[
    {
        "author": "bumblebear3012",
        "created_utc": 1599237740,
        "id": "imjehr",
        "num_comments": 163,
        "num_crossposts": 0,
        "selftext": "Back in July, Barron’s ran a story profiling the rise of Nvidia (NVDA) as the company moved past Intel (INTC) in market cap to become the most valuable US semiconductor company. The  article cited Nvidia’s favorable exposure to data center, gaming, and  AI as major reasons why the company overtook top spot from Intel. Only  two months later, Nvidia is now worth $107bn more than Intel. In other  words, Nvidia is worth more than an AMD more than its Santa Clara rival.  Around the same time, AMD (AMD)  also began to see significant out-performance relative to Intel shares.  With continued momentum in the PC market on the back of its Ryzen  processors and increased success in data center with the EPYC product  line, AMD has risen 57% since the start of July. Over that period, Intel  declined 15%. \n\nIn contrast to Nvidia and AMD, Intel is disproportionately associated with  the PC. Yet even within the PC market, analyst commentary has been  overwhelmingly positive on AMD whereas doubts have surfaced over Intel’s  ability to innovate and remain competitive. In the span of a week at  the end of July, Intel announced a major delay with its 7nm chips and  AMD beat Q2 earnings, raised guidance, and hit its highest PC market  share since 2013. However, the focus on Intel as a struggling PC player  has wrongly overlooked several important developments that set the company up for a near-term rebound in PC and [long-term revenue opportunities in the same higher growth end markets that have fueled premium valuations for both Nvidia and AMD](https://blackjacketco.com/f/new-brand-new-intel-growth-ahead-for-tiger-lake-edge-and-av). \n\n1. Release of Tiger Lake processor, expanded efforts in graphics via  Xe architecture, and development of discrete GPUs for data center and  desktop\n2. Continued momentum in company shift to data-centric business first and PC business second\n3. Expanded Total Addressable Market (TAM) associated with edge computing and edge-enabled technologies\n4. Competitive positioning in autonomous vehicle technology\n\nIntel is currently priced for stagnant to declining revenues, further market share erosion, and lower  relative probability of success compared to Nvidia and AMD. Given recent  product releases and refreshes, as well as a strong strategic vision to  increase share in these higher growth end markets, Intel revenue is  more likely to accelerate and lead to significant multiple expansion in  the coming years. \n\n* Assigning Intel CY23 PT of $125 per share\n* FY23 revenue projected at $100bn\n* FY23 net income projected at $34bn delivering 7.55 in EPS\n* Applying 16.55x P/E and 4.55 P/S \n\nFor an in-depth and comprehensive breakdown on Intel's competitive positioning, see below:\n\n**Tiger Lake and Renewed PC Innovation** \n\nYesterday  Intel finally revealed the highly anticipated Tiger Lake 11th  generation processors for ultra-thin high-performance laptops. Industry  reporting in previous months had speculated that the new system-on-chip  (SoC – incorporates different components like graphics and AI into one  integrated unit) would offer CPU performance advances and improvements  in graphics and AI. Intel even leaked some specs on Monday that seemed  to confirm some of the performance metrics. Although independent  industry studies are required to run Tiger Lake through its full paces,  the event demonstrated that not only can Intel still innovate, it is  more than premature to start counting the company out on PCs. \n\nTiger  Lake clocks up to 20% higher frequencies compared to the 10th  generation Ice Lake family and can reach a single core turbo of 4.8 GHz.  During the presentation, Intel noted that the integrated Iris Xe  graphics perform better than 90% of PCs sold last year, on-board AI is  up to 5x more effective, and WiFi connectivity is up to 3x faster. In a  like-for-like comparison to AMD, Tiger Lake enabled 4x faster photo  upscaling, 2x faster video processing and exporting via Adobe Pro, and  20% faster performance in both Microsoft Word and PowerPoint. For  gaming, Intel conducted side-by-side tests using Gears Tactics. Laptops  running AMD 4800U with integrated graphics and a Nvidia MX350 discrete  graphics card (with Intel 10th Gen i7) performed worse than Tiger Lake.  Intel’s test showed that Tiger Lake handled the game at up to 66% higher  frames per second versus the AMD and Nvidia-powered laptops. \n\nBarring significant discrepancies found during independent reviews, Intel just  delivered performance on 10nm that is equivalent to what is possible on  7nm. With the simultaneous launch of the Evo brand to encompass the new  11th generation-powered ultra-thin high-performance laptop range, Intel  can begin building customer brand recognition and altering perceptions  that Intel has lost competitive footing in the PC market. With 50 PC  designs set to ship with Tiger Lake as soon as this fall, and at least  150 designs anticipated from partner OEMs, Intel may see a very  near-term recovery in its PC market share even despite the 7nm delay.  \n\n**Transition to Data-Centric Business and Future at the Edge**\n\nMore  important to Intel’s future is the multi-year shift towards  higher-growth end markets associated with cloud, edge, and data. Rather  than PCs, Intel sees its primary business as the Data-Centric reporting  segment that now comprises 52% of revenues. That figure is likely to  expand in coming quarters following 34% YoY growth in the most recent  earnings report. In FY19 Q2, the Data-Centric segment only accounted for  46% of revenues. \n\nThat  Data-Centric segment includes: The Data Center Group (36.3% of total  Intel revenues); Non-Volatile Memory Storage Group (8.5%);  Internet-of-Things Group (3.4%); Programmable Solutions Group (2.6%);  and Mobileye (0.7%). The two largest contributors to the segment are  performing extremely well. The Data Center Group grew 43% YoY and saw  operating income climb 72%. The second largest business in the segment,  Non-Volatile Memory Storage, grew 76% YoY for record revenue on the back  of NAND demand growth and higher Average Selling Prices (ASPs). \n\nBy  2024, Intel expects its TAM to reach $300bn. But $230bn of this is  attributed to the Data-Centric TAM. And Intel’s own calculations may be  slightly conservative. In the company’s analysis of its various end  markets, Intel only mentioned the edge compute market in general terms.  Yet that market alone is projected to surpass $100bn by 2030. As much as  public cloud adoption drove demand for server-related products over the  past five years, the edge could end up being a far more important  trend. That is because, in addition to further server demand, the edge  will enable billions of IoT devices to finally become widespread after  years of hype. With TAM growth associated with edge server CPU, GPU, and  storage, plus IoT and edge AI solutions, Intel can achieve growth into  the 2030s so long as the company can execute on its strategic vision.  \n\n*Edge Server* \n\nAn S&amp;P Global study  in spring 2020 estimated that Intel has 90-95% share of the data center  CPU market despite recent share gains by AMD. While edge server  architectures and processes differ versus hyperscale cloud servers, this  figure is testament to the strength of Intel’s relationships with the  leading cloud providers that are also among the early movers in the edge  computing space – namely Amazon with its Lambda@Edge platform,  Microsoft with Azure Functions, and Google with Google Cloud Functions.  \n\nFor  smaller edge providers especially, like Fastly, Akamai, or Cloudflare,  there will be particular emphasis on price-per-performance for server  components. Until recently, that dynamic favored AMD whose EPYC Rome  7742 processor rivals Intel’s Xeon Platinum 8280 on performance yet  undercuts it on price by about 60%. The cost efficiency of EPYC led to  some important edge server design wins for AMD, including Cloudflare’s  new GenX server that excluded Intel parts for the first time. \n\nThe  latest Xeon processors had been on the market for a couple years,  though, and Intel refreshed the product line earlier this year in an  attempt to greatly reduce cost while maintaining performance. In its 24  February press release, Intel directly addressed the need to become more  competitive with AMD on price-per-performance noting that the Xeon  refresh: “…\\[reinforces\\] Intel’s data center leadership by providing  greater performance and performance-per-dollar choices for…customers  across cloud, network and edge.” While Intel compromised on  compatibility with certain server designs, the result is 1.42x better  price-per-core-performance and a cost of $141 per-core for the Gold  6258R. The price tag puts Xeon in a much stronger position relative to  EPYC Rome 7742 which goes for $108 per-core. \n\nDespite  early advantages in cost-per-performance for AMD, Intel still managed  to double its edge deployments year-over-year according to Forbes. And  its impressive partner list includes Lenovo, Red Hat, Advantech,  Caswell, Inventec, Lanner, Nexcom, World Wide Technology, Ericsson, ZTE,  Verizon, Vodafone, Nokia, and China Telecom, among others. With drastic  improvements in price-per-performance, Intel could very well see  additional customer wins in upcoming quarters. \n\nBeyond  CPU, edge applications will see an increase in demand for integrated  and hybrid GPUs. Between advancements in Intel Xe graphics and its  development of discrete graphics cards, the company will become better  positioned to take advantage of the more than 33% CAGR projected for  GPUs from 2020 to 2027 – taking the market from just under $20bn in 2019  to over $200bn according to Deloitte.  Even if Nvidia and AMD maintain large leads over Intel in GPU market  share for edge servers, even a marginal portion of the market could be  meaningful to the Data Center Group which measured around $7bn in Q2. \n\nIn  addition, edge servers present an unprecedented opportunity for NAND  solutions as well – specifically flash storage that utilizes the NVMe  (Non-Volatile Memory Express) protocol. Edge servers have strong need  for high-performance startup operations and extremely reliable storage.  That is because rapid startup times are critical for edge providers to  quickly launch computing instances and deliver the lowest possible  latency for their customers. Improvements in NVMe NAND greatly shrink  the physical storage footprint, reduce power and cooling costs, all the  while improving the overall speed, flexibility, and failure rates. And  Intel Optane and 3D NAND SSDs are exceptionally reliable for storage and  offer performance improvements over legacy storage solutions. \n\n*IoT and AI*\n\nMuch  like edge servers, edge deployed IoT devices will similarly boost  demand for Intel processors. For workload intensive industrial IoT,  Intel has its Core processor. And the Intel Atom processor is  purpose-built for lower-power or embedded applications. Because IoT  devices will collect and process vast amounts of data, these  applications will also require significant amounts of flash memory –  specifically NAND. On-device NAND SSD can increase data transfer speeds  while also integrating module-level security features, remote  management, and more flexible power configurations. Collectively,  improvements in NAND will lower total cost of ownership for these  machines.  \n\nThe edge will lead  to rapid growth for edge AI chipsets that enable IoT devices to deploy  machine learning at the edge without having to send data via internet  back to a centralized data center. Deloitte notes that around 300  million edge AI chips were sold in 2017, but this year could see more  than 750 million units hit the market. With compounded annual growth in  edge AI chipsets anticipated to outpace the broader semiconductor  industry by a considerable amount, ABI research predicts that these edge chips will surpass the market for cloud AI chips by 2025 – marking a massive shift. \n\n**Mobileye and Autonomous Driving Technology** \n\nIt  is interesting the extent to which mainstream conversations in media  and financial commentary largely exclude Intel’s Mobileye and instead  focus on Tesla as the technology leader in autonomous vehicles and  Nvidia as the chipmaker best positioned to disrupt. Although Telsa  claims to offer autonomous modes for its vehicles, based on the 5-level  autonomous capability hierarchy – the industry standard established by  the Society of Automotive Engineers – the most advanced cars currently  on the market only operate at level 2+. Level 2+ falls between levels 2  (partial automation) and 3 (conditional automation). The hardware to  support full level 5 autonomy does exist in 2020, and the software  necessary to manage these systems is not too far behind. However, it  will likely take 5-7 years before manufacturing volumes reach levels to  drive down hardware prices, the necessary regulatory frameworks come  into place, and fully autonomous vehicles gain broad consumer  acceptance.  \n\nIn the  intermediary period, the progression towards level 5 autonomy will  continue to be gradual and incremental. Higher degrees of autonomy will  be achieved by increasingly sophisticated advanced driver assistance  systems (ADAS) that prove out the viability of these technologies and  underpin the manufacturing, regulatory, and consumer environment that  will facilitate the future arrival of self-driving cars. Beyond this, in  many cases the same technology at the center of levels 4 and 5 builds  on the existing foundations of ADAS capabilities. And the dominant  player in the ADAS market is not Tesla, Waymo, or Nvidia. It is  Mobileye. \n\nMobileye’s market  share has consistently stayed above 70% for years, even as competition  from other players has ramped up – Nvidia in particular. The Mobileye  solution is noteworthy, pairing its SoC – the EyeQ family – to support a  range of ADAS capabilities using only a single camera sensor. This  differs from the LiDAR and radar-based systems favored by Waymo, Uber,  GM-owned Cruise, and Nvidia. Tesla – who previously used Mobileye  technology until the two parted ways in 2016 – also leverages a  camera-based system. However, Tesla deploys ultrasonic sensors and  radars in combination with billions of miles of driver data. \n\nMobileye’s  commanding market share in ADAS means that its technology is used by  more than 300 models from 25 global automakers, resulting in 60 million  vehicles on the road worldwide. In contrast, Tesla currently has fewer  than 1 million vehicles on the road equipped with variants of its  autopilot technology. And Mobileye is already working with 4 major OEMs  to soon provide level 3 autonomous solutions. As part of its  arrangements with OEMs, Mobileye receives access to sensor data from  customer vehicles. At present, Mobileye is collecting 3.7 million miles  per day and growing as another 2 million vehicles from these OEMs are  set to join the data-sharing program over the next two years. \n\nWhat  this translates to is a massive partner network with the world’s  leading auto OEMs who will all have a vested interest in competing with  Tesla both in autonomous but also electric vehicles. This also means  that Mobileye has a significant advantage over Nvidia in getting its  ADAS and future autonomous solutions on vehicles. As Mobileye further  prioritizes its fully autonomous solutions, its leading competitive  positioning in ADAS, as well its strong relationships with OEMs, gives  the company a strategic advantage over its competitors as higher levels  of autonomous technologies go to market. This is evidenced by Mobileye’s  strategic partnership with Tesla EV rival NIO to offer level 4 consumer  vehicles by 2022. \n\nEven though  Mobileye made its name based on its single camera platform, the company  is separately developing what is called a full autonomous stack,  incorporating the necessary LiDAR, radar, non-camera sensors, GPS,  modems, and other hardware components that will run on its 5thgeneration  EyeQ processor. In the meantime, Mobileye recently demoed a  self-driving vehicle that navigated the congested streets of Jerusalem  using only 12 cameras and no LiDAR, radar, or non-camera sensors. \n\nOn  the back of the hyperbolic move in Tesla shares YTD, numerous articles  have lauded the company’s so-called multi-year advantages over rivals in  the space. Notably, in July Elon Musk stated that Tesla is “very close”  to level 5 autonomy with no updates needed to hardware as the company’s  Tesla Computer processor currently supports full autonomy. Mobileye’s  EyeQ 5 also supports level 5 autonomy, however. And although the Tesla  Computer exceeds EyeQ 5 on tera operations per second (TOPS), EyeQ 5  offers footprint and power consumption advantages. Moreover, unlike most  other players in autonomous systems, Mobileye has opted for an open  architecture that enables OEMs to program their own software on top of  Mobileye hardware. \n\nTesla has a  lead in data collected per mile at over 3 billion miles, but Mobileye is  catching up and its data repositories also exceed the billion-mile mark  on an annual run rate basis. To deepen the data sets available to  Mobileye, Intel also bought Israeli mobility-as-a-service company Moovit  for $900mn this year. Like Tesla, Mobileye is set to offer its  technology in the important robotaxi market that many in the industry  view as the precursor to consumer-adopted fully autonomous vehicles down  the line. Mobileye is launching pilot robotaxi fleets in Tel Aviv,  Paris, and Daegu City in 2022. \n\nMobileye  still accounts for less than 1% of total Intel revenues despite  doubling sales since being acquired by Intel. Given the strength of  Mobileye’s position in the ADAS market that is expected to grow to more  than $80bn by 2030, as well as the prospects in robotaxis and level 4/5  autonomous systems, Mobileye has strong potential to develop into a  major growth engine for Intel over the next 4-5 years. \n\n**Conclusion**\n\nIntel  shares are roughly flat since early 2018 despite revenues up almost 20%  from FY19 Q2 to FY20 Q2. The relative out-performance in Nvidia and AMD  shares over that time has furthered perceptions that Intel could fall  behind as the former two companies achieve sustained revenue growth tied  to more attractive end markets like data center, gaming, AI, and  autonomous vehicles. \n\nHowever,  recent struggles with certain products and lost PC market share to AMD  have distracted investors from Intel’s ongoing transition to a more data-centric business. With a $230bn TAM projected by 2024 for this  operating segment alone, Intel has multiple opportunities to likewise  drive revenue growth over the long-term. \n\nGiven  the company’s recent advancements with its 11th generation Tiger Lake SoC, continued progress in improving price-per-performance for edge  server components, and the vastly underrated leadership of Mobileye in  the ADAS and autonomous vehicle markets, Intel offers an extremely  compelling opportunity for investors seeking exposure to these  technology trends at a more reasonable valuation. \n\n*You can find me on Twitter* [@BlackjacketCo](https://twitter.com/BlackjacketCo) *where I write about emerging technologies, industry news, and long-term market trends. Thanks for reading!*",
        "subreddit": "stocks",
        "title": "Intel: Recent Struggles Create Attractive Long-Term Buying Opportunity",
        "url": "https://www.reddit.com/r/stocks/comments/imjehr/intel_recent_struggles_create_attractive_longterm/",
        "created": 1599266540.0
    },
    {
        "author": "thegeneraluzi",
        "created_utc": 1599650919,
        "id": "ipe3h6",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "[https://www.globenewswire.com/news-release/2020/09/09/2090672/0/en/Haymaker-ARKO-Holdings-Ltd-and-GPM-Investments-LLC-Announce-Business-Combination.html](https://www.globenewswire.com/news-release/2020/09/09/2090672/0/en/Haymaker-ARKO-Holdings-Ltd-and-GPM-Investments-LLC-Announce-Business-Combination.html)  \n\n\n***Combined Company, ARKO Corp., Positioned for Continued Strong Growth within Recession-Resilient U.S. Convenience Store Industry***  \n\n\n***Anticipated 2021 Pro-forma Adjusted EBITDA\\* expected to be $210 to 215 million***\n\n***Joint Investor Call Scheduled for Wednesday, September 9, 2020 at 9:00 AM ET***\n\nNEW YORK, Sept. 09, 2020 (GLOBE NEWSWIRE) -- Haymaker Acquisition Corp. II (NASDAQ: HYAC) (“Haymaker”), a publicly traded special purpose acquisition company, ARKO Holdings Ltd. (“Arko”), an Israeli public holding company (TASE: ARKO) whose primary asset is a controlling stake in GPM, and GPM Investments, LLC (“GPM” or the “Company”), announced today that they, and certain other related parties, have entered into definitive agreements for a business combination, pending shareholder approval. The transaction is expected to close in the fourth quarter of 2020 and upon closing, the combined company is expected to be listed on the Nasdaq Stock Market under the ticker symbol ARKO.\n\nGPM, the seventh largest convenience store chain in the United States, has grown its store count from 320 stores in 2011 to 1,393 locations as of June 30, 2020 in 23 states comprised of 1,266 company-operated stores and 127 additional sites to which it supplies fuel. The Company operates in three segments: retail, which consists of fuel and merchandise sales to retail consumers; wholesale, which supplies fuel to third-party dealers and consignment agents; and GPM Petroleum, which supplies fuel to Company stores as well as subwholesalers and bulk purchasers.\n\nGiven substantial rollover from existing equityholders, upon completion of the transaction, pro-forma leverage, defined as Net Debt to 2020E Pro Forma Adjusted EBITDA, is expected to be approximately 1.7x. It is anticipated that the combined company will have an equity market capitalization at closing of approximately $1.4 billion. Anticipated total enterprise value, pro-forma for the pending acquisition of Empire Petroleum which GPM anticipates closing in the beginning of the fourth quarter of 2020, is expected to be approximately $2.0 billion, or \\~9x GPM’s 2021E Pro Forma Adjusted EBITDA.\n\nArie Kotler, Chief Executive Officer of Arko and GPM, commented: “We are excited to reach a larger global audience through the pending business combination with Haymaker and subsequent listing on the Nasdaq Stock Market. We have an established platform for identifying and integrating successful acquisitions in the growing, fragmented and historically recession resilient convenience store industry as well as attractive organic sales and profitability drivers. This transaction provides us with increased liquidity and access to the broader capital markets, enabling us to continue to execute on our proven growth strategy as we expand our network of convenience stores across the United States.”\n\nSteven Heyer, CEO and Executive Chairman of Haymaker, commented: “Arko and GPM are the ideal partners for Haymaker. Their business has all of the key attributes we were seeking and we are very pleased to announce the definitive agreement for this combination. We believe Arko and GPM, with their established platform for growth, talented and driven management team, and demonstrated success operating in an attractive end market, will drive value for all stakeholders. Given the current environment, the Company’s resilient business model is particularly relevant, the inherent growth drivers extremely compelling, and their disciplined execution commendable. We are excited to continue to work with Arie and his team as we broaden the shareholder base globally at the newly combined Company and build on their successful track record of growth.”\n\n*\\* Adjusted EBITDA is calculated as EBITDA further adjusted by excluding the gain or loss on disposal of assets, impairment charges, acquisition costs, other non-cash items, and other unusual or non-recurring charges. Pro forma Adjusted EBITDA gives effect to acquisitions and synergies for the entire period presented irrespective of the actual timing of acquisitions or commencement of synergies during the period.*\n\n**Highlights of the proposed transaction:**\n\n* The Company has grown through acquisitions to become the 7th largest convenience store chain in the United States, with 1,266 company-operated locations (excluding pending acquisitions) and 127 dealer sites to which it supplies fuel, in 23 states. The Company has increased its store count approximately 4.4x over the past seven years.\n* The Company projects its Adjusted EBITDA will have grown at a 28%-29% compound annual growth rate (“CAGR”) from 2016 through 2020E.\n* The convenience store industry has demonstrated long-term growth and remains highly fragmented. The industry has grown at a 3.4% CAGR since 2007\\*\\*. The top ten companies control less than 20% of the store base in the United States, providing significant opportunities for future growth.\n* The Company’s growth has accelerated in more recent months during the COVID-19 pandemic as consumers shift shopping patterns to convenience stores from other channels.\n* The combined company will be led by GPM’s current management team, which has significant industry and public market experience, including Arko’s and GPM's Chief Executive Officer, Arie Kotler. Arko and GPM will also benefit from Haymaker’s investing and operational experience at Fortune 500 companies, particularly in the consumer and hospitality sectors.\n\n***\\*\\**** *NACS State of the Industry Report*\n\nRaymond James &amp; Associates, Inc. is serving as lead financial and capital markets advisor. Nomura Securities International, Inc., Stifel, Nicolaus &amp; Company, Incorporated, BMO Capital Markets Corp., and Citigroup Global Markets Inc. are serving as financial advisors and capital markets advisors to Haymaker. Cantor Fitzgerald &amp; Co. is serving as capital markets advisor to Haymaker and Morgan Stanley &amp; Co. LLC is serving as financial and capital markets advisor to Arko. DLA Piper LLP (US), Gornitzky &amp; Co., and Ellenoff Grossman &amp; Schole LLP are serving as legal advisors to Haymaker. Greenberg Traurig, LLP and S. Friedman &amp; Co. are acting as legal advisors to Arko.\n\n**Investor Conference Call Information:**  \nArko, GPM, and Haymaker will host a joint investor conference call to discuss the proposed transaction Wednesday, September 9, 2020 at 9:00 AM ET. Interested parties may listen to the prepared remarks via telephone by dialing 1 (877) 407-3982 in the United States, 1 (809) 406 247 in Israel, or 1 (201) 493-6780 in other countries. Please reference Conference ID 13708312 when prompted.\n\nThe conference call webcast, a related investor presentation with more detailed information regarding the proposed transaction and a transcript of the investor call will be available at [**www.haymakeracquisition.com**](https://www.globenewswire.com/Tracker?data=FxMJU3cIE4WYxyvwyF81Q2N_slOQLbhw5tSpWxQI3xUww6MM53XAyM8-1XAWUSnF98jz9lBEoXpiWZcKQCdn-P7icSOF6r_Vs5EV6g16x7b1Mzi4XW_MMTKXkgROK9Ln). The investor presentation will also be furnished today to the Securities and Exchange Commission (the “SEC”), which can be viewed at the SEC’s website at [**www.sec.gov**](https://www.globenewswire.com/Tracker?data=yawZyeKEtkhVato24HclLfjWT8mbWK9-trcJ-u4aL53iNd_iri6r7qZ90fgFLtremwaboEvbOSfG1W0CK2M0Gw==).\n\n**Additional Information Posted to Website**\n\nHaymaker posted information regarding the proposed transaction, which is available at [**www.haymakeracquisition.com**](https://www.globenewswire.com/Tracker?data=FxMJU3cIE4WYxyvwyF81Q2N_slOQLbhw5tSpWxQI3xXEdcq6ULH_WUfgKbJ6WrpPc8zXporJNaKtqYhn1HFg0XOIDyr6oEWYqyTkBtAMH7b-G88Nwt3PcciMUnaPoquQ). The investor presentation will also be furnished today by Haymaker to the SEC on a current report on Form 8-K, which can be viewed at the SEC’s website at [**www.sec.gov**](https://www.globenewswire.com/Tracker?data=yawZyeKEtkhVato24HclLayDBi3AMyNE_bIfD77uV3l6SBYhQXUE-zSUtOBgCRhBe_etnBecKleI0k5S-2JaSg==).\n\n**About GPM and Arko:**  \nBased in Richmond, VA, GPM was founded in 2003 with 169 stores and has grown through acquisitions to become the 7th largest convenience store chain in the United States, with 1,393 locations comprised of 1,266 company-operated stores and 127 dealer sites to which it supplies fuel, in 23 states. GPM operates in three segments: retail, which consists of fuel and merchandise sales to retail consumers; wholesale, which supplies fuel to third-party dealers and consignment agents; and GPM Petroleum, which supplies fuel to GPM stores as well as a small number of independent operators and bulk purchasers.\n\nArko is the controlling shareholder of GPM (owns \\~68%) and, as part of the proposed transaction, the shares of Arko will be de-listed from Tel-Aviv stock exchange. At the closing of the proposed transaction with Haymaker, Arko will have no material independent operating activities, income, or net assets, other than its ownership interest in GPM.\n\n**About Haymaker:**  \nHaymaker is a $400 million blank check company formed for the purpose of entering into a merger, capital stock exchange, asset acquisition, stock purchase, reorganization or similar business combination with one or more businesses. The Company’s acquisition and value creation strategy is to identify, acquire and, after its initial business combination, build a company in the consumer, retail, media, or hospitality industries. The Company is led by Chief Executive Officer and Executive Chairman Steven J. Heyer, President Andrew R. Heyer, Chief Financial Officer Christopher Bradley, and Senior Vice President Joseph Tonnos. For more information about Haymaker, please visit www.haymakeracquisition.com.\n\n**Additional Information and Where to Find It**  \nARKO Corp. intends to file a registration statement on Form S-4, which will include a prospectus with respect to ARKO Corp.’s securities to be issued in connection with the proposed transaction and a proxy statement with respect to Haymaker’s stockholder meeting to vote on the transaction (the “Haymaker proxy statement/prospectus”), with the SEC. In addition, Arko will prepare a proxy statement (the “Arko proxy”), which will include the Haymaker proxy statement/prospectus as an exhibit thereto, to be filed with the Israel Securities Authority (the “ISA”). **ARKO Corp., Haymaker, GPM and Arko urge investors and other interested persons to read, when available, the Haymaker proxy statement/prospectus and the Arko proxy, as well as other documents filed with the SEC and the ISA, because these documents will contain important information about the proposed transaction.** When available, the Haymaker proxy statement/prospectus and other relevant materials for the proposed transaction will be mailed to stockholders of Haymaker as of a record date to be established for voting on the proposed transaction. The Haymaker proxy statement statement/prospectus, once available, can be obtained, without charge, at the SEC’s web site (http://www.sec.gov).",
        "subreddit": "SPACs",
        "title": "HYAC - Haymaker / ARKO Holdings and GPM- Announce Business Combination",
        "url": "https://www.reddit.com/r/SPACs/comments/ipe3h6/hyac_haymaker_arko_holdings_and_gpm_announce/",
        "created": 1599679719.0
    },
    {
        "author": "bumblebear3012",
        "created_utc": 1599160579,
        "id": "im02di",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Back in July, Barron’s ran a story profiling the rise of Nvidia as the company moved past Intel in market cap to become the most valuable US semiconductor company. The article cited Nvidia’s favorable exposure to data center, gaming, and AI as major reasons why the company overtook top spot from Intel. Only two months later, Nvidia is now worth $107bn more than Intel. In other words, Nvidia is worth more than an AMD more than its Santa Clara rival. Around the same time, AMD also began to see significant outperformance relative to Intel shares. With continued momentum in the PC market on the back of its Ryzen processors and increased success in data center with the EPYC product line, AMD has risen 57% since the start of July. Over that period, Intel declined 15%. \n\nIn contrast to Nvidia and AMD, Intel is disproportionately associated with the PC. Yet even within the PC market, analyst commentary has been overwhelmingly positive on AMD whereas doubts have surfaced over Intel’s ability to innovate and remain competitive. In the span of a week at the end of July, Intel announced a major delay with its 7nm chips and AMD beat Q2 earnings, raised guidance, and hit its highest PC market share since 2013. However, the focus on Intel as a struggling PC player has wrongly overlooked several important developments that set the company up for a near-term rebound in PC and long-term revenue opportunities in the same higher growth end markets that have fueled premium valuations for both Nvidia and AMD. \n\n1. Release of Tiger Lake processor, expanded efforts in graphics via Xe architecture, and development of discrete GPUs for data center and desktop\n2. Continued momentum in company shift to data-centric business first and PC business second\n3. Expanded Total Addressable Market (TAM) associated with edge computing and edge-enabled technologies\n4. Competitive positioning in autonomous vehicle technology\n\nIntel is currently priced for stagnant to declining revenues, further market share erosion, and lower relative probability of success compared to Nvidia and AMD. Given recent product releases and refreshes, as well as a strong strategic vision to increase share in these higher growth end markets, [Intel revenue is more likely to accelerate and lead to significant multiple expansion in the coming years](https://blackjacketco.com/f/new-brand-new-intel-growth-ahead-for-tiger-lake-edge-and-av). \n\n* Assigning Intel CY23 PT of $125 per share\n* FY23 revenue projected at $100bn\n* FY23 net income projected at $34bn delivering 7.55 in EPS\n* Applying 16.55x P/E and 4.55 P/S \n\n**Tiger Lake and Renewed PC Innovation** \n\nYesterday Intel finally revealed the highly anticipated Tiger Lake 11th generation processors for ultra-thin high-performance laptops. Industry reporting in previous months had speculated that the new system-on-chip (SoC – incorporates different components like graphics and AI into one integrated unit) would offer CPU performance advances and improvements in graphics and AI. Intel even leaked some specs on Monday that seemed to confirm some of the performance metrics. Although independent industry studies are required to run Tiger Lake through its full paces, the event demonstrated that not only can Intel still innovate, it is more than premature to start counting the company out on PCs. \n\nTiger Lake clocks up to 20% higher frequencies compared to the 10th generation Ice Lake family and can reach a single core turbo of 4.8 GHz. During the presentation, Intel noted that the integrated Iris Xe graphics perform better than 90% of PCs sold last year, on-board AI is up to 5x more effective, and WiFi connectivity is up to 3x faster. In a like-for-like comparison to AMD, Tiger Lake enabled 4x faster photo upscaling, 2x faster video processing and exporting via Adobe Pro, and 20% faster performance in both Microsoft Word and PowerPoint. For gaming, Intel conducted side-by-side tests using Gears Tactics. Laptops running AMD 4800U with integrated graphics and a Nvidia MX350 discrete graphics card (with Intel 10th Gen i7) performed worse than Tiger Lake. Intel’s test showed that Tiger Lake handled the game at up to 66% higher frames per second versus the AMD and Nvidia-powered laptops. \n\nBarring significant discrepancies found during independent reviews, Intel just delivered performance on 10nm that is equivalent to what is possible on 7nm. With the simultaneous launch of the Evo brand to encompass the new 11th generation-powered ultra-thin high-performance laptop range, Intel can begin building customer brand recognition and altering perceptions that Intel has lost competitive footing in the PC market. With 50 PC designs set to ship with Tiger Lake as soon as this fall, and at least 150 designs anticipated from partner OEMs, Intel may see a very near-term recovery in its PC market share even despite the 7nm delay. \n\n**Transition to Data-Centric Business and Future at the Edge**\n\nMore important to Intel’s future is the multi-year shift towards higher-growth end markets associated with cloud, edge, and data. Rather than PCs, Intel sees its primary business as the Data-Centric reporting segment that now comprises 52% of revenues. That figure is likely to expand in coming quarters following 34% YoY growth in the most recent earnings report. In FY19 Q2, the Data-Centric segment only accounted for 46% of revenues. \n\nThat Data-Centric segment includes: The Data Center Group (36.3% of total Intel revenues); Non-Volatile Memory Storage Group (8.5%); Internet-of-Things Group (3.4%); Programmable Solutions Group (2.6%); and Mobileye (0.7%). The two largest contributors to the segment are performing extremely well. The Data Center Group grew 43% YoY and saw operating income climb 72%. The second largest business in the segment, Non-Volatile Memory Storage, grew 76% YoY for record revenue on the back of NAND demand growth and higher Average Selling Prices (ASPs). \n\nBy 2024, Intel expects its TAM to reach $300bn. But $230bn of this is attributed to the Data-Centric TAM. And Intel’s own calculations may be slightly conservative. In the company’s analysis of its various end markets, Intel only mentioned the edge compute market in general terms. Yet that market alone is projected to surpass $100bn by 2030. As much as public cloud adoption drove demand for server-related products over the past five years, the edge could end up being a far more important trend. That is because, in addition to further server demand, the edge will enable billions of IoT devices to finally become widespread after years of hype. With TAM growth associated with edge server CPU, GPU, and storage, plus IoT and edge AI solutions, Intel can achieve growth into the 2030s so long as the company can execute on its strategic vision.  \n\n*Edge Server* \n\nAn S&amp;P Global study in spring 2020 estimated that Intel has 90-95% share of the data center CPU market despite recent share gains by AMD. While edge server architectures and processes differ versus hyperscale cloud servers, this figure is testament to the strength of Intel’s relationships with the leading cloud providers that are also among the early movers in the edge computing space – namely Amazon with its Lambda@Edge platform, Microsoft with Azure Functions, and Google with Google Cloud Functions.  \n\nFor smaller edge providers especially, like Fastly, Akamai, or Cloudflare, there will be particular emphasis on price-per-performance for server components. Until recently, that dynamic favored AMD whose EPYC Rome 7742 processor rivals Intel’s Xeon Platinum 8280 on performance yet undercuts it on price by about 60%. The cost efficiency of EPYC led to some important edge server design wins for AMD, including Cloudflare’s new GenX server that excluded Intel parts for the first time. \n\nThe latest Xeon processors had been on the market for a couple years, though, and Intel refreshed the product line earlier this year in an attempt to greatly reduce cost while maintaining performance. In its 24 February press release, Intel directly addressed the need to become more competitive with AMD on price-per-performance noting that the Xeon refresh: “…\\[reinforces\\] Intel’s data center leadership by providing greater performance and performance-per-dollar choices for…customers across cloud, network and edge.” While Intel compromised on compatibility with certain server designs, the result is 1.42x better price-per-core-performance and a cost of $141 per-core for the Gold 6258R. The price tag puts Xeon in a much stronger position relative to EPYC Rome 7742 which goes for $108 per-core. \n\nDespite early advantages in cost-per-performance for AMD, Intel still managed to double its edge deployments year-over-year according to Forbes. And its impressive partner list includes Lenovo, Red Hat, Advantech, Caswell, Inventec, Lanner, Nexcom, World Wide Technology, Ericsson, ZTE, Verizon, Vodafone, Nokia, and China Telecom, among others. With drastic improvements in price-per-performance, Intel could very well see additional customer wins in upcoming quarters. \n\nBeyond CPU, edge applications will see an increase in demand for integrated and hybrid GPUs. Between advancements in Intel Xe graphics and its development of discrete graphics cards, the company will become better positioned to take advantage of the more than 33% CAGR projected for GPUs from 2020 to 2027 – taking the market from just under $20bn in 2019 to over $200bn according to Deloitte. Even if Nvidia and AMD maintain large leads over Intel in GPU market share for edge servers, even a marginal portion of the market could be meaningful to the Data Center Group which measured around $7bn in Q2. \n\nIn addition, edge servers present an unprecedented opportunity for NAND solutions as well – specifically flash storage that utilizes the NVMe (Non-Volatile Memory Express) protocol. Edge servers have strong need for high-performance startup operations and extremely reliable storage. That is because rapid startup times are critical for edge providers to quickly launch computing instances and deliver the lowest possible latency for their customers. Improvements in NVMe NAND greatly shrink the physical storage footprint, reduce power and cooling costs, all the while improving the overall speed, flexibility, and failure rates. And Intel Optane and 3D NAND SSDs are exceptionally reliable for storage and offer performance improvements over legacy storage solutions. \n\n*IoT and AI*\n\nMuch like edge servers, edge deployed IoT devices will similarly boost demand for Intel processors. For workload intensive industrial IoT, Intel has its Core processor. And the Intel Atom processor is purpose-built for lower-power or embedded applications. Because IoT devices will collect and process vast amounts of data, these applications will also require significant amounts of flash memory – specifically NAND. On-device NAND SSD can increase data transfer speeds while also integrating module-level security features, remote management, and more flexible power configurations. Collectively, improvements in NAND will lower total cost of ownership for these machines.  \n\nThe edge will lead to rapid growth for edge AI chipsets that enable IoT devices to deploy machine learning at the edge without having to send data via internet back to a centralized data center. Deloitte notes that around 300 million edge AI chips were sold in 2017, but this year could see more than 750 million units hit the market. With compounded annual growth in edge AI chipsets anticipated to outpace the broader semiconductor industry by a considerable amount, ABI research predicts that these edge chips will surpass the market for cloud AI chips by 2025 – marking a massive shift. \n\n**Mobileye and Autonomous Driving Technology** \n\nIt is interesting the extent to which mainstream conversations in media and financial commentary largely exclude Intel’s Mobileye and instead focus on Tesla as the technology leader in autonomous vehicles and Nvidia as the chipmaker best positioned to disrupt. Although Telsa claims to offer autonomous modes for its vehicles, based on the 5-level autonomous capability hierarchy – the industry standard established by the Society of Automotive Engineers – the most advanced cars currently on the market only operate at level 2+. Level 2+ falls between levels 2 (partial automation) and 3 (conditional automation). The hardware to support full level 5 autonomy does exist in 2020, and the software necessary to manage these systems is not too far behind. However, it will likely take 5-7 years before manufacturing volumes reach levels to drive down hardware prices, the necessary regulatory frameworks come into place, and fully autonomous vehicles gain broad consumer acceptance.  \n\nIn the intermediary period, the progression towards level 5 autonomy will continue to be gradual and incremental. Higher degrees of autonomy will be achieved by increasingly sophisticated advanced driver assistance systems (ADAS) that prove out the viability of these technologies and underpin the manufacturing, regulatory, and consumer environment that will facilitate the future arrival of self-driving cars. Beyond this, in many cases the same technology at the center of levels 4 and 5 builds on the existing foundations of ADAS capabilities. And the dominant player in the ADAS market is not Tesla, Waymo, or Nvidia. It is Mobileye. \n\nMobileye’s market share has consistently stayed above 70% for years, even as competition from other players has ramped up – Nvidia in particular. The Mobileye solution is noteworthy, pairing its SoC – the EyeQ family – to support a range of ADAS capabilities using only a single camera sensor. This differs from the LiDAR and radar-based systems favored by Waymo, Uber, GM-owned Cruise, and Nvidia. Tesla – who previously used Mobileye technology until the two parted ways in 2016 – also leverages a camera-based system. However, Tesla deploys ultrasonic sensors and radars in combination with billions of miles of driver data. \n\nMobileye’s commanding market share in ADAS means that its technology is used by more than 300 models from 25 global automakers, resulting in 60 million vehicles on the road worldwide. In contrast, Tesla currently has fewer than 1 million vehicles on the road equipped with variants of its autopilot technology. And Mobileye is already working with 4 major OEMs to soon provide level 3 autonomous solutions. As part of its arrangements with OEMs, Mobileye receives access to sensor data from customer vehicles. At present, Mobileye is collecting 3.7 million miles per day and growing as another 2 million vehicles from these OEMs are set to join the data-sharing program over the next two years. \n\nWhat this translates to is a massive partner network with the world’s leading auto OEMs who will all have a vested interest in competing with Tesla both in autonomous but also electric vehicles. This also means that Mobileye has a significant advantage over Nvidia in getting its ADAS and future autonomous solutions on vehicles. As Mobileye further prioritizes its fully autonomous solutions, its leading competitive positioning in ADAS, as well its strong relationships with OEMs, gives the company a strategic advantage over its competitors as higher levels of autonomous technologies go to market. This is evidenced by Mobileye’s strategic partnership with Tesla EV rival NIO to offer level 4 consumer vehicles by 2022. \n\nEven though Mobileye made its name based on its single camera platform, the company is separately developing what is called a full autonomous stack, incorporating the necessary LiDAR, radar, non-camera sensors, GPS, modems, and other hardware components that will run on its 5th generation EyeQ processor. In the meantime, Mobileye recently demoed a self-driving vehicle that navigated the congested streets of Jerusalem using only 12 cameras and no LiDAR, radar, or non-camera sensors. \n\nOn the back of the hyperbolic move in Tesla shares YTD, numerous articles have lauded the company’s so-called multi-year advantages over rivals in the space. Notably, in July Elon Musk stated that Tesla is “very close” to level 5 autonomy with no updates needed to hardware as the company’s Tesla Computer processor currently supports full autonomy. Mobileye’s EyeQ 5 also supports level 5 autonomy, however. And although the Tesla Computer exceeds EyeQ 5 on tera operations per second (TOPS), EyeQ 5 offers footprint and power consumption advantages. Moreover, unlike most other players in autonomous systems, Mobileye has opted for an open architecture that enables OEMs to program their own software on top of Mobileye hardware. \n\nTesla has a lead in data collected per mile at over 3 billion miles, but Mobileye is catching up and its data repositories also exceed the billion-mile mark on an annual run rate basis. To deepen the data sets available to Mobileye, Intel also bought Israeli mobility-as-a-service company Moovit for $900mn this year. Like Tesla, Mobileye is set to offer its technology in the important robotaxi market that many in the industry view as the precursor to consumer-adopted fully autonomous vehicles down the line. Mobileye is launching pilot robotaxi fleets in Tel Aviv, Paris, and Daegu City in 2022. \n\nMobileye still accounts for less than 1% of total Intel revenues despite doubling sales since being acquired by Intel. Given the strength of Mobileye’s position in the ADAS market that is expected to grow to more than $80bn by 2030, as well as the prospects in robotaxis and level 4/5 autonomous systems, Mobileye has strong potential to develop into a major growth engine for Intel over the next 4-5 years. \n\n**Conclusion**\n\nIntel shares are roughly flat since early 2018 despite revenues up almost 20% from FY19 Q2 to FY20 Q2. The relative outperformance in Nvidia and AMD shares over that time has furthered perceptions that Intel could fall behind as the former two companies achieve sustained revenue growth tied to more attractive end markets like data center, gaming, AI, and autonomous vehicles. \n\nHowever, recent struggles with certain products and lost PC market share to AMD have distracted investors from Intel’s ongoing transition to a more data-centric business. With a $230bn TAM projected by 2024 for this operating segment alone, Intel has multiple opportunities to likewise drive revenue growth over the long-term. \n\nGiven the company’s recent advancements with its 11th generation Tiger Lake SoC, continued progress in improving price-per-performance for edge server components, and the vastly underrated leadership of Mobileye in the ADAS and autonomous vehicle markets, Intel offers an extremely compelling opportunity for investors seeking exposure to these technology trends at a more reasonable valuation. \n\n**Disclosures**\n\nWe are long Cloudflare (NET). \n\n*You can also find me on Twitter* [*@BlackjacketCo*](https://twitter.com/BlackjacketCo) *where I write about emerging technologies and long-term market trends. If you're interested in particular stocks, don't hesitate to reach out. Thanks for reading everyone!*",
        "subreddit": "stocks",
        "title": "New Brand, New Intel: Growth Ahead for Tiger Lake, Edge, and Autonomous Vehicles",
        "url": "https://www.reddit.com/r/stocks/comments/im02di/new_brand_new_intel_growth_ahead_for_tiger_lake/",
        "created": 1599189379.0
    }
]