[
    {
        "author": "MrBeast100kinvest",
        "created_utc": 1594824008,
        "id": "hrorfa",
        "num_comments": 20723,
        "num_crossposts": 1,
        "selftext": "Hi, I’m MrBeast and I’m bored, so I’m going to invest $100,000 into whatever you guys decide on Robinhood. If you don’t believe me check the proof. In 7 days I will look at what the top reply is and invest in it. I don’t care if it’s an option or simply buying Snapchat, I’ll do it lol. This money is as good as gone to me. Have fun!\n\n[proof](https://twitter.com/mrbeastyt/status/1283410776993169408?s=21)",
        "subreddit": "wallstreetbets",
        "title": "I Will Invest $100,000 Into Whatever Is The Top Reply In A Week lol",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hrorfa/i_will_invest_100000_into_whatever_is_the_top/",
        "created": 1594852808.0
    },
    {
        "author": "mori226",
        "created_utc": 1594225171,
        "id": "hnk0r9",
        "num_comments": 1937,
        "num_crossposts": 0,
        "selftext": "Alright boys. This is going to be my final gains post. I cracked the 7-figure mark, and then some. I started with $35k in my ROTH IRA in late February/early March. I took out $50k, so current balance is after this amount.\n\nTotal balance:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/aza8wfympn951.png?width=620&amp;format=png&amp;auto=webp&amp;s=9bf62f41c7548042e7155fc7988cb55b63e74f69\n\nYTD graph, it's been an insane wild ride. The top balance on graph is balance from yesterday, this graph only updates overnight:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/4ujrx8gtpn951.png?width=503&amp;format=png&amp;auto=webp&amp;s=9e7dfbddc461ba03ad0dce267a78002a797407b0\n\nUnlike my previous post, I'm going to post every single one of my trades I've ever made. There was a total of about 350 trades I made.\n\nHere are all my winning trades:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/fu0a7hn4qn951.png?width=1169&amp;format=png&amp;auto=webp&amp;s=0a2fcc6bb5b52e10ba50301aa0374feb8d0fe863\n\n&amp;#x200B;\n\nhttps://preview.redd.it/dzsx6d2aqn951.png?width=1165&amp;format=png&amp;auto=webp&amp;s=06a5639feb386ebd2ca83bfaed92b6b70d197803\n\nAnd here are all my losers:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/50o2gaufqn951.png?width=1159&amp;format=png&amp;auto=webp&amp;s=d08b45c387251b1ad9d89fb13ba9ed733cb98503\n\nPaid over $14k in commissions to Fidelity:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/6jsl4utqqn951.png?width=472&amp;format=png&amp;auto=webp&amp;s=1238eed7f211baf66e79fbb8a3a9d8c8f1ec6d38\n\nI will update this post if anything else comes to my mind. But to put it succinctly. There is a process I follow. I outlined pretty much everything I do in the series of edits and comments I made in my original gains post here:\n\n[https://www.reddit.com/r/wallstreetbets/comments/h83cfp/35k\\_590k\\_in\\_3\\_months/?utm\\_source=share&amp;utm\\_medium=web2x](https://www.reddit.com/r/wallstreetbets/comments/h83cfp/35k_590k_in_3_months/?utm_source=share&amp;utm_medium=web2x)\n\nIf you have any questions in addition though, ask away, I will try to get to everybody. And yes, it fucking feels amazing.\n\nAlso, gaymods... can I please get a flair change to \"$35k to $1.25M\"?\n\nI'm copying and pasting the tips I had in my other post into this since many of you retarded fucks can't even seem to click a link. The following are the general rules I follow in my trades. They have served me well. Luck has a lot to do with it. Probably 60% or more, but learning to click the damn sell and buy button when you don't feel like it (due to greed or fear) is the second biggest component.\n\nEDIT:\n\nLet me try to answer some of the common questions.\n\nI started with $35k in my ROTH. That was money I saved up from previous job.\n\nHold 50% cash reserve at all times as a minimum. YOLOs on FDs are not how you build wealth using options.\n\nGo into OTM positions but only about 10-15%, and a reasonable chance that you personal feel the company can get to the strike before expiration\n\nLearn the greeks. Check current IV levels of the company. Try not to get into trades where the IV is at the top tippy top of a 12 month period.\n\nLearn to not beat yourself up over your trades/mistakes/woulda-shoulda-coulda's. &lt;- This right here was the biggest lesson I learned. Staying focused and not killing myself over my huge mistakes. That sense of dread and horror after seeing your account run up to $550k and then plummeting below $100k in a matter of a week or so, I know is horrific, but learn to focus on what you still have left and climb back up.\n\nLET YOUR WINNERS RIDE. If you are cashing out on a hugely green position, consider taking out only a chunk or better yet, put a trailing stop loss around 20%. I put t-stops once a position goes green about 50%. I don't put trailing stops on currently red positions. I exit my losers by hand usually. I think psychologically I prefer to kill the red deals myself because I'd feel even more horrific and blame the system of the broker if I had a losing position exit out on a trailing stop.\n\nDo not put more than 25% of your account into a single position. We celebrate YOLOs and retardism around here yes, but that doesn't mean you need follow the ultra-retards.\n\nDon't hold 20 different positions. I see so many people holding fucking LUV/AAL/UAL/DAL positions at the same fucking time. No, just pick one and focus on it. Doesn't fucking matter which one, currently besides maybe LUV, the airlines move in lockstep.\n\nLEARN TO CUT YOUR LOSSES. Even at -90%. That 10% through the magic of options trading can easily be used to make the 90% again. Try to climb back out of a hole with 0% left though.\n\nI'll edit more in if I think of anything else, but overall, try to stay disciplined. Learning to control (I admit still very ineffectively but enough to usually put a rein on a runaway destructive thought process) my emotions was key. Losses don't kill options traders, calculating your alternate universe net worth on your woulda-coulda-shouldas do.\n\nEDIT 2:\n\nI will say this. My undergraduate degree was in Economics, and I'm finishing up my MBA in Finance right now.\n\nMy education I think did give me a great deal of edge, over the average person just plunging into options. That doesn't mean you can't educate yourself. First and foremost go fucking watch some videos on options and their greeks. Implications of volatility on price as well is a basic knowledge you should have.\n\nEDIT 3:\n\nI usually buy contracts 1-2 months out. My plan is to sell around the half way point. Leaving a lot of theta meat on the bone so that they are still more valuable.\n\n10-15% OTM. I never buy ITM. That 10-15% level has worked for me. I go for a strike price that I personally feel the stock can hit within the expiration. Almost all my winning trades have been ITM by the time I sold I believe.\n\nEDIT 4:\n\nIf you look at my history, I followed the trends down, and then the trends up. If there's one \"strategy\" to what I do, you can say I ride trends. Knowing the trend was more instinctive. When China, the second biggest fucking economy in the world, was willing to take an extreme measure of forced quarantine of almost 500 million of its citizens, I understood just how fucking serious the virus was. Was that getting priced in the US stock market though? The potentially similar lockdowns in the US? No. Market was fucking hitting ATH at the same time. I shorted the shit out of everything about a week after (including DIS, $80p I bought when it was at $130) market hit ATH I think. My instinct was right, I went up to $550k\\~ or so from this.\n\nBut then I made the mistake of holding when the trend had reversed. The market was no longer responding to the bad news. More death count than any other source of death in the country per day? Green. Record setting unemployment? Green. I went from $550k down to $91k. Bought ballsdeep calls from here and rode the wave back up.\n\nLearning to get a sense of the current trend is the hardest part I think. And who is your best friend? The trend. Who gives you your giant pile of tendies? The trend. Who buys your wife a new iMac pro? The trend. Never try to \"outsmart\" the market. You're going to lose you fucking shirt.\n\nEDIT 6:\n\nAlmost forgot one of the biggest lessons I learned. I never ever close a position within the first \\~1 hour of market opening. I usually close them in the last hour instead. Contract pricing is usually way out of wack across the board you are going to have massive amounts of slippage, mispricing, and just retarded level of lag and shit, even on the big boy brokers like Fidelity. (The only exclusion here would be for SPY...I don't go into SPY anymore, but if I did, I will sell at market open. The liquidity and the price movement is already built in when market opens for SPY. Any other tickers like AMZN, this rule applies)\n\nEDIT 7:\n\nI will add one more thing that led to my biggest gain trades. When a stock currently is at ATH, I mean actual ATH not high of 52 weeks, then there's a massive momentum going for the stock and chances are it will keep that momentum for a while. Using this logic, I went into AMZN calls. Many people asked me why I got in when it had already run up from $1.9k to like $2.1k or something, it's because I used that logic. (Be aware of buying into meme stocks ATH though, I'd be ready to cut my losses the next day if I got into a meme stock and it didn't continue going up/down)\n\nEDIT 8:\n\nLet me make one point clear. You are nothing. You are a nobody. Nobody gives  a fuck about your gut feeling, or TA voodoo, or this, and that, and the market doesn't owe you shit. You are a dumbass. You are a dumbass. Repeat after me, you are a dumbass. The sooner you get this fact through your thick skull and learn to respect the trends of the market, the better it will be for your trades. Learn humility, stop fucking bragging about your 1 or even 10 wins, and more importantly, don't delude yourself into thinking you figured out the secret after your few trades. You haven't. Learn to be humble, and always fucking respect the market trends. It may feel like it, but this is not a fucking game, unless you want it to be and think the #'s you see on the neo screen are not real. You are trying to make serious $, not be proven right or how smart you are. I'll repeat, take ego out of it. Or not. But for me to get to this level over about 350 trades, these tips I outlined above worked remarkably well.\n\n&amp;#x200B;",
        "subreddit": "wallstreetbets",
        "title": "$35k -&gt; $1.25M in 4~ months",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hnk0r9/35k_125m_in_4_months/",
        "created": 1594253971.0
    },
    {
        "author": "Partiallycertain",
        "created_utc": 1595589029,
        "id": "hwzv4a",
        "num_comments": 1836,
        "num_crossposts": 0,
        "selftext": "Am I the only one who feels that way? I remember 2008 being a time of real panic. The news and media was very gloomy, and uncertainty was driving real fear and terror. Bank runs were a real possibility and the dithering in Congress seemed like it might bring everything crashing down. The people in my life (family, friends, and acquaintances) seemed anxious and fearful about the future. I knew more than a few people who lost their asses in 2008. Many of them only partially recovered, and some never did. \n\nThe covid crises is supposedly worse. All of the metrics we have so far seem to indicate that this is worse than 2008 by a longshot. But it just doesn't feel like it. The people in my life seem to be doing well. I don't sense the same fear and anxiety in news and media that I did in 2008. I don't feel overly worried about my long term financial situation. And I don't fear the economic future of the country. \n\nI feel fine and am very optimistic. But the data says that I should be very worried. But I'm just not. Things just don't feel that bad. It's really weird.",
        "subreddit": "investing",
        "title": "Maybe I'm crazy but 2008 felt worse.",
        "url": "https://www.reddit.com/r/investing/comments/hwzv4a/maybe_im_crazy_but_2008_felt_worse/",
        "created": 1595617829.0
    },
    {
        "author": "pikindaguy",
        "created_utc": 1595449979,
        "id": "hw1jny",
        "num_comments": 1830,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2020/07/22/tesla-tsla-earnings-q2-2020.html\n\n- Earnings: **$2.18 ex-items vs. 3 cents per share**\n- Revenue: $6.04 billion vs. $5.37 billion, expected.\n- Net income: $104 million (GAAP)\n\nClosing in on $1700 stock price again, a year ago it was at $260.\n\nEdit: Elon [smiles](https://www.reddit.com/r/teslamotors/comments/hw1pau/a_perfect_month_for_elon/): https://preview.redd.it/jx1fb21vzgc51.jpg?width=354&amp;auto=webp&amp;s=1f352ff6ffb566e214fcf141247635555aecef19",
        "subreddit": "investing",
        "title": "Tesla reports 4th straight quarter of profits, crushes earnings estimates",
        "url": "https://www.reddit.com/r/investing/comments/hw1jny/tesla_reports_4th_straight_quarter_of_profits/",
        "created": 1595478779.0
    },
    {
        "author": "rawrtherapy",
        "created_utc": 1593795525,
        "id": "hkmnni",
        "num_comments": 1323,
        "num_crossposts": 0,
        "selftext": "No fucking way in hell China doesn’t do some shady shit and start stealing from Tesla’s Chinese factory then give all the info to NIO\n\nI 100% know this, how? Because I’ve worked with Chinese companies and my last boss OWNED his own Manufacturing plant that produced the light switches for LUTRON LEVITON and basically 90% of the light switches in the US\n\nThe dude is and was a fucking BALLER\n\nHe then took the design of said switches and created his OWN brand that is fucking HUGE on Amazon\n\nI believe 100% that the same thing is gonna happen with Tesla’s factory\n\nChina is gonna steal the blueprint or some shit and give it to NIO\n\nIdgaf what you think this WILL happen\n\nI’ve seen it happen too many times\n\nTL;DR Calls on NIO till fucking 2021 and beyond. Picking up MASSIVE shares for NIO on Monday at open and long dated calls.\n\nTL;DR2 THIS DOESMT MEAN BEARISH TESLA\nTHIS JUST MEANS BULLISH NIO\nRETARDS\n\nTL;DR3 look at NIOs trading volume as of 1:53pm PST. It’s 221 MILLION. If that’s not a sign of the fucking bulls and NIO probably hitting $15 this month then idk what the fuck is",
        "subreddit": "wallstreetbets",
        "title": "100% think that China will start stealing from Tesla’s China Factory and give it to NIO",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hkmnni/100_think_that_china_will_start_stealing_from/",
        "created": 1593824325.0
    },
    {
        "author": "Theorymeltfool1",
        "created_utc": 1595342257,
        "id": "hv8fob",
        "num_comments": 1189,
        "num_crossposts": 2,
        "selftext": "After watching several interviews with Trevor Milton, I noticed that he engages in behavior that is similar to other fraudster CEOs, such as Elizabeth Holmes, Jeffrey Skilling, Adam Neumann, Billy McFarland, etc.\n\nAlmost every interview of his includes contradictory information. It would probably take an hour-long YouTube video to explain all of the instances, but I'll just go by a few here that you can watch yourself. A few quick instances first:\n\n* His company obviously copied Tesla by naming their company after Nikola Tesla, just choosing the first name instead. Then Trevor has the audacity to say that he can \"out-Elon Elon\". K, based on what? All of your past failures?\n\n* His company is a patent-troll. They sued Tesla for $2 BILLION, over something so incredibly stupid, and *expected* Tesla to pay out because \"they have billions anyways\". This is on the level of those people who fake-trip in a Walmart and sue because \"they have billions anyways\". It's trolling/sociopathic behavior.\n\n* Trevor said \"they're focusing on products that generate revenue\", which is why they got into hydrogen fuel cell (HFC) long-haul trucks. This was *completely contradicted* by their introduction of a pick-up truck, off-road 4x4, and a HFC jetski. Like, those are fun products, about 95% of customers buy those products for fun, not to make money off of. \n\n* He cashed out $70,000,000 in NKLA stock and purchased a $35,000,000 home before the company even sold a single truck.\n\n* Another thing that irks me: Trevor keeps saying \"we want to cut emissions, that's our driving force\" or whatever. He just bought a $35 Million house that uses WAY MORE emissions than a normal size house. And, it's way up in Utah, so he has to commute down to Arizona via air travel or more likely a private jet, which produces tons of emissions more than a normal person. This is like a \"limousine liberal\" personified. \n\n* NKLA applied for a $4 Million PPP loan, despite Trevor cashing out $70,000,000 in stock, and his company being worth Billions (on paper, but they still have a credit line). \n\n* On numerous occasions and interviews, Trevor talked about their company being \"vertically integrated\", i.e. owning the entire process from design, to production, to hydrogen fueling. What's really happening is their trucks are being built by a company all the way in Italy (or Germany), and then shipped to the US. He also has no plans on building out the Hydrogen fueling infrastructure. The \"renderings\" they keep showing he says will only cost \"$10-15 Million each\". That's ridiculous, the renderings for his HFC truck-stops are massive complexes that take up tons of land. Yeah, that's okay for Arizona and Utah, but not in the urban environments where most Trucks operate. And if you only have HFC-filling stations on the outskirts of cities, they'll be busy all the time which will increase transit times and cost more money. It's not like a Tesla Charging station that can just be built in a parking lot or near a loading dock. \n\n* Videos of their \"warehouse\" are all empty. It's not like Tesla's Fremont plant where there are thousands of workers. \n\n* NKLA went public through a \"reverse merger\", which isn't always bad, but it's still a sneaky/backdoor way to become publicly traded and in my opinion is worth staying away from on that basis alone. \n\n* The terms of their lock-out period expiration are just ridiculous. Some people are becoming millionaires before anything has even been sold. All they did was photoshop a few renderings for a few months, and that's somehow worth millions??\n\n* They don't even plan on having any trucks for sale for *years*. That means the next few years they're just going to be burning investors cash. Reminds me of DryShips, MoviePass, Theranos, etc.\n\nhttps://www.youtube.com/watch?v=6Qn2p3Lrn4A\n\n* Their \"Badger\" truck is nothing more than a rendering, and they're already accepting deposits for it?? That doesn't make any sense at all, it's *years* away from production. Their truck is nothing special compared to something like Rivian's or Tesla's, and both of those companies actually have working prototypes.\n\n* It'll be interesting if \"Nikola World\" even has a Badger Truck to show off. (Also, the name completely sucks)\n\n* He always sidesteps questions asked by interviews and twists the questions. She asked about them not producing a pickup truck, and then he says \"Well we have made a truck, we made the world's most advanced HFC truck...\" Yeah, not what she was talking about.\n\n* Anheuser Busch has made FREE reservations of about 800 trucks, but they haven't committed any money to the project. Anyone can go reserve a truck for free. Reservations ARE NOT sales, and Trevor talks like they're sales. That's what got Enron in trouble in the 2000s with their \"Mark-to-market accounting\" tricks.\n\n* In this interview, he mentions \"fun\" way too often. Not really sociopathic, just kind of weird. \n\n* They threatened to sue Bloomberg over the fact that their truck wasn't functional, which was true. If you haven't performed safety testing, then the truck isn't functional. People don't buy products without safety testing. That's why they're not actually following through on the lawsuit, because Trevor knows they would lose.\n\n* He uses the same logic as Elizabeth Holmes, when she would spout that bullshit like \"First they say you're crazy, then they fight you and then all of a sudden, you change the world.\" Worked out well for her, lmao!\n\n* Why do they have such a big factory/warehouse space in Arizona, when their trucks are being \"hand built\" in Germany (wait, not Italy anymore??)? Also, hand-built means not an assembly line, right? He also continuously gets his dates messed up. In this interview he said they'd be beginning production within the next few months, [but in this article he says production won't begin until 2021](https://www.electrive.com/2020/02/07/nikola-tre-to-be-built-in-ulm-germany/). \n\n* [Why is he taking shitty vertical cell-phone footage of trucks?](https://www.youtube.com/watch?v=7C2LDmkEmP0) Can't he have other employees do that?\n\n* He talks about \"tickets to Nikola World\" like it's fucking Coachella or something. It's a company-sponsored event dude, no one gives a shit. Ooh, you get a $100 ticket if you put down a $1,000 deposit for a truck that's not going to be coming out for years?? What a deal!\n\n* That factory in Ulm, Germany he keeps mentioning? Right now, they only produce [fire trucks](https://en.wikipedia.org/wiki/Iveco), they don't even manufacture semi-trucks. So, uh, they're just going to convert from building diesel powered fire trucks to building electric and/or HFC trucks? Has that ever been done before ever?\n\n* [Trevor thinks that two days of reservations is enough to forecast an entire year's worth of reservations.](https://realmoney.thestreet.com/investing/stocks/i-ve-got-a-message-for-nikola-s-ceo-and-he-may-not-like-it-15365601)\n\n* In that article, he takes all criticism as \"haters\" or whatever, and not people who just want to understand what's going on. That's cult-like behavior, something to avoid in droves if you ever see it as an investor. \n\nI could go on, that's what I've seen so far, and I'll probably keep updating this in the future. Result: I'd stay far away from this stock simply because they have nothing for sale for years, which is ridiculous. The CEO acts like a sociopath, and seems to embody the types of traits seen in other sociopaths who were engaging in fraudulent/vaporware products. They're just going to burn through any money that investors have added before delivering anything.\n\nEdit: As mentioned in the comments, Trevor Milton isn't even the CEO any more. That job has been taken up by [Mark Russell](https://www.forbes.com/sites/alanohnsman/2020/06/12/nikola-stock-surge-turns-ceo-mark-russell-into-hydrogen-truckmakers-second-billionaire/#2acd467c31d8) who was the former CEO of Worthington Industries, a metal manufacturing company.\n\nhttps://en.wikipedia.org/wiki/Nikola_Corporation\n\nEdit: Update, banned from /r/nikolacorporation, lmao: https://i.redd.it/jv61sp70r8c51.png\n\nEdit: Another point is that it seems like Nikola thinks the Diesel trucking industry is just going to roll over, die, and replace all their trucks with Nikola Trucks. There is no way these companies are going to let that happen:\n\nhttps://drilling-deep-with-john-kingston.simplecast.com/episodes/the-diesel-engine-isnt-going-anywhere-for-a-long-time\n\nhttps://www.businessinsider.com/diesel-trucks-arent-going-anywhere-2018-3\n\nhttps://www.wsj.com/articles/pilot-truck-stop-empire-moves-away-from-family-leadership-11595341279\n\nhttps://www.truckinginfo.com/10121641/new-gen-diesel-powered-trucks-vital-to-clean-air-goals\n\nIn this video he sounds like a straight-up sociopath, also talks about having \"fun\" again: https://www.youtube.com/watch?v=LpLrxblsWZE",
        "subreddit": "wallstreetbets",
        "title": "Trevor Milton is likely a sociopath. You heard it here first, DD inside.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hv8fob/trevor_milton_is_likely_a_sociopath_you_heard_it/",
        "created": 1595371057.0
    },
    {
        "author": "sleeping_in_",
        "created_utc": 1593860060,
        "id": "hl1hea",
        "num_comments": 1033,
        "num_crossposts": 0,
        "selftext": "A 200 billion market cap on a company which has never turned a proper profit. Full of debt and in a cut throat industry where margins are slim and competition is fierce. Tesla is being priced like it will take over the world, that 1/2 cars in the world will be a Tesla. Have people forgotten that Ford, GM, Audi and BMW are all making electric cars now? Have people forgotten the self driving technology being developed by Waymo? Have people forgotten the bottomless pit companies like Microsoft have to dominate in AI and self driving?\n\nPlease explain to me why this valuation is not a bubble? It looks like dot com 2.0 all over again.",
        "subreddit": "stocks",
        "title": "How is Tesla Stock not in a bubble?",
        "url": "https://www.reddit.com/r/stocks/comments/hl1hea/how_is_tesla_stock_not_in_a_bubble/",
        "created": 1593888860.0
    },
    {
        "author": "SamPom100",
        "created_utc": 1596129108,
        "id": "i0pwvs",
        "num_comments": 1031,
        "num_crossposts": 0,
        "selftext": "Looking at Kodak volume , there was a pretty massive spike before the news came out. As I'm not an insider, I hadn't even heard of this company before it made headlines so I wrote a python script which scans every ticker on the market, gets their last 6 months of volume history, and alerts you when a stock's volume exceeds 10 standard deviations from the mean within the last 3 days.",
        "subreddit": "wallstreetbets",
        "title": "I made a scanner to help you find the next Kodac",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i0pwvs/i_made_a_scanner_to_help_you_find_the_next_kodac/",
        "created": 1596157908.0
    },
    {
        "author": "icejjfritch",
        "created_utc": 1594653293,
        "id": "hqh1l6",
        "num_comments": 1023,
        "num_crossposts": 0,
        "selftext": "As of writing this, TSLA has gone up another 14% today, bringing its one month gain to over 89%. This is crazy to me, but it's still pretty fun to watch it go up. I wouldn't be surprised if  TSLA hit $2000 this week if earnings are positive. Thoughts? Will TSLA ever go back down under $1000?",
        "subreddit": "investing",
        "title": "$TSLA up 14.5% today, price skyrockets past $1,765",
        "url": "https://www.reddit.com/r/investing/comments/hqh1l6/tsla_up_145_today_price_skyrockets_past_1765/",
        "created": 1594682093.0
    },
    {
        "author": "onthetoiletprobably",
        "created_utc": 1593691871,
        "id": "hjvv3n",
        "num_comments": 968,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Am I doing it right? Buying dips. No options just shares.",
        "url": "https://i.redd.it/vacw1wanqf851.jpg",
        "created": 1593720671.0
    },
    {
        "author": "ASoftEngStudent",
        "created_utc": 1594747851,
        "id": "hr5tz4",
        "num_comments": 936,
        "num_crossposts": 1,
        "selftext": "In today's DDDD (data-driven DD), after a long hiatus due to less free time, we'll take another broad view of the current state of the United States economy and public health. We’ll be looking at some data to answer a few questions. Namely, what the state of the pandemic is globally and in the United States, whether or not we will have a second Great Lockdown (yes, historians are now calling this [the Great Lockdown](https://en.wikipedia.org/wiki/COVID-19_recession)), statistics on the resumption of economic activity, and the looming unemployment and eviction crisis, and how this all might affect the stock market.\n\n**COVID-19 Data**\n\nOn face value, we can see the number of confirmed cases rising exponentially again in the United States, after a flattening of new cases during the lockdown.\n\n[New cases by country](https://preview.redd.it/0ppbgmjkuua51.png?width=1600&amp;format=png&amp;auto=webp&amp;s=8364b49db7f55f39ec285f7aec731eda1b83f1d4)\n\nThis is in contrast to countries like New Zealand, which has been declared COVID-19 free for several weeks, and much of Europe which has significantly reduced new cases and has even reopened for tourism. Within the US, the previous epicenter, New York, has seen a drastic reduction in new cases and is moving towards re-opening.\n\n[NY New Cases](https://preview.redd.it/uww1vjlwuua51.png?width=1600&amp;format=png&amp;auto=webp&amp;s=0df5aff508e31aa0450e33459a2a2790e5eb505b)\n\nOn the other hand, another exponential rise in confirmed cases have been seen in several other states that have fully reopened, including California, Texas, and Florida, the three largest states in the union.\n\n[California New Cases](https://preview.redd.it/969nv8hzuua51.png?width=1600&amp;format=png&amp;auto=webp&amp;s=e227e2a481190f3e4d3a28e777a217b19e8ea256)\n\n[Texas New Cases](https://preview.redd.it/7kiy7rv0vua51.png?width=1600&amp;format=png&amp;auto=webp&amp;s=1bcdcc26e402e1456088cb1792a0b4d434522691)\n\n[Florida New Cases](https://preview.redd.it/khrmq322vua51.png?width=1600&amp;format=png&amp;auto=webp&amp;s=5a3f4efe562bcf5d5995747a8042e248d153e3dd)\n\nPart of the increase in new confirmed cases can be attributed to more widespread testing within these states, so we’ll have to look at confirmed deaths to really see if things are getting much worse. If deaths weren’t rising, then the increase in cases could even be considered good news because this implies excessive testing and a much lower case fatality rate than expected.\n\n[California New Deaths](https://preview.redd.it/t6970z73vua51.png?width=1600&amp;format=png&amp;auto=webp&amp;s=afc9073e0e402a6c1f6537478e09536c1bbba3df)\n\n[Texas New Deaths](https://preview.redd.it/b7l6gke4vua51.png?width=1600&amp;format=png&amp;auto=webp&amp;s=74f3dacdfd5f0e73967cb4e97bce3c80846b323d)\n\n[Florida New Deaths](https://preview.redd.it/ticc80p5vua51.png?width=1600&amp;format=png&amp;auto=webp&amp;s=d1b829f5bf0ae83bde766042de8cc7fba5a615fb)\n\nIt looks like there is a true increase in cases within these states. Keep in mind that the new deaths statistics will lag behind the new infections rate by several weeks. The new deaths rate has just started increasing exponentially again at the beginning of July, and this will become even worse, even if governors impose new lockdowns and restrictions because of the delay.\n\n**Will a Second Lockdown Happen?**\n\nThe second question to ask is if there will be a second wave of lockdowns. California recently just announced a [rollback in the lifting of restrictions](https://www.google.com/url?q=https://www.cnbc.com/2020/07/13/california-to-close-indoor-restaurants-movie-theaters-and-bars-statewide-as-coronavirus-cases-rise.html&amp;sa=D&amp;ust=1594749851411000&amp;usg=AOvVaw2qxWTtCYwlbOxvW8cvVKT6) in response to the new increase in cases, setting a precedent for other states to follow suit. However, whether or not there will be a second wave of lockdowns in states is unclear, and depends on several key factors.\n\n*Mask Usage*\n\nDespite initial opposition from health officials telling the public masks do not work, there has been a reversal in messaging, and the government is now encouraging people to wear masks in public. [Even Trump is wearing one in public now](https://www.google.com/url?q=https://www.nytimes.com/2020/07/13/opinion/letters/coronavirus-trump-mask.html&amp;sa=D&amp;ust=1594749851412000&amp;usg=AOvVaw0Yj5a4KXhVBc67mi8IEf5m), especially since there is no longer a shortage. The scientific consensus seems to be that surgical masks are effective in preventing the wearer from transmitting COVID-19 to others if they are sick, but not so effective from having the wearer catch it. This has worked in many other countries, especially in Asia, where people might be publicly shamed or shunned for not wearing a mask and potentially exposing others to COVID-19, which explains why places such as Japan and Taiwan have never seen real widespread transmission. However, in the US there is [significant opposition towards mask wearing](https://www.google.com/url?q=https://www.cnn.com/2020/06/12/health/california-lifts-mask-requirement-trnd/index.html&amp;sa=D&amp;ust=1594749851412000&amp;usg=AOvVaw38DVurc7sTHBNetNmD_FO2), and wearing mandates may not be widely followed in some states. According to [one study](https://www.google.com/url?q=https://www.medrxiv.org/content/10.1101/2020.05.09.20096644v2&amp;sa=D&amp;ust=1594749851413000&amp;usg=AOvVaw3k20celrv3_h--S1KA8gCR), the critical mask adoption rate is calculated to be approximately 73% for the epidemic to be contained. If states are able to successfully convince their population to start wearing masks in public, above that rate, then a second lockdown will not be needed. However, even with a [mask mandate](https://www.google.com/url?q=https://www.cnn.com/2020/06/19/us/california-coronavirus-face-covering-order/index.html&amp;sa=D&amp;ust=1594749851413000&amp;usg=AOvVaw3JdCcj0ul9-vtCuYeAPnS3) in California in all places where social distancing is not possible being enacted a month ago, it does not seem to have been widely followed enough to prevent a rise in new cases and deaths. My personal opinion is that most people are now desensitized to COVID-19 news, and no longer care enough to wear masks in public, and hence the 73% critical adoption rate will not be met in most states, even if there is a mandate implemented.\n\n*Political Opinion*\n\nEspecially important as it’s an election year, a new wave of lockdowns will likely be dependent on the political popularity of it. I wasn’t able to find any reliable recent polls about it, but based on media and political discourse, it looks like the concern right now is more with saving the economy, with the population desensitized towards COVID-19 deaths. A Single Death is a Tragedy; a Million Deaths is a Statistic. This famous quote can be applied to virtually every natural disaster and massacre. Nobody cared about COVID-19 until March when suddenly Tom Hanks and NBA players were diagnosed with it. Everyone then started panicking and raided their local grocery store to buy up all the toilet paper (for some reason). So what will make people care about the pandemic again?\n\n*ICU Beds*\n\nThis is probably the best indicator for when things will go crazy. Once enough hospitals run out of ICU beds to treat COVID-19 patients, they will start having to turn away patients and the case fatality rate will skyrocket. This will likely cause a media frenzy and re-instill widespread panic, shifting political opinion towards more lockdowns. How close are we to this? This statistic is much harder to collect data on and interpret because available ICU beds tend to be fragmented. Since it’ll be logistically difficult to relocate patients to the other side of a state if all the ICU beds in one county fills up, what matters isn’t necessarily how many beds are available in the state, but how many hospitals in each county have reached capacity. Since that’s much harder to interpret and find data on, we'll just look at the available ICU headroom, which does not include potential extra beds that may be created in response to COVID-19.\n\n[California ICU Headroom](https://preview.redd.it/3sdx8la7vua51.png?width=1600&amp;format=png&amp;auto=webp&amp;s=fa5ec78a13e1f26ecf308fad9544bcec1bad0e32)\n\n[Texas ICU Headroom](https://preview.redd.it/5l8h71vbvua51.png?width=1600&amp;format=png&amp;auto=webp&amp;s=796ed67e262d180aae0270e4db3bb64da28237a4)\n\n[Florida ICU Headroom](https://preview.redd.it/klgx21bevua51.png?width=1600&amp;format=png&amp;auto=webp&amp;s=f0c21f85eb21bcbb8b0e11394fde26a2c191851a)\n\nFrom this data, California’s pretty much safe, while Texas’ is close to running out of beds and Florida has pretty much reached capacity.\n\nAnother thing to keep in mind is that it will be much more difficult to solve the lack of ICU beds in these states compared to New York. The vast majority of the state’s population live at or near New York City, which is densely populated (in case you’re geographically deficient). This means the problem can easily be solved by simply adding a bunch of beds in one central location, and sending a hospital ship to one place. This can’t really be done in more sparsely populated states like Texas and Florida. Based on this data, we’ll likely see some panic about COVID-19 again in the coming weeks with ICU beds running out in multiple states.\n\n**The Reopening, Oil, and Economic Activity**\n\n[The state of reopening](https://preview.redd.it/zdz0zq3hvua51.png?width=1600&amp;format=png&amp;auto=webp&amp;s=4a47986120b693fc8dcd6b61cc30aac48cec595f)\n\nIn general, the north east, which was the hardest hit in March, is still in the process of rolling back restrictions, with most other states having already fully reopened. However, many of the new hot spots, like California, Florida, and Texas, are starting to impose new restrictions. The stock market is starting to realize this, with a selloff happening once California announced a complete rollback of re-opening, closing all indoor dining in the state, and there’s fears that the other hotspot states might follow suit.\n\n[New Jobless Claims](https://preview.redd.it/xlnulkljvua51.png?width=1596&amp;format=png&amp;auto=webp&amp;s=82f15416b73529866b809f98a43e10fb8295e88a)\n\nWith a few weeks of many states completely reopening we’re now able to see what the best case scenario for the economy would be. Although dramatically reduced from April highs, there’s still over 1 million new joblessness claims per week, way above pre-pandemic figures. Furthermore, these new joblessness claims have stopped decreasing and are starting to slowly rise back up again, and this is with most of the economy re-opened. Since full reopening in many states are still recent, we don’t have other economic indicators, such as personal savings rate and consumer confidence to see if people are actually re-engaged in the economy or people are still avoiding economic activity out of fear of COVID-19.\n\nAnother thing I’ve been keeping an eye on for a while is crude oil stocks. Despite a rally back up from the (negative) lows on the May contract, WTI has been struggling to break $40 and recover to pre-COVID levels, although being near it. While digging through some data [provided weekly by the EIA](https://www.google.com/url?q=https://www.eia.gov/petroleum/data.php&amp;sa=D&amp;ust=1594749851416000&amp;usg=AOvVaw3bDA78iR9amTL3rriK4Wvl), I noticed something interesting with crude oil stocks - despite re-opening, it’s still increasing.\n\n[Crude Oil Stored \\(kbbl\\)](https://preview.redd.it/xdgrc3hlvua51.png?width=1378&amp;format=png&amp;auto=webp&amp;s=9f7694baf5c7b8143c091f38778b736530820382)\n\nExcept for one small dip in the middle of May, crude oil stocks have been slowly rising throughout this entire re-opening, despite many oil producers cutting back capacity. Worse yet, an OPEC meeting scheduled later this week is expected to [relax production cuts](https://www.google.com/url?q=https://www.cnbc.com/2020/07/13/oil-markets-opec-in-focus.html&amp;sa=D&amp;ust=1594749851416000&amp;usg=AOvVaw3uuF8qeo1DP2VKiGuOkdQg), putting even more crude oil into the supply. Excluding the SPR (Strategic Petroleum Reserve), the story looks slightly less scary for commercial producers.\n\n[Crude Oil Stored for Commercial Use \\(kbbl\\)](https://preview.redd.it/csen71vqvua51.png?width=1356&amp;format=png&amp;auto=webp&amp;s=485df51d36c9a6262d8c42156d68c81971ad0cd8)\n\nThis however does not mean we’re going to be seeing negative oil futures again, since producers have gotten smarter about avoiding a storage squeeze in Cushing.\n\n[Crude Oil Stored for Commercial Use @ Cushing \\(kbbl\\)](https://preview.redd.it/awlcjzcxvua51.png?width=1362&amp;format=png&amp;auto=webp&amp;s=275b43ecabc5521978002db198c099f8f1bf5b49)\n\nRefinery utilization, although steadily increasing, is still significantly below pre-pandemic levels.\n\n[Refinery Utilization Rate](https://preview.redd.it/s1l8rl40wua51.png?width=1366&amp;format=png&amp;auto=webp&amp;s=1b8926c8faf1baf3282c6b2dd530ece560ebe29e)\n\nThe conclusion that can be drawn from this is that oil-based economic activity (i.e. travel and energy usage), while increasing, is still well below what it was in February. Crude oil producers however, are still outproducing what refineries are taking in, and crude stocks have been steadily increasing throughout the entire reopening despite increasing oil prices.\n\n**The Looming Housing Crisis**\n\nAnother thing to mention is the ticking time bomb that is the expiration of the unemployment boost provided by the federal government on July 31, and the eviction crisis coming our way as eviction courts reopen and process them. Mortgage forbearances are also starting to expire, with around 8% of all [active mortgages in forbearance](https://www.google.com/url?q=https://www.cnbc.com/2020/07/10/coronavirus-mortgage-bailout-sees-biggest-one-week-decline-yet.html&amp;sa=D&amp;ust=1594749851418000&amp;usg=AOvVaw2JRDx43Q0y7IYcupImyxDZ). According to [one source](https://www.google.com/url?q=https://www.cnbc.com/2020/07/08/32-percent-of-us-households-missed-their-july-housing-payments.html&amp;sa=D&amp;ust=1594749851418000&amp;usg=AOvVaw24JU1zP70LJmgOsUopIb3Q), 36% of renters and 30% of homeowners did not pay their full housing payment in time. This will probably take a few months to really see the effects of this, but it’s definitely something to consider.\n\n**How This Might Affect Stocks**\n\nWe’re already seeing the first waves of bankruptcies, mostly from companies that were already in a poor financial position like Hertz, JCPenny, and GNC. For the bull case, most of the rally for the past few months have mostly been concentrated in tech stocks, which are much less directly affected by the pandemic, with some companies like Amazon even benefitting from it. They’re usually very financially healthy, and can easily operate in a pandemic, if not benefitting from it. In fact, some stocks like AMZN, TSLA, ZM, and SHOP have gone parabolic in the past few weeks, which is usually not a good sign. On the bear case, most economists predict a prolonged U-shaped or L-shaped economic recovery, and a wave of bankruptcies for companies that couldn’t be rescued by the Fed. As mentioned above, I also believe we’re going to be seeing a second wave of lockdowns in the coming weeks as ICU beds start running out, making the economic situation even worse. Eventually, a shrinking economy, mass unemployment, and reduced spending will ultimately hurt the earnings of even the tech stocks. GOOG and FB earnings ultimately rely on businesses buying ads. AMZN and SHOP earnings rely on consumers buying things. Another argument for the bull side is that due to monetary policies such as QE and 0% treasury yields, along with the unattractiveness of emerging markets in the current economic climate, there is a [massive modern savings glut](https://www.google.com/url?q=https://scholar.harvard.edu/files/straub/files/mss_richsavingglut.pdf&amp;sa=D&amp;ust=1594749851419000&amp;usg=AOvVaw0ThBvbFFnJeTPQWxsBHFQQ) \\- money that has nowhere else to go. This by itself could take another essay to explain, so I might talk about this more in a future post.\n\n**My Positions**\n\nFor those that have been following me the past few months, my positions remain unchanged. After briefly joining the bulls for a few weeks, then 🦘gang, I've now converted back to a 🌈🐻. My only major position right now are VIX calls, with July, Aug, and Sept expiry, which I entered a few weeks ago when VIX was at 26. There's a few reasons for this - I still believe in my [long-term thesis](https://www.reddit.com/r/wallstreetbets/comments/ghcfn5/dddd_the_20102020_liquidityfueled_asset_bubble/) that the stock market is in a bubble, with the past few months accelerating the inflation of it, and my belief that the US will eventually mishandle the COVID-19 response, forcing the government to lockdown again once ICU beds run out. I'm no longer day trading, and will swing trade my current positions when a good selling opportunity comes - I'll keep this post updated if I sell.",
        "subreddit": "wallstreetbets",
        "title": "DDDD - Will We See A Second Great Lockdown?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hr5tz4/dddd_will_we_see_a_second_great_lockdown/",
        "created": 1594776651.0
    },
    {
        "author": "KentuckyFriedIdiot",
        "created_utc": 1593858307,
        "id": "hl16kh",
        "num_comments": 901,
        "num_crossposts": 0,
        "selftext": "As the title states, it just doesn't make sense to me. If the dollar collapsed, am I supposed to buy milk with swiss francs? For the average investor of moderate financial  means, buying a few ounces of gold is all that's possible. If you had millions, I can see buying a bunch as you could utilize it realistically. I just picture the economy in shambles and here I am with my one ounce bar of gold having no clue what to do with it except sell for more \"useless paper\" - Help me see the light on this",
        "subreddit": "investing",
        "title": "I don't see the point in buying gold",
        "url": "https://www.reddit.com/r/investing/comments/hl16kh/i_dont_see_the_point_in_buying_gold/",
        "created": 1593887107.0
    },
    {
        "author": "BUY_NIO_NOW",
        "created_utc": 1595887508,
        "id": "hz1zdi",
        "num_comments": 889,
        "num_crossposts": 0,
        "selftext": "I know most people here do not consider Bitcoin a \"serious\" investment, but the market appears to think otherwise. Bitcoin, along with Gold, has been rising rapidly the past couple of days. In particular Bitcoin has surged from $9kish to over $11k just now. From the looks of it, it seems like the rally is just beginning and we may reach over $15k shortly. \n\nWhat do you all make of this? This time around it seems like institutional investors are loading up on BTC as a hedge against inflation, just like gold. In fact all \"stores of value\" investments seem to be rising. Personally I think there will be big money to be made from altcoins like OMG network in this Bitcoin rally: in the past, a significant rise in BTC has nearly always been followed by rapid rises in alternative cryptocurrencies like Ethereum and Ripple. \n\nSo what will it be fellas? Should mature investors like yourselves start allocating a small position into \"store of value\" cryptocurrencies?",
        "subreddit": "investing",
        "title": "Bitcoin just passed $11000. $9k to $11k in 2 days.",
        "url": "https://www.reddit.com/r/investing/comments/hz1zdi/bitcoin_just_passed_11000_9k_to_11k_in_2_days/",
        "created": 1595916308.0
    },
    {
        "author": "dannyjerome0",
        "created_utc": 1595527707,
        "id": "hwkond",
        "num_comments": 875,
        "num_crossposts": 2,
        "selftext": "I've read countless books on fundamental analysis, including the Intelligent Investor. Dozens of swing trading books, technical analysis books, and day trading strategies. I've taken online courses through my local University in finance (working on an MBA). I do hours upon hours of research before investing in anything, yet everything I touch just gets destroyed. I bought Novagold this year. Next day, short report. Stock plummets. Luckin Coffee? Scandal, fraud, delisted twice, worthless stock. I bought BEN thinking it was a wise long call for dividend growth. Just keeps plummeting. When I bought Tesla and Netflix, they both sank. I've bought endless stocks when they've hit below the lower bollinger bands, and everytime I do, they just go lower (with no news mind you). I bought AAPL yesterday, thinking $386 was a good discount value purchase. PLUMMETING AGAIN. I just don't get it. When a company comes out with a great earnings report and I buy, the stock tanks. When a company comes out with bad earnings, it goes straight up after I short it. I could literally pull letters out of a hat and have better success.\n\nEdit:  I should point out that I do day trade, and I wasn't actually referring to day trading, which I feel like is just a different game than investing.  Thanks to the PDT rule, I can only trade 3x per week, and every week all my profits are offset by my investments.\n\nFINAL EDIT:  I'd just like to point out to save my sanity and refresh my outlook on life.  When the pandemic was at the bottom and I was getting into investing hardcore, I changed my and my wife's retirement allocations into index fund investments, so there's that.  Retirement funds are up 20% since April, which is crazy.  Thank god I'm not allowed to invest in individual stocks with my 403b.\n\nEdit:  Wow, this sub is great!  I am already feeling a lot better.  Never seen support in any other sub like this and was honestly just not checking my inbox because I assumed I was going to just get trolled all day.  Thanks for the wise words and support friends!  Time to move on to index funds for sure!  (Maybe if I can get back into the green on BEN and AAPL ever).",
        "subreddit": "StockMarket",
        "title": "Every single stock purchase I've made this year has been a loss. 100% failure rate.",
        "url": "https://www.reddit.com/r/StockMarket/comments/hwkond/every_single_stock_purchase_ive_made_this_year/",
        "created": 1595556507.0
    },
    {
        "author": "professordurian",
        "created_utc": 1593897689,
        "id": "hlayic",
        "num_comments": 851,
        "num_crossposts": 0,
        "selftext": "The WHO announced they think it will take the world 3-5 years to be past Covid-19.\n\nFauci this week said we will soon be at 100,000 infections a day in the US.  This makes me think that Covid-19 testing companies may have a massive runway ahead of them.\n\nI am focused on Hologic (HOLX).  They are producing 1,000,000 Covid-19 tests a week right now ... while the US has tested 33,000,000 people since the pandemic began.  When I do the math it seems like they are producing a huge % of the tests being used daily right now.   I'm also always more comfortable with S&amp;P 500 companies as they are less likely to be flash in the pan companies that disappear after a couple years.\n\nEven though them and other testers have seen huge boosts in stock price, it seems like that party may just be getting started if in fact WHO and Fauci are right.\n\nWhat other testing companies are you guys focusing on?",
        "subreddit": "stocks",
        "title": "WHO predicts Covid-19 could last 3-5 years. Fauci says 100,000 infections a day in US soon. Covid-19 Testing Companies could just be getting started.",
        "url": "https://www.reddit.com/r/stocks/comments/hlayic/who_predicts_covid19_could_last_35_years_fauci/",
        "created": 1593926489.0
    },
    {
        "author": "hieplenet",
        "created_utc": 1595421473,
        "id": "hvt0ti",
        "num_comments": 815,
        "num_crossposts": 2,
        "selftext": "The United States government said on Wednesday it will pay $1.95 billion for Pfizer Inc to produce and deliver 100 million doses of its COVID-19 vaccine candidate in the United States.\n\nThe agreement allows the U.S. government to acquire an additional 500 million doses, the Department of Health and Human Services and the Department of Defense said.\n\n\nWhat do you take from this news? Super bullish? The stock has gained 5% pre market.",
        "subreddit": "stocks",
        "title": "US will pay $1.95 billion for Pfizer Inc to produce and deliver 100 million doses of its COVID-19 vaccine",
        "url": "https://www.reddit.com/r/stocks/comments/hvt0ti/us_will_pay_195_billion_for_pfizer_inc_to_produce/",
        "created": 1595450273.0
    },
    {
        "author": "Fog_",
        "created_utc": 1594053856,
        "id": "hmb4vn",
        "num_comments": 788,
        "num_crossposts": 0,
        "selftext": "I finally broke out the the $3M resistance and hit [$4M today](https://imgur.com/a/V5hdmbg)\n\nI sold the (10) 7/10 $1220 calls I bought on Thursday at todays [market open](https://imgur.com/a/tMtsoAN) and scalped $1300 7/10 calls for another $10k. \n\n[7/10 $1220 calls sold and all other positions riding](https://imgur.com/a/ZVr2xeb)\n\nTotal of $40k FD investment into $88k [cashed out](https://imgur.com/a/58VAQf5) from Thursday to this morning. I’m buying my dad a model 3 with the $88k which is why it’s cashed out. I told him on Thursday if the $40k FDs print, then that’s his Tesla fund (I need to keep some for taxes and he needs the LR AWD).\n\nThe $1500 1/21 calls will be converted into shares once we hit $1450-$1500 and I’ll start trying to sell covered calls.\n\nIdk how this happened but I’m just going to keep rolling with it. Shout out to NVDA puts bro for inspiring me so long ago.\n\nBonus: this is *definitely* inaccurate but my combined portfolio viewer says I had a bottom of [$14k](https://imgur.com/a/uKnzPin) on Jan 10th 2020 LMAO\n\nExtra bonus: $2M to $4M [challenge](https://www.reddit.com/r/wallstreetbets/comments/eygtot/reverse_guh_tsla_journey_to_2m/fgh3bzy/?utm_source=share&amp;amp;utm_medium=ios_app&amp;amp;utm_name=iossmf) accepted",
        "subreddit": "wallstreetbets",
        "title": "$4M in 7 months. RH almost back to $1M. Dad getting a Tesla.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hmb4vn/4m_in_7_months_rh_almost_back_to_1m_dad_getting_a/",
        "created": 1594082656.0
    },
    {
        "author": "3picEmuBoy",
        "created_utc": 1594944993,
        "id": "hslmcw",
        "num_comments": 772,
        "num_crossposts": 0,
        "selftext": "Hello fellow investors\n\nI recently put together the following portfolio, with the intention of not touching it for at least 10 years. Discuss your opinions in the comments, I'd be glad to hear your feedback!\n\n1) Amazon: 25%\n\nI feel like Amazon can't be stopped in the 2020s, it will completely obliberate every company who can't innovate and put their customers first. I've recently read the book \"bezonomics\" and I suggest everyone who doesn't fully understand this company to read it aswell. Amazon is number 1 by far in e-commerce and cloud computing, industries that are still very young and have a lot of potential. However, the thing I like most about Amazon is its ability to innovate and how they are able to \"spread their wings\" in every segment where there is money to be made.\n\n2) Microsoft: 15%\n\nThis one is pretty obvious and boring. Microsoft has always been a solid company, they have been through many freefalls of the tech market so that is a factor to keep in mind. Their new cloud computing platform \"Azure\" looks very promising, being the second biggest in the world (behind Amazon.) Microsoft has a very diversed business model and a good management team so they are not going anywhere.\n\n3) Apple: 10%\n\nApple is a very high quality company, with a fairly low PE ratio compared to other tech. I also feel like the rise of 5G is only going to make Apple stronger. \n\n4) Alibaba: 10%\n\nI can't forget about this Chinese tech giant! The growth in chinese consumer spending makes this stock really attractive to me. Alibaba pretty much has a monopoly in China concerning e-commerce and cloud computing services ( comparable to Amazon in the US.)\n\n5) Berkshire Hathaway Inc.: 10%\n\nThis company has many rather defensive stocks that will help the firm through recessions and economic downfalls, but this company will also keep riding the upward market trends. Berkshire is a great stabilizer that will round out your portfolio beautifully. One of the best long-term stocks in my opinion.\n\n5) Disney: 5%\n\nThis entertainment giant is still trading at a discount price and is set for a comeback rally any time soon, with the parks reopening etc. The company also pays a respectable amount of dividend, currently yielding at 1.62%.\n\n6) Walmart: 5%\n\nWalmart is often overlooked by investors, because of Amazon, but I strongly believe Walmart isn't going anywhere and is one of the few companies that won't get eaten by Amazon. Walmart also recently launched an e-commerce platform, trying to compete with Amazon. The company also pays a good dividend of 1.64%.\n\n7) Coca-Cola: 5%\n\nA personal favorite of mine, Coca-Cola! One of the strongest and most reliable brands in the world and my favorite dividend king. I love the current discount on this one, trading at 75% of its ATH. The dividend yield 3,5% is beautiful.\n\n8)  PepsiCo: 5%\n\nI feel like if I'm going to be adding Coca-Cola to my portfolio, I can't forget about PepsiCo. These 2 beverage giants are not going anywhere. The dividend yield of 3% is nice aswell.\n\n9)  Johnson &amp; Johnson: 5%\n\nEven though I don't know much about pharmaceutical stocks, I still love JNJ, mostly because of their growing dividend payout (for over 50+ years!)\n\n10)  McDonald's: 5%\n\nMy favorite fast food chain can't lack this portfolio.  When it comes to fast-casual dining, McDonald's is still the kingpin, and it's likely going to stay that way for a long time to come. The growing dividend payout (for 43 consecutive years) also looks really appealing to me.\n\nThanks and stay safe folks",
        "subreddit": "investing",
        "title": "My \"Buy and hold forever\" portfolio",
        "url": "https://www.reddit.com/r/investing/comments/hslmcw/my_buy_and_hold_forever_portfolio/",
        "created": 1594973793.0
    },
    {
        "author": "fail0verflowf9",
        "created_utc": 1595900215,
        "id": "hz5idt",
        "num_comments": 704,
        "num_crossposts": 0,
        "selftext": "I'm trading for 11 months with pretty good success.\n\nI never traded metals and forex before, just stocks.\n\nToday when gold started to consolidate at the last hour I decided to scalp short it with a large amount, so i opened 100 lots.\nI haven't realised, in forex 100 (lots) doesn't mean \"100 pcs\", because I used to stocks and I went full retard without knowledge.\n\nSeconds later I realized it means 10 million dollars (500x leverage).\n\nIt jumped up and immediately I was down 4000.\nI scared as fuck and rather than closing the position immediately I hoped maybe I can close break even.\n\nThe market closed and I waited for the asian session.\nThe gold popped like never before and I lost all my life savings (£65000)\n \nHere is the margin call\n\nhttps://imgur.com/a/i2bpwZ6\n\nYou know the rest of the story. I'm depressed, crying and shouting with myself.\nYes, I know I was stupid, thanks. I just wanted to share this with you.",
        "subreddit": "wallstreetbets",
        "title": "The comedy how I lost all my money in two hours",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hz5idt/the_comedy_how_i_lost_all_my_money_in_two_hours/",
        "created": 1595929015.0
    },
    {
        "author": "thoomerthoomer",
        "created_utc": 1593652177,
        "id": "hjnfst",
        "num_comments": 697,
        "num_crossposts": 0,
        "selftext": "Long story short I donked my noggin as a kid and my parents sued. First annuity check of 100k just hit my account and I want your suggestions. I will either become a millionaire overnight or sleeping on skid row and its up to you. This is no bullshit. I can prove with screenshots but that can easily be photoshopped so you'll just have to take my word I guess?... Throwaway account for obvi reasons.",
        "subreddit": "wallstreetbets",
        "title": "100k settlement money from head injury just hit...and ima YOLO ALL OF IT FOR YOU GUYS",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hjnfst/100k_settlement_money_from_head_injury_just/",
        "created": 1593680977.0
    },
    {
        "author": "ron_leflore",
        "created_utc": 1596227153,
        "id": "i1evk4",
        "num_comments": 653,
        "num_crossposts": 0,
        "selftext": "https://www.nytimes.com/2020/07/31/technology/tiktok-microsoft.html\n\nTikTok is currently owned by ByteDance, a Chinese company.  Despite its popularity in the US, TikTok has been called a threat to the US national security apparently because it collects way more personal information than most apps.",
        "subreddit": "investing",
        "title": "Microsoft in talks to buy TikTok",
        "url": "https://www.reddit.com/r/investing/comments/i1evk4/microsoft_in_talks_to_buy_tiktok/",
        "created": 1596255953.0
    },
    {
        "author": "BigHashBrows",
        "created_utc": 1593993142,
        "id": "hlx027",
        "num_comments": 648,
        "num_crossposts": 0,
        "selftext": "Aight, first, I’m kinda pissed. I missed the bottom and held out and am almost entirely in cash. Little did I know that I’d get my balls tingled by JPow and his printer but alas, here we are, 3100 Spy. WHAT THE FUCK. \nI also held out for divine inspiration in hope that it would crash again, because of a second wave..\n\nGuess what!? Us coronavirus cases are THROUGH THE ROOF and show absolutely no signs of slowing. Texas has had to partially shut down. Texas!! The whole country is fucked and the market is STILL TRENDING UP. \n\nLike whatever about JPow and his machine gun printer but who and how the fuck can ANYONE have genuine market confidence when the market is so near pre covid highs. Surely the big boys know that this is a total clusterfuck?\n\nAgain whatever about those retards in RH buying dogshit Hertz, but the whole market is still relatively stable and high!!?! \n\nSomeone please console me. Nothing makes sense anymore",
        "subreddit": "wallstreetbets",
        "title": "WHAT THE ACTUAL FUCK IS GOING ON",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hlx027/what_the_actual_fuck_is_going_on/",
        "created": 1594021942.0
    },
    {
        "author": "lawngjohn",
        "created_utc": 1595038865,
        "id": "ht8xre",
        "num_comments": 638,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Gay bears are at it again",
        "url": "https://i.redd.it/1uwt8d5yzib51.jpg",
        "created": 1595067665.0
    },
    {
        "author": "SamPom100",
        "created_utc": 1596123661,
        "id": "i0o9be",
        "num_comments": 637,
        "num_crossposts": 0,
        "selftext": "This [python script I wrote](https://github.com/SamPom100/UnusualVolumeDetector) scans every ticker on the market, gets their last 6 months of volume history, and alerts you when a stock's volume exceeds 10 standard deviations from the mean within the last 3 days. (these numbers are all adjustable).\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[here are some samples from when I ran it yesterday](https://preview.redd.it/j67nuj3cl0e51.png?width=360&amp;format=png&amp;auto=webp&amp;s=27ac244eb7a9b4b84fa2ae2a1b8a08db85a05122)\n\n[$KNDI Volume](https://preview.redd.it/ue395lbgl0e51.png?width=2768&amp;format=png&amp;auto=webp&amp;s=f64f59b3e2cbb57712cc4fffdf3cd476adf08c35)\n\n[$KNDI Share Price](https://preview.redd.it/s9jtygygl0e51.png?width=1470&amp;format=png&amp;auto=webp&amp;s=b2b41d32977d23b7423da646a3075f24af98ac1b)",
        "subreddit": "smallstreetbets",
        "title": "I made a tool to help you find the next $KODK",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/i0o9be/i_made_a_tool_to_help_you_find_the_next_kodk/",
        "created": 1596152461.0
    },
    {
        "author": "ActualArrival0",
        "created_utc": 1593876413,
        "id": "hl536d",
        "num_comments": 636,
        "num_crossposts": 0,
        "selftext": "From my \"research\" it will probably be discovered quickly (days) but if it goes undetected then they will most likely notice....eventually. And maybe it will be a year, but they'll yank 53k from the account when they find it. \n\nPlan is to hope they don't notice and use it as an interest-free loan.\n\n[https://imgur.com/a/BRWTxDF](https://imgur.com/a/BRWTxDF)",
        "subreddit": "wallstreetbets",
        "title": "Bank accidentally deposited $53,000 into my account what should I do?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hl536d/bank_accidentally_deposited_53000_into_my_account/",
        "created": 1593905213.0
    },
    {
        "author": "StockSlut2020",
        "created_utc": 1595575986,
        "id": "hwxjev",
        "num_comments": 636,
        "num_crossposts": 0,
        "selftext": "The recent price hikes in tesla stock had nothing to do with fundamentals.\nTesla hasn't produced more than last year, they haven't sold more than last year and haven't gained more than last year.\nThe only reason the price is where it is, is due to cult like price speculation.\n\nIt makes zero sense for tesla to be worth more than several car companies combined.\nThey produce only a fraction amount of cars and there is no evidence proving that they will keep this demand up.\nToyota has 12x the revenue that tesla has and yet tesla is worth 30% more?\nHow does this make any sense at all.\n\nI am warning you tesla share holders, once the negative news comes rolling in this stock will easily fall back to 500$ per share.\nNobody will buy expensive cars during a recession.\nThere is a lot of blood that will be spilled once the hype is over.\nBrace yourselves.",
        "subreddit": "wallstreetbets",
        "title": "Tesla isn't worth even 100B in market cap",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hwxjev/tesla_isnt_worth_even_100b_in_market_cap/",
        "created": 1595604786.0
    },
    {
        "author": "e_urric",
        "created_utc": 1595964478,
        "id": "hzl664",
        "num_comments": 601,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Kanye gets it",
        "url": "https://i.redd.it/ew7vn7t9gnd51.jpg",
        "created": 1595993278.0
    },
    {
        "author": "dhsmatt2",
        "created_utc": 1596079366,
        "id": "i0erej",
        "num_comments": 590,
        "num_crossposts": 0,
        "selftext": "Alright Purple Nurples, AKA PRPL GANG,\n\n&amp;#x200B;\n\n[My Giant 1 year chart](https://preview.redd.it/dy0nx95cwwd51.jpg?width=1127&amp;format=pjpg&amp;auto=webp&amp;s=8fd168ce2f8a3a214a4e7130ff39c8549e79f4c0)\n\n&amp;#x200B;\n\nThe recent run up of purple stock is outperforming my wildest expectations. If you followed my previous posts, then you likely purchased debit spread with 17.5/25, 20/25 or 22.5/25 strikes. If you don't know what a debit spread is then please see my other posts. If you went more ballsy then I recommended then hats off to you and may your gains be fruitful. PRPL stock saw some good after hour trading and has had 3 consecutive all time highs. I think this will continue as long as Trump doesn't Nuke China. Please see my Debit spread guide below, the prices are outdated but the concepts are the same.\n\n[https://www.reddit.com/r/wallstreetbets/comments/hu3yn9/debit\\_spreads\\_a\\_guide\\_for\\_the\\_handicapable/](https://www.reddit.com/r/wallstreetbets/comments/hu3yn9/debit_spreads_a_guide_for_the_handicapable/)\n\nIf you are interested in doing some research on PRPL then I suggest you start with u/lurkingsince2006 , he is my brother from another mother, also known as the OG purple. He makes fancy charts and pictures and probably has a math degree. \n\n**My latest DD can also be found here:**\n\n[https://www.reddit.com/r/wallstreetbets/comments/hv5xx4/purple\\_has\\_hired\\_330\\_people\\_in\\_60\\_days\\_and\\_has/](https://www.reddit.com/r/wallstreetbets/comments/hv5xx4/purple_has_hired_330_people_in_60_days_and_has/)\n\n&amp;#x200B;\n\n**Purple latest Bullish press release can be here:** [https://investors.purple.com/press-releases/news-details/2020/Purple-Expands-U.S.-Manufacturing-with-a-New-Facility-in-Georgia/default.aspx](https://investors.purple.com/press-releases/news-details/2020/Purple-Expands-U.S.-Manufacturing-with-a-New-Facility-in-Georgia/default.aspx)\n\n&amp;#x200B;\n\nIt appears that I was a little conservative in my run up and even I got some FOMO and sold my short leg slightly earlier than I wanted to. To all the followers, Although we may cap our gains at 25.00 with these spreads, our gains will likely be max after a positive earnings call. That being said, **if you are wanting a conservative play, the 22.50/25.00 debit spreads for August, Sept and October will all likely net you more than 100%.** Right now, the Sept spreads are showing a return of 155.00 for every 95.00 at risk, a 163% return. this run up is likely due to the massive hiring spree along with the new factory expansion that was announced yesterday. I expect that we will get more run up if we can maintain green tomorrow. I also expect that purple will smash earnings.\n\n* **If you cannot do options or do not have capital then the PRPLW are still a good play. I still own 45K warrants.**\n* **If you sleep on a casper because you're a giant sissy lala, then PRPL stock is probably the play for you. I still own 45K shares.**\n* **If you are a giant gay bear, just buy the mattress so that you have some comfort when the Mods come over to have their way with you**\n* **I didn't expect this stock to MEME but it is possible as it's still undervalued and will be a cash cow with surging DTC sales. forward PEG may be in the single digits. the last three days of movement lead me to believe earnings day could push this to 27-28, which is about 10% higher than my original expectation. If it memes, then 30+ is not unrealistic.**\n* **This is NOT investment advice- I learned all my investing strategies from TIK TOK, do your own research.**\n* *For those that like selling puts, I would sell 25.00 August, 25.00 September, 30 september, 25 october, 30 october and 30 Januarys. this strategy is independent of the above mentioned strategies. If you have huge balls, 35.00 january's might be a good play.*\n\n&amp;#x200B;\n\nPlease use the following site to calculate potential scenarios for options plays. The following is a sept 22.50/25.00 debit spread with the max return of 163%.\n\n[https://www.optionsprofitcalculator.com/calculator/call-spread.html](https://www.optionsprofitcalculator.com/calculator/call-spread.html)\n\n&amp;#x200B;\n\n[Automated site that shows different scenarios.](https://preview.redd.it/0amjz4lttwd51.jpg?width=643&amp;format=pjpg&amp;auto=webp&amp;s=21fa97715ded189a50fe9df90b2ef793c2ec9a4c)\n\nAt this point, you have a few options if you haven't completed your positions. I completed my positions on the run up today and my max potential gain is more than 1M on \\~3000 contracts. I may make another position tomorrow if it feels right. ***I AM OPTIMISTIC THAT THE GDP DATA EXCEEDS EXPECTATIONS and pushes the market green. I also EXPECT THE JOB DATA WILL SUCK. GDP&gt;JOB data IMHO. If I am wrong and the market turns red, it will likely be a buying opportunity. I recommend you wait for market sentiment before making any moves.***\n\n&amp;#x200B;\n\n[My Positions](https://preview.redd.it/4t497zc1wwd51.jpg?width=1141&amp;format=pjpg&amp;auto=webp&amp;s=c79b789173516f27537f40d0af460b9d22e4bc49)\n\n&amp;#x200B;\n\n[After hours movement](https://preview.redd.it/jjm01193wwd51.jpg?width=760&amp;format=pjpg&amp;auto=webp&amp;s=07eab36d507123d6f5f88fe24b88342d1d8a23b8)",
        "subreddit": "wallstreetbets",
        "title": "PRPL GANG- Another 750K in the bank - Still Money to be made - GAIN",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i0erej/prpl_gang_another_750k_in_the_bank_still_money_to/",
        "created": 1596108166.0
    },
    {
        "author": "07Ghost",
        "created_utc": 1595753370,
        "id": "hy3mgo",
        "num_comments": 576,
        "num_crossposts": 0,
        "selftext": "Simple answer: [Dr. Lisa Su (how she turns around AMD)](https://www.youtube.com/watch?v=lHT5MRky9SA)\n\nWhen you invest in a company, it's not just the product that's important for the company, but its people and leadership as well. Because ultimately, a corporation is just an organization run by bunch of people, which Elon Musk emphasized this point. A company's leader who has a clear vision for the company will bring its people together and its competitive products to market for the future. You look at the leaders between Intel's and AMD's. One got a Ph.D in electric engineering and has a firm grasp of where the industry is heading toward, whereas the other person who was previously a CFO just looks at spreadsheets and uses any means to appease the shareholders. How likely would a business major know anything what the semiconductor industry will look like in five years?\n\nIntel has been dominating 90% of the PC market for many years. The company becomes complacent and so do its shareholders' base as the stockholders enjoy their annual dividend payouts. You do that in a highly competitive semiconductor industry, your company will lose value and eventually get abandoned. You have to be constantly innovating to stay ahead, especially in the technology sector because that's just the nature of the industry. This isn't like consumer staples where the market remains static for a long time. A technology company's moat is easily broken if the company doesn't plan out its roll map &amp; product lines for the next five years. A lot investors could tell this became quite apparent at the last Intel's earning report.\n\nThis also separates the difference between value investing &amp; growth investing. Value investors look at financial statements of a company to judge how it appears now, whereas growth investors look at a company and make financial projections where the company can potentially go toward for the next several years. Growth stocks will never appear cheap at any current time, because if they do, then by definition they already stop growing. If you're a value investor by heart, I advise stay away from investing into tech stocks if you don't have a firm grasp about their respective, ever-changing industries, because most of them will never make sense to you.\n\nThere will be a time to revisit Intel. In my opinion, Intel needs a better leader who has an expertise in the field. Hitherto, AMD will continue to take market shares away from Intel to grow its revenues &amp; earnings, because its leader already planned this out from the last few years. She knew her competitor would have a tougher time catching up in manufacturing the technology. AMD stock is going much higher for the next 2-5 years.\n\nDisclosure: AMD shareholders since $8.00",
        "subreddit": "investing",
        "title": "Why is Intel losing to AMD &amp; people just realized it now?",
        "url": "https://www.reddit.com/r/investing/comments/hy3mgo/why_is_intel_losing_to_amd_people_just_realized/",
        "created": 1595782170.0
    },
    {
        "author": "Cygopat",
        "created_utc": 1594217095,
        "id": "hnhmon",
        "num_comments": 565,
        "num_crossposts": 0,
        "selftext": "I don't really have anything to add to this thread myself. Just wanted to throw it out there and see what people come up with to discuss. It's also very possible that the statement in the title of this thread is no longer true as the post ages. Here's some additional stats:\n\n&amp;#x200B;\n\nPE ratio:\n\nNvidia:  73\n\nIntel: 11.3\n\n&amp;#x200B;\n\nRevenue:\n\nNvidia:  11.78B\n\nIntel: 75.7B\n\n&amp;#x200B;\n\nGross Profit:\n\nNvidia: 6.77B\n\nIntel: 42.14B",
        "subreddit": "investing",
        "title": "At the time I'm writing this, Nvidia ($247.93B) is worth more than Intel ($247.90B)",
        "url": "https://www.reddit.com/r/investing/comments/hnhmon/at_the_time_im_writing_this_nvidia_24793b_is/",
        "created": 1594245895.0
    },
    {
        "author": "lnvisibleGhost",
        "created_utc": 1594419575,
        "id": "hoyi20",
        "num_comments": 564,
        "num_crossposts": 0,
        "selftext": "DIX is down and GEX has spiked like it has during every single massive drop in history since GEX and DIX have been recorded. It spiked massively on the June 10th 7% drop. It spiked on the COVID crash and on the 2018 and 2019 small crashes. It just spiked again on the 9th, and the spike usually predates a crash by 1-3 days.\n\nDIX — Where smart money is headed/dark pool index where smart guys make their plays\n\nGEX — Gamma exposure/hedging by Market Makers\n\nI don’t feel like writing more because nobody listens anyway. Research it more if you want.",
        "subreddit": "wallstreetbets",
        "title": "We are going to have a massive Red Day Monday-Tuesday",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hoyi20/we_are_going_to_have_a_massive_red_day/",
        "created": 1594448375.0
    },
    {
        "author": "MiltDavis",
        "created_utc": 1595116767,
        "id": "htqy2k",
        "num_comments": 553,
        "num_crossposts": 0,
        "selftext": " \n\nNext week congress is back in full swing, woop woop!  The well dries up on extended Unemployment Insurance benefits (aka the extra $600 a week you hear about people getting) on the 31st, and it’s time for some actual decisions to be made.  Here’s how shit looks;\n\n*Primer for the unread autist:*\n\nOn May 25th the House (Democratic) passed the HEROES Act as a starting point for second round of stimulus talks (for those who don’t know how it works, the House passes draft legislation, which then must be approved by the Republican Senate).  This will be the first time the Senate get’s a chance to truly debate it’s merits in session, but McConnell and other Republicans have already given statements letting folks know there is no way it passes as stands.  *What does the HEROES Act include?*  I put the ones that are important to you, the young tendie farmer, in bold\n\n* **a second stimulus check**\n* debt relief\n* student loan forgiveness\n* hazard pay\n* **six more months of COVID-19 unemployment**\n* housing and food assistance\n* nearly $1 trillion in aid for state and local governments so they can pay “vital workers like first responders, health workers, and teachers” who are at risk of losing their jobs due to budget shortfalls\n\nThe HEROES Act would give individuals earning up to $75,000 annually a one-time, non-taxable check for $1,200. However, whereas the first round of payments included an extra $500 per family for every child aged 16 or under, this additional credit would now rise to $1,200 each for a maximum of three dependents, allowing households to claim up to $6,000 each.\n\nSound nice?  It’s not happening.  Both McConnell (Senate Majority Leader) and Mnuchin (if you don’t know who he is stop trading right now) have been given stringent opposition to both those factors by saying 1) the $75,000 cap will be lower.  How much lower?  McConnell has floated $40,000 as the Senate starting point, representing a nearly 50% difference and 2) Mnuchin and McConnell have been both been firm in not extending the $600 weekly UI benefit, calling it a disincentive for people to return to work.\n\nA copy of McConnell’s counter-proposal was leaked to the Associated Press and in addition to the $40,000 cap, it also suggested moving the enhanced Unemployment Benefits from $600 a week to a few hundred dollars a month, and bridging the gap by providing a yet-to-be-determined ‘back to work bonus’.\n\n*So, what?*\n\nPolitics aside, if you’re a bull you probably want as many benefits as possible to keep consumer sentiment high and help retail rebound.  It also helps with travel, etc.  Given that a few of the largest economies in the world (CA, FL, and TX) are halting reopening and--if they’re not overtly saying it--trending toward shutdown, a “back to work bonus” may be a harder sell than the Senate realizes in practicality, and the UI benefit extension could definitely end up being more than a few hundred dollars a month to offset the that naturally occurring loss in work.\n\n*So, when does this happen?*\n\n*Monday- July 20th*: US Senate returns to session\n\n\"as soon as the Senate gets back, we're going to sit down on a partisan basis with the Republicans and the Democrats and it will be our priority to make sure between the 20th and the end of the month that we pass the next legislation.\"\n\nThis will be the first opportunity to get some daily swings based on headlines.\n\n*July 31st-*\\-the house begins a scheduled summer recess until labor day that Pelosi has said she is willing to delay.  This could lead to tactics of brinksmanship similar to those seen with previous budget shutdowns.  But…\n\n*August 7th-* that's when the senate goes on recess and McConnell has been clear that he will not be delaying it or cancelling it.\n\n***In other words, whatever is done will be done by August 7th.***  \n\n*Will Jerome speak on it??*\n\nI don’t see many scheduled FED hearings (or any) on the matter coming up, so this will not be like the hearings popping in June that allowed for massive daily swings.  But we will get lots of sound bites for the news to run with, and sound bites back from the Republican Senate.\n\n**Of note though, on Thursday, July 23rd, there is a House Committee meeting on the Heroes Act.  This should produce some aggravated soundbites from Republicans in the news.**\n\n***How I’m going to play it***\n\nNothing is stopping this vaccine pump from Monday the 21st until Tuesday open, but I’ll be looking to capitalize on moments of weakness for VIX/VXX pops.\n\n**If we are green Monday and Tuesday, Wednesday I’ll be buying:** \n\nVXX 7/24 32c\n\nVXX 7/31 34c\n\nAnd hold them until Republican senate responses come out to what is said during the House Committee meeting on Thursday.\n\n**On afternoons and evenings where Mango/McConnell thrash the Democrats as unreasonable:**\n\nVXX calls on those afternoons slightly OTM or ATM at open the next morning and hold until the next day.\n\n**Given that the vaccine high will likely wear off, case/death numbers are rising, and the news around this stuff will be turbulent, I’ll be moving into good ol’ tech next week with some:**\n\nQQQ 7/31 262c\n\nQQQ 8/7 270c\n\n**On the week of 7/24, in anticipation of a deal getting done:** \n\nSPY 8/7 330c\n\nSPY 8/14 335c\n\n***TLDR:***\n\nHEROES ACT negotiations are going to be a bumpy ride.  Senate Republicans hate the extra poor people benefits but will capitulate on their current hard stance--at least slightly--to keep the market lubed up particularly in light of businesses shutting down in our largest states.\n\nVXX will be good for overnight pops as bad news breaks in negotiations, while QQQ will be a safer play than SPY while negotiations are happening and COVID is raging.  Will move all-in on SPY calls about a week out from Senate recess on August 7th, which is the unofficial--but official--deadline for a plan to be passed.\n\n*I will update with the evolving calendar and pertinent news on the negotiations sometimes here,sometimes my Twitter same name.*\n\n**EDIT: Note 6 PM PST 7/18-- I am not advocating hold VXX long term or saying SPY won't trend upward on those plays--I am referring to those overnight guerilla warfare, get in and get out when you're up plays.  Next leg down ain't coming anytime soon, but there is still money to be made in bouts of volatility.**\n\n***FURTHER READING UPDATED DAILY BELOW***\n\n**UPDATE: (link) 7/18 9:37 PST: So it begins..**. https://www.wsj.com/articles/depleted-trump-economic-team-faces-major-test-over-extending-coronavirus-relief-efforts-11595073600\n\n**UPDATE: (link) 7/18 ** deeper reading on the Unemployment Insurance/ ‘Back to Work’ Bonus debate: https://finance.yahoo.com/news/the-600-boost-in-unemployment-benefits-expires-soon-what-comes-next-200832084.html\n\n**UPDATE: (link) 7/19**  WSJ article examining pros and cons of extended benefits through ind. stories: https://www.wsj.com/articles/as-600-a-week-jobless-aid-nears-end-congress-faces-a-quandary-11595151000?st=l5leqtixuee8ynz&amp;reflink=article_copyURL_share",
        "subreddit": "wallstreetbets",
        "title": "DD: Your Tendie Stimulus (VXX, QQQ, and SPY during upcoming negotiations)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/htqy2k/dd_your_tendie_stimulus_vxx_qqq_and_spy_during/",
        "created": 1595145567.0
    },
    {
        "author": "MelchekoYT",
        "created_utc": 1596058120,
        "id": "i095p9",
        "num_comments": 552,
        "num_crossposts": 0,
        "selftext": "its relatively easy to catch plays like kodak. on monday, there was clearly something big going to happen the next day with all the volume that came in before the news even dropped. probably insiders that knew the news before it dropped. and obviously people who scan hourly for unusual volume on low floats\n\nsame thing happened with WIMI a couple weeks ago. whole bunch of volume and around 10-20% gain right before its huge run up from $3.5 to peak of $38 2 days later.\n\nmost of these huge plays have 2 things in common. they have massive increase in volume the day before the breakout, and they also have been sitting at around the same price for at least a few days, bonus points for a few weeks.\n\nsame thing happened with UONE in june, you could have seen that one coming without even knowing about juneteenth. these opportunities only happen once every few weeks at most, with other relatively smaller plays like MTP that go for 50-300% in between the big ones. you just need to scan basically every couple hours every day for stocks that fit this criteria\n\n1. float under 20mil. dont worry about shares outstanding. kodk has around 50mil outstanding, but under 20mil float. \n\n2. price continously increasing on the day. a huge spike then a dump is no good. we dont want inverted hammer candlesticks\n\n3. and massive volume compared to its daily average. \n\nand thats it. its very common to find 1 and 2 together, but when 3 validates the first two, thats when it has a very high probability of going to the moon. this was the position KODK was in on monday\n\nthere probably wont be anything as big as kodk for the next couple days as KODK is taking pretty much all the volume and preventing other breakouts from happening.\n\none more thing, you wont be able to catch every big move obviously. for example, EQ blew up recently as well, but it didnt have the previous day increase in volume. those are the ones you will inevitably miss because there is no buildup. they go up on random news that nobody knew about beforehand. but you CAN catch the plays like KODK and WIMI and UONE that clearly have ridiculously strong momentum heading into the next day.\n\njust be patient and wait for one to have all 3 of those things i mentioned earlier.\n\njust dont get discouraged. the key is patience and waiting for the perfect setup. your odds of success increase significantly if you just wait for the right setup. i didnt buy anything today because nothing fit my strategy. MYT and TBLT, maybe. but the volume was just not there, and again, ugly ass candlesticks.\n\nno trades beats bad trades EVERY time. unless youre trying new strategies for education purposes with low capital being risked.\n\ngood luck everyone. hope this helps",
        "subreddit": "pennystocks",
        "title": "dont be mad about missing KODK, just be ready for the next one!!! heres some tips to find it next time🚀",
        "url": "https://www.reddit.com/r/pennystocks/comments/i095p9/dont_be_mad_about_missing_kodk_just_be_ready_for/",
        "created": 1596086920.0
    },
    {
        "author": "ephyfish",
        "created_utc": 1595406484,
        "id": "hvq1iw",
        "num_comments": 551,
        "num_crossposts": 0,
        "selftext": "Ok. First things first. I have a masters in finance and was an econ professor for five years. I do have some idea what I'm talking about. However:\n\n1. Timing is always impossible. I know there have been several prophets on here who proclaimed the end of times, only to make fools of themselves. I have suspicions about when the crash is coming, but won't claim I know with any certainty.\n2. Macroeconomics and our current financial system are so, so, fucking complicated that NOBODY really understands them perfectly. You can listen to two legitimately genius dudes on macro podcasts who are saying precisely opposite things. So - you can have a hunch. I do. But at the end of the day, NOBODY knows anything.\n\nOk then. That being said. Here's one thing I feel pretty strongly about in all markets: there are no easy fixes; the rubber *always* meets the road, eventually.\n\nSo what's fueling this insane stock rally? Obviously it's the Fed. It's the Fed pumping money like crazy. And what will pop this bubble? ***When printing money itself starts hurting the situation, rather than helping it.***\n\nExhibit one: The dollar index over the past six months.\n\nhttps://preview.redd.it/cp82kbk3adc51.png?width=2594&amp;format=png&amp;auto=webp&amp;s=9e9f406fae57dc932bc6a9bd7f91e5016f192b8c\n\nThe dollar index, ($DXY) measures the strength of the dollar against a few other currencies. Specifically:\n\n* [Euro](https://en.wikipedia.org/wiki/Euro) (EUR), 57.6% weight\n* [Japanese yen](https://en.wikipedia.org/wiki/Japanese_yen) (JPY) 13.6% weight\n* [Pound sterling](https://en.wikipedia.org/wiki/Pound_sterling) (GBP), 11.9% weight\n* [Canadian dollar](https://en.wikipedia.org/wiki/Canadian_dollar) (CAD), 9.1% weight\n* [Swedish krona](https://en.wikipedia.org/wiki/Swedish_krona) (SEK), 4.2% weight\n* [Swiss franc](https://en.wikipedia.org/wiki/Swiss_franc) (CHF) 3.6% weight\n\nThe dollar has been gradually weakening since April, and yesterday it absolutely nose-dived. Why? Some say the past months dip has been because the dollar is where people run to in times of crisis, and now that the crisis is passing, they don't need dollars as much anymore. Yesterday's dip in particular was attributed to the EuroZone passing a stimulus, giving investors faith that the Euro zone will remain unified and strong (there were rumors of it potentially breaking apart).\n\nHonestly, I don't know why the dollar has been tanking for three months (I have guesses, that's all), and anybody who tells you they do know is a lying sack of shit. And maybe the reason it's been tanking is less important than what the *narrative* around it will be, if it drops much further. You probably guessed it. What's everyone gonna be saying?\n\n**The Fed is printing too much money. They're inflating the shit out of the dollar!**\n\nAgain, whether that's true or not doesn't really matter, because if that's the narrative, the further devaluation of the dollar becomes a self-fulfilling prophecy: other countries don't want to hold dollars anymore because they'll lose their value. More sellers of dollars = $DXY drops even further, etc, etc.\n\nAnd now you're JPow watching $DXY drop down past 93, and you're starting to shit your pants. Because the rubber is meeting the road. The Fed wants modest inflation (2-3%) because it will make their debt worth less. But at the end of the day, a*bsolutely nothing scarier than* ***hyperinflation***. That's the nightmare scenario.\n\nAnd you know hyperinflation sneaks up on you. You have to be fucking vigilant. Not only do you have to stop printing, you might have to RAISE interest rates to avoid inflation getting out of control.\n\nBut again, it ultimately doesn't even matter if JPow changes his colors or not, what matters is the *narrative* that he's going to have to stop printing.\n\nThe market might already be sensing this... while Gold has been shooting up nicely and consistently, Silver has been fucking killing it the past two days. Maybe this \\^ is why.\n\n**Positions:** As I said at the beginning, even if I was 100% sure things were gonna go down like this, I'm wary of trying to time it. I have IWM and SPY puts for November, and GLD and SLV calls, for times between September and January 2022.\n\nNote: Even if this is totally wrong, I'm think there are other factors that will rain hellfire down on the market by November. Second wave in New York + Uncertainty around elections --&gt; both of these could actually *cause* the above cycle to start. Dollar strength is about faith in the US government. Remember that if Biden wins, Trump is still president for another two months. Those two months, where we're not sure if he's even going to leave office willingly or not, could be enough to shake $DXY down and start this thing off.\n\nNot financial advice.\n\nTL;DR  November SPY $280 and IWM $120 ,  SLV and GLD leaps",
        "subreddit": "wallstreetbets",
        "title": "DD: The dollar, the next SPY crash, and JPow hoisted by his own petard",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hvq1iw/dd_the_dollar_the_next_spy_crash_and_jpow_hoisted/",
        "created": 1595435284.0
    },
    {
        "author": "Jaxdtk1",
        "created_utc": 1595275776,
        "id": "husp0e",
        "num_comments": 549,
        "num_crossposts": 0,
        "selftext": "Hey boys, I just needed to vent or get some advice or both. I’m starting to think trading might not be right for me. I started out on some good swing/scalp plays and got my account up 40% in a few weeks. Recently though I’ve been unable to make any gains and I just don’t get it. I’m trying not to chase, read charts carefully, and set stop losses but it seems my stop losses always get triggered and I lose money, then immediately the stock shoots back up. It just feels bad. I feel like I keep getting kicked when I’m down and I’m just watching my account slowly drain out and it sucks. Thanks to whoever listened, luv you guys",
        "subreddit": "pennystocks",
        "title": "Feeling really hopeless",
        "url": "https://www.reddit.com/r/pennystocks/comments/husp0e/feeling_really_hopeless/",
        "created": 1595304576.0
    },
    {
        "author": "__TSLA__",
        "created_utc": 1595321987,
        "id": "hv41wq",
        "num_comments": 548,
        "num_crossposts": 2,
        "selftext": "**TL;DR:** A bit of DD for those wondering about what's going on with TSLA's recent sharp rise: a dramatic contraction of the \"free float\", which could trigger episodes of delta-hedging and short covering fueled positive feedback loops, also known as an \"Infinity Squeeze\".\n\n----\n\nThe most amazing infinity squeeze in history was VW's in 2008, when VW shares went from below €200 to over €1,000 within a single trading week, because there were more short positions than shares available (\"free float contraction\"):\n\n&gt; [**\"Hedge funds lose $30 billion on VW infinity squeeze\"**](https://moxreports.com/vw-infinity-squeeze/)\n\nThink about that, hedge funds shorted an **automaker** in fucking ***2008***, straight during the Lehman episode &amp; meltdown, when demand for new cars cratered, i.e. this was the best possible cannot-go-tits-up Big Short leveraged trade a fellow autist can dream up during a financial crisis, and they were *still* forced out of their positions in a massive short squeeze...\n\n----\nFast forward to 2020, during a raging bull market backstopped by Powell's brrrrrrrr machine, with over a million Robinhood retail traders armed with ~~financial weapons of mass destruction~~ leveraged options, and cue in Tesla's potential S&amp;P 500 addition, which would add TSLA with a bang at a nearly 1% weight: at today's $1,650+ price over $100b worth of TSLA shares (over 63m shares) will be held by passive and active funds benchmarked to the S&amp;P 500, in perhaps the most massive anti-dilutive share buyback program in history.\n\nFor those who want to watch this on video, here's a high quality analysis of the S&amp;P 500 inclusion from Tesla Daily:\n\n&gt; [\"Will Tesla Stock Keep Going Up? Exploring the Mechanics of S&amp;P 500 Inclusion (TSLA)\"](https://twitter.com/TeslaPodcast/status/1282932750543093760)\n\nOr another look at the float contraction caused by Tesla's S&amp;P 500 inclusion:\n\n&gt; [\"Tesla's S&amp;P 500 Inclusion: Predicting TSLA's post-inclusion stock price\"](https://www.reddit.com/r/teslainvestorsclub/comments/hsvqus/teslas_sp_500_inclusion_predicting_tslas/)\n\nWhat neither the video nor the post detailed sufficiently are the non-dilutive &amp; float contraction effects of **options**, the delta hedging inventory in particular, which is somewhere around ~40m TSLA shares today, or 27% of the float - and which **goes up non-linearly as the TSLA price appreciates**.\n\nToday there's a near record amount of TSLA options open interest: 800,000 call contracts and 1,200,000 put contracts, representing a huge delta hedging range of +80m and -120m TSLA shares - but with a current bias for upward skewed TSLA price moves. A +$200 move in TSLA generates about 5,500,000 shares worth of TSLA buying by market makers. (-4% float contraction)\n\nAnd today a record value of TSLA shares are shorted (over $20b short interest VAR), with a short squeeze \"ongoing\" according to short squeeze experts S3 Partners, who called the early 2020 TSLA short squeeze:\n\n&gt; [\"With the market rising there will be more short squeezes, such as $TSLA, as short sellers buy-to-cover as losses mount\"](https://twitter.com/ihors3/status/1285251199889965057)\n\nIf we add up the various TSLA shareholder categories who **must** or are strongly incentivized to hold TSLA, we get:\n\nShareholders | float taken out of circulation\n---|---\nPassive index funds |  26,000,000 shares\nActive funds benchmarked to the S&amp;P 500 | 37,000,000 shares\nDelta-hedging at $1,500 | ~40,000,000 shares or more\nNon-S&amp;P-500 indices already holding TSLA | ~20,000,000 shares\nShorts covering | up to ~5,000,000 shares (14m shares short today)\n | =\nSUM | = ~128,000,000 shares\ntotal free float | = ~147,000,000 shares\n\nMost of these entities **will be forced to buy TSLA at any price** and will take those shares out of circulation for a long time.\n\nThe next time the index funds will even consider selling some of their TSLA will be after the December reindexing, and because historically Tesla's Q3 and Q4 are the strongest quarters, there's a fair chance that the TSLA weight will further increase in December, triggering *more* accumulation.\n\nYeah, **over 85% of the float will be locked up by long-term holders** - or short covering which destroys virtual long shares anti-dilutively, which is recipe for a short squeeze + delta hedging positive feedback loop to drive an \"Infinity Squeeze\" to infinity and beyond. (In reality I think a trillion dollars valuation at $5,400 will probably be a limit to any spike.)\n\nFor the \"it's already priced in!\" crew: **it cannot be priced in** due to a design flaw in the S&amp;P 500 methodology (which flaw modern indices do not have), despite everyone knowing about S&amp;P 500 inclusion, the \"Index Effect\" is real and substantial, because $4.6t of passive S&amp;P 500 index funds **cannot buy before inclusion**, and because the Tesla event is so fucking huge &amp;  unprecedented.\n\nFor those who like to combine fundamental analysis with technical indicators and quant arguments, TSLA trading volume is already showing signs of 'float contraction':\n\n- Yesterday 17.7m TSLA shares were traded, which is **over 12% of the TSLA free float**, in a single trading day.\n- Last week over 105m TSLA shares were traded, which is **over 70% of the TSLA free float**, in a single trading week\n- Last month over 300m TSLA shares were traded, which is **over 200% of the TSLA free float**\n\nAs a comparison: last week, when AAPL has hit new all-time highs, the turnover was just 4% of the float (!)...\n\nA TSLA infinity squeeze will be slower than the VW squeeze IMO, but with a more permanent price increase, and during what appears to be a bull market so far.\n\nTomorrow Tesla will report Q2 earnings, which Wall Street expectations are an EPS loss and a GAAP loss.\n\nIf Tesla beats expectations and posts a profit, no matter how small, it will become eligible for the S&amp;P 500.\n\nTimeline of the addition: while the next S&amp;P 500 index rebalancing occurs on September 18, **there's no such timetable to additions**, which can be announced as quickly as 1 week after the company reports results - or as late as 7 weeks after the ER. This is one of the reason why many funds cannot buy TSLA in advance.\n\nIf Tesla is added then big index funds will get a couple of days advance notice from the S&amp;P 500 committee - but for that Tesla has to post profits first, which is uncertain.\n\nDisclaimer: this is not advice, I might be wrong &amp; degenerate, trade on your own risk and gamble responsibly!\n\n----\n\n**TL;DR:** If this indeed happens (which it might not), then pretty much any TSLA call options post the S&amp;P 500 announcement will go up in value.\n\nEven super deep out of the money $3,000 calls expiring this Friday quadrupled in value yesterday already...",
        "subreddit": "wallstreetbets",
        "title": "Incoming Tesla (TSLA) \"𝗜𝗻𝗳𝗶𝗻𝗶𝘁𝘆 𝗦𝗾𝘂𝗲𝗲𝘇𝗲\"",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hv41wq/incoming_tesla_tsla_𝗜𝗻𝗳𝗶𝗻𝗶𝘁𝘆_𝗦𝗾𝘂𝗲𝗲𝘇𝗲/",
        "created": 1595350787.0
    },
    {
        "author": "GSD_LOVER",
        "created_utc": 1595224132,
        "id": "hufx4f",
        "num_comments": 542,
        "num_crossposts": 0,
        "selftext": "This is hella serious but after listening to the joe rogan pod cast with the quarter rican jew im convinced i need more gold. I have half a milly i want to play with. Then I thought shit I should short it. Thoughts",
        "subreddit": "wallstreetbets",
        "title": "Serious thoughts on half a mill in gold.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hufx4f/serious_thoughts_on_half_a_mill_in_gold/",
        "created": 1595252932.0
    },
    {
        "author": "BitcoinIsFemale",
        "created_utc": 1594603337,
        "id": "hq65dq",
        "num_comments": 535,
        "num_crossposts": 0,
        "selftext": "Yes, this is sort of a cope post but I hope it helps someone out there.\n\nI'm 36 years old and quit my full time job in 2016 to day trade with $180k that I had made from trading 6 months prior. Between then and now, I have becoming a multi-millionaire three times, my ATH was 3.8MM, went back down to 800k, back up to 2.4MM, back down to 1.4MM, etc. \n\nOver and over again, people online told me to take profits, to move into safer investments, etc. When you believe you can make millions in half a year, you don't listen to any of that. I honestly thought I was wolf of Wall Street, and there ARE immense benefits to making that kind of money. I paid off my condo, bought a new car, travelled the world for a year (while trading), and have done luxurious things I NEVER imagined I'd experience before.\n\nAll and all I took home probably about 1.6MM, but in reality only took in maybe 1.1MM after taxes (would be even less if I earned it all within one tax year, but was split into 3).\n\nBesides my assets, I have 90k left in cash, and I just can't trade anymore. It completely fried me and to boot it taught me no life skills. You don't learn anything from trading in this manner except how to fool yourself into think you aren't gambling and wasting your life.\n\nMore importantly, it wasted so much of the prime years of my life that I actually want to cry right now. Your 20s and 30s are when you should be making your way in the world, growing and learning, not hunched over a lap top and being unable to sleep due to sheer avarice and worry. I wasted so much of my life chasing phantoms and with that mindset it will NEVER be enough. You will make a million, then another, then another, maybe lose it all but even if you don't, you pay a price for the money you make, and I don't think it's a good deal.\n\nNice things won't make you happy, but financial security will. If you make a million or two, you might want to consider taking a step back and analyzing your life to see if you're happy. The risk, the stress, and the time you spend in the market will only grow as you make more and it is so fucking dangerous.\n\nI was making 85k at my job, I wish I had stayed and just been a normal person. I made an ok amount of money but it cost me 4 years of my sanity, and held against what I would have earned, plus maybe raises, It really only was about 650k that I traded 4 prime years of my life for. Do something with your life, don't be like me and be some fucking jobless idiot who fooled himself into think he was a trader, with no direction who clings onto a rigged market for dear life.",
        "subreddit": "wallstreetbets",
        "title": "Don't be like me, find meaning in your life because this cannot sustain you.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hq65dq/dont_be_like_me_find_meaning_in_your_life_because/",
        "created": 1594632137.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1593689837,
        "id": "hjvf1y",
        "num_comments": 507,
        "num_crossposts": 0,
        "selftext": "https://www.marketwatch.com/story/tesla-stock-price-target-boosted-to-2000-by-wedbush-making-it-the-highest-among-factset-analysts-2020-07-02?\n\nWedbush analyst Dan Ives raised his stock price target for Telsa Inc. to $2,000 from $1,250 on Friday, making it the highest among analysts on FactSet. \"We believe with demand for Model 3's ramping stronger than expectations in China heading into the summer timeframe, the lockdown easing in the US/Europe, and some potentially \"game changing\" battery developments on the horizon (Battery Day another key catalyst) that Tesla's stock likely has room to run further,\" Ives wrote in a note to clients.",
        "subreddit": "stocks",
        "title": "Tesla stock price target boosted to $2,000 by Wedbush, making it the highest among FactSet analysts",
        "url": "https://www.reddit.com/r/stocks/comments/hjvf1y/tesla_stock_price_target_boosted_to_2000_by/",
        "created": 1593718637.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1594728660,
        "id": "hr0cdw",
        "num_comments": 493,
        "num_crossposts": 0,
        "selftext": "If your question is \"I have $10,000, what do I do?\" or other \"advice for my personal situation\" questions. If you are going to ask how to invest you should include relevant information, such as the following:\n\n* How old are you?\n* Are you employed/making income? How much?\n* What are your objectives with this money? (buy a house? Retirement savings?)\n* What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know its 100% safe?)\n* What are you current holdings? (Do you already have exposure to specific funds and sectors?)\n* Any other assets? House paid off? Cars? Expensive significant other?\n* What is your time horizon? Do you need this money next month? Next 20yrs?\n* Any big debts?\n* Any other relevant financial information will be useful to give you a proper answer.\n\nPlease consider consulting our FAQ first - https://www.reddit.com/r/investing/wiki/faq \n\nBe aware that these answers are just opinions of Redditors and should be used as a starting point for your research. You should strongly consider seeing a registered financial rep before making any financial decisions!",
        "subreddit": "investing",
        "title": "Daily Advice Thread - All basic help or advice questions must be posted here.",
        "url": "https://www.reddit.com/r/investing/comments/hr0cdw/daily_advice_thread_all_basic_help_or_advice/",
        "created": 1594757460.0
    },
    {
        "author": "outatime_mcfly_88",
        "created_utc": 1596071411,
        "id": "i0csz2",
        "num_comments": 493,
        "num_crossposts": 0,
        "selftext": "Listen up, AMD faggots.  Enjoy your W for now, but just like all the other cheap chinese made bullshit, it won’t last.  What you are experiencing right now, that retarded pump — it has a name.  We refer to it as retard strength.  Wouldn’t be possible without all you retards.\n\nFor the rest of you astute individuals, let’s focus on this tendie opportunity with INTC.\n\nLet’s cut the bullshit and get right down to it.\n\nIntel management has guided to free cash flow of $17 **BILLION** this year.  That’s nearly **twice the amount of total revenue** AMD is forecast to generate.  In the first half of 2020, Intel generated more than $10.6 billion in free cash flow — more than $58 million **per day**!!!\n\nMeanwhile, AMD — in that same 6 month period — generated free cash flow of just $32 million **TOTAL**\n\nRead that again you chinese loving fucks.  Intel generated almost **DOUBLE** the free cash flow **PER DAY** than AMD could generate in **6 FUCKING MONTHS**\n\nOh, and guess what else?  INTEL FUCKING PAYS DIVIDENDS!!!\n\nWant to get into P/E ratios???  Cool!\n\nAMD has a laughable P/E ratio of 157.23 \n\nLOLOLOLOL\n\nThat is the literal definition of OVERVALUED.  For you actual retards, P/E ratio is how much an investor is paying per $1 of actual earnings.\n\nIntel is at an amazing 11.61 P/E — you won’t find a better deal.\n\nSo for all those retards who feel great now, ask me how you feel in 6 months when you’re bagholding that chinese knockoff bullshit.\n\nAs for everyone else, enjoy this insane discount and buy this shit up!\n\nFYI, the cutoff for the next dividend payout from INTC is August 6, so get those shares bought and settled now!",
        "subreddit": "wallstreetbets",
        "title": "Let’s cut the bullshit with the doom and gloom for $INTC",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i0csz2/lets_cut_the_bullshit_with_the_doom_and_gloom_for/",
        "created": 1596100211.0
    },
    {
        "author": "tundraaaa",
        "created_utc": 1595231228,
        "id": "huha1q",
        "num_comments": 491,
        "num_crossposts": 0,
        "selftext": "# Fuck you.  \n\nUS didn't need the Fed in the 1920's.  \n\nFor reference, J. P. Morgan owned roughly 2/3 of the country's GDP in the early 1900's. This guy actually bailed out the US gov like 3 times when they ran out of gold and shit. Not that he did this in the 20's - but this serves as a great deal of perspective. (J. P. Morgan died in 1913.)  \n\nYeah, that's right - J.P. Morgan - the banker, whose legacy (his bank) is still fucking us in 2020 - by [manipulating commodities](https://www.ft.com/content/2d7be5a6-d87a-11e9-8f9b-77216ebe1f17); gold, silver prices etc.  \n\n  \n\nI digress.  \n\n* 1920-1929: Economic boom  \n* 1923-1929: Retail investors start speculating, market is propped up  \n* March 25th, 1929: Mini-crash, profit taking; many seling - nobody buying  \n* 1929-ish: Banker loads $25M into stonk market to try to regain confidence ($379M in 2020.)  \n* Spring, 1929: Signs of slowing economy: steel production, construction and car sales experience decline. Stonks climb higher for no reason; new ATHs  \n* September 3rd, 1929: DJIA peaks at 381.17  \n* September-October, 1929: Kangaroo market, everyone is fearing crash.  \n* Black Thursday, October 24th, 1929: Stonk market drops hard, retards lose $5B. \"*DW guys, nothing to see here. It will stabilize np.*\"  \n* Black Monday, October 28th, 1929: 22.6% drop in one day. Other world markets start to follow suit.  \n* Black Tuesday, October 29th, 1929: 12.8% drop in one day  \n* November 29rd: Stonks hit bottom, real stability starts to show  \n* US people and US economy is depressed until WW2  \n\nSomewhere inbetween these events, a bunch retard gamblers commit sudoku  \n\n\\-[thepeoplehistory](http://www.thepeoplehistory.com/1929.html).  \n\n  \n\nWhat has happened from 2013 to 2020? Have you not noticed that so many equities all started booming from 2013, and have kept going until the first yikes in 2015 (and another prop up), second yikes in 2018 (and another prop up), and third yikes in 2020 (and another prop up)?  \n\nKeep propping up the market. The crash will only be worse, the more you do so.  \n\nAfter the initial crash during the Great Depression, the banks collectively \"bailed out\" the stonk market (By buying equities and forcing stonks to go higher,) to make ~~retail traders~~ retarded money regain confidence in stonk market. Then it fucking crashed again.  \n\nNotice a fucking pattern here, you autistic fucks?  \n\nMoon and shit. This time it's different and shit. We have new technology and shit. New paradigm and shit. Tesla moon. Zoom moon. Nikola moon. Zynga moon. Etsy moon. Shopify moon. VeriSign moon. PayPal moon. Square moon. AMD moon. Netflix moon. Amazon moon. MongoDB moon. Wix moon. Spotify moon. Adobe moon. Lululemon moon. Godaddy moon. NVIDIA moon. Chipotle moon. Whatever, fuck you.  \n\n\"*Oh, but they didn't have memes during the Great depression,*\" [Hooverville](https://en.wikipedia.org/wiki/Hooverville#:~:text=A%20%22Hooverville%22%20was%20a%20shanty,was%20widely%20blamed%20for%20it) wants a word with you.  \n\n  \n\nOk I'm rambling, will stfu now. Probably incomprehensible",
        "subreddit": "wallstreetbets",
        "title": "tHe fEd DiDn'T dO aNyThInG In 1929!11!!1!!1",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/huha1q/the_fed_didnt_do_anything_in_19291111/",
        "created": 1595260028.0
    },
    {
        "author": "atmus_fear",
        "created_utc": 1594215471,
        "id": "hnh79b",
        "num_comments": 478,
        "num_crossposts": 0,
        "selftext": "We may or may not be in a bubble, but I can live in it for a bit. This is an incredible run so far.",
        "subreddit": "stocks",
        "title": "NIO just hit $15",
        "url": "https://www.reddit.com/r/stocks/comments/hnh79b/nio_just_hit_15/",
        "created": 1594244271.0
    },
    {
        "author": "Durlag",
        "created_utc": 1595868729,
        "id": "hyvyzh",
        "num_comments": 474,
        "num_crossposts": 0,
        "selftext": "What is your worst investment decision and what have you done to remedy your decision/behavior?\n\nI got caught up in marijuana stocks a few years ago, trading with reckless abandonment. I ended up bag holding a significant amount of Aphria for what seemed an eternity and recently panic sold it all damn well near the bottom. Combined with several other reckless moves I lost about $150,000 (which was a massive % of my portfolio) and tanked my TFSA contribution room among a ton of other stuff.\n\nI'm currently sitting on a few ETF's and am just banking my income in a savings account to buy a property and get out of the market entirely.  It's a really tough lesson but I am fortunate enough to be breathing, happy and young enough to recover from the catastrophe.",
        "subreddit": "CanadianInvestor",
        "title": "What is your worst investment decision?",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/hyvyzh/what_is_your_worst_investment_decision/",
        "created": 1595897529.0
    },
    {
        "author": "TheCuriousBread",
        "created_utc": 1595357233,
        "id": "hvd7ox",
        "num_comments": 473,
        "num_crossposts": 0,
        "selftext": "Up here at WSB we see multi-million accounts basically on a daily basis, anything less than 100k and you're boo-ed off into the bread line if you try to post gain porn of-But here's a reminder (UC Berkely study) of the \"[real world\" statistics when it comes to networth by age](https://sda.berkeley.edu/sdaweb/analysis/exec?formid=mnf&amp;sdaprog=means&amp;dataset=scfcomb&amp;sec508=false&amp;dep=NETWORTH&amp;row=AGESDECADE&amp;column=YEAR&amp;filters=YEAR%282016%29&amp;weightlist=WGT&amp;main=means&amp;transform=none&amp;percentileopt=median&amp;wncases=on&amp;cflevel=95&amp;color=on&amp;ch_type=bar&amp;ch_color=yes&amp;ch_width=600&amp;ch_height=400&amp;ch_orientation=vertical&amp;ch_effects=use2D&amp;decmeans=2&amp;dectotals=0&amp;decdiffs=1&amp;decmedian=2&amp;decse=1&amp;decsd=1&amp;decminmax=2&amp;decwn=1&amp;deczstats=2):\n\n&amp;#x200B;\n\n|Age|Mean|Median|\n|:-|:-|:-|\n|20-29|$56,984|$6,500|\n|30-39|$174,002|$32,600|\n|40-49|$457,783|$93,460|\n|50-59|$998,416|$152,400|\n\n\n**Edit: random fact, the median networth of someone younger than 20 is 250,000**\n\nSo if you're in your 20s and you have more than 6G, you're already ahead of 50% of your peers. Given of course the wealth inequality goes up like K-2 after you pass the 80% percentile.\n\nIf you have 5-digits you're already doing ok for yourself. Not great, but not terrible. Like 3.6 roentgen.\n\n6 digits? Pretty good.\n\n7? You're buying Corvette C8s in your 20s and joining the Carlisle boomer parade.",
        "subreddit": "wallstreetbets",
        "title": "A reminder: How your net worth compare in the \"real world\"",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hvd7ox/a_reminder_how_your_net_worth_compare_in_the_real/",
        "created": 1595386033.0
    },
    {
        "author": "UpTheDownMarket",
        "created_utc": 1595432447,
        "id": "hvw0du",
        "num_comments": 473,
        "num_crossposts": 0,
        "selftext": "https://www.bloomberg.com/amp/news/articles/2020-07-22/insiders-who-nailed-market-bottom-are-starting-to-sell-stocks\n\n\"As U.S. stocks climb to their most expensive levels in two decades, the executives in charge of the companies benefiting from the rally are showing signs of anxiety.\n\nCorporate insiders, whose buying correctly signaled the bottom in March, are now mostly sellers. Almost 1,000 corporate executives and officers have unloaded shares of their own companies this month, outpacing insider buyers by a ratio of 5-to-1, data compiled by the Washington Service showed. Only twice in the past three decades has the sell-buy ratio been higher than now.\"\n\nMake of it what you will.",
        "subreddit": "StockMarket",
        "title": "Insiders Who Nailed Market Bottom Are Starting to Sell Stocks",
        "url": "https://www.reddit.com/r/StockMarket/comments/hvw0du/insiders_who_nailed_market_bottom_are_starting_to/",
        "created": 1595461247.0
    },
    {
        "author": "TODO_getLife",
        "created_utc": 1595331071,
        "id": "hv5quk",
        "num_comments": 468,
        "num_crossposts": 0,
        "selftext": "Just got an email from them:\n\n&gt;Hi there,\n&gt;\nWe’re saddened to share that we’ve made the difficult decision to postpone our UK launch indefinitely. We'll be closing our waitlist and taking down our UK website shortly.\n&gt;\nThe world has changed a lot over the past several months and we’re adapting with it. On a company level, we’ve come to recognise that our efforts are currently best spent on strengthening our core business in the US and making further investments in our foundational systems.\n&gt;\nSince we announced our intent to launch in the UK, we’ve been fueled by your excitement for Robinhood and humbled by your response. We’re sorry that we cannot deliver the product we promised you this year.\n&gt;\nAlthough our global expansion plans are on hold for now, we will continue our work to democratise finance for all and we look forward to the day when we can bring this mission to the UK.\n&gt;\nSincerely,\nThe Robinhood UK Team\n&gt;\nA note about your privacy: We will be deleting email addresses from the waitlist and removing them from our systems to help protect your privacy.\n\nWas waiting for them to come to the UK and compete with freetrade but I guess that won't be happening now. I wonder what caused this, are they having problems in the US they need to fix?",
        "subreddit": "investing",
        "title": "Robinhood cancels UK launch",
        "url": "https://www.reddit.com/r/investing/comments/hv5quk/robinhood_cancels_uk_launch/",
        "created": 1595359871.0
    },
    {
        "author": "JupiterTarts",
        "created_utc": 1594407203,
        "id": "hournb",
        "num_comments": 456,
        "num_crossposts": 0,
        "selftext": "So i just put 50% in Amazon and 50% in Tesla and they just keep consistently going up regardless of whatever the market is doing that day. Nevermind DD. Don't care how inflated either of these two are, they're a pair of escalators that only go up. Got stoplesses set if either of them burst but im sure itll still catch it well into my green zone. Never felt so relaxed for once.",
        "subreddit": "stocks",
        "title": "Finally got tired of looking at my stocks and buying and selling every day. . . .",
        "url": "https://www.reddit.com/r/stocks/comments/hournb/finally_got_tired_of_looking_at_my_stocks_and/",
        "created": 1594436003.0
    },
    {
        "author": "tradewithmiller",
        "created_utc": 1596234946,
        "id": "i1h4ui",
        "num_comments": 454,
        "num_crossposts": 0,
        "selftext": "Tesla and SpaceX CEO Elon Musk lamented the \"entitled\" and \"complacent\" character of people in the United States, and lauded the \"smart\" and \"hard working people\" of China, in the first installment of a three-part interview with Automotive News' \"Daily Drive\" podcast published Friday. \n\nSpecifically, Musk criticized New York and California -- states that have supported his businesses, especially Tesla, with considerable tax breaks, regulatory credits and other government help.\n\nAutomotive News publisher Jason Stein, who conducted the interview, asked Musk, \"How about China as an EV strategy leader in the world?\"\n\nMusk replied: \"China rocks in my opinion. The energy in China is great. People there – there's like a lot of smart, hard working people. And they're really -- they're not entitled, they're not complacent, whereas I see in the United States increasingly much more complacency and entitlement especially in places like the Bay Area, and L.A. and New York.\"\n\nLast year, Chinese government officials helped Tesla secure loans worth around $1.6 billion to construct and begin manufacturing vehicles at the company's relatively new Shanghai factory. This year, the Shanghai government helped Tesla get back to normal operations quickly, at its new plant, after the region was struck by a Covid-19 outbreak and issued widespread quarantines that temporarily suspended manufacturing there.\n\nMusk pointed out, Telsa has not received as much assistance from the government in China as domestic companies there. \"They have been supportive. But it would be weird if they were more supportive to a non-Chinese company. They're not,\" he said.\n\nThe enthusiasm the mercurial Musk expressed for China contrasted with his expressed disdain for communism. In a tweet on Monday this week, Musk mocked social welfare programs in general, and Karl Marx's \"Das Kapital.\"\n\nDuring the Automotive News podcast, Musk also compared the U.S., California and New York to sports teams about to lose their winning status.\n\nHe said:\n\n\"When you've been winning for too long you sort of take things for granted. The United States, and especially like California and New York, you've been winning for too long. When you've been winning too long you take things for granted. So, just like some pro sports team they win a championship you know a bunch of times in a row, they get complacent and they start losing.\"",
        "subreddit": "investing",
        "title": "Elon Musk says 'China rocks' while the U.S. is full of 'complacency and entitlement'.",
        "url": "https://www.reddit.com/r/investing/comments/i1h4ui/elon_musk_says_china_rocks_while_the_us_is_full/",
        "created": 1596263746.0
    },
    {
        "author": "KingSlayer94",
        "created_utc": 1595426788,
        "id": "hvudoj",
        "num_comments": 447,
        "num_crossposts": 0,
        "selftext": "&gt;The complaint details Microsoft’s illegal and anti-competitive practice of abusing its market dominance to extinguish competition in breach of European Union competition law. Microsoft has illegally tied its Teams product into its market-dominant Office productivity suite, force installing it for millions, blocking its removal, and hiding the true cost to enterprise customers.  \n&gt;  \n&gt;“We’re confident that we win on the merits of our product, but we can’t ignore illegal behavior that deprives customers of access to the tools and solutions they want,” said Jonathan Prince, Vice President of Communications and Policy at Slack. “Slack threatens Microsoft’s hold on business email, the cornerstone of Office, which means Slack threatens Microsoft’s lock on enterprise software.”\n\n[https://slackhq.com/slack-files-eu-competition-complaint-against-microsoft](https://slackhq.com/slack-files-eu-competition-complaint-against-microsoft)",
        "subreddit": "investing",
        "title": "$WORK Files EU Competition Complaint Against $MSFT",
        "url": "https://www.reddit.com/r/investing/comments/hvudoj/work_files_eu_competition_complaint_against_msft/",
        "created": 1595455588.0
    },
    {
        "author": "lurkingsince2006",
        "created_utc": 1595212163,
        "id": "hud8ue",
        "num_comments": 445,
        "num_crossposts": 0,
        "selftext": "What are you doing clicking this when you could be reading yet another TSLA post!?!\n\n&amp;#x200B;\n\ntl;dr - PRPL Warrants (PRPLW) were registered again by Purple Innovation to trade on Nasdaq, which should drive a liquidity boost to their value ahead of any pile in from Robinhood users that can now trade them. (EDIT:  see my note at the end.  As a few users have pointed out, I was wrong on the RH retards).\n\nAlso, I'm liking the 20c / 22.5c spreads for 8/21.   Great risk/reward (as of Friday).\n\n# DD Recap\n\nWhen PRPL had closed at $13.67 in the previous trading session I called [PRPL to $19+ by 8/12 (ER)](https://www.reddit.com/r/wallstreetbets/comments/gqpqa3/prpl_to_19_by_812_er_calling_it_again/) on 5/25.  Congrats to those who listened.\n\nIf you actually do DD, I'd recommend you read the above link, along with the follow up DDs done for this quarter:\n\n* [PRPL: More DD For You Autists](https://www.reddit.com/r/wallstreetbets/comments/gs7mjl/prpl_more_dd_for_you_autists/)\n* [Looking for an entry for PRPL? It's right now.](https://www.reddit.com/r/wallstreetbets/comments/gw6irb/looking_for_an_entry_for_prpl_its_right_now/)\n* [PRPL 8-K Sales Release!](https://www.reddit.com/r/wallstreetbets/comments/gzm5y9/prpl_8k_sales_release/)\n* [I bought six PRPL mattresses today. You should buy PRPL too (it's undervalued).](https://www.reddit.com/r/wallstreetbets/comments/hig038/i_bought_six_prpl_mattresses_today_you_should_buy/)\n\n# New DD\n\nI'm going to chat about the following in this post:\n\n1. Warrants on NASDAQ\n2. Updates to some previous DD\n3. Future Vision of PRPL Shared by VP of Branding\n\n# Warrants on NASDAQ\n\nPRPLW warrants were originally listed on Nasdaq when the SPAC combination was completed.   Because there were less than 400 unique round lot holders, the warrants fell off of NASDAQ and onto OTC markets where they have sat for well over a year.\n\nOn Thursday 7/16, Purple [refiled](https://www.sec.gov/Archives/edgar/data/1643953/000121390020017648/0001213900-20-017648-index.htm) to have the warrants listed on NASDAQ.   NASDAQ followed close behind with a filing that [certified their approval](https://www.sec.gov/Archives/edgar/data/1643953/000135445720000339/0001354457-20-000339-index.htm) of the relisting of PRPLW.\n\nHow is this good?   This will allow Robinhood users to pile into the warrants as well (watch Robintrack to monitor for meme status).   On another note, it makes these commission-less trades on most other brokers, and also allows these to become marginable securities for yours truly (which means I get to double down and buy a whole lot more PRPL plays on margin).\n\nRegardless, there was a value drop when the de-listing occurred due to the liquidity drop.   I would expect some liquidity premium to return on these when the listing goes active again.\n\n&amp;#x200B;\n\n# Updates to Previous DD\n\n**Cutting the Low End Products**\n\nPurple sells every mattress they make and is only constrained in sales by their manufacturing capacity (Purple is the actual manufacturer of their product, unlike other mattress startups like Casper).  Please read previous DD at the top if you want more details.\n\nIn order to maximize revenue on the same units of sale, Purple ***discontinued*** their low-end mattress.   This week, they announced a $100 price increase on their mid-tier mattress as well as their most popular mattress.\n\n&amp;#x200B;\n\n|Product|Category|Notes|\n|:-|:-|:-|\n|Original Purple Mattress|Low End|Discontinued|\n|2\" Hybrid Mattress|Mid-Tier|$100 Price Increase|\n|3\" Hybrid Premier Mattress|Most Popular|$100 Price Increase|\n|4\" Hybrid Premier Mattress|Premium|Price Unchanged|\n\nAs Purple is still having sell out and lead time problems (check their website lead times), this is definitely a case of management trying to increase dollars per manufacturing capacity.   For every Original Mattress they didn't manufacture, they were able to sell a Hybrid.\n\nThis is a great sign of management increasing their unit economics yet again.\n\n&amp;#x200B;\n\n**Jobs**\n\nYou may recall that we've been tracking job postings on the Purple job board as another measure of growth.  [The last time I posted on this,](https://www.reddit.com/r/wallstreetbets/comments/gs7mjl/prpl_more_dd_for_you_autists/) there were 56 job postings.   As of Friday, **THERE ARE 98 JOB POSTINGS!**   *More importantly*, they are now offering a $2,000 signing bonus for factory production workers.   There's some pretty interesting other jobs on there as well.\n\nWhile the media screams about unemployment, Purple is trying to fill the roster to the point where production jobs are being offered a relatively substantial bonus!\n\n&amp;#x200B;\n\n# Future Vision of PRPL Shared by VP of Branding\n\nOn 7/9, Burke Morley, VP of Brand and Executive Creative Director at Purple, did a [podcast](https://www.podcast.vivoom.co/post/purple-vp-of-brand-burke-morley-no-longer-a-sleeper) where he shares some of the internal vision they have at Purple.   They do NOT consider themselves just a mattress company, but rather mattresses is just a way to generate cash to allow them to apply their comfort innovation across many categories.\n\nDismissing Purple as just a mattress company is like seeing Amazon as just a bookseller in 1998.  Burke shares their vision where they want to bring their technology to every aspect of your life:  your office, your car, the plane, etc.   Based upon the popularity of Purple's standalone seat cushions recently, they clearly can adapt their product to each of these markets.\n\nIf you are a DD-type of investor, I highly recommend you listen to the whole podcast, which does come across as very right-brained, in order to understand where this company is going.\n\nGiven that they have generated over $70M in cash in just April and May alone, I'm assuming we are going to see some of that cash deployed in product development to tap into these new markets.   Exciting few years ahead of Purple!\n\n&amp;#x200B;\n\nThis is not investment advice and do your own research before making any investments.\n\n&amp;#x200B;\n\nI'm long PRPL via several hundred thousand warrants, 25c 8/17 and 20c/22.5c 8/17 spreads.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/yly04erefxb51.png?width=1242&amp;format=png&amp;auto=webp&amp;s=3e5f1b28e36e5b1c08ec0de3b84c740a9058ad3d\n\nEDIT:   Looks like Robinhood users are still SOL with warrants even though they are NASDAQ.  Time to upgrade your broker.   I still think we will see a liquidity premium for these coming off of OTC.",
        "subreddit": "wallstreetbets",
        "title": "PRPL Warrants are Back on the Menu Boys!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hud8ue/prpl_warrants_are_back_on_the_menu_boys/",
        "created": 1595240963.0
    },
    {
        "author": "hydershykh",
        "created_utc": 1595221401,
        "id": "hufc2u",
        "num_comments": 441,
        "num_crossposts": 0,
        "selftext": "Hi,\n\nI am a Data Scientist by profession and I use tools built using Artificial Intelligence methods to anticipate stock movements. Here the picks of my tools for tomorrow. These are not all penny stocks but they are all pretty cheap, hence the post here. If I receive some reception from the community, I will keep posting them.\n\nBullish picks for tomorrow.\n\n* **$TORC** \\-  Biotech stock, the sector is hot right now. There is the huge gap up that needs to be filled which means less resistance in the trend up. The chart looks very similar to $INMB from last week (my tool anticipated that as well)\n* $**HMHC** \\- This should only be used if it breaks resistance with high volume. There is a solid resistance level right above the price.\n* $**NRBO** \\- Again, a biotech stock. Coming off of a support level. The tool expects this to go up with a probability of 77.9%.\n\nI am planning on posting these alerts on daily basis. They have been working pretty well for the last two weeks (alerted $INMB $BOXL $EQ etc). Let us see how they work this week.\n\nThoughts?",
        "subreddit": "pennystocks",
        "title": "My Tickers for Tomorrow Driven by my AI Tool | TORC, HMHC, NRBO",
        "url": "https://www.reddit.com/r/pennystocks/comments/hufc2u/my_tickers_for_tomorrow_driven_by_my_ai_tool_torc/",
        "created": 1595250201.0
    },
    {
        "author": "OhWowMuchFunYouGuys",
        "created_utc": 1593609294,
        "id": "hj9xks",
        "num_comments": 440,
        "num_crossposts": 0,
        "selftext": "$SFET\n\nhttps://www.safe-t.com/\n\nTHE FUTURE OF CYBER SECURITY –\n\nJune 29th, new software  announced to be used by top Intelligence units. \n\nSafe-T announces that several organizations have successfully deployed Safe-T’s Secure Application Access solution for remote users-\n\nSafe-T also Signs New Agreements for the Resale of its SDP Solution in the United States\n\nSafe-T Signs Partner Agreement with a Fortune 500 Affiliate for the Resale of its SDP Solution\n\nThe new partner is providing a broad range of services and solutions in more than 120 countries in strategy, consulting, digital, technology and operations and is a global leader in applying innovative solutions for improving organizations' operations and efficiency.\n\nComprised of industry leaders from B2B security firms and government agencies as well as elite military units, we understand and appreciate the complex challenges of protecting data in the Digital Transformation.\n\n“In February of this year, Mr. Avi Rubinstein, a seasoned cyber-security expert, joined us as the Company’s Chief Business Officer. Since then, we changed our go-to-market strategy from direct to indirect sales. This transition has allowed us to successfully partner with many leading channel partners in North and South America, Asia Pacific, Europe and Africa. Our cloud-based security solutions enable and support the remote work environment that organizations require to successfully and securely ride through these challenging times, as well as in the future, and we are indeed witnessing an increasing interest in our innovative solutions.\n\nPR statements\n\nJune 29, 2020 (GLOBE NEWSWIRE) -- Safe-T® Group Ltd. (NASDAQ, TASE: SFET),The unique solution was selected by a leading intelligence unit, after successfully winning a tender process.\n\nJune 25, 2020 (GLOBE NEWSWIRE) – Safe-T Launches the Perimeter Access Orchestration Fabric to Support all Remote Access Scenarios\n\nSafe-T® Group Ltd. (NASDAQ, TASE: SFET), a provider of secure access solutions for on-premise and hybrid cloud environments, today announced the launch of its Perimeter Access Orchestration Fabric (PAOF) designed to take its leading Zero Trust Network Access (ZTNA) solution to the next level.\n\nJune 17, 2020- Safe-T Announces the Launch of New Product by NetNut: Data Center Proxy Network\n\nRevenue up almost 200% this year,\n\nOrganizations today face a wide range of remote access scenarios and requirements, all of which must be addressed by a single solution, such as:\n\n• Employees and third-party contractors accessing internal resources;\n• Internal users connecting via the corporate network accessing internal resources;\n• Remote access to cloud-based and on-premises legacy applications; and\n• Integration of multi factor authentication (MFA) and identity awareness into all remote access scenarios.\n\n\nOn April 20, 2020, the Company reported a significant decrease of approximately 93% in its liabilities of a total of $8.23 million pertaining to the convertible debentures issued in April 2019 and in subsequent convertible loan transactions undertaken by the Company. On April 23, 2020, the Company retired in full its outstanding debenture debt, including redemption premium and accrued interest.- Zero risk of bankruptcy.\n\nSummary:\n\nRevenue is up almost 200%(before massive contract) from last year and this stock is currently showing a pennant bullish technical chart. This company will benefit from a second wave of Covid due to the need for Corporations that transition to work from home/ government also just announced their partnership, new software perfect timing. Get in for the moon!!\n\nFurther info -\n\nMassive reach as a company \n\nNew contracts \n\nPublic float 1.7 million\n\nNo debt\n\nBullish for three months leading up to contracts\n\nThe fair value was reported at $2.25 a share before these contracts and its massive revenue and now is easily worth 3+. \n\nCovid has been going around in China since before December. This will continue with no end in sight and more companies will be looking to employ from home with cyber-security becoming a must necessity. \n\nThey have contracts with massive intelligence services and you can assume if an intelligence service would trust the software so would any retail business. \n\nNews transcribed : Safe-T a provider of secure access solutions for on-premise and hybrid Cloud environments, today announced that it has launched a unique implementation of the zero trust secure file access solution and was selected by a leading intelligence unit after successfully winning a tender process. The purchase order is approximately $225,000 and as for a Perpetual license with a one-year maintenance period.   CEO \" We are proud to be the first to introduce our zero trust SFA solution as a SMB proxy and to have been successfully selected over other file access vendors to provide our solution to a leading intelligence unit specializing both and cyber and security. These achievements are important milestones for us as they reiterate our mission to provide world-class, Innovative cybersecurity products which not only fit business and Commercial needs but which we believe are also perfectly suited to government and defense requirements. \"\n\nThey have not released the name of all the clients specifically and PR is in the pipeline I would assume to announce all moves as well as established and new contracts that were acquired by $SFET. This company has never been in a better Financial situation and moving forward they will continue to acquire clients and contracts at a rapid rate. \n\nThis is a short and mid-range play that I see easily pushing $3 or more. I know some will take profits but I would personally hold until all clients and contracts are made clear as the extent is unknown and could be quite substantial. \n\nAlthough I doubt many of you will hold long term I can definitely see this company from $7-10 by EOY. \n\nRisks - \n\nFinancially there is no risk here (money situation is stable) but as with any penny stock an offering is always on the table but I believe with the new contracts they have acquired they will not be looking to do such a thing at this time.\n\n\n\nThanks to everyone who took the time to read.",
        "subreddit": "pennystocks",
        "title": "Massive contract ($SFET) (OVERVIEW) (Catalyst) (DD)",
        "url": "https://www.reddit.com/r/pennystocks/comments/hj9xks/massive_contract_sfet_overview_catalyst_dd/",
        "created": 1593638094.0
    },
    {
        "author": "Theorymeltfool1",
        "created_utc": 1595348653,
        "id": "hvaflx",
        "num_comments": 437,
        "num_crossposts": 1,
        "selftext": "After watching several interviews with Trevor Milton, I noticed that he engages in behavior that is similar to other fraudster CEOs, such as Elizabeth Holmes, Jeffrey Skilling, Adam Neumann, Billy McFarland, etc.\n\nAlmost every interview of his includes contradictory information. It would probably take an hour-long YouTube video to explain all of the instances, but I'll just go by a few here that you can watch yourself. A few quick instances first:\n\n* His company obviously copied Tesla by naming their company after Nikola Tesla, just choosing the first name instead. Then Trevor has the audacity to say that he can \"out-Elon Elon\". K, based on what? All of your past failures?\n\n* His company is a patent-troll. They sued Tesla for $2 BILLION, over something so incredibly stupid, and *expected* Tesla to pay out because \"they have billions anyways\". This is on the level of those people who fake-trip in a Walmart and sue because \"they have billions anyways\". It's trolling/sociopathic behavior.\n\n* Trevor said \"they're focusing on products that generate revenue\", which is why they got into hydrogen fuel cell (HFC) long-haul trucks. This was *completely contradicted* by their introduction of a pick-up truck, off-road 4x4, and a HFC jetski. Like, those are fun products, about 95% of customers buy those products for fun, not to make money off of. \n\n* He cashed out $70,000,000 in NKLA stock and purchased a $35,000,000 home before the company even sold a single truck.\n\n* NKLA applied for a $4 Million PPP loan, despite Trevor cashing out $70,000,000 in stock, and his company being worth Billions (on paper, but they still have a credit line). \n\n* On numerous occasions and interviews, Trevor talked about their company being \"vertically integrated\", i.e. owning the entire process from design, to production, to hydrogen fueling. What's really happening is their trucks are being built by a company all the way in Italy (or Germany), and then shipped to the US. He also has no plans on building out the Hydrogen fueling infrastructure. The \"renderings\" they keep showing he says will only cost \"$10-15 Million each\". That's ridiculous, the renderings for his HFC truck-stops are massive complexes that take up tons of land. Yeah, that's okay for Arizona and Utah, but not in the urban environments where most Trucks operate. And if you only have HFC-filling stations on the outskirts of cities, they'll be busy all the time which will increase transit times and cost more money. It's not like a Tesla Charging station that can just be built in a parking lot or near a loading dock. \n\n* Videos of their \"warehouse\" are all empty. It's not like Tesla's Fremont plant where there are thousands of workers. \n\n* NKLA went public through a \"reverse merger\", which isn't always bad, but it's still a sneaky/backdoor way to become publicly traded and in my opinion is worth staying away from on that basis alone. \n\n* The terms of their lock-out period expiration are just ridiculous. Some people are becoming millionaires before anything has even been sold. All they did was photoshop a few renderings for a few months, and that's somehow worth millions??\n\n* They don't even plan on having any trucks for sale for *years*. That means the next few years they're just going to be burning investors cash. Reminds me of DryShips, MoviePass, Theranos, etc.\n\nhttps://www.youtube.com/watch?v=6Qn2p3Lrn4A\n\n* Their \"Badger\" truck is nothing more than a rendering, and they're already accepting deposits for it?? That doesn't make any sense at all, it's *years* away from production. Their truck is nothing special compared to something like Rivian's or Tesla's, and both of those companies actually have working prototypes.\n\n* It'll be interesting if \"Nikola World\" even has a Badger Truck to show off. (Also, the name completely sucks)\n\n* He always sidesteps questions asked by interviews and twists the questions. She asked about them not producing a pickup truck, and then he says \"Well we have made a truck, we made the world's most advanced HFC truck...\" Yeah, not what she was talking about.\n\n* Anheuser Busch has made FREE reservations of about 800 trucks, but they haven't committed any money to the project. Anyone can go reserve a truck for free. Reservations ARE NOT sales, and Trevor talks like they're sales. That's what got Enron in trouble in the 2000s with their \"Mark-to-market accounting\" tricks.\n\n* In this interview, he mentions \"fun\" way too often. Not really sociopathic, just kind of weird. \n\n* They threatened to sue Bloomberg over the fact that their truck wasn't functional, which was true. If you haven't performed safety testing, then the truck isn't functional. People don't buy products without safety testing. That's why they're not actually following through on the lawsuit, because Trevor knows they would lose.\n\n* He uses the same logic as Elizabeth Holmes, when she would spout that bullshit like \"First they say you're crazy, then they fight you and then all of a sudden, you change the world.\" Worked out well for her, lmao!\n\n* Why do they have such a big factory/warehouse space in Arizona, when their trucks are being \"hand built\" in Germany (wait, not Italy anymore??)? Also, hand-built means not an assembly line, right? He also continuously gets his dates messed up. In this interview he said they'd be beginning production within the next few months, [but in this article he says production won't begin until 2021](https://www.electrive.com/2020/02/07/nikola-tre-to-be-built-in-ulm-germany/). \n\n* Why is he taking shitty vertical cell-phone footage of trucks? Can't he have other employees do that?\n\n* He talks about \"tickets to Nikola World\" like it's fucking Coachella or something. It's a company-sponsored event dude, no one gives a shit. Ooh, you get a $100 ticket if you put down a $1,000 deposit for a truck that's not going to be coming out for years?? What a deal!\n\n* That factory in Ulm, Germany he keeps mentioning? Right now, they only produce [fire trucks](https://en.wikipedia.org/wiki/Iveco), they don't even manufacture semi-trucks. So, uh, they're just going to convert from building diesel powered fire trucks to building electric and/or HFC trucks? Has that ever been done before ever?\n\n* [Trevor thinks that two days of reservations is enough to forecast an entire year's worth of reservations.](https://realmoney.thestreet.com/investing/stocks/i-ve-got-a-message-for-nikola-s-ceo-and-he-may-not-like-it-15365601)\n\n* In that article, he takes all criticism as \"haters\" or whatever, and not people who just want to understand what's going on. That's cult-like behavior, something to avoid in droves if you ever see it as an investor. \n\nI could go on, that's what I've seen so far, and I'll probably keep updating this in the future. Result: I'd stay far away from this stock simply because they have nothing for sale for years, which is ridiculous. The CEO acts like a sociopath, and seems to embody the types of traits seen in other sociopaths who were engaging in fraudulent/vaporware products. They're just going to burn through any money that investors have added before delivering anything.\n\nEdit: As mentioned in the comments, Trevor Milton isn't even the CEO any more. That job has been taken up by [Mark Russell](https://www.forbes.com/sites/alanohnsman/2020/06/12/nikola-stock-surge-turns-ceo-mark-russell-into-hydrogen-truckmakers-second-billionaire/#2acd467c31d8) who was the former CEO of Worthington Industries, a metal manufacturing company.\n\nhttps://en.wikipedia.org/wiki/Nikola_Corporation",
        "subreddit": "StockMarket",
        "title": "Trevor Milton is likely a sociopath. You heard it here first, DD inside.",
        "url": "https://www.reddit.com/r/StockMarket/comments/hvaflx/trevor_milton_is_likely_a_sociopath_you_heard_it/",
        "created": 1595377453.0
    },
    {
        "author": "dogthatbrokethezebra",
        "created_utc": 1594847368,
        "id": "hrw65z",
        "num_comments": 435,
        "num_crossposts": 0,
        "selftext": "Since the whole COVID thing started and there’s been an influx a new retards, it might be helpful to join some of the vets in a good old fashioned WSB paper trading contest. It’s always a lot of fun, and the prizes are usually pretty dope. I think it would be helpful for some of the new guys to learn some interesting strategies and get them on their way to making some fat tendies. Any interest?",
        "subreddit": "wallstreetbets",
        "title": "Should we do a paper trading contest? It’s been a while.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hrw65z/should_we_do_a_paper_trading_contest_its_been_a/",
        "created": 1594876168.0
    },
    {
        "author": "professordurian",
        "created_utc": 1593898005,
        "id": "hlb1qo",
        "num_comments": 434,
        "num_crossposts": 0,
        "selftext": "The WHO announced they think it will take the world 3-5 years to be past Covid-19.\n\nFauci this week said we will soon be at 100,000 infections a day in the US. This makes me think that Covid-19 testing companies may have a massive runway ahead of them.\n\nI am focused on Hologic (HOLX). They are producing 1,000,000 Covid-19 tests a week right now ... while the US has tested 33,000,000 people since the pandemic began. When I do the math it seems like they are producing a huge % of the tests being used daily right now. I'm also always more comfortable with S&amp;P 500 companies as they are less likely to be flash in the pan companies that disappear after a couple years.\n\nEven though them and other testers have seen huge boosts in stock price, it seems like that party may just be getting started if in fact WHO and Fauci are right.\n\nWhat other testing companies are you guys focusing on?",
        "subreddit": "wallstreetbets",
        "title": "WHO predicts Covid-19 to last 3-5 years. Covid-19 Testing companies may just be getting started.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hlb1qo/who_predicts_covid19_to_last_35_years_covid19/",
        "created": 1593926805.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1595491604,
        "id": "hwbt7q",
        "num_comments": 429,
        "num_crossposts": 0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on stock options, but if options aren't your thing then just ignore the theme and/or [post your arguments against options here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nRequired info to start understanding options:\n\n* [Call option Investopedia video](https://www.investopedia.com/terms/c/calloption.asp) basically a call option allows you to buy 100 shares of a stock at a certain price (strike price), but without the obligation to buy\n* [Put option Investopedia video](https://www.investopedia.com/terms/p/putoption.asp) a put option allows you to sell 100 shares of a stock at a certain price (strike price), but without the obligation to sell\n\nSee the following word cloud and click through for the wiki:\n\n[Call option - Put option - Exercising an option - Strike price - ITM - OTM - ATM - Long options - Short options - Combo - Debit - Credit or Premium - Covered call - Naked - Debit call spread - Credit call spread - Strangle - Iron condor - Vertical debit spreads - Iron Fly](https://www.reddit.com/r/stocks/wiki/options-themed-post)\n\nIf you have a basic question, for example \"what is delta,\" then google \"investopedia delta\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion &amp; Options Trading Thursday - Jul 23, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/hwbt7q/rstocks_daily_discussion_options_trading_thursday/",
        "created": 1595520404.0
    },
    {
        "author": "TheCuriousBread",
        "created_utc": 1595170372,
        "id": "hu1pll",
        "num_comments": 425,
        "num_crossposts": 0,
        "selftext": "Everyone and their grandma is throwing money at every random pharma that claims to be developing a vaccine hoping it'd be the next 10 bagger.This is almost exactly like 2016 when every faggot with a github account is writing bullshit white papers about the next great \"DeCeNtRaLizeD 'tulip' MaChInE lEaRnIng AlGoriTMiC pLatforM\".\n\nDo people know what it actually means or why is it better than existing platforms? Noooope but 'tulips' only GOES UP and then it doesn't and 'tulip' crashed down from 20,000USD to 3500USD within a few weeks in the end of 2017 after losing 50% of its value over a weekend.\n\nAre you at the 3500 to 10,000 rush or are you at the 15,000 to 20,0000 phase just before the crash? Who knows, who gives a fuck\\~ stonk only goes up, until it doesn't.\n\nI can't say the B-word or else the post get cucked but you know what I mean.\n\nEDIT: lots of people arguing about T-cells, immune response, and clinical trials in the comments. **Didn't know there's such an overlap on immunotherapy and stock market degeneracy.**",
        "subreddit": "wallstreetbets",
        "title": "\"Investing\" in pharma vaccines is the 'tulip' craze of 2016 on repeat",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hu1pll/investing_in_pharma_vaccines_is_the_tulip_craze/",
        "created": 1595199172.0
    },
    {
        "author": "MrTouchnGo",
        "created_utc": 1594729003,
        "id": "hr0f9h",
        "num_comments": 421,
        "num_crossposts": 0,
        "selftext": "&gt;Delta on Tues­day re­ported a net loss of $5.7 bil­lion for the June quar­ter com­pared with a profit of $1.4 bil­lion a year ear­lier, with sales down 88% at $1.47 bil­lion. The $9.01 loss per share com­pared with the $4.16 con­sen­sus among an­a­lysts polled by Fact­Set.\n\n&gt; The loss in­cluded $2.1 bil­lion in charges against its stakes in three over­seas part­ners—Latam Air­lines Group SA, Grupo Aeromex­ico SA and Vir­gin At­lantic Air­ways Ltd.—that are all in fi­nan­cial trou­ble. Delta also took $3.2 bil­lion in other pan­demic-re­lated charges, in­clud­ing re­tir­ing older planes.\n\n&gt; Mr. Bas­t­ian said the pause in the de­mand re­cov­ery would leave it burn­ing $27 mil­lion in cash a day this month, in line with last month. It is still aim­ing to stop los­ing cash by year-end, but that goal hinges on pas­sen­ger de­mand and the cost of shrink­ing the air­line when gov­ern­ment aid runs out, which it is cur­rently sched­uled to do on Oct. 1.\n\nhttps://www.wsj.com/articles/delta-trims-flying-amid-coronavirus-pandemic-11594725393?st=0kwxxd5vl63a2vi&amp;reflink=article_copyURL_share\n\n&gt; “Given the combined effects of the pandemic and associated financial impact on the global economy, we continue to believe that it will be more than two years before we see a sustainable recovery,” Ed Bastian, Delta’s chief executive officer, said in a statement.\n\nhttps://www.nytimes.com/live/2020/07/14/business/stock-market-updates-coronavirus?referringSource=articleShare",
        "subreddit": "investing",
        "title": "Delta revenue down 88% YoY Q2, for $5.7 billion loss. Estimates 2 years before sustainable recovery",
        "url": "https://www.reddit.com/r/investing/comments/hr0f9h/delta_revenue_down_88_yoy_q2_for_57_billion_loss/",
        "created": 1594757803.0
    },
    {
        "author": "Can_i_touch_you",
        "created_utc": 1595008815,
        "id": "ht0i2f",
        "num_comments": 421,
        "num_crossposts": 0,
        "selftext": "So I took out a $20,000 personal loan at 15%, because I read on reddit that in previous recessions automotive companies bounce back. so I looked at Ford stock. It tripled in 2002 from the 2001 recession. in 2009 it went up 1700% from its lowest in 2008 recession. so I’m banking on within a year at least 100% return, then sell.",
        "subreddit": "wallstreetbets",
        "title": "$20,000 personal loan on one stock.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ht0i2f/20000_personal_loan_on_one_stock/",
        "created": 1595037615.0
    },
    {
        "author": "KE3BO",
        "created_utc": 1594235176,
        "id": "hnn881",
        "num_comments": 417,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Full sent it and Risked $60K(pretty much my whole account) on #TSLA puts. We’ll see how friday turns out lol",
        "url": "https://i.redd.it/brtsjf06mo951.jpg",
        "created": 1594263976.0
    },
    {
        "author": "Soulbeastdude",
        "created_utc": 1596043463,
        "id": "i04m8s",
        "num_comments": 417,
        "num_crossposts": 0,
        "selftext": "Imagine you're an average Robinhood user and on July 28th you see some penny stock for a camera company nobody uses shoot up 300% because they can make cameras with vaccines now or some shit.\n\nAnd then FOMO wants you to invest now but you think \"This shit has peaked.\"\n\nThen imagine it goes up like 500% the next day and now you regret not going all in when you had the chance. But, you think \"\\*Now\\* it has peaked.\" \n\nImagine, 30 minutes later, the stock goes all the way from $2.50 to $54, a weekly increase of \\*\\*+2,370%\\*\\*\n\nAnd now you think,\"Fuck it, I'm riding this to the moon.\" and you invest at $54.\n\nAnd then it drops from $54 to $30 lol get fucked",
        "subreddit": "wallstreetbets",
        "title": "Imagine Kodak",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i04m8s/imagine_kodak/",
        "created": 1596072263.0
    },
    {
        "author": "fuzzyblankeet",
        "created_utc": 1594746595,
        "id": "hr5f9i",
        "num_comments": 412,
        "num_crossposts": 3,
        "selftext": "Hello, friends -\n\nIt's me, Fuzzy. Another beautiful day begins in the neighborhood, and what better place to spend it than here, with you poop-flinging retards? I feel like [Jane Goodall](https://www.nationalgeographic.com/content/dam/cultureexploration/2019/01/jane-goodall-difficult-women/01-jane-goodall-difficult-women.jpg) out here amongst you - a mixture of curiosity, repulsion, and a strange... attraction I can't quite shake that's keeping me around. Side note: she 100% clapped chimp cheeks, right? Boned bonobos? I mean, Fuzzy wouldn't say no to a game of hide the banana with her - if you watch those old specials on the National Geographic Channel (a fixture of Casa de Fuzzy late-night programming) you'll see she's got a body that makes you want to climb it like an orangutan - but facts only, she definitely got misty with a gorilla or two in her day. Or was that [Diane Fossey](https://media.vanityfair.com/photos/5cfab85e76711f7c887fe5fd/master/pass/sigourney-weaver-ghostbusters-2020.jpg)? Either way, with apologies to u/pokimane, I'd definitely hit that. ([PS - welcome back Gary Larson!](https://66.media.tumblr.com/tumblr_m2mp43svgB1qeoyxwo1_400.jpg))\n\nAnyway, this post is a bit inside baseball, but it's my party and I'll do what I want. Today I am going to give you guys a lesson on one of the under-the-radar impacts that the pandemic-du-pangolin has had on the debt markets. Long-time readers know that I'm always banging on about the impact of the covenant-creep of high-yield style structures into traditional bank financings. It's a fact of life in 2020 that the docs governing most bank debt are a lot looser than they used to be (and it was that way before the virus, too), but unscrupulous borrowers and shitty bank lawyers asleep at the wheel during the pandemic have made it worse. The specter of the money-printer looms large, too - with the implicit support of a government hell-bent on keeping the money markets afloat with synthetic liquidity, people just have more appetite for risk in negotiations than they had 18 months ago (from a documentation standpoint). Anyway, one of the big ticket items on the agenda has been the rebirth of the so-called '*J. Crew*' issue - the ability of companies to send valuable shit out of the credit when things start going sideways, so the lenders can't get at them in an enforcement scenario. This can have a major impact on the creditworthiness and overall value of a corporate group and I've spent the last week having a major fight about it with a few idiots on the other side of a deal, so I figured why not take a break from clowning them and clue you guys in to what it is and why it matters.\n\nIt's been a while, so a reminder for the new readers and slow learners in the audience. I will answer any legitimate question I get asked about the post, no matter how stupid (as long as it is sincere or at least funny). Sometimes it takes me a couple of days but I get around to everybody eventually. I do this because getting flamed by someone who knows what they're talking about is the only way to learn - it's how I learned, and it works. **But remember - I don't give advice for free**. So please don't ask me what to buy (long $POPCORN), if your 95% OTM option is fucked (it is) or for a strike/exp (TSLA $6940C 4/20/21) because I'll just have to repeat that in the comments and you'll look like a big dummy.\n\nOK. Got it? Good. Here is what you are about to read:\n\n1. Subs Aren't Just For Doms: Why Corporate Groups Are More Than Just A Ticker\n2. Investment Covenants: How Companies Spend Their Tendies\n3. *J Crew* And You: Exploiting Loopholes For Fun And Profit\n\nIf you are interested in playing along at home, [here is J. Crew's credit agreement as it then existed](https://www.sec.gov/Archives/edgar/data/1051251/000156459014000667/jcg-ex10_201403057.htm), and [here is a copy of the relevant court filings](https://iapps.courts.state.ny.us/fbem/DocumentDisplayServlet?documentId=g3bQfywJstNqt/O3VUqiaw==&amp;system=prod).\n\n**TL;DR**? Fuck you. I am large. I contain multitudes. If you can't handle that, that's on you. Bitch about it to your body-pillow. I just don't give a shit.\n\nLet's do this.\n\n1. **Subs Aren't Just For Doms: Why A Corporation Is More Than Just A Ticker**\n\nA long, long time ago on a tweedy, tea-soaked rock in the North Atlantic, some smart young autists with terrible teeth and a colonialism problem decided it would be a fun idea to YOLO their life savings into speculative investments involving the rape and/or pillage of various locations in the South Pacific and Asia. Unfortunately for them, at this time, you could only do this by either (i) commandeering a ship, sailing there, and raping and pillaging to your heart's delight or (ii) asking the monarch for a permission slip to let you do this without being personally liable for the consequences. Fortunately for these hungry young retards, the great and glorious Queen Libby I (she of the clown hair and white face paint) loved this idea. So she created 'chartered corporations' to facilitate these little excursions. See, back in the day, you needed her permission to make a corp. Anyway, 100 years, several hundred million pounds of profit and millions of dead Indians later, the idea had been so successful that the OG East India Companies formed by those retards were worth nearly a trillion dollars of today's money, and everybody else wanted to get in on the idea - so they did away with royal charters and the rest of the world quickly cottoned on to the idea that separating investors from the actions of the companies they bought into was a cool idea. Thus was born the doctrine of the separate legal entity and modern corporations law.\n\nForward-thinking legal eagles like yours truly then figured out that if it was cool to have one corporation separating investors from actions (and, therefore, liability), it would be *even* *cooler* to layer several corporations between them, making it harder to (i) see who actually owned the company and (ii) to take their shit if anything went wrong. So was born the concept of the modern 'corporate group' - companies that created their own subsidiaries, in which they owned 100% of the issued equity, who then created their own subsidiaries, in which they owned 100% of the issued equity, and so on down the ladder. All the profits can be sent straight up - but the liability (generally) stops at the immediate level of the actor. Awesome, right? Having cake and eating it too - if cake disgorged profits instead of carbs.\n\nIn 2020, pretty much every company that's not a Mom &amp; Pop dry cleaning business works this way. Investors on top, 'name' company nearby (either directly underneath or with holding vehicles in-between, and lots and lots of subsidiaries sitting below the name. There are a bunch of tax reasons to structure this way but the liability shield and diversification of revenue streams is generally the key structural consideration.\n\nSo what happens when the name brand company wants to borrow money? Remember from our previous lessons that how much money you can borrow is directly related to the sort of security you can provide to the lenders - \"Look, I can give you this much dollar value in assets as collateral, and prove to you that my corporate group makes this much money over the course of a year\". Some back office nerds at the bank crunch the numbers (like EBITDA - [check out my primer here](https://www.reddit.com/r/wallstreetbets/comments/g1xq3e/cookin_the_books_with_tsla_fuzzys_ebitda_explainer/)), and the computers spit out a number that the business guys fight about and ultimately gets settled, and hey presto, you've got a brand spanking new billion dollar term loan. Easy so far, right?\n\nHere's where it gets a little tricky. Not every subsidiary is treated the same way in calculating these numbers - because not every subsidiary is necessarily included in the credit support as a guarantor, pledgor, whatever you want to call them. Some get excluded because they're offshore and including them would have adverse tax consequences. Some get excluded because they have complicated ownership structures. Some get excluded because they're just not doing anything - shell corporations parked at some PO box in the Caribbean waiting for a purpose don't have much to contribute to the revenue calcs of the broader group. The distinction here is between what we call '**Restricted Subsidiaries**' - companies who are subject to the various rules and regulations of the credit docs (e.g., can't buy shit, can't borrow shit, can't spend money) - and '**Unrestricted Subsidiaries**' - companies who can do whatever they want because they're 'outside' of the credit, even though they're owned by companies who are inside the credit. The borrower can typically designate (and re-designate) subsidiaries as 'Restricted' or 'Unrestricted' by jumping through a few hoops - most commonly showing that an unrestricted subsidiary being designated restricted would otherwise be in compliance with the debt and liens covenants applicable to restricted subsidiaries. You might want to do this for a variety of reasons but normally its because sometimes there are rules about how you can move shit around inside your credit group; typically you can only move money and assets to companies that are subject to the rules the banks have agreed to ahead of time (not those sneaky unrestricted subs sitting off there away from where the banks can get at them). You can check out the definitions in the J. Crew credit agreement by ctrl+fing \"Restricted Subsidiary\" or \"Unrestricted Subsidiary\".\n\nAnyway, the punchline is that when you look at, say, $TSLA, there's a lot more under the hood than a ticker, a substandard engine and snuff pics of Elon getting pegged by Grimes. You're actually talking about hundreds of subs spread across a wide range of jurisdictions - the ticker is just the tip of the corporate iceberg.\n\n2. **Investment Covenants: How Companies Spend Their Tendies**\n\nAs you may know from my previous posts, [credit agreements have a lot of rules](https://www.reddit.com/r/wallstreetbets/comments/fopuyx/daddy_where_does_money_come_from_birds_bees_long/). They mainly dictate what the borrower and guarantors can and can't do -  can't change shit about the company **except for shit that doesn't matter**, can't sell your shit without telling the banks **except for shit that's really cheap**, can't buy stuff **except for stuff you need**, etc. The big one for our purposes is called the Investments covenant.\n\nI know, I know. It's a word you recognize. Hooray! But slow down, little autist. In credit agreement land, 'Investment' doesn't mean 'investment'. It means whatever the definition in the document says it means. It's not what you use Robinhood for. Here, it means any 'loan, advance, or capital contribution to... another person'. If you want the unfiltered version, ctrl+f \"Investment\" in the J Crew credit agreement to see what I'm talking about. This formulation is broad enough that you can read it to encompass pretty much any transfer of assets you can think of to a subsidiary, so this little doohickey is how companies move money and other shit around their corporate group. Typically, you get a dedicated 'basket' in the negative covenants that allows you to make 'Investments' in subsidiaries up to a certain dollar figure.\n\n3. ***J Crew*** **And You: Exploiting Loopholes For Fun And Profit**\n\nSo, in 2016,  J. Crew was in bad shape. The company was at risk of going under. It was subject to a pretty strict credit agreement that severely limited its ability to incur new debt or repurpose its existing debt. The board was stressed that the company would default under the credit agreement and the lenders would come in and take their shit, limiting the ability of the company to bounce back after filing for bankruptcy. So, they decided to take a very risky gamble - what if they could manage to get the most valuable collateral out of the reach of the lenders? If shit gets moved out of a corporate group, generally there is a trigger that releases whatever liens the lenders have on it, so if they could pull it off, they would be home free.\n\nRemember, credit agreements are **expressly designed to prevent you from doing this**. Why would I lend you a billion dollars on the back of certain collateral if I knew there was a risk you could throw that shit out the window the minute I signed on the dotted line? So this was a ballsy move. Banks would be **pissed.** Here's how it went down.\n\nThe most valuable shit that J. Crew owned was not, surprisingly, shitty chinos and ill-fitting polo shirts. It was intellectual property. So that was what they needed to move.  Section 7.02(t) of the credit agreement allowed investments by non-loan party restricted subsidiaries in any other person (including in an unrestricted subsidiary) if the investment was initially “financed with the proceeds” of certain other permitted Investments. Here, these other permitted investments included the intercompany basket that allowed investments by loan parties in non-loan party restricted subsidiaries up to the greater of $150 million and 4% of total assets. In English, this meant that J. Crew could send shit out the door untouched by routing it through another restricted sub before posting it to the unrestricted subsidiary - 'laundering' the IP.  All it had to do was transfer the value of the IP to a non-guarantor restricted subsidiary prior to moving the IP to an unrestricted subsidiary and it had capacity to move collateral out of the group (up to the limit of the applicable basket). Now, this was **not** how things were intended to work - it was a loophole, and the smarties on the borrower side both spotted it and had the stones to try and drive $500 million worth of IP through it. Hats off to them.\n\nStill with me? This was a **big problem** for the J Crew lenders. And they kicked up a huge stink. So J Crew turned it up a notch and filed for a declatory judgment that what they did was legal. Ultimately the case was settled out of court and the credit agreement was amended to allow the transaction retroactively... which basically was the lenders admitting that J. Crew was right in their interpretations of the documents. So. The market quickly pivoted to prevent this happening by putting a hard cap on how much value could be transferred out of the credit to unrestricted subsidiaries - often called the 'J. Crew blocker'. This is in most credit agreements signed between 2016 and 2019.\n\nThe bat-flu, though, has encouraged borrowers to start fighting this -  as distressed issuers look for ways to address their liquidity concerns and/or reorganized and optimize their capital structures. By my count there are at least five instances in the last three months of either proposed or consummated J. Crew moves. L Brands, Cirque du Soleil, DSG, Maclaren, and GAP are all on my personal shit list for this, but there are more in the pipeline.\n\nThe impact of pulling a J Crew on the value of the equity can be significant, as it is essentially (i) showing the market that you think the name brand of the equity is in financial difficulties (ii) moving value out of the core brands and (iii) damaging the creditworthiness of the business in the eyes of the market.\n\nAnyway. Here ends the lesson. This is something that is being actively negotiated across the market as many companies adjust to the new normal of precarious relationships with their financiers. Whether or not the market goes up or down is increasingly divorced from the true financial position of companies, but debt never lies and is - as my long time readers know - the best way to understanding the 'real' health of a company and how it is positioning itself for the future.\n\nBless up.\n\nFuzzy",
        "subreddit": "wallstreetbets",
        "title": "Cheaters (Always) Prosper: Covenants in the Time of Corona",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hr5f9i/cheaters_always_prosper_covenants_in_the_time_of/",
        "created": 1594775395.0
    },
    {
        "author": "dhsmatt2",
        "created_utc": 1596161832,
        "id": "i0zaqh",
        "num_comments": 412,
        "num_crossposts": 0,
        "selftext": "All- I have received hundreds of DM asking where the stock is going. I have received  questions such as: where do you think it stops, is it over valued, undervalued, should my mom invest, should i Yolo, should i sell and take profits?  blah, blah blah.  Here is some DD- stop asking me about where this ends up because I don't know for sure but I have some Feely Good estimates. I hope this post makes your nipples hard and if it doesn't you're probably a gay bear.\n\nI am going to give you a quick run down of what my expectations are for Q2 earnings and it will include the good, the bad and the ugly. The ugly being the warrant accrual that will hurt GAAP.\n\nFirst of all, There is little that needs to be determined for Q2 top-line as they have already released April and May Sales. April Sales Came in around \\~62M based on my math and May Sales came in at 88M and some change. Based on these numbers, we can safely assume that we will at a minimum have somewhere around 225M in revenue for the quarter by using the average of April and May to determine June. I believe 225M to be on the low side and I have continued to up my estimates as I believe E-commerce is still thriving, especially purple. Purple continues to climb the web traffic ladder and has moved up another \\~500 spots to be the 13,000 most popular site in the world.\n\n&amp;#x200B;\n\nFor simplicity sake, I am going to use some historical numbers to estimate profits. If you'll look at previous posts that I've made then you'll see how I arrived at these numbers. There are some quick napkin calculations below. We can safely assume that the average wholesale selling price of a mattress is \\~1350 dollars and we can assume that GM for wholesale is around 30%. This means the average cost of a mattress to manufacture is \\~945 on average. From my previous posts, we knew that pre Covid the business was split by units, not by gross sales. On average, wholesale consumed 50% of capacity and DTC consumed 50% of capacity. In order to determine average DTC selling price then we can equation **.5\\*1350 + .5\\*(DTC Price) = 1900**. PRPL indicated their average selling price per mattress was \\~1900.00, I found this in their s-3.\n\n\\-----------------------------------\n\n.5\\*1350 + .5\\*(DTC Price) = 1900=========== **DTC average price is 2450.00, 1350 is average Wholesale price.**\n\nDTC Margin is **\\~62% Estimated**\n\nWholesale Margin **\\~30% Estimated**\n\n\\----------------------------------\n\nHistorically, advertising costs have been about 30% of revenue.  I have been tracking advertisement for purple and from a TV cost standpoint, they have not increased their commercial count at all in the last three months. See link, PRPL is still only performing 125 commercials per day. This commercial rate has held steady for 6 months.\n\n[https://www.ispot.tv/brands/tqU/purple-mattress](https://www.ispot.tv/brands/tqU/purple-mattress)\n\n&amp;#x200B;\n\nI believe purple has increased their ad spend online but I believe it will be proportional to their new capacity on a unit basis.\n\nPreviously purple had 6 Machines of capacity and spent 38M in advertising, I believe they will spend (7/6)\\*38M which is 44M or roughly **15M per month. Just because revenue is up, doesn't mean they will spend more per unit- they are capacity constrained and that is terribly inefficient.**\n\n\\----------------------------------\n\n**The following table shows my best guesses on their major category costs. This includes the gross Margin and the other costs subtracted from the Gross Margin.**\n\n||April|May|June (Est)|Total Revenue net revenue effect|\n|:-|:-|:-|:-|:-|\n|Gross Margin from Wholesale|6M\\*30%|17.3\\*30%|20M\\*30%|$**13M**|\n|Gross Margin from DTC|56M\\*62%|71M\\*62%|55M\\*62%|$**112M**|\n|SG&amp;A Costs|(3.5)M|(3.5)M|(3.5)M|**($10.5)M**|\n|Research and Development|(1)M|(1)M|(1)M|**($3)M**|\n|Advertising|(15)M|(15)M|(15)M|**($45)M**|\n|Profit Non GAAP|\\-----------|\\-----------|\\---------|***66.5M or 1.23 EPS***|\n|Warrant Accrual||||**($35M)**|\n|**Profit GAAP Estimated**||||**$31.5M or .59 EPS**|\n\n\\---------------------------------------------------------------------------------------------------------------------------------------------------\n\nIf we used 66.5M, PRPL would report 1.23 EPS on an adjusted Basis.\n\nThe warrant Accrual will unfavorably push the EPS down on a GAAP basis and we will likely see something around .59 EPS. If they can achieve this for the next 4 quarters then in a years time there is a huge potential for stock increases based on the following P/E's.\n\n&amp;#x200B;\n\n||GAAP est.|Non GAAP Est.|\n|:-|:-|:-|\n|**EPS Annualized**|**$2.36**|**$4.92**|\n|Stock price assuming 8x P/E|$18.88|$39.36|\n|Stock Price assuming 12x P/E|$28.32|$59.04|\n|Stock Price assuming 15x P/E|$35.4|$73.8|\n|Stock Price assuming 20x P/E|$47.2|$98.4|\n\n&amp;#x200B;\n\nPeople may say that this is super inaccurate..... but if you look at the following cash statement then you will realize that PRPL has been generating more than 1M per day in cash for the last two months - that is absolutely insane.\n\n&amp;#x200B;\n\n[purple has generated 70M in cash in 60 days.](https://preview.redd.it/tgcjjyf2o3e51.jpg?width=1246&amp;format=pjpg&amp;auto=webp&amp;s=cb9d8d8e7fecae86e7e19b6a35b190d6b3ce23ba)\n\nMark my words, PRPL is going to be more profitable than TPX this quarter. TPX reported earnings of .68 EPS today on revenue of 665M. TPX is trading at 80+ per share. if purple reports a similar .68 EPS then it would be valued about 60% lower than TPX on an EPS basis. if purple posts EPS of \\~1 dollar then it would be undervalued as compared to TPX by about 80%.\n\n&amp;#x200B;\n\nI hope your NIPS are tender now. Hope this helps you understand why I believe PRPL to be so undervalued.",
        "subreddit": "wallstreetbets",
        "title": "PRPL Nurples- Why purple valuation just might make your NIPS hard - DD inside",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i0zaqh/prpl_nurples_why_purple_valuation_just_might_make/",
        "created": 1596190632.0
    },
    {
        "author": "ihasanemail",
        "created_utc": 1595373243,
        "id": "hvi7qo",
        "num_comments": 402,
        "num_crossposts": 0,
        "selftext": "Hi. I'm the guy from this thread .... \n\nhttps://old.reddit.com/r/wallstreetbets/comments/hredpg/30_million_to_19_million_to_46_million_its_been_a/\n\nI don't care if TSLA goes to $2,000 after earnings tomorrow. I'm not sticking around to find out, good luck to the call buyers that are still holding. I bought 400 shares in 50-100 share increments the second half of 2018, cost average was around $335. I started selling in increments last week, cost average around $1,550.\n\nI think I'm getting out at the best possible time, the company is valued at $100 billion more than Toyota. And it's valued more than every other major carmaker put together. I think the stock at $1,000 is priced for perfection, $1,500+ is just nuts considering the macroeconomic backdrop. Nonetheless, I like the company and hope it takes over the world. I'd like to buy a Model Y whenever my Camry kicks the bucket, maybe it will have the zero-cobalt million-mile battery in it by then. Maybe Elon will get the body paint and paneling issues worked out by then, both of my buddies who bought Model 3s the past two years have had issues with the paint, interiors and body paneling that's required warranty repairs by Tesla. I've ridden in a Model Y and the only thing I dislike is the crossbar in the back window that makes getting a clear look out of your rearview difficult.\n\nThe $480,000ish profit was all in taxable accounts unfortunately. So 20 percent long term capital gains tax, minus another 3.8 percent in net investment income tax. So $365,000 left over. No state income tax. Will probably spend it on more Goldman Sachs shares on the next pullback. I'll send a check to the IRS for the $115,000 next week when the last of my sales clear. No sense putting it in a HYSA until next year, out of sight and out of mind.",
        "subreddit": "wallstreetbets",
        "title": "Exited the last of my 2yo TSLA long position today. Not sticking around for earnings.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hvi7qo/exited_the_last_of_my_2yo_tsla_long_position/",
        "created": 1595402043.0
    },
    {
        "author": "rawrtherapy",
        "created_utc": 1595612073,
        "id": "hx64s4",
        "num_comments": 399,
        "num_crossposts": 0,
        "selftext": "The amount of new people I see “trading” more is absolutely bonkers now\n\nFrom friends on Instagram that have become “traders” and handing out advice to people on TikTok that are posting advice after making money on “Tesla” and calling themselves “Gurus” and shilling SPACs and penny stocks\n\nIf there is another big leg down is gonna absolutely DESTROY new traders and I’m completely fine with it\n\nSeeing a bunch of plebs posting about how they grew their account from $500 to $1000!!!! Is getting really fucking annoying.\n\nEspecially when they start handing out advice to their parents and losing all of their money\n\nIdk man I for one welcome the next leg down if it ever comes, tread carefully from not until pre-Elections\n\nShit is about to get really wonky\n\nTL;DR New traders annoying. Don’t take advice from anyone on IG or TikTok. Don’t buy courses. Inverse everyone on WSBs.",
        "subreddit": "wallstreetbets",
        "title": "If there is another leg down, new investors are going to get depressed and never come back",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hx64s4/if_there_is_another_leg_down_new_investors_are/",
        "created": 1595640873.0
    },
    {
        "author": "Usezforce",
        "created_utc": 1595449686,
        "id": "hw1g8u",
        "num_comments": 397,
        "num_crossposts": 1,
        "selftext": " [https://finance.yahoo.com/news/tesla-q2-2020-results-coronavirus-electric-vehicles-170323186.html](https://finance.yahoo.com/news/tesla-q2-2020-results-coronavirus-electric-vehicles-170323186.html) \n\nWelp, they did it. I bought my first shares of TSLA today and expected that to jinx earnings but as it turns out they're profitable. Guess the S&amp;P500 is likely to include Tesla at this point, what a world.",
        "subreddit": "stocks",
        "title": "TSLA profited in Q2...",
        "url": "https://www.reddit.com/r/stocks/comments/hw1g8u/tsla_profited_in_q2/",
        "created": 1595478486.0
    },
    {
        "author": "Pokerhobo",
        "created_utc": 1594411758,
        "id": "how6us",
        "num_comments": 396,
        "num_crossposts": 0,
        "selftext": "At close today, I finally hit $1M in gains for my TSLA calls.  It helped that I bought some more this morning for a quick 100% gain (that's the one highlighted automatically).  For those not familiar with how to read this table (not using RH to trade):  \n\n\n\\- The left side is the strike price and expiration  \n\\- Next is just today's gains  \n\\- Next is total gains  \n\\- Next is current value and number of contracts  \n\\- Last is how much it cost me\n\n[https://i.imgur.com/1XQoRav.png](https://i.imgur.com/1XQoRav.png)\n\nHopefully nothing crazy happens over the weekend.  My plan is to not close my near expiring ones til after earnings which I expect a profit.  Then I have some intended for S&amp;P500 inclusion.  My LEAPS are a ways off so will probably just hold onto those.",
        "subreddit": "wallstreetbets",
        "title": "$1M in TSLA call gains",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/how6us/1m_in_tsla_call_gains/",
        "created": 1594440558.0
    },
    {
        "author": "RichTannins",
        "created_utc": 1594068823,
        "id": "hmgab7",
        "num_comments": 395,
        "num_crossposts": 0,
        "selftext": "Not to get the fanbois all upset, but we are seeing something pretty peculiar with Tesla’s growth this year. You can try and justify it but at the end of the day it’s really hard to be rational about their price and value. Bubble/speculation/battery tech argument aside, if you bought anywhere between 300-750, and are still holding, what’s the goal? Are you holding for the long term? Closing at 1371, I’d have a really hard time not cashing my check and getting the F*** out.",
        "subreddit": "investing",
        "title": "If you bought Tesla in 2020 and are still holding after today, what’s your goal and why!?",
        "url": "https://www.reddit.com/r/investing/comments/hmgab7/if_you_bought_tesla_in_2020_and_are_still_holding/",
        "created": 1594097623.0
    },
    {
        "author": "TU_NYCE",
        "created_utc": 1593727308,
        "id": "hk6hcl",
        "num_comments": 394,
        "num_crossposts": 0,
        "selftext": "I know Papa Elon is in here and he will give everyone gold itt.\n\nWhat a fucking amazing TSLA rally this week. Elon is sending astronauts to space, the moon, Mars, AND retard's portfolios along with it. I bet against TSLA back in May and Elon whooped my ass for it. Never again did I touched TSLA... until now.  \n\n\nSince Tuesday and Wednesday, I was in and out of TSLA when it was around $1000. After realizing the potential upside of the delivery number's momentum and the pure koolaid power behind TSLA investors, I made the yolos of all yolos, around \\~800k on TSLA 7/2s.  \n\n\nI had 1100 7/2s that I paper handed which would've been 1000% gains but that's in the past. Yesterday at close, I was -20% on these because I bought high during the chase. I decided it's either going to be $0 or 1m and left my fate in Elon's hands.  \n\n\nBetted on 2 things:  \n1. SPY gaps up due to good unemployment numbers and because America wasn't gonna end the week red on the most patriotic weekend. TSLA gaps up with SPY.  \n\n\n2. I saw 1200 7/2s in the flow and gauged the market sentiment on StockTwits (gotta figure out what all the rest of the retards are doing).   \n\n\nThese 1200s were getting hit throughout the day all the way until closing for 50k - 200k amounts. I was already all in on my current positions so I didn't jump in these but out of all the flow, these stood out to me and I kept seeing comments about open at 1200, gonna be 1250 EOD...   \n\n\nWoke up this morning and SPY was $315, TSLA $1200. Jumped outta bed and took a cold shower to get this wonderful day started...\n\n&amp;#x200B;\n\nhttps://preview.redd.it/cfo8gwvwhi851.png?width=625&amp;format=png&amp;auto=webp&amp;s=0730a5cc3d2b09e8ba8f5f6c6d597b441b26658a\n\n  \nRH position, 310k on 1150 7/2. Netted 1.1m - 356% gains. I closed these out at the near top at $74/contract. Cost was $14.67/contract.  \n\n\n&amp;#x200B;\n\n[TSLA 1150c 7\\/2 +356&amp;#37; - 1.1m profit](https://preview.redd.it/363l24m3hi851.png?width=828&amp;format=png&amp;auto=webp&amp;s=88a9d5202537755d5a75c75b9e7711d165becb04)\n\n&amp;#x200B;\n\nMy 3 month RH chart. This chart tells the story of pure autism, persistence, and yolos. I started this game on 4/20 and got my first big gains on 5/1 with DFS puts. Right after that, I chased TSLA puts on the same day and took a -150k loss.  \n\n\nConstant ups and downs 4 times back and forth. DIS calls got me back up again only for the mouse to take it all back the next day. Then I moved on to BABA for ER only to get fucked by CHYNAH, not once, not twice, but THREE times.\n\nAt the very bottom, I was -700k in the hole (-72%)\n\nhttps://preview.redd.it/5mdgnpshii851.png?width=828&amp;format=png&amp;auto=webp&amp;s=e51cffa239edeff7091b7090c8e19adcf1179aab\n\n&amp;#x200B;\n\nTOS account. Last 500k all in.  \n\n\nhttps://preview.redd.it/vg9qazgyji851.png?width=994&amp;format=png&amp;auto=webp&amp;s=9378ee407f56bf1f35dd59fb6d1aa53932d4784d\n\n&amp;#x200B;\n\nAll in all, I went from all time lows of -1.7m to now +1.1m. I'm taking this 3 day weekend to journal all my past trades and reanalyze my process/risks. Papa Elon gave me a second chance and I'm gonna take a break... until MONDAY.  \nLessons learned? I've truly learned nothing valuable in terms of fundamentals. The losses and wins have taught me more about trader mindset and keeping myself in check after a huge loss and to fucking keep going back for more.   \n\n\nI've had FB weeklies of $250k expired, I've had calls I held that were -99% and came back from the dead, only to get greedy and lose it the next day. It's hard to explain but you get tunnel vision and your mind just goes blank when shit like this happens.   \n\n\nAlot of you will give me hate for playing recklessly with amounts of money like this and it's understandable. Everyone in here is going through their daily trading days on their own, refining their process, their mindset, and dealing with their losses and wins in their own ways.   \n\n\nMy perspective was really simple. I was ready to lose it all and already accepted that end of day yesterday. But I was ready to take the loss, regroup, and get back in after I pick myself back up. I've already done that 4 times in the past 2 months.  \n\n\nThe MAIN taking point of all my wins and losses for me was to TRUST MY GUT more and stay CONVICTED.  \n\n\n**Notable positions that had I held and stuck with would've been big gains.**  \n1. SPG 65c 7/17 - Had 100k in this and closed to break even, a few days later they were up 1000%. The play was on mall recovery, reopening.  \n2. FB 220 7/2, FB 230 7/2, FB 240 7/2 - Bought last Friday and opening Monday. Got too impatient and closed it for loss. FB rallied huge yesterday. The play was FB was oversold from ads boycotting and will rally back up.\n\n3. SHOP 800c 7/17 - 100k in, sold for 30k profit the next day. The play was SHOP is pure retard strength and every mom and pop retailer is on e-commerce. (I use SHOP for my e-commerce biz)  \n\n\nThe key lesson in these 3 were that I had the right idea but no follow up plan.   \n\n\n  \n**My advice to you retards:**  \n\n\nNEVER. GIVE. UP.   \n\\- If you are down big, step away and regroup.  \n\\- Analyze what went wrong and what went right.  \n\\- Build a checklist for your process to keep you on the right path.  \n**- IF IT IS GOOD ENOUGH TO SCREENSHOT. IT IS GOOD ENOUGH TO LOCK IN GAINS.**  \n\n\nHave a good 4th of July weekend all, cya Monday!  \n\n\ntldr: I'm retarded and Papa Musk saved me from -1.7m to +1.1m. Just placed 2 orders for Tesla X + Cyber truck.  \n\n\n**SEC can suck Elon's CAWK.**  \n**IRS, fuck you too!**",
        "subreddit": "wallstreetbets",
        "title": "THANK YOU PAPA ELON! ~3m GAINS on TSLA - From -1.7m to +1.1m total",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hk6hcl/thank_you_papa_elon_3m_gains_on_tsla_from_17m_to/",
        "created": 1593756108.0
    },
    {
        "author": "trouval",
        "created_utc": 1596172029,
        "id": "i11olu",
        "num_comments": 393,
        "num_crossposts": 0,
        "selftext": "I'm going to do all you retards and wanna be autists a real solid and save you/make you tendies! Scroll down half way if you just want to know why its down 10% because you're all impatient sh\\*ts.  \n\n\nOPKO reported these numbers today:\n\nQ2 GAAP EPS of $0.05 beats by **$0.13.**\n\nRevenue of $301.2M (+33.0% Y/Y) beats by **$71.72M.**\n\nThe EPS beat of $0.05 is VERY bullish and here's why. \n\nhttps://preview.redd.it/hvcl5azag4e51.png?width=820&amp;format=png&amp;auto=webp&amp;s=03d8d703aae4a1dad5b1973fa3a3d7ed3c505202\n\nOPK was not expected to be profitable until the back half of 2021. The fact that they are now profitable in Q2 and beat by $0.13 is BIG. Obviously a 33% topline is crushing it. I'm not even going to talk about how they produce the fastest results within 72 hours or all the major sports contracts they landed because if you don't know about that and asking \"WTF is happening?\" you deserve to lose your tendies. But what you probably did not know were all the contracts they landed with schools, universities, and the CDC. Here's the CEO word for word:\n\n***\"In addition, we have contracted with several colleges and universities to provide testing of students as they return to school this fall. Recently, the CDC awarded BioReference an indefinite delivery, indefinite quantity contract to provide antibody testing, to determine COVID-19 seroprevalence across the country. We will provide results with key demographic information and analysis in collaboration with the CDC for the next four months.\"***\n\n**\"During the second quarter, we agreed to divert significant resources for nursing home employees due to the crisis in New York.\"**\n\nWhy would you need to divert resources if they weren't operating at max capacity already? You're obviously getting WAY more orders than you can meet. Oh and guess what? They're **DOUBLING** their testing capacity. You autists heard me, **DOUBLE.** That $0.05 EPS profit, will easily repeat in Q3 earnings. Oh what else? They are currently using tests from other companies but have developed their own testing kits that is awaiting FDA approval to further cut costs. Even you can figure out what that means for profits.\n\n&amp;#x200B;\n\nNow that the DD is out of the way, **WHY IS IT DOWN 10% AH?!?!**\n\n**1st - Look at OI and Volume on their call options**\n\n[That's a shit ton of calls @ $5 - $7](https://preview.redd.it/hkld5ozpi4e51.png?width=787&amp;format=png&amp;auto=webp&amp;s=7036d63930a3f9f85f130b974fd387fc950d27fe)\n\nMM would have to pay out a WHOLE lot if this stock went to $8, which it should've easily. They have incentives to keep prices pinned at $6. This is EXACTLY what they did last week for expirations but no one gives two shits because there were no earnings.\n\n**2nd - Check out the spike in short volume ratio**\n\n[50&amp;#37; short interest on earnings day!](https://preview.redd.it/242mihicj4e51.png?width=613&amp;format=png&amp;auto=webp&amp;s=5d08922cea553122890e6272de53e46a4d2193c7)\n\nThe short volume ratio was at its highest of 50% of all volume. The current short interest float is \\~34% as of 7/15. Shorts have a HUGE incentive to manipulate prices down so they can cover their asses when all you retards panic sell which half of you all did already. If you were watching price action, prices initial rose &gt; $6 and gained close to 4% before plummeting to sub-$5s and all these tweets and posts popped up asking WHY!??!\n\n**3rd - AFTER HOUR IS LOW VOLUME! EASY TO MANIPULATE A $6 STOCK**\n\n[Afterhour volume is at 800K vs 32MM 10 day average](https://preview.redd.it/5oaen2mfk4e51.png?width=1134&amp;format=png&amp;auto=webp&amp;s=335a46cb46a687e526025f5dfab7abed7173731c)\n\nThat spike down was only 800K volume, a fraction of the daily 32M 10 day average volume. What does this mean? There is a 40% short interest float on a stock that clearly beat with strong guidance and high profitability. This is **EASILY** a $10 stock. You bet your autist ass that this is going to get SQUEEZED SO HARD to a minimum of $10 at open. If this opens below $6 and you still haven't bought more, you're truly an autist and godspeed.\n\n&amp;#x200B;\n\n**TLDR; OPK subjected to market manipulation. Short squeeze imminent at open tomorrow. Buy if under $6.5 for squeeze to $10.**\n\nPS. I haven't really posted much on reddit but thought I'd be the saviour to your tendies. Share and enjoy!",
        "subreddit": "wallstreetbets",
        "title": "OPK $0.15 surprise EPS beat, down 10% AH EXPLAINED. DD INSIDE!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i11olu/opk_015_surprise_eps_beat_down_10_ah_explained_dd/",
        "created": 1596200829.0
    },
    {
        "author": "iAmbitionX",
        "created_utc": 1595527290,
        "id": "hwkjsh",
        "num_comments": 390,
        "num_crossposts": 0,
        "selftext": "Some of you on the discord server may remember me shilling gold and silver with my 400k portfolio in LEAPS months ago. You guys called me a boomer for buying gold and silver - what a short-sighted opinion now that we look back at it ay? Gold and silver's bull run is just beginning with a round bottom technical signal in gold and a multi-year accumulation on silver with it being 60% away from ATH. The only way to become protected in the upcoming equity crash/flat lining will be to stack your dollars in precious metals. Opening any position in LEAPS in either metals in a med-long term expiry will protect and grow your gains despite the upcoming default/credit crisis and collapse of the dollar. You have been enlightened.\n\nTLDR: BALLS DEEP IN GLD AND SLV CALLS. IF YOU HAVE BIG DICK DO GDX AND ROLL OVER SLV CALLS WEEKLY\n\nP.S BTW YOU FUCKERS SERVER MUTED ME FOR SHILLING GOLD/SILVER AT 1.5K/OZ and 14$/OZ RESPECTIVELY. FK U",
        "subreddit": "wallstreetbets",
        "title": "It's me. The precious metals guy",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hwkjsh/its_me_the_precious_metals_guy/",
        "created": 1595556090.0
    },
    {
        "author": "cbvasquez06",
        "created_utc": 1594384330,
        "id": "hoo40a",
        "num_comments": 382,
        "num_crossposts": 0,
        "selftext": "I’ve been paying close attention to people’s post and accounts. There are a lot of new accounts created to posting certain tickers, to get you to think many people are all on board on a particular stock. Beware of fake accounts, it looks like certain companies are hyping their stocks in forums like these. \n\nDo as you wish, but tread carefully.",
        "subreddit": "stocks",
        "title": "Beware",
        "url": "https://www.reddit.com/r/stocks/comments/hoo40a/beware/",
        "created": 1594413130.0
    },
    {
        "author": "hieplenet",
        "created_utc": 1594704660,
        "id": "hqvp6p",
        "num_comments": 381,
        "num_crossposts": 0,
        "selftext": "Start seeing a lots of these posts recently.\n\n&gt;\"I am buying MSFT? Is now good time?\"\n\n&amp;#x200B;\n\n&gt;\"I  just bought MSFT? Is it a mistake?\"\n\n&amp;#x200B;\n\n&gt;\"Should I sell TSLA now? Is it too soon?\"\n\n&amp;#x200B;\n\n&gt;\"I sold TLSA? When should I buy back?\"\n\nWondering why...I think some brokerage requires their users to post on reddit before submitting an order for some securities reasons...\n\nI am not so sure because my broker doesn't require me to post on reddit at all.",
        "subreddit": "stocks",
        "title": "is it possible to buy/sell stocks without posting on r/stocks ?",
        "url": "https://www.reddit.com/r/stocks/comments/hqvp6p/is_it_possible_to_buysell_stocks_without_posting/",
        "created": 1594733460.0
    },
    {
        "author": "HydroStinks_YT",
        "created_utc": 1593630230,
        "id": "hjgp0x",
        "num_comments": 380,
        "num_crossposts": 0,
        "selftext": "https://i.imgur.com/eD99IRO.jpg\n\nDisclaimer: I am fully aware that I am not inventing the wheel here. Millions of people use this strategy. This is simply a post to help out those bagholders out there who want to regain money fast or simply make quick gains. \n\nStep 1: Wake up early. My broker opens at 7:00 AM EST so I wake up at around 6. If you’re on Robinhood, wake up before it opens so you can prepare for your trades. \n\nStep 2: Eat breakfast and get mentally ready. There may be times where you need to watch your stock for an extended period of time and no one wants to do that on an empty stomach. Remind yourself why you’re trading. Do I want $100, $300, or $1000 dollars today? Set a goal. Don’t get greedy.\n\nStep 3: Head on over to - https://www.investing.com/equities/pre-market - For a Pre-Market Screener or    - https://www.investing.com/equities/top-stock-gainers - For a Market Day Screener \nClick the “Chg. %” tab to organize Tickers from greatest increased to least. \n\nStep 4: Analyze volume. Higher volume is usually a good sign. Supply and Demand leads to an increasement in price. Ignore any stocks that you see that have like 4k or 1.5k volume but have 150%+ gains. Those are weird stocks that some millionaire owns all the shares to. \n\nStep 5: Pick your stock. IT’S NOT ALWAYS BAD TO CHASE. You can pick that 100%+ stock just be careful and analyze the chart. Today I played $MYOS when it was 120% up and still made a great amount. Usually I’ll pick one of the top 5 most increased stocks I see on the premarket screener. \n\nStep 6: Analyze the chart. Has it been downtrending since 6 am after a 4 am lift off? Guess what? It’s not necessarily over. Round two will start soon when 7 am, 8 am, and 9 am buyers take over. Learn to read bull flags and double top patters. They will help you immensely.\n\nStep 7: Enter a trade either during a gap up or an uptrend. As you can see in the image, $MYOS formed two beautiful Bull Flags. I waited for the initial sell off to stop and joined in at 2.13. About 45 minutes later it had gone up to 2.77. That is a 30% increase. That’s all I need for the day and I am satisfied. \n\nStep 8: Evalutate how much gains you are willing to risk. As you can see from the chart, there was a “Double Top Pattern.” This indicates a sell off and downtrend. I saw this and exited my position. However, if I would’ve stayed for the ride, a second bull flag had formed and I could’ve gotten more gains.\nThese are the decisions you need make. Do I want to risk my gains for more? or am I happy with what I made today? Remember to be disciplined. Don’t gamble.\n \nThis is basically my strategy that I use every day and I find success always. It’s all about accepting that you may not get as much gains today as the other day and securing profits. Avoid buying at super high peaks because sell offs will scare you. Try to get in when you see a healthy upwards momentum or when it starts to uptrend. If you have any questions please ask them. It’s a bit difficult to explain everything on a reddit post. Have a great day and good luck with the trades.",
        "subreddit": "pennystocks",
        "title": "Easy Non-DD Required and Quick Gains Strategy for Beginners and Experienced Traders",
        "url": "https://www.reddit.com/r/pennystocks/comments/hjgp0x/easy_nondd_required_and_quick_gains_strategy_for/",
        "created": 1593659030.0
    },
    {
        "author": "namsilat",
        "created_utc": 1594702116,
        "id": "hqv5jq",
        "num_comments": 380,
        "num_crossposts": 0,
        "selftext": "Hello retards, it's me, your dad.\n\nI'm sorry I left, boys, that yoga teacher wasn't going to bang herself and your mom had gotten to be a nag about my whisky habit.\n\nIn lieu of raising you, I'm going to give you this. It will make you marginally better at trading.  You might actually end up making money, which is WAY better than having the sort of life long self worth having a loving and present father would have given you.\n\n\nThis post is going to be so fucking basic for you newfucks that we've got about T-minus 5 fucking seconds until some dude named Eggbert jumps on my dick about Laffer curves and tries to steal your fucking money by confusing you all his brain wrinkles.  Don't let him.\n\nThis shit isn't hard newfucks.  You don't need to be taken by surprise every time.  You don't need to get fucked on days like today. You don't need an degree.  You need three basic things.\n\n1. A CHART OF THE MOTHERFUCKING STONK IN QUESTION\n\n2. A WAY TO DRAW A LINE ON THAT CHART IN SOME MOTHERFUCKING WAY.  You can smear it with your shit, you can use a ruler. I don't care.  If you can draw a line, you can do this and not get fucked. I use TOS, which is way, way too hard for most of you to use at this point in your \"career\".  But have at it if you want to.\n\n3. THE ABILITY TO UNDERSTAND THAT ONCE YOU HAVE PURCHASED AN OPTION, YOU CAN STOP THE PAIN OR PLEASURE AT ANY TIME BY CONVERTING IT INTO A SPREAD.  More on this in a minute.\n\nAlright, my smoothbrained beauties.  You're still here. There is hope for you yet.\n\nTHIS, MOTHERFUCKERS, IS A CHART OF APPLE THIS MORNING.\n\nhttps://i.imgur.com/IHIykMX.png\n\nLook at it, it goes up and down.  Like your mom. Does she still have those cute dimples on her ass?  Maybe you're in a call on this stonk, like me, from the day before and you wake up feeling pretty fucking alright about your profits.  BUT STONKS SOMETIMES GO DOWN.  So here is what you need to do to know if that's going to happen.\n\nTake a line, and draw it between the low points on the chart, like this. (Jesus Christ I'm already tired of typing, why am I doing this.)\n\nhttps://i.imgur.com/X9RazHI.png\n\nLOOK AT THAT YOU SUPERCHROMOSOMAL DICKFUCKS!  It is a trend.  The lows are less low every time.  And the stock seems to bounce away from the trend line every time.  It will keep doing this, forever, because of thermodynamics or some shit until something external changes.\n\nThen, at the end of the line.  Something changes.  The low at the very end of the line is LOWER than the trend. \n\n\nhttps://i.imgur.com/dVY6YDu.png\n\n Now it's time to really pay attention Your tendies are might be close to done cooking.\n\nAnd what do you know, we IMMEDIATELY we get a new trend. (Holy fuck, I need a drink, how am I still typing)\n\nhttps://i.imgur.com/EDoly8O.png\n\nNow, if you're like me, and want to take profits wherever you can, this break from GOING UP to DOING SOMETHING THAT IS DIFFERENT THAN GOING UP is where you sell.  I watched the candles go downsies, waited for them to turn around and go upsies one more time, and sold at 398.75.\n\n\nLOOK AT THIS, WE ARE NOW FLAT FOR A WHILE.\n\nTwo things that could happen here.  \n\n1. We could start to go higher.\n\n2. We could also not start to go higher.\n\nIn this case, we went with number two.  Stonk did not always go up.\n\nhttps://i.imgur.com/08bOBeX.png\n\nAs you can see, a downtrend started at 9:41am my time.\n\nAt which point I posted this.\n\nhttps://i.imgur.com/a9OlP5y.png\n\nAnd a pure fucking genius posted immediately after.\n\nhttps://i.imgur.com/rttrKUU.png\n\nWho was right?  The chad 'tard, or the dude with the POWER OF CRAYONS?\n\nhttps://i.imgur.com/9AI5ksD.png\n\nOk, so now you have a very, very dim view of when a stock has changed from doing one thing, to doing something different.  It gets far more complicated, but this is a good start.\n\n\"BUT DAD!\" I hear your voice say.  I'm up and I did the thing and now I think it might go down, but I'm OUT OF DAY TRADES.\n\nCome here, you little shit.\n\nCloser.\n\ncloser.\n\n##SELL A MOTHERFUCKING CALL, DIPSHIT!\n\nGo to robinhood. Find your fucking option. and\n\n##SELL THE STRIKE RIGHT ABOVE IT ON THE SAME DATE\n\nWhat if you're one of my gay sons?\n\n##SELL THE PUT RIGHT BELOW IT ON THE SAME DATE\n\nI went to the fucking trouble, I don't know why I bother, of actually doing this today to illustrate it for you tards.  Here is what it looks like.\n\nhttps://i.imgur.com/K3fVuhB.png\n\nNow, MY GAINS ARE LOCKED IN. AND I DIDN'T DO A DAY TRADE.\n\nThere you go, my boys.  That's what I've got.\n\nIf you're up more than 80% in a month, come find me.  I'll teach you how to work on a muscle car, we can get into a fist fight and patch things up.  Tell your mom I still think about her sometime when I choke out the population paste.",
        "subreddit": "wallstreetbets",
        "title": "Options trading for retards who want to not lose money all the time.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hqv5jq/options_trading_for_retards_who_want_to_not_lose/",
        "created": 1594730916.0
    },
    {
        "author": "Start155",
        "created_utc": 1595545379,
        "id": "hwq74h",
        "num_comments": 379,
        "num_crossposts": 0,
        "selftext": "Today was bad, I mean I had bad days in past but today was a wake up call. I opened a brokerage account in last week of April and moved about 47K from my savings account to buy covid hit stocks with a 2-3 years time frame in mind to get out. I did my research heavily on every company before buying any stocks. Some of them, such as $BA, $MGM, $DAL, $MRO etc. were doing just great while other were a little slow with some were decreasing in value but my profile were slowing getting bigger. Then I thought well I should get a margin account and buy some more stocks as my profile were growing way faster than typical margin interest. So, I got a margin account and bought some more stocks. Then I started doing some day trades here and there and making some more money. I was mainly targeting highly volatile stocks and doing just fine. Just within 5 weeks, I grew my portfolio from $47K to $85K.\n\nHere is my balance history as of yesterday [https://imgur.com/a/dx1FiSJ](https://imgur.com/a/dx1FiSJ)\n\nI thought and decided on June 8 that I would make it to 100K and then get out. But, then combination of a mini crush between June 8-11 and some bad day trade caused my account to decrease to 62K. It was an upsetting week. I was chasing to bring my account value to back at 85K which cause me to trade emotionally and lost 9K more. I was at 53K in third week of June.\n\nAfter that I set some strict rules about my percentage loss in a trade, in a day, maximum number of trades per day etc. It worked greatly and I was able to increase my account to 93.5K as of yesterday. It would actually be way more if I did not become greedy. During last 3 weeks, I did not lock profit of 27K on a single trade and only locked 10K on its way down and then lost 5K from that 10K chasing 2nd time. Another one I did not lock 11K and then locked only 1.5K. I made some very good trades such as 34K, 17K and 19K and some bad ones such as lost 13K today, did not lock 3.3K profit from a TSLA call yesterday and lost almost 13K, Another call being exercised by my broker and I sold all the shares at break even price. If I waited few more hours, I could have locked 20K at least. However, today my portfolio looks like this\n\n[https://imgur.com/a/On2ilLX](https://imgur.com/a/On2ilLX)\n\nMy account value is currently $66.8K, a 26K reduction in one day. I am certain that 16K out of my 25K unrealized loss will recover soon and that would bring back my profile to about 83K in few month. I have TSLA stocks in my portfolio and I think they will grow fast in next 12 months if it's being included in S&amp;P 500 index. I set price alerts for below/above for my exit prices for each and every stocks and decided to not fuck around with day trades and options any more because day trading is extremely stressful and chance of being emotional after huge loss/gains are very high, at least for me. Good thing is I learnt a lots of new stuffs about stocks and stock market in last 3 months. I am grateful that I am getting out of trading with a little profit as well.\n\nThanks for reading this.",
        "subreddit": "wallstreetbets",
        "title": "Profile is down by 27K in a single day with 13K realized losses. I quit.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hwq74h/profile_is_down_by_27k_in_a_single_day_with_13k/",
        "created": 1595574179.0
    },
    {
        "author": "blindgraysquirrel",
        "created_utc": 1595182442,
        "id": "hu52ux",
        "num_comments": 379,
        "num_crossposts": 0,
        "selftext": "I’ve been to one Walmart location three times in as many weeks and all those times I’ve gone, their self checkout machines have been set to “Card Mode” only with no cashback allowed.\n\nMy thesis? They are gonna buy out Amazon in an all-cash deal and force Bezos to take a job as a manager with no upward mobility in the new business entity.\n\nIt could also be the machines are just broken, idk.\n\n\nPositions: SPCE &amp; ERIC 2022 calls",
        "subreddit": "wallstreetbets",
        "title": "Walmart ($WMT) is hoarding cash:",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hu52ux/walmart_wmt_is_hoarding_cash/",
        "created": 1595211242.0
    },
    {
        "author": "retupmocomputer",
        "created_utc": 1595457641,
        "id": "hw3v3b",
        "num_comments": 373,
        "num_crossposts": 0,
        "selftext": "The year is 2020 and JPOW’s nightmare is coming true. The on/off switch on his printer is malfunctioning and it’s currently spitting out fat stacks faster than he can count them. \n\nHe and the rest of the finance world has no idea where to put all these dollars so they somehow start seeping into stocks. \n\n“Hmm, that’s strange, we’re in the single worst economic crisis that has ever occurred and stocks are at all time highs. Must be a shift in outlook; I’ll buy more!” Says the ‘professional’ wall street analyst, wiping drool from the corner of his mouth as he hits the giant green “buy” button on the robinhood commercial user interface. He later updates his tesla price target to $2,000 based on the aftermarket movements today. \n\nBut JPOW knows what’s going on. This is the start of inflation. Soon enough he knows that he’ll have to raise interest rates. Images of December 2018 flash through his mind. Trumps angry words ring through his ears. Eventually he will have to practice some tightening and stock prices will collapse with any hint of rising interest rates or slowing printers. That’s why, even though stocks are being inflated now, they aren’t a safe place for your money since they will crash once the fed starts trying to out out the inflation fire. \n\nSo the inflation is confined to the stock market right now but soon enough if you keep printing money it’ll leak out into Main Street and real people will begin to see real inflation not just in assets but in normal consumer goods too. \n\nHow I plan to beat this? But as many real physical goods on as much leverage as I can. I am eyeing buying Multiple new properties with debt right now, I just bought a new cars, and, of course, lots of guns and ammo. Worst case scenario, I’m in debt up to my eyeballs just like every other American living the dream. But if real inflation actually hits the real economy I now have real assets With debt that suddenly became much less expensive to service. And these real assets have inherent value. They aren’t worthless slips of paper giving me the right to the earnings of some zombie company. They aren’t metal rocks that have no functional value except to ~~pedophiles~~ libertarians. They are real things that I can use and that other people will be able to use and they therefore have intrinsic value regardless of their price in Monopoly money. \n\nI’m a faggot, and these are my delights.\n\nEdit: for the people giving me shit about the cars thing: Imagine if you could buy a car for $1,000 1970 dollars and pay it off with 2020 dollars. Wouldn’t you do it everytime even though it’s a depreciating asset? It’s a useful tool that’ll last you 1-2 decades that you can get for essentially free if you could manage to buy it right before hyperinflation hits.",
        "subreddit": "wallstreetbets",
        "title": "Pro-tip: if you see inflation looming, buy a ton of physical assets on as much leveraged debt as possible.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hw3v3b/protip_if_you_see_inflation_looming_buy_a_ton_of/",
        "created": 1595486441.0
    },
    {
        "author": "Not_An_NSA_Employee",
        "created_utc": 1595349831,
        "id": "hvatu7",
        "num_comments": 372,
        "num_crossposts": 0,
        "selftext": "Bought some calls last week sub $202, but another one yesterday, and bought 2 more today when it went down quite a bit. Going to diamond hand this shit into next week and hope it doesn't pull a Netflix. Who else is holding? \n\nPlays: \n$205c 9/18\n(2)$225.5 8/14\n$227.5 8/21",
        "subreddit": "wallstreetbets",
        "title": "Jacked to the tits in MSFT calls. Who is holding through ER?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hvatu7/jacked_to_the_tits_in_msft_calls_who_is_holding/",
        "created": 1595378631.0
    },
    {
        "author": "alexis_1031",
        "created_utc": 1594411647,
        "id": "how5o1",
        "num_comments": 368,
        "num_crossposts": 0,
        "selftext": "So today, Tesla has risen to $1,500 a share. It was around a month ago that they were trading @ 990 dollars a share. Why do you think this is happening? Is this pure hype from investors who view Elon as something more than a CEO. TSLA isn't even profitable and can be taken out by other car companies, should they make an effective electric car. Are we seeing a bubble swelling before it pops.",
        "subreddit": "investing",
        "title": "What is happening with TSLA?",
        "url": "https://www.reddit.com/r/investing/comments/how5o1/what_is_happening_with_tsla/",
        "created": 1594440447.0
    },
    {
        "author": "chazmcr",
        "created_utc": 1594510066,
        "id": "hpk4m4",
        "num_comments": 368,
        "num_crossposts": 0,
        "selftext": "University of Houston developed an air filter that kills 99.8% of covid19 on a single passthrough... the filter  uses nickel foam and its heated... this development just broke a few days ago, its clinically proven... does anyone have any ideas what producer we might buy into to capitalize on this if it goes nationwide?",
        "subreddit": "wallstreetbets",
        "title": "UNIVERSITY OF HOUSTON developed an air filter that kills 99.8% of covid",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hpk4m4/university_of_houston_developed_an_air_filter/",
        "created": 1594538866.0
    },
    {
        "author": "TrappedInAWaffle",
        "created_utc": 1594080820,
        "id": "hmjvzi",
        "num_comments": 367,
        "num_crossposts": 0,
        "selftext": "There's a new order that in summary, sends international students back home if their classes are online this fall. This is unjust as some live in an opposite timezone, and when classes are 3pm here, it would be 3am there. Hard link right here, but feel free to discuss your thoughts on how this could impact the market.  \n\n\n [https://www.ice.gov/news/releases/sevp-modifies-temporary-exemptions-nonimmigrant-students-taking-online-courses-during](https://www.ice.gov/news/releases/sevp-modifies-temporary-exemptions-nonimmigrant-students-taking-online-courses-during)",
        "subreddit": "StockMarket",
        "title": "RIP to college towns",
        "url": "https://www.reddit.com/r/StockMarket/comments/hmjvzi/rip_to_college_towns/",
        "created": 1594109620.0
    },
    {
        "author": "AKartikeya",
        "created_utc": 1595144496,
        "id": "htws5h",
        "num_comments": 363,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "never watched it before :\\",
        "url": "https://i.redd.it/5syf1sovprb51.jpg",
        "created": 1595173296.0
    },
    {
        "author": "Admiraloftittycity",
        "created_utc": 1595300394,
        "id": "huzm4z",
        "num_comments": 359,
        "num_crossposts": 0,
        "selftext": "My portfolio may not consist of 100's of shares of each stock. It may not be thousands of dollars. But i made a few good moves last Friday and my gf doesn't really care so I figuered I'd post it here. Positions are included. Followed some advice off a guy to buy uber calls worked out pretty well.\n\n(Link: http://imgur.com/gallery/AABEHGj )\n\nEDIT: Thanks for the overwhelming support guys, and for everyone who's asking, I use Robinhood.",
        "subreddit": "stocks",
        "title": "Exciting day",
        "url": "https://www.reddit.com/r/stocks/comments/huzm4z/exciting_day/",
        "created": 1595329194.0
    },
    {
        "author": "DullHall7",
        "created_utc": 1595512775,
        "id": "hwg4up",
        "num_comments": 354,
        "num_crossposts": 0,
        "selftext": "Hello from the UK.\n\nI will make this short and sweet,hopefully. So I want to know if anyone feels the same way. Cutting a long story short and this does make me cringe a little saying this I am a full time 'trader' of sorts. I am not a day trader I swing trade tech stocks and invest heavily in renewable energy, the implementation of 5G automation electric/self driveing cars, bio tech. That's my thing. I would like to say my portfolio was built on blood sweat and tiers but I would be lieing, I rid the bitcoin bull from 2014 in a massive way. Then got lucky again investing in tech mainly Amazon and telsa the last week few months have been mega! \n\nSo getting to my point now I am 25, i have a top end car range rover over finch, my apartment Is paid for I have around 11k a month coming in from swing trades and property rentals. But all I seem to find my self doing is drinking! I wake up walk to the local post office buy all the main papers, the times financial times and newyork post. I will scan though thease for at least 2 hours ( I think you can get ahead on swing trades on hand fulls of information in the columns) then I spend a an hour on reddit. Then by 2 o'clock I am usually in the pub watching price action on my phone checking my fill orders and sell orders. I feel like I just know the market and what's cheap and what's over bought 6 times out of 10 I tend to be right I play with tight stops and dont just hover over one stock all day! (Sorry about the poor spelling and grammar I am not really focusing to much busy checking stocks) so like I said I can be in the pub at 2 I will guzzle around 4 pint go home check reddit market news. Then I seem to sleep thats my life. \n\nEvery one thinks I am a drug dealer even family I cannit bare to tell anyone one what I do for a living it makes me feel uncomfortable. Then you do tell people you always feel that somone has to one up with you or your talking to the future warren buffet that no idea how the world of investing, finance or even how the stock market works. \n\nI dont know what this post was ment to be maybe a rant, maybe just me talking to my self does any one els feel the same way.",
        "subreddit": "StockMarket",
        "title": "I am successful but a bum!",
        "url": "https://www.reddit.com/r/StockMarket/comments/hwg4up/i_am_successful_but_a_bum/",
        "created": 1595541575.0
    },
    {
        "author": "marksizzle",
        "created_utc": 1594041178,
        "id": "hm7ed4",
        "num_comments": 354,
        "num_crossposts": 0,
        "selftext": "**Background**\n\nGlobalstar, Inc. is an American satellite communications company that operates a low Earth orbit satellite constellation for satellite phone and low-speed data communications. Meaning they do location services (GPS), data transmission (cellular), and sensor data (bluetooth low energy). Globalstar is partnered with Jeep and They have recently obtained and solely own some 5G spectrum, Band n53, for use with utilities. That last part is key.\n\n&amp;#x200B;\n\n**Timeline**\n\n\\*This DD/research is from the perspective of someone very familiar with the telecomm and connectivity industry. \\*\n\n***May 1st*** \\- Executive Order issued from White House and Trump Administration to ban use of technology and components from potential foreign adversaries (China, Russia, etc.) that involve our power grid and utilities in the hope to prevent cyber attacks. Device manufacturers will now look to leverage USA and friendly nation based technologies and components which means a boost for companies like Globalstar.\n\n**May 1st+** \\- News starts to spread through the electronics and connectivity industry about the executive order. Many people see the trend and precedent established by this order and are switching their technologies even if they are not involved with utilities.\n\n***May 18th*** \\- Directors and Executives see the writing on the wall and load up on 200k+ shares.\n\n***June 3rd -*** Globalstar rushes to announce their ST-100 chip which provides Cellular data, GPS, and Bluetooth, so they can capitalize on the market shift. Has FCC and IC certifications (USA and Canada). J\n\n***June 17th -*** Globalstar and Nokia publicly announce and demonstrate LTE Band n53 (part of the 5G spectrum) at Technology Conference with focus on utilities.\n\n***June 23rd to 28th -*** Globalstar goes on a hiring spree to design new modem(s) to capitalize on market shift and 5G spectrum. RF Front End Design Engineer, Firmware Engineer, Software Development Engineer.\n\n**July 7th - Earnings to be announced. This is based on previous quarter earnings being announced on May 7th.**\n\n**Financial**\n\nMultiple Form-4s filed on- June 4th\n\nDirector - Keith Cowan, picked up 50k shares at $0.3078 and owns 248,908 total shares\n\nVP of Finance - Tim Taylor, picked up 50k shares at $0.3078 and owns 1,508,112 total shares\n\nDirector - Benjamin Wolff picked up 50k shares at $0.3078 and owns 299,917 total shares Director -\n\nWilliam Hasler, picked up 50k shares at $0.3078 and owns 483,908 total shares\n\n\\*Upcoming Q2 Earnings Report  around July 7th. Previous quarter earnings looked solid and hoping to have the same or better in Q2. Other tidbits - Partnership with Jeep to have co-branded products to serve the rugged vehicle market. New influx of customers to track shipments during COVID-19 outbreak.\\*\n\n**Sources**\n\n***SEC Filings*** *-*\n\n[https://investors.globalstar.com/financial-information/sec-filings](https://investors.globalstar.com/financial-information/sec-filings) Globalstar -\n\n[https://investors.globalstar.com/](https://investors.globalstar.com/) Spot (subsidiary partnered with Jeep) -\n\n[https://www.findmespot.com/en-us/](https://www.findmespot.com/en-us/) Whitehouse Executive Order -\n\n[https://www.whitehouse.gov/presidential-actions/executive-order-securing-united-states-bulk-powe](https://www.whitehouse.gov/presidential-actions/executive-order-securing-united-states-bulk-powe) r-system/ WSJ Exec Order - [https://www.wsj.com/articles/u-s-moves-to-block-imports-of-some-power-equipment-11588346518](https://www.wsj.com/articles/u-s-moves-to-block-imports-of-some-power-equipment-11588346518) Band 53 LTE Approval (Utilities)\n\n[https://investors.globalstar.com/news-releases/news-release-details/globalstar-and-nokia-demonst](https://investors.globalstar.com/news-releases/news-release-details/globalstar-and-nokia-demonst) rate-band-53-private-lte-solution Jobs Posted on LinkedIn - [https://www.linkedin.com/company/globalstar/jobs/](https://www.linkedin.com/company/globalstar/jobs/) Most recent jobs posted on LinkedIn -\n\n[https://www.linkedin.com/jobs/search/f\\_C=8763&amp;f\\_TPR=r604800&amp;locationId=OTHERS.worldwide](https://www.linkedin.com/jobs/search/f_C=8763&amp;f_TPR=r604800&amp;locationId=OTHERS.worldwide) Partnership with Jeep -\n\n[https://investors.globalstar.com/news-releases/news-release-details/spot-announces-new-licensing](https://investors.globalstar.com/news-releases/news-release-details/spot-announces-new-licensing) \\-partnership-jeepr-brand Products with Jeep -\n\n[https://investors.globalstar.com/news-releases/news-release-details/spot-introduces-new-spot-x-je](https://investors.globalstar.com/news-releases/news-release-details/spot-introduces-new-spot-x-je) epr-edition-2-way-satellite TL;DR\n\n**Summary**\n\nGlobalstar is a USA based company that provides asset tracking, cellular data and voice, and more via it’s own satellite system. These are critical in commercial markets such as transportation, construction, and utilities where items are very expensive or communication is critical, but hard to access. There is an Executive Order from the White House to remove all foreign adversary telecom equipment from our utilities and power grid due to risk of cyber attacks. This puts Globalstar in a great position as they recently pushed out their new ST-100 product AND bought 5G spectrum (band n53) to be used in utilities applications (which they showed off at a conference this month with Nokia. They are partnered with Jeep and have an upcoming earnings report for Q2. Insiders own 64% of shares and have been loading up according to SEC filings. The future seems very bright for this one and I’m hoping we caught it early. Possible medium term play too if you want hold.",
        "subreddit": "pennystocks",
        "title": "$GSAT Why 5G w/Nokia, an Executive Order from the White House, and upcoming earnings makes GSAT a great play",
        "url": "https://www.reddit.com/r/pennystocks/comments/hm7ed4/gsat_why_5g_wnokia_an_executive_order_from_the/",
        "created": 1594069978.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1595232551,
        "id": "huhi5x",
        "num_comments": 353,
        "num_crossposts": 0,
        "selftext": "These daily discussions run from Monday to Friday including during our themed posts.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?sort=new&amp;q=Rate+My+Portfolio+-+r%2FStocks+Quarterly+Thread&amp;t=all&amp;restrict_sr=on).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion Monday - Jul 20, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/huhi5x/rstocks_daily_discussion_monday_jul_20_2020/",
        "created": 1595261351.0
    },
    {
        "author": "Zilllnaijaboy99",
        "created_utc": 1596043213,
        "id": "i04jf1",
        "num_comments": 352,
        "num_crossposts": 0,
        "selftext": " [https://www.bloomberg.com/news/articles/2020-07-29/kodak-stock-surge-attracks-43-000-robinhood-traders-in-24-hours?srnd=markets-vp&amp;sref=xTkgnLSf](https://www.bloomberg.com/news/articles/2020-07-29/kodak-stock-surge-attracks-43-000-robinhood-traders-in-24-hours?srnd=markets-vp&amp;sref=xTkgnLSf) \n\n&amp;#x200B;\n\n \n\nRobinhood day traders swarmed to Eastman Kodak Co. shares as the stock rallied 1,600% this week.\n\nAs of 11 a.m. in New York on Wednesday, 43,000 users of the investing app had added [Kodak](https://www.bloomberg.com/quote/KODK:US) to their accounts in some form over the past 24 hours, according to website Robintrack.net, which aggregates data from the brokerage but isn’t affiliated with it. The activity was 20 times more than the next most-popular stock, Actinium Pharmaceuticals Inc. Roughly 27,000 of the additions came over a four-hour span earlier Wednesday.\n\n \n\nThe growing presence of retail investors has become a popular markets narrative this year with zero commission fees and the potential for entertainment in a world largely without sports or gambling luring a new crop of traders. The impact they have on prices is unclear, but similar buying sprees have erupted in pockets of the equity market, including electric-vehicle firms, shares of companies in bankruptcy protection and increasingly pharmaceutical stocks. Earlier this month, Tesla Inc. attracted Robinhood traders at a pace of [10,000 an hour](https://www.bloomberg.com/news/articles/2020-07-13/ten-thousand-day-traders-an-hour-pour-into-tesla).\n\nKodak -- famous for its pioneering work in film photography -- surged 331% to $34.24 as of 11:34 a.m in New York. The rally began after it [won](https://www.bloomberg.com/news/articles/2020-07-29/kodak-shares-add-another-500-as-drug-shift-keeps-boosting-stock) a government loan to assist in the production of a coronavirus treatment.",
        "subreddit": "investing",
        "title": "Kodak Stock Surge Attracts 43,000 Robinhood Traders in 24 Hours",
        "url": "https://www.reddit.com/r/investing/comments/i04jf1/kodak_stock_surge_attracts_43000_robinhood/",
        "created": 1596072013.0
    },
    {
        "author": "namrock23",
        "created_utc": 1594533237,
        "id": "hppf3e",
        "num_comments": 350,
        "num_crossposts": 0,
        "selftext": "If Monday morning is green or flat I'm dumping my UVXY hedge and buying $5k on calls for stonks that may move this month. Here's what I'm thinking about but I can't afford all of them. What would you pick?\n\n5x $SPCE $20c 8/14, about $285 each: they're announcing the cabin design and some retards here have me dreaming that it will go to 30 again.\n\n1x $TSLA $2000c 7/31, about $58.50: because why the hell not. Is it likely to hit 2k? No. Will it make money? Maybe.\n\n5x $CHGG $90c 8/21, about $2.95 each: everyone is going to be distance learning, undergraduates are dishonest little shits, I hear Chegg is great for cheating.\n\n5x $EBAY $62c 7/31, about $2.13 each. Not really sure what's going on with eBay but I see a lot of cocky fuxkers on here hoping this play.\n\n5x $PTON $80c 8/21, about $3.95 each. I find this company anmoying but if they're really diversifying to treadmills and other fitness stuff then they will make bank off rich homebound professionals, since everyone with a $$ job is WFH well into 2021.\n\nAdvice welcome but forget that puts stuff, I'm a real man",
        "subreddit": "wallstreetbets",
        "title": "$5k to blow on long calls next week. Need extra retardation from y'all.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hppf3e/5k_to_blow_on_long_calls_next_week_need_extra/",
        "created": 1594562037.0
    },
    {
        "author": "HipNFire",
        "created_utc": 1595730424,
        "id": "hxz0z6",
        "num_comments": 349,
        "num_crossposts": 0,
        "selftext": "My autistic ass got eaten up by TSLA bringing my account to 28k-&gt;3k on earnings week. No, I did not buy naked calls or puts because IV has crushed me once before but I got put credit spreads 1590/1600p and TSLA decided to go lower after ER...I could of took my 20% nuggets and closed out but decided to take a loss with hopium.\n\nI need a juicy YOLO play for monday that can bring me to Valhalla,\nI want to turn this 3k into 30k you guys tell me what to do and i'll pull the trigger monday open. If I lose all of it then its back to flipping burgers at my local McDonalds and serving the nuggets to you WSBers.",
        "subreddit": "wallstreetbets",
        "title": "Need a juicy YOLO play for Monday",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hxz0z6/need_a_juicy_yolo_play_for_monday/",
        "created": 1595759224.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1595333442,
        "id": "hv68wk",
        "num_comments": 348,
        "num_crossposts": 0,
        "selftext": "If your question is \"I have $10,000, what do I do?\" or other \"advice for my personal situation\" questions. If you are going to ask how to invest you should include relevant information, such as the following:\n\n* How old are you?\n* Are you employed/making income? How much?\n* What are your objectives with this money? (buy a house? Retirement savings?)\n* What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know its 100% safe?)\n* What are you current holdings? (Do you already have exposure to specific funds and sectors?)\n* Any other assets? House paid off? Cars? Expensive significant other?\n* What is your time horizon? Do you need this money next month? Next 20yrs?\n* Any big debts?\n* Any other relevant financial information will be useful to give you a proper answer.\n\nPlease consider consulting our FAQ first - https://www.reddit.com/r/investing/wiki/faq \n\nBe aware that these answers are just opinions of Redditors and should be used as a starting point for your research. You should strongly consider seeing a registered financial rep before making any financial decisions!",
        "subreddit": "investing",
        "title": "Daily Advice Thread - All basic help or advice questions must be posted here.",
        "url": "https://www.reddit.com/r/investing/comments/hv68wk/daily_advice_thread_all_basic_help_or_advice/",
        "created": 1595362242.0
    },
    {
        "author": "Jakelexa1",
        "created_utc": 1595513511,
        "id": "hwgc20",
        "num_comments": 347,
        "num_crossposts": 0,
        "selftext": "Check my profile I’m the guy who told everyone when silver hit 12$ to buy the etf because the price was unrealistic and you couldn’t buy actually silver for that price, just a heads up, silver will continue to rise, this next wave of stimulus when announced will skyrocket silver and gold, it’s not about the gold to silver ratio and I kind of get the understanding that a lot of people here don’t know what money is, so real quick lesson, that helped me when I was starting off is “the dollar is a tool used to measure the value of any item, the more money printed the less valuable it becomes and it takes more of it to purchase a given item” this is reflected strongly in precious metals, whats happening now is not about demand but a weakening dollar. So I’ll say this again as I did in March. BUY SILVER CALLS LITERALLY ANY AT THIS POINT WILL DO IT. \n\nWe all know that some type of large stimulus WILL be passed, and as long as inflation is a risk silver will continue to rise. If you had bought October 16 25$ calls this morning they were worth .75$ at this moment they are worth 1.04$\n\nBuy silver!",
        "subreddit": "wallstreetbets",
        "title": "Hey I’m back, Silver guy.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hwgc20/hey_im_back_silver_guy/",
        "created": 1595542311.0
    },
    {
        "author": "Ironleg01",
        "created_utc": 1595439551,
        "id": "hvy845",
        "num_comments": 345,
        "num_crossposts": 0,
        "selftext": "I've been reading Ray Dalio's new online book and today new chapter came out: \nhttps://www.linkedin.com/pulse/big-cycle-united-states-dollar-part-2-ray-dalio I think it is the best one so far and has a lot of very interesting information in it. I would also strongly recommend reading all previous chapters as well. \n\nBelow are few excerpts from this chapter. This chapter was not really about how do you invest but I thought below are very relevant to what we go through now.\n\n&gt; I remember the devaluation of the dollar very well.  I was clerking on the floor of the New York Stock Exchange at the time.  I was watching on TV as President Nixon told the world that the dollar would no longer be tied to gold.  I thought, “Oh my God, the monetary system as we know it is ending,” and it was.  The next day was Monday.  When I got to work I expected there to be pandemonium, with stocks falling.  There was pandemonium all right, but stocks were rising.\n\n&gt; Then I looked into history and found that on the evening of March 5, 1933, also a Sunday, President Franklin Roosevelt had given essentially the same speech, doing essentially the same thing, which yielded essentially the same result over the following months (a devaluation, a big stock market rally, and big gains in the gold price).  \n\n&gt; As I looked further, I saw that it had happened many times before in many countries for the same reason—too much debt that needed money to ease the debt burden—with essentially the same proclamations by top government officials.  More recent cases that you might remember include the Fed announcing QE on November 25, 2008\n\n&gt; As a result of going off the gold-linked monetary system that constrained money and credit growth, there was a massive acceleration of money and credit, inflation, oil and commodity prices\n\n&gt; I also learned that the value of assets is the reciprocal of the value of money and credit (i.e., the cheaper money and credit are, the more expensive asset prices are) and the value of money is the reciprocal of the quantity of it in existence, so when central banks are producing a lot of money and credit and making it cheaper, it is wise to be more aggressive in owning assets.\n\n### Where the US Is in Its Big Cycle\n\n&gt; As previously explained the Big Cycle of rising and declining empires and their reserve currencies is a cycle that begins with a new world order that comes after a war in which a) there is an environment of peace, prosperity, and productivity in which debt growth is allocated well and sustainably (i.e., most debts are used productively to produce incomes that are greater than debt service so most debts are paid back), equities do well, and the society gets rich with individuals benefiting from the prosperity, though they benefit disproportionately, which eventually leads to b) excessive debt growth to finance speculation and over-consumption, which results in incomes being inadequate to service the debt, which leads to c) central banks lowering interest rates and providing more credit, which produces greater wealth gaps and more over-indebtedness, until d) over-indebtedness becomes so large and central banks lose their ability to create credit growth that produces self-funding debt growth (i.e., in which debts don’t accelerate relative to the incomes needed to service them without central bank subsidies), which e) produces severe economic downturns with large wealth gaps that lead to internal conflict and leads to f) lots of printing of money, big debt restructurings, and big wealth distributions via tax changes g) that create financial, economic, and political vulnerabilities for the leading power relative to emerging powers that lead to wars that define the winners and losers and produce the new world order. The stats seem to suggest that the US is roughly 75% through that cycle, +/- 10%. \n\n&gt; Most world powers that experience this cycle have their “time in the sun,” which is brought about by the uniqueness of their circumstances and the nature of their character and culture (i.e., they have to have the essential elements to work hard and smart, be disciplined, become educated, etc.) and have their decline phases continue through them slipping into relative obscurity.  Some do this decline traumatically, and some do it gracefully.\n\nIn few months he should release next chapter about future macro outlook and I can't wait. Again, if you are interested in macro analysis or even investing in general I highly recommend his books.",
        "subreddit": "investing",
        "title": "Money printing consequnces on asset prices from new Ray Dalio's book",
        "url": "https://www.reddit.com/r/investing/comments/hvy845/money_printing_consequnces_on_asset_prices_from/",
        "created": 1595468351.0
    },
    {
        "author": "ksigguy",
        "created_utc": 1595369499,
        "id": "hvh41d",
        "num_comments": 344,
        "num_crossposts": 0,
        "selftext": "I’ve seen multiple people here say they’re trading “naked options” when they just mean they bought a call or put. \nA naked option is when you SELL an option and you don’t own 100 shares of the stock you sold an option on. \nMy only advice here is if you’re not clear on terminology please don’t sell a naked option because that has the potential for you to lose an awful lot of money. \n\nI’ve seen someone ask for advice about their naked option at least three times in the last day or two when they were describing a call that they’d bought so it seems to be a term that isn’t clearly understood by some new options traders.\n\nEdit: I’ve had several people message me asking if I know where a good place to learn is, Investipedia is a good place, if you’re an audio-visual learner then YouTube videos where the person is using the same platform you are is always helpful.\n\nThink or Swim (ToS) has a paper trading platform that I wish I had used early on to try some of the more advanced methods that won’t leave you to blow up your account on a stupid yolo.\n\nUsing a platform that isn’t RH is always a good idea as well since they can have some pretty wide spreads and don’t show all of the data, like volume and last sale price that are important. Not helpful at all if you have a stock with almost no volume that makes a climb and you think you’ve hit the jackpot only to find you have no buyers. This is a big deal if things go sideways and you want to get out of a trade.",
        "subreddit": "options",
        "title": "“Naked options”",
        "url": "https://www.reddit.com/r/options/comments/hvh41d/naked_options/",
        "created": 1595398299.0
    },
    {
        "author": "Hohshua",
        "created_utc": 1594834717,
        "id": "hrs2ws",
        "num_comments": 344,
        "num_crossposts": 0,
        "selftext": "the recent surge of new users on this sub has led to a huge number of bagholders crying. let’s be honest, it’s noticeably becoming difficult to find good tickers on this sub as of lately. looks like most of you guys got burned by stocks that you ended up chasing. and now y’all are posting “bagholding stocks” or news that will hopefully get your stock pumped again. like cmon, let’s get this sub back to the energy it used to have with new tickers every other day and more DD. none of us want to see the same stocks over and over again only to see it keep going down. we’re here to make money, not donate.",
        "subreddit": "pennystocks",
        "title": "This sub is littered with bagholders",
        "url": "https://www.reddit.com/r/pennystocks/comments/hrs2ws/this_sub_is_littered_with_bagholders/",
        "created": 1594863517.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1595247446,
        "id": "huk88q",
        "num_comments": 343,
        "num_crossposts": 0,
        "selftext": "If your question is \"I have $10,000, what do I do?\" or other \"advice for my personal situation\" questions. If you are going to ask how to invest you should include relevant information, such as the following:\n\n* How old are you?\n* Are you employed/making income? How much?\n* What are your objectives with this money? (buy a house? Retirement savings?)\n* What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know its 100% safe?)\n* What are you current holdings? (Do you already have exposure to specific funds and sectors?)\n* Any other assets? House paid off? Cars? Expensive significant other?\n* What is your time horizon? Do you need this money next month? Next 20yrs?\n* Any big debts?\n* Any other relevant financial information will be useful to give you a proper answer.\n\nPlease consider consulting our FAQ first - https://www.reddit.com/r/investing/wiki/faq \n\nBe aware that these answers are just opinions of Redditors and should be used as a starting point for your research. You should strongly consider seeing a registered financial rep before making any financial decisions!",
        "subreddit": "investing",
        "title": "Daily Advice Thread - All basic help or advice questions must be posted here.",
        "url": "https://www.reddit.com/r/investing/comments/huk88q/daily_advice_thread_all_basic_help_or_advice/",
        "created": 1595276246.0
    },
    {
        "author": "Shrekthefatman",
        "created_utc": 1595970260,
        "id": "hzn1dg",
        "num_comments": 340,
        "num_crossposts": 0,
        "selftext": "AMD up 10% after earnings EOD as it should be\n\nTHIS POST WAS MADE BY #AMDGANG\n\n\n\nFUCK NVIDIA AND INTEL ALL U GAY CHIP PUSSIES CAN LIGMA NUTS AND SUCK ON DEEZ 🥜",
        "subreddit": "wallstreetbets",
        "title": "AMD GANG RISE UP 🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hzn1dg/amd_gang_rise_up/",
        "created": 1595999060.0
    },
    {
        "author": "DerpyMcOptions",
        "created_utc": 1593622794,
        "id": "hje7hj",
        "num_comments": 337,
        "num_crossposts": 0,
        "selftext": " So check this out, I've compiled some top tier info to share with all the autists here...\n\nWe have this company, Biocryst pharmaceuticals... They have been funded by govt grants 2x in the 10's of millions for 2 anti-viral therapies and have exclusive worldwide patent rights on their drugs...\n\nWhat do they do? They try to specifically create drugs for administration via the oral route of which 2 are anti-viral medications and 1 is on the market and the other is in clinical trials testing against yellow fever and COVID in Brazil but has already completed P1 trials for other virus studies with good results.\n\nThey have a NDA pending on a medication which reduces random swelling/inflammatory attacks (HAE) which randomly kills people. They also created an anti-viral drug and got EUA during the swine flu epidemic in the USA back in 2009. The 2 drugs I just listed should bump the price/share to $20 while they're currently trading at 5/share.\n\nNow here's the real kicker.... They have a Braod spectrum Anti-viral which works against 20 different virus families/types in the lab and looks to have stronger promise towards targeting Covid than Remdesivir (yea the mediocre anti-viral all over the MSM/news)... Check these links out for the info... recent news which is just more **Proof BCRX's drug is working as an effective anti-viral in the closest animal model to humans... (link below)**\n\n( [https://biocryst.gcs-web.com/news-releases/news-release-details/galidesivir-stops-zika-viral-replication-primate-model](https://biocryst.gcs-web.com/news-releases/news-release-details/galidesivir-stops-zika-viral-replication-primate-model) )\n\nAlso the Govt is trying to help them scale up production of this drug and it looks like their first big batch may come out early 2021.\n\nIf this drug releases results better than Remdesivir we might see BCRX hit $120-200/share if we were to generate the same market cap increase that Gilead experienced from Remdesivir...\n\nLinks below to see more info about Galidesivir:\n\n[https://www.biocryst.com/our-program/galidesivir/](https://www.biocryst.com/our-program/galidesivir/)\n\n[https://mstp.einstein.yu.edu/news/2319/einstein-invented-compound-now-being-tested-in-covid-19-clinical-trial](https://mstp.einstein.yu.edu/news/2319/einstein-invented-compound-now-being-tested-in-covid-19-clinical-trial)\n\n[https://www.globenewswire.com/news-release/2020/04/09/2014672/0/en/BioCryst-Begins-Clinical-Trial-with-Galidesivir-for-Treatment-of-Patients-with-COVID-19.html](https://www.globenewswire.com/news-release/2020/04/09/2014672/0/en/BioCryst-Begins-Clinical-Trial-with-Galidesivir-for-Treatment-of-Patients-with-COVID-19.html)\n\n**Now here's the really stupid thing!!! shorts are Trapped shorting to one another at the moment and have become trapped to the tune of 15% of the float (because tutes/insiders own 90% of the float) with no free shares in the current price range AI algos likely trapped trading to one another and Forbes launched a hit piece to try and get a hold of retail shares to reduce the size of the 🍆headed for the 🌈 🐻 AI's that got stuck short.**\n\nThis has potential to go to the moon like SpaceX rockets once their P1/2 clinical trial on Galidesivir releases (likely to be published this month or next). The P1 trial is being done in Brazil (and **the only clinical trial in Brazil I currently know of which leads me to believe it's the one Dr. Fauci mentioned he is awaiting results on in last week's run down in front of congress**)\n\nThe TL:DR BCRX currently at $5/share stock might turn into 20-120 by Dec because of trapped shorts along with release of Clinical trial data on Galidesivir combined with their new HAE medication going into pharmacies this yr... Go long my dudes and may the tendies print you into Valhalla! The play: Dec any current calls + hold shares.",
        "subreddit": "wallstreetbets",
        "title": "DD on hidden pharma company BCRX that may save us from death by COVID",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hje7hj/dd_on_hidden_pharma_company_bcrx_that_may_save_us/",
        "created": 1593651594.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1594627773,
        "id": "hqbdpl",
        "num_comments": 336,
        "num_crossposts": 0,
        "selftext": "These daily discussions run from Monday to Friday including during our themed posts.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?sort=new&amp;q=Rate+My+Portfolio+-+r%2FStocks+Quarterly+Thread&amp;t=all&amp;restrict_sr=on).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion Monday - Jul 13, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/hqbdpl/rstocks_daily_discussion_monday_jul_13_2020/",
        "created": 1594656573.0
    }
]