[
    {
        "author": "JPAMota",
        "created_utc": 1584418103,
        "id": "fjyu39",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "So in the last few days with markets dropping close to 30% there are clearly a few opportunities presenting once again!  \nOne of my biggest holdings right now is Hasbro HAS with a current 5% dividend yield a clear repositioning strategy within the entertainment business with Wizard of the Coast and Entertainment One. Additionally, being at almost 10 year lows and with the developed world now currently at the zero lower bond within the corporate market It is for sure one of my favorite stocks out there. Hasbro strategy is clearly making it stand out from the traditional struggling toy producer such as Mattel.  \n\n\nAdditionally, Autodesk ADSK and a few gaming stocks are some of my favorite picks!\n\n[https://youtu.be/Xk2VfbYyEHU](https://youtu.be/Xk2VfbYyEHU)",
        "subreddit": "investing",
        "title": "What to equities to buy with this Market Selloff? Clearly opportunities are showing up, apparently..",
        "url": "https://www.reddit.com/r/investing/comments/fjyu39/what_to_equities_to_buy_with_this_market_selloff/",
        "created": 1584446903.0
    },
    {
        "author": "Kant_sleep13",
        "created_utc": 1583757961,
        "id": "ffu3tj",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Good morning, Here's the watch list for today.\n\nGap Ups: DWT, ENZ, INO, KALA, TVIX, TZA, VIR\n\nGap Downs: ADSK, BABA, BIDU, LYFT, NFLX, ROKU, TSLA, TTD, ZM\n\nThe sky is falling and I'm not surprised . I talked about this last week, longing the TVIX if the market tanked and if the 200 DMA didn't hold it would set up the next move lower. Right now the spy is sitting in a support zone with more support at 272 area. This is an extremely large gap for the market so likely there will huge ranges and choppiness. Since there are so many stocks gapping with the market, not many of which have catalyst, I will be concentrating on ETF's and stocks with good daily charts with room for price to move. If you are new to trading, pay attention and remember cash is a position. Only take the best setups with the best charts. Good luck out there and be careful, Huge gap days are usually the hardest to trade.",
        "subreddit": "stocks",
        "title": "Stock Watch List March 9, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/ffu3tj/stock_watch_list_march_9_2020/",
        "created": 1583786761.0
    },
    {
        "author": "TriforceCaliban",
        "created_utc": 1583674481,
        "id": "ffclsf",
        "num_comments": 131,
        "num_crossposts": 0,
        "selftext": "\tAAPL\n\tACB\n\tADBE\n\tALLY\n\tAMD\n\tAMZN\n\tATVI\n\tBABA\n\tBABA\n\tMMM\n\tBAC\n\tBYND\n\tCCL\n\tCGC\n\tCMG\n\tCOST\n\tCRM\n\tCRON\n\tCZR\n\tDIS\n\tEA\n\tEBAY\n\tETSY\n\tFB\n\tGLD\n\tGOOGL\n\tGOOS\n\tHD\n\tINO\n\tINTC\n\tIQ\n\tJNJ\n\tJPM\n\tLULU\n\tLUV\n\tLVS\n\tM\n\tMCD\n\tMSFT\n\tMU\n\tNFLX\n\tNKE\n\tNVDA\n\tOPK\n\tPENN\n\tPINS\n\tPTON\n\tPYPL\n\tRCL\n\tROKU\n\tSBUX\n\tSHOP\n\tSNAP\n\tSPCE\n\tSQ\n\tSTMP\n\tTGT\n\tTLRY\n\tTLT\n\tTSLA\n\tTTD\n\tTWTR\n\tUBER\n\tULTA\n\tV\n\tWMT\n\tWYNN\n\nAny more to add?",
        "subreddit": "wallstreetbets",
        "title": "Current WSB Meme Stock List",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ffclsf/current_wsb_meme_stock_list/",
        "created": 1583703281.0
    },
    {
        "author": "SeriousPuppet",
        "created_utc": 1583555222,
        "id": "feq2j6",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "I have some long term holdings. I've trimmed down a little and have some cash. But I'm wondering if, instead of selling more of my AMZN, AAPL, etc... if I short sold say a few tech stocks like ADBE, CRM, CRUS,  etc... if that would essentially act as a hedge for my longs with the reasoning that if my tech longs go down then most likely other tech stocks will as well and I'd make money by shorting them as I'm losing money on the longs. \n\n(I realize that I could buy puts as well, but I have never done that yet and am not familiar with that even though I did just get an options account. But I'm wondering if shorting can essentially accomplish a similar task as I don't know if I have the time to learn options.)",
        "subreddit": "stocks",
        "title": "Is shorting stocks a good way to hedge in this environment?",
        "url": "https://www.reddit.com/r/stocks/comments/feq2j6/is_shorting_stocks_a_good_way_to_hedge_in_this/",
        "created": 1583584022.0
    },
    {
        "author": "Kant_sleep13",
        "created_utc": 1583501316,
        "id": "fedgtm",
        "num_comments": 41,
        "num_crossposts": 0,
        "selftext": "Good Morning. Here's the watch list for today.\n\nGap Ups: DRAD, JNUG/NUGT, NNVC, NVAX, TVIX\n\nGap Downs: AAPL, AOBC, BYND, CSCO, CY, DAL, FB, JPM, MSFT, NVDA, TSLA\n\nPossible Day 2 Runners: TDOC, ZM, INO\n\nCorona Virus Related stocks: AHPI, CODX, INO, LAKE, MRNA, NNVC, TDOC, VIR\n\nThe market is gapping down pretty big which usually makes for a tough trading day. With that being said, there are plenty of stocks gapping today and most are gapping with the market. Had I included them all, this list would be ridiculously large so I picked what I thought were the best. Many times stocks will bounce at the open on a large gap like today but due to the extreme nature of the move, and also the SPY not holding the 200 DMA yesterday, we could see some continued selling pressure.\n\nMost airline stocks are extremely oversold and very extended so I didn't add them to my list. Yesterday I mentioned if the market tanked that I would long the TVIX, you can see today why I made that statement yesterday and the TVIX trade worked. However today is a new day. I will be very patient today, and wait for patterns. Days like today it's easy to get chopped up. For now temporary support on the SPY at 285, next after that is the 282 - 280 area. Good luck, be patient and be careful out there.",
        "subreddit": "stocks",
        "title": "Stock Watch List March 6, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/fedgtm/stock_watch_list_march_6_2020/",
        "created": 1583530116.0
    },
    {
        "author": "ajfa",
        "created_utc": 1583420526,
        "id": "fdwgms",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Cisco seems to have hurt more than most tech stocks between the trade war and COVID-19 outbreak. Yet you'd think its products (especially videoconferencing-related, but also 5G rollout) would be more in demand than ever. See the arstechnica article slashdotted yesterday:   \n[https://arstechnica.com/information-technology/2020/03/cisco-pitches-in-to-coronavirus-relief-efforts-by-offering-free-webex/](https://arstechnica.com/information-technology/2020/03/cisco-pitches-in-to-coronavirus-relief-efforts-by-offering-free-webex/)\n\nAny insights on why to be more bearish than usual on this and other network-related tech? \n\nDisclosure: I have a small position (&lt;$2k) in this company.  \nThanks for perspective!",
        "subreddit": "StockMarket",
        "title": "What is the verdict on Cisco (CSCO)?",
        "url": "https://www.reddit.com/r/StockMarket/comments/fdwgms/what_is_the_verdict_on_cisco_csco/",
        "created": 1583449326.0
    },
    {
        "author": "HITLERMAHJONG",
        "created_utc": 1583349746,
        "id": "fdi5yj",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": " Stock: [Splunk](https://www.google.com/url?sa=i&amp;url=https%3A%2F%2Faws.amazon.com%2Fmarketplace%2Fseller-profile%3Fid%3D6a766d61-5a6a-4c97-83f4-8bfe02b74914&amp;psig=AOvVaw1-7xk35I1P7BNaNAo8EGdB&amp;ust=1583436087951000&amp;source=images&amp;cd=vfe&amp;ved=0CAIQjRxqFwoTCLjmnKDFgegCFQAAAAAdAAAAABAD)**(SPLK) - 152.18$**\n\nDirection: **Mildly Bullish**\n\n**Price Target:** **160$**\n\n**Type: Put Credit Spread**\n\n**Fundamental:** Splunk is a growth company simply for its 16 quarters of consecutive double digit growth. Splunk sports a very high, but not astronomical PE, with decent profitability and a consistent record of beating earnings guidance. The recent acquisition (6 month) of SignalFx gives them further footprint in the booming cloud computing sector. An additional note is an announcement of a DoD contract with some huge numbers on it. While I cannot explain its actual effects, I do believe this is a positive for Splunk.\n\n**Technical**: Priced below 20, 50 day averages and below 200 day moving average. MACD shows bullish convergence. RSI shows around 48, coming up from oversold. Options sentiments are very bullish in volume and bullish open interest. Implied movement is 9.1% or about 13.85$ Short interest is at 4.6%, with 5.6 days to cover. One thing to note, the ATM straddle is actually getting cheaper, with a tiny IV contraction. While not a strong signal, I believe this is bullish for Splunk, as contracting IV is not a normality in current macro environments. The skew to call side reinforces this idea.\n\n**Sentimental**: Splunk has been beating and raising for more than 4 years. This track record of growth and performance weights positively. Analyst sentiments are bullish with a higher price target than SPLK’s current price. Numerous partnerships with kings like AWS, CISCO, Accenture give Splunk a competitive moat. While not directly affected by the coronavirus, Splunk will need a massive win to command a big upward move. The main wildcard is the DoD deal updates, which can be a massive boost. Primary bear case is missing estimates and guiding lower.\n\n**Robinhood (3/4/2020) Less Fucky. Not using. Moving to Schwab this weekend.**\n\n**Put Credit Spread 3/13**\n\n**Buy 135 Put**\n\n**Sell 140 Put**\n\n**Everyone is into big data, cloud and becoming big brother without looking like big brother. Splunk is currently the leader in this sector and has minimal effects from current market fears**",
        "subreddit": "options",
        "title": "Splunk (SPLK) 3/4/2020 AMC - Splunk for everyone",
        "url": "https://www.reddit.com/r/options/comments/fdi5yj/splunk_splk_342020_amc_splunk_for_everyone/",
        "created": 1583378546.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1583064523,
        "id": "fbt6pb",
        "num_comments": 3211,
        "num_crossposts": 0,
        "selftext": "Please use this thread to discuss your portfolio, learn of other stock tickers, and help out users by giving constructive criticism.\n\nWhy quarterly?  Public companies report earnings quarterly; many investors take this as an opportunity to rebalance their portfolios.  We highly recommend you do some reading:  A list of [relevant posts &amp; book recommendations.](https://www.reddit.com/r/stocks/wiki/index#wiki_relevant_posts_.26amp.3B_book_recommendations)\n\nYou can find stocks on your own by using a scanner like your broker's or [Finviz.](https://finviz.com/screener.ashx)  To help further, here's a list of [relevant websites.](https://www.reddit.com/r/stocks/wiki/index#wiki_relevant_websites.2Fapps)\n\nIf you don't have a broker yet, see our [list of brokers](https://www.reddit.com/r/stocks/wiki/index#wiki_brokers_for_investing) or search old posts.  If you haven't started investing or trading yet, then setup your [paper trading.](https://www.reddit.com/r/stocks/wiki/index#wiki_is_there_a_way_to_practice.3F)\n\nBe aware of [Business Cycle Investing](https://eresearch.fidelity.com/eresearch/markets_sectors/sectors/si_business_cycle.jhtml?tab=sibusiness) which Fidelity issues updates to the state of global business cycles every 1 to 3 months (note: Fidelity changes their links often, so search for it since their take on it is enlightening).  [Investopedia's take on the Business Cycle](https://www.investopedia.com/articles/investing/061316/business-cycle-investing-ratios-use-each-cycle.asp) and their [video.](https://www.investopedia.com/video/play/business-cycle/)\n\nIf you need help with a falling stock price, check out Investopedia's [The Art of Selling A Losing Position](https://www.investopedia.com/articles/02/022002.asp) and their [list of biases.](https://www.investopedia.com/articles/stocks/08/capital-losses.asp)\n\nHere's a list of all the [previous portfolio stickies.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22Rate+My+Portfolio%22+-+r%2FStocks+Quarterly+Thread&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all)",
        "subreddit": "stocks",
        "title": "Rate My Portfolio - r/Stocks Quarterly Thread March 2020",
        "url": "https://www.reddit.com/r/stocks/comments/fbt6pb/rate_my_portfolio_rstocks_quarterly_thread_march/",
        "created": 1583093323.0
    },
    {
        "author": "macmus1",
        "created_utc": 1583082587,
        "id": "fbx144",
        "num_comments": 66,
        "num_crossposts": 0,
        "selftext": "I'm looking to find some online classes to learn all investment strategies, terminology and tools. \n\nAny ideas where i should start ?",
        "subreddit": "RobinHood",
        "title": "What is the difference between using RH and Fidelity account ? Basic advices.",
        "url": "https://www.reddit.com/r/RobinHood/comments/fbx144/what_is_the_difference_between_using_rh_and/",
        "created": 1583111387.0
    },
    {
        "author": "JT_Marlin",
        "created_utc": 1583118509,
        "id": "fc5mug",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "I don’t need the cash for 5 years. Knowing what you know today, what fund would you choose and when would you go in? I think there’s more downward pressure to come but the 5 year horizon makes me think just buy and check it in 5z",
        "subreddit": "investing",
        "title": "Need to park 100k in a fidelity no fee index fund.",
        "url": "https://www.reddit.com/r/investing/comments/fc5mug/need_to_park_100k_in_a_fidelity_no_fee_index_fund/",
        "created": 1583147309.0
    },
    {
        "author": "SureSpeech5",
        "created_utc": 1583126115,
        "id": "fc75xu",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "  \n\n**NASDAQ: IDEX - Ideanomics**\n\n**Capitalizing on the Electric Vehicle Revolution**\n\n***\"Focused on facilitating end-to-end solutions for the purchase of commercial electric vehicles &amp; developing next generation of financial services and Fintech products\"***\n\n**Key Investment Highlights**\n\n&amp;#x200B;\n\n* EV World Market Growth CAGR of 25.6%\n* Institutional Ownership\n* Stock Trades Below Book Value\n* Doing Business In the Largest Market in the World \n* Strong Experienced Management \n* 2020 Exponential Growth\n\n&amp;#x200B;\n\n**Overview**\n\n**Ideanomics, Inc.** trades on the Nasdaq under the symbol **IDEX** is based in New York, NY, USA, and has offices in Beijing, China.\n\nIdeanomics is a diversified company and primarily operates in the United States and Asia with reported assets of $164,763,676 along with revenues of $ 43,286,378 (Q-3 2019).\n\nIts main operating division is the Mobile Energy Group (MEG) which has been focusing on the expanding global electric-vehicle market.\n\nMEG specializes with companies that have commercial fleets that require by law and government zero emissions mandates to acquire new electric vehicles for their businesses. \n\nBeing the \"Amazon Platform\" for end to end sales &amp; services where enterprises can have full procurement, financing, insurance, batteries and energy along with subsidies for the adoption of electric commercial vehicles.\n\nOver the next 2 years in China more than 24 million commercial vehicles will be required to be replaced with electric vehicles. Ideanomics is well established and strategically positioned to gain a substantial market share of this EV business opportunity.\n\nIn Q3 2019, MEG’s China EV unit turned a profit with only 4,172 taxis sold and delivered, only a small fraction of the 1.2 million taxis available for EV adoption. \n\nIn August 2019, MEG  completed its first sales order of 11,000 e-Taxis for City of Chengdu, China, secured an order in Yunnan Province for 35,000 EV taxis and another order in Guilin, Guanxi Province for 2,300 EV taxis in November 2019.\n\nMEG operates through partnerships with China’s largest automakers, Build Your Dreams (China) (BYD) and Beijing Automotive Industry Co. (BAIC) as well as 24 transportation and 8 financial partners as an end-to-end solutions provider with vehicle procurement, financing, battery charging and energy management needs. \n\nIn July 2019, Ideanomics invested in Glory Connection Snd. Bhd, (Glory) a vehicle manufacturer based in Malaysia. Glory holds the only license granted to date for the manufacturing of electric vehicles in Malaysia and is in the process of setting up its manufacturing and assembly capabilities.\n\nIdeanomics’ FinTech division consist of its ownership of the Delaware Board of Trade (DBOT) an Alternative Trading System, Intelligenta a marketing AI solutions company that serves the Financial Services industry and a new FinTech Village, a 58-acre development site in West Hartford, Connecticut.\n\nThe fintech business division offers customized services based on best-in-class blockchain, AI and other technologies to mature and emerging businesses across various industries. The company is building a financial technology ecosystem through license agreements, joint ventures and strategic investments, which is referred to as Ideanomics’ “Fintech Ecosystem”.\n\n**Share Structure        Sept 30, 2019**\n\n**Market Cap**                  $88,849,138\n\n**Outstanding Shares**   162,076,044\n\n**Restricted Shares**         74,424,144\n\n**Unrestricted Shares**     87,651,900\n\n**52 Week Hi-lo**              $2.84-$0.43\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Assets** \\- $164,763,676\n\n**Revenues** \\- $ 43,286,378\n\n**Institutional Ownership: Fidelity, BlackRock, Vanguard, Charles Schwab, Barclay's Capital**\n\n&amp;#x200B;\n\n[http://www.ideanomics.com/](http://www.ideanomics.com/)",
        "subreddit": "pennystocks",
        "title": "Ideanomics &amp; Electric Vehicle Revolution",
        "url": "https://www.reddit.com/r/pennystocks/comments/fc75xu/ideanomics_electric_vehicle_revolution/",
        "created": 1583154915.0
    },
    {
        "author": "zorro_usa84",
        "created_utc": 1583111097,
        "id": "fc4177",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "I am a first time stock investor and have a brokerage account with Fidelity. I plan to buy a few shares of Google stocks in near future. On Feb. 28, Google stock price fluctuated between $1,269 and $1,339. When you buy a stock on a particular day, can you specify a price? For example, buy two shares of Google only at $1,275, because that is the price I am willing to pay. If someone happens to sell on that day and also is willing to accept this price, there would be a deal. If no one accepts this price, it would be no deal. This is my imagination how the stock deal works.\n\nI guess I am also asking the very fundamental question: how the stock price we see from the graph is determined?  What determines the deal price when (or after) an individual submits a buying or selling request? If the investing guru here could kindly offer explanations, it would be extremely helpful. Thank you.",
        "subreddit": "investing",
        "title": "Rookie question: Can you specify a price to buy stocks in Fidelity Brokerage account?",
        "url": "https://www.reddit.com/r/investing/comments/fc4177/rookie_question_can_you_specify_a_price_to_buy/",
        "created": 1583139897.0
    },
    {
        "author": "jamesbondc",
        "created_utc": 1583145823,
        "id": "fcab0q",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Guys has anyone figured out how to buy fractional stocks using Fidelity mobile app with limit price? For example if I want to buy Amazon at price $1900 for $100.",
        "subreddit": "investing",
        "title": "Fidelity fractional shares and limit orders",
        "url": "https://www.reddit.com/r/investing/comments/fcab0q/fidelity_fractional_shares_and_limit_orders/",
        "created": 1583174623.0
    },
    {
        "author": "fenyxdlex",
        "created_utc": 1583115679,
        "id": "fc519r",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "I’m 28 years old. I have a 401K (Fidelity) and stocks from work soon to vest. I’m searching for reading material to gain some knowledge. I have no idea where to begin. I don’t even understand the mix recommendation for my 401K. I appreciate any insight given.",
        "subreddit": "investing",
        "title": "Book recommendations on stocks and investing",
        "url": "https://www.reddit.com/r/investing/comments/fc519r/book_recommendations_on_stocks_and_investing/",
        "created": 1583144479.0
    },
    {
        "author": "BillNye69",
        "created_utc": 1583098792,
        "id": "fc15l2",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "I have $75k I’d like to put into a brokerage account, Fidelity or Vanguard. My question is, which is the better plan:\n\n1. Depositing all $75k into Fidelity but straight into a money market fund, and then DCAing (say 2k) from the money market fund each week into Fidelity S&amp;P500, in order to ask Fidelity for a signup bonus since I deposited all 75k at once into the brokerage account. (Not sure how much Fidelity would offer me—anyone know?). \n\n2. Just setting up DCA (same 2k) per week from my savings account into Fidelity S&amp;P500.",
        "subreddit": "investing",
        "title": "Worth lump summing $75k into brokerage money market to get signup bonus, or just DCAing from savings account?",
        "url": "https://www.reddit.com/r/investing/comments/fc15l2/worth_lump_summing_75k_into_brokerage_money/",
        "created": 1583127592.0
    },
    {
        "author": "smallstreetgains",
        "created_utc": 1583161053,
        "id": "fcd7vd",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "I was thinking Fidelity.",
        "subreddit": "RobinHood",
        "title": "So what broker are we switching to?",
        "url": "https://www.reddit.com/r/RobinHood/comments/fcd7vd/so_what_broker_are_we_switching_to/",
        "created": 1583189853.0
    },
    {
        "author": "obitookenobi",
        "created_utc": 1583121673,
        "id": "fc6aoq",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "What do you think is better approach to do a Roth IRA portfolio (given I am 30, single and newbie to all this)? I’d like to pick funds and not mess with them (much or at all). I know approach 1 might sound like the way to go, since at Fidelity, this Fund might re-adjust weights as time goes by (that’s what I hear). But I also like knowing the slices that are there in the portfolio and possibly investing in one more over the other at times.\n\n**Approach 1: Investing only in the Fidelity Freedom**® **Index 2055 Fund (Target date fund)**\n\nThis one target date fund comprises of:-\n\n* Fidelity Series Total Market Index Fund\n* Fidelity® Series Global Ex U.S. Index Fund\n* Fidelity® Series Bond Index Fund\n* Fidelity® Series Long-Term Treasury Bond Index Fund\n\n**Approach 2: Index funds - three fund portfolio**\n\n* US market: FSKAX or FZROX (I like FSKAX better)\n* International: FTIHX or FZILX (*IDK which is better. Thoughts?*)\n* Bonds: FXNAX\n\n**Approach 3: Go crazy with Index funds and do more DIY** \n\n* 30% in Domestic Stocks (FSKAX) \n* 15% in International Stocks (FSPSX) \n* 10% in Emerging Market Stocks (FPADX) \n* 15% in Real Estate Stocks (FSRNX) \n* 15% in U.S. Treasuries (FUAMX)\n* 15% in Fidelity Inflation-Protected Bond Index Fund (TIPS)\n\n**So, what is best? If Approach 2 or 3 then what re-adjustments are recommended.** \n\nThanks",
        "subreddit": "investing",
        "title": "Roth IRA portfolio with Fidelity - seeking suggestions.",
        "url": "https://www.reddit.com/r/investing/comments/fc6aoq/roth_ira_portfolio_with_fidelity_seeking/",
        "created": 1583150473.0
    },
    {
        "author": "SureSpeech5",
        "created_utc": 1583125165,
        "id": "fc6zer",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Will companies like Ideanomics have a good 2020 with increased revenues &amp; EPS with world EV sales growing 25.6% CAGR ?\n\n____________________________________________________________________\n\nNASDAQ: IDEX - Ideanomics\n\n \n\"Focused on facilitating end-to-end solutions for the purchase of commercial electric vehicles &amp; developing next generation of financial services and Fintech products\"\n \n \nKey Investment Highlights\n \n \n•\tEV World Market Growth CAGR of 25.6%\n•\tInstitutional Ownership\n•\tStock Trades Below Book Value\n•\tDoing Business In the Largest Market in the World \n•\tStrong Experienced Management \n•\t2020 Exponential Growth\n \n \nOverview\n \nIdeanomics, Inc. trades on the Nasdaq under the symbol IDEX is based in New York, NY, USA, and has offices in Beijing, China.\n \nIdeanomics is a diversified company and primarily operates in the United States and Asia with reported assets of $164,763,676 along with revenues of $ 43,286,378 (Q-3 2019).\n \nIts main operating division is the Mobile Energy Group (MEG) which has been focusing on the expanding global electric-vehicle market.\n \nMEG specializes with companies that have commercial fleets that require by law and government zero emissions mandates to acquire new electric vehicles for their businesses. \n \nBeing the \"Amazon Platform\" for end to end sales &amp; services where enterprises can have full procurement, financing, insurance, batteries and energy along with subsidies for the adoption of electric commercial vehicles.\n \nOver the next 2 years in China more than 24 million commercial vehicles will be required to be replaced with electric vehicles. Ideanomics is well established and strategically positioned to gain a substantial market share of this EV business opportunity.\n \nIn Q3 2019, MEG’s China EV unit turned a profit with only 4,172 taxis sold and delivered, only a small fraction of the 1.2 million taxis available for EV adoption. \n \nIn August 2019, MEG  completed its first sales order of 11,000 e-Taxis for City of Chengdu, China, secured an order in Yunnan Province for 35,000 EV taxis and another order in Guilin, Guanxi Province for 2,300 EV taxis in November 2019.\n \nMEG operates through partnerships with China’s largest automakers, Build Your Dreams (China) (BYD) and Beijing Automotive Industry Co. (BAIC) as well as 24 transportation and 8 financial partners as an end-to-end solutions provider with vehicle procurement, financing, battery charging and energy management needs. \n \nIn July 2019, Ideanomics invested in Glory Connection Snd. Bhd, (Glory) a vehicle manufacturer based in Malaysia. Glory holds the only license granted to date for the manufacturing of electric vehicles in Malaysia and is in the process of setting up its manufacturing and assembly capabilities.\n \nIdeanomics’ FinTech division consist of its ownership of the Delaware Board of Trade (DBOT) an Alternative Trading System, Intelligenta a marketing AI solutions company that serves the Financial Services industry and a new FinTech Village, a 58-acre development site in West Hartford, Connecticut.\n \nThe fintech business division offers customized services based on best-in-class blockchain, AI and other technologies to mature and emerging businesses across various industries. The company is building a financial technology ecosystem through license agreements, joint ventures and strategic investments, which is referred to as Ideanomics’ “Fintech Ecosystem”.\n \n \n \n \nShare Structure        Sept 30, 2019\nMarket Cap                  $88,849,138\nOutstanding Shares   162,076,044\nRestricted Shares         74,424,144\nUnrestricted Shares     87,651,900\n52 Week Hi-lo              $2.84-$0.43\n \n \n \nAssets - $164,763,676\nRevenues - $ 43,286,378\n \n \n \nInstitutional Ownership: Fidelity, BlackRock, Vanguard, Charles Schwab, Barclay's Capital\n\n\nhttp://www.ideanomics.com/",
        "subreddit": "stocks",
        "title": "Ideanomics &amp; Electric Vehicles ?",
        "url": "https://www.reddit.com/r/stocks/comments/fc6zer/ideanomics_electric_vehicles/",
        "created": 1583153965.0
    },
    {
        "author": "SureSpeech5",
        "created_utc": 1583159529,
        "id": "fccv6n",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " Will companies like Ideanomics grow in 2020 considering the markets and COVID 19 ???\n\n&amp;#x200B;\n\n**NASDAQ: IDEX - Ideanomics**\n\n**Capitalizing on the Electric Vehicle Revolution**\n\n***\"Focused on facilitating end-to-end solutions for the purchase of commercial electric vehicles &amp; developing next generation of financial services and Fintech products\"***\n\n**Key Investment Highlights**\n\n* EV World Market Growth CAGR of 25.6%\n* Institutional Ownership\n* Stock Trades Below Book Value\n* Doing Business In the Largest Market in the World\n* Strong Experienced Management\n* 2020 Exponential Growth\n\n**Overview**\n\n**Ideanomics, Inc.** trades on the Nasdaq under the symbol **IDEX** is based in New York, NY, USA, and has offices in Beijing, China.\n\nIdeanomics is a diversified company and primarily operates in the United States and Asia with reported assets of $164,763,676 along with revenues of $ 43,286,378 (Q-3 2019).\n\nIts main operating division is the Mobile Energy Group (MEG) which has been focusing on the expanding global electric-vehicle market.\n\nMEG specializes with companies that have commercial fleets that require by law and government zero emissions mandates to acquire new electric vehicles for their businesses.\n\nBeing the \"Amazon Platform\" for end to end sales &amp; services where enterprises can have full procurement, financing, insurance, batteries and energy along with subsidies for the adoption of electric commercial vehicles.\n\nOver the next 2 years in China more than 24 million commercial vehicles will be required to be replaced with electric vehicles. Ideanomics is well established and strategically positioned to gain a substantial market share of this EV business opportunity.\n\nIn Q3 2019, MEG’s China EV unit turned a profit with only 4,172 taxis sold and delivered, only a small fraction of the 1.2 million taxis available for EV adoption.\n\nIn August 2019, MEG completed its first sales order of 11,000 e-Taxis for City of Chengdu, China, secured an order in Yunnan Province for 35,000 EV taxis and another order in Guilin, Guanxi Province for 2,300 EV taxis in November 2019.\n\nMEG operates through partnerships with China’s largest automakers, Build Your Dreams (China) (BYD) and Beijing Automotive Industry Co. (BAIC) as well as 24 transportation and 8 financial partners as an end-to-end solutions provider with vehicle procurement, financing, battery charging and energy management needs.\n\nIn July 2019, Ideanomics invested in Glory Connection Snd. Bhd, (Glory) a vehicle manufacturer based in Malaysia. Glory holds the only license granted to date for the manufacturing of electric vehicles in Malaysia and is in the process of setting up its manufacturing and assembly capabilities.\n\nIdeanomics’ FinTech division consist of its ownership of the Delaware Board of Trade (DBOT) an Alternative Trading System, Intelligenta a marketing AI solutions company that serves the Financial Services industry and a new FinTech Village, a 58-acre development site in West Hartford, Connecticut.\n\nThe fintech business division offers customized services based on best-in-class blockchain, AI and other technologies to mature and emerging businesses across various industries. The company is building a financial technology ecosystem through license agreements, joint ventures and strategic investments, which is referred to as Ideanomics’ “Fintech Ecosystem”.\n\n&amp;#x200B;\n\n**Share Structure Sept 30, 2019**\n\n**Market Cap** $88,849,138\n\n**Outstanding Shares** 162,076,044\n\n**Restricted Shares** 74,424,144\n\n**Unrestricted Shares** 87,651,900\n\n**52 Week Hi-lo** $2.84-$0.43\n\n**Assets** \\- $164,763,676\n\n**Revenues** \\- $ 43,286,378\n\n**Institutional Ownership: Fidelity, BlackRock, Vanguard, Charles Schwab, Barclay's Capital**\n\n[http://www.ideanomics.com/](http://www.ideanomics.com/)",
        "subreddit": "investing",
        "title": "Electric Vehicle Growth 25.6% CAGR ?",
        "url": "https://www.reddit.com/r/investing/comments/fccv6n/electric_vehicle_growth_256_cagr/",
        "created": 1583188329.0
    },
    {
        "author": "kboogie82",
        "created_utc": 1583166964,
        "id": "fcep86",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Now that Robinhood is probably gonna be shut down how's fidelity?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fcep86/now_that_robinhood_is_probably_gonna_be_shut_down/",
        "created": 1583195764.0
    }
]