[
    {
        "author": "stormwillpass",
        "created_utc": 1584128765,
        "id": "fi5jtz",
        "num_comments": 73875,
        "num_crossposts": 0,
        "selftext": "Welcome back to another edition of the Weekend Discussion Thread. Elevventh trading week of the year has finished. \n\nAs a tradition that started fifty Fridays ago, the first three commenters in each Weekend Discussion Thread will get a flair if they don't already have one, a flair change, or to designate a flair for someone else (edit your comment).\n\nNotable earnings for the upcoming week are MIA.\n\nVerify dates on your brokerage platform in case of errors/changes.\n\n___\n\n[WallStreetBets book now available in paperback as well as kindle](https://old.reddit.com/r/wallstreetbets/comments/ewqu91/wallstreetbets_book_now_available_in_paperback_as/)\n___\n\n**New WallStreetBets Discord**: https://discordapp.com/invite/xpdbeGT\n\n___\n\nNew! [WSB Customer Service and Help Thread](https://old.reddit.com/r/wallstreetbets/comments/fe8nhu/wsb_customer_service_and_help_thread/)\n___\n\nAfter a volatile past couple weeks, some of these helplines might be helpful:\n\nNational Suicide Prevention Lifeline: 1-800-273-8255\n\nNational Problem Gambling Helpline: 1-800-522-4700\n\nSubstance Abuse and Mental Health Services Administration's National Helpline: 1-800-662-4357\n\nSuicide Prevention Lifeline Live Chat [available here](https://suicidepreventionlifeline.org/chat/).\n\nCrisis text hotline available by texting HOME to 741741 (686868 for Canada, 85258 for UK) for crises such as anxiety, suicide, depression, emotional abuse, bullying, self-harm, loneliness, etc.\n\n**You're valued and you matter.**",
        "subreddit": "wallstreetbets",
        "title": "Weekend Discussion Thread - March 13-15, 2020",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fi5jtz/weekend_discussion_thread_march_1315_2020/",
        "created": 1584157565.0
    },
    {
        "author": "stormwillpass",
        "created_utc": 1585339174,
        "id": "fq4eah",
        "num_comments": 46816,
        "num_crossposts": 0,
        "selftext": "Welcome back to another edition of the Weekend Discussion Thread. Thirteenth trading week of the year has finished. \n\nAs a tradition that started fifty-two Fridays ago, the first three commenters in each Weekend Discussion Thread will get a flair if they don't already have one, a flair change, or to designate a flair for someone else (edit your comment).\n\nNotable earnings for the upcoming week are MIA.\n\nVerify dates on your brokerage platform in case of errors/changes.\n\n___\n\n[WallStreetBets book now available in paperback as well as kindle](https://old.reddit.com/r/wallstreetbets/comments/ewqu91/wallstreetbets_book_now_available_in_paperback_as/)\n___\n\n**New WallStreetBets Discord**: https://discordapp.com/invite/xpdbeGT\n\n___\n\nNew! [WSB Customer Service and Help Thread](https://old.reddit.com/r/wallstreetbets/comments/fe8nhu/wsb_customer_service_and_help_thread/)\n\nNew! [WSB Moderator Application Thread](https://old.reddit.com/r/wallstreetbets/comments/fq22f5/wallstreetbets_moderator_application_thread/)\n\n___\n\nAfter a volatile past few weeks, some of these resources might be helpful:\n\nNational Suicide Prevention Lifeline: 1-800-273-8255\n\nNational Problem Gambling Helpline: 1-800-522-4700\n\nSubstance Abuse and Mental Health Services Administration's National Helpline: 1-800-662-4357\n\nSuicide Prevention Lifeline Live Chat [available here](https://suicidepreventionlifeline.org/chat/).\n\nCrisis text hotline available by texting HOME to 741741 (686868 for Canada, 85258 for UK) for crises such as anxiety, suicide, depression, emotional abuse, bullying, self-harm, loneliness, etc.",
        "subreddit": "wallstreetbets",
        "title": "Weekend Discussion Thread - March 27-29, 2020",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fq4eah/weekend_discussion_thread_march_2729_2020/",
        "created": 1585367974.0
    },
    {
        "author": "stormwillpass",
        "created_utc": 1583521895,
        "id": "feig6i",
        "num_comments": 30660,
        "num_crossposts": 0,
        "selftext": "Welcome back to another edition of the Weekend Discussion Thread. Tenth trading week of the year has finished. \n\nAs a tradition that started forty-nine Fridays ago, the first three commenters in each Weekend Discussion Thread will get a flair if they don't already have one, a flair change, or to designate a flair for someone else (edit your comment).\n\nNotable earnings for the upcoming week are MIA.\n\nVerify dates on your brokerage platform in case of errors/changes.\n\n___\n\n[WallStreetBets book now available in paperback as well as kindle](https://old.reddit.com/r/wallstreetbets/comments/ewqu91/wallstreetbets_book_now_available_in_paperback_as/)\n___\n\n**New WallStreetBets Discord**: https://discordapp.com/invite/xpdbeGT\n\n___\n\nNew! [WSB Customer Service and Help Thread](https://old.reddit.com/r/wallstreetbets/comments/fe8nhu/wsb_customer_service_and_help_thread/)\n___\n\nAfter a volatile past couple weeks, some of these helplines might be helpful:\n\nNational Suicide Prevention Lifeline: 1-800-273-8255\n\nNational Problem Gambling Helpline: 1-800-522-4700\n\nSubstance Abuse and Mental Health Services Administration's National Helpline: 1-800-662-4357\n\nSuicide Prevention Lifeline Live Chat [available here](https://suicidepreventionlifeline.org/chat/).\n\nCrisis text hotline available by texting HOME to 741741 (686868 for Canada, 85258 for UK) for crises such as anxiety, suicide, depression, emotional abuse, bullying, self-harm, loneliness, etc.",
        "subreddit": "wallstreetbets",
        "title": "Weekend Discussion Thread - March 6-8, 2020",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/feig6i/weekend_discussion_thread_march_68_2020/",
        "created": 1583550695.0
    },
    {
        "author": "Beartrap86",
        "created_utc": 1584031814,
        "id": "fhje25",
        "num_comments": 1776,
        "num_crossposts": 0,
        "selftext": "I'm 33. I was working during the 2008 crash. This seems worse. But I learned a lot and you autismos should listen up:\n\n1. The put money is raining right now so load up. But it's getting worse everyday as premiums get higher. Don't hold over night unless you got long dated exps. And don't go full retard right now and sell calls, we will have big bounces to come. \n\n2. Max your fucking 401ks. Just keep fucking buying. Bathe in red ink. You will love it. In 2030 these prices will look ridiculous. I'm still not below where I bought in during the last crash and we got more pain to go. \n\n3. Use the fucking put money to go long on cheap ass blue chip stonks and you will retire young. This opportunity won't last forever.\n\n4. Money is mostly bullshit, wash your fucking hands and take precautions.\n\n5. Fuck you guys for finally winning.",
        "subreddit": "wallstreetbets",
        "title": "Some advice from the old fucks",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fhje25/some_advice_from_the_old_fucks/",
        "created": 1584060614.0
    },
    {
        "author": "twitterisawesome",
        "created_utc": 1584753914,
        "id": "fm6vsz",
        "num_comments": 1411,
        "num_crossposts": 0,
        "selftext": "You people sound ridiculous. We've had a bull market for 11 years and now after a bear market for 1 week, you're already asking \"are we there yet?\" when it comes to the bottom. \n\nThis is not a dip. This is not a dream. This is the new reality. The market going down is the new normal. \n\nAnd it will be this way for several months at least.\n\nThe distance that the markets have so quickly fallen speaks not to how close we may currently be to a bottom but how far we may ultimately end up falling.",
        "subreddit": "investing",
        "title": "For people asking if we are near the bottom, stop. The bear market isn't even one week old yet.",
        "url": "https://www.reddit.com/r/investing/comments/fm6vsz/for_people_asking_if_we_are_near_the_bottom_stop/",
        "created": 1584782714.0
    },
    {
        "author": "a1minneapolis",
        "created_utc": 1585232927,
        "id": "fpcf7r",
        "num_comments": 1391,
        "num_crossposts": 0,
        "selftext": "Anyone else not buying the jump in stocks over the last few days? Unemployment numbers will continue to jump.  Everything I am hearing is the state systems are down and I highly doubt that the 3.2 million number is all encompassing.  Layoffs will continue well into April as some companies expected to get back to work immediately but are now realizing the case count and death toll is rising even faster than before.  I think the whole swath of the south who are following republicans advice and are generally obese will get hit even harder than NYC on a % basis.  Furthermore - Cheesecake Factory came out yesterday and said it wasn’t going to be paying its rent.  This is the first large company to say this but it won’t be the only one.  Many individuals are also doing the same with rent and mortgages.  We haven’t even seen the tip of the iceberg.  I think we have, at minimum, and additional 30% to drop in s&amp;p 500 and likely greater than 50%.  I feel like I am watching the big short and we are at that point where the numbers start going bad but the prices are still going up.",
        "subreddit": "stocks",
        "title": "This is the blip in the market before the next downturn",
        "url": "https://www.reddit.com/r/stocks/comments/fpcf7r/this_is_the_blip_in_the_market_before_the_next/",
        "created": 1585261727.0
    },
    {
        "author": "6ixSwings",
        "created_utc": 1585060511,
        "id": "fo642x",
        "num_comments": 1263,
        "num_crossposts": 0,
        "selftext": "Let me guess, after quadruple witching failed, you guys all went to sleep during the weekend thinking this week our lambos and teslas will be printed by the end of this week huh?\n\nYou also couldn't wait for this coming monday to huh? thought it was going to be blooody monday huh?\n\nLet me guess, those so called 'diamond hands' you have are starting to deteriorate into 'paper hands' \n\nLet me guess, your asshole is clinching every time you look at your portfolio?\n\nDo me a favour... GROW A PAIR YOU FUCKING PUSSY. You think we came this far to fold? From getting fucked quadruply from witches left right and centre, getting fucked by the stimulus bill every week, getting fucked retarded bulls week in and week out. You think we're here to fold? YOU THINK WE CAME THIS FAR TO SELL BEFORE APRIL? \n\nARE YOU DUMB OR ARE YOU DUMB?\n\ndo me a fucking favour, go to the closest mirror thats in your vicinity, loook in the mirror and slap yourself so hard that theres an echo in the room. Slap yourself so hard so you realize that your not drunk, its the markets. We will wait for the markets to sober up, we will wait when the president shuts down the whole country, we will wait when the unemployment numbers come out, we WILL follow suit with italy's economy and europe's economy (unfortunately), we will have more cases and panic.. this fucking list goes on. \n\nBIG RALLY = BIG FALL\n\nRemember, it doesn't matter how much money the feds offer coronavirus, the ronazz will keep on taking. We gave that bitch TRILLIONS and she still wants more? Us fucking bears realize that whatever amount of money we offer the ronazz it wont be enough. the ronazzz wants the WHOLE FUCKING WORLD, not a couple of trillions. smarten up bears. You weak bears are embarrassing us running around this forum crying that your puts are down. \n\nTL/DR bears panicking right now, do me a ANOTHER favour, go to the fucking washroom, open up this link [https://www.youtube.com/watch?v=9ikSfs9LETc](https://www.youtube.com/watch?v=9ikSfs9LETc) and stare at the mirror and follow what hes doing in the song. BEAT YOUR FUCKING CHEST HARDER AS THE SONG PROGESSES, HUM LOUDER, BELIEVE HARDER AND STOP BEING A FUCKING COWARD AND ..\n\n&amp;#x200B;\n\nHOLD THE FUCKING LINE.",
        "subreddit": "wallstreetbets",
        "title": "APRIL PUTS bag holders.. so ya portfolio looking like the total opposite of what your expecting huh?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fo642x/april_puts_bag_holders_so_ya_portfolio_looking/",
        "created": 1585089311.0
    },
    {
        "author": "Adderalin",
        "created_utc": 1584650225,
        "id": "flhb0d",
        "num_comments": 1228,
        "num_crossposts": 0,
        "selftext": "Final damage screenshot seconds before account was liquidated:  \n    \nhttps://i.imgur.com/e0sEWEm.jpg\n\nThanks to me UPRO and TMF now are 50% stress tests on TOS, no margin reduction credit, and from 36% and 24% stress tests respectively. Or maybe I'm on reg-t when I took the screenshot, IDK and IDC. Talking with risk management apparently I flew under the radar as they didn't see a margin balance due to the box spread until other account alerts went off as customer service will take a look in when anyone is negative 1 million or more PnL as a courtesy to chat with their clients. Needless to say customer service was horrified and I got another margin phone call to wire in $1,250,000 in the next five minutes or they'd liquidate. I guess they give Portfolio Margin customers a little bit more leeway... \n\nI took the five minutes to grab this one final screenshot. I'm hoping for some bailout money from coronavirus too. \n\nI talked with the bankruptcy lawyer that set me up with the asset protection plan and he already dropped me as a client. I never imagined beer-virus would do this to me. \n\nI'm gonna take some time to just not think about the virus or anything else. \n\n# TL;DR what strike/put/call/etc\n\nI discovered a bug in my broker's risk management software. I guess buy RCL calls per my previous DD.\n\nEdit:\nPrevious post entering the trade and proof of portfolio margin/etc:     \nhttps://www.reddit.com/r/wallstreetbets/comments/fepd4q/portfolio_margin_is_10x_worse_than_u1r0nymans_box/",
        "subreddit": "wallstreetbets",
        "title": "I failed my portfolio margin call. Final damage before TDA liquidated my account.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/flhb0d/i_failed_my_portfolio_margin_call_final_damage/",
        "created": 1584679025.0
    },
    {
        "author": "moon_buzz",
        "created_utc": 1584015157,
        "id": "fhfd9w",
        "num_comments": 1063,
        "num_crossposts": 0,
        "selftext": "Listen, for those of us who stepped in shit and were in the right place at the right time with positions, we got lucky. \n\nIn reality, there is a world of hurt out there. Think about how depressed you were the first time you blew your account... That's the fear most of the world has right now with their life savings and retirement funds. \n\nMore importantly, people are actually worried about the health and safety of the people they love.\n\nWe didn't start the fire, and if bankers make money on bad events why not autists as well.  I agree. Be safe, play the market.\n\nJust don't fucking dance",
        "subreddit": "wallstreetbets",
        "title": "Just don't fucking dance",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fhfd9w/just_dont_fucking_dance/",
        "created": 1584043957.0
    },
    {
        "author": "flesh-salesman",
        "created_utc": 1585176781,
        "id": "fp03kr",
        "num_comments": 1045,
        "num_crossposts": 0,
        "selftext": "On his Twitter, WSBGod was making daily posts until March 20, now there's radio silence. We know he caught the beer soup cancer (see below). I've pinged him and heard no response. You best believe he would have posted after the last 2 crazy fucking days.  \n\n\n* **March 16**: \"I wanted to let y'all know that as of this time I do believe I've been infected by the virus.  I'm self-isolating at home, saving the limited test kits for others who need them more than I do.  Don't worry about me tho, gonna take a lot more than this to bring ol' WSBgod down!\"\n* **March 19**: \"When I breathe I can hear my fucking lungs crackling. Can't wait until this is all over and I can celebrate with some fresh kush again.\"\n\nI seriously think our lord &amp; savior has passed unto the shadow realm. If so, let me be the first to pour one out for him and say this: you lived and died like a fucking legend.\n\nSide note: I spoke to Vanguard. He won't have margin to exercise, so they'll close out his position and his account will probably sit there with a fat 20M+ until it gets sent to probate and his family members kill each other over it.\n\nFuck.\n\nIf you're out there, you glorious bastard, I hope you're okay.\n\n$SPY 150 7/17",
        "subreddit": "wallstreetbets",
        "title": "R.I.P WSBGod, may your tendies rain down from the heavens",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fp03kr/rip_wsbgod_may_your_tendies_rain_down_from_the/",
        "created": 1585205581.0
    },
    {
        "author": "goodspeedmd",
        "created_utc": 1585051468,
        "id": "fo3zsr",
        "num_comments": 991,
        "num_crossposts": 0,
        "selftext": "Can we just take a moment to say fuck you to Xi Jinping? That soul sucker is claiming they have full control over something that they didn't even accept was happening until the population of fucking Houston was screaming for help. Now you're telling us that 18.47% of the world's population has respected social distancing so well that POOF only foreigners are bringing in the beervirus all the while telling every foreign reporter to fuck off back to their country? \n\nAnd the US is still taking their beervirus numbers seriously? Fuck you Xi Jinping\n\nPUTs on it all exp 5/15",
        "subreddit": "wallstreetbets",
        "title": "Fuck you Pooh",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fo3zsr/fuck_you_pooh/",
        "created": 1585080268.0
    },
    {
        "author": "TOADSTOOL__SURPRISE",
        "created_utc": 1584715916,
        "id": "flw9u8",
        "num_comments": 974,
        "num_crossposts": 0,
        "selftext": "Being a bear is painful today. But paytience pays—that’s why the word “pay” is in the word “paytience”\n\nNow, first of all, today is the witch thing; which I dont understand at all...but what I do understand is short squeezes—and today at 3:00, you will witness the greatest short squeeze in the history of capitalism—and you better have fucking cash on hand to buy every put you can from 3-4 this afternoon.\n\nAfter the short squeeze, Stocktwits bulls will scare you and make you think that everything is okay—but it’s not. Millions will file for unemployment in coming weeks. Businesses are closed across the planet—and their stocks are rising—this is a gift from god. Buy puts.\n\nTLDR: all puts literally doesn’t matter...just buy them a month out from expiration",
        "subreddit": "wallstreetbets",
        "title": "I hope you all have cash for puts later today",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/flw9u8/i_hope_you_all_have_cash_for_puts_later_today/",
        "created": 1584744716.0
    },
    {
        "author": "MortalDionysus",
        "created_utc": 1584453815,
        "id": "fk5ryy",
        "num_comments": 944,
        "num_crossposts": 0,
        "selftext": "This is the principle I've invested on, this is the principle I've thrived on.\n\nIn early 2007, there were many of us who could clearly see a storm was coming. When you've got people saying things like *\"they aren't making any new land, real estate can only go up forever!\"* you know you've got irrational greed on your hands. And so I sold in 2006 and held 100% cash, because you should be fearful when others are greedy. And when the market tanked, I printed tendies. Just as many of you are printing tendies now.\n\nBut after that precipitous drop in Oct. 2008, I turned around and began buying stock. Why? Because the sentiment of the market had changed. Because you should be greedy when others are fearful. I held that stock until 2018 and sold for another massive profit.\n\nNow we are seeing a near identical repeat of 2008. The bears have been rewarded for fearing the greed of the bulls. But things can turn around quickly. At some point bears become the greedy party, betting WITH the fear. People are still buying puts after a 30% down market. We've got people on sub predicting a complete financial meltdwn, millions ded, a new GD... I mean, anything is possible, but if you are betting on that, your greed is getting the best of you.\n\n**The point is to be neither a bear nor a bull, but a general contrarian of extremes in the market.** For the past several days, the extreme sentiment is clearly bearish, just as the extreme sentiment was extremely bullish a year ago.\n\nYou all have printed your tendies, but now you are getting greedy. Fear has taken over the market, and so now I am buying that fear. I am converting from a gay bear to a bull, starting this week.\n\nSure, the market will very likely continue to drop in the coming weeks or so... I will buy my way back in gradually, because I know I can't perfectly time the bottom. **The goal isn't to maximize every possible percent move of the market. Chasing that dream will make anyone broke.** The goal is to trade contrarian to market extremes. This week the market has become extreme bearish, and so I am reservedly bullish.\n\n**TL;DR - Your puts are still safe, but stop buying them. I'm not even buying calls, just going LONG on todays drop. And with every red day, I will be buying more, until the money is all gone.**",
        "subreddit": "wallstreetbets",
        "title": "Be Fearful when others are Greedy, be Greedy when others are Fearful",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fk5ryy/be_fearful_when_others_are_greedy_be_greedy_when/",
        "created": 1584482615.0
    },
    {
        "author": "Last_Jedi",
        "created_utc": 1584471451,
        "id": "fkau1z",
        "num_comments": 924,
        "num_crossposts": 0,
        "selftext": "We talk about having a personal emergency fund to help you cover sudden drops in your income, but it's become apparent looking at every company asking for a bailout now that these companies have nothing in the tank and were spending everything they were making (like airlines spending all their profit on stock buybacks). Are there any rules of business as to why not having like 6 months of cash to run your operations is a good thing?",
        "subreddit": "investing",
        "title": "So do mega-corporations just live \"paycheck to paycheck\"?",
        "url": "https://www.reddit.com/r/investing/comments/fkau1z/so_do_megacorporations_just_live_paycheck_to/",
        "created": 1584500251.0
    },
    {
        "author": "wailll",
        "created_utc": 1585253376,
        "id": "fpind0",
        "num_comments": 900,
        "num_crossposts": 0,
        "selftext": "This sub is getting more and more retarded, but not in a good way. No one understands the meaning of lurking anymore and the daily is flooded with retarded people. The witch fiasco, now this unemployment shit. Why are you all surprised that a conclusion reached by people who give 5k upvotes to a copy pasted Investopedia page explaining what the Greeks are is wrong? WSB may once have been one step ahead of the normies, but these days WSB itself has become those thinking they are outsmarting the normies despite being normies themselves. \n\nNo, spamming autistic shit like BEAR GANG and DRILL TEAM 6 in dailies will not make your 4/3 150p print, you are not bear gang, you are retarded.\n\nThink how stupid the average person is, and remind yourself that the average WSB user falls far under that mean. No, you did not discover top secret insider info about rising unemployment rates, you are not a genius for coming to the conclusion 1 day before the announcement that the market could tank from this info. If even a troglodyte could reach a conclusion, the market has reached that conclusion a long long time ago.",
        "subreddit": "wallstreetbets",
        "title": "You all aren't bulls or bears, you're a sheep.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fpind0/you_all_arent_bulls_or_bears_youre_a_sheep/",
        "created": 1585282176.0
    },
    {
        "author": "HowGreatAreYourDanes",
        "created_utc": 1585536729,
        "id": "friwc9",
        "num_comments": 840,
        "num_crossposts": 0,
        "selftext": "I'm a Loan Officer for one of the larger retail lenders. Here’s an overview of how the Fed gone and fucked over mortgage lenders. \n\nTHE CORONAVIRUS MELTDOWN\nThe current coronavirus crisis is having a critical impact on the mortgage industry, which could potentially make the 2008 financial crisis pale in comparison. The pressing issue centers around capital that's required by Mortgage Lenders to be able to function and meet covenants that are required for them to continue to lend. \n\nHERES HOW THE MORTGAGE MARKET WORKS\nLet's begin with the mortgage process. A borrower goes to a Mortgage Originator to obtain a mortgage. Once closed, the loan is handled by a Servicer, which may or may not be the same company that originated the loan. The borrower submits payments to the Servicer, however, the Servicer does not own the loan, they are simply maintaining the loan. This means collecting payments and forwarding them to the investor (Fannie/Freddie/Ginnie), paying taxes and insurance, and answering questions, etc. While they maintain or \"service\" the loan, the asset itself is sold to an aggregator or directly to a government agency like Fannie Mae, Freddie Mac, or Ginnie Mae. The loan then gets placed in a large bundle, which is put in the hands of an Investment Banker. The Investment Banker converts those loans into a Mortgage Backed Security (MBS) that can be sold to the public. This shows up in different investments like Mutual Funds, Insurance Plans, and Retirement Accounts. \n\nThe Servicer's role is very critical. In order to obtain the right to service loans, the Servicer will typically pay 1% of the loan amount up front. The Servicer then receives a monthly payment or \"strip\" equal to about 30 basis points (bps) per year. Because they paid about 1% to obtain the servicing rights and receive roughly 30 bps annual income, the breakeven period is approximately 3 years. The longer that loan remains on the books, the more money the Servicer makes. In many cases, the Servicer may want to use leverage to increase their level of income. Therefore, they may often finance half the cost of acquiring the loan and pay the rest in cash. \n\nSERVICER DILEMMA\nAs you can imagine, when interest rates drop dramatically, there is an increased incentive for many people to refinance their loans more rapidly. This causes the loans that a Servicer had on their books to pay off sooner…often before that 3-year breakeven period. This servicing runoff creates losses for that Mortgage Lender who is servicing the loan. The more loans in a Mortgage Lender’s portfolio, the greater the loss. Servicing runoff, or even the anticipation of it, can adversely impact the market valuation of a servicing portfolio. But at the same time, Lenders typically experience an increase in new loan activity because of the decline in interest rates. This gives them additional income to help overcome the losses in their servicing portfolio. \n\nBut the Coronavirus has caused a virtual shutdown of the US economy, which has created an unprecedented amount of job losses. This adds a new risk to the servicer because borrowers may have difficulty paying their mortgage in a timely manner. And although the Servicer does not own the asset, they have the responsibility to make the payment to the investor, even if they have not yet received it from the borrower. Under normal circumstances, the Servicer has plenty of cushion to account for this. But an extreme level of delinquency puts the Servicer in an unmanageable position.\n\nI'M FROM THE GOVERNMENT AND I'M HERE TO HELP\nIn the Government’s effort to help those who have lost their jobs because of the Coronavirus shutdown, they have granted forbearance of mortgage payments for affected individuals. This presents an enormous obstacle for Servicers who are obligated to forward the mortgage payment to the investor, even though they have not yet received it. Fortunately, there is a new facility set up to help Mortgage Servicers bridge the gap to the investor. However, it is unclear as to how long it will take for Servicers to access this facility.\n\nBut what has not been yet contemplated is the fact that a borrower who does not make their first mortgage payment causes the loan to be ineligible to be sold to an investor. This means that the Servicer must hold onto the asset itself, which ties up their available credit. And with so many new loans being originated of late, the amount of transactions that will not qualify for sale is significant. This restricts the Lender’s ability to clear their pipeline and get reimbursed with cash so they can now fund new transactions.\n\nMARK TO MARKET\nThis week - Due to accelerated prepayments and the uncertainty of repayment, the value of servicing was slashed in half from 1% to 0.5%. This drastic decrease in value prompted margin calls for the many Servicers who financed their acquisition of servicing. Additionally, the decreased value of a Lender’s servicing portfolio reduces the Lender’s overall net worth. Since the amount a lender can lend is based on a multiple of their net worth, the decrease in value of their servicing portfolio asset, along with the cash paid for margin calls, reduces their capacity to lend.\n\nUNINTENDED CONSEQUENCES\nThe Fed’s desire to bring mortgage rates down isn’t just damaging servicing portfolios because of prepayments, it’s also wreaking chaos in Lenders’ ability to hedge their risk. Let’s look at what happens when a borrower locks in their mortgage rate with a Mortgage Lender. Mortgage rates are based on the trading of Mortgage Backed Securities (MBS). As Mortgage Backed Securities rise in price, interest rates improve and move lower. A locked rate on a loan is nothing more than a lender promising to hold an interest rate for a period of time, or until the transaction closes. The Lender is at risk for any MBS price changes in the marketplace between the time they agreed to grant the lock and the time that the loan closes.\n\nIf rates were to rise because MBS prices declined, the Lender would be obligated to buy down the borrower’s mortgage rate to the level they were promised. And since the Lender doesn’t want to be in a position of gambling, they hedge their locked loans by shorting Mortgage Backed Securities. Therefore, should MBS drop in price, causing rates to rise, the Lender’s cost to buy down the borrower’s rate is offset by the Lender’s gains of their short positions in MBS.\n\nNow think about what happens when MBS prices rise or improve, causing mortgage rates to decline. On paper the Lender should be able to close the mortgage loan at a better price than promised to the borrower, giving the Lender additional profits. However, the Lender’s losses on their short position negate any additional profits from the improvement in MBS pricing. This hedging system works well to deliver the borrower what was promised, while removing market risk from the Lender.\n\nBut in an effort to reduce mortgage rates, the Fed has been purchasing an incredible amount of Mortgage Backed Securities, causing their price to rise dramatically and swiftly. This, in turn, causes the Lenders’ hedged short positions of MBS to show huge losses. These losses appear to be offset on paper by the potential market gains on the loans that the lender hopes to close in the future. But the Broker Dealer will not wait on the possibility of future loans closing and demands an immediate margin call. The recent amount that these Lenders are paying in margin calls are staggering. They run in the tens of millions of Dollars. All this on top of the aforementioned stresses that Lenders are having to endure. So, while the Fed believes they are stimulating lending, their actions are resulting in the exact opposite. The market for Government Loans, Jumbo Loans, and loans that don’t fit ideal parameters, have all but dried up. And many Lenders have no choice but to slow their intake of transactions by throttling mortgage rates higher and by reducing the term that they are willing to guarantee a rate lock.\n\nFurthering the Fed’s unintended consequences was the announcement to cut interest rates on the Fed Funds Rate by 1% to virtually zero. Because the Fed’s communication failed to educate the general public that the Fed Funds Rate is very different than mortgage rates, it prompted borrowers in process to break their locks and try to jump ship to a lower rate. This dramatically increased hedging losses from loans that didn’t end up closing.\n\nEVEN STEPHEN KING COULD NOT HAVE SCRIPTED THIS\nIt’s been said that the Stock market will do the most damage, to the most people, at the worst time. And the current mortgage market is experiencing the most perfect storm. Just when volume levels were at the highest in history, servicing runoff at its peak, and pipelines hedged more than ever, the Coronavirus arrived.\nLenders need to clear their pipelines, but social distancing is making it more difficult for transactions to be processed. And those loans that are about to close require that employment be verified. As you can imagine, with millions of individuals losing their jobs, those mortgages are unable to fund, leaving lenders with more hedging losses and no income to offset it.\n\nWHAT NEEDS TO BE DONE NOW\nFortunately, there are many smart people in the Mortgage Industry who are doing everything they can to navigate through these perilous times. But the Fed and our Government needs to stop making it more difficult. The Fed must temporarily slow MBS purchases to allow pipelines to clear. Lawmakers need to allow for first payment defaults, due to forbearance, to be saleable. And finally, the Fed must more clearly communicate that Mortgage Rates and the Fed Funds Rate are not the same. We have faith that the effects of the Coronavirus will subside and that things will become more normalized in the upcoming months.\n\n\nSo, that’s what’s going on - I’d love some input on the best way to use this info for trades. Personally I think that mid-sized loan servicers with minimal diversity are most at risk. Quicken isn't publicly traded, Wells Fargo is too big for their mortgage servicing alone to cripple them. \n\nSo, what servicers are at risk? Cut and paste: The Mortgage Bankers Association (MBA) today released its mid-year rankings of commercial and multifamily mortgage servicers' volumes as of June 30, 2019. At the top of the list of firms is Wells Fargo Bank, N.A., with $681.8 billion in master and primary servicing, followed by PNC Real Estate/Midland Loan Services  ($655.2 billion), KeyBank National Association ($273.1 billion), Berkadia Commercial Mortgage LLC  ($268.4 billion), and CBRE Loan Services ($208.3 billion).\n\nI like CBRE personally - they are exposed to residential MBS and to commercial MBS, retail property management, and just all around their revenue is from parts of the r.e. market that are likely to get fucked pretty hard.\n\nSo, I haven't taken this position yet but will this week - 9/18/2020 CBRE 35p. \n\nTL;DR: If you want to know details of how residential mortgage loan servicers are at high risk due to CARES Act, theres about 20 mins of reading. Or, just know they are at high risk unless the government fixes some shit they broke.",
        "subreddit": "wallstreetbets",
        "title": "Mortgage Servicing Crisis Explained",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/friwc9/mortgage_servicing_crisis_explained/",
        "created": 1585565529.0
    },
    {
        "author": "cinemagical414",
        "created_utc": 1584722707,
        "id": "fly7b4",
        "num_comments": 817,
        "num_crossposts": 0,
        "selftext": "Every financial crisis is exactly the same. Investors figure out a fun new way to make money, lever up their investments, convince dumber investors and businesses to buy in, lever up some more, spread the risk around the entire financial system, and ride the wave up until it crests and crashes.\n\n* In the Panic of 1819, \"wildcat\" banks out west converted funding from the US bank (central bank at the time) into their own leveraged currency and handed out unsecured loans to land developers. Much of the land turned out to be worthless, and the banks went under, dragging down the US bank and US economy with them.\n* The Panic of 1837 was similar, except that east-coast banks handed out money to any and every cotton farmer in exchange for a profit split. When the cotton market crashed, so did the banks.\n* The next capital-P Panic, this one in 1857, was set off when the thousands of miles of tracks promised by mid-19th century-railroad startups stalled out in the construction phase. The implosion among investors reverberated through the entire economy.\n* Then there was the Really Big One -- the Crash of 1929 preceding the Great Depression. Investors in the 1920s were absolutely out of their minds. They dished out easy money like candy in every direction and in every industry -- materials, construction, retail, automobiles, railroads -- believing that the good times of profitable plays and high returns would never end. This is when the semiotics of the stock market began to shift: investors started putting their faith in the rise of the DOW like it was a Newtonian law, without regard to what it stood for or the investments underneath. When those investments turned sour, the bubble grew larger before it finally popped.\n* Skipping ahead to 1987's Black Monday, we have investors so high on their own supply that they truly believe financial wizardry will save them from any downturn. In this early era of computers, traders started using smooth-brained algorithms to hedge their portfolios. Since the robots were protecting us, it was totally fine to lever up and throw money at anything that promised above-market returns. Because the algorithms will surely warn us before we head off the cliff, right? Nah. Stocks dove and brokerages faced margin calls that wiped away their balance sheets. Oops.\n* Reagan-Bush economic philosophy is perfectly captured by the Savings &amp; Loan Crisis. S&amp;Ls were like banks, only without any oversight whatsoever and lots of accounting gimmicks to make them look *not* insolvent. The clarion call for credit lines by unimaginably shitty businesses was heroically answered by S&amp;Ls across the nation. They doled out loans to just about anyone who asked for them at high interest rates and then cooked their books to make it look like they had plenty of working capital and a steady stream of investment income. Some of that income actually came from completely unrelated investments bought on margin, purportedly to hedge against credit risks. Like a mobius strip, the margin for those investments was backed by the loan obligations from the shitty companies they invested in. Just utter shit all the way down. The whole thing blew up in the early 1990s.\n* We didn't learn our lesson because we never do, which brings us to the Dot Com Bubble. Technology got shinier in the 1990s, and the investor class became ever-more transfixed by it. Imagine. The year is 1999. Dial-up speeds can load a gif in about one minute. You think you can start an e-commerce grocery delivery business on this platform, and investors are like, oh yeah man, fuck yeah, take my money! And even though you've reported less than $400K in total revenue, Goldman Sachs underwrites your IPO for a $5 billion valuation. (Goldman is shorting the shit out of you on the other side of their \"Chinese wall.\") The fiasco was fueled Y2K-induced magical thinking by boomer investors placing highly leveraged bets on every empty LLC with \"dot-com\" in its name, and delusional boomer management in tech, media, and telecom (and everywhere else) going deep into debt to finance insane business plans reliant on internet connections that still make phone beeping noise.\n* Next is a story we know: the 2007-2008 Global Financial Crisis. Let's extend insane amounts of credit to anyone with a pulse, bundle up the worthless contracts, stamp AAA on top, sell it to shit-tier mutual funds, borrow against it to take out massive amounts of insurance on it, take out even more insurance on it to bet against it because hey why the fuck not, and then let the perpetual free money machine do its thing. Use the perpetual free money machine to lever up investments everywhere else. Use those levered investments to make more levered investments. Call yourself CFO of Lehman Brothers.\n\nI have no doubt that the illustrious investor class has continued to fuck around over the last decade to build up yet another unsustainable house-of-cards shit-bubble. And now that stocks are tanking, economic activity is screeching to a halt, bond yields are plummeting, and fed rates are reaching zero, it's only a matter of time before the first dominoes start to fall.\n\nBut a market bubble implosion is also an opportunity for tremendous gains. Think John Paulson shorting the ever-loving fuck out of the housing market before the subprime mortgage crisis and reaping $4 billion. The only problem is that real bubbles are very hard to spot, even if they are obvious in retrospect. Finance has become so convoluted that everything can look like a bubble if you stare at it for long enough.\n\nSo here are some ideas for where the bubble may be lurking. I'll add any other credible hypotheses to this list if the post gains interest.\n\n**1.** **Corporate loans**\n\nLow interest rates during the last 10 years have prompted businesses to borrow money with abandon. On the other side of the equation, investors seeking above-market returns have been dishing out these loans like candy. Rising tides across the economy have convinced businesses and investors alike that the risk of these loans going south are immaterial. Reminiscent of the S&amp;L crisis, many of these loans have been given to businesses with little collateral, low liquidity, and tenuous cash flow. If these businesses cease to operate, they will quickly become insolvent, investors will realize huge losses on their loan portfolios, and insurance payouts will balloon.\n\nPer the Fed, corporate debt &amp; loan liabilities have skyrocketed in recent years:  [https://fred.stlouisfed.org/series/TCMILBSNNCB](https://fred.stlouisfed.org/series/TCMILBSNNCB) \n\nSame with bonds, which will face the same problem as loans:  [https://fred.stlouisfed.org/series/CBLBSNNCB](https://fred.stlouisfed.org/series/CBLBSNNCB) \n\n\"Other loans and advances\" and \"miscellaneous liabilities\" (very mysterious) have boomed:\n\n [https://fred.stlouisfed.org/series/OLALBSNNCB](https://fred.stlouisfed.org/series/OLALBSNNCB) \n\n [https://fred.stlouisfed.org/series/MLLBSNNCB](https://fred.stlouisfed.org/series/MLLBSNNCB) \n\nI think this is the most likely origin of a potential market collapse. Market, bond, and loan values are dependent on the uninterrupted function of cash-poor businesses. If any of these are serving as collateral for other investments, or as the foundation for securitized products, then the crash could be spectacular.\n\n**2. Shadow banking**\n\nFollowing the financial crisis, Congress put a muzzle on the world's biggest banks through tougher capital and liquidity requirements. They were forced to delever their balance sheets, unwind from risky investments, and toughen their lending requirements. This didn't stop the demand for risk, though, which moved into the \"shadow banking\" sector. Investment firms like Blackstone, Blackrock, KKR, and Bridgewater and smaller investment banks like Moelis, Houlihan, and Jeffries picked up where JP Morgan and Goldman Sachs left off. We can assume they have loaded up on leverage to purchase what were considered low-risk assets amid low interest rates and broadly appreciating markets. The extent to which they can de-lever without blowing up their balance sheets will determine whether they sink or swim. If they sink, the repercussions will be broad and start to impact the TBTF banks that were supposed to be reined in by financial crisis-era regulations. We can also assume, to some degree at least, that firms like Goldman and Morgan Stanley, which do not have large consumer lending &amp; banking businesses, were able to creatively skirt regulatory requirements and load up on riskier assets. Goldman's latest 10K shows that the firm has up to 70% of its credit portfolio in non-investment grade or distressed corporate loans (see #1 above). That's going to be a problem.\n\n**3. Leveraged real estate**\n\nA major part of the 2008 financial crisis was the implosion of the subprime mortgage market. A decade later, there has been a major shift away from home ownership and toward rental properties. But subprime mortgages have also started to creep back up, with longer terms and higher interest rates. Rental income &amp; long-term mortgage payments are presumably safer for investors than the types of agreements we saw leading up to 2008, but that logic implodes when they're propped up by leverage, securitized into new investment products, and under-girded by rental and mortgage contract terms that consumers are unable to meet. We know that there is a lot of leverage in this sector -- investment firms attest to as much -- and depending on the extent of that leverage, the end result could be a disaster.\n\nThose are my initial musings. Still thinking through potential positions. I think Blackstone &amp; Morgan Stanley could be left holding the bag if the system implodes. Urban-focused REITs could be in major trouble. And businesses with high levels of short-term liabilities in the form of leveraged loans and bonds could start to fold.",
        "subreddit": "wallstreetbets",
        "title": "Spot the bubble before it bursts",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fly7b4/spot_the_bubble_before_it_bursts/",
        "created": 1584751507.0
    },
    {
        "author": "BigPorygon",
        "created_utc": 1584084951,
        "id": "fhvyh0",
        "num_comments": 805,
        "num_crossposts": 0,
        "selftext": "The US stock market has now wiped out the entire $11.5 trillion of value it gained since Trump's 2016 election victory\n\nhttps://markets.businessinsider.com/news/stocks/stock-market-outlook-2016-trump-win-gains-erased-coronavirus-risks-2020-3-1028991585",
        "subreddit": "stocks",
        "title": "The US stock market has now wiped out the entire $11.5 trillion of value it gained since Trump's 2016 election victory",
        "url": "https://www.reddit.com/r/stocks/comments/fhvyh0/the_us_stock_market_has_now_wiped_out_the_entire/",
        "created": 1584113751.0
    },
    {
        "author": "ILikeTalkn2Myself",
        "created_utc": 1584553417,
        "id": "fktnb5",
        "num_comments": 773,
        "num_crossposts": 0,
        "selftext": "[https://www.cnn.com/2020/03/18/investing/stocks-erase-trump-gains/index.html](https://www.cnn.com/2020/03/18/investing/stocks-erase-trump-gains/index.html)\n\nNew York (CNN Business)The Trump stock rally, which at its peak a month ago was robust and seemingly unending, has completely evaporated.\n\nThe Dow ([INDU](https://money.cnn.com/data/markets/dow/?source=story_quote_link)) fell more than [1,800 points on Tuesday](http://www.cnn.com/business/live-news/stock-market-news-today-031820/index.html),  bringing the index below 19,732 points. That was the Dow's closing  level on January 19, 2017, the day before Trump took office.The S&amp;P 500 ([SPX](https://money.cnn.com/data/markets/sandp/?source=story_quote_link)) plunged 7% at midday,[ triggering a circuit breaker](https://www.cnn.com/business/live-news/stock-market-news-today-031820/h_03ac10482657155ab7dc354a7cefab3c)[ which halted trading ](https://www.cnn.com/business/live-news/stock-market-news-today-031820/h_03ac10482657155ab7dc354a7cefab3c)for  15 minutes. That index is still above its Trump inauguration level, but  it is moving closer to wiping out all of Trump's stock market gains as  well. The index, which is the broadest measure of Wall Street, was down  6.3% in the early afternoon on Tuesday.Global  equities have been hit hard by the worries about the economic fallout  from the coronavirus outbreak, which has by now infected more than 7,000  people in the United States.Economists [predict recessions](http://www.cnn.com/2020/03/17/economy/global-recession/index.html)  for both individual countries and the world economy this year as the  pandemic dealt both a supply and demand shock to commerce. That said,  expectations for a sharp rebound for the economy and the stock market  towards in the second half of the year are high.",
        "subreddit": "StockMarket",
        "title": "The entire Trump stock rally is gone: Dow erases all its gains since Donald Trump took office",
        "url": "https://www.reddit.com/r/StockMarket/comments/fktnb5/the_entire_trump_stock_rally_is_gone_dow_erases/",
        "created": 1584582217.0
    },
    {
        "author": "chazzdubz",
        "created_utc": 1584675178,
        "id": "flnygn",
        "num_comments": 745,
        "num_crossposts": 0,
        "selftext": "Will keep this short. At this point everybody understands what quad witching is. The real question is how it applies to tomorrow.\n\n&amp;#x200B;\n\n&gt;**Basics of Max Pain**  \n&gt;  \n&gt;Max pain theory says that the option writers will ~~hedge~~ the contracts they have written. In the case of the market maker, the hedging is done to remain neutral in the stock. Consider the market maker's position if he must write an option contract without wanting a position in the stock.  \n&gt;  \n&gt;As the option expiration approaches, option writers will try to buy or sell shares of stock to drive the price toward a closing price that is profitable for them, or at least to hedge their payouts to option holders. **Call writers sell shares to drive share price down and Put holders buy shares to drive share price up. The max pain strike price exists somewhere in the middle.**\n\n&amp;#x200B;\n\nMM will both be trying to push calls and puts to max pain, which for the SPY, is at $300. Call writers will sell shares in order to try to push price down. Put writers will buy shares in order to push the price up. Considering the recent drill over the past month:\n\nCall Writers Exposure: $81M\n\nPut Writers Exposure: **$14B**\n\nhttps://preview.redd.it/cn8r099zvqn41.png?width=1154&amp;format=png&amp;auto=webp&amp;s=dc0f3d7a7545d0024ae1d18127b51e7dfd7ca129\n\nI think its fairly obvious MM's with put liability will overpower those with call liability. \n\nMore DD? \n\nIn an absolutely devastating liquidity crunch, what a coincidence it is that the FED are reinstating the Primary Dealer Credit Facility (PDCF) from '08, except now repayment terms on loans are no longer overnight, they are 90 days, and the FED has reduced restrictions on acceptable collateral to now include investment grade corporate debt securities, international agency securities, commercial paper, municipal securities, mortgage-backed securities, and asset-backed securities; **plus equity securities.** This facility began ops at 9PM tonight and will run for at least the next 6 months.\n\nYes, California is on lock down and the virus is mutating, but none of that actually matters. This is simply market manipulation. Expect your regularly scheduled bear market next week. \n\n**TLDR:** SPY mooning tomorrow. I'm not saying it will open green, but these put writers will do anything in their power to reduce their exposure here before close, hence the name, witching hour. \n\n$SPY 270C 3/27 - flip the premium at close",
        "subreddit": "wallstreetbets",
        "title": "Friday Green or Red? [DD Inside]",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/flnygn/friday_green_or_red_dd_inside/",
        "created": 1584703978.0
    },
    {
        "author": "PerestroikaPal",
        "created_utc": 1584020181,
        "id": "fhgfj9",
        "num_comments": 717,
        "num_crossposts": 0,
        "selftext": "[Unprecedented turmoil in the markets right now](https://www.cnbc.com/2020/03/11/futures-are-steady-wednesday-night-after-dow-closes-in-bear-market-traders-await-trump.html)",
        "subreddit": "investing",
        "title": "S&amp;P500 has hit the 7% circuit breaker for the second time this week",
        "url": "https://www.reddit.com/r/investing/comments/fhgfj9/sp500_has_hit_the_7_circuit_breaker_for_the/",
        "created": 1584048981.0
    },
    {
        "author": "crappy_entrepreneur",
        "created_utc": 1585551077,
        "id": "frly40",
        "num_comments": 702,
        "num_crossposts": 0,
        "selftext": "Crude hit $19.92 a barrel in the US just now. \n\nLike in 2015, this price crash is an obvious temporary reaction to a perfect storm, and crude obviously isn't going to stay at historic lows for long.\n\nWhat I'm asking is;\n\n1) How is it so long, when the long term value of oil is profoundly unlikely to be permanently damaged\n\n2) If it is indeed rational to invest in Oil long-term at this price, how do I do so? I am UK based if that helps.\n\nSee article for more details (apologies for the paywall)   \n[https://www.ft.com/content/bc938195-82d3-43eb-b031-740028451382](https://www.ft.com/content/bc938195-82d3-43eb-b031-740028451382)",
        "subreddit": "investing",
        "title": "Oil is now under $20 a barrel. This obviously is temporary. How would I invest in this long-term?",
        "url": "https://www.reddit.com/r/investing/comments/frly40/oil_is_now_under_20_a_barrel_this_obviously_is/",
        "created": 1585579877.0
    },
    {
        "author": "MaxAds1",
        "created_utc": 1584623233,
        "id": "fl9q3e",
        "num_comments": 701,
        "num_crossposts": 0,
        "selftext": "Let me guess, you just rolled out of bad after trying to squeeze that post-market-open anxiety out of the tip of your penis. You then rolled into the bathroom to try and get some more stress out of your body huh? Take a look in the mirror. Now take a second look. What do you notice? Bloodshot eyes after periodically waking up to check futures prices? \n\nMaybe you also lost some sleep because your girlfriend of 3 years left you for some douche named Derek. He can't pull off that leather jacket he always wears. He looks like such a douche. Fuck you, Derek. \n\nRight now you're the oldest and most wise you've ever been, and the youngest and most youthful you'll ever be. It's time to use that to your advantage - do not fucking sell. Diamond hands. Diamond fucking hands. This is a once and 20-year opportunity we have on our hands, autists. Not only is the market the easiest it's ever been to make money, but our stupid fucking employers sent us home so we can stare at our trading accounts all day.\n\nDon't waste this. Don't sell. Make as many tendies as your little fucking heart can. Buy that leather jacket and wear it in a way that Derek never can. Fuck you, Derek.\n\nTL/DR: SPY 210 4/17\n\nP.S. If you're reading this Jennifer please come back my life is falling apart without you.",
        "subreddit": "wallstreetbets",
        "title": "Don't Even Think About it",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fl9q3e/dont_even_think_about_it/",
        "created": 1584652033.0
    },
    {
        "author": "Braconomist",
        "created_utc": 1583590408,
        "id": "fevmjf",
        "num_comments": 684,
        "num_crossposts": 0,
        "selftext": " Before, you start reading on the main topic, i would like to make an analogy.\n\nThe reason World War I started is extensively credited to the assassination of Archduke Franz Ferdinand. \n\nIt's assassination is considered the fuse tha would light the fire that would culminate in World War I.\n\nEurope had many problems between it's nations before the assassination, things weren't going well diplomatically and there was a huge pressure on aliances systems and so on, it was just waiting to happen and the murder of the archduke just made it possible.\n\nHaving that in mind:\n\nThe coronavirus was just the fuse that would light the fire to the recession.\n\nRelevant things that were happening before the coronavirus:\n\n1. Corporate profits were already in a recession.\n2. Huge piles of corporate debt, we are at the end of a credit cycle, meaning people and corporation will have to spend less to cut back on debt.\n3. The P/E ratio of the S&amp;P 500, for example, had valuations comparable to previous markets just before the crash, like 2000 and 2008.\n4. The Fed already wasted almost all of it’s ammo, reducing it’s ability to keep the economy going, the stock market has been relying for years on the Fed to keep the party going, now that they realize they are on their own, investors could finally realize every price is pretty much inflated.\n5. Even though interest rates are historically low, the inflation rate is low, even with a low unemployment rate. This definitely means there is some core problems with the economy since it is a clear show of how much pressure the Fed, consumers and the producers are putting to stimulate growth but it’s still lackluster and clearly show signs of contraction.\n6. Millennials and Generation Z are becoming more important every year for the economy. They are probably the most indebted populations there are, reducing their ability to consume, work and to defend themselves against a recession.\n7. Even though we have unemployment at record lows, Americans suffer from low wages, almost no working rights, and low capabilities to consume since household debt is at record lows (can’t stimulate growth in the economy if all the households are using their paychecks is just to stay afloat and live up to the next paycheck, leaving little room to actually consume).\n\nSo, you have that in mind, and also a Bull Market that has been going since 2009, for 10 years, when the average is 8.\n\nSo, if it wasn’t coronavirus it would be something’s else, but let’s examine it’s economic impact.\n\n1. The virus will cause a huge supply shock because of low volume of commerce since China is basically on quarantine and the world depends on China to many of it’s goods.\n2. On the side of the consumers, you can cut rates as much as want, but a huge household debt won’t disappear out of nowhere it these lackluster wages workers are given, have that in mind, the virus is another incentive to consume even less.\n3. These halts on supply on demand can cause huge problems on corporations that today are up to their eyeballs in debt, failing to pay short term debts, causing a huge death spiral.\n4. The outbreak is not even a it’s peak and already caused a huge economic impact that will only get worse.\n5. You can't compare virus outbreaks to previous outbreaks. Because the variable (the virus itself) is completely different from previus outbreaks. People keep comparing this COVID-19 with the SARS in 2003 and they compare how the market reacts back then and think things are going fine. In 2003 the world was much less dependent on China commerce, the Stock Market was just beginning it's Bull Market that would end in 2008. Today we are on all time highs and very much depend on China for global commerce, this virus is much more capable of infection than SARS were, meaning it's economic impact is far greater than any outbreak there. \n\nSo yeah, I don’t see the next month with good eyes.\n\nAlso, one last thing to make things clear:\n\nYou don’t do a emergency cut of 50 bps on a national interest rates if you think the economy is strong and have good foundations, you do it because shit is going down fast and the gears of the economy are starting to break down even faster and you are trying to keep it going by cutting the rates.",
        "subreddit": "investing",
        "title": "The problems isn't the virus, the market already had many problems before and we will see a recession and the end of this Bull Market.",
        "url": "https://www.reddit.com/r/investing/comments/fevmjf/the_problems_isnt_the_virus_the_market_already/",
        "created": 1583619208.0
    },
    {
        "author": "johntempleton",
        "created_utc": 1584711673,
        "id": "flv7kl",
        "num_comments": 676,
        "num_crossposts": 0,
        "selftext": "[Info](https://twitter.com/JimPethokoukis/status/1240987869709250560)\n\nSome perspective: Worst year in the Great Recession: -2.5% decline in GDP.\n\nGoldman is now saying -3.8% this year. Last time that happened was 1946 (-11.6%, post war) and the Great Depression years.",
        "subreddit": "investing",
        "title": "GOLDMAN SACHS: \"We now forecast quarter-on-quarter annualized growth rates of -6% in Q1, -24% in Q2, +12% in Q3, and +10% in Q4 ... full-year growth at -3.8% on an annual average basis... we estimate a 5.5pp increase in the U3 unemployment rate to a 9% peak in coming quarters\"",
        "url": "https://www.reddit.com/r/investing/comments/flv7kl/goldman_sachs_we_now_forecast_quarteronquarter/",
        "created": 1584740473.0
    },
    {
        "author": "cute-girl-in-a-dress",
        "created_utc": 1584931658,
        "id": "fncl6a",
        "num_comments": 670,
        "num_crossposts": 0,
        "selftext": "They're giant fucking pussies. We're jokingly mean to each other 99% of the time. We say really jarring and intense shit. Now these pussies come in here and bash us for using a bit of naughty laguage. \n\nI guess you can't make it through college these days without being brainwashed.",
        "subreddit": "wallstreetbets",
        "title": "The absolutely biggest problem with these new users",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fncl6a/the_absolutely_biggest_problem_with_these_new/",
        "created": 1584960458.0
    },
    {
        "author": "GetYourTwinkies",
        "created_utc": 1585243762,
        "id": "fpfnm9",
        "num_comments": 663,
        "num_crossposts": 0,
        "selftext": "Up until now I've been thinking things will turn around. Now that I likely have the infection, I'm fully appreciating just how fucked this situation is. My roommate and I haven't left the house in two weeks. We had groceries delivered 6 days ago and we sprayed and wiped them down. Now we're both coughing a shit ton, and I woke up shivering uncontrollably last night drenched in sweat with a high fever. I'm starting to have a harder time breathing, feels like I can't get a full breath and there's noise when I breath. I never get sick and the only possible exposure is the groceries. I called 811 and they said since I'm not actively dying or work in healthcare, I don't qualify for a test.\n\nWatch this NYC ER doc talk about how fucked everything is: https://youtu.be/J7s6n_ySkmQ\n\nThose who think we're at the bottom are dreaming. This has just begun - and to make things even more fucked up the only two times I've been sick in the last 10 years are now and at the end of January after returning from Japan where I was crammed in with Chinese new year tourists at aquariums and museums, etc. Exact same symptoms then without the trouble breathing. So reinfection or infection with a new strain seems like a real thing and the idea that we just \"need to get it over with and go back to work\" makes zero sense.",
        "subreddit": "wallstreetbets",
        "title": "I'm 25 and woke up at 2:30am with intense Coronavirus symptoms. This has just begun",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fpfnm9/im_25_and_woke_up_at_230am_with_intense/",
        "created": 1585272562.0
    },
    {
        "author": "banaca4",
        "created_utc": 1585578392,
        "id": "frrqq7",
        "num_comments": 658,
        "num_crossposts": 0,
        "selftext": "I very much doubt they are pricing in the salvation package that was last week. Now it's only more victims more quarantines and more low earnings reports for the next two months. Unbelievable? Sounds even manipulated",
        "subreddit": "stocks",
        "title": "Anybody understands why USA announced very bad news last night and market goes up?",
        "url": "https://www.reddit.com/r/stocks/comments/frrqq7/anybody_understands_why_usa_announced_very_bad/",
        "created": 1585607192.0
    },
    {
        "author": "effvobis",
        "created_utc": 1583349461,
        "id": "fdi3co",
        "num_comments": 637,
        "num_crossposts": 0,
        "selftext": "I just want to post some DD for people who think the beer virus is priced in. The fed holding the economy up like Atlas has given some of you bullcucks some false hope that stonks only go up. \n\n1. The coronavirus has just been proven to have the ability to invade the nervous systems of victims.\n   1. [twitter.com/global...](https://twitter.com/globaltimesnews/status/1235178507820347392?s=21)\n2. China was/is a fucking shitshow even though they sealed themselves off nearly entirely. You think the U.S. is willing to do that? No.\n3. It's now proven that the virus holds the ability to mutate. L-Cov, the deadlier and quicker-spreading one, is expected to be around 70% of cases. The U.S. is fucked.\n   1. [twitter.com/global...](https://twitter.com/globaltimesnews/status/1235094882915471365?s=19)\n4. LA just declared a temporary state of emergency. They are the first to do so. Imagine when other places begin to follow suit.\n   1. [twitter.com/bnodes...](https://twitter.com/bnodesk/status/1235243372283129856?s=21)\n5. The homelessness implications that nobody is talking about.\n   1. [bbc.com/news/b...](https://www.bbc.com/news/business-51706225)\n6. If statistics are anything to go by, the U.S. is/has approached their 50 cases. It will soon explode. Note that these are statistics from countries that have actually \"tried\" to mitigate the spreading, the U.S. is putting an absolute abysmal amount of effort towards the beer virus. I imagine it'll get a lot worse pretty quickly.\n   1. [https://www.reddit.com/r/CoronavirusDownunder/comments/fdbei4/were\\_nearly\\_at\\_50/](https://www.reddit.com/r/CoronavirusDownunder/comments/fdbei4/were_nearly_at_50/)\n\nThis is only brief DD. The virus hasn't been portrayed accurately in the media for fear of spreading panic, but once it starts raking the country, specifically retirement homes, people will begin to notice it's nothing to scoff at.\n\nSPY 4/17 $250",
        "subreddit": "wallstreetbets",
        "title": "Coronavirus not priced in.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fdi3co/coronavirus_not_priced_in/",
        "created": 1583378261.0
    },
    {
        "author": "ReeingLib",
        "created_utc": 1583680203,
        "id": "ffdrz0",
        "num_comments": 635,
        "num_crossposts": 0,
        "selftext": "If you're not in bear gang, it's not too late to join, and I suggest you do so promptly because shits about to hit the fan frens. That being said, I plan on riding the \"V\" down and up on this one, and lastly, if you're a perma bull you're in luck I've got some companies at the bottom that I think will go up over the next few months.\n\n**What's about to happen:**\n\nLet's stick to the facts and correlate this puppy to a similar outbreak; H1N1: \"*From April 12, 2009 to April 10, 2010, CDC estimated there were 60.8 million cases (range: 43.3-89.3 million), 274,304 hospitalizations (range: 195,086-402,719), and 12,469 deaths (range: 8868-18,306) in the United States due to the (H1N1)pdm09 virus... Additionally, CDC estimated that 151,700-575,400 people worldwide died from (H1N1)pdm09 virus infection during the first year the virus circulated* \" [\\[1\\]](https://www.cdc.gov/flu/pandemic-resources/2009-h1n1-pandemic.html)\n\nSince H1N1 got memory holed and everybody forgot about it, the virus became a modern flu, we have flu shots for this thing and chances are you've probably had it at one point or another -- it's just one of the flues that floats around each season. But the Corona is different...\n\nFirst off, this thing already has a reproduction rate higher than any of the previous outbreaks in the last 150 years [\\[3\\]](https://en.wikipedia.org/wiki/Template:Notable_flu_pandemics). AND it's one of the most deadly -- however only to certain age groups which is a big difference [\\[4\\]](https://www.worldometers.info/coronavirus/coronavirus-age-sex-demographics/). Now I do want to make it clear that the Spanish Flu was a lot deadlier to healthy adults, also the age demographics have changed. StatsCanada actually has a good tool that shows the population pyramid and you can compare Spanish Flu in 1918 to 2020 and it'll have some similar-ish results to the USA [\\[5\\]](https://www12.statcan.gc.ca/census-recensement/2016/dp-pd/pyramid/pyramid.cfm?type=1&amp;geo1=01). There's also population pyramid tool here for the USA but it only goes back to 1950 [\\[6\\]](https://www.populationpyramid.net/united-states-of-america/2020/). \n\nBuddy of mine with access to a Bloomberg terminal sent this to me the other day which tracks the spread of the Corona virus [\\[7\\]](https://imgur.com/a/O4J6cuc). Think the code is 'Map Virus' or something. What matters is that we can see a very obvious trend of exponential growth, in fact that's how you model these things... This thing will spread like wildfire once it starts to hit the cities in America, and... already has. [All it takes is one 'chad spreader'](https://imgur.com/a/N542fqR) to jump on the subway and it'll be a matter of weeks and the entire city is infected. In fact it's already happened in Toronto so buy puts on $CANADA [\\[8\\]](https://www.theglobeandmail.com/canada/toronto/article-toronto-man-diagnosed-with-covid-19-used-local-transit-for-three-days/).\n\nWhat matters is that we can see that something like \\~60.8 million people who got H1N1 in the USA from 2009 to 2010 and this thing had an r0 of only like \\~1.5ish. The bat soup virus currently has an estimated r0 at \\~2.4 right now, mind you this is a number that varies through time and can decrease by human intervention (such as quarantines of cities), which will inevitably transpire... \n\nIf we assume that this thing spreads with even some level of similarity to H1N1 in 2009, this is going to be a bloodbath for the boomers. First and foremost, this will spread at a much higher rate among boomers and those in old folks homes, we've got evidence of that already [\\[9\\]](https://www.fox19.com/2020/03/07/coronavirus-concerns-stalls-cruise-ship-off-california/).\n\nBut that's not all. Italy is fucked. They just announced a quarantine of 1/4 of their fucking population [\\[10\\]](https://www.theguardian.com/world/live/2020/mar/08/coronavirus-live-updates-third-death-in-australia-as-cases-reach-more-than-70). Take wild guess how that's going to fare for their economy. The FTSE MIB is down shy of 20% from it's highs as it stands right now and its only going to get worse [\\[11\\]](https://www.marketwatch.com/investing/index/i945?countrycode=it). Given that the Italy  is basically a leading indicator of what's going to happen in the USA...  I fucking DARE YOU to buy spy calls.\n\nSo let's get to the nuts and bolts of this. Some autist named Dr. James Lawler stated that worst case scenario this thing could infect 96m in the USA and kill 480,000 people [\\[12\\]](https://www.independent.co.uk/news/world/americas/coronavirus-dr-james-lawler-warning-us-hospitals-infection-a9385031.html). However, funny enough his estimates are based on a mortality rate of 0.5%. The current mortality rate is \\~3.5% so, rather, we could be looking at up to 3,360,000 dying in the USA if the mortality rate is what it currently is.\n\nHowever, we can math this based on the population pyramids I posted above. In the USA if we take the known mortality rates and population pyramid and transpose that on the worst case scenario, we're looking at shy 1.9m dead (mostly older people) given that 30% get the virus in the next year [\\[13\\]](https://imgur.com/a/vfOz0Nf). If this spreads at the same rate as H1N1, then we're looking at a total of \\~60.8 million infected in a year's time. This corresponds to \\~18.6% of the population getting it and would result in \\~1.16m people dead [\\[14\\]](https://imgur.com/a/WUDaMza). \n\nNow, I'm willing to bet that my boy Donnie isn't interested in losing a massive chunk of his voting block so I'm betting that we see quarantines very soon in the USA, entire cities shut down just like we've seen in China and just like we've seen in Italy and Iran. It's going to happen and when it does, the lemmings will be shocked. I mean, this shouldn't come as a surprise, there's already runs on toilet paper in Australia over this thing [\\[15\\]](https://www.aljazeera.com/news/2020/03/australians-scrap-toilet-rolls-coronavirus-panic-buying-200308014116516.html). \n\nAnyways, I think we'll get a cure eventually and that everybody reading this will be fine, in fact I'm not a doomer whatsoever. Society will continue on and SPY will eventually recover and I'll join bull gang again, but I'm sure Monday will be a bloodbath after Italy quarantined like 16 million people.\n\nBut back to my point, just think about what'll happen to SPY when a US city announces a quarantine. They're already preparing for it by declaring states of emergency now [\\[16\\]](https://www.governor.ny.gov/news/no-202-declaring-disaster-emergency-state-new-york). The fear will be real and it already is...\n\nSo how do we profiteer from this? And what will inevitably transpire?\n\n&amp;#x200B;\n\n**Conclusion:**\n\nI know half of you retards skipped to here but kudos to the champions that read everything I wrote. \n\n1) General stock market decline, puts on $SPY or high beta stocks if IV isn't too high\n\n2) for my perma-bull frens, calls on funeral home and burial companies: $SCI, $CSV, $MATW, $PLC:CA, $DTY:UK, etc.\n\n3) Puts on old folks care homes because those are probably going to be vacant here very shortly and thus less cash flows to investors... stocks like: $WELL, $VTR $OHI, etc.\n\n4) I'm still bearish airlines and travel... I mean go look at the chart of $AAL. After 9/11 that stock went from $40 a share to literally $2 a share... in 2003. The same thing happened during the GFC, stock again went from over $40 a share to a fucking penny stock -- traded at like $0.30 per share. Get ready for round 3... I look forward to buying calls on airlines after this is all over.\n\n5) bearish any developing country/emerging market ETF's. They're going to get hit hard.\n\n6) I don't know anything about medical or medical research stocks but calls and puts on companies researching corona virus cure. Again... correct me if I'm wrong but to my understanding it's zero-sum, the company that gets a solid cure makes bank and the rest are fucked but again idk this isn't my area whatsoever. Also looks like a lot of these stocks are rocketing and IV is massive so I'm sitting on the sidelines on this one\n\nIf you're from r/all wanting to get in on the tendies, I saved a special one just for you! Go all in on $LVS 80C 3/13 calls, trust me. Cannot go tits up.",
        "subreddit": "wallstreetbets",
        "title": "COVID DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ffdrz0/covid_dd/",
        "created": 1583709003.0
    },
    {
        "author": "_WhatchaDoin_",
        "created_utc": 1585195448,
        "id": "fp4vxy",
        "num_comments": 635,
        "num_crossposts": 0,
        "selftext": "I wanted to share my experience of the 2008 bailouts because we are among friends. Right? And friends help each others, and share their experiences. Right?\n\nDuring the financial crisis of 2008, it became clear that the government had to step in. People were losing their jobs, stock market dropped by more than 30%, the market was going up and down by 5-10% a day (the amount my brokerage accounts would go up or down was more than what I was earning in a month at work). It was humbling.\n\nIt was really tough and difficult to trade. Buy on the down days? Sell on the up days? Hold it until sky clears, despite having bled a lot of money already? I was over leveraged too (through LEAP options), which was not the smartest thing to do at the time, but heh, are you going to lock the loss?\n\nThen came the bailout, with a lot of volatility leading to it. A lot of back and forth for days for politicians to get a chance to pass it. (They may have failed to pass the first version even, I don't remember).\n\nFinally, one of the branch passes it, and it's time for the other branch to pass it. \"About time, after the bailout, things are going to get better, we can save those companies, we can move ahead and blue sky is coming.\"\n\nI remember at the time, I was looking at the final votes, and I could not believe it. As the votes would come in, and it became clear that the bailout would pass, S&amp;P futures started to drop, like a stone. WTF!!! Help is coming, everything will get better, why is it dropping?\n\nWell, the reason is simple, by signing the bailout, politicians agreed that we were in a shitty situation, companies needed to be saved, and the lousy bailout was getting signed, and there was no more good news down the line for a while. We shot our ammos, and now let's pray. So it became sell the news.\n\nAs the market continued dropping days after days, and I was going to be wiped out, I had to sell to not be over leveraged anymore. I had to take a 6 figures loss. And I am fortunate that I sold, because the market continued to significantly tank for almost 6 more months to level I did not think we would reach. After selling, I was not taking as much risk anymore, I got burned hard.\n\nAfter we reached the bottom, I switched my positions to risky assets, and I was able to make up some of the losses. But that was a great learning experience, and I figured that I preferred to learn that lesson at the time, when my accounts were not too big than later. Recovering from a 6 figures loss is doable, but more than that, and it is a decade or more of setback.\n\nWell, I can say that almost 12 years later (fuck, already!), the situation is very similar.\nThis time, I was ready, and maybe that will be another post to explain what I did in 2019-2020, as it can be easily applied.\n\nSo today:\n- People were losing their jobs. Check.\n- Stock market dropped by more than 30%. Check.\n- The market was going up and down by 5-10% a day. Check.\n- Bailout in the process, taking days to agree on. Check.\n\nI am not saying that the market is going to drop after the bailout is voted, but watch out for that.\nUnlike 2008, there is no blue sky coming. The bailout is only a short term fix. How long do you think $1200 per person is going to last?\n\nUnlike 2008, we know that the worst is ahead of us. We still don't know. In the US, the coronavirus pandemic is expected to peak in at least 2-3 weeks. But who knows?\nAs we are doubling every 2-3 days, it could mean 100 times more new cases per day. 100 times more death per day (few weeks later the infection). It's absolutely a staggering and awful number.\nHopefully, lockdown will be enforced in every state, so we can reduce this grow rate.\nHospitals are already over capacity, nobody can tell exactly how this is going to end (except that's going to be a carnage).\nEsp. as some are talking about removing the lockdown in 2 weeks!\nAnd even after the peak, it means that people are still getting sick, people are still dying, as they are hospitalized for 2-4 weeks.\nExpect at least 1-2 months of pain, even after peak.\n\nI understand that the market is forward looking, but there are still many opportunities for false head starts, and failed bounces from the bottom.\n\nFrom my experience with the 2008 bailout, nobody could really predict the bottom. Even as it was a financial crisis.\nThis time, it is not looking pretty, so please don't be like the 2008-me, don't be over-leveraged (yet), things can go either way. Politicians are very good at messing up a crisis.\n\nAnd most of all, be safe and healthy, stay home as much as you can. It is going to be a rough ride, and unfortunately we are only getting started.\nMy sincere thoughts for people with friends and families that are going through hardship, sickness and death.\nHang in there!",
        "subreddit": "investing",
        "title": "My experience of the 2008 bailout",
        "url": "https://www.reddit.com/r/investing/comments/fp4vxy/my_experience_of_the_2008_bailout/",
        "created": 1585224248.0
    },
    {
        "author": "WittySmoke",
        "created_utc": 1583950708,
        "id": "fh1ney",
        "num_comments": 629,
        "num_crossposts": 0,
        "selftext": "Disclaimer: I’m a degenerate who likes looking at graphs and has a gambling addiction (but made 50% return today)\n\nHi yet again my fellow autists, as you can tell, my guess turned out to be correct and the market opened red today. This reinforces the trend and I will buy either calls or puts on SPY based on it before the closure today again.\n\nWhat happened yesterday: People were anticipating good news from Trump. Just like always he made himself an idiot (not surprising). Hence stonks went down.\n\nThis graph shows a reoccurring trend that basically happens every day for quite some time now. We can see that if the market closes with a 15 min green candle, it will open a lot lower the next day and vice versa. \n\nThis happens because we are in a very volatile market and people are scared to keep their stocks overnight. This means if the market is trending up at the end of the day people will be selling and if market is going down most see it as an opportunity. This results in the market going in the opposite direction on the next day opening. \n\nAdditionally, if we end up breaking the 173 resistance today and close with a green candle (15 min), the chance of it being bloody tomorrow is very fucking high.\n\n[https:\\/\\/imgur.com\\/a\\/fmwjS9x](https://preview.redd.it/a2m0c9wy33m41.png?width=2620&amp;format=png&amp;auto=webp&amp;s=1c4509a6fbf6a52d7c953453fafb8013be5e6ed2)\n\nId like to address a couple of comments from yesterday:\n\nFor the retard who mentioned recency bias. The whole theory of trading is based on the idea that   \na trend is more likely to continue than stop. This is different from flipping a coin since the market   \nfluctuations are caused my people's phycology, not mere chance.\n\nChanged the graph to the dark mode.\n\nAdded new arrows which look better and coloured them with my crayons.\n\n&amp;#x200B;\n\nTLDR for people with short attention span: If SPY is closing red, but calls. If SPY is closing green buy put.",
        "subreddit": "wallstreetbets",
        "title": "Back with SPY predictions",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fh1ney/back_with_spy_predictions/",
        "created": 1583979508.0
    },
    {
        "author": "Mr_Find_Value",
        "created_utc": 1584006266,
        "id": "fhdt30",
        "num_comments": 580,
        "num_crossposts": 0,
        "selftext": "If you've paid any attention to the financial news over the last 2 years, you've seen the questions and critiques about Warren Buffett's cash position. In almost every interview he's asked why is he stacking cash or why Berkshire isn't outperforming the S&amp;P 500. The majority of questions aren't as brazen, but rewatch some of his interviews and you'll see that 1 or 2 questions along those lines comes up. \n\nTake this article by CNBC:\n\n*Being in the enviable position of having that much cash to spend seems unenviable at the moment, as far as Berkshire shareholders, and maybe even Buffett, are concerned. Buffett’s company is currently on pace for its worst annual stock performance since 2009.*\n\n*“He pinned himself into a corner a few years ago, saying I can’t have $150 billion in cash in three to four years and say that’s alright,” said Greggory Warren, a Morningstar analyst who covers Berkshire Hathaway.*\n\n*Underperformance versus the index, deals that have not worked out well, such as Kraft Heinz (thought it showed signs of life in its most recent earnings), and increasing willingness on Buffett’s part to consider share buybacks, all point to the the importance of moving that cash into investments that generate a return.\"*\n\nhttps://www.cnbc.com/2019/11/01/even-obvious-way-for-buffett-to-solve-big-cash-problem-is-a-puzzle.html\n\nI can spend all day finding each and every article from the past 2-3 years but you understand my point. \n\nAs stocks soared to all time highs, people wondered just as they did during the tech boom whether Buffett had lost his touch. Now Buffett is sitting on a 125+ Billion dollar mountain of cash just biding his time. He's poised more favorably than he could ever ask for, and prices are just getting more reasonable by the day.\n\nTLDR: When you see Buffett stacking cash, he's not an idiot. He's waiting for prices to become reasonable again, which only happens after a significant market decline. \n\nI'm not saying he's an oracle, but he's rarely wrong.",
        "subreddit": "investing",
        "title": "Warren Buffett, as always, looks like the smartest guy in the room.",
        "url": "https://www.reddit.com/r/investing/comments/fhdt30/warren_buffett_as_always_looks_like_the_smartest/",
        "created": 1584035066.0
    },
    {
        "author": "RainMKR",
        "created_utc": 1585416958,
        "id": "fqol7h",
        "num_comments": 570,
        "num_crossposts": 0,
        "selftext": "Hey. Let me tell you about how WSB is getting screwed even when it’s right. It’s a novel so go make some tea.\n\nThe past week has been crazy. 3m unemployed and stocks only went up. Makes no sense, right? Wrong. What you guys need to realize is that the market is not an omnipotent being that prices in every move and plays 4d chess. It’s more like a caveman, driven by greed and fear. Especially during this time.\n\nThree weeks ago, everything was fucked. Not because the virus was spreading, which it always was, but because people started to realize how bad it was and began panic selling. And the trigger was the oil crisis over the weekend that led to bloody Monday. Leveraged funds exploded. Investors were getting margin called or panic sold. Treasuries were basically unobtainable. Corporate bond issuances completely froze. Credit default swaps skyrocketed. Commercial REITS were fucked because they needed to sell illiquid assets to meet fund outflows. Every company was maxing out its credit lines with the banks…you get the idea.\n\nIt was like a run on the banks, but for corporations and investors. That’s what drove the markets down. Plain and simple. It was FEAR of a LIQUIDITY CRISIS.\n\nThen Powell stepped in with his alphabet soup of liquidity mechanisms. ZIRP, PDCF, MMLF, CPFF, FX Swap, TALF, PTIF, ESF, SMCCF, PMCCF. I made up one in there and it doesn’t even matter.\n\nWhat mattered was that, suddenly, the liquidity crisis vanished. The fund backstopped everything with its QE infinity. Yield spreads fell back. People didn’t need to margin sell anymore. Foreign dollar denominated debt wasn’t about to fuck up an emerging world country economy. THAT’s what rallied the market. Immediate FEAR was taken out. And that’s why all the “but worldometer virus count doubles every three days so markets go down” geniuses got screwed.\n\nFor better or worse, with the Fed promising QE forever, the liquidity crisis is now no longer a thing. What comes next will be more ominous: a solvency crisis.\n\nLiquidity is basically any company’s ability to pay very short-term liabilities, like payroll, interest, rent, etc. in the VERY IMMEDIATE TERM. It's about access to cash. For financial markets, it’s also how easily investors can get in and out of positions. Powell lubed the shit out of liquidity.\n\nSolvency, on the other hand, is about the company’s ability to meet LONG TERM debt obligations with its operations. When you talk about unemployment, no consumer spending, high corporate debt load,etc, what you’re really talking about is a solvency issue. Companies can’t produce the revenue to service their debts.\n\nCorporate debt levels are astronomical today. Higher than any level in history. At same time, the virus is not slowing. Consumers and companies are not going to spend. Unemployment is through the roof. The fundamentals are really, really bad.\n\nBUT here’s the kicker, now we’re talking about fundamentals, and NOT fear. The market will trade down because the fundamentals are bad, not because its panicking for lack of liquidity, and that will take time.\n\nWhat I’m saying is yes, the outlook is atrocious and the market deserve to be much lower. BUT it will take much longer to play out because people are no longer panic selling. The Great Depression took 3 years to get from its high to bottom after Bloody Thursday/Tuesday.\n\nYes, maybe the SPY will hit 180 or even lower. BUT it may take 6 months to get there. Meanwhile your OTM 4/17 puts will bleed on theta and never get ITM.\n\nWe’re still at a time of VIX backwardation, meaning expected volatility in the more distant future is LESS than in the near future. I think this is bullshit and an opportunity. With a solvency crisis, it’s a slow burn all the way down.\n\nOr I’m just full of shit.\n\nTL;DR: look for long-dated puts. July, September, or even later. Buckle up and pay the premium. Be careful with very short term, very OTM options. Volatility will likely go down even as stocks go down.",
        "subreddit": "wallstreetbets",
        "title": "From Liquidity to Solvency Crisis: Why WSB is getting screwed even when it’s right",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fqol7h/from_liquidity_to_solvency_crisis_why_wsb_is/",
        "created": 1585445758.0
    },
    {
        "author": "XXXTentacIes",
        "created_utc": 1584316533,
        "id": "fjb97s",
        "num_comments": 568,
        "num_crossposts": 0,
        "selftext": "[Post ](https://imgur.com/gallery/5GTrZlK)\n\nOne day after this is posted, one day before the biggest crash in history again, on the day we hit a million subs... all hell broke loose and the autists were flying around like locusts in Africa. \n\nThe OP’s whole account is now gone. I think he pissed off some big boys and something had to be done. In case something ever happens again, here; \n\n[Archive of WSB](https://webcache.googleusercontent.com/search?q=cache:ovX39fGJr80J:https://www.reddit.com/r/wallstreetbets/+&amp;cd=1&amp;hl=fr&amp;ct=clnk&amp;gl=ca)\n\n[Archive of OP’s Acc](https://web.archive.org/web/20200313143830/https://www.reddit.com/user/Separate-Variation/)https://web.archive.org/web/20200313143830/https://www.reddit.com/user/Separate-Variation/",
        "subreddit": "wallstreetbets",
        "title": "The WSB War: How Going Private Set Up An Engineered Distraction From Making The MM DD Disappear",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fjb97s/the_wsb_war_how_going_private_set_up_an/",
        "created": 1584345333.0
    },
    {
        "author": "__justsayin__",
        "created_utc": 1583080527,
        "id": "fbwi8y",
        "num_comments": 561,
        "num_crossposts": 0,
        "selftext": "Companies have endured financial meltdowns, civil wars and natural disasters. But nothing in modern memory has dented both demand and supply so quickly for so many industries as the coronavirus.\n\nThe virus, which has infected more than 85,000 people, has quickly spread through Asia and Europe, disrupted global travel and hobbled supply chains that churn out everything from smartphones to pharmaceuticals. In days, it went from pockets of woe to the top concern of chief executives world-wide.\n\nConferences are getting canceled, from the Geneva International Motor Show to Facebook Inc.’s F8 developer gathering in California. Disneyland Tokyo is closed. Auto suppliers are warning of parts shortages. Generic drug manufacturers are paying 50% more for some raw materials.\n\nThe widespread nature of the epidemic and related uncertainty will put a hold on large corporate investments, mergers and hiring, said Stanford University economist Nicholas Bloom, who has researched the impact of uncertainty on business cycles.\n\n“A lot of the damage is already being inflicted purely from major decisions being delayed,” Mr. Bloom said. “I can’t see many firms green-lighting any projects until they can figure out what is going on.”\n\nLarry Kudlow, director of the White House’s National Economic Council, said Friday the threat from the virus for Americans is low and the “coronavirus is not going to sink the U.S. economy.” Some in the White House have blamed the media’s coverage of the outbreak for exaggerating the situation and causing hysteria.\n\nThe virus surfaced as U.S. companies were riding atop America’s longest economic expansion on record, matched by soaring stock-market returns. But profit growth for S&amp;P 500 companies started to cool last year, squeezed by rising labor costs and trade disruptions.\n\nOfficial Chinese government gauges of activity in the manufacturing and services sectors plunged to record lows in February, the country said Saturday, dropping deep into territory that indicates a contraction.\n\nIn the U.S., business activity in February fell to its lowest level in more than six years on fears of the epidemic.\n\nIn February, 129 companies in the S&amp;P 500 discussed “coronavirus” in their quarterly earnings calls, up from 60 in January, according to a Wall Street Journal analysis of transcripts. There were nearly 600 mentions of the virus in companies’ security filings in the past week alone, according to Kaleidoscope, a research firm.\n\nExecutives have talked about how the virus will slow consumer spending on products from Crocs sandals to Gucci handbags. It has slowed production at nickel mines in Indonesia and halted the filming of “Mission Impossible 7” in Venice.\n\nAt the same time, many companies have cautioned it is too soon to tell how serious an economic problem the virus will be.\n\n“Every CEO that I know has got to manage an employee dimension, supply-chain dimension, in many cases a revenue dimension,” as well as Wall Street’s needs, said Mike White, who ran PepsiCo Inc.’s PEP -3.18% international division in 2003 when SARS hit. He now sits on the boards of Whirlpool Corp., WHR -2.73% Kimberly-Clark Corp. KMB -2.10% and Bank of America Corp. BAC -2.16% “We’re still in the middle of the river here,” he said.\n\nWhirlpool cited its sales and supply chain in China and elsewhere in Asia in trimming its first-quarter profit guidance Friday. The appliance maker said the outbreak in northern Italy, where it has manufacturing operations, would hurt sales there too.\n\nSome companies that have tried to gauge the impact of the virus have had to revise initial estimates. Emerson Electric Co., EMR -0.42% which makes factory automation equipment, warned on Feb. 13 the virus would reduce quarterly sales by $75 million to $100 million. On Friday, it put the damage as high as $150 million.\n\nOn Friday, United Airlines Holdings Inc. UAL -5.16% postponed until September an investor meeting that was scheduled for March 5, saying it couldn’t have a productive conversation on its long-term strategy until the virus abates. United also is offering certain pilots the option of taking April off with reduced pay, according to a letter from the pilot union chairman to members.\n\nAirlines have taken one of the hardest, earliest hits from the spread of the virus. Asian and European carriers have implemented cost-cutting measures to accommodate canceled flights to China and curtailed services to other affected areas such as Italy.\n\nAs the spread of the virus in China has slowed, some Chinese factories are reopening, though many are short-staffed and transportation is still difficult. For example, smartphone makers are expected to ship 64 million fewer devices in the first half of 2020, market researcher International Data Corp. said, hampered by component shortages and quarantine mandates.\n\nZuru Ltd.’s factories have reopened in phases over the past few weeks, after the toy maker installed dividers between workspaces and added sanitation stations. But the Shenzhen-based company is thinly staffed due to restrictions on China travel and was operating at 20% capacity last week, said co-founder Anna Mowbray. “There’s definitely going to be holes on shelves,” she said.\n\nIn other countries, the disease is still spreading. Hyundai Motor Co. on Friday stopped building its popular Palisade SUV and other U.S.-sold SUVs after a factory worker in Korea tested positive for coronavirus. Google said Friday one of its employees in Zurich had been diagnosed, but the office remains open.\n\nSome companies are getting hit in multiple ways. Water-heater maker A.O. Smith Corp. AOS -1.42% detailed its situation in a securities filing: It has resumed operations in China but at below-normal levels. The stores where its products are sold are mostly closed or operating on reduced hours with significant decline in customer visits, the Milwaukee-based company said. Its products require professional installation, which is limited because of disease containment efforts in China, it said.\n\n\nChina is a key supplier of chemical and raw materials used by many pharmaceutical manufacturers, a potential problem for popular blood-pressure medicines and several older antibiotics that are no longer manufactured in the U.S.\n\nExperts believe China is also the only maker of key ingredients in a class of decades-old antibiotics known as cephalosporins, which treat a range of bacterial infections including pneumonia.\n\nAutomotive suppliers are warning car companies they could run out of certain parts used in North American factories in coming weeks, with particular concern over potential shortages of electronic components. Hoping to stave off factory stoppages, some manufacturers have taken the unusual and costly step of flying in critical parts by cargo planes.\n\nVehicle sales in China plummeted 92% in the first 16 days of February, according to the China Passenger Car Association. Several suppliers have cut profit forecasts in recent days because of the fallout, including electronics suppliers Aptiv PLC and Visteon Corp., and seat maker Adient PLC.\n\nSome companies have benefited from the outbreak, which has spurred buying of respiratory face masks and disinfecting wipes, propping up the shares of some of the companies that make them. Clorox Co. CLX -5.50% ’s stock briefly hit record highs last week while the broader market plunged.\n\n“The good news is that the shock from the virus is hitting at a time when households appear to be in good shape,” wrote Bob Schwartz, a senior economist with Oxford Economics.\n\nMr. White, the former PepsiCo executive, said the long-term economic outlook is solid but there is short-term pressure on companies. “Almost every company is going to have an issue with their first quarter numbers,” he said.\n\nhttps://www.wsj.com/articles/coronavirus-is-different-almost-no-company-is-safe-11583064000?mod=hp_lead_pos3",
        "subreddit": "investing",
        "title": "WSJ: Coronavirus Is Different. Almost No Company Is Safe.",
        "url": "https://www.reddit.com/r/investing/comments/fbwi8y/wsj_coronavirus_is_different_almost_no_company_is/",
        "created": 1583109327.0
    },
    {
        "author": "buhlmbo",
        "created_utc": 1584398957,
        "id": "fju4sm",
        "num_comments": 548,
        "num_crossposts": 0,
        "selftext": "my dad was at a loss of almost 90k from autistic advice that he got from his friends(its possible to be autistic outside of this subreddit). after him literally yoloing all his money into some retarded stocks and losing most of it, he finally saw the wisdom in my autism. he saw my gains with options(he didnt know what they were)and gave me access to his account and 10k so i don't lose even more of his money. in a week i was able to make that 10k into 90k, and now he looks upon his own child like the fallen child of zeus.\n\nall jokes aside though, i am really happy that i was able to make my dad some money, and i really hope some of you dumbasses do some good with your money\n\n[now time to figure out how i can lose it all](https://preview.redd.it/n3cbu1l464n41.png?width=987&amp;format=png&amp;auto=webp&amp;s=31576c43a4725f90f2f66fcf9df7f2800943d438)\n\n&amp;#x200B;",
        "subreddit": "wallstreetbets",
        "title": "thanks to options dad has money now",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fju4sm/thanks_to_options_dad_has_money_now/",
        "created": 1584427757.0
    },
    {
        "author": "Thqsca",
        "created_utc": 1585234146,
        "id": "fpcr3i",
        "num_comments": 547,
        "num_crossposts": 0,
        "selftext": "Hi all,\n\nThe markets are on track for a third straight green day with Dow currently at +4% at the time of this writing, and having that crazy rally 3 days ago with 13%\\~ increase.\n\n Historical unemployment rates that are worse than the great depression and no solution in sight for the virus (especially in the US with the president not taking action with a full lockdown) means that there are many more deaths to come. The tourism, entertainment and sports industries (among full others) are completely crushed. And we still didn't get to the supply chains issues (Iphone 12 has been postponed by a few months already, total smartphones shipments have decreased YoY in the most amount ever, etc).. What makes America a powerhouse - consumerism - is on hold. So why are the stocks going up? Is this truly phase 2 of a bull trap or magically the US decided that printing money and offering 2 trillion dollars will solve everything and they were right?\n\nMaybe I'm stupid, maybe I waited to much on the sidelines (I have 6 figures to invest and haven't touched it yet) but when you hear that even the Olympics got postponed which only happened previously in history at war times, it's almost 'obvious' that the market will at least crash more than 2008. \n\nSo, thoughts? Yeah, I know that this might be the daily what if thread but also I'm truly confused. Would love your thoughts on this wild market right now.",
        "subreddit": "investing",
        "title": "The one billion dollar question - are we in a classic bull trap?",
        "url": "https://www.reddit.com/r/investing/comments/fpcr3i/the_one_billion_dollar_question_are_we_in_a/",
        "created": 1585262946.0
    },
    {
        "author": "lValientl",
        "created_utc": 1584462230,
        "id": "fk83h7",
        "num_comments": 544,
        "num_crossposts": 0,
        "selftext": "I’ve never posted here but I have been lurking for about 2 years now. \n\nThere was something about the old logo that instilled some sort of twisted pride. That even though we just lost our college federal aid on SPY puts, we could keep our head up high.\n\nThis new little baby looks weird as hell and now I get an inverse boner when I browse this sub.",
        "subreddit": "wallstreetbets",
        "title": "Change it back please.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fk83h7/change_it_back_please/",
        "created": 1584491030.0
    },
    {
        "author": "cookingboy",
        "created_utc": 1583788909,
        "id": "fg24jc",
        "num_comments": 538,
        "num_crossposts": 0,
        "selftext": "WSJ article: https://www.wsj.com/articles/italy-bolsters-quarantine-checks-after-initial-lockdown-confusion-11583756737\n\nI think at this point it's safe to day any comparison of Covid19 to recent epidemics like H1N1 Swine Flu and SARS is obsolete and we are in uncharted territory now. A major country of the EU is now under full quarantine with only essential travels allowed within the country. Other countries like Germany and France currently have more cases than Italy did 2 weeks ago, so there is material risk of equal economic impact to those countries as well.\n\nI don't know where this is going in, but it will likely get worse before getting better.",
        "subreddit": "investing",
        "title": "Italy extends quarantine to entire country.",
        "url": "https://www.reddit.com/r/investing/comments/fg24jc/italy_extends_quarantine_to_entire_country/",
        "created": 1583817709.0
    },
    {
        "author": "greyacademy",
        "created_utc": 1584691568,
        "id": "flrapu",
        "num_comments": 537,
        "num_crossposts": 0,
        "selftext": "[Here it is.](https://imgur.com/Fn0eRgD)\n\nI like data, and I collect a lot of it (on stonks I like). Anything I can get my hands on, scrape, collect at eod, it's mine. Anyway, after shoving it all through my little model, this is the end result. I kept it simple for you. No fancy lines you don't need, just today's price, the trend, and some rounded pinpoint averages I'm getting. Do whatever you want with it, this is my baby, but now I have given birth, put it up for adoption, and I take no responsibility. At the very least, for those of you with longer dated puts, hopefully this will help you rest easy. ️‍Make note, it could spike way further up or down in the short term, the day by day plays are too difficult to calculate. The trend is what is important. The same model is also suggesting gld is going to peak around mid May, so I'm kind of buying into the ~~results~~ euphoria right now.\n\n🌈👐💎👐️‍🐻👐💎👐️‍🌈\n\nfor you:\n\ness peee whyyy 2--2--0--p maay lst (210 if you're feelin' lucky). It's not like I'm telling you something you didn't already know, but confirmation bias is one hell of a drug. Long live SV.\n\nfor the bots:\n\n2019/05/01 SPY 300c",
        "subreddit": "wallstreetbets",
        "title": "I made a late night SPY graph for you",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/flrapu/i_made_a_late_night_spy_graph_for_you/",
        "created": 1584720368.0
    },
    {
        "author": "Sparkswont",
        "created_utc": 1584272138,
        "id": "fj01ua",
        "num_comments": 532,
        "num_crossposts": 0,
        "selftext": "[Verification](https://imgur.com/a/tSGMfRs)\n\nAlright I’m going to need someone to explain just exactly what in the fuck is going on because last I checked SPY was still $300. You can imagine my surprise when today we pulled into the Manhattan Cruise Terminal at 3am and I see we had 2 god damn circuit breakers in one week.\n\nBefore the cruise started, Pence announced all tendies were safe and stonks only go up so I sold all my put positions (now worth upwards of $80k). Fuck me.\n\nFeel free to ask me questions about NCL and the cruise, what it’s like to denounce homosexuality but still get fucked in the ass, or any other interesting topics.\n\nFuck.",
        "subreddit": "wallstreetbets",
        "title": "Just returned home from a 7 day Norwegian cruise with no service and no wifi - AMA",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fj01ua/just_returned_home_from_a_7_day_norwegian_cruise/",
        "created": 1584300938.0
    },
    {
        "author": "Washington_Nationals",
        "created_utc": 1584130861,
        "id": "fi6473",
        "num_comments": 532,
        "num_crossposts": 0,
        "selftext": "Listen, for those of us who ~~stepped in shit~~ **loaded up on calls** and were in the right place at the right time with positions, we got lucky.\n\nIn reality, there is a world of hurt out there. Think about how depressed you were the first time you blew your account... That's the fear most of ~~the world~~ **WSB** has right now with their ~~life savings and retirement funds~~ **entire accounts in SPY puts and DIS puts.**\n\nMore importantly, people are actually worried ~~about the health and safety of the people they love~~ **that Boomers might actually survive this thing.**\n\nWe didn't start the ~~fire~~ **big dick rally**, and if bankers make money on ~~bad events~~ **Big D rallies** why not autists as well. I agree. Be safe, play the market.\n\nJust don't fucking dance",
        "subreddit": "wallstreetbets",
        "title": "Just don't fucking dance 2.0",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fi6473/just_dont_fucking_dance_20/",
        "created": 1584159661.0
    },
    {
        "author": "Jackovdajakoff",
        "created_utc": 1584197258,
        "id": "fijg32",
        "num_comments": 515,
        "num_crossposts": 0,
        "selftext": "For those of you so eager to buy back in, it would be good to get educated on what a bear market actually is. It's not just a term for stocks going down or a particularly deep dip to buy. \n\nBear markets act a certain way, last a certain amount of time and certainly don't magically reset back into the last bull market we had. There will be a new bull market (at some point) but it likely will be very different from the nature of the one that is now dead and buried that we all loved so much from 2009 - 2020. Expect different market leadership, different return patterns and certainly a different duration. \n\nThe good news is that typically the sharper the drop into bear market territory, the quicker the recovery is. \n\nThis is a decent primer from AP: [https://apnews.com/de346fd365b1e91cc0c204f68bed700d](https://apnews.com/de346fd365b1e91cc0c204f68bed700d)",
        "subreddit": "investing",
        "title": "S&amp;P 500: The shortest bear market in history lasted 3 months. The longest lasted more than five years. The average lasts 14 months.",
        "url": "https://www.reddit.com/r/investing/comments/fijg32/sp_500_the_shortest_bear_market_in_history_lasted/",
        "created": 1584226058.0
    },
    {
        "author": "Coach__Mcguirk",
        "created_utc": 1584114205,
        "id": "fi1m96",
        "num_comments": 512,
        "num_crossposts": 0,
        "selftext": "https://twitter.com/JenniferJJacobs/status/1238485355998973953?s=20\n\n🌈🐻\n\nBuy ur fucking PUTS.\n\nThis shit is no where closed to finshed. We are in this for the Long haul and the markets are going to react.\n\nRED fucking weekend RED Monday. Lock them in now.",
        "subreddit": "wallstreetbets",
        "title": "Trump is about to declare national emergency",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fi1m96/trump_is_about_to_declare_national_emergency/",
        "created": 1584143005.0
    },
    {
        "author": "RootsIV",
        "created_utc": 1585271812,
        "id": "fpnvdh",
        "num_comments": 512,
        "num_crossposts": 0,
        "selftext": "Guys, lets be real. I've read the opinions of every hey googler and Robinhood gambler and all they do is confuse things so let an industry professional of 15 years tell you some of the facts. About history and the potential future.\n\nIn 2008, the unraveling of the financial system was caused by absolutely over-leveraged risky assets that became too much, and were the \"straw that broke the camels back\" in a big way. It was caused by gross ignorance and greed on a level that we might never see again. Debt issued to people who were obviously never going to be able to pay it back, bundled together and sold to large institutions, they were considered invincible, and many regular people's retirement accounts were comprised of securities in which these were the underlying asset. When the pool of shit that was all of these subprime mortgages that were issued to people who could never even wink at paying them back began to see higher defaults, the value of these assets tanked, and investors' heart rates started to climb as they saw the market for the underlying dry up. This was just the warm-up, the shot from the starting gun to initiate the sprint to the bottom came when Bear Stearns went tits up.\n\nA quick and over-simplified recap of what happened to them goes like this:\n\n\\-They bought tons of highly leveraged CDOs full of garbage mortgages that were somehow rated AAA, which is an investment grade given to instruments that are safe enough for retirement accounts and bank capital reserve requirements.\n\n\\-Because they were so highly leveraged, they were able to purchase well beyond their capital abilities, this was risky, so they bought Credit Default Swaps, which is insurance that protects them against unexpected market behaviors, and also provides a steady amount of income in calm conditions. This is what investors like to call a \"hedge\" because its an investment to protect another investment to some degree.\n\n\\-In 2007, delinquencies started to rise as people began to struggle to pay their mortgages more and more, this worried investors as the value of these CDOs began to fall. The fund started taking losses and people who had lended money to help BS finance this strategy began to request cash t cover losses, essentially a margin call on the firm. While they had insurance it wasn't covering their losses so they started to sell the underlying mortgages in bigger and bigger amounts to raise cash. Other institutions smelled blood in the water and began to accelerate the decrease in value of the mortgages to force BSs hand. These CDOs eventually became worthless, bankrupting the fund and toppling the institution, who was acquired by JP Morgan Chase through a Fed Loan.\n\n\\-This caused complete panic on Wall Street because banks could not make fair assumptions on the values of portfolios and this made them decrease lending to each other out of fear. No one really knew where all of these shit sandwiches were and what they could do.\n\n\\-This spread to other banks as there was a credit crunch and no one could borrow, banks began to struggle to come up with liquidity which quickly led to a bailout and a fat recession.\n\nThis is different from what we are experiencing now. Those toxic assets were nestled in mom and pop retirement accounts and were ultimately acquired by the US govt in a massive bailout for cents on the dollar to keep these institutions from wiping accounts to zero and destroying all of peoples life savings.\n\nIn this situation, we were in a slight bubble yes, many of these companies were overvalued and over-leveraged, but, with business humming along it was working out. Now the beer virus comes along and halts everything. Airlines, grounded. Factories, closed. Restaurants, take out only. Offices, closed.\n\nCompanies have lost their ability to conduct business as usual, and for this reason aren't pulling in enough revenue to pay their expenses. So what do they do? The lower their expenses. The highest generally being payroll, so they start by offering as much paid leave as they can to be nice and try to make the best of the situation, but they can only do that for so long with the cash they have on hand, if they even have any.\n\nNow here's where it gets interesting.\n\nLooking ahead, these companies and small businesses have no idea when this will end, they're developing contingency plans and planning as far into the future as they can. This is what they will have to come up with.\n\nNot knowing how long this will last, the SMART business decision for them is to lay off or fire as many of their workforce as they can while still operating the best they can in these conditions. This makes sense for them because they know every other company is doing the same thing, driving labor supply up and decreasing wages, meaning when they hire employees back at the end of this they will be able to pay them less. Saving them money now and in the future. As an average Joe wondering what the future will hold for his paycheck and the market we can deduce a few things.\n\n1) This isn't going to get better soon, no we haven't hit the bottom and don't ask me when because there is no knowing. Don't look to 2008 because it's just not the same scenario and it is likely to play out different this time. Don't take my word for it but I think we are going to see choppy swings up nd down for a few weeks but they will generally trend in the direction of market sentiment, AKA is this getting better or worse. For now you can expect it to trend down because Beer virus isn't even done with its dynamic warm up before this Pornhub Premium level of fucking.\n\n2) Market prices shouldn't even be a worry of yours, even though you are here for advice of which stocks to buy or which options to gamble on, it would be best to either buy for value or consolidate into cash because the stock market is not behaving right and its got to do with the Fed doing funky things that no consumer will ever find out about.\n\n3) Unemployment will shoot up, and it will take a LONG time to come back down. Corporate profits will suffer and GDP is about to pass the kidney  stone of the century. Our economy is under siege, while it is in its early stages and if this went away tomorrow life would go back to normal, that is not going to happen and the effects of this will only be worse as time goes on. Big Donald says he wants to get things going again but he's just jealous of China going back to normal despite them trying to hide the fact that there will most likely be another outbreak there. Best to play it safe and kill this thing for good before we return to business but if I have learned anything about our Oompa Loompa in Chief is that he tends to pick up the picture book full of good ideas and stand on it so he looks taller during his COVID-19 press shit-shows. The effects of his inadequacies haven't hit yet but they will and he will be remembered for them, take no shelter in anything he says no matter how tempting it is.\n\nI feel like I have gotten terribly off topic but I just wanted to spew out some shit that's been rotting in my head and making a stench, also I'm sick of people trying to look to 2008 on advice of how or where the bottom will come upon us. This is a different animal, look for other indicators, specifically what the Fed is doing, and remember, the grass grows greener where the cash is, follow it.\n\nStay strong, plan ahead. This is the way.",
        "subreddit": "investing",
        "title": "Stop Comparing This to 2008",
        "url": "https://www.reddit.com/r/investing/comments/fpnvdh/stop_comparing_this_to_2008/",
        "created": 1585300612.0
    },
    {
        "author": "Pi-R-Squared",
        "created_utc": 1584030533,
        "id": "fhj1eb",
        "num_comments": 507,
        "num_crossposts": 0,
        "selftext": "The time is now. While everyone else is panicking this is your chance to find good discounts. Just make sure to follow some simple rules:\n\n1) If you have no idea what to invest in, invest in big names like Coke (KO), Microsoft (MSFT), Bank of America (BAC), or ETF's such as SPY, QQQ etc. It is really important that you don't put all your eggs in 1 basket so spread out your investments among the big names you know or an ETF to cover you. **This is the \"set it and forget it\" route. Invest in these types of companies/ETF's and don't look at your account for a while.** \n\n2) If you are feeling a little more gutsy you can invest in some companies that have been hit hard by the world events. Think banks, oil, leisure companies (like carnival (CCL)), think Airlines (DAL, AAL, etc.) Exxon (XOM), Chevron (CVX), BP (BP), and others. **I don't advise you doing this unless you can stomach heavy negative swings. I can't stress this enough.**\n\n3) Remember you are going to see wild swings from day to day. Don't let positive days make you feel like you know everything, and conversely, don't let red days make you feel like you have lost it all and you never should have done this in the first place. It is really important to keep your emotions out of the market. which leads to my next point.\n\n4) Only invest money you can afford to invest (aka: you will be fine without that money for at least 12 months). If you can't afford it and you invest you are basically gambling and there is no way to be rational with money you cannot afford to be without. \n\n&amp;#x200B;\n\nRight now is a great time to invest because there are companies out there that are heavily discounted that normally aren't this cheap. Do your best to take advantage of this moment, and try to keep a cool head while the general public is not calm.",
        "subreddit": "stocks",
        "title": "For those who are wondering when is a good time to invest...",
        "url": "https://www.reddit.com/r/stocks/comments/fhj1eb/for_those_who_are_wondering_when_is_a_good_time/",
        "created": 1584059333.0
    },
    {
        "author": "dlkdev",
        "created_utc": 1583747274,
        "id": "ffsa0j",
        "num_comments": 503,
        "num_crossposts": 0,
        "selftext": "I propose that this day henceforth be remembered in WSB history as \"Blacked Monday\". TLDR: [https://imgflip.com/i/3rvyio](https://imgflip.com/i/3rvyio)\n\n\nAnyway, here's the current status of the TQQQ holdings. As of 3/6 close:\n\n* Cash: $473,293,501\n* Swaps: $10,079,880,246\n* NQH0 futures: $127,408,320\n* Leveraged exposure (swaps + futures): $10,207,288,566\n* Stonks: $4,392,433,163\n* Cash / LEVEX: 4.63%\n* Cash / Total Exposure: 3.24%\n* Stock / Cash: 928%\n\nAs of right now, TQQQ premarket -15.67%, NASDAQ futures limit down,  est. with NDX @ -5.5%:\n\n* Cash balance: -$81,099,913\n* Swap loss:  -$554,393,414\n* NQH0 futures loss: -$7,007,458\n* Stonk loss: -$241,583,824\n\nEst. with NDX @ -7% (cash hours 1st circuit breaker)\n\n* Cash balance: -$747,883,991\n* Swap loss:  -$1,221,177,492\n* NQH0 futures loss: -$15,435,518\n* Stonk loss: -$532,143,278\n\nSo, cash balance negative. @ -7%, cash balance very negative. Looks like today might be the day it died, bois.",
        "subreddit": "wallstreetbets",
        "title": "TQQQ Blacked Monday Update",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ffsa0j/tqqq_blacked_monday_update/",
        "created": 1583776074.0
    },
    {
        "author": "seaoflands",
        "created_utc": 1584732333,
        "id": "fm10uo",
        "num_comments": 499,
        "num_crossposts": 0,
        "selftext": "(I'm calling it early and writing this post to cancel out the influx of any other upset users)\n\n FUCK Y'ALL GODDAMN WITCHER BULLSHIT DD. Jesus Christ every time I listen to this sub I lose money. I'm inversing everything you do from now on. I know there's thousands of other autists who got fucked too. So from the bottom of our hearts: fuck you.",
        "subreddit": "wallstreetbets",
        "title": "There really only needs to be one post about this.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fm10uo/there_really_only_needs_to_be_one_post_about_this/",
        "created": 1584761133.0
    },
    {
        "author": "1poundbookingfee",
        "created_utc": 1585254871,
        "id": "fpj3o5",
        "num_comments": 486,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Updated the map. We are now here.",
        "url": "https://i.redd.it/676ny2f3v2p41.png",
        "created": 1585283671.0
    },
    {
        "author": "Mug_of_coffee",
        "created_utc": 1584915538,
        "id": "fn8gj2",
        "num_comments": 484,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2020/03/22/stock-market-futures-open-to-close-news.html\n\nU.S. stock futures opened sharply lower on Sunday night as Wall Street waits on Washington to agree to an economic stimulus and rescue plan to combat the giant economic blow from the coronavirus outbreak.\n\nDow Jones Industrial Average futures fell more than 900 points, or 5%, to hit their “limit down” level. S&amp;P 500 and Nasdaq 100 futures were also down around 5%. Downside limits to futures contracts are implemented to ensure orderly market behavior. \n\nFutures could be highly volatile as headlines come out of a coronavirus task force news conference Sunday evening and as traders await news on a stimulus bill agreement (or lack of one).\n\nTreasury Secretary Steven Mnuchin said Sunday that financing programs to stimulate the economy could be worth $4 trillion, noting these efforts will include coordination with the Federal Reserve to provide businesses with necessary liquidity.\n\n“When this started, this was a bit unique to the airline industry since we had shut down most of airline travel,” Mnuchin said. “This liquidity facility is a broad-based liquidity facility working with the Fed.”\n\nNational Economic Council Director Larry Kudlow also said Saturday an economic stimulus package will total more than $2 trillion, noting it will be equal to roughly 10% of U.S. economic output. Last week, President Donald Trump signed a $100 billion bill that expanded paid leave in the U.S.\n\nHowever, House Speaker Nancy Pelosi, D-Calif., signaled she is not on board with the Republican-version of the stimulus plan, saying: “From my standpoint, we’re apart.” Senate Majority Leader Mitch McConnell moved a procedural vote related to the stimulus package to 6 p.m. from 3 p.m.\n\nDavid Kostin, chief U.S. equity strategist at Goldman Sachs, said the difference between a fast or a prolonged recovery in the stock market will come down to three factors: How quickly the virus is contained, whether businesses will have ” access to enough capital and liquidity to last the 90 to 180 days,” and whether fiscal stimulus can stabilize growth forecasts.\n\n“If short-term shutdowns lead to business defaults, closures, and permanent layoffs, the damage to corporate earnings growth could persist well after the virus is contained,” Kostin said in a note. \n\nWall Street has been clamoring for fiscal economic relief as the number of coronavirus keep surging. The number of confirmed global cases surpassed 300,000 over the weekend as deaths now total over 13,000, according to data from Johns Hopkins University.\n\nIn the U.S., more than 30,000 cases have now been confirmed. New York Gov. Andrew Cuomo said Sunday cases in the state soared to 15,168 over the weekend. That’s more than in France or South Korea. \n\nThe outbreak has led the New York Stock Exchange to close its trading floor and temporarily move to all-electronic trading beginning Monday. NYSE expects trading to proceed as normal. \n\n“Things will get worse before they get better and the markets will continue to reflect that reality,” said Marc Chaikin, CEO of Chaikin Analytics, in a note. “This means that a bottoming process will take more time and probably inflict more damage to equities.”\n\nStocks suffered their biggest one-week decline since the financial crisis in 2008, with the S&amp;P 500 dropping more than 13%. Those losses put the broad market average more than 32% below its record set on Feb. 19.\n\nLast week ended with all 11 S&amp;P 500 sectors closing more than 20% below their respective 52-week highs. The S&amp;P 500 was also on pace for its worst monthly performance since 1940.\n\nExpectations for the U.S. economy have also quickly deteriorated. Economists at Goldman Sachs wrote Friday they expect a 24% contraction for the second quarter after a 6% drop in the first quarter.\n\n“Suffice to say that the economy entered a unique, sudden-stop recession in March,” wrote Prajakta Bhide, strategist at MRB Partners. “If there is no concrete evidence of meaningful progress toward controlling the epidemic in the next eight weeks, there will be no basis for people and businesses to feel safe to begin to normalize economic activity.”\n\nInvestors have also been rattled by a sharp decline in crude prices. West Texas Intermediate futures fell 29.3% last week, their biggest weekly fall since January 1991. U.S. crude is also more than 66% below its most-recent 52-week high.",
        "subreddit": "investing",
        "title": "Futures hit limit down",
        "url": "https://www.reddit.com/r/investing/comments/fn8gj2/futures_hit_limit_down/",
        "created": 1584944338.0
    },
    {
        "author": "JubilationLee",
        "created_utc": 1585184898,
        "id": "fp2bo4",
        "num_comments": 477,
        "num_crossposts": 0,
        "selftext": "Hey nerds. My grandpa-in-law is 84 and we just got a call from his ER doc in MD that he is in military style lockdown and presumably won’t make it through the night.\n\nImagine you get a call that someone you love is dead to rights and you cannot say goodbye.\n\nReally, stop and think about it.\n\nI’ve just started my WSB journey in the end if feb and I’m up a little over $25k. I’d give literally all of it back to be able to hav my wife and I say goodbye, because this man is dead to rights.\n\nThere is a cost to everything. A lot of you won’t understand it at all. Some of you will understand it when someone you love dies. It is entirely possible, especially now.\n\nJust don’t fucking dance, whatever side of the line you’re walking on:\n\nTl;dr: fuck you, SPY 185p 4/10, and fuck you, don’t feel good about it you fucking pussies.",
        "subreddit": "wallstreetbets",
        "title": "Don’t fucking dance",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fp2bo4/dont_fucking_dance/",
        "created": 1585213698.0
    },
    {
        "author": "hepcecob",
        "created_utc": 1585441567,
        "id": "fqw4mq",
        "num_comments": 457,
        "num_crossposts": 0,
        "selftext": "With the notoriety of GAINS posts, such as from /u/WSBGod, there has been an influx of such posts with just a screenshot of gains and positions, which could easily be faked.  While this was good enough when the community was small, and there could be at least some trust within the community, it's just not enough.  I followed the speedrunning community and they had the same issue where with more and more people being interested in the subject, more strict proof rules had to be implemented.\n\n\nI'm not sure exactly how strict it should be, and what proof would be enough, but not excessive, but these stupid \"I started with $80 and now I have $10^9000 in a span of a week\" have got to go. \n\nPersonally, I would rather have people first declare their positions as they acquire them, with proof, and only after can they show off their gains &amp; losses.",
        "subreddit": "wallstreetbets",
        "title": "Petition to increase strictness of \"proof\" when submitting gains &amp; losses",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fqw4mq/petition_to_increase_strictness_of_proof_when/",
        "created": 1585470367.0
    },
    {
        "author": "Garrison_Forrdd",
        "created_utc": 1584817082,
        "id": "fmk30z",
        "num_comments": 454,
        "num_crossposts": 0,
        "selftext": "After a two-month reduction in China's air pollution due in part to the January and February coronavirus restrictions, new data from Copernicus EU demonstrate the rise of nitrogen dioxide emissions in March as life begins to resume for the country.\n\n\n&gt;https://twitter.com/i/events/1240688520382926850?cn=ZmxleGlibGVfcmVjc18y&amp;refsrc=email\n\n-\n\nWe should see US recovering no later than June. May be as earlier as May/Apr. Cross finger.",
        "subreddit": "StockMarket",
        "title": "Now we know China is recovering for real.",
        "url": "https://www.reddit.com/r/StockMarket/comments/fmk30z/now_we_know_china_is_recovering_for_real/",
        "created": 1584845882.0
    },
    {
        "author": "RETAW57",
        "created_utc": 1584102398,
        "id": "fhyupc",
        "num_comments": 451,
        "num_crossposts": 0,
        "selftext": "Air France - 17.8%\n\nLufthansa - 19.07%\n\nRCL &amp; CCL Futures - Both over 20% up...\n\nWhat is this madness, the day after US bans travel to Europe and coronavirus close down accelerate.\n\nIt's almost nonsensical now. Don't fall for this bull trap. It will be tempting but just see how companies which will face massive material losses are going and you can see this is a senseless rally.",
        "subreddit": "investing",
        "title": "Don't fall for this bull trap. Market is going into senseless mode. Lufthansa, CCL &amp; RCL Futures",
        "url": "https://www.reddit.com/r/investing/comments/fhyupc/dont_fall_for_this_bull_trap_market_is_going_into/",
        "created": 1584131198.0
    },
    {
        "author": "twtregg",
        "created_utc": 1585398984,
        "id": "fqjeda",
        "num_comments": 447,
        "num_crossposts": 0,
        "selftext": "Ok so clearly 3.5M newly unemployed was priced in... 2 month shut down is priced in... more and more beer flu priced in.... \n\nSo, what the hell isn’t priced in?  \n\n1. Corporate bankruptcies. Look for those to start to pick up. When they do, it will be the reverse ‘trickle down economics’ everyone talks about and is good for a few thousand down points. \n\n2. Muni and State bankruptcies. Fact is they make money via income taxes.  There is none of that income stuff being made right now.  And unlike the federal government they can’t just print more money.... this is going to be a problem. \n\n3. Oil. Oil is dead. No one is talking about it. The basin was already drawing on their lines to make payroll when oil was $35.  It’s going to get messy... unless a very stable genius starts to actually buy huge amounts.\n\nOthers?  \n\nPredication - We go back to the lows as real data comes out about the impact beer flu... and go well below that when any of 1, 2 or 3 happen.",
        "subreddit": "wallstreetbets",
        "title": "What the hell isn’t priced in?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fqjeda/what_the_hell_isnt_priced_in/",
        "created": 1585427784.0
    },
    {
        "author": "TheMentelgen",
        "created_utc": 1584192697,
        "id": "fiieap",
        "num_comments": 440,
        "num_crossposts": 0,
        "selftext": "All the bulls saying this shit is priced in are under the same misunderstood mindset of the general public right now. “*We deal with this for a few weeks and then life goes back to normal.*”\n\n##News flash retard, that’s not the timeline.\n\nBuckle the fuck up because I’m about to learn you some shit. \n\nThe point of social distancing is to slow the spread of the virus so that hospitals don’t get overloaded at once, but the current timeline on the plan is **one year or more.**\n\nI’ll say that again for the people in the back.\n\n#That is *one year* of public quarantine. \n\nThis isn’t Mickey getting a quick dip in profits. This is the mouse losing **80% of his revenue sources for the next 12 months.** \n\n##*”But America is doing a bad job quarantining so it’ll be over sooner than that” you stupidly sputter over your 3/16 Spy 300 calls. \n\nYeah, we are. But that doesn’t mean we won’t have a quarantine in effect, it just means we’re going to see a MASSIVE spike in cases as soon as we start actually testing. \n\nThe thing about Beer Flu is you’re infectious as soon as you catch it, and young adults often don’t show symptoms **at all.**\n\n##This means thousands of Typhoid Marys are wandering the country spreading this shit faster than that 0-symptom virus you made in Plague Inc. \n\nSo what happens when we finally start testing and our numbers skyrocket?\n\nFirst off, mass panic as tens of thousands of infected people who don’t even need treatment flood hospitals that are already over capacity, taking attention and resources away from immunocompromised patients that do. The news plays off this fear and people finally start to realize they should take it seriously as dead grandmas rain from the sky. \n\nWe still do social distancing. But there’s far more panic than before, and we all know what the market does during mass panic. \n\n##Also, if Tariff man is positive (which he probably is) he just infected a bunch of the countries biggest CEOs on live TV.\n\nThis shit has got a lot farther to fall. \n\n**tl;dr - Late April/Early May puts. 🌈🐻gang**",
        "subreddit": "wallstreetbets",
        "title": "Here’s what a bunch of you bulls (and America as a whole) don’t realize about Beerflue",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fiieap/heres_what_a_bunch_of_you_bulls_and_america_as_a/",
        "created": 1584221497.0
    },
    {
        "author": "biotechvest",
        "created_utc": 1584732946,
        "id": "fm17ed",
        "num_comments": 438,
        "num_crossposts": 0,
        "selftext": "“We average about 2,000 unemployment insurance claims a day,” Newsom said. “Two days ago or three days, we saw about 40,000 applications. After that 70,000 applications. Yesterday, 80,000 unemployment applications.”\n\nI won’t be surprised if it reaches 150K a day by next week. What’s happening is unheard of. \n\n[California unemployment claims to 80,000 in a day](https://www.ocregister.com/coronavirus-pushes-california-unemployment-claims-to-80000-in-a-day)\n\n-Sitting on SPY puts (Apr 17, 235)\n-Also bought Carvana (CVNA) puts (Apr 3, 25) because company will probably go bankrupt (has very high debt, negative bottom line, sitting on $800 million of car inventory, and now not much sales)\n-LABD calls (Apr 17, 26)\n-TQQQ puts (Mar 27, 40)",
        "subreddit": "wallstreetbets",
        "title": "Unemployment from 2,000 to 80,000 a day in California!!!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fm17ed/unemployment_from_2000_to_80000_a_day_in/",
        "created": 1584761746.0
    },
    {
        "author": "AloneForever",
        "created_utc": 1585584720,
        "id": "frtnm6",
        "num_comments": 431,
        "num_crossposts": 0,
        "selftext": "I'm so bullish right now. Everywhere you look, there's good news coming out. Economy is stronger than it's ever been. People enjoying their lives, really excited about the Fed's balance sheet, and there's so much to be hopeful for. I heard that in 12-18 months we *might* have a vaccine for 🍺🦠. On Fox News they're saying fish tank cleaner cures AIDS. Amazon has even offered to pay their warehouse workers an extra 5 cents per hour.\n\nAnd by the way, let's all extend a warm WSB welcome to the all the normies from Barstool. We're so happy to have you here, and we strongly recommend you all buy quality stocks like Boeing and Ford (these companies are true American heroes).\n\nShout out to my friends, the CEOs of Walmart, Walgreens, CVS, Panera, and my dawg JPow who's been cranking hard on the printer lately to make our economy even better than it already was if you can believe it.",
        "subreddit": "wallstreetbets",
        "title": "Such an incredible time to be alive",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/frtnm6/such_an_incredible_time_to_be_alive/",
        "created": 1585613520.0
    },
    {
        "author": "swaggymedia",
        "created_utc": 1585009070,
        "id": "fnv7xs",
        "num_comments": 429,
        "num_crossposts": 0,
        "selftext": "Every time market has limited-down fed comes out with some bogus news conference trying to pump the market.\n\nThe stimulus package was never meant to come out early this week, they are waiting until end of week after the brutal jobs report comes out. They need a cushion.\n\n\n1. Donald Pump having daily meetings trying to pump market.\n\n2. Today’s pre-market pump was only way to keep market after limit-down, it still didn’t save face.\n\n3. Trump going out and saying treatments are working when doctors are saying that they help but aren’t the cure.\n\n4. Trump pushing you get the workforce back out there (during a pandemic lol), means he’s FKn desperate to get the economy rolling.\n\n\nMoving forward here’s some shit that’s already pRiCeD iN and probably won’t move the market.\n\n-Cases increase by X amount each day\n-More cities go on lockdown.\n-Bad unemployment numbers.\n-Bad earnings reports.\n-Fed chatting about stimulus and QE.\n-Italy/Spain/Europe getting worse.\n\nTHOSE ARE PRICED IN.\n\nWHATS NOT PRICED IN:\n\n-Hospitals in hotspot cities become unbearably overwhelmed and run out of ventilators + icu units become a shit show. As of right now NYC is under control, so it will depend on how it plays out in 1-2 more weeks. There must be PANIC for it to effect the market moving forward.\n\n-Fed injecting 4 trillion into the economy that prioritizes small businesses and gives money to the general population.\n\n-Bad jobs/unemployment reports are priced in. What’s not priced in are insanely bad numbers which is a possibility as whyTrump is trying to delay release. This is why the stimulus is still pending.\n\n\nI think this week will be mostly green pending jobs report and stimulus... we’ll need to wait until the next surge of panic (if that comes) and economy coming to a halt before market has bigger legs down.\n\nMarket has already gone down 35% in a few weeks, don’t be greedy and expect more on any bad news. It’s going to take more panic to make bigger moves down, the kind of panic you don’t even want to happen. Nobody wants the virus to spread beyond control in the states, or unemployment to rise, just so you can make $50 bucks.\n\nI think we stay green this week and move into more blood red days the following week.",
        "subreddit": "wallstreetbets",
        "title": "Fed has completely lost their grip on the market. Stimulus was never coming out early in the week, they are waiting to cushion the jobs report.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fnv7xs/fed_has_completely_lost_their_grip_on_the_market/",
        "created": 1585037870.0
    },
    {
        "author": "FundamentalsInvestor",
        "created_utc": 1583705491,
        "id": "ffk57e",
        "num_comments": 428,
        "num_crossposts": 0,
        "selftext": "https://www.investing.com/indices/us-30-futures\n\nBacking off a bit now...  -980 or so",
        "subreddit": "stocks",
        "title": "Dow is currently off 1,000 in pre-market",
        "url": "https://www.reddit.com/r/stocks/comments/ffk57e/dow_is_currently_off_1000_in_premarket/",
        "created": 1583734291.0
    },
    {
        "author": "CapitalC5",
        "created_utc": 1584837879,
        "id": "fmqo8j",
        "num_comments": 424,
        "num_crossposts": 0,
        "selftext": "They just passed Spain and are rising quickly. Next week, we're gonna see those numbers grow really fast and I think hard lockdowns are inevitable. \n\nTo put those numbers into perspective, it suddenly became a lot higher because of the extra tests. Death and recovery numbers are still very low, so I think panic will hit the stock market not just yet.",
        "subreddit": "stocks",
        "title": "US is now 3rd on the list of countries with most confirmed Covid-19 cases.",
        "url": "https://www.reddit.com/r/stocks/comments/fmqo8j/us_is_now_3rd_on_the_list_of_countries_with_most/",
        "created": 1584866679.0
    },
    {
        "author": "ThunderKingdom00",
        "created_utc": 1584193103,
        "id": "fiihfd",
        "num_comments": 418,
        "num_crossposts": 0,
        "selftext": "My girlfriend and I went to our favorite restaurant yesterday one last time before the coronavirus takes over, and it wasn't even close to as busy as it normally is on a Friday evening. There was a table of six boomers pretty close to us that was yammering really loudly about something they saw on Fox News, when one of the women at the table spoke up and said something along the lines of, \"well there *is* good news!  My guy at Edward Jones - and he really knows what he's doing - said that if I have at least five thousand dollars, now's the time to put it into stocks!\" Her quinquagenarian  friends all gave agreeing coughs and sneezes.\n\nTL;DR: the normie boomers are being told to invest now. Buy SPY 3/31 240p.",
        "subreddit": "wallstreetbets",
        "title": "We're not even close to the bottom. DD Inside",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fiihfd/were_not_even_close_to_the_bottom_dd_inside/",
        "created": 1584221903.0
    },
    {
        "author": "jim_par",
        "created_utc": 1585651481,
        "id": "fsar37",
        "num_comments": 415,
        "num_crossposts": 0,
        "selftext": "Documentaries : \n\nhttps://youtu.be/XcGh1Dex4Yo\n\nhttps://youtu.be/np_ylvc8Zj8\n\nhttps://youtu.be/XcGh1Dex4Yo\n\nhttps://youtu.be/VQzEWeGJLP0\n\nhttps://youtu.be/fsrtB5lp60s\n\nhttps://youtu.be/BuyrBRUsu9A\n\nhttps://youtu.be/43KTN2_Vj30\n\nhttps://youtu.be/gGbT0l3LoT\n\nhttps://youtu.be/5IJeemTQ7Vk\n\nhttps://youtu.be/TbKxUYl3WSE\n\nhttps://youtu.be/5rtRL0vvUBQ\n\nhttps://youtu.be/gDqGSmTPtOQ\n\nhttps://youtu.be/3CccfnRpPtM\n\nhttps://youtu.be/e5qC1YGRMKI\n\nMOVIES : \n\nTHE BIG SHORT \n\nWALL STREET \n\nWALL STREET : MONEY NEVER SLEEPS \n\nTHE WOLF OF WALL STREET \n\nBOILER ROOM \n\nINSIDE JOB \n\nMARGIN CALL \n\nTRADING PLACES \n\nBETTING ON ZERO \n\nTHERE WILL BE BLOOD \n\nTHE HUMMINGBIRD PROJECT \n\nLORD OF WAR \n\nENRON : THE SMARTEST GUYS IN THE ROOM \n\nGLENGARY GLEN ROSS \n\nLIMITLESS \n\nTHE FOUNDER \n\nTHE SOCIAL NETWORK \n\nTV SHOWS : \n\nBILLIONS \n\nSUCCESSION \n\nDIRTY MONEY \n\nPEAKY BLINDERS\n\nSHARK TANK \n\nMAD MEN\n\nFARGO \n\nHOUSE OF CARDS \n\nTABOO \n\nSILICON VALLEY",
        "subreddit": "wallstreetbets",
        "title": "Since this QURANTINE shit is going to be for a while now , I have made a list of movies , TV shows , documentaries and anything related to finance and any suggestions will be added to this list .",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fsar37/since_this_qurantine_shit_is_going_to_be_for_a/",
        "created": 1585680281.0
    },
    {
        "author": "BeerShitzAndBongRips",
        "created_utc": 1583362830,
        "id": "fdli1p",
        "num_comments": 411,
        "num_crossposts": 0,
        "selftext": "Here's some information I've gathered over the past few.\n\nSo the CDC just announced TODAY that they're loosening the criteria for patients to be eligible to get a COVID-19 test. Up until now, the only time that patients were even tested for the virus is if they're in a HOSPITAL with a FEVER.. that means you could be walking into the doctor with a cough, runny nose, and sore throat, and they wouldn't even bust out the test kits. Let that sink in. This explains why the death rate for corona cases in USA is way higher than the average for other developed countries (\\~7% vs \\~2%). the US was only testing severe cases, which supports the story a supposed patient posted in the /r/coronavirus sub a few days ago, claiming they were sent home untested despite showing symptoms.\n\nThe US saw the first community transmission case a WEEK ago - since then we've had potentially contagious people being sent home untested. The old testing criteria probably damaged containment efforts, and the new testing criteria is going to cause an enormous spike in reported cases, guaranteed. We all saw how markets reacted when Italy reported a sudden spike in cases on Feb 22.. \n\nStill not convinced this is a problem? This virus is more contagious, and more deadly than seasonal flu's. Here's how the COVID-19 outbreak compares to similar epidemics in recent history. SARS, 2003 and MERS, 2012, the biologically most closely related viruses were not nearly as contagious and had almost no cases in the USA. We saw no disruption in daily lives. Now consider the H1N1 swine flu epidemic of 2009. Over 43,000 confirmed cases and over 1,200 deaths in the USA. Much more contagious/widespread than SARS/MERS with a similar death rate. Yet none of the above viruses had any negative impact on the markets. Basically, the flu is also less contagious than COVID-19. The average person with flu infects 1.3 other people, while beer virus infects 2.2. This is because a lot of people already have a naturally built up immunity to a lot of strains of the flu, while no one is immune to corona. \n\nCombine this with the fact that there is no vaccine in sight for the next year, you're gonna see some shit. During a calm year, the flu has some 10 million cases in the USA. If corona reaches even this level, we'll see deaths in the six figures. Hence the (failing) scramble to contain. Some people are speculating that the virus will go away with warmer weather, but both SARS and MERS flourished in the summer months, so good luck. \n\nAnd unlike the first death over the weekend, or the rate cut, a sudden spike in cases is not priced in. People were expecting a red Monday just because someone died over the weekend? The US had more than 60 cases at that point. With a death rate of some 2.5%, a death was highly probably. After today's rally the S&amp;P 500 is less than 9% below its all-time-high. Plus, if technicals are any indication, this back and fourth volatility is all the more reason to suspect we haven't hit the bottom.\n\nTLDR; Hope you're using these green days to buy cheap puts. Give it a few weeks before panic sets in.\n\n SPY 280 P 04/17 + VIX 40 C 04/17 = Ctrl + P",
        "subreddit": "wallstreetbets",
        "title": "If you're still unsure if shit is about to hit the fan..",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fdli1p/if_youre_still_unsure_if_shit_is_about_to_hit_the/",
        "created": 1583391630.0
    },
    {
        "author": "moneybandit255",
        "created_utc": 1583946551,
        "id": "fh0jib",
        "num_comments": 411,
        "num_crossposts": 0,
        "selftext": "https://www.google.com/amp/s/www.cnbc.com/amp/2020/03/11/who-declares-the-coronavirus-outbreak-a-global-pandemic.html \n\nHow do we move forward from this boys? Thinking everything is going to get affected now.",
        "subreddit": "stocks",
        "title": "Corona virus declared a Pandemic",
        "url": "https://www.reddit.com/r/stocks/comments/fh0jib/corona_virus_declared_a_pandemic/",
        "created": 1583975351.0
    },
    {
        "author": "blindgraysquirrel",
        "created_utc": 1584035048,
        "id": "fhka56",
        "num_comments": 409,
        "num_crossposts": 0,
        "selftext": "The NHL just announced they’re suspending their season and it’s rumored MLB is considering the same for spring training. NBA is already done. UFC is at risk based on cryptic memes from Dana White.\nAll I have Hulu for is hockey and with that canceled I’ll probably cancel my HULU account and I know several other people who feel the same way.\nTL;DR: DIS Puts $80 strike, at least a month from now. Reason: I’m canceling my $55 a month HULU",
        "subreddit": "wallstreetbets",
        "title": "Disney owns HULU. HULU has live sports for $55 a month. There are no more live sports.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fhka56/disney_owns_hulu_hulu_has_live_sports_for_55_a/",
        "created": 1584063848.0
    },
    {
        "author": "Jburd6523",
        "created_utc": 1584839554,
        "id": "fmr3dp",
        "num_comments": 408,
        "num_crossposts": 0,
        "selftext": "I understand this will be going above your autistic heads, but try to learn to read for just 5 minutes here.\n\nYour 11 year bull market that thrived on low interest rates, and low unemployment encouraged a lot of big dick financial risk taking behavior by large corporations who similar to us kept saying \"Can't go tits up.\" This in turn led to a corporate debt bubble that was highlighted as \"Risky\" by the federal reserves November 2019 financial stability report.\n\n&gt;Business debt levels are high compared with either business assets or GDP, with the riskiest firms accounting for most of the increase in debt in recent years.\n\nWhen companies rack up large amounts of debt, they sell them to cucks as Corporate Bonds. This is known as the corporate bond market. Cucks who own corporate bonds make money by being paid in interest on those bonds.\n\nBut what happens when you have a global pandemic where businesses are forced to shut down for an undermined amount of time? Revenue streams dry up and those companies are now at risk of being unable to pay out the interest payments to the bond holders. This results in a default. Once a company defaults creditors set out on horses with massive dildos to fuck the life out of these companies and force them into bankruptcy. Usually by selling off all their assets to pay back the bond holders and creditors.\n\nThere are corporate bond ETF's that you can buy puts on, and that's probably what I'll put most of my money into. The corporate bond ETFs below are the ones I was able to find with the most Volume and OI.\n\n* $HYG\n* $LQD\n* $JNK\n\nBelieve it or not, fucking $GME GameStop has issued corporate bonds GUH! and $ALGT allegiant travel has some floating around too. I believe those two companies are to high risk of defaulting given the current conditions.\n\nI read a post by a leverage banker on here yesterday that said the defaults are going to start soon, so I believe this upcoming week would be a good time to get into your positions.\n\n\\-Good Luck Retards.",
        "subreddit": "wallstreetbets",
        "title": "Corporate Bond Defaults are coming",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fmr3dp/corporate_bond_defaults_are_coming/",
        "created": 1584868354.0
    },
    {
        "author": "drendon6891",
        "created_utc": 1584191490,
        "id": "fii4wc",
        "num_comments": 402,
        "num_crossposts": 0,
        "selftext": "When everything is green almost every day, all I heard was “don’t time the market” yada yada... but now that shit hits the fan, almost every post I see is “wait it’s going to keep doing down!” Yes, this sub is made up of individuals with different opinions, but the proportion of upvotes on “don’t time the market” posts back then vs “wait a little longer” posts now is very revealing. For a sub that pokes so much fun at WSB some of you truly belong there.\n\nThis is why I always say to do a little of both. My retirement accounts will not get touched, but you can bet your ass I’ve been playing with puts for the past 2 weeks with my individual account.\n\nPoint is stop being so hard-line one way or the other. \n\nReady for downvotes.",
        "subreddit": "investing",
        "title": "So this bear market has revealed how hypocritical this sub is",
        "url": "https://www.reddit.com/r/investing/comments/fii4wc/so_this_bear_market_has_revealed_how_hypocritical/",
        "created": 1584220290.0
    },
    {
        "author": "TheGUHboyyyyyy",
        "created_utc": 1584003408,
        "id": "fhddc3",
        "num_comments": 400,
        "num_crossposts": 0,
        "selftext": "Gents, the futures have been halted due to the breaker hitting -5%\n\nImagine holding calls right now and not being able to sleep. It’s unbelievable. \n\nEveryone say a quick prayer for our long-dead bull gang",
        "subreddit": "wallstreetbets",
        "title": "FUTURES HALTED AS DOW FUTURES HITS -5%",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fhddc3/futures_halted_as_dow_futures_hits_5/",
        "created": 1584032208.0
    },
    {
        "author": "Mr_Find_Value",
        "created_utc": 1584544903,
        "id": "fkr7b8",
        "num_comments": 388,
        "num_crossposts": 0,
        "selftext": "If this drawdown shows us anything, it's that many companies are managed terribly and don't deserve your money. Airlines, hotels, cruise lines aren't able to survive the next 2 months without bailouts.\n\nNow their headwinds are strong, but where's all their profits from the last 10 years? With most of them it was plowed into share buy backs. Some airlines spent 97%+ of their profits right back into share buybacks. \n\nSo we have all these companies right now with their hands out. Unable to survive 2-3 really bad months. These are companies that've made sky high profits for years and years but have managed themselves in a paycheck to paycheck way regardless. \n\nWe need to stop. We can't invest in companies that are completely fiscally irresponsible. Do not reward companies that can't stand 2-3 months of pressure without begging for a bailout. As far as I'm concerned they can go straight to hell for being so irresponsible.\n\nInvest in strong, smart companies that have cash on hand, that can stand a few bad months, that haven't spent all their profits on share buybacks. Find companies that aren't running to Washington with their hands out. As soon as you see them begging for a bailout within weeks of a crisis, they should be persona non grata to us. We as investors need to be smarter and hold these companies to account.",
        "subreddit": "investing",
        "title": "Don't invest in companies that don't deserve it.",
        "url": "https://www.reddit.com/r/investing/comments/fkr7b8/dont_invest_in_companies_that_dont_deserve_it/",
        "created": 1584573703.0
    },
    {
        "author": "igqi",
        "created_utc": 1585345862,
        "id": "fq6oao",
        "num_comments": 374,
        "num_crossposts": 0,
        "selftext": "This may help some of the newer traders out and it might be fun to see what people are watching. Put yourselves in the shoes of a 40 something-year-old person. They have $40,000 saved up and they haven't lost their job. You've never invested before, but you'd like to have a little spending money in 3-5 years.   \n\n\nYou can divide up your $40,000 however you want. $100 here, $1000 there. It's up to you.  \n\n\n* What do you buy now?\n* Why?\n* What price would you buy at?",
        "subreddit": "stocks",
        "title": "You have $40,000 and a blank portfolio. What do you buy? Why?",
        "url": "https://www.reddit.com/r/stocks/comments/fq6oao/you_have_40000_and_a_blank_portfolio_what_do_you/",
        "created": 1585374662.0
    },
    {
        "author": "kafkagoeswest",
        "created_utc": 1583851941,
        "id": "fgf015",
        "num_comments": 374,
        "num_crossposts": 0,
        "selftext": "Trump's economic policies aren't preventing what we're seeing in Europe right now, from happening to America in the next six weeks. We are no closer to containment, and even as we see massive events like SXSW and conferences galore, you still have families in Disneyland, Vegas, and all sorts of interactions. This disease is spreading, and we still haven't seen the full roll out of testing, so we have no idea how many people are infected and currently spreading this to more people. Those numbers are going to come in massive, and it has nothing to do with fiscal stimulus and everything to do with containment, quarantine, and a healthcare solution. \n\nWhen the market opened and hit over 800 I never flinched, because we are no closer today in solving the containment measures, nor are we any closer to understanding the fiscal impact of having an inevitable societal shut down to mitigate the epidemic. \n\nTLDR:  🐻🌈 market until we see something that addresses the health crisis; fiscal stimulus is putting a bandaid on cancer.",
        "subreddit": "wallstreetbets",
        "title": "What honestly changed from yesterday to today? Battling Coronavirus with fiscal stimulus is effective as putting a bandaid on flesh eating bacteria. Today is nothing more than an opportunity to establish more puts two weeks further out.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fgf015/what_honestly_changed_from_yesterday_to_today/",
        "created": 1583880741.0
    },
    {
        "author": "IwannaSayStuff",
        "created_utc": 1584406705,
        "id": "fjw5b0",
        "num_comments": 374,
        "num_crossposts": 0,
        "selftext": "-movies canceled \n-parks closed\n- corona virus bout to fk Florida\n-  sports cencel = less revenue from channels owned by Disney\n- parks are also closed\n- so much bad news surrounding disney\n\n\nHOW IS IT STILL NOT UNDER 90\nI saw this shit go to 91 after hours now its 97 something\n\n\nWhat y'all think\n\nTldr: Disney puts 3/20 85",
        "subreddit": "wallstreetbets",
        "title": "Wtf is going on with Disney",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fjw5b0/wtf_is_going_on_with_disney/",
        "created": 1584435505.0
    },
    {
        "author": "smartkuz",
        "created_utc": 1583557134,
        "id": "feqfb9",
        "num_comments": 374,
        "num_crossposts": 0,
        "selftext": "I’ve made [north of $75k](https://www.reddit.com/r/wallstreetbets/comments/febbrk/dd_its_happening_fellas_black_friday_is_upon_us/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf) in the last 10 days. And I’m starting to feel really shitty. \n\nLet me explain. \n\nWe’re all having a good time “making tendies”. It’s ain’t that fucking hard... short any flagship equity within a sector that’s directly impacted by the beer virus. All of you ass clowns let emotions get in the way of a good short and hold, and the ones that don’t crush the gainz. \n\nThat said, here’s the sad, and uneasy reality, that’s starting to set in... This virus isn’t a game, and people are about to die. [A lot of people. ](https://twitter.com/sethbannon/status/1236125593290276864?s=21)\n\nIt’s all fun and games, until you realize your parents and grandparents are older than 60, and face the real prospect of critical illness. \n\nMaybe it’s something more innocuous, like [the NBA playing the rest of the season with no fans. ](https://twitter.com/shamscharania/status/1236122231656378373?s=21)\n\nEither way, this is starting to feel like the prologue to a dystopian nightmare. In the span of tying this, I received four separate emails from various companies about “how they are dealing with COVID”, and an alert from my own healthcare provider on how I can order doctors on demand to lower my risk of exposure. \n\nSo again.. making money right now isn’t hard. Before you “positions or ban” me, scroll up and click the link and stfu. Grow some balls, make a basket of put options that short indexes and equities from impacted sectors, then go long on inversely correlates equities (ie hospital care providers). The market will generally drift down, and flash crash in the coming days (assuming this isn’t too late and it all goes down Monday, given the fire hose of shifty news). \n\nBut as your laughing all the way to the bank while watching the world burn, I encourage you to step back and take some stock in what’s actually happening here... because it’s real fucked up, and about to land on your doorstep. \n\nI wish you all you fellow WSB’ers the best of luck and health through these tough times.",
        "subreddit": "wallstreetbets",
        "title": "[DD] Crash Incoming - Real Talk",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/feqfb9/dd_crash_incoming_real_talk/",
        "created": 1583585934.0
    },
    {
        "author": "richards_david",
        "created_utc": 1585491042,
        "id": "fr6fq1",
        "num_comments": 373,
        "num_crossposts": 0,
        "selftext": "Let’s see how the current environment looks like.\n\n&amp;#x200B;\n\nHere are **some uncertainties** that govern investors’ reactions over the past 50 days:\n\n* Nobody knows how long will the pandemic last. Obviously, the longer the worse and there is no indication of slowing down.\n* Nobody knows if people who get sick will have immunity over the next potential virus wave.\n* Nobody knows how the transition period back to normal economic activity will be achieved and how long it will take.\n* Nobody can estimate the real economic damage to the backbone of the economy → SMEs\n* Nobody can estimate the second derivative of the sell-off effects, i.e. what will happen with the fallen angels and lack of liquidity.\n\n&amp;#x200B;\n\n**A few facts about the virus:**\n\n* Death rate varies between 0.5% – 7%, depending on population age, ICU coverage and extent of population testing.\n* Most of the patients do not present symptoms for many days, which makes the virus extremely effective in spreading.\n* No vaccine is expected before the next 12–16 months.\n\n&amp;#x200B;\n\n**Now, a few economic facts and hard data:**\n\n* Almost 50% of US corporate debt is BBB rated now and with most of the world’s population being under lock-down, it is no rocket science that big part of them will fall below investment grade.\n* Almost 3.3M Americans filed for jobless claims last week. This is 5x the previous record of 1982.\n* The Fed’s balance sheet just exceeded $5 trillion for the first time.\n* Markets are deep into bear market territories.\n\n&amp;#x200B;\n\n**The Covid-19 effect:**\n\nNow, it is important to clarify that Coronavirus will not disappear overnight. It will be a long and gradual process lasting 3–6 months. I am afraid the worse is yet to come for markets across the world. The detrimental effects in the real economy are becoming more obvious day by day and translated into spikes in unemployment, mortgage payment delays, lack of liquidity and financing for SMEs, cuts in Capex and supplies, and lastly corporate and personal defaults. This is a self-feeding loop probably leading to what economists describe as secular stagnation.\n\nThe Central Banks were not ready to face such a crisis. Rates were extremely low already and their balance sheets were already loaded with a lot of public and corporate debt. Another stimulus plan may be the only solution now, but it is not sustainable in the long run.\n\nMy opinion is that markets will remain into bearish territory for many months after the “end of Covid-19”.\n\n&amp;#x200B;\n\n**What can ordinary investors do to prepare?**\n\n1. **You cannot time the market**. You never could and definitely cannot start now. So, instead of guessing whether stock markets are going to rise or fall further after Covid-19, adopt a longer horizon. Get some exposure in the stock market but do it for the long run. There is no point to pick the best mutual fund, as most of them underperform the markets. Go for a cheap ETF. Robinhood or Vanguard will probably do for most jurisdictions.\n2. **Normal diversifiers** like corporate bonds are always necessary for an all-weather portfolio. However, keep in mind that in every liquidity crunch most of the risky assets move together and move downwards.\n3. **Safe havens**, like government bonds (US, Germany, UK) still have their place in your portfolio.\n4. **Look for market-neutral alternatives**. This can be alternative types of exposure, investment styles, methods, etc. Look for market-neutral assets and funds. At the toughest periods, the market-neutral investments will keep your portfolio beating. It is true that market-neutral exposure is not the easiest thing to achieve as an ordinary investor, but there are a few apps that try to achieve that. I find Daedalus Investment Platform interesting, but I am sure there will be others as well for jurisdictions not covered.\n5. **Keep some cash**. Not only as a safe haven but to also exploit opportunities when you identify them.\n\n&amp;#x200B;\n\n**Summary**: These are hard times for the markets and events that are unprecedented for our generation. It is and will be tough, but the best we can do is be prepared both for the virus (social distancing &amp; healthy routine) and for our long-run financial plan.",
        "subreddit": "investing",
        "title": "How long will the Covid-19 affect the markets? How should everyday investors react?",
        "url": "https://www.reddit.com/r/investing/comments/fr6fq1/how_long_will_the_covid19_affect_the_markets_how/",
        "created": 1585519842.0
    },
    {
        "author": "Honcho2011",
        "created_utc": 1583338545,
        "id": "fdfajt",
        "num_comments": 373,
        "num_crossposts": 0,
        "selftext": "Finance professor referenced WSB autists and their YOLO gains from the past two weeks as the statistical exception of rational behavior in markets. Well done retards. First Bloomberg, now MBA programs.",
        "subreddit": "wallstreetbets",
        "title": "Congrats autists you're now being spoken about in MBA classrooms",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fdfajt/congrats_autists_youre_now_being_spoken_about_in/",
        "created": 1583367345.0
    },
    {
        "author": "theoneguywiththename",
        "created_utc": 1585333197,
        "id": "fq2cj1",
        "num_comments": 370,
        "num_crossposts": 0,
        "selftext": "Alright you fucks need to learn how your own two hands work.  There is a big difference between having strong hands and watching your portfolio burn for no reason. If you're going to watch it burn, it should be in a blaze of yolo glory, none of this slow burning weak shit.\n\nThere is one big reason you're letting it burn\n**Sunk cost fallacy.**  This asshole is your brain trying to lose you money.  Your brain says that I spent a lot of money on this position and lost a lot of money so I may as well hold on to it now.  This is irrational. Stop it.  The market does not give a shit how much your position cost initially.  It's the reason you stay in crappy relationships longer than you should, aside from the obvious.\n\n**Strong hands:** being able to weather expected variability within the market without panic trading\n\n**Dumb hands:** ignoring new clear information that is now available to you because you want to hold a position\n\n\nWhen you aren't sure which is which, ask yourself: Would I still buy this position today, at this current price, knowing all that I know now. \nBecause effectively that's what you are doing every day you are holding a position.\n\n* If the answer is yes, hold strong, don't doubt your vibe. \n* If the answer is no, that means you are only holding onto it because you already have it, get out of that shit.\n\nObviously there are a ton of other fallacies and biases costing you money, google them.  If you're going to lose money at least lose it correctly.  \n\n\nPositions:\nSPY 240p 4/17, 230p 5/15. Because people are back to underestimating this shit.",
        "subreddit": "wallstreetbets",
        "title": "Sunk Cost: Why new fucks are burning money",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fq2cj1/sunk_cost_why_new_fucks_are_burning_money/",
        "created": 1585361997.0
    },
    {
        "author": "fazeka",
        "created_utc": 1584767015,
        "id": "fm9ruz",
        "num_comments": 368,
        "num_crossposts": 0,
        "selftext": "I'm 49 years old. Was maxing out my 401k and Roth.\n\n401k was at $300k before this whole thing started. Up until today, I was fine with leaving it alone. I'm at $215k now:\n\n[https://i.imgur.com/97w5ae2.jpg](https://i.imgur.com/97w5ae2.jpg)\n\nRoth was at $25k, now at $18k:\n\n[https://i.imgur.com/zwpurap.jpg](https://i.imgur.com/zwpurap.jpg)\n\nIn any other bull situation, I was fine leaving it alone. Was even joking with some co-workers 2 weeks ago if I should buy more...\n\nBut I'm only realizing now... we still may have MONTHS of this. Industries are CRATERING.\n\nI'm in the airline industry. NOT a good place to be in. I will likely lose my job.\n\nIs there any possibility of losing it all if I do nothing and leave it? I don't want to sell now but $230k is better than $115k, or $0.\n\nConfused... anxious... nearly suicidal... thoughts please",
        "subreddit": "investing",
        "title": "I'm a DCA'er. I know I shouldn't sell. But this is unprecedented.",
        "url": "https://www.reddit.com/r/investing/comments/fm9ruz/im_a_dcaer_i_know_i_shouldnt_sell_but_this_is/",
        "created": 1584795815.0
    },
    {
        "author": "HumbleNoob",
        "created_utc": 1585067817,
        "id": "fo85zq",
        "num_comments": 366,
        "num_crossposts": 0,
        "selftext": "We are under heavy siege from bulls today. It's been a crazy week from quad witching to Fed buying your grandma's dirty laundry. But remember this- 💎✋\n\n\n\"The battle is now joined on many fronts. We will not waver; we will not tire; we will not falter; and we will not fail. Peace and tendies will prevail\"",
        "subreddit": "wallstreetbets",
        "title": "Bear support thread.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fo85zq/bear_support_thread/",
        "created": 1585096617.0
    },
    {
        "author": "DingleBaerry",
        "created_utc": 1584922394,
        "id": "fnaamm",
        "num_comments": 363,
        "num_crossposts": 0,
        "selftext": "Yep! You heard it here you retarded quad butt fuck Witcher’s! Hope you sold your kids and calls!\n\nI’ll be sure to send you money, in the form of change, when you’re on the street covering my 31 MAR 175p fuckers!\n\nTL;DR\n31 MAR 170p\n\nCheap enough to fly under the radar of your wife’s divorce lawyer",
        "subreddit": "wallstreetbets",
        "title": "CODE RED: SPY Trading At 220 Right Now",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fnaamm/code_red_spy_trading_at_220_right_now/",
        "created": 1584951194.0
    },
    {
        "author": "Ddbigo",
        "created_utc": 1585681765,
        "id": "fsj3l3",
        "num_comments": 358,
        "num_crossposts": 0,
        "selftext": "Going to make it quick and simple. **ishares Russel 2000 ETF is an ETF ($IWM)** comprised of the 2000 smallest market cap stocks, essentially all the small businesses. Today, the volume on a $92 PUT expiring April 3rd soared to almost 250,000. With a .23 premium, that's 5.75 million dollars. The 50 day average option volume for ALL options on $IWM is 104,000. This single option has a volume of **250,000**. The current total put option volume is 550,000. That's 5x the average TOTAL option volume.\n\nhttps://marketchameleon.com/Overview/IWM/OptionSummary/\n\nNow this is weird because with $IWM currently sitting at $113, a $92 strike put is so far OTM that the price would have to drop significantly by this friday or those would all expire worthless. \n\nIt could be possible someone with a lot invested in the underlying stock is hedging, but that would be a massive hedge, and there hasn't been any dramatic change in stock volume in the past 30 days. \n\nSomeone is betting $IWM will have a very, very large movement come friday, whether that is up or down.",
        "subreddit": "wallstreetbets",
        "title": "Very Unusual Option Activity",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fsj3l3/very_unusual_option_activity/",
        "created": 1585710565.0
    },
    {
        "author": "Cursed_Blessing",
        "created_utc": 1585067065,
        "id": "fo7xw4",
        "num_comments": 356,
        "num_crossposts": 0,
        "selftext": "I've been spending the last few weeks browsing this sub and other related sites, trying to gauge sentiment and see what other investors like myself (who are on the sidelines) have been thinking about the current market. General consensus seemed to share the opinion that we are only a few weeks into the crisis and things will get worse before they get better. However, since then the Fed has stepped in with unprecedented action and now there is a new stimulus package expected to pass this week.  Has anyone's outlook changed? A few of the stocks on my watch list (TSLA, DIS, SQ) have seen a massive rally over the last two days and I'm kicking myself for not budging. I'm too stubborn to buy in now but I have this terrible feeling that I will be left on the sidelines while the market begins to make a recovery.",
        "subreddit": "investing",
        "title": "For those who were waiting for a lower entry point, has the Fed intervention or stimulus package changed your outlook at all?",
        "url": "https://www.reddit.com/r/investing/comments/fo7xw4/for_those_who_were_waiting_for_a_lower_entry/",
        "created": 1585095865.0
    },
    {
        "author": "starhockey36",
        "created_utc": 1583501560,
        "id": "fedijb",
        "num_comments": 354,
        "num_crossposts": 0,
        "selftext": "**Cars: GM 01/15/21 $20p .... FCAU 01/15/21 $10P**\n\n&amp;#x200B;\n\nWith the economy seeming entering in to the next recession (or worse), we are all wondering where we can get our money in to become the guy from the Big Short.\n\n&amp;#x200B;\n\nAs noted in the TL;DR at the top for all the autists who can only read TSE, I believe the auto industry will be the next one to crash.\n\n&amp;#x200B;\n\nHere is why:\n\nUS households are absolutely jacked with car loans. As stated in this [article](https://www.investopedia.com/personal-finance/american-debt-auto-loan-debt/), \" Auto loans now make up nearly 10% of all household debt, the third largest debt category behind mortgages and student loans. \" While this may not be that surprising, the point is these things are an extremely heavy burden for individuals. Additionally, cars are a significantly more liquid asset to sell than a home... more on this later.\n\n&amp;#x200B;\n\nSimilar to what was observed in the run-up to the housing market crash, there has been a dramatic increase in the number of sub-prime loans for automobiles. You can read about this [here](https://knowledge.wharton.upenn.edu/article/auto-loan-subprime-crisis/).\n\n&amp;#x200B;\n\nEssentially, what we are seeing in the auto industry is the same thing as the housing market: people are taking out way too large of loans they cannot afford.\n\n&amp;#x200B;\n\n**How does this relate to the current state of the economy?**\n\n&amp;#x200B;\n\nAll of this being said, we know what happens when an economy is hurled into a recession. Companies layoff employees, debts stop being repaid, and people / businesses begin defaulting on their loans.\n\n&amp;#x200B;\n\nSince people are extremely leveraged on their car loans, any hiccup to their income may cause difficulty in repaying the loan. This will cause millions of car owners to either sell their car or it will get repossessed. Here is the intro to econ level analysis of how this scenario plays out:\n\n&amp;#x200B;\n\nPeople lose jobs\n\n...................**This causes demand of used cars to increase**\n\nCan't afford car loan\n\nSell / get car repossessed\n\n...................**This causes supply of used cars to increase**\n\nThe increased supply and increased demand of used cars causes total quantity demanded to increase (rather dramatically, depending on your opinion of the future of the economy).\n\n&amp;#x200B;\n\nThere are only so many cars being sold around the country / world. With the quantity demanded of used cars increasing, the demand for new cars will decrease. As a result, firms such as GM and FCAU may struggle to stay in business, let alone make a profit.\n\n&amp;#x200B;\n\nShort GM and FCAU... Also Wells Fargo seems interesting.",
        "subreddit": "wallstreetbets",
        "title": "The next Housing Market Crash will be...",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fedijb/the_next_housing_market_crash_will_be/",
        "created": 1583530360.0
    },
    {
        "author": "MaxAds1",
        "created_utc": 1585262391,
        "id": "fplc3g",
        "num_comments": 354,
        "num_crossposts": 0,
        "selftext": "u/variation-separate called this 5 days ago and seems to think we will be headed back down in a big way. \n\nIt’s scary how to a T his write up has been so far. I have way too much money invested in puts right now and I’ll be sending this dude a lot of money if we drop below 240 next week. \n\nCurrently drinking heavily but still hopeful. I hope you all are staying safe. \n\nMay the odds forever be in your favor. Fuck Derek. \n\nHere’s a quick [tl/dr of his post](https://imgur.com/gallery/mtx8ceC)",
        "subreddit": "wallstreetbets",
        "title": "Variation Separate called this 5 days ago",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fplc3g/variation_separate_called_this_5_days_ago/",
        "created": 1585291191.0
    },
    {
        "author": "6pjEgRaabbf7HGQqCcy1",
        "created_utc": 1584511573,
        "id": "fkktka",
        "num_comments": 352,
        "num_crossposts": 0,
        "selftext": "(This is from my personal investing notes. I wanted to put it out there and see if anyone feels the same)\n\nI realize that this journal entry got a bit lengthy, so I chopped it into three parts.\n\n----     \nThe Pump  \n-----     \n\nMid-January 2020, articles begin pumping TSLA as Musk announces share purchases.    \n    \n_Markets Insider -  Tesla short sellers have lost nearly $12 billion in just 7 weeks_     \n     \n_Markets Insider - Tesla has yet another biggest bull on Wall Street. Here's why he thinks the stock could surge 57%._    \n     \n_Electrek - Tesla (TSLA) gets new $800 price target based on its ability to execute_        \n     \nMusk is no stranger to stock pumping. Last year he advertised a private share price of 420$, \"funding secured\", to draw in investors. It is not surprising that this time the company has turned to media outlets to get article placement from a third party.    \n\nAt the same time, coordinated social media and message board posts appear hyping TSLA and urging users to buy stock. Social media posts on reddit, twitter, facebook about the price of Tesla on trajectory for $1000/share. A reddit and twitter user named /u/WSBgod begins buying calls in TSLA at $600+; posting his positions and urging his large follower base to do the same. Many of these social media posts are well-written, edgy and bear the hallmarks of professional  copywriters.    \n\n----    \nThe Dump    \n----   \nTesla price began to rise. Viral social media posts and positive articles created high demand for TSLA stock, driving retail investors into a frenzy. On some message boards, users were seen urging people to take credit card advances or student loans to buy Tesla stock at $600+.   \n\nAt this point, a short-term \"spike\" in Teslas price occured. For the purposes of discussion, we will consider $767 (the stock issue price, discussed below) at market close to be the defining price of the spike.   \n\nThis spike began on 02/03 and ended on 02/26. The stock market was open 18 days  during this window. More remarkably, the closing price of TSLA was only above $767 per share on *12 days* during the window.   \n*Chart of the 767$ price line and the recent spike*:   \nhttps://gfycat.com/quaintslimyeuropeanpolecat   \n\nIt turns out this short stock market spike was no surprise to Tesla. Tesla and Goldman Sachs were already preparing to issue stock during this narrow period. Tesla filed an 8-K on 02/19 to issue  2.65 million new shares at $767 per share. Teslas/Goldman's  \"luck\" allowed them to issue on one of the top ten highest dates in TSLA history.    \n\nSocial media and message board influencers sold dreams of $1500 \"moon\" prices to middle-class retail investors. Musk raked $2.31 billion of that cash advance, student loan, and summer job money during this short period of time. Many of his new investors were young; drawn by the new mobile-based, zero-commision brokers such as Robinhood. These younger investors typically turn to social media for their stock research.     \n\nWhile the stock issue was happening, Insiders began exercising options and dumping their stock. Five insiders can be seen exercising (buying) options and dumping stock during the narrow 18-day February spike time frame. Amidst the insider sales there is only one insider purchase - a well-publicized stock purchase by Elon Musk himself.     \n\nhttps://www.marketbeat.com/stocks/NASDAQ/TSLA/insider-trades/    \n\n----     \nThe wreckage settles     \n----     \n\nAfter the dump finished, the retail money was safely in the hands of insiders and Teslas cash reserves. Nameless large traders (known as \"whales\") began dumping the shares in high-volume batches, reaping the harvest of inflated stock price. The stock price plummetted. TSLA is now hovering around ~$400/share on 03/18, less than half the price of the all-time high where retail investors were paying upwards of $800-900 per share.    \n\nTesla is now $2.31 billion richer (although Tesla's high cash burn rate will incinerate this money within two quarters). Insiders at Tesla have gained hundreds of millions from their timely exit.    \n\nOn twitter and message boards, many users are depressed and downtrodden. The investment they purchased during the flurry of hype has lost its value. Many of the users who bought Tesla joke about suicide or selling their house. Many users who got caught in the Tesla hype are silent - ashamed of their losses. Many are selling their devalued shares at a huge loss and will not return to invest in stocks for the time being.      \n\nStock frenzys are not a new phenomenon. Many will blame the media for the unrealistic moonshot expectations towards TSLA during the hype period. Many will blame the drop in value of Tesla stock on the coronavirus (on the contrary, coronavirus was already worldwide during the \"pump\" period as well).     \n\nYet, it is tough not to look at the timing of the entire event and squint:    \n* Tesla insiders and the company issued and sold stock on the perfect dates during a very narrow 12 day window.    \n* The media blitz \"pump\" occured despite Teslas high debt load and extremely low car production rate (400k/year).     \n* Institutional investors stayed put and let retail investors run in to the slaughter, chasing promises of $1000+ TSLA    \n* Tesla issued shares and insiders dumped stock with a masterstroke in perfect timing and preparation     \n\nTLDR: The little guy got fleeced hard, and the corporation enriched itself by hitting the perfect dates on the roulette wheel.    \n\n\"Funding secured\"",
        "subreddit": "investing",
        "title": "The recent TSLA price spike was timed too perfectly",
        "url": "https://www.reddit.com/r/investing/comments/fkktka/the_recent_tsla_price_spike_was_timed_too/",
        "created": 1584540373.0
    },
    {
        "author": "jkracx",
        "created_utc": 1585614755,
        "id": "fs2u3z",
        "num_comments": 350,
        "num_crossposts": 0,
        "selftext": "*disclaimer* \nI’m *clearly* just a gay bear autist passing on what I heard from some geeks\n\n[chart](https://www.tradingview.com/x/lwHD9H5i/)\n\nResistance points\n1. We just barely broke through a strong trendline (brr power bull trap?) into a phat double top \n\n2. Now we’re about to hit the .382 [Fibonacci retracement point](https://youtu.be/Kz6-8nQLRHM)  (Not easy to break through)\n\n3. We’re also about to hit the 20 day moving average\n\nVolume\nVolume has been significantly lower for the past 3 days. Bulls running out of steam?\n\nSo all the technical analysis geeks are saying we’re at a clear tipping point.. there’s a shit ton of people with sell triggers around 265 and if we reject it we should drop like a mother fucker. If we somehow brrr through we might moon.\n\nFundamentals:\n\nBears: Virus getting exponentially worse, unemployment, shrunken gdp, etc. Economic impact will be worse than what we thought.\n\nBulls: Virus is a temporary problem/hoax and we overreacted, pricing in too much damage. The economy is still strong.\n\nIf you’re holding puts, don’t give up yet. Maybe hedge or rollout. \n\nIf you’re holding calls, be careful. A lot of indicators say we’re at the top, but if we somehow retard strength our way through you can get rich asf.",
        "subreddit": "wallstreetbets",
        "title": "Hitting the top tomorrow?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fs2u3z/hitting_the_top_tomorrow/",
        "created": 1585643555.0
    },
    {
        "author": "liverbool8",
        "created_utc": 1585159946,
        "id": "fov42b",
        "num_comments": 349,
        "num_crossposts": 0,
        "selftext": "My fellow gay bears, this has a been dark week. The bulls have swung their massive balls into our face and gave some of us CTE. But someone needs to emerge and lead us to the light, and I think I’m the right 🏳️‍🌈🐻 for the job.\n\nI’m so fucking gay it’s hard to contextualize into words. Imagine if Jay Charles and Magic Johnson’s son fucked and they somehow had a son- and then that son fucked one of the Charmin bears (the male one). I’d pop right out of that asshole, pride flag and put options in my hand.\n\nNow that you know I’m qualified, I want you all to hear this - HOLD YOUR APRIL/MAY PUTS. Miss Rona is going nowhere and is about to remove every boomer praying our gay away on Easter. Recessions don’t happen in a straight fucking drop, large gains are normal before an even bigger fall. 4/17? PRINTING. 5/1? PRINTING. 5/15? DOUBLE PRINTINGGG. \n\nWE MAY NOT HAVE SPORTS, WE MAY NOT HAVE OUR BOYFRIENDS, BUT AFTER MARCH WE ARE GETTING THESE FUCKING TENDIES. GROW A GAY PAIR AND HOLD THE LINEEEE   🏳️‍🌈🐻🏳️‍🌈🐻🏳️‍🌈🐻🏳️‍🌈",
        "subreddit": "wallstreetbets",
        "title": "🏳️‍🌈🐻 RALLY CRY",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fov42b/rally_cry/",
        "created": 1585188746.0
    },
    {
        "author": "NSA_Official_Account",
        "created_utc": 1583531775,
        "id": "fekz62",
        "num_comments": 348,
        "num_crossposts": 0,
        "selftext": "It's the end of the week, hopefully all of you have made tendies on your puts/calls. But that's not what we are here to talk about today, we are here because two gentlemen, just like the two other retards last week, has made stupid promises and will now be hold responsible.\n\n[https://www.reddit.com/r/wallstreetbets/comments/febypd/daily\\_discussion\\_thread\\_march\\_06\\_2020/fjo0vzr/](https://www.reddit.com/r/wallstreetbets/comments/febypd/daily_discussion_thread_march_06_2020/fjo0vzr/) \n\nu/Dawschlong commented \" If ual ends green today i’ll drink bat soup\", UAL ended the day with +0.99%.\n\n[https://www.reddit.com/r/wallstreetbets/comments/febypd/daily\\_discussion\\_thread\\_march\\_06\\_2020/fjnebzf/](https://www.reddit.com/r/wallstreetbets/comments/febypd/daily_discussion_thread_march_06_2020/fjnebzf/) \n\nu/j4rd7n commented \"If WORK closes red today I’m eating my pubes.\", Slack ended the day with -6.94%, this dude is pretty fucking retarded in believing in Slack at all tbh.",
        "subreddit": "wallstreetbets",
        "title": "All debts to be repaid.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fekz62/all_debts_to_be_repaid/",
        "created": 1583560575.0
    },
    {
        "author": "sxt_",
        "created_utc": 1583272816,
        "id": "fd2c9s",
        "num_comments": 347,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Good job you retards, you're on the terminals now.",
        "url": "https://i.redd.it/ifn1qj785jk41.png",
        "created": 1583301616.0
    },
    {
        "author": "Piece_of_Sheet",
        "created_utc": 1583203543,
        "id": "fcnw07",
        "num_comments": 345,
        "num_crossposts": 0,
        "selftext": "On Thursday I called that Friday would be the bottom of the market, the SP500 would hit near 2850 and bounce back up. I was on WSB discord and EVERYONE was laughing at me when I said I was buying SPY calls. Well keep fucking laughing while your puts expire worthless tomorrow. Look at the charts and see for yourself.\n\nLets look at the 15 minute chart of the S&amp;P500. Inverse head and shoulders pattern, stocks going up. Buy calls.\n\nhttps://preview.redd.it/onvps9fgbdk41.png?width=704&amp;format=png&amp;auto=webp&amp;s=2db767e064c84977fc8f5f484dbfc38a33a316b1\n\nNow lets look at the daily chart below. The S&amp;P 500 chart today easily broke above the 200 DMA, that is a good sign for the bulls. Next resistance ahead is the 3139 level which is the 9 DMA.\n\nhttps://preview.redd.it/ryz6lgxxbdk41.png?width=704&amp;format=png&amp;auto=webp&amp;s=529ff7f83174621a9c3b3cfcdbd97b82c788abe3\n\nLets look at the 60 minute chart (below). There is some resistance at the red line around the 3129 level. This is close to the 3139 level on the daily chart.\n\nhttps://preview.redd.it/6x4fgshccdk41.png?width=705&amp;format=png&amp;auto=webp&amp;s=f7891a4beb11a11d1c36bd8fb0f21ad652a878f1\n\nSeems like tomorrow there will be a big resistance zone between the 3129-3139 level. If the S&amp;P 500 can break above that level, then the next resistance is 3168 (100 DMA), but honestly I think itll just shoot right over it and go for 3263 level (50 DMA). Here is the reason why, look at this last chart below:\n\nhttps://preview.redd.it/03bf0e6scdk41.png?width=705&amp;format=png&amp;auto=webp&amp;s=391838680758d0d004219ef805de917d0a6be9b4\n\nThis chart shows the ratio of puts to calls in the market.\n\nMore than 1 means more people buying puts. Anything above 1.1 is getting too risky and 1-sided. Anything above 1.2 is extreme\n\nLess than 1 means  more people buying calls. Anything below 0.8 is extreme.\n\nLook at this fucking chart, people are STILL holding onto their puts that were bought last week. The ratio today closed at 1.29, which is at the same level that we had on Thursday and Friday.\n\n**MOST PEOPLE HAVE NOT TAKEN PROFITS ON THEIR PUTS FROM LAST WEEK.**\n\nTomorrow the market will open higher and LOTS of people will be selling their puts to cut their losses, which will bring the market much higher. We will go way past the 100 DMA (3168 level), we just need to break above the strong 3129-3139 level, then we go to the moon.\n\nTLDR: Everyone in this subreddit is fucking autistic and is still holding puts (thanks to Robinhood). Market opening higher tomorrow.",
        "subreddit": "wallstreetbets",
        "title": "Market going back up to the MOON tomorrow, all your puts going to 0",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fcnw07/market_going_back_up_to_the_moon_tomorrow_all/",
        "created": 1583232343.0
    },
    {
        "author": "DrClearCut",
        "created_utc": 1584110476,
        "id": "fi0nxh",
        "num_comments": 345,
        "num_crossposts": 0,
        "selftext": "Last one got deleted, verified now\n\nI'm a physician in an ER in a major U.S. city.\nWe're seeing a lot of sick patients with upper respiratory infections and negative work ups.\nPeople with CT findings/labs which are found in coronavirus patients. We're being told we can't test. We're getting lot's of push back on every single patient we suspect this in.\n\nThings are gonna get a lot worse in the coming weeks. This is a colossal fuck up by the CDC\n\nBuy SPY puts 2-3 weeks out",
        "subreddit": "wallstreetbets",
        "title": "Buy SPY Puts",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fi0nxh/buy_spy_puts/",
        "created": 1584139276.0
    },
    {
        "author": "iamwooodyharrelson",
        "created_utc": 1584542725,
        "id": "fkqmes",
        "num_comments": 335,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2020/03/18/oil-markets-coronavirus-pandemic-in-focus.html\n\nAt any other time this would be by far the biggest financial news story, but the way things are oil almost feels like a footnote right now. How do you think these low prices will impact the economy?",
        "subreddit": "investing",
        "title": "Oil falls to 17 year low",
        "url": "https://www.reddit.com/r/investing/comments/fkqmes/oil_falls_to_17_year_low/",
        "created": 1584571525.0
    },
    {
        "author": "WSBgod",
        "created_utc": 1584737155,
        "id": "fm2f0q",
        "num_comments": 335,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "As of today, THE BIG SHORT has now returned over 10 MILLION DOLLARS AND RISING!!!",
        "url": "https://i.redd.it/ga2j2z7j3wn41.jpg",
        "created": 1584765955.0
    },
    {
        "author": "Throwaway1010bb",
        "created_utc": 1585220370,
        "id": "fp9l5f",
        "num_comments": 334,
        "num_crossposts": 0,
        "selftext": "This makes no sense at all. Are the companies in the sp500 index better off now, with better future earnings prospects than in 2017? Obviously not.. so what the hell. Seriously.",
        "subreddit": "investing",
        "title": "As deaths surge in the US, the S&amp;P500 soars to mid 2017 levels.",
        "url": "https://www.reddit.com/r/investing/comments/fp9l5f/as_deaths_surge_in_the_us_the_sp500_soars_to_mid/",
        "created": 1585249170.0
    },
    {
        "author": "kidtitan",
        "created_utc": 1584306952,
        "id": "fj8qhm",
        "num_comments": 331,
        "num_crossposts": 0,
        "selftext": "Everyone here saying bears r fuk because of the rate cut don't realize this is a SUPER desperate move by the Fed.\n\nPublic is still in full panic mode, we don't have enough tests, countries are going on lock-down, and the list goes on. Are we so soon to forget the Fed tried injecting 1.5T into the market and we fell even deeper after?\n\nWhat people seem to be missing is we have ZERO moves after this. What the fuck else can they realistically offer as an economic stimulus now? Something like this should've happened sooner, and MAYBE it would've worked. \n\nKeep your heads cool, keep buying puts weeks out, and trade smart. Also, I'm retarded.",
        "subreddit": "wallstreetbets",
        "title": "My fellow bears - you'll be fine.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fj8qhm/my_fellow_bears_youll_be_fine/",
        "created": 1584335752.0
    },
    {
        "author": "wdiaz98",
        "created_utc": 1585198774,
        "id": "fp5lmg",
        "num_comments": 331,
        "num_crossposts": 0,
        "selftext": "When the stimulus bill passes on Friday most of us  autists will become $1,200 richer. Alone, that’s some pussy shit, can’t even buy a reasonable $TSLA option without having to asking your wife’s boyfriend for the other half. But, together we can truly weaponize our autism and make some tendies. Don’t believe me? Fuck you, but I guess I can breakdown the plan for those that are particularly disabled.\n\nLet’s round the sub count to a million. The bill says that those making more than $100K won’t be able to receive free tendies so with that I’ll take out WSBgod and another 99,999 users that either have their shit together or got lucky. The rest of us are still gonna get $1.08 BILLION. We then find the gayest 🐻🌈 with the most diamond of hands to buy all the SPY puts we could afford. Then we just sit, chew on crayons, and wait to become millionaires. 😎😎\n\nTLDR: $SPY 195 4/20",
        "subreddit": "wallstreetbets",
        "title": "So you’re getting $1,200 now what??",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fp5lmg/so_youre_getting_1200_now_what/",
        "created": 1585227574.0
    },
    {
        "author": "BamBamBoy7",
        "created_utc": 1584653008,
        "id": "fli4qq",
        "num_comments": 326,
        "num_crossposts": 0,
        "selftext": "This god awful fucking boss baby ass logo needs to go ASAP. I hate it so much. Fuck that stupid logo. If hating that logo was a stock I would buy all of it. I miss the jazzy cool cat with hair we used to have. He represented our ideals. This little Caillou piece of shit we have now must burn in Hell. \n\nThat is all thanks.",
        "subreddit": "wallstreetbets",
        "title": "I don’t invent, i don’t have a portfolio. I know Jack shit about the market, but I do know one thing.....",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fli4qq/i_dont_invent_i_dont_have_a_portfolio_i_know_jack/",
        "created": 1584681808.0
    },
    {
        "author": "lucassommer",
        "created_utc": 1584402590,
        "id": "fjv3ki",
        "num_comments": 325,
        "num_crossposts": 0,
        "selftext": "Went all in on calls 359pm. Confidence is high and here is why.\n\nUncertainty is over. \n\nGood news globally is catching up proportionately to bad news locally. \n\nFed did its thing.\n\nBailouts pretty much assured.\n\nCheap debt and money locked in.\n\nStimulus helicopter money inbound.\n\nShit load of money on the sidelines and in bonds.\n\nFed going to keep credit markets liquid for the rest of the world.\n\nCentral banks all making the same moves.\n\nVaccines getting injected into humans.\n\nItaly numbers coming down.\n\nJack ma and Bezos making it rain.\n\nTrump said it could last till august and it might be a recession. \n\nEverything is cancelled and lockdowns coming.\n\nTom hanks and Politicians have the Rona\n\nWhat else is unknown? What else is there to be afraid of? Where is the remaining uncertainty?\n\nWill the us hospitals get overrun? Maybe, but we know that now.\n\nWill Americans be out of work? Maybe, but Congress will bail out the worker and the small business.\n\nCats out of the bag. Sellers have sold.\n\nI have friends hiding from the apocalypse in Maine and Vermont loading up on ammo.\n\nPeople are hording toilet paper. \n\nSpy 280c 4/1",
        "subreddit": "wallstreetbets",
        "title": "That was it bois. Wait till stimulus, then straight up. SPY 280c 4/1",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fjv3ki/that_was_it_bois_wait_till_stimulus_then_straight/",
        "created": 1584431390.0
    },
    {
        "author": "WeedCaffeineBooze",
        "created_utc": 1584463570,
        "id": "fk8hb9",
        "num_comments": 322,
        "num_crossposts": 0,
        "selftext": "Fuck my ass and my mouth and my tits, this is so frustrating.\n\nI posted yesterday about how I left $840 of ITM option value on the table in the form of 10x TQQQ $56c that expired on Friday. On Saturday they exercised it, charging my account -$56k for the 1000 shares of TQQQ, massively overdrawing the account.\n\nMonday morning, I closed the position immediately after my 7:00am pre-market opened, at $40.25, realizing a loss of $15,750.\n\nToday they liquidated my positions (mostly TQQQ puts) at 11:24am and called me to inform me of my fucking. After liquidation and liquidation fees, I am left with a $6k debt saved up for retirement. That's not a bad start, right?\n\nhttps://preview.redd.it/j6pdjvawh9n41.png?width=719&amp;format=png&amp;auto=webp&amp;s=5baf36fb5a1c534857672dd5c3a8930dfaacf73f",
        "subreddit": "wallstreetbets",
        "title": "Thanks to auto-exercise, I now have -$6,037.92 in my Roth IRA",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fk8hb9/thanks_to_autoexercise_i_now_have_603792_in_my/",
        "created": 1584492370.0
    },
    {
        "author": "TriforceCaliban",
        "created_utc": 1583674481,
        "id": "ffclsf",
        "num_comments": 131,
        "num_crossposts": 0,
        "selftext": "\tAAPL\n\tACB\n\tADBE\n\tALLY\n\tAMD\n\tAMZN\n\tATVI\n\tBABA\n\tBABA\n\tMMM\n\tBAC\n\tBYND\n\tCCL\n\tCGC\n\tCMG\n\tCOST\n\tCRM\n\tCRON\n\tCZR\n\tDIS\n\tEA\n\tEBAY\n\tETSY\n\tFB\n\tGLD\n\tGOOGL\n\tGOOS\n\tHD\n\tINO\n\tINTC\n\tIQ\n\tJNJ\n\tJPM\n\tLULU\n\tLUV\n\tLVS\n\tM\n\tMCD\n\tMSFT\n\tMU\n\tNFLX\n\tNKE\n\tNVDA\n\tOPK\n\tPENN\n\tPINS\n\tPTON\n\tPYPL\n\tRCL\n\tROKU\n\tSBUX\n\tSHOP\n\tSNAP\n\tSPCE\n\tSQ\n\tSTMP\n\tTGT\n\tTLRY\n\tTLT\n\tTSLA\n\tTTD\n\tTWTR\n\tUBER\n\tULTA\n\tV\n\tWMT\n\tWYNN\n\nAny more to add?",
        "subreddit": "wallstreetbets",
        "title": "Current WSB Meme Stock List",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ffclsf/current_wsb_meme_stock_list/",
        "created": 1583703281.0
    },
    {
        "author": "FundamentalsInvestor",
        "created_utc": 1583268917,
        "id": "fd1c3s",
        "num_comments": 66,
        "num_crossposts": 0,
        "selftext": "I've attempted to map COVID-19 impacts to the economy based upon my view of the cascading effects of human behavior, company behavior, supply chains, spending, etc, and resulting impact to company profits and guidance.  Starting with this very basic diagram.  [Draft impact diagram](https://i.imgur.com/IBDwooK.png)  and [Coggle source](https://coggle.it/diagram/Xlkbg4XWyqFLMmnR/t/covid-19-impact-on-the-economy/7f1e5110c045d1e2e21815c7bc43242ebfa439967f15ae7d8a8f9dc1a98435ff).  Here are the positions I picked up on Mon 2-Mar and will likely hold for a month:\n\n**LONG STOCK OR CALL:  PYPL, EBAY, SHOP, V, MMM, HBIO, GILD, VIVO, RGR**\n\n**SHORT SELLS AND PUTS:  TJX, Starbucks, Nautilus, Las Vegas Sands, Wyndham, Brunswick, Transdigm, Textron, Parker Hannifan**\n\nSo far, outperforming the market\n\n-----------------------\n\nBULLISH implications (most certain, positive &amp; near-term first...  **BOLD** = known COVID-19 exposure):\n\n* Protective Equip --&gt; **MMM, CLX, CTAS, KMB**\n* RX + Vaccine + Testing --&gt; **GILD, MRNA, NVAX, NNVC, IBIO, CODX, OPGN**, BDX, BSX, HYH, INVA, BMY, MDCO, ACHN, ENTA, INO, MLNT, QDEL, SRPT, SVA, TBPH, CEMI, DVAX, GNCA, OSUR  (be careful, lots of potential misses!  [more analysis here](https://www.reddit.com/r/investing/comments/fbbbhn/corona_virus_research_and_stock_dd_part_2/))\n* Med Devices + Equip --&gt; **APT, AHPI (careful microstock), HBIO**, DHR, RMD, DIO, HRC, ICUI, STE, TFX, A, BAX, EW, MDT, CL, KMB, LAKE, BIMI, LLIT\n* Medical Distribution --&gt; ABC, CAH, HSIC, MCK\n* Guns &amp; Ammo --&gt; RGR, OLN, AOBC, NPK\n* Online Purchases --&gt; AMZN, FISV, WP, V, GPN, FRPT, PYPL, SHOP, EBAY, ETSY\n* Hospitals + Medical Svcs --&gt; HCSG, HCA, CYH, LPNT, UHS\n* Home Care + Deathcare --&gt; AMED, LHCG, CSV, STON\n* Internet and Media --&gt; NFLX, FB, TWTR, T, VZ, CTL, FTR, S, TMUS, AMCX, CBS, DISCA, FOX, VIA, DIS\n* Wine &amp; Spirits --&gt; BF.A, STZ, DEO, BREW, TAP, BUD\n* Gaming --&gt; ATVI, EA, TTWO\n* Online Education --&gt; CHGG, XRS, APOL, CPLA, DV, STRA\n* Home Comfort &amp; DIY --&gt; TPX, HD, LOW\n\nBEARISH implications (most certain, destructive &amp; near-term first):\n\n* Cruise Ships --&gt; CCL, NCLH, RCL\n* Hotels --&gt; HLT, IHG, MAR, WH\n* Fitness Clubs --&gt; BC, NLS, PLNT\n* Casinos --&gt; LVS, MGM, WYNN\n* Restaurants --&gt; CMG, CBRL, DRI, JACK, SBUX, PLAY, RRGB, CAKE\n* Community Gatherings --&gt; BWL-A, AMC, CNK, MCS, RDI, ISCA, SEAS, SIX, IMAX\n* Sporting Events / Venues --&gt; MSG, MANU, WWE\n* Furniture OEs &amp; Retail --&gt; ESND, SCS, MLHR, FLXS, ETH, BBBY, BSET, LEG, HOFT, TCS, WSM, RCII, AAN\n* Other Retail --&gt;  ODP, LULU, JWN, TJX, GPS, FL, ROST, DG, DLTR\n* Flight Hours Decline --&gt; TXT, PH, TDG, UTC, HON, GE, RR, BAE, BA, AAL, DAL, LUV, UAL  (be careful with airlines, the low price of fuel is a huge tailwind for their earnings...  also remember that Boeing is 50% defense and already down from recent scandal...  parts manufacturers will get hit especially the first three here, short those!)\n* Intl Container &amp; Crude Carriers --&gt; CMRE, MATX, EURN, KEX, NAT, OSG, TGP, GLOG, GLNG\n* Health Insurance Cost Spike --&gt; ANTM, CI, HUM, UNH\n* Office Supplies &amp; Services --&gt; ACCO, EBF, RRD, XRX\n* Consumer Luxuries --&gt; AVP, COTY, EL, NUS, REV\n* Auto Mileage Decline + China supply chain --&gt; GPC, AAP, AZO, ORLY, CASY, MUSA\n* Capital Equip Pushed Out --&gt; TXT, JCI, LII, WSO, FAST, SNA, SWH\n* Construction Delayed --&gt; AYI, TILE, LL, USG, PPG, SHW, MAS, DOOR, BCC, UFPI, MLM, VMC, OC, CAT, DE\n* New Home Builds Delayed --&gt; DHI, LEN, NVR, PHM, TOL",
        "subreddit": "stocks",
        "title": "My March 03 Covid-19 Stock Pics",
        "url": "https://www.reddit.com/r/stocks/comments/fd1c3s/my_march_03_covid19_stock_pics/",
        "created": 1583297717.0
    },
    {
        "author": "Mario092992",
        "created_utc": 1583777559,
        "id": "ffyzar",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "Most of my funds are in index funds but i got around 10k in bac &amp; paypal. Bac down 15% wtf",
        "subreddit": "investing",
        "title": "How much have you lost? So far/ going to lose today?",
        "url": "https://www.reddit.com/r/investing/comments/ffyzar/how_much_have_you_lost_so_far_going_to_lose_today/",
        "created": 1583806359.0
    },
    {
        "author": "LegalHelpNeeded3",
        "created_utc": 1583215295,
        "id": "fcq95g",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "This past day/week of trading has eviscerated innumerable portfolios. Without money, people can’t use PayPal. \n\n$PYPL puts, $110 3/20\nYou’re welcome. \n\nPost gains when you profit you autists.",
        "subreddit": "wallstreetbets",
        "title": "PayPal Puts",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fcq95g/paypal_puts/",
        "created": 1583244095.0
    },
    {
        "author": "DanteQW",
        "created_utc": 1584387913,
        "id": "fjr2di",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "I've always been interested in ways to invest money. I finally got 100 euros in my PayPal account and I would love to know what are your tips so I can start somewhere.",
        "subreddit": "investing",
        "title": "I'm 16, what should I invest in?",
        "url": "https://www.reddit.com/r/investing/comments/fjr2di/im_16_what_should_i_invest_in/",
        "created": 1584416713.0
    },
    {
        "author": "et1haan",
        "created_utc": 1583372415,
        "id": "fdnoox",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "Before we start off, let me say, there will be absoluty ZERO hedging. None. \n\nAfter getting name dropped on the daily forum today, I feel like a big boy. I have to come out, not as gay, but as 16. Who knows which is worse. Despite how you may disagree after clicking on the link a line below this one, I would call myself a good trader, just an insanely greedy one. Anyways, after doing [this](https://imgur.com/a/ZF9SqAe) to my account in 4 trading days, I realize how bad my gambling addiction has become, and how much I love this shit. I told myself \"dont take profit until your account balance has a 2 in front, and that option says 500% p/l. It was in the 480's when I took that photo. For being 16, that is a shit ton of money. \n\nAnyways, Ill get on with it. You guys tell me what to trade, I do it. This WILL NOT be another CTN, I will make my own trades if you guys say some dumb shit. Ill provide daily updates, and if its looking nice, hell, maybe it will go public one day. \n\nI find myself pretty good (overall) with daytrades, but holding anything over the weekend will fuck me. That's where I want your guys's help. Also, betting against the fed is typically a very bad idea. \n\nCurrently, my account is fucked.  I'm pulling the rest of the $200 out of my Fido, and putting it in here, which will be getting YOLO'd.  I have another 200 waiting on my Paypal, so that will help save my account\n\n&amp;#x200B;\n\nAlso, if spy closes below $300 tomorrow, well, check my recent comments. It will save my account, and lets just say that I will be giving back. \n\n&amp;#x200B;\n\nTLDR: LONG WSBX (WSBXXX COMING SOON)",
        "subreddit": "wallstreetbets",
        "title": "Introducing: The WSB Hedge Fund",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fdnoox/introducing_the_wsb_hedge_fund/",
        "created": 1583401215.0
    },
    {
        "author": "SolePickAlerts",
        "created_utc": 1583443027,
        "id": "fe29vs",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "Hello!\n\nWebull Financial LLC is registered with and regulated by the Securities and Exchange Commission (SEC) and the Financial Industry Regulatory Authority (FINRA). It is also a member of the SIPC, which protects (up to $500,000, which includes a $250,000 limit for cash) against the loss of cash and securities held by a customer at a financially-troubled SIPC-member brokerage firm.\n\nYou will get:\n\n1)Webull has a promotion where they will give you a free stock (valued at $2.5-$250) for opening an account and another free stock at $12-$1400 makes a deposit of ANY amount (even works with $1).\n\n2) $20 from me through paypal/venmo/cashapp\n\nTo complete:\n\n1)comment below and I will PM you my referral link. Or just PM me directly.\n\n2)create an account and have it get approved (usually within 1 business day)\n\n3)Deposit at least $1 into your account.\n\n4)Once your deposit clears, message me again with the app you want to receive your cash. I will be able to confirm if your deposit settles from my end with the program. Deposit usually takes 4-5 business days.\n\nDisclaimer: I am apart of webull influencer program. I get $35 per sign up and deposit. I am willing to pay you $20 out of the $35.\n\nThanks you!",
        "subreddit": "pennystocks",
        "title": "[OFFER] WEBULL: $20 paypal/venmo/cashapp from me + 2 free stocks total $14-1900 from them (US)",
        "url": "https://www.reddit.com/r/pennystocks/comments/fe29vs/offer_webull_20_paypalvenmocashapp_from_me_2_free/",
        "created": 1583471827.0
    },
    {
        "author": "zgar_aby",
        "created_utc": 1583068630,
        "id": "fbtwrl",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "I really want to get into investing, I know all the fundamentals and so on but I have nothing but some 20$ on my Paypal, and my boomer dad won't understand anything about finance nor stock market.. any help? thanks.",
        "subreddit": "stocks",
        "title": "I need advice",
        "url": "https://www.reddit.com/r/stocks/comments/fbtwrl/i_need_advice/",
        "created": 1583097430.0
    },
    {
        "author": "SolePickAlerts",
        "created_utc": 1583849246,
        "id": "fgecfy",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Hello!\n\nWebull Financial LLC is registered with and regulated by the Securities and Exchange Commission (SEC) and the Financial Industry Regulatory Authority (FINRA). It is also a member of the SIPC, which protects (up to $500,000, which includes a $250,000 limit for cash) against the loss of cash and securities held by a customer at a financially-troubled SIPC-member brokerage firm.\n\nYou will get:\n\n1)Webull has a promotion where they will give you a free stock (valued at $2.5-$250) for opening an account and another free stock at $12-$1400 makes a deposit of ANY amount (even works with $1).\n\n2) $20 from me through paypal/venmo/cashapp\n\nTo complete:\n\n1)comment below and I will PM you my referral link. Or just PM me directly.\n\n2)create an account and have it get approved (usually within 1 business day)\n\n3)Deposit at least $1 into your account.\n\n4)Once your deposit clears, message me again with the app you want to receive your cash. I will be able to confirm if your deposit settles from my end with the program. Deposit usually takes 4-5 business days.\n\nDisclaimer: I am apart of webull influencer program. I get $35 per sign up and deposit. I am willing to pay you $20 out of the $35.\n\nThanks you!",
        "subreddit": "pennystocks",
        "title": "[OFFER] WEBULL: $20 paypal/venmo/cashapp from me + 2 free stocks total $14-1900 from them (US)",
        "url": "https://www.reddit.com/r/pennystocks/comments/fgecfy/offer_webull_20_paypalvenmocashapp_from_me_2_free/",
        "created": 1583878046.0
    },
    {
        "author": "Harambe_Like_Baby",
        "created_utc": 1583068688,
        "id": "fbtx5o",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "What high quality names are you all adding to in light of the correction?\n\nLooking at Friday close, V, DIS, PYPL, and MSFT all look attractive, even in light of coronavirus. I would avoid something like Apple given the tremendous exposure to China and continued uncertainty.\n\nWhat else?",
        "subreddit": "stocks",
        "title": "Shopping List",
        "url": "https://www.reddit.com/r/stocks/comments/fbtx5o/shopping_list/",
        "created": 1583097488.0
    },
    {
        "author": "jggrizonic",
        "created_utc": 1583186346,
        "id": "fcjtof",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "So, my main question is this: is it possible for me to buy and sell stocks at age 16? I live in Portugal, Europe.\nFrom a quick Google search I found out that the minimum age is 18 but that is in the United States, I have a PayPal account and don’t know if that’s useful in this type of process. I want to do this because of the coronavirus, if now the markets are low, it’s obvious that in a few months it will get higher. I want to put like 200-300€ and except a gain of 20-40%. If theres  indeed a way to invest, what are the websites you recommend? Thank you for your time",
        "subreddit": "investing",
        "title": "Investing at 16",
        "url": "https://www.reddit.com/r/investing/comments/fcjtof/investing_at_16/",
        "created": 1583215146.0
    },
    {
        "author": "newsboyron",
        "created_utc": 1583359008,
        "id": "fdkjku",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "**Coronavirus: Avoid banknotes and switch to contactless payments to avoid transmission, suggests WHO**  [https://www.independent.co.uk/life-style/health-and-families/coronavirus-news-banknotes-world-health-organisation-contactless-payment-a9374441.html](https://www.independent.co.uk/life-style/health-and-families/coronavirus-news-banknotes-world-health-organisation-contactless-payment-a9374441.html)",
        "subreddit": "stocks",
        "title": "Good for credit card stocks, Paypal and Square?",
        "url": "https://www.reddit.com/r/stocks/comments/fdkjku/good_for_credit_card_stocks_paypal_and_square/",
        "created": 1583387808.0
    },
    {
        "author": "vasmajom",
        "created_utc": 1583324834,
        "id": "fdc9s6",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Hey guys,\n\nNew investor thinking in long term, my portfolio is KO, SBUX, HD, MA, AAPL, GOOG, NFLX, DIS, MSFT, AMZN, PINS, TSLA, PYPL and PFE (this last one is kinda speculative). Put in 3300 USD evenly distributed for a start, and plan to invest around 600-800 USD each month. What do you all think, should I make any changes?\n\nThanks in advance!",
        "subreddit": "investing",
        "title": "Advice on portfolio",
        "url": "https://www.reddit.com/r/investing/comments/fdc9s6/advice_on_portfolio/",
        "created": 1583353634.0
    },
    {
        "author": "Dylansigley",
        "created_utc": 1583095731,
        "id": "fc0dvm",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "**How To GET PAID $2,000 Drop Servicing \\[Get Your High Ticket Client\\]**\n\nA big question I always get from students is how do I get clients to pay me. There’s a few main things to focus on with this. Other than these points it’s all about simply choosing your ideal platform and sending the invoice. Before you do that though, make sure you have these things in place so you don’t run into the major issues I’m about to expose.\n\n**How To Deal With Clients That Don’t Want To Pay**\n\nAlways make sure that you don’t deliver the finished product until the client has paid in full. I’ve had a few experiences in the past where a client hasn’t paid on time which led us not getting paid in full or not getting paid on time. The best way to deal with those who refuse to pay is to either require them to pay 100% up front before working with you or if you go for the 50% up front and 50% on delivery option, at least ensure you never deliver the final product, add your logo to it if it’s something like a video, keep everything on your systems if it’s something like a website.\n\n**How To Get High Paying clients**\n\nRealize your working in an abundant market, there are too many potential clients for you to possibly be able to service them all. There’s plenty of fish in the sea, so you don’t need to be desperate in taking whatever you can get someone to pay you. It all comes down to knowing what your service is worth in the market and charging what you deserve to be paid. If you’re skilled in conveying your worth to clients in relation to a problem they really need to solve right now while you are the very best option to solve that problem then they’re going to be willing to spend very large amounts to get that problem solved. On top of that you need to remember it’s nothing for these companies to spend thousands with you, it’s only a big deal for you if you’re not used to it yet.\n\n**How Should Clients Pay Me**\n\nI’ve heard of all kinds of strange payment structures over the years with all kinda of weird explanations for each. At the end of the day you should only get clients to pay you 100% up front or 50% up front, 50% on delivery if they really push on it. Personally, I only take this second option if the sales is worth at least $2,000 otherwise it’s just not worth the time of going through two sets of receiving payments. The biggest thing is feeling comfortable asking for 100% payment upfront.\n\n**Payment Methods**\n\nThere’s so many platforms out there for accepting payment all of which take some kind of fee. PayPal and Stripe make things simple but they both lead to higher fees expecting payments especially if your bank currency is different to the one you accept payment in. Bank transfer is another option but it can be slower to make happen and asks a bit more of the potential client when making payment as it’s simply a little more work for them but if going this route I recommend using Transferwise to save massively on fees. It’s really going to be a decision between minimizing fees or minimizing the time investment in your client making the payment, all dependent on your preferences in the end.\n\n&amp;#x200B;\n\n[Click HERE to learn more](https://youtu.be/hCCnhRKQw_0)",
        "subreddit": "investing",
        "title": "How To GET PAID $2,000 Drop Servicing",
        "url": "https://www.reddit.com/r/investing/comments/fc0dvm/how_to_get_paid_2000_drop_servicing/",
        "created": 1583124531.0
    },
    {
        "author": "shox911",
        "created_utc": 1584195134,
        "id": "fiiy1d",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Hi guys, what do you think about the PayPal stock considering the corona ‚crisis‘? Is it a long term investment? They had an uplift on Friday but bad news during the weekend will probably destroy the gains on Monday. I got in at 80$/share, would it be smart to realize the earnings now and get back into it?",
        "subreddit": "stocks",
        "title": "$PPYL Thoughts",
        "url": "https://www.reddit.com/r/stocks/comments/fiiy1d/ppyl_thoughts/",
        "created": 1584223934.0
    },
    {
        "author": "lettyshop",
        "created_utc": 1583115446,
        "id": "fc4zjj",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": " \n\nHello guys My Name is Abraham , i am an entrepreneur From Venezuela (the worst country to reach your goals and dreams ) . The situation of my country dont stop me to reach my goals so i made my own store and learn a lot about Facebook ads too . But to promote my website and reach my dreams i need more budget for my fb ads campaings . The monthly salary in my contry is 5$ (yup 5 dolars per month ) . But as an engineer i earn 40$ per month ( is a lot but not enough to reach my goals , run some ads or even buy a car) . Thats why im here , i am looking for a crowdfunding or donations , i want to quit my 8-5 job to focus only on my business .\n\nPD: Im here on reddit and not on (gofundme vs indiegogo ) Because those platforms won't allow my country ( even if i have a paypal or USA bank Account)\n\nHere are some important links\n\nmy personal instagram account : [https://www.instagram.com/aj\\_marin\\_mata/](https://www.instagram.com/aj_marin_mata/)\n\nMy business instagram : [https://www.instagram.com/lettyshop.ca](https://www.instagram.com/lettyshop.ca)\n\nMy website : [www.lettyshop.com](https://www.lettyshop.com/)\n\nMy paypal business account for donations : [lettyshop.ca.vnz@gmail.com](mailto:lettyshop.ca.vnz@gmail.com)\n\nhttps://preview.redd.it/1bbj31mb56k41.png?width=1876&amp;format=png&amp;auto=webp&amp;s=9fa9d8a85d963322a660358be5d13fad31dd78d9\n\nhttps://preview.redd.it/89joyylb56k41.png?width=1914&amp;format=png&amp;auto=webp&amp;s=65549035ac9b344818990cdcb29a4c4f748f7747\n\nhttps://preview.redd.it/q7yz0cmb56k41.png?width=1886&amp;format=png&amp;auto=webp&amp;s=e4e9c561e11ce215b118e1aabeac0d2d916f58f4",
        "subreddit": "RobinHood",
        "title": "Entrepreneur Looking for a crowdfunding",
        "url": "https://www.reddit.com/r/RobinHood/comments/fc4zjj/entrepreneur_looking_for_a_crowdfunding/",
        "created": 1583144246.0
    },
    {
        "author": "traderchile",
        "created_utc": 1584131008,
        "id": "fi65oa",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Hi, i don’t wanna keep investing alone through a broker. It’s too hard and volatile. I need a fund manager to put my money on S&amp;P ETF. I don’t live in USA. I need something 100% online and deposit on my account from a credit card or PayPal or hyperwallet or something like that. Anyone knows a good fund or asset manager of that type?",
        "subreddit": "investing",
        "title": "Fund or asset manager",
        "url": "https://www.reddit.com/r/investing/comments/fi65oa/fund_or_asset_manager/",
        "created": 1584159808.0
    },
    {
        "author": "Ituglobal",
        "created_utc": 1583856675,
        "id": "fgg81g",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Annual Forecast for PayPal – 2020",
        "url": "https://www.reddit.com/r/stocks/comments/fgg81g/annual_forecast_for_paypal_2020/",
        "created": 1583885475.0
    }
]