[
    {
        "author": "mtmtrader",
        "created_utc": 1588337344,
        "id": "gbhhs1",
        "num_comments": 41,
        "num_crossposts": 0,
        "selftext": "Gap Up: $SPI $MDGS $CHFS $MVIS $AKRX $AMTX\n\nGap Down: $EYES $WDC $VVUS $NAIL\n\nPrevious Day Movers: $XELA $THMO $CHAP $MTP $TTI\n\nClick the link below to view news headlines, support levels, resistance levels, and other info for these stocks!\n\n[https://imgur.com/a/SILyKur](https://imgur.com/a/SILyKur)\n\nPlease read before commenting “How can I use this after these stocks have already gone up?”\n\nGaps in either direction present great day trade opportunities and usually have strong relative volume, increased volatility, and recent news/press releases! There are **tons** of different gap trading strategies, some of which allow you to profit from them going up from buying and selling and others that allow you to profit from them going down from short-selling and covering.\n\n**Example 1**: Some stocks will gap up and continue running throughout the day… known as a “gap and go.” These make great buy opportunities. Not all gap ups will gap and go, but you can use both fundamental and technical analysis to find ones with the highest probability of doing so.\n\n**Example 2**: Other gap ups will come straight back down at the open. These are usually stocks with poor fundamentals and a history or dilution/offerings. If you have an account with a broker that allows short-selling, these often make great short opportunities that allow you to profit from them coming back down after they gap up.\n\n**Example 3**: A lot gap downs will become very oversold and end up bouncing back up a bit after the market opens. Depending on the news and the individual company, gap downs can offer a great opportunity to get shares at a discount before a bounce.\n\nAt the end of the day, I hope this just shows that I am **not** posting these to show what has been missed out on, but to hopefully give some good day trade opportunities. It’s still important to do additional research on these stocks before you decide to place any trades!",
        "subreddit": "RobinHoodPennyStocks",
        "title": "05/01/20 MORNING WATCHLIST",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/gbhhs1/050120_morning_watchlist/",
        "created": 1588366144.0
    },
    {
        "author": "Kant_sleep13",
        "created_utc": 1588337097,
        "id": "gbhfk4",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "Good Morning, Here's the watch list\n\nGap Ups: BA, CLX, MDGS, MRNA, TVIX/UVXY, \n\nGap Downs: JNUG/NUGT, NVDA, TQQQ, WDC\n\nMarkets gapping down again. As I have stated previously, trading large gap days are some of the most difficult to trade. Hundreds of stocks are reporting earnings, yet almost none are reacting pre market which is concerning. There is a good chance I will sit today out as most gap downs are gapping into moving averages and I don't see many stocks with good opportunities. If I decide to trade today, I will be patient off of the immediate open and concentrate on key levels of support or resistance for entries. Due to most stocks gaping into support, the list today will be short and I will be running scans intraday to look for better opportunities on earnings plays if any decide to trigger. Before entering into any positions, have a defined risk to reward with stops and targets calculated before entering trades. Good luck trading and have a good weekend.",
        "subreddit": "StockMarket",
        "title": "Stock Watch List May 1, 2020",
        "url": "https://www.reddit.com/r/StockMarket/comments/gbhfk4/stock_watch_list_may_1_2020/",
        "created": 1588365897.0
    }
]