[
    {
        "author": "stormwillpass",
        "created_utc": 1579897800,
        "id": "etg465",
        "num_comments": 11849,
        "num_crossposts": 0,
        "selftext": "Welcome back to another edition of the Weekend Discussion Thread. Fourth trading week of the year has finished. \n\nAs a tradition that started forty-three Fridays ago, the first three commenters in each Weekend Discussion Thread will get a flair if they don't already have one, a flair change, or to designate a flair for someone else.\n\nNotable earnings for [the upcoming week](https://i.imgur.com/IygZDso.png).\n\nMany heavy hitters reporting next week, including Apple, Microsoft, Tesla, Facebook, Boeing, AMD, Visa, Amazon, etc.\n\nVerify dates on your brokerage platform in case of errors/changes.\n\n___\n\nLink to [helplines can be found here](https://old.reddit.com/r/wallstreetbets/comments/dwwugh/weekend_discussion_thread_november_1517_2019/f7m0i3g/)",
        "subreddit": "wallstreetbets",
        "title": "Weekend Discussion Thread - January 24-26, 2020",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/etg465/weekend_discussion_thread_january_2426_2020/",
        "created": 1579926600.0
    },
    {
        "author": "cookingboy",
        "created_utc": 1580153461,
        "id": "eusz3g",
        "num_comments": 683,
        "num_crossposts": 0,
        "selftext": "**Disclamer**: This isn’t a fear mongering post about the virus itself. To put it into perspective the Swine Flu epidemic of 2009 has over 110k confirmed cases and close to 4000 deaths in the US alone yet many people don’t even remember that. But that’s for a different discussion in a different sub.\n\nI’m currently in Shanghai now, from my observation people in the West are not spending enough time talking about how devastating this virus has been to the Chinese economy and its certain global ramifications.\n\nLet’s take the city of Shanghai for example. It’s not one of the more heavily impacted cities, it’s not quarantined and people can mostly come and go freely. Many businesses are still open, from restaurants to malls.\n\nHowever for the first time ever I saw an Apple store with more employees than customers, and an open Starbucks with absolutely zero customers inside. The streets on a Saturday afternoon were about as empty as it would be at midnight on a regular weekday. All of this is happening during what’s supposed to be the  busiest week for consumer spendings in China.\n\nThe worst part is this doesn’t seem like it will change any time soon. Shanghai just announced that they will extend the CNY holidays by another week and people will like remain fearful for the coming weeks, if not months if we don’t see a dramatic turnaround of the virus situation.\n\nWhat this means is that any Western company that relies significantly on China for revenue would see their first quarter earning absolutely *crushed*, especially considering their forecasts were done with the assumption of this quarter being the best quarter of the year. For example I’m foreseeing Apple miss their Greater China’s revenue by as much as 50% this quarter, and it would be even worse for companies like GM, Ford and the airlines.\n\nFurther more this will impact the global manufacturing and supply chain significantly. I don’t know enough to model out a detailed scenario but my gut feeling tells me a prolonged manufacturing shutdown across major Chinese cities would be more than a little disruptive in that regard.\n\nI’m discounting the impact of the virus if it were spread to other countries in any significant numbers, but even considering the situation in China alone it’s extremely worrying.",
        "subreddit": "investing",
        "title": "People aren’t fully realizing the economic impact of the Chinese Corona Virus",
        "url": "https://www.reddit.com/r/investing/comments/eusz3g/people_arent_fully_realizing_the_economic_impact/",
        "created": 1580182261.0
    },
    {
        "author": "choose_a_use",
        "created_utc": 1580243697,
        "id": "evb5rj",
        "num_comments": 653,
        "num_crossposts": 0,
        "selftext": "*  **EPS:** $4.99 vs. $4.55 estimated\n* **Revenue:** $91.8B vs $88.50 billion estimated\n* **iPhone revenue:** $55.97 billion vs. $51.62 billion estimated\n* **Services revenue:** $12.7 billion vs $13.07 billion estimated\n* **Other Products revenue**: $10 billion vs. $9.52 billion estimate\n* **Gross Margin:** 38.4% vs 38.1% estimated\n* **Q2 revenue guidance:** $63 billion to $67 billion vs. $62.45 billion\n* **Q2 margin guidance**: 38% to 239% vs. 38.2%\n\n**Jesus fuck they fucking smashed it**",
        "subreddit": "wallstreetbets",
        "title": "AAPL Earnings Thread",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/evb5rj/aapl_earnings_thread/",
        "created": 1580272497.0
    },
    {
        "author": "jeweled_sky",
        "created_utc": 1577914666,
        "id": "eio7dn",
        "num_comments": 643,
        "num_crossposts": 0,
        "selftext": "The year is 2017, my parents had a successful real estate business with over a dozen rental properties and several fix and flip projects in production. Our assets totaled a million and a half after paying off all loans if we ever liquidated everything. Which we did, and that’s just the tip of the iceberg.\n\nMy oldest brother made the brilliant decision that because he lost his job, he should start day trading. He quickly made $30k on Apple by yoloing his saving in shares before an Apple products release event. Excited by this, he made an entire PowerPoint presentation convincing the family to get into day trading. We were reluctant at first, and I wish it stayed that way.\n\nIn the background he worked with my parents in setting up a family company and opening trading accounts and buying courses. Keep in mind my parents will do anything he says, completely wrapped around his finger. During this time I was getting into the house flipping business in full swing. Working on my parents properties and going to auctions for future projects. I had already set up in my mind that I was going to be a real estate investor because it was the only work I actually enjoyed doing, my parents were very profitable, and even after the 2008 housing market crash, when we lost everything, they were able to bounce back.\nThen one day everything stopped, my parents stopped working real estate and with no capital of my own I couldn’t continue doing it myself. \n\nThey liquidated most of their assets and set up trading accounts with TD. They tried setting up weekly quotas and profit targets, which looking back, were really unrealistic. We needed 20k per month and sometimes more to cover loans from the very last rentals that hadn’t sold just yet. So naturally while they were on the market the quota for the month was 20k...for inexperienced day traders. It dawned on me that money is easy to make every month when a tenant gives it to you rather than we ourselves have to endure risk to make it, but my parents didn’t listen to me, it had to be my brothers way.\n\nYou can probably guess what happened. Loss after loss made our account grow smaller and smaller; and the smaller it got the more we had to risk to make bigger profits. Which only happened once where I made nearly 50k trading Netflix on its highest volume day in 2018. That quickly gotten absorbed by bills. But. By 2018 we were already down some 200k and our bills had been quickly eating up our saving. All the way to the point we starting taking loans just cover expenses and continue trading. Then one day I lost 80k on netflix when it’s earnings made it drop nearly a hundred dollars. If it went up well I’d be into real estate again. I nearly had a heart attack and stayed in bed for I don’t even know how long. If it weren’t for my girlfriend I think I might have killed myself.\n\nWe were forced to live in our last property for a few months before selling it to avoid foreclosure and then my entire family moved into a 1 bedroom apartment my brother still had in Pasadena. Which is an urban city so the rent was 3k. Which was nearly impossible to pay. We did Uber Eats deliveries every single day to just try to make enough money to eat and did some trading with money we borrowed from our extended family. All of our credit scores were shot and there was nothing left to borrow on. Then we sold our very last property and made 100k on the sale. Which we lost.\n\nNearly all of our losses were on options, and they were a direct result of our trading strategy, which was laughable. They set guidelines for the option expiration, loss tolerance, and investment amount(no swing trading). Which hey sounds great why not. Except that when our expenses were so great, the low risk meant we were burning more than we were making, the stress made me make some good and bad trades in an attempt to save my family from ruin. On some trades I would have made literal hundreds of thousands if my parents and older brother didn’t force sell my positions because they couldn’t stomach swing a loss(16k in HD $215 strike bought at $201 and it reached $215 a day before expiration which would have been a $170k profit because instead was forced to be a $2k loss). It really kills your heart to see how much money you could have made, not because you took profits too early, because no one believed you and took a loss on your behalf.\n\nWith no more options we packed up and moved to Maryland were my older brother got a 100k plus job coding websites. Things were good for a while and with no rush to cover rent or bills I was actually able to grow a small account from 4K to 17k. All good things must come to end sadly. He developed MS because of the stress of losing hundreds of thousands in a few years and his relationship was failing as well. These things affected his ability to learn new programing languages or work efficiently so his job fired him. Then it was up to me to make enough to cover the expenses and slowly I saw the account cannibalized to 0. They blame me almost exclusively for losing all the money by the way.\n\nWe moved back to California being forced to stay within the same apartment complex company because no where else will accept us. Now my brother is suicidal, he’s also diabetic and he’s tried killing himself by overdosing on insulin. His hope is at 0. I’ve matured more than any young adult should have from this ordeal so I feel like I can keep going. But moral is low. My parents work nearly 14 hours a day driving for Uber eats. I can’t really help because I had my ankle fused back in July. My other brother doesn’t live with us anymore because of all the chaos that happened. My parents have real estate licenses and they are trying really hard to find clients. I wish there was more I can do. I learned I should have fought more for our family to continue real estate investing. Nothing made us happier than flipping houses. If I had the opportunity to flip a house I’m sure we could jumpstart that career with my parents’ experience. I’m not against trading even after losing everything, sadly it took that much for me to do it half decently. I’m sticking to vertical spreads on etfs and precious metals, which brings in some profits every few weeks but not enough to make living. Sometimes I’ll use around $50 on near expiration out of the money calls of puts to try to get lucky. Sometimes the temptation to let my whole account ride on naked options is strong. Not because I want to be rich, but because I just want my parents to stop working so hard in something they don’t even enjoy doing at their age. I wanted to share my story because I saw how some of you guys shared similar experiences, and some of you were the exceptions that won in the end. Invest in real estate, it’s profitable if you work with someone who has experience and the market hasn’t tanked. I’m going to Texas in a few days to propose to my girlfriend and bring her back to California. If she says yes it’ll be the highlight of my life.\n\nTLDR; Stocks bad, Real Estate good",
        "subreddit": "wallstreetbets",
        "title": "Day Trading, how I lost it all.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eio7dn/day_trading_how_i_lost_it_all/",
        "created": 1577943466.0
    },
    {
        "author": "kickme22",
        "created_utc": 1580247416,
        "id": "evc2re",
        "num_comments": 399,
        "num_crossposts": 0,
        "selftext": "https://www.apple.com/newsroom/2020/01/apple-reports-record-first-quarter-results/",
        "subreddit": "investing",
        "title": "Apple 2020Q1 Earnings",
        "url": "https://www.reddit.com/r/investing/comments/evc2re/apple_2020q1_earnings/",
        "created": 1580276216.0
    },
    {
        "author": "traderfirstyear",
        "created_utc": 1580232365,
        "id": "ev8gh1",
        "num_comments": 321,
        "num_crossposts": 0,
        "selftext": "Traderfirstyear - Reiterates call to go buy Puts on any bounce in the Technology cartel. I am suggesting going into earnings tonight [$AAPL](https://stocktwits.com/symbol/AAPL) will sell off, so you should purchase Puts at the far left end of tonight's implied move. I am also suggesting a \"lotto ticket,\" which expires this week 1/31/2020   Traders should buy the 300 1/31/2020 Put on tonight's Earnings - [$AAPL](https://stocktwits.com/symbol/AAPL) will likely sell off greater then 5% tonight followed through in the morning.   \n\n\\*I normally do not recommend lotto tickets, but this is also an earnings implied move play, which is grossly overvalued.  \n\n I also would recommend not putting ALL your eggs on this one \"lotto ticket\" and staggering the contracts  \n\n1/31/2020 50% 300 Put \n\n2/21/2020 25% 300 Put  \n\n3/20/2020 25% 295 Put  \n\nAs always good luck and we will know the results tonight &amp; tomorrow 1/29/2020 :) \n\n [https://stocktwits.com/traderfirstyear/message/192206793](https://stocktwits.com/traderfirstyear/message/192206793)",
        "subreddit": "options",
        "title": "Traderfirstyear - Recommends Apple Lotto Ticket on Tonight's Earnings 5% + Sell Off at 4:15 - Could be upwards of 80% returns relatively quickly",
        "url": "https://www.reddit.com/r/options/comments/ev8gh1/traderfirstyear_recommends_apple_lotto_ticket_on/",
        "created": 1580261165.0
    },
    {
        "author": "Ghostweed2",
        "created_utc": 1579579216,
        "id": "erp4z8",
        "num_comments": 304,
        "num_crossposts": 0,
        "selftext": "I’m a retired old guy (62) and don’t expect to live forever. Maybe to 2050? My question: what large, secure, dividend paying, American stocks would you buy to hold for decades?\n\nCurrently long, Apple, Intel, Pepsi, Starbucks, Verizon &amp; AT&amp;T. Unwilling to invest in tobacco, munitions, mining, oil. Considering UPS, FDX, V, or MA. Not really a risk taker, at my age.\n\nCheers,\n\nJeff",
        "subreddit": "stocks",
        "title": "Stocks for 30 years?",
        "url": "https://www.reddit.com/r/stocks/comments/erp4z8/stocks_for_30_years/",
        "created": 1579608016.0
    },
    {
        "author": "PrestigeWWinc",
        "created_utc": 1578757842,
        "id": "en90jv",
        "num_comments": 264,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "From a single AAPL call on Dec 20th: 13000% gains",
        "url": "https://i.redd.it/qtbwi3u386a41.jpg",
        "created": 1578786642.0
    },
    {
        "author": "cdiamand",
        "created_utc": 1579267563,
        "id": "eq0c8i",
        "num_comments": 230,
        "num_crossposts": 0,
        "selftext": "See you in CallHalla Brothers\n\n1 SPY - 3634 mentions \n\n2 TSLA - 3188 mentions \n\n3 BYND - 2038 mentions \n\n4 AMD - 1713 mentions \n\n5 AAPL - 1326 mentions \n\n6 SPCE - 990 mentions \n\n7 BA - 573 mentions \n\n8 TSM - 492 mentions \n\n9 AMZN - 467 mentions \n\n10 BAC - 457 mentions \n\n11 ROKU - 447 mentions \n\n12 MSFT - 435 mentions \n\n13 TGT - 384 mentions \n\n14 ACB - 372 mentions \n\n15 PTON - 342 mentions \n\n16 NIO - 292 mentions \n\n17 BABA - 276 mentions \n\n18 DIS - 273 mentions \n\n19 JPM - 242 mentions \n\n20 FB - 208 mentions \n\n21 DOW - 198 mentions \n\n22 SU - 172 mentions (not a stock, you weirdos just love su bae)\n\n23 UBER - 167 mentions \n\n24 TLRY - 148 mentions \n\n25 CGC - 148 mentions \n\n26 QQQ - 136 mentions \n\n27 MU - 134 mentions \n\n28 NFLX - 131 mentions \n\n29 LK - 131 mentions \n\n30 SBUX - 122 mentions \n\n31 SNAP - 121 mentions",
        "subreddit": "wallstreetbets",
        "title": "WSB stock mentions over the last 7 days",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eq0c8i/wsb_stock_mentions_over_the_last_7_days/",
        "created": 1579296363.0
    },
    {
        "author": "BiergartenDayTrader",
        "created_utc": 1580492787,
        "id": "ews0c1",
        "num_comments": 225,
        "num_crossposts": 0,
        "selftext": "You've called us gay. You've told us to eat shit. You told us to worship your Daddy Elon and AAPL. You laughed at us while you won millions on your calls and wasted it on autistic hookers, bad blow, and gloryholes.\n\nBut now we're the ones laughing. Activate Order Covfefe. \n\nBEAR GANG, AWAKEN!!",
        "subreddit": "wallstreetbets",
        "title": "To all Bulls",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ews0c1/to_all_bulls/",
        "created": 1580521587.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1579209359,
        "id": "eppqty",
        "num_comments": 196,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2020/01/16/alphabet-stock-hits-1-trillion-market-cap-for-first-time.html\n\nAlphabet hit the $1 trillion market capitalization, making it the fourth U.S. company to hit the milestone after Apple, Amazon and Microsoft.\n\nDespite the company’s seemingly perpetual cultural clashes, Wall Street sees more dollar signs.",
        "subreddit": "stocks",
        "title": "Alphabet, Google’s parent company, hits trillion-dollar market cap for first time",
        "url": "https://www.reddit.com/r/stocks/comments/eppqty/alphabet_googles_parent_company_hits/",
        "created": 1579238159.0
    },
    {
        "author": "rascally1980",
        "created_utc": 1579965010,
        "id": "etrv6x",
        "num_comments": 187,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "investing",
        "title": "Apple stock is soaring right now. How do you know if this is a time to be “fearful when others are greedy” and sell some shares?",
        "url": "https://www.reddit.com/r/investing/comments/etrv6x/apple_stock_is_soaring_right_now_how_do_you_know/",
        "created": 1579993810.0
    },
    {
        "author": "farzyness",
        "created_utc": 1579200176,
        "id": "epnjnd",
        "num_comments": 173,
        "num_crossposts": 0,
        "selftext": "Hi gang,\n\nI posed two different models in the last 6 years that I'm continually revisiting and updating based on new data that's available to me.\n\nHere's the first one below from 6 years ago where I attached a $450 price target by end of 2018\nhttps://old.reddit.com/r/investing/comments/1k15cb/my_model_of_tsla_through_2013/?st=k5h2987i&amp;sh=78a9694b\n\nHere's the second one I posted a year later with a price target of $800 by end of 2020\nhttps://old.reddit.com/r/investing/comments/1yn1kx/my_revised_model_of_tesla_tsla_by_2023/?st=k5h26rti&amp;sh=43f78d64\n\nIt appears that my models are running roughly a year behind of where my assumptions are ending up, so I figured I'd share my latest model for your viewing and entertainment pleasure.\n\nIn no way am I trying to insinuate that my models are somehow predicting where Tesla's price is going to end up - I'm simply sharing my thought process with you fine folks in the investing community to gather feedback and understand different points of view.\n\nSee below model:\nhttps://docs.google.com/spreadsheets/d/1GUPfQhpFfax8lYC4iyvYT-gD_i9LIRkngFB_o6MZXA8/edit?usp=sharing\n\nMy broad assumptions:\n\n* There will be a 90,000,000 global new vehicle market in 2028\n* Roughly 50% of those sales will be electric\n* Tesla will capture 17% of the EV market which is roughly 7.6 million cars a year\n* I'm assuming a new vehicle introduced in 2025 that will capture the truly affordable car market that will be designed in China and released for worldwide consumption (average of $20k per car without autonomous features). This is called Cybercar in the model\n* Autonomous vehicle revenue will begin to kick in around the year 2025\n* By 2028, roughly 33% of Tesla's new fleet sales (7.6 * .33 = 2.3m) will be generating some level of revenue for the company as autonomous revenue. For this model I'm assuming $7.3k of sales from autonomous per unit on average at 80% margin\n* I'm assuming roughly 1% dilution YoY\n* I'm assuming ~300k Tesla operated RoboTaxis manufactured yearly by Tesla to cover gaps in coverage in the self driving network\n* I'm assuming Tesla Energy to grow to generate similar levels of sales from the Energy business by 2028 as compared to Auto\n* i'm assuming a total operating income % of sales of 17.3% on $508b of revenue by 2028\n* I'm assuming a 38 P/E multiple on $87b of yearly earnings by 2028\n\nThat covers all the big picture stuff as it pertains to what the model takes into account.\n\nThe price is obviously eye popping and would give Tesla a market cap of ~3.5 trillion. However, the way I think about this company is drawing a parallel to Apple, which is a Hardware company that has a SaaS (Software as a Service) component bolted on top of it selling units that generate vastly more $ per unit sold, and is entering an entirely disrupted market in the last 100 years that is about as large as it gets on the auto side - and then you add energy on top of it.\n\nLet me know your thoughts.",
        "subreddit": "investing",
        "title": "My revised (again) model of TSLA through 2028 (Price Target of $17,600 in 2028)",
        "url": "https://www.reddit.com/r/investing/comments/epnjnd/my_revised_again_model_of_tsla_through_2028_price/",
        "created": 1579228976.0
    },
    {
        "author": "steel_sentinel",
        "created_utc": 1579515463,
        "id": "erbgbh",
        "num_comments": 165,
        "num_crossposts": 0,
        "selftext": "25 and just had a quarter life crisis and thought about retirement for the first time ever. Just opened a Roth IRA, looking to get the most bang for my buck for the next 25+ years with this account. \n\nI have two simple strategies I am considering employing. I'm thinking about either investing only in one mutual fund and/or total market ETF and 1-3 individual stocks that would only make up 10-20% of my portfolio(V, MSFT and AAPL most likely). My other strategy would be investing in 10-20 blue chip stocks with with high revenue, low debt and decent dividend payouts (WFC, MO, CCI for example). What strategy is best for very long term growth? \n\nIn regards to the first strategy, if I'm going very long in a Roth IRA wouldnt a mutual fund be better than an ETF? Should I do one or both?\n\nIn regards to the second strategy, since Roth IRA isnt taxed, does it make more sense to go after blue chip dividend stocks or growth stocks?\n\nThanks in advance!",
        "subreddit": "investing",
        "title": "Best 'bang for your buck' long term strategy for Roth IRA account",
        "url": "https://www.reddit.com/r/investing/comments/erbgbh/best_bang_for_your_buck_long_term_strategy_for/",
        "created": 1579544263.0
    },
    {
        "author": "Givenchygurpreet",
        "created_utc": 1578244361,
        "id": "ekfs0c",
        "num_comments": 159,
        "num_crossposts": 0,
        "selftext": "So last decade apple grew like crazy. This decade are we seeing continual growth or has it peaked???. \n\nMy thoughts are: it will continue to grow like 2010s as 5g phones will be a big hit over two years. Airpods are still in demand. Then new wearable technology they will explore into. I dont see an icar but definitely something big this decade for them to stay on top. I always think they will be relevant as existing products are updated and released.",
        "subreddit": "stocks",
        "title": "Apple still top 5 of the new decade?",
        "url": "https://www.reddit.com/r/stocks/comments/ekfs0c/apple_still_top_5_of_the_new_decade/",
        "created": 1578273161.0
    },
    {
        "author": "JakeFromStateFarm462",
        "created_utc": 1579454490,
        "id": "eqz4sr",
        "num_comments": 157,
        "num_crossposts": 0,
        "selftext": "NFLX is insanely overpriced\n\nAight, here me out\n\nI don’t understand why people think NFLX is worth $340.00. The stock is a time bomb about to go off faster than a lonely backpack on a park bench.\n\nNFLX loses BILLIONS in cash every year and doesn’t seem to be stopping anytime soon.\n\nNot only that but for the first time in history the sales growth is slowing down. \n\nThey are getting actual viable competition as well now compared to that depressed unknown high schooler HULU. DIS and AAPL are going to smash Netflix and take over the streaming industry.\n\nDIS has a monthly cost of only $7.00 while the full version of NFLX costs fookin $16.00. Who ain’t going to switch to DIS and get that sweet deal.\n\nThe only reason NFLX got where it is, is because of there move against Blockbuster. I tell you what though, AAPL and DIS are definitely going to beat NFLX’s ass this time.\n\nShort NFLX.",
        "subreddit": "wallstreetbets",
        "title": "NFLX is Insanely Overpriced",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eqz4sr/nflx_is_insanely_overpriced/",
        "created": 1579483290.0
    },
    {
        "author": "rageofanarchy",
        "created_utc": 1579607645,
        "id": "ertlo4",
        "num_comments": 150,
        "num_crossposts": 0,
        "selftext": "More and more these days I see Netflix picking up big movies and putting them on their platform. I just saw a new mark wahlburg movie trailer and thought wow, Netflix is getting into that position where they can just buy anything they want, and movie makers will go for it because everyone’s watching Netflix.\n\nDisney and Apple on the other hand have to stick to their guns, especially Disney. There’s a look, a feel, a branded image that comes along with these two giants - youll never see Disney put out a horror movie or a movie with raunchy sex scenes. But Netflix on the other hand, they’re the jack of all trades, master of none which means they’ll just continue to pick up anything and everything.\n\n*my thoughts not based on anything factual",
        "subreddit": "stocks",
        "title": "Disney/Apple Brand will hurt them - Netflix seems to be seizing the opportunity.",
        "url": "https://www.reddit.com/r/stocks/comments/ertlo4/disneyapple_brand_will_hurt_them_netflix_seems_to/",
        "created": 1579636445.0
    },
    {
        "author": "TripleBrain",
        "created_utc": 1580250726,
        "id": "evcxk6",
        "num_comments": 145,
        "num_crossposts": 0,
        "selftext": "* iPhone primary driver for the record performance, but also feuled by record quarter in services (despite missing expectations in this area), and a \"blowout\" quarter for wearables.\n* iPhone 11's was the top pick for the line, showing that the renovated 3 camera system is not an aesthetic issue.\n* Double digit growth in every category outside of the iPhone!\n* Double digit growth in the U.S, France, Singapore market and an \"emerging market\" with strong performances in Brazil, China, India, Thailand, and Turkey.\n* \"Phenomena demand\" for Airpods and AirPod Pro's for noise cancelling properties.\n* Get this! 75% of Apple Watch purchased were new to Apple Watch. WOW!Wearables are on a roll!\n* iPad sales growth in Mexico, Phillipines, Vietnam, and Thailand.\n* iPhone trade in program doubling compared to the previous year.\n* $2.5B plan for housing development project in California and extending help for community contributors like fire fighters, police, teachers, etc. Great for media!\n* Apple Care/Trade-in program is doing well and have helped to retain loyal customers.\n* $10B in stock repurchases - HOLY !@#$!\n* Net Cash - 99B (that is after debt reduction), but $200B in hand.\n* Apple wearables + home accessories category up 37%\n* Plans to offset seasonality issue by leveraging larger mix of products and services.\n* Plans to grow Apple TV+ business by offering 1 year free services with essentially any Apple product purchase.\n* Apple continuing to take measures to take measures to mitigate virus impact. Cooks says Wuhan sales are not a decisive factor and is \"reflected in the guidance\". PRICED IN!\n* Addressing 1% slow down in services: Apple has already met the double digit growth and Apple TV+ is just starting off and will not materialize it's impact until the following quarters as it continues to grow and add to the services business.",
        "subreddit": "wallstreetbets",
        "title": "AAPL: For those that aren't up to date with conference call",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/evcxk6/aapl_for_those_that_arent_up_to_date_with/",
        "created": 1580279526.0
    },
    {
        "author": "throwaway_investguy",
        "created_utc": 1579547434,
        "id": "erhwso",
        "num_comments": 141,
        "num_crossposts": 0,
        "selftext": "My allocations:\n\n&amp;#x200B;\n\n|Investments|Balance|Percentage of Total|\n|:-|:-|:-|\n|Vanguard SP500 Index|$69,185|35%|\n|Vanguard extended market (small cap)|$ 32,353.42 |16%|\n|MFS International Growth|$ 32,353.42 |11%|\n|BAC|$ 14,370.87 |7%|\n|GOOGL|$ 11,836.16 |6%|\n|MSFT|$ 4,765.65 |2%|\n|AAPL|$ 4,547.19 |2%|\n|VHT|$ 4,512.36 |2%|\n|QQQ|$ 3,124.95 |2%|\n|BABA|$ 2,046.87 |1%|\n|AMZN|$ 1,864.72 |1%|\n|JPM|$ 1,608.24 |0.8%|\n|AMD|$ 1,527.9 |0.8%|\n|SPOT|$1,335.06 |0.7%|\n|UBER|$ 1,053.9 |0.5%|\n\n&amp;#x200B;\n\n|Crypto|Balance|Percentage of Total|\n|:-|:-|:-|\n|Bitcoin|$13,612|7%|\n|Ether|$883.35|0.4%|\n|Ripple|$511.50|0.3%|\n\n&amp;#x200B;\n\n|Cash|Balance|Percentage of Total|\n|:-|:-|:-|\n|High Yield Savings|$6,000|3%|\n|Checkings/Savings|\\~$2,000|1%|\n\nAll equity investments are in retirement accounts.  Total net worth in traditional IRA = 40%, ROTH 48%.",
        "subreddit": "investing",
        "title": "I've saved almost 200k at 30, here's how I've allocated my money",
        "url": "https://www.reddit.com/r/investing/comments/erhwso/ive_saved_almost_200k_at_30_heres_how_ive/",
        "created": 1579576234.0
    },
    {
        "author": "lonnie123",
        "created_utc": 1580343191,
        "id": "evw2qo",
        "num_comments": 139,
        "num_crossposts": 0,
        "selftext": "Not 18 months ago Apple hit the 1T valuation mark... what exactly have they done to almost gain another half TRILLION on top of that?\n\nI know they have begun to monetize services more heavily but is that really worth another half trillion?",
        "subreddit": "investing",
        "title": "Apple is nearly already at $1.5T market cap",
        "url": "https://www.reddit.com/r/investing/comments/evw2qo/apple_is_nearly_already_at_15t_market_cap/",
        "created": 1580371991.0
    },
    {
        "author": "bobbythebich",
        "created_utc": 1580234361,
        "id": "ev8x51",
        "num_comments": 137,
        "num_crossposts": 0,
        "selftext": "So here is the option flow data, these are not all the orders but new orders (most likely) based on the volume exceeding the open interest. These orders were from 9:30 - 12:45 today.\n\n&amp;#x200B;\n\nData is here:\n\nTSLA - [https://ibb.co/mqPgP6V](https://ibb.co/mqPgP6V)\n\nAAPL - [https://ibb.co/1mDfZD6](https://ibb.co/1mDfZD6)\n\nPYPL - [https://ibb.co/Hz1Xjbz](https://ibb.co/Hz1Xjbz)\n\nMMM - [https://ibb.co/rdgMnbD](https://ibb.co/rdgMnbD)\n\nFB - [https://ibb.co/W661Xvq](https://ibb.co/W661Xvq)\n\nEBAY - [https://ibb.co/wRmB5hv](https://ibb.co/wRmB5hv)\n\nDIS (non earnings)- [https://ibb.co/dc5s5Sx](https://ibb.co/dc5s5Sx)\n\nAMD - [https://ibb.co/Hx77sfm](https://ibb.co/Hx77sfm)\n\n&amp;#x200B;\n\nPlease don't delete this post as it contains detailed info with more help then most posts, it took a bit of time too. I would appreciate an upvote.\n\n&amp;#x200B;\n\nI would say ebay has been looking strong, its had flow on calls for atleast 2 weeks.",
        "subreddit": "wallstreetbets",
        "title": "Earnings Data for Today and Tomorrow, Many Included",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ev8x51/earnings_data_for_today_and_tomorrow_many_included/",
        "created": 1580263161.0
    },
    {
        "author": "MaxAds1",
        "created_utc": 1580256976,
        "id": "evehxd",
        "num_comments": 121,
        "num_crossposts": 0,
        "selftext": "God damn it I told myself I wouldn't do this again but I went ahead and bought some fucking TSLA puts for tomorrow. 450 1/31 expiration, hoping for a sell off in the morning.\n\nDid anyone else do something as stupid as this? I made some big tendies from AAPL and MSFT credit put spreads so this is fun money.\n\nDon't you fuck me Elon.",
        "subreddit": "wallstreetbets",
        "title": "TSLA Puts Tomorrow",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/evehxd/tsla_puts_tomorrow/",
        "created": 1580285776.0
    },
    {
        "author": "blaked_baller",
        "created_utc": 1578688079,
        "id": "emwntb",
        "num_comments": 113,
        "num_crossposts": 0,
        "selftext": "Today sucked for all of us\n\nFuck the bears, fucking commie pussies\n\nLoad up on calls -- Monday the bulls take back over. \n\nTesla to 500, Apple to 315, SPY to 230, you know the deal... nothing new, just the greatest Economy of all time USA USA USA\n\nSee yall Monday, Donnie tweet some positive news for us this weekend, thanks g\n\n#BULLGANG",
        "subreddit": "wallstreetbets",
        "title": "Bears had their fun...",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/emwntb/bears_had_their_fun/",
        "created": 1578716879.0
    },
    {
        "author": "HappyCamper1980",
        "created_utc": 1579105078,
        "id": "ep4bok",
        "num_comments": 110,
        "num_crossposts": 0,
        "selftext": "After many years of autistic posting and taking huge ass losses in NVDA last year I finally made it to level 7.  https://imgur.com/a/UHT9pof  Couldn't have done it without you retards (also boring shit like COST AAPL NOW DIS HD GOOG FAST).  Thanks!",
        "subreddit": "wallstreetbets",
        "title": "After many years of autistic posting",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ep4bok/after_many_years_of_autistic_posting/",
        "created": 1579133878.0
    },
    {
        "author": "Carfraction",
        "created_utc": 1579712093,
        "id": "esep5f",
        "num_comments": 107,
        "num_crossposts": 0,
        "selftext": "We are in a blow-off top that could be the top for a decade or more.  Apple hasn't been this far above it's 200 day moving average since 2012 when it  sold off 45% in the next 12 months. Tesla is at 591 and it's in a classic short squeeze that's going up so fast the longs that didn't sell at realistic levels are afraid to sell for missing out on the party, where it stops is going to be 290 but it can visit any insane price before then.  Those of you new to trading and missed the 1999 bubble can tell your kids about the bubble of 2020... and remind them Joe retail trader never wins in the end.",
        "subreddit": "stocks",
        "title": "Classic blow-off top in the market.",
        "url": "https://www.reddit.com/r/stocks/comments/esep5f/classic_blowoff_top_in_the_market/",
        "created": 1579740893.0
    },
    {
        "author": "23569072358345672",
        "created_utc": 1578728794,
        "id": "en4n3p",
        "num_comments": 104,
        "num_crossposts": 0,
        "selftext": "Has the ship sailed once they get this big. It seems like they can’t keep on the trajectory they’re on surely?",
        "subreddit": "investing",
        "title": "When companies like Apple get to the size they are. Is it pointless investing in them?",
        "url": "https://www.reddit.com/r/investing/comments/en4n3p/when_companies_like_apple_get_to_the_size_they/",
        "created": 1578757594.0
    },
    {
        "author": "runtothesun",
        "created_utc": 1578641951,
        "id": "emnqn7",
        "num_comments": 100,
        "num_crossposts": 0,
        "selftext": "I fucking love Apple.\n\nI don't even use a checking account. Or savings. I put tens of thousands into Apple at $210 thinking it would just stabilize and grow slowly. Cuz fuck bank interest and slow gains - what am I? Gay? Fuck no. Bless Tim Apple. This company is a rocket with room to go higher. For a year it's only gone in a 45 degree angle. It's hilarious because bears still exist. This company made goofy pcs 15 years ago and has since killed Nokia and the record store. They make the most popular phone ever - and all they do is re-release them with 1 new feature over and over as if they're Avengers sequels. It's amazing, retarded, and brilliant at the same time. I cant wait for iPhone 57 Pro Max. We're all gonna buy it. How? With the fucking CREDIT CARD made by the same fucking company cuz \"fuck it, lets be a bank too.\"\n\nYou're an idiot if you ain't in Apple. Think about it. Cinematic legend, autist and ping-pong retard, Forrest Gump even invested in 1994. Invested all that shrimp money in that \"fruit company\". 14,627% increase since then. He now mows lawns for 20 minutes and then fucks hookers and snorts cocaine off Jenny's grave.\n\nAnd some of you dumbasses just watch it fly instead of getting on the elevator.\n\nImagine being more retarded than Forrest Gump",
        "subreddit": "wallstreetbets",
        "title": "Forrest Gump bought Apple he's retarded. What does that make you?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/emnqn7/forrest_gump_bought_apple_hes_retarded_what_does/",
        "created": 1578670751.0
    },
    {
        "author": "kirkemg",
        "created_utc": 1578421873,
        "id": "elfi7n",
        "num_comments": 99,
        "num_crossposts": 0,
        "selftext": "What are your best/largest/\"safest\" ETF's that dont include Apple?\n\n&amp;#x200B;\n\nThanks!",
        "subreddit": "investing",
        "title": "Passively investing on my own in large ETF's. How do I get away from Apple?",
        "url": "https://www.reddit.com/r/investing/comments/elfi7n/passively_investing_on_my_own_in_large_etfs_how/",
        "created": 1578450673.0
    },
    {
        "author": "vegaseller",
        "created_utc": 1580241992,
        "id": "evaquq",
        "num_comments": 98,
        "num_crossposts": 0,
        "selftext": "Between markets spiking ever higher on no real news  (hey Apple stopped growing back in 2018 and adding another camera is not fucking innovation) and the equivalent of the spanish flu making a come back (yeah they put up quarantine for 55 million people across 20 cities just for a flu).\n\nShanghai is shut down for 2 weeks and every major factory will remain shut, that is like 2% of GDP right there. Beijing and Shanghais are literal ghost towns and people are desperately sending N95 masks from everywhere into China. This is a far bigger deal than any virus we have seen in the past 100 years. \n\nAre bulls seriously delusional and about to kill themselves over the next week or so? Seriously, there is nothing but bullish sentiment on this sub for the past month straight, everyone is loaded up on call options and tech, which is the most sensitive sector to economic fluctuations. I feel like we are headed for a correction of 10-15%+ which will last months at the very least. Enjoy your ropes boys. Remember, always inverse WSB.\n\n&amp;#x200B;\n\nProof of puts and short position\n\n[https://imgur.com/a/4cpmqOa](https://imgur.com/a/4cpmqOa)",
        "subreddit": "wallstreetbets",
        "title": "Are bulls honestly retarded?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/evaquq/are_bulls_honestly_retarded/",
        "created": 1580270792.0
    },
    {
        "author": "bay650area1",
        "created_utc": 1578932246,
        "id": "eo684w",
        "num_comments": 94,
        "num_crossposts": 0,
        "selftext": "If we look at other FAANG stocks, their growth has been incredible other the past 2 quarters, and for some reason Amazon is falling way behind. It has stalled, but for no good reason. \n\nFacebook: $182 -&gt; $220 (~23%)\n\nApple: $224 -&gt; $311 (~45%)\n\nAmazon: $1,777 -&gt; $1,890 (~7%)\n\nNetflix: $266 -&gt; $339 (~30%)\n\nGoogle: $1,209 -&gt; $1,435 (~20%)\n\nExpect $AMZN to catch up on their earnings (estimated 30th Jan).",
        "subreddit": "wallstreetbets",
        "title": "$AMZN earnings - expect 🚀 to 🌕",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eo684w/amzn_earnings_expect_to/",
        "created": 1578961046.0
    },
    {
        "author": "Influencer1980",
        "created_utc": 1580239050,
        "id": "eva1h0",
        "num_comments": 92,
        "num_crossposts": 0,
        "selftext": "Just curious who is going with Puts and who is going with Calls today prior to earnings. I was thinking of going with a put around $10 out of the money for a Friday expiration but curious on your guys thoughts? Fuckers are definitely expensive but was thinking there could be a nice swing with this Virus shit on top of things.\n\nUPDATE:\n\nOk, I get it. Thanks for the help fellas, I love the criticism on this sub, you guys crack me up. Fuck the Put, I'm going to rock calls for 3 weeks out. I'm trying so hard to get on the Bull train, it's just hard as I got rocked in 2008 but I know it's a different game today then it was back then, just going to be a bull and hedge a bit just in case. I did go short on a lot of China shit so hopefully that works out.. Fucking Tesla, WTF, I got owned on that one..\n\nPS: I did kick some ass on ES and NQ today though so that's going well for me! And to think, I was actually considering going short this morning for about a minute then just jumped on WSB quick to remind me...",
        "subreddit": "wallstreetbets",
        "title": "APPLE - Puts or Calls before earnings news?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eva1h0/apple_puts_or_calls_before_earnings_news/",
        "created": 1580267850.0
    },
    {
        "author": "optionseller",
        "created_utc": 1579935396,
        "id": "etniqm",
        "num_comments": 90,
        "num_crossposts": 0,
        "selftext": "It is clear that some institution opened a 23.3 million position in AAPL calls this Friday, expiring in 14 days. The 300 strike call dwarfs ATM calls volume 5:1. This is beyond autistic scale. Some serious money at work\n\n&amp;#x200B;\n\n[AAPL option volume on Jan 24](https://preview.redd.it/wrxducu3gvc41.png?width=432&amp;format=png&amp;auto=webp&amp;s=383a442d95f86a25aa451e62818ae00ef6050ae2)\n\nOn Jan 2, a similar case happened to TSLA. Some big money opened 12377 calls in TSLA expiring on Jan 17, The call cost 1.33 on Jan 2, when TSLA was retarding at mid 420s. By expiration, TSLA mooned to mid 510s, the call exploded to 16 each piece. That's 17 million in profit 12-bagger. \n\n&amp;#x200B;\n\n[TSLA option volume on Jan 2](https://preview.redd.it/yl4nenx2hvc41.png?width=432&amp;format=png&amp;auto=webp&amp;s=61846503daceb334f6d97743564807910429324b)",
        "subreddit": "wallstreetbets",
        "title": "23.3 million position in AAPL 300 calls expiring 14 days how to profit from this insider move",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/etniqm/233_million_position_in_aapl_300_calls_expiring/",
        "created": 1579964196.0
    },
    {
        "author": "nothrowaway4me",
        "created_utc": 1578602879,
        "id": "emfopu",
        "num_comments": 85,
        "num_crossposts": 0,
        "selftext": "One of the biggest things that's being talked about when it comes to Apple is how the 5G supercycle will supercharge earnings and get the Iphone to be a top performer but I am struggling to understand that thesis. \n\n\n5G is no doubt coming, but the companies benefiting from the adoption of 5G will likely be those who are building the technology itself and the infrastructure. I see 5G as a tailwind for Nokia, AMT, Ericsson, Verizon etc. \n\n\n\nI don't think there are many customers out there who want an Iphone, can afford to get one, but are holding out for 5G? The top priorities of smartphone buyers camera performance, battery and new software features. I can't imagine most people are even aware of what 5G really is",
        "subreddit": "investing",
        "title": "Struggling to see why 5G is viewed as a big catalyst for Apple (and other phone makers)",
        "url": "https://www.reddit.com/r/investing/comments/emfopu/struggling_to_see_why_5g_is_viewed_as_a_big/",
        "created": 1578631679.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1579365142,
        "id": "eqiht9",
        "num_comments": 82,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2020/01/18/in-the-stock-market-its-become-apple-microsoft-and-alphabet-vs-everyone-else.html\n\nSo, in aggregate Apple-Microsoft-Alphabet trades at 26-times this year’s profits, with no debt and enormous capacity to invest, buy back stock or fund future dividends. The broad market is below 19-times earnings.",
        "subreddit": "stocks",
        "title": "In the stock market, it’s become Apple, Microsoft and Alphabet vs everyone else",
        "url": "https://www.reddit.com/r/stocks/comments/eqiht9/in_the_stock_market_its_become_apple_microsoft/",
        "created": 1579393942.0
    },
    {
        "author": "xbted9",
        "created_utc": 1578957280,
        "id": "eoc7ki",
        "num_comments": 74,
        "num_crossposts": 0,
        "selftext": "This growth is not sustainable. The markets injected with money by the FEDS. The valuation are crazy and it does not make sense that trillion dollar companies are moving like penny stocks. The markets literally being held up by like 10 stocks. This is just not right.\n\n\nPuts on everything.",
        "subreddit": "wallstreetbets",
        "title": "So Puts on $MSFT and $APPLE",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eoc7ki/so_puts_on_msft_and_apple/",
        "created": 1578986080.0
    },
    {
        "author": "dbrush21",
        "created_utc": 1578159143,
        "id": "ejzj5h",
        "num_comments": 72,
        "num_crossposts": 0,
        "selftext": "In this video ([https://www.youtube.com/watch?v=YvuSiM9WrzA](https://www.youtube.com/watch?v=YvuSiM9WrzA)) Warren Buffett talks about his expectations for Apple. \n\nHowever, the stock is now up over 100% for the year? Do you think the stock is overvalued right now? Would you consider buying in at this price?",
        "subreddit": "investing",
        "title": "Do you think Apple (AAPL) is overvalued?",
        "url": "https://www.reddit.com/r/investing/comments/ejzj5h/do_you_think_apple_aapl_is_overvalued/",
        "created": 1578187943.0
    },
    {
        "author": "debsman20",
        "created_utc": 1580227072,
        "id": "ev796y",
        "num_comments": 70,
        "num_crossposts": 0,
        "selftext": "All prayers have been said for AAPL. They need to come thru for wbs bull gang to jump tomorrow with joy. Let me hear from all the AAPL fans.",
        "subreddit": "wallstreetbets",
        "title": "AAPL Please give us a come back from coronavirus fall. Let your ER this evening take us to the moon with Elon's spaceship.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ev796y/aapl_please_give_us_a_come_back_from_coronavirus/",
        "created": 1580255872.0
    },
    {
        "author": "Kolo_Toure_Wife",
        "created_utc": 1580233927,
        "id": "ev8tgj",
        "num_comments": 68,
        "num_crossposts": 0,
        "selftext": "Have those hoes been going to SBUX lately? \n\nHow about TGT? I bought calls during the dip and it’s been making me some tendies, when more tender than your sisters tiddies \n\nApple AirPods? Watches? Or just generally Apple shit? \n\nIf she’s a nerd did she go Intel or AMD for her last build? \n\nspit or swallow? \n\nIf you have any noods of them please PM \n\nThanks in advance",
        "subreddit": "wallstreetbets",
        "title": "Are any of your family members basic white hoes 💁‍♀️💁‍♀️? If so report their behavior pls",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ev8tgj/are_any_of_your_family_members_basic_white_hoes/",
        "created": 1580262727.0
    },
    {
        "author": "blaked_baller",
        "created_utc": 1579714442,
        "id": "esf97y",
        "num_comments": 66,
        "num_crossposts": 0,
        "selftext": "Gain porn only, need some pretty gains to look at during this lunch break and 2020 has started off hot hot hot\n\nSpecial s/o to tesla and apple\n\n[2020 Gains](https://ibb.co/8g3Q2f6)\n\nLets keep the tendie train rolling, love you autistic fuckers",
        "subreddit": "wallstreetbets",
        "title": "FLEX YOUR 2020 GAINS",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/esf97y/flex_your_2020_gains/",
        "created": 1579743242.0
    },
    {
        "author": "cdnBacon",
        "created_utc": 1578311764,
        "id": "ekt6gn",
        "num_comments": 64,
        "num_crossposts": 0,
        "selftext": "Hi folks ... I am pretty well diversified, I think, with appropriate weights in Canadian banks and other financials, power generation and similar infrastructure, transportation through CNR, CargoJet and EIF, Some American tech (Googl and Goog, and Apple) then a few \"others\" including Badger Daylighting, Magna.  Some of these represent choices made a long time ago that I am happy with, but lately my strategy has been to find both a decent dividend (2% or higher) and an opportunity for growth (these once the fundamentals have been assessed, of course, and in the context of a company that I understand and whose leadership and direction make me happy).\n\nI have cash I need to put into play, or it is just going to go into a high interest account or a GIC.  Would prefer Canadian as this helps balance out my partner's portfolio.  Man, I am having problems finding Canadian stuff to buy.  In many cases excellent stocks that fit my parameters look to me as though they have already had their run.  \n\nI am old (!!) so pure growth plays don't make a bunch of sense to me at this point.  But I am not dead (!!!) so fire and forget dividend plays also don't particularly appeal. \n\nSo after all that ... what are your top picks, fellow Canucks?  Is it just me or are the Canadian stock shops a bit bare right now?\n\nThanks for any thoughts.",
        "subreddit": "CanadianInvestor",
        "title": "Looking around for good CDN stocks to buy and having problems finding them ... What is (are) your favourites to buy this month?",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/ekt6gn/looking_around_for_good_cdn_stocks_to_buy_and/",
        "created": 1578340564.0
    },
    {
        "author": "winkerpack",
        "created_utc": 1579953414,
        "id": "etpxn6",
        "num_comments": 63,
        "num_crossposts": 0,
        "selftext": "An apple a day keeps the doctor away\n\nA tale as old as time. Sound logic. Sickness resistant.  Long $AAPL",
        "subreddit": "wallstreetbets",
        "title": "Why Apple will not be impacted by this virus outbreak",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/etpxn6/why_apple_will_not_be_impacted_by_this_virus/",
        "created": 1579982214.0
    },
    {
        "author": "CIARRAPUNGI",
        "created_utc": 1579263006,
        "id": "epzk4c",
        "num_comments": 59,
        "num_crossposts": 0,
        "selftext": "I have invested 325euros in 11x leverage contracts in GOOG AAPL and FB, i calculated that the average daily growth of these 3 stocks in the last year was 2.36% (i know that predictig future growth based on the past isn't that good but their growth is stable and not a short term burst).\n\nTo lose all my money in a contract a stock should drop below 9.5% approximately, but i think this is unlikely to happen.\n\nI calculated that after a month(a month is considered 20 days bc 5 trading days a week) with an averaged down growth of 2.2% a day i should have 502euros.\n\nHere are the expected values of my portfolio after given amounts of time:\n\n**STARTING VALUE:** 325euros   EXPECTED **DAILY GROWTH:** 2.2% **KNOCKOUT IF:** down 9.5% or more\n\n&amp;#x200B;\n\n* **1M** 502$\n* **2M** 776$\n* **3M** 1.199$\n* **4M** 1.853$\n* **5M** 2.864$\n* **6M** 4.425$\n* **7M** 6.839$\n* **8M** 10.568$\n* **9M** 16.332$\n* **10M** 25.238$\n* **11M** 39.001$\n* **12M** 60.269$\n\n&amp;#x200B;\n\nI think this is a good idea because investing 325 euros doesn't make sense since the return i could have is too low, and if i lose all the money it's ok bc even if 325 euros are a good sum to me(i'm 18) i don't have much more to do with them, and if get this right it's a lot of money.",
        "subreddit": "wallstreetbets",
        "title": "11x leverage investment",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/epzk4c/11x_leverage_investment/",
        "created": 1579291806.0
    },
    {
        "author": "spacecomedy",
        "created_utc": 1580265655,
        "id": "evggoe",
        "num_comments": 59,
        "num_crossposts": 0,
        "selftext": "If you were to go full on Marie Kondo and assemble a portfolio of only stocks that spark joy for you personally--what would it look like? And by spark joy, I'm not talking about the joy of returns, but the sense that the products/services genuinely bring you joy. I realize this kind portfolio might exclude whole industries (i.e. not sure Lockheed's guided missile systems spark joy for many people, but maybe their existence brings peace of mind). Here's mine: AAPL (phone), DNKN (Munchkins), DEO (Guinness), UL (Q-Tips), HSY (Reese's), NFLX (ever since the DVD days), RCL (total relaxation), COF (cash back rewards).",
        "subreddit": "investing",
        "title": "Spark Joy Portfolio",
        "url": "https://www.reddit.com/r/investing/comments/evggoe/spark_joy_portfolio/",
        "created": 1580294455.0
    },
    {
        "author": "Henry1502inc",
        "created_utc": 1578043896,
        "id": "ejd5zt",
        "num_comments": 58,
        "num_crossposts": 0,
        "selftext": "Trump killed Iran’s general.... markets are in free fall. \nOne hour ago Apple was at $301.50, now it’s at $296. Amazon went from $1900 to 1864. I’m all in on Apple $300 calls that expire today.",
        "subreddit": "wallstreetbets",
        "title": "Oh good lord. Iran assignation = calls are fucked",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ejd5zt/oh_good_lord_iran_assignation_calls_are_fucked/",
        "created": 1578072696.0
    },
    {
        "author": "rawrtherapy",
        "created_utc": 1578961294,
        "id": "eod3kl",
        "num_comments": 57,
        "num_crossposts": 0,
        "selftext": "Everyone talking about Microsoft and Apple, Tesla and Fucking Beyond Meat\n\nYou retards need to realize that that boat has fucking sailed\n\nAll of you here can barely afford one share of Tesla, let alone multiple shares and calls\n\nSemiconductors are in fucking everything and big data is going to the fucking moon\n\nwith all this data companies like $AYX are printing me fucking tendies and semiconductor companies like $TSM are giving me those sweet sweet Call tendies\n\nFuck all of you, i know where the moneys at and aint nobody gonna change my mind\n\nif TESLA ever dips down to $180 sure ill throw my life savings in it but for right now Semiconductors and data companies are where its at fam",
        "subreddit": "wallstreetbets",
        "title": "You guys are all retarded, Semiconductors and Data are the girls you wife",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eod3kl/you_guys_are_all_retarded_semiconductors_and_data/",
        "created": 1578990094.0
    },
    {
        "author": "bobbythebich",
        "created_utc": 1578579951,
        "id": "emabi6",
        "num_comments": 56,
        "num_crossposts": 0,
        "selftext": "Like the title says, AAPL bulls anticipated the move past 300.\n\n100 CALL sweeper orders on/above ask and only 23 puts in sweeper orders.\n\nMost of the expires are for tomorrow and next friday, This flow data is proving it. Don't go against the trend,  \"**Markets can stay irrational** longer than you **can stay** solvent \" \n\n&amp;#x200B;\n\nHere is this data - [https://ibb.co/FbjHw44](https://ibb.co/FbjHw44)\n\n&amp;#x200B;\n\nThe day will come when things will be negative and the flow will confirm, but that's not now.",
        "subreddit": "wallstreetbets",
        "title": "AAPL BULLS anticipated the big move - Data included",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/emabi6/aapl_bulls_anticipated_the_big_move_data_included/",
        "created": 1578608751.0
    },
    {
        "author": "you_who_sleep",
        "created_utc": 1579312610,
        "id": "eqa6ng",
        "num_comments": 56,
        "num_crossposts": 0,
        "selftext": "Everyone had cracked a gain in the stock markets. Apple returned 60% to me this year and I’m starting to eyeball that sell button.",
        "subreddit": "SecurityAnalysis",
        "title": "When do you guys take profits?",
        "url": "https://www.reddit.com/r/SecurityAnalysis/comments/eqa6ng/when_do_you_guys_take_profits/",
        "created": 1579341410.0
    },
    {
        "author": "rugrat1of3",
        "created_utc": 1578500574,
        "id": "eluwmv",
        "num_comments": 55,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "investing",
        "title": "Thoughts on Apple? Buy, hold, or sell. Why?",
        "url": "https://www.reddit.com/r/investing/comments/eluwmv/thoughts_on_apple_buy_hold_or_sell_why/",
        "created": 1578529374.0
    },
    {
        "author": "Psimonkey",
        "created_utc": 1580271215,
        "id": "evhllw",
        "num_comments": 55,
        "num_crossposts": 0,
        "selftext": "Nothing beats sitting in my tendies-paid tesla model 3 where i can jerk off to my robinhood calls only portfolio in one hand and read about you gay ass bears getting hyped over some pussy shit k0R0nA virus. being bear gang makes you a terrible fucking person and you should probably kill yourself for wanting others to die so the market drops a few measly percent. \n\nI'm gonna jerk off again in my Tesla Daddy Elon model 3 TOMORROW because of TIM APPLE absolutely taking us to the promised land. GET HELP. join bull gang. get a tesla model 3. get tendies. or dont! more money for me to jerk off to.  \n\n\nSee you on the moon boys\n\nPOV CAM of my jerk sesh [everyone immediately needs to have this](https://imgur.com/a/KjoW3Oz)",
        "subreddit": "wallstreetbets",
        "title": "when will you bear cucks learn?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/evhllw/when_will_you_bear_cucks_learn/",
        "created": 1580300015.0
    },
    {
        "author": "jimmylikes1",
        "created_utc": 1579374633,
        "id": "eqkrz7",
        "num_comments": 55,
        "num_crossposts": 0,
        "selftext": "Im looking at a few of the high flyers lately for leap plays , what do you degenerates like?\n\nAMD $60 calls trading at $7.20 , breakeven $67.20\n\nTSLA $600 calls $62.85  , breakeven  $662.85\n\nBYND $120 calls $21.85 , breakeven $141.85\n\nAAPL $330 calls $28.95 , breakeven $358.95\n\ngot 11 months left to hit a multi bagger on one of these plays...\n\nmaybe just buy all of them?\n\nFeel free to post other stocks you like and the leap expiry / strike....",
        "subreddit": "wallstreetbets",
        "title": "Pick an Option Leap play for 2021 January expiry...which returns the most $$$",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eqkrz7/pick_an_option_leap_play_for_2021_january/",
        "created": 1579403433.0
    },
    {
        "author": "Brundonius",
        "created_utc": 1578948813,
        "id": "eoa5jv",
        "num_comments": 54,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "investing",
        "title": "If you had to pick ONE stock that will do what Apple did last year and see huge gains in 2020, what would it be and why?",
        "url": "https://www.reddit.com/r/investing/comments/eoa5jv/if_you_had_to_pick_one_stock_that_will_do_what/",
        "created": 1578977613.0
    },
    {
        "author": "gravityCaffeStocks",
        "created_utc": 1580094476,
        "id": "euhudd",
        "num_comments": 52,
        "num_crossposts": 0,
        "selftext": "The time has come for the ultimate showdown.\n\nBeer virus vs Earnings week lead by the tech giants!\n\n\nEverything seems to suggest that the beer virus has won Game 1 before it's even begun, and they might be right without a big bat on Monday.. not like we can expect Whirlpool to hit a homerun.\n\nAAPL is going to kill in game 2. Expect a late game grand slam, and if the market hasn't already been swayed in favor of the tech giants and earnings week, AAPL will convince them otherwise. Game 2 will also consist of AMD batting .320 like it always does, and even if it slumps early, it'll be back to hitting .320 by the end of the week. \n\nGame 3 could be a huge game for TSLA.. can TSLA really continue to bat a red hot .700 for a whole series and keep knocking in RBIs at a godly pace? My bet is yes. But it will be MSFT who brings home Game 3 and carries the team through the rest of the week. Expect a monster homerun that signifies the death of team beer virus.. one of those games where you feel the breath absolutely knocked out of the opponent. FB will choke, going 2-31 this series.\n\nGame 4 is just a continuation of team earnings game 2 and 3 victories and AMZN shines with a 3-5 day with a few RBIs, nothing incredible but enough to seal the victory for team earnings. Regardless of how game 5 plays out, the series was won here.\n\n\nMSFT 150c's and 160c's\nTSLA 6/2020 700c\nAMD 1/2021 30c and couple hundred shares\nAlways holding shares of GOOG\n253 shares of TQQQ\n\nMSFT will be MVP.",
        "subreddit": "wallstreetbets",
        "title": "Beer Virus vs Earnings Week",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/euhudd/beer_virus_vs_earnings_week/",
        "created": 1580123276.0
    },
    {
        "author": "LightningPlus",
        "created_utc": 1580104976,
        "id": "eujtzm",
        "num_comments": 52,
        "num_crossposts": 0,
        "selftext": "**Earnings Watch:  Nearly half of index, 14 out of 30 companies, expected to report  holiday-season results in busiest week of the season, which also  includes Facebook, Tesla and Amazon**\n\nThe Dow Jones Industrial Average increased more than 22% in 2019 and  is already up 2.2% through three weeks of 2020, but it is about to face  its biggest test of the young year, and potentially many years.\n\nNearly half of the 30 Dow  [DJIA, -0.58%](https://www.marketwatch.com/investing/index/djia?mod=MW_story_quote) components are scheduled to  report results from the holiday season in the coming week, which will be  by far the busiest week of the earnings season.\n\nThere are 14  Dow companies expected to report, the most companies from the blue-chip  index to report in a single week since at least 2014, a group that  includes two trillion-dollar market caps in Apple Inc. [AAPL, -0.29%](https://www.marketwatch.com/investing/stock/aapl?mod=MW_story_quote) and Microsoft Corp [MSFT, -1.01%](https://www.marketwatch.com/investing/stock/msft?mod=MW_story_quote) Plenty of non-Dow  companies will throw their numbers in as well — 141 of the S&amp;P 500  companies are expected to report, including Facebook Inc. [FB, -0.83%](https://www.marketwatch.com/investing/stock/fb?mod=MW_story_quote), Amazon.com Inc. [AMZN, -1.22%](https://www.marketwatch.com/investing/stock/amzn?mod=MW_story_quote) and Advanced Micro Devices Inc [AMD, -2.63%](https://www.marketwatch.com/investing/stock/amd?mod=MW_story_quote) \n\nThe 85 members of the S&amp;P 500 that have reported results thus far  have seen net income fall by 0.3% on average from a year ago, though  Credit Suisse Chief U.S. Equity Strategist Jonathan Golub said it’s  tough to make broader inferences from early reports given different  sectors tend to post results at different parts of the earnings cycle.  More than a third of S&amp;P 500 that have reported so far sit in the  financials sector, which could skew those results.\n\nThe  FactSet consensus currently calls for net income to fall by 1.9% for  the S&amp;P 500, based on a blend of reported results and analyst  projections, which would mean [the current earnings recession ](https://www.marketwatch.com/story/earnings-recession-is-expected-to-swallow-all-of-2019-after-holiday-forecasts-disappoint-2019-11-22)would swallow all of 2019’s results.\n\nHere’s what to watch for in the week ahead. \n\n[https://www.marketwatch.com/story/the-dow-is-about-to-face-its-stiffest-test-in-years-2020-01-25](https://www.marketwatch.com/story/the-dow-is-about-to-face-its-stiffest-test-in-years-2020-01-25)",
        "subreddit": "StockMarket",
        "title": "The Dow is about to face its stiffest test in years",
        "url": "https://www.reddit.com/r/StockMarket/comments/eujtzm/the_dow_is_about_to_face_its_stiffest_test_in/",
        "created": 1580133776.0
    },
    {
        "author": "fallouthong",
        "created_utc": 1579659369,
        "id": "es59dv",
        "num_comments": 51,
        "num_crossposts": 0,
        "selftext": "https://www.bloomberg.com/news/articles/2020-01-22/apple-is-raising-tsmc-chip-orders-to-meet-strong-iphone-demand\n\n\nApple is raising their chip orders from TSMC to meet strong iphone demand. People who are still holding onto TSM after losing 50% of their value from last week will be rewarded soon. TAIWAN’s market is closed for 7 days (Chinese New Year) so the BS AIDS VIRUS won’t affect TSM over there which means we will moon in MURICA soon. HOLD STRONG MY FRIEND. WE WILL BE SWIMMING IN TENDIS LIKE VISA SOON.",
        "subreddit": "wallstreetbets",
        "title": "To TSM 💎 🖐 holders: WE ARE SAVED AGAIN!!!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/es59dv/to_tsm_holders_we_are_saved_again/",
        "created": 1579688169.0
    },
    {
        "author": "stakis12",
        "created_utc": 1579980983,
        "id": "etvdxk",
        "num_comments": 51,
        "num_crossposts": 0,
        "selftext": "I’ve often wondered how much gains people have made to grow their room past the $69,500 in your TFSA. \n\nI’ve contributed the max every year and have managed to grow with gains to 104,500\n\nI’ve not had any crazy gains but AAPL is to thank for most of that growth. \n\nJust wanted to see where others who are willing to share are at.",
        "subreddit": "CanadianInvestor",
        "title": "How Big Have You Made Your TFSA Room",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/etvdxk/how_big_have_you_made_your_tfsa_room/",
        "created": 1580009783.0
    },
    {
        "author": "Anik71",
        "created_utc": 1578601005,
        "id": "emf8w4",
        "num_comments": 50,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Praise Tim Apple. Started trading in August, was down 4-5k before I finally got smarter about my option trading.",
        "url": "https://i.redd.it/gdnuwf5r9t941.jpg",
        "created": 1578629805.0
    },
    {
        "author": "rgpace5",
        "created_utc": 1577930844,
        "id": "eirlng",
        "num_comments": 49,
        "num_crossposts": 0,
        "selftext": "When people discuss companies that will benefit from the introduction of 5G the same companies seem to come up...Apple, Qualcomm, Nokia, Ericcson, etc.\n\nPeople usually list companies providing the infrastructure for 5G,5G carriers like AT&amp;T or device companies like Apple. If you look at the companies that have benefited the most from increases WIFI and mobile internet speeds over the last decade it has been companies like Netflix, who have used advances in technology to disrupt traditional markets.\n\nThe effects have also been seen in cloud computing with Amazon and Microsoft, and advertising with Google/Amazon (faster networks/easier access = more searches)\n\nOver the next decade there will certainly be companies who leverage 5G to deepen their competitive advantages or new companies that emerge that will disrupt current markets. I would say remote health care might be an example of this,or companies that utilize increased speeds to monetize AI\n\nWhich companies do you all feel fit this description that you're holding for the long term (5 to 10 years and more)",
        "subreddit": "stocks",
        "title": "Companies that will benefit from 5G indirectly",
        "url": "https://www.reddit.com/r/stocks/comments/eirlng/companies_that_will_benefit_from_5g_indirectly/",
        "created": 1577959644.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1578148043,
        "id": "ejx893",
        "num_comments": 49,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/wallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning January 6th, 2020.\n\n# **Geopolitical tensions could hold back stocks in the week ahead, as investors await jobs report  - [(Source)](https://www.cnbc.com/2020/01/03/geopolitical-tensions-could-hold-back-stocks-in-the-week-ahead.html)**\n*****\n&gt; Geopolitical concerns could continue to weigh on stocks in the week ahead, leaving investors wondering whether Middle East tensions will be the catalyst for a much anticipated market pullback.\n*****\n&gt; Stocks sold off Friday, the second trading day of the year, after a rally to new highs on Thursday. The market was slammed after the U.S. killed Iranian military commander Qasem Soleimani, sparking a rally in oil prices and raising concerns Iran will take some retaliatory action.\n*****\n&gt; The big event in the coming week is the December employment report, expected to show 160,000 payrolls were added and average earnings rose 3.1% year-over-year, according to Refinitiv. The jobs report is especially important after December’s ISM manufacturing data Friday was surprisingly negative and the weakest in more than a decade.\n*****\n&gt; The S&amp;P 500 ended the four-day week at 3,235, with a loss of 0.2%, after Friday’s 0.7% decline. Treasury yields retreated on Friday, as buyers moved into the safety of bonds and the 10-year yield was at 1.78%.\n*****\n&gt; “This was a textbook rationale for a bout of profit taking, but that said, I don’t think it’s dramatic,” said Quincy Krosby, chief market strategist at Prudential Financial. “Nonetheless, the question will be when do buyers come in ... Much will depend on this weekend and next week in terms of headlines from both the White House and Iran.”\n*****\n&gt; Some analysts have been looking for a minor selloff in stocks after the fourth quarter’s 8.5% gain in the S&amp;P 500. But whether Friday’s decline is the start of something bigger is unclear.\n*****\n&gt; “It could be, but only in retrospect will you know for sure,” said Peter Boockvar, chief investment officer at Bleakley Advisory Group.\n*****\n&gt; Boockvar said if Iran takes some minor action, the market could shrug it off, oil could lose its gains, and stocks could move higher again.\n*****\n&gt; “We may see Treasurys continue to get a big bid, gold get a bid and the safe-haven currencies get a bid. If we go into things next week and all things are quiet, the market will pay attention to the data,” Krosby said.\n*****\n&gt; Gregory Faranello, head of U.S. rates at AmeriVet Securities, expects to see Treasury yields lower initially. “I think short-term, the geopolitical risk is probably going to override any fundamental views that people have of the marketplace,” he said.\n*****\n&gt; But there could be a catalyst for some Treasury selling with the issuance of high level of corporate bonds in the coming week. Faranello expects the year to start off strong, with corporate treasurers looking to raise about $30 billion to $35 billion in the debt market.\n*****\n&gt; Strategists said they will be looking closely at the jobs data after Friday’s surprisingly weak manufacturing survey from the Institute for Supply Management, which was expected to have been better because of the trade agreement.\n*****\n&gt; Stephen Stanley, chief economist at Amherst Pierpont, said the survey actually took place before the trade deal was announced, and he’s waiting for the results of the next couple of reports.\n*****\n&gt; He expects to see 165,000 jobs added in December, off of 266,000 in November, which was in part skewed by the end of GM’s strike. “I think there’s a little upside risk. It seems like we saw a pretty strong Christmas season,” he said, adding there could have been more hiring than was factored into seasonal adjustments.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/aoDnUW7.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/6x4NtiW.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/I3ZNEuH.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/QqYTbUD.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/U3Ltxt2.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/CyHtJoF.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/RO92K5i.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/SEszd5M.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/Trp0mo0.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/V19lVTd.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/tlPjW9c.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/aicevVU.png))**\n\n*****\n\n# Typical January Trading: Volatile Last 20 Years\n\n&gt; Yesterday major indexes continued their recent trend of strength on the first trading day of 2020. While today the market has turned weaker on escalating tensions between the U.S. and Iran. This type of volatility was once quite rare in January. However since 2000, the S&amp;P 500 has declined ten times in twenty years in January. This recent weakness can be seen in the above January seasonal pattern chart.\n\n&gt; Over the last 21 years, Only NASDAQ has posted a full-month average gain. DJIA, S&amp;P 500 and Russell 1000 have started January positive, only to surrender early-month gains by the eighth trading day. Greatest weakness has appeared just after mid-month, the eleventh trading day. Mild average losses on or around the eleventh trading day quickly swell to over 2% for DJIA and nearly as much for S&amp;P 500 and Russell 1000.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/82a79e9eb21df6d414fd0ec1c7725b4d/e48bbc4e7f5b7041-e9/s500x750/6a964dc4a15e1c9ab0fcc9ccc451f6e642aacff5.jpg))**\n\n*****\n\n# A Banner Year for US Equities\n\n&gt; 2019 was surely a banner year for US equities. With a total return of 31.5%, the S&amp;P 500's gain in 2019 was nearly three times the historical average 12-month return of 11.7%. That's strong! In the chart below we compare the S&amp;P 500's annualized returns over the last one, two, five, ten, and twenty years to its average annualized returns over those same time frames since 1928. While the one-year return sticks out like a sore thumb, we would note that the S&amp;P 500's annualized returns over the last two, three, and ten years are also above average. Almost as notable as the fact that the one year return has been so much stronger than average is that the S&amp;P 500's two-year return is less than two percentage points above its historical average. That just shows how bad 2018 was! Looking further out, the only time frame where returns are below average is over the last twenty years where the 6.1% annualized gain is almost five percentage points below the historical average. Over a full twenty years, that's a difference of tripling your investment versus making eight times your investment!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/01/010220-Annualized-returns.png))**\n\n&gt; The chart below compares how current returns during the above time frames rank on a percentile basis relative to all other periods. The S&amp;P 500's one-year return ranks in the 85th percentile which is pretty extreme. For the two, five, and ten year periods, though, current returns are much more middle of the road. Conversely, as stretched as extreme to the upside that the one-year return is relative to all other periods, the twenty-year return is even more depressed to the downside. At just 4.6, more than 95% of all other 20-year periods have been better than the last 20.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/01/010220-Annualized-returns-Percentile.png))**\n\n&gt; Finally, as mentioned above the last year has certainly been a strong one, and it follows a year where returns had been abnormally poor. The chart below shows the rolling 12-month total return for the S&amp;P 500 going back to 1990. The gain of 31.49% over the last year was the strongest for the S&amp;P 500 in six years coming up just shy of the 32.39% gain in 2013. Last year at this time, though, the S&amp;P 500 was down over 4% on a total return basis in the prior 12 months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/01/010220-Annualized-returns-Percentile-rolling.png))**\n\n*****\n\n# 2019 and 2020 Dogs of the Dow\n\n&gt; The Dogs of the Dow strategy is a simple, hands-off investment approach that says to buy the 10 highest yielding stocks in the Dow 30 at the start of each year. With the calendar turning over from 2019 to 2020, below is a look at how the Dogs strategy performed in 2019. As shown, the 10 Dogs posted a total return of 19.38% in 2019, which was below the 25% return for the Dow and well below the 28% that the 20 non-Dogs returned. The biggest winner in the Dogs in 2019 was JP Morgan (JPM) with a gain of 47.27%, but Pfizer's (PFE) decline of 6.92% really hurt overall performance.\n\n&gt; The 20 non-Dogs were led by Apple (AAPL), Microsoft (MSFT), Visa (V), and United Tech (UTX), while Walgreens Boots (WBA) and 3M (MMM) were the two non-Dogs that fell in 2019. Start a two-week free trial to Bespoke Institutional to access our Trend Analyzer tool and track key trends in individual stocks and major ETFs.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/01/dogs2019use.png))**\n\n&gt; Moving on to 2020, below is a list of this year's Dogs of the Dow. Eight of the ten Dogs from 2019 remain on the list, while 3M (MMM) and Walgreens Boots (WBA) -- the two non-Dogs that fell in 2019 -- have replaced JP Morgan (JPM) and Procter &amp; Gamble (PG) -- the two biggest gainers of the Dogs in 2019. Dow Inc. (DOW) is the highest yielding Dog at 5.12%, followed by Exxon (XOM), IBM, and Verizon (VZ), which all have dividend yields above 4%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/01/2020dogs.png))**\n\n*****\n\n# Full Year 2019, Q4, and December Asset Class Total Returns\n\n&gt; Below are the final total return performance numbers for key ETFs across asset classes in 2019. For each ETF, we also include its performance in Q4 and December.\n\n&gt; The S&amp;P 500 rallied 2.9% in December and 8.99% in Q4 to finish the full year up 31.22%. The Tech-heavy Nasdaq 100 (QQQ) was by far the best performing US index ETF in 2019 with a gain of 38.96%, and it was the third best ETF in the entire matrix. The title of best performing ETF in 2019 goes to the S&amp;P 500 Technology sector ETF (XLK), which rallied 49.86%. Remember, 40% of XLK is made up of just Apple (AAPL) and Microsoft (MSFT), which gained 89% and 58% in 2019, respectively. The Russia stock market ETF (RSX) was the second biggest winner in the matrix with a 2019 total return of 40.79%.\n\n&gt; Everywhere you look across the equity landscape, there were big winners in 2019, but the weakest area of the market was the Energy sector ETF (XLE). Even still, XLE managed to put up double-digit percentage gains on the year at +11.74%.\n\n&gt; In the commodities space, we saw oil gain 32.61% in 2019, which actually bested the gain for the S&amp;P 500. Gold (GLD) and silver (SLV) both put in solid gains in the mid-teens, while the perpetually losing natural gas ETF (UNG) was the only ticker in the matrix that fell across all three time frames (December, Q4, and full year).\n\n&gt; Looking at fixed income, the aggregate bond market ETFs (AGG and BND) posted total returns of 8%+, while the 20+ Year Treasury ETF (TLT) gained 14% on the year. Q4 and December were tough for fixed income, however, as rates moved higher.\n\n&gt; ###### **([CLICK HERE FOR THE CHART LINK #1!](https://media.bespokepremium.com/uploads/2020/01/assetclass1231.png))**\n\n*****\n\n# January Almanac: Average Performance Slips in Presidential Election Years\n\n&gt; January has quite a reputation on Wall Street as an influx of cash from yearend bonuses and annual allocations typically propels stocks higher. January ranks #1 for NASDAQ (since 1971), but fifth on the S&amp;P 500 and sixth for DJIA since 1950. It is the end of the best three-month span and holds a full docket of indicators and seasonalities.\n\n&gt; DJIA and S&amp;P rankings did slip from 2000 to 2016 as both indices suffered losses in ten of those seventeen Januarys with three in a row, 2008, 2009 and 2010 and then again in 2014 to 2016. January 2009 has the dubious honor of being the worst January on record for DJIA (-8.8%) and S&amp;P 500 (-8.6%) since 1901 and 1931 respectively. Last year, January was downright stellar after the worst December since 1931 for DJIA and S&amp;P 500.\n\n&gt; In election years, Januarys have been weaker. DJIA and S&amp;P 500 slip to number #8 while DJIA average performance dips negative. NASDAQ slips to #3, but average performance remains respectable at 1.7%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART LINK #1!](https://66.media.tumblr.com/891a38b2171ab08b547127db29f12536/f4d2c822df56176c-4f/s400x600/8f8fe64b2da5c123c7e073095dd8b656e1066429.jpg))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending January 3rd, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=KqDWuo8kiFU))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 1.5.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=-wTk5RDVRtE))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$CMC** \n&gt; * **$WBA** \n&gt; * **$BBBY** \n&gt; * **$STZ** \n&gt; * **$LEN** \n&gt; * **$CALM** \n&gt; * **$SMPL** \n&gt; * **$RPM** \n&gt; * **$ANGO** \n&gt; * **$AZZ** \n&gt; * **$KBH** \n&gt; * **$UNF** \n&gt; * **$MSM** \n&gt; * **$INFY** \n&gt; * **$SCHN** \n&gt; * **$SNX** \n&gt; * **$AYI** \n&gt; * **$GBX** \n&gt; * **$HELE** \n&gt; * **$SAR** \n&gt; * **$EXFO** \n&gt; * **$NTIC** \n&gt; * **$LNN** \n&gt; * **$WDFC** \n&gt; * **$KRUS** \n&gt; * **$FC** \n&gt; * **$SLP**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/Trp0mo0.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/lNG07hG.png))**\n###### **([CLICK HERE FOR MOST ANTICIPATED EARNINGS RELEASES FOR THE NEXT 5 WEEKS!](https://i.imgur.com/Y1KO0R4.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 1.6.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/DNOQOhD.png))\n\n&gt; # ***Monday 1.6.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n&gt; # ***Tuesday 1.7.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/QorVd8K.png))\n\n&gt; # ***Tuesday 1.7.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/xTrYEcQ.png))\n\n*****\n\n&gt; # ***Wednesday 1.8.2 0Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/TRPytQz.png))\n\n&gt; # ***Wednesday 1.8.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/owUNbSh.png))\n\n*****\n\n&gt; # ***Thursday 1.9.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/RXUjAgC.png))\n\n&gt; # ***Thursday 1.9.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/m5AQPKl.png))\n\n*****\n\n&gt; # ***Friday 1.10.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/v60Cw2n.png))\n\n\n*****\n\n&gt; # ***Friday 1.10.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# lululemon athletica inc. $229.38\n&gt; **lululemon athletica inc. (LULU)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, December 11, 2019. The consensus earnings estimate is $0.93 per share on revenue of $896.50 million and the Earnings Whisper ® number is $0.98 per share. Investor sentiment going into the company's earnings release has 73% expecting an earnings beat The company's guidance was for earnings of $0.90 to $0.92 per share on revenue of $880.00 million to $890.00 million. Consensus estimates are for year-over-year earnings growth of 24.00% with revenue increasing by 19.91%. Short interest has increased by 9.8% since the company's last earnings release while the stock has drifted higher by 16.0% from its open following the earnings release to be 26.0% above its 200 day moving average of $182.08. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, December 6, 2019 there was some notable buying of 927 contracts of the $260.00 call expiring on Friday, December 13, 2019. Option traders are pricing in a 8.3% move on earnings and the stock has averaged a 11.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LULU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Commercial Metals Company $22.18\n&gt; **Commercial Metals Company (CMC)** is confirmed to report earnings at approximately 6:45 AM ET on Monday, January 6, 2020. The consensus earnings estimate is $0.56 per share on revenue of $1.45 billion and the Earnings Whisper ® number is $0.59 per share. Investor sentiment going into the company's earnings release has 74% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 60.00% with revenue increasing by 13.52%. Short interest has decreased by 22.3% since the company's last earnings release while the stock has drifted higher by 17.6% from its open following the earnings release to be 22.0% above its 200 day moving average of $18.18. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 7.4% move on earnings and the stock has averaged a 6.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CMC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Walgreens Boots Alliance Inc $59.08\n&gt; **Walgreens Boots Alliance Inc (WBA)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, January 8, 2020. The consensus earnings estimate is $1.40 per share on revenue of $34.63 billion and the Earnings Whisper ® number is $1.41 per share. Investor sentiment going into the company's earnings release has 64% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 4.11% with revenue increasing by 2.48%. Short interest has decreased by 30.6% since the company's last earnings release while the stock has drifted higher by 5.4% from its open following the earnings release to be 7.3% above its 200 day moving average of $55.08. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 4.8% move on earnings and the stock has averaged a 5.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=WBA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Bed Bath &amp; Beyond, Inc. $16.08\n&gt; **Bed Bath &amp; Beyond, Inc. (BBBY)** is confirmed to report earnings at approximately 4:15 PM ET on Wednesday, January 8, 2020. The consensus earnings estimate is $0.03 per share on revenue of $2.86 billion and the Earnings Whisper ® number is $0.04 per share. Investor sentiment going into the company's earnings release has 62% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 83.33% with revenue decreasing by 5.68%. Short interest has decreased by 7.7% since the company's last earnings release while the stock has drifted higher by 65.3% from its open following the earnings release to be 24.8% above its 200 day moving average of $12.89. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, December 27, 2019 there was some notable buying of 4,141 contracts of the $17.00 put expiring on Friday, February 21, 2020. Option traders are pricing in a 13.3% move on earnings and the stock has averaged a 9.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BBBY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Constellation Brands, Inc. $189.53\n&gt; **Constellation Brands, Inc. (STZ)** is confirmed to report earnings at approximately 7:30 AM ET on Wednesday, January 8, 2020. The consensus earnings estimate is $1.90 per share on revenue of $1.95 billion and the Earnings Whisper ® number is $1.91 per share. Investor sentiment going into the company's earnings release has 51% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 19.83% with revenue decreasing by 9.75%. Short interest has decreased by 7.7% since the company's last earnings release while the stock has drifted lower by 5.7% from its open following the earnings release to be 1.9% below its 200 day moving average of $193.11. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 5.5% move on earnings and the stock has averaged a 6.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=STZ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Lennar Corp. $56.47\n&gt; **Lennar Corp. (LEN)** is confirmed to report earnings at approximately 6:00 AM ET on Wednesday, January 8, 2020. The consensus earnings estimate is $1.90 per share on revenue of $6.70 billion and the Earnings Whisper ® number is $1.95 per share. Investor sentiment going into the company's earnings release has 69% expecting an earnings beat The company's guidance was for earnings of $0.84 to $1.94 per share. Consensus estimates are for earnings to decline year-over-year by 3.06% with revenue increasing by 3.73%. Short interest has increased by 4.9% since the company's last earnings release while the stock has drifted higher by 0.1% from its open following the earnings release to be 5.7% above its 200 day moving average of $53.44. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 5.2% move on earnings and the stock has averaged a 4.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LEN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Cal-Maine Foods $42.45\n&gt; **Cal-Maine Foods (CALM)** is confirmed to report earnings at approximately 6:30 AM ET on Monday, January 6, 2020. Investor sentiment going into the company's earnings release has 50% expecting an earnings beat. Short interest has decreased by 19.1% since the company's last earnings release while the stock has drifted higher by 2.0% from its open following the earnings release to be 2.6% above its 200 day moving average of $41.38. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 6.4% move on earnings and the stock has averaged a 4.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CALM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Simply Good Foods Company $28.17\n&gt; **Simply Good Foods Company (SMPL)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, January 9, 2020. The consensus earnings estimate is $0.21 per share on revenue of $166.52 million and the Earnings Whisper ® number is $0.23 per share. Investor sentiment going into the company's earnings release has 70% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 16.67% with revenue increasing by 37.70%. Short interest has increased by 140.7% since the company's last earnings release while the stock has drifted higher by 16.2% from its open following the earnings release to be 10.0% above its 200 day moving average of $25.62. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 18.1% move on earnings and the stock has averaged a 4.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SMPL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# RPM International Inc. $75.15\n&gt; **RPM International Inc. (RPM)** is confirmed to report earnings at approximately 6:45 AM ET on Wednesday, January 8, 2020. The consensus earnings estimate is $0.73 per share on revenue of $1.40 billion and the Earnings Whisper ® number is $0.72 per share. Investor sentiment going into the company's earnings release has 59% expecting an earnings beat The company's guidance was for earnings of $0.71 to $0.76 per share. Consensus estimates are for year-over-year earnings growth of 40.38% with revenue increasing by 2.75%. Short interest has decreased by 16.2% since the company's last earnings release while the stock has drifted higher by 15.5% from its open following the earnings release to be 13.8% above its 200 day moving average of $66.05. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 4.5% move on earnings and the stock has averaged a 3.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=RPM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# AngioDynamics $16.49\n&gt; **AngioDynamics (ANGO)** is confirmed to report earnings at approximately 6:00 AM ET on Tuesday, January 7, 2020. The consensus earnings estimate is $0.01 per share on revenue of $71.88 million. Investor sentiment going into the company's earnings release has 28% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 95.45% with revenue decreasing by 21.45%. Short interest has decreased by 27.0% since the company's last earnings release while the stock has drifted higher by 3.7% from its open following the earnings release to be 11.1% below its 200 day moving average of $18.55. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 16.2% move on earnings and the stock has averaged a 9.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ANGO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# AZZ Inc. $45.21\n&gt; **AZZ Inc. (AZZ)** is confirmed to report earnings at approximately 6:30 AM ET on Thursday, January 9, 2020. The consensus earnings estimate is $0.84 per share on revenue of $276.30 million. Investor sentiment going into the company's earnings release has 55% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 42.37% with revenue increasing by 15.36%. Short interest has increased by 121.9% since the company's last earnings release while the stock has drifted higher by 7.6% from its open following the earnings release to be 5.1% above its 200 day moving average of $43.00. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 11.7% move on earnings and the stock has averaged a 7.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AZZ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/wallstreetbets.",
        "subreddit": "wallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning January 6th, 2020",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ejx893/wall_street_week_ahead_for_the_trading_week/",
        "created": 1578176843.0
    },
    {
        "author": "Samhema",
        "created_utc": 1579366186,
        "id": "eqiqm9",
        "num_comments": 48,
        "num_crossposts": 0,
        "selftext": "So, Monday I deposited $160 in my Robinhood account. Was making small gains until I decided I wanted to live the GUH life, so I decided to experiment with the retarded stonk app. I deposited $2k (which the limit) from a debit card account with no cash but RH still gives you access to it right away. So, after that I upgrade to RH gold which has a $5k max instant deposit limit so total I have $5,160...put them in apple and spy calls and currently at $7,155. Net profit: $1995 (1,146%)",
        "subreddit": "wallstreetbets",
        "title": "Robinhood mini glitch found? *Note: only applies to autists*",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eqiqm9/robinhood_mini_glitch_found_note_only_applies_to/",
        "created": 1579394986.0
    },
    {
        "author": "Johnnybats330",
        "created_utc": 1579238027,
        "id": "epvvzf",
        "num_comments": 47,
        "num_crossposts": 0,
        "selftext": "Every week the S&amp;P reaches new highs. A lot of stocks are reaching 52 wk highs like MSFT, Apple, CRM, Accenture.\n\nI have shorted and held aome of them, but currently holding back on putting more than 60% of my cash in equity thinking prices well fall.\n\nIs anyone else holding to cash like a dummy while the bulls run?",
        "subreddit": "investing",
        "title": "Is anyone sittin on cash?",
        "url": "https://www.reddit.com/r/investing/comments/epvvzf/is_anyone_sittin_on_cash/",
        "created": 1579266827.0
    },
    {
        "author": "Thechunkylover53",
        "created_utc": 1579640232,
        "id": "es0x0x",
        "num_comments": 47,
        "num_crossposts": 0,
        "selftext": "Im about to buy 5k of options before earnings. Which should I go with? Both are always flirting with ATH. Apple seems to beat earnings better but I would get less contracts for my money. WSB decide for me.",
        "subreddit": "wallstreetbets",
        "title": "5k Yolo Call: Apple or AMD?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/es0x0x/5k_yolo_call_apple_or_amd/",
        "created": 1579669032.0
    },
    {
        "author": "blackicebaby",
        "created_utc": 1578658894,
        "id": "emq8al",
        "num_comments": 47,
        "num_crossposts": 0,
        "selftext": "1 share of AMZN or 6 shares of AAPL?  Which is better to hold for the next 10 years?",
        "subreddit": "stocks",
        "title": "If you had $2K to invest, AMZN or AAPL?",
        "url": "https://www.reddit.com/r/stocks/comments/emq8al/if_you_had_2k_to_invest_amzn_or_aapl/",
        "created": 1578687694.0
    },
    {
        "author": "Zonties",
        "created_utc": 1578096647,
        "id": "ejobq4",
        "num_comments": 46,
        "num_crossposts": 0,
        "selftext": "So, 2019 was a bit of a rocky year. I started off making an immense amount of money, lost all of my gain shorting Qualcomm on news of their apple settlement in April.  Took me months to recover, but I got stupid towards the end of the year shorting apple, thinking it HAD to go down and constantly in denial. Big share counts too. like 5 to 10000 shares short day trading\n\nThere would be enormous sums of trades to show in the whole account- but I did much better, ironically, in my account where I only day traded options.\n\nMy biggest lessons: cut the loss quickly.  Don't wait, don't guess. If I had done this, i would be much more green.\n\nLesson two: don't let a bias overrule you. I did this w apple towards the end of the year. Fortunately I did not get carried away and start buying puts as it was going up too. CNBC pushed it higher , and I ignored this. I could have easily flipped the trade.\n\nLesson three: listen to your instincts.  Don't get flustered or become a deer in headlights. I repeated these errors again on numerous occasions. Do not become fixated on a past price where you may have had a paper profit. Stock doesn't care about prior levels.\n\nAlso, I noticed the increasing effects cnbc can have on stocks. Lower float unusual options plays, and the time I lost on apple they kept talking of a super cycle.  This just caused me to lost 40k on a short in one day. I could have covered much sooner.\nNot a terrible year, but I repeated these mistakes more times than I should have.\n\nResults below:\n\nhttps://ibb.co/mJM6SzQ\n\nhttps://ibb.co/Qjxf026",
        "subreddit": "wallstreetbets",
        "title": "Real day trading results for 2019",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ejobq4/real_day_trading_results_for_2019/",
        "created": 1578125447.0
    },
    {
        "author": "Hadron90",
        "created_utc": 1579796260,
        "id": "esvb2a",
        "num_comments": 45,
        "num_crossposts": 0,
        "selftext": "Bad news day for China? $LK up 4% because why the fuck not. \n\nNo car related news? Lets boost $TSLA a few percent, sounds good. \n\n&amp;#x200B;\n\nBlast right through earnings expectations, secure new contracts with Apple, and have the rumor mill swirling about potential partnership with Intel? Let's drop 3.5% for the week.",
        "subreddit": "wallstreetbets",
        "title": "Is $TSM the inverse of a hype stock?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/esvb2a/is_tsm_the_inverse_of_a_hype_stock/",
        "created": 1579825060.0
    },
    {
        "author": "SporeFan19",
        "created_utc": 1578415480,
        "id": "ele00e",
        "num_comments": 44,
        "num_crossposts": 0,
        "selftext": "The second best time is in two weeks when that shit drops back down to low 30s. Now hear me out retards before you start throwing your prebuilt HP Pavilion Gaming Desktops at me.  \n  \nYes we all know that AMD blows shintel out of the water in literally every way and the new stuff makes literally every Intel laptop look like a Chinese knockoff of the 1986 IBM PC Convertible. But look at the news and see who it really affects. Do you think $BECKY is going to buy a 64 core AMD Thundercock? Fuck no, $BECKY knows your eyes can only see 32 cores at a time. And you can be sure her favorite movie studios won't be either because we know in Frozen 3: Iced Caramel Macchiato, that new scene with Elsa doing coke off of Olaf's ass is going to be rendered with 4 year old workstations. Emperor Mickey Mouse is not going to fork out a fucking penny for that shit for several more years because he wants to max out those gains.  \n  \nNow let's get to the more important thing, laptops. Who are the primary audience for new laptop purchases? It's fucking $BECKY. We all know that you're not trading in your 3 year old AMD Ryzen Lenovo for another 10 years when you run out of Indian sweatshops capable of recovering your 1TB hentai collection because they cant find flex tape strong enough to hold your broken down cum stained piece of shit laptop together. Do you think $BECKY cares that AMD's new processors are 5 quadrillion times better than anything that ever made Bob Swan edge in his sleep? Hell fucking no. $BECKY needs her apps and all her friends hate when Shaun sends a green SMS from his lenovo anyway. She can't live without Pages and Keynote, and knows exactly how to turn on Microsoft remote desktop to get help when she can't find a tab she closed on Safari. And you know the fucking second she gets a dent in the cover or spills 1ml of her Matcha Green Tea on the keyboard of her 2019 MacBook Pro and it makes a little sticky noise, she's taking that bitch in to the Apple Store where they convince her to buy a brand new one in full. She will be in tears as she pulls out your Surge Mastercard and buys that 2020 Macbook Air along with the $420.69 Airpods pro deluxe that comes in a box with that cute emoji sticker.  \n  \nDon't say I didn't fucking warn you. $BECKY is coming, but you won't be.",
        "subreddit": "wallstreetbets",
        "title": "The first best time to buy AMD was 2015...",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ele00e/the_first_best_time_to_buy_amd_was_2015/",
        "created": 1578444280.0
    },
    {
        "author": "AloneForever",
        "created_utc": 1580395620,
        "id": "ew6h7b",
        "num_comments": 43,
        "num_crossposts": 0,
        "selftext": "Been making mad tendies this past month by YOLOing calls on random stonks I never heard of. Wondering if I should try this theta gang gay club for autists but I’m not sure if they pray to Tim Apple or Daddy Musk.\n\nAm I gay?\n\nProof of autism: https://imgur.com/a/tHXRGlb",
        "subreddit": "wallstreetbets",
        "title": "Been thinking about joining theta gang. Am I gay?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ew6h7b/been_thinking_about_joining_theta_gang_am_i_gay/",
        "created": 1580424420.0
    },
    {
        "author": "TheTruestFacts",
        "created_utc": 1578962119,
        "id": "eoda7s",
        "num_comments": 42,
        "num_crossposts": 0,
        "selftext": "its long past christmas and hanukah\n\nim thinking something like an apple tree with tesla cybertrucks and trump",
        "subreddit": "wallstreetbets",
        "title": "mods can we change this banner already",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eoda7s/mods_can_we_change_this_banner_already/",
        "created": 1578990919.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1578147965,
        "id": "ejx7sw",
        "num_comments": 41,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/stocks. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning January 6th, 2020.\n\n# **Geopolitical tensions could hold back stocks in the week ahead, as investors await jobs report  - [(Source)](https://www.cnbc.com/2020/01/03/geopolitical-tensions-could-hold-back-stocks-in-the-week-ahead.html)**\n*****\n&gt; Geopolitical concerns could continue to weigh on stocks in the week ahead, leaving investors wondering whether Middle East tensions will be the catalyst for a much anticipated market pullback.\n*****\n&gt; Stocks sold off Friday, the second trading day of the year, after a rally to new highs on Thursday. The market was slammed after the U.S. killed Iranian military commander Qasem Soleimani, sparking a rally in oil prices and raising concerns Iran will take some retaliatory action.\n*****\n&gt; The big event in the coming week is the December employment report, expected to show 160,000 payrolls were added and average earnings rose 3.1% year-over-year, according to Refinitiv. The jobs report is especially important after December’s ISM manufacturing data Friday was surprisingly negative and the weakest in more than a decade.\n*****\n&gt; The S&amp;P 500 ended the four-day week at 3,235, with a loss of 0.2%, after Friday’s 0.7% decline. Treasury yields retreated on Friday, as buyers moved into the safety of bonds and the 10-year yield was at 1.78%.\n*****\n&gt; “This was a textbook rationale for a bout of profit taking, but that said, I don’t think it’s dramatic,” said Quincy Krosby, chief market strategist at Prudential Financial. “Nonetheless, the question will be when do buyers come in ... Much will depend on this weekend and next week in terms of headlines from both the White House and Iran.”\n*****\n&gt; Some analysts have been looking for a minor selloff in stocks after the fourth quarter’s 8.5% gain in the S&amp;P 500. But whether Friday’s decline is the start of something bigger is unclear.\n*****\n&gt; “It could be, but only in retrospect will you know for sure,” said Peter Boockvar, chief investment officer at Bleakley Advisory Group.\n*****\n&gt; Boockvar said if Iran takes some minor action, the market could shrug it off, oil could lose its gains, and stocks could move higher again.\n*****\n&gt; “We may see Treasurys continue to get a big bid, gold get a bid and the safe-haven currencies get a bid. If we go into things next week and all things are quiet, the market will pay attention to the data,” Krosby said.\n*****\n&gt; Gregory Faranello, head of U.S. rates at AmeriVet Securities, expects to see Treasury yields lower initially. “I think short-term, the geopolitical risk is probably going to override any fundamental views that people have of the marketplace,” he said.\n*****\n&gt; But there could be a catalyst for some Treasury selling with the issuance of high level of corporate bonds in the coming week. Faranello expects the year to start off strong, with corporate treasurers looking to raise about $30 billion to $35 billion in the debt market.\n*****\n&gt; Strategists said they will be looking closely at the jobs data after Friday’s surprisingly weak manufacturing survey from the Institute for Supply Management, which was expected to have been better because of the trade agreement.\n*****\n&gt; Stephen Stanley, chief economist at Amherst Pierpont, said the survey actually took place before the trade deal was announced, and he’s waiting for the results of the next couple of reports.\n*****\n&gt; He expects to see 165,000 jobs added in December, off of 266,000 in November, which was in part skewed by the end of GM’s strike. “I think there’s a little upside risk. It seems like we saw a pretty strong Christmas season,” he said, adding there could have been more hiring than was factored into seasonal adjustments.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/aoDnUW7.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/6x4NtiW.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/I3ZNEuH.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/QqYTbUD.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/U3Ltxt2.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/CyHtJoF.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/RO92K5i.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/SEszd5M.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/Trp0mo0.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/V19lVTd.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/tlPjW9c.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/aicevVU.png))**\n\n*****\n\n# Typical January Trading: Volatile Last 20 Years\n\n&gt; Yesterday major indexes continued their recent trend of strength on the first trading day of 2020. While today the market has turned weaker on escalating tensions between the U.S. and Iran. This type of volatility was once quite rare in January. However since 2000, the S&amp;P 500 has declined ten times in twenty years in January. This recent weakness can be seen in the above January seasonal pattern chart.\n\n&gt; Over the last 21 years, Only NASDAQ has posted a full-month average gain. DJIA, S&amp;P 500 and Russell 1000 have started January positive, only to surrender early-month gains by the eighth trading day. Greatest weakness has appeared just after mid-month, the eleventh trading day. Mild average losses on or around the eleventh trading day quickly swell to over 2% for DJIA and nearly as much for S&amp;P 500 and Russell 1000.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/82a79e9eb21df6d414fd0ec1c7725b4d/e48bbc4e7f5b7041-e9/s500x750/6a964dc4a15e1c9ab0fcc9ccc451f6e642aacff5.jpg))**\n\n*****\n\n# A Banner Year for US Equities\n\n&gt; 2019 was surely a banner year for US equities. With a total return of 31.5%, the S&amp;P 500's gain in 2019 was nearly three times the historical average 12-month return of 11.7%. That's strong! In the chart below we compare the S&amp;P 500's annualized returns over the last one, two, five, ten, and twenty years to its average annualized returns over those same time frames since 1928. While the one-year return sticks out like a sore thumb, we would note that the S&amp;P 500's annualized returns over the last two, three, and ten years are also above average. Almost as notable as the fact that the one year return has been so much stronger than average is that the S&amp;P 500's two-year return is less than two percentage points above its historical average. That just shows how bad 2018 was! Looking further out, the only time frame where returns are below average is over the last twenty years where the 6.1% annualized gain is almost five percentage points below the historical average. Over a full twenty years, that's a difference of tripling your investment versus making eight times your investment!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/01/010220-Annualized-returns.png))**\n\n&gt; The chart below compares how current returns during the above time frames rank on a percentile basis relative to all other periods. The S&amp;P 500's one-year return ranks in the 85th percentile which is pretty extreme. For the two, five, and ten year periods, though, current returns are much more middle of the road. Conversely, as stretched as extreme to the upside that the one-year return is relative to all other periods, the twenty-year return is even more depressed to the downside. At just 4.6, more than 95% of all other 20-year periods have been better than the last 20.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/01/010220-Annualized-returns-Percentile.png))**\n\n&gt; Finally, as mentioned above the last year has certainly been a strong one, and it follows a year where returns had been abnormally poor. The chart below shows the rolling 12-month total return for the S&amp;P 500 going back to 1990. The gain of 31.49% over the last year was the strongest for the S&amp;P 500 in six years coming up just shy of the 32.39% gain in 2013. Last year at this time, though, the S&amp;P 500 was down over 4% on a total return basis in the prior 12 months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/01/010220-Annualized-returns-Percentile-rolling.png))**\n\n*****\n\n# 2019 and 2020 Dogs of the Dow\n\n&gt; The Dogs of the Dow strategy is a simple, hands-off investment approach that says to buy the 10 highest yielding stocks in the Dow 30 at the start of each year. With the calendar turning over from 2019 to 2020, below is a look at how the Dogs strategy performed in 2019. As shown, the 10 Dogs posted a total return of 19.38% in 2019, which was below the 25% return for the Dow and well below the 28% that the 20 non-Dogs returned. The biggest winner in the Dogs in 2019 was JP Morgan (JPM) with a gain of 47.27%, but Pfizer's (PFE) decline of 6.92% really hurt overall performance.\n\n&gt; The 20 non-Dogs were led by Apple (AAPL), Microsoft (MSFT), Visa (V), and United Tech (UTX), while Walgreens Boots (WBA) and 3M (MMM) were the two non-Dogs that fell in 2019. Start a two-week free trial to Bespoke Institutional to access our Trend Analyzer tool and track key trends in individual stocks and major ETFs.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/01/dogs2019use.png))**\n\n&gt; Moving on to 2020, below is a list of this year's Dogs of the Dow. Eight of the ten Dogs from 2019 remain on the list, while 3M (MMM) and Walgreens Boots (WBA) -- the two non-Dogs that fell in 2019 -- have replaced JP Morgan (JPM) and Procter &amp; Gamble (PG) -- the two biggest gainers of the Dogs in 2019. Dow Inc. (DOW) is the highest yielding Dog at 5.12%, followed by Exxon (XOM), IBM, and Verizon (VZ), which all have dividend yields above 4%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/01/2020dogs.png))**\n\n*****\n\n# Full Year 2019, Q4, and December Asset Class Total Returns\n\n&gt; Below are the final total return performance numbers for key ETFs across asset classes in 2019. For each ETF, we also include its performance in Q4 and December.\n\n&gt; The S&amp;P 500 rallied 2.9% in December and 8.99% in Q4 to finish the full year up 31.22%. The Tech-heavy Nasdaq 100 (QQQ) was by far the best performing US index ETF in 2019 with a gain of 38.96%, and it was the third best ETF in the entire matrix. The title of best performing ETF in 2019 goes to the S&amp;P 500 Technology sector ETF (XLK), which rallied 49.86%. Remember, 40% of XLK is made up of just Apple (AAPL) and Microsoft (MSFT), which gained 89% and 58% in 2019, respectively. The Russia stock market ETF (RSX) was the second biggest winner in the matrix with a 2019 total return of 40.79%.\n\n&gt; Everywhere you look across the equity landscape, there were big winners in 2019, but the weakest area of the market was the Energy sector ETF (XLE). Even still, XLE managed to put up double-digit percentage gains on the year at +11.74%.\n\n&gt; In the commodities space, we saw oil gain 32.61% in 2019, which actually bested the gain for the S&amp;P 500. Gold (GLD) and silver (SLV) both put in solid gains in the mid-teens, while the perpetually losing natural gas ETF (UNG) was the only ticker in the matrix that fell across all three time frames (December, Q4, and full year).\n\n&gt; Looking at fixed income, the aggregate bond market ETFs (AGG and BND) posted total returns of 8%+, while the 20+ Year Treasury ETF (TLT) gained 14% on the year. Q4 and December were tough for fixed income, however, as rates moved higher.\n\n&gt; ###### **([CLICK HERE FOR THE CHART LINK #1!](https://media.bespokepremium.com/uploads/2020/01/assetclass1231.png))**\n\n*****\n\n# January Almanac: Average Performance Slips in Presidential Election Years\n\n&gt; January has quite a reputation on Wall Street as an influx of cash from yearend bonuses and annual allocations typically propels stocks higher. January ranks #1 for NASDAQ (since 1971), but fifth on the S&amp;P 500 and sixth for DJIA since 1950. It is the end of the best three-month span and holds a full docket of indicators and seasonalities.\n\n&gt; DJIA and S&amp;P rankings did slip from 2000 to 2016 as both indices suffered losses in ten of those seventeen Januarys with three in a row, 2008, 2009 and 2010 and then again in 2014 to 2016. January 2009 has the dubious honor of being the worst January on record for DJIA (-8.8%) and S&amp;P 500 (-8.6%) since 1901 and 1931 respectively. Last year, January was downright stellar after the worst December since 1931 for DJIA and S&amp;P 500.\n\n&gt; In election years, Januarys have been weaker. DJIA and S&amp;P 500 slip to number #8 while DJIA average performance dips negative. NASDAQ slips to #3, but average performance remains respectable at 1.7%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART LINK #1!](https://66.media.tumblr.com/891a38b2171ab08b547127db29f12536/f4d2c822df56176c-4f/s400x600/8f8fe64b2da5c123c7e073095dd8b656e1066429.jpg))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending January 3rd, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED!)\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 1.5.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED!)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$CMC** \n&gt; * **$WBA** \n&gt; * **$BBBY** \n&gt; * **$STZ** \n&gt; * **$LEN** \n&gt; * **$CALM** \n&gt; * **$SMPL** \n&gt; * **$RPM** \n&gt; * **$ANGO** \n&gt; * **$AZZ** \n&gt; * **$KBH** \n&gt; * **$UNF** \n&gt; * **$MSM** \n&gt; * **$INFY** \n&gt; * **$SCHN** \n&gt; * **$SNX** \n&gt; * **$AYI** \n&gt; * **$GBX** \n&gt; * **$HELE** \n&gt; * **$SAR** \n&gt; * **$EXFO** \n&gt; * **$NTIC** \n&gt; * **$LNN** \n&gt; * **$WDFC** \n&gt; * **$KRUS** \n&gt; * **$FC** \n&gt; * **$SLP**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/Trp0mo0.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/lNG07hG.png))**\n###### **([CLICK HERE FOR MOST ANTICIPATED EARNINGS RELEASES FOR THE NEXT 5 WEEKS!](https://i.imgur.com/Y1KO0R4.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 1.6.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/DNOQOhD.png))\n\n&gt; # ***Monday 1.6.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n&gt; # ***Tuesday 1.7.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/QorVd8K.png))\n\n&gt; # ***Tuesday 1.7.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/xTrYEcQ.png))\n\n*****\n\n&gt; # ***Wednesday 1.8.2 0Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/TRPytQz.png))\n\n&gt; # ***Wednesday 1.8.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/owUNbSh.png))\n\n*****\n\n&gt; # ***Thursday 1.9.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/RXUjAgC.png))\n\n&gt; # ***Thursday 1.9.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/m5AQPKl.png))\n\n*****\n\n&gt; # ***Friday 1.10.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/v60Cw2n.png))\n\n\n*****\n\n&gt; # ***Friday 1.10.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# lululemon athletica inc. $229.38\n&gt; **lululemon athletica inc. (LULU)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, December 11, 2019. The consensus earnings estimate is $0.93 per share on revenue of $896.50 million and the Earnings Whisper ® number is $0.98 per share. Investor sentiment going into the company's earnings release has 73% expecting an earnings beat The company's guidance was for earnings of $0.90 to $0.92 per share on revenue of $880.00 million to $890.00 million. Consensus estimates are for year-over-year earnings growth of 24.00% with revenue increasing by 19.91%. Short interest has increased by 9.8% since the company's last earnings release while the stock has drifted higher by 16.0% from its open following the earnings release to be 26.0% above its 200 day moving average of $182.08. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, December 6, 2019 there was some notable buying of 927 contracts of the $260.00 call expiring on Friday, December 13, 2019. Option traders are pricing in a 8.3% move on earnings and the stock has averaged a 11.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LULU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Commercial Metals Company $22.18\n&gt; **Commercial Metals Company (CMC)** is confirmed to report earnings at approximately 6:45 AM ET on Monday, January 6, 2020. The consensus earnings estimate is $0.56 per share on revenue of $1.45 billion and the Earnings Whisper ® number is $0.59 per share. Investor sentiment going into the company's earnings release has 74% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 60.00% with revenue increasing by 13.52%. Short interest has decreased by 22.3% since the company's last earnings release while the stock has drifted higher by 17.6% from its open following the earnings release to be 22.0% above its 200 day moving average of $18.18. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 7.4% move on earnings and the stock has averaged a 6.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CMC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Walgreens Boots Alliance Inc $59.08\n&gt; **Walgreens Boots Alliance Inc (WBA)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, January 8, 2020. The consensus earnings estimate is $1.40 per share on revenue of $34.63 billion and the Earnings Whisper ® number is $1.41 per share. Investor sentiment going into the company's earnings release has 64% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 4.11% with revenue increasing by 2.48%. Short interest has decreased by 30.6% since the company's last earnings release while the stock has drifted higher by 5.4% from its open following the earnings release to be 7.3% above its 200 day moving average of $55.08. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 4.8% move on earnings and the stock has averaged a 5.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=WBA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Bed Bath &amp; Beyond, Inc. $16.08\n&gt; **Bed Bath &amp; Beyond, Inc. (BBBY)** is confirmed to report earnings at approximately 4:15 PM ET on Wednesday, January 8, 2020. The consensus earnings estimate is $0.03 per share on revenue of $2.86 billion and the Earnings Whisper ® number is $0.04 per share. Investor sentiment going into the company's earnings release has 62% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 83.33% with revenue decreasing by 5.68%. Short interest has decreased by 7.7% since the company's last earnings release while the stock has drifted higher by 65.3% from its open following the earnings release to be 24.8% above its 200 day moving average of $12.89. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, December 27, 2019 there was some notable buying of 4,141 contracts of the $17.00 put expiring on Friday, February 21, 2020. Option traders are pricing in a 13.3% move on earnings and the stock has averaged a 9.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BBBY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Constellation Brands, Inc. $189.53\n&gt; **Constellation Brands, Inc. (STZ)** is confirmed to report earnings at approximately 7:30 AM ET on Wednesday, January 8, 2020. The consensus earnings estimate is $1.90 per share on revenue of $1.95 billion and the Earnings Whisper ® number is $1.91 per share. Investor sentiment going into the company's earnings release has 51% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 19.83% with revenue decreasing by 9.75%. Short interest has decreased by 7.7% since the company's last earnings release while the stock has drifted lower by 5.7% from its open following the earnings release to be 1.9% below its 200 day moving average of $193.11. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 5.5% move on earnings and the stock has averaged a 6.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=STZ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Lennar Corp. $56.47\n&gt; **Lennar Corp. (LEN)** is confirmed to report earnings at approximately 6:00 AM ET on Wednesday, January 8, 2020. The consensus earnings estimate is $1.90 per share on revenue of $6.70 billion and the Earnings Whisper ® number is $1.95 per share. Investor sentiment going into the company's earnings release has 69% expecting an earnings beat The company's guidance was for earnings of $0.84 to $1.94 per share. Consensus estimates are for earnings to decline year-over-year by 3.06% with revenue increasing by 3.73%. Short interest has increased by 4.9% since the company's last earnings release while the stock has drifted higher by 0.1% from its open following the earnings release to be 5.7% above its 200 day moving average of $53.44. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 5.2% move on earnings and the stock has averaged a 4.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LEN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Cal-Maine Foods $42.45\n&gt; **Cal-Maine Foods (CALM)** is confirmed to report earnings at approximately 6:30 AM ET on Monday, January 6, 2020. Investor sentiment going into the company's earnings release has 50% expecting an earnings beat. Short interest has decreased by 19.1% since the company's last earnings release while the stock has drifted higher by 2.0% from its open following the earnings release to be 2.6% above its 200 day moving average of $41.38. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 6.4% move on earnings and the stock has averaged a 4.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CALM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Simply Good Foods Company $28.17\n&gt; **Simply Good Foods Company (SMPL)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, January 9, 2020. The consensus earnings estimate is $0.21 per share on revenue of $166.52 million and the Earnings Whisper ® number is $0.23 per share. Investor sentiment going into the company's earnings release has 70% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 16.67% with revenue increasing by 37.70%. Short interest has increased by 140.7% since the company's last earnings release while the stock has drifted higher by 16.2% from its open following the earnings release to be 10.0% above its 200 day moving average of $25.62. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 18.1% move on earnings and the stock has averaged a 4.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SMPL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# RPM International Inc. $75.15\n&gt; **RPM International Inc. (RPM)** is confirmed to report earnings at approximately 6:45 AM ET on Wednesday, January 8, 2020. The consensus earnings estimate is $0.73 per share on revenue of $1.40 billion and the Earnings Whisper ® number is $0.72 per share. Investor sentiment going into the company's earnings release has 59% expecting an earnings beat The company's guidance was for earnings of $0.71 to $0.76 per share. Consensus estimates are for year-over-year earnings growth of 40.38% with revenue increasing by 2.75%. Short interest has decreased by 16.2% since the company's last earnings release while the stock has drifted higher by 15.5% from its open following the earnings release to be 13.8% above its 200 day moving average of $66.05. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 4.5% move on earnings and the stock has averaged a 3.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=RPM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# AngioDynamics $16.49\n&gt; **AngioDynamics (ANGO)** is confirmed to report earnings at approximately 6:00 AM ET on Tuesday, January 7, 2020. The consensus earnings estimate is $0.01 per share on revenue of $71.88 million. Investor sentiment going into the company's earnings release has 28% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 95.45% with revenue decreasing by 21.45%. Short interest has decreased by 27.0% since the company's last earnings release while the stock has drifted higher by 3.7% from its open following the earnings release to be 11.1% below its 200 day moving average of $18.55. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 16.2% move on earnings and the stock has averaged a 9.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ANGO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# AZZ Inc. $45.21\n&gt; **AZZ Inc. (AZZ)** is confirmed to report earnings at approximately 6:30 AM ET on Thursday, January 9, 2020. The consensus earnings estimate is $0.84 per share on revenue of $276.30 million. Investor sentiment going into the company's earnings release has 55% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 42.37% with revenue increasing by 15.36%. Short interest has increased by 121.9% since the company's last earnings release while the stock has drifted higher by 7.6% from its open following the earnings release to be 5.1% above its 200 day moving average of $43.00. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 11.7% move on earnings and the stock has averaged a 7.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AZZ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/stocks.",
        "subreddit": "stocks",
        "title": "Wall Street Week Ahead for the trading week beginning January 6th, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/ejx7sw/wall_street_week_ahead_for_the_trading_week/",
        "created": 1578176765.0
    },
    {
        "author": "achari01",
        "created_utc": 1579138661,
        "id": "epc4op",
        "num_comments": 41,
        "num_crossposts": 0,
        "selftext": "This is the ride of our generation. You didn’t catch $AAPL $TSLA $BYND (trash) $NFLX $AMZN $FB or $GOOG lemme introduce you to $SPCE . You see, these guys went ipo without a roadshow by buying a company that was already listed. As in, the banksters did not get a chance to fuck everyone over. \n\nCurrently trading at 15ish with a 3B valuation. This stonk easily goes 3x to less than 10B MC at 45ish. Money is free and looking for a home. Hundreds of billions are sloshing around the world looking for growth. Everyone wants to get off this death rock and Branson is selling tickets. \n\nBut like why should this be worth way way more? 50x 2021 sales of 200m gets us to a 10B MC. And these guys are worth it cause they represent the future of how things will be done. People invest in a dream and these guys are dreaming really fucking big. \n\nCompetition is good. Blue origin. SpaceX. All good. Only thing that can not happen is dead space explorers. As long as every shuttle lands in one piece there is nothing that stops this stupid stonk. \n\nI’m super long and strong, and if I don’t see you autists on the moon, I’ll catch you on Mars. \n\nhttps://imgur.com/a/8bKAEQY",
        "subreddit": "wallstreetbets",
        "title": "Yet another $SPCE DD for all ye autists",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/epc4op/yet_another_spce_dd_for_all_ye_autists/",
        "created": 1579167461.0
    },
    {
        "author": "thimblebrook",
        "created_utc": 1578016939,
        "id": "ej8cv9",
        "num_comments": 41,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "smallstreetbets",
        "title": "AMD, AAPL, and SPY. Now if I cam repeat everyday for a year lol.",
        "url": "https://i.redd.it/xjspmmu01h841.jpg",
        "created": 1578045739.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1578038829,
        "id": "ejcglj",
        "num_comments": 41,
        "num_crossposts": 0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme and/or [post your arguments against fundamentals here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing\n  * [Corporate News](https://www.streetinsider.com/Corporate+News)\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n  * [Economic data](https://www.streetinsider.com/Economic+Data)\n  * [FED](https://www.streetinsider.com/Fed) - Federal Reserve news\n\n-----\n\nMost fundamentals are updated every 3 months due to the fact that corporations release earnings reports every quarter, so traders are always speculating at what those earnings will say, and investors may change the size of their holdings based on those reports.  Expect a lot of volatility around earnings, but it usually doesn't matter if you're holding long term, but keep in mind the importance of earnings reports because a trend of declining earnings or a decline in some other fundamental will drive the stock down over the long term as well.\n\nSee the following word cloud and click through for the wiki:\n\n[Market Cap - Shares Outstanding - Volume - Dividend - EPS - P/E Ratio - EPS Q/Q - PEG - Sales Q/Q - Return on Assets (ROA) - Return on Equity (ROE) - BETA - SMA - quarterly earnings](https://www.reddit.com/r/stocks/wiki/fundamentals-themed-post)\n\nIf you have a basic question, for example \"what is EBITDA,\" then google \"investopedia EBITDA\" and click the Investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nUseful links:\n\n* [Investopedia Tuturiol](https://www.investopedia.com/university/all/fundamental-analysis/) on fundamental analysis including [Discounted Cash Flow](https://www.investopedia.com/university/dcf/) analysis; see [definition here](https://www.investopedia.com/terms/d/dcf.asp)\n* [FINVIZ](https://finviz.com/quote.ashx?t=aapl) for fundamental data, charts, and aggregated news\n* [Earnings Whisper](https://www.earningswhispers.com/stocks/aapl) for earnings details\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion &amp; Fundamentals Friday Jan 03, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/ejcglj/rstocks_daily_discussion_fundamentals_friday_jan/",
        "created": 1578067629.0
    },
    {
        "author": "uybdetsoP",
        "created_utc": 1580244290,
        "id": "evbaus",
        "num_comments": 41,
        "num_crossposts": 0,
        "selftext": "Tesla is coming into Q4 earnings off of a massive rally of 71% over the last 8 weeks. [Tesla options volume are at a 5 year high](https://www.wsj.com/articles/tesla-poised-for-dramatic-move-after-earnings-options-show-11580216400), with calls being especially popular. [Tesla's also one of the most shorted companies.](https://markets.businessinsider.com/news/stocks/tesla-stock-most-shorted-us-beats-apple-highest-short-interest-2020-1-1028823046) Both of these factors accelerate increases in prices. When you buy a call from your brokerage, they hedge their delta risk with positions in the underlying, i.e. they buy $TSLA. As the price of the underlying increases, the delta on the contracts increases and they need to buy more shares. There's similar upward pressure when there's short interest, as bears get margin called and have to buy shares to cover their positions. The fact that brokerages are buying up shares to hedge leveraged bull positions decreases the supply of shares in the market too. This is what happened during the famous Volkswagen short squeeze.\n\nIf the company fails to make a profit or misses its margins or people just decide to profit take, it could trigger a MASSIVE sell off, as clearing houses reduce their delta exposure as the underlying falls and the masses of retail investors panic sell.",
        "subreddit": "wallstreetbets",
        "title": "Case for $TSLA puts",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/evbaus/case_for_tsla_puts/",
        "created": 1580273090.0
    },
    {
        "author": "thewestcoastavenger",
        "created_utc": 1580236363,
        "id": "ev9el7",
        "num_comments": 41,
        "num_crossposts": 0,
        "selftext": "Ok, I've been melting my brain on our favorite sub (r/wallstreetbets). Everyone YOLOing on margin calls on TSLA, AMD, etc. \n\nAnyway, if I have the liquid capital to purchase a decent position in a company I think is going to pop during earnings (AAPL and FB), why wouldn't I just purchase 200 shares and avoid IV/contract price? Don't have to worry about strike price and (obviously) long term tendies come. \n\nThoughts? Are people placing call/put options just operating off lower flexible liquidity and playing margin?",
        "subreddit": "investing",
        "title": "Call Options vs ETF Purchase (Advice/Thoughts)",
        "url": "https://www.reddit.com/r/investing/comments/ev9el7/call_options_vs_etf_purchase_advicethoughts/",
        "created": 1580265163.0
    },
    {
        "author": "Sporofic",
        "created_utc": 1580187726,
        "id": "ev0wkj",
        "num_comments": 41,
        "num_crossposts": 0,
        "selftext": "A couple of weeks ago, a few days after I first came across this sub I made my first options trade. I bought a call for TSLA with little over a month for expiration. I yolo'd my entire portfolio ($3000) at that time and sold it for a \n[~ $1700 gain ](https://i.imgur.com/nctO5qx.jpg)\n\n At that time I didn't understand why I made money and people told me I was extremely lucky. So I did the sensible thing and then invested all the money into stocks like MSFT, AAPL, FB etc. I told myself that I'd allocate a small amount, $100-$200 to play options every month. A week later I saw everyone posting their gains after Netflix and Bynd etc and even I wanted cool looking screenshots. So I did the sensible thing and sold all the stocks I held and yolo'd them into earning plays and one biotech (saw a lot of rockets on stock wits) . Now I've [lost all](https://i.imgur.com/fCPGwqY.jpg) \n the money I've made on the TSLA call and will probably lose more if the companies don't 🚀🚀\n\n[Positions ](https://i.imgur.com/hlZl5eT.jpg)",
        "subreddit": "wallstreetbets",
        "title": "My story",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ev0wkj/my_story/",
        "created": 1580216526.0
    },
    {
        "author": "bobbythebich",
        "created_utc": 1577967879,
        "id": "eixm31",
        "num_comments": 40,
        "num_crossposts": 0,
        "selftext": "Like the title says, do NOT go against the smart money sweeps in apple. Wait for all the puts in big sweeps to come in and join them. Betting against them is wasteful currently.\n\n&amp;#x200B;\n\nHere are a few images of where the sweeps are for 292.50 and 295 for the 3rd. Currently pre-market they are at 295.56\n\n[https://ibb.co/hBTRn0z](https://ibb.co/hBTRn0z)\n\n[https://ibb.co/3C3M65X](https://ibb.co/3C3M65X)\n\n&amp;#x200B;\n\nThese ppl were all paying the ask and above the ask. If a hedge, I don't feel like that would be needed.\n\nCalls for $300 - $305 being bought for the next month the last few days.",
        "subreddit": "wallstreetbets",
        "title": "Don't go against the sweeps in Apple",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eixm31/dont_go_against_the_sweeps_in_apple/",
        "created": 1577996679.0
    },
    {
        "author": "AUTOMATED_FUCK_BOT",
        "created_utc": 1579013848,
        "id": "eombcr",
        "num_comments": 40,
        "num_crossposts": 0,
        "selftext": "So I recently started trading about a month ago, small fry shit (stocks under 50 bucks, a total of around 600 dollars invested). After seeing the immense gainz I got from investing in BYND ($95 to \\~$125) I decided to try harder and test my luck. The other day, I take a \"risk\" and invest a thousand dollars in Apple, Alibaba, and GE with a call on Alibaba. My dick was hard, and my pride was edging me the entire night. The promise of tendies was nigh. \n\nI wake up today and find they all came out of the starting gate losing value, and my BABA bullshit has cost me around 50 bucks, wiping most of my gains from the past month of around 70 dollars. If it doesn't recover then I suppose I learned my first lesson on trading options; fucking don't",
        "subreddit": "wallstreetbets",
        "title": "I had my first autist moment today",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eombcr/i_had_my_first_autist_moment_today/",
        "created": 1579042648.0
    },
    {
        "author": "hysterias3",
        "created_utc": 1579367847,
        "id": "eqj6p6",
        "num_comments": 40,
        "num_crossposts": 0,
        "selftext": "What's everyone doing during earnings? Are you selling everything and buying back in after? I have February and March options for $AAPL and $MSFT and a bunch of others that are reporting in the next couple weeks. not sure what to do.",
        "subreddit": "wallstreetbets",
        "title": "Holding March options for January earnings?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eqj6p6/holding_march_options_for_january_earnings/",
        "created": 1579396647.0
    },
    {
        "author": "ScotchBrandyBourbon",
        "created_utc": 1579202195,
        "id": "epo14k",
        "num_comments": 40,
        "num_crossposts": 0,
        "selftext": "Beating the market is hard. Most hedge Funds can't do it. And most Amateur investors get destroyed by the S&amp;P500. \n\nThe last 10 years I've been able to beat the market. I'm not a genius. And no I didn't destroy the market and make crazy returns. But enough to make it worth while. So how did I beat the market?\n\nFirst of all my default is S&amp;P500 Index. Which is the market IMO. Buy it and hold and you are the market. Next I look for stocks are woefully undervalued. These don't come very often in this environment. \n\nThe first couple years my picks were okay. These stock picks only made up about 10-15% of my portfolio. Then in 2012 I saw Apple. Bought a couple shares. Then in 2013 it was undervalued massively. It had a PE of 11 and a PE of 8 if you took out cash. Crazy. So I loaded up on Apple. At one point Apple was 40% of my portfolio.\n\nFrom 2012-2019 I didn't have any sizeable positions in any other individual stock. With Apple basically doubling the return of the S&amp;P500 the last 7 years I easily beat the market. I found this is the best way to beat the market. \n\n1. Buy S&amp;P500\n\n2. Buy individual stocks only if they are grossly undervalued. This is a rare event. Only happens once every 5 years or so.\n\n3. Invest new money into S&amp;P500\n\nOf course there are other ways to beat the market. You could go 100% all individual stocks but that is more risky are requires way more time to monitor dozens of companies. I'd rather just focus on 1 or 2 companies and go in deep.",
        "subreddit": "investing",
        "title": "My simple strategy for trying to beat the Market.",
        "url": "https://www.reddit.com/r/investing/comments/epo14k/my_simple_strategy_for_trying_to_beat_the_market/",
        "created": 1579230995.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1580458033,
        "id": "ewl6wo",
        "num_comments": 40,
        "num_crossposts": 0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme and/or [post your arguments against fundamentals here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing\n  * [Corporate News](https://www.streetinsider.com/Corporate+News)\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n  * [Economic data](https://www.streetinsider.com/Economic+Data)\n  * [FED](https://www.streetinsider.com/Fed) - Federal Reserve news\n\n-----\n\nMost fundamentals are updated every 3 months due to the fact that corporations release earnings reports every quarter, so traders are always speculating at what those earnings will say, and investors may change the size of their holdings based on those reports.  Expect a lot of volatility around earnings, but it usually doesn't matter if you're holding long term, but keep in mind the importance of earnings reports because a trend of declining earnings or a decline in some other fundamental will drive the stock down over the long term as well.\n\nSee the following word cloud and click through for the wiki:\n\n[Market Cap - Shares Outstanding - Volume - Dividend - EPS - P/E Ratio - EPS Q/Q - PEG - Sales Q/Q - Return on Assets (ROA) - Return on Equity (ROE) - BETA - SMA - quarterly earnings](https://www.reddit.com/r/stocks/wiki/fundamentals-themed-post)\n\nIf you have a basic question, for example \"what is EBITDA,\" then google \"investopedia EBITDA\" and click the Investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nUseful links:\n\n* [Investopedia Tuturiol](https://www.investopedia.com/university/all/fundamental-analysis/) on fundamental analysis including [Discounted Cash Flow](https://www.investopedia.com/university/dcf/) analysis; see [definition here](https://www.investopedia.com/terms/d/dcf.asp)\n* [FINVIZ](https://finviz.com/quote.ashx?t=aapl) for fundamental data, charts, and aggregated news\n* [Earnings Whisper](https://www.earningswhispers.com/stocks/aapl) for earnings details\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion &amp; Fundamentals Friday Jan 31, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/ewl6wo/rstocks_daily_discussion_fundamentals_friday_jan/",
        "created": 1580486833.0
    },
    {
        "author": "matteopalama",
        "created_utc": 1579012239,
        "id": "eolzkf",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "I know this is a noob question\n\nLet's say I bought 10 AAPL at 200$ and 10 AAPL at 250$\n\nNow that AAPL hovers around 300$ i want to sell those bought at 250$ to capitalize the 50$ gain. Does it makes sense to sell those bought at 250$? or every stocks I own has the same value anyway so it doesn't matter which one I sell?\n\n&amp;#x200B;\n\nthanks!",
        "subreddit": "investing",
        "title": "If I have same stock bought at different price, does it make difference which one I'm selling?",
        "url": "https://www.reddit.com/r/investing/comments/eolzkf/if_i_have_same_stock_bought_at_different_price/",
        "created": 1579041039.0
    },
    {
        "author": "Memwar",
        "created_utc": 1580474822,
        "id": "ewnz7j",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "Fucking Nike and Apple among another 50 companies on the SnP use child workers in china who for 20 hours straight for 40 cent for hour with no bathroom breaks and wallstreet looks the other way. Not a fucking peep from them ,but when a couple of old dudes start dying by some small virus all of a sudden they become historians and experts on Chinese culture and history which then spills over and makes boomers and cucks start dropping their shares harder than a depressed japanese in a forrest. Like the fuck? Why? Let me gamble my allowance and make my tendies in peace!",
        "subreddit": "wallstreetbets",
        "title": "Since when did wall street care about chinese citizens?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ewnz7j/since_when_did_wall_street_care_about_chinese/",
        "created": 1580503622.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1578104590,
        "id": "ejq37t",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "\nIt might be a crowded trade, but the stock is still cheap, relative to the online retailer’s free cash flow.\n\n“Buy Amazon” isn’t the world’s biggest stock-picking cliché, but it’s close. There are 49 analysts who cover the shares, and 47 of them are positive, with two neutral, according to FactSet. Only Alibaba Group Holding of China and ICICI Bank of India boast more endorsements.\n\nAnd after a record-setting run-up, Amazon’s stock isn’t obviously inviting. A $1,000 stake at the close of the stock’s first day of trading in 1997 has turned into more than $950,000. The shares today, at $1,875, go for 69 times projected 2020 earnings.\n\nStill, buy Amazon.com (ticker: AMZN). The stock price looks sensible when compared with free cash flow, which is swelling quickly. Some growth initiatives are only now paying off. Don’t expect a 35% gain this year, as Amazon has averaged, compounded, since going public. But don’t rule it out, either.\n\nAmazon’s reputation for operating near break-even has long been outdated. Founder Jeff Bezos has emphasized free cash flow over accounting earnings from the start, and Amazon has generated free cash since 2002. The company has tended to invest much of that cash for growth, and the result is that earnings have been positive only since 2014, and only meaningfully so since 2018. Now the numbers are reaching escape velocity.\n\nWhen 2019’s results are released, Wall Street expects Amazon to report that revenue increased by 20%, to $279.1 billion; that earnings rose slightly, to $10.4 billion; and that free cash flow ballooned by 28%, to $24.9 billion. In 2020, free cash flow is expected to expand even faster, by 36%, to $34 billion.\n\nWithin five years, the consensus view is that Amazon will become the biggest free cash generator in America, passing some companies that aren’t exactly standing still, like Apple (AAPL) and Microsoft (MSFT). The simplest reason is that Amazon’s investment spending can’t keep up with its growth rate forever.\n\nAmazon launched Prime in 2005, with its free two-day shipping for members, and vast opportunities for the company to put capital to work building speedier infrastructure. Not long after, Amazon Web Services went into cloud computing, another path for investment. Both ventures have proved to be lucrative, with Prime spurring increased spending by shoppers, and AWS yielding generous profit margins.\n\nLast year, Amazon said that it would spend to shorten free Prime shipping to a single day. There are early signs of that paying off, too. Cowen analyst John Blackledge estimates that Prime membership grew 13% during the fourth quarter, versus a year earlier. That compares with 3% growth a year ago and would be the third straight quarter of acceleration.\n\nNow, consider another of Amazon’s growth initiatives: advertising. A recent search for “men’s tennis rackets” on Amazon.com yielded editorial recommendations and a racket listing labeled “Amazon’s Choice.” But nothing was more prominently displayed than the three sponsored racket listings near the top—except for the paid ad for portable nets just above them.\n\nAdvertising doesn’t require vast investments in fleets and data farms, and it looks like another boon for Amazon’s growth. Ad revenue will rise 36%, to $17.6 billion, in 2020, and by 2025 will top $46 billion, predicts Cowen’s Blackledge. Assuming a 35% operating margin for the business, he estimates that advertising and AWS will together account for 90% of operating income this year.\n\nThat has important implications for shareholders. First, it bodes well for the competitiveness of a store when it doesn’t have to rely on its retail margins for the bulk of profits. Second, the advertising ramp provides another rich source of funds to invest in growth. Third, with Amazon passing the anniversary of its spending boost for Prime one-day, it is unclear that it will need that extra spending. As things stand, growth in capital expenditures is expected to decelerate from over 25% last year, to 16% this year, to under 10% in 2021.\n\nAmong 10 analysts who have estimated Amazon’s free cash flow out to 2021, the lowest says $32.7 billion, the highest says $57.5 billion, and the average is $43.7 billion. Out to 2024, there are only three estimates, averaging $82.8 billion. Apple, in comparison, is expected to produce close to $63 billion in free cash during its current fiscal year through September.\n\nIf distant estimates for Amazon are feasible, or even if they are only moderately overblown, the stock could continue outperforming. At less than 30 times estimated 2020 free cash flow, it is cheaper than the shares of Visa (V), Nike (NKE), or McDonald’s (MCD). From here, 20% annual gains for the next three years could leave the stock priced at a humbler 25 times free cash flow.\n\nA government crackdown against powerful tech titans is a risk, but Amazon may have a better “who me?” defense than some of the others. Its market share in the public cloud is less than half, and falling, as Microsoft and others catch up. In e-commerce, more than half of its sales are from third-party merchants who pay to use its services. And in online advertising, it’s a pipsqueak next to Alphabet (GOOGL) and Facebook (FB).\n\nAll told, Amazon is popular with stockpickers for good reason. It’s not too late to join the crowd.\n\nSource: Barron's",
        "subreddit": "stocks",
        "title": "Amazon Is a Free-Cash Rocket Ship. Time to Get on Board.",
        "url": "https://www.reddit.com/r/stocks/comments/ejq37t/amazon_is_a_freecash_rocket_ship_time_to_get_on/",
        "created": 1578133390.0
    },
    {
        "author": "GreenWorkCanada",
        "created_utc": 1579624740,
        "id": "erx59k",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "weedstocks",
        "title": "\"2020 may be the year cannabis stocks surge like Apple\" some good hope",
        "url": "https://hypelist.ca/2020-may-be-the-year-cannabis-stocks-skyrocket-like-apple/",
        "created": 1579653540.0
    },
    {
        "author": "KirizzaKirizzu",
        "created_utc": 1579024686,
        "id": "eoor2t",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "Went to Applebee’s last night and got their unlimited tendies which were cold and my waitress wouldn’t give me her number even though I told her about my career as a stockbroker.\n\nThe company is obviously shit so get in now while you still can",
        "subreddit": "wallstreetbets",
        "title": "Short $AAPL NOW",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eoor2t/short_aapl_now/",
        "created": 1579053486.0
    },
    {
        "author": "SomeGuyNamedJay",
        "created_utc": 1579095167,
        "id": "ep2du4",
        "num_comments": 35,
        "num_crossposts": 0,
        "selftext": "I don't get why so many folks talk about 5G handsets being the next big thing for Apple. Who is complaining that their phone too slow to download shows/music/web/etc? Isn't the biggest complaint about battery life? Wouldn't 5G decrease battery life? \n\nI must be missing something.. Can someone tell me what?",
        "subreddit": "stocks",
        "title": "Apple 5G Doubts",
        "url": "https://www.reddit.com/r/stocks/comments/ep2du4/apple_5g_doubts/",
        "created": 1579123967.0
    },
    {
        "author": "ninostsop",
        "created_utc": 1580368538,
        "id": "ew1l59",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "Which one do you think is better to buy right now and why?",
        "subreddit": "stocks",
        "title": "Apple, Visa or Mastercard?",
        "url": "https://www.reddit.com/r/stocks/comments/ew1l59/apple_visa_or_mastercard/",
        "created": 1580397338.0
    },
    {
        "author": "Pineapple_Pizzazz",
        "created_utc": 1579558795,
        "id": "erkr3c",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "A person I trust very much (I’m not gonna say who it was for confidenciality) told me this “meme” was very popular right now \n\n&gt;any female born after 1993 can’t cook… all they know is mcdonald’s , charge they phone, twerk, be bisexual , eat hot chip &amp; lie\n\nI googled it and everyone agrees its true. I don’t know any girls that can cook. I’m wondering how to profit off this. I get that I can buy McDonalds stocks, I can buy phone charger stocks (Apple? Android? I dont know phone companies that well) and I guess I can short kitchen and food companies. This is obviously a long term strategy, since the 1993 females are only. Small part of the market. \n\nMy question is, what hot chips do females like? Also , is there any way to profit from lies or twerk or bisexualism?",
        "subreddit": "wallstreetbets",
        "title": "How to profit off this advice?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/erkr3c/how_to_profit_off_this_advice/",
        "created": 1579587595.0
    },
    {
        "author": "thedudman69",
        "created_utc": 1579276400,
        "id": "eq2523",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "It was literally free money they said. I believed it. Stonks only go up right? RIGHT? Well, thats what I thought one day when I bought an AMZN call thinking \"easy, I sell for $50 profit and run. I'll do that over and over and all will be well.\" Well within 3 minutes, my 1900C on AMZN went from $23.15 down to $11.57. An $1,100 loss...IN 30 MINUTES. I punched things, I screamed.\n\nFast forward through to today, I adopted the theta gang strategy after that brutal loss and sold bull put spreads on AAPL and SPY and collected that sweet, sweet premium. Iran almost did me in but thank the heavens above Mr. Trump did not declare WWIII when I was holding put spreads over night during that fiasco. After today, I will only be down $15 all-time and I'm retiring from options.",
        "subreddit": "wallstreetbets",
        "title": "It was almost fun, but I'm done",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eq2523/it_was_almost_fun_but_im_done/",
        "created": 1579305200.0
    },
    {
        "author": "blunt__nation",
        "created_utc": 1578628473,
        "id": "emlg1o",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": "Love TSLA\n\nFuckers in the news telling me, always in their articles\n\n\"TSLA ain't 'bout this, TSLA ain't 'bout that\n\nMy boy a professional analyst at Morgan Stanley\n\nHe, he, they say that ninja Elon don't be putting in no work\"\n\nSHUT THE FUCK UP!\n\nY'all ninjas ain't know SHIT!\n\nAll ya motherfuckers talk about....\n\n\"TSLA ain't no AMZN, TSLA ain't no AAPL, Tesla a fake\"\n\nSHUT THE FUCK UP!\n\nY'all know I'm real with that ninja\n\nY'all know that ninja Elon fucks HELLA BAD BITCHES\n\nY'all know that ninja Elon don't respect no SEC\n\nY'all know this ninja be talking mad shit about SEC since day one!\n\nY'all know that ninja secured them fundings but decided not to take TSLA private!\n\nMotherfuckers stop playing him like that! \n\nIf I catch another motherfucker talking sweet about TSLA \n\nI'M BEATING THEY ASS\n\nI'M NOT FUCKING PLAYIN' NO MORE\n\nLove TSLA",
        "subreddit": "wallstreetbets",
        "title": "Love TSLA",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/emlg1o/love_tsla/",
        "created": 1578657273.0
    },
    {
        "author": "TripleBrain",
        "created_utc": 1579290670,
        "id": "eq5f1g",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": "Back at it again with another recommendation. Hopefully you guys are swimming in tendies for SBUX!\n\nTo address the concerns: Apple going up 34% on the 3 month chart and 13% on the monthly is not a huge concern for me mainly because of these gains are supported by the integration and expansion of  Apple's service revenue and wearables (airpods/watches) revenue as part of it's core investment strategy. I think it's a healthy move to diversify and branch out from the flagship iPhone revenue which generates some 60% of it's revenue. Apple looks to be staging a great foundation for the development of the service platform which aims to help provide an insurance for customers at a relatively reasonable price ( which I assume will become even more affordable and therefore, profitable as they scale this area). Numbers in last fiscal quarter also suggest a growing revenue share in this area. As per the wearables technology, the watches are becoming increasingly adapted to the active lifestyle market, which is an attractive combination of both technology and sports. I don't see a big competitor in this space as Apple has already established such a strong foundation in this product and the dominance of it's competitors are disproportionately favorable for Apple.\n\nOn second thought, the airpods are also a great technology that they can expand on. Recently there is some buzz on earphones as a health product, by integrating technology that can monitor heart rate and blood pressure through the ear canal via the airpods. This makes a great deal of sense as the skin is much thinner in the ear passageway compared to the wrist that the watch monitors off of. Would be really cool to see if they can work with something like this, and perhaps even integrate a voice recognition system and a translating software (like Google) to make the airpods more than just convenient, but highly accessible. \n\nI'd assume that ER will do commensurately better than the previous year, and we should be seeing some great numbers to support this growth. ALSO! integration of AMD technology into their new macbooks are going to be big for gamers and tech enthusiasts who have largely been accustomed to the Intel processors for ages. AMD is also a grow and developing company and their potential in unison with Apple can be a game changer for the software/high performance gaming market that Apple can also enter into. So, cheers to that my friends! Goodluck!",
        "subreddit": "wallstreetbets",
        "title": "AAPL $330 C 3/20 and $340 C 6/19 are good buys!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eq5f1g/aapl_330_c_320_and_340_c_619_are_good_buys/",
        "created": 1579319470.0
    },
    {
        "author": "The-Bannable",
        "created_utc": 1579582239,
        "id": "erpp0i",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": "Ok, so--first thing in the morning when the market opens, I'll usually yolo all my cash into some put credit spreads on SPY or AAPL or some shit expiring at the end of the week.\n\nThen, you ask: what do I do now while I wait for tendies?\n\nI usually look at the screen, those options that I sold some poor fucker quickly depreciating to zero. I like that feeling, that feeling that I just scammed someone of their hard-earned cash. I particularly like to imagine that this person saved up a lot of money and finally entered the stock market to just lose it all to Papa Theta. This usually makes me kinda hard, actually. Especially when I think of all those poor peasants I'm sending to rot on the streets because of my epic options plays. Just the thought of them shivering in the cold, slowly dying, their cash in my pocket--it's enough to get me to blow my load twice (sometimes even thrice) in a day.\n\nAnd this, my friends, is how I have amazing hands--I almost always let my options expire worthless as I'm too busy jacking off to poor people. Usually the joy and pleasure that I get from this practice is worth more than any money amount that I might have lost.",
        "subreddit": "wallstreetbets",
        "title": "My weekly trading strategy",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/erpp0i/my_weekly_trading_strategy/",
        "created": 1579611039.0
    },
    {
        "author": "Drew1904",
        "created_utc": 1579045141,
        "id": "eotpjo",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "Starting with the sentiment on this thread. If we have a -100 point day in the S&amp;P the suicide hotline will be filled with “stonks only go up”. \n\nBut honestly, sell pressure was more than normal, price action the past 5 days has been volatile in both directions. Thing just feel like they’re starting to misfire. \n\nPair that with today’s bearish pivot by the financial media on the trade deal in headline form i’m worried we may see an algo sell the news event or the beginning of a blow off top in names like AAPL, TSLA, etc before earnings. and if the big names go the broader market goes. \n\nAnyone else feel like we’re being bamboozled? Rug pull inc?",
        "subreddit": "wallstreetbets",
        "title": "Anyone else feel like things are a little toppy the past week?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eotpjo/anyone_else_feel_like_things_are_a_little_toppy/",
        "created": 1579073941.0
    },
    {
        "author": "An_Dr01d",
        "created_utc": 1579138535,
        "id": "epc3th",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": " ***Apple Is the Most Valuable Company in the World (Not just by Market Cap).***\n\n*The   reason why Apple is objectively, within the constraints of the   corpora-paradigm we operate in, the most valuable company in the world   is simple:*\n\nThe social media tech giants, who began and *enabled* the ***hyperacquisition of society itself (the enablers)***;   the reason why the brightest minds in the world understand Apple is so   valuable, is because they are the only modern tech giant that can  resist  the inevitable collapse of social media (and the markets they’ve   co-opted) once regulations are imposed. That is because Apple’s  product  is not the people, unlike the vast majority of the  corporate-tech empire  that dominates the financial markets, to their  great misfortune. They  thought people could be convinced to ***underestimate their own value.***\n\nTake  Silicon Valley, home of the richest, brightest minds of the American  experience. ALL OF THEM who have new families, take the time to ensure  that their kids get as little screen time as possible, and understand  the value of humanity, and human worth.\n\nThankfully,  political narratives are in play that may have paradigm shifts in the  way markets, (as well as economies, and the philosophic underpinning  they rely on) operate in the future\n\nApple’s   value, is that it has the power to not only resist the regulatory   collapse of social media, but it has the largest financial cash reserves   to re-invest back into society (for who’s good?), or whatever it wants   to emerge from the ashes of the financial reawakening.\n\nIt’s   the same reason why the Omaha Guru, the Wizard of Finance is so  heavily  invested in Apple, and why he also (coincidentally, I’m sure)  operated  under the same financial philosophy of prioritizing great free  cash flow  reserves.\n\nApple’s  value can’t be  measured purely by the market. It’s measured by how  resilient they’re  going to be in the upcoming regulation of social  media and the markets  they’ve taken over.\n\nOutcomes  that  are out of all of their hands, and in the hands of the people.  People  who are becoming increasingly aware of the dangers of social  media, and  aware of the dangers of Corporatism in politics, and the  link between  both issues.\n\nThe link is there, and people are aware, and that’s that makes Apple so valuable.\n\nSo  Apple is the company to invest in, if you see a future where social  media becomes more scrutinized and regulated (it already is).\n\nRegulation  is not enough however, and people know that the mere existence of an  instrument that can be so easily exploited for tyranny should be viewed  with extreme skepticism. Particularly if it seems to mobilize dissent  against that skepticism.\n\nIf and when the next recession hits, one thing's for sure: Apple has the has statistical odds of coming out on top.",
        "subreddit": "wallstreetbets",
        "title": "My Thesis For Why Apple is the Most Valuable Company on the Market, and in the World",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/epc3th/my_thesis_for_why_apple_is_the_most_valuable/",
        "created": 1579167335.0
    },
    {
        "author": "Talonman90",
        "created_utc": 1578930744,
        "id": "eo5vl7",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "I’ve finally earned enough on my market investment to buy a few shares, but when you think about it, what else could they do that they haven’t yet? I feel like it’ll plateau at some point, right?",
        "subreddit": "stocks",
        "title": "What’s your take on AAPL?",
        "url": "https://www.reddit.com/r/stocks/comments/eo5vl7/whats_your_take_on_aapl/",
        "created": 1578959544.0
    },
    {
        "author": "HurricaneDorian321",
        "created_utc": 1580255820,
        "id": "eve8cq",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Apple rises as earnings and iPhone sales smash expectations",
        "url": "https://www.cnbc.com/2020/01/28/apple-aapl-earnings-q1-2020.html",
        "created": 1580284620.0
    },
    {
        "author": "onetrickponiy",
        "created_utc": 1579279557,
        "id": "eq2vf1",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "Before finding this sub I believed in the antiquated boomer ideas of risk management and cutting losses, but now I’ve been enlightened. Need some inspiration to hold these AAPL 2/21 350c over this three day weekend. So what’s your best story of having rock hard, veiny, iron hands and it paying off?",
        "subreddit": "wallstreetbets",
        "title": "What’s your best iron hands story?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eq2vf1/whats_your_best_iron_hands_story/",
        "created": 1579308357.0
    },
    {
        "author": "forevalearning",
        "created_utc": 1578799072,
        "id": "eni2ze",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "calls $65 short term or long term? \n\nAny Predictions after Jan 16th, 316B +-2 revenue actuals for 4th quarter.",
        "subreddit": "wallstreetbets",
        "title": "With AMD, Nvida GPU, Qualcomm 865 &amp; Apple A14 productions lined up: TSMC looks stronger than ever.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eni2ze/with_amd_nvida_gpu_qualcomm_865_apple_a14/",
        "created": 1578827872.0
    },
    {
        "author": "PrestigeWWinc",
        "created_utc": 1579011150,
        "id": "eolrr6",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "  \n\n\nhttps://preview.redd.it/bfyza4865ra41.png?width=721&amp;format=png&amp;auto=webp&amp;s=25dd95dfb9166a990a3450215e44a855ad0793d7\n\nAll aboard the apple train!  \n\n\nhttps://imgur.com/e8QioZT",
        "subreddit": "wallstreetbets",
        "title": "It's been a helluva week - All in on AAPL all the time!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eolrr6/its_been_a_helluva_week_all_in_on_aapl_all_the/",
        "created": 1579039950.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1580261770,
        "id": "evfm31",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2020/01/28/apple-wearables-home-and-accessories-segment-now-bigger-than-mac.html\n\n“Wearables, Home and Accessories” revenue is larger than Mac revenue for the first time, Apple revealed in a blowout earnings report on Tuesday. \n\nApple’s catch-all category, which includes AirPods and Apple Watch, surged to $10 billion in revenue in the quarter that ended in December, more than the $7.1 billion in Mac computers that Apple sold. \n\nThe milestone signals where Apple’s business has room to grow, and underscores how Apple’s future is based around wearable computers all over the body, instead of computers that live on a desk.",
        "subreddit": "StockMarket",
        "title": "Apple’s fastest-growing business segment, which includes AirPods and Watch, is now bigger than Mac",
        "url": "https://www.reddit.com/r/StockMarket/comments/evfm31/apples_fastestgrowing_business_segment_which/",
        "created": 1580290570.0
    },
    {
        "author": "PrinceLP",
        "created_utc": 1580140394,
        "id": "eupos5",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": " Listen Here: [https://anchor.fm/cannabis-investing-network/episodes/26---A-Serious-Warning-for-Cannabis-Investors-in-2020-eaetar](https://anchor.fm/cannabis-investing-network/episodes/26---A-Serious-Warning-for-Cannabis-Investors-in-2020-eaetar)\n\n\\*\\*Or listen on Apple Podcast, Spotify, etc.\n\nIn this episode we lay out a serious warning to our network about the potential for an impending capital &amp; liquidity crisis for the cannabis sector in 2020. \n\nCompanies are rapidly burning cash and financing is very tough to secure. Many companies (especially smaller ones) are running out of runway faster than you might think. Why is no one talking about it?\n\n\\- What is going on?\n\n\\- Fundamentals vs Capital Markets\n\n\\- How bad is it? (hint: pretty damn bad)\n\n\\- Predicting what happens next\n\n\\- How to protect yourself as an investor\n\n\\- Survivors will be long term winners\n\n\\- Medium-Long term very bullish on the cannabis space but have to pick your spots accordingly\n\n\\- What to look for in all of your holdings to evaluate your own risk\n\n\\- Are we wrong? Thoughts on things we may have missed\n\n\\*\\*Do you agree or disagree? We'd love to hear your thoughts - CINpodcast@gmail.com",
        "subreddit": "weedstocks",
        "title": "A Serious Warning for Cannabis Investors in 2020 - CIN Podcast Deepdive",
        "url": "https://www.reddit.com/r/weedstocks/comments/eupos5/a_serious_warning_for_cannabis_investors_in_2020/",
        "created": 1580169194.0
    },
    {
        "author": "oranguthang87",
        "created_utc": 1579183031,
        "id": "epjndy",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": " \n\n* Citigroup boosted the price target for **BlackRock, Inc.** (NYSE: BLK) from $580 to $600. BlackRock closed at $530.26 on Wednesday.\n* JP Morgan lowered the price target on **Owens Corning** (NYSE: OC) from $69 to $58. Owens Corning closed at $65.29 on Wednesday.\n* Goldman Sachs cut **CVR Partners LP** (NYSE: UAN) price target from $5 to $3. CVR Partners shares closed at $3.00 on Wednesday.\n* Citigroup raised the price target on **Lululemon Athletica Inc** (NASDAQ: LULU) from $230 to $245. Lululemon closed at $243.49 on Wednesday.\n* Morgan Stanley boosted the price target for **Tesla Inc** (NASDAQ: TSLA) from $250 to $360. Tesla shares closed at $518.50 on Wednesday.\n* KeyBanc raised **Luckin Coffee Inc - ADR** (NASDAQ: LK) price target from $32 to $56. Luckin Coffee shares closed at $45.13 on Wednesday.\n* Goldman Sachs lowered the price target for **Michaels Companies Inc** (NASDAQ: MIK) from $7 to $6.5. Michaels shares closed at $7.00 on Wednesday.\n* Mizuho lowered the price target for **Xilinx, Inc.** (NASDAQ: XLNX) from $115 to $106. Xilinx shares closed at $98.83 on Wednesday.\n* Raymond James lifted **Purple Innovation Inc** (NASDAQ: PRPL) price target from $11 to $13. Purple Innovation closed at $11.27 on Wednesday.\n* Wells Fargo raised the price target for **Adobe Inc** (NASDAQ: ADBE) from $315 to $345. Adobe shares closed at $342.94 on Wednesday.",
        "subreddit": "wallstreetbets",
        "title": "10 Biggest Price Target Changes For Thursday",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/epjndy/10_biggest_price_target_changes_for_thursday/",
        "created": 1579211831.0
    },
    {
        "author": "Wild_Cat_Cory",
        "created_utc": 1578695049,
        "id": "emya47",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I’ve only been dabbling in invest for the past 12mths, and obviously with all the recession talk, China trade deal etc, I think everyone is a little nervous.\n\nBut ultimately I believe the world is becoming more of a cashless society, and it’s so easy with mobile payments etc, I believe it’s inevitable that this whole sector will sky rocket.\n\nI currently have positions in V , PYPL , SQ and taking more of a gamble on PAYS.\n\nI’m looking for thoughts on  taking my positions in the above stocks noted, and investing in the IPAY ETF which would give me coverage on those stocks plus others like M, AXP, GPN, FIS, FISV, DFS and a few more?,\nOr Keep my individual stocks and add to my portfolio like M , GPN etc when or if they ever have a dip?\n\nAnd help would be greatly appreciated, cheers",
        "subreddit": "stocks",
        "title": "IPAY ETF or Individual Stocks?",
        "url": "https://www.reddit.com/r/stocks/comments/emya47/ipay_etf_or_individual_stocks/",
        "created": 1578723849.0
    },
    {
        "author": "Wild_Cat_Cory",
        "created_utc": 1578695049,
        "id": "emya47",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I’ve only been dabbling in invest for the past 12mths, and obviously with all the recession talk, China trade deal etc, I think everyone is a little nervous.\n\nBut ultimately I believe the world is becoming more of a cashless society, and it’s so easy with mobile payments etc, I believe it’s inevitable that this whole sector will sky rocket.\n\nI currently have positions in V , PYPL , SQ and taking more of a gamble on PAYS.\n\nI’m looking for thoughts on  taking my positions in the above stocks noted, and investing in the IPAY ETF which would give me coverage on those stocks plus others like M, AXP, GPN, FIS, FISV, DFS and a few more?,\nOr Keep my individual stocks and add to my portfolio like M , GPN etc when or if they ever have a dip?\n\nAnd help would be greatly appreciated, cheers",
        "subreddit": "stocks",
        "title": "IPAY ETF or Individual Stocks?",
        "url": "https://www.reddit.com/r/stocks/comments/emya47/ipay_etf_or_individual_stocks/",
        "created": 1578723849.0
    },
    {
        "author": "Noctumn",
        "created_utc": 1579297386,
        "id": "eq70fv",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "With earnings coming up on or around 2/12 this is one to watch. I've been in and out of this stock since it was $128 about a year ago. Great product and conservative targets this past year- which may mean great results at earnings. \n\nI currently hold several contracts for the 2/21 expiry and just cashed out of my 1/17 contracts with 100% gains since purchase on the 10th.",
        "subreddit": "options",
        "title": "$GPN Look out for this one",
        "url": "https://www.reddit.com/r/options/comments/eq70fv/gpn_look_out_for_this_one/",
        "created": 1579326186.0
    }
]