[
    {
        "author": "ComputerTE1996",
        "created_utc": 1606148641,
        "id": "jzkpv1",
        "num_comments": 1684,
        "num_crossposts": 0,
        "selftext": "[I made the CIIC DD last week](https://www.reddit.com/r/wallstreetbets/comments/jwoakc/the_next_ev_play_ciic_and_arrival_merger/) when it was $12, there was no mention of CIIC anywhere (I monitor daily threads). [Today it is at $22](https://www.marketwatch.com/investing/stock/ciic).\n\n&amp;#x200B;\n\nWith all these EV stocks popping up, \n\n# my next play is the merger of $THCB and Microvast \n\n([Bloomberg article](https://www.bloomberg.com/press-releases/2020-11-13/tuscan-holdings-corp-announces-intent-to-combine-with-microvast-inc)). You might say, the merger isn't confirmed yet. That is true, but that's how you maximize profit before the news sets in. Bloomberg has never been wrong about any SPAC rumour except once (Topgolf). THCB will be able to sign an extension by Dec 3rd, likely to be beforehand)\n\nRight now, without an agreement confirmation, $THCB has barely popped yet, shares and warrants are still cheap. There is virtually 0 downside risk, THCB shares are currently at $10.44, like most SPACs, you can redeem shares to $10 cash if it fails through, which is unlikely to happen.\n\n&amp;#x200B;\n\n**So what is Microvast?**\n\nTLDR: EV Battery Maker based in Texas, business focuses in Asia (China market is $$). One of the best EV battery techs right now. Already has 100M revenue this year.\n\nIt makes EV batteries based on Lithium Titanium Oxide (LTO) chemistry. Compared to the incumbent Lithium Iron Phosphate (LFP) batteries, Microvast's batteries have longer life, shorter charging times, and offer substantial lower cost of ownership by eliminating swapping station infrastructures required by buses running on LFP batteries.\n\n[Their batteries powered the electric buses used in the 2018 Winter Olympic Games, it expects to generate more than $100 million in revenue this financial year.](https://www.reuters.com/article/microvast-ma-tuscan-holdings/ev-battery-maker-microvast-to-go-public-through-spac-merger-idINL4N2HZ3SI) Most other EV companies don't even have revenue yet. [THCB has a Return On Equity of 48.48%. This is amongst the best returns in the industry. The industry average is 11.30%. THCB outperforms 85% of its industry peers.](https://www.chartmill.com/stock/analyzer/stock/THCB?view=fundamental-analysis&amp;utm_source=stocktwits&amp;utm_medium=FA&amp;utm_content=THCB&amp;utm_campaign=social_tracking)\n\nIf you missed out on CIIC train, this will be the next hype play. I don't expect it to have big jumps in the next few days, but the merger agreement with Microvast should come out within the next 2 weeks. Get in early before it comes out and jumps up 50%. Shares and warrants are both cheap as fuck right now. Once merger is announced, THCB will easily go to \\~$20 range.\n\n&amp;#x200B;\n\nPositions: Load up on THCB shares and warrants. (I am going 30|70).",
        "subreddit": "wallstreetbets",
        "title": "I made the DD on CIIC last week, now I am moving onto my next play (EV battery)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jzkpv1/i_made_the_dd_on_ciic_last_week_now_i_am_moving/",
        "created": 1606177441.0
    },
    {
        "author": "deltalake",
        "created_utc": 1606664569,
        "id": "k3bf1o",
        "num_comments": 724,
        "num_crossposts": 0,
        "selftext": "DD - Pershing Square Tontine Holdings, Ltd ($PSTH)\n\nIn recent weeks there has been a lot of interesting action in the stock market as it relates to $PSTH. Despite a lot of noise and action and speculation if you go looking, the major news outlets and press have been quiet. This DD makes the argument (based on the available evidence) that Bill Ackman’s blank cheque company, PSTH, will announce a merger with Stripe, securing a \\~20% position in the company and taking it public.\n\nThis can be discredited as conjecture, but most things on WSB can be and are before they are realized. There is simply too much evidence here in favor of this happening to be ignored any longer.\n\nKey Information/Timeline of Events:\n\n\\- In July 2020, Bill Ackman went live with SPAC $PSTH – the SPAC raised $4B in proceeds making it the biggest SPAC ever.\n\n\\- The SPAC is designed very differently than others and incentivizes long term holding. Upon purchase of one common share and holding of that share through announcement and merger, owners receive 2/9 of a warrant with a strike of $23. Those who buy and sell on announcement bounce therefore give up that 2/9 and it goes back into the pool for those who hold through merger. What a lot of people are missing is what this means. It means that the ceiling for the value of that fractional merger is unknown but at minimum is 2/9. If there was a minority sell off on announcement that 2/9 could increase to 3/9 or 4/9 warrant for those who stay in. This creates a wild incentive for long term holding of the company and is referenced in the \"tontine\" name - look it up, pretty cool.\n\n\\- Ackman has given several interviews since the listing of PSTH arguing that they are very well positioned to target and capture a unicorn (large cap, well run, asset light, family owned, high moat, company.) Early speculation included AirBnB. While Ackman held talks with the company, they didn’t get to the point where his people got an inside look at the financials and he basically said they had no idea what they were dealing with despite liking how the company looked on the outside. AirBnB now, for many reasons remains unlikely.\n\n\\- Ackman in the same videos talked up Stripe as a quality company but one not ready to go public, specifically citing managerial deficits.\n\n\\- Stripe has been talked up by some in the press as the next Google. They control a large percentage of online payments at present.\n\n\\- Ackman has publicly disclosed his biggest misses as companies that make money based on money, giving Visa/Mastercard as the obvious example.\n\n\\- In the weeks since those interviews, several key events have taken place as follows:\n\no Following Ackman comments, Stripe initiates a dramatic position filling hiring spree with focus on positions needed to go public/SPAC\n\no Square executive joins board of PSTH\n\no Seth Klarman ($30B hedge fund manager “the next Buffet” and noted value investor, disclosed a $400M position in PSTH).\n\no Warren Buffet has slashed his JPM position almost entirely.\n\no Warren Buffet is secretly building a large position and hiding it from the press/pushing filing deadlines as much as possible.\n\no There is a large and undisclosed PSTH somewhere in the market that is not Klarman’s.\n\no In recent days the pre-market movement has been very odd. Several million positions. Pre-market on Friday for example, stock was up nearly 9% for some of the morning. Has consistently hit after-market highs the next day. The data is trending in a very clear direction.\n\nRelevant Documents/Links:\n\n\\- Ackman interview: [https://www.youtube.com/watch?v=GmaCarSyBk4](https://www.youtube.com/watch?v=GmaCarSyBk4)\n\n\\- Klarman position: [https://finance.yahoo.com/news/why-does-seth-klarman-pershing-165111126.html](https://finance.yahoo.com/news/why-does-seth-klarman-pershing-165111126.html)\n\n\\- Buffet leaves JPM: [https://markets.businessinsider.com/news/stocks/warren-buffett-berkshire-hathaway-built-8-billion-jpmorgan-stake-slashed-2020-11-1029846193](https://markets.businessinsider.com/news/stocks/warren-buffett-berkshire-hathaway-built-8-billion-jpmorgan-stake-slashed-2020-11-1029846193)\n\n\\- Buffet secret position: [https://www.cnbc.com/2020/11/17/warren-buffett-could-be-building-a-secret-position.html](https://www.cnbc.com/2020/11/17/warren-buffett-could-be-building-a-secret-position.html)\n\n\\- PSTH (Ackman) recent letter to investors, see PSTH section: [https://assets.pershingsquareholdings.com/2020/08/28125504/Pershing-Square-Holdings-Ltd.-June-2020-Interim.pdf](https://assets.pershingsquareholdings.com/2020/08/28125504/Pershing-Square-Holdings-Ltd.-June-2020-Interim.pdf)\n\n\\- Yolo Capital Mgmt twitter feed outlining much of the same events: [https://twitter.com/yolocapitalmgmt](https://twitter.com/yolocapitalmgmt)\n\nIn the end, we don’t know anything for sure but the evidence here (there is more to dig up, see [u/YOLO](https://new.reddit.com/u/YOLO/), is very compelling). Holding a stake here, whether its Stripe or something else, is likely a play with limited downside and insane upside. The warrant structure (“Tontine”) alone is so appealing.\n\nGoodluck.\n\n\\-commons (long-term) and contracts (June 21)",
        "subreddit": "wallstreetbets",
        "title": "$PSTH DD - Klarman, Buffet, Ackman - The Unicorn Hunter Goes Live - Pay Attention",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k3bf1o/psth_dd_klarman_buffet_ackman_the_unicorn_hunter/",
        "created": 1606693369.0
    },
    {
        "author": "lazyassman",
        "created_utc": 1605896051,
        "id": "jxu9y4",
        "num_comments": 343,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Jack Ma - Smartest Person on Earth",
        "url": "https://i.redd.it/xveyus5vrf061.png",
        "created": 1605924851.0
    },
    {
        "author": "johnyt3",
        "created_utc": 1604706725,
        "id": "jpgd94",
        "num_comments": 138,
        "num_crossposts": 0,
        "selftext": "**Section** **I.  The Election**\n\na.  A Republican Senate:\n\nFirst and foremost, to explain why puts got melted this week, the republican senate was a key component of the bull-run we've seen over the past few days.  When you think of the 2020 US election from the perspective of the major equities in weighted indices (like the SPY), what they were most worried about going into the election was the end of an era of low taxes and deregulation.  Sure, a Biden/Trump win was what people were thinking about most, but in the case of a Biden win, the continuation of a republican senate is what is key in keeping company valuations steady for the next 2 years.  This will keep taxes low, deregulation extended, and new legislation slow to pass.\n\n[Betting Odds for Control of the Senate.  Republicans \\(Red\\) vs Democrats \\(Blue\\).](https://preview.redd.it/1kpa2m0znkx51.png?width=573&amp;format=png&amp;auto=webp&amp;s=ce1d7774d22188467451350a9983150c43f801f8)\n\nShown above are the senate control betting odds as of last night.  They are sitting around 75-25 in favor of the republicans.  If this shifts in the favor of the democrats, we are very likely to see a negative reaction from the markets (though this is unlikely).\n\n&amp;#x200B;\n\nb.  The Implications of a Disputed Election:\n\nNow, on the uniqueness of 2020, this is going to be the first election in a long time where a ton of people on both sides are confident that they're winning.  Shown below are the presidential betting odds since right before the start of the election.  You can see that during the first night, Trump's odds nearly hit 80% as all of the initial votes being counted were from in-person voters. \n\n[Presidential Betting Odds Since Nov 2.  Biden \\(Blue\\) vs Trump \\(Red\\).](https://preview.redd.it/wvf1pf2knkx51.png?width=574&amp;format=png&amp;auto=webp&amp;s=335e7a06beb2e7efccc6636cb12a3d7661eaf9ed)\n\nThe sudden shift back to Biden (currently around 97% chance to win) from mail-in voters is what he has partly (but not exactly) been citing as evidence for voter fraud, and many of his followers are completely with him on the issue.  Invalidating the results of the election is his last stand, but the impact on equities markets is not going to end once the election is called.  The consequence of the apparent invalidity of the entire electoral process is that there will soon be mass confusion, protests, and other civil conflict and unrest around the country.  \n\nSomething that's worth noting is that **during the Bush v Gore election (2000) which was also contested, equities markets sold off 7-8%** within the weeks following the election.  \n\n&amp;#x200B;\n\nc.  Stimulus:\n\nOne final point about the election worth noting is that it has distracted both legislators as well as the general public away from other issues.  One of those issues is the lack of a new stimulus bill from congress; **it is likely that we are going to have to last through the winter until February without a new stimulus bill being passed**.  Trump losing the election will only make him less likely to focus on the issue, as his focus will rather be on taking the best evidence for voter fraud he can find to the Supreme Court.  We may start seeing people defaulting on loans in the middle of the winter, and consequently, we may also start to see small businesses struggling to stay afloat (we will talk about this more when we look at economic data).  On top of this, the initial jobless claims are still sitting around 750,000 people each week (down 7000 from last week); these are people that rely on these stimulus checks.\n\n&amp;#x200B;\n\n**Section II.  Covid-19:  Winter is Coming, Is a Vaccine?**\n\na.  R0 and Cold, Dry Weather:\n\nSo we're headed into the winter months, and one of the other things the election has distracted us all from is the coronavirus.  Its fairly common knowledge that the cold, dry weather of the winter months is primarily responsible for facilitating flu seasons that are worse than they are during any other months of the year.  If you look into some of the early research done on the same topic for Covid, you find exactly what you would expect.  Pictured below are two visuals from a study done in late January in China that aimed to seek the effects of temperature and humidity on the coronavirus.\n\n[A City-Level Visualization of China's Average Temperature from Jan 19 - Feb 10](https://preview.redd.it/pmi8nzd7qkx51.png?width=749&amp;format=png&amp;auto=webp&amp;s=116cd149c7322aa0315961682259e7f9bc854e26)\n\n&amp;#x200B;\n\n[A City-Level Visualization of China's Observed r0 Value of Covid-19 From Jan 19 - Feb 10](https://preview.redd.it/mz2nz9a2qkx51.png?width=820&amp;format=png&amp;auto=webp&amp;s=50583687dd093959ab1c1c388c7bc7a4a0dc4351)\n\nSource: [https://arxiv.org/ftp/arxiv/papers/2003/2003.05003.pdf](https://arxiv.org/ftp/arxiv/papers/2003/2003.05003.pdf)\n\nWhat we see is a fairly **strong correlation between a decrease in temperature and an increase in the observed r0 of the disease**.  Simply, the r0 is just a measure of the contagiousness of a disease.  What we can expect is that during these next few months, Covid is going to reach new highs of contagiousness in the United States.  As we will see below, the current case rates in the US do not seem to set us up for a calm winter.\n\n&amp;#x200B;\n\nb.  The Data:\n\n[Daily Coronavirus Cases in the United States.  7-Day MA Overlaid in Blue.](https://preview.redd.it/az26jsexmkx51.png?width=692&amp;format=png&amp;auto=webp&amp;s=fce6317132ab8e3275a2550218f2d77d4a959d92)\n\nNow to look into the number of infections, during the first wave of cases in the US, we peaked at around 30,000 daily cases and started trending back down as we entered lockdowns and started social distancing.  **Yesterday, we hit 120,000 cases in a single day**, and this barely broke the news as everyone is still entirely focused on the election.  \n\nThese insanely high case numbers, coupled with the effect on r0 of the winter weather, and possibly coupled with massive gatherings that are soon to come from election protests paint a grim picture for the winter to come.  It's never been a better time to stay inside, but we aren't seeing that sentiment or concern  being expressed from the country as a whole.  It's going to get bad.\n\n&amp;#x200B;\n\nc.  The Euro Countries:\n\nAs a response to a similar issue, we have seen Italy, Spain, France, Germany, and some other countries instantiate lockdowns to combat their rapidly rising case numbers.  \n\nSource: [https://www.cntraveler.com/story/european-countries-enter-second-lockdowns-as-cases-spike](https://www.cntraveler.com/story/european-countries-enter-second-lockdowns-as-cases-spike)\n\nThis is something that Trump has repeatedly said he would not do, but that's not necessarily the case with Biden; he has simply said that he will follow the science.  Soon enough we are going to start seeing regulation on social gatherings tightening up again.  A solution to stopping the current wave of Covid is unavoidable at this point, once the election news slows down, this is what people are going to be focused on.  \n\n&amp;#x200B;\n\nd.  Waiting on a Vaccine:\n\nAt the moment, we have Remdesivir which is able to reduce the infection period of Covid by a few days, but we have yet to discover something that reduces the mortality rate.  Something import to note about the Covid vaccines under development, however, is that **the US government has opted to protect pharmaceutical companies from any lawsuits related to unintended symptoms/damages caused by a vaccine**.  The purpose of doing this is to enable pharmaceutical companies to create a vaccine at a significantly faster pace, but the downside is that people are going to be skeptical of taking it.  It's also very likely that once a vaccine is available, it will be primarily given to high-risk patients as it will be in such a short supply, and it will take months (or possibly even a year) until there is enough supply/distribution underway that it can be given to everyone in the country.\n\nThe takeaway here is that we don't have much to help us get through the winter.  The market's are not going to like another economic slowdown, even if it is significantly smaller than the one we saw back in March/April.\n\n&amp;#x200B;\n\n**Section III.  The Invisible Economic Data**\n\na.  Banks, Loans, and What They're Telling Us:\n\nOnce again, due to all of the news and drama about the results of the election, something that is being overshadowed is economic data.\n\nTo take a look at some interesting trends, something that should catch your eye is that we are seeing a continuation of banks tightening their lending standards.  In a booming economy with the \"V-Shaped Recovery\" we are always hearing about, this is not something that we would see continuing to rise.  Especially during a time when people are talking about inflation fears, something to note is that banks tightening their lending standards is deflationary.  If people can't take out loans, and there is less money circulating around the economy, the dollar starts to increase in value.\n\n[Percentage of Banks Tightening Their Lending Standards \\(From the Senior Loan Officer Opinion Survey On Bank Lending Practices\\)](https://preview.redd.it/2uwn3takuox51.png?width=1150&amp;format=png&amp;auto=webp&amp;s=c67d0594ce6f5c4996281475cf72cd0be53d0c09)\n\nShown above, we are seeing around **70% of banks tightening their lending standards to small firms**, and we have not seen this number start to turn around yet.  These levels are comparable to what they were at the peak of the 2008 financial crisis, and what is shows is that the banks, for whatever reason, are **really not comfortable lending money to people right now**.  It should also be noted that typically, when banks tighten their lending standards, long-term treasuries decrease in yield and increase in price.  This is consistent with the fact that banks purchased around $30b in mortgage backed securities this past week alone to make up for their decrease in outgoing loans.\n\n&amp;#x200B;\n\nb.  Imports and Exports:\n\nTaking a look at US month-over-month imports and exports, what we would expect to see during a V-Shaped recovery are values falling rapidly during the initial shock, and then linearly approaching pre-Covid levels by the end of the recovery.  However, what we can see now is that after imports started to recover rapidly in July and August, **the demand has already started to taper off**.  Similarly, exports still have a long way to recover to reach pre-Covid levels, but we are even seeing export demand taper off.  This is likely due to our main export-countries also struggling to regain their pre-Covid levels of demand.\n\n[US MoM Imports \\(USD\\)](https://preview.redd.it/03sdum9c9px51.png?width=657&amp;format=png&amp;auto=webp&amp;s=a065043f449bb5da971e40940a48e8c2925ff1eb)\n\n[US MoM Exports \\(USD\\)](https://preview.redd.it/0tpsoudeapx51.png?width=659&amp;format=png&amp;auto=webp&amp;s=e71fc897e2643b99090d295c7ac12f56350a4f3b)\n\nThe key takeaway here is that with rising Covid cases, a typical economic slowdown during winter months, decreasing import and export demand, and tighter lending standards, the economic data does not portray the country as being in a strong position right now.  \n\n&amp;#x200B;\n\n**Section IV.  The Market and The VIX**\n\na.  Nasdaq, SPY, and DOW's Melt-Up:\n\nFinally, to take a look at where the markets are positioned, the S&amp;P 500 has rallied about 6% in the past 5 days, the DOW has rallied about 5.6%, and the Nasdaq has rallied about 7.9%.  This last trading day, we saw each index fail to break through it's current level, which is just about at market all-time-highs for each of them aside from the DOW (which has not yet fully recovered since March).  Today's volume was also significantly less than it was 2 days prior.\n\n[QQQ 3-Month With Volume](https://preview.redd.it/jget31s6epx51.png?width=814&amp;format=png&amp;auto=webp&amp;s=01ccd4903bd0314f83818ed7b0a1488ae40540fc)\n\n[DIA \\(Dow Jones\\) 3-Month With Volume](https://preview.redd.it/hcdavds8epx51.png?width=812&amp;format=png&amp;auto=webp&amp;s=939b2795c4812448859c35b0b157b6aeb02a557d)\n\n[SPY 3-Month With Volume](https://preview.redd.it/2qyjkpwaepx51.png?width=819&amp;format=png&amp;auto=webp&amp;s=8ac2b71a8c136e37ef5f97238331388465c3c1ce)\n\n&amp;#x200B;\n\nc.  The VIX:\n\nTaking a look at the VIX we are sitting at an all-time low since the start of Covid.  With so many people going long on vol and puts right before the election and then selling out of their positions once the next two years appeared to be stable due to the likelihood of a republican senate, the VIX has gotten absolutely crushed.  \n\n[VXX 6-Month With Volume](https://preview.redd.it/dcsglrtrepx51.png?width=810&amp;format=png&amp;auto=webp&amp;s=c00193cc466a62ac0b5ace19262dfb60c5144a71)\n\n&amp;#x200B;\n\n**TL;DR:**  Given the incoming political unrest of the country, the lack of stimulus for another several months, relatively persistent jobless claims, a likely increasing contagiousness of Covid coupled with possible social distancing regulations coming back into effect, ATH daily Covid case numbers (still rising), economic slowdown associated with winter months, 08-level tightening of banks' lending standards, tapering and slowing demand for imports and exports in the US, and the huge market rally and volatility crush we have just witnessed, the market seems to be gifting us a volatility trade.\n\nAs for the timing of it, once people look away from the election, once people start protesting the results, once people start focusing on Covid again, and once people take a closer look at the economic data, they will feel a lot less comfortable valuing markets at ATH levels.  These valuations will not last.\n\n**TL;DR of TL;DR:**  Volatility spike is likely.  A long-vol play seems appropriate, it's very cheap.\n\n**Positions:  34x (VXX 11/20 $24C)** \n\nLet me know if I missed anything or if you have any ideas of your own.  I may roll-back the options next week to the 27th to buy some more time.",
        "subreddit": "wallstreetbets",
        "title": "Volatility is Coming Back: How Election News is Overshadowing Potential Market Turmoil",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jpgd94/volatility_is_coming_back_how_election_news_is/",
        "created": 1604735525.0
    },
    {
        "author": "n00bball",
        "created_utc": 1604410227,
        "id": "jna9v3",
        "num_comments": 136,
        "num_crossposts": 0,
        "selftext": " Source: [https://www.scmp.com/business/companies/article/3108309/shanghais-stock-market-operator-calls-halt-ant-groups-imminent](https://www.scmp.com/business/companies/article/3108309/shanghais-stock-market-operator-calls-halt-ant-groups-imminent)\n\nChina’s  stock market operator has pulled the rug from under the largest initial  public offering in global finance, calling a halt on the November 5  dual listing of Ant Group’s shares in the city’s technology board less  than 48 hours before the highly anticipated trading was due to start.\n\nA  meeting earlier this week between Ant Group’s senior executives and  China’s top financial regulators constituted “significant change” in the  regulatory environment, which may lead to the fintech company not  fulfilling the listing requirements or disclosure rules of the exchange,  according to a statement by the Shanghai bourse operator.The Shanghai  Stock Exchange has decided to temporarily postpone the listing of Ant  Group, the market operator said.\n\nFour Chinese regulatory bodies, led by the People’s Bank of China, [held a meeting yesterday with the top executives of Ant](https://www.scmp.com/business/companies/article/3108145/ant-group-executives-meet-chinese-regulators-days-trading-debut),  on the eve of the fintech company are due to make their trading debut  in Shanghai and Hong Kong in the world’s biggest initial public  offering.\n\nThe  regulators met with Ant Group’s co-founder Jack Ma, executive chairman  Eric Jing and chief executive Simon Hu, according to a statement by the  securities regulator, without elaborating on the purpose or content of  the meeting.\n\n&amp;#x200B;\n\nThe  meeting also included representatives from the China Banking and  Insurance Regulatory Commission, the China Securities Regulatory  Commission and the State Administration of Foreign Exchange (SAFE), the  currency regulator.\n\n“On  November 2, 2020, Ma as controlling shareholder of Ant Group and Ant’s  management team met with Chinese financial regulators,” according to a  statement from the Hangzhou-based fintech company. “Views regarding the  health and stability of the financial sector were exchanged. Ant Group  is committed to implementing the meeting opinions in depth and  continuing our course based on the principles of: stable innovation;  embrace of regulation; service to the real economy; and win-win  cooperation. We will continue to improve our capabilities to provide  inclusive services and promote economic development to improve the lives  of ordinary citizens.”",
        "subreddit": "investing",
        "title": "Shanghai’s market operator halts world’s largest IPO by pulling Ant Group’s listing, citing changes in regulatory environment",
        "url": "https://www.reddit.com/r/investing/comments/jna9v3/shanghais_market_operator_halts_worlds_largest/",
        "created": 1604439027.0
    },
    {
        "author": "bengraham94",
        "created_utc": 1606571515,
        "id": "k2nz8g",
        "num_comments": 131,
        "num_crossposts": 0,
        "selftext": "QuantumScape is a US EV battery developer that just started trading on NYSE yesterday.\n\n**Technology**\n\nQuantumScape was founded in 2010 by Jagdeep Singh who is also the founder of Infinera which is anorther high tech start-up company.\n\nThey are developing solid-state lithium batteries relying on a solid material known as \"solid-state electrolyte\", whereas conventional batteries rely on liquid or gel electrolytes. Solid-state electrolytes allow for a much higher energy density, resulting in a longer range and more importantly in faster-charge times of about 15 minutes.  Since 2010 they spent over 300 Million $ in the development of this technology. \n\nTheir battery technology promises:\n\n* A range of over 300 miles\n* Charging in under 15 minutes\n* Costs per car under 30K$\n* A Battery Lifetime of more than 12 years or over 150,000 miles\n* More safety due to the non-oxidizable solid-state technology\n\nThe fact, that lithium-ion batteries didnt improve their engery density since 2015 is in my point of view the biggest plus. They secured their advancements with over 200 existing and pending patents. \n\n**Financials**\n\nOf course QuantumScape isnt profitable yet, and they dont plan to be cash flow positive until 2027.\n\nThey accumulated a deficit over the years of about 256 Million $ leading to a negative equity. But accumulated deficit/ accumulated profit is as all of us a know a pure accounting figure with no actual cash outflows. The massive pile of retained losses is due to their constant R&amp;D spendings, hopefully resulting in true technological advancements.\n\nQuantumScape has enough cash at hand to repay their non-current liabilites and 3 times the amount of their current liabilities. Additionally, no additional debt financing is planned as they expect to generate 1 billion $ through their NYSE listing through the SPAC Kensington Capital Aquisitions (230 million $ funding, management and board  stacked with  automotive and technology experts).\n\nBased on a forward looking revenue growth modell (20% discount rate) QuantumScape is valued at 3,3 billion $, whilst the current market cap is around 560 milion \n\n**Backing**\n\nQuantomScope is backed by a lot of expierenced decision makers like JB Straubel from Tesla but also with a load of inovative investors. In 2020 the Volkswagen Group announced its plans to increase shareholding in QuantumScape. Volkswagen sees the future in solid-state batteries rather than lithium-ion batteries as they started cooperating with QuantumScape in 2012. QuantumScape and VW established a joint-venture together to equip all VW EVs. VW is currently producing around 11 million cars per year and has plans to launch 70 electric vehicle models by 2029 with an additional spending of 38 billion $ in eletric mobility by 2024.\n\nAdditional investors are Continental, Bill Gates and Breakthrough Energy which is a umbrella for several organizations that are bundling efforts to accelerate innovation in sustainable energy. Members are Jeff Bezoss, Jack Ma, Richard Branson and George Soros among others. \n\nQuantumScope started trading on friday with a gain of roughly 60%. It is expected that many investors are jumping on the boat till the end of the year.\n\n**Sources**\n\n[https://finance.yahoo.com/news/ev-battery-developer-quantum-scape-begins-trading-on-nyse-153744553.html](https://finance.yahoo.com/news/ev-battery-developer-quantum-scape-begins-trading-on-nyse-153744553.html)\n\n[https://s26.q4cdn.com/263384136/files/doc\\_presentation/QuantumScape-Analyst-Presentation-Oct2020.pdf](https://s26.q4cdn.com/263384136/files/doc_presentation/QuantumScape-Analyst-Presentation-Oct2020.pdf)\n\n[https://www.spiegel.de/wirtschaft/unternehmen/quantumscape-diese-firma-soll-den-durchbruch-fuer-deutsche-e-autos-bringen-a-00000000-0002-0001-0000-000174211442](https://www.spiegel.de/wirtschaft/unternehmen/quantumscape-diese-firma-soll-den-durchbruch-fuer-deutsche-e-autos-bringen-a-00000000-0002-0001-0000-000174211442)\n\n[https://www.cnbc.com/2020/09/03/bill-gates-backed-ev-battery-supplier-to-go-public-through-spac-deal.html](https://www.cnbc.com/2020/09/03/bill-gates-backed-ev-battery-supplier-to-go-public-through-spac-deal.html)\n\n[https://www.quantumscape.com/team/](https://www.quantumscape.com/team/)\n\n[https://electrek.co/2020/11/27/battery-startup-backed-vw-tesla-co-founder-jb-straubel-quantumscape-qs-public/](https://electrek.co/2020/11/27/battery-startup-backed-vw-tesla-co-founder-jb-straubel-quantumscape-qs-public/)\n\n**Positions**:  None unfortunately, I was to fucking slow.",
        "subreddit": "wallstreetbets",
        "title": "QuantumScape ($QS) EV growth potential with boomer backing",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k2nz8g/quantumscape_qs_ev_growth_potential_with_boomer/",
        "created": 1606600315.0
    },
    {
        "author": "InfamousBreadfruit99",
        "created_utc": 1606625241,
        "id": "k339gx",
        "num_comments": 102,
        "num_crossposts": 0,
        "selftext": "Hello Retards,\n\nI'm here to talk to you today about Stripe. \n\nWhat is Stripe you may ask? \n\nStripe is one of the largest private companies backed by Peter Thiel (who has provided us bountiful tendies), Elon Musk, a16z, Thrive, and Sequoia Capital. It is run by 2 Irish brothers, Patrick and John Collison (so we get 2 brains for the price of one). This year, they were ranked #1 on CNBC Disruptor list.\n\n([https://www.cnbc.com/2020/06/16/stripe-disruptor-50.html](https://www.cnbc.com/2020/06/16/stripe-disruptor-50.html)[https://www.cnbc.com/2020/06/16/stripe-disruptor-50.html](https://www.cnbc.com/2020/06/16/stripe-disruptor-50.html))\n\nSo wtf does Strip do?\n\nGood question. Over 50% of all online transactions are processed through Stripe. So think of them like Amex, Visa, and Mastercard mixed with Shopify but without the physical card. 50% was before covid - with a record 9 billion in sales processed this weekend, their online share is probably much, much more.\n\nSo how do I buy it?\n\nWell, well, here comes in Bill Ackman with $PSTH. He has curated an extraordinary list of long term shareholders perfectly fit to take a 10% stake in Stripe at a 70b valuation. These include:\n\n&amp;#x200B;\n\n* [GUGGENHEIM CAPITAL LLC](https://whalewisdom.com/filer/guggenheim-capital-llc) : $499,180,000 - 3.61% - 2nd largest position\n* [BAUPOST GROUP LLC](https://whalewisdom.com/filer/baupost-group-llc-ma) : $397,075,000 - 4.29 - 6th largest position\n* [SOROBAN CAPITAL PARTNERS LP](https://whalewisdom.com/filer/soroban-capital-partners-llc) : $256,964,000 - 2.5% - 14th largest position\n* [WELLS FARGO &amp; COMPANY](https://whalewisdom.com/filer/wells-fargo-co-mn) $222,398,0000 - largest new position\n* [PRICE T ROWE ASSOCIATES INC](https://whalewisdom.com/filer/price-t-rowe-associates-inc-md) $174,318,000\n* [MILLENNIUM MANAGEMENT LLC](https://whalewisdom.com/filer/millennium-management-l-l-c) $119,711,000\n* [CITADEL ADVISORS LLC](https://whalewisdom.com/filer/citadel-advisors-llc) $49,170,000\n\nHow do we know it's $PSTH for sure?\n\nWell, well, we have been doing some extensive DD. DD so strong and huge and perfectly circumcised like Bill Ackman's dick that after the co-founder started following us last week, and the RISK PROGRAM MANAGER is monitoring us now. \n\nTD;LR CALLS ON $PSTH\n\nhttps://preview.redd.it/3t01gw2kz3261.jpg?width=1263&amp;format=pjpg&amp;auto=webp&amp;s=7ad79122cf8c94a50aca0b9b42c22dc154621a35",
        "subreddit": "wallstreetbets",
        "title": "Ginger is The New Green",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k339gx/ginger_is_the_new_green/",
        "created": 1606654041.0
    },
    {
        "author": "therealpanita",
        "created_utc": 1605684346,
        "id": "jwbfqh",
        "num_comments": 102,
        "num_crossposts": 0,
        "selftext": "As most BABA followers know the last two weeks of BABA have been brutal for Alibaba’s share prices.  Since it came out that equivalent to the USA’s SEC in China cancelled off the Ant IPO , on Xi’s orders, just days ahead of when the IPO was to take place as a way to punishment Jack Ma days after Ma had made statements that pissed off China’s leader.\n\nThe Chinese leadership does not want to eliminate or scare international investors away from making investments in China.  Xi is not stupid, he understands that if the BABA stock continues to fall,  it will would not just be hurting Ma but hurt China, as investors would see his country as a dangerous and risky place to invest.\n\nBABA is an inexpensive company - many posts have covered the financial angle so I am not going to cover the financials here.\n\nSo now after a 20% drop in less than two weeks, I am expecting some news to come from a Chinese agency that would calm the nerves of investors.  When that comes BABA shares would in my opinion rebound hard, and I expect it to go back to $310 or even higher in a very short time.\n\nTomorrow, the day after tomorrow, maybe next week, I have no clue of the when, but in my opinión soon. My guess is Xi will direct his people to issue some kind of statement to ease investor minds. I would not be surprised if the Ant IPO comes back on much sooner that.  I am even willing to put money down that Xi’s inner circle, and probably Xi himself, are probably already loading up on BABA shares and options.\n\nAgain it is hard  to say the exact when,  but Xi can’t let this go much further or he risks the reputation of his equity markets.   I think that I want BABA shares.",
        "subreddit": "stocks",
        "title": "Alibaba $BABA",
        "url": "https://www.reddit.com/r/stocks/comments/jwbfqh/alibaba_baba/",
        "created": 1605713146.0
    },
    {
        "author": "panoramicsummer",
        "created_utc": 1605224130,
        "id": "jt5zt8",
        "num_comments": 93,
        "num_crossposts": 0,
        "selftext": "[https://www.economist.com/briefing/2020/11/12/value-investing-is-struggling-to-remain-relevant](https://www.economist.com/briefing/2020/11/12/value-investing-is-struggling-to-remain-relevant)\n\n&amp;#x200B;\n\nFound this to be an excellent read and would love to hear what /investing has to say. Full article below: \n\n&amp;#x200B;\n\nIt is now more than 20 years since the Nasdaq, an index of technology shares, crashed after a spectacular rise during the late 1990s. The peak in March 2000 marked the end of the internet bubble. The bust that followed was a vindication of the stringent valuation methods pioneered in the 1930s by Benjamin Graham, the father of “value” investing, and popularised by Warren Buffett. For this school, value means a low price relative to recent profits or the accounting (“book”) value of assets. Sober method and rigour were not features of the dotcom era. Analysts used vaguer measures, such as “eyeballs” or “engagement”. If that was too much effort, they simply talked up “the opportunity”.\n\nPlenty of people sense a replay of the dotcom madness today. For much of the past decade a boom in America’s stockmarket has been powered by an elite of technology (or technology-enabled) shares, including Apple, Alphabet, Facebook, Microsoft and Amazon. The value stocks favoured by disciples of Graham have generally languished. But change may be afoot. In the past week or so, fortunes have reversed. Technology stocks have sold off. Value stocks have rallied, as prospects for a coronavirus vaccine raise hopes of a quick return to a normal economy. This might be the start of a long-heralded rotation from overpriced tech to far cheaper cyclicals—stocks that do well in a strong economy. Perhaps value is back.\n\nThis would be comforting. It would validate a particular approach to valuing companies that has been relied upon for the best part of a century by some of the most successful investors. But the uncomfortable truth is that some features of value investing are ill-suited to today’s economy. As the industrial age gives way to the digital age, the intrinsic worth of businesses is not well captured by old-style valuation methods, according to a recent essay by Michael Mauboussin and Dan Callahan of Morgan Stanley Investment Management.\n\nThe job of stockpicking remains to take advantage of the gap between expectations and fundamentals, between a stock’s price and its true worth. But the job has been complicated by a shift from tangible to intangible capital—from an economy where factories, office buildings and machinery were key to one where software, ideas, brands and general know-how matter most. The way intangible capital is accounted for (or rather, not accounted for) distorts measures of earnings and book value, which makes them less reliable metrics on which to base a company’s worth. A different approach is required—not the flaky practice of the dotcom era but a serious method, grounded in logic and financial theory. However, the vaunted heritage of old-school value investing has made it hard for a fresher approach to gain traction.\n\n## Graham’s cracker\n\nTo understand how this investment philosophy became so dominant, go back a century or so to when equity markets were still immature. Prices were noisy. Ideas about value were nascent. The decision to buy shares in a particular company might by based on a tip, on inside information, on a prejudice, or gut feel. A new class of equity investors was emerging. It included far-sighted managers of the endowment funds of universities. They saw that equities had advantages over bonds—notably those backed by mortgages, railroads or public utilities—which had been the preferred asset of long-term investors, such as insurance firms.\n\nThis new church soon had two doctrinal texts. In 1934 Graham published “Security Analysis” (with co-author David Dodd), a dense exposition of number-crunching techniques for stockpickers. Another of Graham’s books is easier to read and perhaps more influential. “The Intelligent Investor”, first published in 1949, ran in revised editions right up until (and indeed beyond) Graham’s death in 1976. The first edition is packed with sage analysis, which is as relevant today as it was 70 years ago.\n\nUnderpinning it all is an important distinction—between the price and value of a stock. Price is a creature of fickle sentiment, of greed and fear. Intrinsic value, by contrast, depends on a firm’s earnings power. This in turn derives from the capital assets on its books: its factories, machines, office buildings and so on.\n\nThe approach leans heavily on company accounts. The valuation of a stock should be based on a conservative multiple of future profits, which are themselves based on a sober projection of recent trends. The book value of the firm’s assets provides a cross-check. The past might be a crude guide to the future. But as Graham argued, it is a “more reliable basis of valuation than some other future plucked out of the air of either optimism or pessimism”. As an extra precaution, investors should seek a margin of safety between the price paid for a stock and its intrinsic value, to allow for any errors in the reckoning. The tenets of value investing were thus established. Be conservative. Seek shares with a low price-earnings or price-to-book ratio.\n\nThe enduring status of his approach owes more to Graham as tutor than the reputation he enjoyed as an investor. Graham taught a class on stockpicking at Columbia University. His most famous student was Mr Buffett, who took Graham’s investment creed, added his own twists and became one of the world’s richest men. Yet the stories surrounding Mr Buffett’s success are as important as the numbers, argued Aswath Damodaran of New York University’s Stern School of Business in a recent series of YouTube lectures on value investing. The bold purchase of shares in troubled American Express in 1964; the decision to dissolve his partnership in 1969, because stocks were too dear; the way he stoically sat out the dotcom mania decades later. These stories are part of the Buffett legend. The philosophy of value investing has been burnished by association.\n\nIt helped also that academic finance gave a back-handed blessing to value investing. An empirical study in 1992 by Eugene Fama, a Nobel-prize-winning finance theorist, and Kenneth French found that volatility, a measure of risk, did not explain stock returns between 1963 and 1990, as academic theory suggested it should. Instead they found that low price-to-book shares earned much higher returns over the long run than high price-to-book shares. One school of finance, which includes these authors, concluded that price-to-book might be a proxy for risk. For another school, including value investors, the Fama-French result was evidence of market inefficiency—and a validation of the value approach.\n\nAll this has had a lasting impact. Most investors “almost reflexively describe themselves as value investors, because it sounds like the right thing to say”, says Mr Damodaran. Why would they not? Every investor is a value investor, even if they are not attached to book value or trailing earnings as the way to select stocks. No sane person wants to overpay for stocks. The problem is that “value” has become a label for a narrow kind of analysis that often confuses means with ends. The approach has not worked well for a while. For much of the past decade, value stocks have lagged behind the general market and a long way behind “growth” stocks, their antithesis (see chart 1). Old-style value investing looks increasingly at odds with how the economy operates.\n\nIn Graham’s day the backbone of the economy was tangible capital. But things have changed. What makes companies distinctive, and therefore valuable, is not primarily their ownership of physical assets. The spread of manufacturing technology beyond the rich world has taken care of that. Any new design for a gadget, or garment, can be assembled to order by contract manufacturers from components made by any number of third-party factories. The value in a smartphone or a pair of fancy athletic shoes is mostly in the design, not the production.\n\nIn service-led economies the value of a business is increasingly in intangibles—assets you cannot touch, see or count easily. It might be software; think of Google’s search algorithm or Microsoft’s Windows operating system. It might be a consumer brand like Coca-Cola. It might be a drug patent or a publishing copyright. A lot of intangible wealth is even more nebulous than that. Complex supply chains or a set of distribution channels, neither of which is easily replicable, are intangible assets. So are the skills of a company’s workforce. In some cases the most valuable asset of all is a company’s culture: a set of routines, priorities and commitments that have been internalised by the workforce. It can’t always be written down. You cannot easily enter a number for it into a spreadsheet. But it can be of huge value all the same.\n\n## A beancounter’s nightmare\n\nThere are three important aspects to consider with respect to intangibles, says Mr Mauboussin: their measurement, their characteristics, and their implications for the way companies are valued. Start with measurement. Accounting for intangibles is notoriously tricky. The national accounts in America and elsewhere have made a certain amount of progress in grappling with the challenge. Some kinds of expenditure that used to be treated as a cost of production, such as r&amp;d and software development, are now treated as capital spending in gdp figures. The effect on measured investment rates is quite marked (see chart 2). But intangibles’ treatment in company accounts is a bit of a mess. By their nature, they have unclear boundaries. They make accountants queasy. The more leeway a company has to turn day-to-day costs into capital assets, the more scope there is to fiddle with reported earnings. And not every dollar of r&amp;d or advertising spending can be ascribed to a patent or a brand. This is why, with a few exceptions, such spending is treated in company accounts as a running cost, like rent or electricity.\n\nThe treatment of intangibles in mergers makes a mockery of this. If, say, one firm pays $2bn for another that has $1bn of tangible assets, the residual $1bn is counted as an intangible asset—either as brand value, if that can be appraised, or as “goodwill”. That distorts comparisons. A firm that has acquired brands by merger will have those reflected in its book value. A firm that has developed its own brands will not.\n\nThe second important aspect of intangibles is their unique characteristics. A business whose assets are mostly intangible will behave differently from one whose assets are mostly tangible. Intangible assets are “non-rival” goods: they can be used by lots of people simultaneously. Think of the recipe for a generic drug or the design of a semiconductor. That makes them unlike physical assets, whose use by one person or for one kind of manufacture precludes their use by or for another.\n\nIn their book “Capitalism Without Capital” Jonathan Haskel and Stian Westlake provided a useful taxonomy, which they call the four Ss: scalability, sunkenness, spillovers and synergies. Of these, scalability is the most salient. Intangibles can be used again and again without decay or constraint. Scalability becomes turbo-charged with network effects. The more people use a firm’s services, the more useful they are to other customers. They enjoy increasing returns to scale; the bigger they get, the cheaper it is to serve another customer. The big business successes of the past decade—Google, Amazon and Facebook in America; and Alibaba and Tencent in China—have grown to a size that was not widely predicted. But there are plenty of older asset-light businesses that were built on such network effects—think of Visa and Mastercard. The result is that industries become dominated by one or a few big players. The same goes for capital spending. A small number of leading firms now account for a large share of overall investment (see chart 3).\n\nPhysical assets usually have some second-hand value. Intangibles are different. Some are tradable: you can sell a well-known brand or license a patent. But many are not. You cannot (or cannot easily) sell a set of relationships with suppliers. That means the costs incurred in creating the asset are not recoverable—hence sunkenness. Business and product ideas can easily be copied by others, unless there is some legal means, such as a patent or copyright, to prevent it. This characteristic gives rise to spillovers from one company to another. And ideas often multiply in value when they are combined with other ideas. So intangibles tend to generate bigger synergies than tangible assets.\n\nThe third aspect of intangibles to consider is their implications for investors. A big one is that earnings and accounting book value have become less useful in gauging the value of a company. Profits are revenues minus costs. If a chunk of those costs are not running expenses but are instead spending on intangible assets that will generate future cashflows, then earnings are understated. And so, of course, is book value. The more a firm spends on advertising, r&amp;d, workforce training, software development and so on, the more distorted the picture is.\n\nThe distinction between a running expense and investment is crucial for securities analysis. An important part of the stock analyst’s job is to understand both the magnitude of investment and the returns on it. This is not a particularly novel argument, as Messrs Mauboussin and Callahan point out. It was made nearly 60 years ago in a seminal paper by Merton Miller and Francesco Modigliani, two Nobel-prize-winning economists. They divided the value of a company into two parts. The first—call it the “steady state”—assumes that that the company can sustain its current profits into the future. The second is the present value of future growth opportunities—essentially what the firm might become. The second part depends on the firm’s investment: how much it does, the returns on that investment and how long the opportunity lasts. To begin to estimate this you have to work out the true rate of investment and the true returns on that investment.\n\nThe nature of intangible assets makes this a tricky calculation. But worthwhile analysis is usually difficult. “You can’t abdicate your responsibility to understand the magnitude of investment and the returns to it,” says Mr Mauboussin. Old-style value investors emphasise the steady state but largely ignore the growth-opportunities part. But for a youngish company able to grow at an exponential rate by exploiting increasing returns to scale, the future opportunity will account for the bulk of valuation. For such a firm with a high return on investment, it makes sense to plough profits back into the firm—and indeed to borrow to finance further investment.\n\nPicking winners in an intangible economy—and paying a price for stocks commensurate with their chances of success—is not for the faint-hearted. Some investments will be a washout; sunkenness means some costs cannot be recovered. Network effects give rise to winner-takes-all or winner-takes-most markets, in which the second-best firm is worth a fraction of the best. Value investing seems safer. But the trouble with screening for stocks with a low price-to-book or price-to-earnings ratio is that it is likelier to select businesses whose best times are behind them than it is to identify future success.\n\n## Up, up and away\n\nProperly understood, the idea of fundamental value has not changed. Graham’s key insight was that price will sometimes fall below intrinsic value (in which case, buy) and sometimes will rise above it (in which case, sell). In an economy mostly made up of tangible assets you could perhaps rely on a growth stock that had got ahead of itself to be pulled back to earth, and a value stock that got left behind to eventually catch up. Reversion to the mean was the order of the day. But in a world of increasing returns to scale, a firm that rises quickly will often keep on rising.\n\nThe economy has changed. The way investors think about valuation has to change, too. This is a case that’s harder to make when the valuation differential between tech and value stocks is so stark. A correction at some stage would not be a great surprise. The appeal of old-style value investing is that it is tethered to something concrete. In contrast, forward-looking valuations are by their nature more speculative. Bubbles are perhaps unavoidable; some people will extrapolate too far. Nevertheless, were Ben Graham alive today he would probably be revising his thinking. No one, least of all the father of value investing, said stockpicking was easy.",
        "subreddit": "investing",
        "title": "The Economist: \"Value investing is struggling to remain relevant\"",
        "url": "https://www.reddit.com/r/investing/comments/jt5zt8/the_economist_value_investing_is_struggling_to/",
        "created": 1605252930.0
    },
    {
        "author": "issaaaathroway",
        "created_utc": 1605678742,
        "id": "jwabiq",
        "num_comments": 84,
        "num_crossposts": 0,
        "selftext": "what’s everyone’s thoughts right now? I’m personally buying the dip. I’ve read on what’s going on with Ma and President Xi but I’m really confident on the company for the LT and think the stock will go back up. \n\nAre you guys still buying? Feeling hesitant?",
        "subreddit": "stocks",
        "title": "BABA",
        "url": "https://www.reddit.com/r/stocks/comments/jwabiq/baba/",
        "created": 1605707542.0
    },
    {
        "author": "NightcoreRo",
        "created_utc": 1605637983,
        "id": "jvyfwr",
        "num_comments": 77,
        "num_crossposts": 0,
        "selftext": "Fellow European here. What s the deal with Roblox? I am keen to invest in airbnb when it gets public, but I keep seeing people hyped for Roblox while I haven't got a clue why. Can someone who is bored give ma an insight why would be better than Airbnb , who is slowly coming into vocabulary like \" I Google something\" \" we can do Airbnb or hotel(instead of sayinv host\"\n\n\nTy\n\nAlso long PLTR",
        "subreddit": "stocks",
        "title": "Roblox Vs airbnb",
        "url": "https://www.reddit.com/r/stocks/comments/jvyfwr/roblox_vs_airbnb/",
        "created": 1605666783.0
    },
    {
        "author": "rhetorical_twix",
        "created_utc": 1604410684,
        "id": "jnae0d",
        "num_comments": 73,
        "num_crossposts": 0,
        "selftext": "BABA news flash: The Shanghai arm of ANT IPO might be suspended as Chinese regulators review ANT platform's impact as a potential financial sector disruptor.\n\nI'm actually relieved to see this. Not because I want the ANT IPO suspended, but because it confirms some of my suspicions about how significant of a financial disruptor ANT's platform can potentially be. It revolutionizes and liberalizes capitalization of transactional finance, lending and investing all the way down to the granular individual level. \n\nI was wondering why such a revolutionary system was not threatening existing financial insiders in China. At this point, it might be a regulatory hurdle or a challenge from traditional bank insiders in the country. Either way, I'm holding and might pick up shares if the price drops today, but this does make me nervous.\n\n____________________\n\n&gt; A tweet from Chinese state-affiliated media company Global Times says the Shanghai stock exchange has suspended that arm of Ant Group's (NYSE:BABA) IPO.\n\n&gt; There's nearly $3T in orders for the offering, which hopes to raise just shy of $40B.\n\n&gt; The tweet was backed up by Shanghai's market regulator, which cites recent regulatory talks and the possible inability for Ant to comply with IPO disclosure requirements.\n\n&gt; Yesterday, the WSJ reported that controlling Ant owner Jack Ma and two executives were summoned on Monday to meet with China's central bank and the securities, banking, and foreign exchange regulators.\n\n&gt; The details weren't discussed. Ant simply said that views \"regarding the health and stability of the financial sector were exchanged.\"\n\n&gt; Alibaba shares are down nearly 5% pre-market to $295.37.\nPreviously: Ant Group's Shanghai retail book 872x oversubscribed (Oct. 29 2020)",
        "subreddit": "stocks",
        "title": "BABA: Shanghai arm of ANT IPO might be suspended as Chinese regulators review ANT platform's impact as a potential financial sector disruptor",
        "url": "https://www.reddit.com/r/stocks/comments/jnae0d/baba_shanghai_arm_of_ant_ipo_might_be_suspended/",
        "created": 1604439484.0
    },
    {
        "author": "prplput",
        "created_utc": 1606020194,
        "id": "jypqhd",
        "num_comments": 72,
        "num_crossposts": 0,
        "selftext": "I see these Buy Now Pay Later services absolutely everywhere now. Seems like it’s rarer to find an online store that doesn’t have one or more of these as a payment option. \n\nI’m sure they represent just a small percentage of total ecommerce transactions still, but given their growth it seems completely possible that they grow to a point where they are taking real share away from traditional credit and debit card purchases (since using BNPL totally bypasses these traditional payment rails), which impacts credit card issuers like Chase and Amex and also the card networks like Visa and Mastercard. It also impacts traditional card payment processors like a Stripe or Adyen.",
        "subreddit": "investing",
        "title": "Will Afterpay, Klarna, Affirm become big enough to disrupt the credit card industry, payment processors, and card networks?",
        "url": "https://www.reddit.com/r/investing/comments/jypqhd/will_afterpay_klarna_affirm_become_big_enough_to/",
        "created": 1606048994.0
    },
    {
        "author": "augusttrip2019",
        "created_utc": 1605812360,
        "id": "jx8txr",
        "num_comments": 64,
        "num_crossposts": 0,
        "selftext": "Jack Ma is back baby - first green day we've had in a while after a 20% dip (which was all headline risk).\n\n**Investment Considerations:** \n\n* Some of you may know the stock fell due to Ant Group pausing their IPO. Stock went down almost 20% since October 27th. \n* It's oversold and PE ratio is low (30) compared to some comparable companies (amazon is at 90)\n* IV is also relatively low compared to others in the sector \n* As soon as the Ant IPO is back on we're back to where we were near the $300+ mark \n\n**Positions:** 4/16/21 $298c and long a ton of stuck",
        "subreddit": "wallstreetbets",
        "title": "$BABA is back baby!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jx8txr/baba_is_back_baby/",
        "created": 1605841160.0
    },
    {
        "author": "HGTV-Addict",
        "created_utc": 1604424178,
        "id": "jnehoi",
        "num_comments": 61,
        "num_crossposts": 0,
        "selftext": "China called a sudden halt to the world’s[ biggest initial public offering](https://www.wsj.com/articles/inside-ant-the-company-behind-the-worlds-biggest-ipo-11603798576), casting uncertainty over the future of financial-technology giant Ant Group Co. and delivering an extraordinary rebuke to its controlling shareholder, Jack Ma.\n\nThe Shanghai Stock Exchange suspended Ant’s blockbuster IPO late Tuesday, a day after four regulatory agencies summoned Mr. Ma and the company’s top two executives[ to a closed-door meeting](https://www.wsj.com/articles/chinese-regulators-summon-ant-leaders-amid-record-ipo-11604327306).\n\nThe meeting and a changing regulatory environment constitute major events that have disqualified Ant from listing this Thursday, the bourse said.\n\nThe company said a concurrent Hong Kong listing would also be suspended. Ant plans to return the funds it has collected from investors who subscribed to its IPO, which had been on track[ to raise at least $34.4 billion ](https://www.wsj.com/articles/ant-speeds-ahead-with-record-ipo-after-investor-orders-pour-in-11603890132)in total. “Ant Group apologizes for the trouble this has caused investors,” it said in a post on Chinese social media.",
        "subreddit": "wallstreetbets",
        "title": "Shenanigans in China - ANT Group IPO rejected, new regulations unleashed to kneecap business",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jnehoi/shenanigans_in_china_ant_group_ipo_rejected_new/",
        "created": 1604452978.0
    },
    {
        "author": "smallstreetgains",
        "created_utc": 1605756665,
        "id": "jwv5o4",
        "num_comments": 53,
        "num_crossposts": 0,
        "selftext": "#Trending Tickers\n\nTicker|Mentions|Bulls|Neutral|Bears|Price|Change|P/E\n:--|:--|:--|:--|:--|:--|:--|:--\nNIO|779|29.30%|59.01%|11.69%|45.06|-3.28%|-\nPLTR|592|32.78%|59.85%|7.37%|17.90|0.28%|-\nBABA|300|35.80%|58.37%|5.84%|255.83|-0.38%|52.11\nTSLA|267|32.26%|59.68%|8.06%|486.64|10.2%|-\nBA|218|35.12%|53.17%|11.71%|203.30|-3.21%|-\nSPY|201|24.60%|58.29%|17.11%|356.28|-1.2%|-\nRIOT|152|33.57%|63.64%|2.80%|5.25|-13.72%|-\nCCL|76|21.13%|53.52%|25.35%|17.59|-2.55%|3.74\nGOLD|65|22.03%|72.88%|5.08%|24.46|-3.59%|-\nNET|64|27.45%|60.78%|11.76%|64.48|-2.24%|-\nDKNG|56|25.93%|70.37%|3.70%|47.68|2.3%|-\nPFE|53|17.39%|71.74%|10.87%|36.32|0.78%|13.58\nAMZN|51|22.45%|63.27%|14.29%|3105.46|-0.96%|135.7\nMA|46|15.38%|79.49%|5.13%|335.94|-0.17%|42.22\nMSFT|44|30.00%|65.00%|5.00%|211.08|-1.58%|37.56\n\n\n#Trending Contracts\n\nTicker|Strike|Type|Date|Mentions\n:--|:--|:--|:--|:--\nNIO|$50|CALL|11/20|5\nCCL|$17.5|CALL|1/15/21|3\nNIO|$60|CALL|11/20|3\nNIO|$46|CALL|11/27|3\nPLTR|$24|CALL|2/19|3\nRIOT|$7|CALL|12/4|2\nTSLA|$500|CALL|11/27|2\nCCL|$17|PUT|11/20|2\nPLTR|$15|PUT|11/27|2\nBA|$200|CALL|11/20|2\nACB|$4|CALL|1/21/22|2\nCRSR|$100|CALL|11/20|2\nPLTR|$20|CALL|12/10|1\nPLTR|$20|CALL|2/11|1\nK|$90|CALL|1/21/22|1\nCRSR|$30|CALL|12/18|1\nC|$30|CALL|1/21|1\nUPS|$170|CALL|1/21|1\nFDX|$280|CALL|1/22|1\nDIS|$140|PUT|12/18|1\n\n\n#Other Information\n\nSubreddits Searched: wallstreetbets, investing, stocks, stockmarket, options, robinhood\n\nComments Searched: 17553\n\nUnique Tickers: 264\n\nTotal Tickers: 7238\n\nUnique Contracts: 86\n\nTotal Contracts: 163\n\nFinancial data provided by [Vhinny](https://www.vhinny.com/).\n\nView daily trending tickers on r/RedditTickers.",
        "subreddit": "wallstreetbets",
        "title": "The Most Popular Tickers on Reddit for today, 2020-11-18.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jwv5o4/the_most_popular_tickers_on_reddit_for_today/",
        "created": 1605785465.0
    },
    {
        "author": "Adagio-Spirited",
        "created_utc": 1605116208,
        "id": "jsclh6",
        "num_comments": 51,
        "num_crossposts": 0,
        "selftext": "Who is telling the truth? \n\nSee news in Chinese for context -- it sounded ugly.\n\n1. Alibaba Singles Day Sales (aka 11:11, Nov 11) Hit Record High $75 Billion\n\nReally? Check this out...\n\nWorse Nov 11 (China's equivalent of \"Prime Day/Black Friday/\") in history: Jack Ma &amp; buddies LOST $2 trillion in 2 days [https://finance.sina.com.cn/tech/2020-11-11/doc-iiznezxs1326859.shtml](https://finance.sina.com.cn/tech/2020-11-11/doc-iiznezxs1326859.shtml) ... Google for more (in Chinese of course). NB: Yahoo and Wall Street have a stake in Alibaba?\n\nKeypoint: Authority deliberately imposed many restrictions on labeling and  what can be sold on Alibaba's Taobao on Nov 11... To understand this strategy, read \"China tightens restrictions on Australian exports\" [https://apnews.com/article/virus-outbreak-beijing-global-trade-australia-south-china-sea-ea95bc519eb9bf40172edc626caf5537](https://apnews.com/article/virus-outbreak-beijing-global-trade-australia-south-china-sea-ea95bc519eb9bf40172edc626caf5537) ... same thing.\n\n2. You must have heard of \"China drafts new antitrust guideline to rein in tech giants\" by now. What's the big deal? US and the west did the same thing, nothing happened.\n\nWell, you must have forgotten China's conviction rate in China is literally 99.99%. That's the different.\n\n3. Ant Financials IPO - The politics behind the suspension isn't something Joe can understand.\n\nFirst, the timing - why IPO suspended on the eve of the debut? This is directly due to the 5th China Communist Party plenum that eneded just before Jack Ma &amp; co were told their $3 billion Ant Financials IPO has been suspended.\n\nClue: No heir apparent as Xi reveals top leadership. \n\nStill wondering what's happening? Here &gt; The Boss wanna make sure all parties are obsessed with the IPO, happy, and create no trouble during the party plenum, which is the \"Bilderberg\" of China which may give birth to China's new leader.\n\nSecond, non-bank money-lending is considered loan-sharking no matter how hard you try masqurade the sin as \"fintech\" -- no different from trying to bypass the Fed with any other form of money (just google). This is not to say China is shutting down Ant Financials becos Jack Ma created a ew cryptocurrency, it's becos Ant's microlending is seen as a timebomb for CCP.\n\nHow so? Google keywords like \"China P2P Lending Suicide Scandal\", you'd see why did China craked down the so called hitech \"P2P Lening\" industr that left behind social ills like suicides, bankruptcies, etc (many still listed as pennystocks on NASDAQ like KXIN, WEI, etc. -- all were given 2 years to wind down and do something else)... Ant Financials is no difference for CCP believes Jack Ma &amp; co. will leave behind the same mess so big that it may collapse the CCP. You see? \n\nPlus, big-mouthed Jack Ma actually told this guy [https://en.wikipedia.org/wiki/Wang\\_Qishan](https://en.wikipedia.org/wiki/Wang_Qishan) that China regulators are dinosaur that do not understand \"fintech\".  \n\ntl;dr: Jack Ma is history -- He has been personally targeted to send out a clear message: \"Who's The Boss\" (just like why Trump fired Esper the other day). \"Xi Jinping going after Jack Ma's head\" [https://www.soundofhope.org/post/439876](https://www.soundofhope.org/post/439876)\n\n*What do you make up of the situation?*",
        "subreddit": "investing",
        "title": "$BABA - Jack Ma, Singles Day, Alibaba, Ants Financial",
        "url": "https://www.reddit.com/r/investing/comments/jsclh6/baba_jack_ma_singles_day_alibaba_ants_financial/",
        "created": 1605145008.0
    },
    {
        "author": "cooleddy89",
        "created_utc": 1604275407,
        "id": "jmd2g9",
        "num_comments": 48,
        "num_crossposts": 0,
        "selftext": "Obligatory disclaimer: “predicting is very difficult, especially if it’s about the future”, and I’ve been very wrong before (most recently about the market rebound). But it’s fun to have a discussion and what else is there to do now that it’s cold with a COVID surge?  \n&amp;nbsp;\n\nFull disclosure: Despite my arguments below, I hold modest positions in several of the apartment rental REITs. One reason is simply to hedge against me being wrong. I also think there’s a gap between the eventual modest decline in valuations and the 40-50% decline we’ve seen in luxury coastal apartment REITs (Essex, Avalon, Equity). The public REITs have investment grade credit rating, and several of them (Equity, Avalon) have recently issued debt at ~2% due to the accommodative corporate credit environment. Many also have suburban portfolios which could prosper from the urban departures. \n\n&amp;nbsp;\n\n# Intro \n\nThere’s been a great deal of hysteria in the popular press / investment forums about “the death of cities”. \n\nThis is clearly ridiculous. “Cities” are the engines of economic growth in every developed economy. The 100 largest metropolitan areas contain 65% of the US population and 68% of total economic activity (and closer to 75+% of patents, intellectual property development, etc). Cities as a whole will continue to grow and expand in the United States as they have for the past 200 years. \n\nOn the flip side, not all cities are created equally. I think a very reasonable question to ask is how will the multifamily real estate markets in very high cost of living cities (VCOL), loosely defined as San Francisco, NYC, Boston, and maybe LA fare in the near future? \n\nI’m personally a big believer that external shocks very rarely generate new trends but tend to accelerate existing underlying ones. And when looking at the future of VCOL areas we have a story about demographics, affordability, schools / child care, job dispersion, supply, and immigration. \n\n&amp;nbsp;\n\n# Thesis \n\nMy thesis is that VCOL, and in particular the dense urban cores, will see flat to negative growth in populations, rent, and condo prices as Millennials age into child-rearing years and move to areas with more affordable housing / better schools. Older generations will continue their preference for warmer, lower tax areas while foreign immigration remains depressed. This trend will be compounded by the increase in luxury rental units as projects initiated in 2018, 2019, and early 2020 move onto the market. More flexible work from home policies will also contribute modestly to this trend, but is not the main driver. Single family housing, even in VCOL areas, will likely be unaffected due to severe supply constraints. \n\n&amp;nbsp;\n\nI see Millennials primarily moving to 3 distinct areas of the country:\n\n- Cheaper areas outside the urban core in Metropolitan Statistical Area (MSA), e.g. Worcester MA in the larger Boston metro area, suburban areas in NJ adjacent to NYC, etc. \n- Smaller, emerging high-tech cities such as Pittsburgh, Boise, etc. that offer relatively affordable housing, walkable communities, and often close proximity to national parks, ski areas, etc. \n- Sunbelt / Southern “mega-cities’ such as Phoenix, Austin, Atlanta, etc. with affordable housing and booming populations \n\n# What do the public markets say?\n\nOne of the features (not a bug) of private real estate is that it moves much more slowly and is oftentimes uncorrelated with public markets. Case in point, residential housing prices peaked in the US around 2006-2007 and then decreased until 2012 (i.e. 3-4 years after the stock market and other public markets fully reflected the valuation shifts). Luckily for today’s investors, one major difference between 2008 and today is that we have large, national, publicly traded REITs in both the apartment and single family rental sectors. Even better, the apartment housing REITs have different geographic concentrations and economic consumers (i.e. luxury, affordable, student, etc.). We also have large, publicly traded companies involved in single family home building / renovations that are also great proxies for the single family housing market. \n\n&amp;nbsp;\n\nSo, how are apartment rental REITs in VCOL locations doing? The first one to consider is Essex Property Trust (ESS), a member of the S&amp;P 500. They have luxury apartments primarily in LA &amp; San Francisco (~75%) and also in Seattle (~25%). They are down ~40% from their all time high in February. Next up is Avalon Bay (AVB), the largest apartment REIT, which owns luxury apartments in VCOL coastal areas in Boston, NYC, SF, etc. They are down ~40% from their all time high. Equity Apartments, similar to AvalonBay but with a slightly worse credit rating of BBB+, is down ~50%. UDR, another coastal luxury apartment REIT, is also down ~40%. If you read the most recent earnings calls from Equity / Avalon, one thing they both cite is their high rental collection rate (~98%) and the high household income of their tenants (~$150,000). \n\n&amp;nbsp;\n\nLet’s contrast that to the sunbelt / mid Atlantic luxury REITs: Camden Property (CPT) and Mid America Apartments (MAA). These REITs have extensive holdings in Texas, Florida, Phoenix, etc. Mid America is down ~22% while Camden is down ~25%. \n\n&amp;nbsp;\n\nThe market is currently discounting luxury apartment rentals in VCOL by almost 2x the rate as more affordable sunbelt / Southern cities. This is despite the fact that rental collection rates remain high and that these properties have affluent tenants who are least likely to be affected by the recession. \n\n&amp;nbsp;\n\nThe contrast is even more stark when comparing against single family rental REITs, the largest of which is Invitation Homes (a spinoff of Blackstone, INVH). They own ~90,000 homes across the Sunbelt, upper mid-west, and more affordable areas of the West. They are down only 9% off of all time highs. The US home construction ETF from I-shares (ITB) which tracks home developers such as Lennox and home supply stores like Lowes actually set an all time high in September 2020. \n\n&amp;nbsp;\n\nThe bottom line is that public markets suggest that luxury, apartment rental housing companies have lost 20-50% of their pre-pandemic value, with VCOL losing almost twice the value of luxury rentals in booming sunbelt / southern cities. In contrast, single family home rentals remain extremely strong with valuations of home building companies trading at all time highs. \n\nAs an aside, if you’re bullish on VCOL areas I would strongly suggest purchasing these REITs. The dividend yields are ~4.5% which is the widest spread over 10 year treasuries (0.8%) in many years. If you listen to the earnings call from Equity, Avalon, etc. you’ll also hear the CEOs cite the high private market valuations of their properties. If the market is wrong you’ll lock in relatively high dividend rates with price appreciation. \n\n\n# Demographics \n\nEven before the pandemic, VCOL had stagnant or modestly declining populations. Government census records estimate that NYC lost ~76,000 residents in 2019, a drop of around 0.4%. It’s worth noting that NYC  has for years experienced net negative domestic migration, but foreign immigration balanced out the departures. The Boston metro region stayed flat while San Francisco declined slightly (~0.2%). While economically vibrant, the populations of these cities had clearly started to plateau and even modestly decline prior to the pandemic. There’s a nice graph at rent cafe that summarizes the metros with the highest and lowest net migration over the past decade. NYC and LA top the list, with Boston at the number 8 position. In contrast, the metros with the highest migration are Phoenix, Dallas, and Austin in the Top 5.  \t\n\n&amp;nbsp;\n\nIf we look at the composition of these cities, the largest age bracket is from 25-44: 37.5% in San Francisco, 33.2% in Boston, and 33% NYC. This essentially encompasses the millennial generation, who the census defines are born between 1981 - 1997 (~23 to 39). The millennial cohort comprises ~75 million individuals and is the largest generation since the baby boomers and significantly larger than the next generation, Gen-Z. \n\n&amp;nbsp;\n\nThe millennial cohort entered their mid-20s during and immediately after the Great Recession. Millennials with technical or advanced degrees flocked to the new “knowledge” jobs in tech, consulting, marketing, etc. at employers clustered in VCOL areas. With significant disposable income, these millennials fueled a rise in service industries that attracted other millennials to work as baristas, waiters, etc. At the same time, new single family home construction declined significantly due to the fallout from the housing bust. \n\n&amp;nbsp;\n\nAs a consequence rents held relatively steady during the financial crisis than surged during the recovery. As one data point, rents increased ~50%+ from 2010 to 2019 in SF. As Millennials willingly paid rapidly rising rents in these VCOL, a narrative emerged that millennial were somehow different. They were comfortable renting forever, they didn’t need much space, they believed in the sharing economy and wouldn’t purchase cars, etc. The data appeared to support this data, as the number of renters earning $150,000 increased at twice the rate as home owners.  \n\n&amp;nbsp;\n\nUnfortunately there is increasing evidence against this narrative. A linked MIT Sloan study suggests millennials may actually utilize vehicles more than older generations. The linked survey from ApartmentList suggests that over 90% of millennials want to own homes eventually. Millennials, based on all the studies and surveys I’ve seen, have similar aspirations as older generations. They want to eventually own, not rent, a residence and personal vehicle while raising children. All of these goals have simply been delayed due to financial constraints. \n\nAs we’ll see in the next section, these aspirations are effectively impossible for the vast majority of millennials in VCOL areas. \n\n# Affordability:\n\nThere’s a popular stereotype that the average millennial is a 4 year college graduate, making $100,000+ in tech, who walks around in Patagonia vests sipping $5 lattes (fuller disclosure: this stereotype hits uncomfortable close to home). According to the Government Accountability Office (GAO) only 44% of millennials even have 4 year or higher college degrees. Moreover, at age 39 (i.e. the oldest millennial), an income of $100,000 is in the top ~25% of incomes. The median net worth of the prime home buying aged millennial (30-34) is only $35,000 (including home equity), while the 90th percentile of this group is only ~$260,000 (including home equity). In 1989 (when baby boomers were the equivalent age of Millennials today) they held about 21% of the wealth in the US. In contrast, Millennials today have ~3%. \n\n&amp;nbsp;\n\nFor the median millennia household, who has an income of ~$69,000 pre-pandemic, buying even a modest apartment in a VCOL is difficult to impossible without extensive family assistance. Let’s assume that most millennial households want to have at least 1 child (a Gallup poll found ~87% of millennials without children eventually wanted to have them). That means long term millennials are likely to settle in at least 2BR and more likely 3 BR and up apartments / homes. \n\n&amp;nbsp;\n\nThe median priced condo (not house) in VCOL areas (pre-pandemic) is approximately  ~$1.2 million in SF,  ~$650,000 in Boston, and ~$667,900 in NYC (Manhattan, Brooklyn, and Queens). This understates the lack of affordability, because these prices reflect a mixture of studios to 3+ BRs. I couldn’t find detailed sales pricing for condos segmented by number of bedrooms, but glancing at Zillow / Redfin the prices for 3BR apartments or single family homes across all VCOL areas seems to be at least $800k and above depending on quality, location, etc. \n\n&amp;nbsp;\n\nRents are luckily far more transparent. According to Zumper, the rents for 3BR apartments and above in VCOL (pre-pandemic) areas were ~$5,000 in SF, ~$3,500 in Boston, and ~$4,000 in NYC.  As an aside, if we use a 30% rent to income ratio than a millennial household would have to make at least $10,500 per month (or an annualized salary of $126,000) to rent a 3 BR in the cheapest VCOL area. For households with families in 2017 between 30-35, an income of $126,000 is at the 80th percentile. As we’ll see in the next section, childcare dramatically adds to a households costs. \n\n&amp;nbsp;\n\nSo let’s focus our analysis on the wealthiest 10% of millennials (who coincidentally are also most likely to have affluent parents who can assist with a home down payment). These millennials, particularly those in the prime family formation years of 30-35, make over $170,000+. Given the well documented trend in associative mating, they are also likely to partner with other high income millennials. Let’s assume that ~5% of millennial households make  &gt;$200,000 per year (for comparison, the top 10% of all households made over $200,000 in 2019). These households can easily afford even San Francisco rental prices. And at first glance, a millennial household making $200,000 could save for a downpayment of a $1 million dollar home (~$240,000) within ~6 years if they saved 20% of their gross income. But what about affording the monthly mortgage payment? \n\n&amp;nbsp;\n\nAs rough numbers, a household making $200,000 in Boston, MA would be left with $148,712 after taxes. If they maxed out their 401k, they would have $121,135 or ~$10,000 per month. Redfin estimates that a $1 million home in Boston will cost ~$4500 a month based on a 3%, 30 year mortgage and including home insurance + property taxes. If we assume maintenance + furnishings + misc expenses we can probably assume a total housing cost of ~$5500 per month. Our hypothetical household is thus left with ~$4500 per month to spend on food, entertainment, vehicles costs, etc. while also maxing our their 401k. \n\nLet’s assume there are roughly 31 million households between 25-39, so back of the envelope math suggests that there is a pool of 1.5 million households available to buy real estate in VCOL areas (5% of 31 million) if they could afford the down payment or receive family assistance. \n\nThere is one giant impediment to that math though: affordable childcare and public schools. \n\n# Child Care\n\nThe biggest single reason in my opinion that millennials will leave VCOL urban areas is the the cost of childcare (averaging $2000 per month)  and the persistent poor performance of public schools.  \n\n&amp;nbsp;\n\nThe premier public school districts continue to remain in the outer suburbs of urban areas. A list of the top 15 public school districts in America shows numerous school districts in suburbs surrounding Chicago, NYC, San Francisco, Boston, and Philadelphia. In contrast, public school districts in dense urban areas often receive mediocre ratings. \n\nThe simplest alternative to these urban public schools is to pay for private school. Private school tuitions in VCOL areas range widely between ~$25k and ~$70k per child. These means a family of 4 could easily pay $50k or more in combined tuition, on top of the $66k ($5500 monthly) in housing expenses noted above. These two expenses alone would effectively consume the entire after tax income of a household making $200,000 per year. \n\n&amp;nbsp;\n\nThe crushing expense of childcare shows up in declining birth rates in VCOL. Since 2011, the number of babies born in NYC has declined 9%. San Francisco has the lowest share of children of any of the top 100 metros. Families with children older than 6 are in decline in high density urban areas. (There’s a great Atlantic article from Derek Thompson linked below) \n\n&amp;nbsp;\n\nThe bottom line is that for all but the wealthiest ~5% of millennial households settling down and raising a family in a VCOL area is essentially unaffordable without significant tradeoffs or parental support. Buying a modest home in a VCOL area, sending your children to private school, funding your retirement, and owning a modest vehicle combined requires a household income of close to $300,000. \n\n&amp;nbsp;\n\nBefore the hate mail begins, the key word in the sentence above is trade-offs. I’m well aware the maxing out a joint 401k is puts a household ahead of almost all other American families. Unlike some personal financial columnists, I’m in no way suggesting that earning $300,000 per year is close to poverty or any other nonsense like that. Clearly, earning $300,000 a year as a household is a rare privilege that lets you enjoy a very comfortable lifestyle. \n\nThe point I’m making is that in a VCOL a $300,000 salary does not make you feel affluent. You’re still likely stressed about money, still having to save for years to afford a down payment, driving a modest vehicle, etc. Meanwhile, any of your friends who live in Austin, Denver, etc. are able to enjoy a more stereotypical upper middle class life. Not to mention that your friends who move to Boise, Pittsburgh, etc. likely feel flat out wealthy. \n\n&amp;nbsp;\n\nTaxes are also worth a passing mention. Households making $200,000 in salary, maxing out both partners 401k, pay ~$10k in state / local taxes in VCOL areas (LA, SF, NYC, Boston). It’s worth noting that RSUs, i.e. the bulk of employees compensation at Big Tech firms, are taxed as regular income. Texas, Florida, Nevada, Washington, and New Hampshire all have no income taxes and most have booming metropolitan areas. The recent tax law changes passed by President Trump have also compounded the situation by increasing the standard deduction to $24,000 for married couples and capping the state and local tax deduction to $10k. \n\n# Job Dispersion:\n\nAs I mentioned above, the VCOL areas had stagnating or modestly declining populations even in 2019. In stark contrast, the sunbelt &amp; Southern cities are booming. Austin, TX experienced a 2.8% population increase in 2019. Denver, CO experienced a 1.5% population increase. Boise, Idaho was the fastest growing city in the US over the past decade. Even Orlando, FL is growing at over 1% a year. \n\n&amp;nbsp;\n\nAnd employers are more than happy to open offices in lower cost, “business friendly” locations. Palantir announced its intention to shift to Denver, CO. Tesla plans to open up its Gigafactory near downtown Austin. Startup funding in Austin continues to rise (albeit from low levels).  \n\nEven well established Silicon Valley offices have rapidly growing satellite offices in Austin, Denver, etc.  Facebook has 1200 employees in Austin (compared with ~15,000 in San Francisco). Google has &gt; 1500 employees in Austin as well. Google also employs 1500 employees in Denver / \nBoulder. \n\n&amp;nbsp;\n\nMany of these regions are anchored on world class research universities as well. The University of Texas at Austin has top 10 computer science and engineering programs. Carnegie Mellon in Pittsburgh is a Top 5 computer science school and leader in Artificial Intelligence research.  The University of Minnesota has a top 2 Chemical Engineering program. \n\n&amp;nbsp;\n\nWe unfortunately can’t discuss job dispersion without addressing the vociferous work from home debate. I frankly don’t think the pandemic will significantly impact the work from home trend long term. Many high paying sectors have already moved towards flexible work arrangements. Glancing at McKinsey’s website, we see that many of their positions list 20+ major metros as possible locations, including Atlanta, Chicago, Denver, etc. Snowflake, the hottest company of 2020, lists 237 open positions on their website. Only 86 of those are in listed as San Mateo (their SF Bay Area headquarters), mostly in engineering / internal operations. The reason is obvious: over 125 positions (i.e. 55+%) are in customer facing roles in sales, professional services, etc. Companies want a geographic dispersion of these roles both across the US and internationally. \n\n&amp;nbsp;\n\nIt’s also worth mentioning that “elite” companies, who provide a disproportionate number of the jobs for high income millennials, frankly don’t have that many employees. Alphabet and Facebook combined have only ~200,000 employees despite a market cap of approximately $2 trillion dollars. Bain &amp; McKinsey combined only have ~30,000 employees. JP Morgan chase has 256,941 employees, but only 37,000 (14.4%) are in New York. The largest single office for JP Morgan is actually in Columbus, Ohio and houses 11,050 employees. \n\nWe’re also seeing a bit of a “resource curse” for VCOL cities as the extremely high costs of living / business drive out firms who aren’t as profitable per employee. McKesson, #8 on the S&amp;P 500 list by revenue, moved its HQ from San Francisco to Dallas in 2018. Charles Schwab, is leaving San Francisco while expanding its offices in Denver &amp; Dallas. \n\n&amp;nbsp;\n\nThe bottom line is that the trend was already clear pre-pandemic. The leading companies, who pay the highest salaries, are actively investing in satellite offices or remote positions across the United States. For tech and management consulting companies, this helps distribute their customer facing sales and service teams. For financial and other companies, they are able to lower their costs by moving back-office operations outside VCOL areas. Meanwhile, companies who aren’t able to match the compensation packages of elite firms or want to lower their cost of business are relocating to cheaper areas. \n\nAs a final point, Forbes has an interesting article about the top 15 metro areas ranked by revenue of Fortune 500 companies headquartered there. While the New York metro area dominates the list with 65 companies that earn $1.7 trillion in revenue, and the greater SF / San Jose area is second with ~$1.5 trillion, the next 2 spots are Dallas ($996.2 billion) and Chicago ($842.2). Minneapolis and Houston also are in the top 7 spots, above either Boston or Washington DC. \n\n# Supply:\n\nConcerns about multifamily supply had already started in mid 2019. Years of low interest rates and strong rental price growth had led to dramatic booms in apartment housing. Fannie Mae (the government agency) has detailed insights into the multi-family market across major metros. Helpfully they also include rent growth predictions from 3 large real estate analytics companies.  \n\n&amp;nbsp;\n\nThe Boston, MA core urban area had a projected ~10,000 units in the pipeline for 2020 (estimated at 4-6% new supply).  Rent price increases were estimated at average of 2% and trending downward pre-pandemic.San Francisco had planned delivery of ~5,000 new unites in 2019 and 2020 with a projected increase in vacancy rate of 5% (trending towards balanced). New York City already had a glut of luxury apartments in 2019, with stagnant or negative rent growth projected pre-pandemic. \n\nIt’s worth noting that while single family home construction has continued to lag demand, multi-family home construction rebounded to pre Great Financial Crisis levels by 2013. By 2015, multifamily construction had hit the highest level since 1987. \n\n&amp;nbsp;\n\nWe can see the effect of supply in the fact that average rental prices in several VCOL had started to plateau around late 2018. Boston, MA saw rental price growth of only ~2-3% annually between 2016 and 2019 according to RentCafe. RentCafe also shows San Francisco average rents increasing from $3450 in Nov 2016 to $3683 in Nov 2019, for an annual increase of 2-3% as well. Brooklyn, NY average rents increased from $2603 in Nov 2016 to $2928 in Nov 2019 for a total increase of 12% or ~4% per year. One thing to keep in mind is that these average rents don’t take into account hedonistic adjustments, i.e. people moving into nicer, new luxury apartments and paying slightly more. \n\n# Immigration / Baby Boomers / Gen Z:\n\nWith evidence pointing towards a modest decline in the number of millennials in VCOL areas, could other groups offset their departure? What about foreign immigrants? \n\n&amp;nbsp;\n\nRegardless of your thoughts on the Trump administration, it’s clear the administration has kept its promise to reduce foreign immigration into the United States. In 2018, the New York Times reported that net immigration to the US was only 200,000, the lowest level since the Great Recession. The same article, along with a related article from PBS also notes in particular that Chinese student attendance has dropped significantly due to concerns over visas, geo-political tensions, and violence. The current pandemic and recent trade tensions are likely to only exacerbate the situation. The Department of Homeland Security websites shows that “Persons obtaining lawful residence in the US” dropped by ~150,000 between 2016 and 2019 (or ~10%). This is a problem for VCOL which have relied upon foreign immigration to make up for net domestic migration. Foreign investment has often followed this migration. \n\nAt the moment, there also isn’t an obvious political constituency to argue for increased legal immigration into the US. The Democratic Party’s immigration policy is largely focused on legalizing the Dreamers, i.e. children born to undocumented immigrants. The Republican Party’s immigration policy has largely focused around halting illegal immigration.\n\n&amp;nbsp; \n\nWhat about baby boomers returning to the cities for their golden years? The New York Times cites census data which indicates that 17.8% of 54-72 year olds live in urban areas (defined by density). This compares with 21.6% in 1990. Moreover, while more baby boomers are renting, they seem to prefer to do so in suburban areas. \n\n&amp;nbsp;\n\nWell, what about Gen Z (those born after between 1997- 2012)? First of all, the generation is smaller than millennials by about 5 million individuals. Second, a Pew research study has found that for the oldest Gen Zers (18-23), over 50% have reported that they or someone in their household has lost a job or pay in the recent recession compared to 40% of millennials and only 25% of Baby Boomers. Last, but likely most important, the millennials successfully revitalized and then gentrified large parts of the VCOL urban cores. As a consequence, to borrow a phrase, the rents are already too damn high. Gen Z will enter the workforce already facing sky high rents in VCOL while dealing with a weaker labor market due to the COVID induced recession. \n\n&amp;nbsp;\n\nThe bottom line is that there is no obvious group to replace the millennials if they start exiting core VCOL urban cores in large numbers. \n\n\n# Final Thoughts:\n\nWhew, if you made it this far congratulations! I started writing this as a way to organize my thoughts, then frankly became fascinated in the topic. \n\nIf I were to summarize this article, I would say “demographics is destiny” or “the pandemic accelerates, but does not change, existing trends”.  The 2010s saw the largest generation since the Baby Boomers delay the traditional milestones of adulthood to focus on their careers, education, and finances. Millennials preference for dense, walkable urban areas with deep job markets led to the urban renaissances of VCOL areas and accompanying spike in rents. A boom in multifamily construction followed as real estate developers rushed to deliver luxury rental apartments to cater to this new class of affluent urban dwellers. \n\n&amp;nbsp;\n\nThe 2020s will see VCOL areas deals with the consequences of their success. Most millennials simply cannot afford to raise families in VCOL areas. Even before the pandemic we saw net migration increasing out of VCOL towards the booming Southern / Southwestern areas of the country. Companies are more than willing to follow suit, either by moving directly or by opening satellite officers to take advantage of cheaper real estate and lower taxes. Unfortunately this increase in departures is occurring exactly as multifamily supply continues to increase in VCOL areas due to a multiyear boom in construction. And there is no evidence that I've seen of any other demographic group who will rush to fill the vacancies generated by millennials. Baby boomers continue to prefer warm, low tax, suburban areas. Foreign immigration is depressed and likely to remain so for a variety of factors. Gen Z, with ~5 million fewer members than the millennials,  is graduating into a depressed labor market with rents already inflated far past what the median salary can afford. \n\n&amp;nbsp;\n\nI want to emphasize that this is a modest shift in population, not a panicked flight. A number of affluent millennials will continue to reside in VCOL areas and even purchase long term residences (particularly with parental aid). Millennials who were able to buy in 2012-2014 have enjoyed significant real estate appreciation and are also likely to remain in those areas. But these modest population decreases will lead to a flat to negative rent price growth in VCOL areas as the market struggles to absorb additional luxury supply. \n\n&amp;nbsp;\n\nUnfortunately, as has been a recurring theme during this pandemic, the pain will be felt most acutely by small-scale landlords who bought properties recently in VCOL areas. Residential Real Estate is in some ways a zero sum game in that each tenant can usually only occupy one unit at a time. The large, publicly traded coastal REITs are currently tapping the corporate credit markets to push out their existing debt maturities and raise additional capital at historically low rates. They can, and are, offering deep concessions for their luxury units to attract tenants. They also typically have diversified into suburban areas and can invest opportunistically into high growth areas (notably Denver). They also have historically attracted the more affluent tenants who are willing to pay a premium for amenities (concierage, gyms, etc.) and are least affected by the pandemic. \n\n&amp;nbsp;\n\nTo end on a positive note, I think the migration of millennials to more affordable, emerging cities is a net positive for the United States. Entrepreneurship, measured by small business formation in the US, has been dropping for years. I think part of the problem is that millennials in VCOL are locked into high paying career paths to afford rent, childcare, etc. Likewise spreading economic growth across the country and revitalizing other areas of the US may help bridge some of the bitter partisan politics.   \n\n&amp;nbsp;\n\nP.S. If I post links in my posts they usually get blocked. I generally used NYT, Fannie Mae, the GAO, RentCafe (part of Yardi), and the Atlantic for my sources. If you're curious about a particular source I'll post it",
        "subreddit": "investing",
        "title": "Beyond doom and gloom: A nuanced discussion of multifamily rentals / REITs in very high cost of living cities (VCOL)",
        "url": "https://www.reddit.com/r/investing/comments/jmd2g9/beyond_doom_and_gloom_a_nuanced_discussion_of/",
        "created": 1604304207.0
    },
    {
        "author": "ntrsfrml",
        "created_utc": 1605268779,
        "id": "jtfrqx",
        "num_comments": 46,
        "num_crossposts": 0,
        "selftext": "Senior government leaders were furious about wealthy entrepreneur’s criticisms of regulators; rebuke was the culmination of years of tense relations\n\nMr. Xi, who read government reports about the speech, and other senior leaders were furious, according to the officials familiar with the decision-making. Mr. Xi ordered Chinese regulators to investigate and all but shut down Ant’s initial public offering, the officials said, setting in motion a series of events that led to the deal’s suspension on Nov. 3.\n\nAnt declined to comment, and Mr. Ma couldn’t be reached. The Information Office of the State Council, China’s cabinet, didn’t respond to questions.\n\n[Wall Street Journal](https://www.wsj.com/articles/china-president-xi-jinping-halted-jack-ma-ant-ipo-11605203556?mod=hp_lead_pos5)",
        "subreddit": "stocks",
        "title": "China’s President Xi Jinping Personally Scuttled Jack Ma’s Ant IPO",
        "url": "https://www.reddit.com/r/stocks/comments/jtfrqx/chinas_president_xi_jinping_personally_scuttled/",
        "created": 1605297579.0
    },
    {
        "author": "h9sj2",
        "created_utc": 1605715411,
        "id": "jwif1h",
        "num_comments": 44,
        "num_crossposts": 0,
        "selftext": "~@FrankPeelen (Not me, but DD checks out.)\n\nBased on data I gathered from 13F filings, a large number of TSLA shares seem to have gone missing during Q3, to the tune of 50M shares. \n\nThis is a large number of shares that can't be explained away by retail buying, delta hedging, and smaller institutional investors increasing their stakes.\n@s17_scott and Thekiwi on TMC pointed out to me that $BRK omitted one company from its 13F, and instead disclosed this newly acquired stake separately in a confidential filing, because it was worried that making the position public would move the market too much.\n\nAccording to this BI article: https://markets.businessinsider.com/news/stocks/warren-buffett-berkshire-hathaway-buying-secret-stock-revealed-coming-weeks-2020-11-1029813523, there is a $25B difference between the value of the portfolio $BRK declared in its 13F and its 10-Q ($220B vs $245B). In actuality, they declared $245.5B in their 10-Q and $229B in their 13F, a difference of $16.5B.\n\nThe BI article also mentions a $6B investment into 5 big Japanese trading companies made over a 12 month period, which was made public in early August, and which supposedly explains part of the disparity between the 13F and 10-Q.\n\nIndeed, there is also a disparity of $5B between $BRK's Q2 13F and 10-Q. In other recent quarters, the differences were:\n\nQ2'20: $202.5B vs $207.5B = $5B\nQ1'20: $175.5B vs $180.5B = $5B\nQ4'19: $242B vs $248B = $6B\n\nSo the current $16.5B difference is not normal.\nThe BI article also mentions this has happened once before in Q2'15, when $BRK reported $110.5B in equity holdings in its 10-Q vs $107B in its 13F, a difference of $3.5B, only to file an amendment 3 weeks later, worth $2.5B.\n\nAssuming that $5-6B of the current $16.5B disparity is due to the investment in the Japanese trading giants, what can the other $11B be attributed to? Could $BRK's currently confidential new investment be $TSLA?\n\nAnother important piece of information is the size of this position, and implications it has on 13D/13G filings. Companies have to disclose an acquisition of a 5%+ stake in a company within 10 days to the SEC. So unless $BRK was also allowed to keep this confidential...this means the $11B must be less than 5% of the company in which it was invested. That means the company's market cap must be &gt;$220B, which really limits the options. There are only 25 such companies listed on US exchanges: https://www.dogsofthedow.com/largest-companies-by-market-cap.htm\n\nFurthermore, $BRK already owns stock in 9 of them, and is 1 of them:\n\n1) $AAPL\n2) $AMZN\n3) $BRK\n4) $V\n5) $JNJ\n6) $JPM\n7) $PG\n8) $MA\n9) $BAC\n10) $KO\n\nThere are only 15 other $220B+ companies listed on the NYSE and NASDAQ\n\nNone of this proves anything, but when combined with the ~50M $TSLA shares that went missing in Q3, there are some strong signs showing $BRK's mystery new investment could be $TSLA.\n\nIf it is $TSLA, this $11B would amount to ~25M shares at the stock price at the end of Q3 ($429), and would go a long way towards explaining the ~50M missing $TSLA shares. 50M shares can't be explained away by retails, small institutions, and delta hedging, but...\n25M can, especially with 25M shares worth of buying pressure pushing up the stock price as much as it did in Q3, because a rising stock price requires a lot of shares to be bought for delta hedging purposes, as I've explained in my blog previously:\n\nhttps://teslainvestor.blogspot.com/2020/04/the-mechanisms-that-fueled-tslas.html\n\nSo did $BRK acquire a large stake in $TSLA? There's no proof, but it seems very plausible. We should find out for sure what $BRK's mystery new acquisition is over the next few weeks or months.",
        "subreddit": "wallstreetbets",
        "title": "Buffet and Papa Musk anime crossover?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jwif1h/buffet_and_papa_musk_anime_crossover/",
        "created": 1605744211.0
    },
    {
        "author": "momreview420",
        "created_utc": 1605473038,
        "id": "jut4gt",
        "num_comments": 43,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "ma nipple ulation",
        "url": "https://i.redd.it/735odg1ytgz51.gif",
        "created": 1605501838.0
    },
    {
        "author": "JSTOCKSJ",
        "created_utc": 1606154785,
        "id": "jzmupg",
        "num_comments": 42,
        "num_crossposts": 0,
        "selftext": "Jack ma bent the knee this morning to China. Biden loves China. We are going the fuck up. BABA is better than amazon. Come on people wake up. Where are my BABA holders let’s go.",
        "subreddit": "wallstreetbets",
        "title": "$BABA LETS FUCKING GO. If you think this not closing green today. You are wrong. look at yourself in the mirror right now. Do you want to be a millionaire. Hammer $350 calls for $BABA NOW. HOLIDAY SEASON BUYING.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jzmupg/baba_lets_fucking_go_if_you_think_this_not/",
        "created": 1606183585.0
    },
    {
        "author": "Brothanogood",
        "created_utc": 1605311098,
        "id": "jtrewh",
        "num_comments": 41,
        "num_crossposts": 0,
        "selftext": "Visa stock has made investors more than 1,000% over the past decade -- peppy for an organization that dates back to the Eisenhower administration. But here comes a gaggle of app-based hopefuls eyeing not just the toll roads that make credit cards work, but also the $2 trillion in worldwide revenues collected for payments of all kinds.\n\nYou know about PayPal (ticker: PYPL) and maybe Square (SQ) and Venmo. How about Remitly, Stripe, Circle, and Bolt? There are dozens more with Seussian names. To skip out on a dinner check with under-30s, just mock the encryption protocol of their favorite fintech platform, and tell them you'll froop them ticklecoins.\n\nI spoke this past week with Visa (V) chief Al Kelly about the competitive landscape in payments. That's a sensitive subject now, because Visa is trying to buy a company called Plaid, which serves as a data go-between for banks and apps. For example, Venmo uses Plaid. This month, the Department of Justice sued to block the deal, alleging that it would deprive consumers of a potential alternative to Visa. Kelly calls the deal pro-consumer and says Visa will fight the suit vigorously. \"We feel very, very good about that,\" he says.\n\nVisa was spawned from the first true credit card -- the paper, $300-limit BankAmericard, launched in 1958. Bank of America kept the credit business but licensed the financial plumbing for cards to other banks. This eventually became Visa, and a rival system launched in 1966 became Mastercard (MC). Today, Visa links 70 million sellers with 3.5 billion account credentials issued by 13,000 banks. It collects fees per transaction for authorization, clearing, and settlement, and it sells add-on services for things like detecting fraud and increasing customer loyalty.\n\nThis year, I've come to view paying in cash and receiving change as the financial equivalent of shaking hands during a bilateral sneeze. Giving over a credit card for swiping, or sliding my own and pawing a number pad, is more like an elbow bump -- better, but do we really have to? Tap-to-pay is the norm in most of the world, but not the U.S. -- yet. Kelly says it will be common here soon. If past patterns from other markets repeat, tap-to-pay will bring a big jump in the percentage of U.S. transactions done with cards.\n\nCard adoption is already climbing -- to 82.1% of in-store transactions from 78.7% in January, according to industry researcher The NPD Group. But opportunities for spending have shriveled. So, during Visa's fiscal year ended in September, revenues decreased 5%, to $21.8 billion, and earnings per share fell 7%, to $5.04. Visa is larger than Mastercard and is particularly dominant in debit cards, but Mastercard has been growing faster, especially in Europe. Both have been smaller for years than China's UnionPay.\n\nAnalysts call these networks card rails, and the bank-controlled Automated Clearing House, or ACH, system for money transfers, bank rails. Many upstart players operate as digital wallets that depend in part on card or bank rails, or else use cryptocurrency. Kelly says the payments industry is filled with \"frenemies.\" For example, PayPal, the best-known digital wallet for online purchases, used to steer customers to cheaper ACH rather than Visa cards. Now, under a partnership, Visa gets equal footing with ACH, and PayPal makes inroads at stores using Visa's contactless mobile-payment technology.\n\nStocks in general trade at elevated valuations now, and growth stocks especially. Even so, Visa's price of 38 times this fiscal year's estimated earnings suggests that investors feel confident about its future role in payments, and its return to speedy growth. This fiscal year, earnings-per-share growth is pegged at just 9%, as the pandemic continues and then hopefully lifts. Early estimates for next year's growth put it at 24%. Beyond the tap-to-pay rollout and spending rebound, Visa is hoping to win over push transactions that use bank rails -- like tuition, rent, and wages. Banks will have a say, but they make good money on card businesses, and ACH is a nonprofit.\n\nChina is a wild card. Visa doesn't have a license to operate there domestically, so it partners with local players like AliPay to create new uses for travelers' Visa cards. But phase one of the trade deal between China and the Trump administration is supposed to open China to foreign payment companies like Visa. We'll see. For now, Kelly calls cash his biggest competitor. I'm Purelling just thinking about all that market share up for grabs.\n\nThe stock market is said to be driven by the battle between greed and fear. Right now, it looks more like hope and stupidity. The vaccine results announced this past week by Pfizer (PFE) are the best hope yet that the pandemic's end is in sight. That vaccine and perhaps others could receive emergency-use authorization within the next two months, and much of America could receive needle pokes in the first half of next year. Life could look normal by Thanksgiving 2021.\n\nBut the virus is raging like never before. We've turned simple advice -- keep a bit of distance or wear masks -- into a culture war. And Washington is distracted. That President Donald Trump is denying clear election results is folly. That an overwhelming majority of his party's senators won't speak up is dangerous. If it doesn't damage our democracy, it could kill us by the tens of thousands this winter from inaction on the virus. And it could cripple our economy again.\n\n\"Sell the vaccine,\" wrote Bank of America in an investment strategy note on Friday. It means to reduce holdings of risky assets ahead of what could be a difficult stretch before the economy reopens in earnest. Like Goldman Sachs, BofA is recommending a barbell strategy, with cyclicals on one side, but not distressed ones, and the sort of virus-immune tech stocks that have been flourishing all along on the other.\n\nI know; I dipped too far into politics there for a moment. Media bias, a few will say, and they're right. I don't endorse politicians or parties, but secretly, I'm in the tank for science and representative democracy.\n\n**Source: Barron's Article**",
        "subreddit": "stocks",
        "title": "Pandemic or Not, Visa Remains a Growth Stock Stalking Its Biggest Rival, Cash",
        "url": "https://www.reddit.com/r/stocks/comments/jtrewh/pandemic_or_not_visa_remains_a_growth_stock/",
        "created": 1605339898.0
    },
    {
        "author": "CrazedCookie",
        "created_utc": 1605349904,
        "id": "ju00pm",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "The last couple of weeks I have seen some negative bias towards some Chinese stocks. For those who consider selling their Chinese stocks, I want to clarify a couple of points. Here goes.\n\nChina has already overtaken the U.S. as the biggest economy in the world, as they tackled the pandemic accordingly and are back on a strong growth path. IMF already stated that China’s economy is one-sixth larger than America’s. And the gap will only become bigger as time goes.  \n   \n\\--&gt; **But what about the anti-monopoly laws that will be put in place?**  \n Both Alibaba, JD and Tencent can still grow and coincide within the immense Chinese and Asian market. Moreover, future growth will be primarily driven by growth on other continents. Alibaba is trying to penetrate the European market and can wage a price war with Amazon. What’s more: the Trump tariffs that were implemented under the guise of his ‘America first’ programme, will most likely be reversed by president elect Joe Biden. Which leaves export-driven companies, such as Alibaba, bigger margins on product shipments. Biden is a known globalist and looks to renew relationships with the Chinese government. Because America might not be the biggest economy anymore, they still want to be the global policeman.  \n \n\n**--&gt; And what about the CCPs beef with Jack Ma**  \n I do think it is a bit naïve to think that this will affect BABA long term. We know some of the facts. First, Jack Ma went ‘out of line’ and offended CCP officials. Later, President Xi personally halted the ANT IPO. This is a prime example of big stick diplomacy. Either Ma dials it down, or the CCP will find someone who will. Don’t just assume the biggest Chinese company will fall with the potential fall of Jack Ma.  \n \n\n**EV stocks are overvalued?**  \nChina is both the largest manufacturer and both buyer of electric vehicles in the word. Furthermore, China’s middle class has been among the fastest growing in the world: more than half of the population can now be categorised as middle or upper class. This also drives demand for middle and upper segment EV vehicles, such as being offered by NIO, XPENG, LI and BYD. \n\nIt’s also no secret that the CCP favours domestic brands (i.e. the subsidy offered when buying an EV car with battery swapping system like that of NIO). Combined with their directive of reaching 25% EV by 2025 makes for a powerful catalyst.  \n   \n\\--&gt; **As traditional brands develop hybrids and full EVs, will that halt NIO’s expansion into Europe and the US?**  \n Not necessarily. The neophobia on EVs has almost fully disappeared. Subsequently, fear from Chinese products (which has been a problem in Europe and the US for a good amount of time) is fading away at a good pace. EV cars have become widely accepted and as the world moves away from fossil fuels, and the Chinese brands are further along the line than most traditional manufacturers.\n\nBy the way, a new brand still leaves something to the imagination. In Europe, certain brands have a certain connotation. Like BMW is a brand for snobs. But newer brands? They can still define themselves in a refreshing way.   \n\n\nDisclaimer: this is purely my perspective, make of it what you will. If you're from the US and have a subconscious feeling of patriotism that's fine. But macro economics don't comply with the way we feel.",
        "subreddit": "stocks",
        "title": "Negative bias towards Chinese stocks? No need",
        "url": "https://www.reddit.com/r/stocks/comments/ju00pm/negative_bias_towards_chinese_stocks_no_need/",
        "created": 1605378704.0
    },
    {
        "author": "wilstreak",
        "created_utc": 1604410631,
        "id": "jnadi7",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": "https://www.bloomberg.com/news/articles/2020-11-03/jack-ma-s-ant-group-ipo-suspended-by-shanghai-star-board\n\nFor whatever reason, the biggest IPO in this year will be suspended. Not sure for the actual reason.\n\nMaybe it has something to do with US election as the government want to prepare for possible policy change?",
        "subreddit": "investing",
        "title": "Ant Financial IPO Suspended",
        "url": "https://www.reddit.com/r/investing/comments/jnadi7/ant_financial_ipo_suspended/",
        "created": 1604439431.0
    },
    {
        "author": "KingDahab",
        "created_utc": 1605564185,
        "id": "jvg9j5",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": "Alibaba has a secondary listing (BABAF), which I invested in back then because it's much cheaper than its primary listing (BABA). At the time of this post, the BABAF is $32.84 per stock while BABA is $258.31 per stock.\n\nI thought I made a smart decision until I talked with my friend and he showed me the news and the recent events in China regarding Jack Ma, Alibaba Group, and his newer company (Ant) being halted by the president.\n\nCurrently, it doesn't look so good. I've been reading books regarding history and governance, when an authoritarian doesn't like a businessman; it usually doesn't end well for the company. (Side note: NIO which I've invested in and a lot of people are positively betting on is backed by the Chinese government and it's doing well, this shows a pattern and possibly how to predict a stock of a company based on its relationship with its authoritarian government).\n\nSo, with the current performance and recent events: Do you think that it's time to sell whatever stocks we have in Alibaba OR do you think Jack Ma will prevail and we'll stop losing money (and maybe BABAF can grow as BABA did)?",
        "subreddit": "stocks",
        "title": "Investing in Alibaba Group... is it time to sell or stay?",
        "url": "https://www.reddit.com/r/stocks/comments/jvg9j5/investing_in_alibaba_group_is_it_time_to_sell_or/",
        "created": 1605592985.0
    },
    {
        "author": "Omg_Keynes",
        "created_utc": 1606131653,
        "id": "jzg3og",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": " \n\n* China's move to draft rules aimed at preventing monopolistic behavior by internet platforms is \"[timely and necessary](https://seekingalpha.com/pr/18096275-alibaba-chairman-says-chinas-antitrust-rules-necessary?source=content_type%3Areact%7Cfirst_level_url%3Anews%7Csection%3Amain_content%7Cbutton%3Abody_link)\", says Alibaba Group (NYSE:[BABA](https://seekingalpha.com/symbol/BABA?source=content_type%3Areact%7Cfirst_level_url%3Anews%7Csection%3Amain_content%7Cbutton%3Abody_link)) CEO Daniel Zhang.\n* “Supervision  allows platform enterprises to not only develop well on their own, but  also helps the sustainable and healthy development of the entire society  and creates innovation,” said Zhang at the World Internet Conference.\n* Zhang  said Chinese internet companies have moved to the forefront with the  help of government policies, but regulations need to evolve.\n* The  government-organized annual event from Nov. 23-24 takes place as the  country's internet giants including Alibaba, Tencent Holdings ([OTCPK:TCEHY](https://seekingalpha.com/symbol/TCEHY?source=content_type%3Areact%7Cfirst_level_url%3Anews%7Csection%3Amain_content%7Cbutton%3Abody_link)) and Meituan ([MEIT](https://seekingalpha.com/symbol/MEIT?source=content_type%3Areact%7Cfirst_level_url%3Anews%7Csection%3Amain_content%7Cbutton%3Abody_link)) face increasing government scrutiny.\n* Zhang succeeded Ma in 2019 as Alibaba’s chairman, and concurrently holds the role of CEO.\n* Earlier  this month the planned $37B share market listing of Alibaba affiliate  Ant Group was suspended after regulators warned its lucrative online  lending business faced tighter scrutiny.\n* That followed a speech in which Ma criticized regulators as backward and an obstacle to business development.\n* The  termination of Ant’s IPO prompted suggestions that Beijing might be  punishing Ma while also tightening controls. Ma has yet to publicly  comment on the matter.\n* The move to regulate monopolistic power of China’s technology giants sparked a sell-off in Chinese internet stocks.\n*  Alibaba's e-commerce marketplaces and payment services are also  expected to face greater oversight under the draft rules to prevent  market domination or adoption of methods aimed at blocking fair  competition.\n* Shares +2% premarket.\n\n[https://seekingalpha.com/news/3638562-alibaba-group-ceo-backs-chinas-antitrust-rules-says-timely-and-necessary](https://seekingalpha.com/news/3638562-alibaba-group-ceo-backs-chinas-antitrust-rules-says-timely-and-necessary)",
        "subreddit": "investing",
        "title": "Alibaba Group CEO backs China's antitrust rules, says 'timely and necessary'",
        "url": "https://www.reddit.com/r/investing/comments/jzg3og/alibaba_group_ceo_backs_chinas_antitrust_rules/",
        "created": 1606160453.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1604437457,
        "id": "jnit0j",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Tuesday, November 3, 2020**\n\nStocks added to Monday’s gain in the final market session before the US presidential election. Market participants weighed a host of different outcomes for the election against the backdrop of the ongoing coronavirus pandemic, economic strain, and heightened social unrest. \n\nThe indices traded choppily but ended the day in the green. The tech-heavy Nasdaq (QQQ) finished 1.73% up, the S&amp;P 500 (SPY) finished 2.73% up as well, and the Dow Jones (DIA) performed the best, up 2.02%.\n\nRegardless of who wins the presidency, the result is very likely to drive short-term volatility, especially given the political divide and social unrest present in the United States. Any potential outcome from the election is likely to disappoint a large portion of the population, leading to uncertainty and anxiety that could inject volatility into the market. For example, after the 2016 election, the S&amp;P 500 future slumped around 5%. The index went on to recuperate these declines to finish 1% higher by the end of the first post-Election session. Neil Shearing, chief economist for Capital Economics said, “The experience of 2016 suggests that investors should be careful about taking strong positions on political outcomes and, worse, mechanically translating those to market outcomes.”\n\nGiven the coronavirus pandemic, there has been a surge of early and mail-in voters this year. This could potentially mean that the results of the elections may not become until later on in the week, an outcome sure to negatively affect the markets. According to the US Elections Project,as of this morning, more than 100 million Americans cast their votes early, more than ⅔ the total numbers of voters during the 2016 election. According to Yahoo Finance, if turnout like this holds up, this election could have the highest voter turnout in 100 years. According to Quinnipiac’s final pre-election poll, Joe Biden has an edge in the national polls. However, when looking at key swing states, Biden’s lead is considerably narrower.\n\nThe US Senate is also holding elections this year. The combination of which party takes control of the White House and Senate is another issue of major concern. According to Blackrock Analysts, “We believe a Democratic sweep could pave the way for a new round of large-scale fiscal stimulus and boost spending on clean energy, transport, and housing. It may also bring higher taxes for companies and the wealthy. A Biden win with a Republican-controlled Senate would likely lead to much less fiscal stimulus, little public investment, and no major tax changes,” the analysts said. Fiscal stimulus under a second Trump term may lie somewhere between these two scenarios, we believe, while public investment could be similarly small as under a Biden divided government.”\n\n**Highlights**\n\n* McKesson Corp (MCK) on Tuesday said it and two other major U.S. drug distributors could be expected to pay up to $21 billion under a new proposal to resolve thousands of lawsuits alleging they helped fuel the U.S. opioid crisis.\n* Twitter (TWTR) said in a filing with the Securities and Exchange Commission that the company's board of directors had reviewed CEO Jack Dorsey's leadership and will allow him to remain as CEO. The company also announced a stock buyback plan worth around $2 billion. The price action of the stock should be interesting moving forward.\n* The Shanghai Stock Exchange suspended Ant's blockbuster IPO late Tuesday, a day after four regulatory agencies summoned Mr. Ma and the company's top two executives to a closed-door meeting. The company said a concurrent Hong Kong listing would also be suspended. Ant plans to return the funds it has collected from investors who subscribed to its IPO, which had been on track to raise at least $34.4 billion in total. \"Ant Group apologizes for the trouble this has caused investors,\" it said in a post on Chinese social media. Alibaba (BABA) was down 8% today in sympathy.\n* Amedisys (AMED) target raised by Barclays from $290 to $298 at OVERWEIGHT. Stock currently around $254.\n* Estee Lauder (EL) with multiple positive target increases. Stock currently around $223.\n   * Deutsche Bank (DB) from $258 to $259 at BUY\n   * Morgan Stanley (MS) from $240 to $260 at OUTPERFORM\n* Horizon Therapeutics (HZNP) target raised by BMO Capital from $105 to $110 OUTPERFORM. Stock currently around $73.\n* Jazz Pharma (JAZZ) with multiple target increases. Stock currently around $147.\n   * SVB Leerink from $194 to $202 OUTPERFORM \n   * Barclays from $225 to $233 OUTPERFORM \n   * Royal Bank of Canada from $170 to $180 OUTPERFORM \n* Leidos (LDOS) target raised by Credit Suisse from $120 to $131 at OUTPERFORM. Stock currently around $85.\n* Mercado Libre (MELI) target raised by Credit Suisse to $1,484 at OUTPERFORM. Stock currently around $1215 and has been a monster this year. Ecommerce company in Latin America\n* Inspire Medical (INSP) with two target increases. Stock currently around $122.\n   * Robert W. Baird from $130 to $160 OUTPERFORM \n   * Piper Sandler from $137 to $147 OVERWEIGHT\n   * SVB Leerik from $150 to $170 OUTPERFORM \n* Big Banks did really well today, outperformed the market.\n\n*“Whatever the mind of a person can conceive and believe, it can achieve” -*Napoleon Hill",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Tuesday, Nov 3, 2020. Please enjoy!",
        "url": "https://www.reddit.com/r/StockMarket/comments/jnit0j/here_is_a_market_recap_for_today_tuesday_nov_3/",
        "created": 1604466257.0
    },
    {
        "author": "Important_Diamond842",
        "created_utc": 1605970752,
        "id": "jyc2vf",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "Ok so who the fuck looks and Jack Ma and doesnt feel instant trust and comfortability in placing a fucking YOLO on that mans company?\n\n&amp;#x200B;\n\nHonestly though, we have Alibaba coming up on the holiday and theyre crushing sales as they did Singles day and EPS. Hop on before we take off. \n\n&amp;#x200B;\n\n[https://money.cnn.com/quote/forecast/forecast.html?symb=BABA#:\\~:text=The%2054%20analysts%20offering%2012,the%20last%20price%20of%20270.67](https://money.cnn.com/quote/forecast/forecast.html?symb=BABA#:~:text=The%2054%20analysts%20offering%2012,the%20last%20price%20of%20270.67).\n\n&amp;#x200B;\n\nAlibaba is coming off bullshit news of Ant Fin and their stock dropped to a decent low last week - i bought in $275 strike 1/15 c and its looking right. When do I buy out? im up almost 80% and i have like 5 calls on BABA into April",
        "subreddit": "wallstreetbets",
        "title": "DD on BABA",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jyc2vf/dd_on_baba/",
        "created": 1605999552.0
    },
    {
        "author": "pabsgu46",
        "created_utc": 1604891148,
        "id": "jqpoei",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "Watchlist 11-09-20 👀\n\nKeeping the list short due to the volatility of the market.\n\n$APVO – HUGE RUN!! AH went to the moon and PLUTO!!!! HIGH of Friday was $83.33; it ran four days in a row for 1200%+ Perfect scalp, if you can find a good entry. Be SUPER CAUTIONS. Make sure to check your indicators. \n\n$POLA  - Waiting for news and turning bullish on the 200 MACD. Could see a possible run to #.63 on the  61.8% Fibonacci chart.\n\n$BLNK -  ER are coming up and looking bullish uptrend to the Fibonacci chart  at $10.90 for some resistance, but if it goes above the $10.90 and finds support then it go up to $13.18.\n\n$TBLT - recently reported their revenue on amazon sales. They have ER coming up soon as well. They are projected to crush earnings.\n\n$IDEX - Cheap EV play. Currently bottomed. 50MA could bounce off 200MA. And hit a serious run. Technicals are aligned.\n\n$SNDL – A favorite marijuana stock. Has been running under all the MA (20,50, 100, 200). Did make a nice run to $0.53. Again find a good entry and get out. \n\n$RKT has ER tomorrow and I fully expect them to blow the numbers out of the water and beat expectations by 50+ %\n\n$GEVO – Running on an uptrend on the 200 MA. Looking like it could go towards the Fibonacci chart 61.8% at $1.23. \n\nOnce AGAIN Devil’s lettuce Backburners: $TLRY $HEXO $ ACB $APHA $OGI $VFF $AMRS $GRWG $CRON $CGC\n\nBackburners: $WAFU $PRPH $GBX $PLUG $FCEL $PLM $IRMN $SALM $PECK $OEG",
        "subreddit": "RobinHoodPennyStocks",
        "title": "Watchlist 11-09-20 👀",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/jqpoei/watchlist_110920/",
        "created": 1604919948.0
    },
    {
        "author": "Sablac",
        "created_utc": 1604237221,
        "id": "jm271u",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "I know, another moron asking for advice. But I would really appreciate it. I have about $8000 to invest and currently I've planned to invest in BABA, FB and V tomorrow.  \n\n\nBABA: 10 shares  \nFB: 10 shares  \nV: 10 shares  \n\n\nAm I completely lost? Should I invest in other stocks other than the ones listed?",
        "subreddit": "stocks",
        "title": "BABA, AAPL, FB, V or MA",
        "url": "https://www.reddit.com/r/stocks/comments/jm271u/baba_aapl_fb_v_or_ma/",
        "created": 1604266021.0
    },
    {
        "author": "AllinEmperor",
        "created_utc": 1605896184,
        "id": "jxubi3",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "BABA will go 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀 Nothing can stop Jack Ma boiiiiiiii ( sold ) new target 280c 11/27",
        "url": "https://i.redd.it/p78knr0csf061.jpg",
        "created": 1605924984.0
    },
    {
        "author": "Bolkonsky999",
        "created_utc": 1604707428,
        "id": "jpgk43",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "So Biogen rocketed from 240 to 330( peaked at around 360) on Thursday on hints/hopes of FDA approval for Aducanumab, its experimental drug for Alzheimer's. \n\n[https://www.cnbc.com/2020/11/04/biogens-stock-jumps-30percent-after-fda-staff-says-it-has-enough-data-to-support-approving-alzheimers-drug-.html](https://www.cnbc.com/2020/11/04/biogens-stock-jumps-30percent-after-fda-staff-says-it-has-enough-data-to-support-approving-alzheimers-drug-.html)\n\n**The stock was halted today** before the FDA announcement and has remained so all day. Turns out, FDA rejected it in a 8-1 vote today.\n\n[https://www.cnbc.com/2020/11/06/biogen-suffers-setback-after-alzheimers-drug-fails-to-win-support-from-fda-panel-.html](https://www.cnbc.com/2020/11/06/biogen-suffers-setback-after-alzheimers-drug-fails-to-win-support-from-fda-panel-.html)\n\n**Aducanumab, if approved, was supposed to bring in over $5 billion dollars a year in sale**, which is presumably why when it was rumored to be approved, the stock gained almost 30%. \n\nFurthermore, Biogen has been facing troubles with its multiple sclerosis drug Tecfidera, which brings a decent portion of its sales revenue every year. \n\n\"The Cambridge, MA-based company’s last-ditch efforts to stop a Mylan generic fell flat Thursday, as a federal appellate court denied Biogen an injunction in a ruling last month invalidating Biogen’s ‘514 patent for the multiple sclerosis drug. Had the patent not been wiped out, Biogen would have delayed generic competition until 2028.\"\n\n[https://endpts.com/biogens-last-ditch-injunction-to-protect-tecfidera-is-denied-paving-way-for-mylan-generic/](https://endpts.com/biogens-last-ditch-injunction-to-protect-tecfidera-is-denied-paving-way-for-mylan-generic/)\n\nIt seems inevitable that a generic version of Biogen’s best-selling Tecfidera will enter the market soon and you can read up on the drugs that are currently being developed by other companies, as this MS market is pretty big.  **Tecfidera pulled in $3.3 billion in the U.S. last year, a big chunk of it will be lost in the coming years** from the competition.\n\n&amp;#x200B;\n\nThe good news for us is that it already went up in hopes of the approval and they probably halted the stock to stop the panic selling, but insiders probably sold some already, but if there is still any meat left by Monday open, getting into puts one or two weeks out might be a good idea. Because they halted the stock today, I am hoping for a slower bleed on Monday, but rest assured, Biogen is in a lot of trouble for now.\n\n&amp;#x200B;\n\nTLDR: Biogen went up 30% on Thursday in hopes of an important drug approval, but on Friday, FDA rejected it. The stock was halted on Friday, so must tank on Monday and for the rest of the week. **BUY PUTS.**",
        "subreddit": "wallstreetbets",
        "title": "BIIB puts at Monday open.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jpgk43/biib_puts_at_monday_open/",
        "created": 1604736228.0
    },
    {
        "author": "pabsgu46",
        "created_utc": 1605667985,
        "id": "jw7p9i",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "Watchlist 11-18-20 👀\n\n$KZIA -  NEWS AH,  Kazia Presents Further Paxalisib Data At Sno, Confirming Earlier Positive Safety And Efficacy Signals In Glioblastoma Reached a HOD of $16.38 AH. Has found support $8.80. NO PT possible good scalp.\n\n $MDLY –  Today movement to third quarter earning report for 11/16. Short term bullish on the YTD. AH ran to the 200ma to $10.00 pass all the MA. Could see some more movement premarket.\n\nTECHNICALS:\n\n$UAVS - one white soldier reversal off oversold downtrend on 4hr StochRSI and KDJ (premarket gapper candidate) \n\n$WWR - deliberate bearish harami candlestick pattern. I feel is heavy manipulation. Basically the run was completely overtook by market makers. Expect heavy manipulation moving forward but tremendous upside potential on a long hold with analysts PTs of $150+ \n\n$SPR - recently given PT of $29 yet continues to run bullish with 52 week high of $92.81 and a gap being filled to $36.83 with current price at $34.35 at the close of AH trading.\n\n$POLA – Cup handle bullish uptrend reversal pattern on the descending wedge(handle) \n\n$TTNP - post ER run continuation \n\n$UONEK &amp; $UONE -  BIG Insider buy by the CEO 274K shares.\n\n$CARV - getting pumped by social media influencers PT by $10.\n\n$SAVA - oversold post offering announcement $8 and under is a steal.\n\n$NAKD - facing delisting soon. Dead cat bounce in affect\n\nBackburners  $FUBO $NETE $NVIV $MARA $RIOT $PLTR $DNKG $MOGO",
        "subreddit": "pennystocks",
        "title": "Watchlist 11-18-20 👀",
        "url": "https://www.reddit.com/r/pennystocks/comments/jw7p9i/watchlist_111820/",
        "created": 1605696785.0
    },
    {
        "author": "gotsome4yerboi",
        "created_utc": 1606252722,
        "id": "k0e0o6",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "Listen up ya boneheads\n\nIdk how many more retards like me gotta write up the same shit but heres the last chance you have to get off your wife’s boyfriends couch. BABA is a fucking steal at these levels even after its late day retard strength run into close today. Jack ma has bent the knee, Biden on his way in means we’ll be on our way to rolling around with china in bed, without boring you with TA several indicators showing extremely bullish divergence THIS SHIT BOUT TO POP. \n\n11/27 300c",
        "subreddit": "wallstreetbets",
        "title": "BABA 300 EOW",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k0e0o6/baba_300_eow/",
        "created": 1606281522.0
    },
    {
        "author": "veilwalker",
        "created_utc": 1605640188,
        "id": "jvz5xn",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "BABA getting beat up. Knife catching time, when?",
        "subreddit": "wallstreetbets",
        "title": "Jack Ma?!?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jvz5xn/jack_ma/",
        "created": 1605668988.0
    },
    {
        "author": "picuron",
        "created_utc": 1604884790,
        "id": "jqnzvk",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "The auto-mod will automatically remove my submission if I say the \"RMP\" words, but here are the results:\n\n&amp;#x200B;\n\n    OTHER STOCKS has an allocation of 33.75%\n    AAPL has an allocation of 7.56%\n    TSLA has an allocation of 5.94%\n    MSFT has an allocation of 5.75%\n    NVDA has an allocation of 3.5%\n    NIO has an allocation of 3.33%\n    VOO has an allocation of 3.29%\n    AMZN has an allocation of 3.11%\n    VTI has an allocation of 2.57%\n    QQQ has an allocation of 2.47%\n    AMD has an allocation of 2.35%\n    ICLN has an allocation of 1.38%\n    SQ has an allocation of 1.36%\n    CASH has an allocation of 1.27%\n    BABA has an allocation of 1.26%\n    FB has an allocation of 1.06%\n    DIS has an allocation of 1.06%\n    SPY has an allocation of 0.93%\n    XLK has an allocation of 0.88%\n    KO has an allocation of 0.66%\n    WMT has an allocation of 0.58%\n    VGT has an allocation of 0.58%\n    GOOGL has an allocation of 0.55%\n    V has an allocation of 0.53%\n    VT has an allocation of 0.44%\n    CRM has an allocation of 0.41%\n    A has an allocation of 0.4%\n    ETSY has an allocation of 0.4%\n    BYND has an allocation of 0.39%\n    MA has an allocation of 0.38%\n    T has an allocation of 0.33%\n    INTC has an allocation of 0.32%\n    JPM has an allocation of 0.31%\n    PINS has an allocation of 0.29%\n    SBUX has an allocation of 0.28%\n    SHOP has an allocation of 0.28%\n    CRWD has an allocation of 0.28%\n    RTX has an allocation of 0.27%\n    GOOG has an allocation of 0.24%\n    DAL has an allocation of 0.24%\n    JNJ has an allocation of 0.24%\n    MCD has an allocation of 0.24%\n    PYPL has an allocation of 0.22%\n    BAC has an allocation of 0.2%\n    CVX has an allocation of 0.19%\n    BRK.B has an allocation of 0.18%\n    GOLD has an allocation of 0.18%\n    EA has an allocation of 0.17%\n    WM has an allocation of 0.17%\n    PEP has an allocation of 0.16%\n    SWKS has an allocation of 0.16%\n    WFC has an allocation of 0.16%\n    AXP has an allocation of 0.15%\n    BA has an allocation of 0.15%\n    HD has an allocation of 0.15%\n    PFE has an allocation of 0.15%\n    COST has an allocation of 0.14%\n    LOW has an allocation of 0.14%\n    QCOM has an allocation of 0.14%\n    O has an allocation of 0.14%\n    IWF has an allocation of 0.14%\n    GE has an allocation of 0.13%\n    NFLX has an allocation of 0.13%\n    CHWY has an allocation of 0.13%\n    VUG has an allocation of 0.13%\n    XOM has an allocation of 0.12%\n    NKE has an allocation of 0.12%\n    FVRR has an allocation of 0.12%\n    CCL has an allocation of 0.11%\n    DE has an allocation of 0.11%\n    TWTR has an allocation of 0.1%\n    PLTR has an allocation of 0.1%\n    SEDG has an allocation of 0.1%\n    AVGO has an allocation of 0.09%\n    CAG has an allocation of 0.09%\n    DFS has an allocation of 0.09%\n    KR has an allocation of 0.09%\n    SPG has an allocation of 0.09%\n    SNE has an allocation of 0.09%\n    ABBV has an allocation of 0.08%\n    ATVI has an allocation of 0.08%\n    AMGN has an allocation of 0.08%\n    CSCO has an allocation of 0.08%\n    DOW has an allocation of 0.08%\n    PG has an allocation of 0.08%\n    RCL has an allocation of 0.08%\n    NOW has an allocation of 0.08%\n    TGT has an allocation of 0.08%\n    VZ has an allocation of 0.08%\n    TTD has an allocation of 0.08%\n    UBER has an allocation of 0.08%\n    ZM has an allocation of 0.08%\n    AAL has an allocation of 0.07%\n    HAS has an allocation of 0.07%\n    PPL has an allocation of 0.07%\n    UAL has an allocation of 0.07%\n    BMY has an allocation of 0.06%\n    CMCSA has an allocation of 0.06%\n    GM has an allocation of 0.06%\n    HON has an allocation of 0.06%\n    MPC has an allocation of 0.06%\n    NCLH has an allocation of 0.06%\n    REGN has an allocation of 0.06%\n    TTWO has an allocation of 0.06%\n    LULU has an allocation of 0.06%\n    FDX has an allocation of 0.05%\n    MU has an allocation of 0.05%\n    SNAP has an allocation of 0.05%\n    SONY has an allocation of 0.05%\n    BBY has an allocation of 0.04%\n    CVS has an allocation of 0.04%\n    EL has an allocation of 0.04%\n    KHC has an allocation of 0.04%\n    REG has an allocation of 0.04%\n    LUV has an allocation of 0.04%\n    VRTX has an allocation of 0.04%\n    VTV has an allocation of 0.04%\n    MO has an allocation of 0.03%\n    ADSK has an allocation of 0.03%\n    CDNS has an allocation of 0.03%\n    CI has an allocation of 0.03%\n    IBM has an allocation of 0.03%\n    MLM has an allocation of 0.03%\n    NEE has an allocation of 0.03%\n    ODFL has an allocation of 0.03%\n    ROST has an allocation of 0.03%\n    TXN has an allocation of 0.03%\n    ULTA has an allocation of 0.03%\n    UAA has an allocation of 0.03%\n    UNH has an allocation of 0.03%\n    ACB has an allocation of 0.03%\n    CGC has an allocation of 0.03%\n    ACN has an allocation of 0.02%\n    ADBE has an allocation of 0.02%\n    AMT has an allocation of 0.02%\n    CAT has an allocation of 0.02%\n    DUK has an allocation of 0.02%\n    F has an allocation of 0.02%\n    GPS has an allocation of 0.02%\n    HRL has an allocation of 0.02%\n    HPQ has an allocation of 0.02%\n    LMT has an allocation of 0.02%\n    L has an allocation of 0.02%\n    MGM has an allocation of 0.02%\n    STX has an allocation of 0.02%\n    UNP has an allocation of 0.02%\n    WYNN has an allocation of 0.02%\n    XRX has an allocation of 0.02%\n    MRNA has an allocation of 0.02%\n    IVV has an allocation of 0.02%\n    FNILX has an allocation of 0.02%\n    MMM has an allocation of 0.01%\n    ABT has an allocation of 0.01%\n    AFL has an allocation of 0.01%\n    AMAT has an allocation of 0.01%\n    CBRE has an allocation of 0.01%\n    CMA has an allocation of 0.01%\n    CTVA has an allocation of 0.01%\n    FANG has an allocation of 0.01%\n    DG has an allocation of 0.01%\n    EOG has an allocation of 0.01%\n    EQIX has an allocation of 0.01%\n    IT has an allocation of 0.01%\n    IP has an allocation of 0.01%\n    J has an allocation of 0.01%\n    LHX has an allocation of 0.01%\n    LDOS has an allocation of 0.01%\n    LEN has an allocation of 0.01%\n    LLY has an allocation of 0.01%\n    LYV has an allocation of 0.01%\n    MAR has an allocation of 0.01%\n    NOC has an allocation of 0.01%\n    PM has an allocation of 0.01%\n    PLD has an allocation of 0.01%\n    SLB has an allocation of 0.01%\n    SO has an allocation of 0.01%\n    SWK has an allocation of 0.01%\n    SYF has an allocation of 0.01%\n    TSN has an allocation of 0.01%\n    WBA has an allocation of 0.01%\n    XLNX has an allocation of 0.01%",
        "subreddit": "stocks",
        "title": "I used a web-scraper and Python to compile the average portfolio of the quarterly thread:",
        "url": "https://www.reddit.com/r/stocks/comments/jqnzvk/i_used_a_webscraper_and_python_to_compile_the/",
        "created": 1604913590.0
    },
    {
        "author": "InfamousBreadfruit99",
        "created_utc": 1605625889,
        "id": "jvumaz",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "You love to see it: 🦄\n\n* [GUGGENHEIM CAPITAL LLC](https://whalewisdom.com/filer/guggenheim-capital-llc) : $499,180,000 - 3.61% - 2nd largest position\n* [BAUPOST GROUP LLC](https://whalewisdom.com/filer/baupost-group-llc-ma) : $397,075,000 - 4.29 - 6th largest position\n* [SOROBAN CAPITAL PARTNERS LP](https://whalewisdom.com/filer/soroban-capital-partners-llc) : $256,964,000 - 2.5% - 14th largest position\n* [WELLS FARGO &amp; COMPANY](https://whalewisdom.com/filer/wells-fargo-co-mn) $222,398,0000 - largest new position\n* [PRICE T ROWE ASSOCIATES INC](https://whalewisdom.com/filer/price-t-rowe-associates-inc-md) $174,318,000 \n* [MILLENNIUM MANAGEMENT LLC](https://whalewisdom.com/filer/millennium-management-l-l-c) $119,711,000\n* [CITADEL ADVISORS LLC](https://whalewisdom.com/filer/citadel-advisors-llc) $49,170,000\n\nFollow the yellow brick road for the DD and remember to cast your ballot for the true unicorn king. \n\n[https://whalewisdom.com/stock/psth](https://whalewisdom.com/stock/psth)",
        "subreddit": "wallstreetbets",
        "title": "$PSTH Institutional Holding's Highlights Review",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jvumaz/psth_institutional_holdings_highlights_review/",
        "created": 1605654689.0
    },
    {
        "author": "Adagio-Spirited",
        "created_utc": 1605124958,
        "id": "jsfiuf",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Yahoo etc reported \"Alibaba Singles Day Sales (aka 11:11, Nov 11) Hit Record High $75 Billion\" &gt; Bullish.\n\nReally? Check this out...\n\n1 See news in Chinese for context -- it sounded really ugly.\n\n\"Worst Nov 11 (China's equivalent of \"Prime Day/Black Friday\") in history: Jack Ma &amp; buddies LOST $2 trillion in 2 days\" [https://finance.sina.com.cn/tech/2020-11-11/doc-iiznezxs1326859.shtml](https://finance.sina.com.cn/tech/2020-11-11/doc-iiznezxs1326859.shtml) ... Why the contradiction? *NB: Yahoo and Wall Street have a stake in Alibaba?*\n\n*Google more using Chinese characters 马云 = Jack Ma = Mǎ Yún (马云)*\n\nKeypoint: Authority deliberately imposed many restrictions on labeling and what can be sold on Alibaba's Taobao on Nov 11... To understand this Commie strategy, read \"China tightens restrictions on Australian exports\" [https://apnews.com/article/virus-outbreak-beijing-global-trade-australia-south-china-sea-ea95bc519eb9bf40172edc626caf5537](https://apnews.com/article/virus-outbreak-beijing-global-trade-australia-south-china-sea-ea95bc519eb9bf40172edc626caf5537) ... same idea.\n\n2. You must have heard of \"China drafts new antitrust guideline to rein in tech giants\" by now. What's the big deal? US and the west did the same thing (to MSFT, GOOG) ... nothing happened.\n\nWell, you must have forgotten conviction rate in China is literally 99%. That's the difference.\n\n3. Ant Financials IPO - The politics behind the suspension isn't something Joe can understand.\n\nFirst, the timing - why IPO suspended on the eve of the debut? This is directly due to the 5th China Communist Party plenum that ended just before Jack Ma &amp; co were told their $3 billion Ant Financials IPO has been suspended.\n\nClue: No heir apparent as Xi Jinping reveals top leadership.\n\nStill wondering what's happening? Here &gt; The Boss wanna make sure all parties are obsessed with the world's largest and sauciest IPO, happy, and create no trouble during the party plenum, which is the \"Bilderberg\" of China that may give birth to China's new leader (*against Xi Jinping who wanna rule forever*)\n\nSecond, non-bank money-lending is considered loan-sharking no matter how hard you try masqurade the sin as \"fintech\" -- no different from trying to bypass the Fed with any other form of money (just google what happened to those who tried...). This is not to say China is shutting down Ant Financials becos Jack Ma created a new currency, it's becos Ant's microlending is seen as a timebomb for CCP.\n\nHow so? \n\nGoogle keywords like \"China P2P Lending Suicide Scandal\", you'd see why did China cracked down the so called hitech \"P2P Lending\" industry that left behind nothing good except social ills like suicides, bankruptcies, etc (many still listed as pennystocks on NASDAQ like KXIN, WEI, etc. -- all were given 2 years to wind down and do something else)... Ant Financials is no difference for CCP believes Jack Ma &amp; co. will leave behind the same mess so big that it may just collapse the CCP.\n\nYou see?\n\nPlus, big-mouthed Jack Ma actually told this guy [https://en.wikipedia.org/wiki/Wang\\_Qishan](https://en.wikipedia.org/wiki/Wang_Qishan) that China regulators are dinosaur that neither understand nor capable of regulating \"fintech\".\n\nTL;DR: Jack Ma is history -- He has been personally targeted to send out a clear message: \"Who's The Boss\" (just like why Trump fired Esper the other day). \"Xi Jinping going after Jack Ma's head\" [https://www.soundofhope.org/post/439876](https://www.soundofhope.org/post/439876)\n\n*What do you make up of the situation?*",
        "subreddit": "stocks",
        "title": "The end is nigh for Jack Ma, Alibaba, Ant Financials?",
        "url": "https://www.reddit.com/r/stocks/comments/jsfiuf/the_end_is_nigh_for_jack_ma_alibaba_ant_financials/",
        "created": 1605153758.0
    },
    {
        "author": "Newyorkntilikina",
        "created_utc": 1605280747,
        "id": "jthd6l",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Can anyone summarize the context of why Xi JinPing personally shut down the IPO of Ant Group IPO?\n\nIn an era where China is looking to overtake the United States, wouldn't Ant Group help his cause? Hundreds of Millions are already shopping on Alibaba, JD, PDD etc... Not to mention the exposure of Tencent and of its million of users. So wouldn't Ant Group further spread the dominance of Chinese tech in the United States and globally?\n\nI really don't understand this whole situation. What is Xi JinPing's reasoning? And is this a warning to all other growing Chinese tech companies like JD, PDD, NIO, Tecent, etc...?",
        "subreddit": "stocks",
        "title": "Jack Ma and ANT Group IPO Situation",
        "url": "https://www.reddit.com/r/stocks/comments/jthd6l/jack_ma_and_ant_group_ipo_situation/",
        "created": 1605309547.0
    },
    {
        "author": "QuasiPinoy",
        "created_utc": 1605640395,
        "id": "jvz8dp",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "November 17, 2020 | Reps. Sherrill, McKinley Lead Bipartisan Legislation to Increase Access to Telehealth Services\n\nhttps://sherrill.house.gov/media/press-releases/reps-sherrill-mckinley-lead-bipartisan-legislation-increase-access-telehealth\n\n---\n\nLegislation expands practitioners eligible for Medicare reimbursement for telehealth services\n\nWASHINGTON, DC -- Representatives Mike Sherrill (NJ-11), Rep. David McKinley (WV-01), Rep. Brian Fitzpatrick (PA-01), Rep. Denver Riggleman (VA-05), Rep. Joyce Beatty (OH-03), Rep. Andre Carson (IN-07), Rep. Glenn Thompson (PA-15), Rep. Andy Kim (NJ-03), Rep. Joseph Morelle (NY-25), Rep. Bobby Rush (IL-01), Rep. Albio Sires (NJ-08), Rep. Kevin Hern (OK-01), Rep. William Timmons (SC-04), and Rep. Paul Tonko (NY-20) introduced bipartisan legislation this week to increase access to telehealth services. The Expanded Telehealth Access Act expands the list of the providers eligible for Medicare reimbursement for providing care via telehealth. \n\n“The use of telehealth services during this crisis has demonstrated the critical role technology can play in improving health equity,” said Rep. Sherrill. “No one should have to go without care when a video or phone conversation with a health care provider could mean quicker, safer medical attention.”\n\nTo reduce risks associated with visiting medical providers during the coronavirus pandemic, the Centers for Medicare &amp; Medicaid Services expanded the types of health care providers who receive reimbursement for telehealth services. This legislation makes permanent the reimbursement eligibility for physical therapists, audiologists, occupational therapists, and speech language pathologists and permits the Secretary of Health and Human services to expand this list.\n\n**“Ensuring access to quality health care is more important now than ever. All too often people who live in rural communities in West Virginia don’t have access to the health care specialists they need,” said Rep. McKinley. “It is crucial that such access via telehealth not end abruptly once the public health emergency ends.”**\n\nAccording to the CDC, telehealth services have been particularly valuable for vulnerable populations, especially those with compromised immune systems or in rural areas far from a provider. The CDC also notes that expanded telehealth availability is likely to increase health equity. \n\n“COVID-19 has underscored the need to provide timely and reliable patient care through telehealth services,” said Rep. Riggleman. “I have been at the forefront of expanding telehealth during my time in Congress, and I am proud to be an original sponsor of this legislation that will expand access to telehealth services to rural and underserved communities. This bill will go a long way to remove barriers and bolster healthcare for both patients and providers.”\n\nThe Expanded Telehealth Access Act is supported by American Telehealth Association, the American Physical Therapy Association (APTA), the American Speech-Language-Hearing Association (ASLHA), the American Occupational Therapy Association (AOTA), the eHealth Initiative and Foundation, the Healthcare Information and Management Systems Society, Inc. (HIMSS), and the Personal Connected Health Alliance (PCHAlliance). \n\nThis summer, the American Telemedicine Association (ATA) laid out specific **policy priorities to ensure Medicare beneficiaries continue to access telehealth services even when the COVID-19 pandemic ends**. **One of these priorities is to give the Secretary of HHS the authority to expand the list of providers eligible to offer telehealth to their patients.**\n\n“This legislation removes unnecessary statutory barriers that restrict patients’ access to care and empower patients and their providers to decide on the best care options,” said Ann Mond Johnson, CEO of ATA. “As the only organization exclusively dedicated to the advancement of telehealth, the ATA commends Representatives Sherrill and McKinley for introducing the Expanded Telehealth Access Act.”\n\n“Waivers issued by CMS to allow occupational therapists and occupational therapy assistants to provide services to Medicare beneficiaries via telehealth during the COVID-19 pandemic have demonstrated the effectiveness of occupational therapy delivered through telehealth and the importance of removing barriers to care,” said AOTA President Wendy C. Hildenbrand, PhDP, MPH, OTR/L, FAOTA. “AOTA champions the bi-partisan efforts of Representatives Sherrill and McKinley to ensure that the provision of occupational therapy delivered via telehealth will remain an option for Medicare beneficiaries once the Public Health Emergency ends.” \n\n“The use of telehealth during the pandemic has helped ensure patient access to physical therapist services, helped minimize potential exposure to the virus, and provided an option for therapy clinics and their patients,” said APTA President Sharon L Dunn, PT, PhD. “It is critical for Congress to make this option permanent for Medicare patients. We applaud Rep. Sherrill for her leadership on this important bipartisan legislation with Rep. McKinley, and urge swift action on it.”\n\n“Permanent telehealth access to medically necessary audiology and speech-language pathology services is critical for America’s seniors who live in rural and underserved areas, and especially during the nation’s public health emergency,” said Theresa H. Rodgers, MA, CCC-SLP, 2020 President of ASHA. “ASHA thanks Representatives Mikie Sherrill and David McKinley for recognizing this critical need by introducing the Bipartisan Expanded Telehealth Access Act in the U.S. House of Representatives today. This bill will ensure Medicare beneficiaries permanent telehealth access to hearing, speech, language, swallowing, and cognition related health care services.”",
        "subreddit": "stocks",
        "title": "Bipartisan legislation pushed for telehealth services post-pandemic, affecting Teladoc (TDOC) and Amwell (AMWL)",
        "url": "https://www.reddit.com/r/stocks/comments/jvz8dp/bipartisan_legislation_pushed_for_telehealth/",
        "created": 1605669195.0
    },
    {
        "author": "kbbqking",
        "created_utc": 1606509156,
        "id": "k292om",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "$QS gains were cool today right?!\n\n$PSTH gains will be even bigger next week. On an short trading day $PSTH volume was 158% over average, Stripe acquisition imminent.\n\n[He wants STRIPE](https://youtu.be/gxqTwpWizw4)\n\n“...and I said that if you could own a royalty on people spending money like Visa or Mastercard, that’s the greatest business in the world. If that ever became a public company you would want to buy that company.”\n\n- Bill SPACkman\n\nMore DD from [@YoloCapitalMgmt](https://twitter.com/yolocapitalmgmt?s=21)\n\n12/18/20 $30c\n3/19/21 $30c\n\nLet’s get this bread 🚀",
        "subreddit": "wallstreetbets",
        "title": "Bill SPACkman - $PSTH Stripe Trendies 💰",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k292om/bill_spackman_psth_stripe_trendies/",
        "created": 1606537956.0
    },
    {
        "author": "wsb_gang",
        "created_utc": 1605240622,
        "id": "jtac6g",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "1. Market is forward looking.  As we are preparing for lock-down China is go full steam ahead.\n2.  All you hears are  🌈🐻 telling you that a crash is imminent.  I'm a certify  🌈🐻 and I'm telling you it will not be tomorrow.\n3. BABA name is not on the ban list\n4. ANT is till moving forward and the project numbers is through the roof.\n5. When we get out of quarantine, all the internet sellers will have to order their stuff from BABA because of \"supply chain\".\n6. Jackie Ma is a very shrew business man with a calculate move. We are going to start trade talk soon with China and you know that Jackie Ma little performance will make him very U.S friendly. I expect Biden team would like to talk to him before anyone else.",
        "subreddit": "wallstreetbets",
        "title": "🚀🚀🚀🚀🚀💵💵💵 BABA 0DTE CALLS TOMORROW💵💵💵🚀🚀🚀🚀🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jtac6g/baba_0dte_calls_tomorrow/",
        "created": 1605269422.0
    },
    {
        "author": "phillips47",
        "created_utc": 1606165782,
        "id": "jzqkkg",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": " TL;DR at bottom\n\nFirst off I need to start by saying that I hate investing in a firm that is in a duopoly. I say that because in my experience firms will try again and again to beat out their competition. A great example of this is fedex vs ups. While both companies have performed well this year (as a direct result of covid) long term trends are not in their favor. these companies will both go back to fighting for market share and pricing one another out. Another one is Visa and Mastercard (in this case the winner is Amex). At the end of the day in most duopolies the winner is the consumer.\n\nWith that being said with the initial ipo of both uber and lyft I planned on staying far away from the two. However, recently I have come to realize that uber is a much different business than lyft. Lyft is entirely focused on giving rides while uber is simply focused on transportation. Think for a second about Uber you have Uber eats, raid hailing, and uber freight. I think the most slept on aspect of their business is uber freight it’s a revolutionary platform for drivers to find new freight deliveries. \n\nI almost never hear anyone even bring this aspect of their business up when talking about uber. In addition to freight we still have uber eats and regular uber. I don’t like uber eats at all. This will continue to be a losing sector until it becomes automated (which they are investing heavily in). That is simply because it costs uber more to send an order than they are being paid for that order. I will say the same for doordash. When they have an ipo I promise you it will bust. No food delivery company will ever be profitable until the drivers are completely cut out of the equation. Finally we have regular old uber the bread and butter of the business. The initial problem with this was regulations. However, in a town that recently allows ubers we almost always see DUI related accidents go down so there is a really good argument to allow uber into any town. I believe there is really not a good reason to deny uber entrance into a new jurisdiction. The main factor that causes a city to deny uber to operate is because of bad behavior from drivers. This is a simple fix with more intensive background checks and well eventually autonomous vehicles (which again they are putting a lot of money into). \n\nLet's talk about financials. \n\nBad news first. **Uber is not profitable** and I can’t entirely explain to you as to why that is. Other than the fact that startup costs are very high I can not give you a finite reason as to why they are losing so much money. For a software company they have a very high percentage of expenses being debited to administrative and general I think this could easily be reduced but I was unable to figure out why exactly this number is so high for a firm that is basically an app.\n\nP/E ratio: 27.03--- really fucking bad\n\nPrice/Sales ratio: 26.85 --- terrible\n\nUnfortunately those ratios have gotten worse over the last 12 months and I respect anyone who avoids Uber solely based off of those numbers because that’s not a good sign. \n\nNow for the good news.\n\nUber has seen an increase in users, an increase in revenue, and an increase in market share over every period to date. This is a really good sign and very few companies can say the same. Basically Uber is taking heavy losses at the moment to expand the market as well as their market share. In addition to that i'm sure you already have heard about California legislation that passed in favor of uber/lyft. This was huge for the company and really will shape the future of how they will operate.\n\nNow let’s talk about COVID\n\nAs you could imagine corona has had a big impact on uber stock. However, don’t forget about the eats sector. This part has seen triple digit growth and is more than enough to keep uber afloat. Once we have this virus behind us Uber will be in high demand and we could see some really great numbers coming next year. \n\nTL;DR: Uber has a debt problem, but there is a light at the end of the tunnel. If Uber can reduce administrative expenses while keeping a large budget for R&amp;D the road to profitability would be much shorter than Wall Street might imagine. \n\nPrice targets: (these are somewhat guesses to be honest)\n\nDec 31 2020: 58\n\nJune 30 2021: 74\n\nDec 31 2021: 120",
        "subreddit": "stocks",
        "title": "$UBER is an excellent long term buy let me explain why",
        "url": "https://www.reddit.com/r/stocks/comments/jzqkkg/uber_is_an_excellent_long_term_buy_let_me_explain/",
        "created": 1606194582.0
    },
    {
        "author": "pabsgu46",
        "created_utc": 1604974667,
        "id": "jrc3yi",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "Watchlist 11-10-20 👀\n\nKeeping the list short due to the volatility of the market.\n\n$HCDI – AH NEWS Lennar Corporation Purchases an Additional 66 Lots at Soundview Estates from Harbor Custom Development, In Over the 20 ma and AH hit $8.04, with covid vaccine on the way many real-estate stocks are trading bullish.\n\n$SNDL – Still A favorite marijuana stock. Running under all the MA (20,50, 100, 200). Did make a nice run AH again $0.50. Again find a good entry and get out.\n\n$MEDS – MEDS agreed to promote and market \nAmazon’s storage lockers, a secure, self-service kiosk and pick-up program. The market is responding to this new that occurred on 11/03/20 remember stocks that carries Amazon in the headline holds weight in the market.200 MA shows it is on an uptrend AH hours ran to $5.94. Could see a possible run to $6.41 on the Fibonacci chart.\n\n$AAL- Airlines and cruise ships started recovering today on the news of Pzifer vaccine preventing 90% of covid infection.\n\n$FSKR – Possible swing. EVs are in play with the new administration. Also\nFORM S-1 was file today with SEC. https://www.sec.gov/Archives/edgar/data/0001720990/000119312520289193/d92481ds 1.htm\n\n$UONE - had a strong close and forming a uptrend. Any news could have this one running like back in June, but for now looking for a break resistant at $6.95.\n\nOne more time Devil’s lettuce Backburners: $TLRY $CGC $HEXO $ ACB $APHA $OGI $VFF $AMRS $GRWG $CRON\n\nBackburners: $KERN $IGC $PECK $BLNK $AHT $IHT $NIO",
        "subreddit": "pennystocks",
        "title": "Watchlist 11-10-20 👀",
        "url": "https://www.reddit.com/r/pennystocks/comments/jrc3yi/watchlist_111020/",
        "created": 1605003467.0
    },
    {
        "author": "rayjensen",
        "created_utc": 1605143863,
        "id": "jsl3vf",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "What’s the move here? I see a lot of possible catalysts that could push for a quick rebound but the downward pressure resulting from the China regulation is scary. I don’t think China is really going to do much, it’s more of a scare tactic on Jack Ma. From an analytical standpoint, do you see BABA rebounding or consolidating over the next couple weeks?",
        "subreddit": "wallstreetbets",
        "title": "BABA going into consolidation phase?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jsl3vf/baba_going_into_consolidation_phase/",
        "created": 1605172663.0
    },
    {
        "author": "Balland-Cocgoblir",
        "created_utc": 1605355137,
        "id": "ju0w81",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "The Chinese communist party recently smacked down Jack Ma, co-founder of Ali Baba, which literally cost billions of lost revenue in the “cancelled” IPO of Ant Financial (a sort of Chinese version of PayPal), because he publicly disagreed with the party.\n\nExcluding morality for one moment, there is CLEARLY a massive risk in investing in China. They are prepared to smack down their own – why would they care about you? They also have a history of trying to lock in money from leaving the country. Google it.\n\nChina is very short US dollars, the world’s currency for international deals. I.e. they will say / do what they have to, to get investment in. [https://www.youtube.com/watch?v=dQ8qFhq7pXQ](https://www.youtube.com/watch?v=dQ8qFhq7pXQ)\n\nEven with countless and repeating examples of terrible behavior (financially and morally), I see a countless sea of reddit users with “Should I Invest in BABA?” etc. Am aware its on multiple exchanges.\n\nChina does not play to the same rules the rest of the financial world does; resists / does not release financial statements, and lies constantly, and even bullies 1st world countries (Australia) but cutting off billions in exports across multiple industries, literally overnight, at will! Bless Australia, whom does not take kindly to getting bullied.\n\nGiven the above reasons and more, my personal bias is I cannot reward this behavior by pretending its fine - I now  go out of my way to avoid buying from China (at the shops etc), and sure as hell actively choose to not invest money into any companies there, even though I previously did.\n\n**Do you think investing in China is morally dubious - or totally fine?**\n\nPlease give your reasons - especially for the latter option.",
        "subreddit": "investing",
        "title": "Investing in China: Intelligent Investor or Unpatriotic maggot?",
        "url": "https://www.reddit.com/r/investing/comments/ju0w81/investing_in_china_intelligent_investor_or/",
        "created": 1605383937.0
    },
    {
        "author": "jaxoff707",
        "created_utc": 1606088960,
        "id": "jz6f0s",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\nIve been looking into this for a moment and am interested and confident I could educate myself to pass the exam. My concern is securing sponsorship fr ma FINRA-member Firm. I do not plan to work for anyone other than myself and I never have. Will my lack of employment in the field hold me back? Only examples I see are people going to work for firms and that firm ends up sponsoring the employee. What incentive would a firm have to let me take the exam if I wasn't planning to work for them, and is it even worth attempting with such little to show regarding an established history of credibility or would I be able to prove my expertise to them?",
        "subreddit": "wallstreetbets",
        "title": "19 yr old I run a community of over 200,000 Investors and am EXTREMELY well educated looking to get my series 7",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jz6f0s/19_yr_old_i_run_a_community_of_over_200000/",
        "created": 1606117760.0
    },
    {
        "author": "gohackthat",
        "created_utc": 1606178516,
        "id": "jzuib5",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "Market Commentary (Treasury cuts Fed funding, TSLA and EV/ecommerce stocks) - 11/23/2020\n\nHello investors, hope you enjoyed the weekend!\n\nThe past weekend was my birthday and I had to step away from the monitor a bit but I'm back.\n\nA couple of headlines that I think are important to discuss. \n\n1) Treasury cuts funding for Fed's emergency lending programs\n\n[https://www.bloomberg.com/news/articles/2020-11-19/mnuchin-asks-fed-to-return-unused-stimulus-funds-to-treasury](https://www.bloomberg.com/news/articles/2020-11-19/mnuchin-asks-fed-to-return-unused-stimulus-funds-to-treasury)\n\n2) TSLA added to S&amp;P 500\n\n3) EV stock market hysteria\n\n4) Ozon trade idea\n\n&amp;#x200B;\n\n1) Though the news in and of itself is a bad one, my reaction to the headline is muted. It simply means that Treasury won't back the Fed for its lending programs in corporate and muni bond purchase operations anymore as they see it as being ineffective. \n\nOne might say that it has larger implications for the coming months with regards to Fed's inability to implement monetary policies. I have a few arguments against that.\n\nFirst of all, Mnuchin will be gone soon and Janet Yellen will replace him, which is a pretty obvious reason we can simply ignore this headline as it is the Republicans implementing this decision.\n\nSecond, if you remember from my Market Commentary on 11/19/2020 (see below for the link), Fed's real value in resolving March crisis was being a liquidity backstop.\n\n[https://www.reddit.com/r/Midasinvestors/comments/jxb7y4/market\\_commentary\\_will\\_there\\_be\\_a\\_crash\\_if\\_so/?utm\\_source=share&amp;utm\\_medium=web2x&amp;context=3](https://www.reddit.com/r/Midasinvestors/comments/jxb7y4/market_commentary_will_there_be_a_crash_if_so/?utm_source=share&amp;utm_medium=web2x&amp;context=3)\n\nIn essence, the Fed wasn't actually solving solvency problems that many companies face today. It really was the liquidity in the credit markets that those emergency lending programs provided by reassuring investors and traders that Fed will step in to buy those corporate and muni bonds even if no one else is willing to.\n\nFor more on liquidity crisis in March, check out this article. It explains how FRA-OIS plays a role in showing the health of financial markets funding.\n\n[https://www.bloombergquint.com/quicktakes/why-it-matters-that-the-fra-ois-spread-is-widening-quicktake](https://www.bloombergquint.com/quicktakes/why-it-matters-that-the-fra-ois-spread-is-widening-quicktake)\n\nThe credit markets have accepted these terms and is now in a good condition. Look at the charts below. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/dd1kdnacj2161.png?width=1444&amp;format=png&amp;auto=webp&amp;s=73d98f4dd1433dd05a2935b963d626f5f5cc943e\n\n&amp;#x200B;\n\nhttps://preview.redd.it/51xf6pmgj2161.png?width=1437&amp;format=png&amp;auto=webp&amp;s=149ebe7887822519fd7e0dd15f32e76a397b9565\n\n&amp;#x200B;\n\nhttps://preview.redd.it/6egypgl8k2161.png?width=1435&amp;format=png&amp;auto=webp&amp;s=7d2da8457d4c5dcf0458bec68e57b53be37b98cf\n\nI can show you more charts that show how the short-term funding pressures have been eliminated and like Mnuchin said, Fed's emergency lending programs may not be as effective now as it was back in March.\n\nAlso, would you really think that the Fed will just give up helping the economy just because Mnuchin eliminated the lending programs? Of course not. It simply means that the Fed will purchase more treasuries, more mortgages, and more short-term securities to facilitate the markets.\n\n2) I think the addition of TSLA into S&amp;P 500 has huge implications for the EV market in general. S&amp;P 500 is the most prestigious and largest index in the world by market cap. For a first EV company to be added to the index means that the \"real money\" investors such as pensions and endowments will be forced to own a piece of TSLA. \n\nThe market also confirms that. We got NIO, XPEV, LI, and a whole host of other EVs that are skyrocketing by day, not to mention PLUG that benefits from the EV transition. \n\nDo I think TSLA is a \"good\" buy? Absolutely not. It will never be on any of my retirement positions unless it traded at least a third of its value now.\n\nDo I think TSLA is a \"good trading opportunity\"? Hell yes.\n\nTake a look at this chart.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/kk4d2o5xl2161.png?width=816&amp;format=png&amp;auto=webp&amp;s=834926a57860b80bbe805fb2e8280b12f801ba4c\n\nThe gapping out at $430 to break the 50d MA is a very bullish move, breaking out of the 1.5 months of sideway movements.\n\nIt's never a good idea to be on the short side of this historic mania since you never know when it will pop and you never know how much it can go up. \n\nToday, I took a small OTM call option on TSLA expiring on March 2021. This is one of the rare short term trading that I do and I'm fine with either results. If it loses steam, I'm okay because it was a small bet. If it skyrockets, I'm happy to ride it and see a 3x bagger.\n\nI'd say the max amount of market cap that you can see TSLA reaching in the near-term is $1T, with a high chance of it staying anywhere between $400B to $700B.\n\n3) Speaking of EV companies, I think the whole industry is going through a bubble phase, just like bitcoin, tech boom in 1990s, and real estate in early 2000s. This means we can benefit from the bullish move up as well. \n\nI haven't done enough research to know which companies are in a better position to benefit from the trend the most but NIO and XPEV seem to be in the spotlight: at the center of the largest EV market in the world, largest manufacturers in China, and strong sales momentum.\n\nPlease feel free to share your research or ideas about EV companies in here! [https://www.reddit.com/r/Midasinvestors/comments/jx9puq/share\\_your\\_ideas/](https://www.reddit.com/r/Midasinvestors/comments/jx9puq/share_your_ideas/)\n\n4) Ecommerce play: Ozon.\n\nAs some of you may already be aware, a Russian ecommerce company called Ozon will begin trading this week on NASDAQ. I haven't done deep dive into their financials yet but as you can imagine, it'd be hard to go wrong with the company as it is dubbed the \"Amazon of Russia\".\n\nTo paraphrase, George Soros famously says \"I buy into ideas first, then do the research after, because if it turns out it's bad idea, then I can sell it in a day. If it's a good idea, then I am ahead.\" This is from his book the Alchemy of Finance.\n\nBe on the lookout for this stock!\n\n**Trading plan**\n\n1) Bullish on tech stocks.\n\nDespite tech stocks being not as relevant in a normalized economy with not as much need for e-commerce platforms, I'm still bullish on broader digital consumer and enterprise spending. Favorite risk/reward plays at the moment are PDD, STNE, FVRR, FUTU, BABA, W, and SEDG.\n\n2) Bearish on long end yield curve.\n\nI continue to think yield curve steepening will play out in the medium term (3-6 months). We were caught off guard by the lack of steepening despite the vaccine news but it is likely due to the Fed continuing to purchase the longer end of the curve given a larger fiscal policy plans. \n\nI don't have any positions yet but I plan on shorting ZB futures soon.\n\n3) Bullish on gold.\n\nAs dollar gets weaker and inflatino steams ahead, gold will likely gain momentum upwards.\n\nStill not trading gold at the moment. Looking for a stronger catalyst.\n\n4) Bullish on EV market, with caution.\n\n**Changes**\n\nI plan on buying Ozon this week and potentially one or two of the Chinese EV companies depending on the price actions.\n\nThanks for reading!",
        "subreddit": "SecurityAnalysis",
        "title": "Markets and stock analysis",
        "url": "https://www.reddit.com/r/SecurityAnalysis/comments/jzuib5/markets_and_stock_analysis/",
        "created": 1606207316.0
    },
    {
        "author": "quan42069quan",
        "created_utc": 1605456955,
        "id": "juoce8",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "No, that's not a ticker. It stands for Regional Comprehensive Economic Partnership, its a [new trade pact](https://www.bbc.com/news/world-asia-54949260) (&lt;-- important parts of this quoted below) between basically every major economy in the Asia Pacific region.\n\n&gt;The new free trade zone will be bigger than both the US-Mexico-Canada Agreement and the European Union. \n\nThis is what it does. Important parts bolded:\n\n&gt;The RCEP is expected to eliminate a range of tariffs on imports within 20 years.  \n&gt;  \n&gt;It also includes **provisions on intellectual property, telecommunications, financial services, e-commerce and professional services**.  \n&gt;  \n&gt;But it's possible the new \"rules of origin\" - which officially define where a product comes from - will have the biggest impact.  \n&gt;  \n&gt;Already many member states have free trade agreements (FTA) with each other, but there are limitations.  \n&gt;  \n&gt;\"The existing FTAs can be very complicated to use compared to RCEP,\" said Deborah Elms from the Asian Trade Centre.  \n&gt;  \n&gt;**Businesses with global supply chains might face tariffs even within an FTA because their products contain components that are made elsewhere.**  \n&gt;  \n&gt;**A product made in Indonesia that contains Australian parts, for example, might face tariffs elsewhere in the Asean free trade zone.**  \n&gt;  \n&gt;**Under RCEP, parts from any member nation would be treated equally, which might give companies in RCEP countries an incentive to look within the trade region for suppliers.**\n\nMeaning new markets for financial services and e-commerce for companies within the bloc.\n\nBut another thing about this jumped-out at me and it was the recent Anti-trust draft legislation. Its not like the PRC, even the PLA nutjobs, to undermine some of their best companies because they're monopolies.\n\nIn context though, what they did makes sense for 2 reasons, none of which are Jack Ma:\n\n1. Biden winning means the possibility for trade-war de-escalation. But that means leverage in various counter-veiling sectors will be important. So China is more able to pressure the US over its monopolies (Google, Amazon, etc.) if they can make the case that they've taken actions to clean-up their own act (even if they don't end-up passing meaningful antitrust legislation).\n2. More importantly was *getting this fucking trade deal done*. The companies that would potentially benefit from expanding into Chinese markets need to know (or at least believe) that there will be genuine competition at some level rather than just home-field advantage for Chinese companies. So threatening anti-trust legislation to show they're serious and understand the problem could have been what helped finish the deal. But they didn't pass the law yet and the trade deal is done. So there no more incentive for China to put a lot of teeth into the final version, *if* they ever pass antitrust legislation.\n\nThese are the best answers I can come-up with for \"why now?\" aside from the Jack Ma grudge.\n\nI don't have any positions to post yet but these are what I'm looking at Monday:\n\nCalls on:\n\nBABA\n\nSE\n\nJD\n\nNIO (dunno if you've heard of it)\n\n&amp;#x200B;\n\nI know more about geopolitics than I know about markets so I'm interested what effects you all think this is going to have. Is it priced in? Which companies win biggest?\n\n&amp;#x200B;\n\nTL;DR - Antitrust draft law might have been head-fake to get RCEP done. Calls on China.",
        "subreddit": "wallstreetbets",
        "title": "RCEP",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/juoce8/rcep/",
        "created": 1605485755.0
    },
    {
        "author": "AdKey9864",
        "created_utc": 1604872371,
        "id": "jqkfxu",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Hello Everyone,\n\nI was thinking about whether or not to buy my first property, an Apartment (studio or 1bed/ba near MIT (Kendall Area in Boston, Massachusetts).\n\nMy rationale for buying it, as opposed to renting it, is that it is around $2,100 per month to rent it. Expecting to be living there for five years, that would be $126,000 I put into the property.\n\nWhat are your thoughts? Also, suggestions on how to go about that process? Potential Alternatives? \n\nSalary: $90K pre-tax. My monthly expenses are really low (about 35% of my monthly), so I’d be able to save a lot (50% savings, 15% retirement in the form of 401K match &amp; Roth IRA).",
        "subreddit": "investing",
        "title": "Buying or Renting | Boston, MA |",
        "url": "https://www.reddit.com/r/investing/comments/jqkfxu/buying_or_renting_boston_ma/",
        "created": 1604901171.0
    },
    {
        "author": "pabsgu46",
        "created_utc": 1605064173,
        "id": "js03re",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Watchlist 11-12-20 👀\n\n\\*Banking Holiday Tomorrow\\*\n\nFor those with a Cash Account, this is a friendly reminder that Wednesday, November 11th is Veterans day, which is a banking holiday. Additionally, this means that it does not count as a settlement day. Please keep this in mind to avoid Good Faith Violations.\n\n$$FPRX  - Five Prime rockets 210% on bemarituzumab data in gastric cancer. AH ramn to $24.87. Gapped up to 24 and formed a bull flag. Closing above EMA5 on bullish uptrend for fprx\n\n$FTEK - Fuel Tech Reports 2020 Third Quarter Financial Results Ftek spiked to 1.20; A bull flag formation.\n\n$BORR went up by 14.65% from its latest closing price compared to the recent 1-year high of $9.12. The company’s stock price has collected 6.20% of gains in the last five trading sessions. Press Release reported on 10/28/20 that Borr Drilling Limited – Sale of rig\n\n$HCDI –   Swing NEWS from yesterday  Lennar Corporation Purchases an Additional 66 Lots at Soundview Estates from Harbor Custom Development, In Over the 20 ma and AH hit $8.04, with covid vaccine on the way many real-estate stocks are trading bullish.\n\n$FSKR –Still a swing. Remember , EVs are in play with the new administration. Also \n\nFORM S-1 was file yesterday with SEC. \n\nBackburners: $GTEC $FUBO $FTEK $SPR $BVXV $HYLN $IEA $ALT $MGI $INO $RKT",
        "subreddit": "RobinHoodPennyStocks",
        "title": "Watchlist 11-12-20 👀",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/js03re/watchlist_111220/",
        "created": 1605092973.0
    },
    {
        "author": "augusttrip2019",
        "created_utc": 1605891203,
        "id": "jxso2v",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Have been posting about this for weeks. We're headed back to $300. Oversold on headline news. Jump on baby Jack Ma is back!!\n\n**Positions: 4/16/21 $280C**",
        "subreddit": "wallstreetbets",
        "title": "$BABA - it's not too late to get in on the rocketship back to $300",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jxso2v/baba_its_not_too_late_to_get_in_on_the_rocketship/",
        "created": 1605920003.0
    },
    {
        "author": "pabsgu46",
        "created_utc": 1605842724,
        "id": "jxhlxc",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "Watchlist 11-20-20 👀\n\nIt is FRIDAY, so be cautious with every trade; if you are green, take it.\n\nBiden's plans for mask mandates nationwide will be an early test of his power of persuasion: Here are some stocks keep an eye on:\n\nMask mandate stocks $NBY $APT $AHPI \n\n$DYNT -  Participates in Canaccord Genuity 2020 Medical Technologies &amp; Diagnostics Forum AH ran to $0.65, but let's see if find support $0.61 and resistance $0.72. This one, the MACD, is looking bullish in the short term. \n\n$FEYE -  Announces Acquisition of Respond Software The Respond Software XDR engine to be integrated into Mandiant Advantage, bringing cloud-native AI together with Mandiant intelligence and expertise to automate the - AH ran up to $17.20. MA 200 shows bearish short term, so shorts may be out there to get a down to $13.81, hoping to find support and bounces to the 20 MA $14.14.\n\n$TTNP – Reported quarterly losses of $(0.05) per share. This is a 72.22 percent increase over losses of $(0.18) per share from the same period last year. AH hours run to $0.22 making it turn short term bullish. If it find support $0.21 then we can keep and eye to run up to $0.29.\n\n$SNMP - been giving bullish signals last couple trading sessions. This stock seems to have a set period of time of about 3-4 weeks between runs. Last two runs were about 3 weeks apart. So it's due for another. Avg share holder price is 1.02. Few holding with avg under .70s. Approx 21 day avg for shorts to cover which webull is no longer showing that data. Wonder why?🤔 accumulating shares under .60 for this imminent run to a dollar.\n\nTECHNICALS:\n\n$CEI - energy sector has been seeing huge growth\n\n$TRVN - Swing. Options exp tmrw. Expecting to see some volatility pick up to try and close above 2.50. Expect growth towards 3+ to continue next week. Look to secure a position under 2.50.\n\n$ITRM - Bollinger bands tightening up on daily. Short Squeeze imminent. Under .55 is a steal for incoming run.\n\nBackburners  $CEMI $CELB $NKLA $AYRO $BLNK $NAKD $FUV",
        "subreddit": "pennystocks",
        "title": "Watchlist 11-20-20 👀",
        "url": "https://www.reddit.com/r/pennystocks/comments/jxhlxc/watchlist_112020/",
        "created": 1605871524.0
    },
    {
        "author": "lazyassman",
        "created_utc": 1606251804,
        "id": "k0dq68",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Jack Ma - Outplaying the CCP - Smartest Person on Earth II",
        "url": "https://i.redd.it/coxxqfqm59161.png",
        "created": 1606280604.0
    },
    {
        "author": "iny_m",
        "created_utc": 1604426289,
        "id": "jnf6ri",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "So i’m getting a “Robinhood debit card” mailed to me after signing up and showing my license. \n\nHas anyone else signed up for this ?\n\nWhat i’m seeing is that I can use this Robinhood card just like any Mastercard and it can be used out of country too? (mexico, brazil) ?\n\nIt is contingent based on the the amount I have sitting in my Robinhood account (Like the dollar amount that youre not investing, just sitting there doing nothing) correct ?\n\nAnything I should know ??",
        "subreddit": "RobinHood",
        "title": "Just Signed Up For Debit Card .30% APy",
        "url": "https://www.reddit.com/r/RobinHood/comments/jnf6ri/just_signed_up_for_debit_card_30_apy/",
        "created": 1604455089.0
    },
    {
        "author": "Hiring-An-Editor",
        "created_utc": 1606333310,
        "id": "k0z9w5",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Company hasn't been announced yet.",
        "subreddit": "SPACs",
        "title": "Can someone give ma quick rundown why they're bullish for GIK?",
        "url": "https://www.reddit.com/r/SPACs/comments/k0z9w5/can_someone_give_ma_quick_rundown_why_theyre/",
        "created": 1606362110.0
    },
    {
        "author": "tankrat03",
        "created_utc": 1606663882,
        "id": "k3b7vz",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Wondering what to add next as I'm slowly allocating up to 10% of my portfolio to stocks/ETF's.  Maybe more as time goes on.  Trying to line up a set of solid stocks/ETF then build up from there.  By adding stocks/ETF's am I making things more difficult or should I stick with my Target Date Fund.\n\n&amp;#x200B;\n\nRoth IRA Target Date Fund - 96%\n\nCurrent Stocks/ETF (Roughly 4%):\n\nApple\n\nMicrosoft\n\nTesla\n\nDisney\n\nCoke\n\nARKK\n\n&amp;#x200B;\n\nStocks I'm interested in adding:\n\nAmazon (Add to this by fractional shares)\n\nGoogle (Add to this by fractional shares)\n\nNetflix (still not sure on this)\n\nBrk.B\n\nLockheed Martin (LMT) or Raytheon (RXT) or both\n\nJnJ\n\nVisa or Amex or Mastercard\n\nWal-Mart\n\nFidelity Consumer Discretionary ETF (FDIS) - 30% Amazon and 9% Tesla\n\nFidelity Communication Services Index ETF (FCOM) - 23% Google",
        "subreddit": "StockMarket",
        "title": "What to add next",
        "url": "https://www.reddit.com/r/StockMarket/comments/k3b7vz/what_to_add_next/",
        "created": 1606692682.0
    },
    {
        "author": "ricke813",
        "created_utc": 1605988116,
        "id": "jyh8ko",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "* In FY 2019 before COVID-19:\n   * International Transaction revenue for V = 34.0% of Net Revenue\n   * Cross-border Volume revenue for MA = 33.2% of Net Revenue\n\n&amp;#x200B;\n\n* The latest quarter y/y change for V's International Transaction revenue:\n   * \\-38.3% revenue decrease\n   * Cross-border volume x Intra-Europe = -41%\n\n&amp;#x200B;\n\n* The latest quarter y/y change for MA's Cross-Border revenue:\n   * \\-47.9% revenue decrease\n   * Cross-border volume x Intra-Europe = -49%\n\n**My concerns about V and MA**: Both companies during their recent earnings call said personal travel should pick-up quickly once a vaccine is widely distributed, while business travel will take longer. **I agree**. They both mentioned that personal travel is \"more substantial\" than business travel. Neither company quantified how much of their International Transaction/Cross-border volume is in jeopardy because of the permanent impairment of business travel so that's a major red flag, especially when you consider how important that revenue category is to both companies' top-line and bottom-line since these transactions tend to be higher-yielding than domestic transactions. Without a clear answer, **there's a real risk that International Transaction revenue/Cross-border volume revenue and profit may disappoint after a vaccine is distributed because of business travel.** Both stocks have held up well despite underwhelming results for a FinTech during the pandemic, but investors may need to rerate shares if performance is consistent with my concerns.\n\n**Why I could be wrong**: V &amp; MA may benefit from accelerated cash displacement and get volume from lower-yield transactions. But, it's not clear if it will be enough to offset the higher-yield international transactions. It certainly wasn't enough for either companies for the current quarter.\n\n**Why I still love FinTech**: Besides travel, a lot of wonderful secular trends are benefitting the industry and will only accelerate due to the COVID pandemic. There's a long run-way to expand the world's population to have access to financial services like banking, online shopping will keep growing where cash isn't an option, and continuous innovation will push people away from cash for face-to-face transactions.",
        "subreddit": "stocks",
        "title": "Why I'm bearish on V &amp; MA, but still love FinTech",
        "url": "https://www.reddit.com/r/stocks/comments/jyh8ko/why_im_bearish_on_v_ma_but_still_love_fintech/",
        "created": 1606016916.0
    },
    {
        "author": "hrm015",
        "created_utc": 1605127846,
        "id": "jsgim9",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "What do you guys think of MasterCard’s growth prospects for the next year/2 years?\n\nI know they’ve been hurt by a lack of travel spending. Are they basically going to trade sideways until travel returns?\n\nThinking of selling and putting the $ into a growth ETF that holds them instead. \n\nThanks for any input !",
        "subreddit": "stocks",
        "title": "Thoughts on $MA (MasterCard)?",
        "url": "https://www.reddit.com/r/stocks/comments/jsgim9/thoughts_on_ma_mastercard/",
        "created": 1605156646.0
    },
    {
        "author": "Chowguru",
        "created_utc": 1605709358,
        "id": "jwgm7b",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "[https://www.reuters.com/article/ciig-merger-corp-ma-arrival-idUSL1N2I40XL](https://www.reuters.com/article/ciig-merger-corp-ma-arrival-idUSL1N2I40XL)",
        "subreddit": "wallstreetbets",
        "title": "Time to get in on CIIG. UK EV startup backed by Blackrock and UPS ready to go public.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jwgm7b/time_to_get_in_on_ciig_uk_ev_startup_backed_by/",
        "created": 1605738158.0
    },
    {
        "author": "Hippyjet",
        "created_utc": 1606510551,
        "id": "k29hmh",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "You regretting not getting on ma space sip yet\n\nhttps://preview.redd.it/d7mfj0myiu161.png?width=958&amp;format=png&amp;auto=webp&amp;s=73504e3c9aa8ce72389d561fa6e73a926619d9c7",
        "subreddit": "wallstreetbets",
        "title": "I can almost see the moon",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k29hmh/i_can_almost_see_the_moon/",
        "created": 1606539351.0
    },
    {
        "author": "pabsgu46",
        "created_utc": 1604457809,
        "id": "jnomhi",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Watchlist 11-04-20 👀\n\nKeeping the list short due to the volatility of the market.\n\n$DGLY &amp;  $VISL- Continuation from the last several days.  Keep an eye for a longer swing up the Fibonacci chart 0% at $5.29. Still above all, the MA (20,50,100,200).  Make sure to take profits if you are GREEN. DGLY specializes in body cameras for police; keep riding the wave into the election as there is definite law enforcement demand with this turbulent election.\n\n$MARA – Keeping an eye out for since Bitcoin is nearing 14K. Marathon Patent Group is a patent holding company that is the parent of Uniloc and known for its involvement in cryptocurrencies. \n\n$VTVT – No news but on the radar on many trades. Right above the MA 20 and looking bullish. Look to reach the 200ma at $2.29\n\n$AAPL – Continuation on the uptrend. Waiting for tomorrow EOD candle to stay above $108.71. \n\nBackburners:   $VTVT $RKT $AVPO $UONE $CARV $UONEK $OEG $ZYNE",
        "subreddit": "RobinHoodPennyStocks",
        "title": "Watchlist 11-04-20 👀",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/jnomhi/watchlist_110420/",
        "created": 1604486609.0
    },
    {
        "author": "3103MGunner",
        "created_utc": 1605026058,
        "id": "jro61m",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Got rid of my Spy 355p this morning and rolled into CCL 15P 01/15/21. \n\nMy highest respect to the CCL 20C 11/13/20 guy 60k YOLO... You Sir is why we exist.\n\nI know Chy-nah stocks are tanking hard due to the restrictions the CCP just in placed . Lesson learned No.1 Jack Ma need to shut the fuck up and quick note 📝 Double 11 is tomorrow , as of in the next 30 min , Taobao, JD, PDD having huge Black Friday styled Sales , they are the Chinese Amazon !! Do what you will with it !! You are reading this correctly , in 30 min all these website will hit the highest volume ATH in each calendar year ! Monitor and research chy-nah 11.11 or Chinese Black Friday . \n\n70 CCL 15p 01/15/21 \n\nWhat are your moves please list down below",
        "subreddit": "wallstreetbets",
        "title": "Travel industries 🌈 🐻 🌈 and Chy-nah Bulls quick huddle",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jro61m/travel_industries_and_chynah_bulls_quick_huddle/",
        "created": 1605054858.0
    },
    {
        "author": "pabsgu46",
        "created_utc": 1604457776,
        "id": "jnom6o",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Watchlist 11-04-20 👀\n\nKeeping the list short due to the volatility of the market.\n\n$DGLY &amp;  $VISL- Continuation from the last several days.  Keep an eye for a longer swing up the Fibonacci chart 0% at $5.29. Still above all, the MA (20,50,100,200).  Make sure to take profits if you are GREEN. DGLY specializes in body cameras for police; keep riding the wave into the election as there is definite law enforcement demand with this turbulent election.\n\n$MARA – Keeping an eye out for since Bitcoin is nearing 14K. Marathon Patent Group is a patent holding company that is the parent of Uniloc and known for its involvement in cryptocurrencies. \n\n$VTVT – No news but on the radar on many trades. Right above the MA 20 and looking bullish. Look to reach the 200ma at $2.29\n\n$AAPL – Continuation on the uptrend. Waiting for tomorrow EOD candle to stay above $108.71. \n\nBackburners:   $VTVT $RKT $AVPO $UONE $CARV $UONEK $OEG $ZYNE",
        "subreddit": "pennystocks",
        "title": "Watchlist 11-04-20 👀",
        "url": "https://www.reddit.com/r/pennystocks/comments/jnom6o/watchlist_110420/",
        "created": 1604486576.0
    },
    {
        "author": "CuriousLondo",
        "created_utc": 1606482351,
        "id": "k20r3o",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Nio rebounded nicely. I honestly see better opportunities in $XPENG. Backed by my hero JACK MA. I see this company going to $100 EOY. \n\nWhat yall think?",
        "subreddit": "wallstreetbets",
        "title": "XPENG Day?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k20r3o/xpeng_day/",
        "created": 1606511151.0
    },
    {
        "author": "jrittle",
        "created_utc": 1604331633,
        "id": "jmppr6",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "[https://www.reuters.com/article/interprivate-acq-ma-aeva/lidar-firm-aeva-led-by-apple-veterans-agrees-deal-to-go-public-idUSL1N2HO0UY](https://www.reuters.com/article/interprivate-acq-ma-aeva/lidar-firm-aeva-led-by-apple-veterans-agrees-deal-to-go-public-idUSL1N2HO0UY)",
        "subreddit": "SPACs",
        "title": "Lidar SPAC #3: IPV and Aeva to Merge",
        "url": "https://www.reddit.com/r/SPACs/comments/jmppr6/lidar_spac_3_ipv_and_aeva_to_merge/",
        "created": 1604360433.0
    },
    {
        "author": "CautiousInvestor",
        "created_utc": 1605296613,
        "id": "jtmpig",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "https://www.wsj.com/articles/china-president-xi-jinping-halted-jack-ma-ant-ipo-11605203556?mod=markets_lead_pos2\n\nApparently, a week before the Ant Group's big IPO, Ma made some comments that didn't go down well with the president or other government officials, and that was enough for Jinping to personally intervene and halt the IPO.",
        "subreddit": "investing",
        "title": "Chinese President Xi Jinping halted Ant Group's historic $37 billion initial public offering after its founder, Jack Ma, made displeasing comments",
        "url": "https://www.reddit.com/r/investing/comments/jtmpig/chinese_president_xi_jinping_halted_ant_groups/",
        "created": 1605325413.0
    },
    {
        "author": "ajahec",
        "created_utc": 1606660076,
        "id": "k3a8a8",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Buy VALE and hold: 85% sure that you will profit \n\nAnyone saying the RSI is high and it’s overbought SUCK MA DICK! This isn’t a thing the guy who invented RSI would’ve never sold it if it was the ultimate indicator. It just keeps the pussies away\n\nOkay fast forward the chart looks juicy and ATH will be broken. When? I don’t know.\nIs now a good time to get in? YES no need to perfect time it I don’t care about being down 5-10% if I’m sure I will get at least 50%+ \n\nI will buy a few hundred shares Monday and then see what happens add more and more. \n\n\nPay me or donate something: \n\nCan you guys pay me my 3% commission this time? (No one paid me for my virgin galactic breakthrough) I only take cash I’m located in Europe but will also fly to you and pick it up. I only meet at locations with many people because of bad past experiences I don’t like to talk about \n\n\nSmall-plays: get in but also get out at some point (at least 2-5 weeks looks like growth)\n\nAnother 2 plays where I would get in and exit within the next 2-3 weeks AGN.AS &amp; SABR just swing these bitches nothing to worry about. AGN is good to get in at this price SABR you might want to look for an entry yourself.",
        "subreddit": "wallstreetbets",
        "title": "VALE I know it seems late but just get in",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k3a8a8/vale_i_know_it_seems_late_but_just_get_in/",
        "created": 1606688876.0
    },
    {
        "author": "Luck-Yin",
        "created_utc": 1604493194,
        "id": "jnvwdd",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "&gt;The user data is in Ant Financial, and Ant Financial can draw 70% of the bank. When everything is legal, these institutions will eventually be able to overwhelm state capital in this field, which is a structural advantage after monopoly.\n\nThe most fundamental reason for Ant’s postponement of listing is to touch the cake of the bank. The only way to buy the five funds is through Alipay. \n\nSystemic risk. \"Fintech companies' products such as \"Huabe\", \"White Tiao\", and \"Willful Payment\" have no essential difference between their cores and credit cards issued by banks. They also have the functions of credit supply and installment payment. Expenses are the main source of its profits; products such as \"borrowing\", \"gold bars\", and \"micro loans\" are not essentially different from the small loans provided by banks.\"\n\nAnt Financial does not need to back bank-level supervision, and can naturally increase its leverage to expand its capital volume.\n\nUse other people’s money to form a pool of funds, use other people’s money to lend, and then collect money in the name of technology. Is this determined by technology or by monopoly? There is nothing wrong with this game, and 70% of the loan proceeds go to Jack Ma; when something happens, 98% of the losses belong to others (and most of them are banks).\n\n**So the reason why Ant Financial stopped is probably very simple:**\n\n* You are a bank, re-submit the listing according to the bank's materials\n* And you still have a lot of things incomparable with the bank",
        "subreddit": "StockMarket",
        "title": "Let me tell you. Why did Ant Group delay its IPO?",
        "url": "https://www.reddit.com/r/StockMarket/comments/jnvwdd/let_me_tell_you_why_did_ant_group_delay_its_ipo/",
        "created": 1604521994.0
    },
    {
        "author": "JhoLow_1MDB",
        "created_utc": 1605208561,
        "id": "jt11i6",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Ma certainly pissed off some powerful people with his recent comments:\n\nhttps://www.wsj.com/articles/china-president-xi-jinping-halted-jack-ma-ant-ipo-11605203556\n\n\nBasically, it looks like Ant IPO is shot between the eyes dead unless something happens like Ma basically goes away and is replaced.",
        "subreddit": "investing",
        "title": "WSJ: Xi himself pulled the plug on Ant IPO",
        "url": "https://www.reddit.com/r/investing/comments/jt11i6/wsj_xi_himself_pulled_the_plug_on_ant_ipo/",
        "created": 1605237361.0
    },
    {
        "author": "tomacco187",
        "created_utc": 1605892637,
        "id": "jxt55a",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Will be gobble up by Visa/Mastercard/Square/ or a paypal.  Easily worth $500 mils (TENDIES from here)",
        "subreddit": "wallstreetbets",
        "title": "NETE way undervalue (50mils market cap)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jxt55a/nete_way_undervalue_50mils_market_cap/",
        "created": 1605921437.0
    },
    {
        "author": "crediblepidgeon",
        "created_utc": 1605373275,
        "id": "ju55cp",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Hi all, \n\nLooking for some general investment and portfolio advice. 24 year old that makes roughly $80K/year. \n\nBreakdown of net worth: \n\n* $15K in savings accounts (emergency fund) \n* $3.5K in checking for near-term \n* $10K in 401(K) - Vanguard S&amp;P index fund  \n* $10K in personal brokerage account \n   * 50% in S&amp;P index funds \n   * 50% in individual stocks \n\nNo longer saving cash, as I feel comfortable with the amount I have reserved should an emergency arise. I plan to continue to contribute to my 401(K) as well as invest $1K/month into my personal brokerage account, increasing both proportionally with pay raises. \n\n50% of funds invested in my personal account will go straight into index fund shares (SPY, VOO). I'm also planning on opening positions in ARKK, ICLN as I believe in the thesis of these funds. Mama Wood is a genius, and if we don't switch to clean energy soon the world will end anyway. \n\nThe other 50% of funds invested in my personal account go into individual stocks. I'm tech/financials heavy (half of my individual portfolio) - main holdings include AAPL, MSFT, PYPL, MA, V. I also have smaller positions ESTY, NTDOY, O, TMUS. Will likely open a position in BABA next week. \n\nMy plan is to continue the 75% index/25% individual split in equities. For individual stocks I will continue to focus on growth/tech opportunities as a supplement to index returns. At this point in my life, I think the potential gains from growth should take a front seat to any dividend/value investing. \n\nIs this a solid plan going forward? What would you change thesis or allocation wise? \n\nCheers!",
        "subreddit": "investing",
        "title": "Critique my investment plan &amp; portfolio",
        "url": "https://www.reddit.com/r/investing/comments/ju55cp/critique_my_investment_plan_portfolio/",
        "created": 1605402075.0
    },
    {
        "author": "graymalkincat77",
        "created_utc": 1606349440,
        "id": "k14dax",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "So I have built myself a screening tool that finds potential Iron Condors to sell and lets me know a range for my calls and puts.  Works based on calculating some simple statistics based on past 4 weeks of price swings and identifies which ones have the highest potential to be profitable.  I’m strictly looking at weeklys with about 2k to trade with.  Here is what my tool spit out and I sold today:\n\n12/4 \nMA - 330/352.5\nATVI - 74/77.5\nCMG - 1245/1300\nW - 232.5/262.5\nDPZ - 375/390\n\nMy plan is to hold until expiration.  Thoughts?",
        "subreddit": "options",
        "title": "Building a Strategy",
        "url": "https://www.reddit.com/r/options/comments/k14dax/building_a_strategy/",
        "created": 1606378240.0
    },
    {
        "author": "pabsgu46",
        "created_utc": 1606442899,
        "id": "k1sb2a",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Watchlist 11-27-20 👀\n\nThe New York Stock Exchange and Nasdaq will be closed on Thanksgiving. That's the same for U.S. bond markets and U.S. OTC Markets. On Black Friday, the NYSE and Nasdaq will close early at 1 p.m., followed by U.S. OTC Markets at 2 p.m.\n\nHoldings Companies: $PIC $FSR $LCA are 3 popular atlas stocks. $NBAC $KCAC $LCA$PIC $FSR $TZACU\n\nBTC/Blockchain: Bitcoin - took a huge hit overnight so look for relative stocks to follow suit. i expect bitcoin to rally again after finding a bottom. $MARA $RIOT\n\n$WEI - after a golden cross occured 11.25.20 a huge spike occured and what appeared to be a pump and dump was more the start of what going to be the start of growth for this company. WEI may test lower support levels close to 1.70 or as low as 1.45 before finding a pivot point. may see a PM run to test pivot point at 2.48 23.6% fib\n\n$ONEK Insider trading reports CEO bought $UONEK shares on 11/23, 11/24 and 11/25. He bought shares at $1.21, $1.26 and $1.32. When an inside buy we like to buy and hold shares near the CEO’s average. This stock ran to $6 back in June. It has been silently uptrending. Investment reports has ranked this and $UONE high for stocks to invest in. \n\n$CARV in Friday news broke about a group of investors investing in this Black Owned Bank. Morgan Stanley, BAC, Fed Gov, all supporting this undervalued gem.  Chart is gold and history of monster runs from $6s to $10s. This is pulling a 2020 $COHN $6 to $30 move at some point soon.All traders are closely relating this chart to $COHN in movement, price action and it’s overall catalyst behavior. \n\nSympathy stocks: $UONE $LMFA $BYFC $SALM $IMTE\n\nEV Charging:\n\n$CLSK - tested support levels in the low 10s and is showing solid signs of consolidation around 11 range. may see a pop to fil gaps to 12.40 before seeing some pull back to accumulate support again. profit takers will see this as an opportunity to cash out their profits. we will too as this is only a swing and we want to make some solid gains. speculation on if the run will continue will be required to determine on holding residual shares for continuation\n\n$BLNK - accumulating support around $25 which is what i suspected would occur. may see a rally for options that are expiring tmrw to be ITM\n\nShipper stocks (Back burners):  $TOPS $ESEA $PSHG $GLBS $SINO $SHIP $PSX These stocks where getting some hits on Wednesday some had strong close in AH. These stocks are historically known to spike in November. November isn’t over yet and in my opinion with everything EV focused, we may see a delayed but not forgotten reaction from this sector. Many of us are currently holding shares swinging.\n\n$SPCE – On a bullish trend base on the 200 MA and breaking through a second time to a high of $27.80 and going to keep an eye tomorrow on volume and new candle it crates at the end of the trading day. IMO may have a retracement base on the MACD back to $17.93 before making a third MAJOR break out.  Perhaps after the first quarter of next year.",
        "subreddit": "pennystocks",
        "title": "Watchlist 11-27-20 👀",
        "url": "https://www.reddit.com/r/pennystocks/comments/k1sb2a/watchlist_112720/",
        "created": 1606471699.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1604437486,
        "id": "jnitdp",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Tuesday, November 3, 2020**\n\nStocks added to Monday’s gain in the final market session before the US presidential election. Market participants weighed a host of different outcomes for the election against the backdrop of the ongoing coronavirus pandemic, economic strain, and heightened social unrest. \n\nThe indices traded choppily but ended the day in the green. The tech-heavy Nasdaq (QQQ) finished 1.73% up, the S&amp;P 500 (SPY) finished 2.73% up as well, and the Dow Jones (DIA) performed the best, up 2.02%.\n\nRegardless of who wins the presidency, the result is very likely to drive short-term volatility, especially given the political divide and social unrest present in the United States. Any potential outcome from the election is likely to disappoint a large portion of the population, leading to uncertainty and anxiety that could inject volatility into the market. For example, after the 2016 election, the S&amp;P 500 future slumped around 5%. The index went on to recuperate these declines to finish 1% higher by the end of the first post-Election session. Neil Shearing, chief economist for Capital Economics said, “The experience of 2016 suggests that investors should be careful about taking strong positions on political outcomes and, worse, mechanically translating those to market outcomes.”\n\nGiven the coronavirus pandemic, there has been a surge of early and mail-in voters this year. This could potentially mean that the results of the elections may not become until later on in the week, an outcome sure to negatively affect the markets. According to the US Elections Project,as of this morning, more than 100 million Americans cast their votes early, more than ⅔ the total numbers of voters during the 2016 election. According to Yahoo Finance, if turnout like this holds up, this election could have the highest voter turnout in 100 years. According to Quinnipiac’s final pre-election poll, Joe Biden has an edge in the national polls. However, when looking at key swing states, Biden’s lead is considerably narrower.\n\nThe US Senate is also holding elections this year. The combination of which party takes control of the White House and Senate is another issue of major concern. According to Blackrock Analysts, “We believe a Democratic sweep could pave the way for a new round of large-scale fiscal stimulus and boost spending on clean energy, transport, and housing. It may also bring higher taxes for companies and the wealthy. A Biden win with a Republican-controlled Senate would likely lead to much less fiscal stimulus, little public investment, and no major tax changes,” the analysts said. Fiscal stimulus under a second Trump term may lie somewhere between these two scenarios, we believe, while public investment could be similarly small as under a Biden divided government.”\n\n**Highlights**\n\n* McKesson Corp (MCK) on Tuesday said it and two other major U.S. drug distributors could be expected to pay up to $21 billion under a new proposal to resolve thousands of lawsuits alleging they helped fuel the U.S. opioid crisis.\n* Twitter (TWTR) said in a filing with the Securities and Exchange Commission that the company's board of directors had reviewed CEO Jack Dorsey's leadership and will allow him to remain as CEO. The company also announced a stock buyback plan worth around $2 billion. The price action of the stock should be interesting moving forward.\n* The Shanghai Stock Exchange suspended Ant's blockbuster IPO late Tuesday, a day after four regulatory agencies summoned Mr. Ma and the company's top two executives to a closed-door meeting. The company said a concurrent Hong Kong listing would also be suspended. Ant plans to return the funds it has collected from investors who subscribed to its IPO, which had been on track to raise at least $34.4 billion in total. \"Ant Group apologizes for the trouble this has caused investors,\" it said in a post on Chinese social media. Alibaba (BABA) was down 8% today in sympathy.\n* Amedisys (AMED) target raised by Barclays from $290 to $298 at OVERWEIGHT. Stock currently around $254.\n* Estee Lauder (EL) with multiple positive target increases. Stock currently around $223.\n   * Deutsche Bank (DB) from $258 to $259 at BUY\n   * Morgan Stanley (MS) from $240 to $260 at OUTPERFORM\n* Horizon Therapeutics (HZNP) target raised by BMO Capital from $105 to $110 OUTPERFORM. Stock currently around $73.\n* Jazz Pharma (JAZZ) with multiple target increases. Stock currently around $147.\n   * SVB Leerink from $194 to $202 OUTPERFORM \n   * Barclays from $225 to $233 OUTPERFORM \n   * Royal Bank of Canada from $170 to $180 OUTPERFORM \n* Leidos (LDOS) target raised by Credit Suisse from $120 to $131 at OUTPERFORM. Stock currently around $85.\n* Mercado Libre (MELI) target raised by Credit Suisse to $1,484 at OUTPERFORM. Stock currently around $1215 and has been a monster this year. Ecommerce company in Latin America\n* Inspire Medical (INSP) with two target increases. Stock currently around $122.\n   * Robert W. Baird from $130 to $160 OUTPERFORM \n   * Piper Sandler from $137 to $147 OVERWEIGHT\n   * SVB Leerik from $150 to $170 OUTPERFORM \n* Big Banks did really well today, outperformed the market.\n\n*“Whatever the mind of a person can conceive and believe, it can achieve” -*Napoleon Hill",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Tuesday, Nov 3, 2020. Please enjoy!",
        "url": "https://www.reddit.com/r/stocks/comments/jnitdp/here_is_a_market_recap_for_today_tuesday_nov_3/",
        "created": 1604466286.0
    },
    {
        "author": "SureSpeech5",
        "created_utc": 1604935846,
        "id": "jqznu8",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "  \n\n **Q3 Results Today - TA MA 200 &amp; MA 50 To Cross - Breakout Coming ?**\n\nhttps://preview.redd.it/3ueepw5pg8y51.png?width=700&amp;format=png&amp;auto=webp&amp;s=d4ca4dccfc6d66525499268772f39974706b4542",
        "subreddit": "RobinHoodPennyStocks",
        "title": "Ideanomics - Q3 Results Today - TA MA 200 &amp; MA 50 To Cross - Breakout Coming ?",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/jqznu8/ideanomics_q3_results_today_ta_ma_200_ma_50_to/",
        "created": 1604964646.0
    },
    {
        "author": "TheAbyssBlinked",
        "created_utc": 1605029360,
        "id": "jrp93e",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Ma Look, we made the CFA curriculum!",
        "url": "https://i.redd.it/qav766eo6gy51.png",
        "created": 1605058160.0
    },
    {
        "author": "octobersown24",
        "created_utc": 1606750541,
        "id": "k3y1eh",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "I am going to share DD on some of my higher conviction ideas. I hope they will be helpful and I welcome feedback. First up is $BILL\n\n**Background:** Businesses spend stupid amounts of time dealing with AR/AP (accounts receivable/payable). It is one of the last areas of the back office that haven’t been improved by technology (e.g., quickbooks, turbotax etc). Sending, receiving, paying, and tracking invoices and payments is a MASSIVE market that is ripe for a technological solution. ENTER [BILL.COM](http://bill.com/)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/enwnlynw9e261.png?width=956&amp;format=png&amp;auto=webp&amp;s=49ff34b4e98784f827111ae6c2017c4bd7697a9a\n\n**WHAT THE FUCK IS BILL:** BILL is a cloud based AR/AP platform that manages invoices, allows staff to approve and pay bills and then downloads that information into accounting systems. It is a huge time save and simplifies an annoying af part of running a business. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/mr57d8sx9e261.png?width=948&amp;format=png&amp;auto=webp&amp;s=ba18e5f18ba875e361e17f347ae46731ef358d2a\n\nBILL’s platform is huge and already has 2.5m network members. That means when you go to pay a business, you can just type a name, and it's pretty likely the business you are trying to pay is already on the platform. This creates a huge advantage and creates massive barriers to new entrants (nobody wants to sign up to multiple platforms). Think of it like Venmo but for businesses \n\nThe biggest banks in the country already know they have to work with BILL and provide this service to their business customers (BOA, Wells, JPM). The product is also plugged into all the accounting platforms (Oracle, Quickbooks, Sage etc)\n\nThey are now focused on bringing this product to international companies. If they are successful they will basically be THE global business-to-business payments platform. You could make a solid case that someone like Visa or Mastercard, maybe even Stripe or PayPal would love to own this shit. \n\nThey already have $169m of revenue and are growing at like 50% YoY. The business is profitable with 77% gross margins but the most important part is that this is a HUGE global opportunity - about $30b which they could conceivably become the only player in.\n\nThey are marketing with investors over the next few weeks. Today they will be at the Credit Suisse Technology conference and tomorrow at the Wells Fargo TMT Summit\n\n**KEY TAKEAWAYS**\n\n\\- LIKE VENMO OR CASH APP BUT FOR BUSINESS\n\n\\- NETWORK EFFECT CREATES AN INSURMOUNTABLE MOAT\n\n\\- AS THEY EXPAND THE NETWORK GETS LARGER MAKING THE PRODUCT EXPONENTIALLY MORE VALUABLE. IT FEEDS ON ITS SELF\n\n\\- 59% YOY REVENUE GROWTH\n\n\\- 77% GROSS MARGINS\n\n\\- HUGE GLOBAL OPPORTUNITY ($30B)\n\n\\- TOP HOLDERS INCLUDE LEGIT AF HEDGE FUNDS LIKE LONE PINE AND WHALE ROCK\n\nBILL is rapidly becoming the dominant player in AR/AP and has the potential to become the Quickbooks of its segment. \n\n**How to play:**\n\nBuy stock \n\nSell puts \n\nBuy calls, something in 2021 ITM\n\n**Not investment advice just my opinion. Do your own research.** \n\nI own December 2021 $110 calls and common stock\n\n&amp;#x200B;\n\nhttps://preview.redd.it/x6mvu478ce261.png?width=1087&amp;format=png&amp;auto=webp&amp;s=8463f4fd33a2be2bc95f1ebf8caefb48faeda565",
        "subreddit": "wallstreetbets",
        "title": "DD - DOLLA DOLLAR $BILL",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k3y1eh/dd_dolla_dollar_bill/",
        "created": 1606779341.0
    },
    {
        "author": "gohackthat",
        "created_utc": 1606175642,
        "id": "jztoip",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Market Commentary (Treasury cuts Fed funding, TSLA and EV/ecommerce stocks) - 11/23/2020\n\nHello investors, hope you enjoyed the weekend!\n\nThe past weekend was my birthday and I had to step away from the monitor a bit but I'm back.\n\nA couple of headlines that I think are important to discuss. \n\n1) Treasury cuts funding for Fed's emergency lending programs\n\n[https://www.bloomberg.com/news/articles/2020-11-19/mnuchin-asks-fed-to-return-unused-stimulus-funds-to-treasury](https://www.bloomberg.com/news/articles/2020-11-19/mnuchin-asks-fed-to-return-unused-stimulus-funds-to-treasury)\n\n2) TSLA added to S&amp;P 500\n\n3) EV stock market hysteria\n\n4) Ozon trade idea\n\n&amp;#x200B;\n\n1) Though the news in and of itself is a bad one, my reaction to the headline is muted. It simply means that Treasury won't back the Fed for its lending programs in corporate and muni bond purchase operations anymore as they see it as being ineffective. \n\nOne might say that it has larger implications for the coming months with regards to Fed's inability to implement monetary policies. I have a few arguments against that.\n\nFirst of all, Mnuchin will be gone soon and Janet Yellen will replace him, which is a pretty obvious reason we can simply ignore this headline as it is the Republicans implementing this decision.\n\nSecond, if you remember from my Market Commentary on 11/19/2020 (see below for the link), Fed's real value in resolving March crisis was being a liquidity backstop.\n\n[https://www.reddit.com/r/Midasinvestors/comments/jxb7y4/market\\_commentary\\_will\\_there\\_be\\_a\\_crash\\_if\\_so/?utm\\_source=share&amp;utm\\_medium=web2x&amp;context=3](https://www.reddit.com/r/Midasinvestors/comments/jxb7y4/market_commentary_will_there_be_a_crash_if_so/?utm_source=share&amp;utm_medium=web2x&amp;context=3)\n\nIn essence, the Fed wasn't actually solving solvency problems that many companies face today. It really was the liquidity in the credit markets that those emergency lending programs provided by reassuring investors and traders that Fed will step in to buy those corporate and muni bonds even if no one else is willing to.\n\nFor more on liquidity crisis in March, check out this article. It explains how FRA-OIS plays a role in showing the health of financial markets funding.\n\n[https://www.bloombergquint.com/quicktakes/why-it-matters-that-the-fra-ois-spread-is-widening-quicktake](https://www.bloombergquint.com/quicktakes/why-it-matters-that-the-fra-ois-spread-is-widening-quicktake)\n\nThe credit markets have accepted these terms and is now in a good condition. Look at the charts below. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/dd1kdnacj2161.png?width=1444&amp;format=png&amp;auto=webp&amp;s=73d98f4dd1433dd05a2935b963d626f5f5cc943e\n\n&amp;#x200B;\n\nhttps://preview.redd.it/51xf6pmgj2161.png?width=1437&amp;format=png&amp;auto=webp&amp;s=149ebe7887822519fd7e0dd15f32e76a397b9565\n\n&amp;#x200B;\n\nhttps://preview.redd.it/6egypgl8k2161.png?width=1435&amp;format=png&amp;auto=webp&amp;s=7d2da8457d4c5dcf0458bec68e57b53be37b98cf\n\nI can show you more charts that show how the short-term funding pressures have been eliminated and like Mnuchin said, Fed's emergency lending programs may not be as effective now as it was back in March.\n\nAlso, would you really think that the Fed will just give up helping the economy just because Mnuchin eliminated the lending programs? Of course not. It simply means that the Fed will purchase more treasuries, more mortgages, and more short-term securities to facilitate the markets.\n\n2) I think the addition of TSLA into S&amp;P 500 has huge implications for the EV market in general. S&amp;P 500 is the most prestigious and largest index in the world by market cap. For a first EV company to be added to the index means that the \"real money\" investors such as pensions and endowments will be forced to own a piece of TSLA. \n\nThe market also confirms that. We got NIO, XPEV, LI, and a whole host of other EVs that are skyrocketing by day, not to mention PLUG that benefits from the EV transition. \n\nDo I think TSLA is a \"good\" buy? Absolutely not. It will never be on any of my retirement positions unless it traded at least a third of its value now.\n\nDo I think TSLA is a \"good trading opportunity\"? Hell yes.\n\nTake a look at this chart.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/kk4d2o5xl2161.png?width=816&amp;format=png&amp;auto=webp&amp;s=834926a57860b80bbe805fb2e8280b12f801ba4c\n\nThe gapping out at $430 to break the 50d MA is a very bullish move, breaking out of the 1.5 months of sideway movements.\n\nIt's never a good idea to be on the short side of this historic mania since you never know when it will pop and you never know how much it can go up. \n\nToday, I took a small OTM call option on TSLA expiring on March 2021. This is one of the rare short term trading that I do and I'm fine with either results. If it loses steam, I'm okay because it was a small bet. If it skyrockets, I'm happy to ride it and see a 3x bagger.\n\nI'd say the max amount of market cap that you can see TSLA reaching in the near-term is $1T, with a high chance of it staying anywhere between $400B to $700B.\n\n3) Speaking of EV companies, I think the whole industry is going through a bubble phase, just like bitcoin, tech boom in 1990s, and real estate in early 2000s. This means we can benefit from the bullish move up as well. \n\nI haven't done enough research to know which companies are in a better position to benefit from the trend the most but NIO and XPEV seem to be in the spotlight: at the center of the largest EV market in the world, largest manufacturers in China, and strong sales momentum.\n\nPlease feel free to share your research or ideas about EV companies in here! [https://www.reddit.com/r/Midasinvestors/comments/jx9puq/share\\_your\\_ideas/](https://www.reddit.com/r/Midasinvestors/comments/jx9puq/share_your_ideas/)\n\n4) Ecommerce play: Ozon.\n\nAs some of you may already be aware, a Russian ecommerce company called Ozon will begin trading this week on NASDAQ. I haven't done deep dive into their financials yet but as you can imagine, it'd be hard to go wrong with the company as it is dubbed the \"Amazon of Russia\".\n\nTo paraphrase, George Soros famously says \"I buy into ideas first, then do the research after, because if it turns out it's bad idea, then I can sell it in a day. If it's a good idea, then I am ahead.\" This is from his book the Alchemy of Finance.\n\nBe on the lookout for this stock!\n\n**Trading plan**\n\n1) Bullish on tech stocks.\n\nDespite tech stocks being not as relevant in a normalized economy with not as much need for e-commerce platforms, I'm still bullish on broader digital consumer and enterprise spending. Favorite risk/reward plays at the moment are PDD, STNE, FVRR, FUTU, BABA, W, and SEDG.\n\n2) Bearish on long end yield curve.\n\nI continue to think yield curve steepening will play out in the medium term (3-6 months). We were caught off guard by the lack of steepening despite the vaccine news but it is likely due to the Fed continuing to purchase the longer end of the curve given a larger fiscal policy plans. \n\nI don't have any positions yet but I plan on shorting ZB futures soon.\n\n3) Bullish on gold.\n\nAs dollar gets weaker and inflatino steams ahead, gold will likely gain momentum upwards.\n\nStill not trading gold at the moment. Looking for a stronger catalyst.\n\n4) Bullish on EV market, with caution.\n\n**Changes**\n\nI plan on buying Ozon this week and potentially one or two of the Chinese EV companies depending on the price actions.\n\nThanks for reading!",
        "subreddit": "investing",
        "title": "My thoughts on the markets and some stock plays. See the comment for more analyses!",
        "url": "https://www.reddit.com/r/investing/comments/jztoip/my_thoughts_on_the_markets_and_some_stock_plays/",
        "created": 1606204442.0
    },
    {
        "author": "Luck-Yin",
        "created_utc": 1604492902,
        "id": "jnvu4i",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "1. The most fundamental reason for Ant’s postponement of listing is to touch the cake of the bank. The only way to buy the five funds is through Alipay. Of course, if you eat alone, others can't pass it.\n2. Systemic risk. \"Fintech companies' products such as \"Huabe\", \"White Tiao\", and \"Willful Payment\" have no essential difference between their cores and credit cards issued by banks. They also have the functions of credit supply and installment payment. Expenses are the main source of its profits; products such as \"borrowing\", \"gold bars\", and \"micro loans\" are not essentially different from the small loans provided by banks.\"\n3. Ant Financial does not need to back bank-level supervision, and can naturally increase its leverage to expand its capital volume.\n4. Use other people’s money to form a pool of funds, use other people’s money to lend, and then collect money in the name of technology. Is this determined by technology or by monopoly? There is nothing wrong with this game, and 70% of the loan proceeds go to Jack Ma; when something happens, 98% of the losses belong to others (and most of them are banks).\n\n&gt;**The user data is in Ant Financial, and Ant Financial can draw 70% of the bank. When everything is legal, these institutions will eventually be able to overwhelm state capital in this field, which is a structural advantage after monopoly.**\n\n&amp;#x200B;\n\n**So the reason why Ant Financial stopped is probably very simple:**\n\n* **You are a bank, re-submit the listing according to the bank's materials;**\n* **And you still have a lot of things incomparable with the bank**",
        "subreddit": "stocks",
        "title": "Why did Ant Group delay its IPO? Let me tell you.",
        "url": "https://www.reddit.com/r/stocks/comments/jnvu4i/why_did_ant_group_delay_its_ipo_let_me_tell_you/",
        "created": 1604521702.0
    },
    {
        "author": "spacej3di",
        "created_utc": 1605042251,
        "id": "jrtkg7",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "**Rotation from growth to value continues:**\n\n* Value outperformed growth by another \\~240 bps on Tuesday after Monday's 450 bp gap, which reversed four months of growth outperformance in one session. Came after favorable coronavirus vaccine news, which helped the rotation continue today. A vaccine breakthrough has long been flagged as the most powerful tailwind for a sustained rotation following the longstanding upside leadership of growth and momentum factors. There has also been some focus on positive economic and earnings surprise momentum as drivers, while analysts have highlighted extreme positioning and valuation divergences as well. In addition, while a split Congress has taken the likelihood of meaningful fiscal stimulus off the table, additional support is still coming. While value and cyclicals do face headwinds from worsening coronavirus trends, growth has also seemed to run up against some very elevated expectations, a dynamic evidenced by the lackluster reaction to strong Q3 earnings.\n\n**Growth sectors extend yesterday's historic underperformance:**\n\n* Growth sectors underperformed again. **Tech,** **consumer discretionary and** **communication services** were the only sectors lower with the FAANGs mostly down. Software, semis, restaurants, travel and leisure also among weaker groups. **Healthcare** an outperformer on gains across pharma and distributors, while hospitals mostly extended yesterday's gains. **Financials** ahead with insurers the best group, offsetting weakness across banks, particularly moneycenters. **Materials** led by chemicals. **Industrials** saw broad gains, particularly A&amp;D, rails, and electricals/multis. **Consumer staples** ahead with drug stores, tobacco, beverages among the best groups. **Energy** the best performer WTI higher as IOCs extended Monday's big gains.\n\n**Busy day of Fedspeak:**\n\n* **Dallas' Kaplan** (voter) told [Bloomberg](https://www.bloomberg.com/news/articles/2020-11-10/fed-s-kaplan-says-virus-resurgence-threatens-next-two-quarters?sref=J9GPLx1B) the next two quarters will be difficult, but he sees a strong 2021, expecting 3.5% growth. In [testimony](https://www.federalreserve.gov/newsevents/testimony/quarles20201110a.htm) to a Senate committee, **Vice Chair for Supervision Quarles** said bank strength remains intact with high liquidity and capital levels, **Boston's Rosengren** (non-voter) said in a [speech](https://www.bostonfed.org/-/media/Documents/Speeches/PDF/20201110-text.pdf) policymakers should watch for imbalances as they emerge, and that excessive risk-taking could prolong economic distress, based on previous cycles. **San Francisco's Daly** (non-voter) told [CNBC](https://www.cnbc.com/2020/11/10/fed-officials-in-robust-discussions-about-the-future-of-their-asset-purchase-program.html) that the Fed is in discussions over what more it can do around asset purchases and how the bank should plan communications around asset purchases moving forward. The Fed is currently purchasing \\~$120B a month in bonds, though many believe it could increase the amount and/or change the composition of purchases, though [WSJ](https://www.wsj.com/articles/fed-turns-attention-to-asset-purchases-after-spelling-out-low-rate-pledges-11604226601) noted broad skepticism that strategy would do much given already-low rates.\n\n**McConnell repeats call for limited stimulus package:**\n\n* Senate Majority Leader McConnell (R-KY) on Monday called for limited stimulus bill by year-end, in the wake of positive news on a coronavirus vaccine and falling unemployment ([Bloomberg](https://www.bloomberg.com/news/articles/2020-11-09/mcconnell-calls-for-smaller-stimulus-after-pfizer-vaccine-data?srnd=premium-asia&amp;sref=J9GPLx1B)). Also said this afternoon he will be speaking with House Leader Pelosi, though looking for highly targeted deal ([The Hill](https://thehill.com/homenews/senate/525364-mcconnell-pushing-for-highly-targeted-covid-relief-deal?__twitter_impression=true)). Other Republican senators warned getting a deal done in the lame duck session will be hard and signaled openness to wrapping a stimulus package into a spending bill needed to avoid a government shutdown on 11-Dec. Elsewhere, [WSJ](https://www.wsj.com/articles/stimulus-defense-bill-on-congresss-long-to-do-list-11605032240) noted President-elect Biden expected to play bigger role in stimulus discussion during lame duck to pave path for agreement before he takes office. While Senate Republicans have been focused on a bill worth \\~$500B, House Democrats have insisted it must be in excess of $2T. Odds of a stimulus bill before 2021 further complicated by Trump's refusal to concede and run-off elections in Georgia in early January that could determine control of Senate next year.\n\n**Vaccine breakthrough also brings key unanswered questions, logistical challenges:**\n\n* [Bloomberg](https://www.bloomberg.com/news/articles/2020-11-09/pfizer-vaccine-results-leave-questions-about-safety-longevity?srnd=premium&amp;sref=L75TRUmI) noted that amid all the excitement surrounding news the coronavirus vaccine candidate from Pfizer (PFE-US ) and BioNTech (BNTX-US ) was more than 90% effective in late-stage trials, there are still a number of issues to be sorted out. It highlighted uncertainty over how long the vaccine will confer protection and how many will benefit. Also pointed out the headline number says little about what kind of cases are being prevented. Added that vaccines like Pfizer's must be stored at ultra-cold temperatures. [WSJ](https://www.wsj.com/articles/the-next-big-challenge-after-a-covid-vaccine-is-giving-it-to-enough-people-11604945455?mod=hp_lead_pos1) also discussed the myriad logistical challenges surrounding production and distribution. Pointed out that even at a much better than expected efficacy rate of 90%, at least three-quarters of the population would have to be inoculated to achieve herd immunity and life may not return to normal until 2022.\n\n**Checking in on the bullish narrative:**\n\n* As has been the case for the better part of the last seven or eight months, the biggest tailwind for stocks seems to be the unprecedented fiscal and monetary policy response to the coronavirus pandemic, with BofA pegging the combined stimulus at over $21T. Vaccine optimism has also played a meaningful role, with recent news of a near-term breakthrough driving a rotation to value and cyclical plays. At the same time, there are thoughts that growth factors are likely to be protected by favorable secular themes. Resilient corporate earnings, largely a function of operating leverage, have been another widely discussed bright spot. The removal of the election overhang has also helped and the likelihood of a split Congress and no meaningful shift in tax and regulatory policy has overshadowed earlier hopes for more significant coronavirus and infrastructure stimulus.\n\n**Checking on the bearish narrative:**\n\n* While stimulus has been the big driver of the bullish narrative for stocks, there continue to be concerns about depleted monetary policy arsenals and worries central banks are increasingly is pushing on a string. In addition, there is no appetite for meaningful fiscal stimulus in a Republican controlled Senate. Worsening coronavirus trends have been largely overshadowed by vaccine optimism but represent a headwind on growth, even without a return to the draconian lockdown measures seen early on in the pandemic. A rotation out of growth has some broader market implications given the extent to which the S&amp;P 500 is concentrated in big tech. There are also potential risks from the bond market given the massive inflows driven by a reach for yield. While earnings beat rates have been strong, they have benefited from bombed-out expectations and the bar is moving higher.\n\n**Supreme Court signals it is unlikely to strike down Obamacare**\n\n* [Politico](https://www.politico.com/news/2020/11/10/supreme-court-obamacare-kavanaugh-435711), the [NY Times](https://www.nytimes.com/2020/11/10/us/supreme-court-obamacare-aca.html) and other outlets discussed how the Supreme Court on Tuesday signaled that Obamacare would likely survive its third major legal challenge. Noted that at least five justices, including two members of the court's conservative majority, suggested the individual mandate was severable from the rest of the law. Other conservative justices also expressed doubt about whether Congress' decision to scrap the penalty for failing to secure health insurance because it could be no longer be justified as a tax, caused any harm to the plaintiffs. While the case has been widely viewed as weak, there still have been concerns about the fate of Obamacare under the court's enhanced conservative majority. This development has driven the outperformance of managed care (particularly managed Medicare) and hospital stocks.\n\n**Amazon under regulatory scrutiny in Europe:**\n\n* European Commission filed charges against Amazon (AMZN-US ) on Tuesday after it concluded it breached antitrust rules by using third-party sellers' data for its own benefit. EU launched probe into Amazon in June 2019 and WSJ reported in June of this year it was planning formal antitrust challenges. Brussels said today it is also launching a second investigation into Amazon's e-commerce processes. While big tech has come under heightened regulatory scrutiny in both the US and Europe, it has not been much on overhang on equity sentiment as the group has been a big beneficiary of its leverage to secular growth and disruption themes, several aspects of which have been accelerated by the coronavirus. The bigger threat to the group from near-term perspective seems to be a vaccine-driven rotation from these very crowded longs to under-owned value and cyclical plays.\n\n**NextEra rebuffed by Evergy, Lowe's not in talks to acquire HD Supply, Justice Department clears Uber purchase of Postmates:**\n\n* [Reuters](https://uk.reuters.com/article/evergy-ma-nextera-energy/exclusive-nextera-energy-in-15-billion-bid-for-evergy-sources-idUKL1N2HV2J0) reported that **NextEra** (NEE-US ), the world's largest producer of solar and wind energy, made a \\~$15B all-stock offer to acquire US power utility **Evergy** (EVRG-US ). However, Evergy rejected the offer and it is unclear whether NextEra, which was also recently rebuffed buy Duke Energy (DUK-US ), will make a new approach. **Lowe's** (LOW-US ) said in a [statement](https://www.streetaccount.com/EmailSearchHandler.axd?guid=9a8c0f36-641d-4398-b382-a4e7dacf3827&amp;press_release=true&amp;ticker=HDS&amp;iid=2911999) that it is not in discussions with **HD Supply** (HDS-US ) about a transaction. Followed earlier [Bloomberg](https://www.bloomberg.com/news/articles/2020-11-09/lowe-s-is-said-to-be-in-talks-to-acquire-hd-supply?sref=L75TRUmI) report that said the companies were discussing a deal. [Axios](https://www.axios.com/doj-clears-uber-postmates-deal-566fed38-2d2a-4a1d-95af-45fd61df57bc.html) cited a source familiar with the deal who said the Justice Department has cleared **Uber**'s (UBER-US ) $2.65B all-stock deal to acquire food delivery company **Postmates**. **Adobe** (ADBE-US ) confirmed agreement to acquire privately held **Workfront**, a work management platform for marketers, for $1.5B.\n\n**Post-election transition slowed by legal challenges:**\n\n* [Axios](https://www.axios.com/bill-barr-voter-fraud-investigations-7bfc378a-35f8-467f-9e74-10aa57c8c7d5.html) noted that President Trump has refused to concede the election to President-elect Biden, reiterating allegations of widespread voter fraud and corruption despite a lack of specific evidence. Added that his claims have been shot down by Democratic and Republican secretaries of state. [Bloomberg](https://www.bloomberg.com/news/articles/2020-11-09/trump-campaign-s-legal-blitz-isn-t-targeting-enough-votes-to-win?sref=L75TRUmI) also discussed how Trump's legal challenges are unlikely to gain any meaningful traction. However, [NY Times](https://www.nytimes.com/2020/11/09/us/politics/republicans-trump-concede-2020-election.html?campaign_id=4&amp;emc=edit_dk_20201110&amp;instance_id=23967&amp;nl=dealbook&amp;regi_id=33659448&amp;segment_id=44093&amp;te=1&amp;user_id=2b41d3782bf056154514beb0de555f4d) pointed out that leading Republicans have coalesced around Trump's strategy. In addition, the [AP](https://apnews.com/article/election-2020-joe-biden-donald-trump-elections-voting-fraud-and-irregularities-4eeb9e0c97301a23ae8d05b54c3144fd) reported Attorney General Barr has authorized US attorneys to investigate alleged voter fraud. [Reuters](https://www.bloomberg.com/news/articles/2020-11-10/biden-transition-team-calls-on-federal-agency-to-declare-winner?sref=L75TRUmI) said the Biden transition team is considering legal action to force the General Services Administration to designate him the winner so that it can begin accessing federal resources needed to ensure an orderly transfer of power.\n\n**Political fight brewing over whether to extend Fed's emergency facilities:**\n\n* [NY Times](https://www.nytimes.com/2020/11/09/business/economy/federal-reserve-emergency-loans.html) discussed how a political fight is brewing over whether to extend the Fed's emergency loan programs, which expire on 31-Dec. Paper said that while the Fed might be inclined to keep the programs in effect, Treasury Secretary Mnuchin has signaled he would prefer to end the one that purchases municipal bonds, and has come under heightened pressure from Republicans to allow all five of the Treasury-funded programs to lapse. However, some Democrats had been looking to the municipal program as a backup option if Congress fails to pass additional funds for state and local governments. Paper highlighted some debate about the potential market impact of ending the programs. While they have seen little use, they have been a big part of the powerful Fed signaling effect that quickly helped repair credit markets earlier this year.",
        "subreddit": "stocks",
        "title": "Top Market News - Tuesday, Nov. 10, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/jrtkg7/top_market_news_tuesday_nov_10_2020/",
        "created": 1605071051.0
    },
    {
        "author": "student123321",
        "created_utc": 1606267931,
        "id": "k0ifd4",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "  \n\nHi Everyone, \n\nWe are a group of Ivey Business School students from Canada, researching about art investment space.   \n \n\nWe believe that the current art market space has been lacking attention from the general population as a form of investment. Although there are plenty of art auction websites and places, art has still been an illiquid form of investment for many. From this survey, we hope to learn about how you all think about art as an asset class and your interest in this market. \n\nWe will randomly pick a survey participant for the prize of a $150 Visa/Mastercard gift card.\n\nPlease use the survey link @ below:\n\n[https://artmarket.surveysparrow.com/s/Facebook-Survey---Clone/tt-e449f786ac?fbclid=IwAR2J\\_4oSLU2CPQIjGQJuWjr0\\_Ef46vei\\_XW1xEgrY7FW0CYD1iFFBXfbxK0](https://artmarket.surveysparrow.com/s/Facebook-Survey---Clone/tt-e449f786ac?fbclid=IwAR2J_4oSLU2CPQIjGQJuWjr0_Ef46vei_XW1xEgrY7FW0CYD1iFFBXfbxK0)\n\nIf you have any questions/concerns about the survey, please contact the email below: \n\nkkrish5@uwo.ca\n\nThank you!",
        "subreddit": "investing",
        "title": "Art as an investment",
        "url": "https://www.reddit.com/r/investing/comments/k0ifd4/art_as_an_investment/",
        "created": 1606296731.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1604517215,
        "id": "jo2vwo",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "https://www.marketwatch.com/story/visa-and-mastercard-have-a-lot-in-common-but-covid-19-puts-one-key-difference-in-focus-11604090026\n\nConsumers have been showing an increasing preference for debit cards versus credit cards given the weak economic climate brought on by the pandemic, and right now this skew favors Visa V , which has a larger debit business. Visa generated 52% of its volume in the September quarter from debit transactions, compared with 44% for Mastercard MA .\n\nIn normal recessionary times, debit stays strong for a while before a swing back into credit takes place after a few years, Ellis said, but the COVID-19 crisis adds a new dimension. In addition to the cyclical shift toward debit because of the pandemic, there’s also been a step up in cash displacement, which is a secular trend that she expects to continue. Much of that movement from cash to cards seems to be happening through debit.\n\nEllis said that the debit trends are one reason she tilts toward Visa shares over Mastercard’s these days, though she has buy ratings on both names. She’s also upbeat about the company’s Visa Direct platform, which allows for “push” payments, a popular way for gig economy companies to pay drivers and delivery people. Mastercard has its own version of this, called Send, but Ellis said Visa is investing more in this area and may be benefitting from its larger scale.",
        "subreddit": "stocks",
        "title": "Visa and Mastercard have a lot in common, but COVID-19 puts one key difference in focus",
        "url": "https://www.reddit.com/r/stocks/comments/jo2vwo/visa_and_mastercard_have_a_lot_in_common_but/",
        "created": 1604546015.0
    },
    {
        "author": "lykosen11",
        "created_utc": 1604756774,
        "id": "jpr2v1",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "I am a known massive proponent for the transaction fintechs, and have written a multitude of posts on them in the last 3 years. Apart from diligent financial analysis and modeling, the largest reason for these massive long positions is Sweden.\n\nSweden is a world leader of digital payments, spawning multiple large fintechs platforms, such as Swish (Sweden domestic only), Klarna (Global payments), and iZettle (PayPal acquisition). As one of the world leaders of fintech, I use what works in Sweden to project into the US.\n\nIn the latest Central Bank (Riksbanken) report, Swish (Swedish Venmo/Cashapp) has surpassed total cash usage. It's used eveywhere, by everyone. Combine this potential future with Cashapp and Venmo (both of which show profitable margins), the potential for Square &amp; PayPal is much larger than is currently priced in. These stocks may look very over valued as of now, if you draw a line between where their e wallets are now to where swish is in Sweden, they have very very far to go.\n\nSQ is especially hot as of this week after a smash earnings, but I have a massive conviction that this isn't the last smash quarter they will have. Over the next 5 years I am extremely confident they will both outperform the market in raw e-wallet growth. For the first time, cash will be monitized by private corporations. You don't want to miss it.\n\nI mostly made this post for people who doesn't know how far e wallets have come in frontiers. In 5 years, cash will be very very close to dead in sweden. In 20, it'll be gone. Someone will profit and perhaps become the visa / Mastercard of the new age. \n\nPs: \"hur durr bitcoin &amp; crypto will deseat fiat currencies\". PayPal and Square are the two largest corporations currently investing heavily into crypto. If the stable cryptocurrencies is part of our fintech future, no large company will profit as much as they. Get in.\n\nDisclosure: Gargantuan Square position and large PayPal.",
        "subreddit": "StockMarket",
        "title": "Swish (Venmo/Cashapp/Ewallet) of Sweden Surpasses Cash in Transaction Volume!",
        "url": "https://www.reddit.com/r/StockMarket/comments/jpr2v1/swish_venmocashappewallet_of_sweden_surpasses/",
        "created": 1604785574.0
    },
    {
        "author": "pabsgu46",
        "created_utc": 1604891272,
        "id": "jqppkw",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Watchlist 11-09-20 👀\n\nKeeping the list short due to the volatility of the market.\n\n$APVO – HUGE RUN!! HIGH of Friday was $83.33; it ran four days in a row for 1200%+ Perfect scalp, if you can find a good entry. Be SUPER CAUTIONS. Make sure to check your indicators. \n\n$POLA  - Waiting for news and turning bullish on the 200 MACD. Could see a possible run to #.63 on the  61.8% Fibonacci chart.\n\n$BLNK -  ER are coming up and looking bullish uptrend to the Fibonacci chart  at $10.90 for some resistance, but if it goes above the $10.90 and finds support then it go up to $13.18.\n\n$TBLT - recently reported their revenue on amazon sales. They have ER coming up soon as well. They are projected to crush earnings.\n\n$IDEX - Cheap EV play. Currently bottomed. 50MA could bounce off 200MA. And hit a serious run. Technicals are aligned.\n\n$SNDL – A favorite marijuana stock. Has been running under all the MA (20,50, 100, 200). Did make a nice run to $0.53. Again find a good entry and get out. \n\n$RKT has ER tomorrow and I fully expect them to blow the numbers out of the water and beat expectations by 50+ %\n\n$GEVO – Running on an uptrend on the 200 MA. Looking like it could go towards the Fibonacci chart 61.8% at $1.23. \n\nOnce AGAIN Devil’s lettuce Backburners: $TLRY $HEXO $ ACB $APHA $OGI $VFF $AMRS $GRWG $CRON $CGC\n\nBackburners: $WAFU $PRPH $GBX $PLUG $FCEL $PLM $IRMN $SALM $PECK $OEG",
        "subreddit": "pennystocks",
        "title": "Watchlist 11-09-20 👀",
        "url": "https://www.reddit.com/r/pennystocks/comments/jqppkw/watchlist_110920/",
        "created": 1604920072.0
    },
    {
        "author": "pabsgu46",
        "created_utc": 1605668085,
        "id": "jw7q7b",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Watchlist 11-18-20 👀\n\n$KZIA - NEWS AH, Kazia Presents Further Paxalisib Data At Sno, Confirming Earlier Positive Safety And Efficacy Signals In Glioblastoma Reached a HOD of $16.38 AH. Has found support $8.80. NO PT possible good scalp.\n\n$MDLY – Today movement to third quarter earning report for 11/16. Short term bullish on the YTD. AH ran to the 200ma to $10.00 pass all the MA. Could see some more movement premarket.\n\nTECHNICALS:\n\n$UAVS - one white soldier reversal off oversold downtrend on 4hr StochRSI and KDJ (premarket gapper candidate)\n\n$WWR - deliberate bearish harami candlestick pattern. I feel is heavy manipulation. Basically the run was completely overtook by market makers. Expect heavy manipulation moving forward but tremendous upside potential on a long hold with analysts PTs of $150+\n\n$SPR - recently given PT of $29 yet continues to run bullish with 52 week high of $92.81 and a gap being filled to $36.83 with current price at $34.35 at the close of AH trading.\n\n$POLA – Cup handle bullish uptrend reversal pattern on the descending wedge(handle)\n\n$TTNP - post ER run continuation\n\n$UONEK &amp; $UONE - BIG Insider buy by the CEO 274K shares.\n\n$CARV - getting pumped by social media influencers PT by $10.\n\n$SAVA - oversold post offering announcement $8 and under is a steal.\n\n$NAKD - facing delisting soon. Dead cat bounce in affect\n\nBackburners $FUBO $NETE $NVIV $MARA $RIOT $PLTR $DNKG $MOGO",
        "subreddit": "smallstreetbets",
        "title": "Watchlist 11-18-20 👀",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/jw7q7b/watchlist_111820/",
        "created": 1605696885.0
    },
    {
        "author": "Swamy_ji",
        "created_utc": 1606439614,
        "id": "k1rih5",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Hi All, \n\nI have invested in multiple stocks, but during the start I bought one of MSFT, MASTERCARD, FB, VISA, and XOM is at a loss. Bought them at the start but realized should have bought more to see the growth. Is it worth to keep or should I sell and invest in other stocks to see more gains?\n\nThanks!\n\nFellow Redditor",
        "subreddit": "stocks",
        "title": "Should I Adjust?",
        "url": "https://www.reddit.com/r/stocks/comments/k1rih5/should_i_adjust/",
        "created": 1606468414.0
    },
    {
        "author": "Definetlynotgay420",
        "created_utc": 1605569867,
        "id": "jvhzif",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "What do you guys think about Discover I’m starting to buy into it because while it may not be as big as MasterCard and Visa it has a good dividend and most potential for growth out of the three IMO thoughts?",
        "subreddit": "stocks",
        "title": "Discover Financial services",
        "url": "https://www.reddit.com/r/stocks/comments/jvhzif/discover_financial_services/",
        "created": 1605598667.0
    },
    {
        "author": "varpino7",
        "created_utc": 1605302238,
        "id": "jtopx3",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "I’ve owned shares of Alibaba for a while and it’s been awesome for me. Like a true autist , I wasn’t satisfied and had to buy February calls. Am I fucked? Is Jack Ma going to end up in a body bag? I have nearly 11k out my 14k portfolio in shares and the call. Somebody help me \n\nPositions: 30 shares @ $240\nFeb 19 ‘21 $270 call purchased @ 20.80",
        "subreddit": "wallstreetbets",
        "title": "Chinese Finger Puzzle",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jtopx3/chinese_finger_puzzle/",
        "created": 1605331038.0
    },
    {
        "author": "heythere1000349",
        "created_utc": 1606259507,
        "id": "k0g33i",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "I started investing back in January right before Covid ( I know bad timing )what do u guys think of my stocks I’m in right now ? \n\nLong term investments MA,WM,ABBV,BIDU,SU.TO,GLDD. And these are ones I got after Covid hit. BA,DAL,SPCE. Thoughts ?",
        "subreddit": "stocks",
        "title": "Thoughts on my portfolio?",
        "url": "https://www.reddit.com/r/stocks/comments/k0g33i/thoughts_on_my_portfolio/",
        "created": 1606288307.0
    },
    {
        "author": "pgh1979",
        "created_utc": 1606166097,
        "id": "jzqod4",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "XPEV is a Alibaba company. People who are Jack Ma fans probably had dry powder for the Ant IPO. As that gt postponed they are putting it into XPEV.",
        "subreddit": "wallstreetbets",
        "title": "ANT and XPEV",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jzqod4/ant_and_xpev/",
        "created": 1606194897.0
    },
    {
        "author": "CautiousInvestor",
        "created_utc": 1605296146,
        "id": "jtmk8c",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "Chinese President Xi Jinping halted Ant Group's historic $37 billion initial public offering after its founder, Jack Ma, criticized government leaders",
        "url": "https://www.reddit.com/r/investing/comments/jtmk8c/chinese_president_xi_jinping_halted_ant_groups/",
        "created": 1605324946.0
    },
    {
        "author": "king-ish",
        "created_utc": 1605413288,
        "id": "jufr2e",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "I’m new to investing, started this year and have about 6 ETF’s in my taxable account. My Roth IRA is pretty straight forward &amp; conservative. \n\nI definitely have some overlap in my funds but the holding percent &amp; growth it could see is why I have that. I’m not married to $FDIS $FHLC for 30+ years but like the potential of those two. \n\nSPlG - SPDR Portfolio S&amp;P 500 ETF\nExpense Ratio\n0.03%\n\nTOP 10 HOLDINGS\nCOMPANY\tSYMBOL\t                TOTAL NET ASSETS\nApple Inc.\tAAPL\t                                6.67%\nMicrosoft Corp.\tMSFT\t                         5.70%\nAmazon.com Inc.\tAMZN\t                 4.80%\nFacebook Inc. Cl A\tFB\t                         2.26%\nAlphabet Inc. Cl A\tGOOGL\t                  1.58%\nAlphabet Inc. Cl C\tGOOG\t                  1.55%\nBerkshire Hathaway Inc. BRK.B\t           1.51%\nJohnson &amp; Johnson\tJNJ\t           1.40%\nProcter &amp; Gamble Co.\tPG\t                   1.24%\nVisa Inc. Cl A\tV\t                                  1.21%\n\n\nITOT - iShares Core S&amp;P Total US Stock Market ETF\nExpense Ratio\n0.03%\n\nTOP 10 HOLDINGS\nCOMPANY\tSYMBOL\t             TOTAL NET ASSETS\nApple Inc.\tAAPL\t                              5.53%\nMicrosoft Corp.\tMSFT\t                       4.73%\nAmazon.com Inc.\tAMZN\t               3.98%\nFacebook Inc. Cl A\tFB\t                      1.87%\nAlphabet Inc. Cl A\tGOOGL\t               1.31%\nAlphabet Inc. Cl C\tGOOG\t               1.28%\nBerkshire Hathaway Inc. BRK.B\t        1.25%\nJohnson &amp; Johnson\tJNJ\t        1.16%\nProcter &amp; Gamble Co.\tPG\t                1.03%\nVisa Inc. Cl A\tV\t                               1.00%\n\n\n\nSMSP - SPDR portfolio S&amp;P 600 Small Cap ETF\nExpense Ratio\n0.05%\n\nTOP 10 HOLDINGS\nCOMPANY\tSYMBOL\t               TOTAL NET ASSETS\nMomenta Pharmaceuticals Inc          0.93%\nStamps.com Inc.\tSTMP\t               0.63%\nSimpson Manufacturing Co.\t       0.63%\nMeritage Homes Corp.\tMTH\t       0.62%\nNeogen Corp.\tNEOG\t                      0.62%\nNeoGenomics Inc.\tNEO\t               0.61%\nKinsale Capital Group Inc.\t               0.60%\nExponent Inc.\tEXPO\t                      0.55%\nProto Labs Inc.\tPRLB\t                      0.52%\nUFP Industries Inc.\tUFPI\t               0.52%\n\n\nFTEC - Fidelity MSCI Information Technology Index ETF\nExpense Ratio\n0.08%\n\nTOP 10 HOLDINGS\nCOMPANY\tSYMBOL\t              TOTAL NET ASSETS\nApple Inc.\tAAPL\t                            21.94%\nMicrosoft Corp.\tMSFT\t                     16.55%\nVisa Inc. Cl A\tV\t                             3.69%\nNVIDIA Corp.\tNVDA\t                     3.64%\nMastercard Inc.\tMA\t                             3.30%\nAdobe Inc.\tADBE\t                             2.58%\nSalesforce.com Inc.\tCRM\t      2.47%\nPayPal Holdings Inc.\tPYPL\t      2.40%\nIntel Corp.\tINTC\t                            2.40%\nCisco Systems Inc.\tCSCO\t             1.82%\n\n\nFHLC - Fidelity MSCI Health Care Index ETF\nExpense Ratio\n0.08%\n\nTOP 10 HOLDINGS\nCOMPANY\tSYMBOL\t          TOTAL NET ASSETS\nJohnson &amp; Johnson\tJNJ\t               8.18%\nUnitedHealth Group Inc.\tUNH\t       6.17%\nMerck &amp; Co. Inc.\tMRK\t                      4.37%\nPfizer Inc.\tPFE\t                                             4.25%\nAbbott Laboratories\tABT\t               4.02%\nThermo Fisher Scientific Inc.\tTMO\t3.64%\nAbbVie Inc.\tABBV\t                                     3.23%\nAmgen Inc.\tAMGN\t                                     3.12%\nMedtronic PLC\tMDT\t                              2.91%\nDanaher Corp.\tDHR\t                              2.86%\n\n\nFDIS - Fidelity MSCI Consumer Discretionary Index ETF\nExpense Ratio\n0.08%\n\nTOP 10 HOLDINGS\nCOMPANY\tSYMBOL\t       TOTAL NET ASSETS\nAmazon.com Inc.\tAMZN\t        32.20%\nTesla Inc.\tTSLA\t                       7.68%\nHome Depot Inc.\tHD\t                7.20%\nMcDonald's Corp.\tMCD\t        3.94%\nNike Inc. Cl B\tNKE\t               3.76%\nLowe's Cos.\tLOW\t               3.02%\nStarbucks Corp.\tSBUX\t        2.42%\nTarget Corp.\tTGT\t               1.90%\nBooking Holdings Inc.\tBKNG\t1.69%\nTJX Cos.\tTJX.                      \t1.61%",
        "subreddit": "investing",
        "title": "Can some review my Taxable account 😱",
        "url": "https://www.reddit.com/r/investing/comments/jufr2e/can_some_review_my_taxable_account/",
        "created": 1605442088.0
    },
    {
        "author": "pabsgu46",
        "created_utc": 1604974716,
        "id": "jrc4hq",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Watchlist 11-10-20 👀\n\nKeeping the list short due to the volatility of the market.\n\n$HCDI – AH NEWS Lennar Corporation Purchases an Additional 66 Lots at Soundview Estates from Harbor Custom Development, In Over the 20 ma and AH hit $8.04, with covid vaccine on the way many real-estate stocks are trading bullish.\n\n$SNDL – Still A favorite marijuana stock. Running under all the MA (20,50, 100, 200). Did make a nice run AH again $0.50. Again find a good entry and get out.\n\n$MEDS – MEDS agreed to promote and market \nAmazon’s storage lockers, a secure, self-service kiosk and pick-up program. The market is responding to this new that occurred on 11/03/20 remember stocks that carries Amazon in the headline holds weight in the market.200 MA shows it is on an uptrend AH hours ran to $5.94. Could see a possible run to $6.41 on the Fibonacci chart.\n\n$AAL- Airlines and cruise ships started recovering today on the news of Pzifer vaccine preventing 90% of covid infection.\n\n$FSKR – Possible swing. EVs are in play with the new administration. Also\nFORM S-1 was file today with SEC. https://www.sec.gov/Archives/edgar/data/0001720990/000119312520289193/d92481ds 1.htm\n\n$UONE - had a strong close and forming a uptrend. Any news could have this one running like back in June, but for now looking for a break resistant at $6.95.\n\nOne more time Devil’s lettuce Backburners: $TLRY $CGC $HEXO $ ACB $APHA $OGI $VFF $AMRS $GRWG $CRON\n\nBackburners: $KERN $IGC $PECK $BLNK $AHT $IHT $NIO",
        "subreddit": "RobinHoodPennyStocks",
        "title": "Watchlist 11-10-20 👀",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/jrc4hq/watchlist_111020/",
        "created": 1605003516.0
    },
    {
        "author": "JJonesTrader89",
        "created_utc": 1606323537,
        "id": "k0vw6o",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[https://www.otcmarkets.com/stock/TAUG/news/Tauriga-Sciences-Inc-Officially-Transitions-its-E-Commerce-Payment-Process](https://www.otcmarkets.com/stock/TAUG/news/Tauriga-Sciences-Inc-Officially-Transitions-its-E-Commerce-Payment-Processing-to-Square-Inc--is-Now-Approved-to-Accept-A?id=281503) \n\nThe Company’s E-Commerce Platform No Longer has Any Individual Transaction ($) Dollar Limit Imposed\n\nNEW YORK, NY, Nov. 25, 2020 (GLOBE NEWSWIRE) -- via [NewMediaWire](https://www.globenewswire.com/Tracker?data=BaqPWWcSJJ5hcn_38gFXEsiyV--CE2Hc4dqUuc-5tsNI3sjEA-yPNDiMPq1YsEa89pU6Ink2SYGbGxpbA3xudzmkxEc-cMEIDtbgbl3oYwI=) \\-- Tauriga Sciences, Inc. (OTCQB: TAUG) (“Tauriga” or the “Company”), a revenue generating, diversified life sciences company, with a proprietary line of functional “supplement” chewing gums (Flavors: Pomegranate, Blood Orange, Peach-Lemon, Pear Bellini, Mint, Black Currant) as well as two ongoing Biotechnology initiatives, today announced the official transition of its E-Commerce payment processing to Square Inc. (“Square”).  From now on, the Company’s E-Commerce platform no longer has type of individual transaction ($) limit imposed (previously it had been set at $3,000).  The Company is also pleased to disclose that its E-Commerce website ([www.taurigum.com](https://www.globenewswire.com/Tracker?data=BKEA8gi3mgLSo43GqCHQqKgEOlQrOkaaxvq_ffQvUdIl60JeiamqXwiigUTYpwVfRnKbS7YzhXU9ZgmAzgkAng==)) is now approved to accept American Express credit cards for online payments (previously this was limited to: Visa and Mastercard).[ing-to-Square-Inc--is-Now-Approved-to-Accept-A?id=281503](https://www.otcmarkets.com/stock/TAUG/news/Tauriga-Sciences-Inc-Officially-Transitions-its-E-Commerce-Payment-Processing-to-Square-Inc--is-Now-Approved-to-Accept-A?id=281503)",
        "subreddit": "pennystocks",
        "title": "$TAUG Tauriga Sciences, Inc. Officially Transitions its E-Commerce Payment Processing to Square Inc. &amp; is Approved to Accept American Express Credit Cards",
        "url": "https://www.reddit.com/r/pennystocks/comments/k0vw6o/taug_tauriga_sciences_inc_officially_transitions/",
        "created": 1606352337.0
    },
    {
        "author": "pizza_and_cats",
        "created_utc": 1604412449,
        "id": "jnauj1",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Ant Group’s world record-setting initial public offering (IPO) in Shanghai and Hong Kong has been suspended.\n\nThe Shanghai and Hong Kong stock exchanges made the announcement on Tuesday.\n\nAnt Group’s controller Jack Ma, the executive chairman Eric Jing and CEO Simon Hu were summoned and interviewed by regulators in China.\n\nThe Shanghai Stock Exchange said Ant Group reported “significant issues,” which means it may not meet the conditions for listing or “information disclosure requirements.”\n\nAnt Group's record $34.5 billion IPO in Shanghai and Hong Kong suspended\n\nhttps://www.cnbc.com/2020/11/03/ant-group-ipo-in-shanghai-suspended.html?__source=androidappshare",
        "subreddit": "stocks",
        "title": "Ant Group’s record $34.5 billion IPO in Shanghai and Hong Kong suspended",
        "url": "https://www.reddit.com/r/stocks/comments/jnauj1/ant_groups_record_345_billion_ipo_in_shanghai_and/",
        "created": 1604441249.0
    },
    {
        "author": "lazyassman",
        "created_utc": 1605352114,
        "id": "ju0du5",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "How much can the CCP keep fucking Jack Ma? Thinking about getting some yolo turbo calls.",
        "subreddit": "wallstreetbets",
        "title": "BABA going below $250?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ju0du5/baba_going_below_250/",
        "created": 1605380914.0
    },
    {
        "author": "Andyong558",
        "created_utc": 1604325631,
        "id": "jmnvhu",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "Apps to set price alert with MA",
        "url": "https://www.reddit.com/r/investing/comments/jmnvhu/apps_to_set_price_alert_with_ma/",
        "created": 1604354431.0
    },
    {
        "author": "Maitai_Haier",
        "created_utc": 1605236247,
        "id": "jt9975",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[https://www.wsj.com/articles/china-president-xi-jinping-halted-jack-ma-ant-ipo-11605203556?mod=djemalertNEWS](https://www.wsj.com/articles/china-president-xi-jinping-halted-jack-ma-ant-ipo-11605203556?mod=djemalertNEWS)\n\n Chinese President Xi Jinping personally made the decision to halt the initial public offering of Ant Group, which would have been the world’s biggest, after controlling shareholder Jack Ma infuriated government leaders, according to Chinese officials with knowledge of the matter.\n\nThe rebuke was the culmination of years of tense relations between China’s most celebrated entrepreneur and a government uneasy about his influence and the [rapid growth of the digital-payments behemoth](https://www.wsj.com/articles/jack-mas-giant-financial-startup-is-shaking-the-chinese-banking-system-1532885367?mod=article_inline) he controlled.\n\nMr. Xi, for his part, has displayed a diminishing tolerance for big private businesses that have amassed capital and influence—and are perceived to have challenged both his rule and the stability craved by factions in the country’s newly assertive Communist Party.\n\nIn a speech on Oct. 24, days before [the financial-technology giant was set to go public](https://www.wsj.com/articles/inside-ant-the-company-behind-the-worlds-biggest-ipo-11603798576?mod=article_inline), Mr. Ma cited Mr. Xi’s words in what top government officials saw as an effort to burnish his own image and tarnish that of regulators, these people said.\n\nAt the event in Shanghai, Mr. Ma, the country’s richest man, quoted Mr. Xi saying, “Success does not have to come from me.” As a result, the tech executive said, he wanted to help solve China’s financial problems through innovation. Mr. Ma bluntly criticized the government’s increasingly tight financial regulation for holding back technology development, part of a long-running battle between Ant and its overseers.\n\nMr. Xi, who read government reports about the speech, and other senior leaders were furious, according to the officials familiar with the decision-making. Mr. Xi ordered Chinese regulators to investigate and all but shut down Ant’s initial public offering, the officials said, setting in motion a series of events that led to[ the deal’s suspension on Nov. 3.](https://www.wsj.com/articles/ant-group-ipo-postponed-by-shanghai-stock-exchange-11604409597?mod=article_inline) Investors around the world already had committed to paying more than $34 billion for Ant’s shares. It isn’t clear whether it was Mr. Xi or another government official who first suggested the shutdown.\n\nAnt declined to comment, and Mr. Ma couldn’t be reached. The Information Office of the State Council, China’s cabinet, didn’t respond to questions.\n\nSince Mr. Xi rose to power in late 2012, the government has taken action against some of the country’s highest-profile private conglomerates. Dalian Wanda Group’s Wang Jianlin, [once China’s richest man](https://www.wsj.com/articles/chinas-richest-man-makes-his-move-on-hollywood-1475256816?mod=article_inline), and Wu Xiaohui of Anbang Insurance Group, are among the prominent entrepreneurs who [faced government crackdowns](https://www.wsj.com/articles/anbang-insurances-wu-xiaohui-sentenced-to-18-years-in-prison-1525923337?mod=article_inline).",
        "subreddit": "investing",
        "title": "China’s President Xi Jinping Personally Scuttled Jack Ma’s Ant IPO",
        "url": "https://www.reddit.com/r/investing/comments/jt9975/chinas_president_xi_jinping_personally_scuttled/",
        "created": 1605265047.0
    }
]