[
    {
        "author": "AutoModerator",
        "created_utc": 1606824473,
        "id": "k4jnqt",
        "num_comments": 4571,
        "num_crossposts": 0,
        "selftext": "Please use this thread to discuss your portfolio, learn of other stock tickers, and help out users by giving constructive criticism.\n\nWhy quarterly?  Public companies report earnings quarterly; many investors take this as an opportunity to rebalance their portfolios.  We highly recommend you do some reading:  A list of [relevant posts &amp; book recommendations.](https://www.reddit.com/r/stocks/wiki/index#wiki_relevant_posts_.26amp.3B_book_recommendations)\n\nYou can find stocks on your own by using a scanner like your broker's or [Finviz.](https://finviz.com/screener.ashx)  To help further, here's a list of [relevant websites.](https://www.reddit.com/r/stocks/wiki/index#wiki_relevant_websites.2Fapps)\n\nIf you don't have a broker yet, see our [list of brokers](https://www.reddit.com/r/stocks/wiki/index#wiki_brokers_for_investing) or search old posts.  If you haven't started investing or trading yet, then setup your [paper trading.](https://www.reddit.com/r/stocks/wiki/index#wiki_is_there_a_way_to_practice.3F)\n\nBe aware of [Business Cycle Investing](https://eresearch.fidelity.com/eresearch/markets_sectors/sectors/si_business_cycle.jhtml?tab=sibusiness) which Fidelity issues updates to the state of global business cycles every 1 to 3 months (note: Fidelity changes their links often, so search for it since their take on it is enlightening).  [Investopedia's take on the Business Cycle](https://www.investopedia.com/articles/investing/061316/business-cycle-investing-ratios-use-each-cycle.asp) and their [video.](https://www.investopedia.com/video/play/business-cycle/)\n\nIf you need help with a falling stock price, check out Investopedia's [The Art of Selling A Losing Position](https://www.investopedia.com/articles/02/022002.asp) and their [list of biases.](https://www.investopedia.com/articles/stocks/08/capital-losses.asp)\n\nHere's a list of all the [previous portfolio stickies.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22Rate+My+Portfolio%22+-+r%2FStocks+Quarterly+Thread&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all)",
        "subreddit": "stocks",
        "title": "Rate My Portfolio - r/Stocks Quarterly Thread December 2020",
        "url": "https://www.reddit.com/r/stocks/comments/k4jnqt/rate_my_portfolio_rstocks_quarterly_thread/",
        "created": 1606853273.0
    },
    {
        "author": "cyanlce",
        "created_utc": 1607082851,
        "id": "k6jjm3",
        "num_comments": 815,
        "num_crossposts": 0,
        "selftext": "WSB is the 7th largest holder of GME.\n\n[**Top holders**](http://news.gamestop.com/stock-information/institutional-ownership)\n\nHolder|Shares|% O/S\n:--|--:|--:|\nFidelity|9,534,090|14.6%\nBlackRock|7,897,907|12.1%\nRC Ventures|6,500,000|10.0%\nVanguard|5,288,116|8.1%\nSusquehanna|4,444,128|6.8%\nDimensional Fund Adv|3,948,114|6.1%\nWall Street Bets|3,803,770|5.8%\nSenvest|3,610,740|5.5%\nDonald Foss|3,515,200|5.4%\nMust Asset Mgmt|3,300,000|5.1%\n\nIn case you're wondering, here are most commonly held number of shares:\n\nShares|Responses|% of Total Responses\n:--|--:|--:|\n100|137|5.7%\n200|86|3.6%\n50|69|2.9%\n300|64|2.7%\n10|54|2.3%\n1000|50|2.1%\n500|50|2.1%\n30|44|1.8%\n400|44|1.8%\n20|43|1.8%\nOther|1,756|73.3%\n\n**Please add or update your shares with this link**: https://forms.gle/kJFs1C8gURHA5a8g8\n\nLatest response with for an ID is the one that counts. Shares over 50K must be verified via screenshot.\n\n**Cleaned and filtered data without IDs:** https://docs.google.com/spreadsheets/d/e/2PACX-1vTf1Tpy7RUH6ZjeMhVRsj54WSDVCVEaWLLUPuAJBOOTH6lY2o9J8tzbehO9Z-ukbFrrzhjeXEID-rFx/pubhtml",
        "subreddit": "wallstreetbets",
        "title": "WSB owns 5.8% of GME (GME survey update)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k6jjm3/wsb_owns_58_of_gme_gme_survey_update/",
        "created": 1607111651.0
    },
    {
        "author": "EthLaw",
        "created_utc": 1607269474,
        "id": "k7vxyw",
        "num_comments": 422,
        "num_crossposts": 0,
        "selftext": "*#Clown Market DD:*# Buckle up buckaroos I'm gonna show you how to wine and dine on tendies at Wendys this very Wednesday. Neither Bull, nor Bear, I am full-on Clown and this is my native market. Given the recent Clownish trends, which unequivocally guarantee future results (*cf.* \"New Paradigm\" inflection point of [Figure A](https://transportgeography.org/?page_id=9035), the contents of Airbnb's S-1 disclosure statement (available [here](https://sec.report/Document/0001193125-20-306257/)) and other SEC filings (available [here](https://sec.report/CIK/0001559720)) are completely irrelevant, like seatbelts on a seadoo. \n\n**TLDR;** Imagine an amount of money you are willing to lose and then double it. Buy ABNB at Fidelity on IPO day, shares on Wednesday afternoon, and calls the following week.\n\nNow before you parade down the street blasting your kazoo, let's go over WHY to buy. UBER IPO'd last year at $41. This was a typical case of insider investors realizing their shares of a shitty, unprofitable company were better off in the hands of retail mothershmuckers. UBER has become even less profitable in the interim, so naturally the stock price has risen to $54. Now some of you bigbrains might be furrowing your fiveheads--ABNB has a clear path to profitability and has indeed [turned a profit](https://www.cnet.com/news/airbnb-first-profit-home-rental-travel-startups/) on multiple occasions. My elf ears hear you ask:\n\n&gt;\"Under Clownmarket rules doesn't this mean ABNB will trade flat like a boomer bond?\" \n\n\"Nein!\" is my reply. Fear not, for ABNB posted a [$322m loss](https://www.vox.com/2020/2/12/21134477/airbnb-loss-profit-ipo-safety-tech-marketing) last year. Although it's not as sexy as [TSLA's $862m loss](https://www.statista.com/statistics/272130/net-loss-of-tesla/) in the same year, we can hope ABNB's costs of expanding into China will swell like an ass-eater's lymph nodes. The analysts certainly think so. Cordwell has a price target of [$75 a share](https://www.marketbeat.com/stocks/NASDAQ/ABNB/price-target/) following the likely $45-$50 IPO target.\n\nAlthough Airbnb is clearly just Uber for your mattress, some skeptics demand more metrics. Compare Booking.com (BKNG) which IPO'd at $483.99 in 1999 and dropped to $7.88 by 2001. Could this happen to ABNB? Absolutely not. Why? Because I got bedbugs once at a booking.com dive with fake pics, and I didn't even call their customer service to get my eleven dollars back. Contrast that with when I got kicked out of an Airbnb in Bali six years ago, I got on the phone with a **specialist** who **investigated** my **case** and gave me a bunch of store credit for shit I didn't even ask for. Add in the fact that BKNG now trades at $2125 and you've got yourself a real *fuck it why not* scenario.  \n\nAnd finally, *Google Trends* [shows \"airbnb\" is half as hype as \"tesla\"](https://trends.google.com/trends/explore?geo=US&amp;q=airbnb,tesla) which logically puts ABNB at 50% of TSLA's $558b valuation, =$279b, which would put ABNB's share price at $465.\n\nPut the kazoos away boys, this 10-bagger calls for a fanfaronade of vuvuzelas!",
        "subreddit": "wallstreetbets",
        "title": "Airbnb IPO on Wednesday",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k7vxyw/airbnb_ipo_on_wednesday/",
        "created": 1607298274.0
    },
    {
        "author": "Moostucky_Stank",
        "created_utc": 1608002090,
        "id": "kddj2c",
        "num_comments": 303,
        "num_crossposts": 0,
        "selftext": "From what I can tell it’s not exactly a risky play, has a good dividend, and fidelity has a buy rating on it, but he’s 12. He’s all about investing and always puts half of birthday/Christmas money into the market. To this day it’s only gone into fidelity zero funds. Now he wants to get a little risky.  I figure it’s a great learning experience.",
        "subreddit": "pennystocks",
        "title": "My 12 year old son asked for 100 shares of MNDO for Xmas, seriously. He did his own research. Can you guys take a look before I give him his wish at market opening?",
        "url": "https://www.reddit.com/r/pennystocks/comments/kddj2c/my_12_year_old_son_asked_for_100_shares_of_mndo/",
        "created": 1608030890.0
    },
    {
        "author": "Happy_Pizza_",
        "created_utc": 1607005719,
        "id": "k5y6ka",
        "num_comments": 266,
        "num_crossposts": 0,
        "selftext": "[From the article](https://www.reuters.com/article/cryptocurrencies-sp/sp-dow-jones-indices-to-launch-cryptocurrency-indexes-in-2021-idUSL1N2IJ0TG):\n\n&gt; LONDON (Reuters) - S&amp;P Dow Jones Indices, a division of financial data provider S&amp;P Global Inc, said on Thursday that it will launch cryptocurrency indices in 2021, making it the latest major finance company to enter the nascent asset class.\n\n&gt; The S&amp;P DJI-branded products will use data from New York-based virtual currency company Lukka on more than 550 of the top traded coins, the companies said.  S&amp;P’s clients will be able to work with the index provider to create customized indices and other benchmarking tools on cryptocurrencies, S&amp;P and Lukka said in a joint statement.  S&amp;P and Lukka hope more reliable pricing data will make it easier for investors to access the new asset class, and reduce some of the risks of the very volatile and speculative market, they said.\n\n&gt; “With digital assets such as cryptocurrencies becoming a rapidly emerging asset class, the time is right for independent, reliable and user-friendly benchmarks,” said Peter Roffman, global head of innovation and strategy at S&amp;P Dow Jones Indices. The move by one of the world’s most well-known index providers could help cryptocurrencies become more mainstream investments. It comes as bitcoin continues to soar to record highs against the dollar, boosted by increased demand from investors who say the virtual currency is a hedge against inflation and a safe-haven asset.\n\n&gt; Bitcoin was trading at $19,300 in latest trading on Thursday, having soared around 170% this year. Cryptocurrencies have been around for more than a decade, but have started attracting more interest from large financial companies over the last few years.\n\n&gt; Large firms including Fidelity Investments and Japan’s Nomura Holdings Inc have starting safeguarding bitcoins and other cryptocurrencies for institutional investors, while major exchanges have started offering bitcoin derivatives. The emergence of more mainstream market infrastructure has made the asset class more accessible for institutional investors, with hedge fund managers such as Paul Tudor Jones and Stanley Druckenmiller saying they include bitcoin in their broad investment strategies.",
        "subreddit": "investing",
        "title": "S&amp;P Dow Jones Indices to launch cryptocurrency indexes in 2021",
        "url": "https://www.reddit.com/r/investing/comments/k5y6ka/sp_dow_jones_indices_to_launch_cryptocurrency/",
        "created": 1607034519.0
    },
    {
        "author": "deltalake",
        "created_utc": 1609275699,
        "id": "kmmvdh",
        "num_comments": 205,
        "num_crossposts": 0,
        "selftext": " **Greetings!** [👋](https://emojipedia.org/waving-hand/) [👋](https://emojipedia.org/waving-hand/) [👋](https://emojipedia.org/waving-hand/)\n\n***First of all, I should start by saying I am a little intimidated posting here.*** I am re-directed to you from the cesspool known as WSB. I was encouraged by several to share my work with this sub and while I am not familiar with the sub I thought why not?\n\nUltimately, I regret posting in WSB. It is a strange place. I've tried to answer them in the comments but it is an amazing casino. Its literally a casino. I think the quality of my DD (regardless of whether you know about the SPAC) speaks for itself.\n\nThe post below is really a primer. The link to the first DD is where the money is.\n\nHere's the PSTH S1\n\n[**https://www.sec.gov/Archives/edgar/data/1811882/000119312520175042/d930055ds1.htm**](https://www.sec.gov/Archives/edgar/data/1811882/000119312520175042/d930055ds1.htm)\n\nCheers,\n\nxxoo\n\n\\----------------\n\n🚀 **$PSTH – Activist Investor Bill Ackman’s Gigantic SPAC – Updated DD** 🚀\n\nI last wrote on PSTH roughly 30 days ago and at the time the SPAC was getting very little press attention. Ackman announced the SPAC in the spring of 2020 and it started trading in July at an NAV of $20. Ackman has steadily collected an impressive investor list, filled with long term and reputable names.\n\nSince then and since my last post, a lot has happened. This DD serves to provide an update and recap for those new to the stock and considering a play here.\n\n**TLDR;**\n\nPSTH is a gigantic SPAC with a reputable CEO and the most impressive investor list ever created. For context, Chamath's largest SPAC (IPOF) is worth $1.6B. PSTH is worth $5B with the option to increase to $7B. It is enormous. The company is on record for a Q1 announcement and is targeting a “mature unicorn”. At an NAV of $20, the downside risk is capped significantly while the upside potential is very high depending on target.\n\n**Two Key points in addition to the TLDR:**\n\nTwo aspects of this stock that most people miss to begin with (I've engaged with enough of them online to know):\n\n**1)** Tontine: detailed below but in essence, for every common share you buy now AND hold through the merger and ticker change, you get 2/9 a warrant exercisable at $23. That means for every 9 commons you own, you will receive another 2 commons later at a price of $23 (the stock trades at $26 today)\n\n**AKA if you own 99 commons through the merger, you get 22 more shares at $23 cost each simply for holding through the merger.**\n\n**THIS is what 2/9 Tontine means. It can grow to 3/9 or 4/9 if people choose not to hold through the merger, because the number of warrants is constant and will all be given out to someone.**\n\n**\\*\\*\\*Another note here: beware the manager's right to redeem warrants. This is in the S-1 but the manager's have the right to redeem warrants if the share price meets or exceeds $36 on 20/30 trading days. They have to give you 30 days notice, so just keep that in mind. The warrants are exercisable at the later of 1) 30 days post merger or 2) 1 year post listing which was in July 2020. So as long as you are keeping an eye on events, you will be okay. Don't fall asleep on the stipulation though.**\n\n**For example, if the stock price was to jump to $50 on LOI and then the merger happens 2 months later, 30 days post that merger you warrants go live but so does the manager's right to issue a redemption notice. At that point you would likely consider redeeming the warrants since at the end of that window they could be taken by manager for pennies each. No upside cap based on my reading of the S1, but just be vigilant once the merger is announced.**\n\n**2)** The bank set up. Typically the big banks gouge the eyes out of IPOs and traditional SPACS with fees, etc. We have seen big big misses on the order of $3-4B for both Snowflake and ABNB. With PSTH, Ackman has went a different route abandoning the large cap banks and instead giving underwriting privileges to a ton of small and minority owned banks and credit lenders. This is a legacy move. He's more interested in changing the landscape because he believes (and has explained) that quality public entry structures are the best improvements we can make for the economy, society, and the common retail investor. The structure also incentivizes him to make an exceptional deal, that's the only way he makes money through the warrant system, if the deal goes well. This is why HUGE names are on board, but only one big bank is. This SPAC is opposing the conventional bank-led IPO process. That in itself, is a game changer and once this pops and gets press you can bet your boots that future SPAC leaders (Chamath, etc.) will transition to this method.\n\n**Background information and recent events**\n\n· In July 2020, Bill Ackman went live with SPAC $PSTH – the SPAC raised $5B in proceeds with the option to take it to $7B (leveraging funds from PSCM, Ackman’s hedge fund) making it the biggest SPAC ever created.\n\n· In multiple interviews following the SPACs debut, Ackman has been clear about several things:\n\no He is hunting for a “mature unicorn” - unicorn is defined as $1B or more but \"mature\" here is the key, he's looking for a company worth tens of Billions.\n\no He has stipulated a predictable business is most ideal with steady cash flow or guarantees along the lines of predictable growth\n\no This means a large cap, well run, asset light, family owned, high moat, company according to Ackman. He has explicitly said he's also friendly to a FINTECH\n\no He has a buying power of approximately $7B dollars at present and is hoping to capture a minority stake of between 15-20% of a large enterprise. This means a valuation in the ballpark of $30-40B.\n\n**o Ackman has recruit an incredible board of directors at PSTH, leveraging raw talent from both media and fintech sectors:**\n\nLisa Gersh - Former management executive at NBC News\n\nMichael Ovitz - Former President at The Walt Disney Company\n\nJackie Reses - Former executive at Square, mobile payment company\n\nJoseph Steinberg - Current Chairman of Jefferies Financial Group Inc.\n\n**\\*\\*We don't want to jump to conclusions, but on review of the board, this is certainly a MEDIA and FINTECH heavy group of executives\\*\\***\n\no He has delivered on developing an incredibly impressive list of investors thus far\n\no **Investors in the SPAC so far include:**\n\n§ Baupost Group (headed by Seth Klarman, $30B hedge fund manager, “the next Buffet” and noted value investor) = $450M position\n\n§ Guggenheim Capital = $560M position\n\n§ Ontario Teachers Pension Plan = $290M position\n\n§ Soroban Capital = $290M position\n\n§ Wells Fargo = $290M position\n\n§ Kevin “Sharktank” O’Leary = undisclosed position to be reported in Q1\n\n§ **Warren Buffet’s** position remains speculative. He recently left his JPM position and is secretly adding to a big position (pushing the filing deadline requirements as he does whenever he builds a big position as to not cause an overprice of the stock before he finishes buying). There is also a large undisclosed position in PSTH held by someone from Q3. This remains completely speculative and it may not be Buffet but another large stakeholder or pension fund.\n\n**§ KEY Point: \\*\\*No other big banks have secured big positions in PSTH\\*\\***\n\no The investor list above is just a sample of the top holders. Each of these positions were made at the end of Q3 of this year. The stock has risen $2 or 10% of NAV since this time (not much considering the size and runway ahead).\n\n**PSTH SPAC Design**\n\n· PSTH is called a SPAC, but as others have pointed out, it does not resemble any other SPAC, in size or design. Some details:\n\n· PSTH incentivizes long-term holding and only dramatic upward shifts in the stock price through its unique “tontine” structure. Upon purchase of one common share and holding of that share through announcement and merger, owners receive 2/9 of a warrant with a strike of $23. Those who buy and sell on announcement bounce therefore give up that 2/9 and it goes back into the pool for those who hold through merger. What a lot of people are missing is what this means. It means that the ceiling for the value of that fractional warrant is unknown but at minimum is 2/9. If there was a minority sell off on announcement that 2/9 could increase to 3/9 or 4/9 warrant for those who stay in. This creates a wild incentive for long-term holding of the company and is referenced in the \"tontine\" name - look it up, pretty cool.\n\n**Targets**\n\nMuch speculation exists online as to what companies Ackman is targeting. Here are some key points:\n\n· Earlier in the year he commented publicly on Air B&amp;B, Stripe and Bloomberg. He praised all three companies publicly.\n\n· Since that interview, Air B&amp;B has gone public via IPO and notably lost out on $3.8B during the valuation process and IPO\n\n**· Stripe has generated intense interest online.** Despite the hype, the Collison brothers (head of Stripe) have publicly commented via tweet that “no such deal” had been struck after a WSB twitter account congratulated the brother’s in a silly way. Despite this, many (including me) believe that Stripe is still very much in play and that some of this is a negotiation tactic. When questioned on Stripe, Ackman was gracious but said that the company was not ready to go public, citing managerial and personnel deficits only. In the immediate aftermath of that comment (literally the next week), Stripe went on an insane hiring spree specific to Public Managerial positions. This has been documented extensively by [u/YoloCapitalMgmt](https://www.reddit.com/u/YoloCapitalMgmt/) on twitter. Ackman is on record saying his biggest regret in investing was not getting in on MasterCard due to regulation uncertainty. He said the best investment you could ever make, assuming valuation made sense, was in a company that made royalties on others spending money. He has since commented that PSTH would very much be in favor of merging with a FINTECH. Big name FINTECH EXEC Jackie Reeses (former head of square) has been added to the board of PSTH, creating even more speculation around Stripe as a target).\n\n**· Bloomberg remains in play.** There has been no definitive declination by Bloomberg and rumors in the past exist in both directions. Michael Bloomberg has both commented that he would not take the company public and that there could be interest in a minority stake being sold.\n\n· Other potential targets that have been floated with little in the way of momentum include SpaceX, Fidelity, Inspire Brands and Subway.\n\n**Target summary based on my view**\n\nTargets in order of likelihood of Q1 merger announcement\n\n1. Bloomberg\n2. Stripe\n3. Fidelity\n\n**Bill Ackman**\n\nA few notes on the CEO of the SPAC, William A. Ackman:\n\n· A billionaire activist hedge fund manager with a highly interesting track record if you’re interested in looking into it.\n\n· He has had some misses in years gone by most notably Herbalife short (where he was correct but still lost money) and Valeant.\n\n· In recent years he has mounted an insane comeback poster annualized return of 50 and 60%.\n\n· Some of his most iconic recent plays include Chipotle (take a look at that story) and Canadian Pacific\n\n· Notably he shorted the market prior to COVID, correctly predicting a financial collapse. Through the use of CDS (made popular during the 2008 financial crisis, he turned a $27M insurance policy into a $2.6B trade in March of this year. He subsequently used the funds to advance positions in high quality companies he was a holder of (when these stocks were at their absolute lows in March).\n\n**Some other notes**\n\nThis is a highly interesting play and to get in you are betting on Ackman and the impressive investor list he has obtained.\n\nWhile this isn’t objective financial advice, this play is incredibly enticing and one worth looking into.",
        "subreddit": "investing",
        "title": "Pershing Square Tontine Holdings Ltd. - Big Time Value Play Receiving Little Press",
        "url": "https://www.reddit.com/r/investing/comments/kmmvdh/pershing_square_tontine_holdings_ltd_big_time/",
        "created": 1609304499.0
    },
    {
        "author": "CaramelChewies",
        "created_utc": 1608308840,
        "id": "kfoaex",
        "num_comments": 194,
        "num_crossposts": 0,
        "selftext": "I'm ready to go long but like most investors, there's some trepidation around how hot the markets are and whether or not a correction is inbound. Regardless, I'm curious to see which sectors you guys are keeping an eye on as we match toward 2030. I'm long on consumer discretionary (because people will always want retail therapy) and green-ish tech (e.g. metals recycling companies like American Battery Metals Corp). I'm still skeptical about crypto though it seems to be doing well, even piquing the interest of big players like Fidelity.",
        "subreddit": "investing",
        "title": "What sort of sectors are on your radar for the coming decade?",
        "url": "https://www.reddit.com/r/investing/comments/kfoaex/what_sort_of_sectors_are_on_your_radar_for_the/",
        "created": 1608337640.0
    },
    {
        "author": "deltalake",
        "created_utc": 1608745267,
        "id": "kixho7",
        "num_comments": 185,
        "num_crossposts": 0,
        "selftext": "🚀 **$PSTH – Activist investor Bill Ackman’s Gigantic SPAC – Updated DD** 🚀 \n\nI last wrote on PSTH roughly 30 days ago and at the time the SPAC was getting very little press attention at all. Ackman announced the SPAC in the spring of 2020 and it started trading in July at an NAV of $20. Ackman has steadily collected an impressive investor list, filled with long term and reputable investors.\n\nSince then and since my last post a lot has happened. This DD serves to provide an update and recap for those new to the stock and considering a play here.\n\n**TLDR;**\n\nPSTH is a gigantic SPAC with a reputable CEO and the most impressive investor list ever created. The company is on record for a Q1 announcement and is targeting a “mature unicorn”. At an NAV of $20, the downside risk is capped significantly while the upside potential is very high depending on target.\n\n**Background information and recent events**\n\n· In July 2020, Bill Ackman went live with SPAC $PSTH – the SPAC raised $5B in proceeds with the option to take it to $7B (leveraging funds from PSCM, Ackman’s hedge fund) making it the biggest SPAC ever created.\n\n· In multiple interviews following the SPACs debut, Ackman has been clear about several things:\n\no He is hunting for a “mature unicorn”\n\no He has stipulated a predictable business is most ideal with steady cash flow or guarantees along the lines of predictable growth\n\no This means large cap, well run, asset light, family owned, high moat, company\n\no He has a buying power of approximately $7B dollars at present and is hoping to capture a minority stake of between 15-20% of a large enterprise. This means a valuation in the ballpark of $40B.\n\no He has delivered on developing an incredibly impressive list of investors thus far\n\no **Investors in the SPAC so far include:** \n\n§ Baupost Group (headed by Seth Klarman, $30B hedge fund manager, “the next Buffet” and noted value investor) = $450M position\n\n§ Guggenheim Capital = $560M position\n\n§ Ontario Teachers Pension Plan = $290M position\n\n§ Soroban Capital = $290M position\n\n§ Wells Fargo = $290M position\n\n§ Kevin “Sharktank” O’Leary = undisclosed position to be reported in Q1\n\n§ Warren Buffet’s position remains speculative. He recently left his JPM position and is secretly adding to a big position (pushing the filing deadline requirements as he does whenever he builds a big position as to not cause an overprice of the stock before he finishes buying). There is also a large undisclosed position in PSTH held by someone from Q3. This remains completely speculative and it may not be Buffet but another large stakeholder or pension fund.\n\n§ KEY Point: \\*\\*No other big banks have secured big positions in PSTH\\*\\*\n\no The investor list above is just a sample of the top holders. Each of these positions were made at the end of Q3 of this year. The stock has risen $2 or 10% of NAV since this time (not much considering the size and runway ahead).\n\n**PSTH SPAC Design**\n\n· PSTH is called a SPAC, but as others have pointed out, it does not resemble any other SPAC, in size or design. Some details:\n\n· PSTH incentivizes long-term holding and only dramatic upward shifts in the stock price through its unique “tontine” structure. Upon purchase of one common share and holding of that share through announcement and merger, owners receive 2/9 of a warrant with a strike of $23. Those who buy and sell on announcement bounce therefore give up that 2/9 and it goes back into the pool for those who hold through merger. What a lot of people are missing is what this means. It means that the ceiling for the value of that fractional warrant is unknown but at minimum is 2/9. If there was a minority sell off on announcement that 2/9 could increase to 3/9 or 4/9 warrant for those who stay in. This creates a wild incentive for long-term holding of the company and is referenced in the \"tontine\" name - look it up, pretty cool.\n\n**Targets**\n\nMuch speculation exists online as to what companies Ackman is targeting. Here are some key points:\n\n· Earlier in the year he commented publicly on Air B&amp;B, Stripe and Bloomberg. He praised all three companies publicly.\n\n· Since that interview, Air B&amp;B has gone public via IPO and notably lost out on $3.8B during the valuation process and IPO\n\n· Stripe has generated intense interest online. Despite the hype, the Collison brothers (head of Stripe) have publicly commented via tweet that “no such deal” had been struck after a WSB twitter account congratulated the brother’s in a silly way. Despite this, many (including me) believe that Stripe is still very much in play and that some of this is a negotiation tactic. When questioned on Stripe, Ackman was gracious but said that the company was not ready to go public, citing managerial and personnel deficits only. In the immediate aftermath of that comment (literally the next week), Stripe went on an insane hiring spree specific to Public Managerial positions. This has been documented extensively by u/YoloCapitalMgmt on twitter. Ackman is on record saying his biggest regret in investing was not getting in on MasterCard due to regulation uncertainty. He said the best investment you could ever make, assuming valuation made sense, was in a company that made royalties on others spending money. He has since commented that PSTH would very much be in favor of merging with a FINTECH. Big name FINTECH EXEC Jackie Reeses (former head of square) has been added to the board of PSTH, creating even more speculation around Stripe as a target).\n\n· Bloomberg remains in play. There has been no definitive declination by Bloomberg and rumors in the past exist in both directions. Michael Bloomberg has both commented that he would not take the company public and that there could be interest in a minority stake being sold.\n\n· Other potential targets that have been floated with little in the way of momentum include SpaceX, Fidelity, Inspire Brands and Subway.\n\n**Target summary based on my view**\n\nTargets in order of likelihood of Q1 merger announcement\n\n1. Bloomberg\n\n2. Stripe\n\n3. Fidelity \n\n**Bill Ackman**\n\nA few notes on the head of the SPAC, Ackman:\n\n· A billionaire activist hedge fund manager with a highly interesting track record if you’re interested in looking into it.\n\n· He has had some misses in years gone by most notably Herbalife short (where he was correct but still lost money) and Valeant.\n\n· In recent years he has mounted an insane comeback poster annualized return of 50 and 60%. \n\n· Some of his most iconic recent plays include Chipotle (take a look at that story) and Canadian Pacific\n\n· Notably he shorted the market prior to COVID, correctly predicting a financial collapse. Through the use of CDS (made popular during the 2008 financial crisis, he turned a $27M insurance policy into a $2.6B trade in March of this year. He subsequently used the funds to advance positions in high quality companies he was a holder of (when these stocks were at their absolute lows in March).\n\n**Some other notes**\n\nThis is a highly interesting play and to get in you are betting on Ackman and the impressive investor list he has obtained.\n\nWhile this isn’t objective financial advice, this play is incredibly enticing and one worth looking into\n\n**Resources**\n\n· Ackman interviews: [https://www.youtube.com/watch?v=Pzz5SGpDrc4](https://www.youtube.com/watch?v=Pzz5SGpDrc4) \n\n· [https://www.youtube.com/watch?v=GmaCarSyBk4](https://www.youtube.com/watch?v=GmaCarSyBk4) \n\n· Klarman position: [https://finance.yahoo.com/news/why-does-seth-klarman-pershing-165111126.html](https://finance.yahoo.com/news/why-does-seth-klarman-pershing-165111126.html) \n\n· Guggenheim position: [https://whalewisdom.com/schedule13d/view/guggenheim-capital-llc-sc-13g-2020-08-10-psthu](https://whalewisdom.com/schedule13d/view/guggenheim-capital-llc-sc-13g-2020-08-10-psthu) \n\n· Buffet leaves JPM: [https://markets.businessinsider.com/news/stocks/warren-buffett-berkshire-hathaway-built-8-billion-jpmorgan-stake-slashed-2020-11-1029846193](https://markets.businessinsider.com/news/stocks/warren-buffett-berkshire-hathaway-built-8-billion-jpmorgan-stake-slashed-2020-11-1029846193) \n\n· Buffet secret position: [https://www.cnbc.com/2020/11/17/warren-buffett-could-be-building-a-secret-position.html](https://www.cnbc.com/2020/11/17/warren-buffett-could-be-building-a-secret-position.html) \n\n· PSTH (Ackman) recent letter to investors, see PSTH section: [https://assets.pershingsquareholdings.com/2020/08/28125504/Pershing-Square-Holdings-Ltd.-June-2020-Interim.pdf](https://assets.pershingsquareholdings.com/2020/08/28125504/Pershing-Square-Holdings-Ltd.-June-2020-Interim.pdf) \n\n· My original DD (pinned by mods, is here): [https://www.reddit.com/r/wallstreetbets/comments/k3bf1o/psth\\_dd\\_klarman\\_buffet\\_ackman\\_the\\_unicorn\\_hunter/](https://www.reddit.com/r/wallstreetbets/comments/k3bf1o/psth_dd_klarman_buffet_ackman_the_unicorn_hunter/) \n\n· u/YoloCapitalMgmt on twitter provides an exceptional documentation around PSTH with a specific focus on Stripe: [https://twitter.com/yolocapitalmgmt?lang=en](https://twitter.com/yolocapitalmgmt?lang=en) \n\no Many of the other PSTH related twitter accounts are just opinion accounts attempting to either pump or dump specific stocks. None of them provide any actual analysis or DD other than u/YoloCapitalMgmt\n\no No, I am not Yolo, the thread is just impressive.\n\n· PSTH Holdings: [https://www.nasdaq.com/market-activity/stocks/psth/institutional-holdings](https://www.nasdaq.com/market-activity/stocks/psth/institutional-holdings) \n\n**Positions**\n\n4,000 common shares at \\~$23.50 and a small call option position with a June expiry worth a few thousand dollars.\n\n**Good luck to all holders of this massive and massively interesting SPAC.**",
        "subreddit": "wallstreetbets",
        "title": "PSTH – Pershing Square Tontine Holdings Ltd – The \"Once More Unto The Breach\" DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kixho7/psth_pershing_square_tontine_holdings_ltd_the/",
        "created": 1608774067.0
    },
    {
        "author": "IHateMonie",
        "created_utc": 1608328959,
        "id": "kfuq3i",
        "num_comments": 161,
        "num_crossposts": 0,
        "selftext": "Alright I made this using MS paint because I am too retarded to use photoshop. Short interest died on 20th of November then literally the next trading session (that following Monday) started that week of back to back 10-20% gains. We just saw the same death in short interest recently. That coupled with the fact that fidelity literally has 0 shares available to short and other brokerages are low/out of shares to short makes me think maybe next week will be PLTR week 🚀🚀🚀🚀\n\n[Sources: https:\\/\\/fintel.io\\/ss\\/us\\/pltr \\(Left\\) and Google \\(Right\\) ](https://preview.redd.it/decpzv5do0661.png?width=1407&amp;format=png&amp;auto=webp&amp;s=d64a42cb4d0d7a5074872bfd6daa7daa63ba802b)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[Source: https:\\/\\/iborrowdesk.com\\/report\\/PLTR](https://preview.redd.it/f07956ucp0661.png?width=1247&amp;format=png&amp;auto=webp&amp;s=0bb73b9f487f23926cb80f7f8536af36ad575475)\n\n&amp;#x200B;\n\n[Source: Screenshot from Fidelity](https://preview.redd.it/wnlx1au1p0661.png?width=404&amp;format=png&amp;auto=webp&amp;s=d7bfcc28409b82138d702a08b2c2b6b03b77a8e2)\n\nPosition: Long 17,000 shares @ $14.85\n\n&amp;#x200B;\n\nEdit cause bears gotta be 🌈: \n\nLockup will have 3 days after their Q4 earnings release probably sometime in Feb2021 the number of outstanding shares to be traded will go from .5b to about 1.7b. This might seem bad but if you are concerned you just need to look at snowflake's recent lockup expiration to get an idea of what might happen.\n\nSnowflake had a partial lockup release earlier this week and their float went from 32.2M to a total of 110.6M overnight. This is roughly a 3.4x increase in float volume. PLTR is going from \\~.5B to \\~1.7B float (a 3.4x increase in float). When the lockup expired for SNOW their SP dropped by \\~15% and it is now recovering. So we can expect a \\~15% drop once this lockup is done.",
        "subreddit": "wallstreetbets",
        "title": "PLTR getting ready",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kfuq3i/pltr_getting_ready/",
        "created": 1608357759.0
    },
    {
        "author": "cyanlce",
        "created_utc": 1607180045,
        "id": "k78srf",
        "num_comments": 149,
        "num_crossposts": 0,
        "selftext": "**Not even fake entries can stop us. We are now the 5th largest holder of GME.** \n\n&amp;nbsp;\n\n[**Top holders**](http://news.gamestop.com/stock-information/institutional-ownership)\n\nHolder|Shares|% O/S\n:--|--:|--:|\nFidelity|9,534,090|14.6%\nBlackRock|7,897,907|12.1%\nRC Ventures|6,500,000|10.0%\nVanguard|5,288,116|8.1%\n**Wall Street Bets**|**4,549,698**|**7.0%**\nSusquehanna|4,444,128|6.8%\nDimensional Fund Adv|3,948,114|6.1%\nSenvest|3,610,740|5.5%\nDonald Foss|3,515,200|5.4%\nMust Asset Mgmt|3,300,000|5.1%\n\n&amp;nbsp;\n\n**Breakdown by shares owned**\n\nShares Owned|Responses|Total Shares\n:--|--:|--:\n[0,100)|1,621|52,851\n[100,1K)|1,466|455,590\n[1K,10K)|504|1,357,723\n[10K,50K)|98|2,143,588\n[50K, ∞)|5|539,991\n**Total**|**3,694**|**4,549,742**\n\n&amp;nbsp;\n\nThere were a lot of fake entries, so let me address that.\n\n**1) These guys are not good at what they do**\n\nMost of the fake entries are obvious, for example [here](https://imgur.com/YDgeFOm) and [here](https://imgur.com/DamT0zE).\n\nOthers are less obvious, with random numbers spread out over a wider period of time. But it's not easy to create legit-looking entries and have an impact since they can't see the whole data set.\n\nThere were so many that I couldn't go through all the responses in a detailed way, and was more conservative to exclude more responses than necessary. Unfortunately, I'm also hiding the category column and grouped duplicates, outliers, fake entries into the Excluded category so that I don't provide any helpful feedback to fakers. Apologies for removing transparency for the sake of countering spoilers.\n\nIf we really wanted to stop the fakers, we would ask for email addresses, but then no one would fill out the form. But it doesn't matter anyways, because...\n\n**2) Fake entries don't even matter much, since it just has to be in the ballpark**\n\nSurveys have a huge margin of error and only have to be directionally correct (see recent political polls). The fakers think they're playing 4D chess but are actually playing Candyland... and losing to 4 year-olds. They have the logical skills of GME shorts (which they probably are). \n\n**3) The main benefit of the survey is social proof**\n\nFrom all the responses and all the shares, it's obvious we are a force to be reckoned with. We hold great power, and with great power come great tendies. The next time you get weak hands (next Wed), remember everyone else holding until a squeeze. Even if you have the most delicate, princess hands, hold at least through Q4 earnings and the annual shareholder meeting in April.\n\n&amp;nbsp;\n\n**Please add or update your shares with this link**: https://forms.gle/kJFs1C8gURHA5a8g8\n\nLatest response with for an ID is the one that counts. Shares 50K and up must be verified via screenshot.\n\n&amp;nbsp;\n\n**Cleaned and filtered data without IDs:** https://docs.google.com/spreadsheets/d/e/2PACX-1vTf1Tpy7RUH6ZjeMhVRsj54WSDVCVEaWLLUPuAJBOOTH6lY2o9J8tzbehO9Z-ukbFrrzhjeXEID-rFx/pubhtml",
        "subreddit": "wallstreetbets",
        "title": "When's the GME investor meeting for its 5th largest holder?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k78srf/whens_the_gme_investor_meeting_for_its_5th/",
        "created": 1607208845.0
    },
    {
        "author": "QVonesh",
        "created_utc": 1607851236,
        "id": "kc7pfx",
        "num_comments": 128,
        "num_crossposts": 0,
        "selftext": "Alright you *shrimp-dick fuck nuggets*, listen up because we’re making fucking tendies. QS or QuantumScape has been seeing crazy momentum in the market recently. They are trading at around 63, but I think this is going to absolutely DUMP on December 21st and possibly longer.\n\nSo let’s look at Quantum Scape, they are a battery company that merged with KCAC (Kensington Capital Acquisition Corp), and what is even more interesting, is that Volkswagen has been invested and partnered with this company since 2012.  \n\nAccording to this source\n\n[https://techcrunch.com/2020/09/03/vw-backed-quantumscape/](https://techcrunch.com/2020/09/03/vw-backed-quantumscape/)\n\n“Volkswagen entered the picture in 2012. The automaker has invested a total of $300 million in QuantumScape, including $200 million this year.” *Pay attention to the 200 million this year, it may be very big, but we will come back to that at the very end.* \n\nThe same article states the following, “QuantumScape said it was able to raise more than $700 million through the business combination, a figure that includes $500 million in private investment in public equity, or PIPE. The raise was anchored by institutional investors including **Fidelity Management &amp; Research Company** and **Janus Transaction**”\n\nSo we see 500 million of 700 million dollars are from PIPE shares. Here’s the part where our dick go a slack 2.5in, to firm 3in…\n\n**Pipe shares can be sold after a certain amount of time**, and we all know what happens when massive sell off’s happen.  \n\nAccording to the Registration Statement published by the SEC about Kensington Capital Acquisition Corp, “Pursuant to the Subscription Agreements, Kensington **agreed** that, **within 15 business days** after the Closing (the “Filing Deadline”), Kensington will **file** **with** the SEC (at Kensington’s sole cost and expense) a registration statement **registering the resale** of the PIPE Shares.”\n\nSource:\n\nhttps://www.sec.gov/Archives/edgar/data/1811414/000119312520290474/d14810ds4a.htm\n\nLet’s break down what this means exactly because the language can be confusing (at least it was to me at first because I’m retarded, why else am I here?).\n\nThere is a 15 day countdown starting AFTER their closing day, this was Nov 27th when they officially merged, which was a Friday. Because this 15 day “countdown” only includes business days, that means the countdown actually starts the following Monday, Nov 30th, since that is the next business day that follows the closing day. Now, during this countdown Kensington will file WITH the SEC a “registration statement registering the resale of PIPE shares”. So this registration statement will register the shares to be sold. Now, the word “register” for the resale of the shares may sound ambiguous. Does it mean they now have the potential to be sold, but maybe on a different day? Does this registration mean they CAN IN FACT be sold once they’re registered? Well this next piece of info will be useful to understand, hopefully making your smooth marble brains get some fucking wrinkles.  \n\n“Since this offering was a PIPE, the buyers cannot sell their shares until the company files its resale registration statement with the SEC. **However, an issuer generally cannot sell more than 20% of its outstanding stock at a discount without receiving prior approval from current shareholders**.” *(We will get to the importance of the bolded area at the end)*\n\nSource: \n\n[https://www.investopedia.com/terms/p/pipe.asp#:\\~:text=Since%20this%20offering%20was%20a,prior%20approval%20from%20current%20shareholders](https://www.investopedia.com/terms/p/pipe.asp#:~:text=Since%20this%20offering%20was%20a,prior%20approval%20from%20current%20shareholders).\n\n“Once the SEC declares the registration statement effective, the PIPE investors are then generally able to freely resell their shares in the trading market.”\n\n[https://www.paulhastings.com/docs/default-source/PDFs/715.pdf](https://www.paulhastings.com/docs/default-source/PDFs/715.pdf)\n\nYou might ask “Is there a lock up for these PIPE shares?” And the answer to that is that it is contingent on whether or not the resale registration statement is *effective* or not. So far as I can tell (once again, am retarded), at the end of the 15 day countdown, it’s merely a countdown to have a resale registration agreement written up in general, not necessarily an effective one.  \n\nHowever, from the same SEC document it states “Kensington is separately required at all times to maintain an **effective** resale registration statement for the benefit of the Holders.”\n\nSo, now we know they have to make this registration AND they have to do it in a 15 business day period. With some math we can figure out exactly what day PIPE shares can be sold off. I’m not going to talk down to you autists, even though you’re retarded, but 15 business days after November 30th is December 18th. But December 18th is the fifteenth day of the countdown, so it can’t be sold then. Keep in mind that December 18th is a Friday also, so we can expect a BLOODY RED MONDAY for QS if they are going to sell their PIPE shares. Now that’s a big IF.\n\nLet’s take a look at just how much PIPE shares make up of the total shares.  \n\nFrom the same SEC document…\n\n“‘PIPE’ means the sale of PIPE Shares to the Subscribers, for a purchase price of **$10.00 per share** and an **aggregate purchase price of $500 million**, in a private placement.”\n\nSo what we are looking at is 50 million shares potentially sold off on Monday the 18th. How much is this in reality?\n\nWell according to [https://www.nasdaq.com/market-activity/stocks/qs/institutional-holdings](https://www.nasdaq.com/market-activity/stocks/qs/institutional-holdings)\n\nTheir outstanding shares right now are 189 million. This means that these pipe shares make up 26.5% of ALL of QS’s shares. If we were to see a sell off of this amount, the value of QS would plunder to such an inconceivable amount we could walk away with major tendies.\n\nNow the question is….are they going to sell their shares? Well if we take a look at WHO bought these PIPE shares, we can most likely answer that. Fidelity and Janus are both investment companies who are involved in mutual funds and have clients that they make money for. Because these pipe shares were valued at 10 dollar each, while also looking at QS’s current price. They are currently up 600%+ with 50 million shares…would you take that profit?\n\nNot only that, but the discussion of the “SPAC bubble” has been trending for a few weeks now. As we know, SPAC’s have been huge this year, and the “SPAC bubble” is the fear of overvaluing company’s that IPO in mass quantities which results in a huge crash later on.  \n\nDo you think Fidelity hasn’t heard of this? Why would Fidelity and Janus take a risk of getting more money when they are up 600%+ AND they have clients to look after? The fact of the matter is, is they won’t take this risk, the amount of money gained and any potential of a SPAC bubble popping would have any investor taking profits ASAP.\n\nNow, there were two things I mentioned in the post that I would discuss now. That is Volkswagens involvement in QS and this quote \n\n“However, an issuer generally cannot sell more than 20% of its outstanding stock at a discount without receiving prior approval from current shareholders.”\n\nIn regards to Volkswagen, they have been involved with QS since 2012, they could potentially have shares that they want to sell. They also gave 200 million dollars this year, could this be the purchasing of PIPE shares? Who knows….I sure as fuck don’t, but the potential of more shares being sold from another company involved in QS is something that is good for this. If not, it doesn’t matter all that much given the other information, since it still stands true with or without Volkswagens involvement.\n\nNow, in regards to the quote mentioned before, it could be the case that on December 21st, only 20% of the 50 million shares that Fidelity and Janus hold will be sold. Even so, 20% of 50 million is still 10 million shares or around 5.3% of the outstanding shares that QS has.  \n\nIn conclusion, I think we are looking at a great opportunity to make tendies boys.  \n\nTLDR; Eat grass, smoke ass, short QS, make tendies\n\nPositions to get in on: Dec 24 50p \n\nYou could go further expiration, or you could go further OTM. Who am I kidding though, you idiots are gonna grab FD’s. Just make sure it’s not December 18th.",
        "subreddit": "wallstreetbets",
        "title": "Quantum Scape is about to take a Quantum Dump (QS)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kc7pfx/quantum_scape_is_about_to_take_a_quantum_dump_qs/",
        "created": 1607880036.0
    },
    {
        "author": "brightskies2",
        "created_utc": 1608787848,
        "id": "kj9m9q",
        "num_comments": 107,
        "num_crossposts": 0,
        "selftext": "Background: I've published peer-reviewed journal articles on China's politics and markets before. \n\nAlibaba (and Ant)'s getting pulled into a meeting with regulators today on the heels of a new anti-trust probe. Expect a correction, but much of the uncertainty had already been priced in. \n\nA quick sentiment analysis of the press releases from Chinese government mouthpieces like《人民日報》\\[the People's Daily\\] shows their tone is much more mellow now than before. Where before they hawked on Ma and Alibaba, they're now focusing on “the country’s focus on the healthy development of the platform economy in China”. This talking point is repeated a significant number of times in the releases. \n\nThis stark shift in tone suggests regulators already have a for-show compromise in mind and BABA will only need to kiss the ring when they meet with said regulators today. It also suggests regulators are putting on this show for political grandstanding to send a message to digital companies and the billionaire class to do the same. \n\nTo put this into an even broader context, this episode is just the latest in a chest-puffing government campaign going on over the last couple of years to stress deference to the CCP. China's state-run banks have dragged their heels in performance for a while, and ever since private-sector digital platforms (BABA, JD, Meituan, TCEHY) have forged ahead in innovating much more efficient payment systems, the CCP felt left behind and wanted to be included in the party. What's key is we’ve observed this campaign to be much more discursive and cultural in practice and effect (e.g. prodding individual people and companies to be more humble and thank the party, put on the frills, yaddi-yadda) than it has been economic (e.g. quashing entire companies). \n\nWhy? And where are we headed? BABA and the digital platform economy it's a leader in are essential to China. The CCP has been ramping up efforts to digitalize in a bid to take a lead in the global (fin)tech race and strengthen the yuan at the same time. The innovation of the new China digital currency is a game-changer. The Bank of China filed over 70 patents related to the digital currency in the past year. The patents will likely be approved 2021, which will be BABA's time to shine because the CCP will need the networks and infrastructure of Alipay to make the digital currency a success. \n\nMore bullish sentiment: in Q3 2020, close to 1800 hedge funds/financial institutions had BABA in their holdings, over 200 opened new positions, and \\~700 added to their positions. Bigger names who bought more over Q3: Cathie Woods' Ark, Ray Dalio's Bridgewater, Morgan Stanley, Fidelity, Barclays, Susquehanna, Deutsche, Canada Pension Plan, etc. It remains Blackrock's #8 holding and has become Bridgewater's #4 holding. \n\nMy take: buy and hold. I literally bought more yesterday and I intend to keep buying.",
        "subreddit": "investing",
        "title": "A China expert on BABA: Bullish",
        "url": "https://www.reddit.com/r/investing/comments/kj9m9q/a_china_expert_on_baba_bullish/",
        "created": 1608816648.0
    },
    {
        "author": "deltalake",
        "created_utc": 1607778671,
        "id": "kbova1",
        "num_comments": 97,
        "num_crossposts": 0,
        "selftext": "[🤔](https://emojipedia.org/thinking-face/#:~:text=May%20be%20paired%20with%20%F0%9F%92%AD,to%20Emoji%201.0%20in%202015.)**Back to basics with Ackman's PSTH play**[🤔](https://emojipedia.org/thinking-face/#:~:text=May%20be%20paired%20with%20%F0%9F%92%AD,to%20Emoji%201.0%20in%202015.)\n\nIt's always good to just go back to the basics. There are a lot of rumors floating regarding PSTH. Speculation without an LOI announced as of yet. Some moves seem much more likely than others ***but we are still in the dark.***\n\nIn August, PSCM CEO Bill Ackman wrote a letters to investors. In it he has a section dedicated to PSTH. You can find some of that below. I have bolded what I think are the most important parts highlighting the biggest clues. People like Ackman are careful with these letters, they are legacy, like with Buffet's letters.\n\n**Top Contenders**\n\n1. Stripe\n2. Fidelity\n3. Enterprise \n4. Subway\n\n***---------------------------*****Discussion Points below but check out the letter*****---------------------------***\n\n***Pershing Square Tontine Holdings, Ltd. - Letter to Shareholders***\n\nOn July 22nd, Pershing Square Tontine Holdings, Ltd. (“PSTH”) completed a $4 billion IPO on the New York Stock Exchange. We designed PSTH to be the most investor- and merger-friendly SPAC in the world. Apparently investors agreed, as we had more than $12 billion of demand for the offering when we stopped marketing the IPO on the second day of the road show. We capped the IPO at $4 billion, which, when added to the Pershing Square funds’ minimum $1 billion commitment, created the largest blank check company in the world. \n\nWe capped the size of the public offering so that we would not materially limit the potential universe of merger candidates in which our shareholders would, via a merger, become a minority owner of the newly public company. We are seeking to own a minority interest in the newly merged company because we believe our willingness to be a minority owner will differentiate PSTH from the substantial majority of other private equity and strategic buyers who require control, and are therefore prepared to pay a substantial control premium. \n\n**Sellers are much more price sensitive when selling 100% or even a controlling interest in their business for obvious reasons. A seller’s price sensitivity declines, however, when they are selling a smaller interest that allows them to achieve other important strategic objectives. We therefore expect that a potential PSTH merger partner will be much less price-sensitive in a transaction in which it, in effect, sells a minority interest in a merger with PSTH, which also allows it to raise $5 billion of equity capital and retain control of a newly public New York Stock Exchange listed company. In fact, the smaller the interest they are selling, the lesser the price sensitivity, which makes mergers with larger companies more likely to come on more advantaged terms than with smaller companies. PSTH’s targeting of companies that are multiples of its size is designed to enable it to acquire a minority interest in the newly merged company at an attractive valuation.** \n\nWe have always believed that SPACs are interesting investment constructs. We have had an excellent experience and strong investment results from the first SPAC we co-sponsored in 2011 that merged with Burger King, the predecessor company to Restaurant Brands, which remains a core holding more than eight years after the merger. In principle, a properly structured SPAC with a strong sponsor should offer a much more attractive alternative to going public than through an initial public offering. This fact has begun to be appreciated more widely, including by members of the venture capital community. Recently, Bill Gurley, one of the world’s leading venture capitalists, wrote a detailed blog post comparing SPACs and direct listings with initial public offerings. Bill makes a powerful case for SPACs. We encourage you to read his post: https:// [abovethecrowd.com/2020/08/23/going-public-circa-2020-door-3-the-spac/](https://abovethecrowd.com/2020/08/23/going-public-circa-2020-door-3-the-spac/) \n\nIn order to address these alignment issues, with PSTH we eliminated all forms of compensation, advisory fees, and founder shares. We further improved alignment issues by the Pershing Square funds committing to purchase a minimum of $1 billion of common stock and shareholder warrants on the same terms as PSTH’s public shareholders. In addition, the Pershing Square funds purchased so-called Sponsor Warrants for $65 million – their estimated fair market value at the time of the IPO – that will become 10-year warrants on 5.95% of the newly merged company shares, only if we successfully complete a transaction. \n\nWe also negotiated and capped the underwriting fees payable at 1.8% of the SPAC’s minimum equity capital, further reducing frictional costs. We paid two-thirds of these fees with the purchase of the Sponsor Warrants, which reduces the total frictional costs of PSTH in a merger borne by shareholders and our merger partner to a *de minimis* amount. \n\n**We used the excess demand for the PSTH IPO to curate a shareholder list that would be the envy of any public company. We selected investors for their reputation as long-term, value-added owners. We expect our shareholder registry will contribute to PSTH’s appeal as a merger partner for a high-quality company.** \n\nWe also made a number of changes to the typical shareholder warrant structure of SPACs that minimizes the risk of shareholder redemptions. These structural changes, when coupled with our large amount of committed capital to the entity and our curated long-term shareholder base, reduce and likely eliminate the need to raise expensive so-called PIPE capital at the time a transaction is identified, a de facto requirement in nearly every other SPAC transaction. \n\n**The result of all of the above is that we now control a publicly traded, NYSE-listed company with $5 billion of equity capital that is seeking to merge and take public a large capitalization private company that meets our investment criteria for business quality, growth, and an attractive valuation. PSTH is the largest SPAC in the world with the least amount of frictional costs in a merger, making it a highly attractive alternative to an IPO. As such, we expect that PSTH will give Pershing Square’s investors and PSTH’s public shareholders unique access to an untapped universe of bespoke, large-capitalization investment opportunities.** \n\n**To give you a better understanding of the unique, large scale of PSTH, there have been only three U.S. IPOs in the last decade of $5 billion or more – Alibaba, Uber, and Facebook – and the degree of difficulty for completing an IPO increases materially with its size.** This makes PSTH an extremely attractive alternative for a company that would like to raise $5 billion or more of capital and go public, particularly during a period in the capital markets which is likely to be highly volatile and uncertain because of the economic impact of the virus, the upcoming presidential election, and the challenging political, social, and economic environment. Uncertainty is the enemy of the IPO and the friend of a $5 billion SPAC with the largest amount of committed capital.\n\n**We are in discussions with a number of potential companies that are owned and/or controlled by private equity firms, families, start-up company founders, as well as other private companies, and are encouraged by the initial interest that we have received.** \n\n\\-\n\n**William A. Ackman**\n\n**August 2020**\n\n&amp;#x200B;\n\n\\-----------------------------\n\n**Discussion Points**\n\n* How seriously are people taking the  Collison's Tweets. They seem very benign to a potential deal. They have never said never. Couldn't this just be the mating dance Ackman talks about. 3D Chess?\n* Fintech is still most likely? Think Klarman, Guggenheim, Ackman already being deep in food service industry\n* Subway wouldn't be that bad. Am I wrong? Ackman would get it at a steal of a price. It could be a fixer upper like Chipotle?\n* Agree with my contender list?",
        "subreddit": "wallstreetbets",
        "title": "Pershing Square Holdings Ltd View on PSTH (Pershing Square Tontine Holdings) - World's Largest SPAC",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kbova1/pershing_square_holdings_ltd_view_on_psth/",
        "created": 1607807471.0
    },
    {
        "author": "Aordex96",
        "created_utc": 1608252731,
        "id": "kfahwm",
        "num_comments": 95,
        "num_crossposts": 0,
        "selftext": "I got $200K and I want to upgrade to a portfolio margin account and leave robinhood. Which of the 4 [title] is the best. I wanna leverage the fuck up.\n\nAlso I know td let’s you 6.6x with $125K Minimum. But I can’t find it how much the other let you leverage yourself. If y’all could link the info pls.\n\nCan’t go tits up",
        "subreddit": "wallstreetbets",
        "title": "TD vs Etrade vs Fidelity vs IB portfolio margin which is the best",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kfahwm/td_vs_etrade_vs_fidelity_vs_ib_portfolio_margin/",
        "created": 1608281531.0
    },
    {
        "author": "RetardedDungBeatle",
        "created_utc": 1608491752,
        "id": "kh0687",
        "num_comments": 91,
        "num_crossposts": 0,
        "selftext": "People may remember my older IPOB posts from when it was trading in the high teens (now trading at nearly $30 / share)\n\n[\\- IPOB - institutions buying up the shares on the dip](https://www.reddit.com/r/wallstreetbets/comments/jyh6zs/ipob_opendoor_nameplate_institutions_piling_in/)\n\n[\\- IPOB - momentum building with merger date announced](https://www.reddit.com/r/wallstreetbets/comments/k2rmss/ipob_opendoor_merger_vote_announced_for_1217/)\n\nSince my first posts, the price has gone from $18 to $30. **The merger was voted successfully on Thursday and the ticker changes to OPEN tomorrow.** \n\nTo recap, [OpenDoor is disrupting the $1.3 trillion dollar](https://www.opendoor.com/w/wp-content/uploads/2020/09/Opendoor-overview-investor-presentation.pdf) (annual) real estate market, with a leading market share in ibuying, and reducing a complex, tedious, and costly process to transact on a home to something simple, easy, and straightforward. The company will generate nearly $4B in revenue in 2021 after $2.5B in 2020. Not many flashy or disruptive SPAC combinations are already driving that much growth and proof of concept. This is a real company, not a story. \n\nWith Carvana trading for 6x 2021 and Zillow trading for north of 6x 2021 revenue, that positions OpenDoor to land a $21B market cap, or roughly $40/share assuming it trades in line with its comps day one. With OpenDoor the clear leader with the best market position and technology, it arguably should get a premium - maybe $50-$60 a share or more. If people take a long term view that this should be a $100B company in 3-4 years (and much more long term), even greater potential remains.\n\nTicker change days have proven volatile for a number of SPACs. Most go down as many retail traders don't see the pop they were hoping for. Fortunately, IPOB is supported by Ark Funds (\\~4MM share position), Fidelity, Soros, Sulvetta, and other nameplate institutions. Separately, the shares have consolidated and maintained gains vs. rocketing up just in the last few days - the fast money has been churned out. With the OpenDoor CEO ringing the bell of the NASDAQ, this will get as much visibility as a traditional IPO. \n\n400 May 21 20c.\n\n&amp;#x200B;\n\nhttps://i.redd.it/f26g6oa95e661.gif",
        "subreddit": "wallstreetbets",
        "title": "IPOB Becomes OPEN Tomorrow - Merger with OpenDoor Complete - 50%+ Upside Remains &amp; $450K YOLO Ride or Die",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kh0687/ipob_becomes_open_tomorrow_merger_with_opendoor/",
        "created": 1608520552.0
    },
    {
        "author": "ShutterLeaf",
        "created_utc": 1607535765,
        "id": "k9wieh",
        "num_comments": 88,
        "num_crossposts": 0,
        "selftext": "Fk [C3.Ai](https://C3.Ai) with such retarded opening i really hope that it crashes and burns after the hype so we all can pick it up cheap. At this point im not expecting any ipos to be cheap just purely based on the hype were seeing right now. But here is just a DD i did for it. The company has **an interesting business model in which that the company will partner up with another company to create an application that is proven to increase efficiency, reduce cost, track measurements for analysis purposes and so on and will then proceed to sell the same implementation to other companies that may benefit from the applications**. The revenue is mainly based on the subscription models to create steady stream of revenue. The company is lead by Tom Siebel, the pioneer of the customer relationship management software business that sold his company to Oracle for 6 billion in 2006 and C3.AI is his next level creation to revolutionize the world. **C3.AI is listed as one of the top disruptors of 2020 is backed up by Microsoft and spring creek capital with 50 million of stocks and $ 100 million investment respectively. C3.AI announced the partnership with Raytheon Technologies to develop AI solutions for aerospace and defense missions for government customers, including the U.S. Air Force and intelligence community. They also announced partnership with Microsoft and Adobe for a new customer – relationship management software seeking to comeback Salesforce INC.** The potential **for C3.AI is limitless because of how broad the scope can be. With a successful implementation of an application, C3.AI could easily spin it off to implement such applications to other industries with incredible scalability and tremendous reduction to developing cost**. Before we dive into what the company actually does, here is the overview of the company. \n\n**Financial wise, the company has**\n\n\\- **A whopping 71% yoy growth**\n\n\\- **86% subscription revenue**\n\n\\- **A $271 billion TAM by 2024.** \n\n\\- **Narrowing income loss thanks to the rapid growth**\n\n**The AI technology is a proven technology and is one that is being used daily to help industries moving faster into digital transformation. The currently capability and usage of the AI software is as followed** \n\n\\- **Make 1.1Billion predictions per day**\n\n\\- **Has 4.8million machine learning models in production use**\n\n\\- **Has 622 million sensors generating data for the C3.AI suite**\n\n\\- **Has 770 unique enterprise and extraprise source data integration** \n\n\\- **Has 50 Million businesses and consumers touched daily**\n\n**Notable market successes:**\n\n\\- **Banks are able to enhance securities lending optimization with estimated value of 14 billion in additional daily trades deployed in 52 weeks**\n\n\\- **Healthcare managements are able to enhance production optimization with estimated value of 300% increase in unit production deployed in 4 weeks**\n\n\\- **Oil and gas companies are able to predictive maintenance for offshore oil rigs and is able to recapture $28million per year in avoided shutdowns** \n\nWhat is C3.AI\n\nC3.ai is an enterprise AI software company that provides software as a service, applications that enable the rapid deployment of enterprise AI applications of extraordinary scale and complexity that offer significant social and economic benefit. \n\n**Two primary software solutions:**\n\n**1.** **C3 AI suite: designed to allow customers to apply design, develop, and deploy enterprise AI application to any type (basically a platform that allows you to develop your own applications)**\n\n**2.** **C3 AI Application: include a large and growing family of industry specific and application specific turnkey Ai solutions that can be immediately installed and deployed (a prebuilt application that is ready to go for implementations)**\n\nThe market entry growth strategy of C3.AI is focus on partnering and coordinating with lighthouse customers (the big companies including AWS, Baker Huges, FIS, Google, IBM and Microsoft) to create a proven and scalable applications that work to increase efficiency, cut down on costs and to record measurements on a massive scale for analysis purposes. With the established applications. \n\n**C3.AI is then able to** \n\n**1.** **Expand those same use cases across similar companies**\n\n**2.** **Establish middle market sales organizations, including tele sales, and online sales**\n\n**3.** **Leverage on marketing partners as enterprise and mid-market distribution channels**\n\nReal world user case:\n\nEngie – largest power producer in the world with\n\n\\- 114.4 GW power production capacity\n\n\\- $67 billion annual revenue in europoors money\n\n\\- 153k employees, operated in 70 counties \n\nWith the partnership with Engie, C3.Ai developed and deployed performance optimization for gas power plants, efficiency optimization of heating and cooling plants, energy analysis and management for enterprise and consumer customers, and anomaly detection of wind turbines. **C3 was able to bring the scalability required to build industrial AI based application with over 1million sensors, 5 million end points and 17mil measurements per day with the end result of bringing estimated 1.5 billion in annual economic benefits**\n\n\\- Wind turbines with in 12 weeks of deployment sees 2-3% increase in performance resulting in 15-22Mil annual economic value\n\n\\- Heating and cooling plants see 2-3% saving in energy consumption costs with $3mil annual economic value\n\n\\- Application in analyze energy for metered facility on the Ohio State university campus and is expected to see 25% energy saving within 10 years within 16 weeks of deployment \n\n\\- Application to analyze and forecast consumption for electricity and gas retail customers in France of 2.6Mil electricity consumers and 8.6mil has consumers with deployment of 6 months \n\n**Revenue model**\n\n\\- **Term subscriptions of the C3.AI Suite**\n\n\\- **Term subscriptions of C3.AI applications**\n\n\\- **Monthly runtime fee of C3 AI Applications and customer-developed application built using the C3.AI suite, usage based upon CPU- hour consumption**\n\n\\- **Professional services fees associated with training and assisting customers**\n\nIn the case of Engie, C3.AI would be making money from subscriptions to C3.AI suite and applications, setting up required trackers for measurements, developing AI applications, a monthly runtime fee if Engie is continuing to develop new applications with C3.AI. With the proven applications and set up, C3.AI then would be able to sell them to other companies that could also benefit from same implementation. **With Biden focusing on green energy infrastructures, one could expect the demand of the applications to increase.**\n\nTheir AI has also been used in sectors like utilities, banking, aerospace &amp; defense, healthcare, retail, telecommunications, smart cities, and transportation. **With already proven and prebuilt applications listed below that could be implemented into broader and more general sector.** \n\n\\- **Anti-money laundering**\n\n\\- **COVID-19 Data lake**\n\n\\- **AI CRM**\n\n\\- **Energy management**\n\n\\- **Fraud detection**\n\n\\- **Inventory optimization**\n\n\\- **Predictive maintenance**\n\n\\- **Production schedule optimization**\n\n\\- **Readiness**\n\n\\- **Sensor health**\n\n\\- **Supply network risk** \n\n**As C3.Ai continues to work with various more different sectors to create more applications, C3.AI will be able to reach into more boarder market. With already established applications in various broad sectors, C3.AI is going to take AI to the next level by focusing on deep penetration into business solutions, aerospace and defense with the partnership with Microsoft, Adobe and Raytheon Technologies to fully dominate the sectors.** \n\n **TLDR:** \n\n**There is none cause im too lazy to type one.**",
        "subreddit": "wallstreetbets",
        "title": "🚀🚀🚀 C3.AI is the real gold here ya'll but not at the current price 🚀🚀🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k9wieh/c3ai_is_the_real_gold_here_yall_but_not_at_the/",
        "created": 1607564565.0
    },
    {
        "author": "Amyx231",
        "created_utc": 1608889616,
        "id": "kjwkpl",
        "num_comments": 83,
        "num_crossposts": 0,
        "selftext": "I live in MA. So 12% short term gains tax. Plus the federal level income marginal tax.... I’m at 36%, 47% if I count social security tax and fmla tax (MA special). I don’t think social security taxes apply to investment income, but 36 is already plenty high. Not sure about the MA special tax(es). \n\nI’m about to cry right now. I didn’t make a lot, but I was about to go all in in 2021...and I mean, the taxes!!!\n\nI made $600-650 on $2750 principal to date (started from $250 Jun 27, add $250 every paycheck as I’m able). I was loving the returns, but I admit some investments aren’t stellar. Nothing over 10% red though. A lot of swing trades and day trades. I like to think I’m doing decently. \n\nShould I switch to holding ETFs long term? Or just switch to buy and hold? I like swing trading but I admit I sold too early quite a few times. What are people with high tax liabilities doing? Does anyone know a good hedge fund or 5? \n\nI’m paying 1/3 of my regular income in taxes, etc right now. No deductions - no mortgage (live at home), no kids, no nothing. So...what’s the smart play here? I was planning to put every penny I save in 2021 into stocks....\n\nBefore you recommend it, I’ve explored Roth IRA day trading, and I prefer Webull for day and swing trades but prefer Fidelity for my retirement, just feels more secure. I’m not sure I trust Webull to be here in 50 years. I have FXAIX, etc in my Roth - buy and hold. If I do buy and hold, I’ll do Vanguard and buy their ETF funds. There’s also MHE, but the 4% returns, even if no taxes, are a bit low....",
        "subreddit": "stocks",
        "title": "I’m in shock....taxes. Why did no one tell me about taxes?!",
        "url": "https://www.reddit.com/r/stocks/comments/kjwkpl/im_in_shocktaxes_why_did_no_one_tell_me_about/",
        "created": 1608918416.0
    },
    {
        "author": "bruceNook",
        "created_utc": 1609282911,
        "id": "kmp6wo",
        "num_comments": 78,
        "num_crossposts": 0,
        "selftext": "For y'all holding GME in your Robinhood margin accounts, **don't!** Robinhood [earns a lot of its money](https://robinhood.com/us/en/support/articles/how-robinhood-makes-money/) from lending securities from margin accounts to shorts, and unlike other brokers, doesn't share this income with you! And if you're unsure if you have a margin account or not, [by default](https://robinhood.com/us/en/support/articles/robinhood-accounts/), you have a margin account. Keep options and whatever other not crazily shorted shit in your RH account, but for stuff like GME, why make it easy for Melvin? \n\nSo what can you do to screw over those greedy shorts who have manipulated GME for far too long? Either switch your Robinhood account to a cash account (but then no more instant deposits), or if you still want those instant deposits, move over your GME holdings to another broker like Fidelity or Schwab with a non-margin account. \n\nBest of all, if you buy from some toilet paper hands on Robinhood that get scared off on days like today, then you're helping fortify the front line! Imagine if WSB can take another 1-2% of the float away from shorts! \n\nLess supply -&gt; more fees for shorts -&gt; more covering -&gt; 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\nLet's show Wall Street just how creative and unrelenting us WSB degenerates can be!! DIAMOND HANDS TO TENDIE TOWN  **💎🙌 💎**",
        "subreddit": "wallstreetbets",
        "title": "GME Gang, don't let Robinhood lend your shares to the shorts and Melvin! DD inside for more tendies",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kmp6wo/gme_gang_dont_let_robinhood_lend_your_shares_to/",
        "created": 1609311711.0
    },
    {
        "author": "jonvaughn",
        "created_utc": 1607605680,
        "id": "kaez1i",
        "num_comments": 72,
        "num_crossposts": 0,
        "selftext": "6 Months Ago - KAVL alerted @ .145pps (now $0.411 but went over $1) (3X to 7X) https://old.reddit.com/r/pennystocks/comments/gvmdlv/sit_back_relax_and_let_me_tell_you_why_i_like_kavl/\n\n6 Months Ago - OPTI alerted @ .0042pps (now $.04 but went over $0.20) (10X to 19X) https://old.reddit.com/r/pennystocks/comments/h0ylpj/today_should_be_an_exciting_day_for_opti/\n\n3 Months Ago - CBDD alerted @ .0013pps (now $0.0136 but went over $0.03) (10X to 27X) https://old.reddit.com/r/pennystocks/comments/iotee8/why_cbdd_should_be_on_your_radar_otc_pink/\n\nDISCLAIMER: I am not a day trader or an investment advisor. I'm just a guy with a regular job. My own due diligence starts with financials. Financials, in my opinion, are the foundation. I hold for long periods, and I accumulate on the dips. Also, and most importantly, I do not use rocketships in any of my posts. My broker is Fidelity. You will need a broker that allows for OTC trades. Fidelity is free. Some charge a flat fee. The most difficult decision I've had to face is stomaching the dips - sometimes they get scary. It's part of the game, and many people lose right before they were about to win. Market makers will try to shake the tree and get your shares at a discount.\n\n$JNSH / Market Cap: $2mm / OS 317mm / PPS .0065 / Current Pink Status (https://www.otcmarkets.com/stock/JNSH/security)\nInitial reason it caught my attention was the daily average traded volume. A month ago maybe $7,000 worth of shares traded in a day. And now, $30,000+, a spike at $905,000 on 11/23, settled back down, but volume is steadily higher. And relative to the price per share, still quiet and unknown. So, now, financials...\n\nFirst thing that caught my attention was their investment of $274,000 in Blink (Nasdaq: $BLNK) at the end of September. On Sept 30th, BLNK traded for $10 per share. Today it is trading at $27 per share. This is just a bonus. Nothing to do with the company's core. If the price per share holds true through next financials, this tells me the current price per share is 20% undervalued. This is almost $500,000 that will be automatically added to the next quarter financials.\n\nAnother thing that caught my attention was ZERO debt securities, including promissory or convertible notes. That ugly box that is usually filled in with companies we despise? Blank. Nada. Last conversion was June 2018 and laughable from an impact perspective. Clean.\n\nTo review the most recent financial statement: https://www.otcmarkets.com/stock/JNSH/disclosure\n(I could include a link direct to the PDF but people don't seem to like opening direct PDFs)\n\nJNS Holding Corporation is made up of three wholly-owned subsidiaries. JNS Power &amp; Control Systems, Inc., S&amp;H Leasing, Inc. and Evolve USA Charging Corp., specializing in (EV) charging station installations. This is where I had to BLINK twice. Digging in a little further, mostly in 2018, they installed over 160 (at that time) charging stations covering the greater Chicago area. ICC-certified, temperature control systems, design build - reputable and qualified in the world of electrical.\n\nThis is a profitable OTC company flying under the radar with over $900,000 in assets and $183,000 in liabilities. There is stockholder equity of $700,000. EQUITY. But factor in the BLINK investment. Over a $1.2mm in equity as of today. Regular, re-occuring profits, and equity. Come on now. \n\nI have no future catalyst here. I have no reason to tell you this is going to boom. But everything looks like a solid, small cap company, in a space that has been exploding. I just don't think many people know about it. I believe this one is in a good position to be loading and holding until the catalyst comes. They always do. You have to have patience. Patience has been the key to my success with the OTC. With $JNSH, I see very little downside risk compared to the upside potential. Each of my OTC plays comes with a sense of confidence, not hope, that allows me to continue to accumulate.\n\nCurrent PPS: $0.0065 / Short-Term Target: $0.045* (6X to 8X)\n*This would place a market cap of $14mm, and with the equity, industry growth, and profitability, I believe that is a reasonable estimate. Please review my previous targets on the older posts. Everything is higher than my short-term targets, and I try to be as realisitc as possible. I know I am not going to always pick a winner but I'm on a pretty good streak so far.\n\nSupporting links:\nhttps://www.jnsholdings.com/index.php\n\nCompleted projects:\nhttp://www.jnspower.com/completed-projects.php\n\nIndustry growth potential:\nhttps://cleantechnica.com/2020/06/02/bloomberg-to-compete-with-tesla-ev-charging-infrastructure-needs-to-evolve/",
        "subreddit": "pennystocks",
        "title": "And for my next OTC trick, let me introduce you to $JNSH (previous alerts on $OPTI, $KAVL, &amp; $CBDD - proof with links provided)",
        "url": "https://www.reddit.com/r/pennystocks/comments/kaez1i/and_for_my_next_otc_trick_let_me_introduce_you_to/",
        "created": 1607634480.0
    },
    {
        "author": "clash_jeremy",
        "created_utc": 1609196947,
        "id": "km1dy6",
        "num_comments": 69,
        "num_crossposts": 0,
        "selftext": "Finally put some money into my Fidelity account to get access to more units and other SPAC plays. Robinhood is great and all until you realize they are horrible if you want to actually make money with SPACs. Anyway, I have been digging a ton over the past month or so, and started a position in 4 SPACs today that are extremely close to NAV when you factor in the warrants thrown in with the units. I listed this as discussion, because I'd like to get feedback on these picks and genuinely learn more.\n\nMy strategy with SPACs is to play it very conservative with picks as close to NAV as possible while still having an interesting management team or target industry.\n\n1. SPRQU ($10.90) - 1/2 warrant - $345M trust - This is the one furthest from NAV and probably most discussed on here so far. Same folks you brought Fisker. Their website says, \"Focused on the energy value-chain in North America, with a particular focus on opportunities aligned with energy transition and sustainability.\" You will have a long wait with this one probably, but I'm totally fine to park cash here and see what happens. I'm happy to see they still offer 1/2 warrant. Some prominent teams are starting to do units with 1/5 of a warrant, which is crazy to me.\n2. GNRS ($10.06) - \\~$175M trust -  I've started to see a few post about these guys. Cannabis focused. Some rumors of Leafly are swirling, but that's all it is at this point. Their website is one of the cleanest I've ever seen from a SPAC with detailed plans on different aspects of the industry. I know a lot of pot stocks get a bad rap because of the run-up and subsequent crash, but I like this play because you basically get pre-IPO access to something intriguing, hopefully. In an industry that has some CAGR around 30%, I think there will be massive value here.\n3. SVOKU ($10.50) - 1/2 warrant - \\~260M trust - I've only seen one post on here about this, and it was just an introductory one when it IPOd. The team is diverse with a ton of private equity experience. They are committed to an ESG play, but don't necessarily specify what industry they are looking at. I see this as a Chamath-type play without paying the 20% premium out the gate. This is basically brand new, so you'll be waiting a while.\n4. CTAQU ($10.37) - 1/3 warrant - \\~$402M trust - Same as above. One post on here with not much info. Very interesting management team. Lloyd Carney had another SPAC that had a successful merger, and the company looks to be doing decent (Grid Dynamics). You also have a former CIO with the Army and a SVP from McAfee. It also just started, but the team and focus lead me to believe this could have a Palantir tech/government type target.\n\nI think all of the above are great plays with the upcoming administration in the US, so I'm excited to see where these go. My strategy is to hold all of these until at least LOI unless they get a crazy pump before. Would love to get your feedback. I haven't been in SPACs long, so I'm sure some of you know these companies or management teams much better than I.",
        "subreddit": "SPACs",
        "title": "Four SPACS Near NAV that you may have missed",
        "url": "https://www.reddit.com/r/SPACs/comments/km1dy6/four_spacs_near_nav_that_you_may_have_missed/",
        "created": 1609225747.0
    },
    {
        "author": "jmahoney94",
        "created_utc": 1608225906,
        "id": "kf1rw4",
        "num_comments": 69,
        "num_crossposts": 0,
        "selftext": "QS has been a great stock, but near term caution is warranted. QS is required to file a registration statement to enable the sale of the 50m PIPE shares they issued in conjunction with the KCAC merger. They are required to file within 15 business days of the merger close - that would be today (Dec 16) or tomorrow.\n\nOnce this registration statement is filed, it usually takes the SEC 15-30 days to approve. Once it is approved, PIPE shareholders are free to sell the stock with no restrictions. Note that the current diluted share count is 448m shares (mkt cap $28B). BUT, the current float is only 23m shares (the original KCAC shares). Once the registration statement is approved, the float will more than TRIPLE to 73m shares!\n\nWhile not all PIPE holders will sell immediately, I am sure that most will, given that they just made 6x their money in less than a month. The PIPE holders are mutual funds like Fidelity and Wellington.\n\nBottom line: Be careful since the supply of QS shares available to trade is about to more tham triple in the next 2-4 weeks.",
        "subreddit": "SPACs",
        "title": "QS float about to triple in 2-4 weeks",
        "url": "https://www.reddit.com/r/SPACs/comments/kf1rw4/qs_float_about_to_triple_in_24_weeks/",
        "created": 1608254706.0
    },
    {
        "author": "pound_salt_",
        "created_utc": 1608681013,
        "id": "kih8z3",
        "num_comments": 68,
        "num_crossposts": 0,
        "selftext": " **$STIC -- Northern Star Acquisition Corp. (merging with Bark aka Barkbox which will become $BARK)**\n\n**Current stock price:** $13.95\n\n**Enterprise value:** $2.1 billion\n\n**2020 fiscal year revenues (est):** $224 million\n\n**2021 fiscal year revenues (est):** $370 million\n\n**2022 fiscal year revenues (est):** $516 million \n\n**2023 fiscal year revenues (est):** $706 million\n\nWebsite: [https://bark.co](https://bark.co/)\n\nInvestor Presentation, December 2020 \\[[click here](https://static1.squarespace.com/static/5fc915303436806905d7150e/t/5fdae20279e44d2bcf557f77/1608180228067/BARK-Overview-12162020.pdf)\\]\n\n **Price Target:**\n\nIf we consider $BARK’s 40-50% revenue growth potential over the next few years plus their 60% gross margins plus their current operating margins and net cash positions I think it’s very fair to consider a 12x sales multiple (conservative) on FY2022 sales of $516M (conservative). This would put the market cap in 15 months (end of FY2022) at around $6.2 billion / 202M outstanding shares equals 15-month price target of $30 to $31 which would be 140-150% upside from Friday’s closing price of $12.40\n\n&amp;#x200B;\n\nhttps://preview.redd.it/wriyaz8tst661.jpg?width=1200&amp;format=pjpg&amp;auto=webp&amp;s=3e7918abb733f67427b726177119bf8239fd63c0\n\n***Here’s why I’m really excited about $BARK and why I started a 2.5% position in the company last Thursday as soon as the news broke that $STIC was merging with them…***\n\n**1.** $BARK’s current retention rate of 95% is phenomenal for a consumer products company. This retention rate is more evidence on how much Barkbox customers love their products and see tremendous value in the monthly pricing options. Consumers are realizing you can save a lot of time and money by buying directly from the manufacturer in bulk which is essentially what you’re doing with Barkbox plus you’re not paying all the overhead costs associated with retail locations.\n\n**2.** People love their dogs which means making them happy as much as possible. I have friends that post videos of the “unboxing” every month of the Barkbox with their dogs because it’s such a fun event for them. The dogs go wild as soon as they see the Barkbox coming towards them. As we return to a more normal world after Covid and millions of people are back in offices (at least part-time) they will start to feel the regret and guilt of being away from their dog(s). I believe Barkbox can be one of the solutions to help relieve some of these feelings. We love to spoil our dogs but why deal with the inconvenience of going to the pet store every month when you can just subscribe to Barkbox, save some money, make your dog happy, bring a smile to your own face and take one more errand off your to-do list. \n\n&amp;#x200B;\n\n[ ](https://preview.redd.it/o873gn7ast661.jpg?width=950&amp;format=pjpg&amp;auto=webp&amp;s=b4cbc38d1b603332b7250d90788782c8a882c25a)\n\n**3.** Through the first 3 quarters of FY21 $BARK’s customer acquisition cost on subscriptions have dropped from $56 to $42 (25% decrease). They’ve also been able to increase their gross profit per subscription by 20% during the same time period. These are both strong trends to watch closely as the company stays in growth mode. I think these numbers are moving in the right direction because of my #6 reason down below (social media &amp; influencer marketing). \n\n**4.** When Barkbox first launched they were using toys and treats from other companies but over the years as they’ve gotten to know their customers and analyzed the data...now they design and manufacture more than 90% of their SKUs. On average they design 15 new products every month which means they are always trying to stay ahead of the competition and create the next cool toy or treat rather than playing catch-up. $BARK wants to be the premier innovator and disrupter in the pet industry which I love. \n\n**5.** Bark has embraced the omni-channel strategy which means selling across multiple platforms, both ecommerce and in retail locations. Not only are they doing phenomenally well with their subscription boxes and BarkShop.com website but they are landing huge retail partnerships.\n\n**6.** Bark does an amazing job on social media, they are one of the best I’ve seen at sharing great content although let’s be honest… the cute dogs make it easier. Across all social media platforms Bark and Barkbox now have more than 8 million followers and fans. I’ve also noticed that they’re doing a great job working with influencers and affiliates to help drive website traffic, brand awareness and subscription customers. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/b50t8gtlst661.png?width=932&amp;format=png&amp;auto=webp&amp;s=a2fe6b48bff48d5c8f01f0c36286b1d7b3275a6b\n\n As of Friday’s close I had a 2.5% position in $STIC which reflects my early excitement and enthusiasm for this company. The stock did rally a little bit last week on the merger announcement however I still think the current stock price and impending enterprise value of $BARK is not yet reflecting the growth potential of this company. I did own $CHWY earlier this year and exited with a decent profit but personally I felt the valuation was getting too rich. I still love the pet industry and I want to be involved but no other company got me excited until I heard that Barkbox was coming public via $STIC. Once I dug into the numbers I knew that I needed to start a position right away which I’ll continue to add to in the coming weeks especially on any pullbacks.  \n\n&amp;#x200B;\n\nhttps://preview.redd.it/75bz1ckrrt661.jpg?width=1456&amp;format=pjpg&amp;auto=webp&amp;s=f571720190209f99bfef9ea6211a0614dcbc11e3\n\n Last Thursday, December 17th, Northern Star Acquisition Corp (SPAC) announced they will be merging with Bark to take the company public. Bark is the parent company of Barkbox and several other similar pet brands. The deal which is expected to close in approximately 3-4 months (early 2021Q2) gave Bark an enterprise value of $1.6 billion. This included $454 million of cash proceeds, $200 million of which came via PIPE from firms/funds including Fidelity and the Federated Hermes Kaufmann Fund). Bark will use these funds to accelerate growth through product development &amp; new product launches as well as customer acquisition via retail channel partnerships and DTC marketing. After the deal closes the ticker symbol will be changed from $STIC to $BARK. \n\nThe image below gives you a rough idea of the capital structure and balance sheet: \n\n&amp;#x200B;\n\nhttps://preview.redd.it/7ku2t5nurt661.png?width=892&amp;format=png&amp;auto=webp&amp;s=65dcfd389b15e835ab2347bb75285d088005160a\n\n \n\nBark is the global omni-channel brand leader for dogs which includes their main brand [Barkbox](https://www.barkbox.com/) as well as their other brands [BarkEats](https://hello.barkeats.com/), [BarkBright](https://www.barkbox.com/brightdental), [BarkPost](https://barkpost.com/), [BarkShop](https://barkshop.com/) and [Super Chewer](https://www.barkbox.com/super-chewer). \n\nBarkbox is a subscription service that delivers customized boxes of toys and treats \\[[website](https://www.barkbox.com/)\\]\n\nBarkEats creates custom meals for your dogs based on their nutritional needs \\[[website](https://hello.barkeats.com/)\\]\n\n&amp;#x200B;\n\nhttps://preview.redd.it/mkr45pcxrt661.png?width=1456&amp;format=png&amp;auto=webp&amp;s=f5093bab7aa9f1b4a900df0c6695ad20474ec4d9\n\n BarkBright is their doggie dental brand to keep your dog’s mouth, teeth and gums healthy and fresh \\[[website](https://www.barkbox.com/brightdental)\\] \n\n&amp;#x200B;\n\nhttps://preview.redd.it/8l9v2fd0st661.jpg?width=955&amp;format=pjpg&amp;auto=webp&amp;s=aa7ac6f15e6be130a04b65090febf3ab30e624be\n\n SuperChewer is a subscription box full of extra tough toys and treats \\[[website](https://www.barkbox.com/super-chewer)\\] \n\n&amp;#x200B;\n\nhttps://preview.redd.it/91t40jd1st661.jpg?width=600&amp;format=pjpg&amp;auto=webp&amp;s=88443e0ae61034a1f94965ce559d353c255c5ed7\n\n \n\nAcross their multiple brands $BARK has more than 1.1 million active subscriptions and 6.5 million lifetime customers which includes sales on Amazon and 23,000 retail locations through Target, Petco, PetSmart, Costco and others. Here are some of Bark’s toys being sold on Target.com \\[[click here](https://www.target.com/b/bark/-/N-iskuo?Nao=0)\\]\n\nWith more than 300 million pets in the US and the global pet industry expected to reach $100+ billion in sales this year it means $BARK is operating within a massive TAm. With that large TAM means plenty of competition but I strongly believe $BARK has carved out a nice niche for themselves which means plenty of room for exponential growth. \n\nPart of $BARK’s strategy going forward is to launch new products and services they can upsell to their 1.1+ million subscription customers. This strategy should keep customer acquisition costs low leading to better operating margins and quicker profitability. In the first half of FY2021 $BARK saw 179% YoY revenue growth from new product lines so this could be a massive growth engine moving forward. $BARK knows what their customers want and now they have the capital to build it for them. Since the company has so much data on both dogs and pet owners they are able to create new products and launch new brands with a high probability of success. \n\n$BARK is also planning to expand their relationships with Amazon and their other retail partners. Over the past year $BARK’s sales on Amazon were up 2.5x so it makes sense why this is a focus for them.\n\nFor Bark’s current fiscal year which ends on March 31, 2021 the company expects $370 million of revenues which is 65% revenue growth over fiscal year 2020. The company is also forecasting 60% gross margins (was 61.2% in the first half of FY21). These gross margins are superior to any other public companies in the pet industry such as $CWHY and $FRPT \n\nGoing forward the company is forecasting $516 million for fiscal year 2022 and $706 million for fiscal year 2023 -- they are probably low-balling the forecasts because it’s always better to under-promise and over-deliver once you’re a public company. \n\nIf these forecasts come to fruition it would represent 40% revenue growth and 37% revenue growth respectively for FY2022 and FY2023. $BARK expects gross margins to stay around 59-60% for the foreseeable future. The company expects to lose money through 2023 which is slightly disappointing but not surprising for a consumer products company in growth mode. Personally I think the company’s estimates in their investor presentation will prove to be too low and the company should beat them quite easily. Don’t underestimate the increased brand awareness that goes along with being a public company. Once $BARK is trading under its own ticker symbol and being talked about in the media, on blog sites, on trading platforms and of course on FinTwit it means this really awesome company is now getting exposure to millions of new potential customers. \n\nIn terms of public company comparisons, I’d say Chewy which trades under $CHWY is the best one to use. Chewy was founded a year earlier than Bark and is forecasted to do $7 billion of revenues in their FY2021 with a current market cap of $42 billion. As of Friday’s close, $CHWY’s stock price is now up 245% YTD for 2020. $CHEWY's revenue growth is expected to decline from 45% YoY in their FY2020 to 25% YoY in their FY2021. Throw in their 25% gross margins and it’s easy to see why I think $BARK could be the better growth stock going forward. \n\nNot that I ever invest in companies based on the potential of them being acquired however that is a real possibility for $BARK. I can think of at least 3-4 companies that could be potential acquirers in the future -- $CHWY, $AMZN, $WMT and $TGT just to name a few. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/tdv7pce4st661.jpg?width=742&amp;format=pjpg&amp;auto=webp&amp;s=f876f4f21251bfd470bd57200a5e3a14f74d2377\n\n I'm not saying that $BARK is going to be the next $CHWY because they are very different companies with very different business models but it does show how large the opportunity is for pet focused e-commerce and omni-channel companies especially ones that put a priority on making the customer happy. \n\nSource: [https://jonahlupton.substack.com/p/jonahs-weekly-growth-stock-ideas](https://jonahlupton.substack.com/p/jonahs-weekly-growth-stock-ideas)",
        "subreddit": "wallstreetbets",
        "title": "The next meme hot pick for all the 'GOOD BOY' autists. $STIC &gt;&gt; $BARK aka BARK BOX",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kih8z3/the_next_meme_hot_pick_for_all_the_good_boy/",
        "created": 1608709813.0
    },
    {
        "author": "MitchHedberg",
        "created_utc": 1608244014,
        "id": "kf7u2z",
        "num_comments": 56,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "I'm ready to join the big boys and ditch RH - what's good? Webull interests me. Fidelity? TD? ETrade? Ally? What's your recommendations and experiences?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kf7u2z/im_ready_to_join_the_big_boys_and_ditch_rh_whats/",
        "created": 1608272814.0
    },
    {
        "author": "bethsiebs",
        "created_utc": 1609209308,
        "id": "km54om",
        "num_comments": 56,
        "num_crossposts": 0,
        "selftext": " \n\nI got into the stock market when it crashed, and was buying 1-2k of stocks I was interested in. Now I have way too many, and need to consolidate to have some cash to be able to put 5-10k in the next good buy. Here’s my current holdings. Tell me what to get rid of. \n\n## Individual\n\n#### AAL\n\nAMERICAN AIRLINES GROUP INC COM USD0.01\n\n#### AAPL\n\nAPPLE INC COM USD0.00001\n\n#### AMAT\n\nAPPLIED MATERIALS INC COM USD0.01\n\n#### ARRY\n\nARRAY TECHNOLOGIES INC COM SHS\n\n#### BABA\n\nALIBABA GROUP HOLDING LTD SPON ADS EACH REP 8 ORD SHS\n\n#### BB\n\nBLACKBERRY LTD COM ISIN #CA09228F1036 SEDOL #BCBHZ31\n\n#### BGGSQ\n\nBRIGGS &amp; STRATTON CORP\n\n#### CARR\n\nCARRIER GLOBAL CORPORATION COM\n\n#### CNK\n\nCINEMARK HLDGS INC COM\n\n#### CORR\n\nCORENERGY INFRASTRUCTURE TR IN COM NEW\n\n#### DAL\n\nDELTA AIR LINES INC\n\n#### DKNG\n\nDRAFTKINGS INC COM CL A\n\n#### F\n\nFORD MTR CO DEL COM\n\n#### FZIPX\n\nFIDELITY ZERO EXTND MARKET INDEX FUND\n\n#### GASFX\n\nHENNESSY GAS UTILITY INVESTOR CL\n\n#### GIK\n\nGIGCAPITAL3 INC COM\n\n#### HOFV\n\nHALL OF FAME RESORT &amp;ENTMT CO COM\n\n#### HYLN\n\nHYLIION HOLDINGS CORP COMMON STOCK\n\n#### INTC\n\nINTEL CORP COM USD0.001\n\n#### LUMN\n\nLUMEN TECHNOLOGIES INC COM\n\n#### MHH\n\nMASTECH DIGITAL INC COM\n\n#### MMM\n\n3M CO\n\n#### NET\n\nCLOUDFLARE INC CL A COM\n\n#### PBF\n\nPBF ENERGY INC COM USD0.001\n\n#### PLTR\n\nPALANTIR TECHNOLOGIES INC CL A\n\n#### PLUG\n\nPLUG POWER INC\n\n#### PTON\n\nPELOTON INTERACTIVE INC CL A COM\n\n#### QURE\n\nUNIQURE N.V. COM EUR0.05\n\n#### RIDE\n\nLORDSTOWN MOTORS CORP COM CL A\n\n#### RKT\n\nROCKET COS INC COM CL A\n\n#### SCKT\n\nSOCKET MOBILE INC COM NEW\n\n#### T\n\nAT&amp;T INC COM USD1\n\n#### THCB\n\nTUSCAN HLDGS CORP COM\n\n#### THMO\n\nTHERMOGENESIS HLDGS INC COM\n\n#### TSM\n\nTAIWAN SEMICONDUCTOR MANUFACTURING SPON ADS EACH REP 5 ORD TWD10\n\n#### VVPR\n\nVIVOPOWER INTERNATIONAL PLC COM USD0.012\n\n#### WFDAX\n\nWELLS FARGO DISCOVERY FD CL A\n\n#### WKHS\n\nWORKHORSE GROUP INC COM NEW\n\n#### XL\n\nXL FLEET CORP COM CL A\n\n#### XOM\n\nEXXON MOBIL CORP\n\n## ROTH IRA\n\n#### CLA\n\nCOLONNADE ACQUISITION CORP COM USD0.0001 CL A\n\n#### CORR\n\nCORENERGY INFRASTRUCTURE TR IN COM NEW\n\n#### FE\n\nFIRSTENERGY CORP COM USD0.10\n\n#### FLCSX\n\nFIDELITY LARGE CAP STOCK\n\n#### FVRR\n\nFIVERR INTERNATIONAL LTD COM NPV\n\n#### FXAIX\n\nFIDELITY 500 INDEX FUND\n\n#### FZROX\n\nFIDELITY ZERO TOTAL MARKET INDEX\n\n#### GTLOX\n\nGLENMEDE LARGE CAP CORE\n\n#### IVR\n\nINVESCO MORTGAGE CAPITAL INC\n\n#### MMEDF\n\nMIND MEDICINE (MINDMED) INC SUBORDINATE VOTING SHARES ISIN #CA60255C1095 SEDOL #BLLZKY4\n\n#### NIO\n\nNIO INC SPON ADS EACH REP 1 ORD SHS CLASS A\n\n#### NMM\n\nNAVIOS MARITIME PARTNERS L.P. COM UNITS REP LTD PTN INT(POST REV SPLT)\n\n#### ODT\n\nODONATE THERAPEUTICS INC COM\n\n#### OPEN\n\nOPENDOOR TECHNOLOGIES INC COM\n\n#### PARWX\n\nPARNASSUS ENDEAVOR FUND\n\n#### PBF\n\nPBF ENERGY INC COM USD0.001\n\n#### PSX\n\nPHILLIPS 66 COM\n\n#### VLDR\n\nVELODYNE LIDAR INC COM\n\n#### VLO",
        "subreddit": "stocks",
        "title": "Tell me 2-3 stocks I should sell.",
        "url": "https://www.reddit.com/r/stocks/comments/km54om/tell_me_23_stocks_i_should_sell/",
        "created": 1609238108.0
    },
    {
        "author": "stocks_fren",
        "created_utc": 1608835312,
        "id": "kjkf8r",
        "num_comments": 54,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "An account managed by Fidelity Fund vs. My Palantir YOLO",
        "url": "https://i.redd.it/vn1x2xpdj6761.png",
        "created": 1608864112.0
    },
    {
        "author": "deltalake",
        "created_utc": 1609088283,
        "id": "kl6xvd",
        "num_comments": 54,
        "num_crossposts": 0,
        "selftext": "**🚀TWLO DD – When Opportunity Knocks You Blow the Door Open** \n\nNo, this isn’t about PSTH. It’s about my other favorite stock and second biggest holding, Twilio ($TWLO). \n\nI believe this to be a sleeping giant heading into 2021. Twilio ($TWLO) is a cloud services company that has seen exceptional gains over the course of the last three quarters. \n\n**Overview** \n\nTwilio ($TWLO) is a developer of communications software, cloud-based platform, and services. **Twilio is a leading communications platform firm that enables developers to integrate communications capabilities such as messaging, voice, and video into client-facing products, thus helping businesses strengthen customer engagement worldwide.** Its platform consists of the following sectors: engagement cloud, programmable communications cloud, and super network. \n\nVia TWLO, businesses can integrate real-time communications capabilities into business applications, expanding the number of touchpoints with their customers. Twilio’s value proposition comes from the building blocks available to developers who can use software to assimilate new customer-facing offerings within their applications. Some simple use cases include automatic text notifications for appointments and two-factor authentication for secure services such as WhatsApp. The Programmable communications cloud software is a set of tools that enables developers to embed voice, messaging, and video capabilities into their applications. The super network is a software layer that allows customers' software to communicate with connected devices globally. \n\n**In other words, they are involved in sales happening online re: e-commerce and get a chunk of that action.** \n\nLet the tendies rain down amongst thee [https://www.hollywoodreporter.com/news/tony-montanas-little-friend-story-874414](https://www.hollywoodreporter.com/news/tony-montanas-little-friend-story-874414) \n\nTwilio has done its own research on this and that coronavirus response accelerated digital communication strategies by about six years for businesses. \n\nThe CEO cites this in the Cramer interview and uses the very interesting of NIKE as a digital salesforce using TWLO platforms to reach out to customers. The change in focus can be illustrated by Twilio’s stock run this year, growing 277% year to date. The shares climbed 1.6% higher Tuesday to new highs, closing at $370.75. \n\n**Fundamentals** \n\n· Most Recent Price = 362.88\n\n· 52 Week High = 374.49\n\n· 52 Week Low = 68.06 \n\n· Average Daily Volume = 2.75M\n\n· Market Cap = 54.85B Consensus \n\n**Analyst Ratings** \n\nBuy 20/Overweight 1/Hold 1/Underweight 1/Sell 1 \n\n**Price Targets** \n\nRanges from high 300’s to $550 \n\nFinancials (an actual “Fortress Balance Sheet” as Jamie Dimon would say) \n\nI really cannot say enough about their balance sheet. Its bananas. \n\nTotal Assets = 5.15B \n\nTotal Liabilities = 871.11M\n\nTotal Equity = 4.28B \n\n\\*KEY Financial: TWLO has a Current Ratio (CR) of 8.22, which is insane. For reference, JPMs is 0.88. It’s a metric used to convey overall financial strength using current assets and liabilities, fyi. \n\n**Big Shareholders:** \n\n· The Vanguard Group, Inc. \n\n· Morgan Stanley Investment Management, Inc.\n\n· Fidelity Management &amp; Research Co. LLC \n\n· BlackRock Fund Advisors \n\n**MORNING STAR REPORT SUMMARY**\n\n· Twilio has elite retention rates within the software industry, with gross retention hovering around 97% and net dollar retention north of 120%. \n\n· We think this is indicative of the stickiness of the firm’s platform. \n\n· The proposed acquisition of Segment ties together Twilio’s software stack and will increase business reliance on the firm for customer engagement. \n\n· As Twilio invests more in Solutions APIs, there should be a shift away from lower margin products such as messaging, which should also contribute to increased recurring revenues.\n\n· “We view narrow-moat Twilio as having a long growth runway ahead, as the company continues to make strategic organic and inorganic investments to expand its platform.” \n\n**Key Points re the Bull Case** \n\nSeveral big-time analysts/names have come out calling for a big bull session for TWLO in 2021 \n\n**Alex Zukin** – hugely respected and respected analyst from RBC ranked TWLO as the top software pick for 2021 - [https://www.youtube.com/watch?v=i5IXWtG9jQU](https://www.youtube.com/watch?v=i5IXWtG9jQU)\n\n**Jim Cramer**, you know him – He’s also come out as a big TWLO bull. [https://twitter.com/jimcramer/status/1341822886043070469](https://twitter.com/jimcramer/status/1341822886043070469) \n\nEnough from analysts and Cramer though, there are people in the background that lead these people to post about stocks. The managers at Baron Funds are who I am talking about. Baron Funds is incredibly bullish on TWLO. Chief among their managers is **Alex Umansky**.  \n\n[https://www.barrons.com/articles/stock-fund-soaring-despite-coronavirus-51596060341](https://www.barrons.com/articles/stock-fund-soaring-despite-coronavirus-51596060341) \n\n**Oh, and if you don’t know who or what Baron Funds are, look into it. Ron Baron is who laid the groundwork for me becoming bullish on TSLA in Q1.** \n\nBaron has been in on TSLA since 2013. He has been mocked and laughed at over the years for his huge position. Through the pandemic, he has not sold a single share, and only laments not being able to buy more. Even ARK got out of TSLA to some degree on this bull run. Baron Fund has done DD on TSLA and are projecting, based on numbers, revenue, and management (not hype) another 5-10x gain over the next 5 years. Some Ron Baron Balling on YouTube. \n\nBasically, DUNKING on the silly TSLA bears: [https://www.youtube.com/watch?v=R5QJlTMADGQ](https://www.youtube.com/watch?v=R5QJlTMADGQ) \n\n[https://www.cnbc.com/video/2020/10/14/billionaire-investor-ron-baron-tesla-will-become-a-2-trillion-company.html](https://www.cnbc.com/video/2020/10/14/billionaire-investor-ron-baron-tesla-will-become-a-2-trillion-company.html) \n\nAnyways, these are the people placing TWLO in their funds in big numbers now. These are the people who actually make money. Do you like Bill Ackman? I do too. Ron Baron is the quieter guy in the background managing 3X as much as Ackman. Baron Fund’s Alex Umansky, the architect of the TWLO play is amazing though, he’s been on a killing spree basically…. Up 60% on the year with his 1.5B portfolio at Baron. He has tripled his investment on TWLO thus far with no intent on selling. \n\nMore on his insights here: [https://www.baronfunds.com/sites/default/files/Business-Insider-Article-Reprint-Alex-Umansky-Profile-11.11.20.pdf](https://www.baronfunds.com/sites/default/files/Business-Insider-Article-Reprint-Alex-Umansky-Profile-11.11.20.pdf) \n\n**Resources** \n\nTWLO CEO Interviewed by JAMES “WSB” CRAMER: [https://www.cnbc.com/2020/12/22/coronavirus-sped-up-digital-transformation-by-6-years-twilio-ceo-says.html](https://www.cnbc.com/2020/12/22/coronavirus-sped-up-digital-transformation-by-6-years-twilio-ceo-says.html)\n\nBaron Funds: [https://www.baronfunds.com/sites/default/files/Baron-Global-Advantage-Strategy-Letter-6.30.19.pdf](https://www.baronfunds.com/sites/default/files/Baron-Global-Advantage-Strategy-Letter-6.30.19.pdf)\n\nTwilio Stock calls: [https://realmoney.thestreet.com/investing/twilio-could-climb-to-new-heights-after-another-pullback-15524416](https://realmoney.thestreet.com/investing/twilio-could-climb-to-new-heights-after-another-pullback-15524416)\n\nCEO Discussion: [https://techxplore.com/news/2020-12-twilio-ceo-discusses-pandemic-tech.html](https://techxplore.com/news/2020-12-twilio-ceo-discusses-pandemic-tech.html) \n\nTwilio Buy opportunity: [https://finance.yahoo.com/news/twilio-inc-twlo-stock-sinks-224510121.html](https://finance.yahoo.com/news/twilio-inc-twlo-stock-sinks-224510121.html)\n\n**Plays** \n\nCommons are a great move, imo \n\nOptions are where some serious money can be made in the next 2 quarters though: \n\nApril 2021 $450 calls are selling for around $12 premium \n\nApril 2021 $400 calls are selling for around $30 premium \n\n\\*\\*\\*Jan 2022 $500 calls are selling for around $35 premium\\*\\*\\* \n\n**Positions** \n\n100 shares @ $315 (up around 12% for me in the last 3 weeks)\n\nWill dive into 2022 options this week, 5 or 10K worth \n\n**Good Luck to all!**",
        "subreddit": "wallstreetbets",
        "title": "💥 🚀Twilio - $TWLO – A Great Opportunity for 2021 – Commons or Options, The World is Yours 💥",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kl6xvd/twilio_twlo_a_great_opportunity_for_2021_commons/",
        "created": 1609117083.0
    },
    {
        "author": "Carxlos",
        "created_utc": 1607639002,
        "id": "kap6za",
        "num_comments": 50,
        "num_crossposts": 0,
        "selftext": "I’m currently extremely indecisive to which brokers to use. From these choices I’m looking for something with fast execution speed, not too bad of a UI, something that doesn’t crash or go down as often, and not too expensive fees. I trade options and probably are on the higher side of intermediate as a trader, what are your guys thoughts; Fidelity vs IB vs ETrade vs Tastyworks. \n\nAlso, thank you guys in advance, I appreciate it the help and feedback!",
        "subreddit": "options",
        "title": "WHICH BROKER?! (FIDELITY VS IB VS ETRADE VS TASTYWORKS)",
        "url": "https://www.reddit.com/r/options/comments/kap6za/which_broker_fidelity_vs_ib_vs_etrade_vs/",
        "created": 1607667802.0
    },
    {
        "author": "Misofire",
        "created_utc": 1608340752,
        "id": "kfy9im",
        "num_comments": 48,
        "num_crossposts": 0,
        "selftext": "What are your thoughts on FBOTX, FGDFX, FMEDX, FNETX, FNTEX, FTEK? . These funds focus on disruptive technologies and have significantly outperformed the SP500 since their release. One of the things I like about them is that the expense ratio falls the longer you hold it. From 1% to. 5% within 3 years.\n\nOne of the problems? These funds have only been out since April so there isn't much history to look at.\n\nFor those who know something about these funds, what are your thoughts?",
        "subreddit": "stocks",
        "title": "Fidelity Disruptive Funds - ARK for Boomers",
        "url": "https://www.reddit.com/r/stocks/comments/kfy9im/fidelity_disruptive_funds_ark_for_boomers/",
        "created": 1608369552.0
    },
    {
        "author": "LAguy",
        "created_utc": 1609411680,
        "id": "knnxsb",
        "num_comments": 48,
        "num_crossposts": 0,
        "selftext": "I like these based on the management teams.\n\n**FGNA** \\- Chairman is Joe Moglia who became the CEO of TD Ameritrade in 2001, and when he stepped down in 2008, shareholders had enjoyed a 500% return. In 2009, he became chairman of the board. TD Ameritrade was recently acquired by Charles Schwab. Strategic Sponsor Shareholders includes  Blackstone. [https://www.fgnewamerica.com/](https://www.fgnewamerica.com/)\n\n**FUSE** \\- Chairman Jim Ross is best known for being the global Chairman of its SPDR exchange-traded funds' business.  He is an ETF pioneer and was instrumental in creating, developing, and bringing to market many of the world’s first ETFs, including ETFs in the U.S., Hong Kong and Australia. These included the SPDR S&amp;P 500 ETF (NYSE: SPY), the first U.S. ETF and largest ETF in the world today, as well as the first gold ETF (NYSE: GLD).  [https://www.fusionacq.com/](https://www.fusionacq.com/)\n\n**AACQ** \\- Charles Drucker is former Executive Chairman and CEO of WorldPay.  Mr. Drucker presided over the carve-out of Vantiv from Fifth-Third Bank in 2009, it’s initial public offering in 2012, its merger with Worldpay in 2018, and the subsequent sale to Fidelity National Information Services, Inc. in 2019. [http://www.artiuscapital.com/](http://www.artiuscapital.com/)\n\n(FYI, AACQ might be dead money until after Drucker's Non-Competition agreement expires on July 31st, 2021.) See S-1 SEC filing [https://secfilings.nasdaq.com/filingFrameset.asp?FilingID=14237190&amp;RcvdDate=6/25/2020&amp;CoName=ARTIUS%20ACQUISITION%20INC.&amp;FormType=S-1&amp;View=html](https://secfilings.nasdaq.com/filingFrameset.asp?FilingID=14237190&amp;RcvdDate=6/25/2020&amp;CoName=ARTIUS%20ACQUISITION%20INC.&amp;FormType=S-1&amp;View=html)\n\n**Nine Payment And Fintech Predictions For 2021**\n\n[https://www.forbes.com/sites/danieldoderlein/2021/12/30/nine-payment-and-fintech-predictions-for-2021/?sh=1122beec358f](https://www.forbes.com/sites/danieldoderlein/2021/12/30/nine-payment-and-fintech-predictions-for-2021/?sh=1122beec358f)",
        "subreddit": "SPACs",
        "title": "Favorite Fintech SPACs for New Year and good article on 2021 predictions",
        "url": "https://www.reddit.com/r/SPACs/comments/knnxsb/favorite_fintech_spacs_for_new_year_and_good/",
        "created": 1609440480.0
    },
    {
        "author": "vitilsky",
        "created_utc": 1607532942,
        "id": "k9viva",
        "num_comments": 47,
        "num_crossposts": 0,
        "selftext": "(Reposted: was removed for mentioning creep toe currency)\n\nBlackstone and CVC have agreed to list Paysafe at a $9bn valuation via a merger with a blank-cheque company launched by billionaire Bill Foley (Chairman and former CEO of Fidelity)\n\nFoley Trasimene Acquisition II, the special purpose acquisition company that listed in August on the New York Stock Exchange raising $1.47bn, will merge with Paysafe in one of the largest Spac deals to date.\n\nMr Foley’s investment vehicle will also raise close to $2bn in additional funds from institutional investors, including hedge fund Third Point and Hedosophia, the company set up by British investor Ian Osborne who has launched multiple Spacs with Chamath Palihapitiya (The IPOB guy)\n\nPaysafe, which has been dominant in handling online gambling transactions as well as helping retailers process customers’ online payments, was acquired by Blackstone and CVC for £3bn in 2017. As part of the deal with Mr Foley’s Spac the private equity duo will retain a stake in Paysafe.\"\n\nhttps://www.google.com/amp/s/amp.ft.com/content/7629f86f-65ed-4ee6-824f-30d291f186b6\n\n-----\n\nAbout Paysafe: Paysafe is a leading global payments provider focused on digital commerce and iGaming transactions.\n\nPaysafe holds the No. 2 market share position in the global digital wallet market. The company’s digital wallet is in over 120 markets and has customers like DraftKings Inc (NASDAQ: DKNG) and William Hill. The company has 3.8 million active users for its digital wallet segment.\n\nPaysafe is No. 1 in the iGaming eCash network segment. Customers for this segment include Fortnite, Twitch and Spotify Technologies (NYSE: SPOT).\n\nIn the independent merchant market, Paysafe holds the No. 4 market share position and helps with POS and e-commerce for small businesses.\n\nhttps://m.benzinga.com/article/18678982\n\nBrands: Neteller, Skrill, paysafecard\n\nhttps://en.m.wikipedia.org/wiki/Paysafe_Group\n\nNote: Neteller supports creep toe\n\nhttps://www.neteller.com/en\n\n-----\n\nTLDR. $9 BILLION fintec SPAC deal w. strong institutional investors + Biggest online gambling transaction processor and digital wallet (DraftKings, William Hill, etc) + payment processor used in Fortnite, Spotify, Twitch, etc = This is a big wet pussy waiting to get f***** = tendonitis to the moon",
        "subreddit": "wallstreetbets",
        "title": "$BFT (Paysafe)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k9viva/bft_paysafe/",
        "created": 1607561742.0
    },
    {
        "author": "desmosabie",
        "created_utc": 1609282341,
        "id": "kmp0at",
        "num_comments": 42,
        "num_crossposts": 0,
        "selftext": "i’m using Fidelity desktop/iphone, Stockcharts dot com, WSB, r/investing, news outlets w/associated keywords, and just reading back n’forth but not sure when to pull the trigger. Right now i’ve only $750 ready to go and I go back n’forth on MT (i work in metal fab/weld) an wait for ERs on 1/11/2021 or PSTH and hope for that purchase/merger of ??? turns out as good as i guess but, i have yet to look up and see Bill Ackmans history and how good he is at what he does. With 7B in the bank i’m “guessing” good. \nSo how do you determine enough is enough ? What do you use ?",
        "subreddit": "wallstreetbets",
        "title": "Noob here, when do you consider your DD to be “enough” ?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kmp0at/noob_here_when_do_you_consider_your_dd_to_be/",
        "created": 1609311141.0
    },
    {
        "author": "mazrim00",
        "created_utc": 1607270137,
        "id": "k7w502",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "I know this has been talked of before, but have had a lot of issues with my current account at Vanguard (constant website issues for the last 6 months or so, $300 fees to split units, taking forever for tickers to change with SPACS, unable to buy certain OTC stocks for \"my safety, etc.) but wanted to get a current synopsis on preferred brokers. Also having a hard time using search feature to specifically see if any recent questions on this.\n\n&amp;#x200B;\n\nWhat is your preferred brokerage? From what I remember seeing Fidelity and TD Ameritrade were a few but may be wrong on that.",
        "subreddit": "stocks",
        "title": "Brokerage question",
        "url": "https://www.reddit.com/r/stocks/comments/k7w502/brokerage_question/",
        "created": 1607298937.0
    },
    {
        "author": "slytherin5",
        "created_utc": 1608285653,
        "id": "kfienp",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "There seems to be a lot of opportunity in IPOs. However, I find it very hard to participate. I don't have a lot of assets (&lt;$50K). Is it possible to participate in good IPOs like Doordash, etc.? Which brokerage firms have the most relaxed criterion for participation but do get access to such IPOs.   \nI recently opened an account with Webull, which shows me all the IPOs but doesn't even allow to order. I saw Fidelity needs $100k or $500k+. Schwab doesn't participate at all due to some lawsuit. Merrill Edge and Chase also said they don't allow IPOs with their brokerage accounts.  \n\n\nWould highly appreciate your help!",
        "subreddit": "investing",
        "title": "Is it possible to participate in IPOs of US companies without having $500k+ assets? If yes, which brokerage firms are recommended?",
        "url": "https://www.reddit.com/r/investing/comments/kfienp/is_it_possible_to_participate_in_ipos_of_us/",
        "created": 1608314453.0
    },
    {
        "author": "strukout",
        "created_utc": 1608587240,
        "id": "khr214",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "Fidelity added 1M shares across growth funds\n\n2020-12-18\t\tFLCLX - Fidelity Flex Large Cap Growth Fund\t\t\t\t\t\n2020-12-18\t\tFSBDX - Fidelity Series Blue Chip Growth Fund\t\t\t\t\n2020-12-18\t\tFBCGX - Fidelity Blue Chip Growth K6 Fund\t\t\t\t\n2020-12-18\t\tFBCG - Fidelity Blue Chip Growth ETF\t\t\t\t\n2020-12-18\t\tFBGRX - Fidelity Blue Chip Growth Fund",
        "subreddit": "stocks",
        "title": "Interesting positive for JMIA believers",
        "url": "https://www.reddit.com/r/stocks/comments/khr214/interesting_positive_for_jmia_believers/",
        "created": 1608616040.0
    },
    {
        "author": "MoCopley",
        "created_utc": 1608406767,
        "id": "kgenlg",
        "num_comments": 35,
        "num_crossposts": 0,
        "selftext": "I’m aware there are a few avenues to gain some indirect exposure through alphabet, Fidelity, and Barons. Would be interested to hear any further ideas on it. I’m just seeking more information as to where one would look to possibly get any kind of stake at all in SpaceX.",
        "subreddit": "investing",
        "title": "Does anyone own SpaceX stock, or know someone who does? I’d be interested to know how they did it.",
        "url": "https://www.reddit.com/r/investing/comments/kgenlg/does_anyone_own_spacex_stock_or_know_someone_who/",
        "created": 1608435567.0
    },
    {
        "author": "RomanTheVulgarian",
        "created_utc": 1608777002,
        "id": "kj6vxc",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": "Is there a magical formula to get Level - 2 access? I just want to buy call options, but got denied the update to level 2. I have the max salary and net worth listed in the drop down to their questionnaire, a 401(k) held with Fidelity, as well as Roth IRA holding mutual funds and regular brokerage holding ETFs.  I don’t have experience trading options, but that’s because I don’t have permissions on Fidelity. I don’t want to trade on margin. If I pay $200 to buy a call and lose it, that’s on me. I don’t understand why Fidelity is stopping me with these roadblocks.",
        "subreddit": "options",
        "title": "Fidelity - Level 2 Access",
        "url": "https://www.reddit.com/r/options/comments/kj6vxc/fidelity_level_2_access/",
        "created": 1608805802.0
    },
    {
        "author": "royaIs",
        "created_utc": 1607191135,
        "id": "k7c6ee",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "I honestly hadn't heard about it, until I was looking at my fidelity dashboard and saw it was on of the top purchased stocks yesterday on the site. I did some quick research, and saw this article:\n\nhttps://www.marketwatch.com/story/this-25-year-old-is-now-a-billionaire-after-his-self-driving-car-company-luminar-went-public-11607114665\n\nI wanted to know what you all thought of it, before I really delved deep.",
        "subreddit": "stocks",
        "title": "What are your thoughts on LAZR? A meme stock or a legit investment opportunity?",
        "url": "https://www.reddit.com/r/stocks/comments/k7c6ee/what_are_your_thoughts_on_lazr_a_meme_stock_or_a/",
        "created": 1607219935.0
    },
    {
        "author": "BakedAvocado3",
        "created_utc": 1607551314,
        "id": "ka1r1r",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "Been trying to get into penny stocks but for some reason fidelity wouldn't let me buy last week. Did I miss the boat on these three or are they still going up? I freed up some funds and looking to possibly jump in tomorrow.",
        "subreddit": "pennystocks",
        "title": "New investor here, am I too late for TSNP, SEGI, AND ALPP?",
        "url": "https://www.reddit.com/r/pennystocks/comments/ka1r1r/new_investor_here_am_i_too_late_for_tsnp_segi_and/",
        "created": 1607580114.0
    },
    {
        "author": "slamin-n-jammin",
        "created_utc": 1607630337,
        "id": "kamsk1",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "I want to trade pink sheets on Fidelity, but whenever I go to trade them, I get a message saying \"(TC9052) Opening transactions for Pink Sheets (without information) are not permitted because of the risks associated with these securities and all Microcap securities.\"  Is there a way around this or a way to get approved for trading pink sheets?",
        "subreddit": "pennystocks",
        "title": "Fidelity OTC Pink Sheets",
        "url": "https://www.reddit.com/r/pennystocks/comments/kamsk1/fidelity_otc_pink_sheets/",
        "created": 1607659137.0
    },
    {
        "author": "Representative-Map90",
        "created_utc": 1608059610,
        "id": "kds7yv",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "This seems like a great program that gives you the opportunity for passive income on your stocks.  The rate of return varies from low single digit to 90-100%.  I have a couple of stocks and GBTC is only returning 2.65% while ETHE is currently returning 35% in the program.  That is on top of market gain or loss.  Fidelity can't share the list of stocks available in the program.  Is anyone participating in the program and know of stocks that are returning 20%+?",
        "subreddit": "stocks",
        "title": "Fidelity Fully Paid Lending Program",
        "url": "https://www.reddit.com/r/stocks/comments/kds7yv/fidelity_fully_paid_lending_program/",
        "created": 1608088410.0
    },
    {
        "author": "FUPeiMe",
        "created_utc": 1608844629,
        "id": "kjn0q1",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "I’ve seen some discussion over how different brokerages handle splitting units (combo of commons and warrants) so I figured I’d post this here. I confirmed this on two different calls this week to the trading line. \n\nI don’t know about other brokerages I’m afraid. Happy investing and merry merry merry to you and your families!",
        "subreddit": "SPACs",
        "title": "PSA: Fidelity Splits Units (Commons and Warrants) For Free",
        "url": "https://www.reddit.com/r/SPACs/comments/kjn0q1/psa_fidelity_splits_units_commons_and_warrants/",
        "created": 1608873429.0
    },
    {
        "author": "zahaha",
        "created_utc": 1608700281,
        "id": "kimrlh",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "Got $5,000 as an early Christmas Present from my Grandpa. Planning to invest it in a basket of Shroom Stocks. Let me know your thoughts:\n\n|MMED|$1,000|\n|:-|:-|\n|CTBN|$1,000|\n|CMPS|$1,000|\n|NUMI|$1,000|\n|RVVT|$400|\n|SHRMF|$200|\n|TRUFF|$200|\n|MYCO|$200|\n\n**Notes:** I have a larger portfolio with much safer investments. Not looking for \"You are better off taking the $5k to the roulette wheel\" comments. While $5k is definitely not an insignificant amount of money to me, I am willing to take the risk on this market. I plan to actively monitor and manage this \"Fund\". I know that people will say I should just put it all in MindMed and/or NUMI, but I am pretty set on spreading the investment over a basket of 5-10 stocks. At best, I am hoping this is the next big thing and one of these companies emerges as a leader in the space. More likely is that I think it could just be a good trading opportunity. At worst, I lose my $5k. FTRP was initially on this list but due to foreign investing fees I took it off.\n\n**Questions:** Thoughts on this list and the allocation? I use fidelity which has 0 trading fees and was planning to dollar cost average in. Over what time period do you think I should average in? Should I try to play the dips or determine a set amount to put in each day/week/etc (I know you can't time the market but should I try to time the market lol).  All of these stocks tanked today, should I throw in a significant amount tomorrow? \n\nNot new to investing but new to investing in small/micro caps and OTC's. The discussions on this subreddit have been super helpful. Any and all thoughts are appreciated!\n\n**LT;DR** Just tear apart this portfolio",
        "subreddit": "shroomstocks",
        "title": "Thoughts on this Shroom Stock Portfolio",
        "url": "https://www.reddit.com/r/shroomstocks/comments/kimrlh/thoughts_on_this_shroom_stock_portfolio/",
        "created": 1608729081.0
    },
    {
        "author": "ninijacob",
        "created_utc": 1607631661,
        "id": "kan9hc",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "Had a not-great experience with Fidelity's IPO experience.\n\nI tried to get into the Airbnb IPO, and had marked my interest on the fidelity website. This means that when the price is \"finalized\" they will send a confirmation email to you where you have a relatively short time to approve it. The confirmation email was supposed to come last night and instead came at &lt; 5 AM.\n\nOf course by the time I woke up the confirmation window had closed. If this is an requirement, I would like the ability to at least be called for the confirmation. Now Airbnb is up 100+%, and I missed out on a lucrative price.\n\nAre there other brokers who handle this better?",
        "subreddit": "investing",
        "title": "Better IPO Experience Than Fidelity?",
        "url": "https://www.reddit.com/r/investing/comments/kan9hc/better_ipo_experience_than_fidelity/",
        "created": 1607660461.0
    },
    {
        "author": "cincyrepwatch",
        "created_utc": 1608932770,
        "id": "kk6m4e",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "I am setting up a fidelity account next week, I've been on a simulator and followed this sub learning what I can, researching and I am ready to put my own money into the market. How much did you start with? I am going to start with &lt;1000 that's my plan at least.",
        "subreddit": "stocks",
        "title": "How much did you start with? I'm getting ready to start.",
        "url": "https://www.reddit.com/r/stocks/comments/kk6m4e/how_much_did_you_start_with_im_getting_ready_to/",
        "created": 1608961570.0
    },
    {
        "author": "t_treesap",
        "created_utc": 1607710444,
        "id": "kb802a",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "Title sums it up. So far, none of the exchanges I've checked trade this penny stock! Does anybody know where I can trade this? (Preferably for free.) My Robinhood &amp; WeBull apps don't have it, and when I called Fidelity, he said it didn't come up when it typed it in.\n\nAny advice?\n\nThanks in advance!",
        "subreddit": "investing",
        "title": "Help me find an exchange that trades MMED.NE (OTCQB market)! (Not on Fidelity, RH, WeBull)",
        "url": "https://www.reddit.com/r/investing/comments/kb802a/help_me_find_an_exchange_that_trades_mmedne_otcqb/",
        "created": 1607739244.0
    },
    {
        "author": "yakkamah",
        "created_utc": 1608744666,
        "id": "kixaxl",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "Courtesy of The Great Correction from Yahoo.\n\nSKLZ family and future family...\n\nI took some time and created an accurate DD resource for anyone new and curious about SKLZ and its prospects as an investment going forward. This should serve as a good jumping off point for anyone who wants to research further.\n\nTo the best of my knowledge, everything here is FACT and easily verifiable with a google search and/or listening to some of the recent interviews with the CEO, who by the way, is borderline giddy in some of them at the prospect of finally going public.\n\nSo without further ado... This is why I sincerely believe that being able to buy into this company at the current valuation is a VERY rare opportunity with huge long-term upside potential.\n\nMARKET GROWTH&gt;&gt;&gt;\n\n\\-The mobile game market is currently experiencing explosive growth.\n\n10 years ago it was an 8B market. Today it is 68B. In 2025 it is projected to be a 150B market.\n\n\\-Video games are rapidly becoming the leading form of entertainment.\n\n\\-Already more popular than books, movies and music, video games are on a path to even eclipse TV.\n\n\\-SKLZ DOES NOT CREATE GAMES. SKLZ provides a PLATFORM for game developers to monetize their creations through competition.\n\n\\-There are currently 10M game developers world-wide that are are looking for the best way to monetize.\n\n\\-Before SKLZ, game developers relied on advertising and in-app purchases to monetize their creations.\n\n\\-SKLZ has found that developers who monetize their games through competition (game-centric) instead of advertising are up to 5X More profitable.\n\n\\-SKLZ will run 2B (yes BILLION) tournaments in 2022.To put that in perspective, that's 1700 tournaments EVERY SECOND.\n\n\\-SKLZ user engagement (minutes a day spent gaming) trumps many other popular platforms.\n\nSKLZ 62 minutesTikTok 52Facebook 41YouTube 40Snap 28Mobile Gaming Average 17\n\nMARKET OPPORTUNITY&gt;&gt;&gt;\n\n\\-90% of SKLZ revenue comes from North America\n\n\\-TAM outside of North America is roughly 4X as large.\n\n\\-SKLZ currently has 2.7M monthly active users.\n\n\\-Total MAU world-wide is 2.7 Billion.\n\nThat mean currently SKLZ has only penetrated .1% (that's 1/10th of one percent) of the potential market. It's almost impossible to imagine a longer runway for potential growth.\n\nMOAT&gt;&gt;&gt;\n\n\\-SKLZ Competitive moat is its Anti-cheat tech which involved years of data science development.\n\n\\-SKLZ measures 300 individual data points a minute during gameplay.\n\nThink McAfee Anti-virus but specifically designed for competition-based games.\n\n\\-58 issued or pending PATENTS for this Anti-cheat technology.\n\nINVESTORS&gt;&gt;&gt;\n\nThe people behind Flying Eagle Acquisition Corporation, the company that merged with SKLZ to take them public are the same people that took DKNG public through Diamond Eagle. Yes... These are the Exact Same Guys.\n\n\\-PIPE investors are of the highest quality.\n\n\\-Wellington, Fidelity, Franklin Templeton, Nueberger Berman.\n\n\\-Existing SKLZ stockholders and PIPE investors have agreed to a 24-month lock up period, a testament to all involved party's faith in the business.\n\n\\-SKLZ has been able to deliver incredibly consistant, predictable growth since 2017.\n\n\\-In 2017, SKLZ met with Flying Eagle (DKNG guys) and provided them with growth projections for 3 years out.\n\n\\-SKLZ has met its growth projections every quarter within 1%-5% since 2017.\n\n\\-SKLZ is expected to grow at 57% CAGR through 2022.\n\nFINANCIALS 2020 Q#/YTD&gt;&gt;&gt;\n\n\\-Third Quarter Revenue of 60M, Up 92% YoY-Revenue YTD of 162M, up 91% Over Prior Year-Affirming Full Year Guidance of 255M\n\n\\-Gross Margins of 90%+-Long-term projected EBITDA of over 30%.\n\nVALUATION DISPARITY&gt;&gt;&gt;\n\n\\-At $20, SKLZ is valued at Approximately 12X 2022 Revenue (P/S 12)\n\n\\-Currently SKLZ is valued at Roughly 24X 2020 Revenue (P/S of 24)\n\n\\-Unity Software, a company in a very similar space, is currently valued at 60X Revenue (P/S of 60)\n\nCEO&gt;&gt;&gt;\n\n\\-SKLZ CEO Andrew Paradise is a Big-Idea kind of a guy.\n\n\\-He previously founded and sold his startup AisleBuyer, a company that let consumers check out in stores via their mobile phones, to intuit in 2012.\n\n\\-He is always talking about his company's \"100-year vision\". That vision- Creating the \"competition layer\" of the internet.\n\n\\-My favorite quote from him from a recent interview....\n\n\"What a lot of people don't understand about our business is that SKLZ is not so much a video game system as much as it is.... (wait for it...... ;) a DATA AND FINANCIAL PAYMENTS SYSTEM.\n\nAka... FINTECH.\n\nBig things in the future here folks, short AND long-term.\n\nAs always... Good Luck!!!!",
        "subreddit": "wallstreetbets",
        "title": "$SKLZ DD LETS GO BULL GANG",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kixaxl/sklz_dd_lets_go_bull_gang/",
        "created": 1608773466.0
    },
    {
        "author": "greyflamingbro",
        "created_utc": 1609001588,
        "id": "kkllr4",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "So I have a long time horizon and want to add some more risk and aggressive growth by picking a few winner stocks and ETFs.\n\nHowever, I found myself liking FTEC for my tech ETF but still wanted to pick a few diverse winners. Does this make sense?\n\nThis is what I’ve planned my portfolio out to currently:\n\nMutual Funds:\nFidelity Zero Total Market (FZROX)\nFidelity Zero Total International (FZILX)\n\nBullish Sectors:\nVWO (Emerging Markets)\nFTEC (Technology)\n\nFlee to Safety:\nFUTY (Utilities)\n\nStocks:\nBerkshire Hathaway (BRK.B)\nDisney (DIS)\nJP Morgan Chase (JPM)\nMcDonald’s (MCD)\nWaste Management (WM)\n\nReduce Risk Over Time (At Age 40):\nUS Bond Index Fund (FXNAX) [At age 40]\nInternational Bond Fund (FBIIX) [At age 40]\n\nPrior to holding FTEC, I choose Apple (AAPL), Google (GOOG), Amazon (AMNZ), Facebook (FB), and Walmart (WMT) but I felt way too overweighted in tech.  If I’m bullish on tech should I stay overweight in it?  Or should keeping a high percentage in FTEC help me out more?",
        "subreddit": "stocks",
        "title": "Trying to not be overweight in Tech. Help?",
        "url": "https://www.reddit.com/r/stocks/comments/kkllr4/trying_to_not_be_overweight_in_tech_help/",
        "created": 1609030388.0
    },
    {
        "author": "Bilbostockbaggins",
        "created_utc": 1609350966,
        "id": "kn722i",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "Huya is one of the largest Chinese streaming service that focuses on both live gaming and video streaming.\n\nWhy am I bullish? FINANCIALS \nRevenue last 4qrts: $1.6bn\nNet income: $789 million.\nCurrent market cap: $4.5bn\n\nLet’s compare this to the bae that is PLTR\nRevenue last 4qrts: $1bn\nNet Income: -$1bn\nCurrent market cap: $43bn\n\nLet’s recap, Huya is worth 1/10 of PLTR but has 50% more revenue and is a fully profitable operation. In the last few months funds like Morgan Stanley, Ark, Fidelity have been scooping up shares like a mofo.\n\nZipCharlie on Youtube does an excellent video discussing the recent downtrend and the factors around it. This won’t stay this cheap for long 🚀🚀",
        "subreddit": "wallstreetbets",
        "title": "HUYA is ridiculously undervalued",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kn722i/huya_is_ridiculously_undervalued/",
        "created": 1609379766.0
    },
    {
        "author": "thabiiighomie",
        "created_utc": 1608653650,
        "id": "ki8an1",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "I understand the concept, but I literally cannot figure out how to perform this task on Fidelity. \n\nI have level 1 options. \n\nSince I own the shares already, do I wish to “sell to close”?\n\n14 days out appropriate?\n\nMaybe $3.5 over my purchase price?\n\n\nThank you in advance.",
        "subreddit": "options",
        "title": "I have 400 shares of a company that are down 20%. I want to sell covered calls to help with my average. Any help?",
        "url": "https://www.reddit.com/r/options/comments/ki8an1/i_have_400_shares_of_a_company_that_are_down_20_i/",
        "created": 1608682450.0
    },
    {
        "author": "ThePastyWhite",
        "created_utc": 1609388133,
        "id": "knin49",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "How do I YOLO on the Korean market? Don't think I can with Robinhood or Fidelity 🤔🤔",
        "url": "https://i.redd.it/xnd5zuro7g861.jpg",
        "created": 1609416933.0
    },
    {
        "author": "mnor66",
        "created_utc": 1609135542,
        "id": "klkoaj",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "I am 14 years old, fairly new to trading, and I am just looking for reassurance that my portfolio is pretty well-balanced and geared for long-term success. I've already invested the money and plan on leaving it in for the long-term. I'm hoping that it is not filled with too much risk. I am definitely what would be considered a beginner. Any input would be appreciated. Thanks in advance. My portfolio is below:\n\nTotal - $950\n\n* Fidelity® 500 - 24% - $228\n* Fidelity ZERO Total Market - 20% - $190\n* Fidelity® Large Cap Growth - 16% - $152\n* Fidelity® Mid Cap Growth - 5% - $47.50\n* Fidelity® Mid Cap - 5% - $47.50\n* Fidelity® Small Cap Growth - 5% - $47.50\n* Fidelity® Small Cap - 5% - $47.50\n* PLTR - ≈6.63% - $63\n* BEP - ≈6.63% - $63\n* AMZN - ≈6.63% - $64",
        "subreddit": "StockMarket",
        "title": "Trading Portfolio",
        "url": "https://www.reddit.com/r/StockMarket/comments/klkoaj/trading_portfolio/",
        "created": 1609164342.0
    },
    {
        "author": "X-x-Giger",
        "created_utc": 1608221670,
        "id": "kf0btl",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "[Skillz](https://variety.com/t/skillz/) Inc. has become the first publicly traded mobile esports platform following completion of its merger with Flying Eagle Acquisition Corp., the public acquisition vehicle headed by Hollywood industry veterans [Harry Sloan](https://variety.com/t/harry-sloan/) and [Jeff Sagansky](https://variety.com/t/jeff-sagansky/).\n\nSkillz Inc. and its common stock will begin trading Thursday on the New York Stock Exchange under the ticker symbol “SKLZ.”.\n\nThe company announced Wednesday it has $250 million in cash and no debt on the balance sheet at a time when the mobile gaming market is expected to more than double by 2025 to $150 billion.\n\n“We built Skillz on the founding belief that esports are for everyone, and have made significant progress toward our vision of enabling everyone to share in the future of competition,” said Andrew Paradise, CEO and founder of Skillz. “We stand at the intersection of mobile gaming and esports, perhaps the two most exciting growth opportunities of the next decade. I thank the entire Skillz team for their dedication, passion, and creativity, which have led us to this incredible moment on our journey to build the competition layer of the internet.”\n\nSkillz asserted that it has pioneered the future of the gaming industry, enabling developers to monetize their content five times better than ads or in-app purchases by enabling developers to expand the reach of their games and scale their businesses.\n\n“I’ve had a front row seat to the video game and entertainment industry’s evolution over the past two decades, from my role as founding investor and board member of Bethesda Games to recently taking [DraftKings](https://variety.com/t/draftkings/) public,” said Sloan, chairman of Flying Eagle. “We believe that Andrew has positioned Skillz to lead the convergence of mobile, gaming, and player enablement into the future of entertainment itself.”\n\nThe transaction includes the $158.5 million investment led by Wellington Management Company, Fidelity Management &amp; Research Company, LLC, Franklin Templeton, and Neuberger Berman. Paradise and Chief Research Officer Casey Chafkin will continue to lead the company.\n\n[https://www.businesswire.com/news/home/20201216006031/en/Skillz-Becomes-First-Publicly-Traded-Mobile-Esports-Platform](https://www.businesswire.com/news/home/20201216006031/en/Skillz-Becomes-First-Publicly-Traded-Mobile-Esports-Platform)",
        "subreddit": "wallstreetbets",
        "title": "Skillz (SKLZ) Becomes First Publicly-Traded Mobile Esports Platform Following Merger 12/17",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kf0btl/skillz_sklz_becomes_first_publiclytraded_mobile/",
        "created": 1608250470.0
    },
    {
        "author": "TheGoodAggie",
        "created_utc": 1607888267,
        "id": "kch2my",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "I am wanting to buy some Leaps in my IRA with Fidelity. Since I'm in my 20s, I don't have the cash to actually buy the 100 underlying shares if the contract is Itm. What happens if I buy this call and can't buy the shares? I've been buying and selling options with Robinhood and I was able to sell the contract without having to buy the shares. Trying to do the same thing over at Fidelity.",
        "subreddit": "options",
        "title": "Buying leaps with Fidelity",
        "url": "https://www.reddit.com/r/options/comments/kch2my/buying_leaps_with_fidelity/",
        "created": 1607917067.0
    },
    {
        "author": "SolarPanelDude",
        "created_utc": 1608220540,
        "id": "kezyo4",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "I am using Fidelity.  It wont let me place a stop loss order for penny stocks.  I am up on ABML.  I dont have time to keep checking it hourly.\n\n&amp;#x200B;\n\nIs this across the board for most penny stocks?  Or will a different platform allow me to do it?",
        "subreddit": "pennystocks",
        "title": "How do you protect your gains with penny stocks?",
        "url": "https://www.reddit.com/r/pennystocks/comments/kezyo4/how_do_you_protect_your_gains_with_penny_stocks/",
        "created": 1608249340.0
    },
    {
        "author": "anotherkadashian",
        "created_utc": 1608848914,
        "id": "kjo4wj",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Hi Spacs thread, \n\nI am new to SPACs trading, and don't know how to buy warrants on Fidelity. I am thinking the process is same as buying stock: input the warrant ticket and place the order. I am also thinking it follows the Options trading process where Strike price is needed, etc. Not so sure of what other info I need to put in.\n\nWould you be able to explain how you buy warrants on Fidelity? Many thanks!!",
        "subreddit": "SPACs",
        "title": "How do I purchase warrants on Fidelity?",
        "url": "https://www.reddit.com/r/SPACs/comments/kjo4wj/how_do_i_purchase_warrants_on_fidelity/",
        "created": 1608877714.0
    },
    {
        "author": "msiekkinen",
        "created_utc": 1607091320,
        "id": "k6lnbe",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "I noticed in my Fidelity trading account it lists different traunches of buying power with government bonds being about 10x as much as general for regular securities.\n\nWhy would someone do this?  Even when interest rates weren't zero their return in no way would touch the margin costs?\n\nI'm not actually interested in doing this, just trying to understand the economic sense on why anyone would.  Is that part of some kind of complex trading scheme I'm just completely oblivious to?",
        "subreddit": "investing",
        "title": "Why would someone buy government bonds on margin?",
        "url": "https://www.reddit.com/r/investing/comments/k6lnbe/why_would_someone_buy_government_bonds_on_margin/",
        "created": 1607120120.0
    },
    {
        "author": "Philly139",
        "created_utc": 1609339958,
        "id": "kn3kro",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "Does this look like a reasonable 401k allocation for someone who is 60 and will be retiring in 5 years? \n\nFSKAX (Fidelity total market): 40% \nFTIHX (Fidelity total international): 10% \nFXNAX (Fidelity US bond index): 50% \n\nAny advice is appreciated.  Thanks!",
        "subreddit": "investing",
        "title": "401k allocation with 5 year retirement timeline",
        "url": "https://www.reddit.com/r/investing/comments/kn3kro/401k_allocation_with_5_year_retirement_timeline/",
        "created": 1609368758.0
    },
    {
        "author": "r2002",
        "created_utc": 1606952915,
        "id": "k5lkn3",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "While people are panicking on Reddit and Stocktwits...\n\n&gt;The bill won’t come as a surprise to investors. Emerging markets fund managers have been swapping U.S. listings of widely held stocks like Alibaba Group Holding (BABA), JD.com (JD), NetEase (NTES) for their secondary listings in Hong Kong listings for months, in anticipation of the measure. \n\nThat's right. The absolute *worst* thing that can happen is that your shares get swapped to Hong Kong's stock exchange. The article explained that Interactive Brokers, Fidelity, and Schwab, for example, already offer retail traders like us access to HK's exchange.\n\nGranted that NIO and XPEV are not on the Hong Kong exchange yet. But they have three years to comply with the US rule. That's plenty of time to secure a spot on the Hong Kong exchange. And Hong Kong would *love* to have them. This move could also benefit the companies themselves, as it makes them available to both American *and* Chinese investors:\n\n&gt;A Hong Kong listing means a company’s stock can be traded during the Asian day and is likely to broaden its investor base. If shares are later added to Hong Kong’s so-called stock connect program, they could also become accessible to investors in mainland China. [WSJ](https://archive.fo/XRXPe#selection-2677.0-2677.262)\n\n**tl;dr** Worst thing that happens is you have to open another account to give you access to HKEX. That's assuming a compromise doesn't get reached. And that's assuming Biden even signs this bill.",
        "subreddit": "stocks",
        "title": "Why professional traders are not worried about the Delisting Bill that passed today -- Barons",
        "url": "https://www.reddit.com/r/stocks/comments/k5lkn3/why_professional_traders_are_not_worried_about/",
        "created": 1606981715.0
    },
    {
        "author": "KRAndrews",
        "created_utc": 1608321358,
        "id": "kfscx1",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Why do trades on Fidelity take a million years to go through? Am I doing something wrong?",
        "url": "https://www.reddit.com/r/stocks/comments/kfscx1/why_do_trades_on_fidelity_take_a_million_years_to/",
        "created": 1608350158.0
    },
    {
        "author": "apballer4",
        "created_utc": 1609181843,
        "id": "klwi6x",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "Don't really know exactly the point of this post. I do both since online gambling legalized in my state and am just consistently amazed by this. Hope everyone finds it insightful. Feel free to ask me any questions / make other points.\n\nOnline sports betting is now legal in a variety of states (most legalized this year) &amp; is rapidly expanding to others. Sports betting is very, very similar to derivatives trading. \n\n**Similarities:**\n\n\\- It's a f'ing thrill.\n\n\\- The markets move, *quickly*. We see this in derivatives trading with earnings, regulation changes, central bank policy, etc. Volatility can shoot up or crash down, the underlying price moves as people trade, expressing their opinions in the market. Similarly, the Ravens may be -400 before the game, but Lamar gets COVID and they're quickly -200. Or sharp bettors come in and massively move a line. In trading &amp; sports betting, you are using mathematics, statistics and all of the information you have at the time to make informed \"trades\" (e.g. bets).\n\n\\- This isn't investing where you're holding for years and hoping to realize some expected return. Especially for weekly/daily expirations, it's super similar to sports betting in that usually you know whether you were right or wrong fairly quickly. If you're buying a call option on AAPL for earnings, you'll know shortly after that earnings call if you're winning or losing. Just like buying an NBA team in a game and checking the score in the 1Q.\n\n\\-You're trading/betting against algorithms.\n\n\\- You can win. We see all the time here people consistently making money trading derivatives. It's the same in sports. This isn't slots or roulette; you can beat the house.\n\n**Differences:**\n\n\\- US sportsbooks are inefficient markets. Arbitrage exists. You can't go onto Fidelity and buy an option for $1 while simultaneously selling it for $1.10 on Robinhood. You can in sports betting; the books all have different, independent lines. \n\n \\- Promotions exist; a lot of these sportsbooks (such as DraftKings, a $20 billion company) offer hundreds of dollars in site credit to new users when they join.",
        "subreddit": "wallstreetbets",
        "title": "Options Trading vs. Sports Betting - Pretty Darn Similar?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/klwi6x/options_trading_vs_sports_betting_pretty_darn/",
        "created": 1609210643.0
    },
    {
        "author": "iamnotjedi",
        "created_utc": 1607294488,
        "id": "k83tm6",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Hello, \n\n[https://www.municipalbonds.com/bonds/issue/108472AA9/](https://www.municipalbonds.com/bonds/issue/108472AA9/)\n\nYIELD        : 22.964%   \nMATURITY: 2029 May  \nInvestment: $15,000\n\nI have been researching on MUNI bonds and came across this attractive bond, which is far more difficult to believe. \n\nMy requirements are: \n\n\\&gt; Tax free gains (I'm aware of Roth, Megaback door Roth,..etc). I live in a State tax free state, so my only concern is on Federal taxes \n\n\\&gt; Though, I love researching different stocks and index funds, if there is a 20% ROI on an index fund, I would love to go with that option. \n\n\\&gt; I'm 31 and I've emergency savings for 5 months and I've $20,000 extra cash which I would like to invest. Municipal bonds seems like a good option as it provides tax-free gains. \n\n&amp;#x200B;\n\nWhat are the issues that I need to be aware about while buying these type of bonds? \n\nI use Fidelity for my investments, but I'm not able to find these type of MUNI bonds, is there any other recommended brokers where I can buy these? \n\nIf MUNI bonds is not an option, what are the other options to invest the $20K? Stocks and ETFs are the ones I have in mind. Any help is greatly appreciated.\n\nThanks in advance :)",
        "subreddit": "investing",
        "title": "MUNI Bonds with 20+% yield?",
        "url": "https://www.reddit.com/r/investing/comments/k83tm6/muni_bonds_with_20_yield/",
        "created": 1607323288.0
    },
    {
        "author": "RoughyToughy",
        "created_utc": 1608314237,
        "id": "kfq1vd",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "At the height of the US oil fiasco when everyone was buying oil tankers to store their unexpected oil purchases... I figured oil was still gonna be useful in the post-apocalypse and bought some USO fund calls. My thinking was that this couldn't go tits up.\n\nI own these contracts:  \nExp 12/16/22 10x5c 10x7.5c 10x10c\n\nThe fund then reverse split so each of these contracts is apparently worth 12 shares of USO + $8.18.\n\nSince the volume is so low on these adjusted options, I'm trying to figure out what the value of them is.\n\nToday's price of USO is \\~33.5\n\nThe question: Are these things worth\n\n\\# contracts \\* 12 \\* (USO price - strike) + # contracts \\* $8.18 \n\n10 \\* 12 \\* (33.5 - 5) + 10 \\* 8.18 = 3501.8\n\n10 \\* 12 \\* (33.5 - 7.5) + 10 \\* 8.18 = 3201.8\n\n10 \\* 12 \\* (33.5 - 10) + 10 \\* 8.18 = 2901.8\n\n?\n\nIf so, why does fidelity say they're basically worthless (lack of volume?)?",
        "subreddit": "wallstreetbets",
        "title": "Question on pre-split USO options",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kfq1vd/question_on_presplit_uso_options/",
        "created": 1608343037.0
    },
    {
        "author": "erlachglenn",
        "created_utc": 1608324365,
        "id": "kftaks",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Everything I read is clear that the \"backdoor roth\" is a conversion, and accordingly, not subject to the same limits as a contribution would be.  Theoretically, through the backdoor it is possible that you could deposit &gt;$6,000 into a Roth by both converting and contributing.\n\nI backdoored $6k into my roth already this year. Now that I know I will be just under the income limit for 2020, I tried to contribute directly but Vanguard will not allow this and says I've reached my contribution max? Anyone know a way around this?? Should I just open a different roth with fidelity and use that?",
        "subreddit": "investing",
        "title": "Vanguard Roth Contribution+conversion",
        "url": "https://www.reddit.com/r/investing/comments/kftaks/vanguard_roth_contributionconversion/",
        "created": 1608353165.0
    },
    {
        "author": "sailmak",
        "created_utc": 1608649234,
        "id": "ki6x3q",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "I have a few HCAC warrants and with the ticker change today, fidelity shows ( 42589C112 -  HENNESSY CAP ACQUSTION CORP IV WTS EXP 09/05/2025) which doesn't seem to be tradeable?  \nAny idea how long before I can sell the warrants or there is something else I am not aware of that they cant be traded or as such?  \n\n\nThanks!",
        "subreddit": "SPACs",
        "title": "GOEV (HCAC) warrants not tradeable/visible on Fidelity",
        "url": "https://www.reddit.com/r/SPACs/comments/ki6x3q/goev_hcac_warrants_not_tradeablevisible_on/",
        "created": 1608678034.0
    },
    {
        "author": "ninetyninetoesjoe",
        "created_utc": 1608228638,
        "id": "kf2pe2",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "What more DD do you autists need, Look at this ticker. SKLZ. Get your shit together, your wife’s boyfriend will be jealous when your bringing in all the tendies. Internet stonks only go up.\n\nSome bullet points I found on the internets:\n\nSkillz began trading on the NYSE today under the ticker SKLZ.\n\nThe SPAC transaction included $849 million in funding from investors like Wellington and Fidelity.\n\nNow that it is trading, Skillz has $250 million in cash.\n\nAdditionally, investors will appreciate that it has no debt on its balance sheet.\n\nImportantly, Skillz is now the first publicly traded mobile esports platform.\n\nThis public debut sets a record and also comes at a time when esports are increasingly popular.\n\nCompany executives think the Skillz SPAC merger is the perfect way to leverage the growth runway in the industry and to expand internationally.\n\nWith this in mind, Skillz estimates that there are 2.7 billion gamers in the entire world.\n\nThose 2.7 billion gamers are in a market that will be worth $150 billion by 2025.\n\nRight now, the international market makes up less than 10% of company revenue.\n\nHowever, Skillz said it has plans to really lean into international expansion.\n\nIt believes its own revenue will grow from $225 million in 2020 to $555 million in 2022.",
        "subreddit": "wallstreetbets",
        "title": "SKLZ to the moon",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kf2pe2/sklz_to_the_moon/",
        "created": 1608257438.0
    },
    {
        "author": "RoutineReaction",
        "created_utc": 1608307511,
        "id": "kfnvcw",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "I received a good faith violation on my Fidelity account recently. A restriction was put on my account. This means I can only trade using settled cash. Since then, I have accidentally also incurred what should be a Pattern Day Trading violation, seeing as I have bought and sold 3+ stocks within a single say, and have less than $25,000 in my account. According to fidelity, this should also result in a restriction, but seeing as I am already restricted, nothing has happened. I can now act as a PDT, without penalty, as long as settled cash is being used. Does anyone have experience being in this situation with Fidelity? Is there a chance I will have to answer for this? Will my account will be suspended? Will I immediately receive another automated restriction once my current restriction ends? Perhaps I am confused and the PDT only applies to margin accounts. My account is strictly a cash account.",
        "subreddit": "stocks",
        "title": "Unlimited Day Trading with less than $25,000?",
        "url": "https://www.reddit.com/r/stocks/comments/kfnvcw/unlimited_day_trading_with_less_than_25000/",
        "created": 1608336311.0
    },
    {
        "author": "Nintendie69",
        "created_utc": 1609278776,
        "id": "kmnvv6",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "Every one I've looked up (TDA, Fidelity, Etrade) has customers saying they're waiting on the phone for an hour+ to get to a representative. Is it just really bad this time of year or because so many more people are trading this year?",
        "subreddit": "options",
        "title": "Are there any brokers that don't have long wait times on the phone?",
        "url": "https://www.reddit.com/r/options/comments/kmnvv6/are_there_any_brokers_that_dont_have_long_wait/",
        "created": 1609307576.0
    },
    {
        "author": "CorrectWinter",
        "created_utc": 1608779253,
        "id": "kj7gz9",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "Thanks in advance.",
        "subreddit": "smallstreetbets",
        "title": "I've been marked as a PDT on RH and can't make any trades. Can I transfer my assets to another brokerage like Fidelity to avoid the restriction?",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/kj7gz9/ive_been_marked_as_a_pdt_on_rh_and_cant_make_any/",
        "created": 1608808053.0
    },
    {
        "author": "momodoctor",
        "created_utc": 1608576793,
        "id": "khnj2q",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "I have a margin account with Fidelity since July 2020, but have never borrowed margin for any of my tradings. However, it keeps putting my orders as margin something that I noticed recently as result of constantly losing money when averaging down my position during the day. The issue has been when I open a position (always and always a limit order) with my cash money, and I want to average it down during the day, it keeps buying as WASH SALE ADJUSTMENT at a price waaaay above my LIMIT order!!! for example, first I put order or 100 limit but @ 2$, 2 minutes later want to average it down and buy 200 @ 1.80 and after half an hour  I put another limit order of 3000 @ 1.50. Strangely it buys my last limit order  @ 5$!!!!!!! a price that is not even within the 6 month range of that stock!! and they add a W, standing for WASH SALE adjustment to that order. This is an order that I didn't put and on open position of a stock I am buying for the first time in my portfolio (so no wash sale adjustment rule applies to it) ..... So at my shock my green position suddenly becomes red with a huge LOSS with half an hour of opening that position. a price that I can an no time in my life cover it or average it down!!! I can see that my unadjusted G/L is green but adujsted G/L is very red with big big loss, and if I sell it  I will lose and not gain.\n\nThis has happened to me each time I have been trying to average down my open CASH position! and Each time I called Fidelity, support team kept telling me what's the rule for WASH SALE ADJUSTMENT RULE is! and they told me you sold it before with Loss that's why your new purchase is adjusted for TAX purposes, and I keep explaining them and I have not sold my position yet... \n\nAfter six months one of the reps told me, NO you didn't sell it, WE  SOLD IT BECAUSE IT WAS ON MARGIN AND AT RISK AND WE SEND YOU EMAIL!!! and you cannot see that FIDELITY-MADE sell in your History or closed positions!!!!!!!!!!!!!!!!!!!!!!\n\nso when I was working on my open position, buying and averaging it down, FIDELITY was selling them and creating WASH SALE purchase!!! I am using my own CASH money, and still see cash in my non-marging Buying Power and in my Cash(Core), but they without calling me keep selling my shares, because AUTOMATICALLY, al my orders regardless I buying them with my CASH will get purchased with MARGIN... so they can easily manipulate my portfolio and make money.... Now after six months realizing this, I removed margin from my account and also I need to move to Ameritrade or WeBull. \n\n&amp;#x200B;\n\nPlease be extremely careful if you have a margin account, even if you don't trade on margin.",
        "subreddit": "investing",
        "title": "Be VERY careful with Fidelity! MARGIN/CASH",
        "url": "https://www.reddit.com/r/investing/comments/khnj2q/be_very_careful_with_fidelity_margincash/",
        "created": 1608605593.0
    },
    {
        "author": "HoffYou",
        "created_utc": 1608594551,
        "id": "khtd3w",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "I'm bullish long-term on QuantumScape but it's a $40bn company with no product for 3-4 years. Fidelity is paying me 153% to lend my shares, I suspect it'll be more tomorrow. This has to be a short squeeze, right? Liquidity probably going up 2-3x the second half of January. Protective puts are expensive AF.",
        "subreddit": "wallstreetbets",
        "title": "What to do with $QS?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/khtd3w/what_to_do_with_qs/",
        "created": 1608623351.0
    },
    {
        "author": "catwent",
        "created_utc": 1609299321,
        "id": "kmu37s",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "Planning on investing a little bit into each of MMED, NUMI, and CMPS, at least for now. Planning on holding long term.\n\nFor those in the US - TD Ameritrade, or Fidelity and why? Open to other suggestions as well.\n\nI’d prefer to use Robinhood for reasons, but I’m not sure it’s worth it to wait until all these companies list on the NASDAQ. I don’t want to miss out on another month of this. I know I could buy CMPS through RH, but for simplicity’s sake I’d like to have all my shroom stocks in one place.\n\nThanks for any input!",
        "subreddit": "shroomstocks",
        "title": "TD Ameritrade or Fidelity?",
        "url": "https://www.reddit.com/r/shroomstocks/comments/kmu37s/td_ameritrade_or_fidelity/",
        "created": 1609328121.0
    },
    {
        "author": "nidomight",
        "created_utc": 1608281479,
        "id": "kfhkng",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "I have a family member (older than 18) who is wanting to put some money in an investing account and start investing. They also want to grant me access to the account so that I can help them and potentially make a few trades, based off of what I am currently investing in. I was wondering if there was any broker out there that allows you to not only see your account but another person's account, if given access, without having to keep signing in and out between the two accounts.\n\nThe reason I want to do this is because I'd like to be able to monitor everything easily using a broker that I also use. Currently I use fidelity for my roth IRA, but was not able to find any information rather than being granted different types of authority on another persons account. I also tried to look this up and couldn't find anything useful.",
        "subreddit": "investing",
        "title": "Having easy access to a family members investing account",
        "url": "https://www.reddit.com/r/investing/comments/kfhkng/having_easy_access_to_a_family_members_investing/",
        "created": 1608310279.0
    },
    {
        "author": "onemananswerfactory",
        "created_utc": 1608842004,
        "id": "kjmb56",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "Title rants it all. I want to jump into a fintech or EV (maker, battery charger, or whatever) that's trading sub-$1 and is in the good ol' US of A.",
        "subreddit": "pennystocks",
        "title": "I just want a fintec or EV stock under or near $1 that isn't Canadian so I don't get suckered into paying that damn $50 fee with Fidelity. US only please.",
        "url": "https://www.reddit.com/r/pennystocks/comments/kjmb56/i_just_want_a_fintec_or_ev_stock_under_or_near_1/",
        "created": 1608870804.0
    },
    {
        "author": "BostonBrakeJob",
        "created_utc": 1608348204,
        "id": "kg084z",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "Out of curiousity I hit Google with \"Fidelity mutual fund split history\" and was kind of suprised to see that they do in fact have ETF's that have done a stock split on a handful of their mutual funds over the years.  I'm currently in their S&amp;P fund (FXAIX) and it's creeping up to the average price per \"share\" of the other funds that have split.  I don't know if SP is a good indicator for an upcoming split or not, and I guess really it doesn't matter as I'm still young and plan to keep 100% 401k invested in that fund.  But it would be nice.\n\nHave any of you had a split happen while you were holding an ETF and are there any other factors other than SP for a fund to decide to do one?",
        "subreddit": "investing",
        "title": "ETF splits, how common are they?",
        "url": "https://www.reddit.com/r/investing/comments/kg084z/etf_splits_how_common_are_they/",
        "created": 1608377004.0
    },
    {
        "author": "JustVibing5420",
        "created_utc": 1609179924,
        "id": "klvv5t",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "Hi there, I'm an 18 year old who started his first job and getting into investing immediately after his birthday in September. I love staying on top of my finances and just want to be rich as an adult. I plan on continuing on investing, opening up a Roth IRA in January, and want to get into real estate in my 20's as a side income. I opened up a student credit card with Chase (the only popular local bank in my town) and I went after 3 months of having the student card, which gives 1% back on everything to try for Chase's Freedom Flex card, which gives 5% on things, 3%, and 1% on everything else. I was advised against it because I'm new to having a credit card and my credit score is only 650 as a result of being new.\n\n I make my payments in full, but my real question is how to go about continuing my investing and opening up my Roth IRA. While at Chase, the man I talked to told me all about their app \"YouInvest\" and said that it would be great for investing. I've used Robinhood since my 18th birthday 3 months ago and have $800ish in my account split among companies and have been pretty successful. I also am trying to get into WeBull, but it's kind of confusing so I'm going slow.\n\nThe man advised me to use \"YouInvest\" for my investments since J.P. Morgan is so big and it would be much better. I knew he was basically trying to sell me the idea and he even said to open my Roth IRA with them. I planned on opening my Roth IRA with Fidelity after doing lots of research. I just want some advice on thinks like:\n\n\\- Has anyone used \"YouInvest\" through Chase? Is it superior to Robinhood or other apps in any way? Does it even make sense to stick to my bank's app or just use other apps once I've been into investing for a while like that Think or Swim one?\n\n\\- Do I open up the Roth IRA with Chase or Fidelity? And do I manage it myself and diversify with index funds or do I let them manage it?\n\nThanks for any help!",
        "subreddit": "investing",
        "title": "Chase Investing or Fidelity?",
        "url": "https://www.reddit.com/r/investing/comments/klvv5t/chase_investing_or_fidelity/",
        "created": 1609208724.0
    },
    {
        "author": "finadthrowaway",
        "created_utc": 1607398758,
        "id": "k8wmo9",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "Hello, I'm a minor and I have gotten lucky enough to earn a significant amount of money for my age. I'm interested in trading options, though I cannot do so with my current custodial account on Fidelity. I understand the risk involved with trading options, I plan to just throw play money at it for now, no serious amounts. I am not asking for advice either, I've already set aside money for taxes, maxed out my Roth IRA for this year, etc.\n\n&amp;#x200B;\n\nAre there any brokers that allow custodial accounts that are able to trade options?",
        "subreddit": "investing",
        "title": "Is there a way for a minor to (legally) trade options?",
        "url": "https://www.reddit.com/r/investing/comments/k8wmo9/is_there_a_way_for_a_minor_to_legally_trade/",
        "created": 1607427558.0
    },
    {
        "author": "greatCelery",
        "created_utc": 1609409016,
        "id": "knnfbd",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "say I have zero cash and $50k worth of stocks now in an account at fidelity/interactive broker. One day, I decide to withdraw $10k cash as my margin loan to pay my house mortgage and my margin loan balance is $10000. I just let it sit and don't pay back a penny from now on.\n\n\nLet's say my interest rate is 10.8%, so everyday it is 0.03%. Fidelity/IBKR will charge me $3 everyday. after day one, I owe them $10003; after two days, do I owe them $10006 (simple interest) or $10006.009 (compounding)? \n\n\nIs my cash balance -$11080 after a year? ($10k principal + $1080 interest, simple interest, no compounding)\n\n\nIs my cash balance -$12160 after two years? but if it's compounding yearly, it would be negative $12276.64 (==$11080*1.108).\n\n\nThank you for your help.",
        "subreddit": "investing",
        "title": "Do margin loan interests compound? daily or yearly?",
        "url": "https://www.reddit.com/r/investing/comments/knnfbd/do_margin_loan_interests_compound_daily_or_yearly/",
        "created": 1609437816.0
    },
    {
        "author": "TheFrogWife",
        "created_utc": 1608826919,
        "id": "kji2lb",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "Does anyone else use the fidelity app? There is a new blue w next to my cost basis total for a stock and there is no key to tell me what it means. It's just there mocking me, not really I'm just continuing to type so my post doesn't get autoremoved and I've already tried the fidelity website and goodlw and both haven't given me any answers.\n\nSo anyone know what it's for?",
        "subreddit": "investing",
        "title": "Anyone use the fidelity app? What's the blue w mean?",
        "url": "https://www.reddit.com/r/investing/comments/kji2lb/anyone_use_the_fidelity_app_whats_the_blue_w_mean/",
        "created": 1608855719.0
    },
    {
        "author": "scootrsmb",
        "created_utc": 1608261088,
        "id": "kfctu8",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "Alright guys I'm looking for a little help here. I just recently got into stocks so bear with me. Using fidelity's app, I attempted to sell all of my stock in the s and p 500 index fund because i'm moving it to a different broker. I attempted to sell these this morning and got a notification at the end of the day saying that the transaction was successful but it says its on margin. I previously activated margin before and thought I de-activated it as well because I know enough about it that I don't want it activated. In my account balance all under \"margin\" my money is in \"margin credit\". What do I need to do to get this money back into cash so I can withdraw it? I've been on hold with fidelity for 20 minutes and I need to head to bed with the plan to call in the morning. I'm looking for a little piece of mind, what did I do wrong? What is selling on margin? ( I only see buying on margin when I look it up). I'm not going to wake up thousands in the hole correct lol? Thanks in advanced.",
        "subreddit": "stocks",
        "title": "Sold on margin?",
        "url": "https://www.reddit.com/r/stocks/comments/kfctu8/sold_on_margin/",
        "created": 1608289888.0
    },
    {
        "author": "HPA_Axis",
        "created_utc": 1607971734,
        "id": "kd3olg",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "Hello,\n\nSo I recently saw an advertisement for Fidelity and looked into it some, and decided to post the results of my little experiment here. I scalp stocks for a 2% gain from buy to sell.\n\nI effectively got about 8% more of a gain (gain %, not total %)(total % of about an extra 0.2% of profit--significant for me) on Fidelity. I noticed that the Fidelity limit buys and/or sells executed at a better price than my limit order price (something that never happens on RH). Fidelity lists what amount of money they make off your trades while RH does not.\n\nFidelity pros: **can execute at a better price than you list as a limit**. live support with a real human being on the phone. Unlimited day trades (but no instant/margin feature).\n\nFidelity cons: you have to call to get support, no emailing (bad for introverts like me). No instant account (you have to wait for funds to settle before making another trade with that money-- bad for a small fish like me who moves nearly 100% of my total portfolio per trade \\[yes I know that's not recommended\\]). Less intuitive use of the app. Order summary does not go past $0.01 in detail--I've yet to talk to support to see if that is something I can enable (bad for penny stock traders)\n\nRobhinhood pros: More intuitive app. Possibly more feature rich. Ability to email support instead of having to call someone. Instant feature (but need PDT protection +/-). Trade appeared to execute more quickly, but I think there is just lag on the Fidelity end because even though the price lowered on RH, I still filled at the spike price on Fidelity.\n\nRobinhood cons: a bitch can't get a better buy or sell--Robinhood be getting rich off that shit.\n\nUnknowns: I don't have enough experience to see if Fidelity can settle trades quickly enough for it to be worth it to day trade there with an entire portfolio invested in one stock.\n\nAnywho, I thought I'd pass this info along/see how it goes!",
        "subreddit": "RobinHoodPennyStocks",
        "title": "Robinhood versus Fidelity: My little experiment",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/kd3olg/robinhood_versus_fidelity_my_little_experiment/",
        "created": 1608000534.0
    },
    {
        "author": "Narf_hand",
        "created_utc": 1607352700,
        "id": "k8hyy3",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "I’m trying to buy my first stock valued under $0.001 and I’m getting errors in fidelity. I get this error: \n\n“(TC9052)Opening transactions for Pink Sheets (without information) are not permitted because of the risks associated with these securities and all Microcap securities.”\n\nAny idea how I can acquire this OTC penny? The ticker is RTON\n\nThanks.",
        "subreddit": "pennystocks",
        "title": "Question about trading “pennies” on Fidelity",
        "url": "https://www.reddit.com/r/pennystocks/comments/k8hyy3/question_about_trading_pennies_on_fidelity/",
        "created": 1607381500.0
    },
    {
        "author": "jedi4545",
        "created_utc": 1607967814,
        "id": "kd2ce6",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "[https://www.otcmarkets.com/stock/MYCOF/overview](https://www.otcmarkets.com/stock/MYCOF/overview)\n\nAs a result of this, my brokerage (Fidelity) won't execute any trades against it.\n\nDoes anyone know why this warning has been placed, and what it might take to get it removed?  \n\n\n\"Buyer Beware. OTC Markets Group has determined that there is a public interest concern associated with the company, which may include a spam campaign, questionable stock promotion, known investigation of fraudulent activity committed by the company or insiders, regulatory suspensions, or disruptive corporate actions.\"",
        "subreddit": "shroomstocks",
        "title": "Mydecine (MYCOF) listed as caveat emptor on OTC markets",
        "url": "https://www.reddit.com/r/shroomstocks/comments/kd2ce6/mydecine_mycof_listed_as_caveat_emptor_on_otc/",
        "created": 1607996614.0
    },
    {
        "author": "artanderson",
        "created_utc": 1609135286,
        "id": "klklv6",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "So, I just started brokerage accounts about a year ago, and now I'm wondering about tax loss harvesting for 2020. I have never sold a security before. Appreciate any help or pointers to reading material! \n\n1) If I want to get rid of a stock that looks bubbly (e.g. Lemonade) at a profit, and a stock that I don't want to be invested in anymore (e.g. Root) at a loss, can I get these to cancel out, and pay no taxes? Can I buy Lemonade again after &gt;30 days and avoid the \"wash sale\"?\n\n2) Can I get a short-term capital gain to be canceled by a short-term capital loss?  For example, if my Lemonade shares gained $100, and my Root shares lost $100, these would cancel to $0?  \n\n3) Can I get a short-term capital gain to be canceled by a long-term capital loss? \n\n4) Are dividends treated as long-term capital gains, if you've only owned the security for &lt;1 year? \n\n5) Can I use tax-loss harvesting to offset taxes that I'd normally pay on my dividends? \n\n6) How does tax-loss harvesting work across multiple brokerage accounts? I stopped using Robinhood after their glitches and used Fidelity instead, but I never closed my Robinhood account. \n\n7) For the purposes of tax optimization of my brokerage accounts, should I just ignore my Wealthfront/Betterment automated tax-loss harvesting?\n\n8) Do I need special tax reporting software for all this, or is the premium version of TurboTax good enough?",
        "subreddit": "investing",
        "title": "Tax loss harvesting questions",
        "url": "https://www.reddit.com/r/investing/comments/klklv6/tax_loss_harvesting_questions/",
        "created": 1609164086.0
    },
    {
        "author": "hungrybull98",
        "created_utc": 1607994206,
        "id": "kdb720",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Anyone have trouble purchasing SPACs on margin, I am trying to gobble up $HZON shares in my fidelity account",
        "subreddit": "SPACs",
        "title": "Buying on margin",
        "url": "https://www.reddit.com/r/SPACs/comments/kdb720/buying_on_margin/",
        "created": 1608023006.0
    },
    {
        "author": "Reinbek",
        "created_utc": 1607240901,
        "id": "k7pju5",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "As the title says, I’d like to start soon. I’ve done my research but I still have some questions. Before asking I do want to say that I’m going to use Fidelity (seems easy to use) and I have about 3,000 dollars lying around that I can use to initiate investing. \n\nMy questions: \nBy imputing my bank info to create my account on fidelity, will I have to pay fees any time I purchase stock? I know it takes several days to get verified and actually start investing. \n\nAlso which companies are good for beginners like me? My peers say a bunch of different companies but I’m not sure which ones to look into but I always hear Tesla being mentioned. \n\nOverall I’m still a bit confused and I’d really appreciate any info. Thank you!",
        "subreddit": "stocks",
        "title": "Want to start in buying stock.",
        "url": "https://www.reddit.com/r/stocks/comments/k7pju5/want_to_start_in_buying_stock/",
        "created": 1607269701.0
    },
    {
        "author": "PeanutButterRedDirt",
        "created_utc": 1607347553,
        "id": "k8gkn6",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "So thanks to the end of day run up on Friday, I now realize I was assigned 300 shares of TGT due to the 175 strike calls I was letting expire worthless and taking the $250 loss. Obviously not the case now. \nI don’t hate TGT as a stock, it’s come off highs slightly after solid previous earnings, and we’re moving into heavy retail consumer season (but an unprecedented one at that)...should I just ride out this position even if short term things go south? Personally I see the market as a whole pulling back over this next week or two. \nMaybe fidelity will force the sale at open anyway, this position is now my largest by 2x. \nThoughts/advice from the boys???",
        "subreddit": "wallstreetbets",
        "title": "Assigned $50K in TGT shares...WWYD?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k8gkn6/assigned_50k_in_tgt_shareswwyd/",
        "created": 1607376353.0
    },
    {
        "author": "2HI4ME",
        "created_utc": 1608688038,
        "id": "kijdgp",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "I have a work 401k with fidelity that has 8k in it. My retirement fund  (separate from 401k) is being managed by another brokerage and that's what I plan to retire on. What can i do with this 8K? Can i trade in it? If so, what are the pros and cons. \n\nMy Roth positions bore me to deah. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/umzcuf4odu661.png?width=921&amp;format=png&amp;auto=webp&amp;s=3b3013189d90309bc455181a3540d3ca242d98b0",
        "subreddit": "wallstreetbets",
        "title": "Can i trade out of my works Roth 401k?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kijdgp/can_i_trade_out_of_my_works_roth_401k/",
        "created": 1608716838.0
    },
    {
        "author": "wordytracker",
        "created_utc": 1608018138,
        "id": "kdhdse",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "My advisor recommended Fidelity Global Innovators mutual fund, its past performance looks good but with high MER, is it a good choice to go for? any equivalent ETFs in the market with lower fees?",
        "subreddit": "CanadianInvestor",
        "title": "Fidelity Global Innovators Mutual Fund",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/kdhdse/fidelity_global_innovators_mutual_fund/",
        "created": 1608046938.0
    },
    {
        "author": "markhamm41",
        "created_utc": 1608876301,
        "id": "kju85e",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Got a notice from fidelity saying it is hard to borrow.    i see have no real advantage but stimulus and lock down will keep its business growing.  \n\nI have not personally used them.  How do they compare to uber eat and other delivery services?",
        "subreddit": "wallstreetbets",
        "title": "Doordash, whats your view?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kju85e/doordash_whats_your_view/",
        "created": 1608905101.0
    },
    {
        "author": "MusicGuy96",
        "created_utc": 1607542761,
        "id": "k9yx15",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "It won't let me claiming cash exceeds, but I am buying an amount that is less than what I transferred to my account. It let me buy another stock. Is something different about this company? I am very new to stocks..\n\nTia!",
        "subreddit": "shroomstocks",
        "title": "Can you buy MMEDF on fidelity?",
        "url": "https://www.reddit.com/r/shroomstocks/comments/k9yx15/can_you_buy_mmedf_on_fidelity/",
        "created": 1607571561.0
    },
    {
        "author": "keepexploring10",
        "created_utc": 1608163177,
        "id": "kelfxv",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "I'm 31 and starting to contribute money to ROTH IRA via backdoor but need help to set up my allocations. I'm not sure how much % of my allocations should be towards small cap if there is any...\n\nI'm not sure if 10% of my portfolio is enough for Small cap MF or do I even need Small cap ? If yes, then which one and how much % ? Please feel feel to review/critique. Thanks  \n\n\nBackdoor Roth IRA at Fidelity:\n\n* 45% FZROX (Total US Stock Market Fund)\n* 35% FZILX (Total International Stock Market Fund)\n* 10% FSSNX (Fidelity small cap index fund)\n* 5% QQQ\n* 5% ARKK",
        "subreddit": "investing",
        "title": "Backdoor Roth ira portfolio review",
        "url": "https://www.reddit.com/r/investing/comments/kelfxv/backdoor_roth_ira_portfolio_review/",
        "created": 1608191977.0
    },
    {
        "author": "arilian50",
        "created_utc": 1608599276,
        "id": "khuqur",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Just got into the market this year. I know if I have any profit from any stock I'd have to report it. But the questions how?\n\n\nOn fidelity and robinhood, do I print out some form from there and add it to my taxes? If not then please explain to me. \n\nI apologize if I sound kind of dumb, but this is unfamiliar to me.\n\nThanks a lot in advance. 😎",
        "subreddit": "StockMarket",
        "title": "How do yo ureport stocks on your taxes?",
        "url": "https://www.reddit.com/r/StockMarket/comments/khuqur/how_do_yo_ureport_stocks_on_your_taxes/",
        "created": 1608628076.0
    },
    {
        "author": "onemananswerfactory",
        "created_utc": 1608731519,
        "id": "kitfz4",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "I've dabbled in penny stocks, but I defer to this sub's experience. Is there a fintech stock under $1 that's caught your attention? \n\nFor starters, I've found: [https://www.investopedia.com/markets/quote?tvwidgetsymbol=XELA](https://www.investopedia.com/markets/quote?tvwidgetsymbol=XELA)\n\n...and...\n\n[https://www.investopedia.com/markets/quote?tvwidgetsymbol=JFU](https://www.investopedia.com/markets/quote?tvwidgetsymbol=JFU) (but this is over $1)\n\nI read on here about Supply@ME Capital, but Fidelity here in the US doesn't seem to have it. Ideas?",
        "subreddit": "pennystocks",
        "title": "Anyone know of a potentially great fintech penny stock under $1?",
        "url": "https://www.reddit.com/r/pennystocks/comments/kitfz4/anyone_know_of_a_potentially_great_fintech_penny/",
        "created": 1608760319.0
    },
    {
        "author": "AngryCustomerService",
        "created_utc": 1608042490,
        "id": "kdmobj",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "If I sell in my brokerage account and buy in my Roth, would that be a wash? (Accounts at the same place: Fidelity)\n\nI have some stocks in my brokerage account that I'd like to have in my Roth. I don't mind double exposure for a little bit. Would it be better to sell and buy or do double exposure or have I completely misunderstood wash transactions? \n\nOr is there a better way to move these and I don't know about it?\n\nThank you for any guidance.",
        "subreddit": "stocks",
        "title": "Sell in one account buy in another = wash?",
        "url": "https://www.reddit.com/r/stocks/comments/kdmobj/sell_in_one_account_buy_in_another_wash/",
        "created": 1608071290.0
    },
    {
        "author": "VirusZer0",
        "created_utc": 1608272609,
        "id": "kffs0m",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Basically all the brokers now offer free trades, but of those which don’t sell order flow data? I know RH and Webull does but what about others like ETrade, Fidelity and Schwab?\n\nAnd how exactly does this affect us? If we use limit orders are we less likely to fill? And I believe I’ve read market orders fill at a worse price on RH, what about other brokers? I know stop losses are sold but what exactly else is sold?...",
        "subreddit": "stocks",
        "title": "Which brokers don’t sell order flow data?",
        "url": "https://www.reddit.com/r/stocks/comments/kffs0m/which_brokers_dont_sell_order_flow_data/",
        "created": 1608301409.0
    },
    {
        "author": "_Drosselmeyer",
        "created_utc": 1607530389,
        "id": "k9uomy",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "There is a stock that I know is going to tank on December 21 but there are very low volume on the options. I have never exercised options before but I plan on laying down quite a bit of cash since it is such a sure play. Could some of you autists please lend me a little advice? I use fidelity and I am totally fine with exercising even no one is there that wants to buy since I will be completely inflating the market for options on this stock.   I will put post research about ticker after I enter a position in a few days.",
        "subreddit": "wallstreetbets",
        "title": "Low Volume Option play please help",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k9uomy/low_volume_option_play_please_help/",
        "created": 1607559189.0
    },
    {
        "author": "joost1717",
        "created_utc": 1607630752,
        "id": "kamy5i",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "Does anyone know which brokers do not charge unit split fees? Also, how long does it take to split the units? I have my account with Schwab, and when I called, their representative said that there is no fee for splitting the units, but now they are charging $39 for each split and $39 for exercising warrants. It also takes them over 2 weeks to deliver some of the shares and warrants. Does anyone know anything about TD or Fidelity? Thanks, much appreciated!",
        "subreddit": "SPACs",
        "title": "Fees for splitting units",
        "url": "https://www.reddit.com/r/SPACs/comments/kamy5i/fees_for_splitting_units/",
        "created": 1607659552.0
    },
    {
        "author": "diyastronaut",
        "created_utc": 1608741196,
        "id": "kiw7vr",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Fidelity clearly isn't bull gang",
        "url": "https://i.redd.it/ed6houg0sy661.png",
        "created": 1608769996.0
    },
    {
        "author": "Crack_Fox-",
        "created_utc": 1606916942,
        "id": "k59iyq",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "What app do you use for penny stocks? \n\nI got ALPP on t212 but the majority of tickers mentioned here are not on there. (invest)\n\nCan't see an Ameritrade app. Is Fidelity the way to do it ?.",
        "subreddit": "pennystocks",
        "title": "Any UK on here?",
        "url": "https://www.reddit.com/r/pennystocks/comments/k59iyq/any_uk_on_here/",
        "created": 1606945742.0
    }
]