[
    {
        "author": "OPINION_IS_UNPOPULAR",
        "created_utc": 1607459216,
        "id": "k9c95d",
        "num_comments": 8985,
        "num_crossposts": 0,
        "selftext": "Post all your GME-related positions, prayers, memes, stories, ~~death threats,~~ and shitposts here.",
        "subreddit": "wallstreetbets",
        "title": "GME Earnings Thread",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k9c95d/gme_earnings_thread/",
        "created": 1607488016.0
    },
    {
        "author": "Youkiame",
        "created_utc": 1609383206,
        "id": "knh99p",
        "num_comments": 4969,
        "num_crossposts": 0,
        "selftext": "Like seriously, those top shitposts, memes getting 5+awards are pissing me off. We are at war right now!! Fuck those Wall Street jackass who’s been calling us dimwits, we are about to teach them a lesson and make a name of ourselves. But you guys are here wasting money on stupid Reddit awards. I’ve been skipping my 20$ Wendy’s chicken dinner combo for three months now and buying GME every time it dips below 20$. All of you should be doing the same, everyone jack to the fucking tits!\n\nPosition: GME 🚀🚀🚀🚀",
        "subreddit": "wallstreetbets",
        "title": "You guys need to stop wasting money on useless Reddit awards and buy GME shares",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/knh99p/you_guys_need_to_stop_wasting_money_on_useless/",
        "created": 1609412006.0
    },
    {
        "author": "DeepFuckingValue",
        "created_utc": 1608670994,
        "id": "kie1dk",
        "num_comments": 1155,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "GME YOLO update — Dec 22 2020",
        "url": "https://i.redd.it/25f04qy3zs661.png",
        "created": 1608699794.0
    },
    {
        "author": "SIR_JACK_A_LOT",
        "created_utc": 1608307724,
        "id": "kfnxpn",
        "num_comments": 1071,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "💎🙌 GME Gang rise Up! Earnings dip sucked (Fuck you Sherman) but short squeeze gotta squeeze. Continuing the road to multi-millionaire, who’s with me?",
        "url": "https://i.redd.it/q2djbfr2zy561.jpg",
        "created": 1608336524.0
    },
    {
        "author": "sneakersourcerer",
        "created_utc": 1609087611,
        "id": "kl6qw0",
        "num_comments": 976,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "2000% GME",
        "url": "https://i.redd.it/odngg613er761.jpg",
        "created": 1609116411.0
    },
    {
        "author": "SIR_JACK_A_LOT",
        "created_utc": 1608749174,
        "id": "kiypqq",
        "num_comments": 929,
        "num_crossposts": 0,
        "selftext": "**TLDR:** Going all in on STIC, going to reverse merger with BarkBox in Q1/Q2 and be the next 10-bagger in the BECKY fund\n\n**Why?** Bitches love spoiling their dogs, fucking look at their [website](https://www.barkbox.com/) and [instagram](https://www.instagram.com/barkbox/), their DTC marketing is fucking on point\n\n**Buzzwords:** Pets. E-commerce. Subscription. SPAC. Bitches.\n\n**DD**\n\n* *Pandemic-fueled rise* in pet adoptions blew up CHWY this year, and Barkbox will profit here as well\n* It's a subscription-business meaning lit 2020 == strong recurring revenue into 2021+\n* Diversified product line from boxes to toys to food via e-commerce AND in 23,000 retail locations including Amazon\n* CEO of the SPAC, Joanna Coles, is a [MILF/GILF](https://www.google.com/search?q=Joanna+Coles&amp;source=lnms&amp;tbm=isch) who is on the boards of SNAP and SONOS and knows what millenials love to spend their stimulus money on\n* President/COO of the SPAC, Jon Ledecky, probably does all the real financial shit and already helped launch XL Fleet via a SPAC, which has already mooned\n* If you search for \"STIC\" on reddit: there's only 1 other post about it from yesterday so this is extremely early and profitable [https://www.reddit.com/r/wallstreetbets/search?q=stic&amp;restrict\\_sr=1](https://www.reddit.com/r/wallstreetbets/search?q=stic&amp;restrict_sr=1)\n* Stocktwits follower count growing from 400 yesterday to 756 today, you're finally hearing about a SPAC early enough, you're welcome [https://stocktwits.com/symbol/STIC](https://stocktwits.com/symbol/STIC)\n\n**Numbers**\n\n* $1.6 billion deal\n* $369 (nice) million in revenue for the fiscal year ending March 31, 2021\n* 1.1M active subscriptions up 58% y/y\n* 95% monthly retention with INCREASING gross profit and DECREASING acquisition costs\n* 65% y/y net revenue growth\n* 60% gross margin\n\n**Appendix**\n\n* Full management presentation with financials and forecasts [https://static1.squarespace.com/static/5fc915303436806905d7150e/t/5fdae20279e44d2bcf557f77/1608180228067/BARK-Overview-12162020.pdf](https://static1.squarespace.com/static/5fc915303436806905d7150e/t/5fdae20279e44d2bcf557f77/1608180228067/BARK-Overview-12162020.pdf)\n* WSJ confirmed the merger [https://www.wsj.com/articles/barkbox-to-be-acquired-in-1-6-billion-deal-11608174012](https://www.wsj.com/articles/barkbox-to-be-acquired-in-1-6-billion-deal-11608174012)\n\n[Go to the fucking dog park and ask bitches about BarkBox, everyone is throwing money at their pandemic puppies and those little shits will play\\/eat anything so those subscriptions will never get cancelled \\(until the dog dies, but that's a 10 year later problem\\)](https://preview.redd.it/34h0l8kfaz661.png?width=1456&amp;format=png&amp;auto=webp&amp;s=2ec99460239f379536b2634d1f15194960a96c96)\n\n*Regarding GME:* Hope you all enjoyed the RC-fueled tendies, what a day yesterday. I still strongly believe in the MOASS and believe the squeeze has not squoze yet but my goal is 8 digits or bust in &lt; 1 year so I'm mother-fucking chad-ing it up and going to TIME the market, meaning riding STIC/BARK up 2-5X and then jump back into GME for another 2-5X. Fuck you Warren Buffet and your 90 y/o \"time in the market\" boomer bullshit. The next pandemic in 2025 might wipe us all out anyways, I ain't got time to wait for retirement. Gotta will it into existence. YOLO",
        "subreddit": "wallstreetbets",
        "title": "SIR_JACK_A_LOT's next move: ALL in STIC -&gt; BARK merger (BarkBox -- bitches love spoiling their dogs)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kiypqq/sir_jack_a_lots_next_move_all_in_stic_bark_merger/",
        "created": 1608777974.0
    },
    {
        "author": "cyanlce",
        "created_utc": 1607082851,
        "id": "k6jjm3",
        "num_comments": 815,
        "num_crossposts": 0,
        "selftext": "WSB is the 7th largest holder of GME.\n\n[**Top holders**](http://news.gamestop.com/stock-information/institutional-ownership)\n\nHolder|Shares|% O/S\n:--|--:|--:|\nFidelity|9,534,090|14.6%\nBlackRock|7,897,907|12.1%\nRC Ventures|6,500,000|10.0%\nVanguard|5,288,116|8.1%\nSusquehanna|4,444,128|6.8%\nDimensional Fund Adv|3,948,114|6.1%\nWall Street Bets|3,803,770|5.8%\nSenvest|3,610,740|5.5%\nDonald Foss|3,515,200|5.4%\nMust Asset Mgmt|3,300,000|5.1%\n\nIn case you're wondering, here are most commonly held number of shares:\n\nShares|Responses|% of Total Responses\n:--|--:|--:|\n100|137|5.7%\n200|86|3.6%\n50|69|2.9%\n300|64|2.7%\n10|54|2.3%\n1000|50|2.1%\n500|50|2.1%\n30|44|1.8%\n400|44|1.8%\n20|43|1.8%\nOther|1,756|73.3%\n\n**Please add or update your shares with this link**: https://forms.gle/kJFs1C8gURHA5a8g8\n\nLatest response with for an ID is the one that counts. Shares over 50K must be verified via screenshot.\n\n**Cleaned and filtered data without IDs:** https://docs.google.com/spreadsheets/d/e/2PACX-1vTf1Tpy7RUH6ZjeMhVRsj54WSDVCVEaWLLUPuAJBOOTH6lY2o9J8tzbehO9Z-ukbFrrzhjeXEID-rFx/pubhtml",
        "subreddit": "wallstreetbets",
        "title": "WSB owns 5.8% of GME (GME survey update)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k6jjm3/wsb_owns_58_of_gme_gme_survey_update/",
        "created": 1607111651.0
    },
    {
        "author": "DeepFuckingValue",
        "created_utc": 1608909008,
        "id": "kk0g0f",
        "num_comments": 710,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "GME YOLO Christmas update — Dec 25 2020",
        "url": "https://i.redd.it/x0wn1t9jmc761.png",
        "created": 1608937808.0
    },
    {
        "author": "DeepFuckingValue",
        "created_utc": 1608757572,
        "id": "kj1bhd",
        "num_comments": 636,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "GME YOLO update — Dec 23 2020",
        "url": "https://i.redd.it/5argurri40761.png",
        "created": 1608786372.0
    },
    {
        "author": "Crips_Ahoy177",
        "created_utc": 1609176052,
        "id": "klul2v",
        "num_comments": 607,
        "num_crossposts": 0,
        "selftext": "Ok story time.\n\nI know this isn’t the sub for soppy stories, so Ill keep it short. I’ve been dating this girl since high school and I’ve known for a while that she’s the one I’m going to marry. We are both juniors in college and have a shit ton of debt sitting on us, but we have been toying with the idea for a bit about getting married right after college.\n\nObviously, to do this I need money. I’ve been a safe investor and trader for around 3 years now, only buying ITM calls short term expiry and investing in blue chip stocks, but I’ve been following WSB for a bit now bc y’all are fuckin crazy and it makes my day watching some of the dumbass trades that somehow print bc stocks only go up not tits up (also, loss porn on here is 10/10). But I have come to an impasse. \n\nI’ve thought long and hard about this in the past 3 minutes and have decided to leave the fate of my relationship up to WSB pumping the market. Instead of buying an engagement ring for my girlfriend, I’m going to buy $GME 50c 1/22/21 $22 and hope to God that it works. If it does, I buy the ring and have money to pay off debts and maybe rent for an apartment with what’s left over (I’m still in school so I currently don’t have a job). If it tanks, then my girlfriend dumps me for her husband bc no chick would stay with a broke dumbass who YOLOd life savings on a GameStop.\n\nHelp me WSB bulls, you’re my only hope. GME to the fuckin moon 🚀🚀🚀🚀🚀🚀🚀🚀",
        "subreddit": "wallstreetbets",
        "title": "YOLO on GME 🚀🚀🚀 - will decide if I get married or if I die broke and alone",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/klul2v/yolo_on_gme_will_decide_if_i_get_married_or_if_i/",
        "created": 1609204852.0
    },
    {
        "author": "HotStool",
        "created_utc": 1609195059,
        "id": "km0sd9",
        "num_comments": 583,
        "num_crossposts": 0,
        "selftext": "All I can fucking say is I’ve been watching to volume/resistance data all fucking day for GME and there was HEAVY resistance at the $21.20+ mark all through $23....I’m talking close to a million dollars in sell orders almost every cent of the way up.\n\nNow an hour or so before close it completely dissipated to about 1/5th of that and of course now that it’s after hours it’s even lower. \n\nI’m pretty fucking sure the 🌈🌈🌈🐻🐻🐻 squad is behind this tomfoolery but honestly I’m really fucking pumped for tomorrow and Wednesday. \n\nI’m thinking we see steady increases and as it creeps higher and higher Melvin Crapital is gonna be forced to cover and MOON THIS SHIT 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\nTo all you paper handed f4ggots - enjoy your Wendy’s jobs u fucking degenerate cucks. Me and all the other diamond handed gods will be fucking your wife’s boyfriends in our lambos in no time 😎😎😎😎\n\nHonestly all you idiots have to do is load up on shares and wait for the squeeze to happen. SHARES. Stop only buying calls u fucking retards that’s how Melvin and his wifes boyfriend wins. We. Need. SHARES.\n\nDIAMOND HAND THAT SHIT\n\n\n\nPositions: 5000 shares\n1000 calls (not tellin dates/strikes)\n\nCURRENTLY DEEP RED but I’m a diamond-handed mother fucker so I ain’t scared.",
        "subreddit": "wallstreetbets",
        "title": "PROOF GME IS MOONING TOMORROW AND BEYOND",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/km0sd9/proof_gme_is_mooning_tomorrow_and_beyond/",
        "created": 1609223859.0
    },
    {
        "author": "CPTHubbard",
        "created_utc": 1607625021,
        "id": "kakxrm",
        "num_comments": 572,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "GME Tribe: A Story About How Ryan Cohen is About to Kick Down Sherman's Door and Drink His Milkshake 🚀🚀🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kakxrm/gme_tribe_a_story_about_how_ryan_cohen_is_about/",
        "created": 1607653821.0
    },
    {
        "author": "Uberkikz11",
        "created_utc": 1609009495,
        "id": "kknuk6",
        "num_comments": 558,
        "num_crossposts": 0,
        "selftext": "GME Gang, a belated Merry Christmas 🎄 🎁. Our savior, u/DeepFuckingValue, has shown us the light, and we must rejoice for him and his. Watch this ([https://www.youtube.com/watch?v=aIVscxs9oJg&amp;t=11s](https://www.youtube.com/watch?v=aIVscxs9oJg&amp;t=11s)) if you aren't familiar with the duality that is Roaring Kitty &amp; DFV. Smash that subscribe button and come back to reading (or ask a grown-up for help) these words.\n\nAs the semiliterate among you know, GameStop was scheduled to present on the last day of the ICR Conference (an investor conference for public &amp; private companies to show off how big their shlong is going to be when fully pumped) on January 13th, under the retail category. GameStop analyst extraordinaire (I won't speaketh the naughty Eeking Salpha words, mods) Justin Doperiala at DOMO Capital caught this minor, yet massive tweak.\n\nAt some point in the last few days, GameStop was shifted from the Retail &amp; Consumer category on the 13th to now present under the TECHNOLOGY category AH on Jan 11th. What does this mean? Management may not be-a-buncha-bitches after all. They clearly requested the category switch and have something TECHNOLOGY related to share. M&amp;A? Strategic shift/review? DIGITAL FIRST OMNI-CHANNEL?!? \n\nNow, #WeWantCohen and there's really nothing the boomers can say to change that. But what they can do, is speak boomerish in a way that the other market participants are made aware of the tech &amp; e-commerce opportunity that has not been valued in any way by the market (yes, even at $20/share the stock is an easy 2-3x on fundamentals over 2021-2022). GameStop's tens of millions of unique customer profiles and decades deep dataset are truly unique in the massive gaming industry.\n\nMelvin's put position was rolled to Jan21 (see pic), and management surely knows this. Could they be competent after all? Yes. This tells us they are dropping dongs. Now will Melvin bend over and take it? Doubtful. But don't believe the FUD. The upside opportunity and near term re-rating has been enhanced by Management's choice of the words TECHNOLOGY in this case.\n\nTL;DR: DFV is the man. GME is going much higher. I have thousands of shares and hundreds of ITM/ATM/OTM calls from Apr21 to Jan2023.\n\nP.S. 🚀",
        "subreddit": "wallstreetbets",
        "title": "GME ICR Conference - Words Matter",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kknuk6/gme_icr_conference_words_matter/",
        "created": 1609038295.0
    },
    {
        "author": "BeardlessPete",
        "created_utc": 1608780136,
        "id": "kj7p0e",
        "num_comments": 557,
        "num_crossposts": 0,
        "selftext": "I realize none of you actually care about making money, but on the off chance I can help one person then this post will be worth it. I have a list of rules I follow when I take positions, and I think you might find some value if you have a similar list.\n\n1. **Always trade to the long side - do not short.** There is an underlying elevating factor to the stock market - \"stocks only go up.\" Although this is a meme, it's actually true. This means all bearish positions are fighting gravity by default. Go long, or go home.\n2. **Pick a basket of individual stocks - at least 4 or 5.** If you have an 80% winning strategy, that means your basket will mostly win. If you have an 80% winning strategy and pick a loser, you're fucked. You work hard for your money, so don't fucking insult yourself by losing it you degenerate. Respect yourself and your money and stop giving it to theta goons.\n3. **Only go long in an individual stock once you have a list of conditions**. Here are some of my conditions, and they usually work when I swing trade, as an example:\n   1. The stock is currently trading above the 180 day SMA.\n   2. The stock has a golden cross on the MACD.\n   3. The stock has a candle close above the 9 day SMA.\n   4. The day you enter in the position cannot be a new high.\n   5. Never hold through earnings.\n\nThese are all elevating factors. **To illustrate this point**, look at RAD over the past few weeks:\n\n**10/9/20**, you had most of these confirmation points. The trade went flat and you likely would have sold the very next day at a minor loss. I look stupid, right?\n\nBut, look at **11/3/20** \\- All of the elements listed above (**Except for #1**) are met, and the stock rallies hard. You could take this trade, but I like to have all my indicators met before I move.\n\nThen, on **12/2/20** RAD crosses the 180 day SMA (so all elements are met), and rallies again. This is where someone like me comes in.\n\n**Look at GME:** Yesterday it held above the 180 day SMA, it closed above the 9 day SMA, it had a golden cross, and it doesn't release earnings until March, so you can hold it for a while. You could have seen confirmation yesterday, bought in, and sold out today with a 5% gain. \n\n**I'm not telling you to copy what I do. I'm just trying to give you a basic, understandable, introduction to some simple technical indicators so you don't get burned.** Or at least, you get burned less frequently.\n\n**Also, final point: #4**. **Have a plan and stick to it.** Do you know why you have paper hands? Because you do not have a plan. There are lots of strategies online. There are people who only trade 3 bar plays. There are people who trade breakouts. There are people who trade on RSI. I don't care which one you use - just pick one and start making money. The sooner you have a plan, the sooner you will be able to get diamond hands because you'll know when you should enter and exit your positions.\n\n**Honorable mention:**\n\n[Tradingview.com](https://Tradingview.com). Check it out - it's charting software in the browser. **It's powerful and it's free.** I had no idea this was a thing until a few months ago. Changed my life and made screening so so so much easier.\n\nThat's it. I hope this helped at least one of you guys not throw your Christmas money into the pockets of someone else. Merry Christmas.",
        "subreddit": "wallstreetbets",
        "title": "My gift to you - a list of things you can do to stop losing all your fucking money.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kj7p0e/my_gift_to_you_a_list_of_things_you_can_do_to/",
        "created": 1608808936.0
    },
    {
        "author": "0ptimusPrim0",
        "created_utc": 1609199470,
        "id": "km26gn",
        "num_comments": 556,
        "num_crossposts": 0,
        "selftext": "So I know some of you are feeling cucked and have been expecting a short squeeze every single day for the last X amount of days...\n\nBut here is my DD, and how you can play in a role and profit with or without touching the stock. \n\nYou’re confused so let me speak your language\n🚀🚀🚀🚀🚀🚀\n\n\nGameStop offers PowerUp rewards membership.\n\nThere is a free tier, and $15 yearly membership tier. \nBuy the $15 membership right now...you’ve lost more money than that in less than 15 seconds today...you’ve spent more money on that for lube and protection around your nearest Wendy’s. \n\n\n#If every one of you with positions in GME actually did this, their profit numbers would look ridiculous at the next ER. If you spread this info to other people, many of whom are not aware, they may utilize it and ER would look even better. \n\nSo what does this $15 get you?\n\nA $5 coupon every month that you can use on any item, including gift cards, and online gamin stores. Any of them...all of them\n\nAfter 3 months you break even, after the 4th month you have a higher percentage gain than your RH account. \n\nSo you spend $15 for membership, and get $60 in the course of 12 months. \n\nYour net profit is $45. If every month you pick up a $10 gaming card (PSN/XLive/ N eShop), you only end up paying $5 each month. \n\nAt the end of 12 months, you spent an actual $75, but ended up getting $120 worth of stuff. \n\nUse it for yourself, or if you’re not a gamer, save them up and gift it to someone. Or give it to your wife’s boyfriend so he can use it while his dick is during the refractory period.\n\nTL;DR:\n\nBuy the $15 membership, it can and will help your GME positions...\n\n[GME Theme Song ( 4 Bulls )](https://youtu.be/BfnjX88Va4Y)",
        "subreddit": "wallstreetbets",
        "title": "GameStop DD and potential profits.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/km26gn/gamestop_dd_and_potential_profits/",
        "created": 1609228270.0
    },
    {
        "author": "aQne72yYGsNC",
        "created_utc": 1608313721,
        "id": "kfpvv7",
        "num_comments": 517,
        "num_crossposts": 2,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "$GME Gang Today We Go To The Moon! 🌝",
        "url": "https://v.redd.it/t1plb0gmgz561",
        "created": 1608342521.0
    },
    {
        "author": "Senseisntsocommon",
        "created_utc": 1608694267,
        "id": "kil4wu",
        "num_comments": 484,
        "num_crossposts": 0,
        "selftext": "So with GME running the myth of the inevitable short squeeze has popped up again.  In order for this to happen a ton of people need to short the stock naked.  Which among competent investors is really fucking rare.  I will walk through it below but you can also click this link:\n\nhttps://www.investopedia.com/articles/active-trading/021715/how-protect-short-position-options.asp\n\nFor example let’s assume you wanted to short GME today at $20 a share.  So you sell 100 shares short at $20 each.  With a naked short you have unlimited losses as the stock runs up.  Nobody who knows what the fuck they are doing is going to do that when you can hedge to cap that loss.  A single January 21 call at a strike of 21 had a high of 2.42 today would hedge that just fine.\n\nYou short the shares and buy the call.  Your break even is now 17.68 on your short but your max loss is now $342 without borrowing costs assuming it closes at $20.99 on expiry.  Call expiring worthless for loss of $242 and $99 to cover the short.  \n\nBorrowing costs on 100 shares at 20% and stock at 20 is about $1 a day.  Assuming everything is held to expiry with the January expiry would be about $25.\n\nSo max loss regardless of how high the stock goes is less than $400.\n\nYour break even is kind of ass but that’s because you are protected until mid Jan.  However if IV is particularly high, even if the stock goes down pushing your return on the short up, the call might still retain enough value that your break even is much higher.  \n\nIf it’s a short term play which a short on today would likely be, you could buy a call for Friday which had a high of 1.15 today which puts your break even at 18.85 assuming you hold until Friday at close.  Factoring in borrowing cost it’s 18.8.  \n\nThat’s a hedged short which likely the vast , vast majority of GME shorts are.  Have you not noticed how fucking expensive relatively speaking call options are even with the spikes. A 20c at close with 1.5 days to expiry had a break even at 20.72 with a volume of 30,000.  Now part of that is people buying lottos but a ton of that is covering shorts.\n\nSo the whole premise of there are millions of shares that are short at $5 or $7 is some serious bullshit.  Yes there were 70m shares short give or take 2m at the end of October and there were the same number of shares short at the end of November.  This does not mean they are the same fucking people shorting it. Some have covered, some executed hedges and others have sold that shit short at higher prices.\n\nFor example today alone 8m shares were shorted.\n\nhttps://fintel.io/ss/us/gme\n\nYesterday there were 3m shares shorted.  Borrowing rates are in the 20% range, which works out to around $1 total per 100 shares.  Or a single fucking tick downward.  So no institutions aren’t going to be covering shares they shorted at $15 when it spikes to $19.\n\nBut why has it been spiking if it’s not a short squeeze, and that’s really fucking simple, a ton of people are playing the momentum on it.  Hell 10% of the daily thread is people spamming to buy shares and you can make some money provided you don’t buy the top.  Its not a coincidence that they announce the stimulus and the stock spiked and I would be willing to bet that the vast majority of shares bought today were through Robinhood.\n\nBut Cohen you say?  He added another 3%, yeah he added 3% directly on the dip after earnings.  He’s in at $12 - $13 range based off the timings of the 13d.  If you are wondering what happens if he decides that the board isn’t being accommodating enough and drops his shares look at what happened the day Buffet said he was dropping airlines.  He can eat the ride down to $13 and still be profitable.\n\nThen finally the biggest piece to the short squeeze is long term positive catalysts, the last significant short squeeze came from ACB two earnings ago when they closed the gap on their loss and cancelled their at the money offering.  At that point the long term growth story fundamentally changed as did the state of the business.  That’s what it takes to force a short squeeze, doubling e-commerce sales when overall sales are still massively down isn’t going to cut it.  A slightly green quarter during the launch of multiple new consoles isn’t going to do it either.  Now if they follow that with another solidly profitable quarter in May, at that point a squeeze is possible.\n\n\nTL:DR:  The infinite short squeeze on GameStop is a bullshit argument assuming basic competence from anyone shorting the stock.  Options were in fact originally designed to offset the risks of shorting.  It will go up as long as more people are willing to become bagholders, just don’t be shocked when it comes crashing down.  It also explains the crazy ass high IV on call options.",
        "subreddit": "wallstreetbets",
        "title": "GME short squeeze is a myth that assumes massive incompetence from people that actually know what they are doing.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kil4wu/gme_short_squeeze_is_a_myth_that_assumes_massive/",
        "created": 1608723067.0
    },
    {
        "author": "_Unoriginal_Name",
        "created_utc": 1609257573,
        "id": "kmgzp7",
        "num_comments": 471,
        "num_crossposts": 0,
        "selftext": "https://iborrowdesk.com/report/GME\n\nSo I was interested in what was causing the spike in the downward trend of the GME stock this morning and once being shared this link, I began analysing Melvin and other shorters approach.\n\nWhat I noticed is that they firstly bought 60k worth of shorts limiting the available amount from 100k to 40k. This is not a lot and we all know it! Since then they are actually trying to ease off a bit and have begun reducing their short shares amount. Between 9.30am and 10.30am the number actually increased from 40k to 60k!\n\nSo what does this mean? Well quite simply this is market manipulation at it's finest and IMO they're very scared and we're close to the endgame. We just need to trust our process and DD and not fold with paper hands. They are literally trying to shake trees and see if anything falls out. The fact that they are easing their position between 9.30am and 10.30am means they know it cant't go on forever.\n\nMy guess is they want their EOY results to be good and are just trying to make it to next year! My recommendation is to BTFD and I would honestly buy more if I had any more available funds. Good luck everyone and keep your hands firmly on your shares. \n\n💎🚀😎 GME GANG!!",
        "subreddit": "wallstreetbets",
        "title": "GME Analysis of Shares Currently Being Shorted Today",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kmgzp7/gme_analysis_of_shares_currently_being_shorted/",
        "created": 1609286373.0
    },
    {
        "author": "TcuBisNice",
        "created_utc": 1608810806,
        "id": "kje7w1",
        "num_comments": 466,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "To all the $GME diamond hands gang 💎🙌 out there. To Mars!🚀🚀🚀",
        "url": "https://v.redd.it/ihcj94k7i4761",
        "created": 1608839606.0
    },
    {
        "author": "starskeeponcalling",
        "created_utc": 1607958996,
        "id": "kczhs8",
        "num_comments": 465,
        "num_crossposts": 0,
        "selftext": "Positions : 318 Shares at **18.03**. Fuck me right ? \n\nGME is at **12.38** right now as I'm writing this. I'm trying to figure out what to do now, since I went all IN. And I mean all IN - got no money to invest on any other plays anymore.\n\nI originally got into GME a couple of days before their Q2 earnings. I bought 30c's for 1/15/21 after reading one of the first DDs about the squeeze. Q2 earnings happened, and they got killed, and I panic sold my calls at a loss. And decided not to fuck with GME again. \n\nMade some money on other plays over the months, until the squeeze hype train ran into me, and I decided to YOLO everything into GME, at an average of 18.03, and the ride has just been downhill ever since.\n\nQ3 earnings of course did not lead us anywhere. And today morning, a week later, GME is down to a sad 12.38. Don't I feel like quite the bag holder. \n\nIt seems like every one has a better position than I do (tons of comments from people who got in when it was in single digits, or at around 12-13). But there have to be others like me, who're stuck at an average that seems unsurmountable right now. \n\nIs the plan to just wait till Q4 earnings ? Is there any hope of Daddy Cohen intervening ? Seems like the board has started cutting costs by shutting stores, something that Cohen wanted them to do. My fear is that Sherman might half arse this enough to avoid being taken over, and we're left with this stock that just won't move. Although honestly I don't fully understand the technicals of the squeeze, so I'm sure there are factors beyond these.\n\nEvery time I try asking about these doubts I have on /r/wsb, the answer I've received is that I should hold. And hold I will, as I watch all you autists make money on other plays like PLTR and god knows what.  Look momma didn't raise no paper handed bitch, I've got diamond hands. What I don't got, are diamond balls, and so I'm looking for some support, perhaps some confirmation bias, some guidance ? Anyway, thought I'd create a post where we GME autists can support each other.\n\nAnyone else feel like they're on the same boat ? \n\nMay the squeeze be with us.",
        "subreddit": "wallstreetbets",
        "title": "What the fuck is happening with GME. Time for a support group ?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kczhs8/what_the_fuck_is_happening_with_gme_time_for_a/",
        "created": 1607987796.0
    },
    {
        "author": "jwakk1",
        "created_utc": 1608649245,
        "id": "ki6x8s",
        "num_comments": 463,
        "num_crossposts": 0,
        "selftext": "Hey y’all, just a daily reminder that you are gonna miss out on the rocket that is GME. But there is still time. You should all get in sub-$20 aka right now. If you don’t know the DD, it’s simple: \n\n- console cycle\n\n-Ryan Cohen (he just bought more shares yesterday)\n\n- large short interest\n\n- company has paid off debt. \n\n- this thing could reach $30-$40 on fundamentals alone. \n\n- potential short squeeze\n\n\nDon’t miss the investing opportunity of a lifetime!! 🚀",
        "subreddit": "wallstreetbets",
        "title": "GME is on a moon mission",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ki6x8s/gme_is_on_a_moon_mission/",
        "created": 1608678045.0
    },
    {
        "author": "SIR_JACK_A_LOT",
        "created_utc": 1607471234,
        "id": "k9g3v3",
        "num_comments": 431,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "$200k loss porn on GME ER. Fuck you Sherman for making my dick limp #WeWantCohen",
        "url": "https://i.redd.it/1jwhryhrv1461.jpg",
        "created": 1607500034.0
    },
    {
        "author": "rustincoh1e",
        "created_utc": 1608779063,
        "id": "kj7f8c",
        "num_comments": 420,
        "num_crossposts": 0,
        "selftext": "Came across noise that GME has been on the reg sho threshold list for almost 13 consecutive trading days so I  decided to do some digging and boy did I find something interesting. So interesting that I dare predict a short squeeze could happen as early as tomorrow. The magnitude of the squeeze is something that will be hard to tell, and could be dependent on factors currently unknown to us, but it will definitely be an early christmas present for many. \n\n**What does it mean to be listed on the threshold list and what happens on the 13th consecutive day?**\n\nThe Regulation SHO Threshold Security List was created by the SEC in 2005 to reduce naked short selling. Stocks appear on this list when at least 0.5% of shares outstanding failed to be settled for 5 consecutive days or more. If a stock is on the list for 13 consecutive trading days, participants will be forced to close any settlement failures (a.k.a cover the naked shorts).\n\n**Is GME on the threshold list?**\n\nYou bet. 12 consecutive trading days starting from 8th December 2020. Quick maths mean the 13th consecutive day would fall on 24th December 2020. Shorts will be forced to cover tomorrow basically.\n\nhttps://preview.redd.it/wm6n09bbs1761.png?width=1145&amp;format=png&amp;auto=webp&amp;s=552c76e3fdf51d81989e7021f53316385030a4ad\n\n**Has this happened before?**\n\nYes. 12 consecutive days starting from 22 September 2020. Quick maths mean the 13th consecutive day fell on 8th October 2020. \n\nhttps://preview.redd.it/6r3d53lvs1761.png?width=1111&amp;format=png&amp;auto=webp&amp;s=6a9f42ae5235bbee1b1044b42f8ce5fa6a0f382d\n\nGuess what happened on the 8th October 2020? \n\n[Price shot up by 41.4&amp;#37; with a staggering volume of 76 million shares](https://preview.redd.it/kktrcq0pt1761.png?width=669&amp;format=png&amp;auto=webp&amp;s=d85baa22a8b5666de0e888355c90b8ce02c466f1)\n\n**So there will be squeeze tomorrow? By how much?**\n\nI am not a prophet but I am confident a squeeze will happen tomorrow. How much would be up to your own conclusion. All I can say is that back in October, almost everyone and their wives' boyfriend were bearish on GME other than the few OGs we have here. Ryan Cohen only had a 9% stake, GME gang and their theories were laughed off. Shorts were able to cover and close their naked shorts stealthily and without much trouble. \n\nThis time round, Cohen upped his stake to 13%. WSB Capital has entered the foray with approximately 5% stake, which will probably be watered down to 2.5% of diamond hands stake.  Senvest Management has entered with a 5% stake as well. Hedgeye with 90k twitter followers sets a PT of $50 for GME. Some big player has been buying lots of GME shares for the past 2 days. 30M and 25M volume respectively. There are still 68M shares short at the moment. The market closes early tomorrow at 1pm. Shorts will have to buy a shitload amount of shares in half a trading day. Don't forget, GME is attracting a lot of attention from FOMOs and boomers with the Hedgeye tweet. Shorts will have to compete with all these buyers to cover. True available float should be much lower this time round with more big players in, and retail investors knowing about the potential short squeeze, and most importantly pure autistic energy. \n\nTLDR: All in GME. Set sell limit at $420.69.",
        "subreddit": "wallstreetbets",
        "title": "Why GME could squeeze as early as tomorrow",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kj7f8c/why_gme_could_squeeze_as_early_as_tomorrow/",
        "created": 1608807863.0
    },
    {
        "author": "Bombayzayy",
        "created_utc": 1609258131,
        "id": "kmh65w",
        "num_comments": 407,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Hole the Line! GME to the 🌘🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀",
        "url": "https://v.redd.it/1idp0gj0h5861",
        "created": 1609286931.0
    },
    {
        "author": "DeepFuckingValue",
        "created_utc": 1607547864,
        "id": "ka0ndj",
        "num_comments": 399,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "GME YOLO post-Q3 earnings update — Dec 9 2020",
        "url": "https://i.redd.it/2hopni4d78461.png",
        "created": 1607576664.0
    },
    {
        "author": "dildoflexing",
        "created_utc": 1608672002,
        "id": "kiecy9",
        "num_comments": 396,
        "num_crossposts": 0,
        "selftext": "**Do you remember the last weekend of November 2020?** We had rallied from 12.xx to $16.18. AH reached 17+ We opened on Monday at $18.90.\n\n   The hype was so real that whole weekend. I remember that weekend clearly. I thought that finally, our day is coming. Can you relate? \n\n   However, the shorts actually saw this coming, and one short spent $17.8 Million dollars to keep the price down. This was one of the largest, if not the largest purchase of GME options ever (including calls). Note the timing at 3:51PM (ET)\n\n&amp;#x200B;\n\n[GME shorts drop their bomb.](https://preview.redd.it/ssjwlkh1qs661.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=afa8fbc61840b28d4792055d4ade6cba3a5dd6f7)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**So what, you ask? If you don't know what this does, it is time you learn about what something like this does. Credit to bennpeifert for this beautiful, simple diagram. (Please note that put options would do the exact opposite as a call option)**\n\n&amp;#x200B;\n\nhttps://preview.redd.it/esg11vsxrs661.png?width=760&amp;format=png&amp;auto=webp&amp;s=af79d1bb6d6a9d3ed9fcf274156e4c21b5118541\n\nWhat happened on December 1st? Soon after the market opened, for \"no reason\" we lost steam. It became a yet another one of those feedback loop situation. It started to drop, and we the boonies gas station non absorbent single ply paper handed autists that expect nothing but multi baggers in 48 hours or less lost interest. We sold, the price came lower, we sold more... etc and eventually what could have been a potential rally day ended with lower at $16.56\n\n   Please keep this in mind that we, retail/WSB as a collective are very easily manipulated. Just remember the wise words. \"*Fool me once, shame on you, fool me twice... you can't be fooled again!\"* Diamond hands!\n\n   **Just know that the squeeze is against large players that are diamond hands and diamond balls, as a result, the squeeze will likely not be fast and violent but you can expect it to be AT LEAST like JMIA or SFIX. Zoom out a little bit and check out them graphs.**\n\n   If you are thinking about getting into GME, it's not too late for either stocks or options. Don't worry about options' liquidity when it squeezes if you are thinking options. There will be plenty of MMs willing to buy it to exercise and sell the shares for some profit.\n\n   **Starting tonight, I'm going to write a daily DD with fresh perspectives you guys have not seen on here before. It just might show you guys what Cohen sees in GME.**\n\n**Stay tuned. We are just getting started.** \n\n   My position on GME is made up of shares as well as options JAN 15 15C, 30C, APR 16 30C. GME makes majority of my port.",
        "subreddit": "wallstreetbets",
        "title": "GME autists. Please DO NOT let the SHORTS Manipulate you like this again.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kiecy9/gme_autists_please_do_not_let_the_shorts/",
        "created": 1608700802.0
    },
    {
        "author": "Gareth321",
        "created_utc": 1607496434,
        "id": "k9mylo",
        "num_comments": 395,
        "num_crossposts": 0,
        "selftext": "[Following another quarter of losses, CEO George Sherman says he anticipates fiscal Q4 to see positive year-on-year sales growth due to next-gen launch.](https://www.gamesindustry.biz/articles/2020-12-08-gamestop-has-closed-462-stores-so-far-this-year-783-since-last-year)",
        "subreddit": "investing",
        "title": "GameStop has closed 462 stores so far this year, 783 in last two years",
        "url": "https://www.reddit.com/r/investing/comments/k9mylo/gamestop_has_closed_462_stores_so_far_this_year/",
        "created": 1607525234.0
    },
    {
        "author": "Uberkikz11",
        "created_utc": 1607216324,
        "id": "k7jp7f",
        "num_comments": 384,
        "num_crossposts": 0,
        "selftext": "So, about a month ago I made the observation that GME's U.S. website processes its order numbers in sequential order.\n\nGiven that, I have constructed a model that uses the quarter-to-date e-commerce order data, credit card data scrapes from two separate vendors (&amp; sticking my fucking finger in the air), as well as that bullshit finance stuff that nerds use to come up with a 4Q estimate since the sell-side analysts are such shit-head haters and probably work for Melvin Capital (fuck 'em).\n\nIDGAF is this is gibberish to you, but it tells me and the other autists that the analysts are fucking wrong and 4Q is going to crush Wall Street's estimates. Yes, 4Q20 which comes in March, not 3Q20 which comes on Tuesday.\n\nFeedback appreciated.\n\nInsert obligatory rockets here: 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀",
        "subreddit": "wallstreetbets",
        "title": "GME 4Q Bottom Up E-Commerce &amp; Financial Model",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k7jp7f/gme_4q_bottom_up_ecommerce_financial_model/",
        "created": 1607245124.0
    },
    {
        "author": "supremeslp",
        "created_utc": 1608656567,
        "id": "ki99rp",
        "num_comments": 372,
        "num_crossposts": 0,
        "selftext": "Today’s 25% move upwards was pure authentic buying. According to \\[iborrowdesk\\]([https://iborrowdesk.com/report/GME](https://iborrowdesk.com/report/GME)), shares available for borrow did not change at all today. This shows 2 things.\n\n&amp;#x200B;\n\n Firstly, the institutional shorts like BOfA and melvin have yet to cover, yet are getting pushed further underwater. When/If the squeeze eventually occurs, it is going to be violent. This also shows that the price dips at the 19 range was not a short attack but rather weak hands profit taking. \n\n&amp;#x200B;\n\nSecondly, a big player is accumulating. Either it’s Cohen trying to increase his stake for takeover(he’ll have to report within 2 days), or another institution buying. Either way its bullish.\n\n&amp;#x200B;\n\nNow, heres the important part. Take a look at this chart, paying attention to the red crayon marks.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/5i6dco7lqr661.jpg?width=3038&amp;format=pjpg&amp;auto=webp&amp;s=1d2c3e40eb68b649d7d8b42eb6acff2ad4f3a970\n\nBefore every console season, some idiots start shorting GME, resulting in a mini short squeeze in 2008 and  2014. At its peak, it had a share price of about $64. Now, take a look at how much higher the short interest is, and how much lower the float (total number of shares issued) is. Accounting for the same peak market cap, this gives a conservative estimate of $150 if the squeeze occurs. Note that due to the significantly higher short interest, it may very well exceed 150 by a mile.\n\n&amp;#x200B;\n\nLastly, for the short squeeze to occur, we need to all stop being paperhanded bitches. stop fucking selling at a 20% gain when u can easily get a 10x gain. The more liquidity u give to shorters, the less violent the short squeeze.\n\n&amp;#x200B;\n\ntldr: GME to $150 provided people stop being paperhanded hoes.",
        "subreddit": "wallstreetbets",
        "title": "Why a $150 price target for GME is realistic",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ki99rp/why_a_150_price_target_for_gme_is_realistic/",
        "created": 1608685367.0
    },
    {
        "author": "ramagram",
        "created_utc": 1606921718,
        "id": "k5awn8",
        "num_comments": 371,
        "num_crossposts": 0,
        "selftext": "My god it’s not fun, it’s hard to look at the majority of the time and you can’t introduce her to your friends and family out of pure unbridled shame and self loathing. But you keep her around because she makes your heart fuzzy and gives you the occasional reach around. But one day she’s finally going to wrap her head around that silly CICO diet, trade in the Taco Bell for tangerines and finally start doing actual exercise with that personal trainer she’s been seeing behind your back. She’s going to become the talk of the town and you’re gonna be sorry if you didn’t have the balls to stick around.",
        "subreddit": "wallstreetbets",
        "title": "Holding GME Is like dating the fat girl.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k5awn8/holding_gme_is_like_dating_the_fat_girl/",
        "created": 1606950518.0
    },
    {
        "author": "DeepFuckingValue",
        "created_utc": 1609448756,
        "id": "kny2rx",
        "num_comments": 365,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "GME YOLO year-end update — Dec 31 2020",
        "url": "https://i.redd.it/fc401csk7l861.png",
        "created": 1609477556.0
    },
    {
        "author": "CPTHubbard",
        "created_utc": 1608732318,
        "id": "kito44",
        "num_comments": 358,
        "num_crossposts": 0,
        "selftext": "***The Dude:*** *It's like what Lenin said…you look for the person who will benefit, and, uh, uh...*\n\n***Donny:*** *I am the walrus.*\n\n***The Dude:*** *You know what I'm trying to say...*\n\n***Donny:*** *I am the walrus.*\n\n***Walter Sobchak:*** *Shut the fuck up, Donny!*  *V.I. Lenin!*  *Vladimir Illanich Uleninov!*\n\n***Donny*****:** *What the fuck is he talking about, Dude?*\n\n&amp;#x200B;\n\nHello again, GME Tribe. What a fun day we had yesterday! Could it continue today? Only Melvin Capital (and maybe Ryan Cohen) knows!\n\nAnd an extra special hello today to our newest WSB lookie-loo, Mr. Cramer (Can I call you Jim? I’m gonna call you Jim).  \n\nNow Jim, from what I’ve been able to gather, you and your Boomer stocks and your Hot Manic Takes don’t always get a lot of love around here. But that’s not *all* your fault, Jim. The Paste-Eating Rocket Kids are often good for a solid meme (FYI: it’s pronounced “Mee-Mee.” Feel free to use that on air without verifying). But the Rocket Kids can be a dense bunch and they’re also often one click away from Total Financial Ruin (Quick shout out to SPCE: Pleas fly again). So you have to dig a bit in here to separate the wheat from the chaff, as someone like you actually says in real life. What the fuck even is chaff, Jim? And why do all Boomers seem to think that folksy farm-based idioms are the perfect way to conclude a thought?\n\nAnyway. Those of us who watched your teevee clips last week where you reference your interest in WSB know that you, Jim Cramer, might be one of the Olds, but that you also Think Young(TM). [https://www.thestreet.com/jim-cramer/stock-market-advice-moderna-boeing-fed-ftc-dec-15](https://www.thestreet.com/jim-cramer/stock-market-advice-moderna-boeing-fed-ftc-dec-15). So we’re going to do our best to help your young-thinkin’ brain find the Needle In the Haystack here so you can get All Your Ducks In a Row on GME.  Because we know that you’re a long way from being Put Out to Pasture, and though you may be an out-of-touch millionaire prone to facile yammering, we now ***like*** you here, Jim—simply because you mentioned us and that made us blush a bit since we’re needy Millennials who just want our Boomer mommies and daddies to Tell Us They’re Proud of Us. So even though the Paste-Eating Rocket Kids here are often Buying A Pig in a Poke (Christ, please do not *ever* say that or the kids’ Mee-Mees are gonna fuck you up), we appreciate you recognizing that, every now and then, there’s something worth paying attention to over in this weird little pocket of the Interwebs.  And since you’re actually telling your loyal single-finger-typin’ viewers to check out this WSB shitshow, and “*if they’re running GME, then do some work on GME*,” we assume you might actually be checking this shit out too, since all true Young Thinkers know that What’s Good for the Goose is Good for the Gander. \n\nNow, is the GME play as solid as your recent recommendation to buy Bed Bath and Beyond? Who knows? That seems pretty stupid, and I would look it up myself this weekend but my nice little Saturday is already pretty full so I don’t know—I don’t know if I’ll have enough time. But I’ll tell you one thing: the GME play is **a lot more fucking fun**.  Life in a pandemic is boring, but here in this weird WSB place, these kids like fun.  And for all your Boomer weirdness, you seem like you still like to have a little fun in this Mad, Mad world of ours. So consider joining us here more often.  A word of warning, though: if you don’t like all the dern cuss words we use around here, Jim, well that’s just, like, your opinion man, and we’ll have you know that the Supreme Court has roundly rejected Prior Restraint. \n\nFirst thing’s first: we have a bit of a bone to pick with you (now there *I* go). The stuff you said last week about GME as the next Blockbuster was D-U-M dumb, Jim. You were a bit out of your fucking element with that.  You even made our largest shareholder and conqueror-in-waiting, Mr. Ryan Cohen, send an emoji-only tweet in response, which if you know the super nice-guy Ryan Cohen like all of us do (we actually know nothing), that is pretty much the equivalent of him bringing his dog over to micturate on your and George Sherman’s rug.\n\nNow, I myself have never been into the whole brevity thing, but I wanted to take this opportunity to get you up to speed on the GME movie you’ve wandered into. And I know you’re down with this because you told all your viewers that if WSB is talking about GME, then “make sure you know GME.” So before you say something Absolutely Mad again and Cohen sends a tweet with an even less ambiguous emoji, it’s high time that you start Making the Sure here, Jim. Just consider this to be CPT Hubbard delivering you some Orange Sunshine and turning you on to some of that Sweet, Delicious Non-Chaff Wheat you love so goddamn much. \n\n**Part 1: GME’s Bonkers-Ass Short Interest**\n\nNow, I’m going to lead with the most crowd-pleasing part of the story here (Get ready, Rocket Kids!), and it’s the one that you did not even seem remotely familiar with in your “Stay out of GameStop, Deadbeat!” rant last week. Maybe that was by design or maybe not. We’ll return to that, Jim. But the point here is: the **short interest here is batshit insane**. And not just your garden variety Boomer in Rolled Up Sleeves Ranting About Buying Estee Lauder While Hitting Buttons On The Beep-Bop-Boop Machine kind of insanity. Really and truly fucking nuts.\n\nSo to TL/DR this shit for you, Jim (to use the parlance of our times): GME is **the** **most shorted stock** **trading today—by far**.   [https://financhill.com/most-heavily-shorted-stocks-today](https://financhill.com/most-heavily-shorted-stocks-today) How shorted? Well, the value of shares short exceeds the market cap of the company; there are currently ***more shares short than the total number of shares outstanding***. And when factoring in the institutional and insider ownership, the total short percentage of float is **nearly 300%**. [https://www.gurufocus.com/term/FloatPercentageOfTSO/GME/Float-Percentage-Of-Total-Shares-Outstanding/GameStop-Corp](https://www.gurufocus.com/term/FloatPercentageOfTSO/GME/Float-Percentage-Of-Total-Shares-Outstanding/GameStop-Corp) Even higher, actually, now that Cohen’s interest is over 10%.  Now, I’m not a numbers whiz like you, but that level of short interest and the small available float seems pretty fucked up to me. Like: “how is that even legal?” fucked up. And just for a frame of reference, the **third most shorted** security right now is your beloved Bed Bath and Beyond, with a short percentage of float at a nice and tidy 69%. But by all means run your manic ass over to the goddamn sound machine to get your viewers to munch on that big box stock.\n\nAre you starting to gather why some of us in this weird little pocket of the Interwebs are a little excited about GME? You see, as u/Jeffamazon and RodAlzmann u/Uberkikz11 and others have explained in these here corners and on the twitter machine with their top-notch DD, and as I will translate to you in lingo you can dig, the short sellers got way over their skiis on this one expecting a bankruptcy in Spring of 2020 that never came. And yet, amazingly, the short interest has only **increased** since then—there has effectively been no covering in the aggregate and, in fact, the short percentage has only **gone up**. And now, on the threshold of 2021, we all sit atop a massive powder keg wondering what is going to be the thing that finally lights this shit up. And at the end of this little missive, I’m going to tell you what I think that thing might be (Spoiler: It’s Ryan Cohen! Better start getting used to seeing his name, Jim, because this dude does not fuck around and he’s not going anywhere). \n\n[https://www.reddit.com/r/wallstreetbets/comments/k4csaa/the\\_real\\_greatest\\_short\\_burn\\_of\\_the\\_century\\_part/](https://www.reddit.com/r/wallstreetbets/comments/k4csaa/the_real_greatest_short_burn_of_the_century_part/)\n\n[https://twitter.com/RodAlzmann](https://twitter.com/RodAlzmann)\n\n[https://thecollective.finance/2020/10/gamestop-gme-a-squeeze-to-44-from-14-can-be-justified-fundamentally-100-of-the-shares-are-short-watch-out/](https://thecollective.finance/2020/10/gamestop-gme-a-squeeze-to-44-from-14-can-be-justified-fundamentally-100-of-the-shares-are-short-watch-out/)\n\n**Part 2****: GameStop Isn’t Going Bankrupt and People Actually Want to Buy Shit There**\n\nSo, you foul mouthed little prick, a bonkers-ass short interest is neat and all, but why is Jim Cramer wrong when Jim Cramer compares GME to Blockbuster you might be asking yourself in the third person. First, the most obvious answer, Jim, which you should fucking know already: Blockbuster was **nearly $1 Billion in debt** and missing debt payments left and right when it was delisted way back in 2010. That was also when there was a bit of a credit crunch, if you recall, right after that whole Housing Crash Unpleasantness that you saw coming from a mile away and from which you made hundreds of millions of dollars due to your contrarian foresight—I’m sorry, I’m clearly confusing you with Christian Bale starring as Dr. Michael Burry, weirdo head of Scion Asset Management, which also holds about 1.4M shares of GME (You really gotta start looking into this stuff, Jim – this story is made for TV, man—and you Boomers were raised by TV and you turned out TV!). Also, in 2010 when Netflix is ripping and when Blockbuster was about to be delisted and bankrupt, an analyst noted the obvious fact that Blockbuster  had “nothing on the horizon that makes it look like Blockbuster is going to be more profitable.” \n\n[https://www.reuters.com/article/us-blockbuster/blockbuster-wins-debt-reprieve-forced-to-delist-idUSTRE66052720100702](https://www.reuters.com/article/us-blockbuster/blockbuster-wins-debt-reprieve-forced-to-delist-idUSTRE66052720100702) \n\nBut Jim, if your Blockbuster comparison has any plausibility, GameStop must have a major debt problem then, right? And yet just last month GameStop **repaid $125M in debt** several months ahead of time. It’s also really weird that over the past year management bought back a ton of shares, taking the OS from 102M **down to just under 70M** (making a short squeeze even more likely, my Rocket Children). The weirdness continues with a soon-to-be-bankrupt company holding almost $500M in cash on hand. And according to George Sherman’s “Thine Omnichannel Shalt Be The Omni-est Channel of Them All” Conference Call following Q3, by March 2021 GME will have retired a total of $500M in debt and returned $200M to shareholders through stock buy backs. I’m no expert here, and I do not presently own a Beep-Bop-Boop Machine, but that’s all pretty weird shit to be doing if you’re about to go bankrupt.\n\nNo, no – I get it: who the fuck actually looks at balance sheets anyway before spouting off about what a stock is going to do? I sure as hell don’t. That’s why I follow my man u/Uberkikz11, since that dude is a GME DD Encyclopedia and was born to crunch numbers. No, when Really Smart People make the Blockbuster comparison, it’s usually just Mouth Sounds for: A B&amp;M Store That Used to Be Popular But Now Is Not Because Technology, QED. But here even the Really Smart People might be missing something as well. They’re right in the sense that GME must use this new console cycle window and cash influx to quickly pivot to a tech-first gaming company (more on that and our boy RC shortly!), but they’re wrong on the timing and relevance of this Super Smart Insight.\n\nSo fine, they’re doing ok on debt and cash. But who even goes to that 90s-Ass-Looking Cluttered Mall Geekery anymore anyways? I confess: in my darkest moments, as the short sellers manipulate the fuck out of this stock and I curse the names Bell and Sherman, I too have wondered this. But it turns out that, just like I have no idea why anyone listens to Maroon 5 or eats at Applebee’s, apparently a lot of people in America do shit that I do not. Crazy huh? So here is some pretty neat data showing us how out of touch we might be here, Jim: \n\nFirst, when a pretty large sample size of people were recently asked the question: *which of the following stores or websites do you plan to buy holiday gifts from*? The **#5 response** from United States Americans was none other than **GameStop** (Ticker, Jim: GME). Only Walmart, Amazon, Target, and Dollar Store (poor people buy gifts too, Jim) were ahead of little old GameStop. That’s higher than Nike, Macy’s, the Apple Store—and **double** the response of Bed Bath and Fucking Beyond in every category they surveyed. Check it: (h/t to my man u/snowk88) \n\n[https://stocktwits.com/snowk88/message/260983915](https://stocktwits.com/snowk88/message/260983915)\n\nThat’s kinda crazy huh? See Jim, when you Think Young(TM), you really can learn something new every day. And by following our man u/snowk88 (@snowk88 over at stocktwits), I learn lots of cool shit. But guess who already knew that? The guy that wrote this bad ass letter that identifies GME’s brand and customer data as being one of the most valuable things GME has going for it. [https://s.wsj.net/public/resources/documents/RC\\_Ventures\\_Letter\\_to\\_GameStop.pdf](https://s.wsj.net/public/resources/documents/RC_Ventures_Letter_to_GameStop.pdf) \n\nSo now we know that Real Life People actually buy shit at GameStop here in the year of our lord 2020. But like that analyst from 2010 said about Blockbuster, there must not be anything on the horizon for GameStop to be more profitable in 2021, right?\n\nNow, I will admit that being a bit bearish on GME in December of 2020 would make more sense if, say, GameStop were the nation’s largest purveyor of limp and half-lit pumpkin spice-scented candles and we were exiting the apogee of Shitty Candle Season. But as it turns out, GameStop is currently selling basically the most sought-after items that exist in the marketplace right now—where demand for the Xbox and Ps5 is far outpacing supply and is projected to continue well into 2021.  [https://www.gamesindustry.biz/articles/2020-11-17-microsoft-expects-xbox-series-x-s-shortages-until-q2-2021](https://www.gamesindustry.biz/articles/2020-11-17-microsoft-expects-xbox-series-x-s-shortages-until-q2-2021) I don’t really need to get into the details on that here, because it’s pretty goddamn obvious, but I think 2020 GameStop at the precipice of a new console cycle might be in a bit of a better position than, say, 2010 Blockbuster relying on the latest Adam Sandler release to lift its sagging rental numbers. But I don’t know. Millions of people don’t watch *my* show looking for Candid Analysis from me and *my* folksy man-of-the-people-lookin’ rolled-up sleeves.\n\n**Part 3:** **Ryan Cohen is the Sword of Damocles Hanging Over the Short Sellers’ Dumbass Heads** \n\nAnd now we’ve gotten to the best part. It’s my favorite part of all of this, Jim, and if you give this a little time, I think it will be yours too. You see, all that corporate bla bla bla about balance sheets and console cycles and early debt repayment and overleveraged short sellers and brand recognition is neat and all—and definitely worth a second look by itself. Maybe even a little Beep-Bop-Boop on the ol’ sound machine—I don’t know your fucking methods. But the real thing that’s about to rip all our faces off here is the business and investment decisions of a mild-mannered wunderkind named Ryan Cohen.\n\nNow you can revisit my prior epistle if you want to know a bit more about the involvement of Mr. Ryan Cohen in *Le Affair* *GameStop*. [https://www.reddit.com/r/wallstreetbets/comments/kakxrm/gme\\_tribe\\_a\\_story\\_about\\_how\\_ryan\\_cohen\\_is\\_about/](https://www.reddit.com/r/wallstreetbets/comments/kakxrm/gme_tribe_a_story_about_how_ryan_cohen_is_about/).  My fly-by-night theory of his lawyer’s possible use of the consent solicitation could have probably marinated for another day, but the thrust of my argument there was that Cohen and his attorney have been laying the groundwork to come after GameStop for a while now. And that Cohen was likely emboldened by the humiliating, lame-ass CC performance by some dude with a mid-century comic-strip sounding name that we’ll all soon know only as: The Guy With the Punchable Face Who Used to Be CEO of GameStop.\n\nBut here is where things get really interesting. This is a story in the making, Jim, for fucks sake - take notes! This Monday, on December 21, Mr. Ryan Cohen filed a revised 13D showing that last week he started buying a shit-ton of shares—starting on Tuesday December 15th—which is ***the day after*** the stock price inexplicably plunged on Monday the 14th and the very same day you were yammering on the teevee about GME being Blockbuster! Instead of listening to you, however, Cohen started buying more GME shares (super-sleuth dark pool watchers u/rgrAi and u/snowk88 noticed in real-time that there was some very large accumulation taking place), which culminated in the big reveal that Cohen purchased a total of 2,501,000 additional shares last week—500,000 of which were purchased on Friday December 18, 2020 **at the price of $16.02 a share**. Ryan Cohen is still the single largest shareholder of GME with 9,001,000 shares in total, taking his ownership of GME above the 10% threshold from 9.98% to 12.9%. And so he apparently thinks that the floor for his investment is $16.02 per share. Is he still buying? We’ll know soon. But yesterday seemed like a little taste of what it might look like if a large buyer steps in to prevent short sellers from manipulating all of my nervous little Rocket Children here and their delicate little paper hands.\n\nThere was another thing we learned from this 13D filing: Ryan Cohen has apparently hired a new attorney and law firm. Instead of the great Christopher Davis of Kline Kaplan, now Ryan Cohen is represented by Ryan P. Nebel, a partner with Olshan Frome Wolosky, LLP.  Now, if you’re familiar with my prior ramblings, you might wonder if I was a bit confused, and maybe even a little sad, at this sudden change from my man C. Davis. And you might be a little right. But then the wonder of the internet allowed me to learn a bit about these new lawyers. And holy shit, things are about to get fun.\n\nNow, I liked what I knew about Chris Davis and he seems like a genuine bad ass activist attorney. But the folks at Olshan Frome and Wolosky, LLP are Next Level Players and really seem tailor-made for this exact situation. First off, Olshan is ranked as **the top global lawfirm** for Activist Attorneys. [https://www.olshanlaw.com/assets/htmldocuments/Bloomberg%20Activism%20League%20Tables%20H12020.pdf](https://www.olshanlaw.com/assets/htmldocuments/Bloomberg%20Activism%20League%20Tables%20H12020.pdf) (H/t @flummoxed at stocktwits). They seem to be the go-to law firm for major proxy battles initiated by activist investors. But possibly even more important is that Olshan is the ***same firm that represented Hestia and Permit*** in their successful proxy battle earlier this year to appoint two new directors to the GME Board.  I’m not going into the fine details of that, because this is already a bit of a long-form Idiot’s New Yorker article, but GameStop just went through a proxy fight last year with Activist Investors Hestia Capital and Permit Capital, which resulted in two Board seats for our shareholder buds from Hestia and Permit. So, it’s reasonable to assume that the attorneys at Olshan might know their way around GameStop at this point and where the pressure points are here. \n\n[http://www.globallegalchronicle.com/hestia-capital-and-permit-capitals-two-new-directors-to-the-gamestop-board/](http://www.globallegalchronicle.com/hestia-capital-and-permit-capitals-two-new-directors-to-the-gamestop-board/)\n\n[https://www.olshanlaw.com/resources-mentions-HestiaCapital-PermitCapital-GameStop-BoardofDirectors-ShareholderActivism.html](https://www.olshanlaw.com/resources-mentions-HestiaCapital-PermitCapital-GameStop-BoardofDirectors-ShareholderActivism.html)\n\nAnd if you follow u/snowk88 over at stocktwits (@snowk88)—you don’t? ‘the fuck is wrong with you?— you’d also find a wealth of DD on how Olshan rolls when entering these activist-investor-replaces-dumbass-boards-and-CEOs type disputes. To bottom line it: **they get it fucking done**. \n\n[https://stocktwits.com/snowk88/message/266158534](https://stocktwits.com/snowk88/message/266158534)\n\n[https://stocktwits.com/snowk88/message/266155112](https://stocktwits.com/snowk88/message/266155112)\n\n[https://stocktwits.com/snowk88/message/266153175](https://stocktwits.com/snowk88/message/266153175)\n\nBut what else did we learn from the 13D? We learned that Ryan Cohen is definitely not going anywhere any time soon. Specifically, the filing notes that RC Ventures intends to continue to engage in discussions with GameStop’s board *“regarding means to drive stockholder value, including through changes to the composition of the board and other corporate governance enhancements.\"* And while RC Ventures *“desires to come to an amicable resolution with \\[GameStop, it\\] will not hesitate to take any actions that it believes are necessary to protect the best interests of all stockholders.”*\n\nI really like that last part, don’t you? And although I thought his November 16th letter was pretty goddamn clear, this 13D just ratcheted up the transparency level here. In sum, Ryan Cohen has all of our backs and he’s going to replace this Board and Sherman with people that are on the level and that will help implement his vision.\n\nAnd now seems like a good time to return to those “Ryan Cohen: Boy Genius” articles that were definitely NOT part of a well-coordinated pre-hostile takeover media campaign initiated last year. I think there might be a few things in those articles that Mr. Cohen wanted all of us shareholders (as well as the short sellers and the Board he’s about to replace) to really and truly understand.  Recall also that Cohen is not one for diversification or for playing it safe. So here’s a few choice nuggets for you to ponder:\n\n\\*\\*\\*\n\nBloomberg, June 2020: [https://www.bloomberg.com/news/articles/2020-06-05/chewy-founder-cashes-out-bets-on-apple-wells-fargo](https://www.bloomberg.com/news/articles/2020-06-05/chewy-founder-cashes-out-bets-on-apple-wells-fargo)\n\n· \"It's too hard to find, at least for me, what I consider great ideas,\" he says. \"When I find things I have a lot of conviction in, I go all-in.\" \n\n· Cohen uses the word “conviction” a lot. He says it’s something he learned from his father, who ran a glassware importing business in Montreal where Cohen grew up. “He taught me how to block the noise from the masses,” says Cohen. “To have a point of view and have conviction and not waver.”\n\n· He wouldn’t, however, recommend his \\[non-diversified\\] investment approach to everyone. “You need to have the temperament to block the noise,” he says. “Sometimes it feels like a roller coaster.”\n\n· He likens his obsessive focus on building Chewy to his approach to stock picking. \"I don't want to swing for a single,\" he says.\n\n\\*\\*\\*\n\nYou hear that, Jim? Our man Cohen likes idioms too! But fuck those farm idioms, Jim – we’re upgrading to the Sportsball kind now.  So what’s the takeaway here? I’d say that Cohen has his Eye On The Ball and that it’s time for all short sellers and the Board to Throw in The Towel because Ryan Goddamn Cohen likes to Take the Bull By The Horns and will ensure that he Hits a Homerun for shareholders that believe in his vision.\n\nHere’s a few more things Mr. Cohen wants all of us to know:\n\n\\*\\*\\*\n\nForbes, August 2020: [https://www.forbes.com/sites/zackfriedman/2020/08/16/entrepreneur-chewy-founder-ryan-cohen-shares-his-best-advice/?sh=41e1370e5840](https://www.forbes.com/sites/zackfriedman/2020/08/16/entrepreneur-chewy-founder-ryan-cohen-shares-his-best-advice/?sh=41e1370e5840)\n\n· “For me, each no sounded like they just didn’t understand my vision. It was frustrating at times, but never discouraging. Those ‘no’s never made me doubt my strategy – it was the opposite. I was motivated by all the rejections and they just got me fired up.”\n\n· “I understood that thinking big was likely going to be misunderstood along the way. I’m contrarian by nature, so being misunderstood often validates what I’m doing. It wasn’t until Chewy boxes were on doorsteps across the country that the bulk of investors started to recognize our formula.”\n\n· “\\[M\\]y biggest risk would have been not taking risk. The risk of going head-to-head against Amazon. The risk of insourcing fulfillment. The risk of building a company in Florida rather than a popular tech hub. The risk of spending $3 million a month on TV ads, more than Home Depot HD -0.1%'s budget. The risk of hiring expensive executives even though we weren’t profitable. These decisions were some of the most controversial and required me being comfortable betting against conventional wisdom, and were often contrary to the advice of my board. Suffice it to say, I was not the most popular board member.”\n\n· “Dad never swayed when he believed in something. I never compromised my vision, regardless how many investors turned me down I was not going to give up on building Chewy into the world’s biggest online pet retailer. I love to be challenged, and I’m flexible on details, but I’m never willing to give up.”\n\n\\*\\*\\*\n\nGoddamn it, Ryan. I was done having children but now you’ve forced me into getting back on that train just so I can name this future child Ryan Fucking Cohen. Thanks a lot, asshole.\n\nBut to return to my point: are those the statements of a man that seems likely to walk away at this point? Or is Cohen trying to tell us all to get ready because he is going **All In** on this shit?\n\nSo where does this leave us? After a huge week where Cohen buys 2.5M more shares and then the SP skyrockets to $20 yesterday on that news? Well, this is where I want to tip my cap to my man Justin Dopierala over at Seeking Alpha and allow him to conclude this section. He, along with his pal Dmitriy Kozin have been pretty clear-eyed on all this shit for a while now and they both deserve some credit. And I know I gave my main man Justin a bit of a hard time in my last novella, but the dude is sharp as hell and helped a lot of us see the forest through the trees here.  And you should also definitely invite him to join your poker nights (seriously: check out the dude’s tweet in response to our own Rod Alzmann’s introduction of the #WeWantCohen hashtag right after the Q3 call debacle). [https://twitter.com/DOMOCAPITAL/status/1336446055685230592](https://twitter.com/DOMOCAPITAL/status/1336446055685230592)  You have no comment on a potential takeover involving Ryan Cohen, Justin after your hour-long googly-eyed call together? Can’t believe you’re just preemptively leaving the WSJ and Bloomberg hanging like that. Justin, I love you dude, but if I’m holding pocket Kings I’m folding after that tweet because that twinkle in your eye lets me know you’re about to drop two Aces on my ass.\n\nAnyway. Here is what our man Dopierala thinks might happen here soon (and he called this way back on November 17th- and sorry - no links here, per the mods, as apparently no Alpha must ever be Sought from these parts):\n\n*I think a very likely outcome at this point is a majority slate next shareholder meeting where Cohen takes over BOD and then makes himself CEO. A majority slate proxy battle would require all institutions to call in shares and would force a squeeze.*\n\nWe’re intrigued, Justin. Please continue:\n\n*If Ryan Cohen successfully negotiates a purchase price with the Board then the shareholders will have to vote on it. Unlike the proxy battle where Hestia and Permit were running a minority slate of directors, an offer to purchase GameStop would force institutions like Vanguard and Blackrock to call in their shares. By doing so, the shorts would be forced to close out their positions and GameStop would finally have the greatest short squeeze of all-time. Ironically, Cohen could use this opportunity to sell all of his shares and use the proceeds to entirely fund the acquisition of GameStop going down as the first person in history to acquire a billion dollar company... for absolutely nothing. In fact, his acquisition price would be less than zero.*\n\nAnd now is when I get to speculate on what I think is going to happen here. But I do not necessarily think Cohen is going to put an offer to buy GME to take private. That would definitely trigger a MOASS, but I’m not sure I see it given the attorneys he’s hired and his recent buys up to $16 and the amount of cash that would take. Like Dopierala’s *first* comment, though, I think Cohen is going to nominate directors to replace nearly the entire Board of Directors with a vote happening at the annual meeting and once that Board is in place, they’ll appoint Cohen as CEO. And as Justin notes, if he nominates a majority slate of directors, shares will have to be called in to vote. And this vote and proxy battle will make the prior minority slate Hesita/Permit battle, and the tiny short squeeze that took place when that happened, look tame by comparison. Now everyone: get your calendars out. Because the date to nominate directors here is in **Mid-March**, and my super-smart corporate lawyer buds inform me that it’s standard practice to file about 7-10 days prior. So, if this actually happening, we should be seeing something on this by **early March**.\n\nBut even though early March is now the mark on the wall, today’s insane price action caused me to think about all of this a bit harder and speculate a bit more. And a major h/t to my buds on the stocktwits board, especially u/rgrAi (@amarbar) for all the sharp analysis on this. But if you were Ryan Cohen and you knew this company was hugely undervalued and you had a high level of **CONVICTION** here and also knew you needed shareholder votes to sweep out these dumbasses and implement your vision—then how would you play this with the short interest here as crazy as it is? I’d keep buying. Why? Well, lots of reasons, you smart alecks. First, so I have more guaranteed votes (duh?). Second, so that when the building starts burning and short hedge funds run for the exits they find that a mild-mannered Millennial with super-good ideas has sealed off all the doors and windows. That’s gruesomely delicious, isn’t it? Why else, CPT? Well, finally, and maybe most importantly, because I would want to excite and delight all my fellow shareholders by triggering a slow-burn short squeeze, raising the SP significantly, so that I can once again make the point (as he did in the Nov 16 letter) that the incompetent management that caused a **HUGE drop in SP** following that utterly incompetent Q3 call and the shelf registration, had **nothing to do with the SP increase** that again happened once Cohen announced his intent and started buying. Not the console cycle, not the cost containment measures, not the buybacks and not the early debt reduction. Nope: rightly or wrongly, shareholders will see Ryan Cohen buying shares and the corresponding SP increase and everyone—especially all new buyers who are delighted at their good fortune and swept up by Ryan Cohen Fever 2021—will start getting #WeWantCohen tattoos on their ass they’ll be so happy. And all of us, newly enriched by Ryan Cohen’s Big Canadian Balls and tactical brilliance, will crawl over glass to vote for him over The Boomer Artist Formally Know As GameStop’s CEO. I could be very wrong on this last point in particular, but if we start seeing 13Ds drop here shortly, things should get very fun very quickly. \n\n**Part 4: A Return to Our Short-Squeeze-to-Da-Moon Discussion: Who’s Side Are You Fucking On, Jim?**\n\nNow, Jim, given the fast friendship we’re creating here, and all we’ve been through over the past 5000 words, I hesitate in bringing this up. But we’ve all seen the video, Jim. You know the one I’m talking about. Yes, the one where you actually tell the truth about how short selling hedge funds manipulate the market to knock down the price of perfectly good securities that many hard-working people *invest in*—many normal-ass people all assuming they wont ever have to Point Where On The Dolly The Invisible Hand of the Economy Touched Them. But that’s not life now is it Jim? And fuck those poor-ass rubes for not knowing how to play the game with you sophisticated Masters of the Universe, *amirite*?\n\n[https://www.reddit.com/r/dashpay/comments/93evx4/jim\\_cramer\\_reveals\\_dirty\\_tricks\\_short\\_sellers\\_use/](https://www.reddit.com/r/dashpay/comments/93evx4/jim_cramer_reveals_dirty_tricks_short_sellers_use/)\n\n[https://dealbook.nytimes.com/2007/03/20/cramer-market-manipulator/](https://dealbook.nytimes.com/2007/03/20/cramer-market-manipulator/)\n\nSo where are **you** in this whole GME/Cohen story, Jim? You candidly (gleefully?) acknowledge that a prime strategy that shorts deploy is to spread negative rumors that are then amplified by Big Smart Trustworthy Financial Media Titans like yourself to shake out unsophisticated retail players like my Rocket Kids here—who because of their tiny paper hands and you mean short selling brutes often subsist on paste and paste alone. \n\nSo for this particular security, are you the one helping with the manipulation and actively creating the “new truth” or are you just one of the Useful Idiots that these short sellers use to manipulate with an anodyne, TV media-ready comparison like: *GameStop Is The Next Blockbuster*? And how in the fuck does this fit into your Think Young(TM) project, Jim? Because if there is one thing that we over at WSB fucking hate, it’s a bunch of Manipulative Short Selling Boomer Fuckwads. Why on earth would a hip Young Thinker like you want to be included in that crew, Jim?\n\nAnd I know we’re all friends here now, Jim, but I need to push back a bit on some of what you said in that video in such a cavalier whatareyagonnado manner. So if I understand you, short and distort and fomenting negative reactions from retail players based on deliberately false narratives is ***illegal***, but still easy as fuck to do \"because the SEC doesn't understand it.\" But you fucking do understand it, Jim! So why are you helping those short and distorters break the law here? Why are you being such an obtuse dumbshit? Just check out what happens to the borrow rate and short selling every time there is any good news for GME: \n\n[https://stocktwits.com/Slantedangles/message/264519950](https://stocktwits.com/Slantedangles/message/264519950) (h/t @slantedangles). This manipulation isn't just happening with GME; it is happening *everywhere*. It’s baked into the cake. And that is pretty fucked up that we all just accept it because *whatareyagonnado*.\n\nI think that one thing that those of us who truly do Think Young(TM) have a hard time understanding is at what point in your lives do you Boomers all finally come to realize that it’s maybe time to stop playing the game like you have been? What point do you finally have enough where doing the right thing matters more than getting paid? Maybe start by telling the truth more often—and maybe don’t go out of your way to help those corrupt-ass hedge fund managers who continually fuck over average people *merely because they were stupid enough to believe you all*. What contempt you Masters of the Universe have for all of them—for all of *us*. There is a bigger story here on GME and this out-of-control short interest (naked shorting, counterfeit shares)   [http://counterfeitingstock.com/CS2.0/CounterfeitingStock.html](http://counterfeitingstock.com/CS2.0/CounterfeitingStock.html) than even Ryan Cohen and the inevitable short squeeze we’re about to witness here. And it begins and ends with people like you and Melvin Capital and Bank of America not giving a fuck about the rules while thinking you’re smarter than the rest of us who do—but who lack power to do anything about it. And you know what? Maybe you *are* smarter than us. You certainly know how to play this game pretty well, as that video shows. But if I know my old school 1980s movies like I think I do, this is usually the part of the story where the rag-tag kids from across the tracks come over to show you hubristic rich fuckheads what happens when you fuck a stranger in the ass. \n\nNow I myself have never dabbled in pacifism, Jim, so this isn’t too much of a stretch for me, but seeing that video of yours and seeing the insane short interest and all the manipulation here makes me want to burn the whole corrupt system to the ground—while barricading the doors to trap in those arrogant-ass short sellers who lie and cheat and distort to profit off average people. And though I’m certain that this larger battle is not driving him, maybe that result is one that Ryan Cohen wouldn’t mind too. Though he’s a polite Canadian and would probably just let everyone know that he’s not really mad, just disappointed. But me?  I’m an Angry American and I say: Block the fucking doors and windows and light that shit up. \n\nSo maybe this epistle will be useful for your Think Young(TM) project and cause you to reflect a bit more on what’s really going on out there with this whole GME thing and the likely illegal shorting that has driven the short percentage of float to these insane levels, drawing in new retail shorts too stupid to know what’s even happening.  Or maybe it wont cause you to reflect in the slightest (count me as one of those cynical types that see your overtures to WSB as a transparent play for greater market share from the Young Crowd since your old-ass audience is dying and/or switching to bonds).  But in a few months when all the Billy Ray Valentines and Louis Winthorpes assembled here are toasting each other in stupid shirts on a white-sand beach somewhere, we do not want you to look back on your knee-jerk boomer-ass dismissal of GME and your Useful Idiot blathering with that same tinge of regret and longing you feel when you look at a pre-Client 9 picture of you and your old roomie: warm-toes-and-hosiery-enthusiast E. Spitzer, Esq.\n\nIn conclusion: GME = Blockbuster comparisons are for Simps and Corrupt Short-and-Distorters. Don’t be like them, Jim.  And to my Rocket Children: the only weapon we wield in this stupid game is Diamond Hands with a float like this. Toughen the fuck up.\n\nAnd Happy Holidays everyone.\n\n\\--CPT Hubbard\n\n**TL/DR**: Jim Cramer likes farm-based idioms and apparently being a useful idiot to scummy short selling hedge funds. DD on the GME turnaround is solid and overleveraged short sellers should be shitting themselves. Ryan Cohen, our polite, hard-working Canadian benefactor is about to rip all our fucking faces off and trigger a MOASS. Probably even by early March, if that time is good for you (he’ll text before he comes).  And fuck infinite regress: It’s rockets all the way down here.  **🚀🚀🚀** Now: diamond hands, motherfuckers.\n\n21,000 shares. 710 April 20/25/30Cs. 105 Jan 15/20Cs. This is a shitpost and is only to be used as investment and life advice for Mr. Jim Cramer, Esq.",
        "subreddit": "wallstreetbets",
        "title": "GME Short Squeeze and Ryan Cohen DD for Jim Cramer, The (Man)Child Who Wandered Into the Middle of the GME-Cohen Movie 🚀 🚀 🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kito44/gme_short_squeeze_and_ryan_cohen_dd_for_jim/",
        "created": 1608761118.0
    },
    {
        "author": "cagoulepoker",
        "created_utc": 1608562527,
        "id": "khiwt6",
        "num_comments": 355,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Ryan Cohen files 13D and now owns 12.9% of GME! 🚀",
        "url": "https://twitter.com/CVCResearch/status/1341015955288117249",
        "created": 1608591327.0
    },
    {
        "author": "UncleZiggy",
        "created_utc": 1608658056,
        "id": "ki9rsu",
        "num_comments": 334,
        "num_crossposts": 0,
        "selftext": "Does anyone know a reason for GME up so much, or is this the beginning of the short-squeeze? In a short-squeeze, how high do stocks typically climb?\n\n\nI'm aware that this will depend on how many people have shorted the stock, I'm more interested in how fast it will accelerate and what to look for and general trends from past short-squeezes",
        "subreddit": "stocks",
        "title": "Is GME currently in the short-squeeze (up 20% today so far)?",
        "url": "https://www.reddit.com/r/stocks/comments/ki9rsu/is_gme_currently_in_the_shortsqueeze_up_20_today/",
        "created": 1608686856.0
    },
    {
        "author": "veryforestgreen",
        "created_utc": 1607556808,
        "id": "ka3gey",
        "num_comments": 334,
        "num_crossposts": 0,
        "selftext": "**What we know**\n\n[Short Interest update for the 30th of November is 67.98M up from 67.45M](https://www.ortex.com/stocks/26195/shorts). Yes the shorts never covered jack shit. I hope people remember that almost everyone insisted that people buy shares or Jan or April calls not fucken weeklies. \n\n1.\t[Reported loss of 53 cents vs loss of 85 cents expected. Revenue 1.0B vs 1.09B expected.](https://ca.finance.yahoo.com/news/gamestop-gme-falls-despite-narrower-144802231.html)\n\n2.\t[100 million dollars  in shelf registration](https://www.sec.gov/Archives/edgar/data/1326380/000119312520312805/d67321d424b5.htm). Not shares, dollar amount. So if short squeeze brings this stock to 77.2$ (5B market cap) 2% dilution.\n\n3.\tNo mention of Cohen or Microsoft Deal.\n\nJust want to let people know that that 100m dollars (**NOT SHARES**) in dilution is just an option. Management put it out there either to make some $ when this short squeeze and/or to fend off Cohen for a bit. If you listen on the conference call. [Here’s the link but I'll just cut to the chase.](https://www.fool.com/earnings/call-transcripts/2020/12/09/gamestop-gme-q3-2020-earnings-call-transcript/)\n\n\\*William Reuter -- Bank of America Merrill Lynch -- Analyst\\*\n\n\\*OK. And then, in terms of the new shelf, you know, I saw that you mentioned general corporate purposes. Would you consider issuing stocks to repay debt under that program?\\*\n\n\\*George Sherman -- Chief Executive Officer\\*\n\n\\*No, that's absolutely not the intent. The intent here is to simply optimize flexibility and optionality. Period. There is a lot of unknowns going on in the marketplace with respect to this pandemic, ongoing flex of cases across the world, the impacts on our own businesses.\n\nAnd we're not immune to that, right? And, in that regard, look, we're going to continue to execute our strategies that have bolstered and strengthen our balance sheet. And you see all the work that we've done, including, if we go back to even the long-term debt levels in early 2019 until today, it's -- you know, as of this coming Friday will have reduced our long-term debt over $530 million, by March of '21, they'll be over $600 million. In that same timeframe, that same roughly 24-month timeframe, plus or minus, we also returned over $200 million to shareholders. So, I think -- look, the goal is to continue to focus on running the business and optimizing we run the business, but also be very pragmatic and make sure that we have capital flexibility with no intention to do anything other than maintain our flexibility.\n\nHopefully that helps you.\\*\n\n\\*Jim Bell -- Chief Financial Officer\\*\n\n\\*\\*And as far as \\[Inaudible\\] is concerned, we don't need it. We don't need it. Bottom line.\\*\\*\n\n&amp;#x200B;\n\n\\*\\*What now?\\*\\*\n\nSince this earnings the only thing that has changed is that management is confirmed to be survival mode to save their jobs because Cohen wants to kick them out. [Check Jeff’s DD on GME](https://www.reddit.com/r/wallstreetbets/comments/k4csaa/the_real_greatest_short_burn_of_the_century_part/) and ask yourself how much of that has changed? Nothing.\n\nEveryone knew that earnings was going to be shit since this quarter marks the END of the console cycle. \n\nFor all the doomsayers and fucken 1 ply toilet paper hands, you probably sold and took the loss after you got your ass handed to you by yours truly Melvin Capital. [Here you can see how the # of shares available dropped from 45k to 1k and fees basically skyrocketed.](https://iborrowdesk.com/report/GME) Short the shit out of the stock and hit all those stop losses and paint a terrible earnings picture for GME.\n\nThis isn’t the first time, last earnings they did the same shit (September 9,2020) stock went from 7.35$ to 6.23$ only to rocket up to 9$ in a week. They do this shit every earnings. \n\nGameStop is like PLTR, manipulated to hell by hedge funds except for GameStop they ran out of ammo (SI over 100% and they are underwater) and they’re firing blanks at you. Are you going to run and let them walk all over you or fuck them in the ass. [Look only at the charts (credits to Uberkikz11/Rod Alzmann) to see historically what happens during a new console cycle.](https://pbs.twimg.com/media/Eok1_dBXMAEIdmc?format=jpg&amp;name=4096x4096) This time is no fucken different. \n\n[If you need any reassurance just go to see who you are betting against,](https://www.thestreet.com/video/why-jim-cramer-says-stay-away-from-gamestop) but unlike the big short movie. This time you can fucken dance. \n\n&amp;#x200B;\n\nPosition 100% yolo shares 10k in shares. 💎 ✋ [I've been buying the dip.](https://i.redd.it/szsrb8hhytp51.jpg)\n\n&amp;#x200B;\n\nEarly response for all the 🌈🐻\n\nQ - No one goes to GameStop when you go to order online? \n\nA - Then why isn't Bestbuy/Walmart bankrupt because Amazon.\n\n&amp;#x200B;\n\nQ - Games are all going digital no one uses disc anymore.\n\nA - [75% of PS5 have disc, only 25% are discless because people still want disc.](https://www.eurogamer.net/articles/2020-09-21-playstation-5-digital-edition-stock-far-lower-than-standard-ps5-sources-say)\n\n&amp;#x200B;\n\nQ - GameStop going to go bankrupt like Blockbuster.\n\nA - [You working for Bank of America? Bond holders saying otherwise.](https://markets.businessinsider.com/bonds/gamestop_corp_newdl-notes_201616-21_regs-bond-2021-usu36328ab58)",
        "subreddit": "wallstreetbets",
        "title": "Short Interest Update on GME for 11/30/20 with commentary of the latest conference call",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ka3gey/short_interest_update_on_gme_for_113020_with/",
        "created": 1607585608.0
    },
    {
        "author": "AqeedBrat",
        "created_utc": 1607972959,
        "id": "kd43s9",
        "num_comments": 329,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "This is it boys. Basically all in GME",
        "url": "https://i.redd.it/8h7ie2hnb7561.jpg",
        "created": 1608001759.0
    },
    {
        "author": "DeepFuckingValue",
        "created_utc": 1607462009,
        "id": "k9d6kr",
        "num_comments": 327,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "GME YOLO pre-Q3 earnings update — Dec 8 2020",
        "url": "https://i.redd.it/8gv6opjv31461.png",
        "created": 1607490809.0
    },
    {
        "author": "DeepFuckingValue",
        "created_utc": 1608239142,
        "id": "kf69j1",
        "num_comments": 320,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "GME YOLO update — Dec 17 2020",
        "url": "https://i.redd.it/y4gwdjewat561.png",
        "created": 1608267942.0
    },
    {
        "author": "GdUppp",
        "created_utc": 1606870721,
        "id": "k4ykkh",
        "num_comments": 312,
        "num_crossposts": 0,
        "selftext": "However, luckily I managed to buy longer than usual expirations:\n\nPLTR $30c March 19, 2021\n\nGME $20C April 16, 2021\n\nThoughts on holding these? Both down over 50%, hoping for a bounce back over the next few months. Total investment = 15k, now worth around 7k, and it hurts...\n\nMy heart goes out to those who bought near term or weeklies. This market is WILD.",
        "subreddit": "options",
        "title": "Threw $ into PLTR &amp; GME at peaks",
        "url": "https://www.reddit.com/r/options/comments/k4ykkh/threw_into_pltr_gme_at_peaks/",
        "created": 1606899521.0
    },
    {
        "author": "BitRulez",
        "created_utc": 1608674788,
        "id": "kif9d5",
        "num_comments": 307,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "GME 🚀🚀🚀",
        "url": "https://v.redd.it/q2uzkav4at661",
        "created": 1608703588.0
    },
    {
        "author": "Sir_Yethalot",
        "created_utc": 1609416273,
        "id": "knoveb",
        "num_comments": 305,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "$PLTR &amp; $GME GANG REFUEL 🚀🚀🚀",
        "url": "https://i.redd.it/t8ardu3dji861.jpg",
        "created": 1609445073.0
    },
    {
        "author": "sneakersourcerer",
        "created_utc": 1608562721,
        "id": "khiyuc",
        "num_comments": 304,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "GME Bagholding",
        "url": "https://i.imgur.com/2qNRozR.jpg",
        "created": 1608591521.0
    },
    {
        "author": "Uberkikz11",
        "created_utc": 1609338540,
        "id": "kn3767",
        "num_comments": 296,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "GME Gang - Share Lending Education for Dummies",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kn3767/gme_gang_share_lending_education_for_dummies/",
        "created": 1609367340.0
    },
    {
        "author": "hot_exhaust",
        "created_utc": 1609146454,
        "id": "kln2wa",
        "num_comments": 292,
        "num_crossposts": 0,
        "selftext": "Alright buckos, Smelly Melvin Cuckital has tried everything - even rolling their worthless fucking puts up to the 24’s in a desperate attempt to get some sort of downward move.  Friday was all they’re gonna get.  Stonk is ready to rip.  Buckle up I’m going all in on 1/22 35c at open.\n\nPositions: currently a measly 1/15 13c.  Rolling up for the 35’s.  I know I know I’m poor.\n\nEdit: 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀",
        "subreddit": "wallstreetbets",
        "title": "GME UP 10% PREMARKET 🥜",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kln2wa/gme_up_10_premarket/",
        "created": 1609175254.0
    },
    {
        "author": "Noah_B_Dee",
        "created_utc": 1607520406,
        "id": "k9rslt",
        "num_comments": 289,
        "num_crossposts": 0,
        "selftext": " \n\nHey  guys, any of you that listend to the earnings/guidance from Game Stop know  how retarded management is.... We are all banking on an evolution or  chewie-fication of Game Stop rather than boomers doubling down on a dying  business and praying a new console cycle will save them. In light of the  new revelation that they are \"Creating\" 100m shares out of thin are to  either fight off cohens hostile take over, or to fuck us when the  squeeze takes off so they can profit off of us i was trying to figure  out how we as share holders can fuck over sherman and the fucks with him  and i found this gem...\n\n\"The  board of directors has the power to call general meetings and the   majority of general meetings will be called by the directors (S302 of   the Companies Act 2006).\n\nThe  members also have the ability to demand a general meeting.  Section 303  of the Companies Act 2006 requires the directors to call a  general  meeting once the company has received requests from members   representing 5% of the paid up share capital those entitled to vote at   general meetings of the company.\n\nUnder  S304, the directors must call a general meeting within 21 days  of  receiving such a valid request and provide for the general meeting to   be held on a date not more than 28 days after the date of the notice of   the meeting.\n\nIf the directors do  not call a meeting as required to do so, under  S304, the members who  requested the meeting, or any of them representing  more than one half  of the total voting rights of all of them, may  themselves call a  general meeting.\n\nThe Companies Act  2006 also gives the court the ability to order a  meeting and where a  resigning auditor has given a statement of the  circumstances connected  with his resignation, that auditor is also  entitled to call on the  directors of the company to convene a general  meeting for the purposes  of receiving and considering an explanation of  those circumstances. \"\n\nFor  those of you too retarded to see where this is going - all of us  holding shares should write a letter and demand a share holder  meeting.... WSB holds around 5% and im sure Cohen and Burry would help  out and boom... we get to force Game Stop/Sherman to address Cohens letter and  we get to ask the questions.. be the big man with the microphone... we  get to swing our dicks while looking at swim suit magazines.. we... oh  right i forgot to take my adult hyperactivity dis... oh look a butter fly... any how... I think  it would be a  great headline \"WSB calls share holder meeting\"....  What do you guys  thinks?",
        "subreddit": "wallstreetbets",
        "title": "WSB: Lets demand a GME share holder meeting",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k9rslt/wsb_lets_demand_a_gme_share_holder_meeting/",
        "created": 1607549206.0
    },
    {
        "author": "thatzwhatido_1",
        "created_utc": 1607190548,
        "id": "k7bzkw",
        "num_comments": 280,
        "num_crossposts": 0,
        "selftext": "When I first joined this sub, I was a proud member of PRPL Gang. Ever since then I’ve been looking for the next train to jump on. \n\nI was on the BABA train until Xi sent us back to the Ming Dynasty. \n\nAfter reading what at first I thought was softcore porn(I was undeniably stiff while reading through), I realized it was actual DD.\n\nI sold all my current positions, and went all in on GME.\n\nI want to pay off my house within the next couple months. My wife also deserves a boyfriend that’ll treat her right. \n\nEither way, win-win. \n\n36k in 4/16/21 25c\n\nAlso picked up 9 shares cuz I don’t like leaving any buying power on the table.\n\n[Positions](https://imgur.com/gallery/sKBrWnF?s=sms)",
        "subreddit": "wallstreetbets",
        "title": "GME Gang checking in",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k7bzkw/gme_gang_checking_in/",
        "created": 1607219348.0
    },
    {
        "author": "PmMeClassicMemes",
        "created_utc": 1607398155,
        "id": "k8wgu9",
        "num_comments": 275,
        "num_crossposts": 0,
        "selftext": "I worked for Doordash for nearly two years. I didn't get fired, and this post will be solid DD about how their business operations are dogshit, not me whining because I was underpaid or let go(tho I was underpaid).\n\n**1) The fucking network goes down constantly, their tech is trash**\n\nGo read /r/doordash_drivers or any other employee sub. AT LEAST once per month, on a Friday or Saturday night, the ENTIRE network goes down for at least 1 hour. What happens when the entire network goes down? All restaurants still have to be paid for the food they made, and all orders have to be refunded to customers, who also demand refunds because their tendies were late. Yes, sometimes companies shit is fucked, Facebook has an outage sometimes too. But it happens to Doordash constantly, BEFORE COVID doubled their order volume.\n\nRegarding their tech - here's how the process is supposed to work.\n\n1)You punch in an order for tendies.\n\n2) The restaurant gets a little ping on their tablet saying \"Order? Ya takin this brah?\" (or, LMFAO, the Doordash CALL CENTER CALLS THE ORDER INTO THE RESTAURANT, YES, THEY REALLY DO THIS)\n\n3) The restaurant clicks accept and starts making the food.\n\n4) The Doordash Network does the travelling salesman optimization poorly and offers the order to drivers.\n\n5) A driver accepts\n\n6) The restaurant hits a \"confirmed rdy\" button and the driver, notified via text message comes in an picks it up.\n\nAt EVERY single point in this process, with regularity, I would see evidence that the Doordash system sent the process forward without confirmations. If a restaurant didn't turn their tablet on that morning? Doesn't matter, I'm at the restaurant now asking about an order that they never knew they had, but SOMEHOW confirmed it was ready - despite having a tablet with a dead battery. I'd have my phone in one hand with the \"Order Ready For Pickup at Tendie Shop\" text message in one hand, and be holding the restaurant's dead tablet in my other hand.\n\nCustomers would call me, two seconds after I left the store having hit \"Picked Up\", asking me where I was, because the app told them I was outside.\n\nWhat happens when their network delivers confirmation notifications that are lies? Lost money.\n\nUber has algorithms that automatically price rides and orders. The price changes with demand. What does Doordash do? Charge the same for every order, and pay drivers \"boosts\" in minimum increments of a half hour. So what happens is every Friday or Saturday night, there will be a \"2$ boost\" on all orders from 5pm-9pm. But let's say the system is still saturated at 6pm - then they add a boost from 6pm-9pm for another dollar. But if it dies at 7pm, they can't take the boost off. And if it's overloaded on a Sunday, they basically never add one no matter what. I suspect this is because they don't have an algorithm, they have people they pay to look at network data live and make decisions (poorly).\n\n**2) They don't know how to run a fucking business**\n\nRepeatedly, I would be placed in situations where the simple and proper customer service thing to do was A, but because it saved half a dollar in the short run, I did B and fucked the customer over, because Doordash wouldn't pay me to do A.\n\nHere's an example. New Year's Eve, 230am. I get a double order from a Chinese restaurant. One going way North, one going way South. I live North past the North order, gonna go home after.\n\nThe way double orders work is that drivers get paid a little less, because it's only one pick up. No problem, that's fair!\n\nI get to the Chinese place. They have North order ready, but not South order. They say it will be 30 minutes for South order.\n\nI call Doordash support (more on them in a moment). I explain that the next customer's order will be delayed.\n\nHere are the possible outcomes :\n\nA) Out of the kindness of my heart, I waste my gas (and miss out on pay!) to make North Customer happy, I deliver his order right now, and then come back and get South Customer's order.\n\nB) I sit there for 30 minutes and let North Customer's order get (c)old because they won't pay me extra to deliver it separately, even though it's now two orders.\n\nWhat do you think happened? They wouldn't pay me. I'm an \"independent contractor\", I don't run a fucking Doordash customer charity. North Customer's order got cold. I'm sure he bitched and complained rightfully, and Doordash had to refund his food. Doordash saved 6$ by not paying me, only to probably lose this customer and lose the order's revenue anyways.\n\nLet's talk about support now. Every single restaurant I ever talked to regarding support would make me call about any issue, because the Restaurant Support line ALWAYS had a minimum 30 minute hold wait. They just didn't give a shit.\n\nI've dealt with Uber, DD, Instacart, lots of different support callcenters for this shit. DD hires the Phillipinos that don't speak english well enough to work at the Uber call centre. I would have to hang up 1/5 times I called and call again, because the person I got could not fucking understand what I was saying. I don't have some kind of weird speech impediment either I s2g.\n\nTheir support are total idiots too. Here's a good one.\n\nI try to deliver Chinese to some people. I hear loud music in their apartment. I knock ten times over 5 minutes. I text them twice. I call them three times in the same period. They won't come to the door.\n\nI leave and go do the next order. Support calls me back, says hey, can you go deliver that order? They said they're sorry. I said sure, i'm only a few blocks away anyways.\n\nI go back, same shit happens again, they don't come to the door. I leave again. Support calls me again 20 minutes later, I say this time I'm not going back unless they pay me extra, I've been back once for free already. Support says sure, we'll give you 5$.\n\nI go back, and deliver the food. This time, they come to the door to get it, and the most obviously fucking spun up meth-head i've ever seen comes to the fucking door. I tell support \"Yo, you should ban these ppl from the app, they're high as fuck and wasting my time\". Support says \"That's a good idea, it says here they say their order didn't get delivered like half the time, probably scamming\".\n\nNext week? I get an order from the same Chinese place to the same address, apartment number and all pop up in my app. Declined, so no problem for me. But DD? You can't ban cracked out scam artists who cost you money?\n\nI could go on and on. Essentially in most instances, Doordash support fails to protect the long term interests of the company, which screws over good customers and lets scam artistry run rampant.\n\nMy friends are all hipster foodie millennials and Doortrash has the reputation among ALL OF THEM as the least reliable app, where the app doesn't work, their food goes missing or ends up 3hrs late for no reason. Nobody likes it.\n\n**Doordash is what happens when someone starts a competitor, hoping to get bought out, and then they never get bought. Corona happens and they decide \"oh, maybe we can IPO then and that's how we get rich and get out of this mess?\"**\n\nTL;DR SHORT DOORTRASH\n\nPositions, all stock, will be shorting DD with my GME profits soon enough.\n\nGME, REDACTED SHROOM RELATED PENNYSTOCKS, BPY.UN, VDY",
        "subreddit": "wallstreetbets",
        "title": "Why you should Short DOORTRASH",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k8wgu9/why_you_should_short_doortrash/",
        "created": 1607426955.0
    },
    {
        "author": "hooman_or_whatever",
        "created_utc": 1607580925,
        "id": "kaa2qh",
        "num_comments": 274,
        "num_crossposts": 0,
        "selftext": "Hello Reddit,\n\nGME is not a question of a business model in the future, it is a question of right now. I understand the need for numbers and figures, I do. Technical and fundamental research is viable and necessary, but one very over looked method of analysis is philosophical. We have seen DD after DD talking about the numbers and the business model. But I want to share some thoughts with you of my logical thinking and would love to see counter points.\n\n**First Let's Recap**\n\n**Pre-Earnings (Aug-Dec)**\n\nAlready was running up and then r/wallstreetbets massive hype of a short squeeze and Cohen letters leads to a run-up followed by a sell-off due to overbuying. \n\n**During Earnings (12/7):**\n\n[Earnings Call Transcript](https://www.fool.com/earnings/call-transcripts/2020/12/09/gamestop-gme-q3-2020-earnings-call-transcript/)\n\nThe conversation and presentation actually had good content. Their balance sheet looks fantastic; eliminated debt, reduced costs, making changes towards the digital transformation, e-commerce way up, console sales upcoming, new inventory and other positives they didn't even mention like the [Microsoft deal](https://news.microsoft.com/2020/10/08/gamestop-announces-multiyear-strategic-partnership-with-microsoft/). But the stock plummets...why?\n\nThere were two pieces of \"bad news\": \"missed revenue\" and \"shelf offering\" which PR blasted in a very negative light taking it completely out of context. Revenue missed was expected, not just because it's GME but because of COVID-19 effects on a retail business. \n\nRevenue: Loss was expected, not just because it's GME but because of COVID-19 effects on a retail business. \n\nShelf offering: $100M and has two years to be used. \n\nFirst comment was by Jim Bell: \"\"However, as a pragmatic matter initiating this program provides us with the maximum flexibility and optionality to further bolster our balance sheet and liquidity position and increase flexibility gives us the ability to leverage opportunities to accelerate our transformational strategies, such as increasing the speed at which we elevate expand our omni-channel strategy while further ensuring minimal disruption from any potential further pandemic impacts around the world.\"\n\nWhen asked by William Reuter from BoA. \"OK. And then, in terms of the new shelf, you know, I saw that you mentioned general corporate purposes. Would you consider issuing stocks to repay debt under that program?\"\n\nGeorge Sherman responded: \"No, that's absolutely not the intent. The intent here is to simply optimize flexibility and optionality. Period. There is a lot of unknowns going on in the marketplace with respect to this pandemic, ongoing flex of cases across the world, the impacts on our own businesses.\"\n\nMy thought: It's a defense mechanism to attempt to do one of three things:\n\n1. Help combat against a Cohen takeover\n2. Collect profits on their way out because they know a short squeeze is imminent\n3. They truly want to use it as they said \n\nMy issue with 3 and what they said when asked by William Reuter, is that they have significantly improved the balance sheet and COVID-19 vaccinations have begun, not to mention they are intending on shifting focus on e-commerce, so it just struck me as a very odd reasons for a shelf offer. \n\nNonetheless, during this call the share price absolutely plummets, but why? We received a lot of good news and two pieces of \"bad news\". One was expected (revenue loss) and one was addressed during the call (shelf offering). There was no intent on share dilution at least not anytime soon.\n\nMy thoughts: Only thing I can think is PR putting a negative spin, but more-so it was the bears using the negative PR to their advantage to drive the price down. $14 was the floor by the end of AH.\n\n**Post Earnings (12/9):** \n\nA war rages over $14 keeping it nearly level the entire day.\n\nMy thoughts: Bears expected much lower yet the bulls fought hard. On a bleeding red day where bulls clearly had the disadvantaged portfolios, they were able to support and actually start a small uptrend.\n\n\\#WeWantCohen starts trending and Ryan Cohen puts out a [cryptic Tweet](https://twitter.com/ryancohen/status/1336775515101949963).\n\nMy thoughts: He is completely dissatisfied with management and their ability to address his concerns outline in the letter. After ER the PR that went out and thoughts on the future of the company could have been beautiful if addressed and pitched correctly. Management did not provide comfort in the eyes of anyone and the stock price reflects that as does the PR.\n\n**What's Next?**\n\nThe moment you've all been waiting for. Let's gather some facts.\n\n1. Individuals own 9.87% \n2. Cohen (RC) owns 9.98% \n3. Michael Burry ( Scion) owns 4.3%\n4. GameStop Market Cap $890.11 Million\n5. Cohen net worth $14.6 Billon\n\nCohen could either purchase enough shares to have majority vote or he can outright make an offer to buy the company. So why hasn't he?\n\nThere are two current possibilities:\n\n1. He conducts a hostile takeover.\n2. He has no plans to conduct a hostile takeover.\n\nReason 1 probable timing and outcome: If you were about to make a large purchase, wouldn't you want to get it at the best price possible? He's waiting until he feels like we are actually at the floor before making a move. Truthfully, all he has to do is speak. If he even mentions an intent of acquisition the shorts will run and the bulls will pile in triggering the squeeze. **Bulls win**\n\nReason 2 is interesting because why would he own 10% of a company where he clearly doesn't believe in current management? So, if a hostile takeover isn't the reason, then what is?\n\nI can think of two possibilities:\n\n1. There is already something happening behind the scenes to peacefully put Cohen into a position of power. **Bulls win**\n2. He thought being 10% owner would give him a large enough voice to be convincing, when he realized the board does not share his vision, he pulls out. **Bears win**\n\nNow, this is interesting.\n\nReason 1 seems highly unlikely to me simply due to his tweet today. If there were plans for a peaceful transition of power, I don't think he would add fuel to the fire of bad PR clearly doubting managements skills.\n\nReason 2 is juicy. Between RC, Scion and Individual investors who all want to see Cohen at the helm, that accounts for 24.15% of the company. If RC pulls out, the rest follow, no bulls left to fight the bears, the institutions pull out and GME becomes a penny stock. \n\nMy overall prediction is the **bulls win.** The reason being, I can chart one path to victory for the bears but many paths to victory for the bulls. Also, I do not think we will need to wait until Q4ER to see the squeeze. From each scenario I could think of, Cohen would act sooner rather than later if he intends on purchasing or accumulating enough shares for proxy in order to get the best price possible.\n\nNotice how nothing I said has to do with the future of the business or the business model as a whole? That's because that doesn't matter. Q4 earnings will boost the price high enough for bulls to profit a little and then get out if they don't believe in the company. The overall longevity of the company is a complete different debate. \n\nFeel free to counter-point in the comments.\n\n**TLDR:** You should read.",
        "subreddit": "stocks",
        "title": "GME Either Squeezes or Gets Delisted - Who Will Win Short or Squeeze? Predictions here",
        "url": "https://www.reddit.com/r/stocks/comments/kaa2qh/gme_either_squeezes_or_gets_delisted_who_will_win/",
        "created": 1607609725.0
    },
    {
        "author": "chundlestiltskin",
        "created_utc": 1608861770,
        "id": "kjr5y2",
        "num_comments": 273,
        "num_crossposts": 0,
        "selftext": " I just discovered the \"Poor man's covered call\". I understand the basics. You buy an ITM leap, and sell OTM weeklies/monthlies to recoup your premium. My question is, if your weekly gets exercised while you're well over the ITM strike price of your leap, you still make the difference in option premium in profit on top of all collected premiums correct? Also, assuming you've recouped your LEAP premium by the time the stock tanks, you'll have no remaining risk correct? As MEME stocks find new price floors and greater resistance from MMs, I just feel like PLTR or GME would be ripe for this sort of play.",
        "subreddit": "options",
        "title": "The poor man's covered call",
        "url": "https://www.reddit.com/r/options/comments/kjr5y2/the_poor_mans_covered_call/",
        "created": 1608890570.0
    },
    {
        "author": "imm_uol1819",
        "created_utc": 1609185254,
        "id": "klxm3b",
        "num_comments": 264,
        "num_crossposts": 0,
        "selftext": "Today was eerily similar to Monday November 30th: explosive premarket and a shitload of short raids throughout the day.\n\nNovember 30th created the first $18-$19 bagholders. But guess what? Less than 4 weeks after that, they were already up almost 20%.\n\nMoral of the story: don't get discouraged by Melvin Mondays. They're not crushing our hopes by bringing the price down from 22 back to 20 or even lower.\n\nWe've learned. We diamond hand. We will survive. We will toast to their bleeding puts.\n\nGME 🚀🚀🚀",
        "subreddit": "wallstreetbets",
        "title": "GME gang: hold strong on Melvin Mondays",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/klxm3b/gme_gang_hold_strong_on_melvin_mondays/",
        "created": 1609214054.0
    },
    {
        "author": "jbro12345",
        "created_utc": 1608941595,
        "id": "kk8u2v",
        "num_comments": 263,
        "num_crossposts": 0,
        "selftext": "I am so tired of all you retards posting shit about AAPL and all these other small dick fucking plays. We have one purpose and that's it. Remember when your wife put on her sluttiest outfit last night before going out with her friend from work? She told you your only purpose was to have ice packs ready for her thighs and bandaids for the scrapes on her knees? Yeah, well this is even more direct and serious. \n\nYou have one purpose in this life. Fuck Melvin Capital and his bitch ass boys so hard that when they burp next Christmas, it smells like fresh semen. What that means for you paint sniffing crayon eaters is simple. \n\n**DUMP EVERY CENT FROM YOUR FAST FOOD JOBS AND CHRISTMAS MONEY INTO GME**\n\nGuess who isn't gonna have a happy new year? Yeah you guessed right, 🌈. FUCKING. 🐻's. This next week we are gonna shake the world to it's fucking core with the same sheer, absolute will of a retard jumping out of a moving car to follow the golden arches of McDonalds. Nothing can get in our way. All the wet toilet paper cucks sold already, (ice packs and bandaids aren't cheap) and we know Christmas stamina makes their wives boyfriends even stronger. We can now impose some real autistic willpower into these shorter's souls. \n\n**THE ONLY PLACE TO YOLO** \n\nGME. THATS FUCKING IT. I just refilled the thrusters with more astroglide and although it's slippery, we are gonna squeeze like VW out of this atmosphere. Here is some emojis for the braindead fucks that haven't figured out how to use a voice over software and have this shit read out loud for them. Even blind people figured that out, but you retards just stare at the text with a finger in your nose sucking down a bottle of glue hoping for a Christmas miracle.\n\n🤚💦💦💦🚀🚀🚀🚀🌍\n\n\nStop being so dense and retarded. Calls dated after Q1, everything else dickrammed into shares. I can't fucking read another post with some cuck crying about his weekly OTM calls expiring worthless, when he is actually supposed to be in his chair watching his wife get porked by her coworkers. Stop trying to tear your relationships apart and give them the attention they deserve. If your phone is out, you should be recording, not bitching about your stupid FD's. \n\nThis shit is official. \n\n**SHARES AND CALLS DATED AFTER Q1**\n\nEveryone that actually wants to make money instead of lose it, will already know this. \n\nNow go put your fucking medical helmets on, your mouth guards, anti-scratch gloves and prepare for the war of the fucking decade. If you have access to margin, credit cards, and student loans, don't be a degenerate retard who goes and buys weekly calls. Spend at least 200% of your net worth on shares and maybe you can go be someone's wife's boyfriend. Is that clear? The shorters are sweating and it's dripping down their ass crack. Take advantage of it and stop being a cock gobbler. \n\nTL;DR for you retards with the attention span of a paper bag. GME shares make rocket shoot up. With lube, rocket so slippery that it squeezes out of atmosphere. Literally can't do tit's up. Tit's up bad, GME squeeze up, good. \n\nGME blasting to the massive cock of Orion's belt. \n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🌑🌑🌑🌠🌠🌠🌠🌌🌌\n\nIs that enough fucking rockets? It's not supposed to be a goddamn picture book, but I hope it got at least one of your 3 synapses fired up.",
        "subreddit": "wallstreetbets",
        "title": "Listen up frog brains. GME 🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kk8u2v/listen_up_frog_brains_gme/",
        "created": 1608970395.0
    },
    {
        "author": "FUPeiMe",
        "created_utc": 1609014862,
        "id": "kkped2",
        "num_comments": 260,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/7mgl68kldl761.png?width=1198&amp;format=png&amp;auto=webp&amp;s=4609f822018e1c0830c53ccf4e65442b4cb3b222\n\nBecause I'm a naturally skeptical person, particularly when anonymity is a feature, I offer proof to avoid any BS below.\n\n**Confessions of a Voyeur:**\n\nI enjoy reading about insanely degenerate \"YOLO\" moves or some of the all-in or bust plays but that's not my style and I suspect not the style of many on here so I thought this might help to see another flavor. Having read and been entertained (and inspired) by some of you who have shared your stories I have decided to do the same to offer a slightly different perspective and I of course do not mean to criticize any other strategies. I actually thank all of you who have shared your gains and losses for our collective entertainment. The big losses especially always help to keep me grounded to a strategy of going after double and triples instead of only grand slams. In fact, quite the opposite and I'll have a few shout-outs that come to mind below.\n\n**A Journey of Five Years to Seven Figures:**\n\nI will keep things brief because I know only a fraction of the membership can read, and then another fraction within that grouping can read more than a few sentences, but I think it's crucial to draw a line in the sand when I really got serious with this goal as 2020 marks the first time I rolled over $1M.\n\nI would say 2015 was the year when I started making what I would deem *good money*, at least in my eyes. A top priority of mine was to pay off all debt (minus a mortgage) and I achieved that. At the end of the year, though, I was lucky enough to be blessed with a CPA who explained something to me which has guided my investing ever since. **He explained how an IRA account works, the different types, and most importantly the fact that taxes are deferred. This is critical to understand if you're serious and I'll cover that below.** At first I thought I was misunderstanding him but long story short, I was not. While I would say that since starting my career I was hyper focused on my business I would also say I was equally focused on tax-minimizing strategies and when I learned about deferring gains until far into the future I was hooked!\n\nAt the very end of 2015 I opened my first two IRA accounts, a Roth IRA and a SEP IRA, and in the first quarter of 2016 I fully funded both to the max.\n\nCandidly, while in life I'm fairly comfortable with risk (I gamble regularly, I ride a motorcycle, business risks, etc) I would say I'm more conservative on the investing side (relative to the degens I find here). The first few years of my investing was essentially comprised of maxing out my annual limits on any IRA I could open (those familiar with Roth and other types will know about AGI thresholds limiting what accounts can be contributed to or not) and utilizing index funds as a form of passive investing.\n\n**Pro Tip #1: If you're not maxing out your IRA accounts annually if you can afford to you're retarded, period. And if you don't have any IRA accounts to invest in after reading this then you might be mega-fucking-retarded.**\n\nAt times I stupidly thought I'd \"time the market\" and I'm embarrassed to say that during this incredible bull market run we've been having since 2010-ish there were occasions where I'd move to cash because I didn't want to have any big drops. I've done a lot of reading on this topic since and I think this was a combo of stupidity first but also the age I was when the 2008/2009 crash happened and how it warped my perception of the stock market in general. Though I have had plenty of losing plays, particularly moments of gay beardom where I'd short companies, the bigger mistake was thinking I had even a slight ability to spot market highs and lows.\n\n**Pro Tip #2: Basically 99.9% of** **~~gamblers~~** **investors have no real ability to consistently time the market.**\n\nIn 2018 I decided to take a more active role in my wealth accumulation and this is where my tax aversion strategies really paid off. Because I had been maxing out every IRA account I could get my hands on (eventually ended up with a SEP, Roth, and solo-401K) I had \\~$200K of contributions through 2017 and once I threw in my full 2018 contributions I was off to the races! Now, not all of my money is in retirement accounts unfortunately and my strategies of plays are largely dependent on the account in which I'm making the play (meaning, plays that are short term in nature are made from retirement accounts and plays that are long term go through my non-retirement accounts).\n\n**Pro Tip #3: The CV19 dip was probably a once in a century type of opportunity. I say this because it happened so fast AND it recovered so insanely fast and strong. Don't expect every year to be like 2020 for investing. Growth I had during CV19 was much more luck than skill.**\n\nThis year was exceptionally lucky for me, and for many others as we've seen, but in my case it was mostly due to the fact that much of money was in cash when Covid really hit in March. Not all of it, unfortunately, but because of my natural tendencies to want to focus on protecting against downside I do tend to have more in cash than most people on a percentage basis. That was beneficial to me this year, in past years not so much, but I think overall for the past several years I might be break even or possibly slightly ahead. But having cash on hand when the market tanked in March was extremely lucky without a doubt.\n\nI would like to dedicate a brief paragraph to luck, a subject that comes up as a throw away a lot here but something that I don't think gets a full amount of appreciation. I have been lucky in life across the board, and in the areas of life that it counts most. In family, in relationships, in friendships, in business, through some close calls I've had on motorcycles, and countless other ways. Investing takes luck as well and that's just to be in the game. Lack of luck definitely happens in investing too so as far as my investing goes I don't attribute much of my growth to luck per se. Instead I would say that being lucky enough to have the support system of great people around me, which is all the luck I could ever ask for, provided me the strength to get through some losses and to have some moderate level of confidence as I started having some wins.\n\n**Journey From Occasional Gay Bear, Frequent Degenerate, and Eventual Consistency:**\n\nI was born a gay bear. By that I mean I am naturally untrusting and that goes for people, studies I read, data I see... you name it I'm skeptical. I believe a certain amount of this is healthy but in investing it's the kiss of death. EVEN WHEN YOU'RE RIGHT, YOU ARE WRONG! By that I mean even if you spot a fraud (think NKLA, KODK, etc) the stock can still go up. Why?? BECAUSE STONKS ONLY GO UP, and amazingly that stupidity is actually true, who woulda thunk??!?!\n\nWhen I became active with my investing I was lucky enough to get burned on some small shorting ideas that all failed to one degree or another. I say lucky because they were small and they happened at the start and so I was then able to learn my lesson and never do that again. Though I have not developed much of a strategy to brag about I can share some (probably obvious) things that have worked best for me:\n\n1. As much as I can control myself to do so, I stay away from options. Frankly, I don't have enough conviction in most of my ideas to be willing to predict both the price and timing of how they'll perform. And I am too lazy to fully learn all of the intricacies needed to be consistent with options.\n2. I don't consider myself particularly skilled at picking up trends so I prefer to place bets on more established mid-caps. Sometimes I think they're getting unjustifiably beat down, sometimes I think they have a bright future and/or the ability to outperform the general market. I do still have my degen moments and I can't help but play around with some smaller companies too.\n\n**Why Taxes Matter With Investing:**\n\nI've already written about this at length so I'd first suggest reading: [Tax Info to Cuck Uncle Sam](https://www.reddit.com/r/wallstreetbets/comments/k4phe2/tax_info_to_cuck_uncle_sam_so_simple_even_a_wsb/)\n\nMyself and other members on here have also pointed this out ad nauseam and yet most of you fucking idiots are still investing in non-qualified Robinhood accounts BUT I WANT TO HELP AT LEAST A FEW PEOPLE. To make a long story short, if you intend on growing an investment account and not using it for your regular life expenses you are a fool if you're not doing this in a tax-advantaged way. I have seen at least a dozen people this year that have turned small sums into 7-figures and to do that within a tax advantaged environment means you would owe $0 this year in extra taxes. Even if you took $10k and turned it into $20K this year, which would be great by the way, then wouldn't it be greater NOT to owe taxes on that short-term gain??\n\nIf you're trading today because you need the money tomorrow then this doesn't apply but a lot of us are trading for fun, or to learn. If your job creates enough income to pay your bills then I think the smart move is to treat your investments as your retirement money when you have no income (beyond measly social security) so it only makes sense to lock it up today in exchange for tax breaks that will compound into huge savings down the road.\n\nMy strong strong strong suggestion would be to have both types of investing accounts, what are known as qualified and non-qualified (aka retirement and non-retirement) accounts. This will allow you to utilize qualified money for your short-term plays (less than 12 months) and your non-qualified money for your plays that are expected to last more than 12 months.\n\n**Treating Investing Like Poker:**\n\nI consider investing to be much like my experience with poker. Before CV19 I played occasional live tournaments and what I learned while doing that has been more important than the obvious stuff above.\n\n* The importance of not getting knocked out. To win a tournament you have to be in the tournament and so a reckless strategy of frequent all-ins is not just risking your buy-in, it's risking your ability to remain in play. ICM is what I believe this formula is known as within the poker world.\n* If I win chips, you lose them. It is a very zero-sum game like that. We celebrate our fellow degens here on WSB as royalty among us but one man's victory is another man's defeat and I feel it is important to always be aware of this just for the sake of empathy.\n* The more people playing the bigger the prize pool. Anybody who has played in a poker tournament before has noticed that the more entrants the more the total prize pool grows. This seems to be the same with the market because the more appetite retail and institutional investors have to participate in the market the more companies want to go public to take advantage of that appetite. This means the winners win bigger, but interestingly, the losers don't lose bigger. IE unless you buy in more than once (which is why I don't risk going bust), a loser only loses one buy-in but the winner (or those that place in the Top 10) gets the benefit of all of those losers' buy-ins making up a bigger final score.\n* THIS IS THE IMPORTANT ONE: You don't have to win First Place to make money. In general you can place anywhere in the Top 10% and typically double your money, or better.\n\n**Brief Catalogue of The Winners &amp; Losers:**\n\nI place this last because I don't think it's very important but some of the tickers I did best on were JD, PDD, SQ, LUV, CHWY, CCL, PLTR, CRM and more recently I've been dabbling with SPACS. I'm also part of the GME gang now because of WSB and so far I couldn't be happier! The degen in me still awakens occasionally. I still hold some of those and that's not a complete list. My biggest losses came from shorting HLF and shares of NAT, CHK, and a few others I can't remember. Perhaps it's PTSD that I can't remember.\n\n**My Final Reflection &amp; Perspective For Those Who Are Still Reading:**\n\nMore than anything else I'd like any reader of this post to realize that doubling or tripling your money is hard, but it's a lot easier than making 10X or 20X or 50X like some on here have been fortunate to do. **In fact, even doubling or tripling your money over a period of a few years is fucking hard!** I fear that people see a handful of individuals make 10X, 25X, 50X, etc and then think they're \"doing something wrong\" or feel inclined to take obscene risks in an attempt to duplicate that pattern and I frankly feel it's a fools errand. Admittedly I enjoy reading about those plays too, and I give props to those Gods of Investing who walk amongst us mortals, but I like watching high stakes poker and yet I realize that I am unlikely to ever be playing in those games because of my tolerance for risk. AND THAT IS OKAY! My goal is not to be a billionaire. My goal is to be happy in life and enjoy the company of those most important to me and that's what I was doing before I hit the 7-figure mark and that's what I'll be doing as I continue to (hopefully) grow my portfolio bigger. My main strategy as always will be to not lose money as much as possible and to happily take a 25-30% gain vs. always chasing the clouds.\n\nTo some honorable mentions:\n\n[u/sir\\_jacks\\_a\\_lot](https://www.reddit.com/u/sir_jacks_a_lot/) is one of the few geniuses on here trading in a retirement account and you should all want to be like him/her when you grow up for many reasons. [u/glideoutside](https://www.reddit.com/u/glideoutside/) has been inspirational and has led plenty of people to gains with insightful ideas. [u/poland\\_spring10](https://www.reddit.com/u/poland_spring10/) reminded me just the other day that \"Scared Money Don't Make Money\" and while I am fine with being cautious it had been awhile since I had heard that and he/she was right and I needed that before 2021. [u/vitocorlene](https://www.reddit.com/u/vitocorlene/) for some excellent DD on MT and the steel industry in particular.\n\nI wish I could remember who posted the techno cat and bongo meme yesterday because that shit was great too! And to so many of the rest of you whose screen names I can't remember now but who have shared huge gains, huge losses, and own the fact that you may end up holding huge bags on some of these autist meme stonks and don't give a shit about it anyway. I am jealous of those of you who can stomach going all-in on some of the dumbest shit I have ever seen and I sincerely applaud your willingness to go big or go home, especially those of using margin or loans which is just amazing to watch. I wish EVERYBODY a prosperous 2021. If 2020 was a good year for you I hope you keep it up. If 2020 sucked than don't worry about it, 2021 starts next week.\n\n**A therapist once said to me that your past doesn't dictate your future. She was right. Do your best, don't try to keep up with others, find strategies that work for you, try to match your conviction of a play with your tolerance for risk, and if you have a good idea of a double or triple for 2021 slide into my DMs :-)**",
        "subreddit": "wallstreetbets",
        "title": "Path to 7-Figures, The Unsexy Way",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kkped2/path_to_7figures_the_unsexy_way/",
        "created": 1609043662.0
    },
    {
        "author": "cyanlce",
        "created_utc": 1606962371,
        "id": "k5ociy",
        "num_comments": 258,
        "num_crossposts": 0,
        "selftext": "Quick update on the [survey](https://forms.gle/kJFs1C8gURHA5a8g8) from this morning.\n\nWe received 1000+ responses so far, accounting for shares from /u/DeepFuckingValue (the legend), /u/Jeffamazon (magnum opus DD), and /u/ahminus (negative cost basis). After removing joke entries and outliers, there were 904 responses with a distribution (both for responses with IDs and without) relatively close to what would be expected.\n\nShares Owned|Responses|Total Shares\n:--|--:|--:\n[0,100)|392|12,670\n[100,1K)|341|110,084\n[1K,10K)|140|383,840\n[10K,50K)|27|587,311\n[50K, ∞)|4|237,450\nTotal|904|1,331,355\n\nThis doesn't include shares from notable whales like /u/SIR_JACK_A_LOT. To be conservative, I've excluded responses with larger holdings, which need to be verified with screenshots as suggested by /u/Mr_Saturn_.\n\nIf you want to add or update your shares: https://forms.gle/kJFs1C8gURHA5a8g8",
        "subreddit": "wallstreetbets",
        "title": "GME ownership survey update",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k5ociy/gme_ownership_survey_update/",
        "created": 1606991171.0
    },
    {
        "author": "chcknbscts",
        "created_utc": 1607864971,
        "id": "kcacda",
        "num_comments": 257,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "GME Closing 1,000 Stores Q1 2021",
        "url": "https://bestlifeonline.com/gamestop-closing/",
        "created": 1607893771.0
    },
    {
        "author": "ZeroTolerrance",
        "created_utc": 1608311936,
        "id": "kfpavp",
        "num_comments": 252,
        "num_crossposts": 1,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Gamestop up 8% on a red day",
        "url": "https://media1.tenor.com/images/43730b3ead94f9f2b010be52e4844cdb/tenor.gif?itemid=17820817",
        "created": 1608340736.0
    },
    {
        "author": "ddroukas",
        "created_utc": 1608328493,
        "id": "kfukla",
        "num_comments": 251,
        "num_crossposts": 1,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Our boy Cramer outlines how short sellers easily manipulate stocks (2006; GME playbook)",
        "url": "https://www.youtube.com/watch?v=VMuEis3byY4",
        "created": 1608357293.0
    },
    {
        "author": "GushingGranny1",
        "created_utc": 1608569783,
        "id": "khl7aj",
        "num_comments": 250,
        "num_crossposts": 0,
        "selftext": "As we are now all aware, Papa Cohen, through RC Ventures, just increased his stake in GME to 13% by buying an additional $76m worth of shares bringing his total holdings to 9million shares. \n\nWhat's more is the statement Gamestop issued in light of the news. \n\n    RC Ventures intends to continue to engage in discussions with GameStop’s board “regarding means to drive stockholder value, including through changes to the composition of the board and other corporate governance enhancements.\" \n    While RC Ventures “desires to come to an amicable resolution with [GameStop, it] will not hesitate to take any actions that it believes are necessary to protect the best interests of all stockholders.” \n\nRead between the fucking lines people. Cohen is preparing his war chest to bring GME to the 21st century. A hostile takeover is imminent. Get in the GME rocket now or be left behind. \n\nTl;dr: Get in pussies. \n\n[https://www.thestreet.com/investing/ryan-cohen-chewy-13-percent-stake-gamestop?puc=yahoo&amp;cm\\_ven=YAHOO](https://www.thestreet.com/investing/ryan-cohen-chewy-13-percent-stake-gamestop?puc=yahoo&amp;cm_ven=YAHOO)",
        "subreddit": "wallstreetbets",
        "title": "Ryan Cohen Is Gonna Do A Hostile Takeover Of GME",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/khl7aj/ryan_cohen_is_gonna_do_a_hostile_takeover_of_gme/",
        "created": 1608598583.0
    },
    {
        "author": "convolutionx",
        "created_utc": 1606869010,
        "id": "k4y1xh",
        "num_comments": 245,
        "num_crossposts": 0,
        "selftext": " \n\nI can't DD better than this (I can't even DD at all besides reading other DDs):\n\n[https://www.reddit.com/r/wallstreetbets/comments/k4csaa/the\\_real\\_greatest\\_short\\_burn\\_of\\_the\\_century\\_part/](https://www.reddit.com/r/wallstreetbets/comments/k4csaa/the_real_greatest_short_burn_of_the_century_part/)\n\nBut one interesting thing is just to highlight a section of this DD that actually fulfilled today as promised:\n\n**4) TA - When the stars and crayons align. Here’s an excerpt from our resident astrologist** [u/JayAreW](https://www.reddit.com/u/JayAreW/)**:**\n\n&gt;Ignoring the short squeeze element of GME and just looking at chart action, there are two elements that are important to keep track of. The cup and handle pattern and $15.80.  \nWhile my trading style is 90% technical analysis, there are certain elements which I shy away from – mainly chart patterns. However, it is important to at least recognize the obvious ones because if you see it, chances are others see it too. The main pattern I keep an eye out for are the massive cup and handle patterns. This is an example from Pring [figure 1](https://media.discordapp.net/attachments/778014693059067934/783103438112030760/cup_and_handle_pring_fig_1.PNG).  \nThe buy signal is traditionally a breakout above the handle, and a good estimate for price target is the distance from the base of the cup to the handle, added to the breakout point. A recent example of this is \\[redacted\\][(daily - figure 2)](https://media.discordapp.net/attachments/778014693059067934/783103467937988628/jmia_cup_and_handle_fig_2.PNG). Notice not one, but two failures to break the top of the handle and the subsequent parabolic run. Compare \\[redacted\\] with $GME and you see almost the same pattern [(daily – figure 3)](https://media.discordapp.net/attachments/778014693059067934/783103497926082580/gme_cup_and_handle.PNG). The traditional buy signal would be a breach above the red line (\\~$15.80). The difference between \\[redacted\\] and $GME is that \\[redacted\\] was far more condensed; the pattern played out over a period of a few months where $GME’s cup and handle started in late 2019. Playing this pattern exclusively, I would expect a price target of roughly $27, stretched out over a period of weeks/months and not as explosive as it’s African counterpart (assuming a squeeze doesn't happen between now and then). Typically, any chart pattern calls for a retest of the breakout point, so don’t be surprised if $GME retraces to $15.80 and look for a bounce there as confirmation that the breakout is on. The other important element is the $15.80 price. Not only is it the breakout point for the cup and handle pattern, but it coincides to a price point which I believe was a major short-selling entry point [(fig 4)](https://media.discordapp.net/attachments/778014693059067934/783103538602442812/GME_big_short.PNG). Notice the nearly 20% gap down on 33 million of volume. This type of action doesn’t just happen with selling alone and I believe massive short positions were opened on that day.  \nThis $15.80 then represents a breaking even point for those shorts if they have not closed their positions (and we have no real reason to believe they have). Breaking even is a huge psychological barrier for people when a trade isn’t going their way and often times represents an exit point for crowded positions. Most of the shorts were already underwater - above $15.80 and that water begins to boil. I believe this position is becoming borderline untenable for existing short positions and is a crowded and disastrous trade. So to recap, $15.80 not only serves as an important chart pattern breakout point, but the proverbial “line in the sand” for existing short positions.\n\nExtreme TL;DR = Current cup and handle pattern of GME means if there is a bounce at $15.80, that means breakout is imminent.\n\nAnd lo and behold, what do we see? The markets ended at $15.80 on the dot, and the afterhours pricing is already back up to $15.92, as foretold by [u/JayAreW](https://www.reddit.com/u/JayAreW/).\n\nWhat will happen when there is a breakout? Apparently through TA our resident prophet figured out the breakeven point for short sellers is $15.80, and if GME passes the test at the $15.80 support level and begins to climb again, short sellers are gonna start panicking and start buying back share en masse, which will drive the short squeeze. Ooorrrrrr, they can short even MORE to try and squash the price down, but come earnings report on Dec 8th, if either the report was better than expected, or if Cohen, the dude who built a billion dollar fucking dog food company, does a hostile take over for GME due to less than stellar reports, again, that's a catalyst for the stocks to go up, leading again to short sellers getting fucked if they don't start buying back shares.\n\nAlso, for all you paper hand mofos, literally stop it. Stop it. Stop selling and HOLD FOR AT LEAST A MONTH YOU PANSY BITCHES! Don't you realize the investment firms are scared, fund managers are gonna get fired if the short squeeze happens, so they're doing everything in their power to keep prices down by shorting, wanting cause fear among average joe retail investors like us? This is the wealth transfer from the 1% back to the common people we've been waiting for! If ONLY y'all don't bitch out and stand the line strong! Just be patient and if calls are too risky, just fuking buy shares then! Then you can factor out the risk of time and just enjoy the tendies at the end of the month!\n\nLastly, just like what Citron did to PLTR, plain old market manipulation by publishing a bogus report and price target on PLTR and taking money from all the paper hand bitches here, I'd expect desperate boomer firms to try some equal bullshit in scaring you all to selling. Just expect it to come and HOLD DAMN IT. This is the short squeeze opportunity of a lifetime, and you get to be part of history, and one day you'll be able to tell your grandkids how you fucked up, missed the $500 peak cuz you got too greedy, and sold it at $60 instead.\n\nTL;DR = GME, Tendies, Moon.",
        "subreddit": "wallstreetbets",
        "title": "GME breakout imminent = short squeeze imminent = tendies imminent",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k4y1xh/gme_breakout_imminent_short_squeeze_imminent/",
        "created": 1606897810.0
    },
    {
        "author": "nested_dreams",
        "created_utc": 1607360853,
        "id": "k8kll8",
        "num_comments": 243,
        "num_crossposts": 0,
        "selftext": "**What is ARKG**\nARKG is a managed ETF with exposure to CRISPR, gene editing, therapeutics, agricultural biology and health care innovation.\n\n**Why Invest Now?**\nThis past weekend several companies in this space presented very promising results at the American Society of Hematology (ASH) annual meeting, one of the year’s largest medical conferences.\n\n1. https://www.wsj.com/articles/gene-editing-shows-promise-in-sickle-cell-disease-11607189442\n\n2. https://www.bloomberg.com/news/articles/2020-12-07/traders-sift-through-virtual-blood-meeting-s-winners-and-losers\n\nTo say these guys are going to change the world is a gross understatement. Betting on any individual one involves a bit more risk than I prefer so this managed ETF is excellent and their management team is wayyy smarter than any of us!\n\n**How do we profit?**\nThese companies are prime acquisition targets for the Pharma companies that just put out covid vaxs, have astronomical valuations and investors nagging them about what comes next to justify their massive valuations. 🚀🚀🚀\n\n**How Profitable?**\nLast week I purchased $8k worth of 90 call options expiring 12/18/20 this morning they are worth $80k. Yeah that's right **1000% return!***\n\nSo stop wasting your hard earned tendies on stupid gamestop to watch it go the way of Blockbuster and instead **INVEST** in the next generation of **Pharmaceutical Blockbuster Therapies**. Invest in the technology that is actually going to change the world and directly make your life better!!!\n\n🚀🚀🚀 ARKG 🚀🚀🚀 ARKG 🚀🚀🚀🚀",
        "subreddit": "wallstreetbets",
        "title": "All aboard the **ARKG**: Some actual DD - 1,000% returns in 3 days 🚀🚀🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k8kll8/all_aboard_the_arkg_some_actual_dd_1000_returns/",
        "created": 1607389653.0
    },
    {
        "author": "grecobene",
        "created_utc": 1607961481,
        "id": "kd09bv",
        "num_comments": 243,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "GameStop is out with a new logo",
        "url": "https://i.redd.it/5inkrv7fd6561.jpg",
        "created": 1607990281.0
    },
    {
        "author": "jloy88",
        "created_utc": 1606842669,
        "id": "k4p4gn",
        "num_comments": 242,
        "num_crossposts": 0,
        "selftext": "Take a look at everything outside the shitty SPACs that get plugged here and everything is bright green.\n\n&amp;#x200B;\n\nAPH(A)\n\nAP(XT)\n\nLGV(W)\n\nHCA(C)\n\nPLT(R)\n\nGME \n\nFROG\n\nNIO\n\nALL NEGATIVE lol\n\n....",
        "subreddit": "wallstreetbets",
        "title": "Today is a green day for most every single stock except for wallstreetbets picks lol",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k4p4gn/today_is_a_green_day_for_most_every_single_stock/",
        "created": 1606871469.0
    },
    {
        "author": "Additional_Still5612",
        "created_utc": 1608909955,
        "id": "kk0omp",
        "num_comments": 242,
        "num_crossposts": 0,
        "selftext": "I was reading Uberkikz11 twitter (one of the first guys to talk about GME on here / think the Michael J Burry of GamerGate) to get more DD, and then I saw it: https://gfycat.com/anchoredimpishfishingcat-ving-rhames\n\nSome guy tweeted this to Uberkikz11 and nobody is talking about it:\n\nhttps://twitter.com/KjetillStjerne/status/1342347744875327488/photo/1\n\nDirect link to his \"DD\" screenshot:\n\nhttps://pbs.twimg.com/media/EqD6GpJWMAAHehj?format=jpg&amp;name=large\n\nWho is this guy?: I have no fucking idea.\n\nWhere did he get it?: I have no idea, hoping someone in the comments can tell us.\n\nWhat's he saying?: I transcribed part using my shitty OCR app, there may be errors so it's better to read the screenshot but here you go because you're too lazy:\n\n&gt;Right now there are some aggressive negotiations happening behind the scenes between several of the large short positions and some private equity / investment banks (PE/IBs) which will remain unnamed. The chatter going around is that the PE lb syndicate is offering two options. Option 1 is for the shorts to give highly discounted shares they hold of other stocks in exchange for shares of GME stock held by the PE lb side. This will allow the short positions to start to unwind their situation without getting completely destroyed having to source shares from the open market. Option 2 is to allow the large shorts to purchase tranches of GME from $35 to $80 in a private auction that will swap on an ATS and get reported over a series of weeks to minimize price impact. \n\n&gt;However, things are not progressing well as the discussions have been going on for several months. So, Option 3 is the nuclear option and the reality of it occurring is increasing daily. A few of the head traders have indicated patience is waning and the short squeeze opportunity is just too good to pass up at this point. \n\n&gt;And this is what brings us to Option 3. Option 3 is for PE/IB to suspend discussions with the shorts and begin accumulation. In fact, large quantities of Calls with strikes from $23 to $35 have been quietly accumulated via small lot buys in all expiry series out to 20 January 2023 and remain as open interest. Next step is analysts initiating new coverage on GameStop discussing how the company is turning things around post-COVID. \"Management closed the right stores and properly restructured. The remaining stores can act as micro-distribution centers with GameStop transitioning to a hybrid format e-commerce business. It appears they are taking the best of Amazon (online) and Best Buy (brick &amp; mortar). We see great things ahead for GameStop.\" This is the narrative that will be launched at the right time to drive retail buying and to trigger passive management ETF buying. Then, PE/lBs will dive in with significant open market purchases to lock the float.\n\nPositions: 4500 shares of GME\n\nHappy hanukkah retards, to the MOON: https://gfycat.com/blaringfemaleafricanclawedfrog",
        "subreddit": "wallstreetbets",
        "title": "🚀Christmas Miracle / GamerGate 2020: GME shorts negotiating with PE/IBs to unwind their shorts 🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kk0omp/christmas_miracle_gamergate_2020_gme_shorts/",
        "created": 1608938755.0
    },
    {
        "author": "The_Bossss",
        "created_utc": 1608752861,
        "id": "kizv0v",
        "num_comments": 238,
        "num_crossposts": 0,
        "selftext": "Shout out to u/dildoflexing for the post: [https://www.reddit.com/r/wallstreetbets/comments/kiecy9/gme\\_autists\\_please\\_do\\_not\\_let\\_the\\_shorts/](https://www.reddit.com/r/wallstreetbets/comments/kiecy9/gme_autists_please_do_not_let_the_shorts/)\n\nHe is spot on. Check out what happened today at 2:13 pm.\n\n62,000 put options hit the tape at 2:13 pm triggering a sell off. We are watching now.\n\nDiamond hands - Can't stop, won't stop, Gamestop!\n\nhttps://preview.redd.it/orn37869qz661.jpg?width=743&amp;format=pjpg&amp;auto=webp&amp;s=382afd47d9688434927fce7a8066a29fb4e384bc",
        "subreddit": "wallstreetbets",
        "title": "GME autists. Please DO NOT let the SHORTS Manipulate you like this again: Evidence 12/23",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kizv0v/gme_autists_please_do_not_let_the_shorts/",
        "created": 1608781661.0
    },
    {
        "author": "simonizer59",
        "created_utc": 1607719567,
        "id": "kbayme",
        "num_comments": 238,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "GME gang +PS5 sales = Gains",
        "url": "https://i.redd.it/n18mzhn5em461.png",
        "created": 1607748367.0
    },
    {
        "author": "jackietsaah",
        "created_utc": 1607492166,
        "id": "k9lze0",
        "num_comments": 236,
        "num_crossposts": 0,
        "selftext": "I see two types of people after today, and I don’t like any of them. \n \n1. “Boo-fuckin-hoo, I lost $Xk on GME, should I sell?”\n2. “HAHAHAHA I’m fucking loving this, GME retards got what they deserved, fuck yeah, bruuuh!!!”\n\nLemme deal with #1 first, because these are still decent humans. 3 words, tard. Sell. Motherfucking. CC’s. How much are you down per share? $2? $3? More? Doesn’t matter. You have 100 shares, you have a fighting chance. Time to join theta gang. Sure, sometimes they give us shit, but their strategies work. So, Sell-To-Open a covered call for each 100 share bag you’re holding, find a strike price above or at your cost basis, chose and expiry and boom - some amount of dollars goes back into your account. Good, now your cost basis is $X minus the value of the call. If GME recovers and shoots past $X, your shares get called away, but you made profit. If it doesn’t, if it trades sideways or goes down, theta/delta drive the price of the call down, ao buy that shit back for a net profit and repeat. Remember, if you have a multiple of 100 shares, you can still fight. First rule - don’t lose money. \n\nNow, #2. You fuckers make me sick. I mean, sure, we don’t feel sorry for you when you lose money, you dance with the market, you accepts the risks, but there’s literally no good reason to be happy about it, let alone ecstatic. Is your wife less ugly and your dick longer because some sad shmuck loses his rent money on GME? Is their misfortune somehow making your life less of a shithole? Are you no longer living in your parent’s basement because an autist bought GME calls when fucking everyone said “buy shares”? Be a decent fucking human being and don’t gloat. Oh, and another thing. That company still sold one billion motherfucking dollars of stuff in a quarter, despite the shithow we live in. What did you do this quarter? Some of you are gonna point me to your massive gains, but I say to fuck with that - you did it with massive help of lady luck, some other company’s hard work and your hand in your pants, GME made their $$ from hard work, that makes them respectable, and you a lucky speculator that’s gonna lose their shirt one day while GME still survives.\n\nTL;DR;\n#1 - stop whining, put your big boy pants on and either DCA or sell CCs.\n#2 - eat a dick.\n\nDownvote this to oblivion or upvote it to stratosphere, I don’t care. \n\nPositions: 300 shares at $14.78, sold 3 $21 12/11 calls, sold 7 $13 12/11 puts. Don’t give a shit if assigned, I’ll continue to hold 1000 shares and sell CCs.",
        "subreddit": "wallstreetbets",
        "title": "GME - a bit for everyone",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k9lze0/gme_a_bit_for_everyone/",
        "created": 1607520966.0
    },
    {
        "author": "Overwatch61",
        "created_utc": 1608934907,
        "id": "kk75l4",
        "num_comments": 236,
        "num_crossposts": 0,
        "selftext": "How is every autist here not balls deep in GME stocks and calls?\n\nSeriously how many times over the last year have we singlehandedly fucked every MM’s wife’s boyfriend with TSLA? \n\nHow many other ridiculous meme stocks did we pump together as a group?\n\nHow many diamond handed autists did  we make fucking rich purely off of our own stupidity?\n\nIt’s the end of the year and we have a job to do my friends. We need to buttfuck these gay bears one last time and squeeze these degenerates harder than my erection in Thailand. \n\nAll these insider trading cucks need to be punished for their crimes against humanity. Join me in fighting the good fight. \n\nGME is a safe bet long term anyway so if you wanna be a pussy just buy shares instead of calls. Just don’t paperhand that shit once you buy it. Buy and HOLD until it hits at least $50 and you’re balls deep in some hedge fund managers wife’s boyfriend.\n\nRemember friends: it’s not gay if you like the taste. Then you’re just havin’ fun...\n\nGME 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀",
        "subreddit": "wallstreetbets",
        "title": "GME mooning on Monday and Tuesday 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kk75l4/gme_mooning_on_monday_and_tuesday/",
        "created": 1608963707.0
    },
    {
        "author": "watchmaking",
        "created_utc": 1607547237,
        "id": "ka0fs9",
        "num_comments": 227,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Lord Cohen is not done with GME management yet",
        "url": "https://i.redd.it/rw444yer58461.jpg",
        "created": 1607576037.0
    },
    {
        "author": "josh3684",
        "created_utc": 1609004441,
        "id": "kkmebq",
        "num_comments": 223,
        "num_crossposts": 0,
        "selftext": "I’ve learned a lot since I started with stocks earlier this year. My first stock I bought was GME at a all time low 3.70, I was betting on the next ten consoles making a push for better business by the end of year.. if I only made $10 it. Would have been a success. I only bought 65 shares. Sold 50 of them on Thursday for $1k. From following you guys I jumped on Disney @ $109 and I’m gonna hold long term. I’ve learned a lot from this subreddit. And I’m thankful for all information and prospects. We aren’t competing with each other but this can be a place where we help each other out!",
        "subreddit": "stocks",
        "title": "Sold my first stock ever!! Thank you!",
        "url": "https://www.reddit.com/r/stocks/comments/kkmebq/sold_my_first_stock_ever_thank_you/",
        "created": 1609033241.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1607279056,
        "id": "k7yzhg",
        "num_comments": 222,
        "num_crossposts": 0,
        "selftext": "**The latest jobless numbers came in bad while the stock market keeps pushing forward, is a stock market crash coming soon? Let’s talk about this and the latest stock market news**\n\nHey everyone! So let’s start with the recap off Friday as we saw the broad market [SP500](https://ibb.co/HD8WbDT) leading the way up 0,88%, with the [DOW Industrial](https://ibb.co/sCt0FJj) close behind up 0,83% and the [Nasdaq COMPOSITE](https://ibb.co/dDhWbBG) also gaining a decent amount, up 0,7% with all 3 big indexes closing at all-time highs.\n\nWe saw more than ¾ of the [stocks](https://ibb.co/CB6cSMn) advancing despite below average volume as companies either small, mid or large cap value or growth [stocks](https://ibb.co/qCNqN5G) were gaining except large-cap growth. \n\nThe best gaining [sectors](https://ibb.co/d6f58Mf) were Energy and Materials up over 2% while Utilities finished 1% down on Friday, as Utilities were the only sector to finish the week losing significant ground, with Consumer Discretionary also dropping just 0,12%. With the rest of the sectors in the green, Energy, Health Care, Technology and Communication being the biggest gainers finishing the week up over 2%.\n\n[Utilities](https://ibb.co/Bz8TnvP) have been hit hard in the last year as residential consumers and small businesses have been able to defer paying power bills, this will continue to hold down the sector for now with the debt still increasing.\n\nThe VIX also dropped more than 2% on [Friday](https://ibb.co/18qjBx7) and finished the [week](https://ibb.co/7KyfPxQ) over 5% down as the [HEAT MAP](https://ibb.co/sKhhfx6) from Friday shows us that there were plenty of gains to be made especially in the Energy Sectors as well as Financials, with the big companies from the Tech and Communication sectors doing worse than the rest of the market.\n\nFor the week though this [HEAT MAP](https://ibb.co/92hRtQL) shows that Apple was one of the biggest gainers alongside Semiconductors and Energy Names while Health Care companies like JNJ and Pfizer also did very good.\n\nThe big indexes all finished higher for the [week](https://ibb.co/b3Gb4HN) with the SP500 up 1,7%, the Nasdaq Composite up 2,1% and the Dow up 1% with renewed hopes for a stimulus package being back on the table.\n\nHere are the most interesting economic [reports](https://ibb.co/j84CkLT) for next week, it will be a light week in terms of economic data but still, the market may be volatile and trends may change depending on some of the results.\n\nSo, on Friday [November JOBS](https://ibb.co/r0JPtCs) came in much lower than anticipated, coming in at 245K vs de 610K in October and 469K estimated while the unemployment [rate](https://ibb.co/M9mNBMT) dropped to 6,7% a bit better than expected and down from 6,9% in the past month. Still there are over 10million people unemployed, this number more than doubling since the start on February. The [net addition](https://ibb.co/F54hcKb) of jobs in November was the [smallest](https://ibb.co/dWKmZWH) since May as government jobs were the [worst performing](https://ibb.co/F54hcKb) while transportation and warehousing jobs continue to increase, as big companies … aka Amazon has hired almost 3thousand people per day this year. But the bad news is that [long-term](https://ibb.co/HFZFhyC) unemployment is approaching the peaks from the Great Recession and that is not good news for the economy or the stock market as over 3,9 million people have been out of work for at least 6 months. \n\nSo, this is pretty bad news as mortgages in [forbearance](https://ibb.co/NLcDmYP) just slightly declined this week, by just 39K with more and more plans planned to expire in December, over 1M more exactly, more than 40% of active cases.\n\nThis may finally put some extra pressure on the Congress to agree to a relief package maybe even passing it alongside the government [funding bill](https://ibb.co/1qkTnsD) that is still debated and has over 300 issues that the parties don’t agree on. \n\nThis is becoming more and more obvious as [cases](https://ibb.co/6y9FTjV) in the US continue to rise, coming in over 200k in the last 2 days and the economy will soon feel the pressure from this, I expect the next month or two of economic data to not be so good, this may be the time the market sees a 5-10% correction before moving on higher on more positive things like the availability of the vaccine, the passing of the torch In the Presidency and a possible relief package.\n\nYes, this will continue to add to the [US DEBT](https://ibb.co/QjSPcdB), but even though I don’t have any partisan views, a good structured relief bill would do wonders for the economy as a bridge to when the vaccine will finally be widely available.\n\nYes, I know that the global debt is set to reach $200 trillion but the DEBT-to-GDP [ratio](https://ibb.co/LhWkxKJ) is projected to slowly go back down in the next couple of years.\n\nOther numbers that came in on Friday were [Factory ORDERS](https://ibb.co/xm7JJ2Q) which came in better than expected at +1%. While a new Redfin report indicates an increase in [average home prices](https://ibb.co/pXYNGcz) year over year of 16% with the number of pending home [sales up](https://ibb.co/2nw00m3) almost 30% over last year while new listings of home sales is [up just 9%](https://ibb.co/v3nyLPZ) since 2019 and dropping rather fast in the last months with sales of homes going for all time-high [prices](https://ibb.co/gmvRPd7) at 99,5% of the asking price as the real estate market keeps booming along.\n\nThe other number that came in on Friday and was not so good was the [trade deficit](https://ibb.co/42nsy2W), which widened even more in the last month by almost $2B.\n\nSo next week is again pretty slow in [earnings reports](https://ibb.co/Xkr4f4P) with the most interesting ones on being Chewy, GameStop, Adobe, LuluLemon, Dave&amp;Busters, Costco, Oracle and Broadcom.\n\nI own a small stake in all of them except Oracle and GameStop. I don’t see such a big growth opportunity with Oracle while GameStop I believe will struggle to turn around the business with very though e-commerce competition.\n\nWe will also have a number of new [IPOs](https://ibb.co/0jQWwTf) this week from DoorDash, AirBNB, C3.ai, Hydrofarm and Pubmatic. The first 3 are more interesting for myself but I will only take a first look at AirBNB and at what price that stock goes public to maybe get some action, I think we will a much bigger price than the 44-50$ price range to begin with for public trading. I also expect the same thing to happen with DoorDash which has already raised the IPO [pricing](https://ibb.co/Y8VSCpV) to 90-95$ but I am not very interested to buy that stock, as this type of economy has hugely benefited them and it might see a decrease rather than an increase in the next couple of years.\n\nSo, guys I still believe the stock market has upside in front of it, especially in the next 2 years, but you should tread careful for now, I think a possible correction might be just ahead before we move on higher, as you can see in this [CHART](https://ibb.co/9g0bJdj), a wedge formation is continuing to from with more and more tension, I believe there is about a 6,5% possible downside to the market at the moment before eventually getting back on track next year and going toward the 4000 level. And especially with the most recent jobless numbers in the US, I would try to diversify a little more especially with some EAST-ASIA exposure in countries like South Korea, Singapore and China also.\n\nThank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market!\n\nHave a great day and see you next time!",
        "subreddit": "StockMarket",
        "title": "Stock market crash 2021 or growth ahead? | Jobless claims impact on the stock market | STOCK MARKET NEWS [12-06]",
        "url": "https://www.reddit.com/r/StockMarket/comments/k7yzhg/stock_market_crash_2021_or_growth_ahead_jobless/",
        "created": 1607307856.0
    },
    {
        "author": "Ok_Hearing1231",
        "created_utc": 1606855972,
        "id": "k4tuxf",
        "num_comments": 219,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Guys, I’m a manager at GameStop, and me and my boys are ready to trigger this legendary squeeze.",
        "url": "https://i.redd.it/lchwktx92n261.jpg",
        "created": 1606884772.0
    },
    {
        "author": "horny131313",
        "created_utc": 1608605928,
        "id": "khwlj3",
        "num_comments": 218,
        "num_crossposts": 0,
        "selftext": "Alright retards, listen up. Im back with some more bullish DD on our very favourite gamestop incorporation. To preface, I am not a financial advisor so fuck off SEC and mods. If you're new here, the old DD is there for you to read, I wont repost it. The best way to hold this is **BUYING AND HOLDING SHARES**.\n\nAs we know, the gamestop bankrupt hypothesis is completely obliterated at this point and for the mid to long term future. the NeXt BlOcKbStEr bullshit is out the window. done. I'm also not going to talk about any type of short squeeze, we already know about that and you can read about that elsewhere. \n\n**Heres a list of things that we know:**\n\n* Cohen *just* increased his stake in gamestop to almost 13%.\n* Gamestop is closing unprofitable locations\n* Gamestop is *omnichanneling* their retard energy into online \n* Melvin capital has a MASSIVE short position and they are sweating\n* BofA also has a large short position\n* Sherman is clueless\n* Gamestop will likely surprise wall street with their holiday sales and eps \n\nBut why is this important? Who gives a fuck? dont we already know this shit?\n\nMany saw cohen as a potential catalyst but it was a gamble. Since he entered his position at such a low share price, he could easily leave it and take a profit. And after suffering through that earnings call the two options for cohen were: GTFO or hostile takeover. \n\n* Since cohen ***Increased*** his holding after that debacle, it is easy to see that he will not be leaving us high and dry. **It is now impossible for sherman to dilute his position to under 11%. He is preparing for war.** We can speculate all day into what this means, but one thing is certain. If GameStop doesn't shape up, Cohen will do ***Something.*** This is bullish\n\nThis one's a no brainer, but sometimes can scare people off. Headlines that GameStop is closing more stores may seem bearish, but heres why it's not: \n\n* It's no secret that brick and mortar is falling off, and if GameStop were to fight tooth and nail to remain a largely brick and mortar retailer they would go bankrupt in no time. It is also a fact that underperforming stores drain cash, which lowers net income and thus lowers earnings per share. Any store that is ***LOSING MONEY*** or is barely breaking even is keeping the stock price down because it's preventing future growth and killing net incomes. **Closing underperforming stores will lead to a higher EPS and more cash that can be allocated to growth.**\n\nGamestop is rebranding, and shifting to becoming the **one stop video game and video game related product online retailer.** While we haven't seen exactly what this will be, it is bullish to see them pivoting into other products besides just video games. Headsets, TVS, PC parts, you name it. You've seen the omnichannel memes, but we know that **If they are bullshitting, Cohen will step in.** Expect to see real progress made.\n\n&amp;#x200B;\n\nMelvin and BoA both have short positions, and are desperately trying to drive the price down. Unfortunately, it is getting harder and harder to convince people that gamestop is a failing business. They are sweating and will continue to sweat. Given the buy side volume, they could close these short positions gradually without triggering a massive squeeze, however it **WILL drive the price up significantly higher than it is now.** \n\n&amp;#x200B;\n\nSherman is a clueless boomer who is gonna have his ass handed to him by the younger, smarter, better Ryan Cohen. I mean look at this guy. He's gonna get his ass handed to him and have no clue what's happening. Cohen has a gun to his head and he's sweating. \n\n[Just look at his face. You can see the fear in his eyes. The fake smile. He is terrified.](https://preview.redd.it/wqrztm3vjn661.png?width=294&amp;format=png&amp;auto=webp&amp;s=d1eaace117ae61da56ef5d741be36d1e05d71246)\n\nFinally, It is likely that GME will more than likely beat earnings next quarter. I won't go into much detail into this because it is not my expertise, however u/Uberkikz11 has done some amazing DD and has been doing so for a long time. This guy literally goes into GameStop stores to get his information. Read this: [https://www.reddit.com/r/wallstreetbets/comments/kh9na8/gme\\_4q20\\_financial\\_model/](https://www.reddit.com/r/wallstreetbets/comments/kh9na8/gme_4q20_financial_model/)\n\n&amp;#x200B;\n\nBasically, GameStop is a very solid bet. Barring the event of a total market crash and new bullish news, I think it is extremely realistic to hit 17-20 by EOY. Obviously this is a shares play, but for you gamblers, I cant see jan 15 16-20 calls not printing bigly. Long term calls or leaps too. If you're new to gamestop, the volatility will seem scary but the shorts fight hard with this one. -10% days followed by +20% days are not unusual. Fortunately these swings dont burn much theta as they are relatively common and expected. \n\n&amp;#x200B;\n\n**For those of you who cant read**\n\nGME GO UP SHARES SHARES SHARES JAN 16-20CALL FOR GAMBLER RETARD",
        "subreddit": "wallstreetbets",
        "title": "GME: Why it's time for shorts to give up.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/khwlj3/gme_why_its_time_for_shorts_to_give_up/",
        "created": 1608634728.0
    },
    {
        "author": "Poland_Spring10",
        "created_utc": 1608046755,
        "id": "kdnxrb",
        "num_comments": 211,
        "num_crossposts": 0,
        "selftext": "I just bought 4,000 more shares to bring it up to 10,000. Am I officially one of the bigger players now? Can I get a shout out from our GME gang? GAMESTOP going to bankruptcy? I'll fucking do it again and make it 15,000.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/p66uqv0hed561.png?width=815&amp;format=png&amp;auto=webp&amp;s=5f7b632665569ea28a293ff09a2feb499e39615d",
        "subreddit": "wallstreetbets",
        "title": "GME ride or die",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kdnxrb/gme_ride_or_die/",
        "created": 1608075555.0
    },
    {
        "author": "imboredsoyh",
        "created_utc": 1607823533,
        "id": "kc1mc8",
        "num_comments": 208,
        "num_crossposts": 0,
        "selftext": "Like a hefty shit brewing in the depths of your bowels.\n\nI can feel it. Cohen is up to something 👀\n\n*Anyway...*\n#**The confirmation bias you came for:**\n\n&gt;*Several hedge funds and other institutional investors have recently modified their holdings of the stock. State Street Corp raised its stake in shares of GameStop by 10.3% during the third quarter. State Street Corp now owns 2,609,487 shares of the company’s stock valued at $26,617,000 after purchasing an additional 243,398 shares in the last quarter. **Morgan Stanley grew its holdings in GameStop by 913.2% during the third quarter. Morgan Stanley now owns 1,995,842 shares of the company’s stock worth $20,358,000 after acquiring an additional 1,798,857 shares during the period.** Nuveen Asset Management LLC grew its holdings in GameStop by 89.2% during the second quarter. Nuveen Asset Management LLC now owns 997,586 shares of the company’s stock worth $4,330,000 after acquiring an additional 470,300 shares during the period. Voloridge Investment Management LLC acquired a new position in GameStop during the third quarter worth about $7,900,000. Finally, Wells Fargo &amp; Company MN grew its holdings in GameStop by 352.7% during the third quarter. Wells Fargo &amp; Company MN now owns 763,612 shares of the company’s stock worth $7,789,000 after acquiring an additional 594,935 shares during the period.*\n-TickerReport\n\nWhilst some [insert insult of your choice] on WSB have been telling you to cut your losses and sell you shares, these institutions have been accumulating GME like it's pre-2020 TSLA. **I think they can feel it too.**\n\nFlaired this 'discussion' so please discuss lest mods be displeased.\n\n**TLDR:** GME 🚀 to Uranus (looking at you, shorts)\n\nPositions: you already know I'm all in baby 💎🙌",
        "subreddit": "wallstreetbets",
        "title": "GME Gang... Can ya feel it? (Fresh confirmation bias within)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kc1mc8/gme_gang_can_ya_feel_it_fresh_confirmation_bias/",
        "created": 1607852333.0
    },
    {
        "author": "ClassicJagLive",
        "created_utc": 1607130750,
        "id": "k6y0zu",
        "num_comments": 208,
        "num_crossposts": 0,
        "selftext": "Obviously, $GME Q4 results are a day of reckoning for this business. I have long been tracking this company but I only recently got in with some skin in the game (disclosure – I own \\~3000 shares; I am also new to WSB:)). I also think Q3 is an important moment for the company given the institutional dynamics, but **I do NOT think holding through 12/8 would be a good gamble** (which is why you are seeing several people sell their shares to buy in later). Instead, I think there is a better way to play earnings on 12/8.\n\nFirst off, as everyone knows, Q3 results are going to be ugly. Some have made the argument that the market has already priced this in, but this is only partially true. **Market pricing is dictated by both event-driven probability and hype.** I would guess that the probability of GME missing consensus estimates is \\~50/50 (note missing consensus estimates is different from negative growth which is guaranteed in this case). Nobody knows where things will shake out, so the market will price it as such. However, there is a tremendous amount of hype around this stock (for good reason in my humble opinion), which is why I think this stock is trading well heading into an earnings announcement for a turbulent quarter.\n\nNow, **one way to estimate performance is by using credit card activity as a proxy for performance**. We can then use this and compare it to consensus estimates by research analysts:\n\n*Same-Store Sales*\n\n* Telsey: -27.0% (as of 12/2/20)\n* Wedbush: -20.0% (as of 12/4/20)\n\n**If you look at credit card data scrapping services, it looks like the quarter will end down around 25 – 30%** (based on the service you use). Obviously this is close to the Telsey number, but its worth noting that these credit card services slightly overestimated performance in Q2 (so the number will likely be closer to -30%). **Therefore, I have a feeling that this stock is going to sell-off significantly**, **making it a much better entry point versus pre-earnings.**\n\n**Personally, I am still long this stock, but it seems like the stock is going to drop in the immediate aftermath of the earnings release, which is why I will be holding off from buying on Monday. I’m definitely going to scoop up some more after earnings however!**\n\n&amp;#x200B;\n\nHappy to answer any questions :)",
        "subreddit": "wallstreetbets",
        "title": "$GME is a SCREAMING buy. But AFTER earnings…..",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k6y0zu/gme_is_a_screaming_buy_but_after_earnings/",
        "created": 1607159550.0
    },
    {
        "author": "promiseaik",
        "created_utc": 1608737479,
        "id": "kiv44e",
        "num_comments": 203,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "GME target $50",
        "url": "https://www.reddit.com/gallery/kiv44e",
        "created": 1608766279.0
    },
    {
        "author": "dildoflexing",
        "created_utc": 1608776687,
        "id": "kj6sz7",
        "num_comments": 203,
        "num_crossposts": 0,
        "selftext": "Today’s DD is what I wanted to start out with. I know yesterday’s DD was boring but I just had to start by laying the foundation to establish *GME’s bare minimum growth case (if I were to put a number, a low double digit growth yoy, which in today’s world is just a survival case)* ***in the gaming industry******.*** This is their baseline. This is their foundation. \n\nToday, I’m framing a bull case I haven’t seen others lay out the blueprint for. I hope you guys can all picture it. I am willing to bet this is at least some of what Cohen sees in Gamestop. If I were Cohen, I’d be all over Gamestop too. Disclaimer: I am in e-commerce myself and I’m in a niche within consumer electronics. I make a comfortable living making more than most professionals do. Remember, all of this is on TOP of their baseline growth. \n\nBack in September, Cohen said “long term, he wanted to make Gamestop a true competitor to Amazon” (source A). No article in September specified  the “gaming industry.” To be honest, I feel that only got added in November because to be frank, no one saw it. Everyone laughed. 1:1 competitor? I’m not so sure about this one. I believe in you Ryan, but this might take some time.  \n   Co-existing among eBay ($35B), BestBuy ($26.5B), Amazon in the next 2\\~3 years? 100% Doable. Being #2 amongst those names? Definitely achievable and the setup is too perfect to ignore. \n\n**Gamestop vs Amazon. Advantage Gamestop has on Amazon**\n\n· Gamestop has a location in every urban center. Even after closing 1000 locations that are losing money most likely due to them being in a mall, they still have 4000 locations. It’s time to think of them as 4000 distribution points/fulfillment centers and NOT brick and mortar stores. Amazon has 175 warehouses worldwide. \n\n· They can deliver an item A LOT faster than Amazon or anyone else can. Almost as fast as you can get pizza/food delivery if you are in a major city. \n\n· instant delivery via Doordash (piloting, but no problems yet). For the generation that want everything right now, this is great\n\n· They are already set up to take trade-ins of consumer electronics and already have a reputation for it.\n\n· Direct to consumer = no middle man = greater connection with consumers as well as greater profit.\n\n· When it comes to new items, it’s safe to say that Gamestop has buying power advantage over almost all, if not ALL eBay/Amazon sellers.\n\n· By not having a huge warehouse and carrying 12 million SKUs, their operation is much more efficient. Consumer electronics with the exception of television, are all very compact. (It’s not a loss though a TV is not a hot item people replace every couple of years). \n\n**Now here is where it's gonna get sweet.**\n\n**Ever watch Forrest Gump? Cohen spots Forrest Gamestop sprinting through the field in a true autist form, but he sees the potential in him, as the fastest receiver of tendies.**\n\n· Consumer electronics is one of the most popular and one of the most profitable categories in ecommerce. Think drones, phones, computers, tablets, gaming consoles, VR… etc.\n\n· When it comes to used consumer electronics, the profit margin is actually bigger. In major cities, even as a ‘nobody’, it is not difficult to make $100 flipping devices, and flip 20 devices/week. This is how I got started so I know firsthand.\n\n· It also comprises the most commonly bought and sold items on local classifieds such as Craigslist, Kijiji, and Facebook marketplace. \n\n· Currently the only business with a global presence to facilitate buying/selling them used is eBay. \n\n**Where eBay &amp; others fail/their MAJOR drawbacks when it comes to used. Remember, this is the ONLY names in the game.**\n\n· Long shipping times and many inconveniences to put up with to get the product\n\n· Inconsistency.\n\n· Risk of fraud or at the very least, risk of time being wasted leading to frustration. \n\nDo you see it now? Gamestop is a unicorn hybrid in the marketplace filling the gap between Amazon and eBay, in the most profitable and most category in ecommerce as well as offline, with faster delivery, and you can bet your ass that with Cohen running it, better customer experience. \n\n**But c’mon dude. With a name like Gamestop? How do you think they can establish this in people’s hearts and minds as the consumer electronics shop?** \n\nHow about this name? PowerUp, now it makes sense, right? \n\nThey already have 55M PowerUp members, compared to 165M Amazon Prime members, it’s not a lot. At the same time, it’s not little, but GME has also created a revolving door by giving them more in store credit than cash for their trade ins. \n\n**Valuation**\n\nUnless all shorts are underwater at $16.00 right? Let me use $16.00 as an example, because it will NEVER fall below it now. Meaning? shorts will eventually close. \n\nThat puts the market cap at $1,1B. Amongst 4000 stores. $276,000/store. Try setting up a store in locations Gamestop is set up at, with inventory and trained staff for $276,000.\n\nIt’s not possible. You would probably spend that on set up/reno and inventory alone and that’s not even including the brand presence that’s already built into people’s hearts and minds for buying and selling used consumer electronics.\n\nYeah but the valuation is low because they’re losing money! Without any of the things I mentioned today materializing, they’re going to be posting positive profit moving forward for sure after closing 1000 losing stores and focussing on e-commerce. \n\nGuess what though? Gamestop is already slowly gearing towards what I laid out. Check out their website. Drones, tablets, VR, phones, consoles, used games, computers. \n\nALL of what I laid out today, is ON TOP of the gaming foundation I laid out yesterday.  **🚀**  **🚀**  **🚀** \n\n**Squeeze valuation** \n\n$103 MINIMUM  **🚀**  **🚀**  **🚀** $326 Maximum before coming back down to $40. Timeline 1\\~4 months. I will talk about the squeeze valuation tomorrow. There’s a major positive I haven’t seen others mention.\n\nAsk yourself, have you 4x’d your money in the past 1\\~4 months?  **🚀** \n\n**Position**\n\nShares as well as options JAN 15 15C, 30C, APR 16 30C. GME makes majority of my port.",
        "subreddit": "wallstreetbets",
        "title": "GME DD Fresh Perspectives Pt 2. Gamestop vs Amazon",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kj6sz7/gme_dd_fresh_perspectives_pt_2_gamestop_vs_amazon/",
        "created": 1608805487.0
    },
    {
        "author": "sneakersourcerer",
        "created_utc": 1608698538,
        "id": "kimavm",
        "num_comments": 200,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Late night GME Porn",
        "url": "https://i.redd.it/oohb6h369v661.jpg",
        "created": 1608727338.0
    },
    {
        "author": "possibly6",
        "created_utc": 1609035703,
        "id": "kkv8mc",
        "num_comments": 198,
        "num_crossposts": 0,
        "selftext": "It hit me on christmas morning when I was sitting with my family and everyone was passing around presents and being happy yadayada. Not to say that I don't enjoy the holidays or anything, but the whole time I was thinking, \"man, gifts are cool but I wish I got some $$ to throw in robinhood\"\n\n&amp;#x200B;\n\nIt felt weird not frantically checking my GameStop position every 30 seconds, though I still did (shoutout snowflake gang). Anyways I'm curious, do any of you guys feel the same? Has \"trading\" (may as well be labeled intelligent gambling) become your biggest source of happiness? does it make you sad that nothing brings you joy like seeing big green dildos at market open? \n\n&amp;#x200B;\n\nDon't make me sad baby. Fuck all these broke ass simps that want \"relationships,\" fuck that. I'll be happy after a few yachts.",
        "subreddit": "wallstreetbets",
        "title": "Anyone else just not excited about the little things anymore because of tendies?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kkv8mc/anyone_else_just_not_excited_about_the_little/",
        "created": 1609064503.0
    },
    {
        "author": "lennox_marshall878",
        "created_utc": 1607499226,
        "id": "k9njjh",
        "num_comments": 198,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "GME: 🚀 TO 🚀 THE 🚀 MOON 🌝",
        "url": "https://i.redd.it/xrfbgkxz64461.gif",
        "created": 1607528026.0
    },
    {
        "author": "badgerbacon6",
        "created_utc": 1607450376,
        "id": "k996rz",
        "num_comments": 197,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Countdown to GME Earnings. Pucker those butts 💎🍑💎",
        "url": "https://v.redd.it/pdlnh2wt40461",
        "created": 1607479176.0
    },
    {
        "author": "dopydon",
        "created_utc": 1609122656,
        "id": "klh9np",
        "num_comments": 192,
        "num_crossposts": 0,
        "selftext": "ALL EARS \n\nSTOCKS MOONING TMRW INCLUDE THE FOLLOWING:\n\nGME, $GME, GAMESTOP, Gamestop, The Ryan Cohen Company\n\n 🚀 🚀 🚀  BUCKLE UP AND STRAP IN FOR YOUR ONE WAY TRIP TO THE MOON    \n\n# 🌙",
        "subreddit": "wallstreetbets",
        "title": "STIMULUS APPROVED LAUNCH THREAD 🚀🚀🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/klh9np/stimulus_approved_launch_thread/",
        "created": 1609151456.0
    },
    {
        "author": "swanpenguin",
        "created_utc": 1609277491,
        "id": "kmngx6",
        "num_comments": 191,
        "num_crossposts": 0,
        "selftext": "To the 💎🙌 who have stuck with us, the 🌈🐻 who have doubted us, the 🧻🤏 who have disappointed us, and the retarded fucks who lurk around wsb and somehow don't know what GME is...\n\nThere is still time for you to board the ride of your life: 12/31/2020\n\nForget about spending time with family. Forget about your wife - she's busy fucking her boyfriend anyways. This is more important.\n\n**THE FINAL BATTLE OF 2020 AGAINST THE MELVIN CUCKS IS UPON US.**\n\nListen up and listen close.\n\nGME dropped from $21 to a low of $18.who-gives-a-fuck today. \n\nThis was orchestrated by Melvin Capital. Tomorrow, they're going to try to do the same.\n\n**On 12/31, they're going to try to drop this stock AS LOW AS THEY POSSIBLY CAN.**\n\n*But, uh, sir swanpenguin, why uh is this so important sir? Why do it now?* 🥺👉👈\n\nLemme fill you in on a little secret.\n\nMelvin Capital wants to raise as much money as possible to try to survive the absolute disaster that is their GME short play. 2020 annual performance is CRITICAL to how much money they can raise.\n\n**12/31 IS THE FINAL DAY OF 2020** \n\nThese motherfuckers are DROWNING. They will do everything they can to drop the price as low as possible by EOD 12/31. They will pull every dirty trick they can to manipulate this stock down into the fucking ground so this mess looks manageable (spoiler: it isn't) .\n\nWhat does this mean for you?\n\nThis means the best damn buying opportunity of your life to get in on HISTORY. You won't see a lower stock price and you can bet your ass you'll be watching us 🚀🚀🚀🚀 to the 🌝 if you miss the ride.\n\nWill we see $16 or below on 12/31? Probably not. $17-18 is fair game though.\n\n**TL;DR: SPEND ALL YOUR MONEY ON GME SHARES 12/31 WHEN IT DIPS AND DON'T BE A 🧻🤏💩. HOLD FOR THE SHORT SQUEEZE OF YOUR LIFE.**\n\nPositions: 3000 shares &amp; loads of 35c 4/16 on GME\n\nSee y'all on Valhalla 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀",
        "subreddit": "wallstreetbets",
        "title": "GME: 2020 Season Finale premieres on 12/31",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kmngx6/gme_2020_season_finale_premieres_on_1231/",
        "created": 1609306291.0
    },
    {
        "author": "_Unoriginal_Name",
        "created_utc": 1609024967,
        "id": "kksbu0",
        "num_comments": 191,
        "num_crossposts": 0,
        "selftext": "So currently I have 50% of my money in PLTR and 50% in GME. I aim to hold these stocks for a while (or til a squeeze 😉) and believe both will have a very strong 2021 🚀🚀🚀🚀🚀🚀🚀🚀\n\nSo I guess my question is do I take some profits off the table for my PLTR  and YOLO all my money into GME? The aim would be to get in and out with some GME gains and get back into PLTR  in early January right around January 6th-8th, way before the showcase on the 26th. Just would be kicking myself if I didnt max out a possible squeeze but I definitely want a stake of the PLTR rocket when it moons! 🚀🚀🚀🚀🚀🚀🚀\n\nHow are other fellow GME and PLTR holders approaching this?",
        "subreddit": "wallstreetbets",
        "title": "Is it worth selling my position in PLTR to get more GME shares?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kksbu0/is_it_worth_selling_my_position_in_pltr_to_get/",
        "created": 1609053767.0
    },
    {
        "author": "TheSlingo",
        "created_utc": 1609039849,
        "id": "kkwah6",
        "num_comments": 190,
        "num_crossposts": 0,
        "selftext": "alright fucking idiots first off happy kwanza! second , hear me out, we all loved seeing tesla go to fucking mars before being added to the s&amp;p500, we loved the squeeze on GME, which just to let you know will be at 40 minimum by new years 🚀🚀 and who can forget our growing boy PLTR 🚀🚀🚀\n\nLet's say 2 years from now the stock market has an unbelievably bigly crash alright, and everyone knows even when stonks go down buy the fucking dip because they only go up. What if we as a community decided to create a fund to be used when the next absolutley unpassable stock looks like it's gonna fly out of the fucking solar system, we could all become millionaires and make the boomers all buy after seeing their 1-3% gain for the year causing another pump and making us multi millionaires \n\nhow many of you retards are in",
        "subreddit": "wallstreetbets",
        "title": "Fucking genius idea : we create a WSB trust fund for when the next tesla comes around 🚀🚀🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kkwah6/fucking_genius_idea_we_create_a_wsb_trust_fund/",
        "created": 1609068649.0
    },
    {
        "author": "jjd1226",
        "created_utc": 1607825623,
        "id": "kc264n",
        "num_comments": 187,
        "num_crossposts": 0,
        "selftext": "&gt;Jesus called in a loud voice, \"Lazarus, come out!\" The dead man came out, his hands and feet wrapped with strips of linen, and a cloth around his face. Jesus said to them, \"Take off the grave clothes and let him go.\"\n\n**Tl;dr: GME may have hit bottom if it stays above 12.30 - 13.18 support area. If so, expect an upwards price target of $14.5+ towards end of week and a price target of 15.7-16-20ish by 12/31 - pending detrimental stimulus news.** \n\n# [WATCH HERE](https://www.tradingview.com/chart/GME/7Oo17z3h-GME-Rises-from-the-Dead-12-14-12-31-Possibilities/)\n\n&amp;#x200B;\n\n[1d timeframe](https://preview.redd.it/xohzetj92v461.png?width=1560&amp;format=png&amp;auto=webp&amp;s=98771838d41ddbaa375ba659cf122b3d310db86a)\n\n[30m timeframe](https://preview.redd.it/2v586nkh2v461.png?width=1560&amp;format=png&amp;auto=webp&amp;s=ba8e3a7aac981153033b67cdee0d4fca4a6a47f3)\n\n# Current Positions\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ugp5m5ap2v461.png?width=512&amp;format=png&amp;auto=webp&amp;s=3859dae8130bbc7896ea29432fcdd56e2dfd40ce\n\n# Positions to Add on Monday Morning: GME 13c/13p straddle 12/18\n\nIf you look at the historical option flow, from 12/10-12/12, two day after earnings missed, bearish sentiment started to decline.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/omuhwqu63v461.png?width=3942&amp;format=png&amp;auto=webp&amp;s=13c62fc0f2c9701458e282eb9cdcc7d0c0ce8d97\n\n12/11 option flows seem bearish but if you look at the put orders, it looks like the MMs are expecting a top of around 15 ish, bottom around 13 ish, and hedging with 8-9 ish.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/4hs8ej6c3v461.png?width=3942&amp;format=png&amp;auto=webp&amp;s=7252be69843aa095863887463e3ae1d194d4ab77\n\nIn the darkpool, from 12/09 - 12/11 GM had about $20+ million worth with a spot price of $13.29-13.95.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/re1v2nbi3v461.png?width=584&amp;format=png&amp;auto=webp&amp;s=37b514c19e0314a21fd22b6c7334f98c36544733\n\nUsing the squeezer momentum divergence oscillator, GME topped out on 11/30, firing a squeeze point, and fell to a rounding bottom and into a rectangle consolidation channel, firing a  second squeeze point.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/0e8z90zk3v461.png?width=3382&amp;format=png&amp;auto=webp&amp;s=6fed65bd8e20f2da8e3c3d08d6f597eb82319a1b\n\n**Why the Dip?**\n\n**GameStop Corp** reported second-quarter earnings that came up short on both revenue and EPS estimates.\n\n**What Happened:** GameStop reported second-quarter revenue down 26.7% year over year to $942 million. Lower store base and lower store operating days contributed to same-store sales down 12.7% in the second quarter.\n\n“The second quarter saw strong progress toward our strategic initiatives, fueling an 800% increase in global e-commerce sales, a $133.7 million reduction in SG&amp;A and a significant improvement in our balance sheet with $735.1 million in cash at quarter-end,” CEO George Sherman said.\n\nQuarterly losses of $1.40 per share missed the analyst consensus estimate by 37 cents.\n\n# Why It’s Important: E-commerce growth of 800% year over year was the bright spot in the quarter and represented 20% of total net sales. GameStop was able to see 90% fulfillment rates within 24 hours of customer orders.\n\n# [What does this mean for me? I need more capital or need to be hired as an analyst so I can do this full time because my current job doesn't pay me squat.](https://media.giphy.com/media/eUDhD5XFBw0r6/giphy.gif)\n\nIf you enjoyed this DD, please tip me with reddit coins and karma love! I love WSB.\n\nThanks,\n\nFutureMan",
        "subreddit": "wallstreetbets",
        "title": "GME Rises from the Dead - 12/14 - 12/31 Possibilities",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kc264n/gme_rises_from_the_dead_1214_1231_possibilities/",
        "created": 1607854423.0
    },
    {
        "author": "danielbauwens",
        "created_utc": 1609060101,
        "id": "kl0n8g",
        "num_comments": 185,
        "num_crossposts": 0,
        "selftext": "I'm keeping this as short as possible, with as much information as possible. I might go over some points, but this is what I consider most important. Let's go.\n\n&amp;#x200B;\n\n***Some of the facts:***\n\n\\- We're at the start of a new console cycle, which historically has always lead to a massive spike in share price. Even with the price surge in the last few months, we're still less than 1/6th of what GME was priced at last console cycle. And it's only just begun.\n\n\\- 250% of outstanding share float is shorted [(as of Dec. 14)](https://www.reddit.com/r/wallstreetbets/comments/kkjidv/short_of_float_update_gme_the_short_squeeze_is/) This means that there are more short positions than actually shares outstanding, which would create a problem for the shorters, should there be a catalyst that moves the price upwards, [creating a short squeeze.](https://www.investopedia.com/terms/s/shortsqueeze.asp)\n\n\\- Ryan Cohen, a 35 year old successful businessman, Billionaire, who self-admittedly only invests in companies he believes buys  a 9,98% stake in GameStop and has since increased it to 12,9%.\n\n\\- Ryan Cohen sends the BoD [a letter](https://www.sec.gov/Archives/edgar/data/1326380/000101359420000821/rc13da3-111620.pdf) where he tells them all how unhappy he is with how things are going and that they should get their shit together. This is done BEFORE he increases his stake to 12,9%\n\n\\- GameStop has its Q3 earnings which aren't great, but not as bad as projected, their online sales are up over 250% YTY and they have an additional $300 million in their cash reserve ($600 million for a company who's market cap currently is just over $1 Billion). [Link to Q3 Transcript](https://www.fool.com/earnings/call-transcripts/2020/12/09/gamestop-gme-q3-2020-earnings-call-transcript/)\n\n\\- We learn that they're closing 1000 stores which are hurting their profit by Q1 of 2021 and are doing some rebranding work. [Stores Shutdown](https://bestlifeonline.com/gamestop-closing/) and [Rebranding](https://www.reddit.com/r/wallstreetbets/comments/k66w5h/gme_rebranding_in_progress_theyve_just_changed/)\n\n\\- RC Ventures files another 13D on December 22 where he discloses how he increased his stake above 10% to 12,9% with another message for the board ***\"While the reporting persons desire to come to an amicable resolution with the issuer, the reporting persons will not hesitate to take any actions that they believe are necessary to protect the best interests of all stockholders.\"*** [Link to 13D](https://fintel.io/doc/sec/1822844/000119380520001571/e620151_sc13da-gamestop.htm)\n\n\\- Investing research group Hedgeye pitches long-term potential for [GME with price target of \"$50+\".](https://www.reddit.com/r/wallstreetbets/comments/kiv44e/gme_target_50/)\n\n&amp;#x200B;\n\nNow most of you should get a good idea why GME is a good bet short-term if you've read the above DD and do some logical thinking. There is also an argument to be made about the future potential it has, if Cohen does indeed turn the ship around and polish this into something magnificent. \n\nBut you need some vision to see that, and I'm not trying to push you retards too much out of your comfort zone. \n\nFor further reading, here are some of my favorite posts by my fellow GME shareholders:\n\n\\- [GME Tribe: A Story About How Ryan Cohen is About to Kick Down Sherman's Door and Drink His Milkshake](https://www.reddit.com/r/wallstreetbets/comments/kakxrm/gme_tribe_a_story_about_how_ryan_cohen_is_about/)\n\n\\- [GME 4Q20 Model](https://www.reddit.com/r/wallstreetbets/comments/kh9na8/gme_4q20_financial_model/)\n\n\\- [GME Q3 Thoughts on the clash between Cohen and Sherman](https://www.reddit.com/r/wallstreetbets/comments/k9apx5/gme_q3_call_thoughts_on_the_clash_between_cohen/)\n\n\\- [GME ICR Conference](https://www.reddit.com/r/wallstreetbets/comments/kknuk6/gme_icr_conference_words_matter/)\n\n\\- [Short Interest Update on GME + Commentary](https://www.reddit.com/r/wallstreetbets/comments/ka3gey/short_interest_update_on_gme_for_113020_with/)",
        "subreddit": "wallstreetbets",
        "title": "Why GME is going to the Moon (Compressed information + Links)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kl0n8g/why_gme_is_going_to_the_moon_compressed/",
        "created": 1609088901.0
    },
    {
        "author": "eblozavr322",
        "created_utc": 1608333267,
        "id": "kfw3ze",
        "num_comments": 181,
        "num_crossposts": 0,
        "selftext": "When you read these retarded comments about tHe NeXt BlOcBuStEr take a moment to think about who’s on the other side of the screen typing it. I guaran-fucking-tee you that all the OG bears and doubters (nothing wrong with that) have left these GME discussions for the most part. They’ve read the DD, but it was too risky for their taste. I can respect that.\n\nYou know who is left? Those whose actual job is to keep the price down because otherwise they’re fucked.\n\nhttps://youtu.be/VMuEis3byY4 - watch the whole video (shoutout to our guy u/ddroukas for it) about Cramer telling how he as a short used to keep the price down\n\nPetition to ban these fuckers (like u/Durado) spreading fake bullshit (“making a new truth”, quoting our boy Cramer here) to keep their positions afloat. The clock’s ticking, they’re underwater, and they’ll use anything there is to suppress the price.\n\nI know this may spawn an echo chamber, but at this point our DD is rock solid and the only reason GME is not above 20 shooting off to the moon is that shorties are desperate and doing everything they can, including trying to spread misinformation on a largest trading forum there is\n\nWhat warms my heart is that these morons are getting consistently downvoted. Keep strong my brethren and see you in Valhalla\n\nThe stock crashes frequently, but make no mistake, every time it rises again like a phoenix, stronger and higher.\n\nThey may have the money and influence, but we have the truth and diamond hands on our side. Hold the fucking line. **There is no cost in holding shares long, but shorts are getting killed by borrow fees and clenched anus on a thought of infinite losses.**\n\n**P.S.** I kindly ask all the paper-handed spineless mofos to leave now to not play for shorties on every fucking dip\n\n**Edit:** oh wow, u/Durado deleted their account. For those who missed it: he was going on and on and on about how GME is a trash company and how he loaded up on puts. I might be getting paranoid but it seems like that there are a lot of these kinds of folks who keep commenting the same shit. Not engaging in a discussion, not genuinely tring to understand, not reading DD's and saying what they think. Just stupid pointless \"GME shit buy puts happy to see it burn\"",
        "subreddit": "wallstreetbets",
        "title": "Listen my GME brethren: they can keep the price down all they want, but we win in the end.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kfw3ze/listen_my_gme_brethren_they_can_keep_the_price/",
        "created": 1608362067.0
    },
    {
        "author": "DingLeiGorFei",
        "created_utc": 1608828783,
        "id": "kjikuv",
        "num_comments": 179,
        "num_crossposts": 0,
        "selftext": "I am Chinese, or used to be years ago at least by nationality. I am not going to post Chinese news article detailing the entire power struggle, just English. I mean, you monkeys can't read moon runes.\n\nYou see, the power struggle has been happening since Alibaba and Jack Ma became the ecommerce god of China, like Jeff \"the bald Grinch\" Bezos did with Amazon in America. China are commies, worshipping anyone but the party is illegal. That is why despite the profits and everything else, they are still sitting at 300+ and not flying like AMZN. Chinese know the power struggles all to well, smart ones will avoid it like plague. Not even Chinese boomers are touching it.\n\nhttps://asia.nikkei.com/Politics/Mystery-video-suggests-power-struggle-in-China\n\nThe previous power struggles resulted in Ma forced out of CEO position in 2018, cue lip service to western friends who don't give a fuck just to make sure BABA don't drop. \n\nhttps://www.google.com/amp/s/www.cnbc.com/amp/2019/10/18/alibabas-jack-ma-spent-10-years-preparing-for-his-retirement.html\n\nBut like anyone who had felt the power trip of being the richest and most powerful man before, Ma could not stay retired and out of the limelight for long.\n\nSo he came out of retirement with the biggest fintech IPO in Asia, Ant Group. Now, that really pisses the Emperor off. Recognising his efforts in revolutionalizing ecommerse, Emperor Xi decided to let him spend the rest of his life in retirement... like a charity case. Yet he decides to step in limelight again, and overshadow the most ~~paranoid and insecure~~ powerful man in all of China?! Well Emperor is the party and party is the Emperor, now Emperor finally decides that you must be removed. Especially when they are showing the entire China the power and money capitalism brings. Cue CCP vs CEO power struggle round 2, except this time they are clashing in the open.\n\nhttps://asia.nikkei.com/Editor-s-Picks/China-up-close/Analysis-Xi-sees-Alibaba-and-Tencent-as-rising-threats-to-power\n\nSo what happens?\n\nBuy the dip??\n\nCut losses and run???\n\nAnswer is simple:\n\nIf you are holding stocks then just keep holding it. BABA isn't going anywhere, they are the ecommerce monopoly along with Tencent in almost the entire Asia. The dip will not stop until power struggle turmoil is over, it will get even uglier over the months as Politburo falsify more charges to threaten the CEOs to back down.\n\nRecover your call losses with puts, it really is that easy.\n\nI have no options in it because I hate commies and know how they work. So until there is a clear winner in the power struggle, I am not gonna be a bad retard. If you want to listen, cool. If you think it's the dip you were waiting for, good luck with welfare because I tried. Then again I YOLO 50k each on GME and PLTR so what do I know? 🚀",
        "subreddit": "wallstreetbets",
        "title": "Hello $BABA holders, please don't $ROPE",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kjikuv/hello_baba_holders_please_dont_rope/",
        "created": 1608857583.0
    },
    {
        "author": "javonbangs",
        "created_utc": 1606877695,
        "id": "k50naf",
        "num_comments": 178,
        "num_crossposts": 0,
        "selftext": "I am a newbie and got too excited Monday morning thinking it was mooning from all the hype off this sub and bought at 18.46. Then quickly regretted it once it dropped to 16. \n\nAny thoughts on what it's gonna do this week? I know I'm gonna get some push back for this but, if it rises again to 18+ would it be wise to sell then buy back in when it dips back to 16? Or is this retardism and I'm going to get scorched for even saying this?",
        "subreddit": "wallstreetbets",
        "title": "Anyone else make the mistake of getting into GME at $18+???",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k50naf/anyone_else_make_the_mistake_of_getting_into_gme/",
        "created": 1606906495.0
    },
    {
        "author": "TheManzet",
        "created_utc": 1608398562,
        "id": "kgbvuw",
        "num_comments": 172,
        "num_crossposts": 0,
        "selftext": "I downloaded the most recent SEC Fails-to-Deliver Data and did some real basic statistics  on it.\n\n[Sourced from SEC Fails to Deliver Data - Late November](https://preview.redd.it/qh68ow3wg6661.png?width=929&amp;format=png&amp;auto=webp&amp;s=062de5e7d1204d9b12ee7660a49c0bb3c623a395)\n\nIgnore the weighting column, I just had to do that to get the weighted averages.\n\nIf this is useful, I can do updates as new data is released\n\n  \nObligatory: **GME** 🚀🚀🚀🚀🚀🚀🚀🚀",
        "subreddit": "wallstreetbets",
        "title": "GME gang is in a battle with the shorts. Here's how the shorts are doing",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kgbvuw/gme_gang_is_in_a_battle_with_the_shorts_heres_how/",
        "created": 1608427362.0
    },
    {
        "author": "dildoflexing",
        "created_utc": 1608843577,
        "id": "kjmqek",
        "num_comments": 171,
        "num_crossposts": 0,
        "selftext": "Guys, I’m sorry I did not do a good job at painting the picture yesterday. I was pretty tired from a 4 hour hike and I really wanted to put it up earlier than later so more people would be exposed to it.\n\nA lot of what I wanted to deliver got lost in the ‘Amazon vs GME’. I see it myself. Thank you to all that offered constructive criticism.\n\n**If you still have any doubt that Gamestop is going back down to $16.00, I invite you to take a few minutes to read this as this would put the concern to rest. This DD is a bit longer, but I have never been more confident that this would put your concern to rest.**\n\nHere we go:\n\n**The Future of Gamestop/PowerUP**\n\n**How many of you guys have one of these? Phones, GoPro, drones, VR gear, tablets, gimbal stabilizer?**  \n   \n Of those who answered yes which would be everyone, how many of you did one of these with the old device when you upgraded?\n\n A) Sold it on eBay and hoped to god every day you don’t get scammed until they could no longer open a case against you or pray USPS doesn’t lose the item or get delayed and have the buyer open a return/case as a result. \n\nB) Sold it on Craigslist/Facebook/Kijiji and dealt with time wasters/low ballers/no-shows blowing up your phone which could only made you look popular in front of your crush only to finally have someone show up to offer you $50.00 less than your price which you clearly stated was a FIRM price because of a scratch you mentioned in the ad was ‘worse than they thought’ or that’s just all they had.\n\nC) Gave it to a friend/relative/stash it in your drawer because you can’t be bothered with A or B\n\nD) (Phones only) Don’t really love your friends/relatives as much as you love what you can do with the cash/they don’t want it more than you want the cash but don’t want to deal with A or B so you just took a lowball offer At&amp;T, Verizon…etc gave you which was easily $100\\~200 below the fair market price?  \n   \n  **How many of you guys are ok with buying one of those devices used but you ultimately end up buying new because of:**\n\n A) Getting scammed, buying a fake device/something being broken… etc etc\n\n B) You can’t be bothered to deal with sellers who are not honest in their description. \n\n C) The ideal unicorn seller is too far away.   \n   \n **Can you relate? Of course you can.**\n\nOne day you buy a 1080P drone, next year they come out with 2.7K, next year they come out with 4K, year after that they come out with a 4K that fits in your pocket, and you can’t help but feel like you are just living in the past, or at least, left feeling like you are holding the bag like you bought PLTR at $29. \n\nI have some of those devices, and I end up upgrading AT LEAST one of them every 1\\~2.5 years just like you.  \n \n\n*  Wouldn’t it be nice if there was a place nearby that you can just go to get a fair value for your trade in (maybe $50 less than you could get online but you don’t have to waste any time)? \n*  Wouldn’t it be nice if there was a brick and mortar place nearby you can count on that can’t just change their number/disappear tomorrow, have the ability to deliver your order to you in 1 hour AND offer returns AND offer 90 days warranty? What? I can buy extended warranty too?  \n* If there was one, and you just had to pay $50 on top of what you could find them for online otherwise, would you really bother with anything else? Would anyone?   \n   \n \n\n**Don’t think about Gamestop for a second and be honest with yourself. If you answered yes to all 3, upvote this post. If you answered no to any of the above, just give it some time. You just haven’t experienced the inconvenience/pain yet.**\n\n Ok, I get your point but there is no one that can offer something like this. Not **yet.** \n\n Look, I know back in our days, Gamestop is where you went to get hustled but that’s going to change 180.’ Gamestop will change its name to “PowerUp” to be relevant in the broader consumer electronics field while retaining its gaming foundation.\n\n So Ryan Cohen showed you guys that he’s serious about buying Gamestop upping his stake recently. It also said in 13D that he will do whatever is in the shareholders’ best interest. There was no new 13D posted today. **Meaning? The price rise was organic this week. Not from him buying. Shorts shook you a couple of times. You guys held. You guys did very good.**  \n\n\nHave you ever looked into what Chewy does in terms of customer service? Have you read up anything about Ryan Cohen to see what he/his father stands/stood for when it comes to customer experience? They are about selling goods that will make the customer the most happy not selling stuff that makes the most profit, funny enough, profit follows when you give customers what would make them the most happy and you end up making the most profit anyways. I speak from experience. \n\nWhat made Bezos so successful is his focus on customer experience also. All entrepreneurs out there, please remember my spiel about customer experience at least. It’s the realest thing I or anyone can tell you. Do not ever fight with customers. Kill them with kindness if anything.  \n\nI bet you my last dollar this is what Cohen sees in Gamestop. The locations, the brand presence, 55M PowerUp members many of whom are already cultured on going through Gamestop’s revolving door because you get more store credit than cash and you are just accustomed to it. \n\n**But c’mon man $50? How is the company going to make any money?** Look at the spread between bid and ask. It’s $50 each way from the mid-price (fair market price). That’s $100.00 profit for the company.\n\n Still, only $100.00? Yeah, that’s actually 2X what they make off of console sales. \n\nEvery one of you, I know you said yes to my questions above, so do the math, upgrading at least one of the devices every 1\\~2.5 years. Under this vision, it will be like 10 new consoles are being released every year for Gamestop AT LEAST. It will AT LEAST outdo BestBuy 26.55B market cap. Meaning Gamestop will do at least 20X within the next 5\\~10 years. \n\n**“Yeah but Amazon sells used too? Didn’t you see?”**\n\nNot like this. Used items on Amazon is more like buying stuff on eBay. Often relying on the seller’s description and the seller’s shipping. Can you drop your item off to Amazon and get cash? No\n\nImagine, the items are accurately described, it arrives in 1 hour via Doordash/Uber eats and there is no fuss no muss.\n\n Then, after you bought the device, they just do this 1 simple thing. \n\n 1 week after you bought the thing they send you a text   \n   \n *“Hey Autist, just wanted to check in, how’s your new dildo flexing so far? It’s gwon? Iight, good to hear. We are here if you have any questions/concerns. Have a nice day”*\n\nCohen will do at least this. I guarantee you, except he will add some more personal/relatable touch like “the 4K 69 Mega Pixel camera on that bitch really is something else huh?” As a cherry on top, there it is, one thing we can’t mistake as anything else. A FUCKIN ROCKET EMOJI at the end of the message. Wouldn’t you feel loved?  🚀 \n\n**Oh yeah, add this to the books.**   \n  With millions of us retail WSB autists holding GME, think about what that does for the PR when the squeeze happens and it WILL HAPPEN because $16 is where all the shorts are under water, and we ARE NEVER going below that. They’re paying fees right now and they will eventually cover. \n\nGood chance the squeeze will happen like Tesla’s, 4X ing+ over a couple of months as they start to prove their vision and show that they are there to stay. (Source A). This is how it typically squeezes against diamond hands, diamond balls institutional shorts. 10X ing++++ as they bring their vision to reality. \n\n&amp;#x200B;\n\n[See October 19 to Feb 20](https://preview.redd.it/zag3ukfz57761.jpg?width=959&amp;format=pjpg&amp;auto=webp&amp;s=ba0b9ad0b7878c5f6fd49829d2fe16e719320ee4)\n\nThat is, of course unless Cohen was just waiting for the new year for tax purposes to announce that “oh yeah guys, I actually have enough options, shares now to buy the company”  \n\nHe rides the squeeze, sell 25% shares, profit from that alone will pay for the business acquisition when it comes back down to its value as it is today of around $0. The positive profit they would MOST CERTAINLY generate from this console cycle will more than pay for the restructuring. He still remains a major shareholder with 25%. His best interest will always be scaling GME. Sherman for example, he owns 2% Bezos owns a little over 10%\n\n**Do you want to think really long term?**\n\n YouTube knew from Day 1 they were going to put ads one day, but they wanted to make it as sweet as possible for it to be engrained in you first – think video, think Youtube.   \n   \n  The day will come, think upgrading your device, whether it is new or used, think **PowerUP (more suitable name than Gamestop while retaining the gaming image)**\n\n   My point is, that they can increase the $100 spread if they wanted to if you are still so hung up on making only $100/device when I could easily run around myself as a nobody with no store, no reputation and flip 20 devices/week. Try it. Consumer electronics is SUPER LIQUID.   \n     \n   How about this? When you bring your trade in, you get only $50 less than the classifieds’ resale value when you take store credit, but if you want cash, we can only give you $75 less than the classifieds’ resale value  \n   There, I just made the spread 50% more, $150 profit/device for Gamestop, and I made you more likely to return. Happy? \n\nBezos knew he wasn’t going to sell just books down the road.  \nElon Musk knew he wasn’t signing up to build just cars.   \nSuccessful business people like Ryan can anticipate moves years down the road. \n\nThe sky is the limit.\n\n**We are just at the beginning, and I'm not done yet.**   \n**You think I'm out to lunch? They're already getting started (as mentioned in Pt2 of my DD). If you really can't relate, it's ok, it's probably because you are deep in #1 (as mentioned in Pt1 of my DD)** \n\nMy position:  Shares as well as options JAN 15 15C, 30C, APR 16 30C. GME makes majority of my port. \n\nP.S :   \n\n   Ryan, if you are reading this. I know you see the picture because it's the obvious picture. I’m in the space, and you’re right on the money in regards to the things you preach and do in regards to customer service/customer experience.   \nI got some ideas I can offer from writing these DDs, I see where you can save in shipping, how the listing ‘system’ should be so all employees can take pictures and describe the items with consistency like how all McDonalds employees can make burgers with consistency… etc etc just to start. Feel free to reach out to me.  \nNo? Ok, you will compete with me a few years down the road. Just kidding.   \n   \n**To all you guys &amp; Ryan. Happy Holidays/Merry Christmas.**   \n**Wishing you and your family nothing but the best this holiday season, yours truly**   \n\n\n**- Dildoflexing (You can call me Greendildoflexing when it squeezes)**  \n\n\nSource (A)\n\n[https://www.forbes.com/sites/danrunkevicius/2020/07/20/tesla-stock-may-be-rallying-for-this-absurd-reasonand-this-wont-end-well/?sh=f57ad4767a66](https://www.forbes.com/sites/danrunkevicius/2020/07/20/tesla-stock-may-be-rallying-for-this-absurd-reasonand-this-wont-end-well/?sh=f57ad4767a66)",
        "subreddit": "wallstreetbets",
        "title": "GME DD fresh perspectives Pt 3 Future of Gamestop + Squeeze teaser. Christmas Edition.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kjmqek/gme_dd_fresh_perspectives_pt_3_future_of_gamestop/",
        "created": 1608872377.0
    },
    {
        "author": "CPTHubbard",
        "created_utc": 1607454762,
        "id": "k9apx5",
        "num_comments": 171,
        "num_crossposts": 0,
        "selftext": "I posted this on stocktwits and in another comment thread, but given the feedback I've received, I thought I would create a new post to let this august community think Deep Thoughts about all of this as we approach the moment of truth.  I'm not a social media guy so I usually don't get how all this shit works - just a 40-year-old lawyer who hates his job and sees a ticket out.  Do your own DD and figure your own shit out.  But the time is drawing nigh here for GME.\n\nTo start, I have 20,000 shares and 570 April 20/25Cs across three separate accounts. I also picked up about 100 calls for Jan/late Dec this week just for the hell of it (fuck IV crush when you’re boarding a rocket). I'm holding the all through ER. This could prove to be folly or it could make me very rich. I’ll know pretty soon.\n\nI know there has been some discussion of this here and there, but I find the psychological profiles of the folks in this situation to be very interesting--particularly because both Sherman (current CEO) and Cohen know that, fundamentals aside, this thing is sitting on a powder keg with the short %. But first take Cohen. Boy genius who builds Chewy with his smarts and an ethos dedicated to care for the customer. Beats Amazon in this niche area because he outworked and outsmarted everyone. Worked super close with his Dad, who sounds like an amazing businessman with an old school ethic about treating customers/employees well. After building this juggernaut he sold it for 3Bil. Dude did all of this before he was 33. Then says screw diversification and YOLOs into Apple and Wells Fargo. Apple goes berzerk and splits and he makes more millions. All the while watching and waiting for something new to come around.\n\nAnd then almost exactly a year ago, Cohen’s Dad dies. There are many interviews when he talks about this: his Dad was only 69 and he is barely 35 and that’s early as shit to lose your father and best friend. Do not underestimate what that can do to someone and what lessons one might take from that or how that person feels now barely a year away from that happening. Cohen clearly reveres his Dad for his hard working ethic and how he taught him tenacity when you know you’re right. So Cohen finds GME and he sees that this brilliantly set-up company in an explosive growth sector has been run into the ground by prior management. He thinks he knows the way out: the “Chewy-fication” of GameStop – efficient, customer-focused ecommerce sector domination. So he takes a big stake and then talks to Sherman and explains what needs to happen to save this company.\n\nAnd if the letter he sent last month reflects reality and is not posturing, Cohen is rebuffed a bit. Maybe Boomer Sherman doesn’t like the cut of his jib and patronizes him. Maybe Cohen didn’t like Sherman’s focus on short term profit at the expense of building long-term customer loyalty (the one of two trucks his Dad talks about, which Cohen cites frequently in his interviews). Who knows. But whatever it was, being rebuffed seems to piss Cohen off--judging by the tone of that letter. Oh, and he’s made it known that he has hired basically the top activist investor/takeover law firm and attorney in the country. So he puts Sherman in the hot seat: outline your plan to make GameStop what I know it can be as soon as possible. He knows Q3 earnings is in three weeks when he sends that letter. He’s saying: Don’t you let another conference call go by without outlining this plan. Or else.\n\nAnd the “or else” is of course all speculative. But I do not think that the “or else” is Cohen selling his shares and sulking home pissed off that these mean Boomers didn’t do things the way he wanted them to do. No, I think this guy drinks Sherman’s fucking milkshake, takes this thing and shows the world how it’s done. He’s got the eye of the tiger, he’s still in that young and crushing it phase. He’s got his Dad, his Obi-Wan, guiding him on this. So he’s going to do this right. This is his moment and I think he sees that. He’s watching his baby Chewy with a MC of $30M. He knows he can do that or better with GME. And he is not going to take no for an answer.\n\nThen take Sherman. Dude has been Mr. Big Shot Hired-Gun CEO for a while now. Brought in to right this ship and Be The Man. And just as he starts to turn around this company—the moment he has been waiting for these difficult past 1.5 years (THE NEW CONSOLES ARE HERE!). And he knows that he's going to be able to show shareholders that he can turn this thing around. But then this Chewy billionaire startup bro who is probably the same age as his children comes in and starts trying to tell \\*him\\* how to run a major public corporation. The nerve of this kid. Then, to make things worse, as Sherman prepares for the console release season and the Q3 earnings call, Cohen writes a scathing public letter attached to his 13D that calls out GameStop for being run by idiots and calls out Sherman specifically for being an out-of-touch boomer who doesn’t know the value of what he even has or what to do with it.\n\nAnd this kid demands another strategic review and a public response on the obvious direction that Sherman needs to take the company. Sherman is not dumb. He knows who Cohen’s attorney is and he knows what Cohen is implying in that letter and the money Cohen has. Sherman now knows that the time he has to show shareholders he can turn this thing around has now shrunk. It’s go time. New consoles are out, Q4 numbers are likely to be through the roof and you have to address shareholders for the Q3 earnings call – one that everyone knows is likely to be a dud since it was pre-console cycle. So it’s a gimmie on numbers anyway. What self-respecting Master of the Universe hired gun Boomer CEO would just wilt under this pressure and fail to give every possible piece of good news to try to show shareholders his worth? The wolf is at the door and wants you in the unemployment line because you’re out of touch. Do you go quietly into the night?\n\nOr do you give this punk-ass Millennial Start Up Bro a lesson that You Don’t Mess With the Shermanator? It would be an extraordinary act of self-sabotage if Sherman gave some cagy milquetoast guidance along with some middling Q3 numbers. It’s almost unthinkable. If GameStop has something good to talk about tomorrow, I’m guessing we hear all about it loud and clear. All Sherman’s incentives – financial, ego – point to him trying to knock it out of the park with Q4 guidance. If Sherman doesn’t take this golden opportunity to show his worth and start this squeeze, he deserves everything that’s coming to him. But even though I’d jump at the chance to see Cohen at the helm long term, I’m guessing he gives it his all since the possible outcomes aren’t hard see here. We will know soon if Sherman is a dead man walking or the temporary Hero and Savior of Gamestock, first of his name. And all the while, Mr. Moneybags Ecommerce Boy Genius watches and waits.\n\nThis is going to be fun to watch, to say the least.",
        "subreddit": "wallstreetbets",
        "title": "GME Q3 Call Thoughts on the clash between Cohen and Sherman [Insert Rocket Emoji Here]",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k9apx5/gme_q3_call_thoughts_on_the_clash_between_cohen/",
        "created": 1607483562.0
    },
    {
        "author": "Kenney420",
        "created_utc": 1608029043,
        "id": "kdjj8u",
        "num_comments": 169,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "How it feels to be a GME shareholder",
        "url": "https://gfycat.com/frenchunequaleddogwoodclubgall",
        "created": 1608057843.0
    },
    {
        "author": "Global_Caterpillar44",
        "created_utc": 1609345810,
        "id": "kn5d77",
        "num_comments": 167,
        "num_crossposts": 0,
        "selftext": "As a GME holder, been thinking about what will have to happen to cause shorts to change their investment thesis. Part of it could be a change in timeline, if GME lasts 5+ years rather than the 1-2 years shorts expected, that could be enough to change an investment thesis. Another is that regardless of timeline, shorts probably compare GME to Blockbuster and no matter how long, it's gonna be toast. So even though GME is undervalued right now they obviously do need a strategy for a long-term position in the gaming industry with games becoming more digital. \n\nMaybe they create an E-sports gaming hub? Maybe they successfully transition to being an online gaming retailer with a new strategic partnership with Microsoft? With the promising 200+% online sales growth, there's a real chance the 2nd option could happen without a major change. \n\nSo to the GME shorts lurking, what would it take for y'all to change your thesis?  Also what're y'all gonna do if/when the comparison goes from Blockbuster to Netflix?",
        "subreddit": "wallstreetbets",
        "title": "What will it take to change GME shorts investment thesis?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kn5d77/what_will_it_take_to_change_gme_shorts_investment/",
        "created": 1609374610.0
    },
    {
        "author": "Coffee4thewin",
        "created_utc": 1608671735,
        "id": "kie9yn",
        "num_comments": 166,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Me getting 2% in TSLA today while GME gets 25%",
        "url": "https://i.redd.it/rjz20nke1t661.gif",
        "created": 1608700535.0
    },
    {
        "author": "robbinhood69",
        "created_utc": 1607442723,
        "id": "k96n2a",
        "num_comments": 166,
        "num_crossposts": 0,
        "selftext": "if ur like me ur networth is gonna change for worse (or maybe even better) in like 6 hours and probably oscillate wildly through the week. How are you playing earnings? The OI on this option chain is literally fucking insane btw. Within 2 dollars of current price there are 15k put options expiring this week and 9k call options, which notionally control 2.4 million shares so like 3 or 4% of float or whatever\n\nNext week has an even more absurd amount of put options OI - fucking 30k of put options within 2 dollars of current share price, only 10k of call options so 4 million shares notional\n\nThat's straight up 10% of float that is in options within 2 dollars of share price expiring within the next 10 days, this shit is gonna be volatile af and I wish I knew how to figure out how to play tomorrow but alas I'm too dumb, as IV gets crushed though all these strike points are going to become pretty strong gamma inflection points is my guess\n\nCatalysts for today's call\n\n* Management still hasn't really given Microsoft revenue details\n* Addressing Cohen's concerns\n* GME stopped buybacks until 2021 but given the new administration which may try to limit buybacks is there a chance that management yeets their roll into share buy backs before Buyden and co. run things?\n\nHow are you playing earnings? Anyone looking to buy any dips in AH? \n\nI'm pretty much just standing pat rn, maybe 10% of my position is in calls expiring January and the rest are further out calls/shares so I'm just gonna ride this thru if we dip hard and probably cry to you all about it or whatever. Don't really have much more money left to buy any dips unfortunately",
        "subreddit": "wallstreetbets",
        "title": "Earnings pre GME thread",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k96n2a/earnings_pre_gme_thread/",
        "created": 1607471523.0
    },
    {
        "author": "nurse_with_a_dick",
        "created_utc": 1607899917,
        "id": "kckr5i",
        "num_comments": 165,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/8hhos97281561.png?width=1074&amp;format=png&amp;auto=webp&amp;s=ecc46623fff9f43e96450e0b71d4cd546d9f1e88\n\nalright listen up simps, if you're tired of chasing pltr, gme, and camgirls, here's something better to throw your parent's hard earned money at: HZON\n\nHZON or Horizon Acquisition Corp is a SPAC led by Todd Boehly(5 billion dollar net worth, owns the LA Dodgers), Ex-Netflix VP of 20 years Cindy Holland, and DKNG CEO Jason Robins.\n\nthey just launched recently and now's your fucking chance to get in near NAV. NAV literally means it can't go tits up. don't believe me? read a book you fucking retard\n\nas you can see, they're targeting a merge with a business in the media and entertainment live-streaming industry. what's the only real viable option here? onlyfans. \n\nbut op, you say, why would i want to buy stock for a camgirl site? well \\[according to bloomberg\\]([https://www.bloomberg.com/news/articles/2020-12-05/celebrities-like-cardi-b-could-turn-onlyfans-into-a-billion-dollar-media-company?utm\\_content=business&amp;cmpid=socialflow-twitter-business&amp;utm\\_source=twitter&amp;utm\\_campaign=socialflow-organic&amp;utm\\_medium=social](https://www.bloomberg.com/news/articles/2020-12-05/celebrities-like-cardi-b-could-turn-onlyfans-into-a-billion-dollar-media-company?utm_content=business&amp;cmpid=socialflow-twitter-business&amp;utm_source=twitter&amp;utm_campaign=socialflow-organic&amp;utm_medium=social)) onlyfans will generate over 2 billion dollars in revenue this year. also, everybody knows about it so this shit will fucking moon harder than a 13 year old's dick that just paid for belle delphine's onlyfans\n\ntl;dr hzon will very possibly merge with onlyfans, get the fuck in here before it takes off",
        "subreddit": "wallstreetbets",
        "title": "Brand new SPAC headed by Netflix VP/DraftKings CEO and rumored to merge with OnlyFans: $HZON",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kckr5i/brand_new_spac_headed_by_netflix_vpdraftkings_ceo/",
        "created": 1607928717.0
    },
    {
        "author": "R-Kayde",
        "created_utc": 1609290083,
        "id": "kmrezo",
        "num_comments": 165,
        "num_crossposts": 0,
        "selftext": "  \n\nWell GME gang… here we are. Yesterday, the gay bears fired a warning shot across our bow, and we ignored it. Our cash-colored glasses blinded us from seeing the true intent behind their perceived tomfoolery. We dropped our guard and became too comfortable with our gains and the positions we held with our hands of diamond. Our neglect to respond to that act gave them all the confidence they needed to launch a full out assault on GME Gang.\n\nThe result has been a true massacre. At exactly 0930 hours, Melvin Capital and their gay friends invaded our investment accounts and choked us with their girthy red bear dicks. We were unprepared for the attack, and, as a result, our army suffered mass casualties. We lost many of our brethren today. Men who had the best of intentions but the paper-iest of hands. Their tendies… lost to the ever-churning war machine.\n\nThe intent of the bears was not only to crush our spirits, but to offset some of their losses in order to regain the confidence of their boomer investors on their end-of-year report. This would, in turn, give them more ammunition to continue fighting this war. \n\nBut I have 5 words for those rainbow-dicked prostate smoochers over at Melvin:\n\nThe. Year. Isn’t. Over. Yet.\n\nYeah. That’s right. Tomorrow is December 30th. December FUCKING 30th. Twenty MOTHERFUCKING TWENTY.\n\nIt’s time to remind them that we own &gt;5% of this fucking company, and we make the fucking rules.\n\nRally the troops. All of them. Theta gang. r/investing. Your fucking grandma. Everyone. Tonight we ride across the digital countryside like PAUL FUCKING REVERE and spread the gospel of u/DeepFuckingValue LIKE IT’S FUCKING COVID. Let every autist with a Robinhood account and boomer with a 401k alike know that THE SQUEEZE IS UPON US AND WE MUST BUY SHARES TO FULFILL THE DESTINY OF DADDY COHEN.\n\nLet tomorrow be a day of reckoning for bears across the globe. Show them that the strength of our collective retardation knows no bounds.\n\nToday, we are retards. Today, we are low-functioning autists. Today, we eat tendie scraps in the basement.\n\nTomorrow, we are the market makers. Tomorrow, we are our wife’s boyfriends. Tomorrow, we dine in VALHALLA.\n\nRETARDS.\n\nTOGETHER.\n\nSTRONG.\n\nRALLY CRIES IN THE CHAT MOTHERFUCKERS!",
        "subreddit": "wallstreetbets",
        "title": "Rally Cries for GME Gang!!!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kmrezo/rally_cries_for_gme_gang/",
        "created": 1609318883.0
    },
    {
        "author": "Bombayzayy",
        "created_utc": 1609205596,
        "id": "km4108",
        "num_comments": 162,
        "num_crossposts": 0,
        "selftext": "Many of you are heavily invested in GME taking off, myself included. However, what are good arguments, with facts and sources, to why it won’t hit the 🌘? \n\nI see many DD posts on why it will take off, and they all seem logical and have reliable sources, but just to be sure many of us make the right call of YOLOing GME, what are good counter arguments?",
        "subreddit": "wallstreetbets",
        "title": "Devils Advocate to GME mooning 🚀🚀🚀🚀 What are good reasons to why it will not take off?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/km4108/devils_advocate_to_gme_mooning_what_are_good/",
        "created": 1609234396.0
    },
    {
        "author": "meerupls",
        "created_utc": 1607958565,
        "id": "kczd0f",
        "num_comments": 159,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Well boys. I wanna end myself. Split losses from PLTR, NIO, SPCE, and GME. How will I recover..",
        "url": "https://www.reddit.com/gallery/kczd0f",
        "created": 1607987365.0
    }
]