[
    {
        "author": "73hebdhyd6h36dhld",
        "created_utc": 1588382704,
        "id": "gbwp6y",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "I'm a new investor. Here's what I plan to buy. I have long term and short-term strategies mixed in. I have missed the optimal buying times for a few stocks but I wasn't aware of them at the time. I know I could buy my long-term stocks now but I want to see how well they will survive over the next months, especially the airlines so I want to wait. I'm still trying to decide on what to buy. I don't have FOMO. I will take what I can get.\n\nBudget: 50k+ (as I earn more money, it will increase. The more money I have, the more stocks I can hold long-term)\n\nLength of time: 2-3 years and 10+ years. 2-3 years is not a set time frame. It is a general time I would like to pull out for short-term gains but I can keep it in there longer if it needs more time.\n\nI'm trying to learn as much as I can. I know the market will rally during crashes and bear markets can last 1-3 years. I have bought stocks in the past two months but I'm not used to holding stocks during a volatile market so I prefer to stay out so I don't have to worry about them Some of the stocks I want aren't going to move much in price anyway so I'm not in a hurry to buy them. Any suggestions for stocks or objections to the ones I currently have are welcomed.\n\nVZ 1k\nJPM 1k\nPYPL 1k\nLUV 2K\nUAL 2k\nDAL 4K\nSAVE 4k\nSPG 5k\nAirbus 5k\nCSCO 3k \nIMAX 3k \nPRU and/or AFL 5k (want AFL more than PRU)\n$36k so far\n\nOther stocks I was considering\nMA, V, WM, HON, TSLA, SPCE, JNJ, FLIR, TER",
        "subreddit": "stocks",
        "title": "What do you think of my tentative portfolio?",
        "url": "https://www.reddit.com/r/stocks/comments/gbwp6y/what_do_you_think_of_my_tentative_portfolio/",
        "created": 1588411504.0
    },
    {
        "author": "RobFrias",
        "created_utc": 1589399251,
        "id": "gj683u",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Hi everyone, first time posting here. I’ve been wanting to add biotech companies to my portfolio, but I read that its all highly speculative with them and couldn’t settle on a specific one.\n\nI found the iShares NASDAQ Biotech ETF (WKN: A2DWAW), but I’m not sure if I should jump in, since TER is a bit high (0.35%) and hasn’t really performed that well. \n\nAny thoughts about this ETF? Or about the Biotech sector as a whole?",
        "subreddit": "stocks",
        "title": "Opinions on NASDAQ Biotech ETF?",
        "url": "https://www.reddit.com/r/stocks/comments/gj683u/opinions_on_nasdaq_biotech_etf/",
        "created": 1589428051.0
    },
    {
        "author": "PartiZAn18",
        "created_utc": 1590101539,
        "id": "go7810",
        "num_comments": 4,
        "num_crossposts": 1,
        "selftext": "Hi all,\n\nWhat value added services would you like to see on your investment platform (or are already available and that you find useful)? Off the top of my head I'd like:\n\n- a properly customisable ticker widget for my phone;\n- a SENS announcement service, and notifications of important company dates (eg AGM date, dividend announcement and distribution dates etc);\n- a tool to show my portfolio balance (eg % local, foreign, equity, bonds, prop, etc) \n- a tool to show the weighing of constituents within ETFs, and importantly, overlap of constituents between different etfs\n- a tool to sort TER, performance, (further metrics?) of etfs\n- \n\nWhat about you folks?",
        "subreddit": "investing",
        "title": "Value-added services on your investment platform?",
        "url": "https://www.reddit.com/r/investing/comments/go7810/valueadded_services_on_your_investment_platform/",
        "created": 1590130339.0
    },
    {
        "author": "MK45124512",
        "created_utc": 1589301863,
        "id": "gievqq",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "weedstocks",
        "title": "New Normal: The cannabis industry (Video Interview w/ CURA, TER, others)",
        "url": "https://fortune.com/videos/watch/new-normal-can-the-cannabis-industry-survive-the-coronavirus-crisis/a22df4e1-e245-47b2-8455-617dfe9922f1?activePlaylistName=Latest%20on%20Coronavirus",
        "created": 1589330663.0
    },
    {
        "author": "supershare32",
        "created_utc": 1589825670,
        "id": "gm6u2o",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": " \n\nYou may open an account with any MF platform online and hit the road.\n\nAll the platforms provide numerous ETF options across market cap, sectors, themes etc.\n\nWhen selecting an ETF, do cosndier one with lowest expense ratio as ETFs are passive funds and it makes sense to save money by **investing** into least expensive (TER). For large cap or Nifty 50, SBI Etf is a good option as they are cheapest and reliable.",
        "subreddit": "investing",
        "title": "Do let me know in case of any other clarifications. Happy to share.",
        "url": "https://www.reddit.com/r/investing/comments/gm6u2o/do_let_me_know_in_case_of_any_other/",
        "created": 1589854470.0
    }
]