[
    {
        "author": "Anaranovski",
        "created_utc": 1582992939,
        "id": "fbeqbm",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "The following ix an excerpt from their 27 February 2020 newsletter.\n\nIt's been almost a year since **Fortinet (NASDAQ: FTNT)** was a Best Buy Now. Whereas many cloud computing and computer security companies are not profitable, Fortinet is an exception. Revenue in 2019 was up 20% year over year to $2.16 billion, with a GAAP operating margin of 16% and $2.14 billion in deferred revenue. \n\nInvesting in **JD.com (NASDAQ: JD)** has been quite a wild ride for investors holding on since its last BBN recommendation in May 2018. Between CEO/founder/largest shareholder Richard Liu's escapades in the news and the legal system, tariffs, and the trade war, investors couldn't be blamed for writing this company off as one for the too-hard pile. And then along came SARS-CoV-2, sparking pandemic fears that have led folks into self-imposed or mandated quarantines and causing the Chinese economy to slow down in a major way.\n\n**Jack Henry &amp; Associates (NASDAQ: JKHY)** was first recommended in August 2019. This steady market-beater has not changed much as a company, but we still like it. View this month's Best Buy Now as an opportunity to add or start a new position.\n\nOnce known as Minnesota Mining &amp; Manufacturing, **3M (NYSE: MMM)** hasn't exactly torn up our scorecard since being recommended in September 2017. Or maybe \"torn up\" is apt because the shares are down about 25% since David brought 3M to our attention. But don't let that keep you from considering a position today.\n\nIt may come as a surprise to many investors that mobile game developer** Zynga (NASDAQ: ZNGA)** didn't necessarily peak with its release of FarmVille, which blew up on Facebook (NASDAQ: FB) back in the late 2000s. Zynga has been at the forefront of a turnaround strategy for the ages — combining reliable gaming \"forever franchises\" like Words with Friends and Empires &amp; Puzzles with innovative new games like Merge Magic! has helped reinvigorate the company's revenue stream. This approach has so far proven its worth: Revenue grew 46% year over year after stagnating the past decade, and Zynga's strong cash position of over $1.5 billion means it has plenty of money to continue to invest in its future gaming franchises.\n\n----\n\nNotes:\n\nThis takes into account the market correction for the past week.\n\nFortinet\n\n* In the 1-yr period, has only outperformed the S&amp;P 500 since November 2019\n* In the 5-yr period, has only outperformed the S&amp;P 500 since February 2018\n\nJD.cm\n\n* In the 1-yr period, has only outperformed the S&amp;P 500 since October 2018\n* In the 5-yr period, has under-performed the S&amp;P 500\n\nJack Henry\n\n* Has outperformed the S&amp;P 500 in the 5-yr period, but barely kept pace in the 1-yr period.\n\n3M\n\n* Has under-performed the S&amp;P 500 in the 1-yr and 5-yr periods.\n\nZynga\n\n* Has pretty much outperformed the S&amp;P 500 in he 1-yr and 5-yr periods, but only slightly until the past year.",
        "subreddit": "investing",
        "title": "The Motley Fool: David's Best Buy Now For February",
        "url": "https://www.reddit.com/r/investing/comments/fbeqbm/the_motley_fool_davids_best_buy_now_for_february/",
        "created": 1583021739.0
    },
    {
        "author": "MarkBrooklyn",
        "created_utc": 1582308298,
        "id": "f7ezha",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Based on the chart at this link, JKHY (Jack Henry &amp; Associates) has been growing pretty consistently since 2002. I like stocks like this. But looking at the P/E ratio and dividend yield, I think it may be a little overpriced. I get that tech, and especially financial tech, is really hot right now but I find the valuation a bit risky if I'm going to hold them long term.\n\nAnyone have recommendations for similar stocks? Steady growth trend not linked to economic cycles but at a better valuation?\n\n [https://www.gurufocus.com/news/528189/a-deep-analysis-of-6-fivestar-companies](https://www.gurufocus.com/news/528189/a-deep-analysis-of-6-fivestar-companies)",
        "subreddit": "investing",
        "title": "Consistent revenue growth stocks: JKHY - nice growth recently (5%,6%), growing since 2002, but dividend yield a bit low and P/E ratio a bit high: provides financial tech solutions",
        "url": "https://www.reddit.com/r/investing/comments/f7ezha/consistent_revenue_growth_stocks_jkhy_nice_growth/",
        "created": 1582337098.0
    }
]