[
    {
        "author": "pacosteles",
        "created_utc": 1578325244,
        "id": "ekvqb6",
        "num_comments": 87,
        "num_crossposts": 0,
        "selftext": "This time last year, Slack Technologies, the popular workplace chat provider, was one of the most eagerly anticipated public tech debuts of 2019. That seems like a long time ago. Since Slack went public in June, its stock has dropped about 40%.\n\n\nThe reason for the slump: Revenue growth at Slack is slowing and competition is intensifying, especially from Microsoft. The tech giant is relying on a familiar tactic—bundling a Slack killer with a widely used existing product, its Office 365 suite of apps. Given that competitive pressure, I predict 2020 will be the year that—after years of acquisition speculation—a larger tech company will finally buy Slack.\n\n\nPotential suitors could include Amazon—which has reportedly eyed Slack in the past—and Google. Both companies are top providers of cloud computing services and could plug Slack into their cloud units to increase the revenue they generate from online applications. \n\n\nAlready a big Amazon cloud customer, Slack has committed to spending a minimum of $250 million with the Amazon Web Services division between 2018 and 2023, according to regulatory filings. Becoming part of Amazon could help Slack—which is currently unprofitable—trim some costs.    \n\n\nCisco Systems and Salesforce, both of which could use a spark to fire up their collaboration software businesses, might also make sense as acquirers. Both companies have relationships with corporate chief information officers that could open the door to customers in the Fortune 500. \n\n\nA Slack purchase would be a sizable deal. Slack has a market capitalization of just over $12 billion, although its management would likely push for a higher price. One benchmark they might point to: A few weeks before it went public, Slack was valued in private market trades at about $19 billion. At that price, Slack would be the largest acquisition ever for the likes of Amazon, Google, Cisco, and Salesforce.  \n\n\nOne company that likely won’t buy Slack is the company that would arguably be most responsible for its sale: Microsoft. Owning Slack, along with its in-house Slack competitor, Teams, would give Microsoft a dominant position in workplace collaboration software. Microsoft reportedly considered offering an $8 billion bid for Slack in 2016 before deciding to funnel more investment into building out Teams. \n\n\nBut I’m skeptical that Microsoft could pull off such a deal. Gaining regulatory approval would be an ordeal, if not impossible, because Microsoft already offers a directly competitive product. Microsoft went through the antitrust wringer two decades ago and is happy to avoid joining other big tech companies in the regulatory spotlight now. \n\n\nSpokespeople from AWS and Salesforce declined to comment. A Microsoft spokesperson didn’t have a comment. Spokespeople from Cisco and Google didn’t respond to requests for comment. \n\n\nIf Slack CEO and co-founder Stewart Butterfield doesn’t want to sell, he will have to find a way to win back investor confidence. Clearly what is worrying Wall Street is Slack’s slowing revenue growth and increasing losses. \n\n\nThe company’s annual sales grew 110% in fiscal 2018, which ended last Jan. 31, from the prior year. In fiscal 2019, that figure fell to 82%. In its most recent earnings report, Slack forecast that revenue growth for fiscal 2020 will fall even further to around 55%. Meanwhile, its net loss rose to about $88 million in the third quarter, from nearly $48 million a year earlier.\n\n\nSlack has spread like wildfire as a business tool largely through a free version of its product. To continue to grow, it must find ways to convince these users to become paying ones. During its recent earnings call, for the quarter ended Oct. 31, the company said it had 105,000 paying customers, up 30% from the same period a year earlier. \n\n\nIn an interview, Daniel Newman, founder and principal analyst at Futurum Research, said Slack’s early growth was partly due to developers’ frustration with the limitations of older products like Microsoft’s Skype and Cisco’s Webex. Now, with Microsoft pouring money into Teams and making improvements to the product to entice large companies, Slack has to work much harder to attract customers, he said. And a host of younger companies, such as Zoom and Asana, and open source startups, including Mattermost and Rocket.Chat, also offer workplace collaboration tools. \n\n\n“There is a lot of competition in the collaboration space right now,” Newman said. \n\n\nThe growing competition highlights another issue for Slack. Having captured a loyal following of developers and technical users through word of mouth, it is now spending heavily on sales and marketing to show how its software can help companies be more productive. During the third quarter, its sales and marketing expenses jumped 42% to over $96 million. \n\n\nMicrosoft appears to have gotten into Butterfield’s head. This first became apparent in 2016 when Slack took out a full-page ad in The New York Times to “welcome” Microsoft to the market around the time it introduced Teams. More recently, Butterfield has sounded a defensive note on earnings calls, pointing out that Slack has to earn every customer and can’t rely on bundling its product with other business applications, as Microsoft does. \n\n\nHe often pushes back on Microsoft’s framing of its daily active user numbers for Teams, claiming that the company muddies the waters by counting people who make voice calls using Skype. Slack’s usage figures more accurately reflect the deep level of engagement its users have with the service, according to Butterfield. “The confusion is deliberately created,” Butterfield said on Slack’s recent fiscal third quarter earnings call with investors. \n\n\nWhatever the reason, Butterfield faces a choice: Keep fighting or surrender by selling.",
        "subreddit": "wallstreetbets",
        "title": "Why Slack Will be Acquired",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ekvqb6/why_slack_will_be_acquired/",
        "created": 1578354044.0
    },
    {
        "author": "Necarad",
        "created_utc": 1580475525,
        "id": "ewo44q",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "2020 Dog of the Dow list:\n\nMMM            CVX\nXOM              IBM\nDOW              PFE\nWBA              KO\nCSCO            VZ\n\n\nLooking to buy 100 shares of one and write weekly 1-2% OTM specifically looking at the dogs.  As the profits from the calls will buy shares of the other dogs.  \n\nIntent is to hold said company until it appears it may get booted out of the Dow 30 list.\n\nCurrent DD: WBA personally get scripts filled there.  TA suggests it’ll go down to $50/$51 then rebound (May have hit yesterday).  Also have a 0 DTE $52 call.\n\nMMM very low institutional ownership, makes me Leary that price will be move volatile than others.\n\nVZ: I didn’t think ER looked bad have a 0 DTE $59.5 call\n\nCVX: lotto 115 call 0 DTE \n\nCSCO: 0 DTE $47.5 call need to chart yet\n\nPFE: Thinking it’s near it’s low and set to rebound to $40-$42. Holding a 0 DTE $37 call",
        "subreddit": "wallstreetbets",
        "title": "What Dog of Dow to buy?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ewo44q/what_dog_of_dow_to_buy/",
        "created": 1580504325.0
    },
    {
        "author": "t3chb1zn3ss",
        "created_utc": 1580458094,
        "id": "ewl7aj",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "If you had 25K to enter the market tomorrow, what would you invest in?  Why?\n\nI'm interested in seeing what the responses will be.\n\nThese are the stocks I've been swinging lately:\n\nAAPL, ACN, ADSK, AMD, AMZN, BABA, BR, BZUN, C, COLL, CMG, CRM, CSCO, CTSH, DIS, DOX, EWZ, FB, GE, GOOGL, GPRO, GS, HTBX, MSFT, NET, NFLX, NKE, NVDA, OKTA, SBUX, SEIC, SHOP, SNA, SPOT, SQ, TEAM, TSLA, TTWO, TWTR, UBER, UPWK, V, WDAY, WORK, YEXT, ZEN, and ZS.\n\nMy largest position is in Apple, which I continue to add to and will hold until it reaches $1K per share.  At that point, I'll decide whether to sell.  $1K is a long ways away .... or is it?",
        "subreddit": "stocks",
        "title": "If you had 25K to enter the market tomorrow, what would you invest in?",
        "url": "https://www.reddit.com/r/stocks/comments/ewl7aj/if_you_had_25k_to_enter_the_market_tomorrow_what/",
        "created": 1580486894.0
    },
    {
        "author": "Fed_N_Shoulders",
        "created_utc": 1580164938,
        "id": "euvvw7",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "[https://www.prnewswire.com/news-releases/cisco-appoints-amd-president-and-ceo-dr-lisa-t-su-to-board-of-directors-300993828.html](https://www.prnewswire.com/news-releases/cisco-appoints-amd-president-and-ceo-dr-lisa-t-su-to-board-of-directors-300993828.html)",
        "subreddit": "wallstreetbets",
        "title": "Cisco Appoints AMD President and CEO Dr. Lisa T. Su to Board of Directors $CSCO",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/euvvw7/cisco_appoints_amd_president_and_ceo_dr_lisa_t_su/",
        "created": 1580193738.0
    },
    {
        "author": "Fed_N_Shoulders",
        "created_utc": 1580162103,
        "id": "euv65x",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "[https://www.prnewswire.com/news-releases/cisco-appoints-amd-president-and-ceo-dr-lisa-t-su-to-board-of-directors-300993828.html](https://www.prnewswire.com/news-releases/cisco-appoints-amd-president-and-ceo-dr-lisa-t-su-to-board-of-directors-300993828.html)",
        "subreddit": "investing",
        "title": "Cisco Appoints AMD President and CEO Dr. Lisa T. Su to Board of Directors $CSCO",
        "url": "https://www.reddit.com/r/investing/comments/euv65x/cisco_appoints_amd_president_and_ceo_dr_lisa_t_su/",
        "created": 1580190903.0
    },
    {
        "author": "marveliteIG",
        "created_utc": 1578576125,
        "id": "em9k2w",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "Looking at their business model, MSFT definitely has an edge imo, because of cloud computing compared to CSCO's physical hardware which imo will not be as profitable in the future. However, I can definitely see CSCO adapting to this and switching to a similar business model as MSFT. Also, CSCO is undervalued compared to MSFT. So... my dilemma is which stock to invest in.",
        "subreddit": "StockMarket",
        "title": "CSCO or MSFT?",
        "url": "https://www.reddit.com/r/StockMarket/comments/em9k2w/csco_or_msft/",
        "created": 1578604925.0
    },
    {
        "author": "-NicolasBolas-",
        "created_utc": 1580503868,
        "id": "ewuqq8",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "I am currently looking into cybersecurity stocks since I think that this has still huge growth potential. Beyond the usual suspects like Cisco and check point software technologies I'm very interested in companies that fly under the radar and do not enjoy such high attention, could be smaller ones or some which are in your opinion undervalued. \n\nThanks you for your help and suggestions.",
        "subreddit": "stocks",
        "title": "Cybersecurity stocks",
        "url": "https://www.reddit.com/r/stocks/comments/ewuqq8/cybersecurity_stocks/",
        "created": 1580532668.0
    },
    {
        "author": "Robot_of_Sherwood",
        "created_utc": 1577887961,
        "id": "eiipnb",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "\n## Join Robinhood, get a free share!\n\nThinking of opening an account with Robinhood? Use one of [our referral links](https://www.reddit.com/r/RobinHood/comments/e3ccw7/robinhood_referral_link_thread/) and you'll get a free share! /spam\n\n## Important Links\n\n- Official /r/Robinhood Discord Server: [https://discord.gg/Robinhood](https://discord.gg/Robinhood) (It's where we are most of the time)\n\n\n\n---\n\n### Wednesday the  1st of January\n\n### Ex-div\n\nRSG\n\n### Earnings Reports\n\nALPMY, HLUYY, HOCPY, NBSE, OMVJF, PVT, SPCB, TEUM, TOELY, TOPCF, UNICY\n\n---\n\n### Thursday the  2nd of January\n\n### Ex-div\n\nAEO, AFB, AIR, APLE, AXP, BBX, BMY, CLF, CLI, CSCO, CUZ, CVBF, DOC, FAM, FCPT, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, GL, GLT, HBNC, HLIO, HT, ITUB, IVC, KDP, MORN, MVC, NTAP, OC, RGLD, SAFE, SYY, TOT, UBA, UBP, VIV, WDC, WIRE, WSR\n\n### Earnings Reports\n\nIIVI, LNDC, RECN\n\n---\n\n### Friday the  3rd of January\n\n### Ex-div\n\nBBD, BBDO, BRX, CIG, CXW, GFED, HIFS, JPM, RCII, WERN\n\n### Earnings Reports\n\nLW, ONCS\n\n---\n\n^Standard ^disclaimer: ^The ^content ^in ^this ^thread ^is ^for ^information ^and ^illustrative ^purposes ^only ^and ^should ^not ^be ^regarded ^as ^investment ^advice ^or ^as ^a ^recommendation ^of ^any ^particular ^security ^or ^course ^of ^action. ^Opinions ^expressed ^herein ^are ^the ^opinions ^of ^the ^poster ^and ^are ^subject ^to ^change ^without ^notice. ^Reasonable ^people ^may ^disagree ^about ^the ^opinions ^expressed ^herein. ^In ^the ^event ^any ^of ^the ^assumptions ^used ^herein ^do ^not ^prove ^to ^be ^true, ^results ^are ^likely ^to ^vary ^substantially. ^All ^investments ^entail ^risks. ^There ^is ^no ^guarantee ^that ^investment ^strategies ^will ^achieve ^the ^desired ^results ^under ^all ^market ^conditions ^and ^each ^investor ^should ^evaluate ^their ^ability ^to ^invest ^for ^a ^long ^term ^especially ^during ^periods ^of ^a ^market ^downturn. ^Have ^a ^nice ^day.",
        "subreddit": "RobinHood",
        "title": "Semi-Annual Stock Discussion Thread - Winter/Spring 2020",
        "url": "https://www.reddit.com/r/RobinHood/comments/eiipnb/semiannual_stock_discussion_thread_winterspring/",
        "created": 1577916761.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1578492805,
        "id": "elt7sh",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/wallstreetbets sub! Happy Wednesday to all! Here are your pre-market movers and news this AM-\n\n*****\n\n#[Today's Top Headlines for Wednesday, January 8th, 2020](https://www.cnbc.com/2020/01/08/sp-futures-go-positive-after-sinking-overnight-on-iran-retaliation.html)\n\n* S&amp;P 500 futures turned higher this morning, coming back from overnight lows of more than 1.6% after Iran retaliated for the U.S. killing of a top Iranian general. International oil prices initially surged 4%. But like stocks, crude steadied as the Iranian attacks were less than feared. (CNBC)\n* The direction of the Dow, which closed lower Tuesday on concerns about rising U.S.-Iranian tensions before the airstrikes, could be swayed by the ADP’s December report on private sector employment this morning. The government issues its monthly employment report on Friday. (CNBC)\n* Weekly mortgage applications fell in final weeks of 2019, but homebuyers were out shopping (CNBC)\n* Constellation Brands (STZ), Lennar (LEN), and Dow stock Walgreens Boots Alliance (WBA) are out with quarterly earnings this morning. Bed Bath &amp; Beyond (BBBY) and Helen of Troy (HELE) are among the companies releasing numbers after today’s closing bell. (CNBC)\n* There are no reports of any U.S. service members being hurt after Iran last night launched more than a dozen ballistic missiles against multiple bases housing U.S. troops in Iraq. President Donald Trump tweeted: “All is well!” He plans to make a statement this morning. (CNBC)\n* Iran supreme leader says missile attack was a ‘slap on the face’ for US but it ‘wasn’t enough’ (CNBC)\n* World leaders call for calm after Iranian attack on US forces (CNBC)\n* Saudi Aramco shares hit lowest point since market debut as US-Iran hostilities escalate (CNBC)\n* Airlines avoid Iranian airspace, cancel flights as Mideast tensions spike (CNBC)\n* A Boeing (BA) 737-800 passenger jet, not the grounded Max, operated by a Ukrainian airline crashed minutes after take-off from Tehran on Wednesday morning. There were no survivors. Ukraine International Airlines Flight 752 had 167 passengers and nine crew members on board. (CNBC)\n* United Airlines (UAL) will take a $90 million charge against fourth-quarter earnings, due to Hong Kong disruptions from ongoing anti-government protests. United said the protests have reduced demand for travel to Hong Kong. (Reuters)\n* Fugitive ex-Nissan chief Carlos Ghosn’s lawyers attacked the auto maker this morning, before he was scheduled to hold a highly-anticipated news conference, accusing Nissan of using a “flawed, biased” internal probe to engineer his arrest. (Reuters)\n* Senate Majority Leader Mitch McConnell said Senate Republicans are prepared to move forward on a Trump impeachment trial without agreeing first to rules about witnesses and without any Democratic votes. (CNBC)\n* Facebook (FB) and eBay (EBAY) have removed hundreds of groups and accounts engaged in trading fake reviews, after the U.K. antitrust regulator flagged concerns over them in June. (CNBC)\n* Apple’s (AAPL) App Store platform grossed around $50 billion in 2019, according to analysis by CNBC. But growth is slowing. However, at $50 billion in annual sales App Store alone would be No. 64 on the Fortune 500, ahead of Cisco and behind Morgan Stanley.\n* Baked goods, candies or other cannabis-infused edibles may not be as safe as people think, especially for first-time users, children and the elderly, according to a new paper in the Canadian Medical Association Journal. (CNBC)\n* US cancer death rate drops by largest amount on record (WSJ)\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](http://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://i.imgur.com/6Zvqsi4.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/dCHx1B3.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/L2U900x.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/QqYTbUD.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/V19lVTd.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/Trp0mo0.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/d6YyRYK.png)**)\n\n*****\n\n#THIS AFTERNOON'S POST-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS CALENDAR!]()**)\nT.B.A.\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](hhttps://i.imgur.com/C3febMV.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/oJYMPr1.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/EiKy2Z9.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/K31IbK6.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/sbFxcJE.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #4!](https://i.imgur.com/mGRBaWa.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #5!](https://i.imgur.com/ugyQnBz.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #6!](https://i.imgur.com/5yrcnqq.png)**)\n\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/nrrsdZS.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!](https://i.imgur.com/2QvtmK0.png)**)\n\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS:\n\n* BYND\n* TSLA\n* PIXY\n* M\n* SPY\n* BA\n* TVIX\n* STZ\n* WBA\n* UVXY\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2020/01/08/stocks-making-the-biggest-moves-premarket-lennar-walgreens-macys-boeing-more.html)**)\n\n*****\n\n&gt; **Constellation Brands** – The beer and spirits producer reported adjusted quarterly profit of $2.21 per share, beating the $2.04 a share consensus estimate. Revenue also topped Wall Street forecasts.\n\n&gt; #**STOCK SYMBOL:** STZ\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=STZ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/STZ)**)\n\n*****\n\n&gt; **Walgreens Boots Alliance (WBA)** – The drug store operator missed estimates by 4 cents a share, with adjusted quarterly earnings of $1.37 per share. Revenue came in below estimates as well. Walgreens said it is maintaining its prior earnings outlook for the year despite the soft first quarter.\n\n&gt; #**STOCK SYMBOL:** WBA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WBA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WBA)**)\n\n*****\n\n&gt; **Lennar (LEN)** – The homebuilder reported quarterly profit of $2.13 per share, beating the consensus estimate of $1.90 a share. Revenue also topped Street forecasts. New orders were up 23% on both a dollar and volume basis compared with a year ago.\n\n&gt; #**STOCK SYMBOL:** LEN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=LEN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LEN)**)\n\n*****\n\n&gt; **Macy’s (M)** – Macy’s has cut more than 70 workers at its Bloomingdale’s chain and plans to announce larger layoffs in February, according to a report in Women’s Wear Daily. The moves are said to be part of the retailer’s restructuring plan. Separately, Macy’s reported comparable sales for November and December fell 0.6%, with the retailer noting positive momentum compared to the prior quarter.\n\n&gt; #**STOCK SYMBOL:** M\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=M&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/M)**)\n\n*****\n\n&gt; **Boeing (BA)** – Boeing is under pressure once again following the crash of a Ukraine International Airlines 737-800 shortly after takeoff in Tehran. Officials are pointing to engine failure as the likely cause and say the crash was not related to terrorism.\n\n&gt; #**STOCK SYMBOL:** BA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BA)**)\n\n*****\n\n&gt; **Luckin Coffee (LK)** – Luckin announced a follow-on offering of 7.2 million American depositary shares. Additionally, a selling shareholder of the China-based coffee chain is offering 4.8 million American depositary shares for sale. The announcement came as Luckin announced it is expanding into vending machines to increase its share of the China market.\n\n&gt; #**STOCK SYMBOL:** LK\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=LK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LK)**)\n\n*****\n\n&gt; **Apple (AAPL)** – Apple said customers spent a record $368 million in its App Store on Jan. 1, up 20% from the same day last year. App Store spending was up 16% between Christmas Eve and New Year’s Eve.\n\n&gt; #**STOCK SYMBOL:** AAPL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AAPL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AAPL)**)\n\n*****\n\n&gt; **United Airlines (UAL)** – United Airlines will take a $90 million charge against fourth-quarter earnings, due to Hong Kong disruptions stemming from ongoing anti-government protests. United said the protests have reduced demand for travel to Hong Kong.\n\n&gt; #**STOCK SYMBOL:** UAL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=UAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/UAL)**)\n\n*****\n\n&gt; **Alibaba (BABA)** – Alibaba is undercutting Amazon.com (AMZN) in Europe by offering lower fees for sellers, according to sources who spoke to Reuters. The sources say the move by the China-based online retailer has had mixed results.\n\n&gt; #**STOCK SYMBOL:** BABA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BABA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BABA)**)\n\n*****\n\n&gt; **Becton Dickinson (BDX)** – Becton Dickinson was downgraded to “equal weight” from “overweight” at Barclays, which cites valuation. The medical products maker has seen its stock rise more than 22 percent over the past 12 months.\n\n&gt; #**STOCK SYMBOL:** BDX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BDX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BDX)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/wallstreetbets?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Wednesday, January 8th, 2020! :)**",
        "subreddit": "wallstreetbets",
        "title": "Today's Pre-Market News [Wednesday, January 8th, 2020]",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/elt7sh/todays_premarket_news_wednesday_january_8th_2020/",
        "created": 1578521605.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1578496706,
        "id": "elu0yr",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2020/01/07/apple-app-store-had-estimated-gross-sales-of-50-billion-in-2019.html\n\nApple’s App Store platform grossed around $50 billion in 2019, according to analysis by CNBC.\n\nAt $50 billion in sales per year, the App Store alone would be no. 64 on the Fortune 500, ahead of Cisco and behind Morgan Stanley. \n\nBut the annual disclosure also suggests that growth for the App Store is slowing.",
        "subreddit": "stocks",
        "title": "Apple’s App Store had gross sales around $50 billion last year, but growth is slowing",
        "url": "https://www.reddit.com/r/stocks/comments/elu0yr/apples_app_store_had_gross_sales_around_50/",
        "created": 1578525506.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1578493541,
        "id": "eltd1g",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/smallstreetbets sub! Happy Wednesday to all! Here are your pre-market movers and news this AM-\n\n*****\n\n#[Today's Top Headlines for Wednesday, January 8th, 2020](https://www.cnbc.com/2020/01/08/sp-futures-go-positive-after-sinking-overnight-on-iran-retaliation.html)\n\n* S&amp;P 500 futures turned higher this morning, coming back from overnight lows of more than 1.6% after Iran retaliated for the U.S. killing of a top Iranian general. International oil prices initially surged 4%. But like stocks, crude steadied as the Iranian attacks were less than feared. (CNBC)\n* The direction of the Dow, which closed lower Tuesday on concerns about rising U.S.-Iranian tensions before the airstrikes, could be swayed by the ADP’s December report on private sector employment this morning. The government issues its monthly employment report on Friday. (CNBC)\n* Weekly mortgage applications fell in final weeks of 2019, but homebuyers were out shopping (CNBC)\n* Constellation Brands (STZ), Lennar (LEN), and Dow stock Walgreens Boots Alliance (WBA) are out with quarterly earnings this morning. Bed Bath &amp; Beyond (BBBY) and Helen of Troy (HELE) are among the companies releasing numbers after today’s closing bell. (CNBC)\n* There are no reports of any U.S. service members being hurt after Iran last night launched more than a dozen ballistic missiles against multiple bases housing U.S. troops in Iraq. President Donald Trump tweeted: “All is well!” He plans to make a statement this morning. (CNBC)\n* Iran supreme leader says missile attack was a ‘slap on the face’ for US but it ‘wasn’t enough’ (CNBC)\n* World leaders call for calm after Iranian attack on US forces (CNBC)\n* Saudi Aramco shares hit lowest point since market debut as US-Iran hostilities escalate (CNBC)\n* Airlines avoid Iranian airspace, cancel flights as Mideast tensions spike (CNBC)\n* A Boeing (BA) 737-800 passenger jet, not the grounded Max, operated by a Ukrainian airline crashed minutes after take-off from Tehran on Wednesday morning. There were no survivors. Ukraine International Airlines Flight 752 had 167 passengers and nine crew members on board. (CNBC)\n* United Airlines (UAL) will take a $90 million charge against fourth-quarter earnings, due to Hong Kong disruptions from ongoing anti-government protests. United said the protests have reduced demand for travel to Hong Kong. (Reuters)\n* Fugitive ex-Nissan chief Carlos Ghosn’s lawyers attacked the auto maker this morning, before he was scheduled to hold a highly-anticipated news conference, accusing Nissan of using a “flawed, biased” internal probe to engineer his arrest. (Reuters)\n* Senate Majority Leader Mitch McConnell said Senate Republicans are prepared to move forward on a Trump impeachment trial without agreeing first to rules about witnesses and without any Democratic votes. (CNBC)\n* Facebook (FB) and eBay (EBAY) have removed hundreds of groups and accounts engaged in trading fake reviews, after the U.K. antitrust regulator flagged concerns over them in June. (CNBC)\n* Apple’s (AAPL) App Store platform grossed around $50 billion in 2019, according to analysis by CNBC. But growth is slowing. However, at $50 billion in annual sales App Store alone would be No. 64 on the Fortune 500, ahead of Cisco and behind Morgan Stanley.\n* Baked goods, candies or other cannabis-infused edibles may not be as safe as people think, especially for first-time users, children and the elderly, according to a new paper in the Canadian Medical Association Journal. (CNBC)\n* US cancer death rate drops by largest amount on record (WSJ)\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](http://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://i.imgur.com/6Zvqsi4.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/dCHx1B3.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/L2U900x.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/QqYTbUD.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/V19lVTd.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/Trp0mo0.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/d6YyRYK.png)**)\n\n*****\n\n#THIS AFTERNOON'S POST-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS CALENDAR!]()**)\nT.B.A.\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/C3febMV.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/oJYMPr1.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/EiKy2Z9.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/K31IbK6.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/sbFxcJE.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #4!](https://i.imgur.com/mGRBaWa.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #5!](https://i.imgur.com/ugyQnBz.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #6!](https://i.imgur.com/5yrcnqq.png)**)\n\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/nrrsdZS.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!](https://i.imgur.com/2QvtmK0.png)**)\n\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS:\n\n* BYND\n* TSLA\n* PIXY\n* M\n* SPY\n* BA\n* TVIX\n* STZ\n* WBA\n* UVXY\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2020/01/08/stocks-making-the-biggest-moves-premarket-lennar-walgreens-macys-boeing-more.html)**)\n\n*****\n\n&gt; **Constellation Brands** – The beer and spirits producer reported adjusted quarterly profit of $2.21 per share, beating the $2.04 a share consensus estimate. Revenue also topped Wall Street forecasts.\n\n&gt; #**STOCK SYMBOL:** STZ\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=STZ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/STZ)**)\n\n*****\n\n&gt; **Walgreens Boots Alliance (WBA)** – The drug store operator missed estimates by 4 cents a share, with adjusted quarterly earnings of $1.37 per share. Revenue came in below estimates as well. Walgreens said it is maintaining its prior earnings outlook for the year despite the soft first quarter.\n\n&gt; #**STOCK SYMBOL:** WBA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WBA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WBA)**)\n\n*****\n\n&gt; **Lennar (LEN)** – The homebuilder reported quarterly profit of $2.13 per share, beating the consensus estimate of $1.90 a share. Revenue also topped Street forecasts. New orders were up 23% on both a dollar and volume basis compared with a year ago.\n\n&gt; #**STOCK SYMBOL:** LEN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=LEN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LEN)**)\n\n*****\n\n&gt; **Macy’s (M)** – Macy’s has cut more than 70 workers at its Bloomingdale’s chain and plans to announce larger layoffs in February, according to a report in Women’s Wear Daily. The moves are said to be part of the retailer’s restructuring plan. Separately, Macy’s reported comparable sales for November and December fell 0.6%, with the retailer noting positive momentum compared to the prior quarter.\n\n&gt; #**STOCK SYMBOL:** M\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=M&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/M)**)\n\n*****\n\n&gt; **Boeing (BA)** – Boeing is under pressure once again following the crash of a Ukraine International Airlines 737-800 shortly after takeoff in Tehran. Officials are pointing to engine failure as the likely cause and say the crash was not related to terrorism.\n\n&gt; #**STOCK SYMBOL:** BA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BA)**)\n\n*****\n\n&gt; **Luckin Coffee (LK)** – Luckin announced a follow-on offering of 7.2 million American depositary shares. Additionally, a selling shareholder of the China-based coffee chain is offering 4.8 million American depositary shares for sale. The announcement came as Luckin announced it is expanding into vending machines to increase its share of the China market.\n\n&gt; #**STOCK SYMBOL:** LK\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=LK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LK)**)\n\n*****\n\n&gt; **Apple (AAPL)** – Apple said customers spent a record $368 million in its App Store on Jan. 1, up 20% from the same day last year. App Store spending was up 16% between Christmas Eve and New Year’s Eve.\n\n&gt; #**STOCK SYMBOL:** AAPL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AAPL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AAPL)**)\n\n*****\n\n&gt; **United Airlines (UAL)** – United Airlines will take a $90 million charge against fourth-quarter earnings, due to Hong Kong disruptions stemming from ongoing anti-government protests. United said the protests have reduced demand for travel to Hong Kong.\n\n&gt; #**STOCK SYMBOL:** UAL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=UAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/UAL)**)\n\n*****\n\n&gt; **Alibaba (BABA)** – Alibaba is undercutting Amazon.com (AMZN) in Europe by offering lower fees for sellers, according to sources who spoke to Reuters. The sources say the move by the China-based online retailer has had mixed results.\n\n&gt; #**STOCK SYMBOL:** BABA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BABA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BABA)**)\n\n*****\n\n&gt; **Becton Dickinson (BDX)** – Becton Dickinson was downgraded to “equal weight” from “overweight” at Barclays, which cites valuation. The medical products maker has seen its stock rise more than 22 percent over the past 12 months.\n\n&gt; #**STOCK SYMBOL:** BDX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BDX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BDX)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/smallstreetbets?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Wednesday, January 8th, 2020! :)**",
        "subreddit": "smallstreetbets",
        "title": "Today's Pre-Market News [Wednesday, January 8th, 2020]",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/eltd1g/todays_premarket_news_wednesday_january_8th_2020/",
        "created": 1578522341.0
    },
    {
        "author": "gymaliz",
        "created_utc": 1579967678,
        "id": "etse1p",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "what do you guys think of CSCO today considering the chips sector has delivered above expectations? are you long CSCO at these prices? please share your thesis?\n\nThanks lads",
        "subreddit": "stocks",
        "title": "CSCO after INTC earnings",
        "url": "https://www.reddit.com/r/stocks/comments/etse1p/csco_after_intc_earnings/",
        "created": 1579996478.0
    },
    {
        "author": "ambermage",
        "created_utc": 1579310144,
        "id": "eq9ph9",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "For some reason the automod is making me ask this question in a very overly complicated manner.   \nI'm trying to get a better understanding of the whole options system and so far I only seem to master the (buy high, expire worthless) aspect.   \nI don't know where to find the chart of a price history for something based on specifics.\n\nFor example if I wanted to see the history for Cisco $50 C 3/20/20.  \nIs that a feature included in Level 2 of Robinhood?  \nIf not then where?  \nIs there a source that is free?",
        "subreddit": "options",
        "title": "Where would someone find a price history for specific options.",
        "url": "https://www.reddit.com/r/options/comments/eq9ph9/where_would_someone_find_a_price_history_for/",
        "created": 1579338944.0
    },
    {
        "author": "charvo",
        "created_utc": 1579161246,
        "id": "epgal8",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "This trade is based on CSCO:HD ratio ready to go up. Does it necessarily mean HD will go down? Not exactly, but CSCO will at least go up more than HD. If you want play this with options, you can try long CSCO calls and short HD calls. There are many ways to trade long short, and I think I will employ more of these trades since the broad market is somewhat extended. I am personally long CSCO and short HD with a ratio of 6 to 4.",
        "subreddit": "wallstreetbets",
        "title": "Long CSCO Short HD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/epgal8/long_csco_short_hd/",
        "created": 1579190046.0
    },
    {
        "author": "webbersmak",
        "created_utc": 1579394966,
        "id": "eqpbh0",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Juniper Networks hit my radar last week and I opened a small position. [Looking](https://stockarmor.com/jnpr.pdf) at the numbers, this is a solid find. Nice, thick operation margin. Current assets are plump and cover liabilities 2x over.  You'll the notice the operating cash flow ratio is a little low, but looking deeper, a chunk of the current liabilities are in the form of deferred revenue (customer prepayments). Their TIE ratio of 5+ clearly indicates they can handle their debt payments. \n\n&amp;nbsp;\n\n\nThe other thing I'm happy to see is the plentiful number of open positions on their careers page - a strong indicator of growth. The rollout of 5G may even provide additional tailwinds.\n\n&amp;nbsp;\n\n\nIf you wanted an alternative to a large mega tech like Cisco in your portfolio. This is it.",
        "subreddit": "stocks",
        "title": "Juicy Juniper",
        "url": "https://www.reddit.com/r/stocks/comments/eqpbh0/juicy_juniper/",
        "created": 1579423766.0
    },
    {
        "author": "spacehiphopnerd",
        "created_utc": 1578371551,
        "id": "el6bpb",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Thoughts on CISCO in the long term?",
        "url": "https://www.reddit.com/r/stocks/comments/el6bpb/thoughts_on_cisco_in_the_long_term/",
        "created": 1578400351.0
    },
    {
        "author": "JohnJanoski23",
        "created_utc": 1578243485,
        "id": "ekfkfe",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Opinion for 19 year old Investor\n\nHello everyone, \n\n\nAs an 18 year old I maxed my Vanguard Roth IRA for 2019 using the vanguard target date 2065 and the vanguard star fund. I also have about $5600 in my personal brokerage account including these stocks including diversity percentages of my portfolio \n\n-Coca Cola (KO) 27.28%\n-Microsoft (MSFT) 29.25%\n-Walmart (WMT) 21.73\n-Visa (V) 17.48%\n-Cisco(CSCO) 4.39\n\nI would like to hear opinionated answers on where to allocate new money and if there is positions listed here that don’t make sense for my age that I should possible sell out of and look into new positions. I also received $31,000 from my grandparents last month, but that money is sitting in a saving. I am thinking about investing into real Estate or let the money sit in a CD until I decide. My vision is medium risk.  Thanks to everyone who contributes, happy New Year.",
        "subreddit": "investing",
        "title": "Opinion for 19 year old investor wanting guidance.",
        "url": "https://www.reddit.com/r/investing/comments/ekfkfe/opinion_for_19_year_old_investor_wanting_guidance/",
        "created": 1578272285.0
    },
    {
        "author": "JohnJanoski23",
        "created_utc": 1578242118,
        "id": "ekf8vx",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Advice for 19 year old Investor\n\nHello everyone, \n\n\nAs an 18 year old I maxed my Vanguard Roth IRA for 2019 using the vanguard target date 2065 and the vanguard star fund. I also have about $5600 in my personal brokerage account including these stocks including diversity percentages of my portfolio \n\n-Coca Cola (KO) 27.28%\n-Microsoft (MSFT) 29.25%\n-Walmart (WMT) 21.73\n-Visa (V) 17.48%\n-Cisco(CSCO) 4.39\n\nI would like to hear advice on where to allocate new money and if there is positions listed here that don’t make sense for my age that I should possible sell out of and look into new positions. I also received $31,000 from my grandparents last month, but that money is sitting in a saving. I am thinking about investing into real Estate or let the money sit in a CD until I decide. My vision is medium risk.  Thanks to everyone who contributes, happy New Year.",
        "subreddit": "investing",
        "title": "Advice for 19 year old investor, with many options. Don’t know where to go.",
        "url": "https://www.reddit.com/r/investing/comments/ekf8vx/advice_for_19_year_old_investor_with_many_options/",
        "created": 1578270918.0
    },
    {
        "author": "ericriten",
        "created_utc": 1579202110,
        "id": "epo0el",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "What do you guys think about buying call options for Visa or Cisco?",
        "subreddit": "smallstreetbets",
        "title": "Stock Decision",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/epo0el/stock_decision/",
        "created": 1579230910.0
    },
    {
        "author": "yeahnoworriesmate",
        "created_utc": 1580199901,
        "id": "ev2tyj",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "stocks",
        "title": "$CSCO To The Moon: Cisco Systems (NASDAQ:CSCO) has added AMD CEO Dr. Lisa Su to its board 🚀",
        "url": "https://www.reddit.com/r/stocks/comments/ev2tyj/csco_to_the_moon_cisco_systems_nasdaqcsco_has/",
        "created": 1580228701.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1578492716,
        "id": "elt75n",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/stocks sub! Happy Wednesday to all! Here are your pre-market movers and news this AM-\n\n*****\n\n#[Today's Top Headlines for Wednesday, January 8th, 2020](https://www.cnbc.com/2020/01/08/sp-futures-go-positive-after-sinking-overnight-on-iran-retaliation.html)\n\n* S&amp;P 500 futures turned higher this morning, coming back from overnight lows of more than 1.6% after Iran retaliated for the U.S. killing of a top Iranian general. International oil prices initially surged 4%. But like stocks, crude steadied as the Iranian attacks were less than feared. (CNBC)\n* The direction of the Dow, which closed lower Tuesday on concerns about rising U.S.-Iranian tensions before the airstrikes, could be swayed by the ADP’s December report on private sector employment this morning. The government issues its monthly employment report on Friday. (CNBC)\n* Weekly mortgage applications fell in final weeks of 2019, but homebuyers were out shopping (CNBC)\n* Constellation Brands (STZ), Lennar (LEN), and Dow stock Walgreens Boots Alliance (WBA) are out with quarterly earnings this morning. Bed Bath &amp; Beyond (BBBY) and Helen of Troy (HELE) are among the companies releasing numbers after today’s closing bell. (CNBC)\n* There are no reports of any U.S. service members being hurt after Iran last night launched more than a dozen ballistic missiles against multiple bases housing U.S. troops in Iraq. President Donald Trump tweeted: “All is well!” He plans to make a statement this morning. (CNBC)\n* Iran supreme leader says missile attack was a ‘slap on the face’ for US but it ‘wasn’t enough’ (CNBC)\n* World leaders call for calm after Iranian attack on US forces (CNBC)\n* Saudi Aramco shares hit lowest point since market debut as US-Iran hostilities escalate (CNBC)\n* Airlines avoid Iranian airspace, cancel flights as Mideast tensions spike (CNBC)\n* A Boeing (BA) 737-800 passenger jet, not the grounded Max, operated by a Ukrainian airline crashed minutes after take-off from Tehran on Wednesday morning. There were no survivors. Ukraine International Airlines Flight 752 had 167 passengers and nine crew members on board. (CNBC)\n* United Airlines (UAL) will take a $90 million charge against fourth-quarter earnings, due to Hong Kong disruptions from ongoing anti-government protests. United said the protests have reduced demand for travel to Hong Kong. (Reuters)\n* Fugitive ex-Nissan chief Carlos Ghosn’s lawyers attacked the auto maker this morning, before he was scheduled to hold a highly-anticipated news conference, accusing Nissan of using a “flawed, biased” internal probe to engineer his arrest. (Reuters)\n* Senate Majority Leader Mitch McConnell said Senate Republicans are prepared to move forward on a Trump impeachment trial without agreeing first to rules about witnesses and without any Democratic votes. (CNBC)\n* Facebook (FB) and eBay (EBAY) have removed hundreds of groups and accounts engaged in trading fake reviews, after the U.K. antitrust regulator flagged concerns over them in June. (CNBC)\n* Apple’s (AAPL) App Store platform grossed around $50 billion in 2019, according to analysis by CNBC. But growth is slowing. However, at $50 billion in annual sales App Store alone would be No. 64 on the Fortune 500, ahead of Cisco and behind Morgan Stanley.\n* Baked goods, candies or other cannabis-infused edibles may not be as safe as people think, especially for first-time users, children and the elderly, according to a new paper in the Canadian Medical Association Journal. (CNBC)\n* US cancer death rate drops by largest amount on record (WSJ)\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](http://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://i.imgur.com/6Zvqsi4.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/dCHx1B3.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/L2U900x.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/QqYTbUD.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/V19lVTd.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/Trp0mo0.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/d6YyRYK.png)**)\n\n*****\n\n#THIS AFTERNOON'S POST-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS CALENDAR!]()**)\nT.B.A.\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](hhttps://i.imgur.com/C3febMV.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/oJYMPr1.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/EiKy2Z9.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/K31IbK6.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/sbFxcJE.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #4!](https://i.imgur.com/mGRBaWa.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #5!](https://i.imgur.com/ugyQnBz.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #6!](https://i.imgur.com/5yrcnqq.png)**)\n\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/nrrsdZS.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!](https://i.imgur.com/2QvtmK0.png)**)\n\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS:\n\n* BYND\n* TSLA\n* PIXY\n* M\n* SPY\n* BA\n* TVIX\n* STZ\n* WBA\n* UVXY\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2020/01/08/stocks-making-the-biggest-moves-premarket-lennar-walgreens-macys-boeing-more.html)**)\n\n*****\n\n&gt; **Constellation Brands** – The beer and spirits producer reported adjusted quarterly profit of $2.21 per share, beating the $2.04 a share consensus estimate. Revenue also topped Wall Street forecasts.\n\n&gt; #**STOCK SYMBOL:** STZ\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=STZ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/STZ)**)\n\n*****\n\n&gt; **Walgreens Boots Alliance (WBA)** – The drug store operator missed estimates by 4 cents a share, with adjusted quarterly earnings of $1.37 per share. Revenue came in below estimates as well. Walgreens said it is maintaining its prior earnings outlook for the year despite the soft first quarter.\n\n&gt; #**STOCK SYMBOL:** WBA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WBA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WBA)**)\n\n*****\n\n&gt; **Lennar (LEN)** – The homebuilder reported quarterly profit of $2.13 per share, beating the consensus estimate of $1.90 a share. Revenue also topped Street forecasts. New orders were up 23% on both a dollar and volume basis compared with a year ago.\n\n&gt; #**STOCK SYMBOL:** LEN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=LEN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LEN)**)\n\n*****\n\n&gt; **Macy’s (M)** – Macy’s has cut more than 70 workers at its Bloomingdale’s chain and plans to announce larger layoffs in February, according to a report in Women’s Wear Daily. The moves are said to be part of the retailer’s restructuring plan. Separately, Macy’s reported comparable sales for November and December fell 0.6%, with the retailer noting positive momentum compared to the prior quarter.\n\n&gt; #**STOCK SYMBOL:** M\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=M&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/M)**)\n\n*****\n\n&gt; **Boeing (BA)** – Boeing is under pressure once again following the crash of a Ukraine International Airlines 737-800 shortly after takeoff in Tehran. Officials are pointing to engine failure as the likely cause and say the crash was not related to terrorism.\n\n&gt; #**STOCK SYMBOL:** BA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BA)**)\n\n*****\n\n&gt; **Luckin Coffee (LK)** – Luckin announced a follow-on offering of 7.2 million American depositary shares. Additionally, a selling shareholder of the China-based coffee chain is offering 4.8 million American depositary shares for sale. The announcement came as Luckin announced it is expanding into vending machines to increase its share of the China market.\n\n&gt; #**STOCK SYMBOL:** LK\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=LK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LK)**)\n\n*****\n\n&gt; **Apple (AAPL)** – Apple said customers spent a record $368 million in its App Store on Jan. 1, up 20% from the same day last year. App Store spending was up 16% between Christmas Eve and New Year’s Eve.\n\n&gt; #**STOCK SYMBOL:** AAPL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AAPL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AAPL)**)\n\n*****\n\n&gt; **United Airlines (UAL)** – United Airlines will take a $90 million charge against fourth-quarter earnings, due to Hong Kong disruptions stemming from ongoing anti-government protests. United said the protests have reduced demand for travel to Hong Kong.\n\n&gt; #**STOCK SYMBOL:** UAL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=UAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/UAL)**)\n\n*****\n\n&gt; **Alibaba (BABA)** – Alibaba is undercutting Amazon.com (AMZN) in Europe by offering lower fees for sellers, according to sources who spoke to Reuters. The sources say the move by the China-based online retailer has had mixed results.\n\n&gt; #**STOCK SYMBOL:** BABA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BABA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BABA)**)\n\n*****\n\n&gt; **Becton Dickinson (BDX)** – Becton Dickinson was downgraded to “equal weight” from “overweight” at Barclays, which cites valuation. The medical products maker has seen its stock rise more than 22 percent over the past 12 months.\n\n&gt; #**STOCK SYMBOL:** BDX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BDX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BDX)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/stocks?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Wednesday, January 8th, 2020! :)**",
        "subreddit": "stocks",
        "title": "Today's Pre-Market News [Wednesday, January 8th, 2020]",
        "url": "https://www.reddit.com/r/stocks/comments/elt75n/todays_premarket_news_wednesday_january_8th_2020/",
        "created": 1578521516.0
    },
    {
        "author": "Robot_of_Sherwood",
        "created_utc": 1577876420,
        "id": "eih87f",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "\n## Join Robinhood, get a free share!\n\nThinking of opening an account with Robinhood? Use one of [our referral links](https://www.reddit.com/r/RobinHood/comments/e3ccw7/robinhood_referral_link_thread/) and you'll get a free share! /spam\n\n## Important Links\n\n- Official /r/Robinhood Discord Server: [https://discord.gg/Robinhood](https://discord.gg/Robinhood) (It's where we are most of the time)\n\n\n\n---\n\n### Wednesday the  1st of January\n\n### Ex-div\n\nRSG\n\n### Earnings Reports\n\nALPMY, HLUYY, HOCPY, NBSE, OMVJF, PVT, SPCB, TEUM, TOELY, TOPCF, UNICY\n\n---\n\n### Thursday the  2nd of January\n\n### Ex-div\n\nAEO, AFB, AIR, APLE, AXP, BBX, BMY, CLF, CLI, CSCO, CUZ, CVBF, DOC, FAM, FCPT, FCT, FDEU, FEI, FIF, FMY, FPL, FSD, GL, GLT, HBNC, HLIO, HT, ITUB, IVC, KDP, MORN, MVC, NTAP, OC, RGLD, SAFE, SYY, TOT, UBA, UBP, VIV, WDC, WIRE, WSR\n\n### Earnings Reports\n\nIIVI, LNDC, RECN\n\n---\n\n### Friday the  3rd of January\n\n### Ex-div\n\nBBD, BBDO, BRX, CIG, CXW, GFED, HIFS, JPM, RCII, WERN\n\n### Earnings Reports\n\nLW, ONCS\n\n---\n\n^Standard ^disclaimer: ^The ^content ^in ^this ^thread ^is ^for ^information ^and ^illustrative ^purposes ^only ^and ^should ^not ^be ^regarded ^as ^investment ^advice ^or ^as ^a ^recommendation ^of ^any ^particular ^security ^or ^course ^of ^action. ^Opinions ^expressed ^herein ^are ^the ^opinions ^of ^the ^poster ^and ^are ^subject ^to ^change ^without ^notice. ^Reasonable ^people ^may ^disagree ^about ^the ^opinions ^expressed ^herein. ^In ^the ^event ^any ^of ^the ^assumptions ^used ^herein ^do ^not ^prove ^to ^be ^true, ^results ^are ^likely ^to ^vary ^substantially. ^All ^investments ^entail ^risks. ^There ^is ^no ^guarantee ^that ^investment ^strategies ^will ^achieve ^the ^desired ^results ^under ^all ^market ^conditions ^and ^each ^investor ^should ^evaluate ^their ^ability ^to ^invest ^for ^a ^long ^term ^especially ^during ^periods ^of ^a ^market ^downturn. ^Have ^a ^nice ^day.",
        "subreddit": "RobinHood",
        "title": "Annual Stock Discussion Thread - 2020",
        "url": "https://www.reddit.com/r/RobinHood/comments/eih87f/annual_stock_discussion_thread_2020/",
        "created": 1577905220.0
    },
    {
        "author": "Mdizzle29",
        "created_utc": 1578509900,
        "id": "elx2eg",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Cybersecurity ETF HACK just hit a 52-week high — up roughly 24.8% from its 52-week low of $34.52/share.\n\nThe underlying Prime Cyber Defense Index utilizes a rules-based investment methodology to select a diverse group of companies actively involved in the cyber security industry. This includes companies like Cisco, Palo Alto Networks, Okta and more.\n\nWhy the Move?\n\nThe cybersecurity corner of the U.S. stock market has been an area to watch lately, given the rise in Middle East tensions. The U.S. drone strike near the Baghdad international airport last week killed the top Iranian commander Qasem Soleimani and fueled bets of Iranian cyber attacks on the United States. “Companies that offer threat-detection services are the ones most likely to benefit from increased risk of attacks,” per Bloomberg.\n\n(Note: I currently have a position in HACK)",
        "subreddit": "stocks",
        "title": "Cybersecurity ETF HACK hits 52 week high",
        "url": "https://www.reddit.com/r/stocks/comments/elx2eg/cybersecurity_etf_hack_hits_52_week_high/",
        "created": 1578538700.0
    },
    {
        "author": "yeahnoworriesmate",
        "created_utc": 1580193290,
        "id": "ev1up5",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "$CSCO To The Moon: Cisco Systems (NASDAQ:CSCO) has added AMD CEO Dr. Lisa Su to its board 🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ev1up5/csco_to_the_moon_cisco_systems_nasdaqcsco_has/",
        "created": 1580222090.0
    },
    {
        "author": "webbersmak",
        "created_utc": 1579387545,
        "id": "eqnp63",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Juniper Networks hit my radar last week and I opened a small position. [Looking](https://stockarmor.com/jnpr.pdf) at the numbers, this is a solid find. Nice, thick operation margin. Current assets are plump and cover liabilities 2x over.  You'll the notice the operating cash flow ratio is a little low, but looking deeper, a chunk of the current liabilities are in the form of deferred revenue (customer prepayments). Their TIE ratio of 5+ clearly indicates they can handle their debt payments. \n\nThe other thing I'm happy to see is the plentiful number of open positions on their careers page - a strong indicator of growth. The rollout of 5G may even provide additional tailwinds.\n\nIf you wanted an alternative to a large mega tech like Cisco in your portfolio. This is it.",
        "subreddit": "investing",
        "title": "Juicy Juniper",
        "url": "https://www.reddit.com/r/investing/comments/eqnp63/juicy_juniper/",
        "created": 1579416345.0
    }
]