[
    {
        "author": "socalBarcafan",
        "created_utc": 1587254810,
        "id": "g3xya0",
        "num_comments": 44,
        "num_crossposts": 0,
        "selftext": "Would like to know what postions people picked up when the market was near bottom..\nHere are mine\nAmzn 1690\nBA 107\nDIS 93\nSBUX 55\nZM 91 purchased before the drop\nTTD 166\nBRK/B 182\nFIVN 72\n\nJust picked up CRM last week @156",
        "subreddit": "stocks",
        "title": "Great buys during the drop. Its always good stuff when you hear great buys!!!",
        "url": "https://www.reddit.com/r/stocks/comments/g3xya0/great_buys_during_the_drop_its_always_good_stuff/",
        "created": 1587283610.0
    },
    {
        "author": "djsmfnskcifk",
        "created_utc": 1587590920,
        "id": "g69ucl",
        "num_comments": 41,
        "num_crossposts": 0,
        "selftext": "Hi,\n\nHoping for the tech industry to soar, and perhaps of the entertainment industry in 3 years or so; could could you rate the port foil I created this week, offering me suggestions?  Thanks.  Currently of 8k buying power and opened a margin account, so I can't fuck this up (I decided to take the interest rate.. its (total owed \\* .08)/360 .. less than a dollar per day I think if I calculated it right.\n\n2 ORCLE (planning to purchase more)\n\n4 Akamai Technologies, Inc. - Common Stock\n\n15  Digital Turbine, Inc. - Common Stock (CV EM)\n\n3  Alibaba Group Holding Limited American Depositary Shares each representing eight\n\n4 Canopy Growth Corp5 CHGG2  PC Connection, Inc. - Common Stock\n\n4  Salesforce.com Inc Common Stock\n\n4  Carriage Services, Inc. Common Stock\n\n1 Docusign\n\n1 Alphabet (Google)\n\n8  ETFMG Prime Cyber Security ETF\n\n2 Intuit\n\n3  iShares U.S. Financial Services ETF\n\n8  Lakeland Industries, Inc. - Common Stock\n\n1 Microsoft Corp\n\n65 Novabay Pharm (oops)\n\n1  Invesco Dynamic Leisure and Entertainment ETF  (prob gonna sell.. i was too hopeful. I bought dirt cheap though)\n\n1 Paypal\n\n1 QQQ\n\n3 SAP\n\n3  Service Corporation International Common Stock\n\n5  Sprouts Farmers Market, Inc. - Common Stock\n\n1 Smartsheet\n\n5  Global X Social Media ETF\n\n3 in Square\n\n5 in a shitty REIT Im going to sell\n\n6 AT&amp;T\n\n1 TeleDoc\n\n35 in Upwork\n\n1 in Vanguard Russell 1000 Value ETF\n\n2 in WIX\n\n9 in Slack\n\nI plan to invest in buying more WIX, PayPal, SQ,, Chegg, Oracle, and Docusign\n\nI have a few ETFs outside of the tech sector, but I am rather confident the world will be changed for years to come.\n\nPlease offer additional stocks, considerations, where I should allocate, etc.  I am a week into investing.  I feel that a fully diversified folio, given the boom in tech, is acceptable.  Also, I am about as high of a risk taker as it gets.  Went from investing to gambling and I still have money\n\nEdit:  Future stocks I will plan to buy include: Samsung, Comcast,",
        "subreddit": "StockMarket",
        "title": "Noob Here.. Rate my probably terrible portfolio.",
        "url": "https://www.reddit.com/r/StockMarket/comments/g69ucl/noob_here_rate_my_probably_terrible_portfolio/",
        "created": 1587619720.0
    },
    {
        "author": "lnhvtepn",
        "created_utc": 1586478021,
        "id": "fy3zw3",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "I have Limit Buy Orders on:\n\n* CRM - $135\n* GOOG - $1050\n* SBUX - $60\n* SQ - $50",
        "subreddit": "stocks",
        "title": "If the big dip is coming soon, what are you planning to buy long-term and at what price?",
        "url": "https://www.reddit.com/r/stocks/comments/fy3zw3/if_the_big_dip_is_coming_soon_what_are_you/",
        "created": 1586506821.0
    },
    {
        "author": "Warm_Tzatziki",
        "created_utc": 1586714552,
        "id": "g01hze",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "Are we really seeing now a pump and dump scenario? \n\nI don't think we will retest new lows, but a 5-10% decline is to be seen as it looks like re-running the economy won't be easy based on another countries.\n\nSitting on cash now and wondering whether to start buying after Q1 results come in (I know its priced in, but some red is going to appear I think), or still sit on it. \n\nOr switch to - time in market beats blah blah - and start buying stocks anyway. \n\nLooking for long term invest in big companies like Salesforce, Disney, Uber, Boeing, Amarin (which is crazy cheap now) and some german stocks as well.",
        "subreddit": "StockMarket",
        "title": "Pump and dump",
        "url": "https://www.reddit.com/r/StockMarket/comments/g01hze/pump_and_dump/",
        "created": 1586743352.0
    },
    {
        "author": "BS_Is_Annoying",
        "created_utc": 1587615305,
        "id": "g6g31w",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Corporate America is shitty. \n\nCorporate America takes good people and takes advantage of their willingness to be good people, and the screws them over. Act nice and trustworthy to a customer, good, now take advantage of them and fuck them for their money. \n\nAmazon workers: Willing to walk for 12 hours finding shit in warehouses and piss in a bottle because a 5 minute break will hurt Amazon's bottom line. Fucked by Amazon. \n\nWalmart workers: Unwilling to form a union due because they don't want to get their fellow employees fired. Fucked by Walmart.\n\nHome Depot Cashier: Trying to get 25 cc signup every day so Home Depot can extract $25 in interest per month per cc sign up. Fucked by Home Depot.\n\nSalesforce programmer: Thinks he's doing good in live with his fat 250k salary. Doesn't realize his real value to salesforce is 25 million. Fucked by salesforce.\n\nEvery time I go over to /r/investing I see people saying \"better buy it now because it's going up, I believe in the American company.\"\n\nI've worked at a lot of companies. Some are better than others. Some treat their employees and customers right. They are the exception, and all will eventually turn into shitty companies, fucking over their employees for a buck. \n\nBut I can't blame companies, or the employers who run these companies. It's the system. It's designed to give the highest stock price to the shittiest companies that extract the most out of the employees and customers. Aka, the companies that figure out how to manipulate their employees the most. Amazon has reached god tier at that, now they are a \"tech company\" because they sell more \"books etc.\" than anybody. Best at fucking employees = Best valuation multiplier. \n\nIt's why America is turning into a shit hole. Need proof? Just look at the country with the most confirmed COVID-19 cases. \"But china wha wha wasn't telling the truth about their cccchina virus cases.\" Yeah... and we aren't under-counting im America too? America has reached peak fuck-up. Seriously, what has corporate America brought to the table in the last 30 years? The internet? Invented by the government. Facebook? It's just a fucking creepy web app. Google? Decent, but wtf is up with their we can now do evil shit. Apple? Okay, a little good stuff to come out of them, then Steve Jobs died and their biggest innovation is a cum drop in your ear. And now corporate America Execs is pissed that regular worker bees aren't excited to go die for their bottom line. \n\nAnyway, I've worked A LOT in corporate America. I've seen the shit they do and the way they operate. I can't bring myself to buy stock in corporate America (aside from a few companies temporarily). It's because they are dogshit. \n\nI buy options.",
        "subreddit": "wallstreetbets",
        "title": "I don't buy stock because I don't believe in Corporate America",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/g6g31w/i_dont_buy_stock_because_i_dont_believe_in/",
        "created": 1587644105.0
    },
    {
        "author": "heathermyllz",
        "created_utc": 1586373918,
        "id": "fxcybw",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "Can someone explain why looking at the PE ratio is apparently so important when evaluating a stock? I see growth companies like Amazon, Salesforce, AMD with very high PE ratios...everything I have read regarding evaluating stocks is to look for low-ish PE ratios...a little confused what to analyze for GROWTH stocks in particular that I would consider investing in.",
        "subreddit": "investing",
        "title": "How relevant is PE ratio for growth stocks?",
        "url": "https://www.reddit.com/r/investing/comments/fxcybw/how_relevant_is_pe_ratio_for_growth_stocks/",
        "created": 1586402718.0
    },
    {
        "author": "senormouse9",
        "created_utc": 1587315194,
        "id": "g4ayp3",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "\nI’ve been buying into the market gradually for about a month, not really sure what I’m doing, but having fun learning (watching the market gives me something to do while quarantined). Does my portfolio make sense? \n\nI have between 5 and 10 shares in each (except BUD, where I have 20)\n\nCanopy Growth \n\nStarbucks \n\nCaribbean Cruises \n\nNorwegian Cruises \n\nDisney\n\nFord\n\nABinBev\n\nMolsenCoors\n\nConstellation Brands\n\nTyson Foods\n\nMicrosoft\n\nSalesforce\n\nComcast\n\nViacom\n\nChevron\n\nExxon\n\nVerizon\n\nATT\n\nTMobile\n\nDelta\n\nGM \n\n\nAlso considering Nike, and maybe Google Class C (so expensive...but I thought the same thing about Amazon and have seen it go from 1700 to 2400 in about 3 weeks so what do I know?)\n\nWould love to hear thoughts.",
        "subreddit": "stocks",
        "title": "Portfolio Advice (am I dumb?)",
        "url": "https://www.reddit.com/r/stocks/comments/g4ayp3/portfolio_advice_am_i_dumb/",
        "created": 1587343994.0
    },
    {
        "author": "Warm_Tzatziki",
        "created_utc": 1586952988,
        "id": "g1qt1e",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "Hi Guys,\n\nAfter many fails in recent weeks with day trading trying to be smarter than the market and trying to time it - lesson learned. Speculation is not for me. Back to regular investing. \n\nI currently build a portfolio with:\n\nJNJ - for long term its a good stock overall. ER looking ok, involved in COVID cure, good future outlook. \n\nMicrosoft - leading software for work, gaining with systems for work from home. Azure Cloud looks like one of the market favorites. \n\nSAP (xetra) - its either Workday or SAP. I think SAP will continue its growth in Europe. Pandemic should help with moving to newer software for companies. Next week ER coming in. Good perspectives\n\nPHG - also before ER, the last contract for respirators looks good. One of the biggest medical devices providers currently. Huge on eu market. \n\nSalesforce - also a CRM like sap but different usage. Golden standard for many software solutions. Should also gain from companies moving online. Especiallh that it heavily supports working from home\n\nAll obove stocks are meant to be kept for a long time. All as per my analisys undervalued currently. Nothing is pandemic proof, but I see the above as stocks not going to be heavily affected with corrections or with a good perspective to rebound.\n\nI have two stocks I'm holding with the thought they might tumble so I have them as riskier assets. Ready to cut profits.\n\nNetflix - I think ER will be great for Q1. Might decline afterwards, but for now looks like a growth. Overpriced for sure. \n\nTesla - holding big hopes for their battery technology. Also the world wont stop moving to EV because of COVID. I think its overpriced, but with a good outlook for growth. Stop loss set though for cutting profits. \n\nOn my watch list to swap in case Netflix or Tesla will go down:\n\nBiogen / Inseego / Citrix / Pfizer / 3M\n\nAny recommendations?",
        "subreddit": "StockMarket",
        "title": "Building portfolio during pandemic",
        "url": "https://www.reddit.com/r/StockMarket/comments/g1qt1e/building_portfolio_during_pandemic/",
        "created": 1586981788.0
    },
    {
        "author": "appzly",
        "created_utc": 1586210540,
        "id": "fw80ex",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "MGM, JNJ, CRM, V, ATVI, JPM\n\nI've done some research on all of them but I'm still kinda new",
        "subreddit": "investing",
        "title": "What are some flaws of these companies that I'm looking at buying long term?",
        "url": "https://www.reddit.com/r/investing/comments/fw80ex/what_are_some_flaws_of_these_companies_that_im/",
        "created": 1586239340.0
    },
    {
        "author": "ftstacks",
        "created_utc": 1586673514,
        "id": "fzrpwk",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "Been looking at these stocks and wanted to know what you guys think about them long term? Here’s my own notes and concerns about them.\n\nBABA- e commerce giant, breaking into various businesses such as cloud services and Alipay and they’re continuing to grow, just unsure about China as a whole after LK and other companies producing fraudulent numbers and their economy slowing a bit \n\nNFLX- leader in a growing industry of streaming services, more usage of their content, and is a household name, concerns about continuing to burn through cash and their ability to gain new subscribers, increasing competition, and high valuation\n\nCRM- honestly not the most knowledgeable in the SaaS space but know they are a giant company with a ton of acquisitions, uncertain if they’ll keep growing and if they are overvalued",
        "subreddit": "stocks",
        "title": "Thoughts on Alibaba, Netflix, and Salesforce?",
        "url": "https://www.reddit.com/r/stocks/comments/fzrpwk/thoughts_on_alibaba_netflix_and_salesforce/",
        "created": 1586702314.0
    },
    {
        "author": "amst98",
        "created_utc": 1587626240,
        "id": "g6i7jw",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "I was wondering if anyone could give me some feedback and comment on what three companies you would choose from these watch list. (1 short term, 2 long term)\n\nMSFT\n\nDIS\n\nBA\n\nUBER\n\nXOM\n\nCRM\n\nABT\n\nABBVIE\n\nQCOM\n\nPENN\n\nMGM\n\nJPM\n\nMSGS\n\nThank you!",
        "subreddit": "stocks",
        "title": "Need Advice on my watchlist",
        "url": "https://www.reddit.com/r/stocks/comments/g6i7jw/need_advice_on_my_watchlist/",
        "created": 1587655040.0
    },
    {
        "author": "sankalp89",
        "created_utc": 1588116672,
        "id": "g9yafr",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Hey guys! Earnings season is up. I have tried a premium selling strategy that has worked for me pretty well for at least more than an year. The strategy is a simple put credit spread. And you do it on the companies that have a history of beating revenues, companies that have a strong management, etc. Sure, these companies can also take a dip if they miss their estimates but they tend to come back up after sometime. Examples for such companies might be FAANG+Microsoft. To protect my downside, I go out in the 45 DTE monthly, give up some premium collected and go far out to 2X the expected move. It gives me a little more room to the downside and enough time to recoup losses if the trade goes against me. \n\nI have made a list of such companies. I would like you guys to punch holes in my theory and suggest more companies like these. \n\n\nNFLX -\nINTC - \n\nGOOGL - 4/28\nAMD - 4/28\nSBUX - 4/28\nPEP - 4/28\nBA - 4/29 bmo\nMSFT - 4/29\nFB - 4/29\nTSLA - 4/29\nMCD - 4/30\nAAPL - 4/30\nAMZN - 4/30\nV - 4/30\nGILD - 4/30\n\nBYND - 5/5\nSPCE - 5/5\nDIS - 5/5\nSQ - 5/6\nLYFT - 5/6\nSHOP - 5/6\nUBER - 5/7\nROKU - 5/7\nCSCO - 5/13\nNVDA - 5/21\nKO - \nWMT - 5/19\nBABA - 5/20\nBIDU - 5/21\nHD - 5/19\n\n\nCRM - 6/2 \nCOST - 6/4",
        "subreddit": "options",
        "title": "Stock suggestions for Put Credit spreads",
        "url": "https://www.reddit.com/r/options/comments/g9yafr/stock_suggestions_for_put_credit_spreads/",
        "created": 1588145472.0
    },
    {
        "author": "_buscemi_",
        "created_utc": 1587439671,
        "id": "g57pyq",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "All are aware of the big 4-5 IaaS providers in Amazon, Microsoft, Google, Alibaba, and IBM. There is reasons to believe the SaaS providers are even more room to grow as they adopt to highly fragmented industries such as education and healthcare. Now, the SaaS market is extremely saturated. I am diving in trying to better organize this business model among publicly traded companies. Ultimately I will publish the dashboard via the Koyfin Platform. \n\nLet's do it together. \n\nAt a high level, there are two types of SaaS models. Those that offer horizontally integrated solutions, such as Salesforce or vertically integrated solutions such as Veeva Systems. \n\nBackground on SaaS subtypes: \n\nHorizontally-architected SaaS applications serve specific functions to enterprises across industries. They can include software for enterprise resource planning (ERP), customer relationship management (CRM), compliance, HR, and cybersecurity.\n\nVertically architected applications, on the other hand, offer broader services that cater to specific industries. Companies in this space tend to be earlier on in their lifecycles and could consist of those that develop healthcare-oriented applications designed specifically for doctors, education platforms built for colleges and universities, or property management software that serves the housing industry.\n\nWhat are some of the companies that you feel will have the advantage for their respective product(s) or within their respective verticals?",
        "subreddit": "stocks",
        "title": "Growing SaaS",
        "url": "https://www.reddit.com/r/stocks/comments/g57pyq/growing_saas/",
        "created": 1587468471.0
    },
    {
        "author": "ftstacks",
        "created_utc": 1586584515,
        "id": "fyxm17",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Thoughts on Netflix and Salesforce?",
        "url": "https://www.reddit.com/r/stocks/comments/fyxm17/thoughts_on_netflix_and_salesforce/",
        "created": 1586613315.0
    },
    {
        "author": "helsinki01",
        "created_utc": 1586240182,
        "id": "fwfcs9",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I think this bear-market rally has filled it's purpose. Many bears got killed. MM's recouped some losses. Retail investors going long again...\n\nCurrent Covid-19 scenario (US and World deaths) is priced in, but no the carnage that is coming after earnings announcements (think APPL on May 05) and another 20 million unemployment claims. \n\nAlso not priced in:\n- Suppliers from China still trying to recover. A new Covid wave in China seems to have started. Same for Hong Kong, Singapore. Japan figures are growing. Etc. How long before world travel and tourism resumes? And when it does, how many will have money to do so?\n\n- Homeowners are being allowed to defer their mortgage payments. What they don't know is that such payments are not being waived. In 90 days the banks call them to collect the money or start foreclosure. This is one of the numerous machiavelic actions from he powers that be. As long as a lender is willing to defer payments, they don't have to mark the mortgages as being in default. Basically they are delaying the crash the most they can. Don't believe for a second they will allow gay bears here to keep the tendies the got during the early March crash. These tendies belong to the MM's and they are working on getting them back. And the Federal Reserve is just making sure this happens (MM's/Banks/Federal Reserve are all the same). Real Estate WILL crash, but not now. Give it a few months.\n\n- Unless they come up with a vaccine stat, Covid-19 will start it's 2nd round around October. Just wait 'till this sinks in.\n\n- Social unrest hitting soon in many cities across the world. The world economy is paralized. People have no jobs or food. I give it a few weeks.\n\n- Many more. Too tired to list. You get the idea.\n\nI believe the market will drop a bit tomorrow, but it will then resume it's uptrend for a 2 to 4 weeks. Max pain. That's when market will revisit the lows. My target: SPY 180\n\n**THIS IS A BEAR MARKET RALLY. **\n\nI was lucky enough to buy my PUTs further out, right after selling my initial restaurant PUTs. \nCurrent Positions: \nAMH 9/18 17.5p, \nCBRE 9/18 35p, \nCRM 8/21 120p, 9/18 140p, 1/15 65p, 1/15 95p, \nSBUX 1/15 62.5p\nYUM 1/15 50p\nZ 1/15 25p\nSPY 6/19 150p (risky play. Will sell when SPY @ 220)",
        "subreddit": "wallstreetbets",
        "title": "Market will trend up a bit longer, then crash",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fwfcs9/market_will_trend_up_a_bit_longer_then_crash/",
        "created": 1586268982.0
    },
    {
        "author": "Warm_Tzatziki",
        "created_utc": 1587042858,
        "id": "g2eo4b",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Im having in my portfolio CRM and wondering if swaping for biogen wouldn't be a bad idea.\n\nBiogen should have good earnings (so should CRM have, they reduced the forecast, but should not underperform). \n\nMid term investment.",
        "subreddit": "StockMarket",
        "title": "CRM or BIIB",
        "url": "https://www.reddit.com/r/StockMarket/comments/g2eo4b/crm_or_biib/",
        "created": 1587071658.0
    }
]