[
    {
        "author": "marchsnow",
        "created_utc": 1597243625,
        "id": "i8f10b",
        "num_comments": 1625,
        "num_crossposts": 0,
        "selftext": "&gt; Last July, Harris released a plan to provide “comprehensive health insurance that covers every American.” The way she planned to achieve that? By expanding Medicare.\n\n&gt; Unlike Bernie Sanders, though, Harris did not envision achieving this goal by taxing families making under $100,000. Instead, she planned to pay for “Medicare For All” by taxing Wall Street.\n\n&gt; Her plan called for a 0.2% tax on stock trades, a 0.1% tax on bond trades and a 0.002% tax on derivative transactions. She claimed these taxes would raise more than $2 trillion over the course of a decade. Critics of the plan argued that taxing financial transactions in this way could make it harder for Americans to build retirement savings.\n\n- https://www.marketwatch.com/story/kamala-harris-on-student-loan-forgiveness-medicare-universal-basic-income-credit-scores-and-a-tax-on-trading-stocks-2020-08-12",
        "subreddit": "stocks",
        "title": "Kamala Harris wants to tax stock trades to fund medicare",
        "url": "https://www.reddit.com/r/stocks/comments/i8f10b/kamala_harris_wants_to_tax_stock_trades_to_fund/",
        "created": 1597272425.0
    },
    {
        "author": "rahul4122",
        "created_utc": 1596839719,
        "id": "i5nptk",
        "num_comments": 1514,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Dear Diary, I lost it all again",
        "url": "https://v.redd.it/oibm9p3aqnf51",
        "created": 1596868519.0
    },
    {
        "author": "politiksnubben",
        "created_utc": 1597674522,
        "id": "ibf5eb",
        "num_comments": 1438,
        "num_crossposts": 0,
        "selftext": "Thoughts on that? Am I the only one who sees this as one of the biggest bubbles ever in the market? This must be one of the greatest short squeezes of all time? When VW had the biggest short squeeze of all time it went up to 370b usd in value, and TSLA is soon passing that market cap.\n\nVW crashed HARD when it crashed however. Will TSLA be the same story?",
        "subreddit": "investing",
        "title": "TSLA is now trading at over 12 P/S ratio. Thoughts?",
        "url": "https://www.reddit.com/r/investing/comments/ibf5eb/tsla_is_now_trading_at_over_12_ps_ratio_thoughts/",
        "created": 1597703322.0
    },
    {
        "author": "DavePi81",
        "created_utc": 1597600573,
        "id": "iawy12",
        "num_comments": 1252,
        "num_crossposts": 0,
        "selftext": "My friend dropped out of community college and never had a job in his life.  He mostly watches anime and likes to finger paint. He inherited a good chunk of money from his grandmother who passed away recently, who made her fortune designing luxury dildos and vibrators. He is an avid reader of WSB and thinks he can turn the money into a few million in a snap.  What advice should I tell him so I don't watch him lose it all and come begging to me to pay his anime subscription like he usually does.",
        "subreddit": "wallstreetbets",
        "title": "Friend(24) never held a job in his life, inherited $450,000, and wants to trade options as a full time job.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iawy12/friend24_never_held_a_job_in_his_life_inherited/",
        "created": 1597629373.0
    },
    {
        "author": "MedicalLabScientist",
        "created_utc": 1598096145,
        "id": "iegxro",
        "num_comments": 1229,
        "num_crossposts": 0,
        "selftext": "1. I started my first 401k back around age 26 making $9.50 an hour. I contributed about 3-5% to get the match.\n2. Got a job as a Phlebotomist and made around $12-$14 an hour from say age 28-33 and continued to contribute around 5%\n3. After about 7 years of this at age 33 my balance was maybe around $20,000 or so (kind of disappointing)\n4. Age 34 graduated college and got first real job as a medical technologist making $24.50 an hour and bumped 403b up to 10%\n5. Age 37 making about $27 an hour as Medical Technologist and bumped it up to 15% contribution limit.\n6. final around age 39 making $29 an hour and 15% contribution I finally hit the $100,000 mark in my 403b account. It took me a good 12-13 years of saving.\n7. I am now age 41 and first year I moved to San Diego and am going to earn low six figures this year. I have bumped 403b up to max $19,000 per year. \n8. My liquid assets are now at $267,000.\n\nI am shocked at how fast the ball gets rolling once you hit that first $100,000 balance in your 401k/403b. I took forever to reach that milestone but once i got there I probably made most of the second 100K in about 2 years compounding interest and the fact that I think it sets something off inside of you where you see that on a good market day your money can make you more in one great stock market day then you earn at your 9-5 job in a 2 week pay period. I could only imagine how fast wealth starts to snowball once you reach $1,000,000 and a good 2019 stock market year could add $250,000 to your portfolio. (more then most middle class workers earn in 5 years of work) \n\nMy 2 questions for this post are did anyone else notice that once you hit $100K liquid assets it seems like its kind of the sweet spot where your wealth snowball really starts rolling.\n\nSecondly, why do so many people who focus so hard on earning money at their job, totally ignore saving and investing where undeniably once you reach a certain point your money will begin to go to work everyday, earning as much as a Physician, and start earning you a second six figure income passively.\n\nIts almost as if the number one secret to financial life is to get to 100K then 1,000,000 as quick as humanly possible and then coast the rest of your life one easy mode.",
        "subreddit": "investing",
        "title": "The first $100,000 is the hardest, Anyone else agree?",
        "url": "https://www.reddit.com/r/investing/comments/iegxro/the_first_100000_is_the_hardest_anyone_else_agree/",
        "created": 1598124945.0
    },
    {
        "author": "dhsmatt2",
        "created_utc": 1597421822,
        "id": "i9oxfk",
        "num_comments": 1074,
        "num_crossposts": 0,
        "selftext": "I am currently sitting on 2.998M. I expect I will be close to 3.2 after my spreads expire. I sold some stock after hours yesterday just incase we plummeted today. That move cost me about 75K but it was a hedge in case warrants dropped. Debit spreads are the way.\n\nhttps://preview.redd.it/npqdqikrszg51.jpg?width=806&amp;format=pjpg&amp;auto=webp&amp;s=6e7ab8b792b6a7e1caa374088820fefd78ddf5ea",
        "subreddit": "wallstreetbets",
        "title": "Loss porn? I guess PRPL raped me down to 3M",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i9oxfk/loss_porn_i_guess_prpl_raped_me_down_to_3m/",
        "created": 1597450622.0
    },
    {
        "author": "lilchaseyyy",
        "created_utc": 1596809291,
        "id": "i5ega6",
        "num_comments": 1031,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "My Girlfriend PDT restricted and thought it was an achievement",
        "url": "https://i.redd.it/cmhthxzb8lf51.jpg",
        "created": 1596838091.0
    },
    {
        "author": "WhichEdge",
        "created_utc": 1597832272,
        "id": "ickzrz",
        "num_comments": 885,
        "num_crossposts": 0,
        "selftext": "(Apologies if double post the filters misunderstood a word)\n\nI have to ask... Is anyone else starting to get shit scared?\n\nThe SPY is officially higher than it was at the peak before the fall.\n\nThe SPY Growth is almost 10% higher than at the peak before the fall.\n\nThe DOW is down only around 6% from the all time highs.\n\nThe S&amp;P 500 is now above all time highs.\n\nEven the TSX is only down around 7% from all time highs and the oil sector and other major industries of Canada got decimated..\n\nWe are seeing Warren Buffet go into Gold I never thought I would see the day (I know people are gonna do the standard quip but Buffet and Munger are beasts).\n\nWe are now seeing the trade volume hit all time lows on certain key areas.\n\nWe still have massive waves from COVID in areas of employment, debt, inflation/deflation, business closure, bankruptcy, massive inequality of savings/wealth.\n\nWe have certain segments blown up to the point that when I look at the charts I don't even think \"bubble\" is an accurate term. The charts literally give me cancer they are so intense to look at.\n\nI love pa pa elon just like everyone but the fact that this short squeeze has taken us to around 1900 is insane. Guys this is over 100% on top of the short squeeze from last time and they are down this quarter in actual revenue.\n\nThis may all keep going on for more time than I could ever imagine. Maybe a year or even more but man I am so worried that some people are gonna lose everything when this bursts.\n\nFor god sakes away from the memes for a second and our fun ass phrases please please be careful that you aren't going over what you can handle if this reverses.\n\nWe have already seen how some main stocks can go down 60-80% once they start falling in a month and how the whole indexes can fall almost 50% in a month and a half.\n\nGuys be careful for real.",
        "subreddit": "wallstreetbets",
        "title": "Is anyone else starting to get shit scared?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ickzrz/is_anyone_else_starting_to_get_shit_scared/",
        "created": 1597861072.0
    },
    {
        "author": "TrumpPnisTiny",
        "created_utc": 1597160740,
        "id": "i7u2dl",
        "num_comments": 825,
        "num_crossposts": 0,
        "selftext": "https://www.bloomberg.com/news/articles/2020-08-10/trump-says-he-s-seriously-considering-capital-gains-tax-cut\n\nPresident Donald Trump said he’s “very seriously” considering a capital gains tax cut, a move he decided against last September after saying it wouldn’t do enough to help the middle class.\n\n“We’re looking at also considering a capital gains tax cut, which would create a lot more jobs,” Trump said Monday at a White House news conference.",
        "subreddit": "stocks",
        "title": "Trump Says He’s ‘Seriously’ Mulling a Capital Gains Tax Cut",
        "url": "https://www.reddit.com/r/stocks/comments/i7u2dl/trump_says_hes_seriously_mulling_a_capital_gains/",
        "created": 1597189540.0
    },
    {
        "author": "vegadust",
        "created_utc": 1596975572,
        "id": "i6if11",
        "num_comments": 822,
        "num_crossposts": 0,
        "selftext": "You know what I read here once about a shady Chinese company that always stuck with me? Someone said \"this sub is about making money, nothing else.\"\n\nWell guess what, I disagree you wretch, whoever you are. Being a money grubbing little piece of shit with no allegiance or loyalty might make you money in the short term, but you'll have to live your life as a traitorous gay nerd.\n\nChina is fucking with America, hardcore. They're exploiting our weakness and drumming up infighting in-between us with their troll farms. They're even inciting BLM protests in JAPAN (look it up), it'd be god damn hilarious if I didn't see my city get torn apart a month ago.\n\nYou assholes are salivating over Microsoft potentially buying tik tok. FUCK TIK TOK. China has banned google, Facebook, and a plethora of other AMERICAN companies so they could create their own replicas in China. Why should America let a Chinese company come in and dominate when they don't allow us to compete in China? \n\nNo, I'm supporting **Facebook Reels**. I know Zuckerborg is a retarded nerd who spies on everyone, but he's **MY** retarded gay nerd who spies on everyone. I'm done kowtowing to China. I don't vote or do anything remotely political or actually useful for society, but the very least I can do is buy FACEBOOK CALLS.",
        "subreddit": "wallstreetbets",
        "title": "Fuck you I'm going in hard on Facebook calls on Monday.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i6if11/fuck_you_im_going_in_hard_on_facebook_calls_on/",
        "created": 1597004372.0
    },
    {
        "author": "ulisesmetal",
        "created_utc": 1598018076,
        "id": "idx57z",
        "num_comments": 756,
        "num_crossposts": 0,
        "selftext": "Listen, I've been eyeing Tesla since it hit 1,000 and I resisted to buy it because part of it is hype. Months later and there's no signs of slowing down.  I caved in and bought it at 2,000. Don't want to regret it if it hits 2500 plus. Who's in the same boat as I am? New Battery, Stock splits, and China Market are all positive things for the future.",
        "subreddit": "stocks",
        "title": "I bought Tesla Yesterday. Caved in.",
        "url": "https://www.reddit.com/r/stocks/comments/idx57z/i_bought_tesla_yesterday_caved_in/",
        "created": 1598046876.0
    },
    {
        "author": "lurkingsince2006",
        "created_utc": 1596405654,
        "id": "i2koyx",
        "num_comments": 736,
        "num_crossposts": 0,
        "selftext": "Well, I've officially made my first, second, and third million from PRPL (I called it [right here](https://www.reddit.com/r/wallstreetbets/comments/gs7mjl/prpl_more_dd_for_you_autists/) two months ago).   My net liquidity in PRPL as of Friday close is $2,622,131,72.   That, along with the $380k I've taken out, I'm at just over $3M.   At this point, when you take into account all the stupid moves I made when I first found this sub, I'm now playing with house money.\n\n&amp;#x200B;\n\n# Has PRPL Memed Yet?\n\nNo.   It hasn't.   Not yet.   \n\nI'm kind of getting tired of answering this in PMs, so please don't ask me if it is too late to invest.   This hasn't memed and I believe we will be in the $25-27 range easily after earnings just by fundamentals alone (assuming the previous low visibility on the stock).   As visibility increases, I think the valuation multiple increases, and not past fundamentals.   We will see higher if this becomes a no longer under-the-radar stock.\n\nThis isn't a meme yet, and it is no where close.\n\nHow do we know?   Let's look at the ultimate source of truth on the subject:  [Robintrack](https://robintrack.net/symbol/PRPL).\n\n&amp;#x200B;\n\nhttps://preview.redd.it/lzr2qdg4kne51.png?width=1889&amp;format=png&amp;auto=webp&amp;s=46997d3050986a77c318c7c9e17ceb39cf8b7f91\n\nAs you can see, we've seen a significant influx of Robinhood tards in the last few days, but this isn't memeing, yet.\n\nIf you check the [Robintrack popularity changes](https://robintrack.net/popularity_changes?hoursAgo=168) over the last week, PRPL comes in at #113 most popular in terms of user growth.    That isn't very high at all.   It's surrounded by other stocks you've never heard of.\n\nhttps://preview.redd.it/j2376iielne51.png?width=576&amp;format=png&amp;auto=webp&amp;s=1ea7b7afb1b7de17dd2f36d4bde3f5f17c0ebf5d\n\nThis is hardly meme worthy yet.   Compare this to KODK:\n\nhttps://preview.redd.it/u62x1fgdmne51.png?width=585&amp;format=png&amp;auto=webp&amp;s=83b16c21e2b56c23818b6a48c97ee0410c12047a\n\nWe should also compare PRPL to two recents meme stocks:  SPCE and DKNG.   As a side note, all three of these stocks came from SPACs BTW, hence the warrants.\n\nhttps://preview.redd.it/ne6lwwnvpne51.png?width=1892&amp;format=png&amp;auto=webp&amp;s=e97dba747dc51ec779ef8a8a5640f72257313798\n\nSPCE shot up to about 92,000 Robintards very quickly, which drove the price up.   When the rate of Robintard increases declined and flattened out, the stock dropped.   There are now 150k Robintards holding.\n\nhttps://preview.redd.it/0xndxysxpne51.png?width=1890&amp;format=png&amp;auto=webp&amp;s=c4db5e52718775e5b30ffe74d59784f34395600c\n\nDKNG shot up to about 100,000 Robintards investing on the meme run up, and still has about 120k still in.  The meme drop off is less pronounced on DKNG because, unlike SPCE, they have this thing called \"Revenue\".\n\nKODK, SPCE, and DKNG all had run ups to about 100k Robintards driving the meme up in price way over fundamentals.   PRPL only has 6,600 Robintards, and the current price is fully supported by fundamentals (see some of my previous posts and u/dhsmatt2's previous posts if you want support on that statement).\n\nSo, no, it isn't a meme.   Keep tabs on this though as Robintard entry could definitely cause this to meme up (and we may very well be in the early stages of this right now).   Buy calls now and sell when we start getting close to 100k Robintards.\n\n# Financial Analysis\n\nI think u/dhsmatt2 did a pretty good job [here](https://www.reddit.com/r/wallstreetbets/comments/i0zaqh/prpl_nurples_why_purple_valuation_just_might_make/?sort=new).   My only two comments are:  1)  I think his revenue estimate is low (mine:  $244m, his $225M), and 2)  the warrant liability accrual won't be recurring at the same level (we will see one big bang this quarter and then a wimper going forward until the warrants are gone--so his forward EPS estimate should be higher on his math).\n\nMy revenue estimates:\n\n||Q2 Total|June|May|April|\n|:-|:-|:-|:-|:-|\n|Direct-to-Consumer (DTC)|*205.0*|*80.0*|**71.0**|**54.0**|\n|Wholesale Partner|*39.0*|*19.0*|**17.3**|*2.7*|\n||||||\n|Total|*244.0 M*|*99.0*|**88.3**|*56.7*|\n\nThe bold numbers are known for sure as they were disclosed.   The italicized are my estimates.\n\nI'm putting June DTC as an acceleration over May because of the following:\n\n1. The website still showed significant delays in delivery, which means they were still selling every mattress they make.\n2. Extra manufacturing capacity came online at the beginning of June.\n3. Purple discontinued its lower end models, which would cause a mix shift up in revenue per unit when selling at capacity.\n\nI may be underestimating this as well.\n\nI placed wholesale where it was at because it is still recovering and Joe Megibow [said in this video](https://www.youtube.com/watch?v=uP8ggnn9nK8&amp;feature=youtu.be) that they were almost flat of wholesale year over year at this point.\n\n# Valuations\n\nI'm copying this [from a previous post](https://www.reddit.com/r/wallstreetbets/comments/hig038/i_bought_six_prpl_mattresses_today_you_should_buy/), even though the data is slightly dated now after TPX and SNBR had their releases.\n\n**Enterprice Value / Revenue**\n\n|Ticker|As of 6/28/20|2020 Q1|2019 Q4|2019 Q3|2019 Q2|2019 Q1|\n|:-|:-|:-|:-|:-|:-|:-|\n|PRPL|2.01|2.52|3.94|3.61|3.73|3.09|\n|TPX|1.71|4.84|7.39|7.34|8.07|6.88|\n|SNBR|0.98|2.36|4.40|3.79|4.97|3.78|\n|CSPR|0.53|0.91|||||\n\nBased upon the chart, I don't see a 2x multiple on revenue as unreasonable at all for PRPL, and arguably, it should be higher due to the acceleration in growth rate.\n\nThe Q2 revenue pattern will continue into Q3 and beyond (they are still backed up on delivery on several products).   Additionally, they will be bringing substantial capacity online in the next year to support sales.   I see PRPL producing $800M-$1,200M in revenue over the next year as we see continued capacity growth, shift into higher end mattresses, and continued expansion on both DTC and wholesale doors.\n\nClearly, it is easy to justify the $1.32B valuation as of close Friday, and arguably, much higher.\n\n# Positions\n\n&amp;#x200B;\n\nhttps://preview.redd.it/kza0j31utne51.png?width=1242&amp;format=png&amp;auto=webp&amp;s=dcb053f5300205be309cdf19b4fbc23a7a6df276\n\nA bunch of warrants and call debit spreads.  \n\n# Recommendations\n\nI don't have any recommendations.   Go talk to your investment advisor as this isn't investment advice.   What am I looking at right now?   Debit spreads.\n\nhttps://preview.redd.it/6hv4gez1une51.png?width=1242&amp;format=png&amp;auto=webp&amp;s=b8bdb7c9ecd0ae6730e95732434687b2ecc56a11\n\nIf you took the ask, you can pick up a 20/22.5c debit spread for only $1.70.   It pays out $2.50 as long as the stock stays above $22.50 after earnings (likelihood is extremely high as the stock is currently at $24.37).\n\nFor those of you who are asking what to do or wondering if it is too late to make money:   that is an example conservative position to take even if you think the stock will be flat from here on out till earnings (it won't be).\n\nMy bet is that it continues to grow each day on a run up.   I'll be watching Robintrack very closely on the run up.    My plan is to hold through earnings, unless we meme up.\n\n&amp;#x200B;\n\n# PRPL GANG FTW!!!",
        "subreddit": "wallstreetbets",
        "title": "$3M from PRPL and Has It Memed Yet?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i2koyx/3m_from_prpl_and_has_it_memed_yet/",
        "created": 1596434454.0
    },
    {
        "author": "parvvvvv",
        "created_utc": 1596561347,
        "id": "i3ne0h",
        "num_comments": 637,
        "num_crossposts": 0,
        "selftext": "Guys lets get more puts on this bitch😂😂😂\n\nThe Securities and Exchange Commission has launched an investigation of the trading in shares of Eastman Kodak Co. before and after the news last week of a $765 million government loan to help it make drugs at its U.S. factories, the Wall Street Journal reported Tuesday, citing people familiar with the matter. The loan news caused Kodak's shares to climb to as high as $60, before falling back to $15 on Monday, in massive trading volume. The stock had already moved 25% the day before the news was officially disclosed. Executives with stock options, including some awarded the day before the loan became public, were sitting on big paper gains. Kodak shares were down 1.3% Tuesday, but are up 215% in the year to date, while the S&amp;P 500 has gained 2%.\n\n\nhttps://research.tdameritrade.com/grid/public/markets/news/story.asp?docKey=1-DN20200804010106&amp;cid=1-DN20200804010106-MIP",
        "subreddit": "wallstreetbets",
        "title": "SEC Launches Investigation Of Trading In Kodak Shares Before And After $765 Million Loan Disclosure",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i3ne0h/sec_launches_investigation_of_trading_in_kodak/",
        "created": 1596590147.0
    },
    {
        "author": "glaknight",
        "created_utc": 1598039645,
        "id": "ie3yr4",
        "num_comments": 605,
        "num_crossposts": 0,
        "selftext": " New York (CNN Business)Tesla is preparing to [split its stock](http://www.cnn.com/2020/08/11/cars/tesla-stock-split/index.html), making it more affordable for average investors. It may need to do another one pretty soon if its shares keep surging.Tesla ([TSLA](https://money.cnn.com/quote/quote.html?symb=TSLA&amp;source=story_quote_link)) has skyrocketed 50% since announcing the stock split on August 11. It now trades at nearly $2,100 a share.Once [the split](http://www.cnn.com/2020/08/18/investing/stock-splits-apple-tesla/index.html) goes into effect on August 31, current Tesla investors will get five shares for each one they own. That will [cut the price](http://www.cnn.com/2020/08/11/cars/tesla-stock-split/index.html) by a fifth, to almost $420 a share. The market value of Tesla, now hovering around $390 billion, will remain the same.But does Tesla deserve to trade at such a high valuation? While the [Elon Musk-led company](http://www.cnn.com/2020/08/18/success/elon-musk-tesla-ipo-vault-interview/index.html) is generating [consistent profits](http://www.cnn.com/2020/07/22/cars/tesla-earnings-q2/index.html), its sales are dwarfed by the major auto giants.Tesla is expected to generate nearly $30 billion in annual revenue this year. That’s nothing to sneeze at. But Fiat Chrysler ([FCAU](https://money.cnn.com/quote/quote.html?symb=FCAU&amp;source=story_quote_link)) is estimated to report $100 billion in sales for 2020. GM ([GM](https://money.cnn.com/quote/quote.html?symb=GM&amp;source=story_quote_link)) and Ford ([F](https://money.cnn.com/quote/quote.html?symb=F&amp;source=story_quote_link)) are each forecast to post annual revenue of more than $110 billion.Still, Tesla’s market value is now more than four times the combined market caps of Detroit’s Big 3.\n\nA majority of Wall Street analysts are betting against Tesla. Of the 33 that officially track the stock, only eight have a buy rating on Tesla while 15 have it rated a hold and 10 are recommending a sell on it.Only three of the Tesla analysts currently have a price target for it above $2,000. The consensus target is just under $1,300 — almost 40% below its current price.Tesla continues to be a [big target of short sellers](http://www.cnn.com/2020/01/30/investing/short-selling-squeeze/index.html), investors who borrow the stock and sell it with the hopes of eventually buying it back at a lower price.Of course, Tesla fans can correctly point out that analysts have been consistently wrong and that Wall Street will eventually have to raise its earnings forecasts and price targets on the stock.Tesla may also get a further boost if it is [finally added](http://www.cnn.com/2020/02/06/investing/tesla-sp-500/index.html) to the blue-chip [S&amp;P 500 index](https://money.cnn.com/data/markets/sandp/) — a move that could soon happen now that the company has posted a consistent run of profitable quarters.\n\nFull Article:  [http://pioret.com/tesla-has-soared-50-since-announcing-its-stock-split-last-week](http://pioret.com/tesla-has-soared-50-since-announcing-its-stock-split-last-week)",
        "subreddit": "investing",
        "title": "Tesla has soared 50% since announcing its stock split — last week",
        "url": "https://www.reddit.com/r/investing/comments/ie3yr4/tesla_has_soared_50_since_announcing_its_stock/",
        "created": 1598068445.0
    },
    {
        "author": "tdogger88",
        "created_utc": 1597713424,
        "id": "ibrc1j",
        "num_comments": 594,
        "num_crossposts": 0,
        "selftext": "In most of our generations we’ve never seen valuations like this before. \n\nTesla - A car company that shocks people when it makes a profit and has $13B in debt is valued at $350B (just lol.)\n\nApple - A hardware company that sells electronics valued at almost $2T (I actually don’t think Apple is that overvalued). \n\nZoom - A video chat app that’s used because of work from home valued at $80B while doing roughly $20m in quarterly net income. \n\nAMD - A graphics and chip designer that does a little over $100M in quarterly net income valued at $100B. \n\nShopify - An e-commerce platform that helps small business create an online presence. Still operating at a loss, valued at $120B.\n\nUber - A ride hailing company that has reported net income of -$7B the past year while running into all types of regulatory issues valued at $50B.\n\nThe list goes on and on, let’s have some fun with this one. Not saying they can’t go higher, but when they fall, it’s going to be fun to watch. \n\nBTW, I’m super long Apple, SOXX, and Baba. (Over 100k in Baba leaps)",
        "subreddit": "wallstreetbets",
        "title": "Let’s play a game, who’s the most overvalued at current price.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ibrc1j/lets_play_a_game_whos_the_most_overvalued_at/",
        "created": 1597742224.0
    },
    {
        "author": "3STmotivation",
        "created_utc": 1597498352,
        "id": "ia7el4",
        "num_comments": 591,
        "num_crossposts": 0,
        "selftext": "That's right, your monthly update on the sector that the majority of people seem to hate and has a total market cap almost equal to that of Pinterest. Yes, even I was suprised about this. A sector that provides fuel for powering 20% of the entire US and around 10% of all power generation globally has a combined market cap equivalent to a website where you can look for pictures of furniture (extremely simplified but you get the point).\n\nBut I digress, for those of you who have not read my previous updates and DD, [here](https://amp.reddit.com/r/investing/comments/hp9966/the_case_for_a_big_uranium_bull_market_and_what/) is a general market analysis and five stock suggestions, [here](https://amp.reddit.com/r/investing/comments/huo47l/uranium_miners_are_showing_big_growth_with_many/) is a market update and lastly [here](https://amp.reddit.com/r/stocks/comments/i2bf4d/the_sector_that_returned_20x_50x_100x_and_even/) another update explaining the bullish views and recent drop. I would highly suggest you read these first before asking questions, since they will probably answer most questions you may have in the post itself or between the hundreds of comments. If you do have more questions, I will be more than happy to answer them for you.\n\nNow, let's move on to the big one, what is happening in the sector? Well it looks like 2021 is going to be the year all catalysts come together to form one incredible bull market for uranium. \n\nKazatomprom has publicly announced that their supply in 2021 will be severely impacted. Why is that? Because ISR mining in Kazakhstan is a lot like planting crops. A mining solution has to be put into the ground, which will go into the ore bodies and after between 4 and 7 months the solution can be pumped back out together with the uranium ore. The only problem is that the main 'seeding' months where between April and September, right before Kazakhstan winter. They have now missed their main mining time of the year, which means little to no new uranium will be pulled out of the ground next year for the first time in a long long time. With Kazakhstan responsible for just around 40% of the entire global supply of uranium, this impact will translate into a major supply deficit on top of the already existing supply deficit. This year it is estimated that there will be around 120 million pounds of uranium produced, where 180 million pounds was demanded. This means that inventory and mobile supply had to be used to fill this gap, further tightening the global supply of uranium. Let's talk about the wildest situation, which would be every single uranium producer, including at Olympic Dam, just ramps up to full capacity and sell everything into the market at whatever the current price is. Will that drop the price a bit? Sure it will. Will it take care of the deficit and prevent this bull market from happening? Absolutely not.\n\nIf this structural deficit happened to any other commodity, the price would absolutely skyrocket. So why hasn't uranium? Because there has been almost no talk of nuclear utilities, the main consumer of uranium, coming into the market to buy new fuel. This will change in 2021 and especially 2022 when 40% and 80% of all utilities in the US respectively will be out of contract and thus not getting their all important fuel for the nuclear power plants.\n\nThis contracting cycle comes at the same time as the biggest supply deficit we have yet seen, the closing of several high profile uranium mines, like Orano's Cominak mine, the lack of new uranium mines for at least the next 2/3 years and above all the increasing demand for uranium all across the globe make this entire sector a coiled spring. We do not know when it will go off, but the longer it stays this way the higher the jump and this jump will come. My guess is that there are several small bumps this year and that there will be a huge jump next year which will trigger a bull market that may even eclipse the likes of 2002-2007 and will last between 2-4 years depending on how long it takes for all utilities to sign new contracts and the market to be supplied well again, after which the market will come back down to 'normal levels'.\n\nLastly, there have been index funds who are restructuring their holdings to have more pure play exposure to uranium. $URA will move from 50% to 70%, adding 32 million dollars to the sector. With a sector that had such a small market cap, inflow of capital like this can move the needle substantially. Just imagine what will happen when the general investment community and all those people who made millions in the previous bull market decide to invest into the sector. That will do more than just moving the needle or spring the coil, that would put the needle and the coil into a cannon.\n\nAll signs point to this being the most asymmetrical risk/reward investment you can find in the market. I will not deny the risk it brings, but the potential rewards are so large that they easily write off any risk that might be involved investing in this sector. When all is set and done, those that invested early and held on through all the volatility will be greatly rewarded for their troubles.\n\nExtras:\nI highly suggest checking out people like Brandon Munro, the uranium insider, John Quackes, Crux Investor, Rob Chang and especially Mike Alkin who all have extensive information on the sector and the investment thesis.\n\nDisclaimer:\nUranium holds a 25% spot in my total portfolio, with significant positions in Cameco (CCO), Denison Mines (DNN) and Energy Fuels (UUUU).",
        "subreddit": "investing",
        "title": "The coiled spring that is the uranium market (an update on the supply deficit and a 2021 outlook)",
        "url": "https://www.reddit.com/r/investing/comments/ia7el4/the_coiled_spring_that_is_the_uranium_market_an/",
        "created": 1597527152.0
    },
    {
        "author": "pikindaguy",
        "created_utc": 1596468077,
        "id": "i2yx70",
        "num_comments": 590,
        "num_crossposts": 0,
        "selftext": "Markets seem to really love this move and if the Tiktok deal goes through it's almost like a \"free\" purchase for MSFT with their stock gains.\n\nAccording to Forbes Tiktok is estimated to be worth about $50B right now: https://www.forbes.com/sites/elanagross/2020/07/29/a-reported-takeover-bid-values-tiktok-at-50-billion\n\nMSFT is also sitting on about $140B in cash at the moment too so an all-cash deal is also possible.\n\nImagine buying a $10 burger and getting $12 back on it.",
        "subreddit": "investing",
        "title": "With looming Tiktok deal estimated at $50B, MSFT gains 4% or $64B in value",
        "url": "https://www.reddit.com/r/investing/comments/i2yx70/with_looming_tiktok_deal_estimated_at_50b_msft/",
        "created": 1596496877.0
    },
    {
        "author": "lurkingsince2006",
        "created_utc": 1597274203,
        "id": "i8olie",
        "num_comments": 583,
        "num_crossposts": 0,
        "selftext": "# tl;dr - Earnings is gonna be lit!\n\n[PRPL earnings is tomorrow, 8/13, after hours](https://investors.purple.com/press-releases/news-details/2020/Purple-to-Report-Second-Quarter-2020-Results-on-August-13-2020/default.aspx).   Any other date is wrong.  Robinhood is wrong (why are you using Robinhood still!?!).\n\nI'm going to take you through my earnings projections and reasoning as well the things to look for in the earnings release and the call that could make this moon even further.\n\n&amp;#x200B;\n\n# Earnings Estimates\n\nhttps://preview.redd.it/w3qad4gb9ng51.png?width=854&amp;format=png&amp;auto=webp&amp;s=7a88656a9867d0e40710736f61974a22b5f4a631\n\nI'm calling $244M Net Revenue with $39.75M in Net Income, which would be $0.75 Diluted EPS.  I'll walk you through how I got here\n\n# Total Net Revenue\n\nI make the assumption that Purple is still selling every mattress it can make (since that is what they said for April and May) and that this continued into June because the website was still delayed 7-14 days across all mattresses at the end of June.\n\n**May Revenue and April DTC:**  The numbers in purple were provided by Purple [here](https://investors.purple.com/press-releases/news-details/2020/Purple-Innovation-Reports-Record-First-Quarter-2020-Results/default.aspx) and [here](https://investors.purple.com/press-releases/news-details/2020/Purple-Innovation-Provides-Business-Update-Ahead-of-Participation-in-Oppenheimer-20th-Annual-Consumer-Growth-Conference/default.aspx).  \n\n**April Wholesale:**  My estimate of $2.7M for Wholesale sales in April comes from this statement from the Q1 earnings release:  \" *While wholesale sales were down 42.7% in April year-over-year, weekly wholesale orders have started to increase on a sequential basis.* \"  I divided Q2 2019's wholesale sales evenly between months and then went down 42.7%.\n\n**June DTC:**  This is my estimate based upon the fact that another Mattress Max machine went online June 1, thus increasing capacity, and the low end model was discontinued (raising revenue per unit).\n\n**June Wholesale:**  [Joe Megibow stated at Commerce Next](https://www.youtube.com/watch?v=uP8ggnn9nK8&amp;feature=emb_logo) on 7/30 that wholesale had returned to almost flat growth.  I'm going to assume he meant for the quarter, so I plugged the number here to finish out the quarter at $39.0M, just under $39.3M from a year ago.\n\n&amp;#x200B;\n\n**Revenue Expectations from Analysts** ([via Yahoo](https://finance.yahoo.com/quote/PRPL/analysis?p=PRPL))\n\nhttps://preview.redd.it/notxd6hhbng51.png?width=384&amp;format=png&amp;auto=webp&amp;s=aa0453414f467aa6c5bf72ce8a8046c0ae6e62a5\n\nMy estimate of $244M comes in way over the high, let alone the consensus.   PRPL has effectively already disclosed \\~$145M for April/May, so these expectations are way off.  I'm more right than they are.\n\n# Gross Margins\n\nI used my estimates for Q3/Q4 2019 to guide margins in April/May as there were some one time events that occurred in Q1 depressing margins.   June has higher margin because of the shift away from the low end model (which is priced substantially lower than the high end model).   Higher priced models were given manufacturing priority.\n\n# Operating Expenses\n\n**Marketing and Sales**\n\nJoe mentioned in the [Commerce Next](https://www.youtube.com/watch?v=uP8ggnn9nK8&amp;feature=emb_logo) video that they were able to scale sales at a constant CAC (Customer Acquisition Cost).   There's three ways of interpreting this:\n\n1. Overall customer acquisition cost was constant with previous quarters (assume $36M total, not $93.2M), which means you need to add another $57M to bottom line profit and $1.08 to EPS, or\n2. Customer Acquisition Costs on a unit basis were constant, which means I'm still overstating total marketing expense and understating EPS massively, or\n3. Customer Acquisition Costs on a revenue basis were constant, which is the most conservative approach and the one I took for my estimate.\n\nI straightlined the 2.2 ratio of DTC sales to Marketing costs from Q1.   I am undoubtably too high in my expense estimate here as PRPL saw marketing efficiencies and favorable revenue shifts during the quarter.  So, $93.2M\n\n**General and Administrative**\n\nA Purple HR rep [posted on LinkedIn](https://www.linkedin.com/feed/update/urn:li:activity:6691037138018017280/) about hiring 330 people in the quarter.   I'm going to assume that was relative to the pre-COVID furloughs, so I had June at that proportional amount to previous employees and adjusted April and May for furloughs and returns from furlough.\n\n**Research and Development**\n\nI added just a little here and straight lined it.\n\n# Other Expenses\n\n**Interest Expense**\n\nStraightlined from previous quarters, although they may have tapped ABL lines and so forth, so this could be under.\n\n**One Time and Other**\n\nUnpredictable by nature.\n\n**Warrant Liability Accrual**\n\nI'm making some assumptions here.   \n\n1. We know that the secondary offering event during Q2 from the Pearce brothers triggered the clause for the loan warrants (NOT the PRPLW warrants) to lower the strike price to $0.\n2. I can't think of a logical reason why the warrant holders wouldn't exercise at this point.\n3. Therefore there is no longer a warrant liability where the company may need to repurchase warrants back.\n4. The liability accrual of $7.989M needs to be reversed out for a gain.\n\nThis sucker is worth about $0.15 EPS on its own.\n\n# Earnings (EPS)\n\nI project $39.75M or $0.75 Diluted EPS (53M shares).  How does this hold up to the analysts?\n\n**EPS Expectations from Analysts** ([via Yahoo](https://finance.yahoo.com/quote/PRPL/analysis?p=PRPL))\n\nhttps://preview.redd.it/o2i1dvk6hng51.png?width=373&amp;format=png&amp;auto=webp&amp;s=27e63f7934d85393e1f7b87bf2e2066c28047202\n\n**EPS Expectations from Analysts** ([via MarketBeat](https://www.marketbeat.com/stocks/NASDAQ/PRPL/earnings/))\n\nhttps://preview.redd.it/psu5rajfhng51.png?width=1359&amp;format=png&amp;auto=webp&amp;s=0612d43777c644789b14f8c5decbe36f41925f5e\n\nThese losers are way under.   Now you know why I am so optimistic about earnings.\n\nKeep in mind, these analysts are still giving $28-$30 price targets.  \n\n&amp;#x200B;\n\n# What to Watch For During Earnings (aka Reasons Why This Moons More)\n\nAnalysts, Institutionals, and everyone else who uses math for investing is going to be listening for the following:\n\n* Margin Growth\n* Warrant Liability Accrual\n* Capacity Expansion Rate\n* CACs (Customer Acquisition Costs)\n* New Product Categories\n* Cashless Exercise of PRPLW warrants\n\n&amp;#x200B;\n\n**Margin Growth**\n\nThis factor is HUGE.  If PRPL guides to higher margins due to better sales mix and continued DTC shift, then every analyst and investor is going to tweak their models up in a big way.   Thus far, management has been relatively cautious about this fortuitous shift to DTC continuing.   [If web traffic is any indicator](https://www.reddit.com/r/wallstreetbets/comments/i7gjsn/prpl_q2_revenue_forecast_using_web_traffic/), it will, but we need management to tell us that.\n\n**Warrant Liability Accrual**\n\nI could be dead wrong on my assumptions above on this one.   If it stays, there will be questions about it due to the drop in exercise price.   It does impact GAAP earnings (although it shouldn't--stupid accountants).\n\n**Capacity Expansion Rate**\n\nThis is a BIG one as well.   As PRPL has been famously capacity constrained: their rate of manufacturing capacity expansion is their growth rate over the next year.  PRPL discontinued expansion at the beginning of COVID and then re-accelerated it to a faster pace than pre-COVID by hurrying the machines in-process out to the floor.   They also signed their [manufacturing space deal](https://investors.purple.com/press-releases/news-details/2020/Purple-Expands-U.S.-Manufacturing-with-a-New-Facility-in-Georgia/default.aspx) which has nearly doubled manufacturing space a quarter early.   The REAL question is when the machines will start rolling out.   Previous guidance was end of the year at best.   If we get anything sooner than that, we are going to ratchet up.\n\n**CACs (Customer Acquisition Costs)**\n\nSince DTC is the new game in town, we are all going to want to understand exactly where marketing expenses were this quarter and, more importantly, where management thinks they are going.   The magic words to listen for are \"marketing efficiencies\".   Those words means the stock goes up.  This is the next biggest line item on the P&amp;L besides revenue and cost of goods sold.\n\n**New Product Categories**\n\nWe [heard the VP of Brand](https://www.iheart.com/podcast/256-authentic-influence-31157510/episode/purple-vp-of-brand-burke-morley-67762598/) from Purple give us some touchy-feely vision of where the company is headed and that mattresses was just the revenue generating base to empower this.   I'm hoping we hear more about this.    This is what differentiated Amazon from Barnes and Noble:  Amazon's vision was more than just books.   Purple sees itself as more than just mattresses.   Hopefully we get some announced action behind that vision.   This multiplies the stock.\n\n**Cashless Exercise of PRPLW Warrants**\n\nI doubt this will be answered, even if the question is asked.   I bet they wait until the 20 out of 30 days is up and they deliver notice.   We could be pleasantly surprised.   If management informs us that they will opt for cashless exercise of the warrants, this is anti-dilutive to EPS.   It will reduce the number of outstanding shares and automatically cause an adjustment up in the stock price (remember kids, some people use math when investing).   I'm hopeful, but not expecting it.   The amount of the adjustment depends on the current price of the stock.    Also, I fully expect PRPL management to use their cashless exercise option at the end of the 20 out of 30 days as they are already spitting cash.\n\n# Positions\n\n&amp;#x200B;\n\nhttps://preview.redd.it/tho65crvkng51.png?width=1242&amp;format=png&amp;auto=webp&amp;s=6241ff5e8b26744f9d7119ddef7da86f163c741d\n\nI'm not just holding, I added.\n\nPRPLW Warrants:  391,280\n\nPRPL Call Debit Spreads:   17.5c/25c 8/21 x90, 20c/25c 8/21 x247\n\nAlso, I bought some CSPR 7.5p 8/21 x200 for fun because I think that sucker is going to get shamed back down to $6 after a real mattress company shows what it can do.",
        "subreddit": "wallstreetbets",
        "title": "PRPL Q2 2020 Earnings Expectations",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i8olie/prpl_q2_2020_earnings_expectations/",
        "created": 1597303003.0
    },
    {
        "author": "iwearagreenbackpack",
        "created_utc": 1597158767,
        "id": "i7ti9p",
        "num_comments": 569,
        "num_crossposts": 0,
        "selftext": "To start, you are going to look at this and think... why in the HELL would i buy a $CORN futures ETF? \n\nHERE IS EXACTLY WHY AND I'LL EXPLAIN  \nCorn Yield has been at historic lows for the last 3 years, hence the massive decline in value for this ETF. This ETF tracks the 2nd and 3rd highest Future Contracts, followed by an end of year December Contract. \n\n**Why the hell would you care about this?** \n\nBecause Tomorrow is the $CORN Yield Crop Report... This report is about to absolutely KICK ASS showing that the corn yield from this year is beyond incredible. Now you're probably wondering why the hell this CORNBALL is rambling about corn. Lets dive into some interesting things that are happening with Corn... in real time. First looking at the open interest.\n\n**Corn for August**   \n15k volume, 99% of it on Corn. This is coming with 10k of that volume RIPPING into the market today. This is more times than not a HUGE indication that someone, somewhere knows something that us PEASANTS do not know. So we are going to trust the Mayans and follow this belief.   \n\n\nHELL TAKE A LOOK AT THIS OPEN INTEREST BOARD FOR FRIGGIN CORN! \n\n&amp;#x200B;\n\n[LOOK AT THIS CORN REPORT ](https://preview.redd.it/fqxehq0v1eg51.jpg?width=540&amp;format=pjpg&amp;auto=webp&amp;s=b47079245c8fd026d613e1f1bb043c9c661ba2e3)\n\nWhat is the wildest piece about this, it how much Volume is on the short term in comparison to any other expire date. Now if you don't think this isn't someone, somewhere whose about to get PAID you are smoking better corn than me! \n\nBut lets also look at some strikes here within our lovely friend RobinHood.   \n\n\n  \n\n\n[now this is REALLY wild. So, you're only gonna lose about 1.5 cents for the theta decay, but per dollar we're looking at a LOVELY $35 dollar move. ](https://preview.redd.it/cra4cph52eg51.png?width=653&amp;format=png&amp;auto=webp&amp;s=73d41e80bbef622eaf6f8e2530a949e84ae38959)\n\nLOOK AT THE VOLUME ON THIS CALL! That is ludicrous. Couple it with the IV and you got a match made in heaven. Now, I am about to bring your eyes to some TA and I know TA is dumb and fake thats exactly why I saved it for the end, cause if you're still reading, you're already sold on $CORN. \n\nAs you should be.   \nCorn. \n\n&amp;#x200B;\n\n[This Chart May Look Scary ](https://preview.redd.it/4mtn1rx93eg51.png?width=671&amp;format=png&amp;auto=webp&amp;s=13d82b54e614ba103141008ffb854c42fd6e3728)\n\nBUT, all indicators are showing some BEAUTIFUL things. Look at that RSI, oversold. and its PRIMEDDD for a retrace back up to that 12c look what happened last time there was a 2 standard deviation from the 50ma!? it ripped back to it and through it. \n\nI believe tomorrows report will be phenomenal for $CORN, and if you miss the boat, that's on you. \n\nThank you for coming to my corn talk.",
        "subreddit": "wallstreetbets",
        "title": "So... $CORN is the way.... Trust the Mayans &amp; buy $CORN",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i7ti9p/so_corn_is_the_way_trust_the_mayans_buy_corn/",
        "created": 1597187567.0
    },
    {
        "author": "pikindaguy",
        "created_utc": 1597243901,
        "id": "i8f42o",
        "num_comments": 558,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2020/08/12/uber-may-shut-down-temporarily-in-california.html\n\n- Uber would likely shut down temporarily for several months if a court does not overturn a recent ruling requiring it to classify its drivers as full-time employees, CEO Dara Khosrowshahi said in an interview with Stephanie Ruhle Wednesday on MSNBC.\n\n- Uber and rival Lyft both have about a week left to appeal a preliminary injunction granted by a California judge on Monday that will prohibit the companies from classifying their drivers as independent workers.\n- If the appeal doesn’t work out for Uber, it will bank on voters to determine its fate in voting on on Proposition 22, which would exempt drivers for app-based transportation and delivery companies from being considered employees.",
        "subreddit": "investing",
        "title": "Uber CEO says its service will probably shut down temporarily in California if it’s forced to classify drivers as employees",
        "url": "https://www.reddit.com/r/investing/comments/i8f42o/uber_ceo_says_its_service_will_probably_shut_down/",
        "created": 1597272701.0
    },
    {
        "author": "SteezyPorsche",
        "created_utc": 1597598745,
        "id": "iawdzm",
        "num_comments": 544,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Look at all this fucking $CORN it only grows up",
        "url": "https://v.redd.it/1y7v8xtcfeh51",
        "created": 1597627545.0
    },
    {
        "author": "Big-Weed",
        "created_utc": 1597725985,
        "id": "ibujf9",
        "num_comments": 540,
        "num_crossposts": 0,
        "selftext": "So my gpa got the cancers and it’s honestly been a bit sad the last few days but now the real question comes and that is “what’s next?” Well, he was quite the autistic retard and decided to dump my old college fund all into Apple way back in ‘03 because I enlisted instead. It’s now grown harder than a dick on prom night and I’m looking for a way to buy a new wife that doesn’t already have a boyfriend so what I need to know is should I move it around or keep it rolling all in AAPL like a retarded autist?",
        "subreddit": "wallstreetbets",
        "title": "Grandpa died and left me with 7000 shares of AAPL diversify or let it roll?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ibujf9/grandpa_died_and_left_me_with_7000_shares_of_aapl/",
        "created": 1597754785.0
    },
    {
        "author": "dweeegs",
        "created_utc": 1598161412,
        "id": "iexyez",
        "num_comments": 524,
        "num_crossposts": 0,
        "selftext": "Hello there\n\nI posted about [6 weeks ago](https://www.reddit.com/r/stocks/comments/hn9ydm/defense_stocks_what_the_heck_is_going_on/) about defense being undervalued and they’ve climbed 15-20% since then (besides HII which completely whiffed earnings) and I am now starting to see value in the oil sector(s). The June high and subsequent re-crash for oil industry coincided directly with the new covid case rate picking up. With covid cases declining and oil stocks generally trading in ranges for over a month now, I present my case for a break in those ranges\n\nThere are a couple of tailwinds that are happening right now for WTI:\n\n* New covid cases in the US have dropped substantially from their peak and are on a downtrend [according to JHU’s data](https://i.imgur.com/EShb2sU.jpg). Globally, it seems to be seesawing in a confined range\n* [China is buying a large amount of US crude by September])https://www.reuters.com/article/us-usa-trade-china-oil-exclusive/exclusive-china-ramps-up-u-s-oil-purchases-ahead-of-trade-deal-review-sources-idUSKCN25A2F4), potentially 37 million barrels [according to this](https://oilprice.com/Latest-Energy-News/World-News/China-Charters-Tankers-For-37-Million-Barrels-Of-US-Oil.html)\n* After flooding the US market with [Saudi oil](https://www.npr.org/2020/05/04/850026351/saudi-arabias-oil-tanker-flotilla-is-reaching-the-u-s-despite-some-objections#:~:text=Live%20Sessions-,Saudi%20Arabia's%20Oil%20Tanker%20Flotilla%20Is%20Reaching%20The%20U.S.%2C%20Despite,are%20headed%20to%20the%20U.S.), they have now cut exports to a [record low ](https://oilprice.com/Latest-Energy-News/World-News/Saudi-Arabias-Crude-Oil-Exports-Dip-To-Record-Low-In-June.html)\n* The dual storms in the Gulf have caused a lot of [shut-ins](https://www.reuters.com/article/us-usa-storms-energy/oil-firms-evacuate-staff-curb-offshore-production-ahead-of-twin-storms-idUSKBN25I0J3)\n* After stalling in July, air traffic is starting to [pick back up](https://www.tsa.gov/coronavirus/passenger-throughput) and routes are being added again, although still way way down\nWhich all support WTI prices in the coming weeks. Should be noted that rig counts have continued to lows, however last week was the first week in a long time that a few rigs came back online, which will add to the inventory. How much, I am not sure. You can see from [Baker Hughes’ rig count]( https://rigcount.bakerhughes.com/rig-count-overview) that we added 10 rigs, but are still down a net of 662 rigs from last year. Next we can take a look at the [EIA data](https://www.eia.gov/petroleum/supply/weekly/) for some more insight into what current inventories are like:\n\n* 512M barrels of crude, 15% above average. Peak was 540M barrels on June 19th\n* 244M barrels of gasoline, 7% above average. Peak was before covid due to build over the winter\n* 178M barrels of distillates, 24% above average. Peak was 180M barrels on July 31st\n* Refinery inputs at 14.5M barrels, low was 12.4M barrels on May 13th \n* Refinery rates at 81%. At the low on April 22nd it was at 67%, normally around 95%.\n* WTI is trading in the $42-43 range, with the low being negative due to the contract rollover situation back in the Spring\n\nThe last several EIA reports have been good in general – drawing down of products, with two weeks in a row of fantastic gasoline draw down. \n\nWhat’s my point here? The takeaway should be this: the worst is over. Now is the best chance for a while to get beaten up value stocks at a discount, as the industry recovers and conditions for the crash are resolving\n\nRight now cyclicals have been beaten down to Earth’s core as tech goes up and up. Cyclicals and value generally outperform in a market recovery and I expect a rotation at some point, strengthened by a combination of inventory drops making headlines, covid cases going down, and a general resumption of normal. Any stimulus would be big news for these beaten down stocks as well\n\nWorried about a Democratic administration? Unlike the defense stocks I had previously looked at, I think it’s a real issue for this industry. The Democratic platform calls out removing tax breaks for oil and gas companies while adding environmental regulations. It’s weird that big tech has been climbing – companies like Amazon, Apple, Facebook etc. that are known tax avoiders and privacy usurpers seem like prime candidates to have a ‘tax bill fear’ from the Dem’s closing of tax avoidance legislation and future lawsuits. I haven’t seen any hints of this in the market, so I am going to assume this is not considered a big deal by investors\n\nHowever, I still believe these low valuations are still too low, even with headwinds. Some of the majors have already been adjusting (Shell in particular) and refineries like Valero already have strong renewable fuels segments; Phillips 66 recently announced plans to build the [biggest renewable diesel refinery in the world](https://investor.phillips66.com/financial-information/news-releases/news-release-details/2020/Phillips-66-Plans-to-Transform-San-Francisco-Refinery-into-Worlds-Largest-Renewable-Fuels-Plant/default.aspx)\n\nWhat am I looking at in particular?\n\nRight now, refineries have the best value to me. PSX is **criminally** undervalued with a safe dividend. VLO is another that is set for strong performance. MPC has a strong position after its Speedway asset sale, but I would rank PSX&gt;VLO&gt;MPC at this point for value.\n\n* PSX target price: ~$82, sitting currently at ~$61\n* VLO target price: ~71-72, sitting currently at ~$52.50\n\nFrom a producer standpoint, CVX and COP are both fundamentally solid (I prefer COP at this point). RDS is the closest its been to it’s covid low and is one of the leading majors in transitioning off oil. It’s been beaten down since losing its dividend but I can only assume it will be back. I’m not a fan of XOM going forward, but right now it’s at the low of the range it’s been confined in and wouldn’t be a bad temporary pickup. FANG / EOG / PXD aren’t bad pickups either\n\nPS – stay away from OXY. It’s very clear they’re going to continue to issue shares until they’re through their debt and the pummeling is well deserved. It was popular for a while, not sure how it’s still viewed, just stay away\n\nTLDR; buy refineries and the producers worth buying that aren't drowning in debt or have terrible assets\n\nDisclosure: I have a large position in PSX calls",
        "subreddit": "stocks",
        "title": "Oil stocks - the time is now",
        "url": "https://www.reddit.com/r/stocks/comments/iexyez/oil_stocks_the_time_is_now/",
        "created": 1598190212.0
    },
    {
        "author": "synester302",
        "created_utc": 1598302441,
        "id": "ifxmdf",
        "num_comments": 519,
        "num_crossposts": 0,
        "selftext": "\"Simply, it means that the Fed, which has pegged 2% as a healthy level, will let inflation run higher than that for a while if it has spent a considerable time beneath that level. The Fed's preferred inflation gauge has stayed below that level for all but two years since the Great Recession ended in mid-2009.\"",
        "subreddit": "investing",
        "title": "Powell set to deliver ‘profoundly consequential’ speech, changing how the Fed views inflation",
        "url": "https://www.reddit.com/r/investing/comments/ifxmdf/powell_set_to_deliver_profoundly_consequential/",
        "created": 1598331241.0
    },
    {
        "author": "awaythrow10694",
        "created_utc": 1598250534,
        "id": "ifju39",
        "num_comments": 515,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Robinhood really keeping it simple for us retards",
        "url": "https://i.redd.it/l5u60jtv9wi51.jpg",
        "created": 1598279334.0
    },
    {
        "author": "UlineGum",
        "created_utc": 1596726862,
        "id": "i4tlcm",
        "num_comments": 457,
        "num_crossposts": 0,
        "selftext": "We are all just trying to make some money. Build a better future for ourselves and our families. \n\nHOW CAN YOU KNOCK THAT?\n\nIts what they say during interviews. What they write. \n\nRH broke down the barrier of entry and the old money doesn’t like that. When I was looking at trading back then would have been optionstrader.com it was so daunting. Even ToS could chill a little bit now I love the abundant info. Still love RH\n\nBad trader is a bad trader but if they wanted to gamble they could goto the Casino. \nThe saying the people who do sports betting or gamble are now on the market because of COVID is BS. \n\nKeep learning, keep investing!",
        "subreddit": "wallstreetbets",
        "title": "Why do CNBC/Bloomberg shit on the retail/RH investor? People just trying to build a better future.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i4tlcm/why_do_cnbcbloomberg_shit_on_the_retailrh/",
        "created": 1596755662.0
    },
    {
        "author": "StarxGabby",
        "created_utc": 1597950722,
        "id": "idgpr6",
        "num_comments": 449,
        "num_crossposts": 0,
        "selftext": "I just can't take it anymore. Every single day I think how I missed my chances at becoming a millionaire before 30. I had so many opportunities and I fucked them all up.\n\nSure I made money along the way but nowhere in the ballpark of what I would have made if I had just held. \n\nHow do you live with that?",
        "subreddit": "StockMarket",
        "title": "It hurts so much selling tesla at 900. It hurts so much losing my hard drive with a hundred BTC 7 years ago. It hurts so much not buying stocks in April.",
        "url": "https://www.reddit.com/r/StockMarket/comments/idgpr6/it_hurts_so_much_selling_tesla_at_900_it_hurts_so/",
        "created": 1597979522.0
    },
    {
        "author": "jetter23",
        "created_utc": 1596986290,
        "id": "i6l0o2",
        "num_comments": 441,
        "num_crossposts": 0,
        "selftext": "Hey gang, just wanted to provide a quick update on whats happening in Silver.\n\n\\*\\*\\*\\*\\*\\*\\*\\*DD ALERT\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\n My Positions:\n\nSLV 9/18 24.5C - 79\n\nSLV 9/30 26C - 30\n\nSLV 12/31 27C - 25\n\n&amp;#x200B;\n\n\\*\\*\\*Required Prerequisite Reading\\*\\*\\* [https://www.reddit.com/r/wallstreetbets/comments/i5m4ri/real\\_talk\\_slv/g0qcer1?utm\\_source=share&amp;utm\\_medium=web2x](https://www.reddit.com/r/wallstreetbets/comments/i5m4ri/real_talk_slv/g0qcer1?utm_source=share&amp;utm_medium=web2x)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nHappy Sunday ladies, get ready for Futures Open in 7hrs.\n\n&amp;#x200B;\n\n1) Trump turned the Money printer on yesterday, again.  $400/wk (states have to pickup 25% of it) - You don't have to pay rent/mortgage, electricity bills, or student loans through EOY.  Also, he enacted a payroll tax cut that will be come a grant IF he becomes re-elected. So inflation will continue to rise, oh and the Fed is capping interest rates on bonds. \n\n&amp;#x200B;\n\n2) Metals compete DIRECTLY with REAL (inflation adjusted) interest rates. As a foundational bedrock investment of  Pensions, Mutual Funds, and general portfolios - people have traditionally held long term bonds.  Metals are a 0% thing, you can't eat them and they are basically a pet rock - but they are stable at 0% forever, as metals were the ORIGINAL money.  If you take the current bond rate, and subtract the inflation rate, you get -1.1%.  This is causing MASSIVE moves in the market as people leave bonds and crowd into metals, as 0% beats the hell out of negative REAL rates.  Currently Gold is at 2100, if we go to -2% REAL rates, Gold will be 2500. \n\n&amp;#x200B;\n\n3) Learn about Rehypothecation here ([https://www.investopedia.com/terms/r/rehypothecation.asp#:\\~:text=Rehypothecation%20is%20a%20practice%20whereby,or%20a%20rebate%20on%20fees.](https://www.investopedia.com/terms/r/rehypothecation.asp#:~:text=Rehypothecation%20is%20a%20practice%20whereby,or%20a%20rebate%20on%20fees.)).  For obvious reasons, this is why housing blew up in 2008.  The exact same thing is happening in Silver, but inversely.  Silver has been abused for so long, but it REALLY started in 2011. The \"classic\" (meaning the mined ratio, or the ratio at which they pull this shit out of the ground) is around 16:1.  In 2005, the ratio was 60:1.  On Friday's close, the Silver/Gold ratio was 79:1.  Silver has a LONG way to catch-up.  At CURRENT levels, Silver SHOULD be (assuming a 60:1 ratio) \\~ 35ish.  So when you look at the fact that Silver has been abused for so long that its undervalued, coupled with the Massive run on metals due to negative REAL rates, Silver has massive upside. The amount of fund inflows into Silver ETF's is another leg up on silver as well - they eventually are going to have to officially re-value silver to reflect fund inflows and sentiment.  Who knows what the new Silver/Gold ratio could end up as...but I'm betting its a LOT lower than 60:1. \n\n&amp;#x200B;\n\n4a) Banks will continue to fight us on silver, but they are losing as they were massively short, and the world blew up in their face.  HSBC lost $200M in a single day, and closed their industrial metals business around 6 weeks ago ( [https://www.kitco.com/news/2020-07-03/HSBC-closes-its-industrial-metals-business.html](https://www.kitco.com/news/2020-07-03/HSBC-closes-its-industrial-metals-business.html) ).  Soctiabank also closed down its metals trading desk around 4 months ago ( [https://www.reuters.com/article/us-metals-bank-of-nova-scotia-exclusive/exclusive-scotiabank-to-close-its-metals-business-sources-idUSKCN22A2ZC#:\\~:text=%E2%80%9CScotia%20had%20a%20global%20call,said%20one%20of%20the%20sources.&amp;text=A%20spokeswoman%20for%20Scotiabank%20declined,around%20the%20beginning%20of%202021.](https://www.reuters.com/article/us-metals-bank-of-nova-scotia-exclusive/exclusive-scotiabank-to-close-its-metals-business-sources-idUSKCN22A2ZC#:~:text=%E2%80%9CScotia%20had%20a%20global%20call,said%20one%20of%20the%20sources.&amp;text=A%20spokeswoman%20for%20Scotiabank%20declined,around%20the%20beginning%20of%202021.) )  This means the ONLY one left is JPM, and they are still trying to fight us, but are losing and continuing to wind down shorts. \n\n&amp;#x200B;\n\n4b) The $1.5 drop we saw Thursday night was exactly this - banks reloading shorts to try and fight us, but there is a big difference. An ALL TIME RECORD amount of shorts were opened on the Comex on Thursday, around 350k contracts....a RECORD amount...and all it did was $1.50 in damage....so that should tell you where sentiment and price action is.  [https://www.youtube.com/watch?v=VLHLEAbZUA8&amp;t=1s](https://www.youtube.com/watch?v=VLHLEAbZUA8&amp;t=1s) \n\n&amp;#x200B;\n\n5) Silver is about to go hyperbolic and nothing is in it's way.  The fed is printing money (driving inflation), people are already crowding metals, banks are unwinding their short positions (or closing their metals trading desk all together), and there are HISTORIC inflows into Silver - which will eventually cause a revaluation to the upside.  I'm an EE and I love Technical Analysis, but this is 100% fundamental driven. \n\nA retired energy trader once told me \"Fundamentals will tell you why something is happening, TA will tell you when\".  TA is broken on metals right now and all its doing is making algos and morons try to load shorts.  Multinational global banks are literally leaving the idea of shorting metals, so maybe follow suit?  These are some of the smartest people on earth and I hate bankers, but they aren't dumb.\n\n&amp;#x200B;\n\nHave a great week.",
        "subreddit": "wallstreetbets",
        "title": "Weekend Update - Silver",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i6l0o2/weekend_update_silver/",
        "created": 1597015090.0
    },
    {
        "author": "RobotRedfish",
        "created_utc": 1597164764,
        "id": "i7vbgy",
        "num_comments": 435,
        "num_crossposts": 0,
        "selftext": "**Disclaimer:** I did not invent this indicator or find this correlation. All credit goes to a very intelligent trader on Twitter named Kerberos007 who might be borderline obsessed with finding data-based crash indicators.\n\n**The Indicator:** Let me be clear. I am by no means a great trader. But I found this guy’s crash thesis and checked it against every SPY crash in recent history that I could. It's deadly accurate. I feel like a chimpanzee trying to explain the concept of why fire burns but if it saves some of you guys from not being able to afford the bubble wrap and capri-suns you love, maybe it’s worth it. If you graph the correlation between the daily value of the SPX and GLD, you will see an interesting pattern emerge. In the period before a market crash, they will begin to have a higher correlation. At some point that correlation will become so positive that it crosses the threshold of 0.6. From what I can see, how long it stays above 0.6 doesn’t really matter. The most important part is that when the correlation starts to break down and returns to 0.6 on the way down, all hell breaks loose within 1-3 days. When it triggers, it doesn’t always mean Armageddon type SPY damage but it will be a significant pullback. For example, you can see that it was triggered on 6/5 which was just a couple days before our last significant pullback.\n\n**Where is it Now:** As of today 8/11/20 the correlation is at .64 and dropping like a rock. I’m not telling you guys to go all in on puts because putting all your faith in one indicator doesn’t make sense. I’m just saying that when that .60 threshold is crossed just make sure you are hedged effectively for at least the next 3 trading days. Maybe just a little more bearish than usual just in case things get froggy.\n\n**TLDR:** Be prepared for a big red day once the correlation between GLD and SPX decreases to 0.60. Good luck my brothers. \n\nhttps://preview.redd.it/icji9e4gkeg51.png?width=854&amp;format=png&amp;auto=webp&amp;s=b07cca589a5dd117dbd15a3f8b99c3b4ca286866\n\nP.S. If someone has a great ticker to buy (very) cheap puts on when shit hits the fan, let me know.",
        "subreddit": "wallstreetbets",
        "title": "A Secret Market Crash Indicator is Firing Red",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i7vbgy/a_secret_market_crash_indicator_is_firing_red/",
        "created": 1597193564.0
    },
    {
        "author": "Afshari",
        "created_utc": 1597151579,
        "id": "i7rkie",
        "num_comments": 417,
        "num_crossposts": 0,
        "selftext": "Pre market looks bad... horrific bad... where is my SLV gang.. let’s huddle up and cuddle and pray.. pray for it to go up.. What is your view.. will go up or down from this point...",
        "subreddit": "wallstreetbets",
        "title": "Where is my SLV gang..",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i7rkie/where_is_my_slv_gang/",
        "created": 1597180379.0
    },
    {
        "author": "jerschneid",
        "created_utc": 1598000807,
        "id": "idtcwf",
        "num_comments": 416,
        "num_crossposts": 0,
        "selftext": "Since we just crossed back into record high S&amp;P 500 territory, I thought I would download the S&amp;P 500 historical data going back over 100 years to compare the major market crashes. It turns out the Covid-crash had the fastest recovery of any 25%+ market drop, lasting only about 6 months. The second fastest was after the 1987 Black Monday crash, where the market dropped about 30% and the recovery took about two years. By comparison, during the Great Depression the market dropped about 86% and took 25 years to recover.\n\nHere's a look at the data charted: \n\nhttps://i.imgur.com/k2CMF9E.png\n\n* **Source:** I downloaded weekly S&amp;P 500 data for the last 100 years from [Yahoo Finance](https://finance.yahoo.com/quote/%5EGSPC/history/)\n* **Tools:** Imported into [this google sheet](https://docs.google.com/spreadsheets/d/1vhwHO3M8OxiiqVj-NctucbyzAnIePqyRUEuiBOTJa4U/edit?usp=sharing), charted, then screenshotted and pasted into Photoshop for final annotation",
        "subreddit": "investing",
        "title": "Comparing major S&amp;P 500 crashes of the last 100 years",
        "url": "https://www.reddit.com/r/investing/comments/idtcwf/comparing_major_sp_500_crashes_of_the_last_100/",
        "created": 1598029607.0
    },
    {
        "author": "ghostofgbt",
        "created_utc": 1597181850,
        "id": "i80pce",
        "num_comments": 414,
        "num_crossposts": 0,
        "selftext": "Ok, to prevent 50 posts about this (there were already five here within 15 min), let's use this thread to discuss the TSLA stock split. Answer common questions as there will be a lot, upvote quality answers and downvote and report misinformation. There are gonna be a lot of people wondering how this affects them so let's try to be friendly and remember that in the end we all seek the same thing: thy holy tendies!\n\n&gt; Shares of Tesla Inc. TSLA surged more than 7% in the extended session Tuesday after the Silicon Valley car maker said its board has approved a five-for-one split of the company's common stock \"in the form of a stock dividend to make stock ownership more accessible to employees and investors.\" Each shareholder of record on Aug. 21 will receive a dividend of four additional shares of common stock for each then-held share, to be distributed after the close on Aug. 28, the company said. Trading will begin on a stock split-adjusted basis on Aug. 31, Tesla said. The stock has gained 229% this year, compared with gains around 3% for the S&amp;P 500 index.\n\nwww.marketwatch.com/story/tesla-stock-soars-7-on-5-to-1-stock-split-news-2020-08-11",
        "subreddit": "StockMarket",
        "title": "Tesla jumps on the bandwagon, announces 5 for 1 split. Let's use this thread to discuss it!",
        "url": "https://www.reddit.com/r/StockMarket/comments/i80pce/tesla_jumps_on_the_bandwagon_announces_5_for_1/",
        "created": 1597210650.0
    },
    {
        "author": "cthen1",
        "created_utc": 1596370579,
        "id": "i2b4a4",
        "num_comments": 407,
        "num_crossposts": 0,
        "selftext": "  \n\nAt what point do you think it is time to engage a financial consultant/asset manager/advisor?\n\nSome say never, but many rich and not so rich are using them. Is it just for asset protection and less administrative works? \n\nIs it when one’s investable assets reaches $100K, 500K, 1m, 5m, 10m, 100m? Or only when you are too old to manage them yourself?\n\nAsset managers/financial planners typically charge around 1-1.5% or more, in return for building you a portfolio (conservative/moderate/aggressive), which most experienced investors know anyway, more or less . It is said active managers in the past have had a poor record beating the passive funds. The returns on average would be around 6-8%/year, which is no better than passive investing in S&amp;P/IT/Global etf. So, what do people engage financial consultants?\n\nWould appreciate hearing your thoughts. Thank you.",
        "subreddit": "investing",
        "title": "At what point do you think it is time to engage a financial consultant/asset manager/advisor?",
        "url": "https://www.reddit.com/r/investing/comments/i2b4a4/at_what_point_do_you_think_it_is_time_to_engage_a/",
        "created": 1596399379.0
    },
    {
        "author": "u87hi",
        "created_utc": 1597094864,
        "id": "i7e245",
        "num_comments": 406,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2020/08/10/judge-grants-preliminary-injunction-requiring-uber-and-lyft-to-stop-classifying-drivers-as-contractors.html\n\n&gt; A California judge granted a preliminary injunction Monday requiring Uber and Lyft to stop classifying their drivers as independent contractors pending further action by the court. The order will take effect after 10 days, as the companies requested a brief stay during the appeals process.\n&gt; \n&gt; If upheld, the ruling could have serious implications for Uber and Lyft, both of which are not yet profitable and have seen their ride-hailing businesses suffer during the pandemic. By classifying their drivers as independent workers, rather than employees, the companies have not had to pay for costly benefits that come with a full-time staff. \n&gt; \n&gt; California Attorney General Xavier Becerra requested the injunction as part of a lawsuit he brought in May along with city attorneys from San Francisco, Los Angeles and San Diego. The suit, filed in San Francisco Superior Court, alleged Uber and Lyft violated the state’s new law known as Assembly Bill 5 (AB5), which was created as a way to classify gig workers as full employees and ensure benefits from their employers. Uber and Lyft were among a group of tech companies that have previously opposed the bill, arguing their workers enjoy the flexibility of creating their own schedules as contractors. \n&gt; \n&gt; California officials sought an injunction on the alleged misclassification and restitution for workers and civil penalties worth up to hundreds of millions of dollars.\n&gt; \n&gt; Shares of Uber were down 0.8% during extended trading Monday and Lyft shares were down 1.7%.\n&gt; \n&gt; Both companies said they would appeal the ruling immediately.\n&gt; \n&gt; “The vast majority of drivers want to work independently, and we’ve already made significant changes to our app to ensure that remains the case under California law,” an Uber spokesperson said. “When over 3 million Californians are without a job, our elected leaders should be focused on creating work, not trying to shut down an entire industry during an economic depression.”\n&gt; \n&gt; “Drivers do not want to be employees, full stop,” Lyft said in a statement. “We’ll immediately appeal this ruling and continue to fight for their independence. Ultimately, we believe this issue will be decided by California voters and that they will side with drivers.” \n&gt; \n&gt; “The court has weighed in and agreed: Uber and Lyft need to put a stop to unlawful misclassification of their drivers while our litigation continues,” Becerra said in a statement. “While this fight still has a long way to go, we’re pushing ahead to make sure the people of California get the workplace protections they deserve. Our state and workers shouldn’t have to foot the bill when big businesses try to skip out on their responsibilities. We’re going to keep working to make sure Uber and Lyft play by the rules.”\n&gt; \n&gt; Uber CEO Dara Khosrowshahi advocated for a “third way” to classify workers in a letter to President Donald Trump in March as the first round of coronavirus relief measures were being negotiated. He argued there should be a way for workers to gain protections without sacrificing the flexibility of contract work.\n&gt; \n&gt; In the ruling, Judge Ethan Schulman recognized the value of flexibility offered by Uber and Lyft, writing, “The Court does not take lightly Defendants’ showing that a preliminary injunction may also have an adverse effect on some of their drivers, many of whom desire the flexibility to continue working as they have in the past, and may have commitments that make it difficult if not impossible for them to become full-time employees.”\n&gt; \n&gt; But Schulman wrote that Uber and Lyft’s concerns that the injunction would have “far-reaching effects” had “only been exacerbated by Defendants’ prolonged and brazen refusal to comply with California law. Defendants may not evade legislative mandates merely because their businesses are so large that they affect the lives of many thousands of people.”\n&gt; \n&gt; Schulman wrote that any impact of the injunction on Uber and Lyft’s businesses would likely be mitigated by the fact that both have said the “vast majority of their drivers work on a casual or sporadic basis” and the reality that the coronavirus pandemic has “drastically reduced the demand for Defendants’ services.”\n&gt; \n&gt; “Now, when Defendants’ ridership is at an all-time low, may be the best time (or the least worst time) for Defendants to change their business practices to conform to California law without causing widespread adverse effects on their drivers,” Schulman wrote.\n&gt; \n&gt; Uber and Lyft sought to delay the ruling until there was a ruling on Uber’s constitutional challenge of AB5 or until voters weighed in on a ballot measure they sponsored to exempt them from the law. The Court dismissed those requests.\n&gt; \n&gt; Schulman said Uber’s arguments that drivers’ work was outside the ordinary course of its business, as the standard requires, was “a classic example of circular reasoning.” He summarized the argument as saying that since Uber views itself as a tech company, only its tech workers are its employees.\n&gt; \n&gt; “Were this reasoning to be accepted, the rapidly expanding majority of industries that rely heavily on technology could with impunity deprive legions of workers of the basic protections afforded to employees by state labor and employment laws,” the judge wrote.\n&gt; \n&gt; The ruling does not end the legal battles for Uber and Lyft, however. Last week, California’s Labor Commissioner announced lawsuits against the companies alleging wage theft due to misclassification. The commission seeks to recover wages it believes were owed to drivers currently classified as contractors. The suits were filed in Alameda County Superior Court.",
        "subreddit": "investing",
        "title": "[Breaking news] California judge granted a preliminary injunction Monday requiring Uber/Lyft to stop classifying drivers as independent contractors. Serious implications for Uber/Lyft, both are not yet profitable, are now required to pay for costly benefits that come with a full-time staff.",
        "url": "https://www.reddit.com/r/investing/comments/i7e245/breaking_news_california_judge_granted_a/",
        "created": 1597123664.0
    },
    {
        "author": "ChocolateTsar",
        "created_utc": 1596895330,
        "id": "i5zmeu",
        "num_comments": 399,
        "num_crossposts": 0,
        "selftext": "&gt;The company said it repurchased $5.1 billion worth in stock in May and June. Berkshire repurchased more than $4.6 billion of its Class B stock and about $486.6 million in Class A shares.\n\n&gt;The share repurchase is the most ever in a single period for Buffett, nearly double the $2.2 billion the conglomerate bought back in the final quarter of 2019. In fact, the amount is slightly more than what Buffett spent buying back Berkshire stock in all of 2019. Despite the company’s record buybacks last quarter, the Berkshire’s cash hoard grew to more than $140 billion.\n\n&gt;Operating profits for Berkshire fell 10% during the second quarter, dropping to $5.51 billion from $6.14 billion in the year-earlier period. The company also took a charge of approximately $10 billion from Precision Castparts, Berkshire’s largest business within its manufacturing segment.\n\n&gt;Berkshire’s investments in public markets gained $34.5 billion in the quarter. That gain caused overall second-quarter net earnings to surge to $26.3 billion, up from $14.1 billion a year ago. However, unrealized gains from investments quarter to quarter are volatile and Buffett himself warns investors not to focus on that overall net earnings figure.\n\n[Full article on CNBC](https://www.cnbc.com/2020/08/08/berkshire-hathaway-earnings-q2-2020.html)",
        "subreddit": "investing",
        "title": "Buffett buys back record $5.1 billion in Berkshire stock as coronavirus hits operating earnings",
        "url": "https://www.reddit.com/r/investing/comments/i5zmeu/buffett_buys_back_record_51_billion_in_berkshire/",
        "created": 1596924130.0
    },
    {
        "author": "vprokopev",
        "created_utc": 1598180491,
        "id": "if1bb3",
        "num_comments": 394,
        "num_crossposts": 0,
        "selftext": "My mom just got into stocks. She always starts investing at the top of the bubble, she is a perfect indicator:\n\n1. She bought fucking MMM in the 90s, the fucking pyramid scheme at the very top.\n2. She got in real estate right at the end of the real estate boom in Russia.\n3. She bought some Bitcoif in jan 2018. A swear this is true, I was quite impressed, because she can barely understand how to use email.\n4. Now she got a brokerage account. She was super skeptical about stocks all her life (it is normal for someone who liver in USSR/Russia all their life). And here we are, she is asking me what US stocks should she buy. Out of the blue. WE ARE GOING DOWN!",
        "subreddit": "wallstreetbets",
        "title": "The 100% accurate top indicator have just been triggered! WE ARE GOING DOWN!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/if1bb3/the_100_accurate_top_indicator_have_just_been/",
        "created": 1598209291.0
    },
    {
        "author": "Isthiswittyenough92",
        "created_utc": 1597247197,
        "id": "i8g3bq",
        "num_comments": 394,
        "num_crossposts": 0,
        "selftext": "All you autists worried about RKT and will end up paper handing any dips need to wake up. RKT is one of the best deals on the market right now. Here's why:\n\n**RKT will undoubtedly eventually be valued as a Fintech Company.**\n\nWhy? Because it has all the core components of a fintech company. RKT at it's core is a consumer-facing, tech-based mortgage origination platform and it's productivity, Revenue per Employee, and margins are **in line if not better than fintech players**. Let's take a look:\n\n* RKT's Q1 2020 EBITDA Margin was a **blistering 44%!** Compare that other FinTechs latest EBITDA margins \n   * SHOP at negative 1.9%\n   * GWRE at 6%\n   * LMND at negative 73%!\n   * PYPL at 19%\n* RKT has an **Revenue per Employee (as of 3/31/20) figure of $300k**! Again, compare to other Fintechs, RKT is nearly the exact Median\n   * SHOP at $416k / employee\n   * GWRE at $276k / employee\n   * LMND at $251k / employee\n   * PYPL at $828k / employee\n* Now, let's look at the valuation for the other Fintechs. **RKT is very obviously undervalued compared to the segment**\n   * Enterprise Value / Revenue\n      * SHOP - 54.3x LTM Revenue\n      * GWRE - 11.7x LTM Revenue\n      * LMND - 44.3x LTM Revenue\n      * PYPL - 11.4x LTM Revenue\n      * **RKT - 2.2x LTM Revenue**\n   * P/E\n      * SHOP - N/A, negative EPS\n      * GWRE - 333x P/E\n      * LMND - N/A,negative EPS\n      * PYPL - 87x P/E\n      * **RKT - 7.7x P/E**\n\n**But, but, what about the mortgage volume? Isn't RKT exposed to interest rates and mortgage volume?**\n\nPlain and simple, there is no force that is going to stop volume right now. We can all say that fundamentals don't matter and for stock market pricing they may not. But in terms of interest rate action by the Fed, they very much do matter, and it is clear the Fed does not intend to raise rate until fundamentals truly stabilize. And if rates do come up, it will mean even J.Pow &amp; Co think inflation is getting too hot. Fuck SLV gang, **Real Estate is the ultimate anti-inflation safe-haven.** So volume should remain largely unaffected as investors seek inflation protection.\n\n**RKT continues to gain market share in an expanding market**\n\nLet's face it, eventually boomers will not be applying for new mortgages and millennials are not going to walk into Chase with a $100 fountain pen to apply for a mortgage. One of the biggest themes of the housing market today is increasing rate of home ownership among millenials. RKT's completely digitized offering positions them to capitalize on market trends. The numbers prove this as RKT's share of the total mortgage market has increased from 1.3% in 2009 to &gt;9% in the first quarter of 2020, making RKT the **largest mortgage originator in the US.**\n\n**RKT's technology drives faster, better outcomes for end consumer**\n\nRKT's application process can be understood as \"parallel\" vs. the traditional mortgage industry's \"linear\" process. This results in faster approvals and faster closing times. RKT closes loans 25% faster than the industry average - 29 days on average vs. the industry average of 40 days. Not only is this good for the end consumer (instant-gratification millennials), it means RKT's workforce is significantly more efficient than the industry average, closing average of **8.3 loans per month per team member** in YTD 2020 vs. the **industry average of 2.3 per moth per team member**\n\n**In summary, the retail mortgage industry is in desperate need of digitization. RKT is perfectly positioned to capitalize on this need.** After all, who else is going to do this? Penny-fucking-Mac?\n\nTLDR: Go long RKT, I am long shares and will continue to add on dips.",
        "subreddit": "wallstreetbets",
        "title": "Buying the RKT Dip is an Absolute No-Brainer",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i8g3bq/buying_the_rkt_dip_is_an_absolute_nobrainer/",
        "created": 1597275997.0
    },
    {
        "author": "DigiFreeze",
        "created_utc": 1597846565,
        "id": "icofm5",
        "num_comments": 390,
        "num_crossposts": 0,
        "selftext": "Comrades, people, degenerates,\n\nDuring lockdown, I realized there was no easy way to intuitively understand option trades. So I decided to make one.\n\nIt's called Waffles 🧇. Waffles is a free tool that gives anyone the ability to intuitively build and graphically analyze option strategies on any U.S. ticker. I'm excited to get this out into the world. It should be up and running by this weekend.\n\nManually building trades will be a thing of the past. With Waffles, select the strategy you would like to build and let Waffles do the work for you. That's it. What used to take know-how, time and tedious work and now takes a click.\n\n[Toggling through pre-built strategies](https://i.redd.it/r3ret7ksvyh51.gif)\n\nRepositioning and customizing trades is as easy as building them. Even reposition the trade using keyboard shortcuts 🔥. I hope that quickly building and repositioning strategies will lead to some interesting discoveries from you 😊 --- or bigger and better YOLOs.\n\nReal-time feedback on factors such as implied volatility and time to expiration. Now you can see that vol crush before it happens IRL 😅.\n\n[decreasing and increasing imp vol](https://i.redd.it/2lzs2h4tvyh51.gif)",
        "subreddit": "wallstreetbets",
        "title": "Building a free tool to intuitively build and understand your option bets",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/icofm5/building_a_free_tool_to_intuitively_build_and/",
        "created": 1597875365.0
    },
    {
        "author": "fawkesmulder",
        "created_utc": 1596893054,
        "id": "i5z28l",
        "num_comments": 379,
        "num_crossposts": 0,
        "selftext": "Just got to thinking about all the money robinhood is skimming off the top, and the audacity of their name in light of this.\n\nOther firms report payment for order flow, at least on shares. TDA or Charles Schwab, for example are getting an average of about 1/10 of a cent per share... Robinhood doesn’t post their data. \n\nThis is why Citadel and other huge trading firms pay more for robinhood orders, as there are no parameters publicly listed anywhere and they “get away” with taking more off the top. For shares, it can be a few cents.\n\n“If a customer buys 100 shares of Apple for $200 each—a $20,000 purchase—Robinhood could get up to $5.20 for routing that order to electronic-trading giant Citadel Securities LLC, according to calculations based on a recent Securities and Exchange Commission filing.\n\nSchwab would be paid around 9 cents for sending the same order to Citadel, while TD Ameritrade would get 16 cents on average, according to these companies’ SEC filings.\n\nThat’s a nearly 60-to-1 difference between what Robinhood and Schwab are paid. The gap isn’t always so wide, because of differences in the formulas used to determine the size of the payments. Still, Robinhood often makes much more for the same orders, the filings suggest.”\n\nhttps://www.wsj.com/articles/why-free-trading-on-robinhood-isnt-really-free-1541772001\n\nOptions data isn’t available for TDA, Schwab, etc., but given the difference in share payment for order flow from Robinhood to electronic trading giant Citadel, would it surprise anyone they were also paying more for options? \n\nRobinhood likes to set quite a large bid-ask spread as the default for options with an easy button and number for a retail investor to click that is in the middle, further gouging inexperienced traders.\n\nBut besides that little trick, what about the prices that they show on the screen as the bid/ask.\n\nHow do the option prices compare in real time, bid / ask vs. other brokerages.\n\nI want to do more research.",
        "subreddit": "wallstreetbets",
        "title": "Robinhood is literally stealing from the poor to give to the rich",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i5z28l/robinhood_is_literally_stealing_from_the_poor_to/",
        "created": 1596921854.0
    },
    {
        "author": "unfuckthisfuckery",
        "created_utc": 1597608867,
        "id": "iazhsy",
        "num_comments": 378,
        "num_crossposts": 0,
        "selftext": "If you’re still among the people who think Tesla is jUsT a cAR mAnuFaCtUrEr or it’s HiGhLy OvErVaLUed you need a reality check.\nWhile being the internet’s resident meme lord, Elon Musk is also the Albert Einstein of our time and he’s pushing the boundaries like no one else does.\n\nThis market does not give a single fuck about fundamentals and if you do, wsb is not the place to be bucko. \nThe amount of big news Tesla has in store within the next weeks is outrageous and literally no other company revolutionizes anything at their pace. \n\n8/31: Stock split. Smart money thinks it can price in the influx of new investors, it cannot. The amount of people that sat on the sidelines and didn’t get in at $400 will finally be able to get in and they will, they won’t miss the train a second time. \nRobin Hood traders being a special breed, you already know they’re going to jump on it, mouths foaming like a bunch of hungry hyenas that have to fight over one piece of chicken breast a month.\n\n9/18 S&amp;P board meeting: The addition is going to happen, and despite big funds buying in for two months now, this is precisely the kind of news that pushes a meme stock like crazy.\n\n9/22 Battery day/shareholder meeting: Supposedly the day of the unveil of the million mile battery, a fucking gold mine for the company that gets there first. \nAlso possibly the reveal of the plaid model S &amp; X (lol Sex)\n\n[Supposed quantum leap in full self driving is also happening within the next 2 month.](https://electrek.co/2020/08/14/elon-musk-tesla-full-self-driving-quantum-leap-new-rewrite/amp/)\n\nIn case you forgot why the market is where it is, it’s because of news, hype and the wildly risen demand for tech. If you still can’t get yourself to changing your way of thinking you’ll be on the wrong side of history once again.\n\nTldr; Get out of your fucking bullshit positions and get your cash ready for a Tesla run to Proxima Centauri. TSLA 9/25c 2200",
        "subreddit": "wallstreetbets",
        "title": "Tesla July rally was a joke, September is going to be a fucking rocketship",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iazhsy/tesla_july_rally_was_a_joke_september_is_going_to/",
        "created": 1597637667.0
    },
    {
        "author": "The_Terrific",
        "created_utc": 1596908243,
        "id": "i636je",
        "num_comments": 375,
        "num_crossposts": 0,
        "selftext": "This is a serious request. I work some dead end, shitty, irreplaceable job for $12 hr. \n\nBefore quitting and trying this bullshit full time, should I just trade on days off or should I quit and do it all days and hours? \n\nI took a vacation a few months ago and when I wasn't working or thinking about work I made way better trades and I think it's because I wasn't working. \n\nLet me know. I'm putting into consideration what you full timers have to say.",
        "subreddit": "wallstreetbets",
        "title": "[Serious] To all the people that quit their job to trade, should I?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i636je/serious_to_all_the_people_that_quit_their_job_to/",
        "created": 1596937043.0
    },
    {
        "author": "Redditor_2021",
        "created_utc": 1596731857,
        "id": "i4v3y7",
        "num_comments": 365,
        "num_crossposts": 0,
        "selftext": "CMON YOU AUTISTS. ITS TENDY TIME. Seriously though we all need these gains. Upvote this, get it to the public, and let’s pump the hell out of RKT. To the fucking moon baby.",
        "subreddit": "wallstreetbets",
        "title": "RKT TO THE MOON🚀🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i4v3y7/rkt_to_the_moon/",
        "created": 1596760657.0
    },
    {
        "author": "MistahPee",
        "created_utc": 1597267468,
        "id": "i8mll1",
        "num_comments": 358,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "WSB: It don't go down. Market: It do go down!",
        "url": "https://v.redd.it/vrb6b5p82ng51",
        "created": 1597296268.0
    },
    {
        "author": "nailthrowaway666",
        "created_utc": 1596674737,
        "id": "i4hp9j",
        "num_comments": 354,
        "num_crossposts": 0,
        "selftext": "YO RETARDS,\n\n&amp;#x200B;\n\nIM BACK WITH A SHITLOAD OF MONEY FROM SILVER AND IM FEELIN RISKY\n\n&amp;#x200B;\n\nTOP COMMENT (THAT ACTUALLY IS LOGICAL) GETS A PLAY TOMORROW, 5K CASH.\n\n&amp;#x200B;\n\nIM NOT DOIN 1800 TESLA CALLS ETC, ITS GOTTA BE SOMETHING THAT CAN ACTUALLY HIT U FUCK TARDS.\n\n&amp;#x200B;\n\n08/07 EXPIRATION ONLY.",
        "subreddit": "wallstreetbets",
        "title": "$5K YOLO, YOU NAME IT. I BUY IT.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i4hp9j/5k_yolo_you_name_it_i_buy_it/",
        "created": 1596703537.0
    },
    {
        "author": "negovany",
        "created_utc": 1597438594,
        "id": "i9u54u",
        "num_comments": 354,
        "num_crossposts": 0,
        "selftext": "I told you retards to pay attention to Barrick Gold (GOLD). Turns out Berkshire bought 21 million shares of GOLD. He also trimmed his bank position in WF. What does this mean for us? It means that all boomers and finance journos will be praising miners stocks on Monday and it will rain cash. Hell, I'm up few percent even after hours.",
        "subreddit": "wallstreetbets",
        "title": "Buffet bought GOLD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i9u54u/buffet_bought_gold/",
        "created": 1597467394.0
    },
    {
        "author": "1poundbookingfee",
        "created_utc": 1597682357,
        "id": "ibhl9z",
        "num_comments": 338,
        "num_crossposts": 0,
        "selftext": "Wondering what you should yolo your last $69 in? \n\n# Just. Buy. Tech. Calls. \n\n\\----\n\nQ: Should I dollar cost average into the stock market? \n\nA: No. Just buy tech calls. \n\n\\----\n\nQ: Is it a good idea to go long on metals? \n\nA: No. Just buy tech calls. \n\n\\----\n\nQ: Eddie Murphy made a killing on agriculture future. Should I do the same?\n\nA: No. Just buy tech calls. \n\n\\----\n\nQ: There's a new company called Silver Purple. That sounds like a 100% win. \n\nA: No. Just buy tech calls. \n\n\\----\n\nQ: My wife wants to leave me and take the kids. Should I get a lawyer?\n\nA: No. Just buy tech calls. \n\n\\----\n\nQ: It burns when I pee, should I see a doctor? \n\nA: No. Just buy tech calls. \n\n\\----\n\nQ: I think I may have a gambling addiction. Should I get help?\n\nA: Yes, but also buy tech calls.",
        "subreddit": "wallstreetbets",
        "title": "Just. Buy. Tech. Calls.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ibhl9z/just_buy_tech_calls/",
        "created": 1597711157.0
    },
    {
        "author": "DIRTY_MAGICIAN",
        "created_utc": 1596591441,
        "id": "i3wbe4",
        "num_comments": 333,
        "num_crossposts": 0,
        "selftext": "**Ban me for life if I shit myself.**\n\nAt the beginning of the housing market crash of 2007/8, housing sale prices dropped from $305,800(Q4-2007) to $290,400 (Q1-2008)(-5.04%)\n\nToday, 2020, Q1 to Q2 dropped from $383,000 to $368,700(-5.74%)\n\nUS House Prices consistently correlate a 6 month forecast of Real Personal Consumption Expenditures (PCE), according to Oxford Economics.\n\nQ2(2020) GDP decreased 32.9%, where Q1 had only decreased 5%.\n\nDisposable Personal Income increased $1.53T(42.1%), in Q2 compared with an increase of $157.8B(3.9%) in Q1 where a stimulus package for unemployment was nonexistent. Real Disposable Personal Income increased 44.9% for Q1, compared with an increase of 2.6% for Q2.\n\nPersonal Saving increased to $4.69T 3x from Q1 to Q2.\n\nGold has been on a bull rise since April, steeper than World Technology, and also World Alternative Energy. As of mid-June, Gold bull sentiment has made an even steeper rise to today.\n\nGoldman Sachs Global Investment's Risky/Safe Asset Flow Sentiment shows asset risks in April was around only 5%. As of the beginning of July, their assets were forced up to 82% risk. And in the last month, they've managed to decrease their risk to 60%.\n\nStock Market Valuation from Dec2007 to Jun2008 dropped 38% from neutral(0%) to deeply undervalued.\n\nAutists, if you read this, and read it again, you will see that in 6 months from now, we will be at the bottom of the market. But, unlike last time where it took 18 months for the market to level out to normal, this time it will take 36-48 months.\n\nBuy Puts for Feb-2021. Anything but Gold.",
        "subreddit": "wallstreetbets",
        "title": "Market Crash info for all you Autists",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i3wbe4/market_crash_info_for_all_you_autists/",
        "created": 1596620241.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1597997216,
        "id": "idsqai",
        "num_comments": 331,
        "num_crossposts": 0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme and/or [post your arguments against fundamentals here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nMost fundamentals are updated every 3 months due to the fact that corporations release earnings reports every quarter, so traders are always speculating at what those earnings will say, and investors may change the size of their holdings based on those reports.  Expect a lot of volatility around earnings, but it usually doesn't matter if you're holding long term, but keep in mind the importance of earnings reports because a trend of declining earnings or a decline in some other fundamental will drive the stock down over the long term as well.\n\nSee the following word cloud and click through for the wiki:\n\n[Market Cap - Shares Outstanding - Volume - Dividend - EPS - P/E Ratio - EPS Q/Q - PEG - Sales Q/Q - Return on Assets (ROA) - Return on Equity (ROE) - BETA - SMA - quarterly earnings](https://www.reddit.com/r/stocks/wiki/fundamentals-themed-post)\n\nIf you have a basic question, for example \"what is EBITDA,\" then google \"investopedia EBITDA\" and click the Investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nUseful links:\n\n* [Investopedia Tuturiol](https://www.investopedia.com/university/all/fundamental-analysis/) on fundamental analysis including [Discounted Cash Flow](https://www.investopedia.com/university/dcf/) analysis; see [definition here](https://www.investopedia.com/terms/d/dcf.asp)\n* [FINVIZ](https://finviz.com/quote.ashx?t=aapl) for fundamental data, charts, and aggregated news\n* [Earnings Whisper](https://www.earningswhispers.com/stocks/aapl) for earnings details\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion &amp; Fundamentals Friday Aug 21, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/idsqai/rstocks_daily_discussion_fundamentals_friday_aug/",
        "created": 1598026016.0
    },
    {
        "author": "crooglesam",
        "created_utc": 1597257591,
        "id": "i8jed9",
        "num_comments": 325,
        "num_crossposts": 0,
        "selftext": "I am an absolute noob at trading, let alone options trading.\n\nI wanted to buy 12c 08/21 which was trading at 0.18 at the time. I placed the order for 20 contracts and it would not take the limit of 0.18 on RH, it kept saying that the trade has to be in 5cent increments so I had to place a limit buy with .20 limit. The order executed for 20cents a contract (total $400) and I was already down $40 as soon as the buy executed. So now I waited for the Corn report and knew it was bad. In a bid to minimize my losses I wanted to sell my contracts and they were still trading at 18cents for the 12c 08/21, but then again I was unable to place the sell order with a limit of 0.18 as RH said it had to be in 5cent multiples. So I placed a Limit sell at 0.20\n\nSo I decided to wait it out and see if by any chance the contract would go up in value to 0.20 so I can break even and sell at 0.20. Well the 8/21 calls started dropping in value and suddenly started trading at 0.13 not even 0.15. Now I just decided to sell no matter what and was forced to set limit of .10 since if I set it at 0.15 it would not sell, just like it had not sold at 0.20. So I end up placing sell limit order at 0.10 which executed immediately so my total loss within a span of couple of hours was 50% ($200) of my initial $400 investment.\n\nAm I making some rookie mistake here??",
        "subreddit": "options",
        "title": "Lost 50% on CORN calls",
        "url": "https://www.reddit.com/r/options/comments/i8jed9/lost_50_on_corn_calls/",
        "created": 1597286391.0
    },
    {
        "author": "Mitesite",
        "created_utc": 1597589546,
        "id": "iatnoo",
        "num_comments": 316,
        "num_crossposts": 0,
        "selftext": "Walmart is in the midst of a huge online expansion. They partnered with Shopify 2 months ago and they’re releasing Walmart+ soon, which could potentially rival Amazon Prime. It’s also very unlikely that COVID will have have a huge negative impact on it.\n\nI think WMT is at a great price right now, and it’ll \n have huge growth over the next year or so. What do you guys think?",
        "subreddit": "stocks",
        "title": "Does anyone else think that WMT is undervalued?",
        "url": "https://www.reddit.com/r/stocks/comments/iatnoo/does_anyone_else_think_that_wmt_is_undervalued/",
        "created": 1597618346.0
    },
    {
        "author": "KindheartednessNo884",
        "created_utc": 1597946057,
        "id": "idf7cb",
        "num_comments": 314,
        "num_crossposts": 0,
        "selftext": "At time of writing, GOOG market cap is $1.06T and other tech giants are much higher (AAPL is $2.01T, AMZN is $1.65T, MSFT is $1.61T). That gap feels large to me. Also, FB is valued at $760B with much lower revenue and decelerating growth, so its gap vs GOOG seems small. \n\nIs GOOG a good buy? Are these other companies just overvalued? Curious what you all think.  \nHere's my thinking:\n\n* GOOG has rock-solid fundamentals - excellent gross margins, has maintained \\~15%+ YoY revenue growth even at their scale, and search is a steady business with many entrypoints across the Google ecosystem\n* GOOG has bets across so many forward-looking industries that I think they will be able to diversify over time and don't have real risk of not continuing to innovate. There's of course the risk of anti-trust and privacy regulations, but that's been true for years now (although things do appear to be ratcheting up).\n* It seems their stock hasn't mooned during covid because a meaningful share of search volume (and subsequently search revenue) comes from brick-and-mortar businesses (as opposed to someone like FB, whose ads biz is more of an ecommerce/direct-to-consumer play), which puts a drag on their revenue. This was the main reason for their relatively weak Q2 earnings a couple weeks back.  \n\nDisclaimer: I own shares of every company mentioned here. Thanks for your input - I really enjoy this subreddit and have learned a lot from reading other posts.",
        "subreddit": "investing",
        "title": "Why is GOOG worth so much less than AAPL, AMZN, MSFT?",
        "url": "https://www.reddit.com/r/investing/comments/idf7cb/why_is_goog_worth_so_much_less_than_aapl_amzn_msft/",
        "created": 1597974857.0
    },
    {
        "author": "ElizavetaTheGreat",
        "created_utc": 1596648279,
        "id": "i49lat",
        "num_comments": 308,
        "num_crossposts": 0,
        "selftext": "Hi, just a quick update on my macro sentiment trading journey. I’ve posted my result here two weeks ago - I had 7 winning trades in a row and my account jumped from $10k to $30k. For those who missed my previous post - in my trades I’m following the narrative that fundamentals now mean nothing since Fed started printing in March. Instead of using FA or TA I’m now using macroeconomic sentiment analysis, which is basically a weekly survey of 150k analysts from 130 countries conducted by some company. They’re asking simple questions like “What’s the employment situation in your inner circle: are people losing their jobs and have salary cuts or vice versa”; and post several indicators based on it every week. It’s not an ad so I’m not sharing the company’s name here (unless you ask in DM).\n\nSo, last week was no trade according to sentiments, but this week had a very surprising (for me) guidance - buy calls. I was a bit afraid to follow the call (pun intented) because I think there will be a correction pretty soon. \n\nAnyway, I’ve bought SPY calls (327 strike) for $3.7-ish on Monday and sold today at $5.5-ish with 50% (about $5k) profit. I also was thinking about selling some 332 strike or so to make a spread, but decided just to take profit (don’t want to reinvent the wheel). So this is my 8 profitable trade in a row (I know other sentiment traders had 12 wins in a row).\n\nI think I’ll continue for a few weeks with the same risk-per-trade and then I’ll increase my risk by two times. What’s your thoughts re sentiment analysis?",
        "subreddit": "options",
        "title": "+50% profit on SPY 327 Calls following Macro Sentiments",
        "url": "https://www.reddit.com/r/options/comments/i49lat/50_profit_on_spy_327_calls_following_macro/",
        "created": 1596677079.0
    },
    {
        "author": "Maple_Butter952",
        "created_utc": 1596542463,
        "id": "i3i1l8",
        "num_comments": 304,
        "num_crossposts": 0,
        "selftext": "[Gains](https://imgur.com/gallery/afMJcB4)\n\nI’m very surprised about the lack of attention NVAX gets on this sub considering it has rallied much more than something like TSLA and is a pharmaceutical stock in the middle of a pandemic. Read this and maybe some of you autists can make up the money you lost on MSFT calls and buying KODK at $50.\n\nBackstory:\n\nI have held this stock since 2016 with nothing but diamond hands. In September 2016, they failed their stage 3 clinical trial and fell 84%. In 2019, they issued a 1:20 reverse split. I continued to be optimistic hoping their NanoFlu vaccine could bring some revival to the stock and even doubled down on my initial investment to get my average price down to ~$26. I was rewarded for this once COVID hit.\n\nWhy NVAX?\n\nNVAX was one of the first of the operation warp speed companies to receive significant funding, and they will be a key player in the development of a vaccine. It has, by far had the biggest % gain of all the warp speed companies. \n\nThey will be releasing their phase 1 clinical trial results after hours today.\n\nThe reason NVAX will be more successful than any of the other pharmaceuticals/biotechs is because they already have technology and experience from previous attempts in the type of vaccine that will be used. They use their owned recombinant nanoparticle technology to generate antigen derived from the coronavirus spike (S) protein and contains Novavax’ patented saponin-based Matrix-M.\n\nNVAX, without any COVID vaccine is already incredibly undervalued as is. Their NanoFlu vaccine has shown to be very effective in phase 3 clinical studies and has already been shown to be much more effective than the version Sanofi has developed.\n\nAs a plus, unlike other CEOs of this sector dumping all their stocks, the CEO has increased his number of shares since the beginning of COVID.\n\nImportant events:\n\nMay 11 2020: Coalition for Epidemic Preparedness Innovations (CEPI) awards NVAX $384 million to advance clinical development of their COVID vaccine NVX-CoV2373.\n\nJuly 7 2020: Trump awards NVAX $1.6 Billion\n\n7/27: Trump visits FujiFilm factory that will be manufacturing batches used in NVAX Phase 3 trial and awards FujiFilm a $265 million contract.\n\nPhase 1 clinical trials are expected after hours today, so this may be your last opportunity before this stock truly goes to Pluto.\n\nThings ik you autists will say:\n\n“It’s already ballooned why would I buy in now”\n\nPeople were saying this when it hit 40. People were saying this when it hit 70. Then 90. Then 110. Then 140. Somehow people are still bearish on this after it hit $160 yesterday. Today will be the biggest news NVAX will have regarding COVID, buy in today while you can.\n\n“It hasn’t produced a single thing available on the market”\n\nVery true, but this time is different. Right now, not only does it have the support of Donnie, it also has international support from CEPI as well as the direct funding from the likes of Bill Gates. The technology they have been working on for the past decade will directly be used in their vaccine.\n\n\nMy personal success:\n\nMost of my gains as you’ll see are simply from holding the stock long term. I have also taken up theta gang strategies to sell very OTM options to degenerates as I have no need to take the risk of buy options at this level. At this point if I am forced to sell my shares, I will be happy to take my $4 million and run. \n\nI will admit, buying call options are incredibly profitable and decently easy to predict. For example, this was known to be a very big week for NVAX (even with earnings being pushed back) and it had been facing a resistance at $150 for the past three weeks. Even WSB autists can see that it would likely break $150 sometime this week, and in a pleasant surprise, it managed to do that today and hit a 52wk high in the process. \n\n\nTLDR; NVAX goes brrr. Stage 1 clinical trial data released after hours today will make NVAX go more brrrrr. Earnings coming out next week will make NVAX go even more brrrrrrrrr.",
        "subreddit": "wallstreetbets",
        "title": "$3 Million NVAX Gains",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i3i1l8/3_million_nvax_gains/",
        "created": 1596571263.0
    },
    {
        "author": "DankMemelord25",
        "created_utc": 1596593618,
        "id": "i3wuso",
        "num_comments": 298,
        "num_crossposts": 0,
        "selftext": "Yes I know what you're thinking Autist, as you sit on your gaming chair sipping your choccy milk. \"I've seen all these 🐻 posts before and stonks kept going up, printer goes BRRRRRR\"\n\nFundamentals haven't mattered for months, and except for some sharp pullbacks, NQ and SPY have all been on an absolute tear being instabid on every dip.\n\nThat's all about the change.\n\nTldr - bond market/ PM pricing in no deal on stimulus.\n- Bifurcation of NQ and SPY reached major tipping points.\n- DXY likely to bounce back strongly on risk off sentiment and foreign central bank action.\n- macro long term positioning for Inflation playing out across asset class correlations ( RUSSELL and value stocks starting to gain traction )\n\n1.\nPriced In has become a retarded meme at this point but what does it actually mean? It means basically that the market, chiefly big 💰 / institutions are expecting a future outcome ( or probability of one) and have allocated money appropriately. Historically Fixed Income due to its relative size has been a fairly reliable indicator. Previous crashes this year such as Feb/March crash and the mini NQ/SPY crash in June and July were both foreshadowed by major/ high Vol shifts downwards in 10 year bond prices .\n\nCurrently 10 year are plumbing new lows at the bottom end of 0.50 percent ( discounting the March flash crash ). This coupled with the meteoric rise in GLD and SLV last night IS NOT A GOOD SIGN. The sharp changes occured directly after stimulus news. \n\nWhat this means is that Institutions are signalling a chance the package will not be passed on time or in its entirety . \n\nBUT BUT VIX IS DOWN AND EQUITIES ARE UPPIES!\nyes little autismo, they are but that doesn't mean what you think it does. it's a poorly kept secret that this market is being kept afloat by hedge funds , institutional buying and retail fomo. I don't have the crayons or time to explain it to you but just look at news releases, support level buying and virus/ trade talks pumps. institutional players left the market in February , now it's just algos and retail. Vix being low doesn't necessarily mean what you think it does either. To oversimplify VIX goes up when more people buy puts. This is typically done hedge against market drops. \nBig players don't need to hedge if they SOLD all/ most of their equity holdings and moved it into Bonds/ Gold / Foreign equity. Hedge funds are also notorious for shorting VIX as part of the 'Fed Put \" trade . The fact that FI/PM are up while VIX is down makes me more certain of a drop not less as it means Big boys are trying to pass as many bags as they can to retail without spooking them.\n\n2. There's been a lot of articles on this already so I'll keep it short, you all know how to use Google. SPY since March lows has been split in two like a sociopathic Solomon. There is the big 5 tech and everything else. Currently Big 5 is sitting at 25 percent of all market cap with huge returns over the last few months. This coupled with the performance differential of the other 495 has surpassed levels not seen since the dot com boom. THIS IS NOT SIGN OF A HEALTHY BULL MARKET. Major Bifurcation is the second best signifier of a 🐻 after the technical 20 percent drop level ( which doesn't really mean much) . 🍏 Has now become the largest company in the world surpassing Saudi Aramco. THIS TECH BOOM IS NOT SUSTAINABLE. Most of the apple gains have been from a one of WFH structural shift and Fiscal stimulus ( that now accounts for 25 percent of all disposable income ). If the stimulus bill doesn't pass, Apple is fucked. Just look at the AAPL gains from the last week, do you think this is sustainable?\n\nThe common retort on this sub is, \" we all know it's a bubble but it will pop in few months, I'm getting my TENDIES while they're hot! \"\n\nThis sentiment has been thrown around for months all through April to July. Well what if months later is now? What better catalyst for a bubble pop than a Stimulus not going through as planned? \n\n3. There's been a lot of posts about DXY dying and a lot of it is half true. Currencies are a hard thing to predict but I do want to point out two very key factors that are bullish for DXY. \n3a- The entire world, especially emerging markets rely on Dollar inflows from exports to fund imports for key goods, especially commodities (oil etc). Global trade fell off a cliff in March and has barely recovered so where are countries getting dollars? By buying bonds . This was the reason behind the DXY spike to over 100 in March and the reason why the FX central bank swap program was instituted by JPOW. So unless you see global trade rebounding strongly in the very near term ( pigs will fly ) bonds will continue to be bid extremely strongly at auction, supporting DXY. \n\n3b) DXY as has been pointed out is primarily dropping due to Euro strength ( which makes up about 65 percent of the Index). When DXY is compared to the Bloomberg trade weighted dollar index you'll see it hasn't dropped far at all and this makes sense (see 3a above). The Euro bullish trend, along with AUD/USD,GBP/USD and JPY/USD is unlikely to continue much further. Foreign central banks and governments for that matter will not allow the dollar to crater. We've already seen rumblings from the EU and JPY on this front as exports are already in a tenuous position. The last thing foreign companies need is a strong currency to hamper export sales. So I wouldn't bet against the FED, but I sure as shit wouldn't be getting against the ECB.\n\nSummary: I don't see this stimulus playing out on time or in full. Big money is pricing in either a delay or being scaled back substantially to meet Republican demands. I won't go into the specifics of the political theatre because quite frankly it doesn't matter. PM/ BONDS are are all the signalling device you need.\n\nHow I see this playing out: The stimulus bill will pass on few weeks after a substantial Rug pull, similar to the 2008 TARP fiasco. I would strongly recommend either holding cash or going long DXY while this plays out. Either buy the dip on GLD/SLV with leaps or go long TLT at like 180c.\n\nPositions : short MNQ 3 units at 10530 and 1 ES at 3220. Yeah got in a little early, wasn't expecting the tech earnings blowout but have the margin to hold. \n\nLooking at GLD leaps for 06/21 300c when we get a pullback ( due to margin calls ).",
        "subreddit": "wallstreetbets",
        "title": "🚨🚨🚨 Incoming rug pull and how to play it for maximum tendies.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i3wuso/incoming_rug_pull_and_how_to_play_it_for_maximum/",
        "created": 1596622418.0
    },
    {
        "author": "InvestWithArihant",
        "created_utc": 1596802670,
        "id": "i5cqu6",
        "num_comments": 297,
        "num_crossposts": 0,
        "selftext": "Toyota Motor on Tuesday said it expects profit to drop 80% to its lowest in nine years, as Japan’s biggest automaker grapples with the impact of the novel coronavirus which has sapped global demand for vehicles.\n\nGlobal automakers have begun to gradually resume operations factories after curbs on public movement prevented workers in many countries from commuting. But they face weak demand as job losses and concern about an economic downturn weigh on consumer spending.\n\n“The coronavirus has dealt us a bigger shock than the 2008 global financial crisis,” Toyota President Akio Toyoda said at a live-streamed media briefing.\n\n“We anticipate a big drop in sales volumes, but despite that, we are expecting to remain in the black. We hope to become a leader of the country’s economic recovery.”\n\nToyota forecast an operating profit of 500 billion yen ($4.66 billion) for the year through March 2021, down 80% from 2.44 trillion yen in the year just ended. That would be its weakest profit since the 2011/12 financial year.\n\n[link](https://www.cnbc.com/2020/05/12/toyota-expects-profit-to-drop-80percent-this-year-as-virus-saps-car-sales.html)",
        "subreddit": "stocks",
        "title": "Buy? - Toyota expects profit to drop 80% this year as virus saps car sales",
        "url": "https://www.reddit.com/r/stocks/comments/i5cqu6/buy_toyota_expects_profit_to_drop_80_this_year_as/",
        "created": 1596831470.0
    },
    {
        "author": "MrOaiki",
        "created_utc": 1597148928,
        "id": "i7qwqa",
        "num_comments": 293,
        "num_crossposts": 0,
        "selftext": "Every now and then, people on here think they have some “brilliant” thought about the markets. Often it’s something they believe no one else has thought of, and will make them money. And it goes both ways, bulls see a coming surge. Bears have analyzed the markets and “know” they’re in for a large dip. I claim that whoever in here believes he or she timed the markets,  is fooled by randomness. \n\nEither way, let’s talk about one common trait among a lot of bearish posts in here...\n\n... They seem to imply we live in a proverbial vacuum. Every time the world doesn’t end, I see posts and comments along the lines “of only the Fed hadn’t X” or “if only the lawmakers hadn’t Y”. Well, ok, interesting theories, but we live in a developed world. Governments will always do X and Y, and institutions are always ready for Y. And if they’re not, the legislative bodies are ready to step in to fix whatever systematic faults need to be dressed. The whole market economy is just a set of laws and regulations, and those laws and regulations are being adjusted all the time. Therefor, any analysis made that implies that the world will just stay passive when there’s a risk of it burning, is sloppy and irrelevant.\n\n“The Congress can’t just...”, yes they can. “The Fed can’t keep...”, yes they can.\n\n**Tl;dr: Whatever laws and interventions needed to stabilize the economy and induce growths, will be set in place. Always. And the means of production in mature economies will manage.**",
        "subreddit": "investing",
        "title": "We do not live in a political and institutional vacuum, you should keep that in mind",
        "url": "https://www.reddit.com/r/investing/comments/i7qwqa/we_do_not_live_in_a_political_and_institutional/",
        "created": 1597177728.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1597046924,
        "id": "i70td1",
        "num_comments": 288,
        "num_crossposts": 0,
        "selftext": "These daily discussions run from Monday to Friday including during our themed posts.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?sort=new&amp;q=Rate+My+Portfolio+-+r%2FStocks+Quarterly+Thread&amp;t=all&amp;restrict_sr=on).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion Monday - Aug 10, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/i70td1/rstocks_daily_discussion_monday_aug_10_2020/",
        "created": 1597075724.0
    },
    {
        "author": "DotNetPhenom",
        "created_utc": 1597236512,
        "id": "i8d4mb",
        "num_comments": 286,
        "num_crossposts": 0,
        "selftext": " \n\n&gt;Last July, Harris [released a plan to provide](https://www.marketwatch.com/story/2020-candidate-kamala-harris-wants-wall-street-to-pick-up-the-tab-for-her-medicare-for-all-plan-2019-07-29?mod=article_inline) “comprehensive health insurance that covers every American.” The way she planned to achieve that? By expanding Medicare.  \n&gt;  \n&gt;Unlike Bernie Sanders, though, Harris did not envision  achieving this goal by taxing families making under $100,000. Instead,  she planned to pay for “Medicare For All” by taxing Wall Street.  \n&gt;  \n&gt;Her plan called for a 0.2% tax on stock trades, a 0.1% tax on  bond trades and a 0.002% tax on derivative transactions. She claimed  these taxes would raise more than $2 trillion over the course of a  decade. Critics of the plan argued that taxing financial transactions in  this way could make it harder for Americans to build retirement  savings.\n\n&amp;#x200B;\n\n.2% is a ripoff, retailers wouldnt be able to afford to trade on margin at that rate. \n\n[https://www.marketwatch.com/story/kamala-harris-on-student-loan-forgiveness-medicare-universal-basic-income-credit-scores-and-a-tax-on-trading-stocks-2020-08-12?siteid=yhoof2&amp;yptr=yahoo](https://www.marketwatch.com/story/kamala-harris-on-student-loan-forgiveness-medicare-universal-basic-income-credit-scores-and-a-tax-on-trading-stocks-2020-08-12?siteid=yhoof2&amp;yptr=yahoo)",
        "subreddit": "pennystocks",
        "title": "Would Biden move forward with Kamala's plan to tax stock trades?",
        "url": "https://www.reddit.com/r/pennystocks/comments/i8d4mb/would_biden_move_forward_with_kamalas_plan_to_tax/",
        "created": 1597265312.0
    },
    {
        "author": "Hollowpoint38",
        "created_utc": 1596829866,
        "id": "i5kqpl",
        "num_comments": 286,
        "num_crossposts": 0,
        "selftext": "A post was made [earlier this week](https://www.reddit.com/r/investing/comments/i38k65/fed_tlt_buys_tuesthurs_guarantee_a_50125_return/) recommending people buy the August 7th 170 Call options on TLT.  TLT is a long-term Treasury ETF by iShares.\n\nAs you can see, the post has been removed, but the comments remain.  I think this is a good learning experience.\n\nThe poster and several others advocated the purchase of these options at $1.25.  That means $125 per contract which would give effective control of 100 shares of TLT.  The claim was that it was \"guaranteed money\" because the Fed announced it was buying bonds.  The strategy was to buy at the beginning of the week and hold until expiration date or shortly before.  Let's see how this played out:\n\nAs you can see in the comments, people were showing price charts and drawing lines on them claiming they had made money etc.  It's easy to pull up a chart and draw patterns after-the-fact.  But what happened with the price?\n\nWell yesterday the price of these options was around $1.25-$1.29 per contract.  That is around the same as it had been earlier in the week, which is a break-even or a loss in terms of opportunity.  But that's not the scary part.  As of right now, the price is 5 cents.\n\nhttps://imgur.com/U85P3VS\n\nThe strategy in this was to buy 25 Call options.  That would run around $3,200 at the price the time the post was made.  Right now selling these contracts would get you $125, which means the trade is a -$3,075 loss or so.  Wiped out completely.\n\nI kept asking for people to post up screenshots of their order fills (the buy and sell tickets) to show us that they made profitable trades and weren't just drawing lines on a chart.  They refused.  Guys, be careful.  Lots of people recommend shoddy advice or they oversimplify how options trades work.\n\nDo your due diligence, ask for some screenshots to see if they have any skin in the game.  A lot of times these guys aren't even making the trades, they are just doing a look-back and claiming they were in on the position.  Things aren't so simple as \"The Fed is buying bonds, I'm going in heavy on call options!\"  It's more complicated.\n\nLet this be a cautionary tale.  I feel sorry for the guys who actually followed this position in and who are now looking at some large red numbers.  I get downvoted a lot for being \"condescending\" and a lot of other descriptors.  But I actually do care about investors losing money to half-baked ideas and my commentary hopefully steers people away from stuff like this.  Because innocent guys with a lower account value will take advice and run with it and take food off their own family's table unknowingly.  That's who I'm trying to help.",
        "subreddit": "investing",
        "title": "Result of Treasury options play this week: Beware",
        "url": "https://www.reddit.com/r/investing/comments/i5kqpl/result_of_treasury_options_play_this_week_beware/",
        "created": 1596858666.0
    },
    {
        "author": "socialist_baby",
        "created_utc": 1596466312,
        "id": "i2ye0u",
        "num_comments": 284,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "But when Jpow does it... 😤",
        "url": "https://i.imgur.com/fP8kTAF.jpg",
        "created": 1596495112.0
    },
    {
        "author": "OttermanEmpire",
        "created_utc": 1596757958,
        "id": "i5373o",
        "num_comments": 281,
        "num_crossposts": 0,
        "selftext": "Sup tards, ya boi is back with another bigly gain that is still climbing. How long do I let it ride before I cash out? Definitely letting it take me to the two comma club.\n\nCurrent positions and proof: http://imgur.com/a/4cwnP9i",
        "subreddit": "wallstreetbets",
        "title": "600k+ gain on SLV in 3 days",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i5373o/600k_gain_on_slv_in_3_days/",
        "created": 1596786758.0
    },
    {
        "author": "flyingtable_",
        "created_utc": 1596716592,
        "id": "i4quh8",
        "num_comments": 280,
        "num_crossposts": 0,
        "selftext": "I am a little bit tired of discussions like \"Why did it go down?! They beat the revenue estimates!!\" and alike. People here and on /r/investing seem to almost never look at balance sheets, and use numbers in general. \n\nAre there any sub-reddits / forums / sites that have more financially literate crowds? I'd pay for it.\n\nThank you.",
        "subreddit": "stocks",
        "title": "Are there any sub-reddits / forums / sites that have more financially literate crowds than /r/stocks and /r/investing?",
        "url": "https://www.reddit.com/r/stocks/comments/i4quh8/are_there_any_subreddits_forums_sites_that_have/",
        "created": 1596745392.0
    },
    {
        "author": "Likwid24",
        "created_utc": 1597487619,
        "id": "ia53ox",
        "num_comments": 279,
        "num_crossposts": 0,
        "selftext": "With the recent round of funding this week and the addition of a prominent female board member, It seems to me like Impossible Foods is preparing for an IPO. California law requires at least one female board member in order for a company based in California to go public. Palantir just didn’t the same before filing with the SEC. My guess is early 2021 is possible. Thoughts? \n\nI’m considering picking up pre-IPO shares.",
        "subreddit": "stocks",
        "title": "Impossible Foods preparing for IPO?",
        "url": "https://www.reddit.com/r/stocks/comments/ia53ox/impossible_foods_preparing_for_ipo/",
        "created": 1597516419.0
    },
    {
        "author": "SyruporSyrup",
        "created_utc": 1596681327,
        "id": "i4jhc9",
        "num_comments": 279,
        "num_crossposts": 0,
        "selftext": "I'm not going to waste a lot of time on this since most of you can't read. Quicken Loans parent company Rocket Companiea is IPOing tomorrow under the ticker RKT. This should be an instant WSB meme but true to form no one has posted fuck all about it here. \n\nBut that's not the play. IPOs are a crap shoot, despite what the geniuses at Seeking Alpha think. This is the play:\n\nROCKET Pharmaceuticals (RCKT) is already on a tear. It's a great company, probably. Tomorrow, a ton of retards, mostly from this sub, will accidentally buy it thinking it is RKT. Literally can't go tits up. I have calls and shares and so should you. Time to get rich boys.",
        "subreddit": "wallstreetbets",
        "title": "A literal 🚀 (RKT) is IPOing tomorrow and no one is talking about it",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i4jhc9/a_literal_rkt_is_ipoing_tomorrow_and_no_one_is/",
        "created": 1596710127.0
    },
    {
        "author": "PeanutButter91",
        "created_utc": 1596821945,
        "id": "i5i91o",
        "num_comments": 277,
        "num_crossposts": 0,
        "selftext": "Feeling really dumb and depressed this morning as I was margin called for 380k. Hoping for some advice. Here’s the story:\n\n1) Sold 10x AAPL 375c 21Aug20 \n2) Bought 10x AAPL 380c 21Aug20\nThe credit spread was about $3,000 at the time (mid-July), and max loss therefore should have been $2,000. \n\nI believe the short position was ITM, and long was ATM at the time, although this is irrelevant. \n\nThis morning I received an email saying my short position was exercised (fuck me, I didn’t realize ex-div for AAPL was today). I’m assuming they exercised it yesterday to qualify for the upcoming dividend. My broker (Questrade in Canada) did nothing with my long position, so I’ve gone from a max loss of $2,000 to a much steeper one. I don’t know what to do.. \n\nQuestrade rep convinced me to exercise my long position and sell the shares upon receipt. However, the share price has dropped $10 already today, so my loss has likely gone from $2,000 to $12,000 and could get worse if this drop continues. I submitted the request to exercise the calls and I’m waiting for the shares. \n\nI entered this trade assuming my max loss would be $2,000. I thought questrade would require direction for the long position, cause I don’t have 380k to cover in my account. \n\nTLDR; entered what I thought was a covered credit position, to later be naked and forced into to a $380,000 long position.",
        "subreddit": "options",
        "title": "Help: 380k margin call. Looking for guidance.",
        "url": "https://www.reddit.com/r/options/comments/i5i91o/help_380k_margin_call_looking_for_guidance/",
        "created": 1596850745.0
    },
    {
        "author": "nongaap",
        "created_utc": 1596384961,
        "id": "i2enrc",
        "num_comments": 274,
        "num_crossposts": 0,
        "selftext": "**TLDR: Insiders gave themselves YOLO OTM options in May, signaling something \"big\" was on the table, and you could have traded alongside if you were paying attention.**\n\nHere's an open secret:\n\n* It's illegal to insider trade stock options while in possession of material nonpublic information. duh. BUT...\n* If the Board *gives* you stock options as part of a compensation package, IT'S LEGAL (generally).\n* So if you're an insider in possession of material nonpublic information and wanted to make a financial killing, convince the Board to give you out-of-the-money options. \n\nWhy does this matter for Kodak?\n\n* In May, the Board of Directors suddenly decided to give themselves a ton of out-of-the-money options.\n* **When did conversations with the U.S. government regarding a loan begin? In May.**\n\nThis is how insiders put on WSB style YOLO positions while in possession of inside information and get away with it,. And if you were paying attention, you could have traded alongside.",
        "subreddit": "wallstreetbets",
        "title": "Kodak insiders signaled something \"big\" was on the table 2 months ago",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i2enrc/kodak_insiders_signaled_something_big_was_on_the/",
        "created": 1596413761.0
    },
    {
        "author": "ArisenFall",
        "created_utc": 1597985382,
        "id": "idqcuv",
        "num_comments": 274,
        "num_crossposts": 0,
        "selftext": "Aight boys, I was being a bit of a dumbass and put my money into stocks that would appreciate in value after the pandemic. I’m ashamed of my actions and to make good on my misdeeds tmr I will be yoloing.\n\nMy account has just been 20-40 percent up and down spikes for 2 weeks so I’m looking for some consistency, I want to either be a millionaire or dead.\n\nRkt 3/19/2021c (Already purchased)\nMu 6/15/2021c Going to purchase\nThoughts?\nI said I wanna be a millionaire. This is how to do it bby. Fuck weaklies I want guaranteed tit go up proof TENDIES",
        "subreddit": "wallstreetbets",
        "title": "I’d rather die than diversify",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/idqcuv/id_rather_die_than_diversify/",
        "created": 1598014182.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1596614815,
        "id": "i41beq",
        "num_comments": 273,
        "num_crossposts": 0,
        "selftext": "These daily discussions run from Monday to Friday including during our themed posts.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?sort=new&amp;q=Rate+My+Portfolio+-+r%2FStocks+Quarterly+Thread&amp;t=all&amp;restrict_sr=on).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion Wednesday - Aug 05, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/i41beq/rstocks_daily_discussion_wednesday_aug_05_2020/",
        "created": 1596643615.0
    },
    {
        "author": "iggy555",
        "created_utc": 1598064976,
        "id": "ieax69",
        "num_comments": 272,
        "num_crossposts": 0,
        "selftext": "\"I went through the same process that most people do. I subscribed to a few investment letters and most of them didn't do too well.\"\n\nThat's what William O'Neil, the legendary trader and author of \"How to Make Money in Stocks,\" told Jack Schwager in a 1989 interview for his classic \"Market Wizards\" series.\n\nOut of frustration, O'Neil took the matter into his own hands. He knew a better way to trade was out there — all he had to do was uncover it. After all, he was seeing an array of fund managers crush the competition.\n\n\"Back in 1959, I did a study of the people that were doing very well in the market,\" he said. \"At that time, the Dreyfus fund was a very small fund, managing only about $15 million. Jack Dreyfus, who managed the fund, was doubling the results of all his competitors.\"\n\nO'Neil scoured Dreyfus' quarterly reports, searching tirelessly for any commonalities he could apply to his own methodology. After mapping out more than 100 of Dreyfus' stock purchase points, O'Neil hit pay dirt.\n\n\"There were over 100 of these securities and when I laid them out on a table, I made my first real discovery: Not some, not most, but every single stock had been bought when it went to a new high price,\" he said.\n\nThat unearthing opened the flood gates. O'Neil knew there were more secrets waiting to be uncovered. \n\nThe search continued. \n\nO'Neil shifted his focus to the market's biggest winners, trying to connect the dots between the characteristics of certain stocks and their superior performance. Eventually, his research culminated in a simple seven-part model: CANSLIM.\n\nAllow O'Neil to explain:\n\n\"Each letter of this name represents one of the seven chief characteristics of the all-time great winning stocks during their early developing stages, just before they made huge advances,\" he said.\n\nO'Neil's discovery translated to massive profits.\n\n\"During 1962-63, by pyramiding the profits in three exceptional back-to-back trades — short Korvette, long Chrysler, and long Syntex — he managed to parlay an initial $5,000 investment into $200,000,\" Schwager said.\n\nLet's take a closer look at O'Neil's famed CANSLIM principles. All quotes below are from O'Neil.\n\nC: 'Current earnings per share'\n\n\"The 'C' stands for current earnings per share,\" he said. \"So, our first basic rule in stock selection is that quarterly earnings per share should be up by at least 20 to 50 percent year to year.\"\n\nA: 'Annual earnings per share'\n\n\"In our studies, the prior five-year average annual compounded earnings growth rate of outstanding performing stocks at their early emerging stage was 24%,\" he said. \"Ideally, each year's earnings per share should show an increase over the prior year's earnings.\"\n\nN - 'Something New'\n\n\"The 'new' can be a new product or service, a change in the industry, or new management,\" he said. \"In our research we found that 95 percent of the greatest winners had something new that fell within these categories.\"\n\nS - 'Shares outstanding'\n\n\"Ninety-five percent of the stocks that performed best in our studies had less than twenty-five million shares of capitalization during the period when they had their best performance,\" he said. \"Many institutional investors handicap themselves by restricting their purchases to only large-capitalization companies.\"\n\nL - 'Leader or laggard'\n\n\"So, another basic rule in stock selection is to pick the leading stocks — the ones with the high relative strength values — and avoid the laggard stocks,\" he said. \"I tend to restrict purchases to companies with relative strength ranks above 80.\"\n\nI - 'Institutional sponsorship'\n\n\"Leading stocks usually have institutional backing,\" he said. \"However, although some institutional sponsorship is desired, excessive sponsorship is not, because it would be a source of large selling if anything went wrong with the company or the market in general.\"\n\nM - 'Market'\n\n\"Three out of four stocks will go in the same direction as a significant move in the market averages,\" he said. \"That is why you need to learn how to interpret price and volume on a daily basis for signs that the market has topped.\"",
        "subreddit": "stocks",
        "title": "Stock-market wizard William O'Neil famously turned $5,000 into $200,000 in just a few years. Here's the 7-part model he uses to sniff out winning stocks.",
        "url": "https://www.reddit.com/r/stocks/comments/ieax69/stockmarket_wizard_william_oneil_famously_turned/",
        "created": 1598093776.0
    },
    {
        "author": "forcedguy",
        "created_utc": 1597882853,
        "id": "iczw6n",
        "num_comments": 267,
        "num_crossposts": 0,
        "selftext": "* Safer than hotels with COVID (no shared common air) so demand will keep going up\n* Everyone desperately needs the income and will rent out as much as possible\n* They fired 25% of their workforce so they're leaner than ever\n* SUPER MEMEABLE\n* Counts as housing and tech at the same time\n* It's much nicer fluffing your wife's boyfriend for her on someone else's sheets",
        "subreddit": "wallstreetbets",
        "title": "AirBnB is going IPO and I'm going to YOLO the fuck out of it",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iczw6n/airbnb_is_going_ipo_and_im_going_to_yolo_the_fuck/",
        "created": 1597911653.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1596543034,
        "id": "i3i6ae",
        "num_comments": 264,
        "num_crossposts": 0,
        "selftext": "If your question is \"I have $10,000, what do I do?\" or other \"advice for my personal situation\" questions. If you are going to ask how to invest you should include relevant information, such as the following:\n\n* How old are you?\n* Are you employed/making income? How much?\n* What are your objectives with this money? (buy a house? Retirement savings?)\n* What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know its 100% safe?)\n* What are you current holdings? (Do you already have exposure to specific funds and sectors?)\n* Any other assets? House paid off? Cars? Expensive significant other?\n* What is your time horizon? Do you need this money next month? Next 20yrs?\n* Any big debts?\n* Any other relevant financial information will be useful to give you a proper answer.\n\nPlease consider consulting our FAQ first - https://www.reddit.com/r/investing/wiki/faq \n\nBe aware that these answers are just opinions of Redditors and should be used as a starting point for your research. You should strongly consider seeing a registered financial rep before making any financial decisions!",
        "subreddit": "investing",
        "title": "Daily Advice Thread - All basic help or advice questions must be posted here.",
        "url": "https://www.reddit.com/r/investing/comments/i3i6ae/daily_advice_thread_all_basic_help_or_advice/",
        "created": 1596571834.0
    },
    {
        "author": "seattle_exile",
        "created_utc": 1596835466,
        "id": "i5mgqn",
        "num_comments": 263,
        "num_crossposts": 0,
        "selftext": "  \n\nI was introduced to options in 2005. \n\nA co-worker of mine, who happened to be a 9/11 Truther before that was a term, was all hyped up on the upcoming ER for Amgen. He went around the office on a manic high, telling everyone to buy short term OTM call options - or as we refer to them around these parts, FDs. \n\nAs part of our retirement plans, we each had Fidelity brokerage accounts. To enable options trading, however, you had to call Fidelity and answer questions about your level of financial smarts and how much money you had. The correct answers were, of course \"genius level\" and \"shitloads.\" I answered truthfully. My other coworkers did not. They got to options trading enabled. I did not.\n\nAmgen beat and some of these guys landed 8 baggers. My own officemate made $50k and promptly took his family to Disneyland. As you can imagine, I was dismayed that I missed out.\n\nFor the next few months, chasing the next big trade was all the rage, and our team could hardly get anything done. I got my account upgraded by answering the questions correctly, but every play the group made after Amgen was a loser. Because I never had that thrill of victory, I quickly lost interest, but the temptation to recapture those initial gains captivated some of the other guys. As the losses racked up, the trading group got smaller and smaller, eventually distilling down to the most degenerate off talking in the corner, the crazy Truther mumbling his false prophesies to his last few disciples. I lost about $1000 – which was no small change at that time in my life – but I know that some of the guys lost a lot more chasing that high.\n\nThat’s still better than the snake oil the retail investment crowd is selling.\n\n&amp;#x200B;\n\nFor any market at any given time, Boggleheads and r/investing will tell you to just keep putting money in, no matter how badly you are getting fucked.\n\n*“7% YoY in the market!”* \n\n*“The greatest force in the universe is compound interest!”*\n\n*“If you hold for the long term, you don’t have to worry about volatility!”*\n\nHere’s the cold truth: the life advice Boomers give out is fucking outdated, designed for an analog world created by a Greatest Generation that coddled them, and that includes their financial advice as well.\n\nI am from the “[Oregon Trail Generation](https://socialmediaweek.org/blog/2015/04/oregon-trail-generation/)”, the last slice of GenX that actually grew up with computers. We are the cohort that witnessed the death of the American Middle Class that the Internet Age and Globalization, entering the workforce just as the dot-com bubble finally put it out of its misery.\n\nWhen I was 3, my grandfather retired from Boeing after 35 years. They gave him a platinum plated set of draftsman’s tools, a brass desk clock and a lifelong pension.\n\nWhen I was 19, my girlfriend’s dad was a consultant for Boeing. His job was to dig up dirt on upcoming retirees so they could be fired to deprive them of that pension.\n\nI did the *thing,* that good old American Dream – marriage, house, car, kids. I did what the “experts” tell you to do: save a slice of each paycheck for retirement, invest in a college plan, buy a house as a solid investment. \n\nHere I am barely middle-aged, and I have worked through three major financial crises since I entered the workforce.\n\nI’ve chased a runaway housing market, lowering my parameters every month because the prices kept rising faster than I could make for a down payment.\n\nTwice, I have had my retirement account fleeced, then had to draw down what was left to keep a roof over my head - paying a penalty to do so. \n\nI have been so upside down on a mortgage I’ve considered burning the house down.\n\nSo I am here to tell you firsthand that *Save, Buy, Hold and Diversify* will not help you when the whole market collapses and you find yourself in need of that money, that a house is just an investment that you can live in while it drops in value, and that *Dollar Cost Averaging* is another way of saying *Getting Cucked.*\n\nI say, if you are going to make or lose 50% in the next 10 years, you may as well make or lose that 50% in the next 10 *hours.* \n\n&amp;#x200B;\n\nIn some ways, younger Millennials and Zoomers are better equipped to face these facts than us older folks. If you came of age during the GFC or later, you understand that the game is rigged. All that bailout money is moving around the market while you are struggling to make minimum wage in the Uber Eats gig economy. Unlike those of us who grew up in more stable times, you know in your bones the halcyon days - the ones you've only ever heard about - about are never coming back. \n\nNot for everybody, at any rate.\n\nSo enters RobinHood, and it drives the financial pundits absolutely berserk. Who are these fucking kids YOLOing on HTZ? Don’t they know they are supposed to be investing that money into a passive index fund, or even better, one of those retirement-date funds with the massive expense ratios? It’s fucking up the game for the rest of us! \n\nI have traded options on and off for years in the hopes of making a little pocket money. Fact is, when commissions were $8-$20 per trade (plus a fee per contract), there was no way a small-time retail investor could participate meaningfully. With free or no commissions, the calculus has changed, lowering the bar of entry for smaller investors who can enter and exit a position at any time with only the bid-ask spread the main concern.\n\nBoomers created a monster, and they have only themselves to blame.\n\n&amp;#x200B;\n\nLike many of you, when March hit, I jumped in to puts and lost a bunch of money. This is because I was using an old way of thinking about options, the only one available to small-time retail traders just a few years ago: “I hope that this security makes a huge break in a particular direction.” \n\nAfter this loss and subsequent reflection, I determined that the money was there to be had, just that I was taking the wrong approach. I developed a new strategy, one that takes advantage of the simple fact that I can enter and exit a position without significant commission costs. I began to diversify my targets, and enter smaller positions on those targets, so that I didn’t have everything riding on one or two plays. I developed exit strategies - and followed them! – so that I could take my wins or cut my losses quickly and move on to the next trade. \n\nAnd most importantly, I made it a point to withdraw my gains, if any, at the end of every week.\n\nSince April, I have executed no less than 20 trades per week if you count option expiry. In 15 weeks, I have doubled my account value. Not because of some one-off spectacular play or because I’ve been a bull a bull market. In fact, I’m a bear, but using a pretty neutral strategy. I doubled my money because I adapted to this new trading climate, found what works for me, and simply stuck to it.\n\nDo I think that makes me some some sort of fucking genius? Absolutely not. I’ve made some smart, conservative plays that turned really goddamned sour. I’ve made some truly retarded plays that turned out great. I’ve had good weeks, bad weeks, and weeks that amounted to an incredibly stressful waste of time. I still make a bunch of mistakes - weekly, if not daily. \n\nI am still prepared – waiting, even – for my whole account to get wiped out due to a cacophony of bad plays. In the end, these are all gut decisions. Do I feel good about this? For each of them, only time reveals if I am right.\n\nBut if I have taken one thing away from what I have learned so far this year, it is this: *anybody can make rent money in the equities market now*. You do not have to have a massive account to overcome the burden of commissions, or have a huge investment in dividend stocks to realize a gains-based income. And thank God for that, because the job market is not going to save you.\n\n&amp;#x200B;\n\nI know the gain porn here is enough to make a man drool, and the loss porn is enough to make his balls retract into his stomach. Just understand those are always one-sided directional plays. It’s all-in on a single ticker, a true YOLO, not unlike putting it on black at the roulette table. It’s easy to get caught up looking at the massive gains and get stars in your eyes.\n\nBut forget the lambo and the gold-plated yacht for a moment and consider something more immediate, such as: “could I pay this month’s phone bill with my gains?” With the money you can pare off into a brokerage account, is it possible to avoid spending the the money you make doing whatever it is you do for someone else and make your phone service “free”?\n\nFor example, if you have $1000 and you make a reasonably conservative play with an exit strategy of $100 gain and $100 loss (such as a deep OTM 45DTE bull credit spread on a decent stock that’s been beaten up recently, with a hard exit 21DTE), the likelihood is very high. It is not guaranteed – you may end up down $100 from where you started. But what *is* guaranteed is that you will have to spend 8 hours flipping burgers or whatever at $12.50 an hour to make that $100 if you don't. (Yes, I know, *taxes –* the point still stands).\n\nWhen you finally get to take that $100 out and pay the phone bill with it, it becomes very, very real. \n\nImagine getting to a point where your trading gains pay for the things you *need*, so you can spend the money you earn with your blood sweat and tears on the things you *want.*\n\nThis is what it means to have a “S.M.A.R.T.” goal – small, measurable, achievable, realistic and time-sensitive. When you conform your efforts to translate into something small yet meaningful to your life, it changes the perspective.\n\nBut even if you decide to take your bi-weekly retirement contribution and YOLO it on MU FDs, you’ve got just as much of a chance of coming ahead with that as you do giving it to Mr. Market to hold for the next 20 years.\n\nBoomers will tell you “most day traders lose money!” First, “day trader” is a specific term. But that aside, it is also true most businesses fail in the first year. In both cases, people get burned, give up and go back to what they know. They fail to plan, they fail to learn from experience, and they fail to persevere. \n\nThis is not an appeal to “not be average” nor to keep “chasing bad money with good” - just to keep trying. Set your goals, manage your risk, hone your successes, and learn from your failures.\n\nAt no other time in history has it been possible for the average Joe to participate in the equities market with so little friction as commission-free mobile trading, and with so much leverage as weekly options. I know, because I’m old enough to remember when stock quotes were in the weekly paper, and they were registered in one-eighths of a dollar.\n\n&amp;#x200B;\n\n**TL,DR; T**o Hell with the haters like Cramer and his ilk. Keep learning and growing and trying to rake in tendies. The lambo isn’t the goal - *financial freedom* is. An Ally savings account and a shit job the boss is trying his damnedest to offshore ain’t gonna get you there. We live in a Merchant Republic awash in wealth, and you have the right – the obligation, even - to participate. Go get your fucking slice.\n\nI love you retards.",
        "subreddit": "wallstreetbets",
        "title": "Why YOLO is better than Boggle",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i5mgqn/why_yolo_is_better_than_boggle/",
        "created": 1596864266.0
    },
    {
        "author": "PancakeNips",
        "created_utc": 1597269463,
        "id": "i8n7e9",
        "num_comments": 262,
        "num_crossposts": 0,
        "selftext": "Lend me thy ears brethren. It appears there is a lot of discussion around corn lately... I did corporate finance for 7 years before burning out and left my office on the 32nd floor to become a wheat/corn/bean farmer. Happy to answer any questions you may have regarding input costs / growing / marketing corn in the real world.",
        "subreddit": "wallstreetbets",
        "title": "I am a former corp finance turned corn farmer AMA",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i8n7e9/i_am_a_former_corp_finance_turned_corn_farmer_ama/",
        "created": 1597298263.0
    },
    {
        "author": "Dougyparker",
        "created_utc": 1597871056,
        "id": "icwedw",
        "num_comments": 261,
        "num_crossposts": 0,
        "selftext": "That said, I am 100% self-trained through trial and error. At this late stage I'm kind of interested to see if I could learn anything new. What resources can anybody recommend?",
        "subreddit": "options",
        "title": "I've been trading options for a couple decades and much prefer it to stocks because of its risk reward ratio and simply because I actually make money with options, not so much with stocks.",
        "url": "https://www.reddit.com/r/options/comments/icwedw/ive_been_trading_options_for_a_couple_decades_and/",
        "created": 1597899856.0
    },
    {
        "author": "spl1sh",
        "created_utc": 1597604861,
        "id": "iaya9g",
        "num_comments": 261,
        "num_crossposts": 0,
        "selftext": "For some reason alot of retards here think that Nvidia is just some company that just makes graphics cards for PC basement dwellers and that it's overvalued. \n\nIt's not overvalued at all and it will continue to grow and prosper.\n\n1) Nvidia is heavily invested in Artificial Intelligence, and will have a whole ONE WEEK event showcasing their AI technology the week right after earnings. \nhttps://www.nvidia.com/en-us/events/siggraph/?ncid=so-twit-22731#cid=pv10_so-twit_en-us\n\nThey also are heavily invested in self driving cars. \nhttps://www.nvidia.com/en-us/self-driving-cars/\n\nTheir AI technology has also helped greatly with COVID \nhttps://blogs.nvidia.com/blog/tag/covid-19/\n\n2) They are heavily invested in data centers, and the sales for their data centers are expected to surpass gaming for the first time.\nhttps://www.nvidia.com/en-us/data-center/products/#:~:text=NVIDIA%20Data%20Center%20GPUs,performance%20computing%20(HPC)%20workloads.\n\nhttps://www.marketwatch.com/story/nvidia-data-center-sales-expected-to-surpass-gaming-for-first-time-2020-08-14\n\nThey developed the most powerful industrial computer.\nhttps://blogs.nvidia.com/blog/2020/08/14/making-selene-pandemic-ai/\n\n3) Possible acquisition of ARM. Just google it, literally everyone is talking about how they are the front runner to acquire this huge company.  If they do they will become the Tesla of the chip world\n\n4) 7 price targets raised from 8/10 to 8/14, most of them to 500+\nhttps://www.marketbeat.com/stocks/NASDAQ/NVDA/price-target/\n\n5) New graphics cards releasing September 1st. Check out their twitter and how much they are hyping it up on their website. \nhttps://www.nvidia.com/en-us/geforce/special-event/\n\nThe info was already leaked by Micron and these graphics cards will be very good. \n\nAlso with new consoles coming out, means more games that are graphically demanding. This will lead to a huge increase in sales in graphics cards due to people wanting to upgrade to next gen.\n\nSeriously how can they not destroy the guidance with all this bright future for this company.",
        "subreddit": "wallstreetbets",
        "title": "Why NVDA will go to 500+ (FULL DD)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iaya9g/why_nvda_will_go_to_500_full_dd/",
        "created": 1597633661.0
    },
    {
        "author": "glcorso",
        "created_utc": 1597153206,
        "id": "i7s023",
        "num_comments": 260,
        "num_crossposts": 0,
        "selftext": "My parents bought their house for 126k  in 1985. The house now is worth 600k. \n\nIf I invested 126k into the Dow Jones in 1985 it was trading at 1500... Now it's at 28000.. more than 18x it's value. The investment would be worth 2.5 million dollars! \n\nNot to mention the price of renovations, mortgage interest rates, taxes..etc ... \n\n\nWhy the hell should I buy a house as an investment??? Stocks require 0 work and I can liquidate them with a push of a button.",
        "subreddit": "investing",
        "title": "Explain to me how real estate is a better investment than stocks",
        "url": "https://www.reddit.com/r/investing/comments/i7s023/explain_to_me_how_real_estate_is_a_better/",
        "created": 1597182006.0
    },
    {
        "author": "due11",
        "created_utc": 1597681781,
        "id": "ibhelh",
        "num_comments": 258,
        "num_crossposts": 0,
        "selftext": "Previous 52-week ATH was $1794.99 and today it went over that. There is still massive room for growth with the split, battery day and potential inclusion to S&amp;P 500 coming up.",
        "subreddit": "stocks",
        "title": "TSLA broke 52-week ATH today",
        "url": "https://www.reddit.com/r/stocks/comments/ibhelh/tsla_broke_52week_ath_today/",
        "created": 1597710581.0
    },
    {
        "author": "DigiFreeze",
        "created_utc": 1597846040,
        "id": "icoa3f",
        "num_comments": 257,
        "num_crossposts": 0,
        "selftext": "Hey all, \n\nDuring lockdown, I realized there was no easy way to intuitively understand option trades. So I decided to make one.\n\nIt's called Waffles 🧇. Waffles is a free tool that gives anyone the ability to intuitively build and graphically analyze option strategies on any U.S. ticker. I'm excited to get this out into the world. It should be up and running by this weekend.\n\nManually building trades will be a thing of the past. With Waffles, select the strategy you would like to build and let Waffles do the work for you. That's it. What used to take know-how, time and tedious work and now takes a click.\n\n[Toggling through pre-built strategies](https://i.redd.it/qlfgxd7cuyh51.gif)\n\nRepositioning and customizing trades is as easy as building them. Even reposition the trade using keyboard shortcuts 🔥. I hope that quickly building and repositioning strategies will lead to some interesting discoveries from you 😊.\n\nReal-time feedback on factors such as implied volatility and time to expiration. Now you can see that vol crush before it happens IRL 😅.  \n\n[increasing and decreasing imp vol](https://i.redd.it/4wkh5lpeuyh51.gif)",
        "subreddit": "options",
        "title": "Building a free tool to intuitively build and graphically analyze option trades - Waffles",
        "url": "https://www.reddit.com/r/options/comments/icoa3f/building_a_free_tool_to_intuitively_build_and/",
        "created": 1597874840.0
    },
    {
        "author": "aerrreaa",
        "created_utc": 1596382769,
        "id": "i2e1qb",
        "num_comments": 256,
        "num_crossposts": 0,
        "selftext": "Look my retard brothers who already have a gambling addiction from the $700 you made in a week on your $1,000 account,\n\nI see people crying every day when they've missed out on these triple baggers, like on AMD or Apple. People who are making 300% gains on their accounts from weeklies are the same people you see one month later with a blown up account and no tendies crying \"my peepee real small. Don't do what I do! Wife real mad. Drank piss for nothing!\" They have that massive spike on their Robinhood chart from 4k to 40k and then over the next two weeks down to $600.\n\nYou can make double baggers over and over but once you hit a 90% loss or more nothing's going to matter. If you're the type of retarded autist who will not takes gains at 50% on weeklies and let it ride to 300%, you're the type of retarded autist who won't cut your losses at 20% and let it ride to 90% and ask \"I'm down 90% on Amazon calls, should I hold?\"\n\nI'm talking about options expiring in less than a few weeks. Not someone with options expiring in 6 months whose balls deep in a mattress company named after a fuckin color whose clearly done their DD. Those you can let run 300%. But that's not you, you can't afford those options, you don't do DD and you buy weeklies.\n\nDon't fall for the FOMO. Consistent gains and cutting losses short is what will make you continuously profitable - not a few lucky rolls that make you feel smart even though you think an iron condor has to do with the Soviet Union.\n\nSince I'll get bitched at if I don't post these:\n\nSpy 8/7 330c\n\nAmazon 8/21 3200c",
        "subreddit": "wallstreetbets",
        "title": "Don't follow the FOMO - why those 300% weekly gains aren't healthy",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i2e1qb/dont_follow_the_fomo_why_those_300_weekly_gains/",
        "created": 1596411569.0
    },
    {
        "author": "HSG_Messi",
        "created_utc": 1596728560,
        "id": "i4u39h",
        "num_comments": 251,
        "num_crossposts": 0,
        "selftext": "Reports are circulating  that Microsoft is looking to purchase Tick Tock outright. Is this really a good business move on their part? Could we really see a buy the hype sell the news with MSFT? I mean I know MSFT is typically seen as one of the safest plays and a solid long term hold but is the expectation that this news could shoot it past say 220 with the possibility of a large crash if the deal turns out to be way overpaid or MSFT gets in over their heads trying to run it?\n\nCurious on everyone's stance with this.",
        "subreddit": "stocks",
        "title": "MSFT looking to purchase all of Tick Tock, not just US section.",
        "url": "https://www.reddit.com/r/stocks/comments/i4u39h/msft_looking_to_purchase_all_of_tick_tock_not/",
        "created": 1596757360.0
    },
    {
        "author": "mbash22",
        "created_utc": 1596734419,
        "id": "i4vxi6",
        "num_comments": 248,
        "num_crossposts": 0,
        "selftext": "I only own ETFs right now as I feel like I don't know stocks enough to invest in one stock from another but what is the take on AAPL long term. Is it still a good buy?",
        "subreddit": "StockMarket",
        "title": "$AAPL - miss the boat or is it not too late",
        "url": "https://www.reddit.com/r/StockMarket/comments/i4vxi6/aapl_miss_the_boat_or_is_it_not_too_late/",
        "created": 1596763219.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1596457031,
        "id": "i2vzss",
        "num_comments": 247,
        "num_crossposts": 0,
        "selftext": "If your question is \"I have $10,000, what do I do?\" or other \"advice for my personal situation\" questions. If you are going to ask how to invest you should include relevant information, such as the following:\n\n* How old are you?\n* Are you employed/making income? How much?\n* What are your objectives with this money? (buy a house? Retirement savings?)\n* What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know its 100% safe?)\n* What are you current holdings? (Do you already have exposure to specific funds and sectors?)\n* Any other assets? House paid off? Cars? Expensive significant other?\n* What is your time horizon? Do you need this money next month? Next 20yrs?\n* Any big debts?\n* Any other relevant financial information will be useful to give you a proper answer.\n\nPlease consider consulting our FAQ first - https://www.reddit.com/r/investing/wiki/faq \n\nBe aware that these answers are just opinions of Redditors and should be used as a starting point for your research. You should strongly consider seeing a registered financial rep before making any financial decisions!",
        "subreddit": "investing",
        "title": "Daily Advice Thread - All basic help or advice questions must be posted here.",
        "url": "https://www.reddit.com/r/investing/comments/i2vzss/daily_advice_thread_all_basic_help_or_advice/",
        "created": 1596485831.0
    },
    {
        "author": "timeisadrug",
        "created_utc": 1597216357,
        "id": "i898gh",
        "num_comments": 247,
        "num_crossposts": 0,
        "selftext": "Think about it: prices drop when people sell because they're worried about the price falling, which is the fear of everyone else selling and them being left as bag holders. \n\nIf everyone is a bull, they don't sell, the market doesn't go down. If we only buy then prices go up and we all make money. \n\nLiterally can't go tits up.",
        "subreddit": "wallstreetbets",
        "title": "Selling should be illegal to prevent the market going down",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i898gh/selling_should_be_illegal_to_prevent_the_market/",
        "created": 1597245157.0
    },
    {
        "author": "Dudebroha1",
        "created_utc": 1598134493,
        "id": "iermr2",
        "num_comments": 243,
        "num_crossposts": 0,
        "selftext": "SLV gang, WSB, plebs, gather around for the biggest opportunity of your life..\n\nRequired viewing: https://youtu.be/4F6jYlOePGU\n\nThere are 158,600 September COMEX contracts set to be delivered September 1st. Each contract represents 5000 Oz of Silver. This equates to 750Million+ ounces of physical silver expected to be delivered in September from a single company. \n\n-800M Oz is the total amount of silver mined worldwide every year.\n-JPM owns COMEX and manipulates the price of silver, they don’t have the physical to deliver\n-JPM has continually been shorting silver to make people sell their contracts instead of accepting physical for this record delivery.\n-yet 28.6k contracts have been bought in the last two weeks\n\nWhat do you think will happen to the price of silver when COMEX cannot deliver the silver they sold?\n\nThis really is it..if you don’t have physical silver, or at least yolo on SLV contracts, you lack awareness, at the very least.\n\nThe one question I have for you all, is what should I do with my SLV contracts? Should I sell them and buy more physical? Or so I wait for the moonshot and accept delivery(SLV doesn’t deliver physical silver, it is a stock)? \n\nThanks plebs for reading, and thank you SLV gang for showing me the way.\n\nBONUS VIDEO: (the most patriotic song of the century, sung by the silver gawd himself, Bix Weir) https://youtu.be/ZApnHrYLPiQ\n\n11/20 $38c (4)\n3/15 $38c (23)\n\nPhysical: (9) 2oz bars, 1 kilo of .999 shavings, and 5 AE’s\n\nThanks. Picking out the Tesla I want to buy in October. \n\nAlso, untreatable autism and thus I’m not responsible for the shit I say or type. Thanks newbs.",
        "subreddit": "wallstreetbets",
        "title": "158k Sept. COMEX contracts due in 6 days",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iermr2/158k_sept_comex_contracts_due_in_6_days/",
        "created": 1598163293.0
    },
    {
        "author": "-tangentially",
        "created_utc": 1597587404,
        "id": "iat20w",
        "num_comments": 242,
        "num_crossposts": 0,
        "selftext": "You’ve probably seen a rising trend of bullish posts about Nvidia recently, whether it’s about recent acquisitions being included in revenue, its management, or the semiconductor industry in general.\n\nYesterday, Evening Standard reported that $NVDA has locked in a takeover of Arm Ltd. from SoftBank for a reported 40 billion.\n\nThe reason this is important is that Arm owns instructions-set architectures (ISAs) for the chips within nearly every smartphone, along with a handful of other products. Usually, this isn’t an issue, since SoftBank would sell the rights to produce these chips to Apple, Qualcomm, and others for a fee. \n\n$NVDA, unlike SoftBank, is an actual semiconductor company. They could potentially limit access to their ISAs so that $NVDA can become the sole producer of those chips. Or, due to SoftBank being in the sinosphere and $NVDA being American, potential tensions could arise from the recent economic sanctions.\n\nEither way, considering that the deal is essentially locked in, $NVDA is flying straight to tendie town. Arm is a powerful player in the semiconductor industry, and its acquisition by $NVDA demonstrates that the company is making big moves to become more prevalent. $NVDA could theoretically lockdown a subsector of the semiconductor market by restricting access to chips under Arm’s ISA. And if the Don requests $NVDA restrict Chinese access to the ISAs, you can bet that it will get a fucking BOATLOAD of government subsidies.\n\nTL;DR $NVDA 520c 9/18",
        "subreddit": "wallstreetbets",
        "title": "$NVDA is silently becoming the next tech powerhouse.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iat20w/nvda_is_silently_becoming_the_next_tech_powerhouse/",
        "created": 1597616204.0
    },
    {
        "author": "SillyGrizzles",
        "created_utc": 1596580290,
        "id": "i3td0s",
        "num_comments": 241,
        "num_crossposts": 0,
        "selftext": "Silver (SLV) and Gold (GLD) have both had incredible rallies over the last three months. This has been driven mainly by uncertainty hedges and currency hedges (people worried about the world and people worried about the dollar). While the state of the world is definitely reason enough to jump into safe haven materials, Gold and Silver are both inexorably linked to the strength of the dollar. **AS LONG AS THE DOLLAR KEEPS CRASHING GOLD AND SILVER WILL RALLY.** \n\nFirst we need to talk about why the dollar will continue to crash and to what levels it will fall. The Dollar's strength is linked to (basically) two things: (1) Supply and (2) Demand. While other factors can move the dollar in the short-term, over long-term trends these two basic economic principles are responsible for the dollar's value. \n\n1. Supply: The Fed is printing shit ton of money. Like a shit ton of money. The Fed balance sheet has expanded to over $7 Trillion, and it's likely to go higher over the next year. This is because our economy is fueled by debt, and in order to pay back that debt, the Fed is forced to print more and purchase assets, so people/companies don't default on their obligations. This creates a sort of Zombie economy (kinda like what we had from 2008-2020) where the stock market soars, but the income gap gets larger. I don't want to get into any of that, but the point is the Fed is going to keep printing, because it's the only way to keep people from defaulting. If people are allowed to default on their obligations, we'll have a major financial crisis (like 2008). \n2. Consequences: The consequences of all this printing is that eventually it will devalue our currency. That being said, we're in no danger of inflation in the short-term. Because the economy is so in the shitter, we have massive deflationary forces, so printing money outright (increasing money supply) isn't going to devalue the dollar. Instead, the dollar will become devalued for reason number 2...\n3. Demand: The Fed is buying bonds and keeping interests rates at zero. This essentially guarantees the stock market wont crash and encourages people to borrow. It also means that fixed-income investments will basically yield nothing. So, where can people put their money?\n4. Consequences: The only real place is the stock market or futures market. With incredibly low marginal costs (borrowing money is cheap), the Fed has given the green light for people to speculate and buy equities. **This forces people out of Cash and into Stocks; therefore, demand for the dollar falls.**\n5. Putting this all together: With the long-term fear that money printing will devalue the currency, and the short-term pressure to get out of cash and into the market (not to mention economic uncertainty, credit worthiness, pandemic fears, and election nonsense) we get a perfect storm of dollar weakness. So how does this all look:\n\nThis is a graph of the Dollar Index (DXY) over the last 3-months:\n\n[DXY Index](https://preview.redd.it/zm8v2a7b22f51.png?width=961&amp;format=png&amp;auto=webp&amp;s=730be8b6938dc27ef6408d94f512785e1ed55e9e)\n\nThe dollar has depreciated nearly 7%. This has led to the meteoric rise in Gold and Silver over the same time frame.\n\nGLD:\n\n[GLD Index](https://preview.redd.it/um7rmu9r22f51.png?width=965&amp;format=png&amp;auto=webp&amp;s=86c9876ab4439bd8b5ae8c8bdfdae0f914d85338)\n\nGLD has increased nearly 20%, breaking through its all time high of $185 (2011).\n\nSLV:\n\n[SLV Index](https://preview.redd.it/clxdj4vs22f51.png?width=959&amp;format=png&amp;auto=webp&amp;s=ae01448381860e30c993b482714493e472b66d68)\n\n SLV has increased over 33% from its local high of $18 (2019).\n\n&amp;#x200B;\n\nWhile these movements might look crazy and might make you think you've missed the train, you're wrong. Gold and Silver (especially Silver) have a lot more room to run. This is because the dollar still has a long way to go down. \n\n[DXY Long-Term Look](https://preview.redd.it/rensqvn842f51.png?width=1314&amp;format=png&amp;auto=webp&amp;s=caad130adc90bf7d0f7e78ea259b2a76df8b610d)\n\nIn 2018 the DXY hit \\~$89 and currently it's sitting at $93.35, so in just the short-term it's likely to retest that low. That represents another \\~4.6% decline in the dollar. The 7% decline in the DXY so far has created a 20% rally in GLD and a 30%+ rally in SLV, so just off the likely movement of the Dollar, GLD and SLV should rally an additional \\~14% and \\~20% respectively (if they follow the same ratio of movement). However, in the medium-term, the Dollar will likely trend even lower. The next levels of support are $80 and $73 which get us into 2008/2011 territory. The amount of stimulus and printing being put into the market today is a lot bigger than it was back then, so I wouldn't be surprised if we went back down to those levels.  \n\nFinally, how will Gold and Silver rally given this trend in the Dollar. Well, GLD already took out its ATH of $185 (2011). The Dollar still has a long way to go down, and people are just starting to pay attention to GLD again, so we might easily see GLD reaching $295 by end of 2021. In the last GLD rally the metal moved up 2.69 times in 3-years. Currently, we've only seen the metal rally 69% (heh) over the last \\~2-years. Based on the historical comparison, GLD should easily hit $220 by EOY. I have no doubt there could be a pullback, but given the fact that we're entering a pivotal election, I think GLD will rally at least until the election. \n\n[GLD 2008-2011](https://preview.redd.it/gsbe3vmj82f51.png?width=1461&amp;format=png&amp;auto=webp&amp;s=bd79832f785bf0406b169e75267be256ba3d0f1b)\n\n[GLD 2018-Today](https://preview.redd.it/efv3x2wl82f51.png?width=1462&amp;format=png&amp;auto=webp&amp;s=e3bc94e48eadd64159dd71435e2930d32a3202ea)\n\nSilver is even more exciting. Looking at historical charts of SLV we see that the metal hit a high of $48 in 2011. In the 1980's it went even higher, hitting a record $118. The current price is $24, which means if it retests it's 2008 high's, you can still get a 100% gain from the current price. **I am willing to bet my mother's kidney's on the fact that SLV will hit $30 by EOY.** I'm also pretty confident that it will retest it's local high of $48 sometime in 2021. The best part is, the options on SLV are so fucking cheap it'll make you cream a river of tendies. \n\n[SLV 2008-Today](https://preview.redd.it/ufntjwg2a2f51.png?width=1445&amp;format=png&amp;auto=webp&amp;s=e9c70b130c17d7bbd4076e4e0c42d97361e93ec9)\n\nBoy's I cant stress this enough. Silver and Gold are only just beginning to rally, and there's a really really really good chance SLV goes parabolic. GLD is a much safer bet if you're trying to buy options (just cause of liquidity and size) but the upside potential of SLV is crazy good. Don't miss this shit. It's the easiest money you'll ever make outside of AMZN calls. \n\nKeep buying GLD until it hits around $295 (after that the historical move doesn't hold) and keep buying SLV until $50. For both SLV and GLD that could take between 6-months to 1-year. \n\nTL:DR\n\nGLD Vertical Spread 191/193 September 30th  Expiration.\n\nSLV Vertical Spread 27.5/29 October 16th Expiration.",
        "subreddit": "wallstreetbets",
        "title": "Silver and Gold are both going to go parabolic. Entry points and Exit points + Timeframe.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i3td0s/silver_and_gold_are_both_going_to_go_parabolic/",
        "created": 1596609090.0
    },
    {
        "author": "Aumatity",
        "created_utc": 1598101091,
        "id": "iehz5j",
        "num_comments": 241,
        "num_crossposts": 0,
        "selftext": "I want to be like that grandfather earlier this week and invest 7k shares into one company then forget about it until the kid goes to college. \n\nMy child just turned one so that gives me an approx 17 year runway. What should I buy?\n\nWeed stocks? TSLA (yea right I can’t afford that much even after split to 420) Kodak or another meme stock\n\n100% serious",
        "subreddit": "wallstreetbets",
        "title": "Want to buy 7000 shares of a stock for my kids college fund",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iehz5j/want_to_buy_7000_shares_of_a_stock_for_my_kids/",
        "created": 1598129891.0
    },
    {
        "author": "RoyalFlygon",
        "created_utc": 1597861761,
        "id": "ictcgm",
        "num_comments": 238,
        "num_crossposts": 0,
        "selftext": "It’s one of the most popular stocks on RH and I just don’t get it, tbh.",
        "subreddit": "RobinHood",
        "title": "Why do people still buy Ford when all it has done for years is go down?",
        "url": "https://www.reddit.com/r/RobinHood/comments/ictcgm/why_do_people_still_buy_ford_when_all_it_has_done/",
        "created": 1597890561.0
    },
    {
        "author": "big-sexy89",
        "created_utc": 1597924043,
        "id": "id8rpc",
        "num_comments": 238,
        "num_crossposts": 0,
        "selftext": "What NON TECH stocks under $100.00 are you holding long term?  I’m pretty tech heavy and want to spread it out more.  Companies that are committed to growth in their early stages. Looking to set it and forget it(although I wouldn’t be able to fight the urge to check it out regularly lol).",
        "subreddit": "stocks",
        "title": "What are your best non tech long term hold stocks under $100.00",
        "url": "https://www.reddit.com/r/stocks/comments/id8rpc/what_are_your_best_non_tech_long_term_hold_stocks/",
        "created": 1597952843.0
    },
    {
        "author": "FreshTatarSauce",
        "created_utc": 1598155424,
        "id": "iewqhw",
        "num_comments": 237,
        "num_crossposts": 0,
        "selftext": "\\#Introduction\n\n&amp;#x200B;\n\nHi all, it's your friendly neighborhood Tatar Sauce here with the first episode of my Options series. My hope is to help some of you autistic fucks to not blow up your accounts and learn to manage risk better. Each week I will be touching on a new topic that will hopefully help some of you understand the intricacies of options trading, with each lesson building upon previous lessons. Some topics will include different options strategies, risk/reward balance, and the psychology of trading. If you want me to touch on a particular topic, leave a comment below. If you want to call me a retard, leave a comment below.\n\nI do not sell a program or anything like that, I'm just a dude that loves trading and managing an account.\n\n&amp;#x200B;\n\nSo lets get into it. \n\n&amp;#x200B;\n\nImagine you just read some retarded DD on WSB. You're convinced that OP has shown you the way to Tendie Town, and all thats left for you to do is hop on your PRPL mattress, punch in a few coordinates, go to bed and wake up swimming in a sea of hunny mussy. Like most retards on this sub, you probably have a loose understanding of the Greeks and don't know the difference between a horizontal spread and that gesture your wife does when you invite your buddy C-Note over for poker. So what are your options? Naked calls baby!\n\nWell, I'm here to tell you that while naked calls do have a time and a place, it shouldn't be your go to. If you were one of the autistic fucks posting loss porn because you bought a bunch of naked calls on PRPL, you need this more than anyone. So buckle up, grab a whisky, and let ME lead you to Tendie Town (no mattress required).\n\n&amp;#x200B;\n\n\\#**So what do I do now?**\n\n&amp;#x200B;\n\nVertical spreads baby. Next week we will dive deep into why vertical spreads offer a better risk/reward profile, but first we need to understand the Greeks and what they mean for your option contract. So lets dig in.  \n\n\n\\#**Delta**\n\n&amp;#x200B;\n\n**Contrary to popular belief, delta does NOT mean the percent chance your option will expire ITM.** Delta is simply the amount of money your contract will move in accordance to every dollar the underling moves. In other words, if you bought your call for $2.00 with a .3 delta. and the price moves up $1, it is now worth $2.30. Conversely, if it moves down $1, it is worth $1.70. This is a simplistic way of looking at it, as other things can affect delta such as fundamentals and volatility, but that is what it means.  \n\n\nDelta is affected most by how close the strike price is to the current price of the underling. Farther OTM options have less delta, farther ITM options have more, and ATM is typically around .5. Delta is not heavily affected by DTE. Knowing delta is important in measuring risk/reward because it will tell you how much the value the option will move for or against you as the underling moves.  \n\n\n**#Gamma**\n\n&amp;#x200B;\n\n**If delta is the speed in which the price moves, gamma is the acceleration.** What gamma measures is how much delta changes after each subsequent dollar change. Here is an example to illustrate:  \n\n\n\\&gt; Buy option XYZ 50c with .3 delta and .01 gamma for $2.00\n\n\\&gt; Price moves up $1\n\n\\&gt; Call is worth $2.30, new delta value is now .31\n\n(Now lets say gamma was .15)\n\n\\&gt; Buy option XYZ 50c with .3 delta and .15 gamma for $2.00\n\n\\&gt; Price moves up another $1\n\n\\&gt; Call is worth $2.30, new delta is .45\n\n&amp;#x200B;\n\nMy example is again a simplistic way of looking at it, but don't miss the point- gamma will accelerate the price change in your option as the underling changes and is a important factor in determining risk/reward.\n\n&amp;#x200B;\n\nUnlike delta, gamma is heavily affected by DTE, and gamma increases by a lot as you get closer to expiry, and is much smaller the farther out you buy. It is not affected heavily by how ITM or OTM the option is (although there is a slight increase the closer you get to ATM).  \n\n\nThink of FD's as purchasing gamma, where a large move in your favor will yield exponential returns.  \n\n\n&amp;#x200B;\n\n**#Theta**\n\n&amp;#x200B;\n\n**Think of theta as the amount of money you have to spend per day to hold the contract, or the amount you get paid per day to sell one.** I like to think of theta as \"how much money I will lose per day if the underling trades sideways.\"\n\n&amp;#x200B;\n\nTheta is increased as you get closer to your expiry date. At about 30 DTE, theta begins to accelerate  faster. ATM strikes tend to have the most theta, where ITM strikes have enough intrinsic value that they arent affected as much and OTM strikes go for less premium so there is less value to eat.  \n\n\nI don't think you autistic fucks are dumb enough to need an example for this one. Most of you hold your contracts too long and know what theta burn is. NEXT!  \n\n\n**#Vega**\n\n&amp;#x200B;\n\n**Vega is the amount the underling moves in response to a 1% change in IV.** This is the reason behind the term \"IV crush.\" Vega is greater the farther out you purchase your option, and greater the closer it is to being ATM (while OTM options have a slightly higher vega than ITM, it's not by much).\n\n&amp;#x200B;\n\nI cannot stress this enough, **look at the vega and IV rank of the options you are buying if you want to play earnings!**  \n\n&amp;#x200B;\n\nIV rank takes the past 52 weeks of IV for the ticker and tells you what percentile its current IV is at.\n\n&amp;#x200B;\n\nHigh IV rank and vega is inherently more risky REGARDLESS of what the underling does! I'm tired of seeing you retards weeble wobble your way through posts asking why the fuck your option went down when the price moved in your favor. It's because you're retarded and don't know what you're doing.  \n\n\nHowever, vega can play in your favor if volatility increases. This can be a shrewd play if you catch a ticker a couple weeks before earning.  \n\n\n**#What about Rho?**\n\n&amp;#x200B;\n\nRho stands for red-headed orphan. Nobody cares about rho.\n\n&amp;#x200B;\n\n**#The different type of plays you can make using the Greeks**\n\n&amp;#x200B;\n\n**Believe it or not, there are more ways to play with options then \"hurr durr stonks go up.\"** Here are a few things you can do to leverage yourself and use each Greek to your advantage:  \n\n\nDelta: Purchasing delta is similar exposure to purchasing 100 shares of the underling, but for far less money and risk. It can be a great way to leverage yourself if you are looking to purchase the shares anyway and are okay paying the extra premium for the increased gains. IMO, this is a boomer play that someone makes if they don't want to tie up the capital short term but want the option to exercise long term. For example, AAPL 400c 1/15/21 goes for \\~$111. That is about 1/5 less money then purchasing 100 shares today and AAPL only has to go up like 13 bucks to break even. \n\n&amp;#x200B;\n\nGamma: Purchasing gamma is the thought behind an FD. Low risk, high reward, low chance of profit. The WSB special. I will try to get a day trade in every now and then if I see an opportunity, where I put a tight stop loss on and let it ride. **If you do this, look at the theta and set your stop loss at least that distance away from your purchase price so you don't get stopped out due to theta burn.**  \n\n\nTheta: You don't buy theta. You sell theta. Join r/thetagang for more info.  \n\n\nVega:  If you want to play the volatility of a stock, consider buying or selling vega. Some people use straddles a few weeks before earnings and capitalize on the increased volatility to increase their odds of success when they might not be sure how the market will respond to the earnings. Keep in mind that you will have to put up more premium for farther out DTE options, but if volatility goes up you would be surprised how much it will make your options move.\n\n&amp;#x200B;\n\nSo thats that. Learning the Greeks and learning what you're buying will help keep you from making a lot of rookie mistakes. Next week, I'm going to talk about spreads and why they offer a better risk/reward profile then naked options.  \n\n\n**TLDR:** Stop gambling and start trading.  \n\n\n**Positions:** DKNG 33/34/38/39 Iron Condor 8/28 - PENN 54p 8/28 - VXX 25/26c 8/28 Debit - AAPL 500/520c 9/4 Debit - RKT 27c 9/18 - RKT 26/30c 9/18 Debit - XRX 22c 9/18 - MU 42.5/47.5c 9/18 Debit - AAPL 560/580c 9/18 Debit - SPY 330/320p 9/25 Debit",
        "subreddit": "wallstreetbets",
        "title": "Options 101 Episode 1: An Introduction To The Series- All About Greeks!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iewqhw/options_101_episode_1_an_introduction_to_the/",
        "created": 1598184224.0
    },
    {
        "author": "EatMePlsDaddy",
        "created_utc": 1598122617,
        "id": "ieo6md",
        "num_comments": 236,
        "num_crossposts": 0,
        "selftext": "I have about 2000$ and I live in a very poor country, it took quite a while to get where I am so if I could earn like 10 dollars a day I on top of my day job I might legit not need to work at all. How can I do so? I started looking into the stock market a month ago and just recently actually started investing but I might need more guidance.",
        "subreddit": "StockMarket",
        "title": "Can I realistically make 10-15$ a day by trading stocks?",
        "url": "https://www.reddit.com/r/StockMarket/comments/ieo6md/can_i_realistically_make_1015_a_day_by_trading/",
        "created": 1598151417.0
    },
    {
        "author": "hydershykh",
        "created_utc": 1597033780,
        "id": "i6y7kl",
        "num_comments": 236,
        "num_crossposts": 0,
        "selftext": "A data scientist here. Recently developed a tool that analyzes options flow from the entire day to make short term predictions of 1-5 days. Wanted to share some of the alerts for the next week with you folks. Please let me know if this is something that everyone likes here and if I should continue it.\n\nThe tool is still new so please be careful with all the alerts. **I would recommend paper trading these for a few days and doing your own DD as well**.  The overall accuracy is around 60-70% which means it can make mistakes. Happy to talk more about how the tool works.\n\nBullish means the stock is expected to move up more than 1% from the  current  close at least 1 day in the next 1-5 days. Bearish means  the stock is expected to stay the same or go low in the next few  days. The definitions are a bit loose but the stock usually makes a decent amount in reality.\n\n# Bullish Alerts\n\n**$BABA**   \\- Bullish probability of 84.3%. This fell right at the 50 moving   average which usually acts as a support for a stock in uptrend ([https://i.imgur.com/zHVQEAV.png](https://i.imgur.com/zHVQEAV.png)).\n\n**$CHWY**   \\- Bullish probability of 75.1%. Again, a beautiful setup especially if   it falls on the support at $52 and starts to bounce back ([https://i.imgur.com/87PRrBI.png](https://i.imgur.com/87PRrBI.png))\n\n**$MSFT** \\- Bullish probability of 71.0%. As long as this stays above the support of $210, this is a good setup ([https://i.imgur.com/ap3wpn1.png](https://i.imgur.com/ap3wpn1.png)). Otherwise, it might fall down hard because of the gap.\n\n**$TWLO**   \\- Bullish probability of 67.2%. This is only a decent setup if it  stays  above the support of $245. Bad setup otherwise. However, the tool  is  bullish, so I have got to go with that. ([https://i.imgur.com/mBjDqeT.png](https://i.imgur.com/mBjDqeT.png))\n\n# Bearish Alerts\n\n**$SPCE**   \\- Bearish probability of 88%. This was predicted to be bearish about a   week ago and it has gone down a lot. Continue downward trend if it can   break the support at $17 ([https://i.imgur.com/jwH4yyu.png](https://i.imgur.com/jwH4yyu.png)) ([https://i.imgur.com/78hHgpw.png](https://i.imgur.com/78hHgpw.png))\n\n**$AAL** \\- Bearish probability of 87.5%. I **would be careful**   with this setup since the price  is forming a bullish triangle. If it   breaks the 13$ level, get out immediately as that is a good resistance   level ([https://i.imgur.com/vCnsdc9.png](https://i.imgur.com/vCnsdc9.png))\n\n**$SRNE**   \\- Bearish probability of 86.9%. This is the third alert from the tool   and I've failed twice with this alert. So I would encourage you not to   follow this. But I trust the tool and I think this is going to get down   at some time.\n\n**$JPM** \\- Bearish probability of 85.3%. This is a good setup if it touches the resistance and comes back from $99.7 level ([https://i.imgur.com/RCEvRes.png](https://i.imgur.com/RCEvRes.png))\n\n**If you don't like these alerts, please don't be a hater, just ignore them. They are not perfect and I know that.** \n\nHappy to chat more about how everything works. Please do let me know if this is something folks here would want on daily basis. Here is a spreadsheet that contains results from the week before last ([https://docs.google.com/spreadsheets/d/1fT2P9JKxmnyZFFXEOl9QWBsqAqzTwYi-UXSPJ2InECw/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1fT2P9JKxmnyZFFXEOl9QWBsqAqzTwYi-UXSPJ2InECw/edit?usp=sharing))",
        "subreddit": "options",
        "title": "Developed a Tool that Analyzes Options Flow to make Predictions | BABA, MSFT, SPCE, AAL, JPM",
        "url": "https://www.reddit.com/r/options/comments/i6y7kl/developed_a_tool_that_analyzes_options_flow_to/",
        "created": 1597062580.0
    },
    {
        "author": "Matous_Palecek",
        "created_utc": 1597428882,
        "id": "i9r5je",
        "num_comments": 232,
        "num_crossposts": 0,
        "selftext": "*I love researching quality information about interesting companies, however, it is hard to find those at the intersection of \"intriguing\" yet \"understandable to an outsider\" (this, unfortunately, rules out most of pharma).* \n\nFor example, I've really enjoyed following Tesla, as I've always been passionate about alternative sources of energy, and low-cost airlines, as I've been flying around Europe since I was only a few months old. Love Ryanair and Wizz (though I haven't actually invested in any of those two, but in a US low-cost airline instead). What's interesting to note, is that, usually, the more engaging the company, the better it has done for me financially. \n\n**Looking forward to your tips!**",
        "subreddit": "SecurityAnalysis",
        "title": "What's the most interesting company you're currently invested in?",
        "url": "https://www.reddit.com/r/SecurityAnalysis/comments/i9r5je/whats_the_most_interesting_company_youre/",
        "created": 1597457682.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1596701163,
        "id": "i4nq1m",
        "num_comments": 232,
        "num_crossposts": 0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on stock options, but if options aren't your thing then just ignore the theme and/or [post your arguments against options here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nRequired info to start understanding options:\n\n* [Call option Investopedia video](https://www.investopedia.com/terms/c/calloption.asp) basically a call option allows you to buy 100 shares of a stock at a certain price (strike price), but without the obligation to buy\n* [Put option Investopedia video](https://www.investopedia.com/terms/p/putoption.asp) a put option allows you to sell 100 shares of a stock at a certain price (strike price), but without the obligation to sell\n\nSee the following word cloud and click through for the wiki:\n\n[Call option - Put option - Exercising an option - Strike price - ITM - OTM - ATM - Long options - Short options - Combo - Debit - Credit or Premium - Covered call - Naked - Debit call spread - Credit call spread - Strangle - Iron condor - Vertical debit spreads - Iron Fly](https://www.reddit.com/r/stocks/wiki/options-themed-post)\n\nIf you have a basic question, for example \"what is delta,\" then google \"investopedia delta\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion &amp; Options Trading Thursday - Aug 06, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/i4nq1m/rstocks_daily_discussion_options_trading_thursday/",
        "created": 1596729963.0
    },
    {
        "author": "guccirare",
        "created_utc": 1596462594,
        "id": "i2xd1u",
        "num_comments": 230,
        "num_crossposts": 0,
        "selftext": "Activision calls are literally free money right now. EA beat earnings and they aren’t nearly as big of a thing as Activision right now. Boomers have no idea how popular Call of Duty and Warzone are. ATVI is going to beat earnings for sure because people have been just playing their games all the time during quarantine. Also microtransactions are a great source of revenue for ATVI because it pretty much costs them nothing. And believe me people have been buying a lot of shit in the game because they have nothing else to put their money into.",
        "subreddit": "wallstreetbets",
        "title": "Activision is going to moon after earnings",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i2xd1u/activision_is_going_to_moon_after_earnings/",
        "created": 1596491394.0
    },
    {
        "author": "FrenchFriesAreSalad",
        "created_utc": 1597597208,
        "id": "iavwyh",
        "num_comments": 229,
        "num_crossposts": 0,
        "selftext": "As captain orange is considering a US ban of Alibaba we will probably experience a big dip next week. \n\nHowever, 90% of Baba´s revenue comes from China anyways and approximately only 5% from the USA --&gt;  [https://www.statista.com/statistics/226793/e-commerce-revenue-of-alibabacom/](https://www.statista.com/statistics/226793/e-commerce-revenue-of-alibabacom/) \n\nEven if he bans it, this wont impact their bottom line in any significant way.\n\nSeeing that they release Q2 earnings on 8/20, a selloff prior to this might be the perfect chance to get in before earnings. (corona in china has been non existent in Q2 --&gt; great economical recovery --&gt; huge numbers for Baba)\n\nDoes anybody remember facebooks huge dip when big companies announced they would not run ads for a month ? 15% panic selloff, but when everyone realized how insignificant this was for their bottom line it recovered completely the next week. \n\nIf Baba dips, im going all in september $275 calls.",
        "subreddit": "wallstreetbets",
        "title": "Alibaba Overreaction Play",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iavwyh/alibaba_overreaction_play/",
        "created": 1597626008.0
    },
    {
        "author": "Fuzzers",
        "created_utc": 1597362113,
        "id": "i9b1th",
        "num_comments": 225,
        "num_crossposts": 0,
        "selftext": "Hello fellow degenerates. \n\n I know there has been 6 billion posts about silver, but none of them so far have addressed the unusually large number of open contracts for September. Most of them have just been money printer go BRRRR = inflation = silver go moon. So here's a fun little argument of why silver might enter the stratosphere faster than a hooker in light up sketchers during September. \n\nLike I said, the current open interest for silver September contracts is NUTTY\n\n[COMEX Silver Futures](https://preview.redd.it/772mapunqug51.png?width=624&amp;format=png&amp;auto=webp&amp;s=0e0b944dbbc70766eb70b90692f105d7c1edc7dd)\n\nEach contract represents 5,000 ounces of silver. Now, most of the time only a small portion of these contracts stand for delivery, say 1 or 2% amounting to \\~4 to 9 million ounces of silver. Back in July, an astonishing 17,294 contacts stood for delivery amounting to 86,470,000 ounces of the devils metal. For those of you that can't count, just understand that is a lot. \n\n[Silver Contacts standing for Delivery](https://preview.redd.it/901urvyarug51.png?width=648&amp;format=png&amp;auto=webp&amp;s=a83e739ffcc3996b381f67177a89c91a3c012f45)\n\nIf something similar happens in September, we might be looking at a similar number or more of silver ounces being delivered. So the question is, how much do the banks have? Glad you asked young autist.\n\n[COMEX - Registered and Eligible Silver in ounces.](https://preview.redd.it/bsdee47rrug51.png?width=624&amp;format=png&amp;auto=webp&amp;s=bb1cc36d27e3da9a3834549ba95b23a202050b07)\n\n As of today, there sits a total of roughly 335 million ounces of silver at the Comex across all the big boy banks. \\~128 million of that is registered for delivery, meaning can be used to cover short position and stand for delivery. The other \\~208 million sits eligible, meaning it meets the exchange requirements and COULD be moved over to registered if desired. Funny thing is, a lot of the banks have been moving their silver from eligible to registered in the past couple months, wonder why. For fun, here are the current standings for JPMorgan and The Bank of Nova Scotia.\n\nhttps://preview.redd.it/k5f3ovl1sug51.png?width=624&amp;format=png&amp;auto=webp&amp;s=be44c4e4bf3c6f1359ce828efab40ef162c413e2\n\nhttps://preview.redd.it/xu98xvv4sug51.png?width=624&amp;format=png&amp;auto=webp&amp;s=1b624a4a89126f4f5ebb1019347b3969be10feea\n\nJPMorgan has \\~33.8 million ounces eligible, and \\~131 million registered, while the bank of nova scotia has \\~15 million registered, and 6.5 million eligible. Now what happens when a bank holds a net short position and the longs stand for delivery? Well, good things for the price of silver, bad things for the bank depending on how much they actually have in the comex. \n\nSo what does all this mean? This is probably going to play out either one of two ways: \n\n1. A large amount of contracts will stand for delivery such as in July. If its enough, maybe some of the big banks who have short positions might find themselves in hot water with their silver delivery amounts.  Basically, if enough longs stand for delivery, the amount of silver available to the market goes down = price goes up. \n\n2. Few of the contacts stand for delivery. This is the bear case, if this happens, you better hope your bet on silver being a hedge for inflation is right boys. \n\nTLDR; Huuuge open interest on September silver contracts. If enough stand for delivery you might be able to move out of your wifes boyfriends basement and afford health care. \n\nSLV 9/30 27C &amp; SLV 12/31 30C",
        "subreddit": "wallstreetbets",
        "title": "September Silver Futures Contact - Something Aint Right Kids",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i9b1th/september_silver_futures_contact_something_aint/",
        "created": 1597390913.0
    },
    {
        "author": "MagicNail",
        "created_utc": 1596560033,
        "id": "i3mye9",
        "num_comments": 218,
        "num_crossposts": 0,
        "selftext": "\nI bought kodak at their peak (i found out later that they make fucking cameras) and now its gon tits up and i still havent sold out, what do you Think Will happen to this piece of shit stonk? Is it gonna go back to peak or no please help me yes thanks",
        "subreddit": "wallstreetbets",
        "title": "Kodak tits",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i3mye9/kodak_tits/",
        "created": 1596588833.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1597839133,
        "id": "icmgb9",
        "num_comments": 217,
        "num_crossposts": 0,
        "selftext": "If your question is \"I have $10,000, what do I do?\" or other \"advice for my personal situation\" questions. If you are going to ask how to invest you should include relevant information, such as the following:\n\n* How old are you?\n* Are you employed/making income? How much?\n* What are your objectives with this money? (buy a house? Retirement savings?)\n* What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know its 100% safe?)\n* What are you current holdings? (Do you already have exposure to specific funds and sectors?)\n* Any other assets? House paid off? Cars? Expensive significant other?\n* What is your time horizon? Do you need this money next month? Next 20yrs?\n* Any big debts?\n* Any other relevant financial information will be useful to give you a proper answer.\n\nPlease consider consulting our FAQ first - https://www.reddit.com/r/investing/wiki/faq \n\nBe aware that these answers are just opinions of Redditors and should be used as a starting point for your research. You should strongly consider seeing a registered financial rep before making any financial decisions!",
        "subreddit": "investing",
        "title": "Daily Advice Thread - All basic help or advice questions must be posted here.",
        "url": "https://www.reddit.com/r/investing/comments/icmgb9/daily_advice_thread_all_basic_help_or_advice/",
        "created": 1597867933.0
    },
    {
        "author": "Zaratar",
        "created_utc": 1597995348,
        "id": "idse7s",
        "num_comments": 215,
        "num_crossposts": 0,
        "selftext": "You might want to say: \"Retard, there have been at least a dozen posts about RKT already.\" Well, there is some itsy bitsy tiny bit of new information...\n\n# Hold on to your butts 🚀\n\nYes, you might have seen the stock price climb to \\~$26 after IPO and fall back to $19 and not listened to [this](https://www.reddit.com/r/wallstreetbets/comments/i8g3bq/buying_the_rkt_dip_is_an_absolute_nobrainer/) brilliant retard telling you not to sell GODDAM stock. Maybe because you have read the \"sEeKinG alPhA aNaLysT\" giving it a \"meh\" rating.\n\nWell, in an effort to give you another chance on those sweet tendies, Rocket announced pre-earnings numbers, before the actual earnings date of September 2. This is what it looks like:\n\n* Quarterly earnings are up by 125% from the previous year with quarterly revenue of $5.31 billion. On an adjusted basis revenue is up by 300% over last year. The full report is [here](https://www.marketbeat.com/originals/rocket-comapanies-nyse-rkt-tries-to-lift-off-after-earnings-update/).\n* Adjusted net income is  $2.8 billion, which is an increase of $2.2 billion compared to the first quarter of 2020 and $2.6 billion compared to the second quarter of 2019. For the accountants among you, the full set of numbers are [here](https://www.streetinsider.com/Corporate+News/Rocket+Companies+%28RKT%29+Reports+Prelim.+Q2+Revenue+of+%245+Billion/17243861.html).\n* To put numbers into perspective this is a company with $2.4 billion float according to Google.\n* The stock was up 11.22% today and trading at around $23.8 at market close.\n\n# What does this all mean?\n\n* This is the parent company of Quicken Loans, it is essentially a FinTec company for mortgage refinancing, etc. Some argue that it is actually a tech company. They handle pretty much everything electronically via their website and app. This is important because of COVID-19. According to online [reviews](https://www.nerdwallet.com/reviews/mortgages/rocket-mortgage), they have one of the best-streamlined and user-friendly interfaces.  You can do pretty much everything regarding financing your home without having to sit a crowded office in your facemask.\n* Because of how user-friendly their apps are, they have sweet sweet margins: \"Who is going to do DD on home mortgages when you can do everything on an app. Am I right?\"\n* Interest rates are extremely low due to Fed intervention and it is to remain low for a very long while. Remember the famous [quote](https://www.fxstreet.com/analysis/fed-chairman-were-not-even-thinking-about-thinking-about-raising-rates-202006151341) from our lord and savior JPow: \"We're not thinking about raising rates, we're not even thinking about thinking about raising rates.\" For this reason, everyone and their mum are doing refinancing, buying homes, etc.\n* With a float of $2.4 billion, the company can have VERY significant price changes in a short time.\n* RKT is the ultimate meme ticker. \"RKT to the moon 🚀\" and \"REKT 🔥\" memes will keep us entertained for years to come while providing free advertisement for the company.\n* This is basically TurboTax of mortgages which is a [multi-trillion dollar market](https://www.lendingtree.com/home/mortgage/u-s-mortgage-market-statistics-2019/).\n\n# FAQ for 🌈🐻\n\nQ: But what if the interest rates go back up tomorrow?\n\nA: It won't, as that would collapse the S&amp;P 500 overnight. They have to keep interest rates low so that the money stays in the stock market.\n\n&amp;#x200B;\n\nQ: This sounds like the next subprime mortgage crisis. What if people start defaulting on their mortgages?\n\nA: They are not the ones lending the money, so they don't care. They package the mortgages and hand it to someone else. They keep mortgages for only 3 weeks on average during the process, then they are off the hook.\n\n&amp;#x200B;\n\nQ: Aren't there other mortgage companies with online services?\n\nA: Yes, but nothing this streamlined and easy to use. And they have very good brand recognition with the Rocket brand and Quicken Loans. Again, it is like TurboTax: yes there is other tax software out there, but who cares?\n\n&amp;#x200B;\n\nQ: But the stock price does not reflect the fundamentals. Didn't it crash last week and then stall?\n\nA: Yes there was some price discovery after IPO and you would have been right up until Monday of this week. But since the pre-earnings announcement, the stock price is picking up some serious steam. Once the mainstream media catches on and price exceeds the ATH (probably tomorrow), this will go to the moon. If this does not look like a RKT platform I do not know what does:\n\nhttps://preview.redd.it/lyevy8wx6bi51.png?width=1260&amp;format=png&amp;auto=webp&amp;s=10da2d7c8be7d4a83c0b798c16aafaa94bacfc20\n\n# The Play\n\nJust stop reading and load up the cart already.",
        "subreddit": "wallstreetbets",
        "title": "RKT: The Next 10 Bagger MEME Stock 🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/idse7s/rkt_the_next_10_bagger_meme_stock/",
        "created": 1598024148.0
    }
]