[
    {
        "author": "theycallmeryan",
        "created_utc": 1582035315,
        "id": "f5seog",
        "num_comments": 890,
        "num_crossposts": 0,
        "selftext": "I see many comparisons of the coronavirus outbreak to SARS everywhere. From the media to analysts to WSB posters, everyone loves to compare this coronavirus outbreak to SARS and say that the economy recovered quickly last time, so it will do the same this time. A lot has been discussed about the supply chain disruptions in [other reddit threads](https://www.reddit.com/r/investing/comments/f07zut/some_specific_details_about_impending_supply/), so I do not think it is necessary to talk about that. The differences between the diseases themselves as well as a potential pandemic breaking out has been discussed at length too, so I don’t find it necessary to go into that either. What I will do is show how the Chinese economy is much weaker and much different now than when SARS hit in 2003 and focus not too much on the supply side, but mostly on the demand side and the banking industry based on the research I have been doing. I believe that even if factories reopen tomorrow at 100% efficiency (they have been struggling to reopen amidst [labor shortages](https://www.cnbc.com/2020/02/14/china-coronavirus-its-still-far-from-business-as-usual.html)), coronavirus is completely eradicated, and everyone starts consuming at the same levels that they would have otherwise, the Chinese economy (and the world economy with it) is still in significant trouble.\n\nChina today is much different than China during the SARS outbreak in 2003, [here are some graphs that show just how different](https://www.cnbc.com/2020/02/05/coronavirus-how-china-economy-has-changed-since-sars.html). Notice how China was a much smaller share of the world economy back then (just above 4% according to this graph) compared to 16% now. Services and consumption make up a much larger part of the Chinese economy now, going from a little over 40% back then to around 52% now. According to [this](https://asia.nikkei.com/Spotlight/Caixin/Coronavirus-costs-China-service-sector-144bn-in-1-week) source, that service industry was hit with a $144b loss in a week from coronavirus. SARS was estimated to do [$33 billion in damage to the world economy](https://www.reuters.com/article/us-china-health/u-s-and-others-tighten-curbs-on-travel-to-china-virus-toll-hits-213-idUSKBN1ZT374), coronavirus did an estimated 330% more damage (not adjusted for inflation) just to the Chinese service industry (and I think that is an underestimate) in one week. China also accounts for over 12% of global exports now as opposed to a little over 6% back in 2003. China also accounts for [one-third of global GDP growth](https://www.imf.org/en/News/Articles/2018/07/25/na072618-chinas-economic-outlook-in-six-charts).\n\nChinese tourism has boomed since 2003 too. Tourism to Hong Kong has dropped off sharply thanks to the protests as well as coronavirus, [going from 200,000 visitors per day in February 2019 to less than 3,000 now](https://pbs.twimg.com/media/EQ358ruWsAA8AZb?format=jpg&amp;name=medium). Most flights to/from America (and other countries) are cancelled through the end of [March or April](https://www.nytimes.com/reuters/2020/02/14/world/14reuters-china-health-airlines-factbox.html). SARS hit a manufacturing based economy growing at a 12% rate and that was only 4% of the world economy. This is a service based economy growing at 6% (if you believe the real numbers) that is 16% of the world economy. You can't make up the tourism or services revenue like you can with manufacturing. 750m people [according to the NYT](https://www.nytimes.com/2020/02/15/business/china-coronavirus-lockdown.amp.html#click=https://t.co/ZuO31QVi6g) are currently under some form of lockdown. Even if these quarantines lift soon (that’s a major question), the massive tourism industry both to and from China has taken a huge hit for the near future that cannot be recovered.\n\nIn December 2019, a Moody’s analyst called Chinese corporate debt the [biggest threat to the global economy](https://www.cnbc.com/2019/12/17/chinas-corporate-debt-is-biggest-threat-to-global-economy-moodys.html). [4.9% of China’s private issuers defaulted on loans in 2019](https://www.reuters.com/article/china-markets-default/chinas-private-firms-face-record-default-risk-to-stay-high-in-2020-fitch-idUKL4N28K1YM). This number is up from 0.6% in 2014. Banks have been [encouraged](https://www.reuters.com/article/us-china-gdp-breakingviews/breakingviews-chinas-shadow-bankers-sneak-back-to-market-idUSKBN1ZG0D5) to give loans to tiny, risky businesses while also trying to get bad debt off their books. Due to problems with their banking system, China nationalized its first bank in [20 years](https://www.bloomberg.com/news/articles/2019-05-27/china-s-first-bank-seizure-in-20-years-spooks-lenders-investors) last year. Then they proceeded to take over [two more](https://www.theepochtimes.com/beijing-nationalizes-third-bank-in-3-months_3036953.html). This over-leveraged banking system had been showing its cracks before coronavirus made China grind to a halt for a month. Questions have been raised as to whether or not the industry can be leaned on for an economic recovery as hard as the Chinese government is leaning on it now.\n\nThis was an economy [in trouble](https://www.nytimes.com/2020/01/16/business/economy/china-economy-gdp.html) before the coronavirus hit. The [shadow banking system](https://www.bloomberg.com/news/articles/2019-10-08/trouble-is-brewing-in-the-darkest-corner-of-china-shadow-banking) appears to have gotten out of control. [Shadow banking accounted for 39% and 45% of total lending in Q1 and Q2 2019](https://www.ft.com/content/4c66b622-dea5-11e9-9743-db5a370481bc). According to Bloomberg, wealth managers have been offering “high yield products” to investors and have been using their own capital to make these returns whole due to that high default rate mentioned in the last paragraph. The Bloomberg article states that, “because the products are opaque and regulation is minimal, nobody knows exactly how much money is at risk.” This article is from October 2019, before coronavirus became a concern.\n\nThis is not an economy poised to bounce back like it did with SARS in 2003, despite what the market thinks. It might take a while for the market to realize it, but all it takes is a look at the data to see why that assertion is false. The market is focused on the fact that the virus won't kill us all and not on the fact that the lost revenue from Chinese consumption cannot be made up, despite the CCP propaganda that is being put out from Chinese government officials and Chinese economists. [An article from Barron’s](https://www.barrons.com/articles/coronavirus-brings-chinas-debt-problem-back-into-light-51581679800?mod=hp_LEAD_1) has this to say:\n\n&gt;One area, in particular, is back at the forefront—local debt. Policy makers have directed regional lenders to tolerate a higher threshold for bad loans, hoping to keep thousands of small- and medium-size enterprises (SMEs) from collapsing amid the economic standstill. A survey conducted recently by Peking and Tsinghua universities—China’s top two schools—found that two-thirds of such firms said they could stay afloat no more than one to two months with their current savings. An additional 18% said they could last at most three months.\n\n&gt;Put another way, 85% of China’s SMEs would crumble within three months without financial injections of some sort.\n\n[Here](https://www.mckinsey.com/~/media/mckinsey/featured%20insights/china/china%20and%20the%20world%20inside%20the%20dynamics%20of%20a%20changing%20relationship/mgi-china-and-the-world-full-report-vf.ashx) is a report from McKinsey from July 2019 that has a lot of good data in it regarding China’s exposure to the world economy. I’m just going to post some direct quotes and charts from the report and let you decide what they mean:\n\n&gt;In 11 of the 16 quarters since 2015, consumption contributed more than 60 percent of [China’s] total GDP growth.\n\n&gt;In the United States, among the firms listed in the MSCI USA index, revenue exposure to China amounted to 15 percent of the IT sector, 7 percent of materials, and 6 percent of industrials. In 2017, US companies were estimated to have generated around $450 billion to $500 billion revenue in China through a mix of exports and revenue from Chinese subsidiaries.\n\n[Here](https://i.imgur.com/tebHQRv.png) is a chart from the report showing how exposed the world is to China. Luckily for us, as shown in the above report, US exposure to China is not as massive as you might think. The exposure comes mostly from the rest of Asia, Australia, and Africa instead of developed markets. However, the amount of exposure from developed countries is not negligible. The technology sector, which has driven the majority of our stock market growth, has a [disproportionate exposure](https://i.imgur.com/UeBdEB0.jpg) to revenue coming from China, especially semiconductors like Intel, Micron, Nvidia, and AMD. That chart uses data from 2017 so I would almost guarantee it is less now, but still concerning.\n\nWhile 4 of the 5 mega caps that make up [almost 20% of the S&amp;P 500’s value](https://seekingalpha.com/article/4323952-s-and-p-500-five-great-tech-titans-of-america) and have generated [1/5 of S&amp;P 500 returns since 2009](https://www.bloomberg.com/news/articles/2020-02-15/all-the-ways-stock-market-bulls-have-gone-off-the-rails-again) don’t have much, if any, China exposure on a surface level. However, Apple derived [16.7% of their revenue](https://www.cnbc.com/2020/01/27/apple-impact-of-coronavirus-on-china-business.html) from China, Taiwan, and Hong Kong in 2019. Not to mention that Foxconn factories are still mostly closed down over there and not producing anything. Additionally, [20% of Amazon’s COGS for private label brands is attributable to China](https://markets.businessinsider.com/news/stocks/how-much-amazon-wayfair-will-have-to-boost-prices-tariffs-2019-9-1028499095). Due to how prevalent indexing is, I believe that a tech selloff lead by semiconductors and Apple (just like the old trade war selloffs) would drag down all megacap tech stocks and present a good entry point for an eventual recovery.\n\nAll of this comes on top of Boeing’s struggles with the 737 Max, which are expected to cut US GDP growth by [20%](https://www.axios.com/boeing-production-freeze-gdp-impact-737-max-d2b3b7c9-9a3b-4a2a-a3a0-a49fb54156d0.html) in 2020. In 2017 and 2018, China accounted for [22%](https://www.barrons.com/articles/boeing-plane-deliveries-china-737-max-crash-comac-airbus-trade-deal-51579101765) of Boeing plane deliveries. In 2019, that number dropped to 12%. These struggles with China’s economy and the self inflicted 737 Max struggles will put even more downward pressure on US GDP growth for this year. The phase one trade deal was expected to help Boeing out, but there are now [questions](https://foreignpolicy.com/2020/02/14/china-united-states-trade-deal-commitments-coronavirus-trump-energy-huawei/) as to whether or not China will hold up to their end of it. \n\nIn addition to these Chinese economic struggles, other Asian countries are showing economic woes as well. Singapore just cut their 2020 GDP forecast from 0.5%-2.5% to -0.5%-1.5%. Japan released their Q4 2019 GDP numbers, showing its largest GDP decline since 2014, an annualized rate of [-6.3%](https://www.cmcmarkets.com/en/news-and-analysis/singapore-cuts-2020-growth-forecast-japan-gdp-slumps), coming in way lower than analyst expectations of -2.6%. This was before the coronavirus started sweeping Asia, the Q1 GDP numbers could be worse. While China is responsible for 12.6% of our trade, Japan accounts for 5.4%. A Japanese recession will hurt us too.\n\nTo summarize and give some of my personal opinions to go along with this data, I believe the Chinese economy is in a lot more trouble than most people realize. The shadow banking system is massive and their banks are incredibly over leveraged. There are questions as to whether or not banks can perform the economic stimulus that China is demanding from them to keep small and medium sized firms open. I believe that the data shows China is in very dangerous economic territory that could lead to a recession or at least a major drop in growth for at least Q1 and Q2 2020 that cannot be made up in the second half of the year. It appears to me that these China economic troubles will take a lot of Asia and other developing economies down with them. It remains to be seen if it will take the American economy down too, but I believe that semiconductors and Apple should be trading lower than their current valuations to reflect potential lost growth and revenue streams. I also see Boeing’s struggles continuing to weigh on our GDP growth. I believe the market is fundamentally mispricing risk in the technology sector right now and it will overcorrect downwards in the near future.\n\nTL;DR: China’s economy is potentially going down led by an over-leveraged banking system and it may cause our tech stocks, which derive supply and demand from China, to lead a market correction. Comparing this coronavirus situation to SARS is extremely disingenuous due to the state of the Chinese economy in 2003 compared to the state of the Chinese economy now. The downward pressures from China on world GDP growth as well as Boeing’s pressures on our own GDP growth create a significant risk in all world equity markets that is not being priced in. I’m not saying we’re definitely heading towards a US recession or even a global recession, but the risk should not be ignored by world markets, no matter how much liquidity central banks pump in.",
        "subreddit": "wallstreetbets",
        "title": "SARS vs coronavirus: why it's different this time and the effects on the world economy",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f5seog/sars_vs_coronavirus_why_its_different_this_time/",
        "created": 1582064115.0
    },
    {
        "author": "Azbroker28",
        "created_utc": 1582505918,
        "id": "f8j4hx",
        "num_comments": 558,
        "num_crossposts": 0,
        "selftext": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-stock-market-rally-faces-coronavirus-pandemic-apple-stock-buy-point/",
        "subreddit": "investing",
        "title": "Dow Jones Futures Dive As Stock Market Faces Coronavirus Pandemic Fears",
        "url": "https://www.reddit.com/r/investing/comments/f8j4hx/dow_jones_futures_dive_as_stock_market_faces/",
        "created": 1582534718.0
    },
    {
        "author": "spondgbob",
        "created_utc": 1582064486,
        "id": "f5zz6f",
        "num_comments": 516,
        "num_crossposts": 0,
        "selftext": "Just an observation to describe just how insanely fast stock prices are rising right now. $430 Billion dollars in growth in 5 months is a ridiculously high growth rate to try to maintain. Please stay informed on your investing decisions in the coming months!",
        "subreddit": "investing",
        "title": "Apple hit $1T in market value in September of 2019, and is now over $1.43T 5 months later.",
        "url": "https://www.reddit.com/r/investing/comments/f5zz6f/apple_hit_1t_in_market_value_in_september_of_2019/",
        "created": 1582093286.0
    },
    {
        "author": "Michael12390",
        "created_utc": 1582552314,
        "id": "f8rhvb",
        "num_comments": 485,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2020/02/24/warren-buffett-says-apple-is-probably-the-best-business-i-know-in-the-world.html",
        "subreddit": "investing",
        "title": "Warren Buffett calls Apple ‘probably the best business I know in the world’",
        "url": "https://www.reddit.com/r/investing/comments/f8rhvb/warren_buffett_calls_apple_probably_the_best/",
        "created": 1582581114.0
    },
    {
        "author": "kuzzlebone",
        "created_utc": 1581519885,
        "id": "f2sia7",
        "num_comments": 447,
        "num_crossposts": 0,
        "selftext": "$MSFT has a bad opening. But just think for two goddamn seconds about Microsoft. It’s fucking Microsoft. Every fucking person on the planet has used a Microsoft product. If fucking Apple can be in the 300+ range so can bill suck my dick gates. $MSFT to moon hold your goddamn positions and don’t pussy out unless your a fucking $SIMP",
        "subreddit": "wallstreetbets",
        "title": "Hold strong you fucking idiots",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f2sia7/hold_strong_you_fucking_idiots/",
        "created": 1581548685.0
    },
    {
        "author": "leonx81",
        "created_utc": 1581973801,
        "id": "f5fqlq",
        "num_comments": 313,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2020/02/17/apple-warns-on-coronavirus-it-wont-meet-revenue-guidance-because-of-constrained-iphone-supply-and-suppressed-demand-in-china.html",
        "subreddit": "investing",
        "title": "CNBC: Apple warns on coronavirus — it won't meet revenue guidance because of constrained iPhone supply and suppressed demand in China",
        "url": "https://www.reddit.com/r/investing/comments/f5fqlq/cnbc_apple_warns_on_coronavirus_it_wont_meet/",
        "created": 1582002601.0
    },
    {
        "author": "Noobsicles",
        "created_utc": 1581969096,
        "id": "f5egjw",
        "num_comments": 280,
        "num_crossposts": 0,
        "selftext": "Why are any of you autists not buying into AMD/talking about it? \n\n**Notable bullet points** \n\n*  Apples putting AMD chips in the new MacBooks. (short intel soon)\n-- https://www.digitaltrends.com/computing/why-apple-should-ditch-intel-for-amd/\n* AMD's chip technology is the current best in the market.\n--https://www.digitaltrends.com/computing/amd-vs-intel/\n* New chips in BOTH the PS5/XBOX X\n* Continuous Growth \n* Intels a boomer company\n* Nvidia HOLDS the market. They love AMD. The CEO of amd is literally the niece of Nividas CEO. Forced Partnership.\n* Analysts Price Target of $66 - Raised Constantly.\n\n**DO YOU AUTISTS NOT LIKE FREE MONEY?**\n \n\"I can't read, please just tell me what to buy!\"\n- \nIt's simple. Squeeze Short, High Cheap Long.\n\n- **02/28 - Calls $62 -** Under. Realistically we can expect the margin to close. There will be some hesitation, trust me, I'm on a lot of coke right now. \n-/\n* **03/27 - Calls $60-66** . After hesitation the news will start spreading. People will push to at least close margin. \n* Yearlies if you didn't already make thousands off of the initial calls. No pussy shit.\n\n\n**I'll ask again. Do you not want free money?**\n----\nLiterally can't go tits up. Trust me, I'm autistic.",
        "subreddit": "wallstreetbets",
        "title": "[DD] AMD is going UP this week.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f5egjw/dd_amd_is_going_up_this_week/",
        "created": 1581997896.0
    },
    {
        "author": "Jackovdajakoff",
        "created_utc": 1582851594,
        "id": "famdas",
        "num_comments": 246,
        "num_crossposts": 0,
        "selftext": "I see so many comments on here anytime the market drops like \"stocks are on sale\" or \"if you loved stocks last week, then you should love them even more this week,\" which seem to focus only on the price, without understanding what the price of a stock or the market consists of: future earnings expectations. \n\nJust because the price of a stock was X last week doesn't mean that price has any relevance to the price this week. And just because a stock rose 100% last year, doesn't mean that the stock is any more or less attractive today based on its past history, at least from a fundamental perspective. \n\nWhen you are only factoring in past prices (without analyzing new, forward-looking information) you are engaging in **anchoring,** a psychological concept that overweights initial information you are presented with. \n\nHere is a relatively concise analysis of the current market's outlook from Frank Curzio, who like every analyst, has had his hits and misses, but is usually quite bullish that actually displays analysis based on new information related to earnings. I would link, but this came from an email update.\n\n\\*\\*\\*\n\nAccording to Capital IQ, S&amp;P's research division, companies in the S&amp;P 500 are expected to generate a combined $181 in earnings per share (EPS) in 2020. That's 14% higher than the $159 in combined EPS the S&amp;P 500 generated in 2019. \n\nNow that the coronavirus has spread... there's no way earnings are growing 14% this year. In fact, Goldman Sachs—which once called the virus a ”short-term problem\"—just published a report saying earnings will not grow in 2020. \n\nI think this is conservative, given the number of companies that have lowered earnings over the past two weeks (including Apple and Microsoft, two of the biggest names in the S&amp;P 500). But it's important that investors understand these numbers. \n\nIf we see no earnings growth in 2020... that means 2020 earnings will come in at $159 a share, at most. But if we divide the current price of the S&amp;P 500 (about $3,050) by the $159 in combined earnings... we can see that **the S&amp;P 500 is** **already** **trading at 19x forward earnings.**\n\nIn other words, even though the market pulled back more than 10%... the S&amp;P 500 is still trading like there's no coronavirus. (Remember, earnings are falling alongside the markets... that's why the market is still expensive despite its 10% correction). \n\nAt 19x forward earnings, the markets are still pricing in significant growth. Yet, earnings probably won't grow at all in 2020... \n\nWhat does this mean?\n\n**There's likely another 20% downside from here.**\n\nWith no actual growth forecast for 2020, the market should be trading closer to 15x—the 10-year average... and more than 20% lower than current levels.\n\nOf course, this downside could be limited if we find a vaccine for the coronavirus in the short term... or if we see massive government intervention to help backstop the markets. (Things like lowering interest rates, preventing short selling, or injecting cash directly into the markets.)\n\n\\*\\*\\*\n\nSo anytime someone says stocks are on sale, or cheap, or a good time to buy, you should ask them, \"what are you basing that information on?\" The fact that the price is cheaper than it was last week/month/year means nothing without understanding the earnings picture.",
        "subreddit": "investing",
        "title": "Concise explanation of why stocks could fall 20% more from here",
        "url": "https://www.reddit.com/r/investing/comments/famdas/concise_explanation_of_why_stocks_could_fall_20/",
        "created": 1582880394.0
    },
    {
        "author": "ElRamenKnight",
        "created_utc": 1580544301,
        "id": "ex2xh5",
        "num_comments": 214,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2020/02/01/apple-temporarily-shuts-all-stores-and-offices-in-mainland-china.html  \n\nLooks like the analysts calling an even sharper dip as things worsened weren't kidding.",
        "subreddit": "investing",
        "title": "Apple temporarily shuts all stores and offices in mainland China",
        "url": "https://www.reddit.com/r/investing/comments/ex2xh5/apple_temporarily_shuts_all_stores_and_offices_in/",
        "created": 1580573101.0
    },
    {
        "author": "ShotByArrow",
        "created_utc": 1583018175,
        "id": "fbkx5x",
        "num_comments": 204,
        "num_crossposts": 0,
        "selftext": "I just got back from my weekly trip for a big bag of tendies and apple juice with mommy, and there were a shit load of people there. Apparently they have already completely sold out of water bottles, hand sanitizer, and they are running low on a ton of other things. Sales this quarter are gonna go to the moon so I’m going long on ‘sco\n\nCOST $375C 3/20",
        "subreddit": "wallstreetbets",
        "title": "Costco Sales This Quarter Will Be Insane",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fbkx5x/costco_sales_this_quarter_will_be_insane/",
        "created": 1583046975.0
    },
    {
        "author": "Dense-Phase",
        "created_utc": 1581351604,
        "id": "f1slgk",
        "num_comments": 202,
        "num_crossposts": 0,
        "selftext": "it wasn't one trade, it was more like 30 trades over the course of 2 months with active management.\n\nhttps://preview.redd.it/mdzo69wgg4g41.png?width=1125&amp;format=png&amp;auto=webp&amp;s=b1f6b334180dc0221a9556c7ea097fff2ab15e2c\n\nhttps://preview.redd.it/g5xsyia5g4g41.png?width=1190&amp;format=png&amp;auto=webp&amp;s=6cb416607b1817391c202a308542d13ab5399613\n\nit was a combination of positions in:\n\nAAPL from 280--&gt; 300 at the end of 2019. Then from 302 --&gt; 318 today.\n\nMSFT from 168 earnings day --&gt; 185 today \\[ sold early dammit \\]\n\nbiggest % gainer: MSFT 190 March 20 Calls, 0.36 buy to 3.7 sell today.\n\nalso had positions in AMD and BA, but those % gains weren't phenomenal because I didn't trade AMD well enough when the virus hit.\n\nthanks again WSB #noguhdays",
        "subreddit": "wallstreetbets",
        "title": "turned 42k into 195k in 55 calendar days... thanks to WSB for inspiring me to yolo",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f1slgk/turned_42k_into_195k_in_55_calendar_days_thanks/",
        "created": 1581380404.0
    },
    {
        "author": "fake-account-lol",
        "created_utc": 1582657937,
        "id": "f9fd84",
        "num_comments": 190,
        "num_crossposts": 0,
        "selftext": "I said fuck it , why not try the gay and bought aapl puts and it’s the only thing printing in my portfolio. Still holding steady on my msft 5/15s but gay is the way till the market gets its shit together. I hope y’all come to this realization soon.",
        "subreddit": "wallstreetbets",
        "title": "I concede 🐻🌈 is the way",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f9fd84/i_concede_is_the_way/",
        "created": 1582686737.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1582877259,
        "id": "farghc",
        "num_comments": 183,
        "num_crossposts": 0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme and/or [post your arguments against fundamentals here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing\n  * [Corporate News](https://www.streetinsider.com/Corporate+News)\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n  * [Economic data](https://www.streetinsider.com/Economic+Data)\n  * [FED](https://www.streetinsider.com/Fed) - Federal Reserve news\n\n-----\n\nMost fundamentals are updated every 3 months due to the fact that corporations release earnings reports every quarter, so traders are always speculating at what those earnings will say, and investors may change the size of their holdings based on those reports.  Expect a lot of volatility around earnings, but it usually doesn't matter if you're holding long term, but keep in mind the importance of earnings reports because a trend of declining earnings or a decline in some other fundamental will drive the stock down over the long term as well.\n\nSee the following word cloud and click through for the wiki:\n\n[Market Cap - Shares Outstanding - Volume - Dividend - EPS - P/E Ratio - EPS Q/Q - PEG - Sales Q/Q - Return on Assets (ROA) - Return on Equity (ROE) - BETA - SMA - quarterly earnings](https://www.reddit.com/r/stocks/wiki/fundamentals-themed-post)\n\nIf you have a basic question, for example \"what is EBITDA,\" then google \"investopedia EBITDA\" and click the Investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nUseful links:\n\n* [Investopedia Tuturiol](https://www.investopedia.com/university/all/fundamental-analysis/) on fundamental analysis including [Discounted Cash Flow](https://www.investopedia.com/university/dcf/) analysis; see [definition here](https://www.investopedia.com/terms/d/dcf.asp)\n* [FINVIZ](https://finviz.com/quote.ashx?t=aapl) for fundamental data, charts, and aggregated news\n* [Earnings Whisper](https://www.earningswhispers.com/stocks/aapl) for earnings details\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion &amp; Fundamentals Friday Feb 28, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/farghc/rstocks_daily_discussion_fundamentals_friday_feb/",
        "created": 1582906059.0
    },
    {
        "author": "TripleBrain",
        "created_utc": 1582832982,
        "id": "fahqdx",
        "num_comments": 155,
        "num_crossposts": 0,
        "selftext": "*Please keep things civil and let's try to assess how this market is moving for the good of all.*\n\nIn the past week, it's fair to say this market has been very bipolar with SPY/Techs adding an average of 3% one day, to losing 3% the next. For a lot of people, I am seeing mixed reactions from a few that profited largely to those that are always on the opposite side of the market.\n\nHere is my assessment of the market and the implication of the coronavirus in the short-medium term:\n\nCOVID-19 from a medical perspective is concerning. It has surpassed the SARS outbreak of 2002 by incidence and mortality rate, and in a shorter amount of time. What is a common misconception and commonly referenced in this sub is comparing the coronavirus to the flu. The two are entirely different for one reason: COVID-19 is an **airborne** transmittable condition, whereas the flu is not. Airborne diseases are particularly concerning from a physicians standpoint (credits to a friend of mine in pediatrics/general care) because they travel significantly faster, have a much larger reach, and can infect masses in a short amount of time. COVID-19, though having significantly less death counts compared to the seasonable flu, poses a greater threat to humans at this point because there are currently no viable drugs for treatment and vaccines for preventative care. Moderna and Gilead at the forefront of this treatment are still far from a vaccine which is the most important thing for the outlook of this disease. Moreover, treatments are currently in late-stage development (albeit probably expedited for approval) and has not been tested on large samples of humans. I anticipate a viable treatment potentially in April and May, and a vaccine 3-4 months further down the line. That is if COVID-19 isn't beginning to mutate.\n\nThe implications of this virus is clear in the tech sector. The argument that I hear is that companies do not lose value simply because of delays in production, and once production is back in full force, these companies will appreciate. The issue with this conjecture is that factory delays do in fact depreciate the valuation of a company because it demonstrates 1) an inability for these companies to mitigate from natural disasters, 2) an over-dependence of out-sourced labor in a country that we are having tariff wars with, and 3) the lack of a diversified geography in overseas production. For tech, delays as such as be worrisome for short term value investors (day/swing traders) and call option traders. Take TSLA for example. The stock sat at around $900 5 trading days prior with no immediate signs of a pull back. In light of the 92% reduction of car sales report in China for Jan vs February, the car industry as a whole took a steep drop. TSLA in particular is already back in production, but they are currently seeing 42% loss in registration from December vs January, and I suspect the numbers are going to recede with February.  I am particularly interested in TSLA as it had such a tremendous last quarter, but the difference between the first/second quarter should help investors better understand the current valuation as being over-extended. I would even imagine $500 puts for April as reasonable. Microsoft, NVIDIA, and Apple are all likely to suffer extended losses with outlook revisions guiding downwards. Both apple and microsoft revising guidance and anticipating misses in revenue is also worthwhile to look into. \n\nMoving into the analysis of the movement. Stocks having daily value ranges that stretch, 8% of it's value. These fluxes can be seen in today's early trading hours when SPY reached $300 and all tickers were deep in red. If you line up 30 of the most popular large/mega cap tickers, you will notice that they are head north at the same time. This is a good indicator of algo trading as opposed to optimism in traders. It would be reasonable to believe that traders are buying the dip if these tickers were driven up in separate pace, but you will find a clear indication that many tickers experienced heavy volumes at the exact same time. I use Starbucks as a good support. For Starbucks, it's very clear where their next earnings are headed with the closing of 90% of their stores in China and this being their second largest market after the U.S. Their reopening of 3000 stores will not likely have a recovering effect with the virus still posing a significant threat all across China. However, this ticker moved from -3.80% lows to nearly positive when everything began to move north simultaneously.\n\nTLDR: Let's talk about your thoughts on the trajectory of the market in the short term. I anticipate further bleed in the weeks to come. SPY will likely visit sub $300 in the coming weeks. Over-extended techs will bleed out. Algo trading rebounded many large/mega caps today, but I suspect a quick selloff  out of the blue.",
        "subreddit": "wallstreetbets",
        "title": "Formal discussion of where the market is headed.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fahqdx/formal_discussion_of_where_the_market_is_headed/",
        "created": 1582861782.0
    },
    {
        "author": "Coochie-",
        "created_utc": 1582324183,
        "id": "f7ixp3",
        "num_comments": 153,
        "num_crossposts": 0,
        "selftext": "Wells Fargo to pay $3B settlement for violating antifraud rules, resolving fake account probes.\n- Article from USA TODAY:\nhttps://www.usatoday.com/story/money/2020/02/21/wells-fargo-settlement-bank-reaches-3-billion-settlement-feds/4835436002/\n\nWells Fargo posted an article stating AMD was overpriced or ‘over-rallied’, almost immediately, AMD fell. This can be due to supply chain with China as well but we all know Wells Fargo had an influence in this.\n\nNow, they are paying for it. This is a positive for AMD longs. \n\nAMD partner hints with Apple are becoming more and more frequent. \n\nAMD also has been outperforming intel processors and CPU’s; faster and more reliable for a lower price.\n\nWe are also seeing an increase in volume going into this weekend. Stay confident with AMD, increase will come. \n\nExpect AMD to recover Monday.",
        "subreddit": "wallstreetbets",
        "title": "AMD to recover on Monday.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f7ixp3/amd_to_recover_on_monday/",
        "created": 1582352983.0
    },
    {
        "author": "blueyagami",
        "created_utc": 1582804210,
        "id": "faay8g",
        "num_comments": 152,
        "num_crossposts": 0,
        "selftext": "I just started investing few months ago and have about 2k in my portfolio. I lost a significant amount now in the last one week. My gain has dropped by 20%. Is it recommended to still hold onto the stocks or sell for damage control? \n\nMy big investments include (in the same order)\nTesla\nDisney \nApple \nAbbvie\nSony\nMicrosoft\n\nAny suggestions are welcome.\n\nThank you",
        "subreddit": "StockMarket",
        "title": "Corona virus and stocks- advice needed",
        "url": "https://www.reddit.com/r/StockMarket/comments/faay8g/corona_virus_and_stocks_advice_needed/",
        "created": 1582833010.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1582562194,
        "id": "f8tu6k",
        "num_comments": 148,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2020/02/24/coronavirus-plunge-msft-aapl-googl-amzn-fb-lose-220b-in-value.html\n\nShares of Big Tech companies took a hit Monday after a surge in coronavirus cases renewed rears of a global economic slowdown. \n\nAltogether, Apple, Facebook, Amazon, Microsoft and Google — six of the most valuable U.S. companies — lost over $220 billion.",
        "subreddit": "StockMarket",
        "title": "Coronavirus plunge wipes more than $200 billion from Big Tech stocks",
        "url": "https://www.reddit.com/r/StockMarket/comments/f8tu6k/coronavirus_plunge_wipes_more_than_200_billion/",
        "created": 1582590994.0
    },
    {
        "author": "cookingboy",
        "created_utc": 1582054618,
        "id": "f5xckj",
        "num_comments": 143,
        "num_crossposts": 0,
        "selftext": "Over the past few weeks I, along with some others around here or in the investment community in general, are a bit puzzled by the market's extremely bullish outlook despite the economic impact of nCoV virus turning out to be a lot more severe than initially expected by many.\n\nIn my [original post](https://www.reddit.com/r/investing/comments/eusz3g/people_arent_fully_realizing_the_economic_impact/) about the virus I made some predictions, and they mostly turned out to be very accurate, from AAPL missing their quarterly result (I wrote the post 2 days before Tim Cook gave a wider than normal range for the quarter estimate and 21 days before they issued a guidance warning), to China's energy demand dropping in the short term to the disruption to the supply chain. \n\nOn the other hand, I'm very glad that I didn't make any impulsive trading decisions and short the market, since as everyone know the market has been only getting bullish as this whole virus saga unfolds. Even the Chinese stock market has been doing relatively well since reopening despite the whole country's GDP going down the drain this quarter.\n\nSo is it pure market exuberance (i,e crypto market back in 2017) or is it the media who's making a mount out of an ant hill with regard to a bad flu? \n\nI believe it's neither (ok some market exuberance is definitely here, I can't complain about my TSLA holding). Because in the end, no fundamental behavior/pattern of the market is being threatened by the epidemic. If we look back at the dotcom bust of the late 90s, huge valuations for companies with unproven *revenue* models was the driving factor of the bubble and for 2008 it was the overly leveraged subprime mortgage market. The market didn't collapse because the stocks were trading high, they collapsed because those unsustainable driving factors for the bubbles *inevitably* came to their end. \n\nSo where are we now? Yes there will be some short to medium term economic pains, especially to small/medium businesses or companies that operate in certain industries (I wouldn't go all in on cruise ship stocks right now lol), but none of that will be the actual cause for a real recession since the current *operating framework* of the economy still *appears to be solid*. The Chinese central bank and other government feds/central banks will have no problem injecting cash and capital to keep the appearance up and it may very, very well succeed in smooth out the market bumps through the next 3 months. They have all the economic and *political* incentives to keep this up for as long as possible, and if the virus threat does end (or at least stops worrying people) in the next 3 months, they probably will succeed.\n\nI see two risks with this outlook, one is the virus turns out to be worse than expected and China's economy is still halted six months down the road. In this case the impact will cascade and surpass what the market will be willing to ignore. The second risk is the intense short term pain (supply chain disruption, terrible cashflow impact, SMB hurting, etc) will uncover some fundamental problems in our current economic model. This is slightly more likely than the first risk and it will catch everyone by surprise, so by its nature it's difficult to predict exactly what it would be.\n\nIn the end, I've not changed my investment strategy since the whole virus saga began and I recommend people to not make impulsive decisions trying to time the market in the short term. Considering the unprecedented containment measure and economic impact of this epidemics, this will be a very good data point and learning lesson for everyone, doesn't matter which side you are on.",
        "subreddit": "investing",
        "title": "The market may very well \"fake it until make it\" through a 3-6 months bump in economy, and the bull market can continue throughout 2020.",
        "url": "https://www.reddit.com/r/investing/comments/f5xckj/the_market_may_very_well_fake_it_until_make_it/",
        "created": 1582083418.0
    },
    {
        "author": "noahsnumber1",
        "created_utc": 1581612785,
        "id": "f3cus2",
        "num_comments": 124,
        "num_crossposts": 0,
        "selftext": "https://i.imgur.com/s7fw4ui.jpg\n\nHad a pretty good time this month misting selling put spreads. Not really sure how I can show all of my positions for this since it was probably around 50 different trades. I mainly have been selling put spreads on apple and Microsoft, apple I usually try to sell weeklies or 2 weeks out with the short leg about 10 dollars out the money. \nIt was nice being able to live thru the corona virus recession and still be making money on theta, since I would’ve lost a ton of money if I were still just buying calls like I used to. These spreads are fun but you definitely need to keep looking for entry points into trades and doing DD like you would for calls. For me, if I’m bullish in the short term on the stock I prefer selling the put spreads rather than buying calls even if it does limit my gains some. \nGonna be taking a break for a couple weeks after this, need some time to relax.",
        "subreddit": "wallstreetbets",
        "title": "Been a Pretty Good Month Since Joining Theta Gang",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f3cus2/been_a_pretty_good_month_since_joining_theta_gang/",
        "created": 1581641585.0
    },
    {
        "author": "nbmcucumber",
        "created_utc": 1581974094,
        "id": "f5ftfq",
        "num_comments": 115,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "This is it bois. $AAPL puts",
        "url": "https://www.cnbc.com/2020/02/17/apple-warns-on-coronavirus-it-wont-meet-revenue-guidance-because-of-constrained-iphone-supply-and-suppressed-demand-in-china.html?__source=iosappshare%7Ccom.apple.UIKit.activity.CopyToPasteboard",
        "created": 1582002894.0
    },
    {
        "author": "dillobro",
        "created_utc": 1581363659,
        "id": "f1vlfq",
        "num_comments": 113,
        "num_crossposts": 0,
        "selftext": "In the past year (TTM) Apple's share price has grown roughly 90%. In my opinion, that is the next 5 years of growth already allocated to the shareholder. Therefore, as mentioned in the title, why would you buy it today?\n\nMoney compounds and it is objectively harder to double the size of a company worth $1.4T than $700B. Therefore, I truly believe AAPL is not a good buy at its current price.\n\nInterested to know the sub's thoughts on this matter.",
        "subreddit": "stocks",
        "title": "For AAPL to experience 100% growth at this current moment, they'd become a $2.8T market cap. Based on historical pricing of a PE of 13, that'd mean they'd have TTM earnings of $215B. Therefore, is AAPL really that great of a buy?",
        "url": "https://www.reddit.com/r/stocks/comments/f1vlfq/for_aapl_to_experience_100_growth_at_this_current/",
        "created": 1581392459.0
    },
    {
        "author": "Brendan2526",
        "created_utc": 1582850591,
        "id": "fam55c",
        "num_comments": 108,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "RobinHood",
        "title": "Why such a high return on a long shot of a call?? $AAPL",
        "url": "https://i.redd.it/koz5byby9kj41.jpg",
        "created": 1582879391.0
    },
    {
        "author": "LiquidityMan",
        "created_utc": 1581295224,
        "id": "f1i60f",
        "num_comments": 103,
        "num_crossposts": 0,
        "selftext": "Cities like [Shenzhen, Shanghai and Beijing](https://www.scmp.com/news/china/society/article/3049740/chinese-cities-keen-get-back-work-coronavirus-concerns-grow) will return to work amid the coronavirus outbreak, although schools and universities will remain closed until further notice.\n\n&gt; Companies that did reopen their doors must ensure their workplaces were properly ventilated and avoid using centralised air conditioning systems because they could help spread the coronavirus, the government said.\n\n&gt; To help with the massive influx of people back into the city, 16 checkpoints have been set up at the Hongqiao transport hub in central Shanghai, which links the airport to the intercity high-speed rail network and local subway network.\n\n&gt; On workdays, between 1.2 million and 1.5 million pass through the hub. Authorities in the city said they were alarmed that more than 100 people passing through the Hongqiao hub in the last few days had had a fever.\n\n&gt;Several major employers in Shenzhen have already announced they will not be restarting production on Monday.\n\n&gt; Foxconn, a contract manufacturer that produces iPhones for Apple, told its employees not to return, and has even refitted some of its production lines to make face masks for its workers.",
        "subreddit": "wallstreetbets",
        "title": "Major Chinese Cities Return to Work, Cautiously",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f1i60f/major_chinese_cities_return_to_work_cautiously/",
        "created": 1581324024.0
    },
    {
        "author": "splityoassintwo",
        "created_utc": 1582157515,
        "id": "f6k556",
        "num_comments": 101,
        "num_crossposts": 0,
        "selftext": "Alright fellow autismos listen up. If the beer virus doesn't tank the market this is freest money you will ever see. Semiconductor stocks are way up, AMD and NVDA are printing like crazy. AAPL is still putting up impressive numbers in spite of the guidance adjustment they just gave. As some of you may know most of the big semiconductors are reliant on two companies. Here's a chart to show where the money goes:\n\nhttps://preview.redd.it/v0obj5ffxyh41.png?width=2338&amp;format=png&amp;auto=webp&amp;s=efb986fbced13dc0118b0af6ae24c209004810c6\n\nGlobal Foundries is a private fabricator (sorry no tendies on these guys), they focus on the older 14nm process (they tried 7nm and gave up because they found it was unaffordable to outfit a plant to fab the chips. Because of this IBM switched to Samsung for it's next-gen chips). Intel is also famously struggling to get 7nm up and running. Only two companies really have play in the 7nm space, Samsung and TSMC (traded as TSM) Taiwan Semiconductor Manufacturing Company. TSMC is largest dedicated semiconductor foundry in the world. Qualcomm, Nvidia, AMD, and Apple all buy chips from TSMC. The more each of these companies is in demand, the more money TSMC makes. Their competition is weak right now, Samsung Semiconductor is huge, but you can't invest in them, and they only really make chips for their phones sold outside the US and for IBM (and those chips are for supercomputers, servers, and mainframes not for consumers). They mostly focus on DRAM and SSDs. TSMC is a position right now where it is indispensable to a lot of the worlds largest corporations (Alphabet, Microsoft, Apple, and Amazon all use TSMC products). Right now all these companies are on an absolute tear. TSMC announces earning on April 16th and option prices are ripe. Go get them tendies boiz.",
        "subreddit": "wallstreetbets",
        "title": "Semiconductors for Dummies (TL;DR buy TSM $65C 4/17)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f6k556/semiconductors_for_dummies_tldr_buy_tsm_65c_417/",
        "created": 1582186315.0
    },
    {
        "author": "CrucifictionGod",
        "created_utc": 1582077875,
        "id": "f63bmc",
        "num_comments": 94,
        "num_crossposts": 0,
        "selftext": "Currently i have stock in...\n\n* Google $3k\n* Microsoft $2.5k\n* spce (gonna sell) $2.3k\n* nvidia $1.5k\n* reml $1.4k\n* wwe $1k\n* snap $1k\n* apple $500\n* fb $134\n* apme $20\n* Tesla $15\n* amazon $12\n\nGonna get rid of space and prob nvidia soon  \nThinking i want to invest long term. Should i take more of something like amazon, Facebook, Tesla? Should i pickup Visa/Mastercard/American express or something? Have taxes coming soon and will have 7k to play with. My car is paid off, i have a house and no credit card debt.",
        "subreddit": "stocks",
        "title": "What to invest in",
        "url": "https://www.reddit.com/r/stocks/comments/f63bmc/what_to_invest_in/",
        "created": 1582106675.0
    },
    {
        "author": "abuqasar",
        "created_utc": 1581441101,
        "id": "f2bdwd",
        "num_comments": 90,
        "num_crossposts": 0,
        "selftext": "Alright, fellow autists, new and ready to be screwed but here's some AMD DD for you schmucks. Inverse me cause I'm totally off my rocker and my day job has nothing to do with stonks or trading. You've been warned.  \n\n\nAMD having recently broken resistance at 50 is looking to scale even greater heights. Its lining up a very strong run-up for 2020, having ripped market share from Intel in Q4 2019 and Q1 2020.  \n\n\nBreaking down into points for all the illiterate:  \n\n\n**POINT 1: APPLE CURRENTLY TESTING AMD CHIPS IN MACBOOK PROs**  \nDevelopers have found snippets of code suggesting that Apple developers were testing AMD chips within the kits. [AMD new chips are almost exactly the multi-core solution](https://www.digitaltrends.com/computing/why-apple-should-ditch-intel-for-amd/) apple need and If this pans out they may replace Intel in the near future\n\nThis leads us nicely into the next point...\n\n**POINT 2: APPLE WANTS TO DITCH INTEL**  \nIntel has famously suffered from shortages leading to Apple blaming them in slumps in sale in [May 2019](https://www.techradar.com/sg/news/apple-blames-intels-processor-shortage-for-slump-in-mac-sales). They still can't get their shit together and [cant even confirm  if they can meet 2020 production.](https://marketrealist.com/2019/12/intels-cpu-shortage-impact-chip-giants-pc-makers/).  \nThey even wrote an [apology letter.](https://www.zdnet.com/article/intel-sorry-for-pc-chip-delays-but-we-just-cant-meet-demand-for-cpus/) Apple are looking to jump ship and AMD are starting to look like a luxury yacht. [Expect a JUNE 3rd Announcement at Apples Developers conference](https://www.tomshardware.com/news/apple-may-start-selling-macs-with-amd-cpus)\n\n**POINT 3: AMDs THREADRIPPERS ARE SETTING WORLD RECORDS**  \nOverclockers are using [threadrippers to clock in 5,548.71MHz.](https://www.techradar.com/news/amd-ryzen-threadripper-3990x-overclocked-at-55-ghz-is-setting-world-records) This is a day after release, with overclockers till continuing to tweak and optimize their rigs. Expect top tier sales from this bad boy from PC geeks worldwide\n\n**POINT 4: AMDs are in BOTH the PS5 and in the XBOX Series X**   \nBoth console giants are will be utilizing [AMD processors in their consoles](https://www.techradar.com/sg/news/could-amd-smartshift-be-the-ps5-and-xbox-series-xs-secret-sauce-for-8k-gaming). What else do I have to explain? Its videogames everyone and their uncle is gonna have one.  \n\n\n**POINT 5: AMD WILL STILL BE RELEASING COMPETITIVE GPUS (BIG NAVI) AND CPUS (ZEN3)**\n\nRumors of a GPU releasing March 3 (supposedly an RTX2080 TI Killer) have been circulating, we may not see this date but [Su BAE herself has confirmed a 2020 release](https://www.tweaktown.com/news/70025/amd-ceo-dr-lisa-su-confirms-see-big-navi-2020/index.html).  \n[ZEN 3 Architecture was also confirmed by Queen Su](https://www.techradar.com/news/amd-zen-3) and will upgrade the company's mobile offering substantially.\n\nEND OF POINTS  \n\n\nBased on all the above, I believe AMD will see tremendous progress as a company and in its stock price. If it can survive any negative corrections, we may never see these prices again. If you want to YOLO on *actual* company doing disruptive things in its industry this is it.  \n\n\nDISCLAIMER: I don't currently own any positions in AMD all my money is with SATYA for 20/3. I am planning to roll tendies into AMD once I have closed  \nI am looking at \n\n20/6 80c\n\n18/7 80c\n\nLEAPS @ 80c-90c\n\nDISCLAIMER 2: I am not your financial consultant, broker or investment advisor I am a random stranger on the internet and am not liable for any of your bad decisions. Gamble at your own risk \n\nThank you for coming to my TED talk now go out there and get some tendies boys",
        "subreddit": "wallstreetbets",
        "title": "AMD LONG To Mars DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f2bdwd/amd_long_to_mars_dd/",
        "created": 1581469901.0
    },
    {
        "author": "someBODYoncetoldmie",
        "created_utc": 1580639476,
        "id": "exmmn3",
        "num_comments": 87,
        "num_crossposts": 0,
        "selftext": "Last week I correctly predicted TSLA, AAPL, MSFT and AMZN for some great tendies. Now, after hours of browsing this subreddit, I've decided which earning stocks will give free tendies next week.\n\n**GOOGLe** is prolly the hardest one to predict. It has been tumbling for a few days now and monday it'll probably fall even harder so it's a cheap buy. Even if the earnings fall flat it'll quickly recover anyways because it's fuckin' google.\n\n**DISney** has also been tumbling a bit and will MOON with earnings. They had lots of great Star Wars shit (Mandalorian, themepark...) and disney + will do great cuz it just will. Don't bet against the mouse.\n\n**ATVIsion Blizzard** will MOON the hardest of 'em all. They're cheap right now and last year was gr8. They keep selling shit and Classic is a thing. They had lots of shit like Hong Kong and now with their newest game being a huge flop which drives the stock down but guess what? Earnings don't give a shit about that! Everyone's busy jerking off because Blizzard made another 69 billion from their cash shop.\n\nSource: am 140 IQ autist",
        "subreddit": "wallstreetbets",
        "title": "Predictions for next week's earnings (LITERALLY FREE MONEY) (CANNOT GO TITS UP)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/exmmn3/predictions_for_next_weeks_earnings_literally/",
        "created": 1580668276.0
    },
    {
        "author": "isShark",
        "created_utc": 1581370959,
        "id": "f1xhff",
        "num_comments": 86,
        "num_crossposts": 0,
        "selftext": "The question is when to sell options. Many recommended selling for a 20% gains or have a target when buying. I sold these call options at noon, and then they increased more in value. \n\nI made great gains but still feel like a dick.\n\nAMD, MSFT, GOOGL, AAPL (loss)",
        "subreddit": "wallstreetbets",
        "title": "When do I Sell?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f1xhff/when_do_i_sell/",
        "created": 1581399759.0
    },
    {
        "author": "Davidvg14",
        "created_utc": 1582859843,
        "id": "fao7j9",
        "num_comments": 86,
        "num_crossposts": 0,
        "selftext": "Doesn’t matter the strike. Doesn’t matter the date. Literally every company is coming out TELLING US ALL that their earnings projections were not ready for Corona Virus. Everyone from Apple, Microsoft, to the next meme stock is getting hammered. \n\nSome pharma companies are mooning because boomers want to fund a vaccine, but it’ll get uglier before it gets better. \n\nGodspeed you 🐻 cubs!!\n\nPosition: cashed SPY 2/28 310 puts for gain; move into more puts for 3/6 302 &amp; 298",
        "subreddit": "wallstreetbets",
        "title": "You’re an idiot if not buying puts",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fao7j9/youre_an_idiot_if_not_buying_puts/",
        "created": 1582888643.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1582407417,
        "id": "f7za5x",
        "num_comments": 83,
        "num_crossposts": 0,
        "selftext": "https://finance.yahoo.com/news/warren-buffett-berkshire-hathaway-top-15-stock-holdings-153736237.html\n\nSome of the top holdings include American Express (AXP), Apple (AAPL), Bank of America (BAC), and Delta Airlines (DAL), according to Buffett’s widely-read annual letter.\n\nBerkshire's stock investments delivered unrealized gains of $53.7 billion in 2019 as stocks surged to all-time highs.",
        "subreddit": "StockMarket",
        "title": "Here are Warren Buffett's top 15 stock holdings",
        "url": "https://www.reddit.com/r/StockMarket/comments/f7za5x/here_are_warren_buffetts_top_15_stock_holdings/",
        "created": 1582436217.0
    },
    {
        "author": "kerit96",
        "created_utc": 1582660321,
        "id": "f9fzvk",
        "num_comments": 81,
        "num_crossposts": 0,
        "selftext": "Whenever I see media commentary on how well, or poorly, the DOW is doing on any given day I get irrationally annoyed by how meaningless that index is compared to others, and how people in the financial media should know better than to use it as an indicator of market performance. \n\nContext: I work in institutional investing and part of my job is analyzing investment funds to allocate capital to for a multi-billion dollar portfolio. So I spend a lot of time considering benchmarks to judge relative performance of the potential funds...no one uses the DJIA, and if they did they would get laughed out of the room. \n\nThe reason for this is how the DOW is constructed compared to other indices. The DOW is made of 30 large blue chip stocks (nothing wrong with this part) but it weights those companies based on their stock price. Stock prices are arbitrary, you could have a $10bil market cap company have a higher stock price than a $100bil market cap company just because they have fewer shares outstanding. Based on how the DJIA is constructed a smaller company can have an outsized impact on “the market” if we take the DOW as the ideal representative. \n\nTake Boeing and Apple, both are part of the DOW. As I write this Boeing’s share price is ~$305 and it’s market cap is ~$180bil, Apple’s share price is ~$290 and it’s market cap is $1.3T. Based on how the DJIA is weighted Boeing represents more of the “market” than Apple, despite being ~1/10 the actual size. \n\nOther indices, like the S&amp;P 500 are market cap weighted, so larger companies actually represent a proportional size of the “market” thus giving a better indication of how the market is actually performing. \n\nThank you for humoring my rant, and hope you all fair well as the S&amp;P is looking at another day of losing 3%.",
        "subreddit": "investing",
        "title": "No one should care about the DOW (DJIA)",
        "url": "https://www.reddit.com/r/investing/comments/f9fzvk/no_one_should_care_about_the_dow_djia/",
        "created": 1582689121.0
    },
    {
        "author": "chandler_bling1",
        "created_utc": 1582750073,
        "id": "f9zyop",
        "num_comments": 80,
        "num_crossposts": 0,
        "selftext": "Everything down but I’m holding everything (AAPL, AMD, Eth, MST, SQ, Zoom, Nio, Nvidia, TSLA) except SPCE which I finally decided to take the profit and run.\n\nIs there any stocks that that you think will grow despite world events and burgeoning pandemic?",
        "subreddit": "stocks",
        "title": "Any Corona-proof stocks you’re looking to buy",
        "url": "https://www.reddit.com/r/stocks/comments/f9zyop/any_coronaproof_stocks_youre_looking_to_buy/",
        "created": 1582778873.0
    },
    {
        "author": "Pancakeass420",
        "created_utc": 1582849055,
        "id": "fals2y",
        "num_comments": 79,
        "num_crossposts": 0,
        "selftext": "Let’s face it, puts are the move right now, so what puts are y’all picking up tomorrow? Thinking between doubling down on Disney or maybe picking up some more MSFT, SPY, or AAPL. What’s the move for all the gains?",
        "subreddit": "wallstreetbets",
        "title": "Calling Tendie Makers",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fals2y/calling_tendie_makers/",
        "created": 1582877855.0
    },
    {
        "author": "BlindTiger86",
        "created_utc": 1582727094,
        "id": "f9tyww",
        "num_comments": 76,
        "num_crossposts": 0,
        "selftext": "[https://www.latimes.com/business/story/2020-02-25/tesla-autopilot-crash-hearing](https://www.latimes.com/business/story/2020-02-25/tesla-autopilot-crash-hearing)",
        "subreddit": "investing",
        "title": "NTSB slams Tesla, Apple and regulators over a fatal Autopilot crash",
        "url": "https://www.reddit.com/r/investing/comments/f9tyww/ntsb_slams_tesla_apple_and_regulators_over_a/",
        "created": 1582755894.0
    },
    {
        "author": "Whatsanoption",
        "created_utc": 1581229618,
        "id": "f14u96",
        "num_comments": 70,
        "num_crossposts": 0,
        "selftext": "Am I the only one that thinks this company is criminally undervalued? \n\nIt blows my mind that this is worth so little after Friday compared to their main competition Purple. Purple is really a lot worse subjectively and the only thing they got going for them is they actually manufacture their own product. Look, you can tell me that same old shit about people worried about revenue and profit, but we all fucking know that shit doesn’t really matter. Comparing this to WeWork is the stupidest shit ever. The type of people saying this shit are idiots. I watched a CNBC segment with some dude who claimed he prefers his mattress delivered by two guys and a truck the old fashioned way and that boxed-mattresses are too “Amazon”. \n\nThere are 178 boxed mattress companies, and many companies fit within a few niches: Avocado is the king of boxed mattresses for people who shop at Goop, Bear makes mattresses for retards and athletes alike, and Nectar is just skipping the middle man and importing shit from China to be the cheapest. Some companies however, such as Tuft &amp; Needle, Leesa, Purple, and a few others to some degree try to make a wide variety of mattresses and sleep products to fit every need. If those companies are Android, then Casper is Apple. Who else opens up sleek experience-centered showrooms? Casper has 60 currently, and plan to have over 200 in the near future. Retail is obviously dead, but Casper is opening up stores for the same reason Apple does. Also, people usually want to try out the mattress before they buy it, thats why so many mattress stores exist (and money laundering, but I'll save that story for another time). \n\nAnother thing that I love about Casper is that they really don't care about mattresses, their end goal is to takeover everything related to sleep. Target reported 2/5 of their top selling vitamins are for sleep. People buy weighted blankets and shit now like they never did before. All I ever see on youtube is ASMR. If Casper where to be able to take control of the entire sleep market, shit would low-key be huge. I completely believe they not only have the ability to, but the ambition unlike their competitors who may only be focused on capitalizing on new and emerging boxed-mattress-related-niches as listed above. \n\nLook, I could go into all the very very juicy details I've uncovered in my investigation of Casper and the boxed mattress industry as a whole (Including but not limited to smoking gun evidence that one of their main competitors is a huge fraud), but I'd rather hear what other people have to say given that I literally sleep on a Casper mattress. Please come at me with your most bearish arguments. Tell me why this is a piece of shit and I shouldn’t sink all my money into it.",
        "subreddit": "wallstreetbets",
        "title": "Lets Talk About Casper",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f14u96/lets_talk_about_casper/",
        "created": 1581258418.0
    },
    {
        "author": "blueplatespaysul",
        "created_utc": 1581816359,
        "id": "f4ja5w",
        "num_comments": 69,
        "num_crossposts": 0,
        "selftext": "https://www.reddit.com/r/apple/comments/f4amh0/2020_macbook_pro_13_benchmark_leak_shows_30_gpu/\n\nComments say it might release next month",
        "subreddit": "wallstreetbets",
        "title": "Get your AAPL calls ready. New faster MacBook Pro should drop in March",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f4ja5w/get_your_aapl_calls_ready_new_faster_macbook_pro/",
        "created": 1581845159.0
    },
    {
        "author": "nerdyspartan12",
        "created_utc": 1581981638,
        "id": "f5hrv5",
        "num_comments": 69,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Warren Buffett sold apple stonks(worth 800 millions), any indicator?",
        "url": "https://markets.businessinsider.com/amp/news/warren-buffett-sold-800-million-apple-stock-last-quarter-2020-2-1028910204",
        "created": 1582010438.0
    },
    {
        "author": "anonimirl",
        "created_utc": 1582310836,
        "id": "f7flzy",
        "num_comments": 67,
        "num_crossposts": 0,
        "selftext": "Hello, probably this post will be pointless to most of you but let's have a talk about SPCE here.\n\nAs we know SPCE is relatively new company, so it's price will be really volatile for a while, that bubble was based on a lot of hype regarding this company (same as Tesla), it's down right now as stocks market is down right now either I see a lot of people calling this company useless (like pump and dump stock) but this company has a lot of potential in the future, it will reach much higher price in the future, don't forget that all companies prices goes up and down, of course SPCE is not Apple which is new and causes a lot of uncertainty of its future.\n\nRemember Tesla and short sellers who got painfully burnt by short selling it who thought Tesla was a failure? It was the most short selling stock as I remember, so it says a lot how many people doubted it as it was new company, caused same uncertainty. Same noise against it calling it \"meme stock\", now this \" meme stock\" is doing better than any time before, only people who believed it made a lot of profit of it.\n\nI strongly believe in SPCE future and maybe there are more people who believe in this company and decided to hold its stocks?",
        "subreddit": "stocks",
        "title": "I really don't understand all that noise against SPCE",
        "url": "https://www.reddit.com/r/stocks/comments/f7flzy/i_really_dont_understand_all_that_noise_against/",
        "created": 1582339636.0
    },
    {
        "author": "Fractoos",
        "created_utc": 1582217527,
        "id": "f6vvgr",
        "num_comments": 65,
        "num_crossposts": 0,
        "selftext": "The investment bank told clients this week that a near-term correction, in which the market slides at least 10% from a recent peak, \"is looking much more probable.\"\n\nThe thinking: Equity markets look \"increasingly exposed\" to disappointing earnings growth due to the new coronavirus outbreak, Goldman warns.\n\nThe number of companies that have lowered their guidance on profits for the first quarter is still in line with past years. But Apple's surprise update this week that it wouldn't hit its revenue target has put investors on edge.\n\nGoldman Sachs notes that the global economy is expected to keep growing, and the United States is, too, despite the country already having experienced its longest economic expansion in 150 years. That creates a supportive environment for stocks. But the bank is concerned that earnings expectations could still be too rosy, especially given the exposure of global companies to the Chinese economy.\n\nApple, it observes, has been \"an important driver\" of better-than-expected earnings results. Big Tech companies — Facebook, Amazon, Apple, Microsoft and Google — beat earnings expectations by 20% on average last quarter, compared with 4% for the average S&amp;P 500 company.\n\n\"Any weakness to these and other companies would likely push earnings estimates lower,\" wrote Peter Oppenheimer, the firm's chief global equity strategist.",
        "subreddit": "stocks",
        "title": "Goldman Sachs warns of stock market correction",
        "url": "https://www.reddit.com/r/stocks/comments/f6vvgr/goldman_sachs_warns_of_stock_market_correction/",
        "created": 1582246327.0
    },
    {
        "author": "photowanderer",
        "created_utc": 1581316954,
        "id": "f1mipx",
        "num_comments": 63,
        "num_crossposts": 0,
        "selftext": " [https://www.cnbc.com/2020/02/10/some-factories-in-china-extend-shutdowns-amid-coronavirus-outbreak.html](https://www.cnbc.com/2020/02/10/some-factories-in-china-extend-shutdowns-amid-coronavirus-outbreak.html) \n\nRegarding Apple:  Reuters reported Monday, citing a person familiar with the matter, Foxconn received approval to resume production at a facility in Zhengzhou. But the company is still “trying very hard” to get clearance to reopen plants in other parts of China, Reuters reported.",
        "subreddit": "investing",
        "title": "China remain shuttered as some regions extend shutdowns amid coronavirus quarantine efforts",
        "url": "https://www.reddit.com/r/investing/comments/f1mipx/china_remain_shuttered_as_some_regions_extend/",
        "created": 1581345754.0
    },
    {
        "author": "finca3eo",
        "created_utc": 1580750936,
        "id": "eyaiby",
        "num_comments": 61,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\n|TSLA|\\+56%|\n|:-|:-|\n|BTC (Bitcoin)|\\+28%|\n|AMZN|\\+9%|\n|MSFT|\\+8%|\n|TLT (long-term treasuries)|\\+8%|\n|VXX (volatility)|\\+7%|\n|GOOGL|\\+7%|\n|AAPL|\\+5%|\n|GLD (Gold)|\\+4.5%|\n|QQQ (Nasdaq 100)|\\+3%|\n|AGG (Bonds)|\\+2%|\n|SPY (S&amp;P 500)|\\-0.04%|\n|IWM (Small Caps)|\\-3%|\n|FXI (China)|\\-9%|\n|USO (Oil)|\\-15%|",
        "subreddit": "investing",
        "title": "January in a nutshell... congrats TSLA bulls",
        "url": "https://www.reddit.com/r/investing/comments/eyaiby/january_in_a_nutshell_congrats_tsla_bulls/",
        "created": 1580779736.0
    },
    {
        "author": "hashtag_wills",
        "created_utc": 1581449389,
        "id": "f2dia4",
        "num_comments": 58,
        "num_crossposts": 0,
        "selftext": "A lot of you seem to be confused on what the fuck ROKU's business model actual is. THEY ARE NOT A HARDWARE COMPANY. ROKU is in the Ad business building a *big, next-generation’ targeted ad platform.*\n\nAs more and more people cut the cable, they will have to turn to ROKU's platform, or should I say 'ecosystems' to stream their favorite cable channels and networks. ROKU will take a % of this and be one of the largest in America, since anyone, anywhere with an internet connection can use roku to stream TV. The primary competitor is not other services on the platform, the primary competitor is linear tv - and ROKU has them beat.\n\n**Let's look at some numbers:**\n\n* Roku sells more dedicated streaming devices than perhaps any other company in the world. It’s been estimated that there are more Rokus in US households than there are Fire TVs, Chromecasts, or Apple TVs. Estimates say 40% of all TV's sold are Roku TV's. \n* If you read through [ROKUs dev SDK](https://developer.roku.com/docs/developer-program/advertising/roku-advertising-framework.md), you'll see they force their channel partners to use *their* ads taking a cut of all profits and subs made by, FOX, Disney+ etc.\n   * *Entertainment firms pay a carriage fee to be on the cable lineup.* Roku has built itself up as an advertising company, getting a cut of the ad revenues from major media partners in exchange for the distribution. \n   * **Roku's 2019 revenues**, **67% of Roku's $1.1 billion in revenues came from ads**. Growing to $1.6 billion in 2020, with the bulk coming from advertising again. Which amounts to the revenue base more than doubling (111% projected growth rate between 2018-2020.\n* ROKU's CEO went into a [Mexican standoff with FOX](https://amp.usatoday.com/amp/4623654002) and fucking wonn. The guy has balls, ROKU got the superbowl and cucked FOX.\n\n**Guidance:**\n\n* Millions more to cut their 'cable' in 2020 and pick it back up on ROKU enabled devices and TV's\n* ROKU will announce (soon) something with COMCAST \n\n**ROKU beats earnings. Long ROKU.**",
        "subreddit": "wallstreetbets",
        "title": "ROKU Beats",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f2dia4/roku_beats/",
        "created": 1581478189.0
    },
    {
        "author": "1poundbookingfee",
        "created_utc": 1581377886,
        "id": "f1z87i",
        "num_comments": 56,
        "num_crossposts": 0,
        "selftext": "Having memed MSFT to nearly $200 (check post history for the one right after the TSLA bloodbath), I'm looking around for the next big one. Most recently my company has been hiring a lot of young girls straight out of college, so these are image conscious girls each with at least $80k to blow a year plus a good amount of whatever their Chads are buying.\n\nNow the entire market is pumping up tech with huge multiples extensions and that got me thinking. The next meme stock has got to be tech, sexy and adored by these rich girls. I was thinking of AAPL.",
        "subreddit": "wallstreetbets",
        "title": "What's the next meme pump stock? Something in tech and Becky?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f1z87i/whats_the_next_meme_pump_stock_something_in_tech/",
        "created": 1581406686.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1581976458,
        "id": "f5gg75",
        "num_comments": 55,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2020/02/17/apple-warns-on-coronavirus-it-wont-meet-revenue-guidance-because-of-constrained-iphone-supply-and-suppressed-demand-in-china.html\n\nApple said Monday it would not meet its second-quarter forecast for revenue.\n\nThe company cited global supply constraints for iPhones and lower Chinese demand as a result of the coronavirus outbreak.\n\nApple said in late January that it expected revenue of $63 billion to $67 billion in its fiscal second quarter.",
        "subreddit": "stocks",
        "title": "Apple cuts revenue guidance due to production delays, weak demand in China because of coronavirus",
        "url": "https://www.reddit.com/r/stocks/comments/f5gg75/apple_cuts_revenue_guidance_due_to_production/",
        "created": 1582005258.0
    },
    {
        "author": "triton100",
        "created_utc": 1582552485,
        "id": "f8rj3w",
        "num_comments": 53,
        "num_crossposts": 0,
        "selftext": "Obviously was also down nearly 3 % the Friday before and a fe percent prior to that.",
        "subreddit": "investing",
        "title": "Oof Apple down 4 % premarket -and dropping...",
        "url": "https://www.reddit.com/r/investing/comments/f8rj3w/oof_apple_down_4_premarket_and_dropping/",
        "created": 1582581285.0
    },
    {
        "author": "JimmyJKKKkkkkkkkkj",
        "created_utc": 1582328614,
        "id": "f7jzrn",
        "num_comments": 52,
        "num_crossposts": 0,
        "selftext": "* Okay. Let's get some shit out in the clear first. The way forward for gaming is **game streaming** by game streaming I mean cloud gaming services like Googles Stadia.\n* First of all **Why?**\n* Hardware is expensive in gaming. Like very expensive consider your gaming pc a goos high end gaming pc can easily be worth in excess of several *thousand* dollars which is often an upfront cost most casual gamers *cannot afford to cough up* andd most importantly if the latest games keep getting more intensive on ram and cpu you will need to upgrade it eventually anyway. This means that any cloud gaming service like Nvidia's GEFORCE NOW which is free for an hour of gaming before you need to relog or for roughly 5 pounds a month you can play with decent fps on almost any steam game (something which stadia doesn't allow you to do and is more expensive with an even smaller game pool to play on). Even if you have a MAC you can play steam games which is huge for the gaming market in general.\n* **What does this mean for my AMD tendies?**\nBasically AMD doesn't have a streaming service able to compete with Geforce Now. Geforce now has been in apply only beta for **3 fucking years already** and has accumulated 1 million users  before it went free for everyone to access use provided they queue for available slots on the service (if they have a free account that is (you starting to see the hook and draw tactic Nvidia is playing here?)). Amd is literally stuck in the past making hardware plays whilst Nvidia storms ahead in the game streaming market. Who cares is AMD is hooking up with Apple for a swanky new Mac if people wouldn't need to upgrade to said swanky new Mac cuz their getting their gaming and other capabilities on their old Mac's using Geforce Now. \n\n* **Okay I hear you, most people don't buy Mac's for gaming anyway**\nBut... amd is fundamentally a graphics card company and if you look at it in the perspective of a games streaming service such as Nvidias which already had a massive user base BEFORE it went public and easy to access. The growth potential on Nvidia rn is crazy. \n**So now that Geforce NOW has gone free and easily accessible how are the average consumers reacting?**\nOkay firstly there isn't a lot of statistics for this out yet considering Nvidia has only just fully released it from beta two weeks ago. However, whilst playing recently it has been impossible to miss a **sharp rise in people talking about and using geforce now in game** the ability to play any game regardless of your pc and only requiring a good internet speed (see starlink for any doubters that this will hold geforce now back) is too amazing to pass up on. The average user if they get the 5pound subscription will only spend like 60 bucks a year on Geforce Now compared to the 1000 they would have to spend to upgrade their pc. Also the versatility of geforce now is frankly scary. Consider playing games on ur phone,  TV, or anything for that matter. All u need is a good internet speed.\n**In summary** for this section is suspect geforce now is going through a period of **rocket** growth **you heard it here first** keep an eye on Q2 and Q3 NVDA to see whether or not they start talking about the potential there. Amd is legit getting slept on here I'm telling u\n\n* **TLDR** NVDA is developing a Netflix of game streaming that AMD is sleeping on and is UNDERCUTTING and OUTPERFORMING and quite honestly probably out selling google stadia. With 1 million beta users before going publicly available the growth potential is huge. **BUY NVDA longs at NVDA bottom and hold for YEAR END.**",
        "subreddit": "wallstreetbets",
        "title": "Go LONG on NVDA (we're looking at 6-12 months here folks DD below)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f7jzrn/go_long_on_nvda_were_looking_at_612_months_here/",
        "created": 1582357414.0
    },
    {
        "author": "nachocheeze98",
        "created_utc": 1582177808,
        "id": "f6ojpn",
        "num_comments": 51,
        "num_crossposts": 0,
        "selftext": "Welcome to my ted talk... \nfor those who are done YOLO’ing all their money here’s another one for you. DISNEY reported good numbers, awesome Disney+ subscribers and its fucking Mickey Mouse. its ~%10 below its high and on the 180 sma resistance. \n\nThe stock did not go up on earnings due to fear of coronavirus and we all know it’s nothing to worry about, look at $AAPL after saying they’re going to miss expectations for the fucking virus and still managed to go up. The market is making record highs and Disney is the only lazy fucker that won’t go up... yet\n\nBalance shit is good, technicals are good, why not yolo a bit on this one?\n\nAlso check ($CYBR) could do a deeper breakdown for that one if I get some clout",
        "subreddit": "wallstreetbets",
        "title": "Hear me out $DIS",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f6ojpn/hear_me_out_dis/",
        "created": 1582206608.0
    },
    {
        "author": "forevalearning",
        "created_utc": 1582606979,
        "id": "f951e4",
        "num_comments": 49,
        "num_crossposts": 0,
        "selftext": "TSMC (traded as TSM) Taiwan Semiconductors is the largest dedicated semiconductor foundry in the world supplying  Nvidia, AMD, Qualcomm, Huwaei and Apple chips.\n\nApple iPhone se2/iPhone 9 uses A13 chips manufacturered by TSM. Already exceeding demand, TSM increased production. Recent report from Taiwan is Coronavirus hasn't affected TSMs production line to a great extent. Still having the same guidance for the current quarter.\n\nApple is currently expecting to sell 20 million iPhone 9s to be sold in the next quarter.\n\n**TSMC locked in 5nm A14 Bionic for AAPL, 7nm Big Navi for AMD, and 7nm Ampere for NVDA. Apple is expected to sell over 100 million iPhone 12s this year and the A14 chip production starts soon, the best part is TSM recently announced bear virus won't affect their production output and it's business asusual**\n\nThey are also expanding rapidly to meet the rising global demand for chips. PS5 and Xbox Series X chips are also produced by them. They are selling chips faster than they can make them.\n\nTSM is fluctuating between 59 to 53 for a while due to bear virus news. But found support at 53/54 and is due for a spike soon before Apple late March event. \n\nTSMC Hires Ex-Intel Lobbyist to Deal With U.S.-China Tensions and continue supplying Huwaei.\n\nJuly 17 &amp; April calls are on sale for a short period of time.",
        "subreddit": "wallstreetbets",
        "title": "TSM DD., Load some cheap April/July calls boyzz.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f951e4/tsm_dd_load_some_cheap_apriljuly_calls_boyzz/",
        "created": 1582635779.0
    },
    {
        "author": "ForexMonkey",
        "created_utc": 1581277066,
        "id": "f1drbd",
        "num_comments": 48,
        "num_crossposts": 0,
        "selftext": "Hello degenerates,\n\nThe market is seriously downplaying the risk that Corona has on the world economy. China has extended the shutdown of their factories by another week and this will not. Corona virus has shut down all of the street traffic in Wuhan and many other parts of China out of fear. Corona virus also has the ability to live on plastics (or any material) for 28 days. If they open factories back up and sick people are working, they will essentially be shipping the virus world wide...\n\nApple has shut down stores and 1/5 of their revenue comes from China. They also produce their new iPhones at this time of the year. Any delay now will just result in a delay later. This will slowdown the rollout of 5g.\n\nAlso, imagine those who have loans for their businesses. They aren't making any money and won't be for who knows how long what happens to the credit market in China?\n\nONE BY ONE PEOPLE WILL START TO THINK OF THESE THINGS AND MUCH PROFITS WILL BE MADE, CHEERS DEGENS",
        "subreddit": "wallstreetbets",
        "title": "CORONA VIRUS THREAT DOWNPLAYED (MUCH PROFITS AROUND THE CORNER)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f1drbd/corona_virus_threat_downplayed_much_profits/",
        "created": 1581305866.0
    },
    {
        "author": "n0tfakenews",
        "created_utc": 1581726032,
        "id": "f41hfg",
        "num_comments": 48,
        "num_crossposts": 0,
        "selftext": "Warren Buffett's Berkshire Hathaway 13F summary for the quarter ended Dec. 31, 2019:\n\nNew Stakes\nBIOGEN IDEC Inc. (NASDAQ: BIIB) new 648,447 share position\nKroger Co. (NYSE: KR) new 18,940,079 share position\nS&amp;P DEP RECEIPTS (NYSE: SPY) new 39,400 share position\nVANGUARD S&amp;P 500 ETF (NYSE: VOO) new 43,000 share position\n\nRaised Stakes\nGeneral Motors (NYSE: GM) raised from 72,269,696 shares to 75,000,000 shares\nLiberty SiriusXM Group (NASDAQ: LSXMA) raised from 14,860,360 shares to 31,090,985 shares\nOccidental Petroleum (NYSE: OXY) raised from 7,467,508 shares to 18,933,054 shares\nRESTORATION HARDWARE HOLDINGS, Inc. (NYSE: RH) raised from 1,207,844 shares to 1,708,348 shares\n**SUNCOR ENERGY, Inc. (NYSE: SU) raised from 10,758,000 shares to 15,019,031 shares**\n\nLowered Stakes\nAMERICAN AIRLINES (NASDAQ: AAL) lowered from 43,700,000 shares to 42,500,000 shares\nApple Inc. (NASDAQ: AAPL) lowered from 248,838,679 shares to 245,155,566 shares\nBank of America Corp (NYSE: BAC) lowered from 927,248,600 shares to 925,008,600 shares\nBank of New York (NYSE: BK) lowered from 80,937,250 shares to 79,765,057 shares\nGoldman Sachs Group (NYSE: GS) lowered from 18,353,635 shares to 12,004,751 shares\nPhillips 66 (NYSE: PSX) lowered from 5,182,637 shares to 227,436 shares\nThe Travelers Companies Inc. (NYSE: TRV) lowered from 5,958,391 shares to 312,379 shares\nWells Fargo (NYSE: WFC) lowered from 378,369,018 shares to 323,212,918 shares\n\nhttps://www.streetinsider.com/dr/news.php?id=16480016&amp;gfv=1",
        "subreddit": "CanadianInvestor",
        "title": "Buffett's Berkshire adds 5M shares of Suncor in Q4 2019",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/f41hfg/buffetts_berkshire_adds_5m_shares_of_suncor_in_q4/",
        "created": 1581754832.0
    },
    {
        "author": "pacosteles",
        "created_utc": 1582610898,
        "id": "f95sss",
        "num_comments": 48,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Apple starts reopening stores in China",
        "url": "https://www.cnbc.com/2020/02/24/some-apple-retail-stores-re-open-in-china-after-coronavirus-closings.html",
        "created": 1582639698.0
    },
    {
        "author": "jaydxn1",
        "created_utc": 1582788348,
        "id": "fa8hkn",
        "num_comments": 47,
        "num_crossposts": 0,
        "selftext": "  I’m amazed how irrational the market situation is, why is everyone selling off their tech stocks? \n\nWith the coronavirus and H9N1 around, every fucking body’s gonna be at home either tinkering with their tech or masturbating. This obviously leads to increase in demands for computers, phones and all that tech shit especially when shit starts breaking down and everyone wants to invest in a good entertainment device to wait out the viruses at home.\n\nWhen everyone stops leaving their homes because of the virus fear and starts locking themselves in, the revenues of tech companies are going to skyrocket. When’s the last time you ACTUALLY had sex? Never, nada. BUT when’s the last time you took a hard wank on your computer or phone? I’d say at least 3 times yesterday. \n\nDo you see pattern my fellow autists? Now is the PERFECT opportunity to buy tech calls, normies are being straight up pussies by selling off but when shit hits the ground we’ll see AAPL, MSFT, ROKU, NFLX and all literally go tits up.\n\nFuck off with that 🌈🐻 shit, the tech bulls boutta take over. That’s all for my TED Talk.",
        "subreddit": "wallstreetbets",
        "title": "Why now is the right time to buy tech.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fa8hkn/why_now_is_the_right_time_to_buy_tech/",
        "created": 1582817148.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1582991343,
        "id": "fbec77",
        "num_comments": 47,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/StockMarket. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning March 2nd, 2020.\n\n# **Stock rout may deepen in the week ahead as coronavirus impact starts to show up in economic data  - [(Source)](https://www.cnbc.com/2020/02/28/stock-rout-to-deepen-as-coronavirus-impact-starts-to-show-up-in-data.html)**\n*****\n&gt; Stock investors just experienced one of the nastiest weeks in history that recorded the S&amp;P 500′s fastest correction on record, but hold on tight, the market might have more room to fall as the coronavirus damage starts to creep into upcoming economic data, analysts warned.\n*****\n&gt; Major U.S. stock averages suffered their worst week since the financial crisis as fears about the coronavirus disrupting the global economy scared investors away from risk assets. However, stocks might still be searching for a bottom next week when investors grapple with a slew of economic data potentially dragged down by the outbreak.\n*****\n&gt; The Institute for Supply Management will release its manufacturing gauge on Monday. Meanwhile, the Federal Reserve will publish its latest Beige Book on Wednesday, which will detail anecdotal information on current economic conditions. Many expect U.S. manufacturing to have taken a hit from the coronavirus.\n*****\n&gt; “Look out for ISM surveys and Beige Book for early signs of COVID-19 impact,” Michelle Meyer, Bank of America’s head of U.S. economics, said in a note Friday. “It will take time for the ‘hard’ economic data to show the impact but we are already seeing evidence in early economic indicators.”\n*****\n&gt; Weekend action?\n&gt; The outlook for the week could be changed this weekend by coronavirus headlines or by some sort of intervention by central banks. Expectations are rising on Wall Street that there could be some potential move from the Federal Reserve to get ahead of what could be another rough week.\n*****\n&gt; Fed Chairman Jerome Powell said Friday the central bank is monitoring the coronavirus and pledged action if necessary. Meanwhile, former Fed Governor Kevin Warsh recommended the Fed act as quickly as Sunday before the markets reopen. The market is already pricing in a 100% chance of at least one rate cut at the Fed’s March policy meeting.\n*****\n&gt; Jim Paulsen, chief investment strategist at the Leuthold Group, is worried about the cascading effect of coronavirus hitting upcoming economic data points. “ISM manufacturing is going to be widely scrutinized,” he said.\n*****\n&gt; The ISM manufacturing index rose to a reading of 50.9 last month, the highest level since July (Any reading above 50 signals expansion.) Bank of America expects ISM manufacturing to pull back to 50.0 and said Fed Beige Book may provide “early insight” into the U.S. economic impact from the deadly virus.\n*****\n&gt; Cutting forecasts\n&gt; Next week, investors will also likely grapple with more warnings from major companies about broken supply chains and easing demand due to the outbreak.\n*****\n&gt; Apple, Microsoft, Nike and United Airlines have all sounded alarms that they will not meet their earnings and revenue guidance because of the virus.\n*****\n&gt; Wall Street strategists this week were quick to slash their forecasts on corporate earnings and the stock market. Barclays sees the S&amp;P 500 to end the year at 3,000, down from a previous forecast of 3,300. The bank also expects a 2% drop in profits this year. Meanwhile, Goldman said it sees zero earnings growth for American companies in 2020.\n*****\n&gt; To be sure, some believe the steep stock rout has gone too far too fast, betting on at least a small rebound.\n*****\n&gt; “The level of panic has become very extreme and the level of downside price movement is pretty extreme. All of that is to me more of a sign that we are getting closer to the beginning of the end of it,” Paulsen said.\n*****\n&gt; Another source of support could come from the Trump administration, where officials are discussing tax cuts, among other economic reactions, as one option to make up for the economic impact of the coronavirus, the Washington Post reported Friday.\n*****\n&gt; Still, investors will have to be on edge for a while now with more virus headlines, as well as the key Super Tuesday Democratic primaries. Some notable investors including “bond king” Jeffrey Gundlach blamed the rise of Democratic presidential hopeful Bernie Sanders for helping accelerate massive sell-off.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/xxV96kn.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/3XfCFrl.jpg))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/zbhTBQr.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/zASmUSl.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/wv7Xef1.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/qPOD5uN.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/2z1n5iA.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/jgqhUBR.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/j7kavSk.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/4awCCsW.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/ElXoU2T.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/xH2GYRk.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/HyXxrSJ.png))**\n###### **([CLICK HERE FOR THE CHART LINK #4!](https://i.imgur.com/GIw7Oq6.png))**\n\n*****\n\n# Gauging Potential Economic Impact of Covid-19\n\n&gt; The coronavirus outbreak—or Covid-19 —has caused significant market volatility over the past week. Our approach as always is to focus on economic fundamentals first, but the uncertainty around the scope of the outbreak has made it very difficult to assess potential impact. The situation clearly is unsettling for investors as more cases are reported across Europe and Asia, and the first case of community transmission has been reported in the United States. As this was written, the S&amp;P 500 Index was 10% below its February 19 all-time high.\n\n&gt; “The Covid-19 outbreak continues to significantly disrupt economic activity in China and throughout Asia,” said LPL Financial Senior Market Strategist Ryan Detrick. “Given that China is such a big component of many global supply chains, we will almost certainly see weaker economic data globally over the next several months.”\n\n&gt; Even as the situation remains fluid and very uncertain, we want to provide some sense of the potential U.S. and global economic impact.\n\n&gt; **China**: If virus containment holds in China, which is our base case, we could see something like a 3–4 percentage point impact to Chinese economic growth in the first quarter—possibly 2–3% gross domestic product (GDP) growth rather than 5–6%—followed by a much more modest hit in the second quarter. We think we would see a return to trend growth by the third quarter of 2020. This scenario would put China’s 2020 GDP growth below the current 5.6% Bloomberg-tracked consensus, shown in the LPL Chart of the Day, and the Chinese government’s previous 6% annual target. In other words, China’s GDP growth in 2020 could end up closer to 5% than 6%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/02/Global-econ.png?ssl=1))**\n\n&gt; United States: At this point, our base case is that any economic disruption in the United States may be modest and short-lived, as we expect domestic efforts at containment to be more successful and have less economic disruption than in China. The outbreak may trim 0.25–0.5% from U.S. GDP over the next couple of months due to global supply chain disruption, falling export demand, and decreased tourism. If evidence emerges over the next month or so that the virus is being contained successfully, as we expect, the economic impact would likely be at the better end of that range (0.25%). In that scenario, damage to business and consumer confidence would be limited, setting the stage for a potential second-quarter rebound. We believe our 1.75% U.S. GDP growth forecast may still be achievable.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/02/Global-econ2.png?ssl=1))**\n\n&gt; **Global**: In the short-term, the collective hits to global GDP from China, South Korea, Japan, and Italy—the countries where the outbreak impact has been greatest to date—may comprise 0.2–0.3% of global GDP. Our latest global GDP forecast of 3.5% from our Outlook 2020 publication is probably a bit too high in light of the latest news. We expect to update or reaffirm our economic forecasts once we have more clarity around Covid-19 impact in the weeks ahead.\n\n*****\n\n# Can the Market Bottom on a Friday?\n\n&gt; It's often said that equity markets can't bottom on a Friday. One of the reasons for this line of thinking is that during a market downturn, no one wants to hold onto or bid up equities into a weekend for fear of further bad news. It may just be a matter of semantics, but based on that line of reasoning, the more accurate way to phrase it would be that markets can't bottom on a Thursday or rallies can't begin on a Friday. However you want to think about it, the chart below shows the number of times the closing low of a 10%+ correction has occurred on various weekdays.\n\n&gt; Of the 97 S&amp;P 500 corrections since 1928, the day of the week that has marked the low close of a 10%+ decline the least frequently is actually Wednesday with only 10. Behind Wednesday, Friday has been the second most infrequent day of the week for a bottom (15), and Thursday is the only other day of the week where the S&amp;P 500 has made a low on a closing basis less than 20 times. The days of the week where the S&amp;P 500 most frequently bottoms are Monday and Tuesday with 26 and 28, respectively.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/02/022820-10-Corrections.png))**\n\n&gt; Regarding bear markets (20%+ declines), the trend is very similar. Bear markets have been the least likely to end on a Wednesday or Friday and most likely to end on a Tuesday.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/02/022820-Bear-Markets.png))**\n\n*****\n\n# Dividend Stock Spotlight: S&amp;P 500's Highest Yielders From The Sell-Off\n\n&gt; Given the lower prices of stocks, dividend yields have been on the rise over the past couple of weeks. The dividend yield of the S&amp;P 500 now stands at 2.12% which is the highest since June 3rd of last year when it reached the same level, but only stayed there for a single day. Prior to that, yields were only higher during the Q4 2018 sell-off through February of 2019. At the beginning of the current sell-off on February 19th, the S&amp;P 500's yield was 26 bps lower at 1.86%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/02/Div-yield-sp.png))**\n\n&gt; Of the individual stocks in the index, there are now 81 stocks that have dividend yields of 4% or more. That compares to only 64 at the beginning of the sell-off. In the table below, we show the 25 highest yielders of the S&amp;P 500 as well as the price change and change in the dividend yield since the 2/19 record high. As shown, there is only one stock, Macy's (M), that yields over 10% at the moment. This major retailer has fallen out of favor in the past few years but the stock has gotten crushed since the 2/19 market peak having fallen just under 21% in that time. That decline has raised the dividend yield by 2.44 percentage points, but there is one other stock that has seen its yield increase by even more. That stock is Occidental Petroleum (OXY), the second-highest yielder in the index (9.93%). Being an Energy name, OXY has fallen the most dramatically (-29.05%) since 2/19 of all the highest yielders.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/02/Highest-Yielding-table1.png))**\n\n&gt; While there is a lot of overlap, in the table below we show the stocks that have seen their dividend yields rise the most as stocks have declined since 2/19. Again OXY and M top the list. While no other stocks have seen their dividend yields increase by more than 2 percentage points, there are another 17 who have risen by at least 1 percentage point. Notably, two cruise line stocks, Carnival (CCL) and Royal Caribbean (RCL) find themselves on this list. Carnival (CCL) now yields 6.28% while Royal Caribbean (RCL) yields 4.05%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/02/Biggest-Change-yield-table.png))**\n\n*****\n\n# The Biggest Losers (and a few winners)\n\n&gt; It is no secret that energy stocks have gotten crushed this year, and the list of the 25 worst-performing stocks in the Russell 1000 since the previous record close on February 19th is a prime example of this. Seven energy stocks find themselves on this list, two of which, Chesapeake Energy (CHK) and Kosmos Energy (KOS), take up the number one and two spots having fallen 45.73% and 41.95%, respectively since 2/19. CHK had already been weak headed into the broader market sell-off with a YTD loss on 2/19 over 40%; the past week has added fuel to the fire as it is now down 68.5% YTD. Continental (CLR), Centennial Resource Development (CDEV), Transocean (RIG), and Apergy (APY) are other energy stocks that were down 20% or more on the year headed into this sell-off, and each one has fallen another 20%+ since the 19th. While most of the other biggest losers since 2/19 had already been down on the year, there are some that have seen their gains in 2020 get erased due to this sell-off like Nutanix (NTNX), Qurate Retail (QRTEA), Anaplan (PLAN), Advanced Micro Devices (AMD), Chemours (CC), and CommScope (COMM). Some other notable losers of this group have been those heavily reliant on travel like American Airlines (AAL) and the cruise line stocks like Norwegian (NCLH) and Royal Caribbean (RCL).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/02/Worst.png))**\n\n&gt; Given how breadth has been over the past week, it may not come as any surprise that since the February 19th high there are only 18 stocks of 1000 in the Russell 1000 index that are higher. Four of those are up less than one percent. In the table below we show all of these stocks. Given the sell-off has centered around coronavirus fears, it is sensical that a coronavirus vaccine developer Moderna (MRNA) is the best performing stock since 2/19. What is amazing is there was not much momentum with this name headed into the sell-off. As of 2/19, the stock was actually down 3.27% year to date, but as the Covid-19 saga has moved along it is now up well north of 30% on the year. A few other health care names like Regeneron (REGN) and Gilead (GILD) have also benefited from the coronavirus.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/02/Best.png))**\n\n&gt; The histogram below shows the distribution of performance of Russell 1000 stocks since 2/19. As mentioned above, there are very few stocks in the index that are up since the 2/19 high. The highest share of stocks are down between 10% and 15% while the next highest share are down between 5% and 10%. Of the worst decliners, there are 75 stocks that have fallen over 20%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/02/hist.png))**\n\n&gt; Looking at the individual sectors, again Energy was extremely weak even before equities sold off. On 2/19, the average Energy stock in the Russell 1000 in that sector was down 15.6% YTD. While they hadn't tipped into the red yet, Consumer Staples were only up 1 bp.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/02/YTD-of-219.png))**\n\n&gt; Since the 2/19 high for the US equity market, the average stock in the Russell 1,000 is down well over 10%. The average Energy stock is down the most at -21%, followed by Communication Services and Technology at -13%. Consumer Staples stocks have performed the best with an average decline of 8.9%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/02/Since-219.png))**\n\n&gt; This leaves every sector down year-to-date. Utilities have generally outperformed only falling 2.3%, but the sector is sitting on a loss nonetheless. Of the worst sectors, Industrials, Consumer Discretionary, Materials, and of course Energy have fallen 10% or more.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/02/RIY-CYTD.png))**\n\n*****\n\n# Global Equity Benchmarks Distance From YTD Highs\n\n&gt; The recent equity sell-off has clearly been global in nature as concerns of a global pandemic rise. Perhaps the most surprising aspect of the way equities have sold off recently is that the country that has been hardest hit by the virus is closer to its YTD high than any other major global equity benchmark. The chart below shows the distance that each major global equity benchmark has declined relative to its YTD high. China's Shanghai Composite is down just 4.45%, which is better than any other country shown. Sure, you could argue that the Chinese government is manipulating the market and prohibiting investors from selling, but even the ETF that tracks the CSI 300 (ASHR) is down less than 6%, so anyone could go in and trade at these levels. Manipulated or not, the numbers are the numbers.\n\n&gt; At the bottom of the list, Brazil's Ibovespa index is down more than any other country at 11.6% and that country has only reported one confirmed case so far. With respect to US indices, the Russell 2000 is down the second most of any major global benchmark (-9.19%), while the Nasdaq is down the fourth most at 8.68%. Even the S&amp;P 500 is down close to 8%. These weak US readings come in a backdrop where there have only been 57 confirmed cases and all but a couple are instances where Americans contracted the virus outside of the United States and have been brought to the US under quarantine. Join Bespoke Premium to access Bespoke's most actionable stock market research and analysis.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/02/022620-Distance-from-2020-High.png))**\n\n*****\n\n# Just Four S&amp;P 500 Stocks Up This Week\n\n&gt; There's still another day left in the week, but unless things improve on Friday this will go down as one of the worst weeks for US equities in history. Since WWII, there have only been four other weeks where the S&amp;P 500 was down more than 10% in a given week. On a related note, there are also only four stocks in the entire S&amp;P 500 that are positive for the week! Leading the way higher, Regeneron (REGN) is up a healthy 7.1% while Gilead (GILD) is up just over 4%. Behind these two, the only other stocks that are higher now than they were at last Friday's close are Clorox (CLX) and CME Group (CME).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/02/022720-Biggest-Gainers.png))**\n\n&gt; On the downside, there are a lot more losers, but in the interest of space, below we have only listed the 17 stocks in the S&amp;P 500 that are down over 20% this week alone. Looking through the names on the list, the cruise lines are well represented with Royal Caribbean (RCL), Norwegian Cruise Lines (NCLH), and Carnival (CCL). Besides these names, American Airlines (AAL) is down 26%, while Live Nation (LYV) is down 22.2%.\n\n&gt; One thing we've heard a number of people argue the last few days is that some of the weakness this week is related to the increasing likelihood that Bernie Sanders wins the Democratic nomination. If that's the case, why is not a single one of the worst-performing stocks from the Health Care sector, and why is the Health Care sector the third best performing sector this week and one of just four that is not down 10% so far this week?\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/02/022720-Biggest-Decliners.png))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending February 28th, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=dkYpcmapyKs))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 3.1.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=qQM7SrVGFvY))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$TGT** \n&gt; * **$PLUG** \n&gt; * **$JD** \n&gt; * **$ZM** \n&gt; * **$COST** \n&gt; * **$TLRY** \n&gt; * **$AZO** \n&gt; * **$KSS** \n&gt; * **$SPLK** \n&gt; * **$DLTR** \n&gt; * **$VEEV** \n&gt; * **$XRAY** \n&gt; * **$SE** \n&gt; * **$MRVL** \n&gt; * **$FOLD** \n&gt; * **$KR** \n&gt; * **$OKTA** \n&gt; * **$STNE** \n&gt; * **$BLDP** \n&gt; * **$BURL** \n&gt; * **$CIEN** \n&gt; * **$ALBO** \n&gt; * **$MAXR** \n&gt; * **$ANF** \n&gt; * **$ITCI** \n&gt; * **$FNKO** \n&gt; * **$JWN** \n&gt; * **$EPRT** \n&gt; * **$VIPS** \n&gt; * **$GTT** \n&gt; * **$CORE** \n&gt; * **$BNFT** \n&gt; * **$LVGO** \n&gt; * **$EVRG** \n&gt; * **$ROST** \n&gt; * **$EGRX** \n&gt; * **$AOBC** \n&gt; * **$TGLS** \n&gt; * **$ATRS** \n&gt; * **$HPE** \n&gt; * **$NWN** \n&gt; * **$WVE** \n&gt; * **$WSC**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/j7kavSk.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/x29nduD.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 3.2.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/WpXhdqA.png))\n\n\n&gt; # ***Monday 3.2.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ycdhPpa.png))\n\n\n*****\n\n&gt; # ***Tuesday 3.3.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/VIBwP3J.png))\n\n&gt; # ***Tuesday 3.3.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/0CU1CX3.png))\n\n*****\n\n&gt; # ***Wednesday 3.4.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/BCVHMu2.png))\n\n&gt; # ***Wednesday 3.4.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/6EsJdZf.png))\n\n*****\n\n&gt; # ***Thursday 3.5.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/3YUYSb9.png))\n\n&gt; # ***Thursday 3.5.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/M3Hifok.png))\n\n*****\n\n&gt; # ***Friday 3.6.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/n0W1FLJ.png))\n\n*****\n\n&gt; # ***Friday 3.6.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n# Target Corp. $103.00\n&gt; **Target Corp. (TGT)** is confirmed to report earnings at approximately 6:30 AM ET on Tuesday, March 3, 2020. The consensus earnings estimate is $1.66 per share on revenue of $23.49 billion and the Earnings Whisper ® number is $1.68 per share. Investor sentiment going into the company's earnings release has 74% expecting an earnings beat Consensus estimates are for year-over-year earnings growth of 8.50% with revenue increasing by 2.23%. On Friday, February 28, 2020 there was some notable buying of 3,641 contracts of the $100.00 put expiring on Friday, March 20, 2020.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TGT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Plug Power, Inc. $4.34\n&gt; **Plug Power, Inc. (PLUG)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, March 5, 2020. The consensus estimate is for a loss of $0.06 per share on revenue of $90.15 million and the Earnings Whisper ® number is ($0.05) per share. Investor sentiment going into the company's earnings release has 66% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 25.00% with revenue increasing by 50.70%. Short interest has increased by 29.2% since the company's last earnings release while the stock has drifted higher by 59.6% from its open following the earnings release to be 39.8% above its 200 day moving average of $3.10. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, January 17, 2020 there was some notable buying of 2,010 contracts of the $5.00 put expiring on Friday, March 20, 2020. Option traders are pricing in a 20.0% move on earnings and the stock has averaged a 4.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=PLUG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# JD.com, Inc. $38.51\n&gt; **JD.com, Inc. (JD)** is confirmed to report earnings at approximately 5:00 AM ET on Monday, March 2, 2020. The consensus earnings estimate is $0.44 per share on revenue of $23.81 billion and the Earnings Whisper ® number is $0.47 per share. Investor sentiment going into the company's earnings release has 76% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 1,000.00% with revenue increasing by 21.41%. Short interest has decreased by 9.9% since the company's last earnings release while the stock has drifted higher by 9.9% from its open following the earnings release to be 19.4% above its 200 day moving average of $32.25. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, February 12, 2020 there was some notable buying of 8,001 contracts of the $38.00 put expiring on Friday, March 20, 2020. Option traders are pricing in a 11.5% move on earnings and the stock has averaged a 5.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=JD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Zoom Video Communications, Inc. $105.00\n&gt; **Zoom Video Communications, Inc. (ZM)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, March 4, 2020. The consensus earnings estimate is $0.07 per share on revenue of $176.36 million and the Earnings Whisper ® number is $0.10 per share. Investor sentiment going into the company's earnings release has 82% expecting an earnings beat The company's guidance was for earnings of approximately $0.07 per share on revenue of $175.00 million to $176.00 million. The stock has drifted higher by 63.4% from its open following the earnings release to be 29.0% above its 200 day moving average of $81.40. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 12.1% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ZM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Costco Wholesale Corp. $281.14\n&gt; **Costco Wholesale Corp. (COST)** is confirmed to report earnings at approximately 4:15 PM ET on Thursday, March 5, 2020. The consensus earnings estimate is $2.06 per share on revenue of $38.34 billion and the Earnings Whisper ® number is $2.10 per share. Investor sentiment going into the company's earnings release has 75% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 2.49% with revenue increasing by 8.32%. Short interest has decreased by 9.0% since the company's last earnings release while the stock has drifted lower by 4.6% from its open following the earnings release to be 1.6% below its 200 day moving average of $285.72. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, February 27, 2020 there was some notable buying of 1,125 contracts of the $285.00 put expiring on Friday, March 20, 2020. Option traders are pricing in a 8.2% move on earnings and the stock has averaged a 3.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=COST&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Tilray, Inc. $14.43\n&gt; **Tilray, Inc. (TLRY)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, March 2, 2020. The consensus estimate is for a loss of $0.34 per share on revenue of $55.35 million and the Earnings Whisper ® number is ($0.40) per share. Investor sentiment going into the company's earnings release has 51% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 3.03% with revenue increasing by 256.38%. Short interest has increased by 25.9% since the company's last earnings release while the stock has drifted lower by 32.1% from its open following the earnings release to be 49.5% below its 200 day moving average of $28.57. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, February 26, 2020 there was some notable buying of 2,011 contracts of the $15.00 call expiring on Friday, April 17, 2020. Option traders are pricing in a 26.7% move on earnings and the stock has averaged a 8.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TLRY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# AutoZone, Inc. -\n&gt; **AutoZone, Inc. (AZO)** is confirmed to report earnings at approximately 6:55 AM ET on Tuesday, March 3, 2020. The consensus earnings estimate is $11.87 per share on revenue of $2.58 billion and the Earnings Whisper ® number is $12.01 per share. Investor sentiment going into the company's earnings release has 73% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 3.31% with revenue increasing by 5.28%. Short interest has decreased by 7.1% since the company's last earnings release while the stock has drifted lower by 16.7% from its open following the earnings release to be 7.3% below its 200 day moving average of $1,113.49. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 8.3% move on earnings and the stock has averaged a 5.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AZO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Kohl's Corporation $39.15\n&gt; **Kohl's Corporation (KSS)** is confirmed to report earnings at approximately 7:00 AM ET on Tuesday, March 3, 2020. The consensus earnings estimate is $1.92 per share on revenue of $6.80 billion and the Earnings Whisper ® number is $1.91 per share. Investor sentiment going into the company's earnings release has 40% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 14.29% with revenue decreasing by 0.34%. Short interest has decreased by 2.6% since the company's last earnings release while the stock has drifted lower by 19.7% from its open following the earnings release to be 19.9% below its 200 day moving average of $48.86. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, February 24, 2020 there was some notable buying of 809 contracts of the $40.00 put expiring on Friday, March 20, 2020. Option traders are pricing in a 11.7% move on earnings and the stock has averaged a 9.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=KSS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Splunk Inc. $147.33\n&gt; **Splunk Inc. (SPLK)** is confirmed to report earnings at approximately 4:00 PM ET on Wednesday, March 4, 2020. The consensus earnings estimate is $0.96 per share on revenue of $783.94 million and the Earnings Whisper ® number is $1.00 per share. Investor sentiment going into the company's earnings release has 91% expecting an earnings beat The company's guidance was for revenue of approximately $780.00 million. Consensus estimates are for year-over-year earnings growth of 31.51% with revenue increasing by 26.02%. Short interest has increased by 2.1% since the company's last earnings release while the stock has drifted higher by 9.1% from its open following the earnings release to be 10.8% above its 200 day moving average of $132.95. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, February 26, 2020 there was some notable buying of 2,414 contracts of the $155.00 call expiring on Friday, March 6, 2020. Option traders are pricing in a 13.0% move on earnings and the stock has averaged a 8.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SPLK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Dollar Tree Stores, Inc. $83.03\n&gt; **Dollar Tree Stores, Inc. (DLTR)** is confirmed to report earnings at approximately 7:30 AM ET on Wednesday, March 4, 2020. The consensus earnings estimate is $1.75 per share on revenue of $6.39 billion and the Earnings Whisper ® number is $1.75 per share. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat The company's guidance was for earnings of $1.70 to $1.80 per share. Consensus estimates are for earnings to decline year-over-year by 9.33% with revenue increasing by 2.98%. Short interest has decreased by 7.1% since the company's last earnings release while the stock has drifted lower by 13.3% from its open following the earnings release to be 17.9% below its 200 day moving average of $101.15. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, February 26, 2020 there was some notable buying of 3,974 contracts of the $85.00 call expiring on Friday, March 20, 2020. Option traders are pricing in a 9.0% move on earnings and the stock has averaged a 7.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DLTR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/StockMarket.",
        "subreddit": "StockMarket",
        "title": "Wall Street Week Ahead for the trading week beginning March 2nd, 2020",
        "url": "https://www.reddit.com/r/StockMarket/comments/fbec77/wall_street_week_ahead_for_the_trading_week/",
        "created": 1583020143.0
    },
    {
        "author": "cking113i",
        "created_utc": 1580664371,
        "id": "exrplj",
        "num_comments": 44,
        "num_crossposts": 0,
        "selftext": "Wondering what people’s thoughts on this are.",
        "subreddit": "stocks",
        "title": "Apple: good buy considering dip in share price from outbreak of coronavirus?",
        "url": "https://www.reddit.com/r/stocks/comments/exrplj/apple_good_buy_considering_dip_in_share_price/",
        "created": 1580693171.0
    },
    {
        "author": "Potpourrri",
        "created_utc": 1581396867,
        "id": "f23eai",
        "num_comments": 44,
        "num_crossposts": 0,
        "selftext": "Photoshop\nSketch\nCreative Cloud\nPremiere\nAfter Effects\nLightroom\nIllustrator\n\nWhat millenial do you know that both owns a Mac and does NOT use one or all of these products?\n\nAdobe has been treated like trash these past few years. Don't get me wrong, I love MSFT, but you wouldn't buy MSFT puts would you? Right, which is exactly why you'd do the next best thing -- buy AAPL. \n\nBUT WAIT\n\nWhy buy AAPL? They have dozens of business sectors bleeding their wallet and rely on iPhone and MacBook sales to pump up their numbers. Hmm.. now if only there were a company that releases the most used software on AAPL in a market they are so entrenched in that literally no one can topple them. They would have to be so widely used that they get literal passive marketing from everyone online because there aren't any other tools to use other than theirs.\n\nAnd they would have to be so pervasive that even your 10-year old nephew knows their products, but doesn't quite know their name.\n\nIt's a new era. Boomers are dying. The only big bois left will be those that pervade the infrastructure of the masses and those that create that infrastructure.\n\nThis is the MSFT and ADBE era\n\nDon't get left behind\n(If you doubt me, take 1 look at their charts and 1 look at MSFT and go short it)",
        "subreddit": "wallstreetbets",
        "title": "You haven't heard of Adobe?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f23eai/you_havent_heard_of_adobe/",
        "created": 1581425667.0
    },
    {
        "author": "Cygopat",
        "created_utc": 1580834496,
        "id": "eyssoo",
        "num_comments": 43,
        "num_crossposts": 0,
        "selftext": "I know TSLA is fun and all but MSFT has been a LITERALLY RISK FREE investment, this fucker has been going nothing but up for years without a break while also paying a decent dividend and not relying on a memer on crack at CEO, it's about to take over AAPL again as the highest market cap stonk and quote me on this it will be the first company to 10T market cap.",
        "subreddit": "wallstreetbets",
        "title": "MSFT $180 gang",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eyssoo/msft_180_gang/",
        "created": 1580863296.0
    },
    {
        "author": "UpbeatSolution5",
        "created_utc": 1581193277,
        "id": "f0x3rw",
        "num_comments": 43,
        "num_crossposts": 0,
        "selftext": "I have two kids (aged 7 and 5) and I have around 5K for them to invest, I was thinking of just dumping into apple stock AAPL and adding to it yearly.\n\nBut i figured I would ask one of my favorite subreddits where I should dump the money and let it ride for the next 18years, \n\nThanks in advance for all the advice.",
        "subreddit": "wallstreetbets",
        "title": "Investment/Stock for kids",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f0x3rw/investmentstock_for_kids/",
        "created": 1581222077.0
    },
    {
        "author": "lebronthegreatest533",
        "created_utc": 1581065753,
        "id": "f07wq8",
        "num_comments": 43,
        "num_crossposts": 0,
        "selftext": "What's some good dates and strikes to purchase at for Uber and MSFT? Relatively new to options but have made $300 on Apple on my first day, hoping to keep the ball rolling, although they say the first one is free. :&gt; Any other options to trade would be appreciated. Looking for about a $100 profit a day nothing too crazy. Thanks in advance",
        "subreddit": "options",
        "title": "Uber or MSFT calls today??",
        "url": "https://www.reddit.com/r/options/comments/f07wq8/uber_or_msft_calls_today/",
        "created": 1581094553.0
    },
    {
        "author": "Big-Weed",
        "created_utc": 1582838528,
        "id": "faj704",
        "num_comments": 42,
        "num_crossposts": 0,
        "selftext": "Just a good ole fashioned loss porn thread. Sharing your loss porn is the first step to recovery. Like how I just lost $22k on AAPL alone this week.",
        "subreddit": "stocks",
        "title": "Does anyone have any big loss stories they’d like to share?",
        "url": "https://www.reddit.com/r/stocks/comments/faj704/does_anyone_have_any_big_loss_stories_theyd_like/",
        "created": 1582867328.0
    },
    {
        "author": "lebronthegreatest533",
        "created_utc": 1581212915,
        "id": "f11lkp",
        "num_comments": 42,
        "num_crossposts": 0,
        "selftext": "They were originally supposed to re-open on the 9th, but are now closed for another week. I have TWO 2/28 $330 Calls. \n\nTwo questions:\n1) How does this affect Apple's share price?\n2) What's the best move for me?\n\nThanks in advance.\n\n[Apple China Closed till 2/15](https://www.bloomberg.com/news/articles/2020-02-07/apple-extends-store-closures-in-china-over-coronavirus)",
        "subreddit": "options",
        "title": "Apple China stores closed till 02/15.",
        "url": "https://www.reddit.com/r/options/comments/f11lkp/apple_china_stores_closed_till_0215/",
        "created": 1581241715.0
    },
    {
        "author": "thcricketfan",
        "created_utc": 1580573948,
        "id": "ex8ele",
        "num_comments": 42,
        "num_crossposts": 0,
        "selftext": "I have about 50K in my portfolio consisting of Apple and MSFT. Coronavirus is already hitting the portfolio with Apple temporarily closing the stores in China. Whats the better options - Sell on Monday and buy back at a later point or to continue holding my portfolio. I dont have an immediate need for money and have been holding them for &gt; 1 year. Thanks!",
        "subreddit": "stocks",
        "title": "Coronavirus - Sell or Hold?",
        "url": "https://www.reddit.com/r/stocks/comments/ex8ele/coronavirus_sell_or_hold/",
        "created": 1580602748.0
    },
    {
        "author": "JustALurker110",
        "created_utc": 1581119214,
        "id": "f0j6s6",
        "num_comments": 39,
        "num_crossposts": 0,
        "selftext": "To start, I’m a bored SE on a Friday so you’ll probably want to inverse all the plays I talk about here for max profit. Also, while I don’t think the Coronavirus is a threat to any of us, it’s still worth discussing the economic impact. \n\nFirst, the stocks most dependent on China: https://www.cnbc.com/2019/05/06/here-are-the-companies-wall-street-is-worried-most-about-if-a-full-blown-trade-war-breaks-out.html\n\nhttps://finance.yahoo.com/news/big-stocks-exposure-china-185734394.html\n\nThe yahoo link is a little old but use the info as you wish. WYNN reported earnings today and they missed, also reported they’re losing 2-2.5 million US dollars a day. Their Macau casinos will remain shut for 2 weeks minimum. The semiconductors are all way up on the list as well, and are suffering as most of China’s manufacturing has remained shut down (80% of it). Apple supplier Foxconn also delayed the opening of production in Shenzhen, told employees not to return, and lowered its 2020 outlook due to drop in manufacturing. Apple has further delayed the reopening of its retail stores in China. All of these companies (Semis, Apple, Nike, etc) not only rely on China for revenue/sales, but also manufacturing. \n\nMost of the semis released earnings recently, prior to any realizing the virus could have a large effect on revenue and supply. I’ll be playing $MRVL earnings for early March, and watching the casinos (WYNN, MGM) into next earnings. If they pop up a bit in the coming weeks I’ll grab some puts for mid May/June because their quarters are going to be poor. Same goes for the other semis with large China exposure. \n\nI also expect a SPY pull back just due to the size of the Chinese economy and the length to which it’s been mostly shut down. Additionally, the virus seems to be spreading at a continuous pace with no signs of slowing yet (within China). They can pump a few billion into the market, but that doesn’t come close to making up for the lost revenues and manufacturing from the second largest economy.",
        "subreddit": "wallstreetbets",
        "title": "China and the upcoming weeks",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f0j6s6/china_and_the_upcoming_weeks/",
        "created": 1581148014.0
    },
    {
        "author": "Fall0utFighter",
        "created_utc": 1582082276,
        "id": "f64cqb",
        "num_comments": 39,
        "num_crossposts": 0,
        "selftext": "I would like to know the best way to make a living trading stocks with only $1000 to start with. Can I just look up a list of the best high growth stocks to invest in and do some short term trading of those companies? I've heard Apple, Microsoft and Mastercard are good options.\n\nIf that strategy won't generate enough to make a living what other techniques can I use? I want high risk high reward.\n\nAny book recommendations?",
        "subreddit": "CanadianInvestor",
        "title": "How to turn a thousand dollars into a million trading stocks?",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/f64cqb/how_to_turn_a_thousand_dollars_into_a_million/",
        "created": 1582111076.0
    },
    {
        "author": "Funkierail",
        "created_utc": 1582659462,
        "id": "f9frtj",
        "num_comments": 39,
        "num_crossposts": 0,
        "selftext": "for about a few weeks i have been debating whether to invest in the stock market or not.\nSo a few days ago i decided to just put my money in the market instead of it just sitting there in me bank account with 0% interest.\nBy now the Corona virys has hit the market and i think i made a bad decision by not waiting for 1 or 2 days.\nshould i sell out of my investments or just hold on to them?\ni have about 1000 euro's in shares of apple, microsoft and at&amp;t.\ni know these companies probably won't go bankrupt by this but is it smart to sell my shares to buy them back when they are a lower price?\n\n(english is not my first language so sorry for mistakes)",
        "subreddit": "investing",
        "title": "losing my first money in the stock market",
        "url": "https://www.reddit.com/r/investing/comments/f9frtj/losing_my_first_money_in_the_stock_market/",
        "created": 1582688262.0
    },
    {
        "author": "Go18Dummy",
        "created_utc": 1582234693,
        "id": "f708nk",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "WTF is going on with Apple?",
        "url": "https://i.imgur.com/OzIM5hs.png",
        "created": 1582263493.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1582272444,
        "id": "f781cp",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme and/or [post your arguments against fundamentals here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing\n  * [Corporate News](https://www.streetinsider.com/Corporate+News)\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n  * [Economic data](https://www.streetinsider.com/Economic+Data)\n  * [FED](https://www.streetinsider.com/Fed) - Federal Reserve news\n\n-----\n\nMost fundamentals are updated every 3 months due to the fact that corporations release earnings reports every quarter, so traders are always speculating at what those earnings will say, and investors may change the size of their holdings based on those reports.  Expect a lot of volatility around earnings, but it usually doesn't matter if you're holding long term, but keep in mind the importance of earnings reports because a trend of declining earnings or a decline in some other fundamental will drive the stock down over the long term as well.\n\nSee the following word cloud and click through for the wiki:\n\n[Market Cap - Shares Outstanding - Volume - Dividend - EPS - P/E Ratio - EPS Q/Q - PEG - Sales Q/Q - Return on Assets (ROA) - Return on Equity (ROE) - BETA - SMA - quarterly earnings](https://www.reddit.com/r/stocks/wiki/fundamentals-themed-post)\n\nIf you have a basic question, for example \"what is EBITDA,\" then google \"investopedia EBITDA\" and click the Investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nUseful links:\n\n* [Investopedia Tuturiol](https://www.investopedia.com/university/all/fundamental-analysis/) on fundamental analysis including [Discounted Cash Flow](https://www.investopedia.com/university/dcf/) analysis; see [definition here](https://www.investopedia.com/terms/d/dcf.asp)\n* [FINVIZ](https://finviz.com/quote.ashx?t=aapl) for fundamental data, charts, and aggregated news\n* [Earnings Whisper](https://www.earningswhispers.com/stocks/aapl) for earnings details\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion &amp; Fundamentals Friday Feb 21, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/f781cp/rstocks_daily_discussion_fundamentals_friday_feb/",
        "created": 1582301244.0
    },
    {
        "author": "saul_2",
        "created_utc": 1581974151,
        "id": "f5ftyg",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "Tim Apple just warned Wall Street they won’t meet the expected revenue because of constrained iPhone supply and suppressed demand in China.\n\n#BUY THE DIP.\n\nSauce: https://www.cnbc.com/2020/02/17/apple-warns-on-coronavirus-it-wont-meet-revenue-guidance-because-of-constrained-iphone-supply-and-suppressed-demand-in-china.html",
        "subreddit": "wallstreetbets",
        "title": "Apple going to tank",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f5ftyg/apple_going_to_tank/",
        "created": 1582002951.0
    },
    {
        "author": "sleeping_in_",
        "created_utc": 1581525779,
        "id": "f2tzly",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "I often put in trades which can be $40,000 at a time, what is the general rule in liquid stocks like Apple or Microsoft in the maximum you can buy without moving the price and paying more?",
        "subreddit": "investing",
        "title": "How much of a liquid stock can you buy without moving the price?",
        "url": "https://www.reddit.com/r/investing/comments/f2tzly/how_much_of_a_liquid_stock_can_you_buy_without/",
        "created": 1581554579.0
    },
    {
        "author": "DillyJ123",
        "created_utc": 1580744529,
        "id": "ey8x1h",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "I’m fairly new to trading and I’ve been watching videos on trading and I even had a simulator account that’s I actually made a lot of money on, but that was trading large scale stocks like Apple, Amazon, Tesla, etc. but obviously I don’t have the money to swing trade those. I’ve been buying smaller scale stocks with an initial investment of 250 and I haven’t had any realized losses Bc I’ve remained hopeful for them to rise. Any advice to help get me back up? And how to actually do good research and DD? Thanks for any help",
        "subreddit": "RobinHood",
        "title": "Struggle is real",
        "url": "https://www.reddit.com/r/RobinHood/comments/ey8x1h/struggle_is_real/",
        "created": 1580773329.0
    },
    {
        "author": "SlightName",
        "created_utc": 1580714220,
        "id": "ey3bdz",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "Apple is falling fast and hard like when it hit my boy Isaac Newton on the noggin.\n\nbuy the dip.\n\nApple will be hurt by supply chain issues as well as lost revenue due to closing its stores in China. \n\nStill though, its a great company with great fundamentals. \n\nbuy. the. dip.",
        "subreddit": "wallstreetbets",
        "title": "Buy Apple as it falls",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ey3bdz/buy_apple_as_it_falls/",
        "created": 1580743020.0
    },
    {
        "author": "GoldenKaze",
        "created_utc": 1581969852,
        "id": "f5eny2",
        "num_comments": 35,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\n* Apple  cut its revenue guidance Wednesday in a letter to investors, citing weak  iPhone sales and blaming economic issues in China.\n* The revised guidance is sending Apple suppliers’ stocks down.\n* Several had already cut their own forecasts, citing reduced demand from a major client.\n\n&amp;#x200B;\n\n[https://www.cnbc.com/2019/01/03/apples-suppliers-are-getting-crushed-by-its-lowered-revenue-guidance.html](https://www.cnbc.com/2019/01/03/apples-suppliers-are-getting-crushed-by-its-lowered-revenue-guidance.html)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nIf you were to look here at Apples quarterly Revenue, it appears to be mostly negative with some slight growth towards the end, nowhere near enough to justify the stock going up 150% since the negative guidance was given.",
        "subreddit": "investing",
        "title": "in In Jan 3 2019, Apple stocks got crushed for lowering guidance, since then Apple stock has more than doubled",
        "url": "https://www.reddit.com/r/investing/comments/f5eny2/in_in_jan_3_2019_apple_stocks_got_crushed_for/",
        "created": 1581998652.0
    },
    {
        "author": "Kazul28",
        "created_utc": 1581637339,
        "id": "f3j6ri",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "MSFT down $5 and change the last 3 days on a string of unfortunate events and I'm sitting here struggling to figure out why they're taking a beating while all other big tech is up or flat.\n\n1. Tuesday morning drop due to probably being over bought. Ok, I get that - we've had a serious run up lately and there was bound to be some profit taking.\n2. Tuesday afternoon FTC announcement. Is this really THAT big of a deal? I mean all of those companies were playing within the rules...now they want to go back and punish them for that? I can't believe that the FTC is actually going get away with fining anyone or make them unwind any of the previous deals. If they think it's a problem, just change the threshold and be done with it.\n3. Wednesday morning another dip sell off - ok, we're a bit over bought and this is just a correction. That was followed by a small rally back to end with a small gain at the end. Cool, we'll just tread water for a bit before resuming the push to $200.\n4. Thursday morning bad Coronovirus news but we shrug it off since Microsoft really doesn't have the kind of China exposure as say Apple. Then we rally on the news of a price target increase...everything looking good now.\n5. Thursday afternoon the Jedi Contract news. This really just feels like a personal slight against Trump and I'm glad the judge is making them pony up some cash to compensate Microsoft for this bs. It's stupid that this is gonna drag out but I can't imagine the contract being taken away.\n\nCan someone explain where in this timeline is the super bad news to cause MSFT to drop 2.5% in 72 hours cause I don't get it.\n\nFull disclosure - I'm sitting on 2/28 187.5c and 3/20 200c and have taken a 60% beating this week. I would love to buy the dip but I'm out of capital to do so. Right now it feels like its no longer a question of IF I'm going to lose out, but HOW MUCH I'm going to lose. I thought my hands were strong but they starting to shake after that contract announcement and the Theta Gang is approaching with pitchforks and torches.",
        "subreddit": "wallstreetbets",
        "title": "Can someone explain this MSFT pounding to me?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f3j6ri/can_someone_explain_this_msft_pounding_to_me/",
        "created": 1581666139.0
    },
    {
        "author": "CanBurritosFeelLove",
        "created_utc": 1581449835,
        "id": "f2dmcj",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "Soall of the threads about the markets reaction to the Coronavirus outbreak seem to devolve into how serious of a threat the virus is or isn't but ignoring that and assuming it doesn't become an apocalyptic or world changing event, why exactly would we see a huge market pull back from this?   \n\n\nYes, I understand that many companies Supply Chains will be impacted by the virus and it's effect on Chinas manufacturing industry but every single person knows that will be temporary so how on earth could expect the market to pull out of otherwise solid companies? If everyone is aware that these supply chain impacts are temporary, anyone with a brain will simply by shares the moment it dips.   \n\n\nCoronavirus is not taking cash out of investors pockets. It's not causing people to lose their jobs. If Apple announces they'll have a shortage of iPhones this month and the stock drops, no one is thinking \"well people aren't going to buy iPhones anymore\". Everyone knows that while their earnings might take a hit the company is still on solid fundamentals. Every non-Chinese company that is a wise investment and isn't already teetering on disaster before this virus is in the same boat. \n\nAm I wrong?",
        "subreddit": "investing",
        "title": "Why would the Market go down significantly due to Cornavirus?",
        "url": "https://www.reddit.com/r/investing/comments/f2dmcj/why_would_the_market_go_down_significantly_due_to/",
        "created": 1581478635.0
    },
    {
        "author": "MajorMalfunctionUSAF",
        "created_utc": 1582913107,
        "id": "fayu1a",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": "My income, about $100k per year, comes from the VA, Social Security and military retirement and will only increase one or two percent each year with cost of living increases. I am unable to work, both physically and because of limitations in place on the benefits I receive. I haven't worked since 2006.\n\nAt first glance, this may seem like I should shut up and color and enjoy my retirement. After having a fairly successful career, both military and as a civilian, it's hard to know that I'll never get that next big raise, bonus or promotion. Like many career military officers as well as those of us left messed up (disabled), I've had two failed marriage and a 24 year old son who hasn't talked to me in 4 years. My life is dreary, dull, and empty. With nothing much to look forward to and no chance to increase my income. I need a reason to get out of bed every day so I've been seriously thinking about doing some investing.\n\nWith the coronavirus and stocks plummeting, it seems there is no better time to get in and buy low on stocks that are always going to rebound, like Apple, Microsoft, Amazon, etc. I'm also interested in tech stocks and worked on tech for several years before being unable to work. Really open to anything though. \n\nI could invest $5k to $10k that I could afford to lose if it didn't work out. I'm looking for noob-level advice on the mechanics of how to get started, tax implications, etc. I'd like to use, preferably, free software that is Android friendly, keep my taxes simple, and not have to check the status of things 5 times a day. I guess I'd like to be able to buy and set limits on when to sell or buy certain stocks. The more automated the better. I would be most interested in short term gains, and I'm not risk adverse. As I said earlier, I'm already retired, disabled, can't work, don't need a rainy day find, medical is taken care of, and everything is paid off. I would like to make some extra money to maybe replace my 14 year old car, do a little traveling, maybe pick up some new toys or move up to a nicer house. I know that's not going to happen anytime soon, just some mid to long term goals. My spouse is taken care of in case I die, so I don't need to worry about that. In short, I'd like to try to take advantage of this stock market drop, correction, or whatever you want to call it. My taxes now are extremely simple and I'd like to keep them that way.\n\nSorry if I'm all over the map, just trying to provide as much relevant background as possible, my motivations, goals, level of experience, etc. I would appreciate any and all constructive advice and I'll be glad to answer any questions if anyone actually reads and comments. Thanks!",
        "subreddit": "investing",
        "title": "Seeking Advice on jumping in while the market is down. I'm a 100% disabled veteran, 57 years old, and retired. I have no debt, house, cars and all assets are paid off. Have about $25k cash but no investments.",
        "url": "https://www.reddit.com/r/investing/comments/fayu1a/seeking_advice_on_jumping_in_while_the_market_is/",
        "created": 1582941907.0
    },
    {
        "author": "ScotchBrandyBourbon",
        "created_utc": 1580917816,
        "id": "ezbhqj",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "Crazy numbers.\n\nApple's buyback started in 2013.\n\nThey bought about 1.75 billion shares.\n\nAverage cost per share: $186.35\n\nWith a current price of $322 Apple saved investors about $237 billion.\n\nI remember hearing all types of criticisms about the Apple buyback. Glad I didn't listen to those people.\n\nApple added massive shareholder value with this buyback.",
        "subreddit": "investing",
        "title": "Apple 'saved' shareholders $237 Billion with buybacks.",
        "url": "https://www.reddit.com/r/investing/comments/ezbhqj/apple_saved_shareholders_237_billion_with_buybacks/",
        "created": 1580946616.0
    },
    {
        "author": "newaccount6969420",
        "created_utc": 1581172636,
        "id": "f0sd2a",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "For example if I bought 1 Apple stock right now for £12.40 and placed a loss stop of 0.25 which would mean that maximum amount I could lose from that stock would be 20p, would this mean that the stock is instantly sold if it drops to that price, meaning I would only lose 20p? Also if that’s the case then why doesn’t everyone just put the smallest distance stop possible on their stocks to create an extremely low risk investment?",
        "subreddit": "investing",
        "title": "Can you prevent most money loss with a stop?",
        "url": "https://www.reddit.com/r/investing/comments/f0sd2a/can_you_prevent_most_money_loss_with_a_stop/",
        "created": 1581201436.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1582991514,
        "id": "fbedqa",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/wallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week and month ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning March 2nd, 2020.\n\n# **Stock rout may deepen in the week ahead as coronavirus impact starts to show up in economic data  - [(Source)](https://www.cnbc.com/2020/02/28/stock-rout-to-deepen-as-coronavirus-impact-starts-to-show-up-in-data.html)**\n*****\n&gt; Stock investors just experienced one of the nastiest weeks in history that recorded the S&amp;P 500′s fastest correction on record, but hold on tight, the market might have more room to fall as the coronavirus damage starts to creep into upcoming economic data, analysts warned.\n*****\n&gt; Major U.S. stock averages suffered their worst week since the financial crisis as fears about the coronavirus disrupting the global economy scared investors away from risk assets. However, stocks might still be searching for a bottom next week when investors grapple with a slew of economic data potentially dragged down by the outbreak.\n*****\n&gt; The Institute for Supply Management will release its manufacturing gauge on Monday. Meanwhile, the Federal Reserve will publish its latest Beige Book on Wednesday, which will detail anecdotal information on current economic conditions. Many expect U.S. manufacturing to have taken a hit from the coronavirus.\n*****\n&gt; “Look out for ISM surveys and Beige Book for early signs of COVID-19 impact,” Michelle Meyer, Bank of America’s head of U.S. economics, said in a note Friday. “It will take time for the ‘hard’ economic data to show the impact but we are already seeing evidence in early economic indicators.”\n*****\n&gt; Weekend action?\n&gt; The outlook for the week could be changed this weekend by coronavirus headlines or by some sort of intervention by central banks. Expectations are rising on Wall Street that there could be some potential move from the Federal Reserve to get ahead of what could be another rough week.\n*****\n&gt; Fed Chairman Jerome Powell said Friday the central bank is monitoring the coronavirus and pledged action if necessary. Meanwhile, former Fed Governor Kevin Warsh recommended the Fed act as quickly as Sunday before the markets reopen. The market is already pricing in a 100% chance of at least one rate cut at the Fed’s March policy meeting.\n*****\n&gt; Jim Paulsen, chief investment strategist at the Leuthold Group, is worried about the cascading effect of coronavirus hitting upcoming economic data points. “ISM manufacturing is going to be widely scrutinized,” he said.\n*****\n&gt; The ISM manufacturing index rose to a reading of 50.9 last month, the highest level since July (Any reading above 50 signals expansion.) Bank of America expects ISM manufacturing to pull back to 50.0 and said Fed Beige Book may provide “early insight” into the U.S. economic impact from the deadly virus.\n*****\n&gt; Cutting forecasts\n&gt; Next week, investors will also likely grapple with more warnings from major companies about broken supply chains and easing demand due to the outbreak.\n*****\n&gt; Apple, Microsoft, Nike and United Airlines have all sounded alarms that they will not meet their earnings and revenue guidance because of the virus.\n*****\n&gt; Wall Street strategists this week were quick to slash their forecasts on corporate earnings and the stock market. Barclays sees the S&amp;P 500 to end the year at 3,000, down from a previous forecast of 3,300. The bank also expects a 2% drop in profits this year. Meanwhile, Goldman said it sees zero earnings growth for American companies in 2020.\n*****\n&gt; To be sure, some believe the steep stock rout has gone too far too fast, betting on at least a small rebound.\n*****\n&gt; “The level of panic has become very extreme and the level of downside price movement is pretty extreme. All of that is to me more of a sign that we are getting closer to the beginning of the end of it,” Paulsen said.\n*****\n&gt; Another source of support could come from the Trump administration, where officials are discussing tax cuts, among other economic reactions, as one option to make up for the economic impact of the coronavirus, the Washington Post reported Friday.\n*****\n&gt; Still, investors will have to be on edge for a while now with more virus headlines, as well as the key Super Tuesday Democratic primaries. Some notable investors including “bond king” Jeffrey Gundlach blamed the rise of Democratic presidential hopeful Bernie Sanders for helping accelerate massive sell-off.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/xxV96kn.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/3XfCFrl.jpg))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/zbhTBQr.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/zASmUSl.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/wv7Xef1.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/qPOD5uN.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/2z1n5iA.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/jgqhUBR.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/j7kavSk.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/4awCCsW.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/ElXoU2T.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/xH2GYRk.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/HyXxrSJ.png))**\n###### **([CLICK HERE FOR THE CHART LINK #4!](https://i.imgur.com/GIw7Oq6.png))**\n\n*****\n\n# Gauging Potential Economic Impact of Covid-19\n\n&gt; The coronavirus outbreak—or Covid-19 —has caused significant market volatility over the past week. Our approach as always is to focus on economic fundamentals first, but the uncertainty around the scope of the outbreak has made it very difficult to assess potential impact. The situation clearly is unsettling for investors as more cases are reported across Europe and Asia, and the first case of community transmission has been reported in the United States. As this was written, the S&amp;P 500 Index was 10% below its February 19 all-time high.\n\n&gt; “The Covid-19 outbreak continues to significantly disrupt economic activity in China and throughout Asia,” said LPL Financial Senior Market Strategist Ryan Detrick. “Given that China is such a big component of many global supply chains, we will almost certainly see weaker economic data globally over the next several months.”\n\n&gt; Even as the situation remains fluid and very uncertain, we want to provide some sense of the potential U.S. and global economic impact.\n\n&gt; **China**: If virus containment holds in China, which is our base case, we could see something like a 3–4 percentage point impact to Chinese economic growth in the first quarter—possibly 2–3% gross domestic product (GDP) growth rather than 5–6%—followed by a much more modest hit in the second quarter. We think we would see a return to trend growth by the third quarter of 2020. This scenario would put China’s 2020 GDP growth below the current 5.6% Bloomberg-tracked consensus, shown in the LPL Chart of the Day, and the Chinese government’s previous 6% annual target. In other words, China’s GDP growth in 2020 could end up closer to 5% than 6%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/02/Global-econ.png?ssl=1))**\n\n&gt; United States: At this point, our base case is that any economic disruption in the United States may be modest and short-lived, as we expect domestic efforts at containment to be more successful and have less economic disruption than in China. The outbreak may trim 0.25–0.5% from U.S. GDP over the next couple of months due to global supply chain disruption, falling export demand, and decreased tourism. If evidence emerges over the next month or so that the virus is being contained successfully, as we expect, the economic impact would likely be at the better end of that range (0.25%). In that scenario, damage to business and consumer confidence would be limited, setting the stage for a potential second-quarter rebound. We believe our 1.75% U.S. GDP growth forecast may still be achievable.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/02/Global-econ2.png?ssl=1))**\n\n&gt; **Global**: In the short-term, the collective hits to global GDP from China, South Korea, Japan, and Italy—the countries where the outbreak impact has been greatest to date—may comprise 0.2–0.3% of global GDP. Our latest global GDP forecast of 3.5% from our Outlook 2020 publication is probably a bit too high in light of the latest news. We expect to update or reaffirm our economic forecasts once we have more clarity around Covid-19 impact in the weeks ahead.\n\n*****\n\n# Can the Market Bottom on a Friday?\n\n&gt; It's often said that equity markets can't bottom on a Friday. One of the reasons for this line of thinking is that during a market downturn, no one wants to hold onto or bid up equities into a weekend for fear of further bad news. It may just be a matter of semantics, but based on that line of reasoning, the more accurate way to phrase it would be that markets can't bottom on a Thursday or rallies can't begin on a Friday. However you want to think about it, the chart below shows the number of times the closing low of a 10%+ correction has occurred on various weekdays.\n\n&gt; Of the 97 S&amp;P 500 corrections since 1928, the day of the week that has marked the low close of a 10%+ decline the least frequently is actually Wednesday with only 10. Behind Wednesday, Friday has been the second most infrequent day of the week for a bottom (15), and Thursday is the only other day of the week where the S&amp;P 500 has made a low on a closing basis less than 20 times. The days of the week where the S&amp;P 500 most frequently bottoms are Monday and Tuesday with 26 and 28, respectively.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/02/022820-10-Corrections.png))**\n\n&gt; Regarding bear markets (20%+ declines), the trend is very similar. Bear markets have been the least likely to end on a Wednesday or Friday and most likely to end on a Tuesday.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/02/022820-Bear-Markets.png))**\n\n*****\n\n# Dividend Stock Spotlight: S&amp;P 500's Highest Yielders From The Sell-Off\n\n&gt; Given the lower prices of stocks, dividend yields have been on the rise over the past couple of weeks. The dividend yield of the S&amp;P 500 now stands at 2.12% which is the highest since June 3rd of last year when it reached the same level, but only stayed there for a single day. Prior to that, yields were only higher during the Q4 2018 sell-off through February of 2019. At the beginning of the current sell-off on February 19th, the S&amp;P 500's yield was 26 bps lower at 1.86%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/02/Div-yield-sp.png))**\n\n&gt; Of the individual stocks in the index, there are now 81 stocks that have dividend yields of 4% or more. That compares to only 64 at the beginning of the sell-off. In the table below, we show the 25 highest yielders of the S&amp;P 500 as well as the price change and change in the dividend yield since the 2/19 record high. As shown, there is only one stock, Macy's (M), that yields over 10% at the moment. This major retailer has fallen out of favor in the past few years but the stock has gotten crushed since the 2/19 market peak having fallen just under 21% in that time. That decline has raised the dividend yield by 2.44 percentage points, but there is one other stock that has seen its yield increase by even more. That stock is Occidental Petroleum (OXY), the second-highest yielder in the index (9.93%). Being an Energy name, OXY has fallen the most dramatically (-29.05%) since 2/19 of all the highest yielders.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/02/Highest-Yielding-table1.png))**\n\n&gt; While there is a lot of overlap, in the table below we show the stocks that have seen their dividend yields rise the most as stocks have declined since 2/19. Again OXY and M top the list. While no other stocks have seen their dividend yields increase by more than 2 percentage points, there are another 17 who have risen by at least 1 percentage point. Notably, two cruise line stocks, Carnival (CCL) and Royal Caribbean (RCL) find themselves on this list. Carnival (CCL) now yields 6.28% while Royal Caribbean (RCL) yields 4.05%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/02/Biggest-Change-yield-table.png))**\n\n*****\n\n# The Biggest Losers (and a few winners)\n\n&gt; It is no secret that energy stocks have gotten crushed this year, and the list of the 25 worst-performing stocks in the Russell 1000 since the previous record close on February 19th is a prime example of this. Seven energy stocks find themselves on this list, two of which, Chesapeake Energy (CHK) and Kosmos Energy (KOS), take up the number one and two spots having fallen 45.73% and 41.95%, respectively since 2/19. CHK had already been weak headed into the broader market sell-off with a YTD loss on 2/19 over 40%; the past week has added fuel to the fire as it is now down 68.5% YTD. Continental (CLR), Centennial Resource Development (CDEV), Transocean (RIG), and Apergy (APY) are other energy stocks that were down 20% or more on the year headed into this sell-off, and each one has fallen another 20%+ since the 19th. While most of the other biggest losers since 2/19 had already been down on the year, there are some that have seen their gains in 2020 get erased due to this sell-off like Nutanix (NTNX), Qurate Retail (QRTEA), Anaplan (PLAN), Advanced Micro Devices (AMD), Chemours (CC), and CommScope (COMM). Some other notable losers of this group have been those heavily reliant on travel like American Airlines (AAL) and the cruise line stocks like Norwegian (NCLH) and Royal Caribbean (RCL).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/02/Worst.png))**\n\n&gt; Given how breadth has been over the past week, it may not come as any surprise that since the February 19th high there are only 18 stocks of 1000 in the Russell 1000 index that are higher. Four of those are up less than one percent. In the table below we show all of these stocks. Given the sell-off has centered around coronavirus fears, it is sensical that a coronavirus vaccine developer Moderna (MRNA) is the best performing stock since 2/19. What is amazing is there was not much momentum with this name headed into the sell-off. As of 2/19, the stock was actually down 3.27% year to date, but as the Covid-19 saga has moved along it is now up well north of 30% on the year. A few other health care names like Regeneron (REGN) and Gilead (GILD) have also benefited from the coronavirus.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/02/Best.png))**\n\n&gt; The histogram below shows the distribution of performance of Russell 1000 stocks since 2/19. As mentioned above, there are very few stocks in the index that are up since the 2/19 high. The highest share of stocks are down between 10% and 15% while the next highest share are down between 5% and 10%. Of the worst decliners, there are 75 stocks that have fallen over 20%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/02/hist.png))**\n\n&gt; Looking at the individual sectors, again Energy was extremely weak even before equities sold off. On 2/19, the average Energy stock in the Russell 1000 in that sector was down 15.6% YTD. While they hadn't tipped into the red yet, Consumer Staples were only up 1 bp.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/02/YTD-of-219.png))**\n\n&gt; Since the 2/19 high for the US equity market, the average stock in the Russell 1,000 is down well over 10%. The average Energy stock is down the most at -21%, followed by Communication Services and Technology at -13%. Consumer Staples stocks have performed the best with an average decline of 8.9%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/02/Since-219.png))**\n\n&gt; This leaves every sector down year-to-date. Utilities have generally outperformed only falling 2.3%, but the sector is sitting on a loss nonetheless. Of the worst sectors, Industrials, Consumer Discretionary, Materials, and of course Energy have fallen 10% or more.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/02/RIY-CYTD.png))**\n\n*****\n\n# Global Equity Benchmarks Distance From YTD Highs\n\n&gt; The recent equity sell-off has clearly been global in nature as concerns of a global pandemic rise. Perhaps the most surprising aspect of the way equities have sold off recently is that the country that has been hardest hit by the virus is closer to its YTD high than any other major global equity benchmark. The chart below shows the distance that each major global equity benchmark has declined relative to its YTD high. China's Shanghai Composite is down just 4.45%, which is better than any other country shown. Sure, you could argue that the Chinese government is manipulating the market and prohibiting investors from selling, but even the ETF that tracks the CSI 300 (ASHR) is down less than 6%, so anyone could go in and trade at these levels. Manipulated or not, the numbers are the numbers.\n\n&gt; At the bottom of the list, Brazil's Ibovespa index is down more than any other country at 11.6% and that country has only reported one confirmed case so far. With respect to US indices, the Russell 2000 is down the second most of any major global benchmark (-9.19%), while the Nasdaq is down the fourth most at 8.68%. Even the S&amp;P 500 is down close to 8%. These weak US readings come in a backdrop where there have only been 57 confirmed cases and all but a couple are instances where Americans contracted the virus outside of the United States and have been brought to the US under quarantine. Join Bespoke Premium to access Bespoke's most actionable stock market research and analysis.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/02/022620-Distance-from-2020-High.png))**\n\n*****\n\n# Just Four S&amp;P 500 Stocks Up This Week\n\n&gt; There's still another day left in the week, but unless things improve on Friday this will go down as one of the worst weeks for US equities in history. Since WWII, there have only been four other weeks where the S&amp;P 500 was down more than 10% in a given week. On a related note, there are also only four stocks in the entire S&amp;P 500 that are positive for the week! Leading the way higher, Regeneron (REGN) is up a healthy 7.1% while Gilead (GILD) is up just over 4%. Behind these two, the only other stocks that are higher now than they were at last Friday's close are Clorox (CLX) and CME Group (CME).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/02/022720-Biggest-Gainers.png))**\n\n&gt; On the downside, there are a lot more losers, but in the interest of space, below we have only listed the 17 stocks in the S&amp;P 500 that are down over 20% this week alone. Looking through the names on the list, the cruise lines are well represented with Royal Caribbean (RCL), Norwegian Cruise Lines (NCLH), and Carnival (CCL). Besides these names, American Airlines (AAL) is down 26%, while Live Nation (LYV) is down 22.2%.\n\n&gt; One thing we've heard a number of people argue the last few days is that some of the weakness this week is related to the increasing likelihood that Bernie Sanders wins the Democratic nomination. If that's the case, why is not a single one of the worst-performing stocks from the Health Care sector, and why is the Health Care sector the third best performing sector this week and one of just four that is not down 10% so far this week?\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/02/022720-Biggest-Decliners.png))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$TGT** \n&gt; * **$PLUG** \n&gt; * **$JD** \n&gt; * **$ZM** \n&gt; * **$COST** \n&gt; * **$TLRY** \n&gt; * **$AZO** \n&gt; * **$KSS** \n&gt; * **$SPLK** \n&gt; * **$DLTR** \n&gt; * **$VEEV** \n&gt; * **$XRAY** \n&gt; * **$SE** \n&gt; * **$MRVL** \n&gt; * **$FOLD** \n&gt; * **$KR** \n&gt; * **$OKTA** \n&gt; * **$STNE** \n&gt; * **$BLDP** \n&gt; * **$BURL** \n&gt; * **$CIEN** \n&gt; * **$ALBO** \n&gt; * **$MAXR** \n&gt; * **$ANF** \n&gt; * **$ITCI** \n&gt; * **$FNKO** \n&gt; * **$JWN** \n&gt; * **$EPRT** \n&gt; * **$VIPS** \n&gt; * **$GTT** \n&gt; * **$CORE** \n&gt; * **$BNFT** \n&gt; * **$LVGO** \n&gt; * **$EVRG** \n&gt; * **$ROST** \n&gt; * **$EGRX** \n&gt; * **$AOBC** \n&gt; * **$TGLS** \n&gt; * **$ATRS** \n&gt; * **$HPE** \n&gt; * **$NWN** \n&gt; * **$WVE** \n&gt; * **$WSC**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/j7kavSk.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/x29nduD.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 3.2.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/WpXhdqA.png))\n\n\n&gt; # ***Monday 3.2.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ycdhPpa.png))\n\n\n*****\n\n&gt; # ***Tuesday 3.3.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/VIBwP3J.png))\n\n&gt; # ***Tuesday 3.3.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/0CU1CX3.png))\n\n*****\n\n&gt; # ***Wednesday 3.4.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/BCVHMu2.png))\n\n&gt; # ***Wednesday 3.4.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/6EsJdZf.png))\n\n*****\n\n&gt; # ***Thursday 3.5.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/3YUYSb9.png))\n\n&gt; # ***Thursday 3.5.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/M3Hifok.png))\n\n*****\n\n&gt; # ***Friday 3.6.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/n0W1FLJ.png))\n\n*****\n\n&gt; # ***Friday 3.6.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n# Target Corp. $103.00\n&gt; **Target Corp. (TGT)** is confirmed to report earnings at approximately 6:30 AM ET on Tuesday, March 3, 2020. The consensus earnings estimate is $1.66 per share on revenue of $23.49 billion and the Earnings Whisper ® number is $1.68 per share. Investor sentiment going into the company's earnings release has 74% expecting an earnings beat Consensus estimates are for year-over-year earnings growth of 8.50% with revenue increasing by 2.23%. On Friday, February 28, 2020 there was some notable buying of 3,641 contracts of the $100.00 put expiring on Friday, March 20, 2020.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TGT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Plug Power, Inc. $4.34\n&gt; **Plug Power, Inc. (PLUG)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, March 5, 2020. The consensus estimate is for a loss of $0.06 per share on revenue of $90.15 million and the Earnings Whisper ® number is ($0.05) per share. Investor sentiment going into the company's earnings release has 66% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 25.00% with revenue increasing by 50.70%. Short interest has increased by 29.2% since the company's last earnings release while the stock has drifted higher by 59.6% from its open following the earnings release to be 39.8% above its 200 day moving average of $3.10. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, January 17, 2020 there was some notable buying of 2,010 contracts of the $5.00 put expiring on Friday, March 20, 2020. Option traders are pricing in a 20.0% move on earnings and the stock has averaged a 4.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=PLUG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# JD.com, Inc. $38.51\n&gt; **JD.com, Inc. (JD)** is confirmed to report earnings at approximately 5:00 AM ET on Monday, March 2, 2020. The consensus earnings estimate is $0.44 per share on revenue of $23.81 billion and the Earnings Whisper ® number is $0.47 per share. Investor sentiment going into the company's earnings release has 76% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 1,000.00% with revenue increasing by 21.41%. Short interest has decreased by 9.9% since the company's last earnings release while the stock has drifted higher by 9.9% from its open following the earnings release to be 19.4% above its 200 day moving average of $32.25. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, February 12, 2020 there was some notable buying of 8,001 contracts of the $38.00 put expiring on Friday, March 20, 2020. Option traders are pricing in a 11.5% move on earnings and the stock has averaged a 5.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=JD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Zoom Video Communications, Inc. $105.00\n&gt; **Zoom Video Communications, Inc. (ZM)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, March 4, 2020. The consensus earnings estimate is $0.07 per share on revenue of $176.36 million and the Earnings Whisper ® number is $0.10 per share. Investor sentiment going into the company's earnings release has 82% expecting an earnings beat The company's guidance was for earnings of approximately $0.07 per share on revenue of $175.00 million to $176.00 million. The stock has drifted higher by 63.4% from its open following the earnings release to be 29.0% above its 200 day moving average of $81.40. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 12.1% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ZM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Costco Wholesale Corp. $281.14\n&gt; **Costco Wholesale Corp. (COST)** is confirmed to report earnings at approximately 4:15 PM ET on Thursday, March 5, 2020. The consensus earnings estimate is $2.06 per share on revenue of $38.34 billion and the Earnings Whisper ® number is $2.10 per share. Investor sentiment going into the company's earnings release has 75% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 2.49% with revenue increasing by 8.32%. Short interest has decreased by 9.0% since the company's last earnings release while the stock has drifted lower by 4.6% from its open following the earnings release to be 1.6% below its 200 day moving average of $285.72. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, February 27, 2020 there was some notable buying of 1,125 contracts of the $285.00 put expiring on Friday, March 20, 2020. Option traders are pricing in a 8.2% move on earnings and the stock has averaged a 3.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=COST&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Tilray, Inc. $14.43\n&gt; **Tilray, Inc. (TLRY)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, March 2, 2020. The consensus estimate is for a loss of $0.34 per share on revenue of $55.35 million and the Earnings Whisper ® number is ($0.40) per share. Investor sentiment going into the company's earnings release has 51% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 3.03% with revenue increasing by 256.38%. Short interest has increased by 25.9% since the company's last earnings release while the stock has drifted lower by 32.1% from its open following the earnings release to be 49.5% below its 200 day moving average of $28.57. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, February 26, 2020 there was some notable buying of 2,011 contracts of the $15.00 call expiring on Friday, April 17, 2020. Option traders are pricing in a 26.7% move on earnings and the stock has averaged a 8.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TLRY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# AutoZone, Inc. -\n&gt; **AutoZone, Inc. (AZO)** is confirmed to report earnings at approximately 6:55 AM ET on Tuesday, March 3, 2020. The consensus earnings estimate is $11.87 per share on revenue of $2.58 billion and the Earnings Whisper ® number is $12.01 per share. Investor sentiment going into the company's earnings release has 73% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 3.31% with revenue increasing by 5.28%. Short interest has decreased by 7.1% since the company's last earnings release while the stock has drifted lower by 16.7% from its open following the earnings release to be 7.3% below its 200 day moving average of $1,113.49. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 8.3% move on earnings and the stock has averaged a 5.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AZO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Kohl's Corporation $39.15\n&gt; **Kohl's Corporation (KSS)** is confirmed to report earnings at approximately 7:00 AM ET on Tuesday, March 3, 2020. The consensus earnings estimate is $1.92 per share on revenue of $6.80 billion and the Earnings Whisper ® number is $1.91 per share. Investor sentiment going into the company's earnings release has 40% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 14.29% with revenue decreasing by 0.34%. Short interest has decreased by 2.6% since the company's last earnings release while the stock has drifted lower by 19.7% from its open following the earnings release to be 19.9% below its 200 day moving average of $48.86. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, February 24, 2020 there was some notable buying of 809 contracts of the $40.00 put expiring on Friday, March 20, 2020. Option traders are pricing in a 11.7% move on earnings and the stock has averaged a 9.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=KSS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Splunk Inc. $147.33\n&gt; **Splunk Inc. (SPLK)** is confirmed to report earnings at approximately 4:00 PM ET on Wednesday, March 4, 2020. The consensus earnings estimate is $0.96 per share on revenue of $783.94 million and the Earnings Whisper ® number is $1.00 per share. Investor sentiment going into the company's earnings release has 91% expecting an earnings beat The company's guidance was for revenue of approximately $780.00 million. Consensus estimates are for year-over-year earnings growth of 31.51% with revenue increasing by 26.02%. Short interest has increased by 2.1% since the company's last earnings release while the stock has drifted higher by 9.1% from its open following the earnings release to be 10.8% above its 200 day moving average of $132.95. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, February 26, 2020 there was some notable buying of 2,414 contracts of the $155.00 call expiring on Friday, March 6, 2020. Option traders are pricing in a 13.0% move on earnings and the stock has averaged a 8.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SPLK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Dollar Tree Stores, Inc. $83.03\n&gt; **Dollar Tree Stores, Inc. (DLTR)** is confirmed to report earnings at approximately 7:30 AM ET on Wednesday, March 4, 2020. The consensus earnings estimate is $1.75 per share on revenue of $6.39 billion and the Earnings Whisper ® number is $1.75 per share. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat The company's guidance was for earnings of $1.70 to $1.80 per share. Consensus estimates are for earnings to decline year-over-year by 9.33% with revenue increasing by 2.98%. Short interest has decreased by 7.1% since the company's last earnings release while the stock has drifted lower by 13.3% from its open following the earnings release to be 17.9% below its 200 day moving average of $101.15. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, February 26, 2020 there was some notable buying of 3,974 contracts of the $85.00 call expiring on Friday, March 20, 2020. Option traders are pricing in a 9.0% move on earnings and the stock has averaged a 7.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DLTR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/wallstreetbets.",
        "subreddit": "wallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning March 2nd, 2020",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fbedqa/wall_street_week_ahead_for_the_trading_week/",
        "created": 1583020314.0
    },
    {
        "author": "flyyoufools97",
        "created_utc": 1581606766,
        "id": "f3bdex",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "I think I'm finally going to buy this stock.  It's P/E ratio is still relatively cheap compared to MSFT or basically any other tech company out there.  They're rotting in cash and I see nothing but growth in the next decade.  \n\nAny reason not to buy it?  What are your thoughts?",
        "subreddit": "stocks",
        "title": "So, Apple...",
        "url": "https://www.reddit.com/r/stocks/comments/f3bdex/so_apple/",
        "created": 1581635566.0
    },
    {
        "author": "LowNumber8",
        "created_utc": 1582654545,
        "id": "f9ehda",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "Hi,\n\nI currently hold 6x AAPL, 10x MSFT and 75x SPCE. I plan to hold all my stocks longterm. Now that the market is low, should I increase my holdings in one of them or add other stocks like V, MA, AMD, DIS, NVDA ...? \n\nI also have World ETF‘s but would like to spice it up with shares.\n\nWhat do you think?\n\nThanks !",
        "subreddit": "stocks",
        "title": "Which long term stocks to buy right now ?",
        "url": "https://www.reddit.com/r/stocks/comments/f9ehda/which_long_term_stocks_to_buy_right_now/",
        "created": 1582683345.0
    },
    {
        "author": "runningwiththebulls",
        "created_utc": 1582050949,
        "id": "f5wdqs",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "I have about $14,000 saved up that I will need to pay for tuition next year. Currently it is in Apple, FSMEX, and Intel. Basically I want at least a 50% gain so when I graduate I won't be completely broke. I will not have any student debt. I have been researching theta gang strategies and was wondering if that would be enough to gain 7k by next semester.",
        "subreddit": "wallstreetbets",
        "title": "How to double my tuition money before next semester?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f5wdqs/how_to_double_my_tuition_money_before_next/",
        "created": 1582079749.0
    },
    {
        "author": "MaxBPlanking",
        "created_utc": 1582990279,
        "id": "fbe359",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "Hi!\n\nI had a call spread on Apple,\n\n* Sold 28 FEB 27 275 Call\n* Bought 28 FEB 277.5 Call\n\nI had thought they were expiring next Friday, so it's my fault that I didn't double check the expiration.\n\nApple closed Friday at $273.36, but went a few cents ITM after hours. I was under the impression that if options were still OTM after 1.5 hours into afterhours, they would not be assigned. TD Ameritrade is currently marking Apple at $274.91.\n\nI just received an email that I've been assigned on my short call. The issue is, I don't have enough capital to cover that position, and since it's the weekend and my position has expired, I can't use my long call to cover. \n\nCurrently, my TD account indicates that I have a potential maintenance call of $7,379.00.\n\nMy question is, what will happen on Monday morning? If Apple opens at $275 or lower, will TD just purchase these shares and cover, or will I be affected some how?\n\nThanks!",
        "subreddit": "options",
        "title": "Assigned on my short call, and I have a question.",
        "url": "https://www.reddit.com/r/options/comments/fbe359/assigned_on_my_short_call_and_i_have_a_question/",
        "created": 1583019079.0
    },
    {
        "author": "LoganYoung34",
        "created_utc": 1581382641,
        "id": "f20bon",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "Hello everyone! To keep this post a reasonable length I will link to my valuation hosted on Adobe's document cloud. [Link to full valuation in pdf format here!](https://documentcloud.adobe.com/link/track?uri=urn%3Aaaid%3Ascds%3AUS%3Ae4edb1a1-16a2-4e6a-a52b-b4a105a981c7) (If you want to skip the explanation of the inputs the story behind the numbers is located on pages 8-9 and the DCF model is located on page 10). Please take a look at the valuation before bashing or agreeing with my range.\n\nFor the past year Apple has been on a massive run with seemingly no sign of stopping. Analysts have been upping their price targets and managers who have missed out on the run are piling in. With Apple recently reporting earnings, there has been renewed debate about what price investors should be paying for stock in Apple. Many say that the company is expensive and point to relative valuation measures such as P/E that are above their long term averages. Others say the company is inexpensive and point to growing revenue segments such as wearables and services.\n\nMy preferred method of valuing companies is intrinsic valuation, and what I present here is an intrinsic valuation assessing the value of equity in Apple using a DCF model. I am hoping to start a discussion about what others believe that Apple stock is worth, as well as what assumptions I have made that others agree or disagree with.\n\nI present a base case, bull case, and bear case for Apple and what each of those scenarios would potentially look like. If I was an analyst I would give the stock a buy rating and place the fair value range of Apple stock between $350 and $400. This is NOT a price target and is based on the assumptions which are outlined in the paper.\n\nPlease leave any questions, comments, feedback, and discussion down below. I thoroughly enjoy talking about companies, the stock market, economics, etc. Preferably leave comments that are constructive or spark discussion.",
        "subreddit": "investing",
        "title": "($AAPL) Apple Intrinsic Valuation as of 2/10/2020. What do you think Apple stock is worth?",
        "url": "https://www.reddit.com/r/investing/comments/f20bon/aapl_apple_intrinsic_valuation_as_of_2102020_what/",
        "created": 1581411441.0
    },
    {
        "author": "GreedySpeculator",
        "created_utc": 1582671281,
        "id": "f9iydb",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": " \n\nI'd  like to share some thoughts to help me straighten my thoughts because  this is an extremely difficult juncture. I'll try to be very concise.\n\nNarrative  is focused 100% on a few hundred cases in some in and around Italy, for  most traders that is the beginning but in the context of the broader  implications of COVID19, if it was gonna kill US mkts it would have done  so when Wuhan quarantined 11m productive consumers and locked supply  chain for an unforeseen amount of time. Even the DAX which is extremely  exposed to Wuhan was at an ATH of 13800. instead we had a quick V shaped  dip in the US and even FXI / KWEB recovered (not without the national  team but that's another story)\n\nMy  explanation as to what was happening was that as long as bonds kept  rallying so much (TLT) it was fine to keep the equity as the central  bankers had our back and there's nothing that the nasdaq loves more than  lower real rates ($TIP &amp; $GLD)\n\nSuddenly  the actual fed chair, Richard Clarida gave an interview to S.Liesmann  where he essentially told the mkt to back off cuz it ain't happening\n\n📷\n\n[https://www.cnbc.com/2020/02/25/fed-vice-chair-clarida-says-its-still-too-soon-to-tell-how-much-coronavirus-will-impact-growth.html](https://www.cnbc.com/2020/02/25/fed-vice-chair-clarida-says-its-still-too-soon-to-tell-how-much-coronavirus-will-impact-growth.html)\n\nhe's also sending his homies to relay the same message, ie just now :\n\n[https://www.wsj.com/articles/feds-kaplan-unclear-right-now-coronavirus-calls-for-rate-change-11582670163](https://www.wsj.com/articles/feds-kaplan-unclear-right-now-coronavirus-calls-for-rate-change-11582670163)\n\n📷\n\nAnd  see that's a huge problem because even if you take the Nasdaq which is  the best index in the world as far as fundamentals go the valuation  doesn't make sense historically unless u consider &lt; 0 real rate that  we were pricing in. if the guy doesn't cut to where we expect him to cut  (2 cuts) then the real rate is around 50bps and we've never had Spooz  trading at 19x NTM PE with 50bps real rate and gold at 1700 suddenly  makes no sense at all.\n\nSo my thinking is that this dude spoiled the one thing which made the mkt not fall on a number of bearish items :\n\n* Extremely strong $ which is negative to earnings for big nasdaq names\n* Bank  names holding up way better than they ought to given what the curve was  doing assuming great US consumer (KRE is down 4% today)\n* AAPL/SMH universe supply chain disruptions in Wuhan\n* Comrade sanders gaining groud was dismissed by mkt participants as having no chance vs the Don\n\nAnd now it suddenly all came to the forefront, crystallized in this italian pasta flu bullshit.\n\nSo  now what's next, i think we can have a V shaped recovery because  Chinamen have done an outstanding work containing the disease and  getting back to work asap + they have spared no effort in liquidity and  fiscal measures to help, unlike the fed here.\n\nAt  worst this becomes a more dangerous type of seasonal flu and we get on  on our lives. Nasdaq earnings for one are extremely good  but if the FED  doesn't want to help\n\nBut it won't  happen if the fed keeps pushing back against what is priced in the mkt  (&gt;2 cuts by year end)  so yeah, i have so many reasons to buy the  nasdaq here but i think it makes sense to stay prudent because unless  Clarida concedes very soon, it will soon mean that the 2yr rate will  have to get back to &gt;1.5 and it is simply impossible for equities to  rally in front of that.\n\nAlso you cannot trade here without differentiating btwn timezones:\n\nOne  thing that is certain is that Europeans came on board on the FED  argument, that's why the selling has been so harsh during EZ timezones,  in fact all of yesterday's loss came from them. US Simply managed to  keep it flat and only sold today.\n\nAsian  seems to be the only timezone where you can express some bullishness  and i will be trying to that however there is one issue which is  extremely problematic for the Nikkei (and can pull down all indexes with  it) and that's the Tokyo Olympics, let's just say that a lot of hope  rests on it in Japan and tonight's session will depend on how they  interpret this news item\n\n[https://www.japantimes.co.jp/news/2020/02/25/national/senior-member-says-ioc-three-months-decide-fate-tokyo-olympics/#.XlV7dkpCdPY](https://www.japantimes.co.jp/news/2020/02/25/national/senior-member-says-ioc-three-months-decide-fate-tokyo-olympics/#.XlV7dkpCdPY)\n\nTLDR:\n\n**so  for now i will try a long in Asian session. and would short into  strength in EU/US Sessions as long as Fed doesn't change it's mind.**",
        "subreddit": "investing",
        "title": "Mkt might not be going down because of why you think it is going down",
        "url": "https://www.reddit.com/r/investing/comments/f9iydb/mkt_might_not_be_going_down_because_of_why_you/",
        "created": 1582700081.0
    },
    {
        "author": "thekeats7",
        "created_utc": 1582861358,
        "id": "faoje8",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "Disclaimer: This post is for bull gang only, fuck all you 🌈🐻 . \n\nAPT is set to 🚀🚀🚀 for as long as beer virus is a thing. Ride the Boomer fear and reap sweet tendies. I can’t believe nobody is talking about this stock, especially after it rose 130% today after announcing it was going to be able to fulfill the $14 million dollar order for new face masks. They only did $12 million in revenue all last quarter, and according to them\n\n“have now booked approximately $14.1M in orders for the company's N-95 face mask since January 27, 2020, an increase of $3.6M from the $10.4M reported as of February 13, 2020, and demand for the product remains  strong.”\n\nThis Bull Gang retards still have time to get in before it moons. And oh my is this shit going to moon, every panic seller Boomer is going to invest  what’s left of their 401ks into it after seeing that it doubled today cuz of the beer virus. No matter what Daddy Powell does the market is  gonna fall tomorrow cuz of Friday sell offs and more 🌈🐻 panic, which plays directly into this stock. Worst case scenario, Coronavirus is cured in a few weeks and we exit with sweet tendies; Best case scenario the whole world is infected and Anthony Bruce becomes the  new Tim Apple. To the moon boys. Fuck all the 🌈🐻 trying to take the market from us. \n\nTL;DR: Buy this shit if you’re still a part of Bull Gang but want to join in on the beer virus profits too. ",
        "subreddit": "wallstreetbets",
        "title": "THE YEAR OF THE BULL",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/faoje8/the_year_of_the_bull/",
        "created": 1582890158.0
    },
    {
        "author": "UnhandledPromise",
        "created_utc": 1581380286,
        "id": "f1zs4x",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "Tell me I'm wrong. \n\nI did the DD. I sat here and convinced myself. I looked at their IPO timeframes on their charts and they both look like shit. They're both failing to make money. They're both easily replaced by someone like Apple partnering with someone else and shoving an iPad mount onto a bike or in the case of Fitbit, an Apple watch. \n\n$BECKY doesn't care about Peloton. It's not something young women necessarily want, it's a status symbol for men and older women if anything. That makes it even worse than Fitbit.\n\nAnecdote: My realtor is loaded, and he uses his house as a marketing tactic so it's fucking massive. He has a Peloton. The thing is, it's an asset of his business (no proof, but come on), and it's on the same easy credit that's going around for everyone. I bet this is the case in most purchases. Why does this matter? \n\nPeloton is really exposed to a market downturn. Even IF this company is profitable right now (it isn't) and even IF this company finds a way into $BECKY's heart, and even IF this company innovates and amounts to more than an iPad on a cycle, all of that will blow away like a fart in highway traffic if a single thing threatens the market and overall consumer sentiment. \n\nIt's a product which could only exist in this inflated, horseshit market.",
        "subreddit": "wallstreetbets",
        "title": "$PTON = $FIT",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f1zs4x/pton_fit/",
        "created": 1581409086.0
    },
    {
        "author": "oncefriends",
        "created_utc": 1581101685,
        "id": "f0ez6d",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "Why has it even beaten earnings in 2019? \n\nIt costs 5x the price of Gdrive and 4x the price of OneDrive and 3x the price of Apple per Gb per month, and I don't see the interface being better in any way.\n\nThe only chance for it to go up is if it gets acquired but it's such an easy entry that everyone would do it themselves.\n\nBuying $10 puts for 2022.",
        "subreddit": "wallstreetbets",
        "title": "What kind of retard uses Dropbox anymore?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f0ez6d/what_kind_of_retard_uses_dropbox_anymore/",
        "created": 1581130485.0
    },
    {
        "author": "Maui100",
        "created_utc": 1581974440,
        "id": "f5fwrd",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "Apple warns on coronavirus — it won't meet revenue guidance because of constrained iPhone supply and suppressed demand in China - https://www.cnbc.com/2020/02/17/apple-warns-on-coronavirus-it-wont-meet-revenue-guidance-because-of-constrained-iphone-supply-and-suppressed-demand-in-china.html",
        "subreddit": "wallstreetbets",
        "title": "Apple Guidance",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f5fwrd/apple_guidance/",
        "created": 1582003240.0
    },
    {
        "author": "ThisIsTotesBillGates",
        "created_utc": 1582971814,
        "id": "fbaoec",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "This huge dip almost correction has dropped us back to 2016 levels on pretty much all over the line.\n\nSlowly its becoming clear that corona is just another flu-type.\n\nStarbucks is about to reopen their stores,\n\nApple has said that their factories might reopen soon...\n\nSome stocks are down and might be toxic on their own..  but some „le gems“ are simply on sale double whammy...\nShare your best thoughts and why",
        "subreddit": "stocks",
        "title": "Buy the Dip! What are the stocks we should be watching to buy after the corona craze passes?",
        "url": "https://www.reddit.com/r/stocks/comments/fbaoec/buy_the_dip_what_are_the_stocks_we_should_be/",
        "created": 1583000614.0
    },
    {
        "author": "TripleBrain",
        "created_utc": 1582261612,
        "id": "f769dz",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "First and foremost, I have followed the energy sector for quite some time so I'll give my thoughts on what I see with the aforementioned stocks and the trajectory as a whole.\n\nThis was my post some several months ago when ENPH had it's big ITC drop; needless to say, I bought the dip but without much capital at the time. \n\n [https://www.reddit.com/r/wallstreetbets/comments/dpce9k/enph\\_could\\_be\\_your\\_next\\_success\\_story/](https://www.reddit.com/r/wallstreetbets/comments/dpce9k/enph_could_be_your_next_success_story/)\n\nThat being said, let's jump in on the DD.\n\nThis year should be a great year for energy/green stocks with the rapid shifting of tech companies towards fully electric and renewable energy sources (namely TSLA, Intel, MSFT, Google, Apple, etc - all of which use solar energy as part of their operations). Considering the growth of the solar industry in the last year as well as software-driven solar tech, the energy market is consistently finding new opportunities to increase exposure in the greater market and making meaningful partnerships. Take for example Sun Power, which is one of the largest distributors of solar panels in the U.S, Phillips which is working on a sustainable energy source for TSLA vehicles, PLUG which is making deals with Amazon, Walmart, and potentially Home Depot. In fact, the U.S in 2019 has increased this sector's employment by 250,000 jobs in just Florida alone, and an increase in 31 states. Employment rate is oftentimes  a great predictor for an industry's health and outlook. Moreover, legislation such as CA Title 24 mandate requires all homes built after 2020 to have solar PV installed, and prior to this, following Lennar, Toll Brothers, and KBH, every new property developed in the last 2 years have solar installed and software-solar tech (automated thermostats). Another thing to consider is the cutting of door-to-door sales in many solar tech companies, and focusing on consultants that build partnerships for these companies. Vehicles are also starting to move into solar tech, with TSLA being the obvious front runner, but also fully electric Jaguars, MUSTANGS, and Audi's, all of which have never produced any fully electric, or even hybrid vehicles up until the recent years. The demand for solar is high and traditional energy providers (fossil fuels and standard energy providers) are starting to lose marketshare in the energy sector. This is mainly as a result of the growing issues and litigations over high winds, faulty equipment, and fires. If you take a look at solar installations, you will see a clear trend:\n\n&amp;#x200B;\n\nStarts with ITC incentives have been very favorable towards these solar companies, and with the tiered tax credit incentive system that depreciates each year, people are incentivized to get this tech sooner than later. What the ITC means (for those that don't know), it's the investment tax credit which is a 26% federal tax deduction for installing solar tech in your home. And as the full electric auto market grows, there is a substantially larger percentage of residents that will have these installed. For those buying new homes this year and forward, they will come fully furnished. \n\nThere are lots of catalyst in this space, everything from the automotive industry, real estate industry, software tech industry, ITC, and general move towards renewable energy. Cloud based platforms will require an immense amount of energy to run these cloud servers, and MSFT/Amazon are already all over solar tech. This area is also just starting to develop rapidly. \n\nMy picks are, from most optimistic to least:\n\nVSLR, RUN, SPWR, ENPH, SEDG \n\nAlso, for those that are discussing FSLR, it was a huge miss but imo analyst had no reason to lift EPS this high and guidance last quarter was far too optimistic. One big reason why I believe FSLR failed is that they are the only utility-scale distributor in the mix. That means they only work with utility companies to provide energy on large grids, however, they do not fit into the category or have partnerships with commercial or residential units. Moreover, as utility companies are beginning to lose marketshare and are losing the trust of customers (especially in CA), I can only imagine that FLSR partnerships are suffering. Anyway, I lost money on my calls which will probably be at -90% at open. I thought it would ride the energy wave, but I was wrong. \n\nAlso, WSB auto hid this post. lol",
        "subreddit": "stocks",
        "title": "Buy VSLR/RUN/SEDG/ENPH and how they are different from FSLR - Complete DD",
        "url": "https://www.reddit.com/r/stocks/comments/f769dz/buy_vslrrunsedgenph_and_how_they_are_different/",
        "created": 1582290412.0
    },
    {
        "author": "DerailedCM",
        "created_utc": 1582127913,
        "id": "f6cocw",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "I've never traded options before, but wouldn't you want to buy options that expire in late June/July since Apple will likely announce using AMD chips on June 3rd? \n\nI'm just trying to understand why so many of you think AMD will spike in the next 30 days.",
        "subreddit": "wallstreetbets",
        "title": "Why are you autists buying calls that expire on 3/20 for AMD?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f6cocw/why_are_you_autists_buying_calls_that_expire_on/",
        "created": 1582156713.0
    },
    {
        "author": "albertglue88",
        "created_utc": 1582139294,
        "id": "f6flg8",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "Yesterday they announce that they will not match results forecast.  Also, clearly one of the big tech companies with bigger China dependency. \n\nNone of their services really stand out (music, tv, iCloud, now wtf CDN). But still, they manage to be there just selling iPhones and EarPods. \n\nCan someone please explain? \n\nI understand their hardware sells are hard rock (even though, Microsoft surfaces are gaining traction).\n\nAnyway last time their stocks went down, one of the big claims was the lack of revenue on services... that hasn’t changed but still the stocks went 100% up in 1 year",
        "subreddit": "stocks",
        "title": "I don’t get Apple stocks behavior",
        "url": "https://www.reddit.com/r/stocks/comments/f6flg8/i_dont_get_apple_stocks_behavior/",
        "created": 1582168094.0
    },
    {
        "author": "pr0p3llerh43d",
        "created_utc": 1582682375,
        "id": "f9llwp",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "For the last month I've refused to believe the effects of the Coronavirus were priced in with the supply chain and consumer disruptions in China. After getting fucked buying SPY &amp; FXI puts 3 weeks ago, I tried again last week, and bought AAPL, NVDA and AMD puts as downside protection for my portfolio.\n\nAs you can see going from [here](https://i.imgur.com/Kgw3jLE.png) to [here](https://i.imgur.com/9Z5I4sZ.png), I'm up 3-4x on my puts. I bought basically 10% out of the money thinking it was a good hedge if everything went tits up. However everything is now in the money (except for NVDA).\n\nI'm long on the big semis (TSM, NVDA, AMD etc) in shares so my portfolio value has stayed pretty constant which is what I wanted.\n\nAnyway my question is, do I roll these puts over to further OTM puts? Just don't worry about it? I want downside protection but want to maximise gains if things keep crashing.\n\nTl;Dr: Roll over puts to further OTM or just shut the fuck up?",
        "subreddit": "wallstreetbets",
        "title": "I need some advice (downside protection on semis)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f9llwp/i_need_some_advice_downside_protection_on_semis/",
        "created": 1582711175.0
    },
    {
        "author": "Shmuco",
        "created_utc": 1581006497,
        "id": "ezur4b",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "I have a sum of money to invest in the short to medium term (2-3 years)  but I’m scared to it because there may be a better time to invest.\nI’m looking at company’s like Microsoft, google, Apple, Tesla, renewable energies and Alibaba\n\nWhat’s everyone’s thoughts?",
        "subreddit": "stocks",
        "title": "Sacred to invest",
        "url": "https://www.reddit.com/r/stocks/comments/ezur4b/sacred_to_invest/",
        "created": 1581035297.0
    },
    {
        "author": "1poundbookingfee",
        "created_utc": 1581521187,
        "id": "f2stfe",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "We fucked them, and now they fuck us back.\n\nGreat job guys, within 5 days and with down syndrome retard strength we managed to pump up the second largest market cap stock in the US through buying 30c way OTM calls. \n\nAt the same time, some poor algo thought we were some rain man retard and started buying up the underlying to hedge, creating a self fulfilling cycle of higher and higher prices. \n\nNow that were fully leveraged and some algo's human realized what was going on, they are starting to reap the pumped up premiums and unwinding the underlying shares. Turns out we were just idiot man rather than rain man.\n\nGodspeed. Tim Apple next or someone else bald?",
        "subreddit": "wallstreetbets",
        "title": "Algos are reaping the high premiums on MSFT calls",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f2stfe/algos_are_reaping_the_high_premiums_on_msft_calls/",
        "created": 1581549987.0
    },
    {
        "author": "Power80770M",
        "created_utc": 1581977839,
        "id": "f5gt5w",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Apple warns that coronavirus will hurt revenue",
        "url": "https://nyti.ms/2HxyciK",
        "created": 1582006639.0
    },
    {
        "author": "SirMixolydianalot",
        "created_utc": 1582909301,
        "id": "faxsck",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "Hi /r/investing. I sold most of my positions across the board yesterday and today. Overall I got out with a modest profit of 10-12%. I'm not complaining. But I'm still holding on to AAPL. What would you say the outlook looks like for AAPL? I bought most of them at $235'ish. Should I get out now while it's still in green?",
        "subreddit": "investing",
        "title": "How low could AAPL go?",
        "url": "https://www.reddit.com/r/investing/comments/faxsck/how_low_could_aapl_go/",
        "created": 1582938101.0
    },
    {
        "author": "KRONOS_415",
        "created_utc": 1581978515,
        "id": "f5gzik",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Apple Warns That Coronavirus Will Hurt Revenue",
        "url": "https://www.nytimes.com/2020/02/17/technology/apple-coronavirus-economy.html?smid=nytcore-ios-share",
        "created": 1582007315.0
    },
    {
        "author": "Ravenplague",
        "created_utc": 1580645895,
        "id": "exnna4",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "Just curios what people are planning on doing with their Apple stock. Yes, the trend for Apple stock includes a lot of pullbacks after earnings, and then there is a resurgence in share price to new highs, almost like clockwork. With that said, the absolute hysteria that coronavirus has created, which has now led to Apple closing stores for a week or two, has lit the fuse for a large sell off. Down $14+ on Friday alone, which is a bit excessive. I’m thinking of selling first thing on Monday, and then picking it up again when it’s on sale. Part of me wishes people would stop with the frenzied panic, but the rational investor in me realizes that this will create a lot of fire sake on opportunities.",
        "subreddit": "StockMarket",
        "title": "Apple Stock",
        "url": "https://www.reddit.com/r/StockMarket/comments/exnna4/apple_stock/",
        "created": 1580674695.0
    },
    {
        "author": "HarjodhKharbar",
        "created_utc": 1581964246,
        "id": "f5d64v",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "Apple has been quietly buying back their own stock and retiring it over the last few years because they think their stock is undervalued. \n\nIf Apple continues buying back a significant amount of their own stock, what effect will this have on their stock price?",
        "subreddit": "investing",
        "title": "Apple buying back stock",
        "url": "https://www.reddit.com/r/investing/comments/f5d64v/apple_buying_back_stock/",
        "created": 1581993046.0
    },
    {
        "author": "Shaun8030",
        "created_utc": 1582676612,
        "id": "f9k9o6",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "Down 8 percent since last week about 40k. \nHolding QQQ, Vgt and Soxx ETFs \nAmzn , Visa , Mastercard , apple, MSFT, Disney , goog stocks . \nNot worried at all confident my holdings will bounce back sooner or later.",
        "subreddit": "stocks",
        "title": "How much are you down and what are you holding ?",
        "url": "https://www.reddit.com/r/stocks/comments/f9k9o6/how_much_are_you_down_and_what_are_you_holding/",
        "created": 1582705412.0
    },
    {
        "author": "mytwm",
        "created_utc": 1580765406,
        "id": "eyeck5",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "## 📈 ARK Invest, Tesla’s biggest bull, set a target price of $7,000 for 2024\nAccording to a research performed by ARK Invest, Tesla may be worth $7,000 in 2024 and even $15,000 in the bull case. The firm analyzed 3 variables for Tesla: Gross margin, capital efficiency and autonomous driving capabilities. ARK’s valuation is based on ten scenarios, each of them probability weighted.\n\n[Tesla financial scores](https://inspectcompany.com/microsoft):\n* Profitability: **1.2**/10\n* Operating Efficiency: **1.4**/10\n* Liquidity: **2.5**/10\n* Solvency: **5**/10\n\n\n## 📦 Amazon announced that fourth quarter sales went up 21% to $87.4 billion\nAmazon reported financial results for the quarter ended on December 30, 2019. The company reported earnings per share of $6.48 and a revenue of $87.44B. In the same period last year, Amazon reported earnings per share of $6.04 on revenue of $72.38B.\n\n[Amazon financial scores](https://inspectcompany.com/microsoft):\n* Profitability: **5.4**/10\n* Operating Efficiency: **2.7**/10\n* Liquidity: **3.8**/10\n* Solvency: **6.9**/10\n\n## 📊 Microsoft reported better than expected earnings and guidance for next quarter\nMicrosoft reported financial results for the quarter ended on December 30, 2019. The company reported earnings per share of $1.52 and a revenue of $36.91B. In the same period last year, Microsoft reported earnings per share of $1.08 on revenue of $32.47B. Microsoft expects to earn between $34.1B and $34.9B in the next quarter.\n\n[Microsoft financial scores](https://inspectcompany.com/microsoft):\n* Profitability: **9.2**/10\n* Operating Efficiency: **9.3**/10\n* Liquidity: **8.8**/10\n* Solvency: **7**/10\n\n## 🤝 Accenture and Google Cloud collaborate to help life sciences companies advance the discovery, development and delivery of innovative therapies\nAccenture and Google Cloud announced that Google Cloud will be the cloud technology provider for Accenture’s INTIENT™ life sciences industry platform. The new, multi-year agreement brings Google’s cloud and artificial intelligence capabilities together with Accenture’s life sciences services and platforms and is intended to help life sciences organizations make their data more accessible, secure and valuable.\n\n[Alphabet financial scores](https://inspectcompany.com/microsoft):\n* Profitability: **7.7**/10\n* Operating Efficiency: **7.7**/10\n* Liquidity: **9.3**/10\n* Solvency: **9.7**/10\n\n## 📊 Earning reports for this week\nFebruary 3: Alphabet\nFebruary 3: American Financial Group\nFebruary 3: NXP Semiconductors\nFebruary 3: Check Point\nFebruary 3: AMG\nFebruary 3: Asbury Automotive Group\nFebruary 3: AECOM\nFebruary 4: Aflac\nFebruary 4: Chubb\nFebruary 4: Fiserv\nFebruary 4: Allstate\nFebruary 4: Eaton\nFebruary 4: Ralph Lauren\nFebruary 4: Cerner\nFebruary 4: Match Group\nFebruary 4: Disney\nFebruary 4: Genworth\nFebruary 4: Grace\nFebruary 4: Cummins\nFebruary 4: Sony\nFebruary 4: Royal Caribbean\nFebruary 4: New Relic\nFebruary 4: Clorox\nFebruary 4: ConocoPhillips\nFebruary 4: Allegheny Technologies\nFebruary 4: Centene\nFebruary 4: Ferrari\nFebruary 4: Emerson\nFebruary 4: Chipotle\nFebruary 4: Aramark\nFebruary 4: Ford Motor\nFebruary 4: Sally Beauty\nFebruary 4: Atmos Energy\nFebruary 4: SiriusXM\nFebruary 4: McKesson\nFebruary 4: Crown Holdings\nFebruary 4: Globe Life\nFebruary 4: Snap Inc.\nFebruary 4: Anixter\nFebruary 4: Allergan\nFebruary 4: Prudential Financial\nFebruary 5: AMETEK\nFebruary 5: DTE\nFebruary 5: GoPro\nFebruary 5: Twilio\nFebruary 5: Cubic\nFebruary 5: MetLife\nFebruary 5: General Motors\nFebruary 5: Coty\nFebruary 5: Cincinnati Financial\nFebruary 5: EnerSys\nFebruary 5: Capri Holdings\nFebruary 5: Merck\nFebruary 5: Toyota\nFebruary 5: Suncor Energy\nFebruary 5: Lincoln Financial Group\nFebruary 5: Flowers Foods\nFebruary 5: Peabody Energy\nFebruary 5: Penske\nFebruary 5: QUALCOMM\nFebruary 5: Nuance\nFebruary 5: UGI\nFebruary 5: FMC\nFebruary 5: AvalonBay Communities\nFebruary 5: Cognizant\nFebruary 5: Energizer\nFebruary 5: O’Reilly Auto Parts\nFebruary 6: Cemex\nFebruary 6: Manitowoc\nFebruary 6: Take-Two Interactive Software\nFebruary 6: FleetCor\nFebruary 6: Cigna\nFebruary 6: ESTĒE LAUDER\nFebruary 6: DXC Technology\nFebruary 6: AGCO\nFebruary 6: Zendesk\nFebruary 6: Yum! Brands\nFebruary 6: Kellogg’s\nFebruary 6: Fortinet\nFebruary 6: Cardinal Health\nFebruary 6: CDW\nFebruary 6: T-Mobile US\nFebruary 6: BD\nFebruary 6: Fortive\nFebruary 6: Baidu\nFebruary 6: Ball\nFebruary 6: Tyson Foods\nFebruary 6: Twitter\nFebruary 6: Activision Blizzard\nFebruary 6: Uber\nFebruary 6: Pinterest\nFebruary 6: ABIOMED\nFebruary 6: Bristol-Myers Squibb\nFebruary 7: AbbVie",
        "subreddit": "StockMarket",
        "title": "What's happening this week? Headlines on Tesla, Amazon, Microsoft, Alphabet and Accenture",
        "url": "https://www.reddit.com/r/StockMarket/comments/eyeck5/whats_happening_this_week_headlines_on_tesla/",
        "created": 1580794206.0
    }
]