[
    {
        "author": "SargeCarbon",
        "created_utc": 1608234441,
        "id": "kf4osv",
        "num_comments": 107,
        "num_crossposts": 0,
        "selftext": "**TL: DR at the bottom**\n\nI was searching about Jay-Z when I found this ticker. I researched this SPAC for a little bit a came to the conclusion that this stock that's really close to NAV is really underrated.  **Subversive Capital Acquisition Corp (SBVCF)** is going to merge with  **THE PARENT COMPANY** which includes companies like **Caliva, Left Coast Ventures, Rocnation and Monogram**.\n\n&amp;#x200B;\n\nFrom [Article 1](https://www.businesswire.com/news/home/20201124005792/en/Subversive-Capital-Acquisition-Corp.-the-Largest-Cannabis-SPAC-in-History-Announces-Transaction-with-Shawn-%E2%80%9CJAY-Z%E2%80%9D-Carter-Roc-Nation-Caliva-and-Left-Coast-Ventures) \" *Newly formed vertically integrated cannabis company to be named TPCO Holding Corp. (****The Parent Company)****, will be the* ***largest in California***\\*\"\\*\n\nWhat is **Caliva and Left Coast Ventures?**\n\nCaliva is 75$ million cannabis company that operates in California \"*Caliva currently reaches over 50% of consumers in California \".*\n\nLeft Coast Ventures is a [31.6$](https://www.owler.com/company/leftcoastventures) cannabis company that also operates in California\n\nCaliva and Left Coast Ventures expect combined pro forma revenues of $185 million in 2020 and $334 million in 2021.\n\nCaliva currently reaches over 50% of consumers in California through their existing platform for delivery. The Parent Company is expected to have the greatest consumer reach of any cannabis company in California reaching 75% of consumers in the state by the end of 2021 and almost 90% by the end of 2022.\n\n**These 2 companies will run the cannabis scene in California.**\n\nWhat is **Rocnation and Monogram?**\n\nRocnation is an entertainment agency founded by rapper Jay-Z in 2008. Rocnation has a revenue of  [$25 million](https://www.owler.com/company/rocnation). Rocnation is also backed by artists [Rihanna, Yo Gotti, and Meek Mill.](https://www.businessinsider.com/jay-zs-roc-nation-enters-into-partnership-top-cannabis-spac-2020-11)\n\nMonogram is a cannabis company founded by Jay-Z. This company is new and I couldn't find revenue but because Jay-Z is a popular online personality this SPAC may grow because of it.\n\nThese 2 companies will promote this stock which will make more young investors interested.\n\n**When is this deal expected to close?**\n\n\" *Transaction expected to close in January 2021* \"\n\n**Who is on the team?**\n\nSteve Allan as CEO- Brett Cummings as CFO, President of Left Coast Ventures- Dennis O’Malley as COO, President of Caliva- Shawn “JAY-Z” Carter as Chief Visionary Officer\n\n**Who is on the board of Directors?**\n\nCarol Bartz, former CEO of Yahoo and Autodesk- Desiree Perez, CEO of ROC NATION- Al Foreman, Partner of Tuatara Capital- Daniel Neukomm, CEO of La Jolla Group- Jeffry Allen, Director of NetApp and Barracuda- Leland Hensch, CEO of SCAC- Michael Auerbach, Founder and Chairman of SCAC\n\n**Where can I watch a conference?**\n\n[Here](https://www.prnewswire.com/news-releases/subversive-capital-acquisition-corp-the-largest-cannabis-spac-in-history-to-webcast-live-at-virtualinvestorconferencescom-december-3rd-301183566.html)\n\n**Link to the SPAC website:** [Here](https://www.subversivecapital.com/)\n\n**TL;DR:** This SPAC will merge with \"The Parent Company\". This company is the largest cannabis company in California. Jay-Z is the Chief Visionary Officer, with his popular influencer friends promoting his product. They have $575 million in cash on hand. $185 million net revenue this year. This stock is very underrated.\n\n**Risks:** This is an OTC which means it is, not SEC reviewed, and **can** be fraud, but doesn't have to be.\n\n&amp;#x200B;\n\n&amp;#x200B;",
        "subreddit": "SPACs",
        "title": "$SBVCF - THe Biggest Cannabis SPAC Deal Ever?",
        "url": "https://www.reddit.com/r/SPACs/comments/kf4osv/sbvcf_the_biggest_cannabis_spac_deal_ever/",
        "created": 1608263241.0
    },
    {
        "author": "ThrowRAGlados",
        "created_utc": 1609366502,
        "id": "knc5ji",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "I was curious on how many holdings this community would consider too much, or if anyone has a target number. Far anyone curious, my portfolio consists of even proportions of companies trading above the EMA in my watchlist. They are as following:\n\nCERS\nZNGA\nSGMO\nIOVA\nENPH\nTGTX\nMYOV\nDAC\nPUMP\nPLAY\nROKU\nCHGG\nICLN\nBLDP\nKOD\nPLUG\nJKS\nNIO\nNET\nQCLN\nTAN\nTSM\nPLTR\nAPOG\nMAXN\nDIS\nAMD\nGME\nLMND\nJD\nHUBS\nFCEL\nCRSR\nCOUP\nCRWD\nOKTA\nADSK\nTSLA\nSHOP\n\nAre there any of these you would be nervous holding? Anything you would want to add?",
        "subreddit": "investing",
        "title": "How many holdings would you say are too many?/which of mine would you get rid of?",
        "url": "https://www.reddit.com/r/investing/comments/knc5ji/how_many_holdings_would_you_say_are_too_manywhich/",
        "created": 1609395302.0
    },
    {
        "author": "piss-in-a-bottle",
        "created_utc": 1607451825,
        "id": "k99p2g",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "**Sales Growth**\n\nPalantir's (PLTR) growth increased by 51.87% in the last quarter. As shown within Figure 1, this is a quick and promising recovery from the COVID quarter. This coupled with the downturn of COVID cases and PLTR's active involvement in combatting the virus should continue to enable revenue uptick. It should be particularly noted that PLTR'S September Net Income (\\~900m) has increased dramatically now they have signed a number of significant contracts.\n\n&amp;#x200B;\n\n**DO WALL STREET ANALYSTS RECOMMEND INVESTORS BUY SHARES OF PALANTIR TECHNOLOGIES?**\n\n6 Wall Street analysts have issued \"buy,\" \"hold,\" and \"sell\" ratings for Palantir Technologies in the last year. There are currently 5 hold ratings and 1 buy rating for the stock, resulting in a consensus recommendation of \"Hold.\" This is relevant as of 12/2. **I got banned before making this post because the mods are fgts so I'm too lazy to update.**\n\n&amp;#x200B;\n\n**WHEN IS PALANTIR TECHNOLOGIES' NEXT EARNINGS DATE? SHALL I GET SHARES TO HOLD FOR GLORIOUS TENDIES?**\n\nPalantir Technologies is scheduled to release its next quarterly earnings announcement on Thursday, February 11th 2021. Holding shares until this point would be my advice, especially given their newly executed contracts with substantial SLAs.\n\n&amp;#x200B;\n\n**WHEN DID PALANTIR TECHNOLOGIES IPO?**\n\n(PLTR) raised $0 in an initial public offering (IPO) on Wednesday, September 30th 2020. The company issued 257,100,000 shares at $0.00 per share. None served as the underwriter for the IPO. This is a NEW stock. It will be volatile, as is a lot of IPOs.\n\n&amp;#x200B;\n\n**WHO ARE PALANTIR TECHNOLOGIES' MAJOR SHAREHOLDERS?**\n\nPalantir Technologies' stock is owned by a variety of retail and institutional investors. Top institutional shareholders include Point72 Asset Management L.P. (1.95%), BlackRock Inc. (1.91%), Soros Fund Management LLC (1.20%), Allen Operations LLC (0.45%), Myriad Asset Management Ltd. (0.31%) and Public Sector Pension Investment Board (0.29%). Company insiders that own Palantir Technologies stock include Alexander C Karp, Alexander D Moore, David A Glazer, Matthew A Long, Shyam Sankar and Stephen Andrew Cohen.\n\n**WHAT IS PALANTIR TECHNOLOGIES' STOCK PRICE TODAY?**\n\nOne share of PLTR stock can currently be purchased for approximately $28.87. High band priced at 36.70 by EOY based on current trends. Low band priced at $21.10 by EOY based on current trends. This prediction is indicative of current trends, however would not be a sign for future performance. My personal view is if you own shares, hold them. Similar companies within PLTR's industry Oracle (ORCL), SAP (SAP), Shopify (SHOP), ServiceNow (NOW), Intuit (INTU), Square (SQ), Snowflake (SNOW), Activision Blizzard (ATVI), Autodesk (ADSK), VMware (VMW) on average have shown a steady uptick of growth and will continue to do so given the future viability of the product. Buying is under your own discretion, if you think that big data is going to be a part of the future then consider a buy. If not, don't.\n\n&amp;#x200B;\n\n**TLDR**: Newly IPO'd company, high likelihood to continue to grow exponentially over time now commercialised, strong contracts but volatile stock. \n\n**Recommendation:** Ban anyone who bad-mouths PLTR",
        "subreddit": "wallstreetbets",
        "title": "PLTR Stock - Main Summary Points",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k99p2g/pltr_stock_main_summary_points/",
        "created": 1607480625.0
    },
    {
        "author": "cg1899",
        "created_utc": 1607968706,
        "id": "kd2mvt",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "I've been dollar cost averaging in M1 Finance since October 28, 2019. I contributed $2000 for tax year 2019 and $6000 (max) for tax year 2020. I have current positions in the following: \n\nTTD, TSLA, FVRR, CRWD, PYPL, NFLX, SNPS, PINS, HUBS, TWLO \n\nMy last change, I took a little off the top with TWLO as I thought it was going to tank...it did not and it kept going. I wanted to spread some love to PYPL, NFLX, SNPS and PINS. I should have let it run, but oh wellz. \n\nWhat I'd like to do is hopefully have 40% annualized return so I can get $1,000,000 in a 10 year timeline. I'm not interested in going index funds (I will advise folks who are in their 20s to do that.) \n\nI am think of liquidating everything to keep my double-up and go into the following M1 pies: \n\n**Financial Pie** 25%\n\n**Consumer Cyclical Pie** 25%\n\n**Communication Services Pie** 25%\n\n**Technology Pie** 25%\n\n**\\*** **Financial Pie** \n\nLMND 50%\n\nPYPL 50%\n\n\\* **Consumer Cyclical Pie**\n\nAMZN 50%\n\nTSLA 50%\n\n\\* **Communication Services Pie**\n\nDIS 20%\n\nFVRR 20%\n\nPINS 20%\n\nTWLO 20%\n\nZM 20%\n\n\\* **Technology Pie**\n\nCRWD 17%\n\nHUBS 17%\n\nSHOP 17%\n\nTTD 17%\n\nADSK 16%\n\nOKTA 16%\n\n\\--------\n\nShould I start from scratch with the above? If I can get 40% or more of annualized returns with what I've done I'd be very happy. Once I get a million, I will then turn into a dividend investor and live off yields for the rest of my life. That's my goal anyway. I welcome any advice or being pointed in the right direction.",
        "subreddit": "investing",
        "title": "Doubled My Contribution in Roth IRA in a Little Over a Year. Do I Sell to Rebalance My Positions or Stay Put?",
        "url": "https://www.reddit.com/r/investing/comments/kd2mvt/doubled_my_contribution_in_roth_ira_in_a_little/",
        "created": 1607997506.0
    },
    {
        "author": "Zealousideal-Post116",
        "created_utc": 1609444609,
        "id": "knwusn",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[https://reportedtimes.com/engineering-design-software-market-is-going-to-boom-ibm-geometric-autodesk-dassault-systems-bentley-systems-hexagon-ab/](https://reportedtimes.com/engineering-design-software-market-is-going-to-boom-ibm-geometric-autodesk-dassault-systems-bentley-systems-hexagon-ab/)\n\nA Recent IPO (9/22/2020) I found that is showing huge growth and even more potential. IPO opened at $22 back in September and they're already up to $40/share, up 55%!  They're a Software company in the infrastructure industry, developed software such as MicroStation.\n\nHow they originally caught my eye:\n\n* 44 Acquisitions, essentially trucking any competitor in their path\n* Locked in Government Contracts (I.e. DMV, Highway and Safety, Toll roads, Bridge inspections..etc)\n* Earnings are forecast to grow 20.29% per year\n* Revenue grew by 8.2% over the past year\n* A niche market (infrastructure) which has a hands\n* They seem to be making the right forward thinking choices (SaaS instead of Fat Client, building software on popular cloud platforms (AWS and Azure), and slowly cutting back on debt\n\nThe industry is booming, seems to only be a matter of time before it catches the eyes of a hedge fund company that buys a ton of shares and we see a huge rocket to the moon",
        "subreddit": "wallstreetbets",
        "title": "Engineering Design Software to Boom! Ticker: BSY",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/knwusn/engineering_design_software_to_boom_ticker_bsy/",
        "created": 1609473409.0
    }
]