[
    {
        "author": "Sevro_andthe_howlers",
        "created_utc": 1598320338,
        "id": "ig2w5s",
        "num_comments": 1083,
        "num_crossposts": 0,
        "selftext": "This is not financial advise. Do your own research. I personally am gonna do exactly what this says, and.... hard.\n\nThis is a win big or lose the entire bet trade. Here’s the backstory:\n\nIf you watch the Commodities Futures Trading ([https://www.cftc.gov/](https://www.cftc.gov/)) weekly report on precious metals report (near the bottom here at “Commodity Exchange Incorporated” “short format) [https://www.cftc.gov/MarketReports/CommitmentsofTraders/index.htm](https://www.cftc.gov/MarketReports/CommitmentsofTraders/index.htm))\n\nYou can see that from last weekly, large commercial traders were net short about 46,000 silver contracts. That's 240,000,000 ounces. **They can't get them.**\n\nhttps://preview.redd.it/faa0pivd12j51.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=b285392df24cf18568983dd46c6ca5ab4f5e01a3\n\nThere’s only about 1,000,000,000 in circulation. Physical silver is going for a $7-$8 premium versus /SI. \n\nThe thinking is that this large discrepancy in physical vs paper will lead to MANY more /SI holders seeking delivery next Thursday when settlement occurs.That leaves the banks with 3 options.\n\n1. Write more paper contracts short and try to hammer the price. That would lead to more exposure I'm not thinking they want.\n\n2. Take their lumps and attempt to fill as many settlements as possible. They risk losses in the billions and fines\n\n3. Most likely. They attempt to buy the contracts back, driving a huge temporary jump in prices. Basically the reverse of oil in april. I expect SLV to go crazy on Wednesday and Thursday this week.\n\nSomeone else does too as the option volume and open interest at $40 strike is the highest on the board so.... what is to prevent a[ $TSLA](https://twitter.com/search?q=%24TSLA&amp;src=cashtag_click) or[ $AAPL](https://twitter.com/search?q=%24AAPL&amp;src=cashtag_click) like squeeze in[ $SLV](https://twitter.com/search?q=%24SLV&amp;src=cashtag_click) next week?!\n\nI would like to say nothing.,,\n\nTHE PLAY\n\nThe play is to pick up options on Tuesday (tomorrow) that expire on Friday, and our out of the money. (I personally went with $28 strike, but I have a few lottos too). If scenario 2 happens, we make money. If 3 happens, we make a lot. If 1 happens, we try again next week and the hole is deeper.\n\n(REPORT)\n\nI have already made an offering to the Tendie Gods, so I hope I'm good. We'll see.\n\nhttps://preview.redd.it/ssn2ssr912j51.jpg?width=1512&amp;format=pjpg&amp;auto=webp&amp;s=595bc2fb25dccdaa3b612350018f4ee4981ab803",
        "subreddit": "wallstreetbets",
        "title": "THE most serious DD you'll see for quite a while. Prepare for tendie overload.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ig2w5s/the_most_serious_dd_youll_see_for_quite_a_while/",
        "created": 1598349138.0
    },
    {
        "author": "ChunkyLittleSquirrel",
        "created_utc": 1598666207,
        "id": "iik7g2",
        "num_comments": 873,
        "num_crossposts": 0,
        "selftext": "In particular Apple and Tesla. The longer I wait for them to become cheaper, the higher they go. Let's forget all technicals and fundamentals because 2020 right. Now I actually expect these to go ever higher after the actual split, simply because so many people will think they've instantly became cheaper. Simple lesson here...Once again, time-in beats timing.",
        "subreddit": "stocks",
        "title": "The longer I wait for Stocks to become cheaper, the more expensive they get.",
        "url": "https://www.reddit.com/r/stocks/comments/iik7g2/the_longer_i_wait_for_stocks_to_become_cheaper/",
        "created": 1598695007.0
    },
    {
        "author": "1541drive",
        "created_utc": 1598627851,
        "id": "ii8wsu",
        "num_comments": 812,
        "num_crossposts": 0,
        "selftext": "For those who subscribe to having the majority or the entirety of their equity holdings to consist of ETF/funds from the S&amp;P 500, the impact to their portfolio as a function of any one company has increased substantially.\n\nEven with total market funds like Vanguard's VTI, these five stocks make up an outsized portion of the fund because of market cap weight.  \n\nMuch like investors using \"ex-US\" funds to increase exposure to international holdings, are there funds that are \"ex-FAANG\" so individuals can lessen the impact?  If not, would another practical strategy be to buy more non-tech sector funds as opposed to say buy more of the 400+ other S&amp;P 500 stocks as counterweight.\n\nThoughts?",
        "subreddit": "investing",
        "title": "With MSFT, AAPL AMZN, GOOGL and FB making up more than 1/5 of the S&amp;P500, what are practical ways to de-risk your portfolio from this imbalance?",
        "url": "https://www.reddit.com/r/investing/comments/ii8wsu/with_msft_aapl_amzn_googl_and_fb_making_up_more/",
        "created": 1598656651.0
    },
    {
        "author": "glaknight",
        "created_utc": 1598039645,
        "id": "ie3yr4",
        "num_comments": 605,
        "num_crossposts": 0,
        "selftext": " New York (CNN Business)Tesla is preparing to [split its stock](http://www.cnn.com/2020/08/11/cars/tesla-stock-split/index.html), making it more affordable for average investors. It may need to do another one pretty soon if its shares keep surging.Tesla ([TSLA](https://money.cnn.com/quote/quote.html?symb=TSLA&amp;source=story_quote_link)) has skyrocketed 50% since announcing the stock split on August 11. It now trades at nearly $2,100 a share.Once [the split](http://www.cnn.com/2020/08/18/investing/stock-splits-apple-tesla/index.html) goes into effect on August 31, current Tesla investors will get five shares for each one they own. That will [cut the price](http://www.cnn.com/2020/08/11/cars/tesla-stock-split/index.html) by a fifth, to almost $420 a share. The market value of Tesla, now hovering around $390 billion, will remain the same.But does Tesla deserve to trade at such a high valuation? While the [Elon Musk-led company](http://www.cnn.com/2020/08/18/success/elon-musk-tesla-ipo-vault-interview/index.html) is generating [consistent profits](http://www.cnn.com/2020/07/22/cars/tesla-earnings-q2/index.html), its sales are dwarfed by the major auto giants.Tesla is expected to generate nearly $30 billion in annual revenue this year. That’s nothing to sneeze at. But Fiat Chrysler ([FCAU](https://money.cnn.com/quote/quote.html?symb=FCAU&amp;source=story_quote_link)) is estimated to report $100 billion in sales for 2020. GM ([GM](https://money.cnn.com/quote/quote.html?symb=GM&amp;source=story_quote_link)) and Ford ([F](https://money.cnn.com/quote/quote.html?symb=F&amp;source=story_quote_link)) are each forecast to post annual revenue of more than $110 billion.Still, Tesla’s market value is now more than four times the combined market caps of Detroit’s Big 3.\n\nA majority of Wall Street analysts are betting against Tesla. Of the 33 that officially track the stock, only eight have a buy rating on Tesla while 15 have it rated a hold and 10 are recommending a sell on it.Only three of the Tesla analysts currently have a price target for it above $2,000. The consensus target is just under $1,300 — almost 40% below its current price.Tesla continues to be a [big target of short sellers](http://www.cnn.com/2020/01/30/investing/short-selling-squeeze/index.html), investors who borrow the stock and sell it with the hopes of eventually buying it back at a lower price.Of course, Tesla fans can correctly point out that analysts have been consistently wrong and that Wall Street will eventually have to raise its earnings forecasts and price targets on the stock.Tesla may also get a further boost if it is [finally added](http://www.cnn.com/2020/02/06/investing/tesla-sp-500/index.html) to the blue-chip [S&amp;P 500 index](https://money.cnn.com/data/markets/sandp/) — a move that could soon happen now that the company has posted a consistent run of profitable quarters.\n\nFull Article:  [http://pioret.com/tesla-has-soared-50-since-announcing-its-stock-split-last-week](http://pioret.com/tesla-has-soared-50-since-announcing-its-stock-split-last-week)",
        "subreddit": "investing",
        "title": "Tesla has soared 50% since announcing its stock split — last week",
        "url": "https://www.reddit.com/r/investing/comments/ie3yr4/tesla_has_soared_50_since_announcing_its_stock/",
        "created": 1598068445.0
    },
    {
        "author": "tdogger88",
        "created_utc": 1597713424,
        "id": "ibrc1j",
        "num_comments": 594,
        "num_crossposts": 0,
        "selftext": "In most of our generations we’ve never seen valuations like this before. \n\nTesla - A car company that shocks people when it makes a profit and has $13B in debt is valued at $350B (just lol.)\n\nApple - A hardware company that sells electronics valued at almost $2T (I actually don’t think Apple is that overvalued). \n\nZoom - A video chat app that’s used because of work from home valued at $80B while doing roughly $20m in quarterly net income. \n\nAMD - A graphics and chip designer that does a little over $100M in quarterly net income valued at $100B. \n\nShopify - An e-commerce platform that helps small business create an online presence. Still operating at a loss, valued at $120B.\n\nUber - A ride hailing company that has reported net income of -$7B the past year while running into all types of regulatory issues valued at $50B.\n\nThe list goes on and on, let’s have some fun with this one. Not saying they can’t go higher, but when they fall, it’s going to be fun to watch. \n\nBTW, I’m super long Apple, SOXX, and Baba. (Over 100k in Baba leaps)",
        "subreddit": "wallstreetbets",
        "title": "Let’s play a game, who’s the most overvalued at current price.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ibrc1j/lets_play_a_game_whos_the_most_overvalued_at/",
        "created": 1597742224.0
    },
    {
        "author": "fire_water76",
        "created_utc": 1598579888,
        "id": "ihyea8",
        "num_comments": 569,
        "num_crossposts": 0,
        "selftext": "I believe I did pretty well in the market this year. My networth increased ~65% since its lowest point in March, [~350k to 620k](https://imgur.com/a/3Vu6u2f). 20k from the car I bought in March. I rolled over a 401k and it messed up Mint's reporting, hence the spike from Jul -&gt; Aug. \n\nI beat the [SP500 by 40%](https://imgur.com/a/adeDokD) in my YOLO account, my FAANG account went from [180-&gt;300](https://imgur.com/a/kBmBp1O)\n\nI did this by following some basic investing principles, buying and holding for the most part, being patient, and only investing in areas which I have expertise in. \n\nI did not buy into the TSLA hype, nor do I play options, nor do I play crypto. \n\n#High level advice:\n=========================================\n\nhttps://www.simplysafedividends.com/intelligent-income/posts/37-top-10-pieces-of-investment-advice-from-warren-buffett\n\nI picked the 7 I agree with.\n\n1. Invest in what you know…and nothing more.\n2. Never compromise on business quality\n3. When you buy a stock, plan to hold it forever\n4. Diversification can be dangerous\n5. Most news is noise, not news (don't read articles about investing)\n8. The best moves are usually boring (buy and hold)\n10. Only listen to those you know and trust \n\nI firmly believe that anyone who follows those concepts, they will find success in investing.  \n\n#General mindset:\n================\n- Keep emotions out of the market\n- Don't bother timing the market. Don't get ruled by FOMO.\n- Understand that for some stocks, you can't really average cost down. You will have to stomach buying the stock at a higher entry point. My refusal to average up early on caused me to miss out on a lot of gains. \n- Understand the difference between trading, investing, and gambling. \n- Have an exit strategy (stop losses would have helped me a lot in March, I now learned from my expensive mistake)\n- Be greedy-- not TOO greedy. If a stock pops 10%, I will sell half to lock in profits. It's super common to see a lot of companies pop and the next day dip a bit due to sell off. Perfect time to grab more on the dip. This is obviously impossible to time, which is why I only sell half. \n\n#Application:\n==================================================================\nI was very specific in the types of companies I would choose to invest in within tech. I decided to follow my strengths. As a data engineer, I'm very intimate with cloud technologies, and I think I generally have pretty sharp business acumen and good strategic direction. \n\nAs a result, my day to day work had me using a ton of technologies in the cloud space. I've used Splunk, NewRelic, Twilio, AWS, GCP, Hortonworks/Cloudera, Oracle, Tableau, Datadog, Sendgrid (bought by Twilio), Dropbox/box, Slack, Salesforce, Marketo, Databricks, Snowflake, HP Vertica, just to name a few. I was familiar with CDN services like Fastly and Cloudflare because sometimes, I worked with the DevOps and IT guys. \n\nBased on industry hearsay, day to day work, eventually, I got a good \"feel\" of what technologies were widely adopted, easy to use, and had a good reputation in the industry. Similarly, I also got a feel for what tech were being considered 'dated' or not widely used (HP, Oracle, Cloudera, Dropbox, Box). \n\nI tend to shy away from companies that I don't understand. In the past, most times I've done that-- I got burned.  My biggest losers this year was betting on $NAT and $JMNA (10k total loss). After learning from those mistakes, I decided to only focus on investing in companies that either I or my peers have intimate first hand experience with using. Because of this rationale, the majority of stocks in my portfolio are products which I believe in, I thoroughly enjoy using, and I would recommend to my friends, family, and colleagues. \n\nPost COVID, due to the shift to remote work and increase in online shopping I decided to double down on tech. I already knew that eCommerce was the next big thing. I made very early investments into SHOP and Amazon in 2017 for that reason.\n\nMy hypothesis was that post-COVID, the shift on increased online activity, remote work, and eCommerce would mean that companies which build tools to support increased online activity should also increase. I decided to choose three sectors within tech to narrow down-- these were three sectors that I had a good understanding of, due to the nature of my work and personal habits. \n\n1. eCommerce + AdTech \n2. IT/DevOps (increased online activity means higher need for infra)\n3. FinTech (increased shopping activity means more transactions)\n\nThese are the points I consider before I consider jumping into a stock:\n\n1. Do I feel good about using the company? Do I believe in the company's vision?\n2. Where do I see this company in 5 years? 10 years? Do I see my potential children being around to use these companies?\n3. What does YoY, QoQ growth look like for this company? \n4. Is/Will this product be a core part of how businesses or people operate?\n5. Who are their customers and target demographic?\n6. (SaaS) Customer testimonials, white papers, case studies. If it's for a technology, I'm going to want to read a paper or use case.\n\nIn March, I took what I believe to be an \"educated gamble\". When the market crashed, I liquefied most of my non tech assets and reinvested them into tech. Some of the holdings I already had, some holdings were newly purchased.\n\nI have 50% of my networth in AMZN, MSFT, AAPL, GOOG, FB, NFLX, and the rest in individual securities/mutual funds. I have 3 shares of TSLA that I got in @1.5.\n\nHere are the non FAANGs I chose.\n\n1. $SQ. I had already been invested in SQ since 2016. I made several bad trades, holding when it first blew past 90 until I sold it at 70... bought in again last year at 60s, after noticing that more and more B&amp;M stores were getting rid of their clunky POS systems and replacing it with Square's physical readers. After COVID, I noticed a lot of pop up vendors, restaurants doing take out. A Square reader made transactions very easy to make post-COVID. \n\n2. $ATVI. Call of Duty and Candy Crush print money for them. I've been a Blizzard fanboy since I was a kid, so I have to keep this just out of principle.\n\n3. $SHOP. They turned a profit this year, and I think there is still a lot more room to grow. It's become somewhat of a household name. I've met quite a few people who mentioned that they have a Shopify site set up to do their side hustle. I've tried the product myself, and can definitely attest that it's pretty easy to get an online shop up and running within a day. I 5.5xed my return here. \n\n4. $BIGC. I bought into this shortly after IPO. I'm very excited to see an American Shopify. BigC focuses on enterprise customers right now, and Shopify independent merchants, so I don't see them directly competing. I'm self aware this is essentially a gamble. I got in at 90, sold at 140, and added more in 120s. I def got lucky here... it's not common for IPOs to pop so suddenly. I honestly wasn't expecting it to pop so soon.\n\n5. $OKTA. Best in class SSO tool. Amazing tool that keeps tracks of all of my sign-ons at work. \n\n6. $DDOG. Great monitoring tool. Widely adopted and good recommendations throughout the industry. Always had a nice looking booth at GoogleNext.\n\n7. $ZM. Zoom was the only video conf tool at work which I had a good time using. Adoption had blown up pre-COVID already in the tech world, and post-COVID, they somehow became a noun. \"Zoom parties\" and \"Zoom dates\" somehow became a thing interwoven into peoples' day to day lives.\n\n8. $TWLO. Twilio sells APIs which allow applications to send messages like text, voice, and video chat. For example, when DoorDash sends you a text at 1 AM reminding you that your bad decision has arrived, that text is powered by Twilio. In March, New York announced that they were going to use Twilio to send SMS notifs for COVID contact tracing. \n\n10. $NET/$FSTY. These two two seem like the ones best poised for growth in the CDN space. This is based off of industry exposure and chatting with people who work in DevOps.\n\n11. $DOCU. people aren't going to office to sign stuff, super easy to use, I like their product. \n\n12. $WMT. eComm, streaming, and a very substantial engineering investment makes me think they have room to grow. Also I really need to diversify. \n\n13. $COST. When is the last time you heard someone say \"Man I hate going to Costco and paying $1.50 for a hotdog and soda?\" Diversification. Also cheap hotdogs.\n\n14. $NVDA/AMD. GPUs are the present and the future. Not only are they used for video games, but Machine Learning now uses GPU instead of CPU to do compute (Tensorflow for example). Crypto is still a thing as well, and there will always been a constant need for GPUs.\n\nMutual funds/ETFs\n1. $FSCSX. MF which focuses on FinTech. \n\n2. $VTSAX Pretty much moves with the SP500. \n\n3. $WCLD. Holdings include Salesforce, Workday, Zuora, Atlassian, Okta, New Relic, Fastly... \n\nTitanvest:\nI was an early access user, and I was able to secure 0% fees for my accout. 36% gains so far. I like them, because their portfolio happens to include shares of tech giants that I either don't have individual stocks for or my stake is low (CRM, PPYL). It nicely complements my existing portfolio.\n\n#Some things I do that that are against the grain:\n\n- Not really diversified. 80% is in tech. They are in very different sectors of tech, but the truth is, when tech falls, all of these companies fall. I'm obviously long tech and I do not believe that tech will fall anytime soon. What about the dot com bubble? There wasn't a single dot com company that was integral in our lives. The internet was in its infancy then. Techonology is now such an interwoven part of our lives and I see companies like Apple, Amazon, Google to be sticking around for several generations.\n\n- I don't read investing articles. I think people who write articles about a stock all have ulterior motives-- to pump or to dump. Case in point-- Citron Research spent years writing articles telling people how SHOP was overvalued. Why did they do that? Because they were shorters at the time. I turned 5k into 27k, because I held on to most of my SHOP shares.\n\n- I don't take much value from balance sheets, other than net loss, income, YoY growth. Instead, I use my business acumen to try to pick up on info that isn't super apparent from Google. For example, one thing I always do is that I look at the career page to see how the business is growing. Increase on marketing/sales/implementation engineers is typically a solid sign that a company is preparing headcount to take new deals in the upcoming quarters. I look at the product road map, supported integrations, and customer base. \n\nOne example was how I applied the above principle was to WalMart. In 2018 I noticed that I was getting targeted by a lot of Data engineering job listing for WalMartLabs-- WarMart's tech division. The role was to build out a big data pipeline to support their eCommerce platform. WalMart's online store released in Q3 of 2019. Post COVID, I used their online store and it was a seamless experience. They even offer a 5% cash back card like Amazon. They reported strong Q4 sales last year, and they did very well post COVID. Why did I choose to invest in $WMT? Because I believe that Wal-Mart has room to grow for their online platform. \n\nLastly... remember that wealth isn't accrued over time. It takes years to build. The quickest way to increase your wealth is by investing in yourself-- your career and earning potential. The sooner my income increased, the quicker I had more capital to buy into stocks. \n\nAlso, if you've gotten this far, the point of my post isn't to say that you should invest into tech. The message I'm trying to get across is-- when picking companies, pick companies in fields or verticals you have good knowledge in. Heed Buffet's advice to only pick companies you believe in and understand. Play to your strengths, don't mindless toss money based on one person's posts on Reddit-- always do your own due diligence. Use DD as a guide and use personal research and experience to drive your decision.",
        "subreddit": "stocks",
        "title": "How I applied Buffet's strategies to my own portfolio, +70% networth, beat SP500 by 40%",
        "url": "https://www.reddit.com/r/stocks/comments/ihyea8/how_i_applied_buffets_strategies_to_my_own/",
        "created": 1598608688.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1598493253,
        "id": "ihc9q7",
        "num_comments": 540,
        "num_crossposts": 0,
        "selftext": "The world’s most valuable car company just hit another milestone.\n\nTesla ￼’s (ticker: TSLA) market capitalization on Wednesday topped $400 billion. About two months ago, it was celebrating $200 billion. It first hit $100 billion in January.\n\nTesla passed Johnson &amp; Johnson ￼ (JNJ) along the way on Wednesday, in terms of market cap. There are only seven companies in the S&amp;P 500 index worth more, including Visa ￼ (V) at $447 billon and Apple ￼ (AAPL) at $2.16 trillion.\n\nThere is a lot you could buy for $400 billion. Here are a few notable   comparisons to put that figure in context.\n\nIt’s more than the combined value of every team in the four major U.S. professional sports, according to Forbes estimates. It’s also more than the Forbes estimate for the combined net worth of Bill Gates, Mark Zuckerberg, and Tesla’s own CEO Elon Musk.\n\nIt’s nearly four times International Business Machines ￼’ (IBM) market cap.\n\nYou could buy 400 billion things at a dollar store—or just buy Dollar General ￼ (DG) and Dollar Tree ￼ (DLTR).\n\nIt’s also more than the individual gross domestic product of Israel, Ireland, and Hong Kong.\n\nWith $400 billion, you could also stockpile about 181 billion regular gallons of gas, based on AAA’s U.S. estimates. You could drive 5.79 trillion miles, if you averaged 32 miles per gallon. That would take you around the Earth 232.5 million times.\n\nIf you are into electric vehicles, $400 billion could get you 10.53 million of Tesla’s basic 2020 Model 3. Of course, such a sale would cause price targets to soar. And Tesla would need a few more factories to turn out that many vehicles. The company only delivered about 90,000 vehicles in the second quarter.\n\nSource: Barron's",
        "subreddit": "stocks",
        "title": "Tesla Is Now Worth $400 Billion",
        "url": "https://www.reddit.com/r/stocks/comments/ihc9q7/tesla_is_now_worth_400_billion/",
        "created": 1598522053.0
    },
    {
        "author": "Big-Weed",
        "created_utc": 1597725985,
        "id": "ibujf9",
        "num_comments": 540,
        "num_crossposts": 0,
        "selftext": "So my gpa got the cancers and it’s honestly been a bit sad the last few days but now the real question comes and that is “what’s next?” Well, he was quite the autistic retard and decided to dump my old college fund all into Apple way back in ‘03 because I enlisted instead. It’s now grown harder than a dick on prom night and I’m looking for a way to buy a new wife that doesn’t already have a boyfriend so what I need to know is should I move it around or keep it rolling all in AAPL like a retarded autist?",
        "subreddit": "wallstreetbets",
        "title": "Grandpa died and left me with 7000 shares of AAPL diversify or let it roll?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ibujf9/grandpa_died_and_left_me_with_7000_shares_of_aapl/",
        "created": 1597754785.0
    },
    {
        "author": "dweeegs",
        "created_utc": 1598161412,
        "id": "iexyez",
        "num_comments": 524,
        "num_crossposts": 0,
        "selftext": "Hello there\n\nI posted about [6 weeks ago](https://www.reddit.com/r/stocks/comments/hn9ydm/defense_stocks_what_the_heck_is_going_on/) about defense being undervalued and they’ve climbed 15-20% since then (besides HII which completely whiffed earnings) and I am now starting to see value in the oil sector(s). The June high and subsequent re-crash for oil industry coincided directly with the new covid case rate picking up. With covid cases declining and oil stocks generally trading in ranges for over a month now, I present my case for a break in those ranges\n\nThere are a couple of tailwinds that are happening right now for WTI:\n\n* New covid cases in the US have dropped substantially from their peak and are on a downtrend [according to JHU’s data](https://i.imgur.com/EShb2sU.jpg). Globally, it seems to be seesawing in a confined range\n* [China is buying a large amount of US crude by September])https://www.reuters.com/article/us-usa-trade-china-oil-exclusive/exclusive-china-ramps-up-u-s-oil-purchases-ahead-of-trade-deal-review-sources-idUSKCN25A2F4), potentially 37 million barrels [according to this](https://oilprice.com/Latest-Energy-News/World-News/China-Charters-Tankers-For-37-Million-Barrels-Of-US-Oil.html)\n* After flooding the US market with [Saudi oil](https://www.npr.org/2020/05/04/850026351/saudi-arabias-oil-tanker-flotilla-is-reaching-the-u-s-despite-some-objections#:~:text=Live%20Sessions-,Saudi%20Arabia's%20Oil%20Tanker%20Flotilla%20Is%20Reaching%20The%20U.S.%2C%20Despite,are%20headed%20to%20the%20U.S.), they have now cut exports to a [record low ](https://oilprice.com/Latest-Energy-News/World-News/Saudi-Arabias-Crude-Oil-Exports-Dip-To-Record-Low-In-June.html)\n* The dual storms in the Gulf have caused a lot of [shut-ins](https://www.reuters.com/article/us-usa-storms-energy/oil-firms-evacuate-staff-curb-offshore-production-ahead-of-twin-storms-idUSKBN25I0J3)\n* After stalling in July, air traffic is starting to [pick back up](https://www.tsa.gov/coronavirus/passenger-throughput) and routes are being added again, although still way way down\nWhich all support WTI prices in the coming weeks. Should be noted that rig counts have continued to lows, however last week was the first week in a long time that a few rigs came back online, which will add to the inventory. How much, I am not sure. You can see from [Baker Hughes’ rig count]( https://rigcount.bakerhughes.com/rig-count-overview) that we added 10 rigs, but are still down a net of 662 rigs from last year. Next we can take a look at the [EIA data](https://www.eia.gov/petroleum/supply/weekly/) for some more insight into what current inventories are like:\n\n* 512M barrels of crude, 15% above average. Peak was 540M barrels on June 19th\n* 244M barrels of gasoline, 7% above average. Peak was before covid due to build over the winter\n* 178M barrels of distillates, 24% above average. Peak was 180M barrels on July 31st\n* Refinery inputs at 14.5M barrels, low was 12.4M barrels on May 13th \n* Refinery rates at 81%. At the low on April 22nd it was at 67%, normally around 95%.\n* WTI is trading in the $42-43 range, with the low being negative due to the contract rollover situation back in the Spring\n\nThe last several EIA reports have been good in general – drawing down of products, with two weeks in a row of fantastic gasoline draw down. \n\nWhat’s my point here? The takeaway should be this: the worst is over. Now is the best chance for a while to get beaten up value stocks at a discount, as the industry recovers and conditions for the crash are resolving\n\nRight now cyclicals have been beaten down to Earth’s core as tech goes up and up. Cyclicals and value generally outperform in a market recovery and I expect a rotation at some point, strengthened by a combination of inventory drops making headlines, covid cases going down, and a general resumption of normal. Any stimulus would be big news for these beaten down stocks as well\n\nWorried about a Democratic administration? Unlike the defense stocks I had previously looked at, I think it’s a real issue for this industry. The Democratic platform calls out removing tax breaks for oil and gas companies while adding environmental regulations. It’s weird that big tech has been climbing – companies like Amazon, Apple, Facebook etc. that are known tax avoiders and privacy usurpers seem like prime candidates to have a ‘tax bill fear’ from the Dem’s closing of tax avoidance legislation and future lawsuits. I haven’t seen any hints of this in the market, so I am going to assume this is not considered a big deal by investors\n\nHowever, I still believe these low valuations are still too low, even with headwinds. Some of the majors have already been adjusting (Shell in particular) and refineries like Valero already have strong renewable fuels segments; Phillips 66 recently announced plans to build the [biggest renewable diesel refinery in the world](https://investor.phillips66.com/financial-information/news-releases/news-release-details/2020/Phillips-66-Plans-to-Transform-San-Francisco-Refinery-into-Worlds-Largest-Renewable-Fuels-Plant/default.aspx)\n\nWhat am I looking at in particular?\n\nRight now, refineries have the best value to me. PSX is **criminally** undervalued with a safe dividend. VLO is another that is set for strong performance. MPC has a strong position after its Speedway asset sale, but I would rank PSX&gt;VLO&gt;MPC at this point for value.\n\n* PSX target price: ~$82, sitting currently at ~$61\n* VLO target price: ~71-72, sitting currently at ~$52.50\n\nFrom a producer standpoint, CVX and COP are both fundamentally solid (I prefer COP at this point). RDS is the closest its been to it’s covid low and is one of the leading majors in transitioning off oil. It’s been beaten down since losing its dividend but I can only assume it will be back. I’m not a fan of XOM going forward, but right now it’s at the low of the range it’s been confined in and wouldn’t be a bad temporary pickup. FANG / EOG / PXD aren’t bad pickups either\n\nPS – stay away from OXY. It’s very clear they’re going to continue to issue shares until they’re through their debt and the pummeling is well deserved. It was popular for a while, not sure how it’s still viewed, just stay away\n\nTLDR; buy refineries and the producers worth buying that aren't drowning in debt or have terrible assets\n\nDisclosure: I have a large position in PSX calls",
        "subreddit": "stocks",
        "title": "Oil stocks - the time is now",
        "url": "https://www.reddit.com/r/stocks/comments/iexyez/oil_stocks_the_time_is_now/",
        "created": 1598190212.0
    },
    {
        "author": "Mitesite",
        "created_utc": 1597849860,
        "id": "icpgzu",
        "num_comments": 412,
        "num_crossposts": 0,
        "selftext": "Apple has become the first US company to reach a $2 trillion evaluation.\n\nhttps://www.cnn.com/2020/08/19/tech/apple-stock-two-trillion-market-value/index.html",
        "subreddit": "stocks",
        "title": "Apple is now worth $2 trillion",
        "url": "https://www.reddit.com/r/stocks/comments/icpgzu/apple_is_now_worth_2_trillion/",
        "created": 1597878660.0
    },
    {
        "author": "bigyerb",
        "created_utc": 1597068485,
        "id": "i75gw9",
        "num_comments": 408,
        "num_crossposts": 0,
        "selftext": "My portfolio is down 68% all time so I just put every last dollar into $460c 8/14.  It’s been a long road back up utilizing smart plays.  A long, hard road.  Instead, today, I decide to become a gambler.",
        "subreddit": "wallstreetbets",
        "title": "Just yolo’d every last dollar into AAPL calls AMA",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i75gw9/just_yolod_every_last_dollar_into_aapl_calls_ama/",
        "created": 1597097285.0
    },
    {
        "author": "DimitrisMeli",
        "created_utc": 1598833427,
        "id": "ijnwc8",
        "num_comments": 400,
        "num_crossposts": 0,
        "selftext": "**Bull reasons:**\n\n* They just got a whole lot cheaper and the average pleb will be all over that shit.\n* People FOMO hard from the fuss.\n* People have bugs in their algos and they haven't adjusted them for split. When the algos see a super low price they insta buy the fuck out of it.\n* Big dogs double down because they have priced in stuff you can't begin to imagine. Oh, and everything is priced in.\n* No one dares to short Musk and Cook, because they will get cucked. Again.\n* FDs just got cheaper and every retard can afford them. Time to gamble with lunch money.\n* Battery day for TSLA and ARM based computers from AAPL coming soon.\n* If people wanted to lock in gains, they would have done so on Friday.\n* StOnKs OnLy gO uP.\n\n&amp;#x200B;\n\n**Bear reasons:**\n\n* The average pleb thinks they've gotten enough tendies from Papa Musk and Tim Apple. They sell it all to lock in gains. Also, that's the 3rd eviction notice and they finally have to pay rent. They cash out.\n* Fractional shares already exist for those who wanted cheap AAPL and TSLA. There is no need for the college kids to buy due to lower price.\n* Broke af people with just 1 share see an opportunity for liquidity. Before the split, on the one hand, they wanted to lock in gains and on the other hand they didn't want to sell their only share of their biggest winner. Now they can sell part of their position.\n* People are expecting them to drop, because they are overextended and we are in a dot com bubble. They sell in order to \"buy the dip\".\n* Retard algos auto trigger from unusual activity and sell hard.\n* Big dogs are expecting the dip and sell at open driving everything down even further.\n* Stocks that split historically underperform initially.\n* All the paper hands see a small initial dip for any of the above reasons and they sell off.\n\n&amp;#x200B;\n\n**What will actually happen:**\n\n&gt;!I don't fucking know. Do I look like a billionaire to you? This is a casino. Flip a fucking coin and then reverse it too.!&lt;",
        "subreddit": "wallstreetbets",
        "title": "This is what will ACTUALLY happen to TSLA and AAPL on Monday open",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ijnwc8/this_is_what_will_actually_happen_to_tsla_and/",
        "created": 1598862227.0
    },
    {
        "author": "AMcMahon1",
        "created_utc": 1598897713,
        "id": "ik3aw5",
        "num_comments": 390,
        "num_crossposts": 0,
        "selftext": "Behind only Apple, Amazon, Microsoft, Google, Facebook, Alibaba, and Berkshire Hathaway.\n\nTheir q2 revenue was 6 billion and net income was 100 million. Most euphoric stock of all time? Possibly.\n\nWhen will it come crashing down? Who knows but it's not sustainable at it's current valuation that's for sure.\n\nNext up is Old Man Buffet and Berkshire",
        "subreddit": "wallstreetbets",
        "title": "Tesla surpasses Visa to become the 8th most valuable publicly traded company in the world",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ik3aw5/tesla_surpasses_visa_to_become_the_8th_most/",
        "created": 1598926513.0
    },
    {
        "author": "NobertTR88",
        "created_utc": 1598462914,
        "id": "ih37te",
        "num_comments": 388,
        "num_crossposts": 0,
        "selftext": "Chart shows it all.. just look at the candles. The 2000 tech Crash will be nothing in comparison. Once the bubble starts to burst the run for the exit will be epic. Its unreal and it will be retail investors and traders who will get burnt the worst. \n\nThis will scar a generation of traders and investors to never invest in stocks again once this bubble pops. Tesla, Netflix hell even Apple and Amazon are way overvalued. \n\nIn before brrr and stocks only go up. We can see the inflation of the printing clearly in the charts. But one thing is certain. In no time in the past has printing money solved any major event. Just look at the hyperinflation in Venezuela or past Germany.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/c7x4ecedtdj51.jpg?width=1560&amp;format=pjpg&amp;auto=webp&amp;s=98861d0f0d9103cdb8ba7685baf4f534b2e7dc8f",
        "subreddit": "wallstreetbets",
        "title": "Tech Bubble²",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ih37te/tech_bubble²/",
        "created": 1598491714.0
    },
    {
        "author": "fawkesmulder",
        "created_utc": 1596893054,
        "id": "i5z28l",
        "num_comments": 379,
        "num_crossposts": 0,
        "selftext": "Just got to thinking about all the money robinhood is skimming off the top, and the audacity of their name in light of this.\n\nOther firms report payment for order flow, at least on shares. TDA or Charles Schwab, for example are getting an average of about 1/10 of a cent per share... Robinhood doesn’t post their data. \n\nThis is why Citadel and other huge trading firms pay more for robinhood orders, as there are no parameters publicly listed anywhere and they “get away” with taking more off the top. For shares, it can be a few cents.\n\n“If a customer buys 100 shares of Apple for $200 each—a $20,000 purchase—Robinhood could get up to $5.20 for routing that order to electronic-trading giant Citadel Securities LLC, according to calculations based on a recent Securities and Exchange Commission filing.\n\nSchwab would be paid around 9 cents for sending the same order to Citadel, while TD Ameritrade would get 16 cents on average, according to these companies’ SEC filings.\n\nThat’s a nearly 60-to-1 difference between what Robinhood and Schwab are paid. The gap isn’t always so wide, because of differences in the formulas used to determine the size of the payments. Still, Robinhood often makes much more for the same orders, the filings suggest.”\n\nhttps://www.wsj.com/articles/why-free-trading-on-robinhood-isnt-really-free-1541772001\n\nOptions data isn’t available for TDA, Schwab, etc., but given the difference in share payment for order flow from Robinhood to electronic trading giant Citadel, would it surprise anyone they were also paying more for options? \n\nRobinhood likes to set quite a large bid-ask spread as the default for options with an easy button and number for a retail investor to click that is in the middle, further gouging inexperienced traders.\n\nBut besides that little trick, what about the prices that they show on the screen as the bid/ask.\n\nHow do the option prices compare in real time, bid / ask vs. other brokerages.\n\nI want to do more research.",
        "subreddit": "wallstreetbets",
        "title": "Robinhood is literally stealing from the poor to give to the rich",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i5z28l/robinhood_is_literally_stealing_from_the_poor_to/",
        "created": 1596921854.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1598386268,
        "id": "igk17f",
        "num_comments": 371,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2020/08/25/iphone-sales-steady-while-global-smartphone-sales-tank-20percent-in-q2.html\n\nGlobal smartphone sales dropped 20.4% in the second quarter of 2020, according to data released Tuesday from Gartner. \n\nApple posted a .4% decline in year-over-year smartphone sales, according to Gartner.\n\nIn comparison, Samsung experienced the largest decline in sales in the quarter, 27.1% less year-over-year, according to the company.",
        "subreddit": "stocks",
        "title": "iPhone sales steady while global smartphone sales tank 20% in Q2",
        "url": "https://www.reddit.com/r/stocks/comments/igk17f/iphone_sales_steady_while_global_smartphone_sales/",
        "created": 1598415068.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1597997216,
        "id": "idsqai",
        "num_comments": 331,
        "num_crossposts": 0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme and/or [post your arguments against fundamentals here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nMost fundamentals are updated every 3 months due to the fact that corporations release earnings reports every quarter, so traders are always speculating at what those earnings will say, and investors may change the size of their holdings based on those reports.  Expect a lot of volatility around earnings, but it usually doesn't matter if you're holding long term, but keep in mind the importance of earnings reports because a trend of declining earnings or a decline in some other fundamental will drive the stock down over the long term as well.\n\nSee the following word cloud and click through for the wiki:\n\n[Market Cap - Shares Outstanding - Volume - Dividend - EPS - P/E Ratio - EPS Q/Q - PEG - Sales Q/Q - Return on Assets (ROA) - Return on Equity (ROE) - BETA - SMA - quarterly earnings](https://www.reddit.com/r/stocks/wiki/fundamentals-themed-post)\n\nIf you have a basic question, for example \"what is EBITDA,\" then google \"investopedia EBITDA\" and click the Investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nUseful links:\n\n* [Investopedia Tuturiol](https://www.investopedia.com/university/all/fundamental-analysis/) on fundamental analysis including [Discounted Cash Flow](https://www.investopedia.com/university/dcf/) analysis; see [definition here](https://www.investopedia.com/terms/d/dcf.asp)\n* [FINVIZ](https://finviz.com/quote.ashx?t=aapl) for fundamental data, charts, and aggregated news\n* [Earnings Whisper](https://www.earningswhispers.com/stocks/aapl) for earnings details\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion &amp; Fundamentals Friday Aug 21, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/idsqai/rstocks_daily_discussion_fundamentals_friday_aug/",
        "created": 1598026016.0
    },
    {
        "author": "Tkuenzler",
        "created_utc": 1598757487,
        "id": "ij5uwl",
        "num_comments": 323,
        "num_crossposts": 0,
        "selftext": "If apple hits $150 by October 1st ill buy one of you fucking retards a brand new I phone 12 regular model. \n\n Why you ask? Cause I have more money on this then you make in a year.  03/21 $530 calls (pre split).\n\nLets go.",
        "subreddit": "wallstreetbets",
        "title": "AAPL $150 BY 10/01",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ij5uwl/aapl_150_by_1001/",
        "created": 1598786287.0
    },
    {
        "author": "Evil____",
        "created_utc": 1597799799,
        "id": "ice312",
        "num_comments": 321,
        "num_crossposts": 0,
        "selftext": "I've dedicated a large percentage of my portfolio to renewable energy companies and have obtained some knowledge on the sector and specific companies in doing so. I've noticed a trend of people inquiring about these companies so I hope that this post can provide some information. \n\n---------------------------\n\nI'll provide a brief bullish thesis and some information about my investments in renewables. These are in order of weight in my portfolio. \n\n------------------------------\n\nTesla (TSLA)\n\nMost of us know what Tesla is about. They are the global leader in electric vehicles and will eventually come out with autonomous driving but I'll focus on their energy business. They sell solar panels with the lowest cost/watt of U.S. manufacturers, but this isn't the exciting part of their energy business. They are a leader in battery storage, which is an integral part of a renewable future. Energy storage systems store energy produced from solar panels and when the sun isn't shining, energy is consumed from the batteries instead. Also their autobidder software, which is out in trial in Massachusetts and Australia I believe, eventually will turn energy into a market place for Tesla customers. Read more about autobidder here: https://www.tesla.com/support/autobidder \n\nMy bull case for Tesla (specifically the energy side of the business) is that they will continue to innovate with their low cost panels, and be a leader in battery storage, plus leverage their autobidder software to bring added value to residential customers.\n\n--------------------------------------\n\nVestas Wind Systems (VWDRY) \n\nhttps://www.vestas.com/~/media/vestas/investor/investor%20pdf/financial%20reports/2020/q2/2020%20q2_pres.pdf\n\nVestas is the leading manufacturer and installer of wind turbines. They have a global footprint and are expected to grow in line with the growth of the wind industry as a whole. A major growth engine in their business is going to be their expanding service and maintenance business, which has very high margins. My bull case for Vestas is that they are a unique pure play wind turbine company with years of experience in the growing industry. \n\n--------------------------------\n\nFirst Solar (FSLR)\n\nFirst Solar is an American based solar module manufacturing and solar project operating company. Most of their business comes from corporate and grid level solar projects. Notably, they have Next Era Energy, Microsoft and Apple as customers. The real bullish case behind First Solar is around their differentiated Cadmium Telluride solar modules. Compared to the standard Crystalline silicon technology, First Solar's modules last longer and produce energy at higher efficiencies in hotter climates. \n\nMy bull case for First Solar is around their differentiated technology, strong balance sheet, and position as an American company, which typically warrants a higher P/E ratio than foreign countries. \n\n----------------------------------\n\nJinko Solar (JKS) \n\nhttps://ir.jinkosolar.com/static-files/5a6d9266-d288-4ece-a0ea-f8e49ff60119\n\nJinko Solar is a leader is a Chinese based solar panel manufacturer. They produce low cost modules and also manage solar projects. Their business model is similar to First Solar's, however they trade at a cheaper valuation, due to being a Chinese company. You can read more about their technology on their investor relations page, but my main bull case for this company is around their position in South East Asia as a leading manufacturer, as this is undoubtably the biggest potential market for solar energy. \n\n--------------------------\n\nCanadian Solar (CSIQ) \n\nhttp://investors.canadiansolar.com/events\n\nCanadian Solar is also a leader in the module manufacturing &amp; project development business. They have a similar business model with Jinko and First Solar. Canadian Solar owns equity stakes in several of their solar projects, which gives them a source of recurring revenue. They also have a large footprint in American grid/commercial systems and are a market leader in North America. \nThey trade at an absurdly low 5 P/E ratio despite significant growth expectations in the coming years. \n\nMy bull case for CSIQ is around their ability to dominate the current market and potential to capitalize off of further market growth and consolidation towards the biggest solar companies. Also their current valuation is very intriguing. \n\n--------------------------\n\nSolarEdge (SEDG) \n\nhttps://investors.solaredge.com/\n\nSolarEdge is the global leader in the Inverter space, with a 60% U.S. market share. For those who don't know, Inverter's turn the D.C. electrical current from the sun into an A.C. current, which is used by households. The inverter business is also much higher margin than the module (panel) business, due to there being fewer players in the industry. They are also expanding into energy storage and electric vehicle manufacturing. \n\nMy bull case around SolarEdge is around their market dominance in the Solar Inverter business, which will grow exponentially in the coming years plus future expansion in storage &amp; EVs. They have a very strong management team as well. \n\n--------------------------\n\nTPI composites (TPIC)\n\nhttps://ir.tpicomposites.com/download/companies/tpicomposites/Supplements/TPI%20Earnings%20Deck%202Q20.pdf\n\nTPI composites manufacturers wind blades and sells them to wind turbine companies. They have long term contracts with the top 5 non Chinese wind turbine companies (Vestas, GE, Siemens, Nordex &amp; Enercon.) 63% of total wind blade manufacturing is outsourced to companies like TPI and they are the market leader in this space with about 20% market share globally. The business currently has low margins, but they target a 12% EBITDA margin for the future, and they trade at a measly 0.74 P/S ratio currently. They are also expanding into EV composite manufacturing and have a contract with a certain EV company that I can't mention on this subreddit apparently (DM if you want more info) to manufacture vehicle parts for them.\n\n-------------------\n\nEnphase Energy (ENPH) \n\nhttps://investor.enphase.com/static-files/81902e59-7d61-4693-aa86-8d54e63975b9\n\nEnphase is the sole producer of Microinverters, which are smaller inverters that go on individual panels and provide a safer, more efficient, but more expensive solution than the standard string inverters. Microinverters are used in smaller solar systems, mostly residential. They also have an energy storage business that is just starting to scale. Enphase and SolarEdge are competitors in both of these spaces, and are expected to be major players in the future. Like SolarEdge, Enphases' inverter business is high margin and expects rapid future growth, as the residential solar market grows. \n\nMy bullish case around Enphase is around their Microinverter technology, potential for expansion into storage and unique Ensamble home energy management system (read about Ensamble on the Investor relations page). \n\n-----------------------\n\nBrookfield Renewables (BEPC)\n\nBrookfield Renewables owns and operates renewable energy systems and projects. They sell energy produced from such systems to utility companies and have a recurring revenue stream. They also pay a 3.73% dividend yield. Their investments are split relatively evenly between Hydroelectric, solar and wind. \n\nMy bullish thesis around BEPC is the consistent cash flow positive revenue stream and relative safety in the business model. Also, they provide be with exposure to hydroelectric energy. \n\n--------------------------------\n\nLet me know if you have any comments, hold, or plan to buy any of these companies!",
        "subreddit": "stocks",
        "title": "A guide for those looking to invest in Renewable Energy. (My Renewable portfolio with DD)",
        "url": "https://www.reddit.com/r/stocks/comments/ice312/a_guide_for_those_looking_to_invest_in_renewable/",
        "created": 1597828599.0
    },
    {
        "author": "KindheartednessNo884",
        "created_utc": 1597946057,
        "id": "idf7cb",
        "num_comments": 314,
        "num_crossposts": 0,
        "selftext": "At time of writing, GOOG market cap is $1.06T and other tech giants are much higher (AAPL is $2.01T, AMZN is $1.65T, MSFT is $1.61T). That gap feels large to me. Also, FB is valued at $760B with much lower revenue and decelerating growth, so its gap vs GOOG seems small. \n\nIs GOOG a good buy? Are these other companies just overvalued? Curious what you all think.  \nHere's my thinking:\n\n* GOOG has rock-solid fundamentals - excellent gross margins, has maintained \\~15%+ YoY revenue growth even at their scale, and search is a steady business with many entrypoints across the Google ecosystem\n* GOOG has bets across so many forward-looking industries that I think they will be able to diversify over time and don't have real risk of not continuing to innovate. There's of course the risk of anti-trust and privacy regulations, but that's been true for years now (although things do appear to be ratcheting up).\n* It seems their stock hasn't mooned during covid because a meaningful share of search volume (and subsequently search revenue) comes from brick-and-mortar businesses (as opposed to someone like FB, whose ads biz is more of an ecommerce/direct-to-consumer play), which puts a drag on their revenue. This was the main reason for their relatively weak Q2 earnings a couple weeks back.  \n\nDisclaimer: I own shares of every company mentioned here. Thanks for your input - I really enjoy this subreddit and have learned a lot from reading other posts.",
        "subreddit": "investing",
        "title": "Why is GOOG worth so much less than AAPL, AMZN, MSFT?",
        "url": "https://www.reddit.com/r/investing/comments/idf7cb/why_is_goog_worth_so_much_less_than_aapl_amzn_msft/",
        "created": 1597974857.0
    },
    {
        "author": "DankMemelord25",
        "created_utc": 1596593618,
        "id": "i3wuso",
        "num_comments": 298,
        "num_crossposts": 0,
        "selftext": "Yes I know what you're thinking Autist, as you sit on your gaming chair sipping your choccy milk. \"I've seen all these 🐻 posts before and stonks kept going up, printer goes BRRRRRR\"\n\nFundamentals haven't mattered for months, and except for some sharp pullbacks, NQ and SPY have all been on an absolute tear being instabid on every dip.\n\nThat's all about the change.\n\nTldr - bond market/ PM pricing in no deal on stimulus.\n- Bifurcation of NQ and SPY reached major tipping points.\n- DXY likely to bounce back strongly on risk off sentiment and foreign central bank action.\n- macro long term positioning for Inflation playing out across asset class correlations ( RUSSELL and value stocks starting to gain traction )\n\n1.\nPriced In has become a retarded meme at this point but what does it actually mean? It means basically that the market, chiefly big 💰 / institutions are expecting a future outcome ( or probability of one) and have allocated money appropriately. Historically Fixed Income due to its relative size has been a fairly reliable indicator. Previous crashes this year such as Feb/March crash and the mini NQ/SPY crash in June and July were both foreshadowed by major/ high Vol shifts downwards in 10 year bond prices .\n\nCurrently 10 year are plumbing new lows at the bottom end of 0.50 percent ( discounting the March flash crash ). This coupled with the meteoric rise in GLD and SLV last night IS NOT A GOOD SIGN. The sharp changes occured directly after stimulus news. \n\nWhat this means is that Institutions are signalling a chance the package will not be passed on time or in its entirety . \n\nBUT BUT VIX IS DOWN AND EQUITIES ARE UPPIES!\nyes little autismo, they are but that doesn't mean what you think it does. it's a poorly kept secret that this market is being kept afloat by hedge funds , institutional buying and retail fomo. I don't have the crayons or time to explain it to you but just look at news releases, support level buying and virus/ trade talks pumps. institutional players left the market in February , now it's just algos and retail. Vix being low doesn't necessarily mean what you think it does either. To oversimplify VIX goes up when more people buy puts. This is typically done hedge against market drops. \nBig players don't need to hedge if they SOLD all/ most of their equity holdings and moved it into Bonds/ Gold / Foreign equity. Hedge funds are also notorious for shorting VIX as part of the 'Fed Put \" trade . The fact that FI/PM are up while VIX is down makes me more certain of a drop not less as it means Big boys are trying to pass as many bags as they can to retail without spooking them.\n\n2. There's been a lot of articles on this already so I'll keep it short, you all know how to use Google. SPY since March lows has been split in two like a sociopathic Solomon. There is the big 5 tech and everything else. Currently Big 5 is sitting at 25 percent of all market cap with huge returns over the last few months. This coupled with the performance differential of the other 495 has surpassed levels not seen since the dot com boom. THIS IS NOT SIGN OF A HEALTHY BULL MARKET. Major Bifurcation is the second best signifier of a 🐻 after the technical 20 percent drop level ( which doesn't really mean much) . 🍏 Has now become the largest company in the world surpassing Saudi Aramco. THIS TECH BOOM IS NOT SUSTAINABLE. Most of the apple gains have been from a one of WFH structural shift and Fiscal stimulus ( that now accounts for 25 percent of all disposable income ). If the stimulus bill doesn't pass, Apple is fucked. Just look at the AAPL gains from the last week, do you think this is sustainable?\n\nThe common retort on this sub is, \" we all know it's a bubble but it will pop in few months, I'm getting my TENDIES while they're hot! \"\n\nThis sentiment has been thrown around for months all through April to July. Well what if months later is now? What better catalyst for a bubble pop than a Stimulus not going through as planned? \n\n3. There's been a lot of posts about DXY dying and a lot of it is half true. Currencies are a hard thing to predict but I do want to point out two very key factors that are bullish for DXY. \n3a- The entire world, especially emerging markets rely on Dollar inflows from exports to fund imports for key goods, especially commodities (oil etc). Global trade fell off a cliff in March and has barely recovered so where are countries getting dollars? By buying bonds . This was the reason behind the DXY spike to over 100 in March and the reason why the FX central bank swap program was instituted by JPOW. So unless you see global trade rebounding strongly in the very near term ( pigs will fly ) bonds will continue to be bid extremely strongly at auction, supporting DXY. \n\n3b) DXY as has been pointed out is primarily dropping due to Euro strength ( which makes up about 65 percent of the Index). When DXY is compared to the Bloomberg trade weighted dollar index you'll see it hasn't dropped far at all and this makes sense (see 3a above). The Euro bullish trend, along with AUD/USD,GBP/USD and JPY/USD is unlikely to continue much further. Foreign central banks and governments for that matter will not allow the dollar to crater. We've already seen rumblings from the EU and JPY on this front as exports are already in a tenuous position. The last thing foreign companies need is a strong currency to hamper export sales. So I wouldn't bet against the FED, but I sure as shit wouldn't be getting against the ECB.\n\nSummary: I don't see this stimulus playing out on time or in full. Big money is pricing in either a delay or being scaled back substantially to meet Republican demands. I won't go into the specifics of the political theatre because quite frankly it doesn't matter. PM/ BONDS are are all the signalling device you need.\n\nHow I see this playing out: The stimulus bill will pass on few weeks after a substantial Rug pull, similar to the 2008 TARP fiasco. I would strongly recommend either holding cash or going long DXY while this plays out. Either buy the dip on GLD/SLV with leaps or go long TLT at like 180c.\n\nPositions : short MNQ 3 units at 10530 and 1 ES at 3220. Yeah got in a little early, wasn't expecting the tech earnings blowout but have the margin to hold. \n\nLooking at GLD leaps for 06/21 300c when we get a pullback ( due to margin calls ).",
        "subreddit": "wallstreetbets",
        "title": "🚨🚨🚨 Incoming rug pull and how to play it for maximum tendies.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i3wuso/incoming_rug_pull_and_how_to_play_it_for_maximum/",
        "created": 1596622418.0
    },
    {
        "author": "PeanutButter91",
        "created_utc": 1596821945,
        "id": "i5i91o",
        "num_comments": 277,
        "num_crossposts": 0,
        "selftext": "Feeling really dumb and depressed this morning as I was margin called for 380k. Hoping for some advice. Here’s the story:\n\n1) Sold 10x AAPL 375c 21Aug20 \n2) Bought 10x AAPL 380c 21Aug20\nThe credit spread was about $3,000 at the time (mid-July), and max loss therefore should have been $2,000. \n\nI believe the short position was ITM, and long was ATM at the time, although this is irrelevant. \n\nThis morning I received an email saying my short position was exercised (fuck me, I didn’t realize ex-div for AAPL was today). I’m assuming they exercised it yesterday to qualify for the upcoming dividend. My broker (Questrade in Canada) did nothing with my long position, so I’ve gone from a max loss of $2,000 to a much steeper one. I don’t know what to do.. \n\nQuestrade rep convinced me to exercise my long position and sell the shares upon receipt. However, the share price has dropped $10 already today, so my loss has likely gone from $2,000 to $12,000 and could get worse if this drop continues. I submitted the request to exercise the calls and I’m waiting for the shares. \n\nI entered this trade assuming my max loss would be $2,000. I thought questrade would require direction for the long position, cause I don’t have 380k to cover in my account. \n\nTLDR; entered what I thought was a covered credit position, to later be naked and forced into to a $380,000 long position.",
        "subreddit": "options",
        "title": "Help: 380k margin call. Looking for guidance.",
        "url": "https://www.reddit.com/r/options/comments/i5i91o/help_380k_margin_call_looking_for_guidance/",
        "created": 1596850745.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1598123550,
        "id": "ieogjy",
        "num_comments": 273,
        "num_crossposts": 0,
        "selftext": "https://markets.businessinsider.com/news/stocks/tesla-surpasses-walmart-market-value-most-valued-sp500-us-companies-2020-8-1029524035\n\njnj, v, brk.b, fb, googl, msft, amzn, aapl.",
        "subreddit": "stocks",
        "title": "Tesla just surpassed Walmart in market value. Here are the 8 remaining S&amp;P 500 companies worth more than Tesla.",
        "url": "https://www.reddit.com/r/stocks/comments/ieogjy/tesla_just_surpassed_walmart_in_market_value_here/",
        "created": 1598152350.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1598602017,
        "id": "ii34ui",
        "num_comments": 270,
        "num_crossposts": 0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme and/or [post your arguments against fundamentals here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nMost fundamentals are updated every 3 months due to the fact that corporations release earnings reports every quarter, so traders are always speculating at what those earnings will say, and investors may change the size of their holdings based on those reports.  Expect a lot of volatility around earnings, but it usually doesn't matter if you're holding long term, but keep in mind the importance of earnings reports because a trend of declining earnings or a decline in some other fundamental will drive the stock down over the long term as well.\n\nSee the following word cloud and click through for the wiki:\n\n[Market Cap - Shares Outstanding - Volume - Dividend - EPS - P/E Ratio - EPS Q/Q - PEG - Sales Q/Q - Return on Assets (ROA) - Return on Equity (ROE) - BETA - SMA - quarterly earnings](https://www.reddit.com/r/stocks/wiki/fundamentals-themed-post)\n\nIf you have a basic question, for example \"what is EBITDA,\" then google \"investopedia EBITDA\" and click the Investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nUseful links:\n\n* [Investopedia Tuturiol](https://www.investopedia.com/university/all/fundamental-analysis/) on fundamental analysis including [Discounted Cash Flow](https://www.investopedia.com/university/dcf/) analysis; see [definition here](https://www.investopedia.com/terms/d/dcf.asp)\n* [FINVIZ](https://finviz.com/quote.ashx?t=aapl) for fundamental data, charts, and aggregated news\n* [Earnings Whisper](https://www.earningswhispers.com/stocks/aapl) for earnings details\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion &amp; Fundamentals Friday Aug 28, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/ii34ui/rstocks_daily_discussion_fundamentals_friday_aug/",
        "created": 1598630817.0
    },
    {
        "author": "Gothlander",
        "created_utc": 1597351196,
        "id": "i97thu",
        "num_comments": 270,
        "num_crossposts": 0,
        "selftext": " \n\n# 'Fortnite' maker Epic Games sues Apple over App Store policies\n\nThe lawsuit comes after Apple removed 'Fortnite' from its App Store. \n\n&amp;#x200B;\n\n *Fortnite* developer Epic Games is suing Apple after the company [removed the game](https://www.engadget.com/apple-removes-fortnite-190920925.html) from its App Store. In [a lawsuit](https://cdn2.unrealengine.com/apple-complaint-734589783.pdf), Epic accuses the iPhone maker of anti-competitive and monopolistic behavior. “Epic brings this suit to end Apple’s unfair and anti-competitive actions that Apple undertakes to unlawfully maintain its monopoly in two distinct, multibillion dollar markets,” the company writes in a court filing, pointing to Apple’s control over the App Store and payments processing for in-app purchases.",
        "subreddit": "stocks",
        "title": "Epic games sues Apple. Will we see AAPL come down in price tomorrow?",
        "url": "https://www.reddit.com/r/stocks/comments/i97thu/epic_games_sues_apple_will_we_see_aapl_come_down/",
        "created": 1597379996.0
    },
    {
        "author": "Gaston44",
        "created_utc": 1598731822,
        "id": "iiz9w6",
        "num_comments": 267,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Fidelity is glitched right now if you have AAPL or TSLA shares. It says that I’m a millionaire",
        "url": "https://i.imgur.com/WZDqd36.jpg",
        "created": 1598760622.0
    },
    {
        "author": "Berlout",
        "created_utc": 1598831345,
        "id": "ijndek",
        "num_comments": 258,
        "num_crossposts": 0,
        "selftext": "Near the end of Forest Gump it shows how rich he became by having shares in Apple. He's a millionaire. He felt rich, and if you've held TSLA for a few years you probably feel rich too.\n\nHere's the thing, that was in 1994. So in 1994 Apple was already at a price where people are making bank. Since then it's gone up 500 times. \n\nSo in 2046 when TSLA is worth 500 times what it is today (206 trillion) don't be kicking yourself you sold out to buy shares in a mattress company or some other shit.",
        "subreddit": "wallstreetbets",
        "title": "Forest Gump is a Billionaire and you can be too by holding TSLA for the next 26 years",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ijndek/forest_gump_is_a_billionaire_and_you_can_be_too/",
        "created": 1598860145.0
    },
    {
        "author": "Dylan-Jupp",
        "created_utc": 1597179953,
        "id": "i804fz",
        "num_comments": 257,
        "num_crossposts": 0,
        "selftext": "Huge breaking news for Tesla! Plus Apple coming up as well? I haven’t been around for some big splits like this so I’m curious what people think about this.",
        "subreddit": "stocks",
        "title": "Tesla 5:1 stock split!",
        "url": "https://www.reddit.com/r/stocks/comments/i804fz/tesla_51_stock_split/",
        "created": 1597208753.0
    },
    {
        "author": "aerrreaa",
        "created_utc": 1596382769,
        "id": "i2e1qb",
        "num_comments": 256,
        "num_crossposts": 0,
        "selftext": "Look my retard brothers who already have a gambling addiction from the $700 you made in a week on your $1,000 account,\n\nI see people crying every day when they've missed out on these triple baggers, like on AMD or Apple. People who are making 300% gains on their accounts from weeklies are the same people you see one month later with a blown up account and no tendies crying \"my peepee real small. Don't do what I do! Wife real mad. Drank piss for nothing!\" They have that massive spike on their Robinhood chart from 4k to 40k and then over the next two weeks down to $600.\n\nYou can make double baggers over and over but once you hit a 90% loss or more nothing's going to matter. If you're the type of retarded autist who will not takes gains at 50% on weeklies and let it ride to 300%, you're the type of retarded autist who won't cut your losses at 20% and let it ride to 90% and ask \"I'm down 90% on Amazon calls, should I hold?\"\n\nI'm talking about options expiring in less than a few weeks. Not someone with options expiring in 6 months whose balls deep in a mattress company named after a fuckin color whose clearly done their DD. Those you can let run 300%. But that's not you, you can't afford those options, you don't do DD and you buy weeklies.\n\nDon't fall for the FOMO. Consistent gains and cutting losses short is what will make you continuously profitable - not a few lucky rolls that make you feel smart even though you think an iron condor has to do with the Soviet Union.\n\nSince I'll get bitched at if I don't post these:\n\nSpy 8/7 330c\n\nAmazon 8/21 3200c",
        "subreddit": "wallstreetbets",
        "title": "Don't follow the FOMO - why those 300% weekly gains aren't healthy",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i2e1qb/dont_follow_the_fomo_why_those_300_weekly_gains/",
        "created": 1596411569.0
    },
    {
        "author": "MicronDRAM",
        "created_utc": 1598305900,
        "id": "ifysf7",
        "num_comments": 249,
        "num_crossposts": 0,
        "selftext": "Major changes are coming to the Dow Jones Industrial Average.\n\nS&amp;P Dow Jones Indices said Monday that three new companies will be joining the 30-stock benchmark index.\n\nSalesforce.com will replace Exxon Mobil, Amgen will replace Pfizer and Honeywell International will replace Raytheon Technologies.\n\nThe changes will go into effect before the market opens on Monday, August 31.\n\n“The index changes were prompted by DJIA constituent Apple Inc.’s decision to split its stock 4:1, which will reduce the index’s weight in the Global Industry Classification Standard (GICS) Information Technology sector,” a statement read. “The announced changes help offset that reduction. They also help diversify the index by removing overlap between companies of similar scope and adding new types of businesses that better reflect the American economy.”\n\nAs a result of Apple’s 4-for-1 stock split, its ranking is set to drop from the top all the way down to 16th, and its weighting in the average will fall from 11% to just 3%, according to S&amp;P Dow Jones Indices.\n\nThe 124-year-old blue-chip average is price-weighted, meaning stocks with higher share prices are given greater weight in the gauge",
        "subreddit": "investing",
        "title": "Salesforce, Honeywell, and Amgen added to the DJIA. They are replacing Exxon Mobil, Pfizer, and Raytheon.",
        "url": "https://www.reddit.com/r/investing/comments/ifysf7/salesforce_honeywell_and_amgen_added_to_the_djia/",
        "created": 1598334700.0
    },
    {
        "author": "mbash22",
        "created_utc": 1596734419,
        "id": "i4vxi6",
        "num_comments": 248,
        "num_crossposts": 0,
        "selftext": "I only own ETFs right now as I feel like I don't know stocks enough to invest in one stock from another but what is the take on AAPL long term. Is it still a good buy?",
        "subreddit": "StockMarket",
        "title": "$AAPL - miss the boat or is it not too late",
        "url": "https://www.reddit.com/r/StockMarket/comments/i4vxi6/aapl_miss_the_boat_or_is_it_not_too_late/",
        "created": 1596763219.0
    },
    {
        "author": "-tangentially",
        "created_utc": 1597587404,
        "id": "iat20w",
        "num_comments": 242,
        "num_crossposts": 0,
        "selftext": "You’ve probably seen a rising trend of bullish posts about Nvidia recently, whether it’s about recent acquisitions being included in revenue, its management, or the semiconductor industry in general.\n\nYesterday, Evening Standard reported that $NVDA has locked in a takeover of Arm Ltd. from SoftBank for a reported 40 billion.\n\nThe reason this is important is that Arm owns instructions-set architectures (ISAs) for the chips within nearly every smartphone, along with a handful of other products. Usually, this isn’t an issue, since SoftBank would sell the rights to produce these chips to Apple, Qualcomm, and others for a fee. \n\n$NVDA, unlike SoftBank, is an actual semiconductor company. They could potentially limit access to their ISAs so that $NVDA can become the sole producer of those chips. Or, due to SoftBank being in the sinosphere and $NVDA being American, potential tensions could arise from the recent economic sanctions.\n\nEither way, considering that the deal is essentially locked in, $NVDA is flying straight to tendie town. Arm is a powerful player in the semiconductor industry, and its acquisition by $NVDA demonstrates that the company is making big moves to become more prevalent. $NVDA could theoretically lockdown a subsector of the semiconductor market by restricting access to chips under Arm’s ISA. And if the Don requests $NVDA restrict Chinese access to the ISAs, you can bet that it will get a fucking BOATLOAD of government subsidies.\n\nTL;DR $NVDA 520c 9/18",
        "subreddit": "wallstreetbets",
        "title": "$NVDA is silently becoming the next tech powerhouse.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iat20w/nvda_is_silently_becoming_the_next_tech_powerhouse/",
        "created": 1597616204.0
    },
    {
        "author": "WhichEdge",
        "created_utc": 1598855229,
        "id": "ijsyge",
        "num_comments": 242,
        "num_crossposts": 0,
        "selftext": "Be beyond careful guys.\n\nThe company use to float around 200-275 from 2014-2017, then it went to around 300-375 from 2017-end of 2019.  Right before the first short squeeze rally there was a bit of a dip and then to the moon at around 920.  COVID and the wear off it fell around 60+% in less than a month and then took off again from that 350 marker.\n\nWe all know technical analysis is bunk asf in some ways but it can show us some important basics even in crazy markets and you can see pretty obvious were Tesla started to correct to go back down just for Elon to do some black magic fuckery.\n\nI know everyone is betting on the influx of retail investors due to the new price after split and I agree there will be some and I also agree the S&amp;P, Battery, China news is good but we have to remember after going down almost 20% in a few weeks before the Split was announced it went up 60 some percent.\n\nI won't mention the insane p/e ratios, or any other factors here guys just be careful.  I only included this basic warning and basic info because I can't believe the amount of people getting into Tesla that I know that don't know these basic ass figures.\n\nAt least with Apple when it does its normal 20-30% correct every few years you won't have a organization pumped to the tits to the point that milk is squirting and WSB autists think they found the new god of fertility and harvest \"gains\" lol.\n\nWishing all you guys safety and wicked margins and if the sell off happens that none of you get caught wearing your gf/wives panties bent over ready to accept the bears bulbous engorged ....",
        "subreddit": "wallstreetbets",
        "title": "A note to those still playing Tesla...",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ijsyge/a_note_to_those_still_playing_tesla/",
        "created": 1598884029.0
    },
    {
        "author": "FreshTatarSauce",
        "created_utc": 1598155424,
        "id": "iewqhw",
        "num_comments": 237,
        "num_crossposts": 0,
        "selftext": "\\#Introduction\n\n&amp;#x200B;\n\nHi all, it's your friendly neighborhood Tatar Sauce here with the first episode of my Options series. My hope is to help some of you autistic fucks to not blow up your accounts and learn to manage risk better. Each week I will be touching on a new topic that will hopefully help some of you understand the intricacies of options trading, with each lesson building upon previous lessons. Some topics will include different options strategies, risk/reward balance, and the psychology of trading. If you want me to touch on a particular topic, leave a comment below. If you want to call me a retard, leave a comment below.\n\nI do not sell a program or anything like that, I'm just a dude that loves trading and managing an account.\n\n&amp;#x200B;\n\nSo lets get into it. \n\n&amp;#x200B;\n\nImagine you just read some retarded DD on WSB. You're convinced that OP has shown you the way to Tendie Town, and all thats left for you to do is hop on your PRPL mattress, punch in a few coordinates, go to bed and wake up swimming in a sea of hunny mussy. Like most retards on this sub, you probably have a loose understanding of the Greeks and don't know the difference between a horizontal spread and that gesture your wife does when you invite your buddy C-Note over for poker. So what are your options? Naked calls baby!\n\nWell, I'm here to tell you that while naked calls do have a time and a place, it shouldn't be your go to. If you were one of the autistic fucks posting loss porn because you bought a bunch of naked calls on PRPL, you need this more than anyone. So buckle up, grab a whisky, and let ME lead you to Tendie Town (no mattress required).\n\n&amp;#x200B;\n\n\\#**So what do I do now?**\n\n&amp;#x200B;\n\nVertical spreads baby. Next week we will dive deep into why vertical spreads offer a better risk/reward profile, but first we need to understand the Greeks and what they mean for your option contract. So lets dig in.  \n\n\n\\#**Delta**\n\n&amp;#x200B;\n\n**Contrary to popular belief, delta does NOT mean the percent chance your option will expire ITM.** Delta is simply the amount of money your contract will move in accordance to every dollar the underling moves. In other words, if you bought your call for $2.00 with a .3 delta. and the price moves up $1, it is now worth $2.30. Conversely, if it moves down $1, it is worth $1.70. This is a simplistic way of looking at it, as other things can affect delta such as fundamentals and volatility, but that is what it means.  \n\n\nDelta is affected most by how close the strike price is to the current price of the underling. Farther OTM options have less delta, farther ITM options have more, and ATM is typically around .5. Delta is not heavily affected by DTE. Knowing delta is important in measuring risk/reward because it will tell you how much the value the option will move for or against you as the underling moves.  \n\n\n**#Gamma**\n\n&amp;#x200B;\n\n**If delta is the speed in which the price moves, gamma is the acceleration.** What gamma measures is how much delta changes after each subsequent dollar change. Here is an example to illustrate:  \n\n\n\\&gt; Buy option XYZ 50c with .3 delta and .01 gamma for $2.00\n\n\\&gt; Price moves up $1\n\n\\&gt; Call is worth $2.30, new delta value is now .31\n\n(Now lets say gamma was .15)\n\n\\&gt; Buy option XYZ 50c with .3 delta and .15 gamma for $2.00\n\n\\&gt; Price moves up another $1\n\n\\&gt; Call is worth $2.30, new delta is .45\n\n&amp;#x200B;\n\nMy example is again a simplistic way of looking at it, but don't miss the point- gamma will accelerate the price change in your option as the underling changes and is a important factor in determining risk/reward.\n\n&amp;#x200B;\n\nUnlike delta, gamma is heavily affected by DTE, and gamma increases by a lot as you get closer to expiry, and is much smaller the farther out you buy. It is not affected heavily by how ITM or OTM the option is (although there is a slight increase the closer you get to ATM).  \n\n\nThink of FD's as purchasing gamma, where a large move in your favor will yield exponential returns.  \n\n\n&amp;#x200B;\n\n**#Theta**\n\n&amp;#x200B;\n\n**Think of theta as the amount of money you have to spend per day to hold the contract, or the amount you get paid per day to sell one.** I like to think of theta as \"how much money I will lose per day if the underling trades sideways.\"\n\n&amp;#x200B;\n\nTheta is increased as you get closer to your expiry date. At about 30 DTE, theta begins to accelerate  faster. ATM strikes tend to have the most theta, where ITM strikes have enough intrinsic value that they arent affected as much and OTM strikes go for less premium so there is less value to eat.  \n\n\nI don't think you autistic fucks are dumb enough to need an example for this one. Most of you hold your contracts too long and know what theta burn is. NEXT!  \n\n\n**#Vega**\n\n&amp;#x200B;\n\n**Vega is the amount the underling moves in response to a 1% change in IV.** This is the reason behind the term \"IV crush.\" Vega is greater the farther out you purchase your option, and greater the closer it is to being ATM (while OTM options have a slightly higher vega than ITM, it's not by much).\n\n&amp;#x200B;\n\nI cannot stress this enough, **look at the vega and IV rank of the options you are buying if you want to play earnings!**  \n\n&amp;#x200B;\n\nIV rank takes the past 52 weeks of IV for the ticker and tells you what percentile its current IV is at.\n\n&amp;#x200B;\n\nHigh IV rank and vega is inherently more risky REGARDLESS of what the underling does! I'm tired of seeing you retards weeble wobble your way through posts asking why the fuck your option went down when the price moved in your favor. It's because you're retarded and don't know what you're doing.  \n\n\nHowever, vega can play in your favor if volatility increases. This can be a shrewd play if you catch a ticker a couple weeks before earning.  \n\n\n**#What about Rho?**\n\n&amp;#x200B;\n\nRho stands for red-headed orphan. Nobody cares about rho.\n\n&amp;#x200B;\n\n**#The different type of plays you can make using the Greeks**\n\n&amp;#x200B;\n\n**Believe it or not, there are more ways to play with options then \"hurr durr stonks go up.\"** Here are a few things you can do to leverage yourself and use each Greek to your advantage:  \n\n\nDelta: Purchasing delta is similar exposure to purchasing 100 shares of the underling, but for far less money and risk. It can be a great way to leverage yourself if you are looking to purchase the shares anyway and are okay paying the extra premium for the increased gains. IMO, this is a boomer play that someone makes if they don't want to tie up the capital short term but want the option to exercise long term. For example, AAPL 400c 1/15/21 goes for \\~$111. That is about 1/5 less money then purchasing 100 shares today and AAPL only has to go up like 13 bucks to break even. \n\n&amp;#x200B;\n\nGamma: Purchasing gamma is the thought behind an FD. Low risk, high reward, low chance of profit. The WSB special. I will try to get a day trade in every now and then if I see an opportunity, where I put a tight stop loss on and let it ride. **If you do this, look at the theta and set your stop loss at least that distance away from your purchase price so you don't get stopped out due to theta burn.**  \n\n\nTheta: You don't buy theta. You sell theta. Join r/thetagang for more info.  \n\n\nVega:  If you want to play the volatility of a stock, consider buying or selling vega. Some people use straddles a few weeks before earnings and capitalize on the increased volatility to increase their odds of success when they might not be sure how the market will respond to the earnings. Keep in mind that you will have to put up more premium for farther out DTE options, but if volatility goes up you would be surprised how much it will make your options move.\n\n&amp;#x200B;\n\nSo thats that. Learning the Greeks and learning what you're buying will help keep you from making a lot of rookie mistakes. Next week, I'm going to talk about spreads and why they offer a better risk/reward profile then naked options.  \n\n\n**TLDR:** Stop gambling and start trading.  \n\n\n**Positions:** DKNG 33/34/38/39 Iron Condor 8/28 - PENN 54p 8/28 - VXX 25/26c 8/28 Debit - AAPL 500/520c 9/4 Debit - RKT 27c 9/18 - RKT 26/30c 9/18 Debit - XRX 22c 9/18 - MU 42.5/47.5c 9/18 Debit - AAPL 560/580c 9/18 Debit - SPY 330/320p 9/25 Debit",
        "subreddit": "wallstreetbets",
        "title": "Options 101 Episode 1: An Introduction To The Series- All About Greeks!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iewqhw/options_101_episode_1_an_introduction_to_the/",
        "created": 1598184224.0
    },
    {
        "author": "iBifteki",
        "created_utc": 1598528639,
        "id": "ihji0a",
        "num_comments": 218,
        "num_crossposts": 0,
        "selftext": "Currently flirting with $510 pre-market, 2 days before the split.\n\nI am personally in loooong. What most retards can't seem to grasp in their peanut sized brains is that this company is not just hyped like fucking $TSLA.\n\nIt's so liquid, profitable, has an amazing business model, average customer lifetime value, and is also perfectly positioned in a post-pandemic world to grow even more.\n\nIf it dips I'm doubling down, I love you Tim.",
        "subreddit": "wallstreetbets",
        "title": "$AAPL ready for lift-off 🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ihji0a/aapl_ready_for_liftoff/",
        "created": 1598557439.0
    },
    {
        "author": "bumblebear3012",
        "created_utc": 1598112671,
        "id": "iel67c",
        "num_comments": 204,
        "num_crossposts": 0,
        "selftext": "Is Microsoft the best stock of all-time? Back in the 90s, it used to be  known as the millionaire stock with how many Microsoft investors and  employees saw their wealth rise on the back of the company’s fortunes. The shares have split 9 times. And the company is currently the second most valuable in the world. If you invested $1,000 in the Microsoft IPO  in 1986, today it’d be worth $2,130,200 – that’s a total return of  212,920%, or 25% annualized returns *every year for the past 34 years*. By comparison, $1,000 invested in the Apple IPO would be worth $1,262,380 today. \n\nMicrosoft’s  dominance in PC software was so absolute by the late 1990s that the US  Government opened antitrust proceedings in 2001 and tried to break up  the company. Yet only a decade later, Microsoft had largely been  surpassed by Apple and Google. No longer did tech executives and  business schools point to IBM as the poster child for corporate  stagnation and loss of commanding market share. It was now Microsoft. \n\n7  years ago, Microsoft was such an afterthought that the now-famous FAANG  moniker conspicuously excludes the Redmond giant despite Microsoft  outperforming both Google and Facebook in the time since (and until  Apple’s near-30% rise the past month, Apple as well). So how did we get  here? \n\nThe [journey](https://blackjacketco.com/f/featured-flashback-how-microsoft-rose-and-fell-then-rose-again) – summarized below – revisits the mania surrounding the launch of Windows 95, an  investment that saved Apple from bankruptcy, a series of failed  acquisitions and product launches, and the rebirth of Microsoft under  current CEO Satya Nadella. \n\n **BASIC beginnings to PC Powerhouse (1980s to 2001)** \n\n* In 1980, IBM – the world’s largest computer manufacturer at the time –  approached Microsoft with an offer to license an operating system for  their soon-to-be-released IBM PC. When Microsoft received the contract,  they hadn’t yet built the operating system. They actually had to  purchase a Seattle-based company called QDOS to help build the original  MS-DOS system that Microsoft eventually licensed to IBM.\n* As part of the deal, Microsoft insisted that MS-DOS be non-exclusive to  IBM. IBM thought the future of the PC was hardware. Not anticipating  companies like Compaq would be able to legally reverse-engineer their  PC, Big Blue agreed to the terms. And it was the ability of Microsoft to  bundle MS-DOS with the various competing PCs that transformed the  company into the go-to operating system provider for nearly every PC on  the market. By the close of the decade, Microsoft’s stock had already  risen over 500% since its IPO. \n* MS-DOS was only a text-based system though, and Microsoft soon began to  work on a fully graphical interface, including desktop navigation and  icons, as part of a new operating system that would come to be known as  Windows. Windows completely changed the game for the PC, making it much  more user friendly and accessible for everyday consumers. By 1995,  Windows was so synonymous with the PC that customers lined up around the  block at midnight to try and get their hands on the Windows 95 release.  The Empire State Building was even lit up in Microsoft colors to mark  the occasion. \n* In 1997,  Windows 95 and the Microsoft family of operating systems held a  commanding 86.3% PC market share. In contrast to Microsoft, Apple was on  the verge of bankruptcy that year. Following an emergency investment of  $150mn from Microsoft, Bill Gates appeared live-on screen at an Apple  event with Steven Jobs to announce the agreement. He was promptly  booed. \n\n**Complacency, Stagnation, and Decline (2001-2014)**\n\n* While it’s hard to point to a single factor that caused Microsoft to  lose its way, the company became obsessed with propping up Windows as it  was the company’s major cash cow. New products were only deemed viable  if they augmented Windows or were backward-compatible. Ultimately, this  narrow focus on Windows left Microsoft over-exposed to the PC market at a  time when new trends were starting to emerge in computing and digital  services. \n* On December 29,  1999, Microsoft hit a split-adjusted all-time high of nearly $120 per  share. A little over two weeks later, Bill Gates stepped down as CEO and  Steven Ballmer ascended to lead the company. Under Ballmer, Microsoft  employees repeatedly identified promising technologies, like e-readers  and mobile software, only to see those projects pushed aside because  they didn't revolve around Windows. Microsoft had an e-reader prototype  as early as 1998, developed a mobile operating system called Windows CE,  and worked on a smartphone-type device all the way back in 2000.  Despite a multi-year head start in these areas, Microsoft never found  success. \n* Apple released the  first iPod in 2001, but it took until 2006 for Microsoft to release the  rival Zune. And in a sign of how far ahead Apple now was at that point,  only two months later Steve Jobs revealed an integrated music player and  internet-capable phone called the iPhone. The Zune was a complete  disaster, and in 2009, Apple had a 71% share of the MP3 player market. \n* Microsoft also completely missed the mark on search. In 2004, an  upstart Google had been poaching talented developers – as well as some  senior executives – from Microsoft for a couple years. In response,  Ballmer ordered the company to start prioritizing search. Although  Microsoft had several previous iterations of a search platform, the  company didn’t launch Bing until May 2009. Over the next 3 years Bing  lost $6bn, and a failed acquisition of advertising company aQuantive in  an attempt to jump-start search led to a $6.2bn write-down and the  company’s first-ever quarterly loss in 2012. \n* After the introduction of the iPhone, Ballmer famously said: “No chance  that the iPhone is going to get any significant market share.” Yet as  PC sales plateaued then declined and the mobile market was quickly  becoming the future, Microsoft’s inability to develop a mobile strategy  or a competing product became the embodiment of the company’s failure to  perceive market trends and remain relevant beyond the PC. Although  Ballmer tried to get Microsoft into the game by purchasing Nokia’s  mobile phone division in 2013, the company never got above 3.6% market  share. And in 2015, Microsoft wrote off the whole acquisition for  $7.5bn.  \n\n**Nadella and the Rise of Azure (2014-Present)**\n\n* One of Nadella’s first and most important moves after taking the helm  was to finally recognize that Windows could no longer drive the future  of Microsoft. Instead, he made it a corporate priority to go all-in on  the cloud at the exact time when enterprise IT spend was starting to  show a real demand for cloud computing capabilities. \n* He also greatly changed the culture. Under Gates and Ballmer, Microsoft  was the epitome of anti-competitive. Rather than work with other  companies in the PC and software businesses, they used Microsoft’s  dominant position in both operating system and web browsing to squeeze  rivals or eliminate them altogether. Nadella forced Microsoft to open,  to seek out partnerships, and to even prioritize its iOS or Android  mobile software offerings to the detriment of the now defunct Windows  phone. \n* Today, Linux is about  as widely used on Azure as Windows is. And this corporate strategy has  led companies to seek out Microsoft’s cloud offerings as Amazon  increasingly expands into more and more industries to disrupt. Microsoft  also repackaged its enterprise and productivity tools into  subscription-based products rather than costly one-time downloads or  annual license fees. \n* The new  Microsoft strategy has empowered developers and engineers to pursue  innovation in the exact opposite way that occurred under Ballmer. And  the company has developed a more customer-centric approach to developing  software that has resulted in a suite of bundled enterprise resource  products, such as Dynamics 365, that have made the entire Office 365  SaaS offering that much more compelling for large corporations. \n* The most crucial driver in the Microsoft turnaround has been the  hyper-growth of the company’s Iaas and PaaS platform Azure. As much  credit as Azure receives now, back in 2015 and 2016, Amazon AWS was  largely considered the undisputed king of the cloud. Articles would  frequently cite how AWS was bigger than Microsoft, IBM, Oracle, and  Google combined. Following years of 75-100% growth rates, however, Azure  is now firmly in peer status alongside AWS. This is no better evidenced  than by Microsoft’s $10bn contract win over Amazon for the DoD JEDI  contract last year. \n* Although  Azure growth is slowing, as of July 2020 AWS has 31% market share versus  20% for Azure – an amazing turnaround. And despite the disproportionate  attention given to the AWS/Azure as the “cloud”, Microsoft’s place as  the leader of enterprise SaaS means that the company actually generates  more quarterly revenues ($14.3bn) from the cloud relative to Amazon  ($10.8bn). \n\nWhen Nadella first took over, Microsoft’s market cap sat around $300bn. Today, it’s $1.6tn. \n\n*You can find me on Twitter* [@BlackjacketCo](https://twitter.com/BlackjacketCo) *where I write about emerging technologies and long-term market trends. Thanks for reading!*",
        "subreddit": "stocks",
        "title": "Microsoft: The Story behind the Rise and Fall then Rise",
        "url": "https://www.reddit.com/r/stocks/comments/iel67c/microsoft_the_story_behind_the_rise_and_fall_then/",
        "created": 1598141471.0
    },
    {
        "author": "MasterCookSwag",
        "created_utc": 1597318798,
        "id": "i8yclu",
        "num_comments": 202,
        "num_crossposts": 0,
        "selftext": "https://www.bloomberg.com/news/articles/2020-08-13/apple-readies-apple-one-subscription-bundles-to-boost-services?utm_content=business&amp;utm_campaign=socialflow-organic&amp;cmpid=socialflow-facebook-business&amp;utm_medium=social&amp;utm_source=facebook\n\n&gt;\t\nApple Inc. is readying a series of bundles that will let customers subscribe to several of the company’s digital services at a lower monthly price, according to people with knowledge of the effort.\n\n&gt;The bundles, dubbed “Apple One” inside the Cupertino, California-based technology giant, are planned to launch as early as October alongside the next iPhone line, the people said. The bundles are designed to encourage customers to subscribe to more Apple services, which will generate more recurring revenue.\n\n&gt;There will be different tiers, according to the people, who asked not to be identified discussing private plans. A basic package will include Apple Music and Apple TV+, while a more expensive variation will have those two services and the Apple Arcade gaming service. The next tier will add Apple News+, followed by a pricier bundle with extra iCloud storage for files and photos.",
        "subreddit": "investing",
        "title": "Apple Readies ‘Apple One’ Subscription Bundles to Boost Services",
        "url": "https://www.reddit.com/r/investing/comments/i8yclu/apple_readies_apple_one_subscription_bundles_to/",
        "created": 1597347598.0
    },
    {
        "author": "off-topic_guy",
        "created_utc": 1597955339,
        "id": "idi7db",
        "num_comments": 195,
        "num_crossposts": 0,
        "selftext": "It only takes ten 100% investments to get from $1000 to $1,000,000\n\nI see a lot of people posting calls on here. Calls are the types of posts that do well on this site. WSB is all about %1000 trades, and a %100 trade likely isn't gonna get much attention. Consistent 100% trades will however, get you rich. A poll from a while back showed that a lot of the users on here having been trading for less than 6 months, and likely don't know much about spreads. I'm also pretty new to this. \n\n\nA 2000c 9/11 costs $14,000. Can't afford a Tesla call? A 2000/2100 9/11 spread costs $4000 and can make you $6000. \n\n\nTake AAPL, what are the odds that apple goes up $5 on any given month? I mean it's not guaranteed of course, but it's pretty fucking likely.\n\nIt currently trades for 469. A 470/475 spread for September 4th costs $205 right now. Plug this spread into optionsprofitcalculator.com, and you'll see that if AAPL is 475 or higher at the end of the day on September 4th, you'll make a 144% profit.\n\n$205 is accessible to just about anyone, and you can always buy more spreads if you can afford to. I get that there is a stock split, and apple will likely go up by more than just $5 by September 4th, but you can do this $5 spread over and over for a ~likely~ 144% gain everytime.\n\nA $475 call for Sept 4 by itself costs about $1200. You could buy 6 spreads with the same amount. %144 of 1200 is $1728. In order to make that same amount of money with a call, AAPL would have to go up by at least $15. The beauty of the spread is that you're only betting AAPL will go up by $5. \n\nAs long as you pick a stock with relatively consistent small growth you can make a killing with lots of trades betting on small swings.\n\n\nTLDR: debit call spreads make more money than you think. Buy AAPL 470c 9/4, sell AAPL 480c 9/4. 144% return (almost) guaranteed. Rinse and repeat just $5 otm. Can double your money every 3 weeks.",
        "subreddit": "wallstreetbets",
        "title": "Spread the Love",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/idi7db/spread_the_love/",
        "created": 1597984139.0
    },
    {
        "author": "WannabeStonks69",
        "created_utc": 1598407184,
        "id": "igq217",
        "num_comments": 189,
        "num_crossposts": 0,
        "selftext": "Ok, so you know how Apple has been mooning on news of the iPhone 12, and ARM MacBooks, which has totally screwed over INTC and made TSM and other suppliers to AAPL moon?\n\n(Here's the background info in case you missed the news [https://www.youtube.com/watch?v=LS52JigV1CY](https://www.youtube.com/watch?v=LS52JigV1CY))\n\nApple was actually approached by Softbank to buy ARM but they couldn't due to ARM licensing stuff out to competitors as well, and Apple obviously has a very private philosophy too so that wouldn't work. But, they will continue to use chipsets based on ARM's architecture for the future macbooks/iphones as well ([https://wccftech.com/apple-shows-disinterest-in-buying-arm-from-softbank/](https://wccftech.com/apple-shows-disinterest-in-buying-arm-from-softbank/)). But if you just follow the money, and try to find out who actually will OWN ARM, the offer has come from none other than Nvidia, and the deal to buy ARM is all but confirmed. (seeck ingalpha.com/article/4370499-chippening-part-2-nvidia-reaches-for-outstretched-arm). And I'm sure that most of you are aware of how AAPL is trying to expand its reach into countries like India for the first time offering first-party stores and an online store, etc. This will only increase their sales numbers, and Apple will only get more bullet proof from hereon. The real story here, is in NVDA.\n\nWhen they do end up buying ARM, the merger will either be seen as A.) a value destroying buy that wasn't worth it or B.) A merger of epic proportions that inserts Nvidia into the mobile and CPU market \"Apple recently indicated it would change their use of Intel chips in Mac computers to custom made ARM-based chips. This is likely due to the desire to include a touch screen and also due to the general efficiency of the design as well as ARM's licensing of its IP to Apple. This could be the start of a major transition for chip usage among desktop computers. Moreover, this technology appears to be competitive for use in data-centers markets.\n\nNVIDIA is not currently a major competitor in the smartphone and tablet business, so acquiring ARM would expand it into new realms where ARM happens to dominate. NVIDIA did previously attempt to compete in this business, but its Tegra chips never got much market share.\"\n\nMost of you already know how durable Nvidia is, but for those of you that don't I'll leave you with these too: Nvidia's R&amp;D expense/gross profit is surprisingly low due to multiple income streams, and although it is increasing (as expected) we can expect gross profits to massively increase too with the world's largest company as its customer. Their Cash per share has grown insanely :\n\nCash Per Share ratio\n\n📷\n\nhttps://preview.redd.it/p3wz4otn79j51.png?width=753&amp;format=png&amp;auto=webp&amp;s=501e51a371f0d4ab402a8500a03e14b6e31f86d3\n\nAnd they have low long term debt that has barely increased, but their assets have remarkably increased, which means a low lt debt/asset ratio, just showing you how much of a powerhouse NVDA is.\n\nLT debt/total assets\n\n📷\n\nhttps://preview.redd.it/0hg0zqmo79j51.png?width=643&amp;format=png&amp;auto=webp&amp;s=b2862927faff7933cf9600ae20f76455de0a47ee\n\nNot only that, but along with decreasing/flatlining long term debt, they have a negative cash conversion cycle, which greatly reduces opex. Financially, this is only the beginning of their buildup. Aside from just solid financials for such a revolutionary company, they have revolutionary products. Their cloud services and acquisition of Mellanox will only expand their bases. Nvidia has a vision, and it may be very far-out and hard to accomplish or it may be the most genius thing I've ever seen. I'm not sure how long this'll take to work itself out, but I wouldn't fear buying March 2021 740 calls.",
        "subreddit": "wallstreetbets",
        "title": "NVDA 1000 SOON",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/igq217/nvda_1000_soon/",
        "created": 1598435984.0
    },
    {
        "author": "vadimyuryev",
        "created_utc": 1598693143,
        "id": "iiplpg",
        "num_comments": 188,
        "num_crossposts": 0,
        "selftext": "I’ve been making YouTube tech reviews and videos on Apple products for the past 4 years. Currently making videos for the Max Tech YouTube channel. \n\nThis is going to be the most important positive change for Apple ever since I started. You literally have no idea. \n\n— The iPhone 12 is getting released with the A14 chip that will be so much more powerful than the Qualcomm chip in android phones that they won’t be able to catch up for years. (The new 865 plus is hardly faster than last year’s overpriced 865) \n\n— this will be achieved by using TSMC’s brand new 5nm technology which is gonna be more powerful and more power efficient than people are expecting. \n\n— TSMC is already working on their 3nm tech that will be going into 2022 iPhones, iPads and Macs. \n\n— they are gonna implement 5G across their iPhone lineup without raising the prices crazy high like other brands like Samsung are forced to do right now. \n\n— leaks have shown that the iPhone 12 pro will come with the widely requested 120Hz display and insane camera recording features (4K at 240fps) \n\n— their Apple silicon chip Macs are gonna be so good and so powerful using TSMC’s 5nm tech that people’s minds will be blown. The new features and battery life are gonna be game changers. \n\n— the transition period to ARM-based chips will be much smoother than people are expecting. \n\n— these Macs will likely also have models with support for 5G cellular. \n\n— their new iPads are gonna start getting redesigned with a modern design for the first time in years. While the android tablets aren’t getting much better. Huge demand upswing. \n\n— the Apple Watch is gonna support more sensors and features than ever before, and they’re gonna release a brand new budget model for the first time. \n\n— Apple is gonna release their brand new services bundles which are gonna be very popular, and we all know that services are where the money is at. \n\n— Apple is gonna release a new Apple TV which will begin to get marketed as a gaming console. They’ll release a new gaming controller at the same time that will work across all of their Apple devices including the iPhone. \n\n— Apple will release a HomePod mini to better compete with the Amazon echo and push their Apple Music sales. \n\n— Apple is gonna begin to switch most of their devices to Mini-LED displays on their devices which will be almost as good as OLED without all of the drawbacks. \n\n— The stock split is gonna allow a bunch of new investors to get in after they realize all of this is happening. \n\nThose are just a few of the reasons why Apple has even more room to grow within the next year. -Vadim from the Max Tech channel on YouTube. \n\nPositions: wait for correction and dip after stock split. Go long on AAPL if you can afford January calls. \nAlso: $TSM 100c 1/15/21",
        "subreddit": "wallstreetbets",
        "title": "Why Apple has much more room to grow within the next year. $AAPL",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iiplpg/why_apple_has_much_more_room_to_grow_within_the/",
        "created": 1598721943.0
    },
    {
        "author": "T_Dizzle_My_Nizzle",
        "created_utc": 1597895922,
        "id": "id38up",
        "num_comments": 183,
        "num_crossposts": 0,
        "selftext": "If I buy a shit ton of calls on AAPL and buy a shit ton of iPads, the stock price will skyrocket and I can sell for a quick profit. If I execute everything perfectly, then I have no money at risk. I honestly think this strategy is almost as safe as buying box spreads, but in this scenario, you actually get to hold on to tangible assets (the iPads) and you can refund them at any time for free money. If this strategy is too advanced for some of you, I understand that it may take awhile to fully understand all of the moving parts of this investing plan. If any of you guys are experts, then let me know if this is even legal because it almost seems too good to be true honestly.",
        "subreddit": "wallstreetbets",
        "title": "Is it legal for me to buy calls on AAPL right before buying an iPad?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/id38up/is_it_legal_for_me_to_buy_calls_on_aapl_right/",
        "created": 1597924722.0
    },
    {
        "author": "LayeredFailure",
        "created_utc": 1596371397,
        "id": "i2ba5z",
        "num_comments": 181,
        "num_crossposts": 0,
        "selftext": "Apple has had 1,044% gain in 10 years; 267% in the past  5 years. \n\nGoogle has had 545% in the past 10 years; 135% in the past 5 years.\n\nMicrosoft has had 725% in the past 10 years; 336% in the past 5 years.\n\nI was thinking about it, and would it bad a bad idea to just split my money in a couple stocks (still looking at the other long term companies, but probably Google and Microsoft) but just keep it there for the next 10 years or whenever I need it?\n\nIf i invest my savings of just shy of 100k, and contribute bi-weekly (each part of my paycheck I can buy more stocks) I could add about 40-50k annually.\n\n&amp;#x200B;\n\nIs this a bad idea? I understand the concept of diversifying but I also don't believe these companies will be overshadowed in the next 10 years. Is there something I'm not considering? Why do people overly diversify and routinely buy and sell? How often do people go 'ultra long' on stocks?",
        "subreddit": "investing",
        "title": "Investing in Apple for the next 10 years?",
        "url": "https://www.reddit.com/r/investing/comments/i2ba5z/investing_in_apple_for_the_next_10_years/",
        "created": 1596400197.0
    },
    {
        "author": "TheHastyTypr",
        "created_utc": 1598707069,
        "id": "iis87z",
        "num_comments": 167,
        "num_crossposts": 0,
        "selftext": "Looking round wsb and less prestigious sites, there seems to be a 50/50 consensus on whether papa musk and Tim apple are going to reap us all delicious well cooked and preservative free tendies upon open, OR there will be a massive sell off with a hole so deep even dwayne Johnson could stick his roid dick inside and jiggle it about.\n\nTldr: are you all selling on open and buying the dip or expecting immediate gains?",
        "subreddit": "wallstreetbets",
        "title": "Tsla/aapl sell on open or wait for FOMOers to piss their moneys on it?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iis87z/tslaaapl_sell_on_open_or_wait_for_fomoers_to_piss/",
        "created": 1598735869.0
    },
    {
        "author": "Cygopat",
        "created_utc": 1596413576,
        "id": "i2muj7",
        "num_comments": 165,
        "num_crossposts": 0,
        "selftext": "Apple, Microsoft, Amazon, Google. These companies have one thing in common - their market cap is above $1 Trillion. They're all fairly diversified, some more some less but they certainly don't rely on one single product to exist. It's actually basically impossible to open a business nowadays without having to do with at least one of these companies. I realize that just 15 years ago the top 4 companies by market cap were very different ones and historically things have always changed, especially in tech. This time feels different though. Regulators are sleeping and politicians don't understand these companies. On top of that China is getting more and more powerful so it's questionable if there's even political interest in holding back the tech giants. Whenever competition emerges they can just kill it with money either by simply buying the competition or making the own product superior. On top of that their products have long lasting lock in effects. For the business side it's very expensive to move away from them and your average user hates having to get used to something new. As long as something \"just works\" people don't change for minor benefit and it feels like these companies have gotten strong enough to ensure that nobody else is ever offering something vastly superior.\n\nAs much as the past has shown otherwise, I don't see a world in which Apple, Microsoft, Amazon and Google are not at all at least top 10 in market cap 20 years from now.\n\nAt this point why even bother with anything else and not go all in on them?",
        "subreddit": "investing",
        "title": "Are we heading towards a Cyberpunk-style future in which a few companies own and run everything?",
        "url": "https://www.reddit.com/r/investing/comments/i2muj7/are_we_heading_towards_a_cyberpunkstyle_future_in/",
        "created": 1596442376.0
    },
    {
        "author": "1poundbookingfee",
        "created_utc": 1598546960,
        "id": "iholti",
        "num_comments": 165,
        "num_crossposts": 0,
        "selftext": "Being a poorfag wanting to buy some AMZN $4000 10/16, I was saddened by both the need to plop $3000 per contract, and get reamed by the $1.50 in bid/ask spread. \n\nSo looking for DD starting from my favorite site, Google Images, I noticed many signs that confirms a split will be coming, with the number 5 being the most likely. \n\n1. Bezos has already showed his affinity for a split, most famously from his wife, the ultimate girl-chad who if Elon wasn't already in a relationship, would definitely try to get his FUNDING SECURED from. \n\n&amp;#x200B;\n\n[At least 2 for 1 split](https://preview.redd.it/zpri3bswpkj51.png?width=1280&amp;format=png&amp;auto=webp&amp;s=523a6fb45f443862e39d7ac610c2a016b9b786f9)\n\n2. Like how his Highness [tweeted on 5/1](https://www.reddit.com/r/wallstreetbets/comments/ibfipq/musk_is_genius/), covertly giving everyone the signal that TSLA will be split 5 for 1, Bezos has been giving the signal throughout the years. \n\n&amp;#x200B;\n\n[Elton Bezos showing you 5-for-1](https://preview.redd.it/wz2go4ulqkj51.png?width=2600&amp;format=png&amp;auto=webp&amp;s=ac2f2c13e36d64ad7a9ce4b4922c27e321e485fd)\n\n&amp;#x200B;\n\n[Hitman Bezos flashing the same BULLGANG symbol](https://preview.redd.it/hqtqz0tnqkj51.png?width=618&amp;format=png&amp;auto=webp&amp;s=5d85f4151ca6c5ffef957712d66eff13439e9091)\n\n&amp;#x200B;\n\n3. Even at a 5 for 1 split, AMZN would be at around $600, far beyond the reach of the average autismo or retard. But good news, I also found this super secret image, where Bezos is flashing the \"Double BULLGANG symbol\", indicating a possible 10 for 1 split. \n\n&amp;#x200B;\n\n[Tansuit Bezos with the rare double BULLGANG ](https://preview.redd.it/ja0gya90rkj51.png?width=1280&amp;format=png&amp;auto=webp&amp;s=8f973987dd6961593433dd45c623b7f86c4aa92c)\n\nBecause of the previous successes with Tim Apple and Elon Musk, Bezos will definitely feel cucked if he doesn't split. Worst case for him is that the original Cucc (Zucc the Cucc) beats him to it.",
        "subreddit": "wallstreetbets",
        "title": "Bezos will split AMZN at least 5-for-1. Here's the DD.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iholti/bezos_will_split_amzn_at_least_5for1_heres_the_dd/",
        "created": 1598575760.0
    },
    {
        "author": "assetdash",
        "created_utc": 1598233028,
        "id": "iffsjm",
        "num_comments": 162,
        "num_crossposts": 0,
        "selftext": "Tesla has [overtaken](https://assetdash.com) Walmart, Procter and Gamble, Mastercard, and Home Depot by market cap. \n\nThe recent rally started after Tesla announced it would be doing a five to one stock split on August 31st. Since the announcement, Tesla has added an additional **$126 billion** to its market capitalization bringing the total to **$382 billion** as of Friday’s close.\n\nThe surge pushed Tesla’s market capitalization past many household names including retail giant Walmart and consumer goods corporation Procter and Gamble.\n\nWalmart recently announced an earnings beat on both revenue and earnings per share led by **97% annual eCommerce growth**. Walmart’s total revenue in the second quarter was $137 billion, while Tesla’s second-quarter revenue was only $6 billion. Walmart’s net income was $6.48 billion while Tesla’s second-quarter net income was just over $100 million.\n\nProcter and Gamble reported $17.7 billion in revenue with $2.8 billion in net income in its last quarter, more than **173%**, and **2,592%** respectively when compared to Tesla’s most recent earnings.\n\nTesla currently has a $10 billion market capitalization lead over Walmart and a $41 billion lead over Procter &amp; Gamble.\n\nOutside of the stock split announcement, investors are excited about Tesla’s delivery of 90,000 cars in the second quarter, 10,000 above estimates.\n\nTesla is gearing up to pass finance conglomerate Visa and the multinational corporation Johnson &amp; Johnson. Visa’s market capitalization is only $14 billion ahead of Tesla’s while Johnson &amp; Johnson has a $20 billion lead over the automobile company. Surpassing Johnson &amp; Johnson would put Tesla in the [Top 10 by market capitalization](http://assetdash.com/).\n\nTesla is not the only company seeing its shares rise in price following the announcement of a stock split. Apple announced a four to one stock split on July 30th. Since the announcement, Apple has added **$480 billion** to its market capitalization making it the first US company to pass the $2 trillion market cap milestone. The rally has increased Apple’s lead as the most valuable US company over Amazon and Microsoft by more than **$400 billion**.",
        "subreddit": "stocks",
        "title": "Tesla's market cap drives past Walmart, Procter and Gamble, and Home Depot",
        "url": "https://www.reddit.com/r/stocks/comments/iffsjm/teslas_market_cap_drives_past_walmart_procter_and/",
        "created": 1598261828.0
    },
    {
        "author": "NatenLogansDad",
        "created_utc": 1598698885,
        "id": "iiqkio",
        "num_comments": 156,
        "num_crossposts": 0,
        "selftext": "Robinhood is showing the split price but not split quantity at the moment, at least on my end. \n\nIt’s gonna be alright.",
        "subreddit": "RobinHood",
        "title": "Reminder- Apple shareholders , you’re fine.",
        "url": "https://www.reddit.com/r/RobinHood/comments/iiqkio/reminder_apple_shareholders_youre_fine/",
        "created": 1598727685.0
    },
    {
        "author": "Okmanl",
        "created_utc": 1598212614,
        "id": "ifa049",
        "num_comments": 152,
        "num_crossposts": 0,
        "selftext": "Something I noticed, when Amazon released AWS the value of the stock began increasing ten fold. \n\nWhen Tesla released the cybertruck, and announced battery day the stock shot up ten fold. \n\nWhen Square announced a new addition to their ecosystem such as using ML to take out loans and opening a real bank, the stock also increases tremendously. \n\n\nIt seems that investing in good vertically integrated companies, with great CEOs, that have shown a history of being able to suddenly announce unexpected innovations will end up giving 10-100x returns. Which is what TSLA, AMZN and SQ are currently doing. Which is what AAPL used to do under Steve Jobs. \n\n\nThis is also why Cathy Wood’s investment thesis is amazing. Because not only does her ETFs contain good companies, led by good CEOs, but they also tend to innovate as well.",
        "subreddit": "stocks",
        "title": "The market doesn’t account for unexpected innovation. Which is why ARKK is currently the best ETF today.",
        "url": "https://www.reddit.com/r/stocks/comments/ifa049/the_market_doesnt_account_for_unexpected/",
        "created": 1598241414.0
    },
    {
        "author": "oznomal",
        "created_utc": 1597280179,
        "id": "i8q88a",
        "num_comments": 152,
        "num_crossposts": 0,
        "selftext": "I am in my twenties and like many \"new\" investors became very interested in the market as a result of the economic downturn brought on by COVID-19. I saw a lot of my peers on Twitter and FaceBook making decent gains and it really piqued my interest because I have been saving roughly 4k per month in a high interest savings account and not really doing much else with it. I always thought the market to be too risky for my taste but after becoming comfortable with my base savings, I was ready to start my own journey into investing. I am not really the kind of person to go off of word of mouth so I set out to learn as much as I could on my own through reading and online courses. I took a course on the basics of the stock market on Udemy which mainly covered fundamental analysis but touched on the technical side of things as well. In addition to this I took a more in depth course on just technical analysis which covered trend lines, candlestick patterns etc ... I didn't find it too helpful for long term investments but it still seemed interesting. Lastly I read the Intelligent Investor as well as One Up on WallStreet and a book on basic accounting to help me understand how to decipher what I was seeing on these annual reports and what all of the numbers meant when I was attempting to valuate a potential purchase .... as well as various YouTube courses and tutorials\n\nAll of this has occurred over the course of the past 3 months, so while I have become a little more knowledgeable than most of my friends just blindly throwing money into the market, I still don't feel very confident in my newly developed skills because .... well, they are new and I haven't had enough experience. \n\n&amp;#x200B;\n\n**IF YOU DON'T CARE ABOUT ME AND MY JOURNEY INTO THE STOCK MARKET, SKIP TO HERE:**\n\n&amp;#x200B;\n\nWith that being said, I have been seeing a lot of talk about this 4:1 Apple split that is coming up and while I understand that this doesn't change the company fundamentally at all, I really can't seem to see why Apple is trading for what it is ... or more importantly, why so many analysts are rating it as a \"buy\". I know that Graham specifically warns against needing validation from \"professionals\" for your decision making but since I am still really a newbie, I wanted to know if there is something I am missing in forming my opinion that the stock is severely overvalued. \n\n&amp;#x200B;\n\nHere is how I arrived at this conclusion: \n\n**Point 1:** \n\nIn my opinion, Apple is nothing more than a 1 dimensional hardware company. When you look at the annual report for FY 19' the revenue stemmed from the following: \n\n* iPhone Sales: 54.7%\n* Services: 17.8%\n* Mac: 9.9%\n* Wearables, Home, &amp; Accessories: 9.4%\n* iPad: 8.2%\n\nOut of all of these things, the only one that is not hardware is services which means that 82.2% of the sales come from hardware alone ... mainly iPhone. \n\nFurthermore, if you look at what exactly makes up this \"services\" category you will see that it is Apple Music, Apple Care, iCloud, App Store Subscriptions, and also baked in there is the free version of iCloud, Maps, and Siri. \n\nNow, while I respect apple for growing this particular vertical (services) of its company which has experienced some good growth over the last few years\n\n2017: $32,700M in sales\n\n2018: $39,748M in sales (increase of 21.55%)\n\n2019: $46,291M in sales (increase of 16.46%)\n\nI can't help but also realize how closely coupled the services vertical is to the hardware vertical. Mostly all of the services Apple provides depend on the successful sale of its hardware. I can speak personally that I cancelled Apple Music in 2017 for Spotify because I switched jobs (software engineer) to a position that required me to work in a secure environment where I couldn't bring in my phone and since Apple Music had no web app, I couldn't listen to music and code while at work. This makes me weary of their services business as a whole because if for some reason the hardware becomes less popular then the services will suffer severely it seems ... you don't really need Apple Music without an iPhone .... and you aren't really paying for app store subscriptions if you don't have an iPhone or Mac ... and you also don't need Apple Care without an Apple Device, see where I am heading? \n\n&amp;#x200B;\n\niPhone sales are plateauing which can be seen by the data leading up to 2018 as well as the official announcement from Apple that they would stop providing exact numbers on the numbers of units sold at the end of 2018.  Data: [https://www.statista.com/statistics/276306/global-apple-iphone-sales-since-fiscal-year-2007/](https://www.statista.com/statistics/276306/global-apple-iphone-sales-since-fiscal-year-2007/)\n\nIn addition to iPhone sales slowing up ... PC sales have been declining across the board for a while due to the fact that handhelds have become increasingly more powerful, this has also resulted in the plateauing of Mac sales as well. Data: [https://www.statista.com/statistics/276308/global-apple-mac-sales-since-fiscal-year-2002/](https://www.statista.com/statistics/276308/global-apple-mac-sales-since-fiscal-year-2002/)\n\n&amp;#x200B;\n\nI say all of this to point out that for a company that is getting 82% of its sales from hardware, the hardware growth seems to be slowing down tremendously and the services market that it seems to be  shifting into seems largely dependent on the hardware, which seems concerning to say the least. \n\n&amp;#x200B;\n\n**Point 2:** \n\nApple does not appear to either be a growth stock or a value stock in the current climate. Don't get me wrong, I think Apple is pretty good company as a whole and they appear to clearly be financially stable  even despite the declining hardware sales ... but at this price they are far from a \"value\" stock and from a financial perspective, they don't seem to be a \"growth\" stock either. \n\nWhen you look at net income for the past 5 years you will notice that it hasn't really changed too much, when comparing the most recent annual report with the one from 5 years ago the net income has only increased by 3.5% which doesn't even take into account inflation which in actuality would make it seem like the net income for FY 19' was actually less than what was earned in FY 15'\n\n2015: $53.39B\n\n2016: $45.69B\n\n2017: $48.35B\n\n2018: $59.53B\n\n2019:  $55.26B\n\n&amp;#x200B;\n\nFurthermore, what seems funky to me is that the EPS actually seems to be increasing over time ... but it is not due to the net income rising, it is due to the fact that Apple has been buying back stock each year thus decreasing the total number of shares outstanding from 5.75B in 2015 to 4.62B in 2019, a decrease of 19.65% over the past 5 years ... this makes the EPS seem higher and the P/E seem lower, making the stock seem more valuable than it actually is. \n\n&amp;#x200B;\n\n**SHARES OUTSTANDING:** \n\n2015: 5.75B\n\n2016: 5.47B (-4.87%)\n\n2017: 5.22B (-4.57%)\n\n2018: 4.96B (-4.98%)\n\n2019: 4.62B (-6.85%)\n\n&amp;#x200B;\n\n2015 - 2019 Change: - 19.65%\n\n&amp;#x200B;\n\n**EPS (as is in annual report):**\n\n2015: $9.28\n\n2016: $8.35 (-10.02%)\n\n2017: $9.27 (+11.02%)\n\n2018: $12.01 (+29.56%)\n\n2019:  $11.97 (-0.37%)\n\n&amp;#x200B;\n\n2015 - 2019 Change: +28.99%\n\n&amp;#x200B;\n\n**EPS (based on consistent shares outstanding of 5.75B across all years)**\n\n2015: $9.28\n\n2016: $7.94 (-14.44%)\n\n2017: $8.40 (+5.79%)\n\n2018: $10.35 (+23.21%)\n\n2019:  $9.61 (-7.15%)\n\n&amp;#x200B;\n\n2015 - 2019 Change: +3.56%\n\n&amp;#x200B;\n\nThen if we use each 2019 EPS to calculate the P/E based on todays closing price of $452.04\n\n**P/E TTM as is:** $37.76\n\n**P/E TTM adjusted based on consistent shares outstanding:** $47.04\n\n&amp;#x200B;\n\nNot really sure if I am even allowed to make an adjusted calculation based on what if they never brought back the shares but nonetheless here it is .... \n\n&amp;#x200B;\n\n**Point 3:**\n\nThis is purely speculation which is against the rules, I know .... but I can't help but think consumer psychology has to play a role in the market.\n\nThe truth of the matter is that consumers don't really know what they want until it is presented to them, iPhone has dominated the market for what seems like forever but in actuality, it has really only been about a decade. iPhone 4 was the real game changer since it allowed people to get their hands on an iPhone for other carriers. There seems to be a general consensus among many consumers now though that all Apple does is slap a new camera on each new model, repackage it, and put it on the shelf .... being in tech myself, I understand that the technical upgrades such as chipsets and other components that don't bring forth clear, tangible improvements do play a vital role in allowing the device to move forward and become more capable but I don't think the average consumer understands that. \n\nApple vs Android is a tired and pretty much done battle, they have been battling for the market for a while and many consumers have chosen their side and will likely stick with it at this point when comparing the 2 ... however, I have a feeling that if a new product were to emerge onto the market that were neither android or apple but introduced something reliable, new, and fresh then consumers would be more than ready for a change. Apple's double edged sword is that it is a complete ecosystem, all of the devices rely on some type of proprietary operating system which when paired together create a pretty good user experience between the devices. However, make no mistake, iPhone sits at the top of that ecosystem and for many consumers, iPhone is the segway into the Apple ecosystem. You get an iPhone and you like it .... so now when you get a computer you want a Mac etc. I say this to point out how financially dependent Apple is on the iPhone, if ever it should fail ... then the performance of the company will suffer miserably. How long can iPhone continue to dominate? Touch screen phones of this type have been running the scene for the past decade, I honestly think a major change is on the horizon for smart phones, but I don't necessarily believe Apple will be the company to usher it in .... and because of that belief I just don't think it would be a good idea to overpay for a stock now with the stupid belief that the what goes up must continue to go up.\n\n&amp;#x200B;\n\n**Conclusion:** \n\nFrom everything I see it seems like Apple is severely overvalued right now, the company  has shown a long history of growth and one would like to think that would continue but based on the financials it doesn't seem like the growth factor is really there right now. I don't think the company is doomed or is a bad pick, I just don't think it's a good pick at its current price. However, with that being said ... I don't have nearly as much experience as many of you I'm sure and definitely not those analysts. on Wall Street, so I was trying to figure out why people are so excited as the price sits now and why the buy rating seems to be so high.",
        "subreddit": "stocks",
        "title": "Can someone make the positive Apple stock outlook make sense?",
        "url": "https://www.reddit.com/r/stocks/comments/i8q88a/can_someone_make_the_positive_apple_stock_outlook/",
        "created": 1597308979.0
    },
    {
        "author": "Bdavid5",
        "created_utc": 1597323399,
        "id": "i8zf3r",
        "num_comments": 149,
        "num_crossposts": 0,
        "selftext": "## What’s A Stock Split And How It Could Affect Your Current Holdings\n\nApple and Tesla, arguably two of the hottest companies on [Wall Street](http://www.stockmarket.com/investing), both announced stock splits in recent weeks. The question is, can it positively affect your current holdings? First, let’s understand what a stock split is. Essentially, a stock split is exactly what it sounds like. One share is splitting up into a few individual shares. This often comes after a particular share price has been inflated to a level that may be ‘too high’. For example, in Tesla 5-for-1 stock split example, one share worth $1500 now will be broken into 5 shares worth $300 each. This way, it will lower the entry barrier for investors who wish to buy a stake in the company.\n\nA stock split can typically result in a share price increase following a decrease immediately after the split. Since many retail investors find the stock now more affordable, they end up boosting demand and driving up prices. A stock split also reminds investors that the share price had been increasing in the past. It is not surprising that many investors extrapolate the historical growth into the future and bid up the share price again. One thing to also note is that even though the number of outstanding shares increases and stock price decreases, the market capitalization doesn’t change.\n\n# Who Tend To Benefit From Stock Splits?\n\nGenerally speaking, stock splits are neutral events for current shareholders. In the case of the Apple 4-for-1 stock split, you used to own 1 stock, but moving forward you will own 4, but the total value remains the same. Essentially, a stock split wouldn’t change the company value, all else being equal. But the truth is, all else is rarely equal when we apply it in the market.\n\nBoth TSLA stock and AAPL stock jumped after the announcement. This may be the fifth time for Apple to do a stock split, but it is Tesla’s first. The price change will be more dramatic for Tesla, whose stock split will bring individual share to the $300 range. Compared to Apple’s post-split of $100 range, Tesla’s post-split stock might find it harder to attract smaller investors.\n\nCertain online brokerages offer investors to buy fractional stocks. Conceptually, it offers the same thing in the absence of stock splits. Then again, not all brokerages will offer such services and it’s not that easy to move shares between brokerages. Therefore, it will not create a much stronger demand than actual stock splits. Now, like it or not, news of stock splits tend to cause share prices to jump. And that is not really rational. But who cares? As long as the prices go up, existing shareholders would not be complaining.\n\n## Tesla &amp; Apple’s Stock Splits Could Restart The Trend Again.\n\nIs stock splits a thing in the past? Tracing back the history, in 1997, 102 companies in the [S&amp;P 500](https://stockmarket.com/ticker?symbol=SPY) split their stocks, and in 2016, only 7 companies did so, a decline of more than 90%. That is about to change when two of the hottest tech companies announced they will be splitting their shares at the end of this month. The zero brokerage fees environment gives companies a greater incentive to split shares today. In addition, it creates a more affordable and accessible stock for Robinhood traders to start trading. After all, many retail investors are nonetheless still prone to judging how “expensive” a stock is based on its dollar value. That said, it is not surprising to see other tech companies like Amazon, Shopify, or Alphabet make such moves in their own timeline.",
        "subreddit": "StockMarket",
        "title": "Apple &amp; Tesla Announced Stock Splits; Here’s How It Could Impact Your Investments",
        "url": "https://www.reddit.com/r/StockMarket/comments/i8zf3r/apple_tesla_announced_stock_splits_heres_how_it/",
        "created": 1597352199.0
    },
    {
        "author": "therealdiabolus",
        "created_utc": 1597823242,
        "id": "icjcmr",
        "num_comments": 149,
        "num_crossposts": 0,
        "selftext": "Alright now that I’ve hooked you autists with my retarded title I will now bore you with boring information here we go:\n\n\n**History Lesson**\nJPM + other bullion banks have been suppressing silver prices for over half a century the second half of [this old ass article from 2010 that basically predicted the silver spike of 2011](https://www.thestreet.com/opinion/silvers-history-of-suppression-10787499) explains it pretty well. Basically the bullion banks were “printing silver” which caused a supply fake out keeping silver at low level so the banks can roll in their money piles from silver shorts.\n\nHistorically silver normally moved at about 20:1 of gold which is it’s “normal” price and as you can see [in this fun graph](https://www.macrotrends.net/2517/gold-prices-vs-silver-prices-historical-chart) as of 2011-2012 silver has decided to fuck off and do it’s own thing. We are currently at 76:1 gold to silver.\n\n**JPM Bad and Fed fault**\nIn 2008 after the collapse of Bear Stearns JPM inherited all their silver shorts. Because Beat Stearns was “too big to fail” the whole JPM take over was handled by the fed. JPM ofc started to manipulate silver by spoofing supply (It was estimated in 2008 its estimated that 2/3rds of the silver supply was literally just paper) and gold and taking massive gains meanwhile the CFTC decides to investigate JPM for manipulation but some how manages to continue manipulation and hoard a literal fuck ton of actual silver. Since then JPM has never lost on a silver short (as of 2018). \n\nNow because JPM took over the failing Beat Stearns bank it’s *speculated* that the fed told the CFTC to ignore JPM and let them do what ever the fuck they wanted with gold and silver and [apparently gave JPM a 10 year deal to make unlimited tendies](https://www.silverdoctors.com/silver/silver-news/theres-a-govtjp-morgan-10-year-deal-to-rig-silver-prices-thats-coming-to-an-end-in-march-2018/) which was supposed to end in early 2018.\n\n**Current Events**\nRecently JPM has been under [investigation for rigging metals \n](https://www.bloomberg.com/news/articles/2020-02-05/jpmorgan-s-role-in-metals-spoofing-is-under-u-s-criminal-probe) again after some [employee guilty pleas](https://www.cnbc.com/2018/12/13/jp-morgan-faces-lawsuits-after-guilty-pleas-by-a-former-metals-trader.html) in late 2018.\n\nBecause of human malware virus JPM [went net long](https://gsiexchange.com/with-jpmorgan-back-in-the-mix-the-hammer-is-now-about-to-fall/) on silver in April and there is a precious metals supply problem while there is a run on precious metals going on. Also everyone wants their silver deliveries now which caught JPM with their pants down holding paper instead of silver so the real supply is being revealed to be low. Which is thanks to daddy JPOW and his brrrrr machine pushing inflation.\n\nAll the other bullion banks who are still short who were making tendies off of JPM’s shenanigans will eventually have to cover their shorts by buying silver, pushing up the price more. \n\n**TLDR:** Buy SLV calls. Silver supply way down demand is up bigly and silver will go up huuuugely. I’m expecting $35 by end of September.\n\nPositions: \nSLV Call $31 10/2\nBag holding Purple Mattress shares \nGonna but some AAPL and AMZN stonk.\n\n**Side note**\nPlease don’t use RH those shitty spreads aren’t worth it. Just get a real broker and pay the 0.65 per contact and save more money on the spreads.",
        "subreddit": "wallstreetbets",
        "title": "SLV to the moon 🌙 🚀 🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/icjcmr/slv_to_the_moon/",
        "created": 1597852042.0
    },
    {
        "author": "theinternetishere12",
        "created_utc": 1598126315,
        "id": "iepamp",
        "num_comments": 147,
        "num_crossposts": 0,
        "selftext": "I have a feeling most of you are extremely bullish.  The question I have for you is, do you feel comfortable going all in on $TSLA which is now at 2050?  How about $AAPL bear $500?\n\nLong-term no question these are good stocks to buy and hold.  But, are they good stocks to buy...now?\n\nAll the technicians are calling for a correction.  Where do you see yourself?",
        "subreddit": "investing",
        "title": "Valuations and P/E - The Bubble. Is it here?",
        "url": "https://www.reddit.com/r/investing/comments/iepamp/valuations_and_pe_the_bubble_is_it_here/",
        "created": 1598155115.0
    },
    {
        "author": "vadimyuryev",
        "created_utc": 1596694538,
        "id": "i4mgq1",
        "num_comments": 146,
        "num_crossposts": 0,
        "selftext": "Alright guys so I'm one of the hosts on a YouTube channel named \"Max Tech\".  \nI previously did YouTube work for the channel \"Appleinsider\" since 2016, making videos on Apple products which include Mac computers with Intel chips. \n\nI also grew up playing video games and building custom PCs right when AMD started to release six-core and 8-core processors that were cheaper than Intel CPUs and targeted towards gamers.  \n\nEven though the Intel chips were better for gaming, I still bought AMD because they were cheaper. Intel maintained the lead for many years since games really only used 4 cores, and Intel chips gave more consistent frame rates for gaming.\n\nAt one point, it was clear to me and to everyone else that Intel was intentionally holding off from innovating and improving their performance because they already owned a bulk of the market share. They realized that they could make more profit by making small improvements every year, while AMD was busting their ass trying to figure out how they can compete. (it was ultimately the gaming and custom PC market) \n\nMeanwhile.. Apple was using Intel chips quite successfully in their Mac computers the like MacBooks and iMacs. And Apple was also using their XEON chips for their higher-end machines. And of course, Intel was killing it in the server market.\n\nNow in 2013, Intel announced that they were working on their new 10nm chip process and that it should be ready to launch in 2015, and they said their 7nm chips should launch in 2017. \n\nBack to Intel, over the new few years, Intel delayed 10nm to 2016... and then to 2017.. and then to late 2019... We are now in 2020 and Intel is still shipping 14+++++ nm chips for high-end machines like the 2020 5K Apple iMac that was just released yesterday. Only laptops are getting the actual 10nm chips right now. \n\nIn 2017, AMD shocked the world by announcing their new Ryzen chips, and then also their Threadripper chips, and ever since then, they've been quickly catching up to Intel in terms of both performance and price. \n\nBecause of this, Intel instantly started lowering the price of their chips, and in 2018, they finally made 6-core chips for the MacBook Pro. 8-core chips in 2019, and now 10-core chips in 2020. This is an obvious and desperate move to try and compete with AMD. \n\nBecause Intel's 10nm chips were not ready in 2015 or 2016, Apple's redesigned 2016 MacBook Pro which was thinner than ever before, had overheating issues. The overheating was severe in 2018 with the 6-core chips that Intel made in fear of AMD. \n\nThere were even leaked emails from Intel executives worried about AMD's price to performance beating out Intel. \n\nAnd right now, it is well known that AMD is making BETTER price-to-performance x86 chips. \n\nThe MOST important part of this discussion is that the tech community as a whole, including or YouTube and Reddit, are now convinced that AMD is the way to go. I've seen countless comments on my videos that are dissing on Intel chips and wishing that Apple would switch to using Intel. \n\nIf we make a build guide video using an Intel processor, we get shamed and called dumb for not using an AMD chip. Our Mac Pro videos got a ton of negative feedback because Apple is stupid for using Intel chips. Our 2020 MacBook Pro videos were getting comments dissing on Intel's 10th-gen chips. The entire community is starting to hate Intel and preferring AMD.  \n\nAMD stock has increased over 11x since they announced the first Ryzen chips in August of 2016.  \nIntel stock has only increased 38% since that same date. \n\nAnd looking towards the future.. Intel has recently delayed their 7nm chips until late 2022 or 2023. This caused their stock price to tank at they last earnings call. \n\nThere's even now a class-action lawsuit against Intel because of this delay. \n\nThis also caused their chief of chip engineering to resign, and they reorganized their entire chip team. \n\nThey've even discussed outsourcing their future 6nm, 5nm and 3nm chip production to their rival foundry TSMC because they've lost confidence in their own foundry. \n\nSo it's clear that Intel is getting killed by AMD with each passing year, and the tech community knows it. (Which is VERY important)   \n\n\nThis brings us into the Apple and TSMC portion of this DD.   \n\n\nBack in 2013, Apple announced their A7 chip for their iPhone 5s, the first 64 bit smartphone chip, and ever since then, there was a massive performance war between Apple and Qualcomm, fighting to create the fastest smartphone chips, in which Apple ultimately won. \n\n(The A13 in the iPhone 11 Pro is still much faster than the Snapdragon 865+ which was just recently released this year) \n\nStuck in the middle of this battle was TSMC, which has been the EXCLUSIVE manufacturer of Apple Silicon chips for their iPhones and iPads since the A10 chip in 2016. \n\nAnd in 2018, Apple released their 11\" iPad Pro with the A12X chip manufactured by TSMC's 7nm process. This iPad from 2 years ago is so powerful that it still outperforms the new 2020 13\" MacBook Pro with Intel's 10th gen chip in both processor AND graphics performance. \n\nNow, Apple is about to announce their iPhone 12 in about a month that's gonna pack the A14 chip which is being built on TSMC's brand new 5nm process. \n\nAnd of course, the next iPad Pro will get a much improved A14X 5nm chip, and it's the same story for the Apple Silicon Mac chips that will start being released later this year in October/November. \n\nI'm of course, talking about Apple finally ditching Intel and moving forward with their own chips. This makes sense for Apple for various different reasons.\n\n1: They can run iPhone &amp; iPad apps on their Macs.\n\n2: They control both the software and hardware for incredibly amounts of performance optimization.\n\n3: They can make sure every new Mac update gets a new chip with performance improvements instead of relying on Intel to release improved chips. \n\n4: This is of course, much cheaper for Apple since they don't have to pay Intel the high price of their chips. \n\n5: They don't have to deal with overheating issues since most Intel chips are still on 14nm technology, therefore running very hot and using a lot of power.   \n\n\nAnd there's a good chance that the very first Apple Silicon Mac chips are gonna outperform the current Intel chips, stay much cooler and give you much better battery life. \n\nJust to give you some perspective in terms of how Intel's 10nm compares to TSMC's 5nm..\n\nIntel 10nm transistor density: around 100 million transistors per square millimeter.\n\nTSMC 5nm transistor density: around 171 million transistors per square millimeter. \n\n  \nTSMC has already confirmed that they're working on risk production of their new 3nm process in 2021,  with those chips going into 2022 iPhones, iPads and Macs. \n\nSo here's what the future looks like:\n\n  \nIntel 7nm in late 2022/2023 : 240 million transistors per square millimeter\n\nTSMC 3nm shipping in 2022 Apple products: 290 million transistors per square millimeter\n\nAnd apparently, TSMC is already working on plans for their 2nm process for 2024.   \n\n\nAnd due to Intel's past, there's a very good chance that Intel could delay 7nm even further, especially since they had to restructure their entire chip team, while TSMC has been on point.   \n\n\nSo the future isn't looking very bright for Intel's chip technology compared to TSMC. No wonder why they wanted to outsource their chips from them.   \n\n\nAnd one last bit on Apple's switch to their own chips built by TSMC. \n\nApple has already given developers their transition kit which is a Mac Mini with an A12Z chip from their iPad Pro. \n\nOne developer tweeted this: \"At this point, I think that the first gen Apple Silicon machines will be faster at running x86 code than an actual x86...\"  \n\n\nWhat he means is that Apple's new Rosetta 2 emulation software is so good that he thinks it'll outperform Intel chips even though it's not running natively for ARM. \n\nSo basically, Apple made the right choice by ditching Intel.   \n\n\nAnd if Apple proves everyone wrong by coming out with incredibly great Macs thanks to their switch to their own Apple Silicon ARM-based chips, then there's a VERY good chance that the rest of the market will follow them and start developing ARM-based chips for laptops.\n\nThis will force Windows to start heavily investing in their ARM-based Windows software. \n\nAnd if you didn't already know.. Intel is FAR behind in the ARM-based chip world.   \n\n\nNow, the most common argument I hear is this: Apple is only a tiny part of Intel's business, and while that may be true.. the MOST important thing is the public's view of Intel.  \n\n\nThe tech community is already starting to despise Intel as a brand name because of their overpriced processors and the fact that AMD is beginning to CRUSH them. \n\nJust wait until Apple Silicon Macs start getting released and people realize that ARM-chips have a ton of potential, and they'll start hating Intel even more. \n\nThis will cause Intel's brand recognition and reputation to get absolutely destroyed in favor of AMD and Apple Silicon. This alone will lead to less market share. And what will happen if Nvidia or Apple buy out ARM? \n\nAnd by the way, there are now more and more ARM-based servers popping up, so there's a good chance that Intel will start to lose market share on the server side if ARM-based servers prove themselves. (They use less power so this makes sense for server farms)\n\n&amp;#x200B;\n\nBasically, what I'm trying to say is that Intel just got ditched by Apple.. and they're getting killed by AMD and TSMC. ARM is coming VERY quickly and Intel is NOT ready. They have been plagued with delay after delay, and all of this drama will ruin the confidence of their staff, leading to lowered productivity. It's not looking good for Intel for the long-term.  \n\n\nAs of right now, Intel stock is very cheap, and you might make a few bucks if you trade short term.. but I wouldn't hold Intel stock long term.   \n\n\nIf you want more in-depth info with visuals and extra details, you can check out two videos I made on the Max Tech Youtube channel: \n\n\"How Intel Lost the CPU Race..\"\n\n\"Apple Silicon ARM Chips vs Intel x86 Processors for Mac?\"\n\nHopefully you enjoyed this DD.",
        "subreddit": "wallstreetbets",
        "title": "INTC - Why you Should NOT hold Intel stock long term!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i4mgq1/intc_why_you_should_not_hold_intel_stock_long_term/",
        "created": 1596723338.0
    },
    {
        "author": "Stupid-investor",
        "created_utc": 1598629613,
        "id": "ii9h0o",
        "num_comments": 144,
        "num_crossposts": 0,
        "selftext": "TSLA, AAPL, AMZN yeah we get it. There’s so much money. But I don’t have 18k to slap down on a TSLA call. \n\nWhat positions are you all taking for under $500 a pop?\n\nRight now I’m working with a few SPY $350c 9/11",
        "subreddit": "smallstreetbets",
        "title": "Options for us poors",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/ii9h0o/options_for_us_poors/",
        "created": 1598658413.0
    },
    {
        "author": "cryptoguy66",
        "created_utc": 1596335038,
        "id": "i24l6l",
        "num_comments": 144,
        "num_crossposts": 0,
        "selftext": "Facebook, Amazon, Google, Apple, Tesla\nInvest in these stocks for the long term and play short term options for the instant tendies. No need to diversify further than these quality stonks",
        "subreddit": "wallstreetbets",
        "title": "FAGAT",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i24l6l/fagat/",
        "created": 1596363838.0
    },
    {
        "author": "ryanlipton",
        "created_utc": 1597599942,
        "id": "iawr29",
        "num_comments": 141,
        "num_crossposts": 0,
        "selftext": "* Last 6 months\n* Facebook\n   * \\+22%\n* Amazon\n   * \\+47%\n* Apple\n   * \\+41%\n* Netflix\n   * \\+27%\n* **Google**\n   * **-1%**\n\n&amp;#x200B;\n\nI don't see how every other big tech company is vastly more valuable after coronavirus but Google isn't. The post-COVID world makes every single tech company more valuable and every other tech company's stock price has gone up aside from Google. It makes me think that Google should be a BUY right now and a value stock. But I don't understand why Google is vastly trailing every other tech company during the pandemic.",
        "subreddit": "investing",
        "title": "Why is Google the only stock out of the Big Tech stocks to not see its stock price go higher since before the pandemic? Seems like a great value opportunity to me. What does everyone else think?",
        "url": "https://www.reddit.com/r/investing/comments/iawr29/why_is_google_the_only_stock_out_of_the_big_tech/",
        "created": 1597628742.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1597392406,
        "id": "i9i01u",
        "num_comments": 141,
        "num_crossposts": 0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme and/or [post your arguments against fundamentals here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nMost fundamentals are updated every 3 months due to the fact that corporations release earnings reports every quarter, so traders are always speculating at what those earnings will say, and investors may change the size of their holdings based on those reports.  Expect a lot of volatility around earnings, but it usually doesn't matter if you're holding long term, but keep in mind the importance of earnings reports because a trend of declining earnings or a decline in some other fundamental will drive the stock down over the long term as well.\n\nSee the following word cloud and click through for the wiki:\n\n[Market Cap - Shares Outstanding - Volume - Dividend - EPS - P/E Ratio - EPS Q/Q - PEG - Sales Q/Q - Return on Assets (ROA) - Return on Equity (ROE) - BETA - SMA - quarterly earnings](https://www.reddit.com/r/stocks/wiki/fundamentals-themed-post)\n\nIf you have a basic question, for example \"what is EBITDA,\" then google \"investopedia EBITDA\" and click the Investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nUseful links:\n\n* [Investopedia Tuturiol](https://www.investopedia.com/university/all/fundamental-analysis/) on fundamental analysis including [Discounted Cash Flow](https://www.investopedia.com/university/dcf/) analysis; see [definition here](https://www.investopedia.com/terms/d/dcf.asp)\n* [FINVIZ](https://finviz.com/quote.ashx?t=aapl) for fundamental data, charts, and aggregated news\n* [Earnings Whisper](https://www.earningswhispers.com/stocks/aapl) for earnings details\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion &amp; Fundamentals Friday Aug 14, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/i9i01u/rstocks_daily_discussion_fundamentals_friday_aug/",
        "created": 1597421206.0
    },
    {
        "author": "SanderGGs",
        "created_utc": 1598477219,
        "id": "ih7uso",
        "num_comments": 141,
        "num_crossposts": 0,
        "selftext": "J Pow, aka, J Plow the Dollar in the ass, has a speech set tomorrow. I personally think after seeing the consumer confidence index seeing such a rapid decline back to Obama levels, we are witnessing deflation before our very eyes. After the fed minutes came out last Wednesday, my calls took the biggest, longest, girthiest red Dildo I have seen since December 2017. For that very reason I sold out of all of my positions before market close today. \n\nAm I the biggest autist in the world for selling my April 2021 Apple calls? Or am I a genius because a dip is inevitable tomorrow?",
        "subreddit": "wallstreetbets",
        "title": "J Pow Speech, Tomorrow, 9:10 AM ET",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ih7uso/j_pow_speech_tomorrow_910_am_et/",
        "created": 1598506019.0
    },
    {
        "author": "mateobra",
        "created_utc": 1598363836,
        "id": "igcong",
        "num_comments": 139,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "APPL - When apple is pumping? I need to BRRR no to see red portfolio!! 500c 9/18",
        "url": "https://i.redd.it/ecuuiqjsm5j51.jpg",
        "created": 1598392636.0
    },
    {
        "author": "ZoomsterVK",
        "created_utc": 1598377035,
        "id": "iggxk4",
        "num_comments": 139,
        "num_crossposts": 0,
        "selftext": " [Judge says Apple can’t prevent ‘Fortnite’ maker from using its developer tools](https://finance.yahoo.com/m/1f47e002-862e-308b-8ad0-c1a3aa3253c8/judge-says-apple-can%E2%80%99t.html?siteid=yhoof2&amp;yptr=yahoo)\n\nThis is  preposterous.\n\nMy sweet Timmy boy. Puts on court.",
        "subreddit": "wallstreetbets",
        "title": "Judge says Apple can’t prevent ‘Fortnite’ maker from using its developer tools",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iggxk4/judge_says_apple_cant_prevent_fortnite_maker_from/",
        "created": 1598405835.0
    },
    {
        "author": "ModJon",
        "created_utc": 1598538830,
        "id": "ihm3kd",
        "num_comments": 135,
        "num_crossposts": 0,
        "selftext": "We’re in the middle of a pandemic, these stocks have been flying and flying. It just feels so wrong and I feel so uncomfortable to buy in knowing the state of the world and how the market just keeps ignoring it. \n\nDoes anyone else feel like this? Is it wrong to feel the way I am? How do you go about deciding whats the right thing to do? I just feel way too afraid and I don't know how to get out of this feeling.",
        "subreddit": "investing",
        "title": "Is it wrong to be afraid to buy into stocks like Apple Tesla Google Amazon during times like these?",
        "url": "https://www.reddit.com/r/investing/comments/ihm3kd/is_it_wrong_to_be_afraid_to_buy_into_stocks_like/",
        "created": 1598567630.0
    },
    {
        "author": "vegadust",
        "created_utc": 1597699131,
        "id": "ibn6j5",
        "num_comments": 134,
        "num_crossposts": 0,
        "selftext": "Apple makes gay phones and overpriced lap tops, I'd know because I only own apple products, but let's just go with the phones because it's their main source of income.\n\nIn 2020 about 45% of people use an Iphone. That's not even half of the market and Apple is a trillion dollar company.\n\nTesla owns virtually 100% of the electric car market, which is rapidly expanding across Europe and Asia.\n\nMore importantly, there IS NO competition for Tesla. No one can do it as well as them, period. There isn't even a second competitor, and legacy car manufacturing will not be able to convert their facilities to making electric because they might lose in the battle with Tesla whereas they are fine right now where they are... those CEOs are thinking short term and about their retirement plans, not about the future of society or the planet.\n\nI'm sure people will mock me for saying that Tesla is worth a trillion, but in reality it's probably worth more. It's worth more than Apple, for sure.",
        "subreddit": "wallstreetbets",
        "title": "If Apple is worth a trillion then so is Tesla.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ibn6j5/if_apple_is_worth_a_trillion_then_so_is_tesla/",
        "created": 1597727931.0
    },
    {
        "author": "MrHindoG",
        "created_utc": 1598843875,
        "id": "ijqiec",
        "num_comments": 134,
        "num_crossposts": 0,
        "selftext": "I’m not sure about the insider trading laws but I heard that if you post it on a public forum where everyone has an equal opportunity to see the news, then it can’t be insider trading. Tomorrow I’m going to buy $1000 worth of Apple (~8 shares worth) which I think could drive the price up (higher demand = higher price). Wanted to disclose this so you all can act accordingly",
        "subreddit": "wallstreetbets",
        "title": "Insider trading disclosure",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ijqiec/insider_trading_disclosure/",
        "created": 1598872675.0
    },
    {
        "author": "Domega86",
        "created_utc": 1596926564,
        "id": "i68ffh",
        "num_comments": 130,
        "num_crossposts": 0,
        "selftext": "My wife and I have well diversified retirement accounts and are in our 30’s. Each account has about 200k of stocks and well whatever 10% of our pay goes to. Ive even picked up 60 ounces of silver bullion at $18 an ounce cost average. \n\nToday, with a fear of stagflation/inflation I have started a Robinhood account.  I opened the account and purchased 3 shares of Apple stock. I’m not looking to by a daily trader but and investor for the long term. This is so some of my cash doesn’t depreciate with inflation. \n\nI see some low hanging fruit on some big name stocks. Airlines, cruise ships, Ford, GM, and Microsoft.   With Covid-19 happening some of these industries have had a pull back. I feel they will rebound and a timely fashion and get back to past peaks. \n\nCan anyone help me polish my thoughts? I never had experience really dabbling in stocks like this. With those companies i mentioned above I’m only willing to risk 10-50 shares of stock.  \n\nThanks for your thoughts and feedback.",
        "subreddit": "RobinHood",
        "title": "Newbie advice. Robinhood Rookie.",
        "url": "https://www.reddit.com/r/RobinHood/comments/i68ffh/newbie_advice_robinhood_rookie/",
        "created": 1596955364.0
    },
    {
        "author": "clicknbait",
        "created_utc": 1596838317,
        "id": "i5nb19",
        "num_comments": 130,
        "num_crossposts": 0,
        "selftext": "I am seeing a shit load of new treads discussing the following-\n\n1. Fastly vs NET\n2. Hold Fastly or let go?\n3. What does Fastly do? \n\nSo I will clear up a few myths just in case. \n\nFastly is a CDN provider, which allows their clients to host their website on Fastly's servers. Fastly's business model is catered towards large enterprises that are looking at fastest (thus the name!) cold start time, i.e. time it takes to load a webpage on mobile/PC. Here are a few of their clients-\n\n1. **Clients doing very well during Covid**\n\n* Reddit\n* Shopify\n* Wayfair\n* Pinterest\n* Twitter\n* Stripe\n* Overstock\n* Shazam\n* Wealthfront\n* Etsy\n* Tiktok\n\n2. **Clients doing not so well during Covid**\n\n* Airbnb\n* Jetblue\n* Trip Advisor\n* Alaska Air\n* Kayak\n* Yelp\n* Kayak,\n* and many more....\n\nNotice first that their clients that are booming right now are very likely to continue booming for the next year or so. Once we are done with Covid (that is if), revenues will switch to clients in hospitality business, which typically have a strong business during normal times.\n\n&amp;#x200B;\n\nFastly's USP is fastest cold start time, i.e., it is the best CDN in the market which allows the visitors on their client's website to load the webpage/apps faster than anyone else in the market right now. \n\n&amp;#x200B;\n\n**Why is this USP so important**\\--well there are a few reasons why Fastly will continue to have higher growth rate.  I have noted a few down below-\n\n&amp;#x200B;\n\n1. Apple rolls out 5g iPhone later this year. They will require webpages to load faster. Fastly is the best CDN there is to handle that request. This does not mean that Akamai or NET are sitting out catching honeybee, but really means that Fastly is positioned to serve that switch to 5g better than NET or Akamai IMO.\n2. Fastly's business model is unique. It charges their customers based on the bytes loaded, which translates to the amount of time people spend on their customers' website. Thus, while I am spending 5-10 mins to write this essay, Reddit is getting charged by Fastly (pun intended!). Notice that this is a different business model than NET. NET offers a free subscription to begin with and has lower CDN hosting rate for those willing to host on their servers. Therefore, organizations which do not feel that speed is of concern to them as much, prefer to use NET. On the flip side, Fastly has a niche set of customers who value speed, because user experience on their website is of utmost importance to them. Imagine if I had to spend several 100 microseconds for a webpage to open, I would be pissed and may not go on that website, purely because of that reason.\n3. YoY growth based on investor's copy was 62%, which is great if you ask me. As long as it is staying above 50, my money is parked there.\n4. Bergman and Josh raised guidance for this year, during a time when a lot of CFOs are holing on giving guidance. Also of importance is that these folks in the C suite like to give a conservative guidance and beat it. In other words, promise less and deliver more. This leaves no question that next earnings should be a beat but do not take my word on it because who knows what happens tomorrow.\n\n**Influence of Tiktok on Fastly's revenue**\n\nCertainly one of the most important question that needs to be addressed because Tiktok constitutes 12% of the revenues. With the stock dropping like a rock after ER and then earnier today after Donny decided to ban it after 45 days, looks like a lot of the uncertainty is already baked into the price at this moment. Those who were uncertain unboarded the train today. That point is the exhaustion point where bulls come in and drive the stock higher (e.g., Chegg today).\n\n&amp;#x200B;\n\nI personally feel that Tiktok MSFT should be a done deal and they are waiting to announce this sometime this month. I am neither an insider nor do I happen to know the actually outcome. However, I do follow hedge fund option sentiment and I have noticed bullish calls inflow for MSFT this past couple days. While I am a peasant who is not connected to anyone involved with the deal, I am sure some of these whales are aware of the decision, which is part of the reason for that bullish call inflow for MSFT.\n\n&amp;#x200B;\n\n**Should you dump FSLY or not?**\n\nEntirely up to you but I see a lot of growth in this company. Fundamentally, nothing has changed in how they operate. The company gave an upward guidance and that drives the stock in forward direction. Some sellers left the ship because a lot of RH investors have not seen losses in their life or some are not even aware of the potential of this company, except it became a meme stock lately and FOMO drove a lot of noobs in FSLY train.\n\nIt is always better to curtail losses. If you trust that they will continue to bring in revenues, I would dollar cost average on every dip. This ensures your average cost of the share is reduced significantly with any dip. Most fund managers actually add stocks to their funds when the stock is sitting at 30 day MA. Fastly had such a quick run up that the 30 day MA kept moving. All of that being said, I think it may rest for some time before beginning the next leg up. That could be a week, 2 weeks, or a month but you will have to be patient if you do not want to loose money. However, never panik sell on a red day because that is literally the day people like me buy from people who are selling. \n\nWould Monday bring a ray of light and we open green-\n\nNo one knows what happens but I would continue to DCA on every 5% drop. I remember when Square dropped a couple years ago, I kept DCAing and here I am sitting on gains. \n\n&amp;#x200B;\n\nI hope this helped convince some of you.",
        "subreddit": "stocks",
        "title": "Fastly - Some Myths Cleared Here",
        "url": "https://www.reddit.com/r/stocks/comments/i5nb19/fastly_some_myths_cleared_here/",
        "created": 1596867117.0
    },
    {
        "author": "dumpsterfire_account",
        "created_utc": 1598384863,
        "id": "igjkkp",
        "num_comments": 128,
        "num_crossposts": 0,
        "selftext": "Things are based on supply and demand, right? \n\nSo when TSLA and AAPL split, the affordability of their options will go THROUGH THE ROOF. Your inbred cousin from down south will be able to afford an OTM TSLA call that has a reasonable chance of printing. Your teen neighbor will now be able to YOLO his lunch money on AAPL calls. \n\nDon't believe me? These guys from NYU and UIUC wrote a whole THESIS on demand based options pricing [http://faculty.baruch.cuny.edu/lwu/890/DBOP.pdf](http://faculty.baruch.cuny.edu/lwu/890/DBOP.pdf)\n\nI know y'all will be too 'busy' to read that whole thing but let me summarize: LOTS MORE PEOPLE WILL BE ABLE TO AFFORD TSLA OPTIONS NEXT WEEK.... AND THAT WILL PUSH THE PRICE UP. Same goes for AAPL to a lesser extent.\n\n&amp;#x200B;\n\nTSLA $2,500c 1/15/2021\n\nAAPL $600c 1/15/2021\n\nAAPL $500c 1/21/2022",
        "subreddit": "wallstreetbets",
        "title": "Dr. TSLA and Mr. AAPL or How I Learned to Love Demand Based Options Pricing",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/igjkkp/dr_tsla_and_mr_aapl_or_how_i_learned_to_love/",
        "created": 1598413663.0
    },
    {
        "author": "_Flipside_",
        "created_utc": 1598046450,
        "id": "ie62xo",
        "num_comments": 128,
        "num_crossposts": 0,
        "selftext": "I am baffled by the posts on the sub lately. Literally people coming here asking what is a stock without even looking up Google, a dictionary or the FAQ of the sub. Even better, some coming here not knowing what a stock is but having already downloaded RH and bought one.\n\nThat and the countless posts on TSLA and AAPL splits. At least we should have a consolidated thread. The same questions are asked 100 times a day\n\nI am all for being nice and helping new people but this trend lately is concerning...",
        "subreddit": "stocks",
        "title": "The posts on the sub lately...",
        "url": "https://www.reddit.com/r/stocks/comments/ie62xo/the_posts_on_the_sub_lately/",
        "created": 1598075250.0
    },
    {
        "author": "assetdash",
        "created_utc": 1597937903,
        "id": "idcl2u",
        "num_comments": 127,
        "num_crossposts": 0,
        "selftext": "Market Cap Milestones 🏆\n\n• $T reaches **$1B** in **1924**\n\n• $GM reaches **$10B** in **1955**\n\n• $GE reaches **$100B** in **1995**\n\n• $AAPL reaches **$2T** in **2020**\n\n[*Source*](https://assetdash.com/)",
        "subreddit": "stocks",
        "title": "Market Cap Milestones",
        "url": "https://www.reddit.com/r/stocks/comments/idcl2u/market_cap_milestones/",
        "created": 1597966703.0
    },
    {
        "author": "hanudu",
        "created_utc": 1598390328,
        "id": "iglc7x",
        "num_comments": 126,
        "num_crossposts": 0,
        "selftext": "Second only to SPY. \n\nAll the options activity was net bullish and net caused market makers to buy 4.2 million shares of NIO to hedge their positions.\n\nIn case you missed it, stock  was up 19% on &gt;2x adv.\n\n&amp;#x200B;\n\n[NIO](https://preview.redd.it/xhgobd2os7j51.jpg?width=1188&amp;format=pjpg&amp;auto=webp&amp;s=8c7c4d003c16aa638506bc7c2a0c67929047a78f)\n\n&amp;#x200B;\n\nSources:\n\n[volsage.com](https://volsage.com)\n\nfinance.yahoo.com",
        "subreddit": "options",
        "title": "NIO beats AAPL and FB on the option leader-board today",
        "url": "https://www.reddit.com/r/options/comments/iglc7x/nio_beats_aapl_and_fb_on_the_option_leaderboard/",
        "created": 1598419128.0
    },
    {
        "author": "macdncheese",
        "created_utc": 1598080548,
        "id": "iee4u5",
        "num_comments": 123,
        "num_crossposts": 0,
        "selftext": " \n\nWhere to start. I've had some success channel-surfing SPY weeklies. Taking small routine gains each week: a thousand here, a few thousand there. The objective is a 1% gain to the portfolio each session. It's been fun, profitable, and reliable.\n\nThursday rolls around with the unemployment numbers and I'm getting a bear vibe. I know, I know, you don't need to say it. My gut was screaming don't do it.\n\nThat morning, I'd already bagged $3000 from the first spike and drop at the open. Was ready to call it day. At this point, I throw back a couple of beers (it's 10:00 pm in Asia) and start thinking there's gotta be room for some tasty bearish puts today. Just a quick strike, take one ride down the red candle slide, bag some tendies, and get out. Let's roll.\n\nI usually buy 30-50 ATM contracts. Enough of an \"investment\" (wager, if you will) to make some money but not lose my damn shirt if I bet wrong and have to bail.\n\nThis time I decide to yolo in and bought 100 8/21 SPY 337P for just over 10K. I don't quite know why; maybe the booze was making me cocky and greedy. The TA )and my lying gut) suggested the price should pop down quickly, print, and let me out.\n\nInstead, it pops up fast. ffs. I usually don't get caught out like that. Suddenly, I'm down more than I'm comfortable and, against my better judgment, I decided to double down with another 130 contracts for a total of 230 337P 1DTE priced at just over $24,000. \n\nSudden alarming alarm washes over me and I realize I might be in way deeper than I'd like or had planned to be when I sat down to trade. That's simply too much money for one rubbish trade and way outside of my rules for engagement and trading strategy. This was the first time dropping such a large sum; of course, it's not going to work out. Deep down, I already know I'm fucked.\n\nPrice is melting up and digging me a deeper pit of hell from which to escape. At $8000 down and the clock ticking towards 4:00 pm (4:00 am, my time), I get to that point where bailing is going to hurt too much; I decide to ride it out overnight to see if I can get a meltdown on Friday to cash in my 230 0 DTE hail marys. Fuck it, let's diamond hand this shit and see if we can pull and pray that price down a buck to $337.\n\nAs I'm trading from Asia, I have to wait out a super stressful Friday on two hours of sleep from Thursday's shit show. I'm sweating, can't focus, and know I'm in the shit. I sit down around 4:00 pm local to watch the pre-market. \n\nHey, there's movement in the PM! At 7 am, the price has rolled down to a little over 335. Fucking perfect. If I could just sell now, I'd be bagging around 20K according to the options calculator. But we all know where this goes... it's waaaay to early and that price is guaranteed to roll right back up.\n\nFriday morning it melts right up to 338 by the bell. Funny how that works. Unfortunately, no quick dump op at the open. I hang on. \n\nMy unrealized losses are now in the $12,000 range. This is gonna hurt. At about 30 minutes into the session, I had a super short window to sell back to an $8000 loss; instead, I stood my damn ground and decided to wait it out like a fucking clown. \n\nNo pop down, no nothing--just green dojis meandering up the fucking hill for hours...\n\nBy now I'm fucking raging at the WSB bulls yelling \"Tesla this\" and \"Apple that\" at me from my Samsung (not AAPL) tablet... ffs, shut up, I've got my own problems at the moment.\n\nThe day (night for me) wears on. I'm losing hope as the price action of the underlying stonk literally only goes up. Look SPY, I need you to *swoon*, not *moon*!\n\nThis was unreal and completely divorced from the reality of life, Mainstreet, whatever. Wall Street simply does not care about fundamentals, TA, the world burning down, presidential hellfire, anything. Literally it's now all pump with little dump. And to make it worse with each refresh of Reddit, WSB was driving me up the wall going on and on about FAANGS, bears, bulls, 500/2000, Rheeeeee, tendies, tenders, chicken, etc..\n\nAt this point, I'm going down with the ship. I'm squeezing my diamond hands for all they're worth, waiting for a reversal of power-hour, something. Of course, nothing... nothing happens AT ALL, other than the slow creep of SPY taking my tendies $0.01 at a time. I'm now looking at the full loss. This blows.\n\nI mean it really fucking blows. Life-changing, \"I fucked up,\" kinda sucks. By 3:00 pm, I'm fucked. I pray one last time for power-hour to dump hard, knowing, of course, that it won't. I finally bail at 3:40 pm, selling off my 230 contracts at 0.03. Not good times. I had to tell Jesus himself in a variety of ways that I was not impressed.\n\nI lost the $24,000 and had to call my wife today to explain it to her... it's embarrassing, depressing, humiliating, etc. Well, I had to explain it to her boyfriend who explained it her as she was \"busy at the moment.\" To make it worse, Chad said he was \"disappointed in me.\"\n\nI'll fight another day, but this one fucking bites. It's all on me, this is my bad. I'll take it like a man (or bear) but got damn if I ever bet against the WSB bois and bulls in this market. Bears really are fuk--well, maybe not next week... but I'm not taking that bet.\n\ntl;dr: it was a bad idea to yolo into 230 contracts of 08/21 SPY 337P; lost mucho tendies",
        "subreddit": "wallstreetbets",
        "title": "Went Full Bear; Paid Full Price",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iee4u5/went_full_bear_paid_full_price/",
        "created": 1598109348.0
    },
    {
        "author": "KnownGene6",
        "created_utc": 1598588770,
        "id": "ii0j67",
        "num_comments": 122,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "The stock market is my casino almost made enough for a lambo #tesla #apple",
        "url": "https://i.redd.it/mzcmpp2n7oj51.jpg",
        "created": 1598617570.0
    },
    {
        "author": "kg9936",
        "created_utc": 1598276933,
        "id": "ifpbrz",
        "num_comments": 121,
        "num_crossposts": 0,
        "selftext": "TSLA, AAPL, and RKT have been a god send. Trying to figure out the best time to sell so I don't get the rug pulled out from under me or get crushed by Theta.\n\nPositions:\n\nAAPL 485c 9/18\n\nAAPL 500c 9/18\n\nRKT 30c 12/18\n\nRKT 30c 3/19/2021\n\nRKT 30c 12/17/2021\n\nhttps://preview.redd.it/0mvxv0ldgyi51.png?width=702&amp;format=png&amp;auto=webp&amp;s=25eff0011f7e77dfc438c0ee375acd122c5bfca8",
        "subreddit": "wallstreetbets",
        "title": "Back from the fucking DEAD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ifpbrz/back_from_the_fucking_dead/",
        "created": 1598305733.0
    },
    {
        "author": "bumblebear3012",
        "created_utc": 1598717955,
        "id": "iiv6om",
        "num_comments": 121,
        "num_crossposts": 0,
        "selftext": "From 2010 to 2019, not a single stock in the S&amp;P 500 performed better than Netflix did. Today, the company counts nearly 200 million subscribers across its global streaming platform. At any one time, Netflix accounts for 12-15% of all global internet traffic. And its market cap of $231bn makes Netflix more valuable than Bank of America, AT&amp;T, or Comcast. If you invested $1,000 in the Netflix IPO in 2002, those shares would now be worth $437,888 for a total return of 43,688% – or annualized returns of 39.51% over the past 18 years. \n\nBut if it weren’t for a bad pitch to Blockbuster, Netflix may have never started the streaming revolution. Did you know that Netflix was originally called Kibble? That Walmart was once the biggest threat to its business? Or that the company nearly launched a “Netflix Box” to download shows instead of offering a fully on-demand streaming service? In the latest featured flashback, we profile how Netflix went from just another dot-com to category inventor, with quite a few ups and downs in between. \n\n**The Amazon.com of “Something”**\n\n* Early legend had it that Netflix CEO and co-founder Reed Hastings got the idea for Netflix after Blockbuster charged him a $40 late fee for Apollo 13. He has since conceded that he told that story to encapsulate the Netflix ethos and business model. The more widely accepted version is that both Hastings and co-founder Marc Randolph both greatly admired Amazon and wanted to replicate their success by becoming the next Amazon.com of “something”. \n* In 1997, DVD players were still uncommon and could cost upwards of $700, making them an expensive upgrade over the mainstay VCR. Originally, the duo considered a VHS mail-in service but ultimately decided that shipping video cassettes would be too costly. When they test-mailed a CD to their homes and it arrived in the same condition, they thought they were onto something. \n* After securing funding (including $25,000 from Randolph’s mother), Netflix opened its first distribution center in San Jose in 1998. Back then, the business model was to charge $4 per rental plus $2 for postage. They only had a skeleton staff and fewer than 1000 titles among their collection. But that didn’t prevent Jeff Bezos from making an offer for Netflix to spur Amazon’s entry into the movie rental business. \n* The company rejected the offer but continued to struggle financially before moving to a subscription model in late 1999. Netflix figured that overnight delivery was possible from San Jose throughout the Bay Area, and local consumers were quick to sign up for a flat rate fee in exchange for unlimited movie rentals. That year, Netflix also signed revenue-sharing agreements with several major studios. \n\n**Dot Com Bubble Burst and Near Collapse**\n\n* Although by 2000 Netflix now counted about 300,000 subscribers, the company was burning through an unsustainable rate of cash - $50 million that year alone. To draw in new subscribers, they offered generous deals and free trials. And the combination of only $20 monthly subscriptions for unlimited DVD rentals with a reliance on the US Postal Service meant that the company didn’t have much promise of improving its cash flow. \n* Plans to go public were scrapped when the dot com bubble burst. On top of that, the tech collapse caused venture capital money to dry up throughout the Valley. Unlike during the two or three previous years, investors were no longer willing to back dot com companies that had yet to turn a profit. According to an account from Randolph, Netflix thought the best option to stay in operation was to try and sell part of the company to Blockbuster – the dominant player in the rental market that had 7,700 retail locations at the time. \n* In early 2000, Hastings and Randolph flew to Dallas to meet with Blockbuster. Netflix wanted to maintain its independence by offering a 49% stake but agreed to take on the name Blockbuster.com. The idea was that Netflix would become the online division of Blockbuster. When Blockbuster asked how much it would cost for the whole company, Hastings replied “$50mn”. Not only did Blockbuster decline the arrangement, Randolph noted that Blockbuster CEO John Antioco [struggled not to laugh](https://www.vanityfair.com/news/2019/09/netflixs-crazy-doomed-meeting-with-blockbuster) when Hastings named his price. Instead, Blockbuster signed a 20-year video-on-demand agreement with Enron Broadband Services. \n* Soon after this, though, DVD sales began to gain major traction and the cost of mass-producing DVDs fell to $1 per unit. On the back of the rise in DVD players, Netflix more than doubled its customer base to 750,000 towards the end of 2002. Even still, many had doubts about the future of the company and its shares hovered around pre-split levels of $6 ($0.42 on a split-adjusted basis at today’s float). Wall Street even likened Netflix to infamous dot-com failures such as Kozmo or Webvan. \n\n**Enter Walmart, then Blockbuster**\n\n* Despite Wall Street’s skepticism, Walmart became intrigued by the success of Netflix and launched an identical service in early 2003. Not only did Walmart undercut Netflix’s $19.95/month subscription with a rate of $18.86, they rivaled Netflix on selection. Hastings reacted to Walmart’s entry by saying he was “glad” and that it “will benefit Netflix.” Numerous attempts to keep undercutting Netflix on price didn’t work, and Hasting’s suggestion that Walmart’s presence in the rental market would help Netflix actually proved to be true. \n* With DVDs now becoming a popular mode of watching entertainment, the major obstacle preventing subscriber growth was convincing people to rent DVDs online. The entrances of Walmart in 2003 and Blockbuster in 2004 into the market greatly enhanced public understanding of the subscription-based DVD rental model. In fact, marketing by Walmart and Blockbuster had a knock-on effect for Netflix. \n* With lower competitor prices and similar libraries, one of the key advantages for Netflix was its algorithm-driven recommendation feature. Prior to Netflix, box-office hits received the vast majority of rental revenues as it was difficult for consumers to learn about less well-known movies. At the time, 80% of Netflix rentals came from 2,000 titles – completely inverting the previous model of brick-and-mortar rental. \n* The success of Netflix in promoting a wider range of films made the platform extremely popular with studios as a marketing vehicle and alternative mode of movie advertising versus traditional media. Blockbuster had also been sitting on a mountain of rental data, but unlike Netflix, they never utilized it to build out their online service. Eventually Walmart abandoned online DVD rentals in 2005 and even struck a deal to convert its subscribers to Netflix in exchange for Netflix promoting Walmart’s in-store DVDs for purchase.\n\n**The Start of Streaming** \n\n* In 2002, it cost $30 in bandwidth to download a DVD-quality movie online. But by the mid-2000s, internet speeds were now fast enough that it became feasible to think about sending content digitally. In 2005, the company thought the best way forward was to sell a “Netflix Box” that customers could download movies to then be able to watch them the next day. The product was about ready to launch when some began having second thoughts. Around this time YouTube was experiencing incredible success and growth. Rather than restrict Netflix streaming to a specific hardware device, the company decided to make its new web-based on-demand service hardware-agnostic. \n* Netflix began streaming its movies and TV shows directly to subscribers’ devices in 2007 – more or less ending the rental wars that began at the start of the decade. At the end of that year, Netflix had 7.5 million subscribers, marking 24x growth in its user base in just over seven years. While Amazon also launched a streaming service that year, Netflix enjoyed a dominant market share at 91%. A few years later in 2010, Blockbuster had filed for bankruptcy protection and Netflix shares were hitting all-time highs. \n* Even after the exit of Blockbuster and its near monopoly on streaming for a time, Netflix experienced a couple of growing pains that caused analysts to question its future on more than one occasion. The most notable of these occurred in 2011 when the company decided to split its DVD rental and streaming plans while it was still mailing 14 million DVDs to customers. The result was that customers who wanted streaming and DVD rental had to pay 60% more per month than before. When the company announced it had lost 800,000 subscribers in its Q3 FY11 earnings report due to the move, shares plunged 35%. Shares had reached a pre-adjusted split high of nearly $300 that summer before falling to $78 in October.\n\n**Original Content, International Expansion, and Media Giant** \n\n* Over the next few years, though, Netflix began significantly investing in original content and moving its platform into new markets. From 2011 to 2015, Netflix expanded into Canada and Europe, across Latin America, and began to gain a foothold in Asia. However, perhaps just as important to the new leg of growth was the start of original content in 2013 with the launch of “House of Cards”. While the move into original content required major capital investments by Netflix, it also reduced licensing fees and furthered the value proposition for the platform as some of its shows gained critical acclaim. \n* The dual strategy led to Netflix growing subscribers from 70.8 million in 2015 to 167.1 million in 2019 (63.5% of whom were international-based). In 2017, US-based Netflix subscribers equaled the combined number of cable subscribers for the first time. And in 2019, 6 of the top 10 streamed television shows in the US were Netflix original content. With Disney, Comcast, AT&amp;T, Apple, and others pushing heavily into streaming with a combination of high-value content and deep pockets, it remains to be seen who will ultimately win the streaming wars. But there is no doubting the immense success Netflix has achieved in reinventing how we consume entertainment, and their shareholders have been rewarded greatly. \n\n*You can also find me on Twitter* [*@BlackjacketCo*](https://twitter.com/BlackjacketCo) *where I write about emerging technologies and long-term market trends. Thanks so much for reading!*",
        "subreddit": "stocks",
        "title": "Netflix: The Story Behind the Rise of an Internet Media Giant",
        "url": "https://www.reddit.com/r/stocks/comments/iiv6om/netflix_the_story_behind_the_rise_of_an_internet/",
        "created": 1598746755.0
    },
    {
        "author": "jonamon5",
        "created_utc": 1598308377,
        "id": "ifzjul",
        "num_comments": 121,
        "num_crossposts": 0,
        "selftext": "All in the title boys! Started in late February and road the rona crash til mid April. Kinda fucked up in the middle cuz I was still listening to seperationvariation so.....anyways, saw all the tendies being made by bulls and deciding to fuck it and go all in calls. Switched to tech leaps and riding out mostly MSFT and AAPL currently. \n\n[https://imgur.com/gallery/wZr8a93](https://imgur.com/gallery/wZr8a93)",
        "subreddit": "wallstreetbets",
        "title": "1K to 38K in 6 months!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ifzjul/1k_to_38k_in_6_months/",
        "created": 1598337177.0
    },
    {
        "author": "Dr_90210",
        "created_utc": 1596370869,
        "id": "i2b6aw",
        "num_comments": 120,
        "num_crossposts": 0,
        "selftext": "Last week I lost about 1k on two bad contracts. I was wondering could anybody recommend some plays? I was thinking about INO or Apple calls.",
        "subreddit": "options",
        "title": "Any advice for the upcoming week",
        "url": "https://www.reddit.com/r/options/comments/i2b6aw/any_advice_for_the_upcoming_week/",
        "created": 1596399669.0
    },
    {
        "author": "roflcopter75",
        "created_utc": 1598216330,
        "id": "ifb5cz",
        "num_comments": 117,
        "num_crossposts": 0,
        "selftext": "I’ve got a few contracts set to expire 9/11 @ 490.  How many other people are holding?\n\nNot sure how much gas we got left but I’m at least moderately confident we’re crossing 500 this week.  Hype train can’t last forever but lord let me get one more week 🙏.",
        "subreddit": "wallstreetbets",
        "title": "AAPL Calls",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ifb5cz/aapl_calls/",
        "created": 1598245130.0
    },
    {
        "author": "xerxes7777",
        "created_utc": 1598023042,
        "id": "idymbq",
        "num_comments": 117,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "RobinHoodPennyStocks",
        "title": "Took a break from Penny's for Apple and it is flinging me up ahead of split.",
        "url": "https://i.redd.it/lyvb1p45hdi51.jpg",
        "created": 1598051842.0
    },
    {
        "author": "tradeind27",
        "created_utc": 1598054012,
        "id": "ie87p8",
        "num_comments": 117,
        "num_crossposts": 0,
        "selftext": "Missed easy pick $AAPL , Missed the autists $TSLA  , Missed the $SLV love &amp; literally shit stocks like $CMG  . I fucking played safe even in my 401k by having stocks 20% , Bonds 80% . \n\nStarted shorting things in June and stopped doing that in 3 weeks after getting kick in the ass. \n\n&amp;#x200B;\n\nAfter seeing insane gains of everybody &amp; missing this 1 time life opportunity, literally feeling sad each day :(",
        "subreddit": "wallstreetbets",
        "title": "Am I the only one here who missed the rally since last 3 months",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ie87p8/am_i_the_only_one_here_who_missed_the_rally_since/",
        "created": 1598082812.0
    },
    {
        "author": "herpderpington712",
        "created_utc": 1596553283,
        "id": "i3kuxk",
        "num_comments": 115,
        "num_crossposts": 0,
        "selftext": "Listen up fuckers.\n\n\nI’m not ludicrously experienced with options, but I can recognize some bullshit when I see it. This arcticle [(Intel ‘Stunning Failure’ Heralds End of an Era for U.S. Chip Sector)](https://finance.yahoo.com/news/intel-stunning-failure-heralds-end-030711424.html) and a bunch of other 🌈🐻 news caused $INTC to drop off the face of the earth last week. \n\n\nI kinda fail to see the drama. Intel has always outsourced it's chips. Maybe it's doing it more now, but even 8 years ago when my brother and I built our first PC's. His chip was from Mexico, mine was from Taiwan. \n\n\nFurthermore, TSMC, the company this article says Intel should sell factories to, has been the heavyweight chip maker for a decade or more.\n\n\nNvidia and AMD for example, they are the two graphics card manufacturers. BOTH of them have their chips made by TSMC. These companies do all their designing, but in the end everything is made by TSMC anyway. At least, a lions share of it.\n\n\nNow, Intel definitely has struggled in the recent market, but that's because they've demolished AMD in the performance chip market for nearly two decades. There was no reason to keep pushing their envelope, spending billions on R&amp;D for a better product. All they had to do was refine their Lake series processors and they'd continue to rake in a ton of profit. This profit was used to expand their market to the mobile industry. Particularly laptops. For a long time it was hard to get an apple product with any kind of processor that wasn't Intel.\n\n\nThey're not going away. They're not crashing.\n\n\nThey're just finally seeing AMD pass them in one market. This has caused other markets to start to shift due to uncertainty about who the \"best\" chip manufacturer is, but trust me - we will see Intel back with a fiery vengeance.\n\n\nI wouldn't be surprised if Intel pops out some high core count chips that are pushing 5.0-5.5 all core clock count speeds. Once they scale down their transistor size... Oof. It's going to be a Rottweiler back in the pit. \n\n\n\nTL;DR INTC $55c 09/18, but load up on whatever the hell you want, these contracts are CHEAP",
        "subreddit": "wallstreetbets",
        "title": "INTC BUY BUY BUY",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i3kuxk/intc_buy_buy_buy/",
        "created": 1596582083.0
    },
    {
        "author": "FreshTatarSauce",
        "created_utc": 1598834816,
        "id": "ijo98s",
        "num_comments": 114,
        "num_crossposts": 0,
        "selftext": "#**Introduction**\n\nHey all, it's ya boy Tatar back with the 2nd episode of my option series. If you missed last week, got check out last weeks as this weeks topic builds on it. You can find it [here.](https://www.reddit.com/r/wallstreetbets/comments/iewqhw/options_101_episode_1_an_introduction_to_the/)\n\nLets dive right in.\n\n#**What is a vertical spread?**\n\nA vertical spread is the simultaneous purchase and selling of an options contract of the same type, same expiration date, but different strike prices. If you are familiar with what a spread is, continue to the next section. I'm going to keep it basic for all the kiddos in the back.\n\nThere are four different types of vertical spreads: 1) Call Credit Spreads 2) Call Debit Spreads 3) Put Credit Spreads and 4) Put Debit Spreads\n\nLets look at an example of each with a ticker, XYZ that is trending at $50.\n\nA call credit spread would be selling a call contract that is closer to being ITM, and purchasing one farther OTM. Example: selling the $52 contract and purchasing the $55. You will receive a premium for this trade that will decay with time, lets call it $100. With this play, you want the price of XYZ to stay under $52 so you collect the full premium. Your max loss is the distance in the spread minus premium earned ($300 - $100) and max gain is the premium earned ($100). You will need to put up the collateral to cover your max loss.\n\nA call debit spread would be the opposite of above: purchasing the $52 call and selling the $55. You will pay a premium for this play, so you will not need to put up any collateral for this play. Lets keep consistent with the above example and say you paid $100 for this play. Your max loss is $100, max gain would be the distance of the spread minus premium payed ($300 - $100).\n\nA put credit spread would be selling a put contract that is closer to being ITM, and purchasing one farther OTM. Example: selling the $48 contract and purchasing the $45. You will receive a premium for this trade that will decay with time, lets call it $100. With this play, you want the price of XYZ to stay above $48 so you collect the full premium. Your max loss is the distance in the spread minus premium earned ($300 - $100) and max gain is the premium earned ($100). You will need to put up the collateral to cover your max loss.\n\nA put debit spread would be the opposite of above: purchasing the $48 put and selling the $45. You will pay a premium for this play, so you will not need to put up any collateral for this play. Lets keep consistent with the above example and say you paid $100 for this play. Your max loss is $100, max gain would be the distance of the spread minus premium payed ($300 - $100).\n\nIf you need a further explanation, checkout the Investopedia page [here.](https://www.investopedia.com/terms/v/verticalspread.asp)\n\n#**Vertical Spreads vs Naked Options: Greeks Analysis**\n\n**TLDR: Compared to naked calls, spreads experience less time decay, less movement when the underlying moves, and are much more affordable for longer time frames**\n\nThe basic premise behind understanding how that works is to understand the greeks. Basically, what you do is take the long option greeks and subtract the short option greeks and that will give you the greeks values for the play.\n\nI screencapped a couple options this past week for SPY and will use them to illustrate what I mean. For this example, lets look at a call debit spread.\n\nPurchase: SPY 350c and sell SPY 353c\n\n          350c          353c          Total\nPrice     3.16          -1.82         1.34\nDelta      .47          -.33           .14\nGamma      .04          -.04           ~0\nTheta     -.21           .19          -.02\nVega       .2           -.18           .02\n\nAs we can see, the spread gives us an entirely different greeks profile than if we bought the 350c naked.\n\nSo, lets get into the pros and cons of these type of spreads when comparing them to their naked conuterpart.\n\n#**Pros:**\n\n1) **Each play is cheaper.** This will allow you to either buy more contracts of the same play, or buy more expensive contracts.\n\n2) **The price moves against you slower.** Since gamma and delta are neutralized, the underlying moving against you will have less impact on the play. \n\n3) **Time decay is lessened.** There will still be time decay as long as both legs are OTM, but it is drastically reduced. In the example above, the spread time decay is 10% what the naked 350c is.\n\n4) **Theta works FOR you when both legs are ITM.** Keep in mind that this will be a slow burn, and most will close out their spread when it gets here, but some times it might be worth holding the spread and letting time decay work in your favor.\n\n5) **You can purchase contracts with longer expiration dates.** Since these contracts can be very expensive, this can open up some plays to a smaller account that they might not have been able to afford before.\n\n6) **Easier to cut your losses.** Since the spread takes longer to move against you due to decreased delta and theta, you have more time to wait and think about closing it out for a smaller loss.\n \n#**Cons:**\n\n1) **You won't be able to earn the full profit until expiration day.** This is due to the fact that each contract will have extrinsic value that gets lessened as the contracts get close to expiry.\n\n2) **You limit your upside.** This can't be ignored, since you are selling an option, any price movement beyond that option doesn't offer any more intrinsic value to the spread. However, since we can often buy more spreads, this can actually benefit us. I'll get into that below.\n\n3) **Getting fills is harder.** If you are trying to make a play on an illiquid option, or want to get a bargain on your limit price, it might take a while to get filled, if at all. This can be counteracted by legging into a spread, which I will get into later.\n\n#**Calculating max profit compared to just buying a naked option**\n\nI expect a lot of you retards to scoff at the idea of limiting your gains, but pump the breaks before going full retard.\n\nWhen I purchase a spread, my goal is to purchase 3 spreads for the price of 1 naked option. Sometimes it's 2:1, but with each additional spread you purchase you have the opportunity for increased gains.\n\nUsing the example of SPY above, 1 naked option of 350c would cost $316. A 350c/353c spread costs $134, so you could purchase 2 spreads for $268. \n\nIf SPY goes to 353, the spreads will yield $300 more profit than the naked option.\n\nYour breakeven would be $356, with both plays being worth the same at that point.\n\nYou are limiting your upside only if the underlying goes above $356.\n\nSo while it is a fair criticism to talk about limiting upside risk, most of the time our plays would benefit from purchasing spreads instead. Especially the closer to expiry we purchase.\n\n#**Tips:**\n\nSo I am still tweaking my personal strategy, but here are a few things I've learned so far that might be helpful:\n\n1) Purchasing spreads &lt; 45 DTE. I found that purchasing options beyond that yields much slower gains, and I find myself closing them out for smaller profit to free up the capital. If you want to buy a leap, just buy the leap naked.\n\n2) Legging into a spread. What I like to do sometimes is purchase a call with the intention of selling the other leg of the spread at a later time. This can be tricky to pull off sometimes, but having this tool in your toolbox gives you more options.\n\n3) CUT YOUR DAMN LOSSES. Since spreads take longer to move against you, cutting your losses yields less overall loss than naked options. \n\n4) Buy multiple spreads of the same play. This adds a multiplier effect to your gains, and IMO is the best way to take advantage of spreads compared to naked options.\n\nPositions: AAPL 560/580 debit spread, rest cash",
        "subreddit": "wallstreetbets",
        "title": "Options 101 Episode 2: Leveling Up To The Vertical Spread And Analysis Of The Greeks",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ijo98s/options_101_episode_2_leveling_up_to_the_vertical/",
        "created": 1598863616.0
    },
    {
        "author": "daynightcase",
        "created_utc": 1598037112,
        "id": "ie35qw",
        "num_comments": 110,
        "num_crossposts": 0,
        "selftext": "Beside the stock split, which fundamentally adds no value to the company yet it added half a trillion $ to its valuation. What is driving this insane rally?\n\nAMZN +73%\n\nAAPL +70%\n\nMSFT +30%\n\ntheoretically MSFT, AMZN and all the software service companies would be the most beneficiary in the last 6 month because of the COVID. However, AAPL actually doubled in valuation. Their revenue hasn't grown to justify this price levels, so what gives? AAPL isn't a meme stock like TSLA, so i am genuinely surprised. Is Apple overvalued or AMZN and MSFT undervalued?",
        "subreddit": "investing",
        "title": "Apple ($AAPL) surge (up 70% YTD)",
        "url": "https://www.reddit.com/r/investing/comments/ie35qw/apple_aapl_surge_up_70_ytd/",
        "created": 1598065912.0
    },
    {
        "author": "dsdd1373",
        "created_utc": 1597979155,
        "id": "idovcr",
        "num_comments": 110,
        "num_crossposts": 0,
        "selftext": "Smh, came to this subreddit for good advice for stock trading, made great fucking money on tesla calls then lost all of it on purple calls. Fuck everyone on this subreddit. Fuck elon, fuck prpl, fuck robinhood!! \n\n\nOk now that I let out my anger, I just got a small personal loan for apple calls, se yall at the top!",
        "subreddit": "wallstreetbets",
        "title": "Lost all my money, f all yall",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/idovcr/lost_all_my_money_f_all_yall/",
        "created": 1598007955.0
    },
    {
        "author": "FinndBors",
        "created_utc": 1598213094,
        "id": "ifa5hs",
        "num_comments": 110,
        "num_crossposts": 0,
        "selftext": "\nI've posted bits and pieces of this in some comments since some form of the question has come up on this subreddit. I want to list out a list of reasons why today is like the dot com times and ALSO what is different about today. I am not a financial professional, but I have been working in the tech industry for over 20 years. It is mostly tech stock focused.\n\nI'm going to also add (fact) or (anecdotal) or (opinion) to my bullet points, so take those bullet points with the appropriate grain of salt.\n\nReasons we are NOT like the dot-com boom (roughly in order of importance):\n\n* (fact) Interest rates are much lower now and long term expectations on yield is also low. In 1999, the 10 year treasury was at around 5% and rose to over 6.5% in 2000. The P/E of the S&amp;P 500 in 2000 was around 30. Which means that the 10 year treasury yielded MORE than the S&amp;P 500 earnings. This is absolutely not true today with the 10 year treasury yield being around 0.6% and P/Es being around 25-30. This single point is extremely important to understand.\n* (fact) Late stage VCs are more of a thing now than they were in dot com. Thus you have fewer IPOs and the companies that do are more mature and less speculative (of course there are outliers, see below).\n* (fact) The NASDAQ P/E in 2000 was really quite ridiculous (I can't find a chart for some reason, i think it was around 80). S&amp;P 500 was more comparable between 2000 and now.\n* (anecdotes) You can no longer get a job at a startup / real tech firm just because you know HTML or can write \"hello world\" in Perl. A lot of firms back in the late 90's were trying to fatten up the employee count and race to IPO to cash out. This doesn't happen today.\n* (fact) There was no pandemic in 2000 and it makes comparisons hard.\n\nReasons we are like the dot-com boom (roughly in order of importance)\n\n* (anecdotes) Sentiment on the ground is very similar to what you hear during the dot com boom. We make fun of the people who invest in stupid shit like NKLA, HTZ, etc. But a lot of people are creaming their pants still on the big tech (FAMANG) saying they are forever-holds / they can't go down, etc. You also now are starting to see intelligent, rational people putting money in things **precisely** because other people will and assume they can get out before it all falls apart.\n* (fact) In the late 90s, internet brokers were a new thing and made trading easier for people who didn't know anything -- and we see that today with COVID stay-at-homers and an influx of users into robinhood (I wish I could get hard numbers on the comparison). (opinion) Because of this, I'm fairly certain pricing is out of whack for a large number of companies.\n* (fact) The P/E ratios of the big techs today are higher than a lot of the big techs during 2000. Nasdaq P/E in 2000 was off the chart, but if you just look at the big profitable companies like INTC, ORCL, AAPL, HPQ, IBM, which were the equivalent of FAMANG today, they had P/Es mostly under 30s. FAMANG are around 35 except for Netflix and Amazon which are much higher (see huge caveat on interest rates above). CSCO and MSFT in 2000 were the outliers having P/Es of well over 60.\n* (anecdotes) In tech companies, a common business plan for new firms in the last ~8 years is to get market share at any cost and figure out profitability later. This is really no different from dot com when firms were valued by number of \"eyeballs\".\n* (opinion) \"this time is different\". At least in terms of technology, it's not. The internet itself was a bigger \"paradigm shift\" than what we are seeing today. I used \"paradigm shift\", because was a common buzzword that turned into a joke back in the late 90s and used to justify crazy valuations. Machine Learning is amazing, but not on par with connecting everyone on the globe. And the cloud is just a fancy name for running something on someone else's computer (even though its quite nice how easy and seamless it is today vs. 20 years ago).\n* (anecdotes) While it is harder to IPO today without profitability or clear path to profitability, it clearly still happens (UBER, LYFT, SNAP). And others are using backdoor IPOs (NKLA, SPCE).\n* (fact) In 2000, the IT sector along with Media stocks and the Telecommunications Services sector approached 40% of the S&amp;P market cap. The categories have changed but if you combine IT and Communication Services sectors, you get a 38% of S&amp;P market cap today. If you add Amazon which is not included in IT/Communication, you get over 40%. Does this mean anything, especially since we are in a pandemic and more stuff runs on IT? Not sure.\n\nYou can definitely pick apart some of the individual points, I just wanted to lay them all out and see what people thought and if anyone has other valid comparisons. I personally think we ARE in some kind of tech bubble, but I'm not going to make a fool of myself in predictions on when and how it will burst. And fuck it, while I do have more in cash than typical, I'm still in VTI/VXUS and a bunch of individual tech names since I have the background to do some analysis on the business.\n\nI'll end with a few random thoughts:\n\n* In August 1999, a lot of people were looking at the craziness of the dot com boom and how people were throwing money at stupid shit. I don't care what people say, it was pretty obvious something was wrong. If you shorted the NASDAQ then, you will watch the NASDAQ more than double in 7 months time and have your face ripped off.\n* Taking what I've posted as a whole, the one thing to be terrified about is if long term interest rates rise and the fed is either powerless or does not step in for whatever reason. This will completely destroy the stock and bond market. I don't see the catalyst for it, but I'm no economic genius. You might be able to make an argument that gold is a hedge for this unlikely scenario. There is also the worry of a slump in earnings due to general economic malaise, but that is a garden variety concern that everyone is watching for and usually pretty temporary. Rise in interest rates would be real bad.",
        "subreddit": "investing",
        "title": "Differences and similarities between 2000 and now.",
        "url": "https://www.reddit.com/r/investing/comments/ifa5hs/differences_and_similarities_between_2000_and_now/",
        "created": 1598241894.0
    },
    {
        "author": "abmuld",
        "created_utc": 1598149399,
        "id": "ieved0",
        "num_comments": 108,
        "num_crossposts": 0,
        "selftext": "alright retards daddy Tim Apple is going to take us to Mars\n\nApple took 42 years to reach 1 trillion, and 2 years to reach 2 trillion. Based on common sense Apple will reach 3 trillion at the same ratio: \n\n2 years : 42 years as X years : 2 years \n\n= .095 years \n\n.095 x 365 days = 34.675 days until Apple reaches 3 trillion\n\nAll logic points to all my savings on 700c 9/18 don’t miss out",
        "subreddit": "wallstreetbets",
        "title": "AAPL TO THE MOON (PROVEN WITH LOGIC AND FACTS)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ieved0/aapl_to_the_moon_proven_with_logic_and_facts/",
        "created": 1598178199.0
    },
    {
        "author": "bottlecapman2",
        "created_utc": 1596325255,
        "id": "i22aez",
        "num_comments": 108,
        "num_crossposts": 0,
        "selftext": "I see young adults on here posting about buying dividend growth stocks so they can live on the income during retirement two or three or more decades down the road. Is this really a smart approach?\n\nAren’t today’s well established, high growth, low-to-no dividend payout companies likely to be tomorrow’s dividend growth companies? And in the meantime, you’ve gotten a better total return and no taxation?\n\nI feel like, just by loading up on Microsoft, Apple, Visa, and Mastercard today (all of which do pay a (low yield) dividend), you’ve got a good chance of having a very nice dividend income stream in twenty years.",
        "subreddit": "investing",
        "title": "Dividend growth investing for young people",
        "url": "https://www.reddit.com/r/investing/comments/i22aez/dividend_growth_investing_for_young_people/",
        "created": 1596354055.0
    },
    {
        "author": "fjs8",
        "created_utc": 1598409032,
        "id": "igqjho",
        "num_comments": 108,
        "num_crossposts": 0,
        "selftext": "Just curious of the ages of most of the investors/traders on here. I'm 22 myself. Would be great if a mean age is also known. \n\nIf it matters, my portfolio is AAPL, DIS, BA, MGM, SQ, UAL",
        "subreddit": "stocks",
        "title": "Ages of investors on here?",
        "url": "https://www.reddit.com/r/stocks/comments/igqjho/ages_of_investors_on_here/",
        "created": 1598437832.0
    },
    {
        "author": "MajinJuuu",
        "created_utc": 1596383004,
        "id": "i2e43l",
        "num_comments": 107,
        "num_crossposts": 0,
        "selftext": "Planning on dropping $6500 into AAPL tomorrow. To do that, I will be cutting my V and MSFT by a bit, the rest is cash already on hand.\n\nMy financial manager is in the midst of talking me out of it as he believes AAPL isnt a good investment at the moment, being at its ATH and now the most valuable company on earth.\n\nCould use some thoughts on this.",
        "subreddit": "stocks",
        "title": "AAPL Tomorrow",
        "url": "https://www.reddit.com/r/stocks/comments/i2e43l/aapl_tomorrow/",
        "created": 1596411804.0
    },
    {
        "author": "starwarscapital",
        "created_utc": 1598405275,
        "id": "igpk69",
        "num_comments": 107,
        "num_crossposts": 0,
        "selftext": "Hello and welcome. If you read my forecast over the weekend, you would have accurately timed the rotation from Tesla and Apple into Facebook and Amazon. \n\nNow we are going to discuss rotating back into Tesla and Apple although I expect some more momentum into Facebook as well. \n\nAmazon's momentum is fucking slow until Bezos split's that shit so I don't really use spend much energy trying to forecast that.\n\nMy forecast for Apple is about $127.85-$130 opening on the split day and rocketing that week to mid 30s even flirting with 140 intraday but coming down to mid 130s. After which it will grind sideways for a bit and fight for $150 over October and November.\n\nAs for Tesla, I do not see Tesla going much over $2100 this week. I will literally liquidate everything and buy puts on you retards in order for Tesla to open at $420 on Monday. After the split, I expect it to rocket to \\~$500 followed by a sell off after battery day but I don't know how much.\n\nFeel free to look into your crystal ball and share what it's saying to you in this thread.",
        "subreddit": "wallstreetbets",
        "title": "Apple &amp; Tesla Post-Split Discussion &amp; Forecast",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/igpk69/apple_tesla_postsplit_discussion_forecast/",
        "created": 1598434075.0
    },
    {
        "author": "Tripper1",
        "created_utc": 1598717254,
        "id": "iiuz9k",
        "num_comments": 105,
        "num_crossposts": 0,
        "selftext": "Normally I wouldn't buy stocks after ATH like these two company's have but the market isn't exactly doing normal things anymore. I sold options this week for nice gains but now have enough liquidity to buy a few shares of both AAPL and TSLA. \n\n The question is should I wait for a dip to get the shares I want or take advantage of the split dropping the price to buy in before it keeps going up to a point I can't afford?",
        "subreddit": "smallstreetbets",
        "title": "Buying TSLA and AAPL after split?",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/iiuz9k/buying_tsla_and_aapl_after_split/",
        "created": 1598746054.0
    },
    {
        "author": "rs5-",
        "created_utc": 1596553149,
        "id": "i3ktgl",
        "num_comments": 104,
        "num_crossposts": 0,
        "selftext": "Hey yall was looking to put more money in the game. I was wondering if you guys have any suggestions. I hope you all don’t mind me asking/isn’t too low effort \n\nI currently own is there anything you recommend adding? Thank you so much \n\nApple \nMicrosoft \nFacebook \nVery very small portions of ual, luv, ccl \nUso \nNvda \nDocu \nVisa \nPaypal \nJpm \nDis \nLmt\nJnj \nTdoc",
        "subreddit": "stocks",
        "title": "Favourite growth stock?",
        "url": "https://www.reddit.com/r/stocks/comments/i3ktgl/favourite_growth_stock/",
        "created": 1596581949.0
    },
    {
        "author": "MrMineHeads",
        "created_utc": 1598658195,
        "id": "iii8hb",
        "num_comments": 103,
        "num_crossposts": 0,
        "selftext": "Let's get this straight: the price of a stock is not random\\*. The price is (theoretically) all future earnings of a company discounted at some rate (depending on the risk of the stock) to the present day. What this means is that in order for you to rationally price a stock, you first want to see what money it will deliver to you in the future, and how likely it is to deliver that money. The more earnings and/or the more likely it is to achieve those earnings, the higher the price. So, to price a stock, you form your expectations about all future earnings and discount them depending on the risk of the stock to today's money, and now you can rationally decide if a stock is a buy or sell or even short. This whole thing is called the Discounted Cash Flow Model.\n\nNow, this is the essence of this post: a change in expectations about future earnings, or a change in the discount rate are the only things that change investor sentiment about a stock. It is not how it has historically performed nor about its current situation. It is always how do investors feel about the future of the company.\n\nA lot of people on this sub like that point out the history of a stock to jusifity going long, or the fact that the company is projected to make a lot of money or that it currently does. The reality is that all of that is reflected in the price of the stock. You can use historical earnings to project future earnings, but that is all, and those future earnings are already reflected in the stock's price. Only a change in expectations or the risk of a company meeting expectations influence the price of the stock. This ultimately means only future events can change the price of the stock, and unless you can predict the future, for all intents and purposes, the price of a stock today is right.\n\nHere's a consequence of this line of thinking:\n\nYou want to know why Apple is $2.1T in market cap? It is a mix of high earnings in the future and a very low risk of missing.\n\nHave low risk necessarily means having lower future returns. Almost all (&gt;97%) returns are explained by taking on more risk (using the Fama-French 5 factor model). This is the fundamental idea behind investing, and is basically a law at this point. High risk = high reward.\n\nApple being priced high means that it's expectations are high (meaning for anyone who invests in Apple right now, they are expecting Apple to earn lots of money) and those expectations are not terribly risky. This ultimately means that for Apple investors to make returns at or above the market, Apple has to consistently beat expectations and become even a safer investment in order for current investors to make returns.\n\nWhat this ultimately means is that in the long-term, large cap growth stocks are not the best investments you should have. Companies like Apple are basically guaranteeing you low returns in the long run. If you have a long time horizon, you should be investing in systematically risky assets because in the long run, you make more returns. Things like value, and small cap stocks are higher risk and higher reward.\n\n\\*Price movements are a random walk, but that is because the future is effectively random.",
        "subreddit": "investing",
        "title": "A reminder on what moves the price of a stock",
        "url": "https://www.reddit.com/r/investing/comments/iii8hb/a_reminder_on_what_moves_the_price_of_a_stock/",
        "created": 1598686995.0
    },
    {
        "author": "jalapenojacker",
        "created_utc": 1598051955,
        "id": "ie7n7k",
        "num_comments": 98,
        "num_crossposts": 0,
        "selftext": "It has come to my attention that a lot of people are unsure what to make of the Record Date for the stock split. There is a lot of people spreading misinformation by saying that it’s a “deadline” and that you won’t be eligible for the stock split after the record date. THAT IS COMPLETELY FALSE! \n\nYou can still buy the stock next week and still be eligible for the 5:1 stock split. The record date just records who is eligible for the stock as of August 21st. However, When you buy the stock next week you buy the stock and the right to the 5:1 stock split from the person who was recorded on August 21st. That’s it, you still get your 5 shares after the split. The only date that really matters is August 31st, which is the split date.\n\nFeel free to copy and paste my post if you come across anyone wondering about the record date! \n\nThanks.",
        "subreddit": "wallstreetbets",
        "title": "TSLA and AAPL Stock Split Record Date and Why it Doesn’t Matter!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ie7n7k/tsla_and_aapl_stock_split_record_date_and_why_it/",
        "created": 1598080755.0
    },
    {
        "author": "tommy-gun9",
        "created_utc": 1596503817,
        "id": "i39wv1",
        "num_comments": 97,
        "num_crossposts": 0,
        "selftext": "What would you put the $2,500 into? I was strongly leaning toward putting it all into Apple but I’m starting to move toward an ETF like $SPY. What stock or ETF would you choose?",
        "subreddit": "StockMarket",
        "title": "$2,500 to put into the market tomorrow morning",
        "url": "https://www.reddit.com/r/StockMarket/comments/i39wv1/2500_to_put_into_the_market_tomorrow_morning/",
        "created": 1596532617.0
    },
    {
        "author": "noratooo",
        "created_utc": 1597502131,
        "id": "ia8dx8",
        "num_comments": 97,
        "num_crossposts": 0,
        "selftext": "I have a post that I explained how in etoro you don’t own the stock what so ever but u just own a cfd contract even if you don’t use margin \n\nIn this post I’ll explain a little bit about how etoro pays dividends on your stocks even tho you don’t own them and the dangers of trading on this kind of brokers \n\n“”””””””””””””””””””\n\n\nAs I said in one of my replay , the underlying asset is a cfd contract (cfd contracts are decaying assets ) , a cfd contract doesn’t grant you any ownership over the real stock. Let me explain again .\n\nIn one of the legit brokers I use , they have this program that if you subscribe in , you give the broker the permission to lend the stocks in your portfolio to other traders who want to short sell the stock , like I have 5 apple stocks in my portfolio, if I’m signed up to the lending programme in this legit broker , then they can take my 5 apple stocks and lend them to someone who wants to short sell them .\n\n1 - by law I’m not paid dividends on those stocks that they borrowed from me , but the borrower is paid the dividend cause he is the owner now as long as he is borrowing my stocks .\n\n2- said broker will pay me 50% of the interest that he charges the short seller\n\n3- the broker will still give me my dividends equivalent but in a form of capital gain ( etoro does pay u dividends equivalent from the commission that he charges on his platform , but not real dividends, )\n\nThis might sound complicated but again this is way a broker like etoro can tell their clients that they are buying the asset which in-fact they are not , it is legal but it is a form of word play , the real danger is if etoro goes bankrupt or for any reason doesn’t wna does his part of cfd contract deal then they tottaly can , they don’t do it upfront , but they can halt trading on a certain stock , just an example , a real legit broker will never halt trading on a stock unless the exchange itself halt trading and no one in the world can buy the stock , in etoro you will find that you can’t sell a certain position or open one , while at the same time other traders on other platforms are happily buying the same stock and selling it , this is one form of etoro saying “ I don’t want to keep up to my words that and exercise the cfd contract “\n\nSomethings I said are a bit complicated but etoro banks on the low experience and innocency of their clients .\n\nHope this helps",
        "subreddit": "stocks",
        "title": "Beware of etoro",
        "url": "https://www.reddit.com/r/stocks/comments/ia8dx8/beware_of_etoro/",
        "created": 1597530931.0
    },
    {
        "author": "MarijuanaGrowGroup",
        "created_utc": 1598191406,
        "id": "if3pmk",
        "num_comments": 97,
        "num_crossposts": 0,
        "selftext": "Sit down, listen up. \n\nI'm tired of people coming in here for the last 3 goddamn months looking for investment advice. If you come here looking for investment advice, you strike me as the type of person rolling up to a ChuckECheese for surgery consultation. \n\nSnort some Covid. \n\nCut a line of bath salts and read this post below. \n\n&amp;#x200B;\n\n1. No one gives 2 Rosie O'Donnell shits that you are trying to invest in stocks. There's a place for you, it sure as fuck isn't here. \n2. You have gains? Sweet, that's cool, we jerk off to losses though. I'm down voting every gain i see from here on out. \n3. Yes, It's too late for your retail retarded ass to invest in AAPL, TSLA, MSFT, and all the other garbage we've been playing for the last 6 months. Wait until the news reports \"DOW DROPS 800 points in a day\". THAT'S WHEN YOU SMASH BUY. \n4. No one is going to tell  you to to invest. This is a casino and Wendy's is a 5 start goddamn meal. \n5. You are not special. You are not a unique snow flake. Get the fuck out so we can get dudes like my boy Chimpu back in here. \n6. If you're buying options, only buy FD's if you want to get rich. You know what FD stands for? Faggots Delight. Are you? Then buy these. \n7. An austist is someone who thinks they've got it figured out and shoved the square peg through the round hole.\n8. A retard is you, posting here trying to do what the autist does except you can't because you're stuck on the peg being square and the hole being round. \n9. No one here has a wife, but everyone's wife is getting fucked. \n10. This makes you a cuck. \n11. If you inverse 50% of WSB and play out 50% of WSB, you will lose 100% of your money.\n12. Don't worry about tendies, you wont ever understand what the fuck they are. \n13. There are legends here, I am not one of them, you will never be one of them. \n14. If you think buying stocks is cool, it is, but don't post that shit here unless you're memeing a stock. What is a stock meme? See my RKT position below. \n15. When you think people here like you, they don't. They abuse you, take advantage of you, call you names. You'll make a post here and delete it out of shame. \n16. Grow the fuck up and get over it. You're dealing with degenerates who are keyboard warriors 9 days out of the week. \n\n&amp;#x200B;\n\nAAPL $520C 8/28\n\nRKT - 700S @ $18.10 / $30C 10/16\n\nSLV - $30C 1/15",
        "subreddit": "wallstreetbets",
        "title": "Read if you're New",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/if3pmk/read_if_youre_new/",
        "created": 1598220206.0
    },
    {
        "author": "mashrocks",
        "created_utc": 1597873986,
        "id": "icxbzm",
        "num_comments": 96,
        "num_crossposts": 0,
        "selftext": "Bought AAPL Aug 21 calls not realizing that August 21... is on Friday. AAPL was 468 this Morning but instead of going up with the news, it went down before end of the day. Am I totally fucked or is there a chance?",
        "subreddit": "wallstreetbets",
        "title": "How likely will AAPL hit 470 by Friday?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/icxbzm/how_likely_will_aapl_hit_470_by_friday/",
        "created": 1597902786.0
    },
    {
        "author": "LargeStonks",
        "created_utc": 1598645707,
        "id": "iieljz",
        "num_comments": 96,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Aapl",
        "url": "https://i.redd.it/tvr268ixwsj51.jpg",
        "created": 1598674507.0
    },
    {
        "author": "vadimyuryev",
        "created_utc": 1598885497,
        "id": "ijzeab",
        "num_comments": 94,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "smallstreetbets",
        "title": "AAPL stock goes up. My call inversely goes down??",
        "url": "https://v.redd.it/kjhorbevpck51",
        "created": 1598914297.0
    },
    {
        "author": "dragoniteVS",
        "created_utc": 1597367405,
        "id": "i9cgty",
        "num_comments": 93,
        "num_crossposts": 0,
        "selftext": "Just out of curiosity, has anyone dove in and done an analysis on companies in the index? I know tech is the main culprit in the price skyrocketing lately, but I need a sanity check after watching everything just keep going up lately. I'm mostly just stock piling cash, but I'll admit it's hard when everyday is green. Are companies revenues actually getting stronger, or decreasing overall? Also, do you think big techs recent reporting of revenue increases (AAPL, FB, etc) is a growing trend moving forward, and do you think that revenue jump justifies the current prices? Curious at the responses, thanks.",
        "subreddit": "investing",
        "title": "Is the S&amp;P actually overvalued?",
        "url": "https://www.reddit.com/r/investing/comments/i9cgty/is_the_sp_actually_overvalued/",
        "created": 1597396205.0
    },
    {
        "author": "Ned_Flanderz",
        "created_utc": 1596935093,
        "id": "i6als7",
        "num_comments": 93,
        "num_crossposts": 0,
        "selftext": "Apple will be splitting soon, what are your thoughts on this?\n\n1. Robinhood exists, poor autistic children will be able to buy it with their fractional shares boosting it back up\n2. Thousands of other companies are valued above Apple, why do they feel the need to Split, does this benefit them in some way?\n3. Stocks only go up\n4. How many of you Degenerates plan on buying some/more once they split?\n5. I'm thinking options upon the split, as more will buy into the hype, and it'll plateau again, but not before the retards realize the company value didn't increase and it wont hit $520 by the end of the year again\n\nAnyways, I'm bored on the weekend, so what are you guys doing with this?",
        "subreddit": "wallstreetbets",
        "title": "AAPL Split",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i6als7/aapl_split/",
        "created": 1596963893.0
    },
    {
        "author": "plazmohney",
        "created_utc": 1596820472,
        "id": "i5hsg0",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Listen up fellas. \n\nTelehealth has tremendous potential moving forwards, we all know that. Additionally, the world is becoming increasingly cognizant of mental health and the importance of maintaining it. \n\nOTRK combines telehealth with mental health. I would describe what they do but the Motley Fool probably does it better than me:\n\n \"The artificial intelligence (AI)-driven platform targets and engages with those coping with chronic conditions whose lives can improve with behavioral change. The company then delivers its insights to patients either in-person or via telehealth connection with a healthcare professional.\n\nLike Livongo, Ontrak partners with employers and healthcare plans to find, treat, and support those with behavioral health conditions, eventually delivering medical expense savings upwards of 50%.\"\n\nA lot of people have been comparing OTRK to LVGO over the last few weeks. For those who don't know, LVGO is a &gt;12B market cap stock who deals with telehealth for diabetes. They grew heavily in 2019 and 2020, with revenue going from $40M to $91 M in Q2 2020. They are now positive cash flow, whereas they were bigly in the red a year ago. From this growth their stock has seen over a 400% increase in value.  \n\nGuess which company has similar financial to the old LVGO. OTRK made 17 M in revenue (+124% YoY) in Q2 2020, but is debt ridden and has negative cash flow. They shot up almost 100% on the earnings beat to $60 and now have a market cap of $1B. This seems like a fair valuation, as they're following the footsteps of LVGO but still need a few more years to get there, right? WRONG\n\nIn the OTRK earnings call, their CEO Terren Peizer gave guidance for 90 MILLION total revenue in 2020. They're at less 30 Million after two quarters. That's some rapid fucking growth. The CEO seems a little sketchy. He did some work in 1983 as a highly yield bond salesman and he ratted on one of his buddies to the SEC in exchange for immunity. I don't trust the guy and you shouldn't either. \n\nBut, their CEO is pumping the shit out of this company, and who the hell is going to tell him he's wrong until their next earnings report when we actually get to see what they've been up to. Their $1B market cap should probably be $3B by the next earnings call if people buy into his projections. That's a stock price of $60-$180.\n\nThis company is possibly a scam, so be wary, but this shit could pump to the moon. \n\nDISCLAIMER: These options have relatively low volume and large bid/asks. Don't try and make hella trades with this shit. Get into a position you like and hold it for a few weeks. \n\nTLDR: Buy OTM options on OTRK dated no later than November.",
        "subreddit": "wallstreetbets",
        "title": "A CEO who loves to pump. The case for the next LVGO",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i5hsg0/a_ceo_who_loves_to_pump_the_case_for_the_next_lvgo/",
        "created": 1596849272.0
    },
    {
        "author": "mediusresearch",
        "created_utc": 1597018698,
        "id": "i6ufet",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "**Overview**\n\nIn order to mitigate the spread of COVID-19, governments in [188 different countries](https://www.brookings.edu/research/school-closures-government-responses-and-learning-inequality-around-the-world-during-covid-19/) have implemented school closures. For the United States specifically, every state and territory ordered or recommended school closures—affecting upwards of 55 million students across the country. Wary of the achievement gap that could spur from prolonged closures, the Centers for Disease Control &amp; Prevention (CDC) has recently released [guidelines](https://www.cdc.gov/coronavirus/2019-ncov/community/schools-childcare/schools-faq.html) for reopening schools. Moreover, Governor Andrew Cuomo of New York [recently announced](https://www.nytimes.com/2020/08/07/nyregion/cuomo-schools-reopening.html) that schools can decide to open so long as they are in a region where the average rate of positive coronavirus tests is below 5 percent over a two-week period. \n\n**Efficacy of School Reopening: Lessons from Other Nations**\n\nExtended school closures impact students in a variety of ways: it fosters learning loss, weakens social and emotional skills, entrenches abuse in unstable homes, and can lead to a decline in nutritional health. Cognizant of the importance of in-person instruction, multiple countries have already set guidelines to reopen their schools:\n\n*Denmark*\n\n* In Denmark, students were to stay 2 meters apart wherever possible, were grouped into “bubbles” of 12, and were required to wash their hands every two hours but not to wear masks. \n\n*Germany*\n\n* In Germany, their government cut class sizes in half, had one-way hallways, staggered breaks, masks for teachers and free twice-weekly Covid-19 tests for students and teachers.\n\n*Taiwan*\n\n* In Taiwan, students returned to school and were required to go through temperature checks at school entries and to wear face masks. Additionally, Taiwan left school reopening to a more localized decision to account for differing infection rates in the country.\n\nIn each of these nations, case and mortality counts continued to decline after reopening schools—a positive indication that school reopenings have been effectively implemented with a variety of guidelines.\n\n**Concerns With School Reopening**\n\nAlthough some governments were able to successfully reopen schools, other governments were not as successful. In Jerusalem, over 100 students and 15 staff members were infected after an outbreak occurred at a high school. To alleviate the spread of COVID-19 in schools, the CDC recommends more research on mitigation strategies (i.e. face masks, the use of cohorting, social distancing).\n\nThe Council of Chief State School Officers estimated that schools would need between $158.1 billion and $244.6 billion in additional funding to open safely. \n\nOn top of the estimated [158.1 billion to 244.6 billion dollars](https://ccsso.org/blog/ccsso-submits-cost-estimate-safely-reopening-public-schools-after-covid) school are estimated to need to open safely, considering that the United States has recently surpassed five million virus cases, school reopenings could pose a harm to children—especially considering that the response to COVID-19 has not been as effective as other nations that have reopened schools.\n\n**Financial Impacts**\n\n*Stocks*\n\nOnline educational institutions and virtual schools have seen increases in enrollment as a result of extended school closures. Publicly traded company K12—which currently owns 40% of the market—saw [stocks rise 21%.](https://www.edsurge.com/news/2020-03-05-public-markets-watch-for-coronavirus-impact-on-edtech-stocks) Chegg, a popular service for study materials and tutors, has seen stocks rise [87% in the last year.](https://investorplace.com/2020/07/5-online-education-stocks-that-can-expand-your-horizons/)\n\n*Costs to School Districts*\n\nThe pandemic will cost states [$555 billion over fiscal years 2020 to 2022.](https://www.cbpp.org/research/state-budget-and-tax/states-continue-to-face-large-shortfalls-due-to-covid-19-effects) Seeing as school districts rely on state funding and local tax revenue that is likely to be cut because of rampant unemployment, it is likely that districts will have to resort to laying off employees or lessening the quality of education. This occurred during the Great Recession when the Clark County School District in Nevada [laid off upwards of 500 employees in a single year.](https://www.edweek.org/ew/articles/2011/01/13/16landscape.h30.html)\n\nLet us know what you think!",
        "subreddit": "wallstreetbets",
        "title": "Medius Research Brief: COVID-19 School Re-openings and It's Impact on the Financial Sector",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i6ufet/medius_research_brief_covid19_school_reopenings/",
        "created": 1597047498.0
    },
    {
        "author": "albundy12345",
        "created_utc": 1597070353,
        "id": "i760i4",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": " \n\n **Tinley Beverage Company ($TNYBF $TNY)** makes award winning cannabis beverages in California. The flavors are designed to replicate alcoholic drinks like Fireball, Margarita, Moscow Mule, Malibu Coconut Rum, Amaretto, Kahlua. They also offer non-alcoholic ready to drink cocktails under the Beckett's brand names, available at Bevmo, and soon to begin trials at warehouse stores like Sam's or Costco.\n\nThey built a new plant with a high-tech bottling line, which recently received its license, and will soon be commissioned into use. In addition to making their own drinks, they are expected to announce copacking deals to make cannabis drinks for their clients. Former NBA player Baron Davis is on board as an advisor, he helped grow and sell Vitaminwater. Here are some of their key upcoming events anticipated by long-term shareholders. Particularly of interest are the copacking deals to manufacture beverages for other cannabis companies. \n\n&amp;#x200B;\n\n**Q2 Financials (Ending June 30th) will be out in just a few short weeks.** To give you an idea what this might look like: As of June 24th, \"the Company has fully exhausted its inventory of Tinley™ ’27 multi-serve products, which were produced at the Company’s recently-decommissioned Phase 2 facility. The Company’s inventory of carbonated, ready-to-drink products is nearly depleted\". \"The Company expects to generate initial co-packing revenue in Q2 from pre-production packaging services\". These numbers will be interesting nonetheless. As a comparison, at March 31st, the Company had $174,000 in revenues for the first 3 months of the year, and $277,807 in finished goods. The releases subsequent have laid it out black and white, this product has been SOLD. When it hits the financials is another question, but it is coming. There will obviously be a period of time throughout Q3 that some product would not be widely available until the most recent production at Long Beach.\n\n**The Company's Long Beach Facility is fully licensed (and producing)!** As of July 2, \"the initial run of Tinley’s™ ’27 products will include the Company’s new Tinley’s™ ’27 Arabica Cask.\" There had been some speculation as to whether this would happen \"mid-July\". As stated, \"the Company expects the first bottling run to take place in the facility by mid-July.\" Since this time, pictures with multi-serve beverages, mainly the Cinnamon Cask, have come to light. Remember that the Coconut Cask is the Company's number 1 seller. Reading between the lines, one can infer that even though the Cinnamon pictures came out a few days ago, the Coconut Cask was most surely produced before then. Production would have been occurring over the past few weeks as a result. As of July 29 interview with Jeff Maser and Money Works Magazine, production was in the works at that very moment in time, and had been for some time already.  Single serves will be completed after the multi. The team is working to get California stocked.\n\n**A massive consumer trend in non-alcoholic beverages has emerged while many of us have been shareholders, right under our noses.** Further to the Money Works Magazine interview, one development that has taken hold over the last year or two is that a massive, massive, consumer trend has emerged in non-alcoholic beverages. This has occurred during the time many of you have been shareholders. The massive demand for this emerging trend is prudent to capture; it had an estimated market share of $18 Billion last year alone, growing in the triple digits in certain markets around the world. The company has diversified its risk by focusing attention to it, and used their know-how and resources to capitalize on this astronomical growth. Remember, the Company's principals are the best of the best in the beverage space (their bio's are at the bottom of this post). They're making strategic decisions on behalf of shareholders, allocating time and efforts where money is to be made. Bear in mind that although infused beverages are the Company's bread and butter (Tinley's), regulations have made its rollout much slower than that of Beckett's (non-infused line). Beckett's can be rolled out very easily (using the same great taste and formulations already developed), while regulators take their time to make many facets of the business easier (or more difficult?). Revenue recognition is also much, much faster with Beckett's. Banking regulations unfortunately make revenue recognition much slower with Tinley's. Some have pointed out that Jeff has only mentioned Beckett's lately. In Canada, there is an extremely fine line when talking about the two business lines. The regulations do not allow for a cross marketing of the two. You either talk about Tinley's, or you talk about Beckett's, not both. Be cognizant of this.\n\n**The Company has at least 4 commitments from supermarkets/chains for Beckett's.** The June monthly CSE report (form 7) stated, the company is \"working to obtain additional grocery, liquor store and other retail placements for its beverages\". The July report had a slight change of wording: the Company is \"working to begin trials at the previously-disclosed grocery and warehouse chains, as well as obtain additional grocery, liquor store ecommerce and other retail placements for its non-infused beverages\". This indicates they are one step closer to a rollout. Jeff indicated in the most recent interview with Money Works Magazine that they \"ramped up production;\" producing more Beckett's last week for these demos.\n\n**Closing of the current Private Placement will happen today.** Since its announcement several weeks ago, the share price has held steady, but the most important development here - nearly 5 million shares have been purchased, in the open market, over this time. (Most likely bought off of those selling to buy in on the private placement). That is one incredibly large position that was taken over the past month. The placement took a bit of time due to some last minute due diligence by one of the houses taking interest, which is not unusual in the industry.\n\n**Celebrity endorsements are coming.** There have been some questions coming up as to why this has not happened yet. It has always been important to ensure the Company had ample inventory, and distribution in place prior to announcing these. It is **absolutely imperative** to have this in place before letting celebrities endorse and tell their followers. There have been many examples of celebrities doing such with other products, only to have inventory and website issues unable to handle the newfound demand. With beverages, you only get 1 shot to win over the consumer. Get it right, the first time. With Long Beach up and running, it is safe to say the Company is one step closer to releasing this news. The Company is \"working to finalize initiatives with prominent figures **(with an S)** in sports and entertainment for marketing of Tinley products and co-packing clients’ products.\"\n\n**Copacking. There has been \"a ton of interest\".** The May 27th release is most important here: Mr. \\[Baron\\] Davis is currently working on marketing initiatives and development of new products for the Company’s own products and its expected co-packing clients’ products. We also know that the copackers are \"well known\". There is some major money to be had here...\"Well Known\" being the key words 📷;) With the July 2nd licensing news, \"the Company is now in a position to consummate agreements in its pipeline of prospective co-packing clients, and it will update the market as such agreements come to fruition.\"\n\n**Canada will be announced \"shortly\"** regarding Beckett's, and Tinley's. When this happens, remember that Canada is a very, very large piece of real estate. The product will hit, but it's rollout and availability won't happen in a single day. It will take some time. You may see it in Toronto right away for example, but may take some time to reach its way to Vancouver. The logistics are quite immense.\n\nAs shareholders, to truly be a part of the company's success, it is absolutely imperative to share the story with friends, family, business owners, neighbours. Let's hit the ground running.\n\nTo summarize, In no particular order, be sure to watch out for the following:\n\n\\- Q2 financials\n\n\\- fully commissioned production facility announcement\n\n\\- copacking arrangements\n\n\\- Beckett's chains announcements\n\n\\- territorial expansion (Canada etc)\n\n\\- marketing and celebrity endorsements\n\nIf you are unfamiliar with the Company and its main principals, feel free to read below (I absolutely encourage those who do know to have a re-read),  it will give you an idea of just how connected the Company is in the beverage space, or if you have any doubt. I hope this has been a great help for those who may have been in the dark on a few of the Company's developments.\n\nCheers!\n\n**Richard Gillis, President, Western USA**\n\n• Previously President, Youngs Market Company – US$3 billion in annual sales; 2nd largest beverage alcohol distributor in Western USA\n\n• EVP/General Manager of Coca-Cola Enterprises, Southwest USA\n\n• 30 years in various senior positions in the beverage and CPG industries\n\n**Jeffrey Maser, Founder, CEO of Becketts (non-infused) Canada**\n\n• Previously in beverage branding and product strategy at the Watt Design Group, a subsidiary of Cott Corporation during period when Cott was the largest beverage company in the world after Coca Cola and Pepsi\n\n• 10 years in venture capital, merchant and investment banking with a focus on emerging industries\n\n**Ted Zittell, Director &amp; Brand Manager**\n\n• Previously President of Cott’s Retail Brands International, where he led the creation and launch of premium retailer brand and marketing programs worldwide\n\n• Senior partner at The Watt Design Group for 17 years (including during period of ownership by Cott Corp.)\n\n• Senior consultant for McMillan Doolittle LLP, a leading Chicago-based retail and consumer experience agency\n\n• Advisor for US private equity and investment funds in the food and beverage sectors\n\n• Recent executive-level engagements include work for Walmart, Kroger, CVS Pharmacy, P&amp;G, Nestlé, Loblaws, Sainsbury's and Tesco\n\n**Mark Benadiba, Advisory Board**\n\n• Previously CEO, Cott Canada and EVP Operations, USA\n\n• Board of Directors, Cott Corporation (2008-2017)\n\n**Andrew Stodart, Advisory Board &amp; Tinley Canada Lead**\n\n• Launched Crystal Head Vodka and brought from concept to nationwide North American distribution in 18 months\n\n• Oversaw the launch of Dan Aykroyd Wines at Diamond Estates Wines and Spirits\n\n• International brand manager for Black Velvet Whisky (Constellation Brands); built from a declining brand into the 3rd-largest selling brand in its category\n\n• Various roles at Patron Tequila and Everfresh Juice\n\n**Baron Davis, Advisory Board**\n\n• Two-time NBA All Star; played for the Charlotte Hornets, Golden State Warriors, Los Angeles Clippers, Cleveland Cavaliers and New York Knicks\n\n• Early Vitaminwater® investor\n\n• Entrepreneur and Investor in Film and Music Production, Publications, Merchandise and Retail, Beverage, Finance, Real Estate, and Technology\n\n**Curt Marvis, Director**\n\n• MTV Lifetime Achievement Award recipient\n\n• Previously President, Digital Media, Lionsgate Entertainment (NYSE:LGF.A)\n\n• Founder and CEO, QYOU Television (TSXV:QYOU), an LA &amp; Toronto based, millennial-focused television &amp; media company distributed in 35 countries\n\n**Douglas Fulton, Director**\n\n• LA-Based, European Emmy Award-winning television executive\n\n• Co-Founder of LA Christine, a line of premium skincare products\n\n**Ben Knight, Advisory Board**\n\n• Founder of CMX Distribution and 420 Central Brand Stores in California\n\n&amp;#x200B;\n\n **Corporate Presentation:** [https://drinktinley.com/wp-content/uploads/Tinley-Corporate-Presentation-Q2-2020-1.pdf](https://drinktinley.com/wp-content/uploads/Tinley-Corporate-Presentation-Q2-2020-1.pdf)",
        "subreddit": "pennystocks",
        "title": "Tinley Beverage Company Upcoming Catalysts $TNY $TNYBF",
        "url": "https://www.reddit.com/r/pennystocks/comments/i760i4/tinley_beverage_company_upcoming_catalysts_tny/",
        "created": 1597099153.0
    },
    {
        "author": "Cicero1982",
        "created_utc": 1597820553,
        "id": "iciv8u",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "# Pre Market Brief for Wednesday August 19th 2020\n\nYou can subscribe to the daily 4:00 AM Pre Market Brief on [The Twitter Link Here](https://www.tradinganalysisresources.com/2020/05/free-references-and-resources.html?m=1) . Alerts in the tweets will direct you to the daily 4:00 AM Pre Market Brief in this sub.\n\n[Morning Research and Trading Prep Tool Kit](https://www.tradinganalysisresources.com/2020/05/free-references-and-resources.html?m=1)\n\n[The Ultimate Quick Resource For the Amateur Trader.](https://www.reddit.com/r/pennystocks/comments/hcja2q/the_ultimate_quick_resource_for_the_amateur_trader/)\n\n*Published* **3*****:00*** ***AM*** *EST / Updated as of* ***3:00 AM*** *EST*\n\n\\-----------------------------------------------\n\n***Stock Futures:***\n\n* [Pre-Market Trading](https://money.cnn.com/data/premarket/)\n* [Stock](https://finance.yahoo.com/news/stock-market-news-live-august-19-2020-221817551.html) futures open flat after S&amp;P 500's record close\n* [Asia](https://www.cnbc.com/2020/08/19/asia-markets-wall-street-australia-china-relations-currencies-in-focus.html) Pacific stocks mixed; Japan’s exports in July slide on-year\n* [European](https://www.cnbc.com/2020/08/19/europe-markets-stocks-seen-higher-after-wall-street-record-highs.html) markets set to open slightly higher after record highs on Wall Street\n\n**Tuesday** ***08/18/2020 News and Markets Recap:***\n\n* [Your Pre Market Brief for 08/18/2020](https://www.reddit.com/r/pennystocks/comments/ibxl4u/your_premarket_brief_for_08182020/)\n* [Market Recap](https://finance.yahoo.com/video/market-recap-tuesday-august-18-201742935.html)\n\n***Wednesday*** ***August 19th 2020*** [***Economic Calendar***](https://tradingeconomics.com/calendar) (All times are Eastern)\n\n* **07:00 AM** [**MBA 30-Year Mortgage Rate**](https://tradingeconomics.com/united-states/mortgage-rate) 14/AUG \n* **07:00 AM** [**MBA Mortgage Applications**](https://tradingeconomics.com/united-states/mortgage-applications) 14/AUG \n* **10:30 AM** [**EIA Crude Oil Stocks Change**](https://tradingeconomics.com/united-states/crude-oil-stocks-change) 14/AUG \n* **10:30 AM** [**EIA Gasoline Stocks Change**](https://tradingeconomics.com/united-states/gasoline-stocks-change) 14/AUG \n* **10:30 AM** [**EIA Distillate Stocks Change**](https://tradingeconomics.com/united-states/distillate-stocks) 14/AUG \n* **10:30 AM** [**EIA Cushing Crude Oil Stocks Change**](https://tradingeconomics.com/united-states/cushing-crude-oil-stocks) 14/AUG \n* **10:30 AM** [**EIA Refinery Crude Runs Change**](https://tradingeconomics.com/united-states/refinery-crude-runs) 14/AUG \n* **10:30 AM** [**EIA Heating Oil Stocks Change**](https://tradingeconomics.com/united-states/heating-oil-stocks-) 14/AUG \n* **10:30 AM** [**EIA Distillate Fuel Production Change**](https://tradingeconomics.com/united-states/distillate-fuel-production) 14/AUG \n* **10:30 AM** [**EIA Gasoline Production Change**](https://tradingeconomics.com/united-states/gasoline-production) 14/AUG \n* **10:30 AM** [**EIA Crude Oil Imports Change**](https://tradingeconomics.com/united-states/crude-oil-imports) 14/AUG \n* **01:00 PM** 20-Year Bond Auction \n* **02:00 PM** [**FOMC Minutes**](https://tradingeconomics.com/united-states/interest-rate) \n\n***News Heading into Wednesday August 19th 2020***\n\n*NOTE: PLEASE DO NOT YOLO THE VARIOUS TICKERS WITHOUT DOING RESEARCH. THE TIME STAMPS ON THE FOLLOWING ARTICLES MAY BE LATER THAN OTHERS ON THE WEB. THE CREATOR OF THIS THREAD COMPILED THE FOLLOWING IN A QUICK MANNER AND DOES NOT ATTEST TO THE VERACITY OF THE INFORMATION BELOW. YOU ARE RESPONSIBLE FOR VETTING YOUR OWN SOURCES AND DOING YOUR OWN DD.* \n\n* [GNCA](https://www.sec.gov/Archives/edgar/data/1457612/000145761220000142/s3august2020.htm) Genocea -1.8% as holders file to offer 21.39M shares  \n* [VRNA](https://www.globenewswire.com/news-release/2020/08/19/2080411/0/en/Verona-Pharma-Initiates-Multiple-Dose-Part-of-Phase-2-Clinical-Trial-with-pMDI-Formulation-of-Ensifentrine-in-COPD.html) Verona Pharma Initiates Multiple Dose Part of Phase 2 Clinical Trial with pMDI Formulation of Ensifentrine in COPD (Overnight News).\n* [AXDX](http://ir.axdx.com/2020-08-18-Accelerate-Diagnostics-Announces-FDA-Emergency-Use-Authorization-for-COVID-19-Antibody-Testing-System) Accelerate Diagnostics up 13% on FDA emergency use nod for COVID-19 test (Overnight News).\n* [CYDY](https://www.globenewswire.com/news-release/2020/08/19/2080404/0/en/CytoDyn-Requests-Fast-Track-Approval-for-COVID-19-Patients-from-U-K-s-Regulatory-Agency-MHRA-based-on-its-Top-line-Report-Showing-Statistically-Significant-Endpoint-NEWS2-p-0-023-a.html) CytoDyn requests “Fast Track Approval” in U.K for COVID-19 trial (Overnight News).\n* [CNTG](https://www.globenewswire.com/news-release/2020/08/19/2080412/0/en/CENTOGENE-Opens-Walk-In-COVID-19-Testing-Facility-at-Hamburg-Airport.html) CENTOGENE Opens Walk-In COVID-19 Testing Facility at Hamburg Airport (Overnight News).\n* [HUD](https://www.reuters.com/article/us-hudson-m-a-dufry/dufry-to-buy-rest-of-hudson-in-311-million-deal-idUSKCN25F0HE) Dufry to buy rest of Hudson in $311 million deal (Overnight News).\n* [REGN](https://www.marketwatch.com/story/regeneron-enlists-roche-to-help-make-covid-19-drug-2020-08-19) Regeneron teams with Roche to triple supply of its COVID-19 drug (Overnight News).\n* [MTP](https://finance.yahoo.com/news/midatech-pharma-plc-announces-exercise-060000702.html) Midatech Pharma Announces Exercise of Warrants and Issue of Equity (Overnight News).\n* [ON](https://www.businesswire.com/news/home/20200818005824/en/Semiconductor-Announces-Upsize-Pricing-Private-Offering-700) ON Semiconductor Announces Upsize and Pricing of Private Offering of $700 Million of 3.875% Senior Notes (Overnight News).\n* [RXT](https://www.globenewswire.com/news-release/2020/08/19/2080400/0/en/Rackspace-Technology-Announces-Results-of-Global-Cloud-Budget-Survey-Uncovers-the-Hidden-Complexities-of-IT-Spend-Management.html) Rackspace Technology Announces Results of Global Cloud Budget Survey, Uncovers the Hidden Complexities of IT Spend Management (Overnight News).\n* [GS](https://in.reuters.com/article/us-tech-omio/booking-app-omio-raises-100-million-in-travel-recovery-bet-idINKCN25F0LO?il=0) Booking app Omio raises $100 million in travel recovery bet (Overnight News).\n* [CHGG](https://www.businesswire.com/news/home/20200818005858/en/Chegg-Prices-Offering-900.0-Million-0-Convertible) Chegg Prices Offering of $900.0 Million of 0% Convertible Senior Notes Due 2026 (Overnight News).\n* [FUTU](https://www.globenewswire.com/news-release/2020/08/19/2080425/0/en/Futu-Announces-Pricing-of-Offering-of-9-500-000-American-Depositary-Shares.html) Futu Announces Pricing of Offering of 9,500,000 American Depositary Shares (Overnight News).\n* [BCOV](https://www.businesswire.com/news/home/20200818005479/en/Streamed-Video-Content-Dominates-Media-Entertainment-Consumption) Streamed Video Content Dominates Media and Entertainment Consumption According to the Brightcove Q2 2020 Global Video Index (Overnight News).\n* [ORCL](https://www.wsj.com/articles/trump-expresses-support-for-oracle-to-buy-tiktok-11597799352) Trump Expresses Support for Oracle to Buy TikTok (Overnight News).\n* [BX](https://www.reuters.com/article/us-takeda-m-a-blackstone/takeda-preparing-to-sell-japan-consumer-health-unit-to-blackstone-kyodo-idUSKCN25F039) Takeda preparing to sell Japan consumer health unit to Blackstone: Kyodo (Overnight News).\n* [NOVA](https://www.prnewswire.com/news-releases/gaf-energy-and-sunnova-launch-strategic-partnership-to-expand-roof-integrated-solar-options-for-homeowners-301114525.html) GAF Energy and Sunnova Launch Strategic Partnership to Expand Roof-Integrated Solar Options for Homeowners (Overnight News).\n* [EQNR](https://www.globenewswire.com/news-release/2020/08/19/2080407/0/en/Equinor-s-share-saving-plan-allocates-shares.html) Equinor’s share saving plan allocates shares (Overnight News).\n* [AAPL](https://www.benzinga.com/news/20/08/17149799/apple-revamps-music-radio-service-with-a-rebranded-beats-1-and-two-new-stations) Apple Revamps Music Radio Service With A Rebranded Beats 1, And Two New Stations (Overnight News).\n* [World’s](https://www.cnbc.com/2020/08/19/maersk-earnings-q2-2020.html) largest shipping firm says demand will ‘significantly decline’ this year(Overnight News).\n* [NI](https://www.prnewswire.com/news-releases/nisource-inc-announces-pricing-and-preliminary-results-of-its-any-and-all-tender-offer-301114476.html) NiSource Inc. Announces Pricing and Preliminary Results of its Any and All Tender Offer\n* [WU](https://finance.yahoo.com/news/western-union-now-available-card-010000707.html) Western Union Now Available at CARD Bank (Overnight News).\n* [INBX](https://www.sec.gov/Archives/edgar/data/1739614/000162828020012838/inbxs-1mefaug2020.htm) Form S-1MEF (registration adding securities to prior form s-1 registration \\[rule 462(b)\\]) filed with the SEC  \n* [GILD](https://www.businesswire.com/news/home/20200818005811/en/Gilead-Receives-Complete-Response-Letter-Filgotinib-Treatment) Gilead comes up empty with U.S. application for filgotinib for rheumatoid arthritis  \n* [MIDD](https://www.businesswire.com/news/home/20200818005844/en/Middleby-Corporation-Prices-Upsized-Offering-650-Million) The Middleby Prices Upsized Offering of $650 Million Convertible Senior Notes Due 2025 \n* [U.S.](https://www.marketwatch.com/story/us-china-agree-to-expand-airline-flights-between-them-to-8-per-week-2020-08-18), China to expand airline flights between them to eight per week.  (UAL, DAL, CEA, ZNH) \n* [JUUL MO](https://www.bloomberg.com/news/articles/2020-08-18/juul-e-cigarette-getting-fda-review-to-stay-on-the-u-s-market) Juul E-Cigarette Getting FDA Review to Stay on the U.S. Market\n* [HRMY](https://www.sec.gov/Archives/edgar/data/1802665/000119312520223850/d794185ds1mef.htm) Form S-1MEF (registration adding securities to prior form s-1 registration \\[rule 462(b)\\]) filed with the SEC  \n* [CDNS](https://finance.yahoo.com/news/cadences-john-wall-present-keybanc-000000616.html) Cadence's John Wall to Present at KeyBanc Future of Technology Series  \n* [EHTH](https://www.sec.gov/cgi-bin/browse-edgar?CIK=1333493) EHealth chief bullish on future, increases stake to 703K shares  \n* [ZNGA](https://www.barrons.com/articles/zynga-is-largest-mobile-game-maker-by-market-share-51597793969) Zynga Becomes Largest Mobile Game Maker by Market Share \n* [CNDT](https://www.sec.gov/Archives/edgar/data/921669/000092846420000047/cndtsc13da08182020.htm) Conduent +3.2% as it names Icahn's Gary to board for settlement  \n* [RMAX](https://www.prnewswire.com/news-releases/remax-2020-broker-owner-conference-features-memorable-speakers-valuable-lessons-and-the-launch-of-new-tools-training-and-technology-for-its-global-network-of-entrepreneurs-301114468.html) RE/MAX 2020 Broker Owner Conference Features Memorable Speakers, Valuable Lessons and the Launch of New Tools, Training and Technology for its Global Network of Entrepreneurs\n* [CNNE](https://www.businesswire.com/news/home/20200818005810/en/Cannae-Holdings-Announces-Investment-Foley-Trasimene-Acquisition) Cannae Holdings Announces Investment in Foley Trasimene Acquisition Corp. II’s Recently Priced $1.3 Billion Initial Public Offering  \n* [BFT](https://finance.yahoo.com/news/foley-trasimene-acquisition-corp-ii-231500321.html) Foley Trasimene Acquisition Corp. II Announces Pricing of Upsized $1.3 Billion Initial Public Offering\n* [RIO](https://www.reuters.com/article/us-rio-tinto-outlook-copper/rio-tinto-cuts-2020-refined-copper-outlook-on-smelter-restart-delay-in-utah-mine-idUSKCN25E2X8) Rio Tinto cuts 2020 refined copper outlook on smelter restart delay in Utah mine\n* [AR](https://www.prnewswire.com/news-releases/antero-resources-announces-pricing-of-250-million-offering-of-convertible-senior-notes-301114462.html) Antero Resources Announces Pricing of $250 Million Offering of Convertible Senior Notes  \n* [III](https://www.globenewswire.com/news-release/2020/08/18/2080350/0/en/Asia-Pacific-Sourcing-Slumps-in-Q2-on-Pandemic-Concerns.html) Asia Pacific Sourcing Slumps in Q2 on Pandemic Concerns\n* [QHRC](https://www.globenewswire.com/news-release/2020/08/18/2080351/0/en/Quest-Resource-Holding-Corporation-to-Present-Virtually-and-Host-1x1-Investor-Meetings-at-the-11th-Annual-Midwest-Ideas-Investor-Conference-on-August-26th-27th.html) Quest Resource Holding to Present Virtually and Host 1x1 Investor Meetings at the 11th Annual Midwest Ideas Investor Conference on August 26th &amp; 27th  \n* [REV C](https://www.bloomberg.com/news/articles/2020-08-18/citi-resigns-role-on-brigade-clo-deal-amid-escalating-loan-feud) Citi Resigns Role on Brigade CLO Deal Amid Escalating Loan Feud  \n* [REV C](https://www.reuters.com/article/us-citigroup-revlon-lawsuit/citigroup-wins-freeze-on-funds-mistakenly-sent-to-revlon-creditors-idUSKCN25E2GO) Citigroup wins freeze on funds mistakenly sent to Revlon creditors\n* [RDFN](https://www.prnewswire.com/news-releases/late-summer-housing-market-is-unseasonably-hot-prices-up-10-and-pending-sales-up-13-301114453.html) Late-Summer Housing Market is Unseasonably Hot, Prices Up 10% and Pending Sales Up 13%  \n* [RPAI](https://www.prnewswire.com/news-releases/retail-properties-of-america-inc-prices-400-0-million-offering-of-senior-unsecured-notes-301114449.html) Retail Properties Of America Prices $400.0 Million Offering Of Senior Unsecured Notes  \n* [SRNE](https://www.sec.gov/ix?doc=/Archives/edgar/data/850261/000110465920096566/tm2028939d1_8k.htm) Sorrento Therapeutics -10.4% after CFO's ouster  \n* [STAR](https://www.prnewswire.com/news-releases/istar-pricing-400-million-of-senior-unsecured-notes-301114447.html) iStar Pricing $400 Million of Senior Unsecured Notes\n* [CWT](https://www.globenewswire.com/news-release/2020/08/18/2080338/0/en/California-Water-Service-Group-Honored-as-Silver-Stevie-Award-Winner-for-COVID-19-Employer-Response.html) California Water Service Group Honored as Silver Stevie® Award Winner for COVID-19 Employer Response  \n* [JNPR](https://www.globenewswire.com/news-release/2020/08/18/2080340/0/en/Archdiocese-of-Brisbane-Selects-Juniper-Networks-to-Provide-AI-Driven-Wi-Fi-Solutions-Across-Its-Operations.html) Archdiocese of Brisbane Selects Juniper Networks to Provide AI-Driven Wi-Fi Solutions Across Its Operations  \n* [ROP](https://www.globenewswire.com/news-release/2020/08/18/2080341/0/en/Roper-Technologies-Prices-Public-Offering-Of-300-Million-Senior-Unsecured-Notes-Due-2022-700-Million-Senior-Unsecured-Notes-Due-2025-700-Million-Senior-Unsecured-Notes-Due-2027-And.html) Roper Technologies Prices Public Offering Of $300 Million Senior Unsecured Notes Due 2022, $700 Million Senior Unsecured Notes Due 2025, $700 Million Senior Unsecured Notes Due 2027 And $1 Billion Senior Unsecured Notes Due 2031\n* [TTEK](https://www.businesswire.com/news/home/20200818005799/en/Tetra-Tech-Wins-29.7-Million-USAID-Renewable) Tetra Tech Wins $29.7 Million USAID Renewable Energy Contract\n* [SPKE](https://finance.yahoo.com/news/spark-energy-inc-announces-class-220000352.html) Spark Energy Announces Class A Common Stock Share Buyback Program  \n* [DMYD](https://www.businesswire.com/news/home/20200818005791/en/dMY-Technology-Group-II-Announces-Closing-Underwriters%E2%80%99) dMY Technology Group II Announces Closing of Underwriters’ Over-Allotment Option in Connection with its Initial Public Offering  \n* [GVA](https://www.graniteconstruction.com/newsroom/granite-inliner-awarded-c12-million-sewer-maintenance-project-ontario-canada) Granite Inliner receives C$12M sewer maintenance project in Canada  \n* [BPYU](https://www.globenewswire.com/news-release/2020/08/18/2080324/0/en/Brookfield-Property-REIT-Inc-Announces-Final-Results-of-Tender-Offer.html) Brookfield Property REIT Inc. Announces Final Results of Tender Offer\n* [KKR](https://www.sec.gov/ix?doc=/Archives/edgar/data/1404912/000114036120018689/nt10014196x8_8k.htm) KKR prices $750M senior notes  \n* [GSIT](http://www.globenewswire.com/news-release/2020/08/18/2080322/0/en/GSI-Technology-to-Participate-in-the-LD-500-Virtual-Conference-on-September-3-2020.html) GSI Technology to Participate in the LD 500 Virtual Conference on September 3, 2020  \n* [ADI](https://investor.analog.com/news-releases/news-release-details/analog-devices-appoints-dr-laurie-h-glimcher-board-directors) Analog Devices Appoints Dr. Laurie H. Glimcher to Board of Directors \n* [DNB](https://www.sec.gov/ix?doc=/Archives/edgar/data/1799208/000179920820000011/dnb-20200812.htm) Dun and Bradstreet adds Jackson to expanded board   \n* [STNG](https://www.globenewswire.com/news-release/2020/08/18/2080319/0/en/Scorpio-Tankers-Inc-Announces-Purchase-of-Common-Shares-by-Scorpio-Services-Holding-Limited.html) Scorpio Tankers Announces Purchase of Common Shares by Scorpio Services Holding  \n* [MDC](https://www.prnewswire.com/news-releases/richmond-american-debuts-new-models-at-popular-folsom-masterplan-301114415.html) Richmond American Debuts New Models at Popular Folsom Masterplan  \n* [HAL](https://www.halliburton.com/en-US/default.html) Halliburton wins contact to bring cloud-based tech to Thailand offshore rigs  \n* [FLUX](https://www.businesswire.com/news/home/20200818005786/en/Flux-Power-Announces-Closing-12.4-Million-Underwritten) Flux Power Announces Closing of $12.4 Million Underwritten Public Offering Including Full Exercise of Over-Allotment Option  \n* [FISV](https://finance.yahoo.com/news/fiserv-announces-pricing-secondary-offering-212500775.html) Fiserv Announces Pricing of Secondary Offering of Common Stock by New Omaha Holdings\n* [EBC](https://www.businesswire.com/news/home/20200818005783/en/Eastern-Bank-Announces-Commencement-Stock-Offering) Eastern Bank Announces Commencement of Stock Offering    \n* [RRR](https://www.prnewswire.com/news-releases/station-casinos-offers-cashless-gaming-with-playon-at-las-vegas-properties-301114409.html) Station Casinos offers \"Cashless Gaming\" with \"PlayOn\" at Las Vegas Properties  \n* [ICMB](https://apnews.com/PR%20Newswire/2f2ea99b0f76c31b3e5f1827b45b9367) Investcorp Credit Management BDC Schedules Earnings Release of Fourth Quarter Ended June 30, 2020  \n* [GLDD](https://www.defense.gov/Newsroom/Contracts/Contract/Article/2317151/) US Department of Defense awards new contracts to GLDD\n* [SWN](https://www.businesswire.com/news/home/20200818005768/en/Southwestern-Energy-Prices-Offering-350-Million-Senior) Southwestern Energy prices senior notes offering  \n* [ORCC](https://www.bloombergquint.com/onweb/mindbody-software-maker-for-gyms-slapped-with-higher-loan-cost) Mindbody, Software Maker for Gyms, Slapped With Higher Loan Cost  \n* [CALB](https://www.globenewswire.com/news-release/2020/08/18/2080310/0/en/California-Bank-of-Commerce-Adds-Veteran-Bankers-to-Growing-Team.html) California Bank of Commerce Adds Veteran Bankers to Growing Team  \n* [AMZN](https://www.cnbc.com/2020/08/18/amazon-pushes-sellers-to-meet-prime-delivery-guarantees.html) Amazon pushes sellers to meet two-day delivery guarantees so more people can get Prime-eligible products\n* [SSP](https://www.businesswire.com/news/home/20200818005724/en/Triton-Digital-Releases-Webcast-Metrics-Rankings-Top) Triton Digital Releases Webcast Metrics Rankings for the Top Digital Audio Properties for June 2020  \n* [MJCO](https://www.businesswire.com/news/home/20200818005654/en/Majesco-Taps-Minds-Today%E2%80%99s-Influential-Industry-Leaders) Majesco Taps into the Minds of ’s Most Influential Industry Leaders Shaping the Future of Insurance  \n* [RRC](https://www.globenewswire.com/news-release/2020/08/18/2080304/0/en/Range-Announces-Pricing-of-Upsized-300-Million-Offering-of-Additional-9-250-Senior-Notes-Due-2026-and-Amends-Terms-of-Tender-Offers.html) Range Announces Pricing of Upsized $300 Million Offering of Additional 9.250% Senior Notes Due 2026 and Amends Terms of Tender Offers  \n* [IRTC](https://www.globenewswire.com/news-release/2020/08/18/2080299/0/en/iRhythm-Technologies-Announces-Proposed-Public-Offering-of-Common-Stock.html) iRhythm Technologies launches equity offering  \n* [ALBO](https://www.globenewswire.com/news-release/2020/08/18/2080294/0/en/Albireo-Reports-Topline-Results-from-Phase-2-Trial-of-Elobixibat-in-NAFLD-NASH.html) Albireo Reports Topline Results from Phase 2 Trial of Elobixibat in NAFLD/NASH\n* [CXO](https://www.businesswire.com/news/home/20200818005763/en/Concho-Resources-Publishes-Inaugural-2020-Sustainability-Report) Concho Resources Publishes Inaugural 2020 Sustainability Report  \n* [PSN](https://www.prnewswire.com/news-releases/parsons-completes-requirements-for-operations-at-salt-waste-processing-facility-301114377.html) Parsons completes requirements for operations at SWPF  \n* [LE](https://www.sec.gov/Archives/edgar/data/799288/000156459020040577/le-8k_20200812.htm) Lands' End works out deal for more financial breathing room  \n* [SABR](https://www.sec.gov/ix?doc=/Archives/edgar/data/1597033/000119312520223619/d54448d8k.htm) Sabre falls after $250M convertible, common stock offerings  \n* [HDS](https://www.globenewswire.com/news-release/2020/08/18/2080290/0/en/HD-Supply-Holdings-Inc-Announces-Fiscal-2020-Second-Quarter-Earnings-Release-Date-and-Conference-Call.html) HD Supply Holdings Announces Fiscal 2020 Second-Quarter Earnings Release Date and Conference Call  \n* [HHC](https://www.prnewswire.com/news-releases/the-howard-hughes-corporation-announces-closing-of-an-offering-of-750-000-000-senior-notes-due-2028--301114321.html) The Howard Hughes® Announces Closing Of An Offering Of $750,000,000 Senior Notes Due 2028  \n* [GASS](https://www.globenewswire.com/news-release/2020/08/18/2080286/0/en/STEALTHGAS-INC-Announces-the-Date-for-the-Release-of-the-Second-Quarter-and-Six-Months-2020-Financial-and-Operating-Results-Conference-Call-and-Webcast.html) STEALTHGAS Announces the Date for the Release of the Second Quarter and Six Months 2020 Financial and Operating Results, Conference Call and Webcast  \n* [AFG](https://www.businesswire.com/news/home/20200818005745/en/American-Financial-Group-Increases-Annual-Common-Stock) American Financial Group Increases Annual Common Stock Dividend by 11%; Fifteenth Consecutive Year of Dividend Increases  \n* [RXT](https://www.globenewswire.com/news-release/2020/08/18/2080285/0/en/Onica-a-Rackspace-Technology-Company-Introduces-Contact-Center-Intelligence-Solution-Built-on-Amazon-Web-Services.html) Onica Introduces Contact Center Intelligence Solution Built on Amazon Web Services  \n* [MRCY](https://www.globenewswire.com/news-release/2020/08/18/2080274/0/en/Mercury-Systems-Awarded-Patent-for-Cyberattack-Protection-Technology.html) Mercury Systems awarded patent for cyberattack protection technology  \n* [PRTS](https://www.prnewswire.com/news-releases/carpartscom-announces-closing-of-public-offering-of-common-stock-and-full-exercise-of-the-underwriters-over-allotment-option-301114334.html) Announces Closing of Public Offering of Common Stock and Full Exercise of the Underwriters' Over-Allotment Option  \n* [PLV](https://www.businesswire.com/news/home/20200818005691/en/Permianville-Royalty-Trust-Announces-Monthly-Operational-Update) Permianville Royalty Trust Announces Monthly Operational Update  \n* [WM](https://www.businesswire.com/news/home/20200818005718/en/Waste-Management-Announces-Cash-Dividend) Waste Management Announces Cash Dividend  \n* [EYEN](https://www.sec.gov/Archives/edgar/data/1682639/000110465920096532/tm2028879-1_424b5.htm) Eyenovia under pressure on planned equity offering  \n* [JKHY](https://www.sec.gov/Archives/edgar/data/779152/000077915220000061/jkhy-20200630xexhibit9.htm) Jack Henry and Associates falls 6% after earnings report, downside EPS forecast  \n* [MASI](https://www.businesswire.com/news/home/20200818005857/en/New-Studies-Investigate-Accuracy-Noninvasive-Continuous-Hemoglobin) New Studies Investigate the Accuracy of Noninvasive, Continuous Hemoglobin Monitoring with Masimo SpHb® on Neonates  \n\nNote: Seeking A url's and Reddit do not get along.\n\n***Upcoming Earnings:***\n\n* [Earnings Calendar](https://finance.yahoo.com/calendar/earnings/)\n* [Earnings Calendar II](https://tradingeconomics.com/earnings)\n\n***COVID-19 Stats and News:***\n\n* [COVID-19 Stats](https://www.worldometers.info/coronavirus/country/us/)\n* [Latest Map and Case Count](https://www.nytimes.com/interactive/2020/us/coronavirus-us-cases.html)\n* [Universities](https://finance.yahoo.com/news/coronavirus-college-classess-campus-211709998.html) begin U-turns as campus life brings outbreaks\n* [Coronavirus](https://finance.yahoo.com/news/coronavirus-gut-check-how-small-businesses-are-surviving-205917890.html) gut check: How small businesses are surviving\n* [Treasury](https://www.cnbc.com/2020/08/18/us-bonds-treasury-yields-in-focus-amid-economic-data-auctions.html) yields hold steady as investors monitor stimulus deal\n\n***Macro Considerations:***\n\n* [Economic Indicators](https://tradingeconomics.com/united-states/indicators)\n* [Economic Indicator Forecasts](https://tradingeconomics.com/united-states/forecast)\n* [Tracking America’s Recovery](https://www.cnn.com/business/us-economic-recovery-coronavirus)\n\n[***Most Recent SEC Filings***](https://www.lazyfa.com/events/)\n\n* [SEC Form 10-K](https://sec.report/Form/10-K) (Annual Performance)\n* [SEC Form 10-Q](https://sec.report/Form/10-Q) (Quarterly Performance)\n* [SEC Form 8-K](https://sec.report/Form/8-K) (Information of Shareholder Interest)\n* [SEC Form DEFA14A](https://sec.report/Form/DEFA14A) (Upcoming Shareholder Meeting)\n* [SEC Form 4](https://sec.report/Form/4) (Insider Trading)\n* [SEC Form 144](https://sec.report/Form/144) (Insider Selling)\n* [SEC Form 13F](https://sec.report/Form/13F-HR) (Institutional Investment)\n\n***Other***\n\n* [Current Trading Halts](https://www.nasdaqtrader.com/trader.aspx?id=TradeHalts)\n* [Reg SHO Threshold List](https://www.nasdaqtrader.com/trader.aspx?id=RegSHOThreshold)\n* [Short Sale Circuit Breaker](https://www.nasdaqtrader.com/trader.aspx?id=ShortSaleCircuitBreaker)\n* [Highest Short Interest](https://www.highshortinterest.com)\n* [Most Recent Insider Filings](https://m.insidertracking.com)\n* [Fear and Greed Index](https://money.cnn.com/data/fear-and-greed/)\n* [OTC Market Snapshot](https://www.otcmarkets.com)\n* [Highest Implied Volatility](https://www.barchart.com/options/highest-implied-volatility/stocks)\n* [Most Recent IPO Filings](https://www.ipomonitor.com/pages/ipo-filings.html)\n* [Dividend Calendar](https://www.thestreet.com/dividends/index.html)\n* [Most Active Stocks](https://finance.yahoo.com/most-active)\n* [Daily Gainers](https://finance.yahoo.com/screener/predefined/day_gainers)\n* [Daily Losers](https://finance.yahoo.com/screener/predefined/day_losers)\n\n\\-----------------------------------------------\n\n[Morning Research and Trading Prep Tool Kit](https://www.tradinganalysisresources.com/2020/05/free-references-and-resources.html?m=1)\n\nOther Useful Resources:\n\n[The Ultimate Quick Resource For the Amateur Trader.](https://www.reddit.com/r/pennystocks/comments/hcja2q/the_ultimate_quick_resource_for_the_amateur_trader/)\n\nSubscribe to This Brief and the daily 4:00 AM Pre Market Brief on [The Twitter Link Here](https://www.tradinganalysisresources.com/2020/05/free-references-and-resources.html?m=1) . Alerts in the tweets will direct you to the daily brief in this sub\n\nIt is up to you to judge the accuracy and veracity of these headlines before trading.",
        "subreddit": "pennystocks",
        "title": "Your Pre-Market Brief for 08/19/2020",
        "url": "https://www.reddit.com/r/pennystocks/comments/iciv8u/your_premarket_brief_for_08192020/",
        "created": 1597849353.0
    },
    {
        "author": "Trade_Theory",
        "created_utc": 1596513481,
        "id": "i3cbpg",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "The title says it all. Rate my portfolio. I've posted percent allocations of my stock portfolio. I do not plan to post dollar values in order to keep an unbiased opinion. My immediate plan is to sell out of PFF in its entirety and reallocate that position. If you could change one position, what would that be? I have no plans to withdraw funds or retire anytime in the near future. My primary investment objective is growth and secondary is income.\n\n&amp;#x200B;\n\n|PFF|12.2%|\n|:-|:-|\n|MSFT|10.1%|\n|SRET|9.1%|\n|V|5.7%|\n|NEE|4.6%|\n|AAPL|4.3%|\n|XLU|4.0%|\n|SOXX|3.0%|\n|WM|2.2%|\n|XLF|2.1%|\n|BRK.B|2.0%|\n|JJN|1.9%|\n|JPM|1.6%|\n|WFC|1.6%|\n|IWM|1.5%|\n|UAL|1.5%|\n|QCOM|1.5%|\n|NVDA|1.5%|\n|SPYG|1.4%|\n|MLHR|1.4%|\n|SLV|1.4%|\n|INTC|1.3%|\n|LRCX|1.3%|\n|GLD|1.2%|\n|XHB|1.2%|\n|DIS|1.2%|\n|AVGO|1.1%|\n|MA|1.0%|\n|C|1.0%|\n|QQQ|.9%|\n|PG|.9%|\n|AMD|.8%|\n|RTX|.8%|\n|XLE|.7%|\n|XOM|.7%|\n|MDT|.7%|\n|XLP|.6%|\n|BAC|.6%|\n|AEP|.6%|\n|JETS|.6%|\n|MGM|.5%|\n|RDFN|.5%|\n|BA|.5%|\n|XOP|.5%|\n|LOW|.5%|\n|JNJ|.5%|\n|STWD|.5%|\n|XLI|.5%|\n|KO|.5%|\n|TXN|.4%|\n|DAL|.4%|\n|MJ|.4%|\n|AAL|.4%|\n|SPG|.4%|\n|XLB|.4%|\n|XLV|.4%|\n|FISV|.3%|\n|T|.3%|\n|VNQ|.3%|\n|AMTD|.1%|",
        "subreddit": "investing",
        "title": "Rate my stock portfolio",
        "url": "https://www.reddit.com/r/investing/comments/i3cbpg/rate_my_stock_portfolio/",
        "created": 1596542281.0
    },
    {
        "author": "Trade_Theory",
        "created_utc": 1596513522,
        "id": "i3cc1k",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "The title says it all. Rate my portfolio. I've posted percent allocations of my stock portfolio. I do not plan to post dollar values in order to keep an unbiased opinion. My immediate plan is to sell out of PFF in its entirety and reallocate that position. If you could change one position, what would that be? I have no plans to withdraw funds or retire anytime in the near future. My primary investment objective is growth and secondary is income.\n\n&amp;#x200B;\n\n|PFF|12.2%|\n|:-|:-|\n|MSFT|10.1%|\n|SRET|9.1%|\n|V|5.7%|\n|NEE|4.6%|\n|AAPL|4.3%|\n|XLU|4.0%|\n|SOXX|3.0%|\n|WM|2.2%|\n|XLF|2.1%|\n|BRK.B|2.0%|\n|JJN|1.9%|\n|JPM|1.6%|\n|WFC|1.6%|\n|IWM|1.5%|\n|UAL|1.5%|\n|QCOM|1.5%|\n|NVDA|1.5%|\n|SPYG|1.4%|\n|MLHR|1.4%|\n|SLV|1.4%|\n|INTC|1.3%|\n|LRCX|1.3%|\n|GLD|1.2%|\n|XHB|1.2%|\n|DIS|1.2%|\n|AVGO|1.1%|\n|MA|1.0%|\n|C|1.0%|\n|QQQ|.9%|\n|PG|.9%|\n|AMD|.8%|\n|RTX|.8%|\n|XLE|.7%|\n|XOM|.7%|\n|MDT|.7%|\n|XLP|.6%|\n|BAC|.6%|\n|AEP|.6%|\n|JETS|.6%|\n|MGM|.5%|\n|RDFN|.5%|\n|BA|.5%|\n|XOP|.5%|\n|LOW|.5%|\n|JNJ|.5%|\n|STWD|.5%|\n|XLI|.5%|\n|KO|.5%|\n|TXN|.4%|\n|DAL|.4%|\n|MJ|.4%|\n|AAL|.4%|\n|SPG|.4%|\n|XLB|.4%|\n|XLV|.4%|\n|FISV|.3%|\n|T|.3%|\n|VNQ|.3%|\n|AMTD|.1%|",
        "subreddit": "StockMarket",
        "title": "Rate my stock portfolio",
        "url": "https://www.reddit.com/r/StockMarket/comments/i3cc1k/rate_my_stock_portfolio/",
        "created": 1596542322.0
    }
]