[
    {
        "author": "bigbear0083",
        "created_utc": 1580568827,
        "id": "ex76jm",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "Good Saturday afternoon to all of you here on r/wallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning February 3rd, 2020.\n\n# **Stocks stumble into February, one of the weakest months for market  - [(Source)](https://www.cnbc.com/2020/01/31/stocks-stumble-into-february-one-of-the-weakest-months-for-stocks.html)**\n*****\n&gt; As stocks enter the month of February, worries about the coronavirus that slammed stocks in January could continue to be a big market catalyst in the week ahead.\n*****\n&gt; There are lots of other possible drivers for markets, including the January jobs report Friday and other key economic news, which comes as worries grow that the economy was already weakening even without the impact of the rapidly spreading virus. There are also dozens of earnings reports, including Alphabet, Disney and Merck.\n*****\n&gt; Another focus for markets could be the Iowa Democratic presidential caucus Monday, where Vermont Sen. Bernie Sanders could possibly win over former Vice President Joseph Biden.\n*****\n&gt; But the virus headlines could dominate, rattling stocks and continuing to drive investors into the safety of bonds. U.S. airlines Friday said they were discontinuing flights to China, as Beijing tries to contain the transmission of the virus that had infected nearly 10,000 people by Friday.\n*****\n&gt; China’s mainland stock markets reopen Sunday night New York time, and investors will be watching for the ripple effects from that expected decline, though traders have been actively trading Chinese market ETFs.\n*****\n&gt; # Correction or pull back?\n&gt; Stocks are limping into February after January’s disappointing losses, and analysts see more selling ahead as virus headlines rattle markets. But they are divided on whether the selling will soon be capped, or the pullback will reach 5 to 10%.\n*****\n&gt; The S&amp;P 500 fell 1.8% Friday to 3,225, its worst day since October. It was down 2.1% for the week, and ended the month with a 0.2% loss, its first negative month in five.\n*****\n&gt; “February is the third worst month of the year, with an average negative decline of 0.1%, and it’s been up only 53% of the time, versus an average gain for all months of 0.7%,” said Sam Stovall, chief investment strategist at CFRA. Stovall said September and August are the worst and second weakest months for the S&amp;P 500, going back to World War II. In general, stocks are higher 60% of the time, over all months.\n*****\n&gt; On Friday, the S&amp;P 500 was about 3.4% from its Jan. 17 high. “I call a decline of 1% to 5% noise. The closer we get to 5%, the louder the noise,” said Stovall, adding the S&amp;P could decline as much as 10%.\n*****\n&gt; “I think it’s a good possibility, just based on valuation—over 19.6 times forward earnings. That’s the most since 2002,” he said. “By my metrics, we were overvalued by 9 to 12%, so we end up with a deep pullback or a shallow correction.” A correction is when the market loses 10% from its high.\n*****\n&gt; “People have definitely been buying volatility to protect themselves from more of a leg down,” said Patrick Kernan, CEO of Cardinal Capital Corp. “We believe, like last Friday, when the coronavirus really started coming to a head, that people were very nervous ahead of the weekend.” Kernan, who trades S&amp;P options, said investors do not appear to expect a very sharp decline, but they do see more volatility and more downside for stocks.\n*****\n&gt; RBC chief U.S. equity strategist Lori Calvasina said she has been expecting a 5 to 10% decline, even before the virus, but she expected it to be triggered by the primary season. After Monday’s Iowa caucus, the New Hampshire primary is the week after, and Super Tuesday with about a dozen primaries is March 3.\n*****\n&gt; “I still think it’s so early. If you were to see Sanders win, I don’t thinkthe market would like it, but I wouldn’t really change my view,” she said. “I still view it as a 5 to 10% pullback. The election has always been a central contributor to that,” she said.\n*****\n&gt; Stovall said it’s still early in the process and markets could ignore the Iowa vote, even though investors see Sanders’ policies as negative for stocks. Sanders supports Medicare for all; would end oil and gas fracking, and would raise taxes for individuals and companies.\n*****\n&gt; “Only 16 percent of those who have won the Iowa primary have gone on to win the presidency,” he said. Investors do see Sanders as having less chance against President Donald Trump than former Vice President Joseph Biden, who has lagged him in Iowa polls.\n*****\n&gt; Stovall said investors will certainly be monitoring economic data in the week ahead, after fourth quarter GDP showed a slower pace for consumers and business spending remains depressed. This past week, economists were penciling in a short-lived hit to first quarter growth from the virus before it bounces back in the second quarter. But the first quarter could also see a half percentage point hit from Boeing’s production shut down.\n*****\n&gt; Goldman Sachs economists said the virus could shave 0.4 percentage points from first quarter growth but it would mostly recover by the second quarter.\n*****\n&gt; Stovall said he’s watching “a combination of earnings and the jobs report because earnings reports could give clues as to what companies are thinking about the virus and the jobs report should give us additional clues about how strong the economy is,” he said.\n*****\n&gt; The expectations that the virus could hit global growth has sent Treasury yields sharply lower this week, and the dollar has weakened against the majors. The 10-year Treasury yield was at 1.52% Friday afternoon, and strategists say it could continue to move lower. Yields move opposite price.\n*****\n&gt; The 10-year has also fallen below the yield on the 3-month bill, and the curve has become “inverted.” An inverted yield is a recession warning, and those fears are rising again due to the potential impact of the virus on China’s economy and the world economy.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/Ms7pnyW.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/ojanFLC.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/6pUu4Wt.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/eVWWwMR.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/jNie8v1.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/zW7mKhV.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/PhHG14b.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/Ng9rAYd.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/pQNRK2N.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/awNfHLy.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/ZR9zSwK.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/ywB5fTk.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/XqNLwhI.png))**\n###### **([CLICK HERE FOR THE CHART LINK #4!](https://i.imgur.com/zNWfUQ1.png))**\n\n*****\n\n# What a Difference Two Weeks Makes!\n\n&gt; The tone of the market sure did change over the last two weeks! The image below is from our Trend Analyzer screen of US indices as of the close two weeks ago on 1/17. Heading into that weekend, the major US averages were all at 'Overbought' or 'Extreme Overbought' levels, and while their Trend ratings were all positive, the Timing scores for nearly all of them was 'Poor'.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/01/011720-US-Indices-1024x494.png))**\n\n&gt; Fast-forwarding to the present, it's a completely different picture for the major US indices. Today, not a single one of the major US index ETFs is overbought, and a few of them are even oversold. Here's the silver lining, though; since all of their Trend ratings are still positive, their timing scores all currently rank as 'Good'. While not what we would classify as a 'Perfect' set up right now, for investors who have been waiting for a pullback, the window is starting to open.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/01/013120-US-Indices-1024x498.png))**\n\n*****\n\n# Short Circuit\n\n&gt; It was just a week ago that the Philadelphia Semiconductor Index (SOX) gapped sharply higher to record highs on the back of strong earnings from Intel (INTC). So much for that rally. By the end of the day last Friday, the SOX was actually down over 1%, and outside of a rally this past Tuesday, it has traded down every day since. From record highs on Friday morning, the SOX is closing out this week down more than 8% from last Friday's highs and below its 50-day moving average (DMA) for the first time since October. For the last several months, the 50-DMA has acted as support for the SOX, so we'll be watching closely to see how the index holds up in the days ahead. We've repeatedly discussed the importance of the semis as a barometer of the health of the broader market, so it will be important for the group to find its footing soon.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/01/013120-Semis-Chart.png))**\n\n&gt; In terms of the SOX's individual components, the weakness has been broad-based. Since its closing high on 1/23, every member of the SOX besides INTC is down, and INTC is barely up! The average performance of the index's components since 1/23 has been a decline of nearly 9%, and a third of the components are down by double-digit percentages. Semis had been a leadership group for the market as recently as last week, but after the declines over the last five trading days, the average 2020 performance of stocks in the index is a decline of 3.5% and only eight components are up. Even for the semis, this has been a quick reversal.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/01/013120-Semis-Components.png))**\n\n*****\n\n# 49ers Or Chiefs?\n\n&gt; The Super Bowl Indicator suggests stocks rise for the full year when the Super Bowl winner has come from the original National Football League (now the NFC), but when an original American Football League (now the AFC) team has won, stocks have fallen. We would be the first to admit that this indicator has no connection to the stock market, but “data don’t lie”: The S&amp;P 500 Index has performed better, and posted positive gains with greater frequency, over the past 53 Super Bowl games when NFC teams have won. Of course, it doesn’t always work, as stocks did great last year even though the dreaded Patriots (from the AFC) won the Super Bowl.\n\n&gt; A simpler way to look at the Super Bowl indicator is to look at the average gain for the S&amp;P 500 when the NFC has won versus the AFC—and ignore the history of the franchises. As shown in the LPL Chart of the Day, this similar set of criteria has produced an average price return of 10.2% when an NFC team has won, compared with a return of 6.8% with an AFC winner. An NFC winner has produced a positive year 79% of the time, while the S&amp;P 500 has been up only 64% of the time when the winner came from the AFC.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/01/super-bowl-indicator.png?ssl=1))**\n\n&gt; The 49ers have won the Super Bowl five times, putting them just behind the six that the Patriots and Steelers have won. The Chiefs, meanwhile, have won the Super Bowl only once, exactly 50 years ago.\n\n&gt; The year the Chiefs won the Super Bowl (1970), the S&amp;P 500 was virtually flat. Meanwhile, we’ve seen some impressive market returns the years the 49ers made it to the big game. In fact, the S&amp;P 500 has averaged nearly 21% in the six years they made it to the final game, and 19% in the five years they won.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/01/bulls-are-happy-the-49ers-are-in-the-super-bowl.png?ssl=1))**\n\n&gt; “There have been 53 Super Bowl winners, yet only 20 teams account for those wins,” said LPL Financial Senior Market Strategist Ryan Detrick. “And wouldn’t you know it, the 49ers have recorded the third-best market return out of those 20 teams when they win.”\n\n&gt; Here’s a breakdown of the 20 Super Bowl winners and how the S&amp;P 500 has done following their victories.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/01/how-does-the-SP-500-index-do-when-you-team-wins.png?ssl=1))**\n\n&gt; LPL Research would like to reiterate that in no way shape or form do we recommend investing based on this data, but those of us outside of New England can all agree we’re glad the Patriots aren’t in the game! Have a great Super Bowl weekend everyone.\n\n*****\n\n# Viral Outbreak Ends Period of Market Calm\n\n&gt; Fears that the deadly coronavirus would spread further around the globe intensified Monday and led to the biggest one-day drop in the S&amp;P 500 Index since October 8, 2019. In fact, it was the first time the index moved 1% in either direction since early October—spanning 71 trading days. Not only that, but the index’s streak of 30 consecutive days without back-to-back declines, tying the longest such streak in over 60 years as shown in the LPL Chart of the Day, came to an end. Stocks had been eerily calm.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/01/71-days-in-a-row-without-a-1-change-for-the-SP500-index.png?ssl=1))**\n\n&gt; We know from history these calm periods haven’t lasted very long. We were due for some volatility with stocks up about 15% in less than four months and valuations elevated. But a catalyst for a sell-off wasn’t obvious after the U.S.-China phase-one trade deal was signed on January 15. Economic data has been better globally, central banks remain supportive, and the major escalation in the U.S.-Iran conflict had minimal market impact. Then the coronavirus outbreak happened.\n\n&gt; “The coronavirus outbreak brings uncertainty to markets, and investors are understandably nervous,” said LPL Financial Chief Investment Strategist John Lynch. “While economic activity in China is being impacted, particularly travel-related businesses, we expect limited U.S. economic impact as with SARS in 2002–2003, bird flu in 2006, and Zika in 2016.”\n\n&gt; More than 100 deaths have been confirmed out of more than 4,500 cases of the coronavirus. Initial reports suggest this virus may be less deadly than SARS, which led to 774 deaths with more than four times the mortality rate as corona. Our hope at this point is that the current outbreak will be better contained and less deadly than SARS.\n\n&gt; We certainly don’t want to minimize human losses, however, our job is to provide you information on the potential impact to the markets. History tells us that the economic and market impact after potentially similar events tended to be modest and short-lived. The SARS outbreak started in November 2002, global equities bottomed in March 2003, and the outbreak was fully contained by July 2003—several months into the 2003–2007 bull market. The temporary loss of global output was quickly recovered in the third quarter of 2003.\n\n&gt; So while this situation is fluid and unnerving, we would advise suitable investors to stick with their long-term investing plans where appropriate and focus on generally supportive fundamentals of the economy, interest rates, and corporate profits.\n\n*****\n\n# February Almanac: Weak Link in Best Six Months\n\n&gt; Even though February is right in the middle of the Best Six Months, its long-term track record, since 1950, is rather tepid. February ranks no better than sixth and has posted meager average gains except for the Russell 2000. Small cap stocks, benefiting from “January Effect” carry over; tend to outpace large cap stocks in February. The Russell 2000 index of small cap stocks turns in an average gain of 1.2% in February since 1979—just the sixth best month for that benchmark.\n\n&gt; A strong February in 2000 boosts NASDAQ and Russell 2000 rankings in election years. Otherwise, February’s performance, compared to other presidential-election-year months, is mediocre at best with no large-cap index ranked better than seventh (DJIA and S&amp;P 500 since 1950, Russell 1000 since 1979).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/9e34d983528dd8ba9318507afe5ab487/adc248f00c22c241-e9/s400x600/89582e679e67bdacb47f14034f5988f808a89164.jpg))**\n\n*****\n\n# Market May be Immune to Coronavirus\n\n&gt; Over the years the market has built up a rather strong immunity to viruses, outbreak, epidemics and pandemics. While economies and communities around the world have suffered from these outbreaks and the horrific human toll they have taken, the market has proven to be resilient.\n\n&gt; We took a look back at 14 previous such contagions since 1950 and how the market performed right after the disease was confirmed publically by health officials and where the market was 3, 6 and 12 months later.\n\n&gt; HIV/AIDS continue to be an ongoing problem and is the longest running, widest spread and deadliest infectious human disease since the Spanish Flu that killed 50-100 million people worldwide from 1918-1920. HIV/AIDS is estimate to have taken the lives of some 30 million people.\n\n&gt; However, from the time these epidemics have become known to the public at large they have had little negative impact on the S&amp;P 500 since 1950. As you can see in the table here the market was weaker during the outbreaks of the first three on the list, but there were arguably other factors that had a greater impact than these diseases.\n\n&gt; In 1957, during the Asian Flu pandemic the market was pushed into a bear market by a hawkish fed that had been raising interest rates culminating in a bear market bottom in October 1957. The downdraft surrounding the Hong Kong Flu in 1968 was likely cause more by heightened hostilities in the Vietnam War and the related protests and events in the USA that culminated in the bear market bottom on May 26, 1970.\n\n&gt; When the HIV/AIDS epidemic became known in 1981 the market was suffering from the nasty double-dip recession from 1980-1982. The Iraq War held the market down in early 2003 during the SARS outbreak. The sovereign debt crisis and the downgrade of US debt in 2011 likely hurt the market more than the horrendous Haitian Cholera outbreak. The Measles scare in the US in late 2014-early 2015 had little impact on the market, though we suffered a mini-bear in 2015-2016 due to the EU Sovereign Debt Crisis, Brexit fears and the Chinese bear market.\n\n&gt; So while the new Wuhan Coronavirus is a major health and economic concern, especially to the affected areas, if history is any guide, the market is not likely to suffer from it.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/780a4e844cd0844caec4ab4740bc2317/4920c4dbd675407c-06/s500x750/f1421a0eb80bd75fbf0a6a2624c71c8d3a9c5327.jpg))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending January 31st, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED!)\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 2.2.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=291cHBjPndw))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$DIS** \n&gt; * **$GOOGL** \n&gt; * **$SNAP** \n&gt; * **$TWTR** \n&gt; * **$ABBV** \n&gt; * **$F** \n&gt; * **$QCOM** \n&gt; * **$UBER** \n&gt; * **$SYY** \n&gt; * **$SPOT** \n&gt; * **$ON** \n&gt; * **$PINS** \n&gt; * **$TWLO** \n&gt; * **$BMY** \n&gt; * **$CMG** \n&gt; * **$IRBT** \n&gt; * **$CHKP** \n&gt; * **$MRK** \n&gt; * **$CNC** \n&gt; * **$SNE** \n&gt; * **$SIRI** \n&gt; * **$GM** \n&gt; * **$GILD** \n&gt; * **$PTON** \n&gt; * **$BP** \n&gt; * **$ABG** \n&gt; * **$LITE** \n&gt; * **$WYNN** \n&gt; * **$ATVI** \n&gt; * **$CTLT** \n&gt; * **$NSSC** \n&gt; * **$ACM** \n&gt; * **$GOOS** \n&gt; * **$SAIA** \n&gt; * **$DSPG** \n&gt; * **$RACE** \n&gt; * **$RCL** \n&gt; * **$COP** \n&gt; * **$AMG** \n&gt; * **$RL**\n&gt; * **$PLUS** \n&gt; * **$NXPI** \n&gt; * **$MCK** \n&gt; * **$CI**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/pQNRK2N.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/TGOGN8I.png))**\n###### **([CLICK HERE FOR MOST ANTICIPATED EARNINGS RELEASES FOR THE NEXT 5 WEEKS!](https://i.imgur.com/ITFECsE.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 2.3.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/HiGR4EF.png))\n\n\n&gt; # ***Monday 2.3.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/pSEERXv.png))\n\n\n*****\n\n&gt; # ***Tuesday 2.4.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/zqLdRqt.png))\n\n&gt; # ***Tuesday 2.4.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/NLPsraN.png))\n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/Dh1LRRU.png))\n\n*****\n\n&gt; # ***Wednesday 2.5.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/HW6dHyJ.png))\n\n&gt; # ***Wednesday 2.5.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/X2cKKMR.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/0rp0Yyh.png))\n\n*****\n\n&gt; # ***Thursday 2.6.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/02XMggZ.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/aqYNFFo.png))\n\n&gt; # ***Thursday 2.6.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/s4LwHiF.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/evpxdCi.png))\n\n*****\n\n&gt; # ***Friday 2.7.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/DqfZS2l.png))\n\n*****\n\n&gt; # ***Friday 2.7.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/tm9eiYq.png))\n\n*****\n\n# Walt Disney Co $138.31\n&gt; **Walt Disney Co (DIS)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, February 4, 2020. The consensus earnings estimate is $1.43 per share on revenue of $21.08 billion and the Earnings Whisper ® number is $1.51 per share. Investor sentiment going into the company's earnings release has 81% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 22.28% with revenue increasing by 37.75%. Short interest has increased by 5.0% since the company's last earnings release while the stock has drifted lower by 1.4% from its open following the earnings release to be 0.2% above its 200 day moving average of $138.09. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, January 28, 2020 there was some notable buying of 6,678 contracts of the $135.00 call expiring on Friday, July 17, 2020. Option traders are pricing in a 5.6% move on earnings and the stock has averaged a 2.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DIS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Alphabet, Inc. -\n&gt; **Alphabet, Inc. (GOOGL)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, February 3, 2020. The consensus earnings estimate is $12.76 per share on revenue of $38.44 billion and the Earnings Whisper ® number is $13.05 per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 0.08% with revenue decreasing by 2.13%. Short interest has increased by 20.8% since the company's last earnings release while the stock has drifted higher by 12.3% from its open following the earnings release to be 16.1% above its 200 day moving average of $1,234.53. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, January 30, 2020 there was some notable buying of 809 contracts of the $1,340.00 put expiring on Friday, February 21, 2020. Option traders are pricing in a 5.9% move on earnings and the stock has averaged a 4.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=GOOGL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Snap Inc. $18.38\n&gt; **Snap Inc. (SNAP)** is confirmed to report earnings at approximately 4:10 PM ET on Tuesday, February 4, 2020. The consensus earnings estimate is $0.01 per share on revenue of $560.39 million and the Earnings Whisper ® number is $0.03 per share. Investor sentiment going into the company's earnings release has 72% expecting an earnings beat The company's guidance was for revenue of $540.00 million to $560.00 million. Consensus estimates are for year-over-year earnings growth of 133.33% with revenue increasing by 43.76%. Short interest has decreased by 1.4% since the company's last earnings release while the stock has drifted higher by 32.1% from its open following the earnings release to be 17.8% above its 200 day moving average of $15.61. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, January 24, 2020 there was some notable buying of 6,149 contracts of the $19.00 call expiring on Friday, February 7, 2020. Option traders are pricing in a 12.6% move on earnings and the stock has averaged a 11.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SNAP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Twitter, Inc. $32.48\n&gt; **Twitter, Inc. (TWTR)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, February 6, 2020. The consensus earnings estimate is $0.28 per share on revenue of $997.35 million and the Earnings Whisper ® number is $0.31 per share. Investor sentiment going into the company's earnings release has 58% expecting an earnings beat The company's guidance was for revenue of $940.00 million. Consensus estimates are for earnings to decline year-over-year by 12.50% with revenue increasing by 9.74%. Short interest has decreased by 3.0% since the company's last earnings release while the stock has drifted higher by 3.4% from its open following the earnings release to be 11.0% below its 200 day moving average of $36.51. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, January 15, 2020 there was some notable buying of 3,109 contracts of the $32.00 put expiring on Friday, February 21, 2020. Option traders are pricing in a 10.7% move on earnings and the stock has averaged a 15.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TWTR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# AbbVie Inc. $81.02\n&gt; **AbbVie Inc. (ABBV)** is confirmed to report earnings at approximately 7:45 AM ET on Friday, February 7, 2020. The consensus earnings estimate is $2.20 per share on revenue of $8.76 billion and the Earnings Whisper ® number is $2.23 per share. Investor sentiment going into the company's earnings release has 80% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 15.79% with revenue increasing by 5.48%. Short interest has increased by 20.8% since the company's last earnings release while the stock has drifted higher by 1.2% from its open following the earnings release to be 4.9% above its 200 day moving average of $77.22. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, January 30, 2020 there was some notable buying of 3,080 contracts of the $47.50 call expiring on Friday, September 18, 2020. Option traders are pricing in a 4.7% move on earnings and the stock has averaged a 2.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ABBV&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Ford Motor Company $8.82\n&gt; **Ford Motor Company (F)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, February 4, 2020. The consensus earnings estimate is $0.17 per share on revenue of $36.79 billion and the Earnings Whisper ® number is $0.14 per share. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 43.33% with revenue decreasing by 11.97%. Short interest has decreased by 12.6% since the company's last earnings release while the stock has drifted lower by 0.6% from its open following the earnings release to be 7.9% below its 200 day moving average of $9.57. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, January 21, 2020 there was some notable buying of 30,831 contracts of the $9.00 put expiring on Friday, February 14, 2020. Option traders are pricing in a 6.7% move on earnings and the stock has averaged a 7.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=F&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# QUALCOMM Incorporated $85.31\n&gt; **QUALCOMM Incorporated (QCOM)** is confirmed to report earnings at approximately 4:00 PM ET on Wednesday, February 5, 2020. The consensus earnings estimate is $0.85 per share on revenue of $4.83 billion and the Earnings Whisper ® number is $0.88 per share. Investor sentiment going into the company's earnings release has 70% expecting an earnings beat The company's guidance was for earnings of $0.80 to $0.90 per share. Consensus estimates are for earnings to decline year-over-year by 30.33% with revenue decreasing by 0.25%. Short interest has decreased by 28.9% since the company's last earnings release while the stock has drifted lower by 5.0% from its open following the earnings release to be 7.2% above its 200 day moving average of $79.60. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, January 17, 2020 there was some notable buying of 6,082 contracts of the $105.00 call expiring on Friday, February 21, 2020. Option traders are pricing in a 6.3% move on earnings and the stock has averaged a 4.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=QCOM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Uber Technologies, Inc. $36.29\n&gt; **Uber Technologies, Inc. (UBER)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, February 6, 2020. The consensus estimate is for a loss of $0.69 per share on revenue of $4.08 billion and the Earnings Whisper ® number is ($0.55) per share. Investor sentiment going into the company's earnings release has 56% expecting an earnings beat. Short interest has decreased by 11.8% since the company's last earnings release while the stock has drifted higher by 24.6% from its open following the earnings release. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 6.1% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=UBER&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# SYSCO Corp. $82.14\n&gt; **SYSCO Corp. (SYY)** is confirmed to report earnings at approximately 8:00 AM ET on Monday, February 3, 2020. The consensus earnings estimate is $0.83 per share on revenue of $15.09 billion and the Earnings Whisper ® number is $0.85 per share. Investor sentiment going into the company's earnings release has 68% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 10.67% with revenue increasing by 2.20%. Short interest has decreased by 6.4% since the company's last earnings release while the stock has drifted higher by 1.6% from its open following the earnings release to be 7.8% above its 200 day moving average of $76.18. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, January 28, 2020 there was some notable buying of 1,050 contracts of the $83.00 put expiring on Friday, February 21, 2020. Option traders are pricing in a 4.2% move on earnings and the stock has averaged a 4.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SYY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Spotify Technology S.A. $141.30\n&gt; **Spotify Technology S.A. (SPOT)** is confirmed to report earnings at approximately 6:00 AM ET on Wednesday, February 5, 2020. The consensus estimate is for a loss of $0.25 per share on revenue of $2.09 billion and the Earnings Whisper ® number is ($0.19) per share. Investor sentiment going into the company's earnings release has 72% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 160.98% with revenue increasing by 22.44%. Short interest has decreased by 1.0% since the company's last earnings release while the stock has drifted higher by 7.8% from its open following the earnings release to be 1.6% above its 200 day moving average of $139.11. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, January 23, 2020 there was some notable buying of 835 contracts of the $270.00 call expiring on Friday, January 15, 2021. Option traders are pricing in a 8.1% move on earnings and the stock has averaged a 4.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SPOT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/wallstreetbets.",
        "subreddit": "wallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning February 3rd, 2020",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ex76jm/wall_street_week_ahead_for_the_trading_week/",
        "created": 1580597627.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1580568566,
        "id": "ex74hf",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Good Saturday afternoon to all of you here on r/StockMarket. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning February 3rd, 2020.\n\n# **Stocks stumble into February, one of the weakest months for market  - [(Source)](https://www.cnbc.com/2020/01/31/stocks-stumble-into-february-one-of-the-weakest-months-for-stocks.html)**\n*****\n&gt; As stocks enter the month of February, worries about the coronavirus that slammed stocks in January could continue to be a big market catalyst in the week ahead.\n*****\n&gt; There are lots of other possible drivers for markets, including the January jobs report Friday and other key economic news, which comes as worries grow that the economy was already weakening even without the impact of the rapidly spreading virus. There are also dozens of earnings reports, including Alphabet, Disney and Merck.\n*****\n&gt; Another focus for markets could be the Iowa Democratic presidential caucus Monday, where Vermont Sen. Bernie Sanders could possibly win over former Vice President Joseph Biden.\n*****\n&gt; But the virus headlines could dominate, rattling stocks and continuing to drive investors into the safety of bonds. U.S. airlines Friday said they were discontinuing flights to China, as Beijing tries to contain the transmission of the virus that had infected nearly 10,000 people by Friday.\n*****\n&gt; China’s mainland stock markets reopen Sunday night New York time, and investors will be watching for the ripple effects from that expected decline, though traders have been actively trading Chinese market ETFs.\n*****\n&gt; # Correction or pull back?\n&gt; Stocks are limping into February after January’s disappointing losses, and analysts see more selling ahead as virus headlines rattle markets. But they are divided on whether the selling will soon be capped, or the pullback will reach 5 to 10%.\n*****\n&gt; The S&amp;P 500 fell 1.8% Friday to 3,225, its worst day since October. It was down 2.1% for the week, and ended the month with a 0.2% loss, its first negative month in five.\n*****\n&gt; “February is the third worst month of the year, with an average negative decline of 0.1%, and it’s been up only 53% of the time, versus an average gain for all months of 0.7%,” said Sam Stovall, chief investment strategist at CFRA. Stovall said September and August are the worst and second weakest months for the S&amp;P 500, going back to World War II. In general, stocks are higher 60% of the time, over all months.\n*****\n&gt; On Friday, the S&amp;P 500 was about 3.4% from its Jan. 17 high. “I call a decline of 1% to 5% noise. The closer we get to 5%, the louder the noise,” said Stovall, adding the S&amp;P could decline as much as 10%.\n*****\n&gt; “I think it’s a good possibility, just based on valuation—over 19.6 times forward earnings. That’s the most since 2002,” he said. “By my metrics, we were overvalued by 9 to 12%, so we end up with a deep pullback or a shallow correction.” A correction is when the market loses 10% from its high.\n*****\n&gt; “People have definitely been buying volatility to protect themselves from more of a leg down,” said Patrick Kernan, CEO of Cardinal Capital Corp. “We believe, like last Friday, when the coronavirus really started coming to a head, that people were very nervous ahead of the weekend.” Kernan, who trades S&amp;P options, said investors do not appear to expect a very sharp decline, but they do see more volatility and more downside for stocks.\n*****\n&gt; RBC chief U.S. equity strategist Lori Calvasina said she has been expecting a 5 to 10% decline, even before the virus, but she expected it to be triggered by the primary season. After Monday’s Iowa caucus, the New Hampshire primary is the week after, and Super Tuesday with about a dozen primaries is March 3.\n*****\n&gt; “I still think it’s so early. If you were to see Sanders win, I don’t thinkthe market would like it, but I wouldn’t really change my view,” she said. “I still view it as a 5 to 10% pullback. The election has always been a central contributor to that,” she said.\n*****\n&gt; Stovall said it’s still early in the process and markets could ignore the Iowa vote, even though investors see Sanders’ policies as negative for stocks. Sanders supports Medicare for all; would end oil and gas fracking, and would raise taxes for individuals and companies.\n*****\n&gt; “Only 16 percent of those who have won the Iowa primary have gone on to win the presidency,” he said. Investors do see Sanders as having less chance against President Donald Trump than former Vice President Joseph Biden, who has lagged him in Iowa polls.\n*****\n&gt; Stovall said investors will certainly be monitoring economic data in the week ahead, after fourth quarter GDP showed a slower pace for consumers and business spending remains depressed. This past week, economists were penciling in a short-lived hit to first quarter growth from the virus before it bounces back in the second quarter. But the first quarter could also see a half percentage point hit from Boeing’s production shut down.\n*****\n&gt; Goldman Sachs economists said the virus could shave 0.4 percentage points from first quarter growth but it would mostly recover by the second quarter.\n*****\n&gt; Stovall said he’s watching “a combination of earnings and the jobs report because earnings reports could give clues as to what companies are thinking about the virus and the jobs report should give us additional clues about how strong the economy is,” he said.\n*****\n&gt; The expectations that the virus could hit global growth has sent Treasury yields sharply lower this week, and the dollar has weakened against the majors. The 10-year Treasury yield was at 1.52% Friday afternoon, and strategists say it could continue to move lower. Yields move opposite price.\n*****\n&gt; The 10-year has also fallen below the yield on the 3-month bill, and the curve has become “inverted.” An inverted yield is a recession warning, and those fears are rising again due to the potential impact of the virus on China’s economy and the world economy.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/Ms7pnyW.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/ojanFLC.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/6pUu4Wt.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/eVWWwMR.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/jNie8v1.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/zW7mKhV.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/PhHG14b.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/Ng9rAYd.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/pQNRK2N.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/awNfHLy.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/ZR9zSwK.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/ywB5fTk.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/XqNLwhI.png))**\n###### **([CLICK HERE FOR THE CHART LINK #4!](https://i.imgur.com/zNWfUQ1.png))**\n\n*****\n\n# What a Difference Two Weeks Makes!\n\n&gt; The tone of the market sure did change over the last two weeks! The image below is from our Trend Analyzer screen of US indices as of the close two weeks ago on 1/17. Heading into that weekend, the major US averages were all at 'Overbought' or 'Extreme Overbought' levels, and while their Trend ratings were all positive, the Timing scores for nearly all of them was 'Poor'.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/01/011720-US-Indices-1024x494.png))**\n\n&gt; Fast-forwarding to the present, it's a completely different picture for the major US indices. Today, not a single one of the major US index ETFs is overbought, and a few of them are even oversold. Here's the silver lining, though; since all of their Trend ratings are still positive, their timing scores all currently rank as 'Good'. While not what we would classify as a 'Perfect' set up right now, for investors who have been waiting for a pullback, the window is starting to open.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/01/013120-US-Indices-1024x498.png))**\n\n*****\n\n# Short Circuit\n\n&gt; It was just a week ago that the Philadelphia Semiconductor Index (SOX) gapped sharply higher to record highs on the back of strong earnings from Intel (INTC). So much for that rally. By the end of the day last Friday, the SOX was actually down over 1%, and outside of a rally this past Tuesday, it has traded down every day since. From record highs on Friday morning, the SOX is closing out this week down more than 8% from last Friday's highs and below its 50-day moving average (DMA) for the first time since October. For the last several months, the 50-DMA has acted as support for the SOX, so we'll be watching closely to see how the index holds up in the days ahead. We've repeatedly discussed the importance of the semis as a barometer of the health of the broader market, so it will be important for the group to find its footing soon.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/01/013120-Semis-Chart.png))**\n\n&gt; In terms of the SOX's individual components, the weakness has been broad-based. Since its closing high on 1/23, every member of the SOX besides INTC is down, and INTC is barely up! The average performance of the index's components since 1/23 has been a decline of nearly 9%, and a third of the components are down by double-digit percentages. Semis had been a leadership group for the market as recently as last week, but after the declines over the last five trading days, the average 2020 performance of stocks in the index is a decline of 3.5% and only eight components are up. Even for the semis, this has been a quick reversal.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/01/013120-Semis-Components.png))**\n\n*****\n\n# 49ers Or Chiefs?\n\n&gt; The Super Bowl Indicator suggests stocks rise for the full year when the Super Bowl winner has come from the original National Football League (now the NFC), but when an original American Football League (now the AFC) team has won, stocks have fallen. We would be the first to admit that this indicator has no connection to the stock market, but “data don’t lie”: The S&amp;P 500 Index has performed better, and posted positive gains with greater frequency, over the past 53 Super Bowl games when NFC teams have won. Of course, it doesn’t always work, as stocks did great last year even though the dreaded Patriots (from the AFC) won the Super Bowl.\n\n&gt; A simpler way to look at the Super Bowl indicator is to look at the average gain for the S&amp;P 500 when the NFC has won versus the AFC—and ignore the history of the franchises. As shown in the LPL Chart of the Day, this similar set of criteria has produced an average price return of 10.2% when an NFC team has won, compared with a return of 6.8% with an AFC winner. An NFC winner has produced a positive year 79% of the time, while the S&amp;P 500 has been up only 64% of the time when the winner came from the AFC.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/01/super-bowl-indicator.png?ssl=1))**\n\n&gt; The 49ers have won the Super Bowl five times, putting them just behind the six that the Patriots and Steelers have won. The Chiefs, meanwhile, have won the Super Bowl only once, exactly 50 years ago.\n\n&gt; The year the Chiefs won the Super Bowl (1970), the S&amp;P 500 was virtually flat. Meanwhile, we’ve seen some impressive market returns the years the 49ers made it to the big game. In fact, the S&amp;P 500 has averaged nearly 21% in the six years they made it to the final game, and 19% in the five years they won.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/01/bulls-are-happy-the-49ers-are-in-the-super-bowl.png?ssl=1))**\n\n&gt; “There have been 53 Super Bowl winners, yet only 20 teams account for those wins,” said LPL Financial Senior Market Strategist Ryan Detrick. “And wouldn’t you know it, the 49ers have recorded the third-best market return out of those 20 teams when they win.”\n\n&gt; Here’s a breakdown of the 20 Super Bowl winners and how the S&amp;P 500 has done following their victories.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/01/how-does-the-SP-500-index-do-when-you-team-wins.png?ssl=1))**\n\n&gt; LPL Research would like to reiterate that in no way shape or form do we recommend investing based on this data, but those of us outside of New England can all agree we’re glad the Patriots aren’t in the game! Have a great Super Bowl weekend everyone.\n\n*****\n\n# Viral Outbreak Ends Period of Market Calm\n\n&gt; Fears that the deadly coronavirus would spread further around the globe intensified Monday and led to the biggest one-day drop in the S&amp;P 500 Index since October 8, 2019. In fact, it was the first time the index moved 1% in either direction since early October—spanning 71 trading days. Not only that, but the index’s streak of 30 consecutive days without back-to-back declines, tying the longest such streak in over 60 years as shown in the LPL Chart of the Day, came to an end. Stocks had been eerily calm.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/01/71-days-in-a-row-without-a-1-change-for-the-SP500-index.png?ssl=1))**\n\n&gt; We know from history these calm periods haven’t lasted very long. We were due for some volatility with stocks up about 15% in less than four months and valuations elevated. But a catalyst for a sell-off wasn’t obvious after the U.S.-China phase-one trade deal was signed on January 15. Economic data has been better globally, central banks remain supportive, and the major escalation in the U.S.-Iran conflict had minimal market impact. Then the coronavirus outbreak happened.\n\n&gt; “The coronavirus outbreak brings uncertainty to markets, and investors are understandably nervous,” said LPL Financial Chief Investment Strategist John Lynch. “While economic activity in China is being impacted, particularly travel-related businesses, we expect limited U.S. economic impact as with SARS in 2002–2003, bird flu in 2006, and Zika in 2016.”\n\n&gt; More than 100 deaths have been confirmed out of more than 4,500 cases of the coronavirus. Initial reports suggest this virus may be less deadly than SARS, which led to 774 deaths with more than four times the mortality rate as corona. Our hope at this point is that the current outbreak will be better contained and less deadly than SARS.\n\n&gt; We certainly don’t want to minimize human losses, however, our job is to provide you information on the potential impact to the markets. History tells us that the economic and market impact after potentially similar events tended to be modest and short-lived. The SARS outbreak started in November 2002, global equities bottomed in March 2003, and the outbreak was fully contained by July 2003—several months into the 2003–2007 bull market. The temporary loss of global output was quickly recovered in the third quarter of 2003.\n\n&gt; So while this situation is fluid and unnerving, we would advise suitable investors to stick with their long-term investing plans where appropriate and focus on generally supportive fundamentals of the economy, interest rates, and corporate profits.\n\n*****\n\n# February Almanac: Weak Link in Best Six Months\n\n&gt; Even though February is right in the middle of the Best Six Months, its long-term track record, since 1950, is rather tepid. February ranks no better than sixth and has posted meager average gains except for the Russell 2000. Small cap stocks, benefiting from “January Effect” carry over; tend to outpace large cap stocks in February. The Russell 2000 index of small cap stocks turns in an average gain of 1.2% in February since 1979—just the sixth best month for that benchmark.\n\n&gt; A strong February in 2000 boosts NASDAQ and Russell 2000 rankings in election years. Otherwise, February’s performance, compared to other presidential-election-year months, is mediocre at best with no large-cap index ranked better than seventh (DJIA and S&amp;P 500 since 1950, Russell 1000 since 1979).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/9e34d983528dd8ba9318507afe5ab487/adc248f00c22c241-e9/s400x600/89582e679e67bdacb47f14034f5988f808a89164.jpg))**\n\n*****\n\n# Market May be Immune to Coronavirus\n\n&gt; Over the years the market has built up a rather strong immunity to viruses, outbreak, epidemics and pandemics. While economies and communities around the world have suffered from these outbreaks and the horrific human toll they have taken, the market has proven to be resilient.\n\n&gt; We took a look back at 14 previous such contagions since 1950 and how the market performed right after the disease was confirmed publically by health officials and where the market was 3, 6 and 12 months later.\n\n&gt; HIV/AIDS continue to be an ongoing problem and is the longest running, widest spread and deadliest infectious human disease since the Spanish Flu that killed 50-100 million people worldwide from 1918-1920. HIV/AIDS is estimate to have taken the lives of some 30 million people.\n\n&gt; However, from the time these epidemics have become known to the public at large they have had little negative impact on the S&amp;P 500 since 1950. As you can see in the table here the market was weaker during the outbreaks of the first three on the list, but there were arguably other factors that had a greater impact than these diseases.\n\n&gt; In 1957, during the Asian Flu pandemic the market was pushed into a bear market by a hawkish fed that had been raising interest rates culminating in a bear market bottom in October 1957. The downdraft surrounding the Hong Kong Flu in 1968 was likely cause more by heightened hostilities in the Vietnam War and the related protests and events in the USA that culminated in the bear market bottom on May 26, 1970.\n\n&gt; When the HIV/AIDS epidemic became known in 1981 the market was suffering from the nasty double-dip recession from 1980-1982. The Iraq War held the market down in early 2003 during the SARS outbreak. The sovereign debt crisis and the downgrade of US debt in 2011 likely hurt the market more than the horrendous Haitian Cholera outbreak. The Measles scare in the US in late 2014-early 2015 had little impact on the market, though we suffered a mini-bear in 2015-2016 due to the EU Sovereign Debt Crisis, Brexit fears and the Chinese bear market.\n\n&gt; So while the new Wuhan Coronavirus is a major health and economic concern, especially to the affected areas, if history is any guide, the market is not likely to suffer from it.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/780a4e844cd0844caec4ab4740bc2317/4920c4dbd675407c-06/s500x750/f1421a0eb80bd75fbf0a6a2624c71c8d3a9c5327.jpg))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending January 31st, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED!)\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 2.2.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=291cHBjPndw))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$DIS** \n&gt; * **$GOOGL** \n&gt; * **$SNAP** \n&gt; * **$TWTR** \n&gt; * **$ABBV** \n&gt; * **$F** \n&gt; * **$QCOM** \n&gt; * **$UBER** \n&gt; * **$SYY** \n&gt; * **$SPOT** \n&gt; * **$ON** \n&gt; * **$PINS** \n&gt; * **$TWLO** \n&gt; * **$BMY** \n&gt; * **$CMG** \n&gt; * **$IRBT** \n&gt; * **$CHKP** \n&gt; * **$MRK** \n&gt; * **$CNC** \n&gt; * **$SNE** \n&gt; * **$SIRI** \n&gt; * **$GM** \n&gt; * **$GILD** \n&gt; * **$PTON** \n&gt; * **$BP** \n&gt; * **$ABG** \n&gt; * **$LITE** \n&gt; * **$WYNN** \n&gt; * **$ATVI** \n&gt; * **$CTLT** \n&gt; * **$NSSC** \n&gt; * **$ACM** \n&gt; * **$GOOS** \n&gt; * **$SAIA** \n&gt; * **$DSPG** \n&gt; * **$RACE** \n&gt; * **$RCL** \n&gt; * **$COP** \n&gt; * **$AMG** \n&gt; * **$RL**\n&gt; * **$PLUS** \n&gt; * **$NXPI** \n&gt; * **$MCK** \n&gt; * **$CI**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/pQNRK2N.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/TGOGN8I.png))**\n###### **([CLICK HERE FOR MOST ANTICIPATED EARNINGS RELEASES FOR THE NEXT 5 WEEKS!](https://i.imgur.com/ITFECsE.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 2.3.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/HiGR4EF.png))\n\n\n&gt; # ***Monday 2.3.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/pSEERXv.png))\n\n\n*****\n\n&gt; # ***Tuesday 2.4.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/zqLdRqt.png))\n\n&gt; # ***Tuesday 2.4.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/NLPsraN.png))\n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/Dh1LRRU.png))\n\n*****\n\n&gt; # ***Wednesday 2.5.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/HW6dHyJ.png))\n\n&gt; # ***Wednesday 2.5.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/X2cKKMR.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/0rp0Yyh.png))\n\n*****\n\n&gt; # ***Thursday 2.6.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/02XMggZ.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/aqYNFFo.png))\n\n&gt; # ***Thursday 2.6.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/s4LwHiF.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/evpxdCi.png))\n\n*****\n\n&gt; # ***Friday 2.7.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/DqfZS2l.png))\n\n*****\n\n&gt; # ***Friday 2.7.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/tm9eiYq.png))\n\n*****\n\n# Walt Disney Co $138.31\n&gt; **Walt Disney Co (DIS)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, February 4, 2020. The consensus earnings estimate is $1.43 per share on revenue of $21.08 billion and the Earnings Whisper ® number is $1.51 per share. Investor sentiment going into the company's earnings release has 81% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 22.28% with revenue increasing by 37.75%. Short interest has increased by 5.0% since the company's last earnings release while the stock has drifted lower by 1.4% from its open following the earnings release to be 0.2% above its 200 day moving average of $138.09. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, January 28, 2020 there was some notable buying of 6,678 contracts of the $135.00 call expiring on Friday, July 17, 2020. Option traders are pricing in a 5.6% move on earnings and the stock has averaged a 2.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DIS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Alphabet, Inc. -\n&gt; **Alphabet, Inc. (GOOGL)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, February 3, 2020. The consensus earnings estimate is $12.76 per share on revenue of $38.44 billion and the Earnings Whisper ® number is $13.05 per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 0.08% with revenue decreasing by 2.13%. Short interest has increased by 20.8% since the company's last earnings release while the stock has drifted higher by 12.3% from its open following the earnings release to be 16.1% above its 200 day moving average of $1,234.53. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, January 30, 2020 there was some notable buying of 809 contracts of the $1,340.00 put expiring on Friday, February 21, 2020. Option traders are pricing in a 5.9% move on earnings and the stock has averaged a 4.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=GOOGL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Snap Inc. $18.38\n&gt; **Snap Inc. (SNAP)** is confirmed to report earnings at approximately 4:10 PM ET on Tuesday, February 4, 2020. The consensus earnings estimate is $0.01 per share on revenue of $560.39 million and the Earnings Whisper ® number is $0.03 per share. Investor sentiment going into the company's earnings release has 72% expecting an earnings beat The company's guidance was for revenue of $540.00 million to $560.00 million. Consensus estimates are for year-over-year earnings growth of 133.33% with revenue increasing by 43.76%. Short interest has decreased by 1.4% since the company's last earnings release while the stock has drifted higher by 32.1% from its open following the earnings release to be 17.8% above its 200 day moving average of $15.61. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, January 24, 2020 there was some notable buying of 6,149 contracts of the $19.00 call expiring on Friday, February 7, 2020. Option traders are pricing in a 12.6% move on earnings and the stock has averaged a 11.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SNAP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Twitter, Inc. $32.48\n&gt; **Twitter, Inc. (TWTR)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, February 6, 2020. The consensus earnings estimate is $0.28 per share on revenue of $997.35 million and the Earnings Whisper ® number is $0.31 per share. Investor sentiment going into the company's earnings release has 58% expecting an earnings beat The company's guidance was for revenue of $940.00 million. Consensus estimates are for earnings to decline year-over-year by 12.50% with revenue increasing by 9.74%. Short interest has decreased by 3.0% since the company's last earnings release while the stock has drifted higher by 3.4% from its open following the earnings release to be 11.0% below its 200 day moving average of $36.51. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, January 15, 2020 there was some notable buying of 3,109 contracts of the $32.00 put expiring on Friday, February 21, 2020. Option traders are pricing in a 10.7% move on earnings and the stock has averaged a 15.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TWTR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# AbbVie Inc. $81.02\n&gt; **AbbVie Inc. (ABBV)** is confirmed to report earnings at approximately 7:45 AM ET on Friday, February 7, 2020. The consensus earnings estimate is $2.20 per share on revenue of $8.76 billion and the Earnings Whisper ® number is $2.23 per share. Investor sentiment going into the company's earnings release has 80% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 15.79% with revenue increasing by 5.48%. Short interest has increased by 20.8% since the company's last earnings release while the stock has drifted higher by 1.2% from its open following the earnings release to be 4.9% above its 200 day moving average of $77.22. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, January 30, 2020 there was some notable buying of 3,080 contracts of the $47.50 call expiring on Friday, September 18, 2020. Option traders are pricing in a 4.7% move on earnings and the stock has averaged a 2.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ABBV&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Ford Motor Company $8.82\n&gt; **Ford Motor Company (F)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, February 4, 2020. The consensus earnings estimate is $0.17 per share on revenue of $36.79 billion and the Earnings Whisper ® number is $0.14 per share. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 43.33% with revenue decreasing by 11.97%. Short interest has decreased by 12.6% since the company's last earnings release while the stock has drifted lower by 0.6% from its open following the earnings release to be 7.9% below its 200 day moving average of $9.57. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, January 21, 2020 there was some notable buying of 30,831 contracts of the $9.00 put expiring on Friday, February 14, 2020. Option traders are pricing in a 6.7% move on earnings and the stock has averaged a 7.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=F&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# QUALCOMM Incorporated $85.31\n&gt; **QUALCOMM Incorporated (QCOM)** is confirmed to report earnings at approximately 4:00 PM ET on Wednesday, February 5, 2020. The consensus earnings estimate is $0.85 per share on revenue of $4.83 billion and the Earnings Whisper ® number is $0.88 per share. Investor sentiment going into the company's earnings release has 70% expecting an earnings beat The company's guidance was for earnings of $0.80 to $0.90 per share. Consensus estimates are for earnings to decline year-over-year by 30.33% with revenue decreasing by 0.25%. Short interest has decreased by 28.9% since the company's last earnings release while the stock has drifted lower by 5.0% from its open following the earnings release to be 7.2% above its 200 day moving average of $79.60. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, January 17, 2020 there was some notable buying of 6,082 contracts of the $105.00 call expiring on Friday, February 21, 2020. Option traders are pricing in a 6.3% move on earnings and the stock has averaged a 4.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=QCOM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Uber Technologies, Inc. $36.29\n&gt; **Uber Technologies, Inc. (UBER)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, February 6, 2020. The consensus estimate is for a loss of $0.69 per share on revenue of $4.08 billion and the Earnings Whisper ® number is ($0.55) per share. Investor sentiment going into the company's earnings release has 56% expecting an earnings beat. Short interest has decreased by 11.8% since the company's last earnings release while the stock has drifted higher by 24.6% from its open following the earnings release. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 6.1% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=UBER&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# SYSCO Corp. $82.14\n&gt; **SYSCO Corp. (SYY)** is confirmed to report earnings at approximately 8:00 AM ET on Monday, February 3, 2020. The consensus earnings estimate is $0.83 per share on revenue of $15.09 billion and the Earnings Whisper ® number is $0.85 per share. Investor sentiment going into the company's earnings release has 68% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 10.67% with revenue increasing by 2.20%. Short interest has decreased by 6.4% since the company's last earnings release while the stock has drifted higher by 1.6% from its open following the earnings release to be 7.8% above its 200 day moving average of $76.18. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, January 28, 2020 there was some notable buying of 1,050 contracts of the $83.00 put expiring on Friday, February 21, 2020. Option traders are pricing in a 4.2% move on earnings and the stock has averaged a 4.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SYY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Spotify Technology S.A. $141.30\n&gt; **Spotify Technology S.A. (SPOT)** is confirmed to report earnings at approximately 6:00 AM ET on Wednesday, February 5, 2020. The consensus estimate is for a loss of $0.25 per share on revenue of $2.09 billion and the Earnings Whisper ® number is ($0.19) per share. Investor sentiment going into the company's earnings release has 72% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 160.98% with revenue increasing by 22.44%. Short interest has decreased by 1.0% since the company's last earnings release while the stock has drifted higher by 7.8% from its open following the earnings release to be 1.6% above its 200 day moving average of $139.11. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, January 23, 2020 there was some notable buying of 835 contracts of the $270.00 call expiring on Friday, January 15, 2021. Option traders are pricing in a 8.1% move on earnings and the stock has averaged a 4.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SPOT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/StockMarket.",
        "subreddit": "StockMarket",
        "title": "Wall Street Week Ahead for the trading week beginning February 3rd, 2020",
        "url": "https://www.reddit.com/r/StockMarket/comments/ex74hf/wall_street_week_ahead_for_the_trading_week/",
        "created": 1580597366.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1580568706,
        "id": "ex75kx",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Good Saturday afternoon to all of you here on r/stocks. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning February 3rd, 2020.\n\n# **Stocks stumble into February, one of the weakest months for market  - [(Source)](https://www.cnbc.com/2020/01/31/stocks-stumble-into-february-one-of-the-weakest-months-for-stocks.html)**\n*****\n&gt; As stocks enter the month of February, worries about the coronavirus that slammed stocks in January could continue to be a big market catalyst in the week ahead.\n*****\n&gt; There are lots of other possible drivers for markets, including the January jobs report Friday and other key economic news, which comes as worries grow that the economy was already weakening even without the impact of the rapidly spreading virus. There are also dozens of earnings reports, including Alphabet, Disney and Merck.\n*****\n&gt; Another focus for markets could be the Iowa Democratic presidential caucus Monday, where Vermont Sen. Bernie Sanders could possibly win over former Vice President Joseph Biden.\n*****\n&gt; But the virus headlines could dominate, rattling stocks and continuing to drive investors into the safety of bonds. U.S. airlines Friday said they were discontinuing flights to China, as Beijing tries to contain the transmission of the virus that had infected nearly 10,000 people by Friday.\n*****\n&gt; China’s mainland stock markets reopen Sunday night New York time, and investors will be watching for the ripple effects from that expected decline, though traders have been actively trading Chinese market ETFs.\n*****\n&gt; # Correction or pull back?\n&gt; Stocks are limping into February after January’s disappointing losses, and analysts see more selling ahead as virus headlines rattle markets. But they are divided on whether the selling will soon be capped, or the pullback will reach 5 to 10%.\n*****\n&gt; The S&amp;P 500 fell 1.8% Friday to 3,225, its worst day since October. It was down 2.1% for the week, and ended the month with a 0.2% loss, its first negative month in five.\n*****\n&gt; “February is the third worst month of the year, with an average negative decline of 0.1%, and it’s been up only 53% of the time, versus an average gain for all months of 0.7%,” said Sam Stovall, chief investment strategist at CFRA. Stovall said September and August are the worst and second weakest months for the S&amp;P 500, going back to World War II. In general, stocks are higher 60% of the time, over all months.\n*****\n&gt; On Friday, the S&amp;P 500 was about 3.4% from its Jan. 17 high. “I call a decline of 1% to 5% noise. The closer we get to 5%, the louder the noise,” said Stovall, adding the S&amp;P could decline as much as 10%.\n*****\n&gt; “I think it’s a good possibility, just based on valuation—over 19.6 times forward earnings. That’s the most since 2002,” he said. “By my metrics, we were overvalued by 9 to 12%, so we end up with a deep pullback or a shallow correction.” A correction is when the market loses 10% from its high.\n*****\n&gt; “People have definitely been buying volatility to protect themselves from more of a leg down,” said Patrick Kernan, CEO of Cardinal Capital Corp. “We believe, like last Friday, when the coronavirus really started coming to a head, that people were very nervous ahead of the weekend.” Kernan, who trades S&amp;P options, said investors do not appear to expect a very sharp decline, but they do see more volatility and more downside for stocks.\n*****\n&gt; RBC chief U.S. equity strategist Lori Calvasina said she has been expecting a 5 to 10% decline, even before the virus, but she expected it to be triggered by the primary season. After Monday’s Iowa caucus, the New Hampshire primary is the week after, and Super Tuesday with about a dozen primaries is March 3.\n*****\n&gt; “I still think it’s so early. If you were to see Sanders win, I don’t thinkthe market would like it, but I wouldn’t really change my view,” she said. “I still view it as a 5 to 10% pullback. The election has always been a central contributor to that,” she said.\n*****\n&gt; Stovall said it’s still early in the process and markets could ignore the Iowa vote, even though investors see Sanders’ policies as negative for stocks. Sanders supports Medicare for all; would end oil and gas fracking, and would raise taxes for individuals and companies.\n*****\n&gt; “Only 16 percent of those who have won the Iowa primary have gone on to win the presidency,” he said. Investors do see Sanders as having less chance against President Donald Trump than former Vice President Joseph Biden, who has lagged him in Iowa polls.\n*****\n&gt; Stovall said investors will certainly be monitoring economic data in the week ahead, after fourth quarter GDP showed a slower pace for consumers and business spending remains depressed. This past week, economists were penciling in a short-lived hit to first quarter growth from the virus before it bounces back in the second quarter. But the first quarter could also see a half percentage point hit from Boeing’s production shut down.\n*****\n&gt; Goldman Sachs economists said the virus could shave 0.4 percentage points from first quarter growth but it would mostly recover by the second quarter.\n*****\n&gt; Stovall said he’s watching “a combination of earnings and the jobs report because earnings reports could give clues as to what companies are thinking about the virus and the jobs report should give us additional clues about how strong the economy is,” he said.\n*****\n&gt; The expectations that the virus could hit global growth has sent Treasury yields sharply lower this week, and the dollar has weakened against the majors. The 10-year Treasury yield was at 1.52% Friday afternoon, and strategists say it could continue to move lower. Yields move opposite price.\n*****\n&gt; The 10-year has also fallen below the yield on the 3-month bill, and the curve has become “inverted.” An inverted yield is a recession warning, and those fears are rising again due to the potential impact of the virus on China’s economy and the world economy.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/Ms7pnyW.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/ojanFLC.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/6pUu4Wt.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/eVWWwMR.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/jNie8v1.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/zW7mKhV.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/PhHG14b.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/Ng9rAYd.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/pQNRK2N.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/awNfHLy.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/ZR9zSwK.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/ywB5fTk.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/XqNLwhI.png))**\n###### **([CLICK HERE FOR THE CHART LINK #4!](https://i.imgur.com/zNWfUQ1.png))**\n\n*****\n\n# What a Difference Two Weeks Makes!\n\n&gt; The tone of the market sure did change over the last two weeks! The image below is from our Trend Analyzer screen of US indices as of the close two weeks ago on 1/17. Heading into that weekend, the major US averages were all at 'Overbought' or 'Extreme Overbought' levels, and while their Trend ratings were all positive, the Timing scores for nearly all of them was 'Poor'.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/01/011720-US-Indices-1024x494.png))**\n\n&gt; Fast-forwarding to the present, it's a completely different picture for the major US indices. Today, not a single one of the major US index ETFs is overbought, and a few of them are even oversold. Here's the silver lining, though; since all of their Trend ratings are still positive, their timing scores all currently rank as 'Good'. While not what we would classify as a 'Perfect' set up right now, for investors who have been waiting for a pullback, the window is starting to open.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/01/013120-US-Indices-1024x498.png))**\n\n*****\n\n# Short Circuit\n\n&gt; It was just a week ago that the Philadelphia Semiconductor Index (SOX) gapped sharply higher to record highs on the back of strong earnings from Intel (INTC). So much for that rally. By the end of the day last Friday, the SOX was actually down over 1%, and outside of a rally this past Tuesday, it has traded down every day since. From record highs on Friday morning, the SOX is closing out this week down more than 8% from last Friday's highs and below its 50-day moving average (DMA) for the first time since October. For the last several months, the 50-DMA has acted as support for the SOX, so we'll be watching closely to see how the index holds up in the days ahead. We've repeatedly discussed the importance of the semis as a barometer of the health of the broader market, so it will be important for the group to find its footing soon.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/01/013120-Semis-Chart.png))**\n\n&gt; In terms of the SOX's individual components, the weakness has been broad-based. Since its closing high on 1/23, every member of the SOX besides INTC is down, and INTC is barely up! The average performance of the index's components since 1/23 has been a decline of nearly 9%, and a third of the components are down by double-digit percentages. Semis had been a leadership group for the market as recently as last week, but after the declines over the last five trading days, the average 2020 performance of stocks in the index is a decline of 3.5% and only eight components are up. Even for the semis, this has been a quick reversal.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/01/013120-Semis-Components.png))**\n\n*****\n\n# 49ers Or Chiefs?\n\n&gt; The Super Bowl Indicator suggests stocks rise for the full year when the Super Bowl winner has come from the original National Football League (now the NFC), but when an original American Football League (now the AFC) team has won, stocks have fallen. We would be the first to admit that this indicator has no connection to the stock market, but “data don’t lie”: The S&amp;P 500 Index has performed better, and posted positive gains with greater frequency, over the past 53 Super Bowl games when NFC teams have won. Of course, it doesn’t always work, as stocks did great last year even though the dreaded Patriots (from the AFC) won the Super Bowl.\n\n&gt; A simpler way to look at the Super Bowl indicator is to look at the average gain for the S&amp;P 500 when the NFC has won versus the AFC—and ignore the history of the franchises. As shown in the LPL Chart of the Day, this similar set of criteria has produced an average price return of 10.2% when an NFC team has won, compared with a return of 6.8% with an AFC winner. An NFC winner has produced a positive year 79% of the time, while the S&amp;P 500 has been up only 64% of the time when the winner came from the AFC.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/01/super-bowl-indicator.png?ssl=1))**\n\n&gt; The 49ers have won the Super Bowl five times, putting them just behind the six that the Patriots and Steelers have won. The Chiefs, meanwhile, have won the Super Bowl only once, exactly 50 years ago.\n\n&gt; The year the Chiefs won the Super Bowl (1970), the S&amp;P 500 was virtually flat. Meanwhile, we’ve seen some impressive market returns the years the 49ers made it to the big game. In fact, the S&amp;P 500 has averaged nearly 21% in the six years they made it to the final game, and 19% in the five years they won.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/01/bulls-are-happy-the-49ers-are-in-the-super-bowl.png?ssl=1))**\n\n&gt; “There have been 53 Super Bowl winners, yet only 20 teams account for those wins,” said LPL Financial Senior Market Strategist Ryan Detrick. “And wouldn’t you know it, the 49ers have recorded the third-best market return out of those 20 teams when they win.”\n\n&gt; Here’s a breakdown of the 20 Super Bowl winners and how the S&amp;P 500 has done following their victories.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/01/how-does-the-SP-500-index-do-when-you-team-wins.png?ssl=1))**\n\n&gt; LPL Research would like to reiterate that in no way shape or form do we recommend investing based on this data, but those of us outside of New England can all agree we’re glad the Patriots aren’t in the game! Have a great Super Bowl weekend everyone.\n\n*****\n\n# Viral Outbreak Ends Period of Market Calm\n\n&gt; Fears that the deadly coronavirus would spread further around the globe intensified Monday and led to the biggest one-day drop in the S&amp;P 500 Index since October 8, 2019. In fact, it was the first time the index moved 1% in either direction since early October—spanning 71 trading days. Not only that, but the index’s streak of 30 consecutive days without back-to-back declines, tying the longest such streak in over 60 years as shown in the LPL Chart of the Day, came to an end. Stocks had been eerily calm.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/01/71-days-in-a-row-without-a-1-change-for-the-SP500-index.png?ssl=1))**\n\n&gt; We know from history these calm periods haven’t lasted very long. We were due for some volatility with stocks up about 15% in less than four months and valuations elevated. But a catalyst for a sell-off wasn’t obvious after the U.S.-China phase-one trade deal was signed on January 15. Economic data has been better globally, central banks remain supportive, and the major escalation in the U.S.-Iran conflict had minimal market impact. Then the coronavirus outbreak happened.\n\n&gt; “The coronavirus outbreak brings uncertainty to markets, and investors are understandably nervous,” said LPL Financial Chief Investment Strategist John Lynch. “While economic activity in China is being impacted, particularly travel-related businesses, we expect limited U.S. economic impact as with SARS in 2002–2003, bird flu in 2006, and Zika in 2016.”\n\n&gt; More than 100 deaths have been confirmed out of more than 4,500 cases of the coronavirus. Initial reports suggest this virus may be less deadly than SARS, which led to 774 deaths with more than four times the mortality rate as corona. Our hope at this point is that the current outbreak will be better contained and less deadly than SARS.\n\n&gt; We certainly don’t want to minimize human losses, however, our job is to provide you information on the potential impact to the markets. History tells us that the economic and market impact after potentially similar events tended to be modest and short-lived. The SARS outbreak started in November 2002, global equities bottomed in March 2003, and the outbreak was fully contained by July 2003—several months into the 2003–2007 bull market. The temporary loss of global output was quickly recovered in the third quarter of 2003.\n\n&gt; So while this situation is fluid and unnerving, we would advise suitable investors to stick with their long-term investing plans where appropriate and focus on generally supportive fundamentals of the economy, interest rates, and corporate profits.\n\n*****\n\n# February Almanac: Weak Link in Best Six Months\n\n&gt; Even though February is right in the middle of the Best Six Months, its long-term track record, since 1950, is rather tepid. February ranks no better than sixth and has posted meager average gains except for the Russell 2000. Small cap stocks, benefiting from “January Effect” carry over; tend to outpace large cap stocks in February. The Russell 2000 index of small cap stocks turns in an average gain of 1.2% in February since 1979—just the sixth best month for that benchmark.\n\n&gt; A strong February in 2000 boosts NASDAQ and Russell 2000 rankings in election years. Otherwise, February’s performance, compared to other presidential-election-year months, is mediocre at best with no large-cap index ranked better than seventh (DJIA and S&amp;P 500 since 1950, Russell 1000 since 1979).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/9e34d983528dd8ba9318507afe5ab487/adc248f00c22c241-e9/s400x600/89582e679e67bdacb47f14034f5988f808a89164.jpg))**\n\n*****\n\n# Market May be Immune to Coronavirus\n\n&gt; Over the years the market has built up a rather strong immunity to viruses, outbreak, epidemics and pandemics. While economies and communities around the world have suffered from these outbreaks and the horrific human toll they have taken, the market has proven to be resilient.\n\n&gt; We took a look back at 14 previous such contagions since 1950 and how the market performed right after the disease was confirmed publically by health officials and where the market was 3, 6 and 12 months later.\n\n&gt; HIV/AIDS continue to be an ongoing problem and is the longest running, widest spread and deadliest infectious human disease since the Spanish Flu that killed 50-100 million people worldwide from 1918-1920. HIV/AIDS is estimate to have taken the lives of some 30 million people.\n\n&gt; However, from the time these epidemics have become known to the public at large they have had little negative impact on the S&amp;P 500 since 1950. As you can see in the table here the market was weaker during the outbreaks of the first three on the list, but there were arguably other factors that had a greater impact than these diseases.\n\n&gt; In 1957, during the Asian Flu pandemic the market was pushed into a bear market by a hawkish fed that had been raising interest rates culminating in a bear market bottom in October 1957. The downdraft surrounding the Hong Kong Flu in 1968 was likely cause more by heightened hostilities in the Vietnam War and the related protests and events in the USA that culminated in the bear market bottom on May 26, 1970.\n\n&gt; When the HIV/AIDS epidemic became known in 1981 the market was suffering from the nasty double-dip recession from 1980-1982. The Iraq War held the market down in early 2003 during the SARS outbreak. The sovereign debt crisis and the downgrade of US debt in 2011 likely hurt the market more than the horrendous Haitian Cholera outbreak. The Measles scare in the US in late 2014-early 2015 had little impact on the market, though we suffered a mini-bear in 2015-2016 due to the EU Sovereign Debt Crisis, Brexit fears and the Chinese bear market.\n\n&gt; So while the new Wuhan Coronavirus is a major health and economic concern, especially to the affected areas, if history is any guide, the market is not likely to suffer from it.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/780a4e844cd0844caec4ab4740bc2317/4920c4dbd675407c-06/s500x750/f1421a0eb80bd75fbf0a6a2624c71c8d3a9c5327.jpg))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending January 31st, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED!)\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 2.2.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED!)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$DIS** \n&gt; * **$GOOGL** \n&gt; * **$SNAP** \n&gt; * **$TWTR** \n&gt; * **$ABBV** \n&gt; * **$F** \n&gt; * **$QCOM** \n&gt; * **$UBER** \n&gt; * **$SYY** \n&gt; * **$SPOT** \n&gt; * **$ON** \n&gt; * **$PINS** \n&gt; * **$TWLO** \n&gt; * **$BMY** \n&gt; * **$CMG** \n&gt; * **$IRBT** \n&gt; * **$CHKP** \n&gt; * **$MRK** \n&gt; * **$CNC** \n&gt; * **$SNE** \n&gt; * **$SIRI** \n&gt; * **$GM** \n&gt; * **$GILD** \n&gt; * **$PTON** \n&gt; * **$BP** \n&gt; * **$ABG** \n&gt; * **$LITE** \n&gt; * **$WYNN** \n&gt; * **$ATVI** \n&gt; * **$CTLT** \n&gt; * **$NSSC** \n&gt; * **$ACM** \n&gt; * **$GOOS** \n&gt; * **$SAIA** \n&gt; * **$DSPG** \n&gt; * **$RACE** \n&gt; * **$RCL** \n&gt; * **$COP** \n&gt; * **$AMG** \n&gt; * **$RL**\n&gt; * **$PLUS** \n&gt; * **$NXPI** \n&gt; * **$MCK** \n&gt; * **$CI**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/pQNRK2N.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/TGOGN8I.png))**\n###### **([CLICK HERE FOR MOST ANTICIPATED EARNINGS RELEASES FOR THE NEXT 5 WEEKS!](https://i.imgur.com/ITFECsE.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 2.3.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/HiGR4EF.png))\n\n\n&gt; # ***Monday 2.3.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/pSEERXv.png))\n\n\n*****\n\n&gt; # ***Tuesday 2.4.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/zqLdRqt.png))\n\n&gt; # ***Tuesday 2.4.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/NLPsraN.png))\n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/Dh1LRRU.png))\n\n*****\n\n&gt; # ***Wednesday 2.5.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/HW6dHyJ.png))\n\n&gt; # ***Wednesday 2.5.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/X2cKKMR.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/0rp0Yyh.png))\n\n*****\n\n&gt; # ***Thursday 2.6.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/02XMggZ.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/aqYNFFo.png))\n\n&gt; # ***Thursday 2.6.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/s4LwHiF.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/evpxdCi.png))\n\n*****\n\n&gt; # ***Friday 2.7.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/DqfZS2l.png))\n\n*****\n\n&gt; # ***Friday 2.7.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/tm9eiYq.png))\n\n*****\n\n# Walt Disney Co $138.31\n&gt; **Walt Disney Co (DIS)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, February 4, 2020. The consensus earnings estimate is $1.43 per share on revenue of $21.08 billion and the Earnings Whisper ® number is $1.51 per share. Investor sentiment going into the company's earnings release has 81% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 22.28% with revenue increasing by 37.75%. Short interest has increased by 5.0% since the company's last earnings release while the stock has drifted lower by 1.4% from its open following the earnings release to be 0.2% above its 200 day moving average of $138.09. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, January 28, 2020 there was some notable buying of 6,678 contracts of the $135.00 call expiring on Friday, July 17, 2020. Option traders are pricing in a 5.6% move on earnings and the stock has averaged a 2.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DIS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Alphabet, Inc. -\n&gt; **Alphabet, Inc. (GOOGL)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, February 3, 2020. The consensus earnings estimate is $12.76 per share on revenue of $38.44 billion and the Earnings Whisper ® number is $13.05 per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 0.08% with revenue decreasing by 2.13%. Short interest has increased by 20.8% since the company's last earnings release while the stock has drifted higher by 12.3% from its open following the earnings release to be 16.1% above its 200 day moving average of $1,234.53. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, January 30, 2020 there was some notable buying of 809 contracts of the $1,340.00 put expiring on Friday, February 21, 2020. Option traders are pricing in a 5.9% move on earnings and the stock has averaged a 4.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=GOOGL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Snap Inc. $18.38\n&gt; **Snap Inc. (SNAP)** is confirmed to report earnings at approximately 4:10 PM ET on Tuesday, February 4, 2020. The consensus earnings estimate is $0.01 per share on revenue of $560.39 million and the Earnings Whisper ® number is $0.03 per share. Investor sentiment going into the company's earnings release has 72% expecting an earnings beat The company's guidance was for revenue of $540.00 million to $560.00 million. Consensus estimates are for year-over-year earnings growth of 133.33% with revenue increasing by 43.76%. Short interest has decreased by 1.4% since the company's last earnings release while the stock has drifted higher by 32.1% from its open following the earnings release to be 17.8% above its 200 day moving average of $15.61. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, January 24, 2020 there was some notable buying of 6,149 contracts of the $19.00 call expiring on Friday, February 7, 2020. Option traders are pricing in a 12.6% move on earnings and the stock has averaged a 11.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SNAP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Twitter, Inc. $32.48\n&gt; **Twitter, Inc. (TWTR)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, February 6, 2020. The consensus earnings estimate is $0.28 per share on revenue of $997.35 million and the Earnings Whisper ® number is $0.31 per share. Investor sentiment going into the company's earnings release has 58% expecting an earnings beat The company's guidance was for revenue of $940.00 million. Consensus estimates are for earnings to decline year-over-year by 12.50% with revenue increasing by 9.74%. Short interest has decreased by 3.0% since the company's last earnings release while the stock has drifted higher by 3.4% from its open following the earnings release to be 11.0% below its 200 day moving average of $36.51. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, January 15, 2020 there was some notable buying of 3,109 contracts of the $32.00 put expiring on Friday, February 21, 2020. Option traders are pricing in a 10.7% move on earnings and the stock has averaged a 15.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TWTR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# AbbVie Inc. $81.02\n&gt; **AbbVie Inc. (ABBV)** is confirmed to report earnings at approximately 7:45 AM ET on Friday, February 7, 2020. The consensus earnings estimate is $2.20 per share on revenue of $8.76 billion and the Earnings Whisper ® number is $2.23 per share. Investor sentiment going into the company's earnings release has 80% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 15.79% with revenue increasing by 5.48%. Short interest has increased by 20.8% since the company's last earnings release while the stock has drifted higher by 1.2% from its open following the earnings release to be 4.9% above its 200 day moving average of $77.22. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, January 30, 2020 there was some notable buying of 3,080 contracts of the $47.50 call expiring on Friday, September 18, 2020. Option traders are pricing in a 4.7% move on earnings and the stock has averaged a 2.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ABBV&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Ford Motor Company $8.82\n&gt; **Ford Motor Company (F)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, February 4, 2020. The consensus earnings estimate is $0.17 per share on revenue of $36.79 billion and the Earnings Whisper ® number is $0.14 per share. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 43.33% with revenue decreasing by 11.97%. Short interest has decreased by 12.6% since the company's last earnings release while the stock has drifted lower by 0.6% from its open following the earnings release to be 7.9% below its 200 day moving average of $9.57. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, January 21, 2020 there was some notable buying of 30,831 contracts of the $9.00 put expiring on Friday, February 14, 2020. Option traders are pricing in a 6.7% move on earnings and the stock has averaged a 7.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=F&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# QUALCOMM Incorporated $85.31\n&gt; **QUALCOMM Incorporated (QCOM)** is confirmed to report earnings at approximately 4:00 PM ET on Wednesday, February 5, 2020. The consensus earnings estimate is $0.85 per share on revenue of $4.83 billion and the Earnings Whisper ® number is $0.88 per share. Investor sentiment going into the company's earnings release has 70% expecting an earnings beat The company's guidance was for earnings of $0.80 to $0.90 per share. Consensus estimates are for earnings to decline year-over-year by 30.33% with revenue decreasing by 0.25%. Short interest has decreased by 28.9% since the company's last earnings release while the stock has drifted lower by 5.0% from its open following the earnings release to be 7.2% above its 200 day moving average of $79.60. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, January 17, 2020 there was some notable buying of 6,082 contracts of the $105.00 call expiring on Friday, February 21, 2020. Option traders are pricing in a 6.3% move on earnings and the stock has averaged a 4.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=QCOM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Uber Technologies, Inc. $36.29\n&gt; **Uber Technologies, Inc. (UBER)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, February 6, 2020. The consensus estimate is for a loss of $0.69 per share on revenue of $4.08 billion and the Earnings Whisper ® number is ($0.55) per share. Investor sentiment going into the company's earnings release has 56% expecting an earnings beat. Short interest has decreased by 11.8% since the company's last earnings release while the stock has drifted higher by 24.6% from its open following the earnings release. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 6.1% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=UBER&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# SYSCO Corp. $82.14\n&gt; **SYSCO Corp. (SYY)** is confirmed to report earnings at approximately 8:00 AM ET on Monday, February 3, 2020. The consensus earnings estimate is $0.83 per share on revenue of $15.09 billion and the Earnings Whisper ® number is $0.85 per share. Investor sentiment going into the company's earnings release has 68% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 10.67% with revenue increasing by 2.20%. Short interest has decreased by 6.4% since the company's last earnings release while the stock has drifted higher by 1.6% from its open following the earnings release to be 7.8% above its 200 day moving average of $76.18. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, January 28, 2020 there was some notable buying of 1,050 contracts of the $83.00 put expiring on Friday, February 21, 2020. Option traders are pricing in a 4.2% move on earnings and the stock has averaged a 4.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SYY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Spotify Technology S.A. $141.30\n&gt; **Spotify Technology S.A. (SPOT)** is confirmed to report earnings at approximately 6:00 AM ET on Wednesday, February 5, 2020. The consensus estimate is for a loss of $0.25 per share on revenue of $2.09 billion and the Earnings Whisper ® number is ($0.19) per share. Investor sentiment going into the company's earnings release has 72% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 160.98% with revenue increasing by 22.44%. Short interest has decreased by 1.0% since the company's last earnings release while the stock has drifted higher by 7.8% from its open following the earnings release to be 1.6% above its 200 day moving average of $139.11. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, January 23, 2020 there was some notable buying of 835 contracts of the $270.00 call expiring on Friday, January 15, 2021. Option traders are pricing in a 8.1% move on earnings and the stock has averaged a 4.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SPOT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/stocks.",
        "subreddit": "stocks",
        "title": "Wall Street Week Ahead for the trading week beginning February 3rd, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/ex75kx/wall_street_week_ahead_for_the_trading_week/",
        "created": 1580597506.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1580736095,
        "id": "ey72kc",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/stocks sub! Welcome to the new trading month and a fresh start! Here are your pre-market news this AM-\n\n*****\n\n#[Today's Top Headlines for Monday, February 3rd, 2020](https://www.cnbc.com/2020/02/03/what-to-watch-today-dow-to-rise-iowa-caucuses-coronavirus-spreads-to-11-in-us.html)\n\n* U.S. stock futures were pointing to a higher open, but not close to erasing a significant portion of Friday’s coronavirus-driven sell-off. The Dow had its worst day since August on Friday. The S&amp;P 500 since October. Both were pushed into negative territory for January. The Dow is now at its lowest since Dec. 18, with the S&amp;P 500 finishing at its lowest since Dec. 30. The Nasdaq, however, did manage to finish January with a 2% gain. (CNBC)\n* Chinese markets plunged on their return from the extended Lunar New Year holiday, and maintained steep declines by the close. The Shanghai composite fell 7.72% while the Shenzhen component dropped 8.45%. The moves in Chinese stocks were playing catch up as the coronavirus outbreak continues to widen. (CNBC)\n* On today’s U.S. economic calendar, both the ISM manufacturing Index and December construction spending are released at 10 a.m. ET. Food distributor Sysco (SYY) is one of the few companies set to release quarterly earnings this morning, while Google parent Alphabet (GOOGL) grabs the spotlight in today’s after-the-bell reports. The pace of earnings reports picks up substantially over the next few days, with 86 S&amp;P 500 companies scheduled to issue numbers. (CNBC)\n* Sen. Bernie Sanders, former Vice President Joe Biden, Sen. Elizabeth Warren and former Mayor Pete Buttigieg all have a good chance to leave today’s first-in-the-nation Iowa presidential caucuses with the most delegates. Recent polls show a tight race, and the fluid nature of the caucuses suggest any of the leading candidates could enjoy a surprisingly strong showing in the first nominating contest. (CNBC)\n* Iowa caucus: What it is, how it works and why it’s important (CNBC)\n* Big Tech faces high-stakes test with Iowa caucuses (CNBC)\n* ‘I will pay more’: Bloomberg unveils $5 trillion tax plan targeting wealthy and corporations (CNBC)\n* John Kerry overheard discussing possible 2020 bid (NBC News)\n* Senate leaders have reached a deal to postpone the final vote in President Donald Trump’s impeachment trial, whether to convict or acquit him, until Wednesday The arrangement delays the vote until after tonight’s Iowa caucus, and the president’s State of the Union Address, scheduled for tomorrow. (CNBC)\n* Poll: US is split on Trump’s removal from office; top Dems lead him in 2020 race (CNBC)\n* Key dates on the US presidential election calendar (Reuters)\n* Italy’s health ministry has confirmed health ministers from the Group of Seven will discuss the coronavirus outbreak in a teleconference call at 8 a.m. ET today.The U.S. reported two more coronavirus cases Sunday, for a total of 11. China’s reported a total of 361 deaths and 17,205 confirmed cases. (CNBC)\n* Apple temporarily shuts all stores and offices in mainland China (CNBC)\n* Hong Kong leader Carrie Lam announced today the city would suspend 10 out of a possible 13 border crossings with mainland China in an effort to curb the coronavirus. Thousands of medical workers in Hong Kong went on strike, in hopes of convincing the city’s government to a complete shutdown of its borders with the mainland. (CNBC)\n* Bernard Ebbers, a former telecom executive convicted in one of the largest corporate accounting scandals in U.S. history, died yesterday, just over a month after his early release from prison. The Canadian-born Ebbers was convicted in New York in 2005 on securities fraud and other charges and received a 25-year sentence. (AP)\n* WeWork reportedly intends to name Sandeep Mathrani, a veteran in the real estate industry, as its new CEO. Mathrani was previously CEO at Brookfield Properties’ retail group, and is on the executive board and board of trustees for the International Council of Shopping Centers and the board of directors of Host Hotels &amp; Resorts. (CNBC)\n* It took 50 years, but the wait is now over for the Kansas City Chiefs after coming back from a 10-point deficit in the third quarter to beat the San Francisco 49ers at Super Bowl LIV at Hard Rock Stadium in Miami. The Chiefs, which last appeared in a Super Bowl in 1970, won their second Vince Lombardi Trophy in three Super Bowl appearances. (CNBC)\n* Watch all the Super Bowl commercials right here (CNBC)\n* Tom Brady’s cryptic tweet was just an ad for Hulu (CNBC)\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](https://finviz.com/futures.ashx)**)\n\n*****\n\n#LAST WEEK'S MARKET MAP:\n######(**[CLICK HERE FOR LAST WEEK'S MARKET MAP!](https://finviz.com/publish/020320/sec_all_w1_074983330.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#LAST WEEK'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR LAST WEEK'S S&amp;P SECTORS CHART!](https://i.imgur.com/DvFBBj6.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/0ptOQwJ.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/eVWWwMR.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/MbGpBC5.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n*($DIS $GOOGL $SNAP $TWTR $ABBV $F $QCOM $UBER $SYY $SPOT $ON $PINS $TWLO $BMY $CMG $IRBT $CHKP $MRK $CNC $SNE $SIRI $GM $GILD $PTON $BP $ABG $LITE $WYNN $ATVI $CTLT $NSSC $ACM $GOOS $SAIA $DSPG $RACE $RCL $COP $AMG $RL $PLUS $NXPI $MCK $CI)*\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/pQNRK2N.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n*($SYY $ON $CHKP $ABG $CTLT $SAIA $ACM $DSPG $NSSC $AMG $PINE $LUB)*\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/qbrgVKZ.jpg)**)\n\n*****\n\n#THIS AFTERNOON'S POST-MARKET EARNINGS CALENDAR:\n*()*\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS CALENDAR!]()**)\nT.B.A.\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/Vy5xjGr.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/AQhdZOi.png)**)\nNONE.\n\n*****\n\n#FRIDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR FRIDAY'S UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/ZR9zSwK.png)**)\n######(**[CLICK HERE FOR FRIDAY'S UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/ywB5fTk.png)**)\n######(**[CLICK HERE FOR FRIDAY'S UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/XqNLwhI.png)**)\n######(**[CLICK HERE FOR FRIDAY'S UPGRADES/DOWNGRADES LINK #4!](https://i.imgur.com/zNWfUQ1.png)**)\n\n*****\n\n#FRIDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR FRIDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/ByMW20r.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!](https://i.imgur.com/EPjmYcb.png)**)\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS:\n\n* AIMT\n* LK\n* GILD\n* CLVS\n* CHKP\n* ON\n* YANG\n* XOM\n* ROKU\n* CNP\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2020/02/03/stocks-making-the-biggest-moves-premarket-apple-boeing-verizon-nike-uber-more.html)**)\n\n*****\n\n&gt; **Las Vegas Sands (LVS), Wynn Resorts (WYNN)** – These will be among casino stocks on watch, on news that gambling revenue in Macao fell a worse-than-expected 11.3% amid the spread of the coronavirus.\n\n&gt; #**STOCK SYMBOL:** LVS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=LVS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LVS)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** WYNN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WYNN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WYNN)**)\n\n*****\n\n&gt; **Delta Air Lines (DAL), American Airlines (AAL), United Airlines (UAL)** – These and other airline stocks will also be in the spotlight, as new restrictions on travel to and from China are implemented.\n\n&gt; #**STOCK SYMBOL:** DAL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DAL)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** AAL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AAL)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** UAL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=UAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/UAL)**)\n\n*****\n\n&gt; **Apple (AAPL)** – Apple shut down all its stores and corporate offices in mainland China due to the coronavirus. The closure is scheduled to last until Feb. 9.\n\n&gt; #**STOCK SYMBOL:** AAPL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AAPL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AAPL)**)\n\n*****\n\n&gt; **Aimmune Therapeutics (AIMT)** – The drugmaker received Food and Drug Administration approval for the first-ever treatment for peanut allergies.\n\n&gt; #**STOCK SYMBOL:** AIMT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AIMT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AIMT)**)\n\n*****\n\n&gt; **Check Point Software (CHKP)** – Check Point reported quarterly profit of $2.02 per share, 3 cents a share above estimates. The cybersecurity company’s revenue also beat Street forecasts, boosted by an increase in subscriptions.\n\n&gt; #**STOCK SYMBOL:** CHKP\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=CHKP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/CHKP)**)\n\n*****\n\n&gt; **Boeing (BA)** – Boeing faces a new obstacle in getting the grounded 737 Max back in service, according to The Wall Street Journal. The paper quotes people familiar with the matter as saying that European regulators want what they regard as potentially hazardous wiring relocated to avoid short circuits.\n\n&gt; #**STOCK SYMBOL:** BA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BA)**)\n\n*****\n\n&gt; **Verizon (VZ)** – Verizon was downgraded to “neutral” from “outperform” at Credit Suisse, which said the stock lacks positive near-term catalysts. Credit Suisse feels positive influences for the stock are weighted toward the back half of the year, ahead of the mass market launch of 5G service.\n\n&gt; #**STOCK SYMBOL:** VZ\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=VZ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/VZ)**)\n\n*****\n\n&gt; **Seagate Technology (STX)** – Seagate was upgraded to “buy” from “hold” at Stifel Nicolaus, pointing to improving fundamentals for the disk drive maker.\n\n&gt; #**STOCK SYMBOL:** STX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=STX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/STX)**)\n\n*****\n\n&gt; **Nike (NKE)** – The athletic footwear and apparel maker’s stock was added to the “Analyst Focus List” at J.P. Morgan Chase, which sees a recent pullback as a buying opportunity. J.P. Morgan points to Nike’s innovation and product pipeline.\n\n&gt; #**STOCK SYMBOL:** NKE\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=NKE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/NKE)**)\n\n*****\n\n&gt; **Uber (UBER)** – Uber was added to the “Best Ideas” list at Wedbush, which feels the ride-hailing service has laid the groundwork for growth, especially amid the streamlining of the Uber Eats operation.\n\n&gt; #**STOCK SYMBOL:** UBER\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=UBER&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/UBER)**)\n\n*****\n\n&gt; **Northrop Grumman (NOC)** – The defense contractor’s stock received a double downgrade at Goldman Sachs, which pushed its rating to “sell” from “buy.” Goldman said the company’s organic revenue growth is slower than that of its peers and that profit margins are compressing.\n\n&gt; #**STOCK SYMBOL:** NOC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=NOC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/NOC)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat is on everyone's radar for today's trading day ahead here at r/stocks?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Monday, February 3rd, 2020! :)**",
        "subreddit": "stocks",
        "title": "Today's Pre-Market Movers &amp; News [Monday, February 3rd, 2020]",
        "url": "https://www.reddit.com/r/stocks/comments/ey72kc/todays_premarket_movers_news_monday_february_3rd/",
        "created": 1580764895.0
    }
]