[
    {
        "author": "bigbear0083",
        "created_utc": 1587220502,
        "id": "g3oglv",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/wallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning April 20th, 2020.\n\n# **A blast of earnings news is coming, but the market may be more focused on when the economy will reopen  - [(Source)](https://www.cnbc.com/2020/04/17/a-blast-of-earnings-news-is-coming-but-the-market-may-be-more-focused-on-when-the-economy-will-reopen.html)**\n*****\n&gt; Earnings from IBM, Netflix, Coca-Cola and dozens of others are expected in the week ahead, but as the state shutdowns now reach the one-month threshold, the market is more likely to trade on virus headlines and news about reopening the economy.\n*****\n&gt; There are also some important economic reports, including existing home sales on Monday and durable goods on Friday. But it is the weekly jobless claims data that will again be most relevant, as economists watch to see whether the number of workers seeking claims has now peaked and whether there are any signs some are returning to jobs, as government funds reach the hands of business owners.\n*****\n&gt; In the past week, stocks were higher, but there was a divergence with the Dow up just under 2.2% at 24,242, and Nasdaq, surging 6%, lifted by tech and biotech. The S&amp;P 500 gained 3% for the week and is now 31% off its March lows.\n*****\n&gt; Stocks gained amid signs the virus outbreak has peaked and some reopenings could start slowly in the next few weeks.\n*****\n&gt; The market also bounced Friday as the results of an early study of a Gilead drug showed promise with severe cases of coronavirus. Technology stocks were up about 4% for the week, and health care was up more than 5% while consumer discretionary stocks led with a gain of more than 6%.\n*****\n&gt; “As the virus news goes, so go risk assets. People expect bad economic data,” said Patrick Leary, chief market strategist at Incapital. “The data is all expected to be horrible. The only economic data we can really look at now and start to measure is the claims data on Thursday.” As of April 11, more than 22 million workers claimed unemployment benefits over a four-week period, as states shut down and schools, restaurants, stores and many other businesses closed or were forced to cut back.\n*****\n&gt; Charts are important\n&gt; Analysts who watch stock charts say technical levels will continue to have a powerful pull on the market, since so many traders have set their computers to trade around those numbers.\n*****\n&gt; For instance, the S&amp;P 500 had a hard time breaking through the 50-day moving average Friday, and fell back after it initially edged near 2,862 in morning trading. But at the end of the trading day, it smashed through that level, surging to close at 2,874, a positive sign for Monday’s open. The 50-day literally is the average closing price for the S&amp;P over the previous 50 sessions. Technical analysts believe watching moving averages gives them an important tool for price trends and momentum.\n*****\n&gt; Bob Doll, Nuveen’s chief equity strategist, said he believes the market hit its bear market low on March 23, but it could take another dive towards lows at some point.\n*****\n&gt; “My [low] target was 2,350. We spent 36 hours below that and got to 2,192. If there’s a secondary low, then probably the lowest chance is 2,350,” he said. “I’m not sure we’re going to go there, based on two things, the power of the rally and two, the stimulus. It’s been awesome.”\n*****\n&gt; Travelers, and Texas Instruments release results Tuesday. AT&amp;T, Delta Airlines, and Intel, Blackstone and Eli Lily are reporting Thursday. American Express and Verizon are expected Friday.\n*****\n&gt; Doll said he expects the market to listen to comments from corporate executives on conference calls but ignore the actual earnings. “The market is going to pay a lot more attention to what can a rebound look like, and what can 2021 numbers look like,” he said. “They’ll be selling on that versus how deep is the hole going to be in the second quarter. The macro questions around that are recurrence, therapeutics, and vaccine and how fast can the economy come back, and nobody knows the answer to that.”\n*****\n&gt; President Donald Trump laid out guidelines for reopening the economy, but left the decision making up to the states, which are facing varied levels of new infections. One issue is the lack of testing, and American businesses have pressed for more availability of test kits so workers can be brought back more safely.\n*****\n&gt; Doll said he is partial to health care and technology stocks, and one reason is because of the Fed’s quantitative easing programs. “We’re now in QE4. We had QE1, QE2, QE3, and six months after QE 1, 2 and 3, there were two sectors that outperformed-technology and health care, and there were two that underperformed, utilities and REITs,” he said.\n*****\n&gt; Doll said he also is looking at how stocks might come through the virus shutdowns. “Part of what you want to make sure is the company is going to make it through, and make sure the industry has decent demand getting out of it. If it has decent demand during it, that’s a good thing, and that takes you back to health care and technology,” said Doll.\n*****\n&gt; Leary said he expects companies to be scrutinized somewhat differently by analysts this quarter, and balance sheets will be more important.\n*****\n&gt; “Its going to be on a case-by-case basis about how analysts are going to look at them. This is not a typical recession. Recessions seem to hit different sectors,” he said, “This one one is different in that it really has several losers like airlines and travel and entertainment companies. It has some real winners too. I like health care and pharma. Anything that’s defensive in nature is going to perform well.”\n*****\n&gt; Companies have been tapping the corporate bond market at a record pace to boost their cash piles to help them through the economy’s shutdown, and the coming week should be no different.\n*****\n&gt; The corporate debt market has been open for business and spreads have narrowed since the Fed announced a program to buy corporate debt. Companies have issued more than $160 billion in investment grade bonds so far this month, with JP Morgan issuing $10 billion this past week in the biggest bank deal ever, according to Credit Flow Research.\n*****\n&gt; More are expected in the coming week, as companies report earnings and exit the blackout period.\n*****\n&gt; “I think what corporate treasurers know is the window of opportunity for issuing debt at reasonable rates will quickly close once the economy starts opening,” said Leary. He said balance sheets and earnings will be more scrutinized once things start to become more normal.\n*****\n&gt; “They won’t have an excuse anymore ... right now, everything is expected to unexpected,” he said, “I think that window will close, and we’ll have to take a look at the bond market again. Their ability to issue will be impacted by their balance sheets...[now] there’s plenty of cash coming at them. The Fed will step in to support.”\n*****\n&gt; Leary said some of the interest in corporate bonds is from investors who are fearful of buying stocks right now but may want to invest in a company through the safer play of its bonds. Leary said energy bonds are among the least desirable, with the huge drop in crude prices.\n*****\n&gt; West Texas Intermediate crude futures for May settled at $18.72 per barrel, it lowest level since January, 2002. But that contract expires Tuesday. The June contract settled at $25.08 per barrel, and will resume trading there next week as the active contract.\n*****\n&gt; “It’s just a reflection of physical market conditions,” said John Kilduff of Again Capital, of the big decline in the May contract. He said it shows that futures traders do not want to actually take delivery of the commodity, due to an increasing lack of storage space.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/DgwrUcm.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/yKRo7Ea.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/3rA0fDB.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/DrwoiV6.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/i40FkmH.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/nMvlyBE.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/R8OVKd3.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/eZZyOqa.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/douLwsS.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/y2laKRP.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/dBSYk0L.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/LwQokav.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/zgBClvX.png))**\n###### **([CLICK HERE FOR THE CHART LINK #4!](https://i.imgur.com/Fcc6DrP.png))**\n\n*****\n\n# How Markets Performed During the Spanish Flu\n\n&gt; With equities surging into the close ahead of the weekend, traders are shrugging their shoulders wondering how the hell the market is rallying given the economic damage inflicted by the COVID-19 outbreak, which has been cited as the worst pandemic to hit the United States since the 1918 Spanish flu. This leads to the question, how did the stock market perform during the Spanish flu outbreak? The chart below compares the performance of the DJIA to the weekly mortality rate of the Spanish flu during each of the waves of that pandemic from mid-1918 through early 1919 (as cited in a WSJ article earlier today).\n\n&gt; Looking at how the outbreak of the Spanish flu played out, there were basically three different waves of the virus (red line). The first wave in the summer of 1918 was a relatively mild one compared to the other two, and the DJIA's performance during that wave was essentially flat as it never declined more than 3%. The real damage from the Spanish flu was in the fall of 1918 when the mortality rate spiked up as high as 24 per 1,000 people per week. During that wave of the pandemic, which also came in the thick of a post-WWI recession, the DJIA peaked just as the wave was getting underway and fell for the next three months. Even with the severity of the outbreak during that wave, though, the DJIA never fell more than 11% from peak to trough. On a comparative basis, even after the 28% rally over the last four weeks, the S&amp;P 500 is still down 15% from its high. Obviously, comparing two periods more than 100 years apart is hardly an apples to apples comparison, but it's still interesting that during what was an even deadlier pandemic in 1918, the DJIA never even approached anything close to a bear market.\n\n&gt; Looking at the chart, the DJIA's low of the decline coincided with the second wave of the outbreak just as the third (more mild) wave of the pandemic was getting underway. Furthermore, during that third wave, the DJIA kicked off what was a strong rally of more than 25% in less than three months on optimism over an end to the outbreak.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/041720-DJIA-flue.png))**\n\n&gt; So, once the mortality rate of the Spanish flu dropped down to zero, it must have been nothing but clear skies ahead for the Dow, right? Well, not necessarily. When it comes to the stock market, there's always something. Less than a year after the mortality rate from the Spanish flu dropped down to zero, the US economy actually went into a year and a half long recession. That contraction was so severe that it has been dubbed the Depression of 1920/21, one where unemployment topped 10% and deflation was as high as 18%! The bear market that accompanied that recession was also severe as the DJIA declined 46%. Imagine coming out of a pandemic with nothing more than an 11% correction and then getting socked with that!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/041720-DJIA-1920-1921.png))**\n\n*****\n\n# Silver Shining in the Near Term, Gold Shining Over the Long Term\n\n&gt; Gold (GLD) has had an interesting run over the past year. Last spring, the ETF for the yellow metal finally pressed above multiyear resistance roughly around $130. After surging through late summer, GLD continued its rally at the end of 2019 and early 2020 before turning sharply lower alongside stocks in March. But since its March 19th low it has gone on to rally over 17% as of today and is now at its highest levels since early 2013.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/GLD.png))**\n\n&gt; Another precious metal, Silver (SLV), has not been as fortunate. Although it shared in the rally last spring and summer, SLV has yet to eclipse its early September highs. While gold had broken out again in February and March, silver put in a lower high before plummeting to its lost level since 2009 in mid-March.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/SLV.png))**\n\n&gt; But since that low on March 18th, SLV has actually outperformed rising 27.83%. Gold is up only up 15.14% since that same day and 17% since its respective low one day later on March 19th. While the S&amp;P 500's (SPY) low was not put in place until a few days after gold and silver on March 23rd, since March 18th, SLV is also outperforming SPY's 15.97% gain.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/Performance-1.png))**\n\n&gt; Over the long term, though SLV is still the worst performer of the group. As shown in the chart below, SLV is down 8.84% over the past two years while the S&amp;P 500's gains have also been somewhat lackluster thanks to the most recent sell-off with only a 4.11% gain. Gold, on the other hand, has outshined the other two having surged 26.93%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/Percent-GLD-SLV-SPY.png))**\n\n*****\n\n# It’s Earnings Season (Or Whatever it is Companies Plan to Report)\n\n&gt; It’s that time of year again. The time when corporate America reports financial results for the prior three months. Normally, we call it earnings season, but given the fact that most of the US economy has been shut down and no timetable is set for when it re-opens, for a lot of companies out there, there really isn’t much in the way of earnings, revenues, or guidance to speak of. Instead, this reporting period will likely be a lot of companies trying to put the best spin on how much (or little) cash they have on hand to withstand the shutdown.\n\n&gt; Besides the major banks and financials, there hasn’t been a whole lot in the way of reports to speak of, but of the results we have seen, the stock market reaction hasn’t been great as companies like Johnson &amp; Johnson (JNJ), JP Morgan (JPM), Wells Fargo (WFC), Bank of America (BAC), and Goldman Sachs (GS) have all seen negative reactions to their reports. The only large-cap that has really reacted positively to earnings so far is UnitedHealth (UNH) which gained more than 4%. Next week, the pace of reports will pick up, but the peak period for reports won’t be for another two weeks when more than 300 companies will report in a single day.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/calendar.png))**\n\n*****\n\n# Typical April Trading: Strength from Start to Finish\n\n&gt; April, the last month of DJIA &amp; S&amp;P 500 “Best Six Months,” has a strong historical track record. April 1999 was the first month DJIA gained over 1000 points (10.25%). April is also DJIA’s best month since 1950 with an average 1.9% gain. After a disastrous March, the rally than began in late March has extended in April. As of yesterday’s close, DJIA is up 7.39% so far this April. S&amp;P 500 is up 8.32%, NASDAQ has risen 10.81%. Small caps, measured by the Russell 2000 have not fared as well, up just 2.17%.\n\n&gt; April’s historical performance over the recent 21-year period is plotted in the chart above (21-year average is on the left vertical scale) compared to April 2020 (right vertical scale). Magnitude of gains this year is substantial however, the trend this year has been similar to past years. Should the current trend remain intact, further gains this month are possible. Coronavirus uncertainty remains extremely elevated, but there does to be some light flickering at the end of tunnel.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/826c536dba71629e9d1a26329db32eba/97c8d036ee5ba87c-9b/s500x750/55708144eea7c12b24adf731e9dc63e41e31604b.jpg))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$NFLX** \n&gt; * **$DAL** \n&gt; * **$KO** \n&gt; * **$INFY** \n&gt; * **$HAL** \n&gt; * **$LMT** \n&gt; * **$ALLY** \n&gt; * **$SNAP** \n&gt; * **$T** \n&gt; * **$DPZ** \n&gt; * **$IBM** \n&gt; * **$PM** \n&gt; * **$INTC** \n&gt; * **$LUV** \n&gt; * **$CMG** \n&gt; * **$BIIB** \n&gt; * **$HCA** \n&gt; * **$VZ** \n&gt; * **$BOH** \n&gt; * **$MTB** \n&gt; * **$ONB** \n&gt; * **$SAP** \n&gt; * **$BMRC** \n&gt; * **$CMA** \n&gt; * **$PHG** \n&gt; * **$AXP** \n&gt; * **$ERIC** \n&gt; * **$CBU** \n&gt; * **$KMB** \n&gt; * **$TFC** \n&gt; * **$PLD** \n&gt; * **$SYF** \n&gt; * **$NEE** \n&gt; * **$LII** \n&gt; * **$NDAQ** \n&gt; * **$LLY** \n&gt; * **$SNA** \n&gt; * **$LVS** \n&gt; * **$TRV** \n&gt; * **$LRCX** \n&gt; * **$KALU** \n&gt; * **$EMR** \n&gt; * **$CIT** \n&gt; * **$FITB**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/douLwsS.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/zBd2gQL.png))**\n###### **([CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES FOR THE MONTH OF APRIL 2020!](https://i.imgur.com/wlvhXbo.jpg))**\n###### **([CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES BEFORE MONDAY'S OPEN!](https://i.imgur.com/25QY7uo.jpg))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 4.20.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/uzAy7Pk.png))\n\n\n&gt; # ***Monday 4.20.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/xjSoWZ3.png))\n\n\n*****\n\n&gt; # ***Tuesday 4.21.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/RbwZ1le.png))\n\n&gt; # ***Tuesday 4.21.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/DjS7QnD.png))\n\n*****\n\n&gt; # ***Wednesday 4.22.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/aY4wQPz.png))\n\n&gt; # ***Wednesday 4.22.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/F2u6ejr.png))\n\n*****\n\n&gt; # ***Thursday 4.23.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/QW6sJiO.png))\n\n&gt; # ***Thursday 4.23.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/gylBF9c.png))\n\n*****\n\n&gt; # ***Friday 4.24.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/vwNztBG.png))\n\n*****\n\n&gt; # ***Friday 4.24.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# Netflix, Inc. $422.96\n&gt; **Netflix, Inc. (NFLX)** is confirmed to report earnings at approximately 4:00 PM ET on Tuesday, April 21, 2020. The consensus earnings estimate is $1.61 per share on revenue of $5.70 billion and the Earnings Whisper ® number is $1.68 per share. Investor sentiment going into the company's earnings release has 76% expecting an earnings beat The company's guidance was for earnings of approximately $1.66 per share. Consensus estimates are for year-over-year earnings growth of 111.84% with revenue increasing by 26.08%. Short interest has decreased by 28.5% since the company's last earnings release while the stock has drifted higher by 27.2% from its open following the earnings release to be 31.0% above its 200 day moving average of $322.81. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, April 17, 2020 there was some notable buying of 5,963 contracts of the $470.00 call expiring on Friday, April 24, 2020. Option traders are pricing in a 12.7% move on earnings and the stock has averaged a 4.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NFLX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Delta Air Lines, Inc. $24.27\n&gt; **Delta Air Lines, Inc. (DAL)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, April 22, 2020. The consensus estimate is for a loss of $0.70 per share on revenue of $9.64 billion and the Earnings Whisper ® number is ($1.41) per share. Investor sentiment going into the company's earnings release has 26% expecting an earnings miss. Consensus estimates are for earnings to decline year-over-year by 172.92% with revenue decreasing by 7.94%. Short interest has increased by 38.3% since the company's last earnings release while the stock has drifted lower by 60.9% from its open following the earnings release to be 54.1% below its 200 day moving average of $52.86. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, April 16, 2020 there was some notable buying of 13,289 contracts of the $25.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 12.3% move on earnings and the stock has averaged a 1.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Coca-Cola Company $48.06\n&gt; **Coca-Cola Company (KO)** is confirmed to report earnings at approximately 6:55 AM ET on Tuesday, April 21, 2020. The consensus earnings estimate is $0.44 per share on revenue of $8.49 billion and the Earnings Whisper ® number is $0.44 per share. Investor sentiment going into the company's earnings release has 55% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 8.33% with revenue increasing by 5.86%. Short interest has decreased by 22.1% since the company's last earnings release while the stock has drifted lower by 17.0% from its open following the earnings release to be 10.0% below its 200 day moving average of $53.39. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, April 17, 2020 there was some notable buying of 4,000 contracts of the $42.00 put expiring on Friday, May 8, 2020. Option traders are pricing in a 5.6% move on earnings and the stock has averaged a 4.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=KO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Infosys Technologies Ltd. $8.58\n&gt; **Infosys Technologies Ltd. (INFY)** is confirmed to report earnings at approximately 7:55 AM ET on Monday, April 20, 2020. The consensus earnings estimate is $0.14 per share on revenue of $3.29 billion and the Earnings Whisper ® number is $0.15 per share. Investor sentiment going into the company's earnings release has 29% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 7.69% with revenue increasing by 7.52%. Short interest has increased by 23.9% since the company's last earnings release while the stock has drifted lower by 22.7% from its open following the earnings release to be 19.2% below its 200 day moving average of $10.62. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, March 30, 2020 there was some notable buying of 4,005 contracts of the $9.00 put expiring on Friday, October 16, 2020. Option traders are pricing in a 12.2% move on earnings and the stock has averaged a 3.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=INFY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Halliburton Company $7.58\n&gt; **Halliburton Company (HAL)** is confirmed to report earnings at approximately 6:45 AM ET on Monday, April 20, 2020. The consensus earnings estimate is $0.25 per share on revenue of $5.08 billion and the Earnings Whisper ® number is $0.27 per share. Investor sentiment going into the company's earnings release has 17% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 8.70% with revenue decreasing by 11.45%. Short interest has decreased by 17.6% since the company's last earnings release while the stock has drifted lower by 68.1% from its open following the earnings release to be 60.1% below its 200 day moving average of $19.02. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, April 3, 2020 there was some notable buying of 20,284 contracts of the $7.00 put expiring on Friday, May 15, 2020. Option traders are pricing in a 18.3% move on earnings and the stock has averaged a 3.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Lockheed Martin Corp. $401.51\n&gt; **Lockheed Martin Corp. (LMT)** is confirmed to report earnings at approximately 7:30 AM ET on Tuesday, April 21, 2020. The consensus earnings estimate is $5.75 per share on revenue of $15.23 billion and the Earnings Whisper ® number is $5.81 per share. Investor sentiment going into the company's earnings release has 57% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 4.01% with revenue increasing by 6.24%. Short interest has decreased by 30.8% since the company's last earnings release while the stock has drifted lower by 7.7% from its open following the earnings release to be 5.2% above its 200 day moving average of $381.53. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 7.0% move on earnings and the stock has averaged a 1.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LMT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Ally Financial $15.37\n&gt; **Ally Financial (ALLY)** is confirmed to report earnings at approximately 7:30 AM ET on Monday, April 20, 2020. The consensus earnings estimate is $0.74 per share on revenue of $1.61 billion and the Earnings Whisper ® number is $0.61 per share. Investor sentiment going into the company's earnings release has 17% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 7.50% with revenue increasing by 0.75%. Short interest has decreased by 45.8% since the company's last earnings release while the stock has drifted lower by 51.7% from its open following the earnings release to be 46.9% below its 200 day moving average of $28.95. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, March 30, 2020 there was some notable buying of 8,801 contracts of the $10.00 put expiring on Friday, June 19, 2020. Option traders are pricing in a 16.3% move on earnings and the stock has averaged a 4.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ALLY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Snap Inc. $12.98\n&gt; **Snap Inc. (SNAP)** is confirmed to report earnings at approximately 4:10 PM ET on Tuesday, April 21, 2020. The consensus estimate is for a loss of $0.07 per share on revenue of $426.88 million and the Earnings Whisper ® number is ($0.09) per share. Investor sentiment going into the company's earnings release has 55% expecting an earnings beat The company's guidance was for revenue of $450.00 million to $470.00 million. Consensus estimates are for year-over-year earnings growth of 50.00% with revenue increasing by 33.22%. Short interest has decreased by 14.5% since the company's last earnings release while the stock has drifted lower by 28.0% from its open following the earnings release to be 18.3% below its 200 day moving average of $15.89. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, April 17, 2020 there was some notable buying of 9,211 contracts of the $13.50 call expiring on Friday, April 24, 2020. Option traders are pricing in a 17.2% move on earnings and the stock has averaged a 12.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SNAP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# AT&amp;T Corp. $31.23\n&gt; **AT&amp;T Corp. (T)** is confirmed to report earnings at approximately 6:50 AM ET on Wednesday, April 22, 2020. The consensus earnings estimate is $0.85 per share on revenue of $44.38 billion and the Earnings Whisper ® number is $0.87 per share. Investor sentiment going into the company's earnings release has 41% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 1.16% with revenue decreasing by 1.00%. The stock has drifted lower by 18.9% from its open following the earnings release to be 14.0% below its 200 day moving average of $36.30. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, March 31, 2020 there was some notable buying of 50,564 contracts of the $31.00 put expiring on Friday, June 19, 2020. Option traders are pricing in a 5.6% move on earnings and the stock has averaged a 4.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=T&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Domino's Pizza, Inc. $362.97\n&gt; **Domino's Pizza, Inc. (DPZ)** is confirmed to report earnings at approximately 7:30 AM ET on Thursday, April 23, 2020. The consensus earnings estimate is $2.29 per share on revenue of $867.60 million and the Earnings Whisper ® number is $2.34 per share. Investor sentiment going into the company's earnings release has 68% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 4.09% with revenue increasing by 3.78%. Short interest has decreased by 66.9% since the company's last earnings release while the stock has drifted higher by 0.3% from its open following the earnings release to be 29.8% above its 200 day moving average of $279.69. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, April 17, 2020 there was some notable buying of 679 contracts of the $390.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 9.7% move on earnings and the stock has averaged a 9.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DPZ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/wallstreetbets.",
        "subreddit": "wallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning April 20th, 2020",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/g3oglv/wall_street_week_ahead_for_the_trading_week/",
        "created": 1587249302.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1587220315,
        "id": "g3oew1",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/StockMarket. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning April 20th, 2020.\n\n# **A blast of earnings news is coming, but the market may be more focused on when the economy will reopen  - [(Source)](https://www.cnbc.com/2020/04/17/a-blast-of-earnings-news-is-coming-but-the-market-may-be-more-focused-on-when-the-economy-will-reopen.html)**\n*****\n&gt; Earnings from IBM, Netflix, Coca-Cola and dozens of others are expected in the week ahead, but as the state shutdowns now reach the one-month threshold, the market is more likely to trade on virus headlines and news about reopening the economy.\n*****\n&gt; There are also some important economic reports, including existing home sales on Monday and durable goods on Friday. But it is the weekly jobless claims data that will again be most relevant, as economists watch to see whether the number of workers seeking claims has now peaked and whether there are any signs some are returning to jobs, as government funds reach the hands of business owners.\n*****\n&gt; In the past week, stocks were higher, but there was a divergence with the Dow up just under 2.2% at 24,242, and Nasdaq, surging 6%, lifted by tech and biotech. The S&amp;P 500 gained 3% for the week and is now 31% off its March lows.\n*****\n&gt; Stocks gained amid signs the virus outbreak has peaked and some reopenings could start slowly in the next few weeks.\n*****\n&gt; The market also bounced Friday as the results of an early study of a Gilead drug showed promise with severe cases of coronavirus. Technology stocks were up about 4% for the week, and health care was up more than 5% while consumer discretionary stocks led with a gain of more than 6%.\n*****\n&gt; “As the virus news goes, so go risk assets. People expect bad economic data,” said Patrick Leary, chief market strategist at Incapital. “The data is all expected to be horrible. The only economic data we can really look at now and start to measure is the claims data on Thursday.” As of April 11, more than 22 million workers claimed unemployment benefits over a four-week period, as states shut down and schools, restaurants, stores and many other businesses closed or were forced to cut back.\n*****\n&gt; Charts are important\n&gt; Analysts who watch stock charts say technical levels will continue to have a powerful pull on the market, since so many traders have set their computers to trade around those numbers.\n*****\n&gt; For instance, the S&amp;P 500 had a hard time breaking through the 50-day moving average Friday, and fell back after it initially edged near 2,862 in morning trading. But at the end of the trading day, it smashed through that level, surging to close at 2,874, a positive sign for Monday’s open. The 50-day literally is the average closing price for the S&amp;P over the previous 50 sessions. Technical analysts believe watching moving averages gives them an important tool for price trends and momentum.\n*****\n&gt; Bob Doll, Nuveen’s chief equity strategist, said he believes the market hit its bear market low on March 23, but it could take another dive towards lows at some point.\n*****\n&gt; “My [low] target was 2,350. We spent 36 hours below that and got to 2,192. If there’s a secondary low, then probably the lowest chance is 2,350,” he said. “I’m not sure we’re going to go there, based on two things, the power of the rally and two, the stimulus. It’s been awesome.”\n*****\n&gt; Travelers, and Texas Instruments release results Tuesday. AT&amp;T, Delta Airlines, and Intel, Blackstone and Eli Lily are reporting Thursday. American Express and Verizon are expected Friday.\n*****\n&gt; Doll said he expects the market to listen to comments from corporate executives on conference calls but ignore the actual earnings. “The market is going to pay a lot more attention to what can a rebound look like, and what can 2021 numbers look like,” he said. “They’ll be selling on that versus how deep is the hole going to be in the second quarter. The macro questions around that are recurrence, therapeutics, and vaccine and how fast can the economy come back, and nobody knows the answer to that.”\n*****\n&gt; President Donald Trump laid out guidelines for reopening the economy, but left the decision making up to the states, which are facing varied levels of new infections. One issue is the lack of testing, and American businesses have pressed for more availability of test kits so workers can be brought back more safely.\n*****\n&gt; Doll said he is partial to health care and technology stocks, and one reason is because of the Fed’s quantitative easing programs. “We’re now in QE4. We had QE1, QE2, QE3, and six months after QE 1, 2 and 3, there were two sectors that outperformed-technology and health care, and there were two that underperformed, utilities and REITs,” he said.\n*****\n&gt; Doll said he also is looking at how stocks might come through the virus shutdowns. “Part of what you want to make sure is the company is going to make it through, and make sure the industry has decent demand getting out of it. If it has decent demand during it, that’s a good thing, and that takes you back to health care and technology,” said Doll.\n*****\n&gt; Leary said he expects companies to be scrutinized somewhat differently by analysts this quarter, and balance sheets will be more important.\n*****\n&gt; “Its going to be on a case-by-case basis about how analysts are going to look at them. This is not a typical recession. Recessions seem to hit different sectors,” he said, “This one one is different in that it really has several losers like airlines and travel and entertainment companies. It has some real winners too. I like health care and pharma. Anything that’s defensive in nature is going to perform well.”\n*****\n&gt; Companies have been tapping the corporate bond market at a record pace to boost their cash piles to help them through the economy’s shutdown, and the coming week should be no different.\n*****\n&gt; The corporate debt market has been open for business and spreads have narrowed since the Fed announced a program to buy corporate debt. Companies have issued more than $160 billion in investment grade bonds so far this month, with JP Morgan issuing $10 billion this past week in the biggest bank deal ever, according to Credit Flow Research.\n*****\n&gt; More are expected in the coming week, as companies report earnings and exit the blackout period.\n*****\n&gt; “I think what corporate treasurers know is the window of opportunity for issuing debt at reasonable rates will quickly close once the economy starts opening,” said Leary. He said balance sheets and earnings will be more scrutinized once things start to become more normal.\n*****\n&gt; “They won’t have an excuse anymore ... right now, everything is expected to unexpected,” he said, “I think that window will close, and we’ll have to take a look at the bond market again. Their ability to issue will be impacted by their balance sheets...[now] there’s plenty of cash coming at them. The Fed will step in to support.”\n*****\n&gt; Leary said some of the interest in corporate bonds is from investors who are fearful of buying stocks right now but may want to invest in a company through the safer play of its bonds. Leary said energy bonds are among the least desirable, with the huge drop in crude prices.\n*****\n&gt; West Texas Intermediate crude futures for May settled at $18.72 per barrel, it lowest level since January, 2002. But that contract expires Tuesday. The June contract settled at $25.08 per barrel, and will resume trading there next week as the active contract.\n*****\n&gt; “It’s just a reflection of physical market conditions,” said John Kilduff of Again Capital, of the big decline in the May contract. He said it shows that futures traders do not want to actually take delivery of the commodity, due to an increasing lack of storage space.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/DgwrUcm.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/yKRo7Ea.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/3rA0fDB.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/DrwoiV6.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/i40FkmH.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/nMvlyBE.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/R8OVKd3.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/eZZyOqa.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/douLwsS.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/y2laKRP.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/dBSYk0L.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/LwQokav.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/zgBClvX.png))**\n###### **([CLICK HERE FOR THE CHART LINK #4!](https://i.imgur.com/Fcc6DrP.png))**\n\n*****\n\n# How Markets Performed During the Spanish Flu\n\n&gt; With equities surging into the close ahead of the weekend, traders are shrugging their shoulders wondering how the hell the market is rallying given the economic damage inflicted by the COVID-19 outbreak, which has been cited as the worst pandemic to hit the United States since the 1918 Spanish flu. This leads to the question, how did the stock market perform during the Spanish flu outbreak? The chart below compares the performance of the DJIA to the weekly mortality rate of the Spanish flu during each of the waves of that pandemic from mid-1918 through early 1919 (as cited in a WSJ article earlier today).\n\n&gt; Looking at how the outbreak of the Spanish flu played out, there were basically three different waves of the virus (red line). The first wave in the summer of 1918 was a relatively mild one compared to the other two, and the DJIA's performance during that wave was essentially flat as it never declined more than 3%. The real damage from the Spanish flu was in the fall of 1918 when the mortality rate spiked up as high as 24 per 1,000 people per week. During that wave of the pandemic, which also came in the thick of a post-WWI recession, the DJIA peaked just as the wave was getting underway and fell for the next three months. Even with the severity of the outbreak during that wave, though, the DJIA never fell more than 11% from peak to trough. On a comparative basis, even after the 28% rally over the last four weeks, the S&amp;P 500 is still down 15% from its high. Obviously, comparing two periods more than 100 years apart is hardly an apples to apples comparison, but it's still interesting that during what was an even deadlier pandemic in 1918, the DJIA never even approached anything close to a bear market.\n\n&gt; Looking at the chart, the DJIA's low of the decline coincided with the second wave of the outbreak just as the third (more mild) wave of the pandemic was getting underway. Furthermore, during that third wave, the DJIA kicked off what was a strong rally of more than 25% in less than three months on optimism over an end to the outbreak.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/041720-DJIA-flue.png))**\n\n&gt; So, once the mortality rate of the Spanish flu dropped down to zero, it must have been nothing but clear skies ahead for the Dow, right? Well, not necessarily. When it comes to the stock market, there's always something. Less than a year after the mortality rate from the Spanish flu dropped down to zero, the US economy actually went into a year and a half long recession. That contraction was so severe that it has been dubbed the Depression of 1920/21, one where unemployment topped 10% and deflation was as high as 18%! The bear market that accompanied that recession was also severe as the DJIA declined 46%. Imagine coming out of a pandemic with nothing more than an 11% correction and then getting socked with that!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/041720-DJIA-1920-1921.png))**\n\n*****\n\n# Silver Shining in the Near Term, Gold Shining Over the Long Term\n\n&gt; Gold (GLD) has had an interesting run over the past year. Last spring, the ETF for the yellow metal finally pressed above multiyear resistance roughly around $130. After surging through late summer, GLD continued its rally at the end of 2019 and early 2020 before turning sharply lower alongside stocks in March. But since its March 19th low it has gone on to rally over 17% as of today and is now at its highest levels since early 2013.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/GLD.png))**\n\n&gt; Another precious metal, Silver (SLV), has not been as fortunate. Although it shared in the rally last spring and summer, SLV has yet to eclipse its early September highs. While gold had broken out again in February and March, silver put in a lower high before plummeting to its lost level since 2009 in mid-March.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/SLV.png))**\n\n&gt; But since that low on March 18th, SLV has actually outperformed rising 27.83%. Gold is up only up 15.14% since that same day and 17% since its respective low one day later on March 19th. While the S&amp;P 500's (SPY) low was not put in place until a few days after gold and silver on March 23rd, since March 18th, SLV is also outperforming SPY's 15.97% gain.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/Performance-1.png))**\n\n&gt; Over the long term, though SLV is still the worst performer of the group. As shown in the chart below, SLV is down 8.84% over the past two years while the S&amp;P 500's gains have also been somewhat lackluster thanks to the most recent sell-off with only a 4.11% gain. Gold, on the other hand, has outshined the other two having surged 26.93%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/Percent-GLD-SLV-SPY.png))**\n\n*****\n\n# It’s Earnings Season (Or Whatever it is Companies Plan to Report)\n\n&gt; It’s that time of year again. The time when corporate America reports financial results for the prior three months. Normally, we call it earnings season, but given the fact that most of the US economy has been shut down and no timetable is set for when it re-opens, for a lot of companies out there, there really isn’t much in the way of earnings, revenues, or guidance to speak of. Instead, this reporting period will likely be a lot of companies trying to put the best spin on how much (or little) cash they have on hand to withstand the shutdown.\n\n&gt; Besides the major banks and financials, there hasn’t been a whole lot in the way of reports to speak of, but of the results we have seen, the stock market reaction hasn’t been great as companies like Johnson &amp; Johnson (JNJ), JP Morgan (JPM), Wells Fargo (WFC), Bank of America (BAC), and Goldman Sachs (GS) have all seen negative reactions to their reports. The only large-cap that has really reacted positively to earnings so far is UnitedHealth (UNH) which gained more than 4%. Next week, the pace of reports will pick up, but the peak period for reports won’t be for another two weeks when more than 300 companies will report in a single day.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/calendar.png))**\n\n*****\n\n# Typical April Trading: Strength from Start to Finish\n\n&gt; April, the last month of DJIA &amp; S&amp;P 500 “Best Six Months,” has a strong historical track record. April 1999 was the first month DJIA gained over 1000 points (10.25%). April is also DJIA’s best month since 1950 with an average 1.9% gain. After a disastrous March, the rally than began in late March has extended in April. As of yesterday’s close, DJIA is up 7.39% so far this April. S&amp;P 500 is up 8.32%, NASDAQ has risen 10.81%. Small caps, measured by the Russell 2000 have not fared as well, up just 2.17%.\n\n&gt; April’s historical performance over the recent 21-year period is plotted in the chart above (21-year average is on the left vertical scale) compared to April 2020 (right vertical scale). Magnitude of gains this year is substantial however, the trend this year has been similar to past years. Should the current trend remain intact, further gains this month are possible. Coronavirus uncertainty remains extremely elevated, but there does to be some light flickering at the end of tunnel.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/826c536dba71629e9d1a26329db32eba/97c8d036ee5ba87c-9b/s500x750/55708144eea7c12b24adf731e9dc63e41e31604b.jpg))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending April 17th, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=Gl9EH42Ldgc))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 4.19.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$NFLX** \n&gt; * **$DAL** \n&gt; * **$KO** \n&gt; * **$INFY** \n&gt; * **$HAL** \n&gt; * **$LMT** \n&gt; * **$ALLY** \n&gt; * **$SNAP** \n&gt; * **$T** \n&gt; * **$DPZ** \n&gt; * **$IBM** \n&gt; * **$PM** \n&gt; * **$INTC** \n&gt; * **$LUV** \n&gt; * **$CMG** \n&gt; * **$BIIB** \n&gt; * **$HCA** \n&gt; * **$VZ** \n&gt; * **$BOH** \n&gt; * **$MTB** \n&gt; * **$ONB** \n&gt; * **$SAP** \n&gt; * **$BMRC** \n&gt; * **$CMA** \n&gt; * **$PHG** \n&gt; * **$AXP** \n&gt; * **$ERIC** \n&gt; * **$CBU** \n&gt; * **$KMB** \n&gt; * **$TFC** \n&gt; * **$PLD** \n&gt; * **$SYF** \n&gt; * **$NEE** \n&gt; * **$LII** \n&gt; * **$NDAQ** \n&gt; * **$LLY** \n&gt; * **$SNA** \n&gt; * **$LVS** \n&gt; * **$TRV** \n&gt; * **$LRCX** \n&gt; * **$KALU** \n&gt; * **$EMR** \n&gt; * **$CIT** \n&gt; * **$FITB**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/douLwsS.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/zBd2gQL.png))**\n###### **([CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES FOR THE MONTH OF APRIL 2020!](https://i.imgur.com/wlvhXbo.jpg))**\n###### **([CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES BEFORE MONDAY'S OPEN!](https://i.imgur.com/25QY7uo.jpg))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 4.20.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/uzAy7Pk.png))\n\n\n&gt; # ***Monday 4.20.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/xjSoWZ3.png))\n\n\n*****\n\n&gt; # ***Tuesday 4.21.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/RbwZ1le.png))\n\n&gt; # ***Tuesday 4.21.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/DjS7QnD.png))\n\n*****\n\n&gt; # ***Wednesday 4.22.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/aY4wQPz.png))\n\n&gt; # ***Wednesday 4.22.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/F2u6ejr.png))\n\n*****\n\n&gt; # ***Thursday 4.23.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/QW6sJiO.png))\n\n&gt; # ***Thursday 4.23.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/gylBF9c.png))\n\n*****\n\n&gt; # ***Friday 4.24.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/vwNztBG.png))\n\n*****\n\n&gt; # ***Friday 4.24.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# Netflix, Inc. $422.96\n&gt; **Netflix, Inc. (NFLX)** is confirmed to report earnings at approximately 4:00 PM ET on Tuesday, April 21, 2020. The consensus earnings estimate is $1.61 per share on revenue of $5.70 billion and the Earnings Whisper ® number is $1.68 per share. Investor sentiment going into the company's earnings release has 76% expecting an earnings beat The company's guidance was for earnings of approximately $1.66 per share. Consensus estimates are for year-over-year earnings growth of 111.84% with revenue increasing by 26.08%. Short interest has decreased by 28.5% since the company's last earnings release while the stock has drifted higher by 27.2% from its open following the earnings release to be 31.0% above its 200 day moving average of $322.81. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, April 17, 2020 there was some notable buying of 5,963 contracts of the $470.00 call expiring on Friday, April 24, 2020. Option traders are pricing in a 12.7% move on earnings and the stock has averaged a 4.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NFLX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Delta Air Lines, Inc. $24.27\n&gt; **Delta Air Lines, Inc. (DAL)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, April 22, 2020. The consensus estimate is for a loss of $0.70 per share on revenue of $9.64 billion and the Earnings Whisper ® number is ($1.41) per share. Investor sentiment going into the company's earnings release has 26% expecting an earnings miss. Consensus estimates are for earnings to decline year-over-year by 172.92% with revenue decreasing by 7.94%. Short interest has increased by 38.3% since the company's last earnings release while the stock has drifted lower by 60.9% from its open following the earnings release to be 54.1% below its 200 day moving average of $52.86. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, April 16, 2020 there was some notable buying of 13,289 contracts of the $25.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 12.3% move on earnings and the stock has averaged a 1.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Coca-Cola Company $48.06\n&gt; **Coca-Cola Company (KO)** is confirmed to report earnings at approximately 6:55 AM ET on Tuesday, April 21, 2020. The consensus earnings estimate is $0.44 per share on revenue of $8.49 billion and the Earnings Whisper ® number is $0.44 per share. Investor sentiment going into the company's earnings release has 55% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 8.33% with revenue increasing by 5.86%. Short interest has decreased by 22.1% since the company's last earnings release while the stock has drifted lower by 17.0% from its open following the earnings release to be 10.0% below its 200 day moving average of $53.39. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, April 17, 2020 there was some notable buying of 4,000 contracts of the $42.00 put expiring on Friday, May 8, 2020. Option traders are pricing in a 5.6% move on earnings and the stock has averaged a 4.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=KO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Infosys Technologies Ltd. $8.58\n&gt; **Infosys Technologies Ltd. (INFY)** is confirmed to report earnings at approximately 7:55 AM ET on Monday, April 20, 2020. The consensus earnings estimate is $0.14 per share on revenue of $3.29 billion and the Earnings Whisper ® number is $0.15 per share. Investor sentiment going into the company's earnings release has 29% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 7.69% with revenue increasing by 7.52%. Short interest has increased by 23.9% since the company's last earnings release while the stock has drifted lower by 22.7% from its open following the earnings release to be 19.2% below its 200 day moving average of $10.62. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, March 30, 2020 there was some notable buying of 4,005 contracts of the $9.00 put expiring on Friday, October 16, 2020. Option traders are pricing in a 12.2% move on earnings and the stock has averaged a 3.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=INFY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Halliburton Company $7.58\n&gt; **Halliburton Company (HAL)** is confirmed to report earnings at approximately 6:45 AM ET on Monday, April 20, 2020. The consensus earnings estimate is $0.25 per share on revenue of $5.08 billion and the Earnings Whisper ® number is $0.27 per share. Investor sentiment going into the company's earnings release has 17% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 8.70% with revenue decreasing by 11.45%. Short interest has decreased by 17.6% since the company's last earnings release while the stock has drifted lower by 68.1% from its open following the earnings release to be 60.1% below its 200 day moving average of $19.02. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, April 3, 2020 there was some notable buying of 20,284 contracts of the $7.00 put expiring on Friday, May 15, 2020. Option traders are pricing in a 18.3% move on earnings and the stock has averaged a 3.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Lockheed Martin Corp. $401.51\n&gt; **Lockheed Martin Corp. (LMT)** is confirmed to report earnings at approximately 7:30 AM ET on Tuesday, April 21, 2020. The consensus earnings estimate is $5.75 per share on revenue of $15.23 billion and the Earnings Whisper ® number is $5.81 per share. Investor sentiment going into the company's earnings release has 57% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 4.01% with revenue increasing by 6.24%. Short interest has decreased by 30.8% since the company's last earnings release while the stock has drifted lower by 7.7% from its open following the earnings release to be 5.2% above its 200 day moving average of $381.53. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 7.0% move on earnings and the stock has averaged a 1.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LMT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Ally Financial $15.37\n&gt; **Ally Financial (ALLY)** is confirmed to report earnings at approximately 7:30 AM ET on Monday, April 20, 2020. The consensus earnings estimate is $0.74 per share on revenue of $1.61 billion and the Earnings Whisper ® number is $0.61 per share. Investor sentiment going into the company's earnings release has 17% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 7.50% with revenue increasing by 0.75%. Short interest has decreased by 45.8% since the company's last earnings release while the stock has drifted lower by 51.7% from its open following the earnings release to be 46.9% below its 200 day moving average of $28.95. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, March 30, 2020 there was some notable buying of 8,801 contracts of the $10.00 put expiring on Friday, June 19, 2020. Option traders are pricing in a 16.3% move on earnings and the stock has averaged a 4.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ALLY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Snap Inc. $12.98\n&gt; **Snap Inc. (SNAP)** is confirmed to report earnings at approximately 4:10 PM ET on Tuesday, April 21, 2020. The consensus estimate is for a loss of $0.07 per share on revenue of $426.88 million and the Earnings Whisper ® number is ($0.09) per share. Investor sentiment going into the company's earnings release has 55% expecting an earnings beat The company's guidance was for revenue of $450.00 million to $470.00 million. Consensus estimates are for year-over-year earnings growth of 50.00% with revenue increasing by 33.22%. Short interest has decreased by 14.5% since the company's last earnings release while the stock has drifted lower by 28.0% from its open following the earnings release to be 18.3% below its 200 day moving average of $15.89. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, April 17, 2020 there was some notable buying of 9,211 contracts of the $13.50 call expiring on Friday, April 24, 2020. Option traders are pricing in a 17.2% move on earnings and the stock has averaged a 12.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SNAP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# AT&amp;T Corp. $31.23\n&gt; **AT&amp;T Corp. (T)** is confirmed to report earnings at approximately 6:50 AM ET on Wednesday, April 22, 2020. The consensus earnings estimate is $0.85 per share on revenue of $44.38 billion and the Earnings Whisper ® number is $0.87 per share. Investor sentiment going into the company's earnings release has 41% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 1.16% with revenue decreasing by 1.00%. The stock has drifted lower by 18.9% from its open following the earnings release to be 14.0% below its 200 day moving average of $36.30. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, March 31, 2020 there was some notable buying of 50,564 contracts of the $31.00 put expiring on Friday, June 19, 2020. Option traders are pricing in a 5.6% move on earnings and the stock has averaged a 4.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=T&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Domino's Pizza, Inc. $362.97\n&gt; **Domino's Pizza, Inc. (DPZ)** is confirmed to report earnings at approximately 7:30 AM ET on Thursday, April 23, 2020. The consensus earnings estimate is $2.29 per share on revenue of $867.60 million and the Earnings Whisper ® number is $2.34 per share. Investor sentiment going into the company's earnings release has 68% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 4.09% with revenue increasing by 3.78%. Short interest has decreased by 66.9% since the company's last earnings release while the stock has drifted higher by 0.3% from its open following the earnings release to be 29.8% above its 200 day moving average of $279.69. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, April 17, 2020 there was some notable buying of 679 contracts of the $390.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 9.7% move on earnings and the stock has averaged a 9.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DPZ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/StockMarket.",
        "subreddit": "StockMarket",
        "title": "Wall Street Week Ahead for the trading week beginning April 20th, 2020",
        "url": "https://www.reddit.com/r/StockMarket/comments/g3oew1/wall_street_week_ahead_for_the_trading_week/",
        "created": 1587249115.0
    },
    {
        "author": "BuyLowSellNever",
        "created_utc": 1585932308,
        "id": "fubref",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "My top 5 that have really impressive growth, forecast growth and ROIC that are ALSO trading at very attractive prices are:\n\nAMAT\n\nLRCX\n\nHUM\n\nFB\n\nV\n\n\nWhat about you?",
        "subreddit": "stocks",
        "title": "What are your top 5 stocks that you’re watching right now?",
        "url": "https://www.reddit.com/r/stocks/comments/fubref/what_are_your_top_5_stocks_that_youre_watching/",
        "created": 1585961108.0
    },
    {
        "author": "TrueHavoc",
        "created_utc": 1586081764,
        "id": "fvbmb8",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Between the two, what would do better? At first I was leaning towards Lam, but after doing more research I feel that ASML is stronger. I'm relatively new to stocks so, wanted opinions of the wise community of r/investing",
        "subreddit": "investing",
        "title": "ASML vs LRCX",
        "url": "https://www.reddit.com/r/investing/comments/fvbmb8/asml_vs_lrcx/",
        "created": 1586110564.0
    },
    {
        "author": "AltristicOffice",
        "created_utc": 1585802973,
        "id": "ftg5ci",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I looked at LRCX back in January 2017 when I was still in high school. Turns out it nearly tripled before the market decline. Is it too overpriced now?",
        "subreddit": "stocks",
        "title": "LRCX",
        "url": "https://www.reddit.com/r/stocks/comments/ftg5ci/lrcx/",
        "created": 1585831773.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1587220565,
        "id": "g3oh6c",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/smallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning April 20th, 2020.\n\n# **A blast of earnings news is coming, but the market may be more focused on when the economy will reopen  - [(Source)](https://www.cnbc.com/2020/04/17/a-blast-of-earnings-news-is-coming-but-the-market-may-be-more-focused-on-when-the-economy-will-reopen.html)**\n*****\n&gt; Earnings from IBM, Netflix, Coca-Cola and dozens of others are expected in the week ahead, but as the state shutdowns now reach the one-month threshold, the market is more likely to trade on virus headlines and news about reopening the economy.\n*****\n&gt; There are also some important economic reports, including existing home sales on Monday and durable goods on Friday. But it is the weekly jobless claims data that will again be most relevant, as economists watch to see whether the number of workers seeking claims has now peaked and whether there are any signs some are returning to jobs, as government funds reach the hands of business owners.\n*****\n&gt; In the past week, stocks were higher, but there was a divergence with the Dow up just under 2.2% at 24,242, and Nasdaq, surging 6%, lifted by tech and biotech. The S&amp;P 500 gained 3% for the week and is now 31% off its March lows.\n*****\n&gt; Stocks gained amid signs the virus outbreak has peaked and some reopenings could start slowly in the next few weeks.\n*****\n&gt; The market also bounced Friday as the results of an early study of a Gilead drug showed promise with severe cases of coronavirus. Technology stocks were up about 4% for the week, and health care was up more than 5% while consumer discretionary stocks led with a gain of more than 6%.\n*****\n&gt; “As the virus news goes, so go risk assets. People expect bad economic data,” said Patrick Leary, chief market strategist at Incapital. “The data is all expected to be horrible. The only economic data we can really look at now and start to measure is the claims data on Thursday.” As of April 11, more than 22 million workers claimed unemployment benefits over a four-week period, as states shut down and schools, restaurants, stores and many other businesses closed or were forced to cut back.\n*****\n&gt; Charts are important\n&gt; Analysts who watch stock charts say technical levels will continue to have a powerful pull on the market, since so many traders have set their computers to trade around those numbers.\n*****\n&gt; For instance, the S&amp;P 500 had a hard time breaking through the 50-day moving average Friday, and fell back after it initially edged near 2,862 in morning trading. But at the end of the trading day, it smashed through that level, surging to close at 2,874, a positive sign for Monday’s open. The 50-day literally is the average closing price for the S&amp;P over the previous 50 sessions. Technical analysts believe watching moving averages gives them an important tool for price trends and momentum.\n*****\n&gt; Bob Doll, Nuveen’s chief equity strategist, said he believes the market hit its bear market low on March 23, but it could take another dive towards lows at some point.\n*****\n&gt; “My [low] target was 2,350. We spent 36 hours below that and got to 2,192. If there’s a secondary low, then probably the lowest chance is 2,350,” he said. “I’m not sure we’re going to go there, based on two things, the power of the rally and two, the stimulus. It’s been awesome.”\n*****\n&gt; Travelers, and Texas Instruments release results Tuesday. AT&amp;T, Delta Airlines, and Intel, Blackstone and Eli Lily are reporting Thursday. American Express and Verizon are expected Friday.\n*****\n&gt; Doll said he expects the market to listen to comments from corporate executives on conference calls but ignore the actual earnings. “The market is going to pay a lot more attention to what can a rebound look like, and what can 2021 numbers look like,” he said. “They’ll be selling on that versus how deep is the hole going to be in the second quarter. The macro questions around that are recurrence, therapeutics, and vaccine and how fast can the economy come back, and nobody knows the answer to that.”\n*****\n&gt; President Donald Trump laid out guidelines for reopening the economy, but left the decision making up to the states, which are facing varied levels of new infections. One issue is the lack of testing, and American businesses have pressed for more availability of test kits so workers can be brought back more safely.\n*****\n&gt; Doll said he is partial to health care and technology stocks, and one reason is because of the Fed’s quantitative easing programs. “We’re now in QE4. We had QE1, QE2, QE3, and six months after QE 1, 2 and 3, there were two sectors that outperformed-technology and health care, and there were two that underperformed, utilities and REITs,” he said.\n*****\n&gt; Doll said he also is looking at how stocks might come through the virus shutdowns. “Part of what you want to make sure is the company is going to make it through, and make sure the industry has decent demand getting out of it. If it has decent demand during it, that’s a good thing, and that takes you back to health care and technology,” said Doll.\n*****\n&gt; Leary said he expects companies to be scrutinized somewhat differently by analysts this quarter, and balance sheets will be more important.\n*****\n&gt; “Its going to be on a case-by-case basis about how analysts are going to look at them. This is not a typical recession. Recessions seem to hit different sectors,” he said, “This one one is different in that it really has several losers like airlines and travel and entertainment companies. It has some real winners too. I like health care and pharma. Anything that’s defensive in nature is going to perform well.”\n*****\n&gt; Companies have been tapping the corporate bond market at a record pace to boost their cash piles to help them through the economy’s shutdown, and the coming week should be no different.\n*****\n&gt; The corporate debt market has been open for business and spreads have narrowed since the Fed announced a program to buy corporate debt. Companies have issued more than $160 billion in investment grade bonds so far this month, with JP Morgan issuing $10 billion this past week in the biggest bank deal ever, according to Credit Flow Research.\n*****\n&gt; More are expected in the coming week, as companies report earnings and exit the blackout period.\n*****\n&gt; “I think what corporate treasurers know is the window of opportunity for issuing debt at reasonable rates will quickly close once the economy starts opening,” said Leary. He said balance sheets and earnings will be more scrutinized once things start to become more normal.\n*****\n&gt; “They won’t have an excuse anymore ... right now, everything is expected to unexpected,” he said, “I think that window will close, and we’ll have to take a look at the bond market again. Their ability to issue will be impacted by their balance sheets...[now] there’s plenty of cash coming at them. The Fed will step in to support.”\n*****\n&gt; Leary said some of the interest in corporate bonds is from investors who are fearful of buying stocks right now but may want to invest in a company through the safer play of its bonds. Leary said energy bonds are among the least desirable, with the huge drop in crude prices.\n*****\n&gt; West Texas Intermediate crude futures for May settled at $18.72 per barrel, it lowest level since January, 2002. But that contract expires Tuesday. The June contract settled at $25.08 per barrel, and will resume trading there next week as the active contract.\n*****\n&gt; “It’s just a reflection of physical market conditions,” said John Kilduff of Again Capital, of the big decline in the May contract. He said it shows that futures traders do not want to actually take delivery of the commodity, due to an increasing lack of storage space.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/DgwrUcm.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/yKRo7Ea.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/3rA0fDB.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/DrwoiV6.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/i40FkmH.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/nMvlyBE.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/R8OVKd3.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/eZZyOqa.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/douLwsS.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/y2laKRP.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/dBSYk0L.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/LwQokav.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/zgBClvX.png))**\n###### **([CLICK HERE FOR THE CHART LINK #4!](https://i.imgur.com/Fcc6DrP.png))**\n\n*****\n\n# How Markets Performed During the Spanish Flu\n\n&gt; With equities surging into the close ahead of the weekend, traders are shrugging their shoulders wondering how the hell the market is rallying given the economic damage inflicted by the COVID-19 outbreak, which has been cited as the worst pandemic to hit the United States since the 1918 Spanish flu. This leads to the question, how did the stock market perform during the Spanish flu outbreak? The chart below compares the performance of the DJIA to the weekly mortality rate of the Spanish flu during each of the waves of that pandemic from mid-1918 through early 1919 (as cited in a WSJ article earlier today).\n\n&gt; Looking at how the outbreak of the Spanish flu played out, there were basically three different waves of the virus (red line). The first wave in the summer of 1918 was a relatively mild one compared to the other two, and the DJIA's performance during that wave was essentially flat as it never declined more than 3%. The real damage from the Spanish flu was in the fall of 1918 when the mortality rate spiked up as high as 24 per 1,000 people per week. During that wave of the pandemic, which also came in the thick of a post-WWI recession, the DJIA peaked just as the wave was getting underway and fell for the next three months. Even with the severity of the outbreak during that wave, though, the DJIA never fell more than 11% from peak to trough. On a comparative basis, even after the 28% rally over the last four weeks, the S&amp;P 500 is still down 15% from its high. Obviously, comparing two periods more than 100 years apart is hardly an apples to apples comparison, but it's still interesting that during what was an even deadlier pandemic in 1918, the DJIA never even approached anything close to a bear market.\n\n&gt; Looking at the chart, the DJIA's low of the decline coincided with the second wave of the outbreak just as the third (more mild) wave of the pandemic was getting underway. Furthermore, during that third wave, the DJIA kicked off what was a strong rally of more than 25% in less than three months on optimism over an end to the outbreak.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/041720-DJIA-flue.png))**\n\n&gt; So, once the mortality rate of the Spanish flu dropped down to zero, it must have been nothing but clear skies ahead for the Dow, right? Well, not necessarily. When it comes to the stock market, there's always something. Less than a year after the mortality rate from the Spanish flu dropped down to zero, the US economy actually went into a year and a half long recession. That contraction was so severe that it has been dubbed the Depression of 1920/21, one where unemployment topped 10% and deflation was as high as 18%! The bear market that accompanied that recession was also severe as the DJIA declined 46%. Imagine coming out of a pandemic with nothing more than an 11% correction and then getting socked with that!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/041720-DJIA-1920-1921.png))**\n\n*****\n\n# Silver Shining in the Near Term, Gold Shining Over the Long Term\n\n&gt; Gold (GLD) has had an interesting run over the past year. Last spring, the ETF for the yellow metal finally pressed above multiyear resistance roughly around $130. After surging through late summer, GLD continued its rally at the end of 2019 and early 2020 before turning sharply lower alongside stocks in March. But since its March 19th low it has gone on to rally over 17% as of today and is now at its highest levels since early 2013.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/GLD.png))**\n\n&gt; Another precious metal, Silver (SLV), has not been as fortunate. Although it shared in the rally last spring and summer, SLV has yet to eclipse its early September highs. While gold had broken out again in February and March, silver put in a lower high before plummeting to its lost level since 2009 in mid-March.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/SLV.png))**\n\n&gt; But since that low on March 18th, SLV has actually outperformed rising 27.83%. Gold is up only up 15.14% since that same day and 17% since its respective low one day later on March 19th. While the S&amp;P 500's (SPY) low was not put in place until a few days after gold and silver on March 23rd, since March 18th, SLV is also outperforming SPY's 15.97% gain.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/Performance-1.png))**\n\n&gt; Over the long term, though SLV is still the worst performer of the group. As shown in the chart below, SLV is down 8.84% over the past two years while the S&amp;P 500's gains have also been somewhat lackluster thanks to the most recent sell-off with only a 4.11% gain. Gold, on the other hand, has outshined the other two having surged 26.93%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/Percent-GLD-SLV-SPY.png))**\n\n*****\n\n# It’s Earnings Season (Or Whatever it is Companies Plan to Report)\n\n&gt; It’s that time of year again. The time when corporate America reports financial results for the prior three months. Normally, we call it earnings season, but given the fact that most of the US economy has been shut down and no timetable is set for when it re-opens, for a lot of companies out there, there really isn’t much in the way of earnings, revenues, or guidance to speak of. Instead, this reporting period will likely be a lot of companies trying to put the best spin on how much (or little) cash they have on hand to withstand the shutdown.\n\n&gt; Besides the major banks and financials, there hasn’t been a whole lot in the way of reports to speak of, but of the results we have seen, the stock market reaction hasn’t been great as companies like Johnson &amp; Johnson (JNJ), JP Morgan (JPM), Wells Fargo (WFC), Bank of America (BAC), and Goldman Sachs (GS) have all seen negative reactions to their reports. The only large-cap that has really reacted positively to earnings so far is UnitedHealth (UNH) which gained more than 4%. Next week, the pace of reports will pick up, but the peak period for reports won’t be for another two weeks when more than 300 companies will report in a single day.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/calendar.png))**\n\n*****\n\n# Typical April Trading: Strength from Start to Finish\n\n&gt; April, the last month of DJIA &amp; S&amp;P 500 “Best Six Months,” has a strong historical track record. April 1999 was the first month DJIA gained over 1000 points (10.25%). April is also DJIA’s best month since 1950 with an average 1.9% gain. After a disastrous March, the rally than began in late March has extended in April. As of yesterday’s close, DJIA is up 7.39% so far this April. S&amp;P 500 is up 8.32%, NASDAQ has risen 10.81%. Small caps, measured by the Russell 2000 have not fared as well, up just 2.17%.\n\n&gt; April’s historical performance over the recent 21-year period is plotted in the chart above (21-year average is on the left vertical scale) compared to April 2020 (right vertical scale). Magnitude of gains this year is substantial however, the trend this year has been similar to past years. Should the current trend remain intact, further gains this month are possible. Coronavirus uncertainty remains extremely elevated, but there does to be some light flickering at the end of tunnel.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/826c536dba71629e9d1a26329db32eba/97c8d036ee5ba87c-9b/s500x750/55708144eea7c12b24adf731e9dc63e41e31604b.jpg))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$NFLX** \n&gt; * **$DAL** \n&gt; * **$KO** \n&gt; * **$INFY** \n&gt; * **$HAL** \n&gt; * **$LMT** \n&gt; * **$ALLY** \n&gt; * **$SNAP** \n&gt; * **$T** \n&gt; * **$DPZ** \n&gt; * **$IBM** \n&gt; * **$PM** \n&gt; * **$INTC** \n&gt; * **$LUV** \n&gt; * **$CMG** \n&gt; * **$BIIB** \n&gt; * **$HCA** \n&gt; * **$VZ** \n&gt; * **$BOH** \n&gt; * **$MTB** \n&gt; * **$ONB** \n&gt; * **$SAP** \n&gt; * **$BMRC** \n&gt; * **$CMA** \n&gt; * **$PHG** \n&gt; * **$AXP** \n&gt; * **$ERIC** \n&gt; * **$CBU** \n&gt; * **$KMB** \n&gt; * **$TFC** \n&gt; * **$PLD** \n&gt; * **$SYF** \n&gt; * **$NEE** \n&gt; * **$LII** \n&gt; * **$NDAQ** \n&gt; * **$LLY** \n&gt; * **$SNA** \n&gt; * **$LVS** \n&gt; * **$TRV** \n&gt; * **$LRCX** \n&gt; * **$KALU** \n&gt; * **$EMR** \n&gt; * **$CIT** \n&gt; * **$FITB**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/douLwsS.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/zBd2gQL.png))**\n###### **([CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES FOR THE MONTH OF APRIL 2020!](https://i.imgur.com/wlvhXbo.jpg))**\n###### **([CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES BEFORE MONDAY'S OPEN!](https://i.imgur.com/25QY7uo.jpg))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 4.20.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/uzAy7Pk.png))\n\n\n&gt; # ***Monday 4.20.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/xjSoWZ3.png))\n\n\n*****\n\n&gt; # ***Tuesday 4.21.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/RbwZ1le.png))\n\n&gt; # ***Tuesday 4.21.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/DjS7QnD.png))\n\n*****\n\n&gt; # ***Wednesday 4.22.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/aY4wQPz.png))\n\n&gt; # ***Wednesday 4.22.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/F2u6ejr.png))\n\n*****\n\n&gt; # ***Thursday 4.23.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/QW6sJiO.png))\n\n&gt; # ***Thursday 4.23.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/gylBF9c.png))\n\n*****\n\n&gt; # ***Friday 4.24.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/vwNztBG.png))\n\n*****\n\n&gt; # ***Friday 4.24.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# Netflix, Inc. $422.96\n&gt; **Netflix, Inc. (NFLX)** is confirmed to report earnings at approximately 4:00 PM ET on Tuesday, April 21, 2020. The consensus earnings estimate is $1.61 per share on revenue of $5.70 billion and the Earnings Whisper ® number is $1.68 per share. Investor sentiment going into the company's earnings release has 76% expecting an earnings beat The company's guidance was for earnings of approximately $1.66 per share. Consensus estimates are for year-over-year earnings growth of 111.84% with revenue increasing by 26.08%. Short interest has decreased by 28.5% since the company's last earnings release while the stock has drifted higher by 27.2% from its open following the earnings release to be 31.0% above its 200 day moving average of $322.81. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, April 17, 2020 there was some notable buying of 5,963 contracts of the $470.00 call expiring on Friday, April 24, 2020. Option traders are pricing in a 12.7% move on earnings and the stock has averaged a 4.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NFLX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Delta Air Lines, Inc. $24.27\n&gt; **Delta Air Lines, Inc. (DAL)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, April 22, 2020. The consensus estimate is for a loss of $0.70 per share on revenue of $9.64 billion and the Earnings Whisper ® number is ($1.41) per share. Investor sentiment going into the company's earnings release has 26% expecting an earnings miss. Consensus estimates are for earnings to decline year-over-year by 172.92% with revenue decreasing by 7.94%. Short interest has increased by 38.3% since the company's last earnings release while the stock has drifted lower by 60.9% from its open following the earnings release to be 54.1% below its 200 day moving average of $52.86. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, April 16, 2020 there was some notable buying of 13,289 contracts of the $25.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 12.3% move on earnings and the stock has averaged a 1.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Coca-Cola Company $48.06\n&gt; **Coca-Cola Company (KO)** is confirmed to report earnings at approximately 6:55 AM ET on Tuesday, April 21, 2020. The consensus earnings estimate is $0.44 per share on revenue of $8.49 billion and the Earnings Whisper ® number is $0.44 per share. Investor sentiment going into the company's earnings release has 55% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 8.33% with revenue increasing by 5.86%. Short interest has decreased by 22.1% since the company's last earnings release while the stock has drifted lower by 17.0% from its open following the earnings release to be 10.0% below its 200 day moving average of $53.39. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, April 17, 2020 there was some notable buying of 4,000 contracts of the $42.00 put expiring on Friday, May 8, 2020. Option traders are pricing in a 5.6% move on earnings and the stock has averaged a 4.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=KO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Infosys Technologies Ltd. $8.58\n&gt; **Infosys Technologies Ltd. (INFY)** is confirmed to report earnings at approximately 7:55 AM ET on Monday, April 20, 2020. The consensus earnings estimate is $0.14 per share on revenue of $3.29 billion and the Earnings Whisper ® number is $0.15 per share. Investor sentiment going into the company's earnings release has 29% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 7.69% with revenue increasing by 7.52%. Short interest has increased by 23.9% since the company's last earnings release while the stock has drifted lower by 22.7% from its open following the earnings release to be 19.2% below its 200 day moving average of $10.62. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, March 30, 2020 there was some notable buying of 4,005 contracts of the $9.00 put expiring on Friday, October 16, 2020. Option traders are pricing in a 12.2% move on earnings and the stock has averaged a 3.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=INFY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Halliburton Company $7.58\n&gt; **Halliburton Company (HAL)** is confirmed to report earnings at approximately 6:45 AM ET on Monday, April 20, 2020. The consensus earnings estimate is $0.25 per share on revenue of $5.08 billion and the Earnings Whisper ® number is $0.27 per share. Investor sentiment going into the company's earnings release has 17% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 8.70% with revenue decreasing by 11.45%. Short interest has decreased by 17.6% since the company's last earnings release while the stock has drifted lower by 68.1% from its open following the earnings release to be 60.1% below its 200 day moving average of $19.02. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, April 3, 2020 there was some notable buying of 20,284 contracts of the $7.00 put expiring on Friday, May 15, 2020. Option traders are pricing in a 18.3% move on earnings and the stock has averaged a 3.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Lockheed Martin Corp. $401.51\n&gt; **Lockheed Martin Corp. (LMT)** is confirmed to report earnings at approximately 7:30 AM ET on Tuesday, April 21, 2020. The consensus earnings estimate is $5.75 per share on revenue of $15.23 billion and the Earnings Whisper ® number is $5.81 per share. Investor sentiment going into the company's earnings release has 57% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 4.01% with revenue increasing by 6.24%. Short interest has decreased by 30.8% since the company's last earnings release while the stock has drifted lower by 7.7% from its open following the earnings release to be 5.2% above its 200 day moving average of $381.53. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 7.0% move on earnings and the stock has averaged a 1.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LMT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Ally Financial $15.37\n&gt; **Ally Financial (ALLY)** is confirmed to report earnings at approximately 7:30 AM ET on Monday, April 20, 2020. The consensus earnings estimate is $0.74 per share on revenue of $1.61 billion and the Earnings Whisper ® number is $0.61 per share. Investor sentiment going into the company's earnings release has 17% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 7.50% with revenue increasing by 0.75%. Short interest has decreased by 45.8% since the company's last earnings release while the stock has drifted lower by 51.7% from its open following the earnings release to be 46.9% below its 200 day moving average of $28.95. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, March 30, 2020 there was some notable buying of 8,801 contracts of the $10.00 put expiring on Friday, June 19, 2020. Option traders are pricing in a 16.3% move on earnings and the stock has averaged a 4.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ALLY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Snap Inc. $12.98\n&gt; **Snap Inc. (SNAP)** is confirmed to report earnings at approximately 4:10 PM ET on Tuesday, April 21, 2020. The consensus estimate is for a loss of $0.07 per share on revenue of $426.88 million and the Earnings Whisper ® number is ($0.09) per share. Investor sentiment going into the company's earnings release has 55% expecting an earnings beat The company's guidance was for revenue of $450.00 million to $470.00 million. Consensus estimates are for year-over-year earnings growth of 50.00% with revenue increasing by 33.22%. Short interest has decreased by 14.5% since the company's last earnings release while the stock has drifted lower by 28.0% from its open following the earnings release to be 18.3% below its 200 day moving average of $15.89. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, April 17, 2020 there was some notable buying of 9,211 contracts of the $13.50 call expiring on Friday, April 24, 2020. Option traders are pricing in a 17.2% move on earnings and the stock has averaged a 12.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SNAP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# AT&amp;T Corp. $31.23\n&gt; **AT&amp;T Corp. (T)** is confirmed to report earnings at approximately 6:50 AM ET on Wednesday, April 22, 2020. The consensus earnings estimate is $0.85 per share on revenue of $44.38 billion and the Earnings Whisper ® number is $0.87 per share. Investor sentiment going into the company's earnings release has 41% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 1.16% with revenue decreasing by 1.00%. The stock has drifted lower by 18.9% from its open following the earnings release to be 14.0% below its 200 day moving average of $36.30. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, March 31, 2020 there was some notable buying of 50,564 contracts of the $31.00 put expiring on Friday, June 19, 2020. Option traders are pricing in a 5.6% move on earnings and the stock has averaged a 4.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=T&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Domino's Pizza, Inc. $362.97\n&gt; **Domino's Pizza, Inc. (DPZ)** is confirmed to report earnings at approximately 7:30 AM ET on Thursday, April 23, 2020. The consensus earnings estimate is $2.29 per share on revenue of $867.60 million and the Earnings Whisper ® number is $2.34 per share. Investor sentiment going into the company's earnings release has 68% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 4.09% with revenue increasing by 3.78%. Short interest has decreased by 66.9% since the company's last earnings release while the stock has drifted higher by 0.3% from its open following the earnings release to be 29.8% above its 200 day moving average of $279.69. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, April 17, 2020 there was some notable buying of 679 contracts of the $390.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 9.7% move on earnings and the stock has averaged a 9.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DPZ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/smallstreetbets.",
        "subreddit": "smallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning April 20th, 2020",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/g3oh6c/wall_street_week_ahead_for_the_trading_week/",
        "created": 1587249365.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1587220923,
        "id": "g3okfm",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/stocks. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning April 20th, 2020.\n\n# **A blast of earnings news is coming, but the market may be more focused on when the economy will reopen  - [(Source)](https://www.cnbc.com/2020/04/17/a-blast-of-earnings-news-is-coming-but-the-market-may-be-more-focused-on-when-the-economy-will-reopen.html)**\n*****\n&gt; Earnings from IBM, Netflix, Coca-Cola and dozens of others are expected in the week ahead, but as the state shutdowns now reach the one-month threshold, the market is more likely to trade on virus headlines and news about reopening the economy.\n*****\n&gt; There are also some important economic reports, including existing home sales on Monday and durable goods on Friday. But it is the weekly jobless claims data that will again be most relevant, as economists watch to see whether the number of workers seeking claims has now peaked and whether there are any signs some are returning to jobs, as government funds reach the hands of business owners.\n*****\n&gt; In the past week, stocks were higher, but there was a divergence with the Dow up just under 2.2% at 24,242, and Nasdaq, surging 6%, lifted by tech and biotech. The S&amp;P 500 gained 3% for the week and is now 31% off its March lows.\n*****\n&gt; Stocks gained amid signs the virus outbreak has peaked and some reopenings could start slowly in the next few weeks.\n*****\n&gt; The market also bounced Friday as the results of an early study of a Gilead drug showed promise with severe cases of coronavirus. Technology stocks were up about 4% for the week, and health care was up more than 5% while consumer discretionary stocks led with a gain of more than 6%.\n*****\n&gt; “As the virus news goes, so go risk assets. People expect bad economic data,” said Patrick Leary, chief market strategist at Incapital. “The data is all expected to be horrible. The only economic data we can really look at now and start to measure is the claims data on Thursday.” As of April 11, more than 22 million workers claimed unemployment benefits over a four-week period, as states shut down and schools, restaurants, stores and many other businesses closed or were forced to cut back.\n*****\n&gt; Charts are important\n&gt; Analysts who watch stock charts say technical levels will continue to have a powerful pull on the market, since so many traders have set their computers to trade around those numbers.\n*****\n&gt; For instance, the S&amp;P 500 had a hard time breaking through the 50-day moving average Friday, and fell back after it initially edged near 2,862 in morning trading. But at the end of the trading day, it smashed through that level, surging to close at 2,874, a positive sign for Monday’s open. The 50-day literally is the average closing price for the S&amp;P over the previous 50 sessions. Technical analysts believe watching moving averages gives them an important tool for price trends and momentum.\n*****\n&gt; Bob Doll, Nuveen’s chief equity strategist, said he believes the market hit its bear market low on March 23, but it could take another dive towards lows at some point.\n*****\n&gt; “My [low] target was 2,350. We spent 36 hours below that and got to 2,192. If there’s a secondary low, then probably the lowest chance is 2,350,” he said. “I’m not sure we’re going to go there, based on two things, the power of the rally and two, the stimulus. It’s been awesome.”\n*****\n&gt; Travelers, and Texas Instruments release results Tuesday. AT&amp;T, Delta Airlines, and Intel, Blackstone and Eli Lily are reporting Thursday. American Express and Verizon are expected Friday.\n*****\n&gt; Doll said he expects the market to listen to comments from corporate executives on conference calls but ignore the actual earnings. “The market is going to pay a lot more attention to what can a rebound look like, and what can 2021 numbers look like,” he said. “They’ll be selling on that versus how deep is the hole going to be in the second quarter. The macro questions around that are recurrence, therapeutics, and vaccine and how fast can the economy come back, and nobody knows the answer to that.”\n*****\n&gt; President Donald Trump laid out guidelines for reopening the economy, but left the decision making up to the states, which are facing varied levels of new infections. One issue is the lack of testing, and American businesses have pressed for more availability of test kits so workers can be brought back more safely.\n*****\n&gt; Doll said he is partial to health care and technology stocks, and one reason is because of the Fed’s quantitative easing programs. “We’re now in QE4. We had QE1, QE2, QE3, and six months after QE 1, 2 and 3, there were two sectors that outperformed-technology and health care, and there were two that underperformed, utilities and REITs,” he said.\n*****\n&gt; Doll said he also is looking at how stocks might come through the virus shutdowns. “Part of what you want to make sure is the company is going to make it through, and make sure the industry has decent demand getting out of it. If it has decent demand during it, that’s a good thing, and that takes you back to health care and technology,” said Doll.\n*****\n&gt; Leary said he expects companies to be scrutinized somewhat differently by analysts this quarter, and balance sheets will be more important.\n*****\n&gt; “Its going to be on a case-by-case basis about how analysts are going to look at them. This is not a typical recession. Recessions seem to hit different sectors,” he said, “This one one is different in that it really has several losers like airlines and travel and entertainment companies. It has some real winners too. I like health care and pharma. Anything that’s defensive in nature is going to perform well.”\n*****\n&gt; Companies have been tapping the corporate bond market at a record pace to boost their cash piles to help them through the economy’s shutdown, and the coming week should be no different.\n*****\n&gt; The corporate debt market has been open for business and spreads have narrowed since the Fed announced a program to buy corporate debt. Companies have issued more than $160 billion in investment grade bonds so far this month, with JP Morgan issuing $10 billion this past week in the biggest bank deal ever, according to Credit Flow Research.\n*****\n&gt; More are expected in the coming week, as companies report earnings and exit the blackout period.\n*****\n&gt; “I think what corporate treasurers know is the window of opportunity for issuing debt at reasonable rates will quickly close once the economy starts opening,” said Leary. He said balance sheets and earnings will be more scrutinized once things start to become more normal.\n*****\n&gt; “They won’t have an excuse anymore ... right now, everything is expected to unexpected,” he said, “I think that window will close, and we’ll have to take a look at the bond market again. Their ability to issue will be impacted by their balance sheets...[now] there’s plenty of cash coming at them. The Fed will step in to support.”\n*****\n&gt; Leary said some of the interest in corporate bonds is from investors who are fearful of buying stocks right now but may want to invest in a company through the safer play of its bonds. Leary said energy bonds are among the least desirable, with the huge drop in crude prices.\n*****\n&gt; West Texas Intermediate crude futures for May settled at $18.72 per barrel, it lowest level since January, 2002. But that contract expires Tuesday. The June contract settled at $25.08 per barrel, and will resume trading there next week as the active contract.\n*****\n&gt; “It’s just a reflection of physical market conditions,” said John Kilduff of Again Capital, of the big decline in the May contract. He said it shows that futures traders do not want to actually take delivery of the commodity, due to an increasing lack of storage space.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/DgwrUcm.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/yKRo7Ea.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/3rA0fDB.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/DrwoiV6.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/i40FkmH.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/nMvlyBE.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/R8OVKd3.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/eZZyOqa.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/douLwsS.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/y2laKRP.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/dBSYk0L.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/LwQokav.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/zgBClvX.png))**\n###### **([CLICK HERE FOR THE CHART LINK #4!](https://i.imgur.com/Fcc6DrP.png))**\n\n*****\n\n# How Markets Performed During the Spanish Flu\n\n&gt; With equities surging into the close ahead of the weekend, traders are shrugging their shoulders wondering how the hell the market is rallying given the economic damage inflicted by the COVID-19 outbreak, which has been cited as the worst pandemic to hit the United States since the 1918 Spanish flu. This leads to the question, how did the stock market perform during the Spanish flu outbreak? The chart below compares the performance of the DJIA to the weekly mortality rate of the Spanish flu during each of the waves of that pandemic from mid-1918 through early 1919 (as cited in a WSJ article earlier today).\n\n&gt; Looking at how the outbreak of the Spanish flu played out, there were basically three different waves of the virus (red line). The first wave in the summer of 1918 was a relatively mild one compared to the other two, and the DJIA's performance during that wave was essentially flat as it never declined more than 3%. The real damage from the Spanish flu was in the fall of 1918 when the mortality rate spiked up as high as 24 per 1,000 people per week. During that wave of the pandemic, which also came in the thick of a post-WWI recession, the DJIA peaked just as the wave was getting underway and fell for the next three months. Even with the severity of the outbreak during that wave, though, the DJIA never fell more than 11% from peak to trough. On a comparative basis, even after the 28% rally over the last four weeks, the S&amp;P 500 is still down 15% from its high. Obviously, comparing two periods more than 100 years apart is hardly an apples to apples comparison, but it's still interesting that during what was an even deadlier pandemic in 1918, the DJIA never even approached anything close to a bear market.\n\n&gt; Looking at the chart, the DJIA's low of the decline coincided with the second wave of the outbreak just as the third (more mild) wave of the pandemic was getting underway. Furthermore, during that third wave, the DJIA kicked off what was a strong rally of more than 25% in less than three months on optimism over an end to the outbreak.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/041720-DJIA-flue.png))**\n\n&gt; So, once the mortality rate of the Spanish flu dropped down to zero, it must have been nothing but clear skies ahead for the Dow, right? Well, not necessarily. When it comes to the stock market, there's always something. Less than a year after the mortality rate from the Spanish flu dropped down to zero, the US economy actually went into a year and a half long recession. That contraction was so severe that it has been dubbed the Depression of 1920/21, one where unemployment topped 10% and deflation was as high as 18%! The bear market that accompanied that recession was also severe as the DJIA declined 46%. Imagine coming out of a pandemic with nothing more than an 11% correction and then getting socked with that!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/041720-DJIA-1920-1921.png))**\n\n*****\n\n# Silver Shining in the Near Term, Gold Shining Over the Long Term\n\n&gt; Gold (GLD) has had an interesting run over the past year. Last spring, the ETF for the yellow metal finally pressed above multiyear resistance roughly around $130. After surging through late summer, GLD continued its rally at the end of 2019 and early 2020 before turning sharply lower alongside stocks in March. But since its March 19th low it has gone on to rally over 17% as of today and is now at its highest levels since early 2013.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/GLD.png))**\n\n&gt; Another precious metal, Silver (SLV), has not been as fortunate. Although it shared in the rally last spring and summer, SLV has yet to eclipse its early September highs. While gold had broken out again in February and March, silver put in a lower high before plummeting to its lost level since 2009 in mid-March.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/SLV.png))**\n\n&gt; But since that low on March 18th, SLV has actually outperformed rising 27.83%. Gold is up only up 15.14% since that same day and 17% since its respective low one day later on March 19th. While the S&amp;P 500's (SPY) low was not put in place until a few days after gold and silver on March 23rd, since March 18th, SLV is also outperforming SPY's 15.97% gain.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/Performance-1.png))**\n\n&gt; Over the long term, though SLV is still the worst performer of the group. As shown in the chart below, SLV is down 8.84% over the past two years while the S&amp;P 500's gains have also been somewhat lackluster thanks to the most recent sell-off with only a 4.11% gain. Gold, on the other hand, has outshined the other two having surged 26.93%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/Percent-GLD-SLV-SPY.png))**\n\n*****\n\n# It’s Earnings Season (Or Whatever it is Companies Plan to Report)\n\n&gt; It’s that time of year again. The time when corporate America reports financial results for the prior three months. Normally, we call it earnings season, but given the fact that most of the US economy has been shut down and no timetable is set for when it re-opens, for a lot of companies out there, there really isn’t much in the way of earnings, revenues, or guidance to speak of. Instead, this reporting period will likely be a lot of companies trying to put the best spin on how much (or little) cash they have on hand to withstand the shutdown.\n\n&gt; Besides the major banks and financials, there hasn’t been a whole lot in the way of reports to speak of, but of the results we have seen, the stock market reaction hasn’t been great as companies like Johnson &amp; Johnson (JNJ), JP Morgan (JPM), Wells Fargo (WFC), Bank of America (BAC), and Goldman Sachs (GS) have all seen negative reactions to their reports. The only large-cap that has really reacted positively to earnings so far is UnitedHealth (UNH) which gained more than 4%. Next week, the pace of reports will pick up, but the peak period for reports won’t be for another two weeks when more than 300 companies will report in a single day.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/calendar.png))**\n\n*****\n\n# Typical April Trading: Strength from Start to Finish\n\n&gt; April, the last month of DJIA &amp; S&amp;P 500 “Best Six Months,” has a strong historical track record. April 1999 was the first month DJIA gained over 1000 points (10.25%). April is also DJIA’s best month since 1950 with an average 1.9% gain. After a disastrous March, the rally than began in late March has extended in April. As of yesterday’s close, DJIA is up 7.39% so far this April. S&amp;P 500 is up 8.32%, NASDAQ has risen 10.81%. Small caps, measured by the Russell 2000 have not fared as well, up just 2.17%.\n\n&gt; April’s historical performance over the recent 21-year period is plotted in the chart above (21-year average is on the left vertical scale) compared to April 2020 (right vertical scale). Magnitude of gains this year is substantial however, the trend this year has been similar to past years. Should the current trend remain intact, further gains this month are possible. Coronavirus uncertainty remains extremely elevated, but there does to be some light flickering at the end of tunnel.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/826c536dba71629e9d1a26329db32eba/97c8d036ee5ba87c-9b/s500x750/55708144eea7c12b24adf731e9dc63e41e31604b.jpg))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$NFLX** \n&gt; * **$DAL** \n&gt; * **$KO** \n&gt; * **$INFY** \n&gt; * **$HAL** \n&gt; * **$LMT** \n&gt; * **$ALLY** \n&gt; * **$SNAP** \n&gt; * **$T** \n&gt; * **$DPZ** \n&gt; * **$IBM** \n&gt; * **$PM** \n&gt; * **$INTC** \n&gt; * **$LUV** \n&gt; * **$CMG** \n&gt; * **$BIIB** \n&gt; * **$HCA** \n&gt; * **$VZ** \n&gt; * **$BOH** \n&gt; * **$MTB** \n&gt; * **$ONB** \n&gt; * **$SAP** \n&gt; * **$BMRC** \n&gt; * **$CMA** \n&gt; * **$PHG** \n&gt; * **$AXP** \n&gt; * **$ERIC** \n&gt; * **$CBU** \n&gt; * **$KMB** \n&gt; * **$TFC** \n&gt; * **$PLD** \n&gt; * **$SYF** \n&gt; * **$NEE** \n&gt; * **$LII** \n&gt; * **$NDAQ** \n&gt; * **$LLY** \n&gt; * **$SNA** \n&gt; * **$LVS** \n&gt; * **$TRV** \n&gt; * **$LRCX** \n&gt; * **$KALU** \n&gt; * **$EMR** \n&gt; * **$CIT** \n&gt; * **$FITB**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/douLwsS.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/zBd2gQL.png))**\n###### **([CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES FOR THE MONTH OF APRIL 2020!](https://i.imgur.com/wlvhXbo.jpg))**\n###### **([CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES BEFORE MONDAY'S OPEN!](https://i.imgur.com/25QY7uo.jpg))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 4.20.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/uzAy7Pk.png))\n\n\n&gt; # ***Monday 4.20.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/xjSoWZ3.png))\n\n\n*****\n\n&gt; # ***Tuesday 4.21.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/RbwZ1le.png))\n\n&gt; # ***Tuesday 4.21.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/DjS7QnD.png))\n\n*****\n\n&gt; # ***Wednesday 4.22.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/aY4wQPz.png))\n\n&gt; # ***Wednesday 4.22.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/F2u6ejr.png))\n\n*****\n\n&gt; # ***Thursday 4.23.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/QW6sJiO.png))\n\n&gt; # ***Thursday 4.23.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/gylBF9c.png))\n\n*****\n\n&gt; # ***Friday 4.24.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/vwNztBG.png))\n\n*****\n\n&gt; # ***Friday 4.24.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# Netflix, Inc. $422.96\n&gt; **Netflix, Inc. (NFLX)** is confirmed to report earnings at approximately 4:00 PM ET on Tuesday, April 21, 2020. The consensus earnings estimate is $1.61 per share on revenue of $5.70 billion and the Earnings Whisper ® number is $1.68 per share. Investor sentiment going into the company's earnings release has 76% expecting an earnings beat The company's guidance was for earnings of approximately $1.66 per share. Consensus estimates are for year-over-year earnings growth of 111.84% with revenue increasing by 26.08%. Short interest has decreased by 28.5% since the company's last earnings release while the stock has drifted higher by 27.2% from its open following the earnings release to be 31.0% above its 200 day moving average of $322.81. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, April 17, 2020 there was some notable buying of 5,963 contracts of the $470.00 call expiring on Friday, April 24, 2020. Option traders are pricing in a 12.7% move on earnings and the stock has averaged a 4.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NFLX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Delta Air Lines, Inc. $24.27\n&gt; **Delta Air Lines, Inc. (DAL)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, April 22, 2020. The consensus estimate is for a loss of $0.70 per share on revenue of $9.64 billion and the Earnings Whisper ® number is ($1.41) per share. Investor sentiment going into the company's earnings release has 26% expecting an earnings miss. Consensus estimates are for earnings to decline year-over-year by 172.92% with revenue decreasing by 7.94%. Short interest has increased by 38.3% since the company's last earnings release while the stock has drifted lower by 60.9% from its open following the earnings release to be 54.1% below its 200 day moving average of $52.86. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, April 16, 2020 there was some notable buying of 13,289 contracts of the $25.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 12.3% move on earnings and the stock has averaged a 1.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Coca-Cola Company $48.06\n&gt; **Coca-Cola Company (KO)** is confirmed to report earnings at approximately 6:55 AM ET on Tuesday, April 21, 2020. The consensus earnings estimate is $0.44 per share on revenue of $8.49 billion and the Earnings Whisper ® number is $0.44 per share. Investor sentiment going into the company's earnings release has 55% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 8.33% with revenue increasing by 5.86%. Short interest has decreased by 22.1% since the company's last earnings release while the stock has drifted lower by 17.0% from its open following the earnings release to be 10.0% below its 200 day moving average of $53.39. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, April 17, 2020 there was some notable buying of 4,000 contracts of the $42.00 put expiring on Friday, May 8, 2020. Option traders are pricing in a 5.6% move on earnings and the stock has averaged a 4.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=KO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Infosys Technologies Ltd. $8.58\n&gt; **Infosys Technologies Ltd. (INFY)** is confirmed to report earnings at approximately 7:55 AM ET on Monday, April 20, 2020. The consensus earnings estimate is $0.14 per share on revenue of $3.29 billion and the Earnings Whisper ® number is $0.15 per share. Investor sentiment going into the company's earnings release has 29% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 7.69% with revenue increasing by 7.52%. Short interest has increased by 23.9% since the company's last earnings release while the stock has drifted lower by 22.7% from its open following the earnings release to be 19.2% below its 200 day moving average of $10.62. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, March 30, 2020 there was some notable buying of 4,005 contracts of the $9.00 put expiring on Friday, October 16, 2020. Option traders are pricing in a 12.2% move on earnings and the stock has averaged a 3.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=INFY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Halliburton Company $7.58\n&gt; **Halliburton Company (HAL)** is confirmed to report earnings at approximately 6:45 AM ET on Monday, April 20, 2020. The consensus earnings estimate is $0.25 per share on revenue of $5.08 billion and the Earnings Whisper ® number is $0.27 per share. Investor sentiment going into the company's earnings release has 17% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 8.70% with revenue decreasing by 11.45%. Short interest has decreased by 17.6% since the company's last earnings release while the stock has drifted lower by 68.1% from its open following the earnings release to be 60.1% below its 200 day moving average of $19.02. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, April 3, 2020 there was some notable buying of 20,284 contracts of the $7.00 put expiring on Friday, May 15, 2020. Option traders are pricing in a 18.3% move on earnings and the stock has averaged a 3.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Lockheed Martin Corp. $401.51\n&gt; **Lockheed Martin Corp. (LMT)** is confirmed to report earnings at approximately 7:30 AM ET on Tuesday, April 21, 2020. The consensus earnings estimate is $5.75 per share on revenue of $15.23 billion and the Earnings Whisper ® number is $5.81 per share. Investor sentiment going into the company's earnings release has 57% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 4.01% with revenue increasing by 6.24%. Short interest has decreased by 30.8% since the company's last earnings release while the stock has drifted lower by 7.7% from its open following the earnings release to be 5.2% above its 200 day moving average of $381.53. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 7.0% move on earnings and the stock has averaged a 1.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LMT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Ally Financial $15.37\n&gt; **Ally Financial (ALLY)** is confirmed to report earnings at approximately 7:30 AM ET on Monday, April 20, 2020. The consensus earnings estimate is $0.74 per share on revenue of $1.61 billion and the Earnings Whisper ® number is $0.61 per share. Investor sentiment going into the company's earnings release has 17% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 7.50% with revenue increasing by 0.75%. Short interest has decreased by 45.8% since the company's last earnings release while the stock has drifted lower by 51.7% from its open following the earnings release to be 46.9% below its 200 day moving average of $28.95. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, March 30, 2020 there was some notable buying of 8,801 contracts of the $10.00 put expiring on Friday, June 19, 2020. Option traders are pricing in a 16.3% move on earnings and the stock has averaged a 4.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ALLY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Snap Inc. $12.98\n&gt; **Snap Inc. (SNAP)** is confirmed to report earnings at approximately 4:10 PM ET on Tuesday, April 21, 2020. The consensus estimate is for a loss of $0.07 per share on revenue of $426.88 million and the Earnings Whisper ® number is ($0.09) per share. Investor sentiment going into the company's earnings release has 55% expecting an earnings beat The company's guidance was for revenue of $450.00 million to $470.00 million. Consensus estimates are for year-over-year earnings growth of 50.00% with revenue increasing by 33.22%. Short interest has decreased by 14.5% since the company's last earnings release while the stock has drifted lower by 28.0% from its open following the earnings release to be 18.3% below its 200 day moving average of $15.89. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, April 17, 2020 there was some notable buying of 9,211 contracts of the $13.50 call expiring on Friday, April 24, 2020. Option traders are pricing in a 17.2% move on earnings and the stock has averaged a 12.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SNAP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# AT&amp;T Corp. $31.23\n&gt; **AT&amp;T Corp. (T)** is confirmed to report earnings at approximately 6:50 AM ET on Wednesday, April 22, 2020. The consensus earnings estimate is $0.85 per share on revenue of $44.38 billion and the Earnings Whisper ® number is $0.87 per share. Investor sentiment going into the company's earnings release has 41% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 1.16% with revenue decreasing by 1.00%. The stock has drifted lower by 18.9% from its open following the earnings release to be 14.0% below its 200 day moving average of $36.30. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, March 31, 2020 there was some notable buying of 50,564 contracts of the $31.00 put expiring on Friday, June 19, 2020. Option traders are pricing in a 5.6% move on earnings and the stock has averaged a 4.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=T&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Domino's Pizza, Inc. $362.97\n&gt; **Domino's Pizza, Inc. (DPZ)** is confirmed to report earnings at approximately 7:30 AM ET on Thursday, April 23, 2020. The consensus earnings estimate is $2.29 per share on revenue of $867.60 million and the Earnings Whisper ® number is $2.34 per share. Investor sentiment going into the company's earnings release has 68% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 4.09% with revenue increasing by 3.78%. Short interest has decreased by 66.9% since the company's last earnings release while the stock has drifted higher by 0.3% from its open following the earnings release to be 29.8% above its 200 day moving average of $279.69. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, April 17, 2020 there was some notable buying of 679 contracts of the $390.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 9.7% move on earnings and the stock has averaged a 9.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DPZ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/stocks.",
        "subreddit": "stocks",
        "title": "Wall Street Week Ahead for the trading week beginning April 20th, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/g3okfm/wall_street_week_ahead_for_the_trading_week/",
        "created": 1587249723.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1587220434,
        "id": "g3og0i",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/stocks. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning April 20th, 2020.\n\n# **A blast of earnings news is coming, but the market may be more focused on when the economy will reopen  - [(Source)](https://www.cnbc.com/2020/04/17/a-blast-of-earnings-news-is-coming-but-the-market-may-be-more-focused-on-when-the-economy-will-reopen.html)**\n*****\n&gt; Earnings from IBM, Netflix, Coca-Cola and dozens of others are expected in the week ahead, but as the state shutdowns now reach the one-month threshold, the market is more likely to trade on virus headlines and news about reopening the economy.\n*****\n&gt; There are also some important economic reports, including existing home sales on Monday and durable goods on Friday. But it is the weekly jobless claims data that will again be most relevant, as economists watch to see whether the number of workers seeking claims has now peaked and whether there are any signs some are returning to jobs, as government funds reach the hands of business owners.\n*****\n&gt; In the past week, stocks were higher, but there was a divergence with the Dow up just under 2.2% at 24,242, and Nasdaq, surging 6%, lifted by tech and biotech. The S&amp;P 500 gained 3% for the week and is now 31% off its March lows.\n*****\n&gt; Stocks gained amid signs the virus outbreak has peaked and some reopenings could start slowly in the next few weeks.\n*****\n&gt; The market also bounced Friday as the results of an early study of a Gilead drug showed promise with severe cases of coronavirus. Technology stocks were up about 4% for the week, and health care was up more than 5% while consumer discretionary stocks led with a gain of more than 6%.\n*****\n&gt; “As the virus news goes, so go risk assets. People expect bad economic data,” said Patrick Leary, chief market strategist at Incapital. “The data is all expected to be horrible. The only economic data we can really look at now and start to measure is the claims data on Thursday.” As of April 11, more than 22 million workers claimed unemployment benefits over a four-week period, as states shut down and schools, restaurants, stores and many other businesses closed or were forced to cut back.\n*****\n&gt; Charts are important\n&gt; Analysts who watch stock charts say technical levels will continue to have a powerful pull on the market, since so many traders have set their computers to trade around those numbers.\n*****\n&gt; For instance, the S&amp;P 500 had a hard time breaking through the 50-day moving average Friday, and fell back after it initially edged near 2,862 in morning trading. But at the end of the trading day, it smashed through that level, surging to close at 2,874, a positive sign for Monday’s open. The 50-day literally is the average closing price for the S&amp;P over the previous 50 sessions. Technical analysts believe watching moving averages gives them an important tool for price trends and momentum.\n*****\n&gt; Bob Doll, Nuveen’s chief equity strategist, said he believes the market hit its bear market low on March 23, but it could take another dive towards lows at some point.\n*****\n&gt; “My [low] target was 2,350. We spent 36 hours below that and got to 2,192. If there’s a secondary low, then probably the lowest chance is 2,350,” he said. “I’m not sure we’re going to go there, based on two things, the power of the rally and two, the stimulus. It’s been awesome.”\n*****\n&gt; Travelers, and Texas Instruments release results Tuesday. AT&amp;T, Delta Airlines, and Intel, Blackstone and Eli Lily are reporting Thursday. American Express and Verizon are expected Friday.\n*****\n&gt; Doll said he expects the market to listen to comments from corporate executives on conference calls but ignore the actual earnings. “The market is going to pay a lot more attention to what can a rebound look like, and what can 2021 numbers look like,” he said. “They’ll be selling on that versus how deep is the hole going to be in the second quarter. The macro questions around that are recurrence, therapeutics, and vaccine and how fast can the economy come back, and nobody knows the answer to that.”\n*****\n&gt; President Donald Trump laid out guidelines for reopening the economy, but left the decision making up to the states, which are facing varied levels of new infections. One issue is the lack of testing, and American businesses have pressed for more availability of test kits so workers can be brought back more safely.\n*****\n&gt; Doll said he is partial to health care and technology stocks, and one reason is because of the Fed’s quantitative easing programs. “We’re now in QE4. We had QE1, QE2, QE3, and six months after QE 1, 2 and 3, there were two sectors that outperformed-technology and health care, and there were two that underperformed, utilities and REITs,” he said.\n*****\n&gt; Doll said he also is looking at how stocks might come through the virus shutdowns. “Part of what you want to make sure is the company is going to make it through, and make sure the industry has decent demand getting out of it. If it has decent demand during it, that’s a good thing, and that takes you back to health care and technology,” said Doll.\n*****\n&gt; Leary said he expects companies to be scrutinized somewhat differently by analysts this quarter, and balance sheets will be more important.\n*****\n&gt; “Its going to be on a case-by-case basis about how analysts are going to look at them. This is not a typical recession. Recessions seem to hit different sectors,” he said, “This one one is different in that it really has several losers like airlines and travel and entertainment companies. It has some real winners too. I like health care and pharma. Anything that’s defensive in nature is going to perform well.”\n*****\n&gt; Companies have been tapping the corporate bond market at a record pace to boost their cash piles to help them through the economy’s shutdown, and the coming week should be no different.\n*****\n&gt; The corporate debt market has been open for business and spreads have narrowed since the Fed announced a program to buy corporate debt. Companies have issued more than $160 billion in investment grade bonds so far this month, with JP Morgan issuing $10 billion this past week in the biggest bank deal ever, according to Credit Flow Research.\n*****\n&gt; More are expected in the coming week, as companies report earnings and exit the blackout period.\n*****\n&gt; “I think what corporate treasurers know is the window of opportunity for issuing debt at reasonable rates will quickly close once the economy starts opening,” said Leary. He said balance sheets and earnings will be more scrutinized once things start to become more normal.\n*****\n&gt; “They won’t have an excuse anymore ... right now, everything is expected to unexpected,” he said, “I think that window will close, and we’ll have to take a look at the bond market again. Their ability to issue will be impacted by their balance sheets...[now] there’s plenty of cash coming at them. The Fed will step in to support.”\n*****\n&gt; Leary said some of the interest in corporate bonds is from investors who are fearful of buying stocks right now but may want to invest in a company through the safer play of its bonds. Leary said energy bonds are among the least desirable, with the huge drop in crude prices.\n*****\n&gt; West Texas Intermediate crude futures for May settled at $18.72 per barrel, it lowest level since January, 2002. But that contract expires Tuesday. The June contract settled at $25.08 per barrel, and will resume trading there next week as the active contract.\n*****\n&gt; “It’s just a reflection of physical market conditions,” said John Kilduff of Again Capital, of the big decline in the May contract. He said it shows that futures traders do not want to actually take delivery of the commodity, due to an increasing lack of storage space.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/DgwrUcm.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/yKRo7Ea.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/3rA0fDB.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/DrwoiV6.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/i40FkmH.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/nMvlyBE.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/R8OVKd3.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/eZZyOqa.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/douLwsS.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/y2laKRP.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/dBSYk0L.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/LwQokav.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/zgBClvX.png))**\n###### **([CLICK HERE FOR THE CHART LINK #4!](https://i.imgur.com/Fcc6DrP.png))**\n\n*****\n\n# How Markets Performed During the Spanish Flu\n\n&gt; With equities surging into the close ahead of the weekend, traders are shrugging their shoulders wondering how the hell the market is rallying given the economic damage inflicted by the COVID-19 outbreak, which has been cited as the worst pandemic to hit the United States since the 1918 Spanish flu. This leads to the question, how did the stock market perform during the Spanish flu outbreak? The chart below compares the performance of the DJIA to the weekly mortality rate of the Spanish flu during each of the waves of that pandemic from mid-1918 through early 1919 (as cited in a WSJ article earlier today).\n\n&gt; Looking at how the outbreak of the Spanish flu played out, there were basically three different waves of the virus (red line). The first wave in the summer of 1918 was a relatively mild one compared to the other two, and the DJIA's performance during that wave was essentially flat as it never declined more than 3%. The real damage from the Spanish flu was in the fall of 1918 when the mortality rate spiked up as high as 24 per 1,000 people per week. During that wave of the pandemic, which also came in the thick of a post-WWI recession, the DJIA peaked just as the wave was getting underway and fell for the next three months. Even with the severity of the outbreak during that wave, though, the DJIA never fell more than 11% from peak to trough. On a comparative basis, even after the 28% rally over the last four weeks, the S&amp;P 500 is still down 15% from its high. Obviously, comparing two periods more than 100 years apart is hardly an apples to apples comparison, but it's still interesting that during what was an even deadlier pandemic in 1918, the DJIA never even approached anything close to a bear market.\n\n&gt; Looking at the chart, the DJIA's low of the decline coincided with the second wave of the outbreak just as the third (more mild) wave of the pandemic was getting underway. Furthermore, during that third wave, the DJIA kicked off what was a strong rally of more than 25% in less than three months on optimism over an end to the outbreak.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/041720-DJIA-flue.png))**\n\n&gt; So, once the mortality rate of the Spanish flu dropped down to zero, it must have been nothing but clear skies ahead for the Dow, right? Well, not necessarily. When it comes to the stock market, there's always something. Less than a year after the mortality rate from the Spanish flu dropped down to zero, the US economy actually went into a year and a half long recession. That contraction was so severe that it has been dubbed the Depression of 1920/21, one where unemployment topped 10% and deflation was as high as 18%! The bear market that accompanied that recession was also severe as the DJIA declined 46%. Imagine coming out of a pandemic with nothing more than an 11% correction and then getting socked with that!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/041720-DJIA-1920-1921.png))**\n\n*****\n\n# Silver Shining in the Near Term, Gold Shining Over the Long Term\n\n&gt; Gold (GLD) has had an interesting run over the past year. Last spring, the ETF for the yellow metal finally pressed above multiyear resistance roughly around $130. After surging through late summer, GLD continued its rally at the end of 2019 and early 2020 before turning sharply lower alongside stocks in March. But since its March 19th low it has gone on to rally over 17% as of today and is now at its highest levels since early 2013.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/GLD.png))**\n\n&gt; Another precious metal, Silver (SLV), has not been as fortunate. Although it shared in the rally last spring and summer, SLV has yet to eclipse its early September highs. While gold had broken out again in February and March, silver put in a lower high before plummeting to its lost level since 2009 in mid-March.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/SLV.png))**\n\n&gt; But since that low on March 18th, SLV has actually outperformed rising 27.83%. Gold is up only up 15.14% since that same day and 17% since its respective low one day later on March 19th. While the S&amp;P 500's (SPY) low was not put in place until a few days after gold and silver on March 23rd, since March 18th, SLV is also outperforming SPY's 15.97% gain.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/Performance-1.png))**\n\n&gt; Over the long term, though SLV is still the worst performer of the group. As shown in the chart below, SLV is down 8.84% over the past two years while the S&amp;P 500's gains have also been somewhat lackluster thanks to the most recent sell-off with only a 4.11% gain. Gold, on the other hand, has outshined the other two having surged 26.93%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/Percent-GLD-SLV-SPY.png))**\n\n*****\n\n# It’s Earnings Season (Or Whatever it is Companies Plan to Report)\n\n&gt; It’s that time of year again. The time when corporate America reports financial results for the prior three months. Normally, we call it earnings season, but given the fact that most of the US economy has been shut down and no timetable is set for when it re-opens, for a lot of companies out there, there really isn’t much in the way of earnings, revenues, or guidance to speak of. Instead, this reporting period will likely be a lot of companies trying to put the best spin on how much (or little) cash they have on hand to withstand the shutdown.\n\n&gt; Besides the major banks and financials, there hasn’t been a whole lot in the way of reports to speak of, but of the results we have seen, the stock market reaction hasn’t been great as companies like Johnson &amp; Johnson (JNJ), JP Morgan (JPM), Wells Fargo (WFC), Bank of America (BAC), and Goldman Sachs (GS) have all seen negative reactions to their reports. The only large-cap that has really reacted positively to earnings so far is UnitedHealth (UNH) which gained more than 4%. Next week, the pace of reports will pick up, but the peak period for reports won’t be for another two weeks when more than 300 companies will report in a single day.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/calendar.png))**\n\n*****\n\n# Typical April Trading: Strength from Start to Finish\n\n&gt; April, the last month of DJIA &amp; S&amp;P 500 “Best Six Months,” has a strong historical track record. April 1999 was the first month DJIA gained over 1000 points (10.25%). April is also DJIA’s best month since 1950 with an average 1.9% gain. After a disastrous March, the rally than began in late March has extended in April. As of yesterday’s close, DJIA is up 7.39% so far this April. S&amp;P 500 is up 8.32%, NASDAQ has risen 10.81%. Small caps, measured by the Russell 2000 have not fared as well, up just 2.17%.\n\n&gt; April’s historical performance over the recent 21-year period is plotted in the chart above (21-year average is on the left vertical scale) compared to April 2020 (right vertical scale). Magnitude of gains this year is substantial however, the trend this year has been similar to past years. Should the current trend remain intact, further gains this month are possible. Coronavirus uncertainty remains extremely elevated, but there does to be some light flickering at the end of tunnel.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/826c536dba71629e9d1a26329db32eba/97c8d036ee5ba87c-9b/s500x750/55708144eea7c12b24adf731e9dc63e41e31604b.jpg))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$NFLX** \n&gt; * **$DAL** \n&gt; * **$KO** \n&gt; * **$INFY** \n&gt; * **$HAL** \n&gt; * **$LMT** \n&gt; * **$ALLY** \n&gt; * **$SNAP** \n&gt; * **$T** \n&gt; * **$DPZ** \n&gt; * **$IBM** \n&gt; * **$PM** \n&gt; * **$INTC** \n&gt; * **$LUV** \n&gt; * **$CMG** \n&gt; * **$BIIB** \n&gt; * **$HCA** \n&gt; * **$VZ** \n&gt; * **$BOH** \n&gt; * **$MTB** \n&gt; * **$ONB** \n&gt; * **$SAP** \n&gt; * **$BMRC** \n&gt; * **$CMA** \n&gt; * **$PHG** \n&gt; * **$AXP** \n&gt; * **$ERIC** \n&gt; * **$CBU** \n&gt; * **$KMB** \n&gt; * **$TFC** \n&gt; * **$PLD** \n&gt; * **$SYF** \n&gt; * **$NEE** \n&gt; * **$LII** \n&gt; * **$NDAQ** \n&gt; * **$LLY** \n&gt; * **$SNA** \n&gt; * **$LVS** \n&gt; * **$TRV** \n&gt; * **$LRCX** \n&gt; * **$KALU** \n&gt; * **$EMR** \n&gt; * **$CIT** \n&gt; * **$FITB**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/douLwsS.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/zBd2gQL.png))**\n###### **([CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES FOR THE MONTH OF APRIL 2020!](https://i.imgur.com/wlvhXbo.jpg))**\n###### **([CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES BEFORE MONDAY'S OPEN!](https://i.imgur.com/25QY7uo.jpg))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 4.20.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/uzAy7Pk.png))\n\n\n&gt; # ***Monday 4.20.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/xjSoWZ3.png))\n\n\n*****\n\n&gt; # ***Tuesday 4.21.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/RbwZ1le.png))\n\n&gt; # ***Tuesday 4.21.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/DjS7QnD.png))\n\n*****\n\n&gt; # ***Wednesday 4.22.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/aY4wQPz.png))\n\n&gt; # ***Wednesday 4.22.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/F2u6ejr.png))\n\n*****\n\n&gt; # ***Thursday 4.23.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/QW6sJiO.png))\n\n&gt; # ***Thursday 4.23.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/gylBF9c.png))\n\n*****\n\n&gt; # ***Friday 4.24.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/vwNztBG.png))\n\n*****\n\n&gt; # ***Friday 4.24.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# Netflix, Inc. $422.96\n&gt; **Netflix, Inc. (NFLX)** is confirmed to report earnings at approximately 4:00 PM ET on Tuesday, April 21, 2020. The consensus earnings estimate is $1.61 per share on revenue of $5.70 billion and the Earnings Whisper ® number is $1.68 per share. Investor sentiment going into the company's earnings release has 76% expecting an earnings beat The company's guidance was for earnings of approximately $1.66 per share. Consensus estimates are for year-over-year earnings growth of 111.84% with revenue increasing by 26.08%. Short interest has decreased by 28.5% since the company's last earnings release while the stock has drifted higher by 27.2% from its open following the earnings release to be 31.0% above its 200 day moving average of $322.81. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, April 17, 2020 there was some notable buying of 5,963 contracts of the $470.00 call expiring on Friday, April 24, 2020. Option traders are pricing in a 12.7% move on earnings and the stock has averaged a 4.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NFLX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Delta Air Lines, Inc. $24.27\n&gt; **Delta Air Lines, Inc. (DAL)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, April 22, 2020. The consensus estimate is for a loss of $0.70 per share on revenue of $9.64 billion and the Earnings Whisper ® number is ($1.41) per share. Investor sentiment going into the company's earnings release has 26% expecting an earnings miss. Consensus estimates are for earnings to decline year-over-year by 172.92% with revenue decreasing by 7.94%. Short interest has increased by 38.3% since the company's last earnings release while the stock has drifted lower by 60.9% from its open following the earnings release to be 54.1% below its 200 day moving average of $52.86. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, April 16, 2020 there was some notable buying of 13,289 contracts of the $25.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 12.3% move on earnings and the stock has averaged a 1.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Coca-Cola Company $48.06\n&gt; **Coca-Cola Company (KO)** is confirmed to report earnings at approximately 6:55 AM ET on Tuesday, April 21, 2020. The consensus earnings estimate is $0.44 per share on revenue of $8.49 billion and the Earnings Whisper ® number is $0.44 per share. Investor sentiment going into the company's earnings release has 55% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 8.33% with revenue increasing by 5.86%. Short interest has decreased by 22.1% since the company's last earnings release while the stock has drifted lower by 17.0% from its open following the earnings release to be 10.0% below its 200 day moving average of $53.39. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, April 17, 2020 there was some notable buying of 4,000 contracts of the $42.00 put expiring on Friday, May 8, 2020. Option traders are pricing in a 5.6% move on earnings and the stock has averaged a 4.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=KO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Infosys Technologies Ltd. $8.58\n&gt; **Infosys Technologies Ltd. (INFY)** is confirmed to report earnings at approximately 7:55 AM ET on Monday, April 20, 2020. The consensus earnings estimate is $0.14 per share on revenue of $3.29 billion and the Earnings Whisper ® number is $0.15 per share. Investor sentiment going into the company's earnings release has 29% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 7.69% with revenue increasing by 7.52%. Short interest has increased by 23.9% since the company's last earnings release while the stock has drifted lower by 22.7% from its open following the earnings release to be 19.2% below its 200 day moving average of $10.62. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, March 30, 2020 there was some notable buying of 4,005 contracts of the $9.00 put expiring on Friday, October 16, 2020. Option traders are pricing in a 12.2% move on earnings and the stock has averaged a 3.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=INFY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Halliburton Company $7.58\n&gt; **Halliburton Company (HAL)** is confirmed to report earnings at approximately 6:45 AM ET on Monday, April 20, 2020. The consensus earnings estimate is $0.25 per share on revenue of $5.08 billion and the Earnings Whisper ® number is $0.27 per share. Investor sentiment going into the company's earnings release has 17% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 8.70% with revenue decreasing by 11.45%. Short interest has decreased by 17.6% since the company's last earnings release while the stock has drifted lower by 68.1% from its open following the earnings release to be 60.1% below its 200 day moving average of $19.02. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, April 3, 2020 there was some notable buying of 20,284 contracts of the $7.00 put expiring on Friday, May 15, 2020. Option traders are pricing in a 18.3% move on earnings and the stock has averaged a 3.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Lockheed Martin Corp. $401.51\n&gt; **Lockheed Martin Corp. (LMT)** is confirmed to report earnings at approximately 7:30 AM ET on Tuesday, April 21, 2020. The consensus earnings estimate is $5.75 per share on revenue of $15.23 billion and the Earnings Whisper ® number is $5.81 per share. Investor sentiment going into the company's earnings release has 57% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 4.01% with revenue increasing by 6.24%. Short interest has decreased by 30.8% since the company's last earnings release while the stock has drifted lower by 7.7% from its open following the earnings release to be 5.2% above its 200 day moving average of $381.53. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 7.0% move on earnings and the stock has averaged a 1.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LMT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Ally Financial $15.37\n&gt; **Ally Financial (ALLY)** is confirmed to report earnings at approximately 7:30 AM ET on Monday, April 20, 2020. The consensus earnings estimate is $0.74 per share on revenue of $1.61 billion and the Earnings Whisper ® number is $0.61 per share. Investor sentiment going into the company's earnings release has 17% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 7.50% with revenue increasing by 0.75%. Short interest has decreased by 45.8% since the company's last earnings release while the stock has drifted lower by 51.7% from its open following the earnings release to be 46.9% below its 200 day moving average of $28.95. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, March 30, 2020 there was some notable buying of 8,801 contracts of the $10.00 put expiring on Friday, June 19, 2020. Option traders are pricing in a 16.3% move on earnings and the stock has averaged a 4.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ALLY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Snap Inc. $12.98\n&gt; **Snap Inc. (SNAP)** is confirmed to report earnings at approximately 4:10 PM ET on Tuesday, April 21, 2020. The consensus estimate is for a loss of $0.07 per share on revenue of $426.88 million and the Earnings Whisper ® number is ($0.09) per share. Investor sentiment going into the company's earnings release has 55% expecting an earnings beat The company's guidance was for revenue of $450.00 million to $470.00 million. Consensus estimates are for year-over-year earnings growth of 50.00% with revenue increasing by 33.22%. Short interest has decreased by 14.5% since the company's last earnings release while the stock has drifted lower by 28.0% from its open following the earnings release to be 18.3% below its 200 day moving average of $15.89. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, April 17, 2020 there was some notable buying of 9,211 contracts of the $13.50 call expiring on Friday, April 24, 2020. Option traders are pricing in a 17.2% move on earnings and the stock has averaged a 12.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SNAP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# AT&amp;T Corp. $31.23\n&gt; **AT&amp;T Corp. (T)** is confirmed to report earnings at approximately 6:50 AM ET on Wednesday, April 22, 2020. The consensus earnings estimate is $0.85 per share on revenue of $44.38 billion and the Earnings Whisper ® number is $0.87 per share. Investor sentiment going into the company's earnings release has 41% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 1.16% with revenue decreasing by 1.00%. The stock has drifted lower by 18.9% from its open following the earnings release to be 14.0% below its 200 day moving average of $36.30. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, March 31, 2020 there was some notable buying of 50,564 contracts of the $31.00 put expiring on Friday, June 19, 2020. Option traders are pricing in a 5.6% move on earnings and the stock has averaged a 4.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=T&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Domino's Pizza, Inc. $362.97\n&gt; **Domino's Pizza, Inc. (DPZ)** is confirmed to report earnings at approximately 7:30 AM ET on Thursday, April 23, 2020. The consensus earnings estimate is $2.29 per share on revenue of $867.60 million and the Earnings Whisper ® number is $2.34 per share. Investor sentiment going into the company's earnings release has 68% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 4.09% with revenue increasing by 3.78%. Short interest has decreased by 66.9% since the company's last earnings release while the stock has drifted higher by 0.3% from its open following the earnings release to be 29.8% above its 200 day moving average of $279.69. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, April 17, 2020 there was some notable buying of 679 contracts of the $390.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 9.7% move on earnings and the stock has averaged a 9.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DPZ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/stocks.",
        "subreddit": "stocks",
        "title": "Wall Street Week Ahead for the trading week beginning April 20th, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/g3og0i/wall_street_week_ahead_for_the_trading_week/",
        "created": 1587249234.0
    },
    {
        "author": "Doing-the-most",
        "created_utc": 1587568247,
        "id": "g62tyx",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Can someone tel me if I made the right call on this call",
        "url": "https://i.redd.it/qjaf6rqyxdu41.jpg",
        "created": 1587597047.0
    },
    {
        "author": "TheHolyTrinity_",
        "created_utc": 1587675843,
        "id": "g6uwlz",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "options",
        "title": "Can someone explain this to me? Is this a glitch? Pleas tel me it is",
        "url": "https://i.redd.it/ao0vj86vtmu41.jpg",
        "created": 1587704643.0
    }
]