[
    {
        "author": "bumblebear3012",
        "created_utc": 1596482526,
        "id": "i33kxb",
        "num_comments": 159,
        "num_crossposts": 0,
        "selftext": "In a recent post I did on AMD, some had expressed interest in a write-up on Cloudflare. I wasn’t going to write anything since I am long NET, but then I saw Fastly up around 13% today ahead of its earnings on Wednesday. With both Cloudflare and Fastly reporting this week, I thought the timing was apt to compare these two as they’ve pursued different approaches to building their networks. And I happen to believe that while Fastly’s heavy focus on speed/performance does offer some advantages in the CDN market, the real opportunity in these names (as well as Akamai for that matter) is the edge computing market – not CDN.\n\nI think one of the major reasons why Fastly is up over 430% YTD and Cloudflare over 145% is because most analysts were slow to pick up on the full extent of the end market(s) these companies are exposed to. I also think there has been some conflation in terms of the technology. Even now, I see CDN and edge computing used interchangeably when they are not necessarily the same. While similar ideas in that they both leverage edge servers (servers placed at a closer geographical proximity to the end-user or device), the use-case is not necessarily the same. Think of a CDN more so as a particular application or use of edge computing. To this point, multiple CDN players (Akamai, LimeLight, CDNetworks) have made recent moves into the broader edge computing market. \n\nBroader is the keyword here, because whereas CDNs cache web content (videos, photos, etc. from a website to speed its “delivery” to the site’s visitor), the hype surrounding edge computing is more so tied to 5G and the Internet-of-Things rather than primarily websites or SaaS applications necessarily. To be more specific, the value proposition of IoT is the vast distribution of sensors and real-time *collection* of data. Positioning edge networks closer to the IoT devices can enable faster industrial or logistics solutions.\n\nThose familiar with Fastly will be aware that they offer (or offered) the fastest cold start times (this just means the time it takes for an application to start up and be responsive to user input) of any serverless network application (CDN or edge) at 35 microseconds. Fastly claims that they are the gold standard for speed and performance and superior to AWS, Azure, Google, and Cloudflare. This approach has been successful, especially in targeting large enterprise customers. Fastly has a much larger average customer size relative to Cloudflare. \n\nWhile Fastly has recently expanded their security offerings as they further develop their edge platform, Cloudflare's strategy from the onset has been to balance performance, speed, and flexibility. Why does this matter? The major drawback to edge computing is that it greatly increases attack vectors for network intrusion. 5G will enable an extremely rapid proliferation of IoT devices. According to the Telecommunications Industry Association, by 2022, more than half of all internet-connected devices will by IoT machines. And IoT device operators will absolutely prioritize security of their industrial and logistics applications, especially as most computing applications (websites, programs, etc.), are not really as sensitive to latency at the speeds we are talking – i.e. the user/operator can’t actually discern the speed difference on their end. \n\nIoT operators (industrial, logistics, transportation companies) won’t be focused on consumers doing e-commerce or going on Reddit. They will be collecting zettabytes of structured and unstructured data to *push upstream* so that they can manage their assets more efficiently and securely. Fastly’s network utilizes fewer servers to increase efficiency and speed. Although that is great for Twitter, this lowers the network capacity to mitigate DDoS attacks (the most common IoT attack). Cloudflare has more points-of-presence and network capacity versus Fastly. This combined with their more expansive attack logs (Cloudflare services a far greater number of web properties than Fastly) and more mature security product portfolio, gives their network architecture numerous advantages for the edge computing market. This is all ignoring the fact that Cloudflare announced last week *zero nanosecond* cold start times for its edge computing platform which totally undercuts the Fastly speed advantage anyway. \n\nThe CDN market is larger today. Prior to COVID and the work-from-home demand boost, estimates tagged it at around $13.3bn. In comparison, the edge computing market was only $3.5bn in 2019 according to Grand View Research. Looking towards the future though? The CDN market is forecasted to hit $23bn plus by 2025, while the edge computing market is seen hitting $43bn or more in 2027. There have been recent reports that suggest the rise in the edge computing market over the next 10 years could even rival the growth in public cloud over the previous ten years (led by Amazon, Microsoft, Google). And Gartner believes that by 2025, three-quarters of enterprise-generated data will be created and processed at the edge. If you stop and think how much data has been created in 2020 versus just a few years ago, that is truly staggering growth. \n\nThe above comments gloss over the fact that there are also some very real reasons why a CTO or purchaser would select Cloudflare as a CDN over Fastly. The other big advantage Fastly has over Cloudflare (and Akamai) is it is *much* more customizable for developers. For web applications that are very high-level enterprise grade or extremely sensitive to latency, it absolutely makes sense to go with Fastly. However not all use-cases for a CDN require that level of customization, and there is quite the vertical learning curve for developers to learn the Fastly platform. Cloudflare also has more flexible pricing tiers (including a free tier) for customers who may not need the premium features. In short, there is a much wider range of use-cases that Cloudflare can cater to with its CDN platform relative to Fastly. I think this is evidenced by the fact that Cloudflare has far more customers (number not size) in addition to a much bigger developer community on Stackflow. \n\nThis all gives Cloudflare more potential to scale with its CDN customers and cross-sell its more diverse product portfolio. Again, Fastly certainly has a very strong presence in the large enterprise market. And for many, the performance and customization offered by Fastly will be a decisive factor when it comes to which CDN provider to choose. But I do think that Fastly has very much built itself to be the premium provider when a lot of customers are totally happy with a marginally slower cold start time if it means more flexibility on cost or ease-of-use.\n\nAt the end of the day, what this boils down to is which end market are you more bullish on: CDN or edge computing. For the record, I think over the next five years Fastly has a great opportunity to keep up the momentum. Its performance YTD would scare me a little bit in the immediate term because I think these levels assume continued growth acceleration or more guidance raises. But the CDN market is projected to keep growing at a healthy clip. And like I said, there are definitely some clear use cases for Fastly. \n\nI just happen to think that Cloudflare has a much, much, much higher long-term ceiling (thinking next 10-15 years) when you look at its natural advantages in the edge computing space and the enormous potential of that end market. Also of note, Cloudflare is slated to nearly double its global data center footprint over the next 3 years through its joint venture in China with JD.com. And whatever you think of China, its undeniable that there will be a data explosion there as internet penetration goes from the low 60% it is today to someday rival western countries. \n\nFastly is interesting, but when you look at the fact that Cloudflare has 77% gross margins compared to 57% for Fastly, you are ultimately paying a higher EV/revenue for slower growth, fewer revenues, one-fifth the cash, and significantly weaker margins. Good luck to all!",
        "subreddit": "stocks",
        "title": "Fastly vs. Cloudflare: The Pre-Earnings Rundown",
        "url": "https://www.reddit.com/r/stocks/comments/i33kxb/fastly_vs_cloudflare_the_preearnings_rundown/",
        "created": 1596511326.0
    },
    {
        "author": "clicknbait",
        "created_utc": 1596838317,
        "id": "i5nb19",
        "num_comments": 130,
        "num_crossposts": 0,
        "selftext": "I am seeing a shit load of new treads discussing the following-\n\n1. Fastly vs NET\n2. Hold Fastly or let go?\n3. What does Fastly do? \n\nSo I will clear up a few myths just in case. \n\nFastly is a CDN provider, which allows their clients to host their website on Fastly's servers. Fastly's business model is catered towards large enterprises that are looking at fastest (thus the name!) cold start time, i.e. time it takes to load a webpage on mobile/PC. Here are a few of their clients-\n\n1. **Clients doing very well during Covid**\n\n* Reddit\n* Shopify\n* Wayfair\n* Pinterest\n* Twitter\n* Stripe\n* Overstock\n* Shazam\n* Wealthfront\n* Etsy\n* Tiktok\n\n2. **Clients doing not so well during Covid**\n\n* Airbnb\n* Jetblue\n* Trip Advisor\n* Alaska Air\n* Kayak\n* Yelp\n* Kayak,\n* and many more....\n\nNotice first that their clients that are booming right now are very likely to continue booming for the next year or so. Once we are done with Covid (that is if), revenues will switch to clients in hospitality business, which typically have a strong business during normal times.\n\n&amp;#x200B;\n\nFastly's USP is fastest cold start time, i.e., it is the best CDN in the market which allows the visitors on their client's website to load the webpage/apps faster than anyone else in the market right now. \n\n&amp;#x200B;\n\n**Why is this USP so important**\\--well there are a few reasons why Fastly will continue to have higher growth rate.  I have noted a few down below-\n\n&amp;#x200B;\n\n1. Apple rolls out 5g iPhone later this year. They will require webpages to load faster. Fastly is the best CDN there is to handle that request. This does not mean that Akamai or NET are sitting out catching honeybee, but really means that Fastly is positioned to serve that switch to 5g better than NET or Akamai IMO.\n2. Fastly's business model is unique. It charges their customers based on the bytes loaded, which translates to the amount of time people spend on their customers' website. Thus, while I am spending 5-10 mins to write this essay, Reddit is getting charged by Fastly (pun intended!). Notice that this is a different business model than NET. NET offers a free subscription to begin with and has lower CDN hosting rate for those willing to host on their servers. Therefore, organizations which do not feel that speed is of concern to them as much, prefer to use NET. On the flip side, Fastly has a niche set of customers who value speed, because user experience on their website is of utmost importance to them. Imagine if I had to spend several 100 microseconds for a webpage to open, I would be pissed and may not go on that website, purely because of that reason.\n3. YoY growth based on investor's copy was 62%, which is great if you ask me. As long as it is staying above 50, my money is parked there.\n4. Bergman and Josh raised guidance for this year, during a time when a lot of CFOs are holing on giving guidance. Also of importance is that these folks in the C suite like to give a conservative guidance and beat it. In other words, promise less and deliver more. This leaves no question that next earnings should be a beat but do not take my word on it because who knows what happens tomorrow.\n\n**Influence of Tiktok on Fastly's revenue**\n\nCertainly one of the most important question that needs to be addressed because Tiktok constitutes 12% of the revenues. With the stock dropping like a rock after ER and then earnier today after Donny decided to ban it after 45 days, looks like a lot of the uncertainty is already baked into the price at this moment. Those who were uncertain unboarded the train today. That point is the exhaustion point where bulls come in and drive the stock higher (e.g., Chegg today).\n\n&amp;#x200B;\n\nI personally feel that Tiktok MSFT should be a done deal and they are waiting to announce this sometime this month. I am neither an insider nor do I happen to know the actually outcome. However, I do follow hedge fund option sentiment and I have noticed bullish calls inflow for MSFT this past couple days. While I am a peasant who is not connected to anyone involved with the deal, I am sure some of these whales are aware of the decision, which is part of the reason for that bullish call inflow for MSFT.\n\n&amp;#x200B;\n\n**Should you dump FSLY or not?**\n\nEntirely up to you but I see a lot of growth in this company. Fundamentally, nothing has changed in how they operate. The company gave an upward guidance and that drives the stock in forward direction. Some sellers left the ship because a lot of RH investors have not seen losses in their life or some are not even aware of the potential of this company, except it became a meme stock lately and FOMO drove a lot of noobs in FSLY train.\n\nIt is always better to curtail losses. If you trust that they will continue to bring in revenues, I would dollar cost average on every dip. This ensures your average cost of the share is reduced significantly with any dip. Most fund managers actually add stocks to their funds when the stock is sitting at 30 day MA. Fastly had such a quick run up that the 30 day MA kept moving. All of that being said, I think it may rest for some time before beginning the next leg up. That could be a week, 2 weeks, or a month but you will have to be patient if you do not want to loose money. However, never panik sell on a red day because that is literally the day people like me buy from people who are selling. \n\nWould Monday bring a ray of light and we open green-\n\nNo one knows what happens but I would continue to DCA on every 5% drop. I remember when Square dropped a couple years ago, I kept DCAing and here I am sitting on gains. \n\n&amp;#x200B;\n\nI hope this helped convince some of you.",
        "subreddit": "stocks",
        "title": "Fastly - Some Myths Cleared Here",
        "url": "https://www.reddit.com/r/stocks/comments/i5nb19/fastly_some_myths_cleared_here/",
        "created": 1596867117.0
    },
    {
        "author": "FOSSnowball",
        "created_utc": 1598063876,
        "id": "ieao2g",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "Does/will Starlink complement or compete with Edge Computing companies like Fastly ($FSLY) and Akamai ($AKAM)?",
        "url": "https://www.reddit.com/r/investing/comments/ieao2g/doeswill_starlink_complement_or_compete_with_edge/",
        "created": 1598092676.0
    }
]