[
    {
        "author": "K215215",
        "created_utc": 1593282594,
        "id": "hgypxy",
        "num_comments": 370,
        "num_crossposts": 1,
        "selftext": "I see a ton of you guys posting about waiting for the tech bubble to pop and I want to help you guys stop losing money by clearing up some common misconceptions I see in the daily threads. Here goes:\n\n**1) Tech is not a single industry, it is the combination of multiple different industries in various stages of their life-cycles**, all of which's business model are impacted differently by Covid 19. Yes, there are consumer products, social media, online retail and advertising, but there is also security, infrastructure, enterprise management software, database management, content delivery networks, gaming, financial services, communications, etc. All of these have different revenue models, customer types and growth trajectories independent of each other. By labeling them all tech and not understanding why they may or may not be thriving, you're going to miss out on big runs or talk yourself into costly contrarian puts during runs.\n\nWith the understanding that tech is not a monolith, but many industries, think about how covid actually impacts these individual industries. In many cases, covid has accelerated digital transformation and sped up adoption of these companies. Web services are more important than before (MSFT, AMZN), security is critical (CRWD, OKTA, ZS), more people are viewing content from the internet (NET, FSLY, AKAM) and main street retail is closed (SHOP, AMZN, ETSY), etc. etc. ***Most of these companies are non-discretionary or infrastructure spend*** \\- nobody is cancelling an important enterprise management system (VEEV, EVBG, CRM, NOW) because of covid - they'll fire headcount first. \n\n**2) If your analysis is that the company is not profitable and so its overvalued, you're doing it wrong.** *Know the difference between Gross Margins and Operating Profit.* If the company's core business is very profitable and they're spending a fuckload on product development, hiring sales and building corporate infrastructure, it doesn't matter if their operating profit is negative if their sales are growing 35%. The revenues will catch up. Quickly.\n\n**3) The Subscription Based Revenue Model (SaaS) is the greatest things to happen to these companies and investors in 20 years.** Having smooth, recurring, reliable revenue streams, impacted only by churn and growth allows helps eliminate big negative surprises during earnings and compounds growth quickly for the businesses. \n\nTake MSFT for example - for us boomers (I'm 40), they used to release a new Windows updates every 2-3 years and inevitably you'd have to purchase it, adapt to it, and sometimes you'd skip an update. Their earnings were based on how popular the updates were and how much people bought them. In 2015, they switched from that model to SaaS (software as a service). Now, I pay an annual subscription to MSFT for their applications. I never think about it - its just subtracted from my account - and will pay it as long as I have a computer. They dont have to worry about coming up with big new updates.\n\nCompare this to some other industries. Life Sciences - you invest millions in research and the drug has to show efficacy and get approved by FDA, which is major boom or bust. Automotive - design a great car and hope you find a market for it, but then your sales are massively impacted macro trends. Nobody is fucking cancelling MSFT subscriptions during a recession.\n\n**4) Tech's operating model makes its potential for exponential growth unmatched.** For a company like Fastly or Okta, think about what you would actually have to do to provide the infrastructure for 40% annual growth - you spend on product development, hiring customer success/support and sales people. You beef up HR, operating systems and infrastructure. *But your biggest expense by far is hiring people, who can work from home and be quickly removed.* \n\nCompare that to some other industries. For a car company to grow 40%, beyond the people cost, they need massive capex investments to improve their production infrastructure and they'll have to be sure their supply chain of small manufacturers can keep up, not to mention the impact of fluctuations in raw material costs (read, tarriffs), marketing and inventory storage. Thats a lot of moving parts. These implications apply to most manufacturing industries. For a life sciences company to grow 40%, they have to discover a massive blockbuster medicine, because users of current non-generic medications don't spike 40% a year. Put simply, it is much easier/cheaper/faster to just hire people and acquire technology than having to have physical infrastructure, supply chains, warehousing etc. This makes techs growth potential vastly superior than other industries.\n\n**5) Finally, and most importantly, this is not 2001. I will repeat this for the real boomers here who were burned before, this is not 2001.** In 2001 the companies did not have real growth, revenue, consumer adoption. Today they do. Take a look at Redpoints look at 2020 Q1 earnings for public SaaS companies ( [https://medium.com/redpoint-ventures/a-look-back-at-q1-public-saas-earnings-e392a7f6f4f8](https://medium.com/redpoint-ventures/a-look-back-at-q1-public-saas-earnings-e392a7f6f4f8) ). The median company of the 54 public companies followed had 31% YoY growth, 74% gross margin and 117% customer retention. Thats insane.\n\nTLDR; tech is not overvalued - these cloud companies are growing exponentially and in many cases, their business models and adoption/use of their services are enhanced by Covid. \n\nPOSITIONS - FSLY 50C, 60C 9/18, SPOT 230C 7/17, DDOG 90C 8/21, NET 36C 8/21, SE 106C 7/17, ENPH 50C 8/2, TWLO 210C 8/21\n\nMy qualifications - I spent many years as strategic consultant with a fancy mba that focused on business growth and have worked in literally every industry",
        "subreddit": "wallstreetbets",
        "title": "Tech is Not a Overvalued",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hgypxy/tech_is_not_a_overvalued/",
        "created": 1593311394.0
    },
    {
        "author": "notbrokemexican",
        "created_utc": 1593424417,
        "id": "hhx2ax",
        "num_comments": 168,
        "num_crossposts": 0,
        "selftext": "# # The Basic Idea\n\nI'm building a portfolio that revolves around developing a post-covid world. The overarching theme behind these picks American Innovation &amp; Mexican Development. I'm 26 years old and hold a strong conviction that investing in Mexican development will reward me in the decades to come. I'm a software engineer in the US &amp; an avocado farmer in Mexico.\n\nYou may see that I avoid some industries in important sectors. These arenas, if compelling enough, would likely be subscribed to a weak ETF that gets contributed to lightly. For example, an oncology ETF if Joe Biden wins the presidency in 2020.\n\n&amp;#x200B;\n\n# # Basic Rules \n\nI generally try to exercise these rules and concepts in my framework\n\n* Applications of common sense\n* Applications of game theory\n* Modesty in asset allocation over aggression\n\n&amp;#x200B;\n\n# # The Practice\n\nI have multiple sets of investments using\n\n\\- Primary assets (12) which receive the priority allocation of assets\n\n\\- Secondaries that may be exchanged into the Primary asset group if compelling enough (6x)\n\n&amp;#x200B;\n\nFor example, I will have an **Augmented Reality Group** composed of\n\n1. **Facebook (Primary)**\n2. \\[Nintendo, Disney, Apple, Adobe\\]\n\n&amp;#x200B;\n\n# # Asset Group Breakdown \n\n* Augmented Reality\n* Machine Learning\n* Financial Access\n* Semiconductors\n* Cloud Infrastructure\n* Cloud Services\n* Network Infrastructure\n* Power Systems\n* Industry\n* Industrial Robotics\n* Consumer Supply\n* ETF Diversification &amp; Asset Amplification\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # Primary Assets \n\n*  Facebook \\[Augmented Reality\\]\n*  Microsoft \\[Machine Learning\\]\n*  Paypal \\[Financial Access\\]\n*  Texas Instruments \\[Semiconductors\\]\n*  Cloudflare \\[Cloud Infrastructure\\]\n*  DocuSign \\[Cloud Services\\]\n*  Crown Castle International \\[Network Infrastructure\\]\n*  Panasonic \\[Power Systems\\]\n*  Kansas City Union \\[Industry\\]\n*  FANUC \\[Industrial Robotics\\]\n*  Costco \\[Consumer Supply\\]\n*  SPY \\[ETF Diversification &amp; Asset Amplication\\]\n*  SPCE \\[Monkey Capitalist Casino\\]\n\n&amp;#x200B;\n\n# # Augmented Reality Group\n\n1. **Facebook**\n\n*    Adobe\n*    Apple\n*    Nintendo\n*    Disney\n\n&amp;#x200B;\n\n*The gist*\n\nThe Augmented Reality Group are companies with a vested interest in AR products and sufficient power for cultural impacts. \n\n&amp;#x200B;\n\n# # Machine Learning Group\n\n1. **Microsoft**\n\n*   Google\n*   Tesla\n\n&amp;#x200B;\n\n*The gist*\n\nThe Machine Learning Group are organizations that are ML advantaged. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # Financial Access Group\n\n1.  **Paypal**\n\n*    Square\n*    Visa\n\n&amp;#x200B;\n\n*The gist*\n\nThe Financial Access group focuses on modernizing accessibility to financial instruments.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # Semiconductors Group\n\n1.  **Texas** **Instruments**\n\n*   AMD\n*   Nvidia\n\n&amp;#x200B;\n\n*The gist*\n\nThe Semiconductors Group focuses on the access to technology and computing. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # Cloud Infrastructure Group \n\n1.  **Cloudflare**\n\n*   Fastly \n*   Z-Scaler\n*   Akamai\n\n&amp;#x200B;\n\n*The gist*\n\nThe Cloud Infrastructure Group focuses on stabilizing high quality advancements in computing.\n\n&amp;#x200B;\n\n# # Cloud Services Group\n\n1. **DocuSign**\n\n*   Twitter\n*   Chegg\n*   Dropbox\n*   Lyft\n*   1Life Medical\n*   Snapchat\n*   Salesforce\n*   Upwork\n*   Autodesk\n*   Twilio\n\n&amp;#x200B;\n\n*The gist*\n\nThe Cloud Services Group are inelastic cloud computing or service distribution.\n\n&amp;#x200B;\n\n# # Network Infrastructure Group\n\n1.  **Crown Castle International**\n\n*   T-Mobile\n*   America Movil\n\n&amp;#x200B;\n\n*The gist*\n\nThe Network Infrastructure Group focuses on the expansion of telecommunications across the US and Mexico. \n\n&amp;#x200B;\n\n# # Power Systems Group \n\n1. **Panasonic**\n\n*   Vestas\n*   Plug Power\n*   Siemens\n\n&amp;#x200B;\n\n*The gist*\n\nThe Power Systems Group focuses on the growth of alternative energy systems.\n\n&amp;#x200B;\n\n# # Industry Group\n\n1.  **Kansas City Southern Rail**\n\n*    Berkshire.B\n*    XLB Materials ETF\n\n&amp;#x200B;\n\n*The gist*\n\nThe Industry Group works on material development of US and Mexico. \n\n&amp;#x200B;\n\n# # Industrial Robotics Group  \n\n1. **FANUC**\n\n*   ABB\n*   Rockwell Automation\n\n&amp;#x200B;\n\n*The gist*\n\nThe Industrial Robotics group focuses on the increasing automation of labor.\n\n&amp;#x200B;\n\n# # Consumer Supply Group \n\n1.  **Costco**\n\n*   Amazon\n*   Shopify\n\n&amp;#x200B;\n\n*The gist*\n\nThe Consumer Supply has a similar focuses on customer satisfaction during purchase time.\n\n&amp;#x200B;\n\n# # ETF Diversification &amp; Asset Amplification \n\n1. **SPY**\n\n*   EWW Mexico ETF\n*   FIVG 5g \n*   IPO Startup \n*   WCLD Cloud \n*   ESPO Gaming\n*   CIBR Cybersecurity \n*   HACK Cybersecurity \n*   TPAY Financials\n*   ARKF Financial Technology\n*   IPAY Financial Services\n*   DFNL Banking Services\n*   SOXX Semiconductors\n*   IYT Railroad \n*   POTX Cannabis \n*   BOTZ Automation \n\n&amp;#x200B;\n\n*The gist*\n\nThe ETF &amp; Asset Amplification is a group of industries I would like to factor uncertainties for or better capture. \n\n&amp;#x200B;\n\n# # Monkey Capitalist Casino \n\n1.  **SPCE**\n\n*   DKNG\n*   Dennys\n\n&amp;#x200B;\n\n*The gist*\n\nDennys is a logistic stock that represents the American Trucking Economy. All of these stocks are sinful and this is the space I allow my monkey biases to come out.\n\n  \n\n&amp;#x200B;\n\nInvestment explanations in V2 Draft",
        "subreddit": "investing",
        "title": "My Covid Portfolio Restructure - Mexican-American Stock Meta",
        "url": "https://www.reddit.com/r/investing/comments/hhx2ax/my_covid_portfolio_restructure_mexicanamerican/",
        "created": 1593453217.0
    },
    {
        "author": "water_boat",
        "created_utc": 1591051991,
        "id": "guv1pq",
        "num_comments": 55,
        "num_crossposts": 1,
        "selftext": "Intro:\n\nOracle makes enterprise software (database management system) for UNIX, LINUX and Windows Operating Systems. They have acquired Acme Packet (produces and markets session border controllers, multiservice security gateways and session routing proxies), BEA Systems (specializes in enterprise infrastructure software products), Hyperion Corp. (Financial Management System that provides financial consolidation and reporting that enables you to rapidly consolidate and report financial results), MICRO Systems (designs and engineers processor-based control systems, unmanned vehicle control stations, and flight terminal systems), NetSuite (cloud ERP enterprise that provides SaaS to manage to manage business finances, operations and customer relations), PeopleSoft (ERP that provides human resource management systems, financial management solutions, supply chain management solutions and enterprise performance solutions), Siebel Systems (CRM engaged in design, development, marketing, and support) and Sun MicroSystems (sells computers, computer components, and IT services - also the creator of Java). Essentially, they are one of the biggest leaders of Cloud.\n\nCOVID has further increased the demand and need of Cloud and has accelerated the integration of Cloud-based companies. As such, ORCL is expected to achieve higher levels of growth.\n\nKey Highlights:\n\n\\- ORCL's next quarterly ER: **June 17, 2020**\n\n\\- ORCL stock has recovered from the crash relatively quickly and has shown a pretty strong support of $51 and resistance of \\~$54. Current stock price $53.06 (with a moderate down-trend).\n\nhttps://preview.redd.it/1t1qaasigd251.png?width=1213&amp;format=png&amp;auto=webp&amp;s=f60e1d579092fd1cf1c9208a44e5e63c12b1b0eb\n\n\\- The highest EPS forecast recorded in ORCL's history for the upcoming ER (1.2 vs 0.96 of last quarter - pre-covid)\n\n\\- Multiple revenue streams while showing steady growth\n\nhttps://preview.redd.it/u66dsrdumd251.png?width=831&amp;format=png&amp;auto=webp&amp;s=d9d6a0e957db2322fdfb45c4b6d0331d70768f9f\n\n\\- Many fear the next S&amp;P500 slide is soon coming as we're nearing its pre-covid number, but SPY vs ORCL correlation index is 0.44 so rest assured, ORCL will not be impacted as much.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/p5asbgoymd251.png?width=1337&amp;format=png&amp;auto=webp&amp;s=ca88c90da438a9dafc667e4b010820e84d8d4414\n\n\\- Low IV  (soon to increase) and the recent drop signals a great entry point.\n\nPotential:\n\nMost cloud companies' stock price surged pre and post ER breaking its ATH. Comparatively, ORCL will be at least $58 leading up to ER.\n\nORCL 55c 06/26",
        "subreddit": "wallstreetbets",
        "title": "ORCL Earnings Play",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/guv1pq/orcl_earnings_play/",
        "created": 1591080791.0
    },
    {
        "author": "cclagator",
        "created_utc": 1591224439,
        "id": "gw4n2s",
        "num_comments": 43,
        "num_crossposts": 0,
        "selftext": "I put together a little cheat sheet of how I think about which trade structure I use for what. This is obviously only covering a small portion of the trade universe but I thought it would be helpful to those a little overwhelmed with the choice within an options chain.\n\nThe key here is keeping things simple. Knowing what a trade is expressing and how that applies to what you think/hope will happen. That main point is not wasting money with sloppy call or put purchases, and taking what the options market is giving you. Keep it simple, use the expected move and get the universe of trades closer to the binary decisions we make when we trade stock.\n\n[Here's](https://www.optionseye.com/content/images/2020/06/Screen-Shot-2020-06-02-at-7.17.51-PM.png) the full flowchart, bullish, bearish and neutral.\n\nYou'll notice that it organizes by short premium in the middle and lower probability long premium trades as it gets to the edges (duh) but what I think is helpful is how even on the long premium trades it accounts for selling as much premium as possible to finance that view. (or at least an easier way to think about it)\n\nThe focus is on 4 common (defined risk, multi-leg) options trades. Call spreads, put spreads, butterflies and condors and when to use them based on your expectations versus the crowd's. This is by no means an exhaustive list of potential trades. But these are a great starting point for those looking to use some smarter trade structures to express directional views. Strikes can of course be adjusted to slightly alter each trade. For instance, a call spread to the expected move can be set to be more in the money to get the breakeven in line with the stock, creating something quite similar to a stock alternative.\n\nAnd as a decision tree on each:\n\n[Bullish](https://www.optionseye.com/content/images/2020/06/Screen-Shot-2020-06-02-at-7.24.32-PM-1.png)\n\n[Bearish](https://www.optionseye.com/content/images/2020/06/Screen-Shot-2020-06-02-at-10.29.22-PM.png)\n\n[Neutral](https://www.optionseye.com/content/images/2020/06/Screen-Shot-2020-06-02-at-10.37.08-PM.png)\n\nFull post here where I go through some examples in CRM and ADBE over on OptionsEye. Let me know if you have any questions or any other ideas of trades you like in similar situations.",
        "subreddit": "options",
        "title": "Spread decisions tree",
        "url": "https://www.reddit.com/r/options/comments/gw4n2s/spread_decisions_tree/",
        "created": 1591253239.0
    },
    {
        "author": "rhcsa2019",
        "created_utc": 1591367316,
        "id": "gx5lnk",
        "num_comments": 40,
        "num_crossposts": 0,
        "selftext": "I just read that amazon is in a multi year contract with slack. So all Amazon corporation will be using slack. It will also be incorporated into AWS services. Do you think Amazon will use slack not only to compete with Microsoft teams, but to turn it into a CRM to also compete with salesforce?\nWhat could this mean for slacks stock? I dont get why its going down? Earnings report was better than projections. Is it a good idea to make an investment into slack right now?",
        "subreddit": "StockMarket",
        "title": "Amazon multi year contract with slack",
        "url": "https://www.reddit.com/r/StockMarket/comments/gx5lnk/amazon_multi_year_contract_with_slack/",
        "created": 1591396116.0
    },
    {
        "author": "Saphira9",
        "created_utc": 1591654824,
        "id": "gz9p9h",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "I'm thinking of signing up for Motley Fool's new 5G recommendation service, and splitting the cost with [u/GRITxGRIND](https://www.reddit.com/user/GRITxGRIND/). We're looking to split the cost with anyone else who is interested in investing in 5G. It's called \"Next-Gen Supercycle\" which was $1,299 for a year , but now they're offering it for $799 for 6 months. So if someone joins us and we split it 3 ways, it's $266 each and we'd all get the recommendations.\n\nThe 5G recommendations are called \"Next-Gen Supercycle\", and it includes recommendations about companies that would get massive growth from 5G phones and other connected devices, as well as semiconductor suppliers in the 5G supply chain, micro-cap companies involved in connected and self-driving cars, and companies that would get a boost from 5G infrastructure to build the networks and cell sites. Apparently Motley Fool reviewed over 900 companies and narrowed it down to 19 stock ideas as well as future recommendations and an example portfolio section designed around 5G.\n\nSo far, I've had great returns from Motley Fool's \"Stock Advisor\" recommendations. In the last 2 months, I'm up +11% on ANET, +13% on CRM, +16% on ETSY, +19% on SHOP, +23% on OKTA, +27% on TEAM, +41% on TTD, and +64% on SFIX. Also +4.85% on ACN after just a week. I realize most of these gains are due to the general market improving, but the companies they recommend are vetted to stay successful for the next 3-5 years. For those not familiar, Motley Fool focuses on growth stocks. Motley Fool gives themselves a bad rep with the free articles that sound like they're written by interns, and the hype-filled ads, but once you actually pay you get decent research and stock recommendations that actually beat the market.\n\nSo if you're interested in investing in 5G companies, and want to get recommendations from Motley Fool, let me know and I'll give you access to all the 5G recommendations and research. I can keep you posted on recommendations from their $199 Stock Advisor service too.\n\nIf you're an investor who doesn't like 5G or the idea of investing in it, please don't reply here and post your thoughts elsewhere. Also, if your opinion on Motley Fool is based only on reading their awful free clickbait articles, don't bother starting an argument here. Thanks!",
        "subreddit": "StockMarket",
        "title": "Motley Fool 5G recommendations",
        "url": "https://www.reddit.com/r/StockMarket/comments/gz9p9h/motley_fool_5g_recommendations/",
        "created": 1591683624.0
    },
    {
        "author": "ss_400401",
        "created_utc": 1592955792,
        "id": "hepwm1",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "Majority holding in MSFT LEAPS. Should i sell or wait till $280-300? I believe it will reach this price only if they make a major acquisition like salesforce(CRM) since they are weak in the ERP sector and their CRM tool dynamics 365 is not that great.\n\n**Bull case:** MSFT has .Net, SQL Server, GIT Hub, Microsoft Dynamics 365 for developers. Office 365, Teams, Linkedin,  Windows &amp; Azure for consumers &amp; enterprise. Hololens and JEDI deal with military and believe sales will eventually move them to a MSFT shop. \n\nNew Xbox releasing this year, strategic partnership with Sony that allows Sony to leverage xCloud. xCloud is a direct competitor to google's Stadia, multi year partnership with NBA that allows fan engagement with Azure (Believe since Ballmer is the owner of clippers he might have a hand in it) and recent partnership with Facebook by killing off mixer. Eventually FB HTML cloud games will stream using xCloud aka Azure. Into hardware with surface products etc..\n\n**Bear Case** P/E of 34 which is expensive, if the whole market falls MSFT goes down with the market even though it's completely diversified. Lackluster buyback program with **7.5B** outstanding shares on the market which might make the stock price stagnant. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/ye04z0pmsq651.png?width=1216&amp;format=png&amp;auto=webp&amp;s=59f5dac14f9c204abd0d5f14f9eef578723ac9db",
        "subreddit": "wallstreetbets",
        "title": "Urus or Model 3?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hepwm1/urus_or_model_3/",
        "created": 1592984592.0
    },
    {
        "author": "VolvoKoloradikal",
        "created_utc": 1592662281,
        "id": "hcmwgp",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\n* Salesforce has a 75% gross margin, that seems extravagant. Does this mean there is no competition in this business sector?\n* Realty Income (the REIT), has a profit margin of 94.5%. Also seems very extravagant. How is a real estate company managing to have such how profit margins with the costs involved in owning real estate assets?\n\n&amp;#x200B;\n\nThen I saw other companies which makes zero sense at all.\n\n* Dominion Energy, 99% margin. This is an electric and gas utility with quite steep capital and operating expenses, how do they achieve a 99% margin?\n* Sempra Energy, 98% margin. They are also an electrical and pipeline utility with quite steep capital and operating expenses, how do they achieve a 98% margin?\n\n&amp;#x200B;\n\nThen I saw ones which make alot of sense.\n\n* WellCare Health Plans with a 99% margin. Health insurance is legalized corruption in the US and this shows so blatantly.\n* Celgene 96% pharmaceutical with exclusive rights and sells a drug at exorbitant prices.\n* Incyte 96% pharmaceutical with exclusive rights and sells a drug at exorbitant prices.\n* Regenaron 93% pharmaceutical with exclusive rights and sells a drug at exorbitant prices.",
        "subreddit": "investing",
        "title": "Profit Margins, How Do Companies Get Away With Such High Margins?",
        "url": "https://www.reddit.com/r/investing/comments/hcmwgp/profit_margins_how_do_companies_get_away_with/",
        "created": 1592691081.0
    },
    {
        "author": "OhWowMuchFunYouGuys",
        "created_utc": 1592985442,
        "id": "hewyhj",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "VerifyMe is a development stage company transforming into a commercial company very quickly.A strong management team has made the right connections.VerifyMe has a recent contract with a large global customer.The next earnings report will be the first to include revenue from the large global customer.This stock is way off the radar and could make a big splash with its next earnings report and worth seeing how it develops from there.\n\nVerifyMe (OTCQB:VRME) ( now on NYSE as of days ago). is a provider of anti-counterfeiting technology and solutions. The main product is security printing with authentication serialization technology for product labels. The company is in the early stages of commercializing its products which I described in an early January article, VerifyMe Is Swinging For The Fences.\n\nThe move up from the OTC, where the stock is currently trading, to the Nasdaq as well as cleaning up the balance sheet are designed to make the company more of a palatable suitor for U.S. government as well as foreign government business.\n\n All outstanding debentures will be converted resulting in post IPO fully diluted 6 million share count and 1.5 million outstanding warrants. At a market price of $5 to $6 (it's 4 now) per share, the market cap will be just under $40 million. Management expects to raise about $6 million from the IPO and there is **No debt**The capital raise demonstrates the wide interest, including institutional investment that is supporting the success of this IPO.\n\n S-One is the infrastructure, providing inventory, marketing and sales services in 30 countries.\nHP Inc. (NYSE:HPQ) provides cannisters, uses VerifyMe's ink in its digital presses and provides its worldwide salesforce.\nMicro Focus International PLC (MFGP) provides software support.\n\nIn other words they are just getting the ball rolling and I expect great things from them moving forward.  They have been on the rise and have successfully reached from OTC to the NYSE. They are under the radar and should pick up very well once recognition In the market is gained.\n\nRisks: They still need to establish more business partners and grow sources of revenue.\n\nThey had to reverse split to gain compliance to even be listed as well as do an offering but the good news in that is it just happened and the offering is now closed. This was more to gain compliance than them needing the help.\n\nThe volume is low but I expect that to change the more the market gets interest.\n\nThey were just listed so the price is subject to movement to find its stable ground. Once again this could be good or bad depending on market sentiment the more it catches on.\n\nLast although not a risk should be mentioned, they are new so until the word gets around Growth might not be as fast but we can definitely change that as the reach of this sub and all their connections can put it on the map. \n\n\nEnd post",
        "subreddit": "pennystocks",
        "title": "New to the exchange and exciting company to invest $VRME",
        "url": "https://www.reddit.com/r/pennystocks/comments/hewyhj/new_to_the_exchange_and_exciting_company_to/",
        "created": 1593014242.0
    },
    {
        "author": "HeavyG_93",
        "created_utc": 1592456421,
        "id": "hb8141",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "I have 100 PCG @11.84 and 100 GE @8.27\n\n\nLot of headwinds for both companies, exacerbated by covid. Was betting PG&amp;E would return to 40-50 at some point in the future. \n\nLarry Culp is great executive so I was basically betting on him + an OG American company. \n\n\nWith all the headwinds though, I can’t shake the feeling I’d be better off cutting my losses and moving the money into cloud based companies. Shopify, Salesforce, Fastly, Cloudlare. \n\n\nWhat do y’all think? Should I cut my losses on hanging around for these companies to recover former glory and move into potential cloud growth?",
        "subreddit": "stocks",
        "title": "Considering swapping out my PCG and GE with FSLY and and CRM",
        "url": "https://www.reddit.com/r/stocks/comments/hb8141/considering_swapping_out_my_pcg_and_ge_with_fsly/",
        "created": 1592485221.0
    },
    {
        "author": "kapasaki",
        "created_utc": 1592949897,
        "id": "heo4x3",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "CRM 08/21/2020 195c\n\nThoughts?",
        "subreddit": "options",
        "title": "First ever options trade",
        "url": "https://www.reddit.com/r/options/comments/heo4x3/first_ever_options_trade/",
        "created": 1592978697.0
    },
    {
        "author": "Saphira9",
        "created_utc": 1591654657,
        "id": "gz9n4m",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Hi r/investing I'm thinking of signing up for Motley Fool's new 5G recommendation service, and splitting the cost with [u/GRITxGRIND](https://www.reddit.com/user/GRITxGRIND/). We're looking to split the cost with anyone else who is interested in investing in 5G. It's called \"Next-Gen Supercycle\" which was $1,299 for a year , but now they're offering it for $799 for 6 months. So if someone joins us and we split it 3 ways, it's $266 each and we'd all get the recommendations.\n\nThe 5G recommendations are called \"Next-Gen Supercycle\", and it includes recommendations about companies that would get massive growth from 5G phones and other connected devices, as well as semiconductor suppliers in the 5G supply chain, micro-cap companies involved in connected and self-driving cars, and companies that would get a boost from 5G infrastructure to build the networks and cell sites. Apparently Motley Fool reviewed over 900 companies and narrowed it down to 19 stock ideas as well as future recommendations and an example portfolio section designed around 5G.\n\nSo far, I've had great returns from Motley Fool's \"Stock Advisor\" recommendations. In the last 2 months, I'm up +11% on ANET, +13% on CRM, +16% on ETSY, +19% on SHOP, +23% on OKTA, +27% on TEAM, +41% on TTD, and +64% on SFIX. Also +4.85% on ACN after just a week. I realize most of these gains are due to the general market improving, but the companies they recommend are vetted to stay successful for the next 3-5 years. For those not familiar, Motley Fool focuses on growth stocks, but give themselves a bad rep with the free articles that sound like they're written by interns, and the hype-filled ads, but once you actually pay you get decent research and stock recommendations that actually beat the market.\n\nSo if you're interested in investing in 5G companies, and want to get recommendations from Motley Fool, let me know and I'll give you access to all the 5G recommendations and research. I can keep you posted on recommendations from their $199 Stock Advisor service too.\n\nIf you're an investor who doesn't like 5G or the idea of investing in it, please don't reply here and post your thoughts elsewhere. **Also, if your opinion on Motley Fool is based only on reading their awful free clickbait articles, don't bother starting an argument here.** Thanks!",
        "subreddit": "investing",
        "title": "Motley Fool 5G recommendations",
        "url": "https://www.reddit.com/r/investing/comments/gz9n4m/motley_fool_5g_recommendations/",
        "created": 1591683457.0
    },
    {
        "author": "boccherini-trader",
        "created_utc": 1592703421,
        "id": "hcy8fb",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "**Summary**\n\nIovance is well-positioned as the key leader of cell therapy in the solid tumor space. The phase 2 lifleucel data in heavily pretreated melanoma and LN-145 data in heavily pretreated cervical cancer demonstrates compelling efficacy. LN-145 received fast track and breakthrough therapy designation in cervical cancer, and is also in phase 2 for HNSCC and NSCLC. Both lifleucel and LN-145 are being tested in combination with Keytruda, which may unlock substantial value in earlier lines of therapy. Iovance also has a strong foundation for scaled-up manufacturing and rapid therapy processing. Given the acquisitions of leading cell therapy companies by big pharma, we think a future buyout is likely, but may not take place until after commercialization. Regardless of acquisition status, we feel that Iovance has the requisite data and infrastructure to succeed independently. **We will be initiating a position in Iovance, targeting a 3-4% weight.** \n\n  \n**Key Takeaways**\n\n* We project peak sales of \\~$630 M in melanoma for lifleucel, \\~$500 M for LN-145 in cervical cancer, and \\~$1.8 B for LN-145 in HNSCC due to compelling efficacy in difficult to treat tumors and first-to-market status for cell therapy in solid tumors, resulting in a future valuation of \\~$44.50/share, a 42% premium on current stock price.\n* Lifleucel and LN-145 are widely expected to be approved in their respective indications, and this approval could come as soon as the second half of 2020.\n* Substantial upside exists if these therapies demonstrate clinically meaningful efficacy in NSCLC, and if entry into earlier lines of therapy through Keytruda combination is achieved.\n* How smoothly Iovance transitions to full commercialization is a key factor in realizing maximum opportunity, particularly as any acquisitions of Iovance appear more likely after product launch.\n\n**Overview**\n\nIovance Biotherapeutics is a cell therapy-based company that specializes in autologous polyclonal tumor infiltrating lymphocyte (TIL) production. The key value proposition that distinguishes Iovance from other T cell therapies is developing assets targeting solid tumors in late-stage clinical trials, with the high likelihood of becoming the first T cell therapy to gain approval in these tumor types. Iovance possesses two key assets in pivotal trials:\n\n* **Lifleucel:** This TIL therapy is being trialed in heavily pretreated, PDx-resistant melanoma patients. An ORR of 36% was observed in these patients (improving on standard of care chemotherapy with an ORR of \\~10%). 2/66 patients had complete response, with 23 partial responders. These rates were seen across patient segments / prior treatment history. Data was generated in 2L+ patients and includes those who progressed on a PDx therapy. Enrolled patients experienced a mean of 3.3 lines of prior therapy and high baseline tumor burden. Data released during ASCO in late May showed that median duration of response had not been met at 18.7 months, indicating durable efficacy.\n* **LN-145:** This therapy is similar to Lifleucel, but is being tested in heavily pretreated cervical cancer, for which it received fast track and breakthrough therapy designation. ORR was 44%, a high benchmark considering these patients had received an average of 2.4 prior therapies. Considering Keytruda (the current standard of care for this population) gained approval in this subpopulation based on an ORR of 14%, we expect LN-145 to be approved. Beyond cervical cancer, LN-145 is already in phase 2 for HNSCC and NSCLC (both as a monotherapy and in combination with Keytruda), which could be extremely lucrative if similar results are seen in these indications. Additionally, phase 1 data in NSCLC showed 2 of 20 patients with complete response ongoing after one year, pointing to a higher probability of success in this indication.\n\nIn 2019, Iovance began building a 136 K square foot manufacturing facility in Philadelphia slated for completion in 2021, positioning the company to scale up rapidly for production of their therapies upon approval. Additionally, Iovance has a relatively rapid manufacturing process, with the ability to prepare therapies in 22 days. Overall, in a field that has seen setbacks due to scaling up, Iovance has prepared to avoid these growing pains.\n\n  \n**Epidemiology**\n\n* **Melanoma:** With an overall incidence of \\~100 K/year, unresectable/metastatic melanoma represents \\~5% of all cases, or \\~5 K/year. \\~60% receive a second-line therapy, totalling \\~3 K/year patients addressable by lifleucel in 2021. ***Unmet Need:*** *Limited options exist for patients that progress on a PD-1, with ORR of chemotherapy hovering around 10%.*\n* **Cervical Cancer:** This tumor type has a U.S. incidence of \\~13.8 K/year. Approximately \\~50% of cases are caught early in progression. Of the remaining 50%, estimations for receipt of 2nd-line therapy vary, with an average of \\~35% of patients receiving a 2nd line within 2 years of first-line therapy. This represents a treatable population of \\~2.4 K/year in 2021. ***Unmet Need*****:** Chemotherapy has traditionally been the standard of care in this patient population, with ORR of \\~15%. Keytruda was recently approved for this subgroup with an ORR of \\~15%, indicating high remaining unmet need.\n* **HNSCC:** With an overall incidence of \\~45 K/year, metastatic HNSCC represents \\~33% of all cases, or \\~15 K/year. \\~50% are expected to receive second-line therapy, totalling \\~7.5 K/year patients addressable by LN-145 with an anticipated launch in 2022. ***Unmet Need:*** *Current second-line standard of care include chemotherapy, with response rates of \\~10%, setting a low bar for improving on current therapies.*\n\n**Key Inflection Points** \n\n* Iovance is expecting final results for the pivotal trials in melanoma and cervical cancer by second half of 2020 and expects BLA submission within 2020 as well.\n* Specifics on when NSCLC and HSNCC phase 2 data will be released have not been shared, and the primary completion data for these studies is set for December 2023. However, we expect additional data on the phase 1 trials to be released sometime in the coming year. If lifleucel can demonstrate an ORR of &gt;20% in NSCLC, we would expect this to be viewed as clinically meaningful and to drive higher valuation.\n\n**Analogs** \n\n* **Yescarta** is approved for 3L+ large B-cell lymphoma. Launched in 2017, Yescarta earned $456 M in 2019, and is priced at an annual cost of \\~$375 K.\n* **Kymriah**, also approved in 2017 for B-cell precursor ALL and in 2018 for large B-cell lymphoma, generated $278 M in sales in 2019. Kymriah is price at \\~$375 K for large B-cell lymphoma, and \\~$475 M per year for ALL.\n\n**Key Stock Drivers**\n\n* **Compelling Clinical Data:** Both Iovance assets have demonstrated compelling data in heavily pretreated tumor types with limited alternate options and low bars for clinical efficacy.\n* **Lucrative Expansion Opportunities:** There is substantial expansion potential outside of core indications of melanoma and cervical cancer, with ongoing phase 2 trials in NSCLC and HNSCC.\n* **Entering Earlier Lines of Therapy:** Combination trials with Keytruda in melanoma, HNSCC, and NSCLC may allow lifleucel and LN-145 to enter earlier lines of therapy, unlocking additional value.\n* **Strong Manufacturing Capacity:** Investment in large-scale manufacturing facilities and rapid therapy processing position Iovance to commercialize their therapies upon approval and quickly scale up to meet demand.\n* **Likely Future Target of Acquisition:** Given what we have seen with large pharma seeking to enter the cell therapy space through acquisition (e.g., Gilead and Kite Pharma), there is a significant likelihood that Iovance gets bought by a major player. However, given the recent stock offering, this may not come until after commercialization.\n* **Recent Stock Offerings Pricing Iovance at a 30% Discount:** Despite releasing positive data in melanoma during ASCO in late May, Iovance’s stock offerings raising \\~$600 M have brought the price down from a \\~$41 high to \\~$31, providing opportunity to acquire shares at what is likely a discounted price.\n\n**Potential Risks**\n\n* **Cash Burn Rate:** Iovance is burning through cash at an accelerated rate, with cash burn increasing by \\~62% in 2019. In 2019, Iovance spent \\~$166 M and in 2020Q1 spent \\~$60 M (2-fold that of 2019Q1), leaving \\~$250 M on hand. This prompted a new stock offering in which Iovance closed on \\~$600 M in cash to fuel the commercialization process. This  should provide the cash necessary to achieve commercialization, but we will be keeping a close watch on rate of cash burn and how it coincides with advancement of commercialization efforts.\n* **Operationalizing Commercialization Efforts:** Given that it looks like Iovance will commercialize on its own, building the sales force and other infrastructure necessary to meet sales goals may be challenging for a company with no prior experience. Not much information has been released around salesforce, so we will be watching for any updates here.\n* **Incomplete NSCLC Data:** The phase 1 data for LN-145 in NSCLC looks promising, but comes with confounding factors, as select patients were given subsequent treatments combining two chemotherapies with IL-1. Additionally, ORR data was not released. The data coming out of larger trials in NSCLC will likely play a key role in Iovance valuation.\n* **Future Competition from Major Players in Cell Therapy Space:** While Iovance has a head start on tackling solid tumors, CAR-T companies are looking toward this market with increasing vigor. If they can solve for the key challenge of inducing CAR-T to infiltrate the solid tumor (e.g., through engineering of immunosuppressive factors), these therapies could pose a threat to Iovance's market share in the future, though this is not likely to occur short-term. \n\nDisclosure: \n\nWe own shares of Rhythm Pharmaceuticals. This article expresses our own opinions, not Rhythm Pharmaceuticals’ or any other party’s opinion. We are not receiving compensation for this report. We do not have a business relationship with the company mentioned in this report.",
        "subreddit": "investing",
        "title": "Iovance (IOVA): Tumor cell therapy company w/ compelling data and lucrative expansion opportunities",
        "url": "https://www.reddit.com/r/investing/comments/hcy8fb/iovance_iova_tumor_cell_therapy_company_w/",
        "created": 1592732221.0
    },
    {
        "author": "notbrokemexican",
        "created_utc": 1593424510,
        "id": "hhx2uh",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "# # The Basic Idea\n\nI'm building a portfolio that revolves around developing a post-covid world. The overarching theme behind these picks American Innovation &amp; Mexican Development. I'm 26 years old and hold a strong conviction that investing in Mexican development will reward me in the decades to come. I'm a software engineer in the US &amp; an avocado farmer in Mexico.\n\nYou may see that I avoid some industries in important sectors. These arenas, if compelling enough, would likely be subscribed to a weak ETF that gets contributed to lightly. For example, an oncology ETF if Joe Biden wins the presidency in 2020.\n\n&amp;#x200B;\n\n# # Basic Rules \n\nI generally try to exercise these rules and concepts in my framework\n\n* Applications of common sense\n* Applications of game theory\n* Modesty in asset allocation over aggression\n\n&amp;#x200B;\n\n# # The Practice\n\nI have multiple sets of investments using\n\n\\- Primary assets (12) which receive the priority allocation of assets\n\n\\- Secondaries that may be exchanged into the Primary asset group if compelling enough (6x)\n\n&amp;#x200B;\n\nFor example, I will have an **Augmented Reality Group** composed of\n\n1. **Facebook (Primary)**\n2. \\[Nintendo, Disney, Apple, Adobe\\]\n\n&amp;#x200B;\n\n# # Asset Group Breakdown \n\n* Augmented Reality\n* Machine Learning\n* Financial Access\n* Semiconductors\n* Cloud Infrastructure\n* Cloud Services\n* Network Infrastructure\n* Power Systems\n* Industry\n* Industrial Robotics\n* Consumer Supply\n* ETF Diversification &amp; Asset Amplification\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # Primary Assets \n\n*  Facebook \\[Augmented Reality\\]\n*  Microsoft \\[Machine Learning\\]\n*  Paypal \\[Financial Access\\]\n*  Texas Instruments \\[Semiconductors\\]\n*  Cloudflare \\[Cloud Infrastructure\\]\n*  DocuSign \\[Cloud Services\\]\n*  Crown Castle International \\[Network Infrastructure\\]\n*  Panasonic \\[Power Systems\\]\n*  Kansas City Union \\[Industry\\]\n*  FANUC \\[Industrial Robotics\\]\n*  Costco \\[Consumer Supply\\]\n*  SPY \\[ETF Diversification &amp; Asset Amplication\\]\n*  SPCE \\[Monkey Capitalist Casino\\]\n\n&amp;#x200B;\n\n# # Augmented Reality Group\n\n1. **Facebook**\n\n*    Adobe\n*    Apple\n*    Nintendo\n*    Disney\n\n&amp;#x200B;\n\n*The gist*\n\nThe Augmented Reality Group are companies with a vested interest in AR products and sufficient power for cultural impacts. \n\n&amp;#x200B;\n\n# # Machine Learning Group\n\n1. **Microsoft**\n\n*   Google\n*   Tesla\n\n&amp;#x200B;\n\n*The gist*\n\nThe Machine Learning Group are organizations that are ML advantaged. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # Financial Access Group\n\n1.  **Paypal**\n\n*    Square\n*    Visa\n\n&amp;#x200B;\n\n*The gist*\n\nThe Financial Access group focuses on modernizing accessibility to financial instruments.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # Semiconductors Group\n\n1.  **Texas** **Instruments**\n\n*   AMD\n*   Nvidia\n\n&amp;#x200B;\n\n*The gist*\n\nThe Semiconductors Group focuses on the access to technology and computing. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # Cloud Infrastructure Group \n\n1.  **Cloudflare**\n\n*   Fastly \n*   Z-Scaler\n*   Akamai\n\n&amp;#x200B;\n\n*The gist*\n\nThe Cloud Infrastructure Group focuses on stabilizing high quality advancements in computing.\n\n&amp;#x200B;\n\n# # Cloud Services Group\n\n1. **DocuSign**\n\n*   Twitter\n*   Chegg\n*   Dropbox\n*   Lyft\n*   1Life Medical\n*   Snapchat\n*   Salesforce\n*   Upwork\n*   Autodesk\n*   Twilio\n\n&amp;#x200B;\n\n*The gist*\n\nThe Cloud Services Group are inelastic cloud computing or service distribution.\n\n&amp;#x200B;\n\n# # Network Infrastructure Group\n\n1.  **Crown Castle International**\n\n*   T-Mobile\n*   America Movil\n\n&amp;#x200B;\n\n*The gist*\n\nThe Network Infrastructure Group focuses on the expansion of telecommunications across the US and Mexico. \n\n&amp;#x200B;\n\n# # Power Systems Group \n\n1. **Panasonic**\n\n*   Vestas\n*   Plug Power\n*   Siemens\n\n&amp;#x200B;\n\n*The gist*\n\nThe Power Systems Group focuses on the growth of alternative energy systems.\n\n&amp;#x200B;\n\n# # Industry Group\n\n1.  **Kansas City Southern Rail**\n\n*    Berkshire.B\n*    XLB Materials ETF\n\n&amp;#x200B;\n\n*The gist*\n\nThe Industry Group works on material development of US and Mexico. \n\n&amp;#x200B;\n\n# # Industrial Robotics Group  \n\n1. **FANUC**\n\n*   ABB\n*   Rockwell Automation\n\n&amp;#x200B;\n\n*The gist*\n\nThe Industrial Robotics group focuses on the increasing automation of labor.\n\n&amp;#x200B;\n\n# # Consumer Supply Group \n\n1.  **Costco**\n\n*   Amazon\n*   Shopify\n\n&amp;#x200B;\n\n*The gist*\n\nThe Consumer Supply has a similar focuses on customer satisfaction during purchase time.\n\n&amp;#x200B;\n\n# # ETF Diversification &amp; Asset Amplification \n\n1. **SPY**\n\n*   EWW Mexico ETF\n*   FIVG 5g \n*   IPO Startup \n*   WCLD Cloud \n*   ESPO Gaming\n*   CIBR Cybersecurity \n*   HACK Cybersecurity \n*   TPAY Financials\n*   ARKF Financial Technology\n*   IPAY Financial Services\n*   DFNL Banking Services\n*   SOXX Semiconductors\n*   IYT Railroad \n*   POTX Cannabis \n*   BOTZ Automation \n\n&amp;#x200B;\n\n*The gist*\n\nThe ETF &amp; Asset Amplification is a group of industries I would like to factor uncertainties for or better capture. \n\n&amp;#x200B;\n\n# # Monkey Capitalist Casino \n\n1.  **SPCE**\n\n*   DKNG\n*   Dennys\n\n&amp;#x200B;\n\n*The gist*\n\nDennys is a logistic stock that represents the American Trucking Economy. All of these stocks are sinful and this is the space I allow my monkey biases to come out.\n\n  \n\n&amp;#x200B;\n\nInvestment explanations in V2 Draft",
        "subreddit": "StockMarket",
        "title": "My Portfolio Restructuring - Mexican-American Meta",
        "url": "https://www.reddit.com/r/StockMarket/comments/hhx2uh/my_portfolio_restructuring_mexicanamerican_meta/",
        "created": 1593453310.0
    },
    {
        "author": "boccherini-trader",
        "created_utc": 1592703450,
        "id": "hcy8pw",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": " \n\n**Summary**\n\nIovance is well-positioned as the key leader of cell therapy in the solid tumor space. The phase 2 lifleucel data in heavily pretreated melanoma and LN-145 data in heavily pretreated cervical cancer demonstrates compelling efficacy. LN-145 received fast track and breakthrough therapy designation in cervical cancer, and is also in phase 2 for HNSCC and NSCLC. Both lifleucel and LN-145 are being tested in combination with Keytruda, which may unlock substantial value in earlier lines of therapy. Iovance also has a strong foundation for scaled-up manufacturing and rapid therapy processing. Given the acquisitions of leading cell therapy companies by big pharma, we think a future buyout is likely, but may not take place until after commercialization. Regardless of acquisition status, we feel that Iovance has the requisite data and infrastructure to succeed independently. **We will be initiating a position in Iovance, targeting a 3-4% weight.**\n\n**Key Takeaways**\n\n* We project peak sales of \\~$630 M in melanoma for lifleucel, \\~$500 M for LN-145 in cervical cancer, and \\~$1.8 B for LN-145 in HNSCC due to compelling efficacy in difficult to treat tumors and first-to-market status for cell therapy in solid tumors, resulting in a future valuation of \\~$44.50/share, a 42% premium on current stock price.\n* Lifleucel and LN-145 are widely expected to be approved in their respective indications, and this approval could come as soon as the second half of 2020.\n* Substantial upside exists if these therapies demonstrate clinically meaningful efficacy in NSCLC, and if entry into earlier lines of therapy through Keytruda combination is achieved.\n* How smoothly Iovance transitions to full commercialization is a key factor in realizing maximum opportunity, particularly as any acquisitions of Iovance appear more likely after product launch.\n\n**Overview**\n\nIovance Biotherapeutics is a cell therapy-based company that specializes in autologous polyclonal tumor infiltrating lymphocyte (TIL) production. The key value proposition that distinguishes Iovance from other T cell therapies is developing assets targeting solid tumors in late-stage clinical trials, with the high likelihood of becoming the first T cell therapy to gain approval in these tumor types. Iovance possesses two key assets in pivotal trials:\n\n* **Lifleucel:** This TIL therapy is being trialed in heavily pretreated, PDx-resistant melanoma patients. An ORR of 36% was observed in these patients (improving on standard of care chemotherapy with an ORR of \\~10%). 2/66 patients had complete response, with 23 partial responders. These rates were seen across patient segments / prior treatment history. Data was generated in 2L+ patients and includes those who progressed on a PDx therapy. Enrolled patients experienced a mean of 3.3 lines of prior therapy and high baseline tumor burden. Data released during ASCO in late May showed that median duration of response had not been met at 18.7 months, indicating durable efficacy.\n* **LN-145:** This therapy is similar to Lifleucel, but is being tested in heavily pretreated cervical cancer, for which it received fast track and breakthrough therapy designation. ORR was 44%, a high benchmark considering these patients had received an average of 2.4 prior therapies. Considering Keytruda (the current standard of care for this population) gained approval in this subpopulation based on an ORR of 14%, we expect LN-145 to be approved. Beyond cervical cancer, LN-145 is already in phase 2 for HNSCC and NSCLC (both as a monotherapy and in combination with Keytruda), which could be extremely lucrative if similar results are seen in these indications. Additionally, phase 1 data in NSCLC showed 2 of 20 patients with complete response ongoing after one year, pointing to a higher probability of success in this indication.\n\nIn 2019, Iovance began building a 136 K square foot manufacturing facility in Philadelphia slated for completion in 2021, positioning the company to scale up rapidly for production of their therapies upon approval. Additionally, Iovance has a relatively rapid manufacturing process, with the ability to prepare therapies in 22 days. Overall, in a field that has seen setbacks due to scaling up, Iovance has prepared to avoid these growing pains.\n\n**Epidemiology**\n\n* **Melanoma:** With an overall incidence of \\~100 K/year, unresectable/metastatic melanoma represents \\~5% of all cases, or \\~5 K/year. \\~60% receive a second-line therapy, totalling \\~3 K/year patients addressable by lifleucel in 2021. ***Unmet Need:*** *Limited options exist for patients that progress on a PD-1, with ORR of chemotherapy hovering around 10%.*\n* **Cervical Cancer:** This tumor type has a U.S. incidence of \\~13.8 K/year. Approximately \\~50% of cases are caught early in progression. Of the remaining 50%, estimations for receipt of 2nd-line therapy vary, with an average of \\~35% of patients receiving a 2nd line within 2 years of first-line therapy. This represents a treatable population of \\~2.4 K/year in 2021. ***Unmet Need***\\*\\*:\\*\\* Chemotherapy has traditionally been the standard of care in this patient population, with ORR of \\~15%. Keytruda was recently approved for this subgroup with an ORR of \\~15%, indicating high remaining unmet need.\n* **HNSCC:** With an overall incidence of \\~45 K/year, metastatic HNSCC represents \\~33% of all cases, or \\~15 K/year. \\~50% are expected to receive second-line therapy, totalling \\~7.5 K/year patients addressable by LN-145 with an anticipated launch in 2022. ***Unmet Need:*** *Current second-line standard of care include chemotherapy, with response rates of \\~10%, setting a low bar for improving on current therapies.*\n\n**Key Inflection Points**\n\n* Iovance is expecting final results for the pivotal trials in melanoma and cervical cancer by second half of 2020 and expects BLA submission within 2020 as well.\n* Specifics on when NSCLC and HSNCC phase 2 data will be released have not been shared, and the primary completion data for these studies is set for December 2023. However, we expect additional data on the phase 1 trials to be released sometime in the coming year. If lifleucel can demonstrate an ORR of &gt;20% in NSCLC, we would expect this to be viewed as clinically meaningful and to drive higher valuation.\n\n**Analogs**\n\n* **Yescarta** is approved for 3L+ large B-cell lymphoma. Launched in 2017, Yescarta earned $456 M in 2019, and is priced at an annual cost of \\~$375 K.\n* **Kymriah**, also approved in 2017 for B-cell precursor ALL and in 2018 for large B-cell lymphoma, generated $278 M in sales in 2019. Kymriah is price at \\~$375 K for large B-cell lymphoma, and \\~$475 M per year for ALL.\n\n**Key Stock Drivers**\n\n* **Compelling Clinical Data:** Both Iovance assets have demonstrated compelling data in heavily pretreated tumor types with limited alternate options and low bars for clinical efficacy.\n* **Lucrative Expansion Opportunities:** There is substantial expansion potential outside of core indications of melanoma and cervical cancer, with ongoing phase 2 trials in NSCLC and HNSCC.\n* **Entering Earlier Lines of Therapy:** Combination trials with Keytruda in melanoma, HNSCC, and NSCLC may allow lifleucel and LN-145 to enter earlier lines of therapy, unlocking additional value.\n* **Strong Manufacturing Capacity:** Investment in large-scale manufacturing facilities and rapid therapy processing position Iovance to commercialize their therapies upon approval and quickly scale up to meet demand.\n* **Likely Future Target of Acquisition:** Given what we have seen with large pharma seeking to enter the cell therapy space through acquisition (e.g., Gilead and Kite Pharma), there is a significant likelihood that Iovance gets bought by a major player. However, given the recent stock offering, this may not come until after commercialization.\n* **Recent Stock Offerings Pricing Iovance at a 30% Discount:** Despite releasing positive data in melanoma during ASCO in late May, Iovance’s stock offerings raising \\~$600 M have brought the price down from a \\~$41 high to \\~$31, providing opportunity to acquire shares at what is likely a discounted price.\n\n**Potential Risks**\n\n* **Cash Burn Rate:** Iovance is burning through cash at an accelerated rate, with cash burn increasing by \\~62% in 2019. In 2019, Iovance spent \\~$166 M and in 2020Q1 spent \\~$60 M (2-fold that of 2019Q1), leaving \\~$250 M on hand. This prompted a new stock offering in which Iovance closed on \\~$600 M in cash to fuel the commercialization process. This should provide the cash necessary to achieve commercialization, but we will be keeping a close watch on rate of cash burn and how it coincides with advancement of commercialization efforts.\n* **Operationalizing Commercialization Efforts:** Given that it looks like Iovance will commercialize on its own, building the sales force and other infrastructure necessary to meet sales goals may be challenging for a company with no prior experience. Not much information has been released around salesforce, so we will be watching for any updates here.\n* **Incomplete NSCLC Data:** The phase 1 data for LN-145 in NSCLC looks promising, but comes with confounding factors, as select patients were given subsequent treatments combining two chemotherapies with IL-1. Additionally, ORR data was not released. The data coming out of larger trials in NSCLC will likely play a key role in Iovance valuation.\n* **Future Competition from Major Players in Cell Therapy Space:** While Iovance has a head start on tackling solid tumors, CAR-T companies are looking toward this market with increasing vigor. If they can solve for the key challenge of inducing CAR-T to infiltrate the solid tumor (e.g., through engineering of immunosuppressive factors), these therapies could pose a threat to Iovance's market share in the future, though this is not likely to occur short-term.\n\nDisclosure:\n\nWe own shares of Rhythm Pharmaceuticals. This article expresses our own opinions, not Rhythm Pharmaceuticals’ or any other party’s opinion. We are not receiving compensation for this report. We do not have a business relationship with the company mentioned in this report.",
        "subreddit": "pennystocks",
        "title": "Iovance (IOVA): Tumor cell therapy company w/ compelling data and lucrative expansion opportunities",
        "url": "https://www.reddit.com/r/pennystocks/comments/hcy8pw/iovance_iova_tumor_cell_therapy_company_w/",
        "created": 1592732250.0
    },
    {
        "author": "ajaferi",
        "created_utc": 1592320394,
        "id": "ha5vpc",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "2 to 5 years? What you guys think? Does it still has the power to push along after more than a decent run in last 4 years?",
        "subreddit": "stocks",
        "title": "CRM in LT",
        "url": "https://www.reddit.com/r/stocks/comments/ha5vpc/crm_in_lt/",
        "created": 1592349194.0
    },
    {
        "author": "FEELINGFEELINGFEELIN",
        "created_utc": 1591019942,
        "id": "gul3z5",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Please help im very new ($PD $ESTC $WORK $VTIQ $NET $UAL $MGM $TU $CRM $SPLK $ZM)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gul3z5/please_help_im_very_new_pd_estc_work_vtiq_net_ual/",
        "created": 1591048742.0
    },
    {
        "author": "Sterison",
        "created_utc": 1591945146,
        "id": "h7fu3v",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing_discussion",
        "title": "Experience the ultimate Salesforce Mobile Technology Solution. Sell smarter and faster with Sterison SFA and increase your on-field sales performance by 35%. Connect us for demo! info@sterison.com www.sterison.com",
        "url": "https://www.reddit.com/r/investing_discussion/comments/h7fu3v/experience_the_ultimate_salesforce_mobile/",
        "created": 1591973946.0
    },
    {
        "author": "Sterison",
        "created_utc": 1591946244,
        "id": "h7g1w8",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "options",
        "title": "Experience the ultimate Salesforce Mobile Technology Solution. Sell smarter and faster with Sterison SFA and increase your on-field sales performance by 35%. Connect us for demo! info@sterison.com www.sterison.com",
        "url": "https://youtu.be/9ESo6WogbGU",
        "created": 1591975044.0
    },
    {
        "author": "boccherini-trader",
        "created_utc": 1592703506,
        "id": "hcy988",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " \n\n**Summary**\n\nIovance is well-positioned as the key leader of cell therapy in the solid tumor space. The phase 2 lifleucel data in heavily pretreated melanoma and LN-145 data in heavily pretreated cervical cancer demonstrates compelling efficacy. LN-145 received fast track and breakthrough therapy designation in cervical cancer, and is also in phase 2 for HNSCC and NSCLC. Both lifleucel and LN-145 are being tested in combination with Keytruda, which may unlock substantial value in earlier lines of therapy. Iovance also has a strong foundation for scaled-up manufacturing and rapid therapy processing. Given the acquisitions of leading cell therapy companies by big pharma, we think a future buyout is likely, but may not take place until after commercialization. Regardless of acquisition status, we feel that Iovance has the requisite data and infrastructure to succeed independently. **We will be initiating a position in Iovance, targeting a 3-4% weight.**\n\n**Key Takeaways**\n\n* We project peak sales of \\~$630 M in melanoma for lifleucel, \\~$500 M for LN-145 in cervical cancer, and \\~$1.8 B for LN-145 in HNSCC due to compelling efficacy in difficult to treat tumors and first-to-market status for cell therapy in solid tumors, resulting in a future valuation of \\~$44.50/share, a 42% premium on current stock price.\n* Lifleucel and LN-145 are widely expected to be approved in their respective indications, and this approval could come as soon as the second half of 2020.\n* Substantial upside exists if these therapies demonstrate clinically meaningful efficacy in NSCLC, and if entry into earlier lines of therapy through Keytruda combination is achieved.\n* How smoothly Iovance transitions to full commercialization is a key factor in realizing maximum opportunity, particularly as any acquisitions of Iovance appear more likely after product launch.\n\n**Overview**\n\nIovance Biotherapeutics is a cell therapy-based company that specializes in autologous polyclonal tumor infiltrating lymphocyte (TIL) production. The key value proposition that distinguishes Iovance from other T cell therapies is developing assets targeting solid tumors in late-stage clinical trials, with the high likelihood of becoming the first T cell therapy to gain approval in these tumor types. Iovance possesses two key assets in pivotal trials:\n\n* **Lifleucel:** This TIL therapy is being trialed in heavily pretreated, PDx-resistant melanoma patients. An ORR of 36% was observed in these patients (improving on standard of care chemotherapy with an ORR of \\~10%). 2/66 patients had complete response, with 23 partial responders. These rates were seen across patient segments / prior treatment history. Data was generated in 2L+ patients and includes those who progressed on a PDx therapy. Enrolled patients experienced a mean of 3.3 lines of prior therapy and high baseline tumor burden. Data released during ASCO in late May showed that median duration of response had not been met at 18.7 months, indicating durable efficacy.\n* **LN-145:** This therapy is similar to Lifleucel, but is being tested in heavily pretreated cervical cancer, for which it received fast track and breakthrough therapy designation. ORR was 44%, a high benchmark considering these patients had received an average of 2.4 prior therapies. Considering Keytruda (the current standard of care for this population) gained approval in this subpopulation based on an ORR of 14%, we expect LN-145 to be approved. Beyond cervical cancer, LN-145 is already in phase 2 for HNSCC and NSCLC (both as a monotherapy and in combination with Keytruda), which could be extremely lucrative if similar results are seen in these indications. Additionally, phase 1 data in NSCLC showed 2 of 20 patients with complete response ongoing after one year, pointing to a higher probability of success in this indication.\n\nIn 2019, Iovance began building a 136 K square foot manufacturing facility in Philadelphia slated for completion in 2021, positioning the company to scale up rapidly for production of their therapies upon approval. Additionally, Iovance has a relatively rapid manufacturing process, with the ability to prepare therapies in 22 days. Overall, in a field that has seen setbacks due to scaling up, Iovance has prepared to avoid these growing pains.\n\n**Epidemiology**\n\n* **Melanoma:** With an overall incidence of \\~100 K/year, unresectable/metastatic melanoma represents \\~5% of all cases, or \\~5 K/year. \\~60% receive a second-line therapy, totalling \\~3 K/year patients addressable by lifleucel in 2021. ***Unmet Need:*** *Limited options exist for patients that progress on a PD-1, with ORR of chemotherapy hovering around 10%.*\n* **Cervical Cancer:** This tumor type has a U.S. incidence of \\~13.8 K/year. Approximately \\~50% of cases are caught early in progression. Of the remaining 50%, estimations for receipt of 2nd-line therapy vary, with an average of \\~35% of patients receiving a 2nd line within 2 years of first-line therapy. This represents a treatable population of \\~2.4 K/year in 2021. ***Unmet Need***\\*\\*:\\*\\* Chemotherapy has traditionally been the standard of care in this patient population, with ORR of \\~15%. Keytruda was recently approved for this subgroup with an ORR of \\~15%, indicating high remaining unmet need.\n* **HNSCC:** With an overall incidence of \\~45 K/year, metastatic HNSCC represents \\~33% of all cases, or \\~15 K/year. \\~50% are expected to receive second-line therapy, totalling \\~7.5 K/year patients addressable by LN-145 with an anticipated launch in 2022. ***Unmet Need:*** *Current second-line standard of care include chemotherapy, with response rates of \\~10%, setting a low bar for improving on current therapies.*\n\n**Key Inflection Points**\n\n* Iovance is expecting final results for the pivotal trials in melanoma and cervical cancer by second half of 2020 and expects BLA submission within 2020 as well.\n* Specifics on when NSCLC and HSNCC phase 2 data will be released have not been shared, and the primary completion data for these studies is set for December 2023. However, we expect additional data on the phase 1 trials to be released sometime in the coming year. If lifleucel can demonstrate an ORR of &gt;20% in NSCLC, we would expect this to be viewed as clinically meaningful and to drive higher valuation.\n\n**Analogs**\n\n* **Yescarta** is approved for 3L+ large B-cell lymphoma. Launched in 2017, Yescarta earned $456 M in 2019, and is priced at an annual cost of \\~$375 K.\n* **Kymriah**, also approved in 2017 for B-cell precursor ALL and in 2018 for large B-cell lymphoma, generated $278 M in sales in 2019. Kymriah is price at \\~$375 K for large B-cell lymphoma, and \\~$475 M per year for ALL.\n\n**Key Stock Drivers**\n\n* **Compelling Clinical Data:** Both Iovance assets have demonstrated compelling data in heavily pretreated tumor types with limited alternate options and low bars for clinical efficacy.\n* **Lucrative Expansion Opportunities:** There is substantial expansion potential outside of core indications of melanoma and cervical cancer, with ongoing phase 2 trials in NSCLC and HNSCC.\n* **Entering Earlier Lines of Therapy:** Combination trials with Keytruda in melanoma, HNSCC, and NSCLC may allow lifleucel and LN-145 to enter earlier lines of therapy, unlocking additional value.\n* **Strong Manufacturing Capacity:** Investment in large-scale manufacturing facilities and rapid therapy processing position Iovance to commercialize their therapies upon approval and quickly scale up to meet demand.\n* **Likely Future Target of Acquisition:** Given what we have seen with large pharma seeking to enter the cell therapy space through acquisition (e.g., Gilead and Kite Pharma), there is a significant likelihood that Iovance gets bought by a major player. However, given the recent stock offering, this may not come until after commercialization.\n* **Recent Stock Offerings Pricing Iovance at a 30% Discount:** Despite releasing positive data in melanoma during ASCO in late May, Iovance’s stock offerings raising \\~$600 M have brought the price down from a \\~$41 high to \\~$31, providing opportunity to acquire shares at what is likely a discounted price.\n\n**Potential Risks**\n\n* **Cash Burn Rate:** Iovance is burning through cash at an accelerated rate, with cash burn increasing by \\~62% in 2019. In 2019, Iovance spent \\~$166 M and in 2020Q1 spent \\~$60 M (2-fold that of 2019Q1), leaving \\~$250 M on hand. This prompted a new stock offering in which Iovance closed on \\~$600 M in cash to fuel the commercialization process. This should provide the cash necessary to achieve commercialization, but we will be keeping a close watch on rate of cash burn and how it coincides with advancement of commercialization efforts.\n* **Operationalizing Commercialization Efforts:** Given that it looks like Iovance will commercialize on its own, building the sales force and other infrastructure necessary to meet sales goals may be challenging for a company with no prior experience. Not much information has been released around salesforce, so we will be watching for any updates here.\n* **Incomplete NSCLC Data:** The phase 1 data for LN-145 in NSCLC looks promising, but comes with confounding factors, as select patients were given subsequent treatments combining two chemotherapies with IL-1. Additionally, ORR data was not released. The data coming out of larger trials in NSCLC will likely play a key role in Iovance valuation.\n* **Future Competition from Major Players in Cell Therapy Space:** While Iovance has a head start on tackling solid tumors, CAR-T companies are looking toward this market with increasing vigor. If they can solve for the key challenge of inducing CAR-T to infiltrate the solid tumor (e.g., through engineering of immunosuppressive factors), these therapies could pose a threat to Iovance's market share in the future, though this is not likely to occur short-term.\n\nDisclosure:\n\nWe own shares of Rhythm Pharmaceuticals. This article expresses our own opinions, not Rhythm Pharmaceuticals’ or any other party’s opinion. We are not receiving compensation for this report. We do not have a business relationship with the company mentioned in this report.",
        "subreddit": "stocks",
        "title": "Iovance (IOVA): Tumor cell therapy company w/ compelling data and lucrative expansion opportunities",
        "url": "https://www.reddit.com/r/stocks/comments/hcy988/iovance_iova_tumor_cell_therapy_company_w/",
        "created": 1592732306.0
    },
    {
        "author": "Frostyfragzz",
        "created_utc": 1591101537,
        "id": "gv6ko0",
        "num_comments": 144,
        "num_crossposts": 0,
        "selftext": "Hello again, ‘tardos. I’m back with another deep-value play—and might I suggest that, this time, you learn to take profit. Additionally, I’ve realized that (due to poor levels of reading comprehension) it’s necessary to include in an easy-to follow summary early-on in the post. Today, we’re looking at DXC, your tech support specialist’s least favorite company! The post will go as follows, and, as always, ***TL;DR at bottom***:\n\n1. What is DXC?\n2. What is the DXC turnaround process like?\n3. Undervalued\n4. Catalysts For Growth\n5. Bear Case \n6. Smart Money\n7. The Play / TL;DR\n\n# 1. What is DXC?\n\nDXC Technology is a provider of IT services. It’s a massive company, sitting at \\~120 on the Fortune 500, and with 20B in LTM revenues. It operates through two segments, Global Business Services (GBS) and Global Infrastructure Services (GIS). GBS includes “technology solutions comprising enterprise, cloud application, and consulting services; application services; analytics services; business process services; and industry software and solutions.” The GIS segment “provides cloud and platform services; workplace, mobility, and Internet of Things services; and security solutions.”\n\nIf you’re like me, the above basically reads as a bunch of buzzwords that you don’t care about. The important thing to realize is that many of DXC’s specializations are absolute money-losers, some are stagnant, and some are highly promising. Essentially, any segment that has been doing well in the market overall (cloud security, analytics, etc.) is doing well, and the other segments are forgettable. Here’s an example from their 2019 [annual investor presentation ](https://assets1.dxc.technology/investor_relations/downloads/DXC_Annual_Report_2019_10K_Final_v4.pdf)summarizing this effect (“digital” essentially encapsulates SAAS solutions): \n\nhttps://preview.redd.it/p3mbstdooh251.png?width=970&amp;format=png&amp;auto=webp&amp;s=67ab20f7d02175a5cbb953676c6f183a31c6bd12\n\nAnd this trend has continued throughout Covid-19 up until this quarter. Though, as with most companies we’ve seen some Covid-related QoQ contraction, we are absolutely seeing growth in the “Analytics and Engineering” and “Cloud and Security” segments:\n\nhttps://preview.redd.it/j5fr5y9poh251.png?width=1244&amp;format=png&amp;auto=webp&amp;s=ed624cbc16017302b3b49c2f96d112e5d1d28b32\n\nIf you’re too lazy to parse all that, basically just understand that DXC does the same things as the B2B IT segments of Accenture, Cognizant Group, Infosys, and CGI Inc. Now that you understand *what* DXC does, it’s important to understand if they do it *well*. Unfortunately for clients and shareholders, DXC’s non-SAAS services (and some of it’s SAAS ones) are ***utterly shit***. I’m going to expand on this for a while, but don’t have a fweak out just yet. \n\nThe shittiness of DXC over the past few years is well-demonstrated through a simple Reddit search. Within 5 minutes, I was able to find these comments: \n\nhttps://preview.redd.it/cbtqfdyroh251.png?width=728&amp;format=png&amp;auto=webp&amp;s=b1adb3938ff4c15fcd6eb497ff31e3712728beea\n\nhttps://preview.redd.it/mhuq505uoh251.png?width=1184&amp;format=png&amp;auto=webp&amp;s=18103395bbdbd2ab5cc129f259e2590c9ad328b9\n\nAll of this is reflected in DXC’s share price, which has been on a downtrend for a long time:\n\nhttps://preview.redd.it/wyk558qvoh251.png?width=1206&amp;format=png&amp;auto=webp&amp;s=4c6c40ae966f59e0939d1ddd5723d2af0cb2c0be\n\nEven though DXC beat earnings (Q4 results came in on May 28th), its stock price further plummeted due to other continuing issues, like diminishing revenue. The company’s share price now sits at \\~$14.5 and it’s market cap has declined to \\~$3.6 billion. Even though a decline in worth should feel nice and familiar for you autists, obviously this is not a company that’s performing well. \n\nThe good news is that the management of the company is well aware that they are shit, and they are additionally well aware of the path towards growth: pivoting away from their underperforming verticals and into SAAS, selling unprofitable segments, and providing customers with an actually good experience. Let’s examine what the company is doing to turn itself around, and whether or not this presents an opportunity for tendies.\n\n# 2. An Ugly DXCling?\n\nDXC’s turnaround story is, in large part, about management. In 2019, continuing underperformance resulted in a management shake-up that saw [Mike Salvino](https://www.dxc.technology/investor_relations/ds/32534/147322-mike_salvino_biography) take the reins. In addition to looking like a [Chad](https://www.google.com/search?tbm=isch&amp;sxsrf=ALeKk02_lng_BrG2LumGjtCOqGH94JrRLw%3A1590772575830&amp;source=hp&amp;biw=1183&amp;bih=737&amp;ei=X0PRXv25L7OIytMP4YeG0Aw&amp;q=mike+salvino&amp;oq=mike+salvino&amp;gs_lcp=CgNpbWcQAzICCAAyAggAMgIIADICCAAyAggAMgIIADIECAAQGDIECAAQGDIECAAQGDIECAAQGDoFCAAQgwE6BggAEAgQHlDVBFjSDmDPEGgAcAB4AIABVogBvQaSAQIxMpgBAKABAaoBC2d3cy13aXotaW1n&amp;sclient=img&amp;ved=0ahUKEwi95bDSydnpAhUzhHIEHeGDAcoQ4dUDCAc&amp;uact=5#imgrc=X6Oqc96utpic5M) version of Jim Carrey, Salvino is very well-regarded in the field, and has quite a bit of experience “extracting value” from his time at PE firm Carrick Capital Partners. Also, he was the chief executive at Accenture Operations, which is essentially Accenture’s non-shitty IT services branch. Salvino has instituted several changes designed to turn DXC around. \n\nFirst, they’ve begun to focus on, well, not being shitty to customers. This is not mere talk. Prior to this quarter, 40 customers had opened challenges against DXC for services not rendered; these occasionally amounted to legal action. However, on the last conference call, Salvino noted that:\n\n“On customer delivery, we have now **fixed 35 of the 40 challenged accounts** \\[meaning the customers are retained\\]. Of the remaining five, two have decided to leave us, and we are still working the other three. Investing to fix these accounts was something I highlighted during my first earnings call, and I'm happy to report this is pretty much behind us.”\n\nThat’s extremely good news. Another problem that has plagued DXC is its Workplace and Mobility subunit. But this long struggling area has actually been *helped* by Covid-19, and may become a big earner going forward:\n\nhttps://preview.redd.it/gpkdaxmyoh251.png?width=1562&amp;format=png&amp;auto=webp&amp;s=129539453ec6a126f0e5149ca5a52b0f8b7bdc40\n\nAdditionally, DXC has been implementing financial flexibility measures both as a response to Covid-19 and so as to strengthen the business generally. It’s recently completed a debt-raise for [$500 million dollars](https://www.bamsec.com/filing/119312520107182?cik=1688568), at a modest—particularly for a company that has a bad narrative surrounding it—4% interest rate. That’s good because the stock price won’t get hammered by an offering anytime soon. \n\nFurther, DXC has no upcoming debt obligations that are particularly threatening—in fact, the nearest debt due date is in 2022. It also recently suspended its massive 5% dividend. This news is largely what caused DXC to crash 13% on Friday, May 29th, but it’s actually a smart move. The suspension of a dividend will free up further cash that can be reinvested and used to pay down interest, as well as to [raise employee salaries](https://www.glassdoor.com/Salary/DXC-Technology-Salaries-E1603125.htm). This is a huge point, because DXC has lost human capital by not paying its employees enough; finally, they are learning their lesson. Considering all this, the recent stock price downturn is frankly a big market overreaction (and if you were investing in DXC for a dividend, you’re an idiot).\n\nBut here’s the real reason to invest in DXC, as described by some fat guy named Seth Klarman:\n\n**“**Spinoffs permit parent companies to divest themselves of businesses that no longer fit their strategic plans, are faring poorly, or adversely influence investor perceptions of the parent, thereby depressing share prices. When a company owns one or more businesses involved in costly litigation, having a poor reputation, experiencing volatile results, or requiring an extremely complex financial structure, **its share price may also become depressed.** The goal in spinning off such businesses is to create **parts with a combined market value greater than the present whole.**” — Seth Klarman in *Margin of Safety*\n\nThis quote is amazingly apt, considering DXC recently [completed a sale](https://www.marketwatch.com/press-release/dxc-technology-to-sell-us-state-and-local-health-and-human-services-business-to-veritas-capital-for-50-billion-2020-03-10) of its shitty Local Health and Human Services segment to PE firm Veritas Capital for… $5 billion (**\\~$3.6 billion cash after taxes**). The market responded with huge support to this plan: DXC share price jumped around 30% in one day and remained there for months, up until it got bat-soup fucked:\n\nhttps://preview.redd.it/q23pv531ph251.png?width=1208&amp;format=png&amp;auto=webp&amp;s=1c9194ef092dd355475092b978141074705829cb\n\nNow that we know DXC’s areas of operation, ugly past, turnaround strategy, and recent stock price action, we can turn towards an examination of its financials. \n\n# 3. The Great DXCtator\n\n**“**But WAIT,” you’re surely thinking! Doesn’t it seem shocking that DXC, a company with a mere $3.6 billion market cap, will literally have that amount in cash come deal close? Surely, something must be wrong. You’re probably thinking that the deal won’t close due to Covid. That may be true, except for the following clause in the MAC. What’s the MAC? Only the [very thing](https://www.divestopedia.com/definition/4954/material-adverse-change-mac) designed to avoid this deal getting shuttered by force majeure (e.g. a pandemic):\n\nhttps://preview.redd.it/233awtm3ph251.png?width=1718&amp;format=png&amp;auto=webp&amp;s=e3938a75584f35f80c8ad48ff615e777c6fce607\n\nOf course, there has been much skepticism still—but Salvino’s earnings call comments demonstrate complete conviction that this deal will go through as planned (actually, ahead of schedule). It seems extremely unlikely that such comments would be made were this not to be the case:\n\nhttps://preview.redd.it/n2f61tb5ph251.png?width=1628&amp;format=png&amp;auto=webp&amp;s=eb86e6154fddeb424e1099947035f0ad9116c4ed\n\nBut perhaps you’re thinking—if you’re one of the more “savant” idiots here—that this company is abysmal at generating FCF, and so it effectively is still a terrible investment, even with cash on hand equal to its market cap. However, you’d also be wrong:\n\nhttps://preview.redd.it/ufvzogk6ph251.png?width=1828&amp;format=png&amp;auto=webp&amp;s=d823a78b877b8cf594db3c8bb347f7e1a187d77b\n\nAdditionally, the CEO has expressed that cash from the sale will be used to pay down debt, resulting in even more future FCF (check those large negative interest numbers on the above statement). Here’s an image of a DCF that makes some terribly conservative assumptions from an [excellent analysis](https://autumncapitalmanagement.wordpress.com/2020/05/19/dxc-technology-nysedxc/) of DXC’s finances (apologies for pic quality):\n\nhttps://preview.redd.it/gk1owm19ph251.png?width=716&amp;format=png&amp;auto=webp&amp;s=08c1bd569f3beec3293292b294af3855ff1ab8c4\n\nhttps://preview.redd.it/pz02iqscph251.png?width=727&amp;format=png&amp;auto=webp&amp;s=067ea46fa7faa3c023896a648a425b4f40962fd2\n\nhttps://preview.redd.it/oxvplwfdph251.png?width=675&amp;format=png&amp;auto=webp&amp;s=2426564fc2cc3b958e5769f9456a18def77267a8\n\nWhat does this mean? Essentially, if DXC behaves as it has in the past, its current stock price implies an mouth-watering 20% IRR over the next decade. Given *astoundingly* conservative assumptions, including “-50% revenue, margin contraction across the board, $1.5B in AR write-downs (40% of outstanding), and $400m in working capital additions for *five* years on a *smaller* business with currently break even working capital,” there’s still a positive IRR of around 5.77%. Basically, once the market properly values DXC, it’s gonna fly. \n\n# 4. Catalysts\n\nWhat’s gonna make the market catch on? The most obvious catalyst, and one which proves this thesis, will be the completion of the segment sale. As is mentioned above, it’s expected this will occur by next September. However, I expect the narrative will change far sooner, after the initial de-risked (post-ER) stock is bought up. To truly make money, you often have to get in before the market catches on.\n\nAdditionally, the market could begin valuing DXC not on its past performance, but on its likely future performance. In a way, it’s already doing that. If you recall from above, the interest rate on DXCs new bond offering was just 4%. Because the [current risk free rate ](https://www.marketwatch.com/investing/bond/tmubmusd03m?countrycode=bx)is \\~1.4%, if this company was as distressed as its stock price would imply, we’d expect to see this interest be something more like 7.4% - 9.4%. You can do some math to see what this implies for the stock price, but I’m too lazy. Basically, it means it's super undervalued.\n\nFurther, DXC’s shift to cloud could prove profitable enough to change the narrative around the company. There’s been a 23% uptick in qualified pipeline leads over the past few months, many of which come from cloud customers dealing with WFH, and 7% cloud growth QoQ. But they’re also working to better margins, instead of merely boosting top-line growth. The company’s $550-700 million cost savings plan, according to the earnings call, is expected to accelerate this coming quarter. \n\nI’m getting a bit bored of writing this, so let me just end with this summary. EPS this past quarter was $1.2 per share, and the quarter before that was $1.4 per share. Boo-hoo. In that time, the stock price has more than **halved**, even though the company generates FCF, and has entered into a sale that will see them **receive their MARKET CAP IN COLD HARD CASH**. And that is what we call on opportunity.\n\n# 5. Bear Case\n\nThere are four main potential components to the bear case. The first, and most obvious, is that the sale doesn’t go through. That seems unlikely based on this last ER, based on the language of the MAC, and based on the fact that the involved PE firm hasn’t said anything to the contrary. But anything is possible.\n\nSecond, DXC’s shift to cloud could be absolutely botched. Keep in mind that, this whole time, I’ve not been claiming this is a *good company*. So I suppose that it’s possible that DXC could fuck this turnaround up so badly that their future earnings come in far worse than the -8% to -10% growth they’ve already conservatively forecasted for the upcoming quarter. That being said, even though they’ve been shitty, they aren’t exactly ignorant about IT trends. They are the largest fully IT focused company in the Fortune 500, after all.\n\nFinally, there’s a tiny chance that they struggle with their debt. It’s not like their cap table is particularly attractive: \n\nhttps://preview.redd.it/p0jpdo4fph251.png?width=1326&amp;format=png&amp;auto=webp&amp;s=030a0043b46585ce2eb97982989fe540579e474e\n\nHowever, it must be kept in mind that they should have $3.6 billion cash on hand very soon, and that they are able to raise new debt at highly reasonable rates. Even if they weren’t they only have $600 million of debt maturing in the next two years (and they have $20 billion in revenue). So it’s not exactly like they’re on the brink of bankruptcy. \n\nFinally, as some old guy said once, the market can remain irrational longer than you can remain solvent. So even if *everyone knows DXC* is undervalued, that doesn’t mean that it won’t stay that way. In my opinion, this is the true risk. It’s much easier for investors to buy into the narrative that a company is undervalued because it’s going to do better than expected, than it is to get them to believe that a company is deservedly getting shat on, but that said stream of shit is coming at far too high a flow-rate. But I also am confident in the market’s efficiency. \n\n# 6. ‘Tutes for the Slutes\n\nAs always, it’s best to assume that some loser from Bridgewater has figured this shit out already. So let’s see what the smart money thinks about DXC. First, note that it has an extremely high level of institutional ownership—around 80%. You can see the many funds holding it [here](https://www.holdingschannel.com/bystock/?symbol=dxc). To me, this shows good faith in their future prospects.\n\nAdditionally, ER reports are catching on to the fact that DXC is undervalued. Morgan Stanley [just set a $33 price target](https://markets.businessinsider.com/analysts-opinions/dxc-technology-overweight-715630). Citigroup and Cowen have also recently upgraded to a buy rating. Even JPM, who is neutral on the stock, has a price target of 17. That’s \\~16% higher than price at time of writing.\n\nEssentially, smart money is betting on this play. With a recent ER having de-risked the stock, I believe that now is a great time to get in. I predict we won’t see this below $\\~14 for the foreseeable future.\n\n# 7. TL;DR / Play\n\nDXC is retardedly undervalued. Even with worst case assumptions, it should go up from here. I contend that a run up these next few months, and then the closure of the $5 billion sale will assuage almost any fears of these worst case assumptions. Keep in mind that this company is generating almost the same EPS as the quarter previously in one of the worst crises we’ve ever seen, will have $3.5 billion in pure cash after tax, and has taken **real** steps to implement a turnaround. I don’t think it’ll take the market long at all to catch on—I expect there to be a runup prior to their next earnings call on August 9th. If the company can merely beat its conservative EPS forecast and confirm the deal is still good, which it almost certainly will, all is gucci. Because of that I’ve loaded up on:\n\n# July 17 $16 &amp; $17 calls\n\nI’m also going with stock since it’s been nicely de-risked, but you guys don’t give a shit about that. Positions:\n\nhttps://preview.redd.it/hxcjccogph251.png?width=1426&amp;format=png&amp;auto=webp&amp;s=c0aa80ccafed5f14971384e7e77135ebefadf230\n\n***All I can say about DXC is this—remember all the girls you didn’t think were hot until they turned around?***",
        "subreddit": "wallstreetbets",
        "title": "Big Swinging DXC: Why a Bad Company Will Run from $14 to $20+",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gv6ko0/big_swinging_dxc_why_a_bad_company_will_run_from/",
        "created": 1591130337.0
    }
]