[
    {
        "author": "Evil____",
        "created_utc": 1608838536,
        "id": "kjlbx7",
        "num_comments": 1077,
        "num_crossposts": 0,
        "selftext": "First of all, I am incredibly privileged. When my grandpa passed away in March, I inherited $30,000. I had $10,000 saved up as well from working the prior summer and that $10,000 was already invested in the stock market. In high school I found out about stocks in my economics class and the day I turned 18 I invested every penny I had. \n\nOnce again, I am privileged to be able to invest this money at all.. I have a college fund to pay my tuition, I don’t have to worry about when my next meal is coming, and I have the freedom to spend my money as I choose. \n\nAnyways, in March &amp; April when the market crashed I decided it was time to really dive into the stock market. I spent about 5 hours every day researching companies and I’m here to share what I’ve learned. \n\nIn my opinion, **the** **companies** **you** **invest** **in** **should** **be** **an** **extension** **of** **your** **worldview.** Where do you think the world will be in 10 years+ and what industries will prosper from the change. As I was raised in a liberal family and hold these values, I’m quite concerned with **Climate** **Change**. I’ve taken college classes in this realm since and learned more about the risks we face. I believe that any company whose mission revolves around mitigating the climate crisis will prosper in the coming decades. \n\n------------------------------------\n\nThat being said, I’ll list the companies I hold and a very brief synopsis of what they do and why I hold their stock. **Please** **do** **your** **own** **research**; this is only meant to introduce young investors to a certain mindset that I hold and the companies that I choose to support. \n\n--------------------------\n\n**Tesla** **(TSLA)** \n\nportfolio weight: **22.86%**\n\ngain/loss **1026%** **gain**\n\nYou guys all know what Tesla is about. They are the premier EV company with goals of cutting battery costs by 56% and producing 20,000,000+ cars in the decade. They also have a growing energy business with solar roofs, panels, battery storage and an autobidder software. Tesla is priced insanely high by traditional metrics. If these metrics are your investing style then it’s not for you. If you’re like me, and you look for companies to hold for decades then I believe Tesla is one of the best investments out there. What other company will benefit from the transition to renewables in response to climate change and changing political conditions?\n\n----------------------------------\n\n**MP** **Materials** **(MP)**\n\nportfolio weight: **12.68%**\n\ngain/loss: **197%**  **gain**\n\nMP is the only active rare earth mineral miner in the U.S. They produce neodymium concentrates which are important components in NDPR magnets; used in EV motors, wind turbines, electronics &amp; much more. \n\nI bought MP during their early pre-merger days and have already seen considerable profits in a few months. I’ve been shaving this position to keep it around 10% because it is a commodity play which can be quite risky. That being said, rare earths are expected to appreciate substantially in price as EV demand increases. Furthermore, MP is moving downstream to refine their rare earths themselves, as they currently ship them to China to be refined, and in the future they plan on manufacturing their own NDPR batteries. This will increase their margins greatly. \n\n----------------------------------\n\n**Planet** **13** **(PLNHF)**\n\nportfolio weight **5.35%**\n\ngain/loss: **147.71** **gain**\n\nThis one is a MJ stock and I’m focusing mostly on my Climate Change investments on this post so I’ll keep it brief. They own a superstore in Vegas and have their own brands. I believe the MJ industry is going to explode soon and PLNHF will benefit. \n\n--------------------------------------\n\n**Jinko** **Solar** **(JKS)**\n\nportfolio weight: **4.91%**\n\ngain/loss: **268.88%** **gain**\n\nJinko Solar is a leading solar panel manufacturer in China. They’ve seen market consolidation in China and are poised to benefit from increasing demand and incentives around solar energy. Specifically, South East Asia is expected to see dramatic growth in renewables as China/India are responsible for a large portion of global emissions and are also seeing considerable growth in GDP and population. It’s a play on the South East Asian economy and renewable industry. \n\n-------------------------------------\n\n**SolarEdge** **(SEDG)**:\n\nportfolio weight: **4.89%**\n\ngain/loss: **108.5%** **gain**\n\nSolarEdge is the global leader in panel inverters, which turn the sun’s D.C. current into usable electricity for households (A.C. current). The inverter space is a much more consolidated industry with higher margins than panels. They trade at a more expensive multiple and are expected to see dramatic top and bottom line growth in the coming years. Solar panels need inverters to perform; simple as that. With fewer companies focused on this space, I expect the top players to have a large market share and grow along with the solar energy market. SEDG is also expanding into the energy storage and EV charging markets with recent acquisitions. \n\n--------------------------------------\n\n**Enphase** **Energy** **(ENPH)**\n\nportfolio weight: **4.43%** \n\ngain/loss: **203.08%** **gain**\n\nEnphase is also in the inverter market, with their differentiated microinverters. Micro Inverters are generally used in smaller systems and optimal for residential solar. Everything said above about the inverter market is true for Enphase as well. Enphase’s business goes beyond inverters though. They are targeting a full residential energy ecosystem, with storage and their “Enlighten” software App, which will manage home energy usage and sell excess energy back to the grid. Enphase is very much a play on a future decentralized microgrid, with homes trading energy to each other as prices fluctuate. \n\n-------------------------------------------\n\n**Canadian** **Solar** **(CSIQ)**\n\nportfolio weight: **4.42%**\n\ngain/loss: **118.32%** *gain**\n\nCanadian Solar is another panel manufacturing company. They are also seeing growth in market share as smaller players struggle during the pandemic. CSIQ is a low cost producer with residential, commercial and grid level projects. They are planning on expanding their recurring revenue stream through full and partial ownership of solar projects. You can read more about this on the IR page. CSIQ is a pure solar play with an international footprint and vast management expertise. They will certainly benefit from any movement towards renewables, especially if legislation is passed to set a price on carbon. \n\n--------------------------\n\n**Lemonade** **LMND** \n\nportfolio weight: **3.93%**\n\ngain/loss: **112.52** **gain**\n\nLemonade is not a climate change related investment. It’s highly speculative but I think their management team and business model is really cool so I put some money in (and quickly more than doubled it). I’ll be brief here, but basically they are a home/renter/pet insurance company that takes a flat 25% cut of premiums as revenue and uses the remaining money to pay out claims. They aim to align incentives by donating anything left over beyond the 25% to a charity of customers choosing. Also, their use of AI makes the registration and claims process seamless and “delights” customers. \n\n----------------------------\n\n**TPI** **Composites** **(TPIC)**\n\nportfolio weight: **3.73%**\n\ngain/loss: **153.99%** **gain**\n\nTPIC manufacturers wind blade composites. They supply the top five wind turbine companies outside of China. I wrote about them on prior posts so I’ll just copy &amp; paste here:\n63% of total wind blade manufacturing is outsourced to companies like TPI and they are the market leader in this space with about 20% market share globally. The business currently has low margins, but they target a 12% EBITDA margin for the future, and they trade at a measly 0.74 P/S ratio currently. They are also expanding into EV composite manufacturing and have a contract with Workhorse to manufacture vehicle parts for them.\n-----------------------------\n\n**Skyworks** **Solutions** **(SWKS)**\n\nportfolio weight: **2.83%**\n\ngain/loss: **60.57%** **gain**\n\nSkyworks is a semiconductor focused on connectivity chips for all kinds of devices. They aren’t climate change related which is the point of this post so I’ll leave it at that.\n\n----------------------------\n\n**Tattooed** **Chef** **(TTCF)**\n\nportfolio weight: **2.65%**\n\ngain/loss: **55.90** **gain**\n\nTattooed Chef is a play on the rising plant-based food trend. They make a variety of frozen food items, widely available in Walmart, Costco and Target. They are expanding into Whole Foods, Trader Joe’s and many more stores, where I expect them to be very successful. The plant based market is exploding for a couple of reasons. Firstly, there is more research on the health benefits of a plant based diet, with athletes such as Chris Paul &amp; Todd Gurley endorsing these brands. Also, consumers are becoming increasingly aware of the threat of climate change and how avoiding red meat can have a positive impact on the planet. I expect TTCF to benefit off of these trends and continue innovating in the plant-based space. I bought in 3 weeks ago and the price has exploded since then. \n\n-------------------------\n\n**Workhorse** **(WKHS)**\n\nportfolio weight: **2.60%**\n\ngain/loss: **35.90%** **gain**\n\nWorkhorse is an electric delivery van company. They manufacture last mile electric vehicles and are developing drones to further decrease last mile delivery costs. They are a play on the e-commerce industry and electrification of vehicles. I’m invested in them because last mile delivery is responsible for a large chunk of transportation carbon emissions and in desperate need of electrification. I also believe that Workhorse will get a large chunk of the upcoming USPS contract which will provide a stable revenue stream.\n---------------------\n\n**Aphria** **(APHA)**\n\nportfolio weight: **2.45%**\n\ngain/loss: **53%** **gain**\n\nAphria is another MJ play for me. Once again they aren’t a climate change investment so I’ll keep it brief. They just finalized a merger with Tilray, making them the biggest cannabis producer in the world. They are based in Canada and I believe they will be the market leader in Europe, due to their infrastructure advantage through owning CC Pharma.\n\n----------------------------\n\n**Vestas** **Wind** **Systems** **(VWDRY)**\n\nportfolio weight: **2.40%**\n\ngain/loss: **197.44%** **gain**\n\nVestas is the global leader in wind turbine manufacturing and installation. They are one of the few pure wind plays in the stock market, making them an attractive choice for anybody looking to get exposure to wind. A big driver if future growth will be their service and maintainace business, which their management team has been focused on in recent quarters. This is a higher margin business with consistent recurring revenues. \n\n----------------------------\n\n**Facebook** **(FB)**\n\nportfolio weight: **2.38%**\n\ngain/loss: **20.61%** **gain\n\nI’m selling out of FB very soon but I still hold them for now. FB is an incredible business and I’m sure they’ll see growth in the future, but it just isn’t for me (anymore). I consider ethics a lot in my investments, which many of you may consider stupid but idc. \n\n---------------------------\n\n**Hannon** **Armstrong** **(HASI)**\n\nportfolio weight: **2.18%**\n\ngain/loss: **57.40%** **gain**\n\nHASI is a REIT, which solely makes climate change related investments. They invest in the land under solar projects, energy efficient buildings and much more. HASI is a great dividend play and I expect their stock price to appreciate as climate change worries are exacerbated in the future. \n\n---------------------------\n\n**Beyond** **Meat** **(BYND)**\n\nportfolio weight: **2.10%**\n\ngain/loss: **21.24%** **gain**\n\nI made a post with some DD earlier this year on Beyond so I’ll just link that below:\n\nhttps://www.reddit.com/r/stocks/comments/if9tmj/beyond_meat_bynd_fundamental_analysis_with_my/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf\n\n---------------------------\n\n**Brookefield** **Renewable** **Partners** **(BEPC)**\n\nportfolio weight: **2.06%**\n\ngain/loss: **87.23%** **gain**\n\nBEPC owns and operates a portfolio of renewable energy assets. Earlier this year they completed a merger with Terraform Power, expanding their solar &amp; wind footprint. They are also the primer owner of hydroelectric power plants, which produce a consistent source of electricity. BEPC has a strong management team and owns valuable assets that will greatly appreciate in value as government incentives expand around renewable energy consumption. They also pay a nice dividend. \n\n—————————————-\n\n**Disney** **(DIS)**\n\nportfolio weight: **2.03%**\n\ngain/loss: **50.06%** **gain** \n\nI’m invested in Disney mostly for some portfolio diversity. I’m a big fan of their streaming platform and business strategy revolving around that. This one isn’t climate change related so I’ll leave it at that.\n\n———————————\n\n**First** **Solar** **(FSLR)**\n\nportfolio weight: **1.84%**\n\ngain/loss: **70.47%** **gain**\n\nFirst Solar is an American based panel manufacturer and projects operator. They used differentiated technology with Cadmoum Telluride panels, which are supposed to increase output and lifetime at a higher cost. FSLR is just another play on the growing solar industry, and being U.S. based seems to reward them a higher earnings multiple in the market than their peers. They also have a beautiful balance sheet. \n\n———————————-\n\n**Trulieve** **Cannabis** **(TCNFF)**\n\nportfolio weight: **1.44%**\n\ngain/loss: **5.33%** **gain**\n\nTrulieve is another Cannabis play. This one based in the U.S. with a large medical market in Florida. Nuff said. (Do your own research) \n\n———————————\n\n**Star** **Peak** **Energy** **Transition** **(STPK)**\n\nportfolio weight **1.43%**\n\ngain/loss: **55.45%** **gain**\n\nStar peak is a brand new holding for me and already shot up like crazy. It’s one of these merger companies (the word is censored on this subreddit). merging with Stem energy storage. Stem is involved in the battery storage industry, with mostly grid level storage systems. They currently have an even larger market share than Tesla and my reason for holding this stock is mostly as a hedge against Tesla’s energy business. \n\n——————————-\n\n**Shopify** **(SHOP)**\n\nportfolio weight: **1.10%**\n\ngain/loss: **18.19%** **gain**\n\nShopify is an eCommerce platform, which allows customers to seamlessly design their own website and process payments. I’ve used Shopify in the past and am a big fan of the business, which is a big part of why I’m invested. They have a steep valuation but I plan on holding for 10+ years. \n\n—————————————\n\nTotal gain: **181.52%**\n\n(Note: I’ve taken some profits on a few of my stocks so the unrealized gain from my current holdings is less than my “total” gain by a few % points.)\n\n--------------------------\n\nYes, I’m young and idealistic and have a lot to learn but I do know a few things. Here’s some of the lessons I’ve learned along my 1 and a half year journey in the market. \n\n—————————————-\n\n\nBy investing in a company, you are supporting them financially. Buying pressure on companies’ stocks increases the price and allows them to raise capital more efficiently. It might be hard to hear, but **when** **you** **buy** **Exxon** **stock**, **you** **are** **helping** **them** **destroy** **our** **planet**. The same is true vice versa.  \n\n**Don’t** **listen** to** **anybody** **on** **reddit**. Seriously. Nobody here knows any better than you. Do your own research, form your own judgements. If you’re gonna pick individual stocks then following advice on reddit is not the way to go. Reading through investor relations pages is the best way to go. Watch videos and read articles about both sides of the story with different companies. Don’t take these videos as facts though, just absorb what other people think and judge the validity of the information for yourself. It’s important to **become** **an** **independent** **thinker**. This is a slow process but eventually you’ll get the hang of things.\n\n**Invest** **with** **a** **10+** **year** **timeline**. This is especially true if you’re young like myself. Don’t concern yourself with daily or even monthly swings in a stock. Ask yourself if the company will be worth substantially more in a decade. If not, then say, if so then buy and hold. Don’t try to time the market or swing trade. You’re just bringing on unnecessary risk. Buy and hold and buy some more. \n\n**Assess** **your** **own** **risk** **tolerance**. As I’m sure several people will point out, my portfolio is incredibly speculative and risky from a traditional viewpoint. I have a really fucking high risk tolerance, so I invest with a “riskier” mindset. If I were to lose all my money tomorrow, I’d be fine. I’m going to have a college degree in a couple years and I’m not worried about being able to find a job. My reason for investing is about having the financial freedom to do whatever I want in life, and not worry about money in the future. If you’re investing for retirement or to pay off student loans, then I recommend taking a more conservative approach and maybe buying some index funds. However, if you’re young and have a stomach for risk like myself, then go crazy.\n\n------------------------------------\n\nIn conclusion, I’ve had an incredible year or so in the market. I don’t expect to have even close to these same returns in the future, but I’ve learned a thing or two and I’m here to share this information. You may disagree with everything I said and all the stocks I own and that’s okay! Don’t copy my portfolio and take everything I say with a grain of salt, however I hope you find some wisdom from this post!",
        "subreddit": "stocks",
        "title": "My $112,000 climate change portfolio at the age of 19 &amp; what I've learned",
        "url": "https://www.reddit.com/r/stocks/comments/kjlbx7/my_112000_climate_change_portfolio_at_the_age_of/",
        "created": 1608867336.0
    },
    {
        "author": "actuallynotanyone",
        "created_utc": 1608480022,
        "id": "kgwf3j",
        "num_comments": 284,
        "num_crossposts": 0,
        "selftext": "I am looking into a few different stock tickers for 2021 and was wondering what you guys thought.\n\nI am currently looking at my major positions being in PLTR, NIO, INRG and MT.\n\nWas also looking at SQ, AMD and ENPH to diversify a bit more but was doing a bit of DD and didn't really see much room for improvements on any of those 3, have seen alot of people saying about SQ but wanted to see if anyone else had any thought on this?",
        "subreddit": "stocks",
        "title": "Stock picks for 2021",
        "url": "https://www.reddit.com/r/stocks/comments/kgwf3j/stock_picks_for_2021/",
        "created": 1608508822.0
    },
    {
        "author": "sammyp1999",
        "created_utc": 1608683915,
        "id": "kii55g",
        "num_comments": 154,
        "num_crossposts": 0,
        "selftext": "The solar industry, as soon as in the past month (not to mention this entire year), has absolutely been going to the moon. CSIQ has now had 3 consecutive days gaining 8%+, two of those days gaining 11%. SPWR finished at 12% today and doubled over the past 2 months. ENPH got the credit it deserved from big-name institutions and finished up 30% in the past week, again doubling in the past two months.\n\nThat's not to say that solar hasn't had a phenomenal year in general either. RUN, ENPH, SPWR, PLUG, etc. are all examples of companies that have seen 3, 4, 5, even 9x growth this year. What's more, many of them (SPWR, CSIQ) still have extremely stomache-able fundamentals. \n\nA large portion of this growth is under Trump, who was obviously not a proponent of green energy. I take this to mean that since solar can show astronomical growth in adversity, it could yield amazing growth under the right conditions. \n\nWhat solar stocks do you all think are holes-in-one? Why? Where do you think the industry is going in 2021? What upsides/downsides are people not talking about? If people invest now are they catching the tail-end of a fluke, or is this just the beginning?\n\nPersonally, I'm invested in CSIQ, ENPH, SPWR, and QCLN. They've all worked like magic in my portfolio. I'd like to hear what you guys are invested in with the green energy space.",
        "subreddit": "stocks",
        "title": "Solar stocks are going crazy. They deserve a discussion.",
        "url": "https://www.reddit.com/r/stocks/comments/kii55g/solar_stocks_are_going_crazy_they_deserve_a/",
        "created": 1608712715.0
    },
    {
        "author": "millerlit",
        "created_utc": 1608065605,
        "id": "kdu9e8",
        "num_comments": 89,
        "num_crossposts": 0,
        "selftext": "I thought it would be good to see what others are investing in to get new ideas.  Below are the stocks and etf's I am currently invested in.   Added BCDA yesterday based on their phase 3 feedback due on 12/17.\n\n\n\n* AAPL\n* AMD\n* AMRC\n* AMZN\n* ARRY\n* AZRE\n* BA\n* BCDA\n* BLNK\n* BRKS\n* BWEN\n* CBAT\n* CLSK\n* CRNC\n* CRSP\n* CRWD\n* DCBO\n* DDOG\n* DIS\n* DKNG\n* ENPH\n* ETSY\n* EXAS\n* FOUR\n* FSLR\n* FSLY\n* FTCH\n* GIK\n* HYLN\n* JMIA\n* LKYSF\n* LSPD\n* MA\n* MCRB\n* MITK\n* MMEDF\n* NET\n* NOVA\n* NSTG\n* NTLA\n* NVTA\n* NXE\n* PACB\n* PD\n* PENN\n* PINS\n* PLTR\n* PLUG\n* PRLB\n* PSNL\n* PSTG\n* QCOM\n* RDVT\n* RIOT\n* RUN\n* SBE\n* SEDG\n* SPCE\n* SPLK\n* SPWR\n* SQ\n* SUNW\n* THCB\n* TPIC\n* TSM\n* TTEC\n* TWST\n* UBER\n* UPWK\n* USAT\n* V\n* VCYT\n* VERI\n* VGT\n* VLDR\n* VUG\n* WK\n* XPEL\n* ZS",
        "subreddit": "stocks",
        "title": "What are you currently invested in",
        "url": "https://www.reddit.com/r/stocks/comments/kdu9e8/what_are_you_currently_invested_in/",
        "created": 1608094405.0
    },
    {
        "author": "GrapeJuicex",
        "created_utc": 1609368317,
        "id": "kncq59",
        "num_comments": 58,
        "num_crossposts": 0,
        "selftext": "S&amp;P Dow Jones Indices will make the following changes to the S&amp;P 500, S&amp;P MidCap 400, and S&amp;P SmallCap 600 effective prior to the opening of trading on Thursday, January 7:\n\n**S&amp;P MidCap 400 constituent Enphase Energy Inc. (NASDAQ: ENPH) will replace Tiffany &amp; Co (NYSE: TIF) in the S&amp;P 500**, S&amp;P SmallCap 600 constituent Capri Holdings Limited (NYSE: CPRI) will replace Enphase Energy in the S&amp;P MidCap 400, and Celsius Holdings Inc. (NASDAQ: CELH) will replace Capri Holdings in the S&amp;P SmallCap 600. LVMH Moet Hennessy-Louis Vuitton SE is acquiring Tiffany &amp; Co in a deal expected to be completed soon pending final conditions.\n\nS&amp;P SmallCap 600 constituent Brooks Automation Inc. (NASDAQ: BRKS) will replace WPX Energy Inc. (NYSE: WPX) in the S&amp;P MidCap 400 and e.l.f. Beauty Inc. (NYSE: ELF) will replace Brooks Automation in the S&amp;P SmallCap 600. S&amp;P 500 constituent Devon Energy Corp. (NYSE: DVN) is acquiring WPX Energy in a deal expected to be completed soon pending final conditions.",
        "subreddit": "stocks",
        "title": "Enphase Energy to Join S&amp;P 500",
        "url": "https://www.reddit.com/r/stocks/comments/kncq59/enphase_energy_to_join_sp_500/",
        "created": 1609397117.0
    },
    {
        "author": "Sham-Wow_1337",
        "created_utc": 1609368842,
        "id": "kncw5i",
        "num_comments": 55,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Enphase (ENPH) Set to Join S&amp;P 500",
        "url": "https://www.streetinsider.com/dr/news.php?id=17770097",
        "created": 1609397642.0
    },
    {
        "author": "Thetrader2896",
        "created_utc": 1606863614,
        "id": "k4weu3",
        "num_comments": 50,
        "num_crossposts": 0,
        "selftext": "Today my dumbass lost 4300 or 12% of my account, out of the 4300 was a zm gamble which was 1400. The rest was from my long calls like ENPH which been absolutely fucked the past 3 days, high was 148 on Friday morning and now 128... you guys should buy it is a leader. But back to course, I plan to sell everything jan 1 2021 to net taxes for April. This fucking market is too tight to make money it is just stupid. I expect a double dip recession and crash and maybe a financial crisis Starting mid to late January. Remember this post and screenshot it, I am now ringing the alarm bells!",
        "subreddit": "wallstreetbets",
        "title": "Anyone experience black Tuesday today?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k4weu3/anyone_experience_black_tuesday_today/",
        "created": 1606892414.0
    },
    {
        "author": "threefourpizza",
        "created_utc": 1608082986,
        "id": "kdzk23",
        "num_comments": 49,
        "num_crossposts": 0,
        "selftext": "It just keeps skyrocketing, is solar energy the next oil industry? Especially after who Biden picked for his cabnit. I’m seriously about to go all in on this solar etf + ENPH/other solar stock.\n\n\nThanks",
        "subreddit": "stocks",
        "title": "$TAN now the time to get in?",
        "url": "https://www.reddit.com/r/stocks/comments/kdzk23/tan_now_the_time_to_get_in/",
        "created": 1608111786.0
    },
    {
        "author": "milquero",
        "created_utc": 1608598365,
        "id": "khuh9f",
        "num_comments": 48,
        "num_crossposts": 0,
        "selftext": "Hello from Eastern Europe!\n\nA third of my portfolio is in the following 19 individual stocks, in the order of their weighting:\n\nSQ\nTTD\nCRWD\nROKU\nNET\nPLTR\nFVRR\nSE\nNIO\nPINS\nNVDA\nBABA\nDOCU\nJD\nPYPL\nASML\nHUBS\nZM\nTDOC\n\nIf you were to add *one* stock for solid growth in 2021, what would it be?\n\nI am oscillating between ADBE, BAND, BIDU, COUP, CRM, ETSY, STNE, as well as CSIQ/ENPH/TPIC.\n\nNote that the ETFs I've invested in already have significant holdings in AAPL and MSFT.\n\nThank you!",
        "subreddit": "stocks",
        "title": "Portfolio of 19 stocks. What should be my 20th?",
        "url": "https://www.reddit.com/r/stocks/comments/khuh9f/portfolio_of_19_stocks_what_should_be_my_20th/",
        "created": 1608627165.0
    },
    {
        "author": "badpauly",
        "created_utc": 1607638231,
        "id": "kap194",
        "num_comments": 45,
        "num_crossposts": 0,
        "selftext": "\nThis is a list of the top 20 companies that experienced the largest change in insider shares in the last seven (7) days.\nThe SEC defines an insider as any officer, director or 10% shareholder. It is not illegal for these people to buy or sell their own shares.\nIn fact, since most of them get paid in stock options, it is expected. However, it is illegal for them to trade on inside information\nthat has not been made public. So for example if there are drug trial results that are bad and not public,\ninsiders cannot dump shares. That said, many people have observed that insiders - in general - seem to have a good\ntrack record at timing their purchases.  All trades that are marked as part of a 10b5 plan are excluded from this report.\n\n## Largest Insider Buying (Last 7 Days)\nCompany|Count|Shares Changed|Avg. Price|Value Change\n--------|-----:|-----:|-----:|--------:  \n[SBTX / Silverback Therapeutics, Inc.](https://fintel.io/n/us/sbtx)|10|2,783,572|21|58,455,012 \n[RGLS / Regulus Therapeutics Inc.](https://fintel.io/n/us/rgls)|10|43,986,020|1|27,359,304 \n[PROG / Progress Residential 2018-SFR3 Trust 4.18](https://fintel.io/n/us/prog)|2|8,256,880|3|26,999,998 \n[MPLN / MultiPlan Corporation](https://fintel.io/n/us/mpln)|3|1,812,045|8|14,893,602  \n[ZMTP / Zoom Telephonics Inc.](https://fintel.io/n/us/zmtp)|2|3,602,606|2|8,465,404 \n[CAR / Avis Budget Group, Inc.](https://fintel.io/n/us/car)|2|117,758|39|4,577,612 \n[GIM / Templeton Global Income Fund](https://fintel.io/n/us/gim)|2|519,740|5|2,823,836 \n[SEER / Seer, Inc. Class A](https://fintel.io/n/us/seer)|1|78,947|19|1,499,993 \n[HCHC / HC2 Holdings, Inc.](https://fintel.io/n/us/hchc)|3|340,548|3|1,186,563 \n[DRTT / DIRTT Environmental Solutions Ltd.](https://fintel.io/n/us/drtt)|2|326,600|3|1,028,801 \n[CSV / Carriage Services, Inc.](https://fintel.io/n/us/csv)|1|29,000|30|870,580 \n[CURI / CuriosityStream Inc. Class A](https://fintel.io/n/us/curi)|3|78,000|9|701,220 \n[CNNE / Cannae Holdings, Inc.](https://fintel.io/n/us/cnne)|1|15,000|42|634,950 \n[VTA / Invesco Dynamic Credit Opportunities Fund](https://fintel.io/n/us/vta)|1|38,898|10|406,095 \n[USIO / Usio, Inc.](https://fintel.io/n/us/usio)|2|193,382|2|346,154 \n[BKI / Black Knight, Inc.](https://fintel.io/n/us/bki)|2|3,383|88|299,951 \n[FSLF / First Eagle Senior Loan Fund](https://fintel.io/n/us/fslf)|2|16,872|14|231,821 \n[DLTR / Dollar Tree, Inc.](https://fintel.io/n/us/dltr)|2|2,000|111|222,000 \n[HMHC / Houghton Mifflin Harcourt Company](https://fintel.io/n/us/hmhc)|1|52,622|3|178,394 \n[VBFC / Village Bank &amp;amp; Trust Financial Corp.](https://fintel.io/n/us/vbfc)|3|5,000|31|155,000 \n[ATCX / Atlas Technical Consultants, Inc. Class A](https://fintel.io/n/us/atcx)|1|20,000|7|141,600 \n[TCC / Trammell Crow Co.](https://fintel.io/n/us/tcc)|2|15,000|9|135,043 \n[BOXL / Boxlight Corporation](https://fintel.io/n/us/boxl)|3|85,000|2|134,900 \n[TESS / Tessco Technologies, Inc.](https://fintel.io/n/us/tess)|3|19,300|6|121,657 \n[MDLZ / Mondelez International, Inc.](https://fintel.io/n/us/mdlz)|1|2,000|58|116,840 \n[GBDC / Golub Capital BDC, Inc.](https://fintel.io/n/us/gbdc)|4|7,922|14|111,611 \n[VSTM / Verastem, Inc.](https://fintel.io/n/us/vstm)|1|50,000|2|108,500 \n[CODI / Compass Diversified Holdings](https://fintel.io/n/us/codi)|1|4,000|25|100,400 \n[GFF / Griffon Corp.](https://fintel.io/n/us/gff)|1|5,000|20|100,100 \n[UAL / United Continental Holdings, Inc.](https://fintel.io/n/us/ual)|1|1,900|49|93,091 \n[ARAV / Aravive, Inc.](https://fintel.io/n/us/arav)|2|16,000|6|92,240 \n[FLL / Full House Resorts, Inc.](https://fintel.io/n/us/fll)|1|20,000|4|74,200 \n[HRTH / HARTE HANKS INC](https://fintel.io/n/us/hrth)|7|24,000|2|59,728 \n[BZH / Beazer Homes USA, Inc.](https://fintel.io/n/us/bzh)|1|3,616|15|55,324 \n[CTHR / Charles &amp;amp; Colvard, Ltd.](https://fintel.io/n/us/cthr)|3|43,915|1|53,885 \n[DMAC / DiaMedica Therapeutics Inc.](https://fintel.io/n/us/dmac)|2|10,000|5|53,697 \n[ACFN / Acorn Energy, Inc.](https://fintel.io/n/us/acfn)|1|164,501|0|49,350 \n[MSVB / Mid-Southern Savings Bank, FSB (Salem, IN)](https://fintel.io/n/us/msvb)|2|3,042|14|43,751 \n[HEPA / Hepion Pharmaceuticals, Inc.](https://fintel.io/n/us/hepa)|1|25,000|2|39,418 \n\n## Largest Insider Selling (Last 7 Days)\nCompany|Count|Shares Change|Avg. Price|Value Change\n--------|-----:|-----:|-----:|--------:  \n[ZI / ZoomInfo Technologies Inc. Class A](https://fintel.io/n/us/zi)|52|-42,095,743|44|-1,846,934,929  \n[FOUR / Shift4 Payments](https://fintel.io/n/us/four)|1|-9,200,000|54|-495,282,000  \n[AQUA / Evoqua Water Technologies Corp.](https://fintel.io/n/us/aqua)|2|-16,615,382|25|-413,723,012 \n[OM / Outset Medical, Inc.](https://fintel.io/n/us/om)|4|-7,372,450|50|-371,202,858 \n[BGNE / BeiGene, Ltd.](https://fintel.io/n/us/bgne)|2|-1,511,546|220|-333,295,893 \n[OSH / OSHKOSH WIS GO REF BDS 2016 H](https://fintel.io/n/us/osh)|5|-1,574,250|46|-72,415,500 \n[LYB / LyondellBasell Industries NV](https://fintel.io/n/us/lyb)|4|-518,691|89|-45,948,398 \n[PVH / PVH Corp. ](https://fintel.io/n/us/pvh)|13|-427,105|90|-38,575,023 \n[CRSP / CRISPR Therapeutics AG](https://fintel.io/n/us/crsp)|19|-171,004|154|-26,424,505 \n[CRWD / CrowdStrike Holdings, Inc. Class A](https://fintel.io/n/us/crwd)|3|-155,000|168|-26,073,400 \n[FCX / Freeport-McMoRan Inc.](https://fintel.io/n/us/fcx)|2|-952,887|25|-24,032,612 \n[NARI / Inari Medical, Inc.](https://fintel.io/n/us/nari)|6|-269,322|66|-17,766,228 \n[TFFP / TFF Pharmaceuticals, Inc.](https://fintel.io/n/us/tffp)|4|-1,075,000|14|-14,943,000 \n[DEN / Denbury Inc.](https://fintel.io/n/us/den)|5|-586,477|25|-14,407,183 \n[VAR / Varian Medical Systems, Inc.](https://fintel.io/n/us/var)|1|-82,500|174|-14,383,974 \n[AVTR / Avantor, Inc.](https://fintel.io/n/us/avtr)|2|-510,640|27|-13,864,558 \n[SEDG / SolarEdge Technologies, Inc.](https://fintel.io/n/us/sedg)|15|-42,619|276|-11,813,152 \n[BLL / Ball Corp.](https://fintel.io/n/us/bll)|5|-124,062|94|-11,722,732 \n[SNPS / Synopsys, Inc.](https://fintel.io/n/us/snps)|1|-47,299|237|-11,227,217 \n[MTOR / Meritor, Inc.](https://fintel.io/n/us/mtor)|2|-400,000|28|-11,165,448 \n[SCCO / Southern Copper Corp.](https://fintel.io/n/us/scco)|1|-176,195|61|-10,749,657 \n[QSR / Restaurant Brands International Inc.](https://fintel.io/n/us/qsr)|1|-149,793|60|-8,959,119 \n[FIVE / Five Below, Inc.](https://fintel.io/n/us/five)|4|-48,461|162|-7,820,109 \n[TWST / Twist Bioscience Corp](https://fintel.io/n/us/twst)|2|-75,000|103|-7,755,000 \n[SKX / Skechers U.S.A. Inc.](https://fintel.io/n/us/skx)|2|-200,000|37|-7,426,768 \n[PLNT / Planet Fitness, Inc.](https://fintel.io/n/us/plnt)|2|-100,000|74|-7,405,492 \n[TTEK / Tetra Tech, Inc.](https://fintel.io/n/us/ttek)|4|-71,468|98|-7,281,534 \n[GIX / GigCapital2, Inc.](https://fintel.io/n/us/gix)|4|-593,551|11|-6,710,173 \n[NEO / NeoGenomics, Inc.](https://fintel.io/n/us/neo)|3|-134,735|48|-6,535,030 \n[ENPH / Enphase Energy, Inc.](https://fintel.io/n/us/enph)|2|-50,000|130|-6,514,790 \n[TEN / Tenneco, Inc.](https://fintel.io/n/us/ten)|2|-588,968|11|-6,473,035 \n[Z / Zillow Group, Inc. Class C](https://fintel.io/n/us/z)|2|-57,500|110|-6,329,710 \n[MSA / MSA Safety Inc.](https://fintel.io/n/us/msa)|5|-38,233|152|-5,790,731 \n[SMTC / Semtech Corp.](https://fintel.io/n/us/smtc)|6|-80,144|71|-5,655,853 \n[LAD / Lithia Motors, Inc.](https://fintel.io/n/us/lad)|10|-18,403|294|-5,387,224 \n[HUBS / HubSpot, Inc.](https://fintel.io/n/us/hubs)|4|-11,500|390|-4,484,468  \n[ECL / Ecolab, Inc.](https://fintel.io/n/us/ecl)|5|-18,445|224|-4,131,885 \n[WEN / The Wendy&amp;#x27;s Company ](https://fintel.io/n/us/wen)|1|-184,823|22|-4,064,184\n\n*Count* column is number of transactions.\n\nSource: [Fintel.io/insiders](https://fintel.io/insiders)",
        "subreddit": "StockMarket",
        "title": "Significant Insider Trading Activity (Last 7 Days)",
        "url": "https://www.reddit.com/r/StockMarket/comments/kap194/significant_insider_trading_activity_last_7_days/",
        "created": 1607667031.0
    },
    {
        "author": "crownmethesheep",
        "created_utc": 1608207311,
        "id": "kewdp9",
        "num_comments": 43,
        "num_crossposts": 0,
        "selftext": "Deals are popping up left and right to close out the year as liquidation deadlines approaches. With Biden confirmed as POTUS, i am focusing on Green energy/infrastructure plays. Here are a few:\n\nRICE\n\nEnergy transition / Sustainability\nDaniel Rice, IV (Fmr CEO, Rice Energy), James Torgerson (Fmr CEO, Avangrid)\n\nhttps://ricespac.com/\n\nhttps://www.sec.gov/Archives/edgar/data/1823766/000121390020033072/f424b4_riceacquisition.htm\n\nBOAC (set to split shortly)\n\nEnergy, Industrials\nC. John Wilder (Former CEO, Shell Capital; Former CEO, TXU Corp), Duncan Palmer (CFO, Cushman &amp; Wakefield)\n\nhttps://www.bluescapegroup.com/index.html\n\nhttps://sec.report/Document/0001104659-20-119558/tm2025064-16_424b4.htm\n\nFar out: RSVA\n\nRodgers Silicon Valley SPAC: T. J. Rodgers (Co-founder/Fmr CEO, Cypress Semiconductor), Emmanuel Hernandez (Director, ON Semiconductor)\n\nT.J. Rodgers is a trailblazer in this space, famously known for saving ENPH. This was just released as units, so split will take some time.",
        "subreddit": "SPACs",
        "title": "SPACs at NAV, it's a beautiful thing",
        "url": "https://www.reddit.com/r/SPACs/comments/kewdp9/spacs_at_nav_its_a_beautiful_thing/",
        "created": 1608236111.0
    },
    {
        "author": "Tiny_Rick_C137",
        "created_utc": 1609424619,
        "id": "knqtqa",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "$2 to $176 in two years, I'm amazed I don't hear shit about it here. ENPH likely to see a bump from getting added to S&amp;P500, they're going to see a huge bump from solar tax credit extension that was just approved, and they're rolling out a new energy storage inverter line. All the while, they've shown all signs that they will continue to exceed guidance.\n\n$420 end of 2021.\n\nEdit: Reposted since a mod asked me to.",
        "subreddit": "wallstreetbets",
        "title": "ENPH to the moon - rocket emoji rocket emoji go fuck yourself emoji",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/knqtqa/enph_to_the_moon_rocket_emoji_rocket_emoji_go/",
        "created": 1609453419.0
    },
    {
        "author": "Arrow222",
        "created_utc": 1608564887,
        "id": "khjn5a",
        "num_comments": 35,
        "num_crossposts": 0,
        "selftext": "Hey guys,\n\nGreeks and new columns, like Annualized Yield on Collateral was added to [FDscanner](https://app.fdscanner.com/) over the weekend.\n\nWith the new tools, it became much easier to search for the optimal short puts.\n\nHere's a scan for Jan 2021 with the following settings\n\n- Expiry: 15 Jan 2021\n- Option Type: Puts only\n- Delta: Under 0.3\n- Theta Annual %: Above 100%\n\nTheta Annual % columns means the yield on collateral on cash secured puts. For calls, it's yield on collateral on the share price * 100, since the collateral is 100 shares.\n\nHere's the first 20 options that passed the filters.\n\n\n|No.|Ticker|Type|Strike|Share Price|Last|Delta|Theta|Theta Annual %|% OTM|IV|\n:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|\n|1|[CVM](https://member.fdscanner.com/ticker/CVM)|Put|$7.5|$13.1|$0.9|-0.1352|-0.0424|206.35%|42.75%|277.92%|\n|2|[CVM](https://member.fdscanner.com/ticker/CVM)|Put|$10|$13.1|$1.7|-0.236|-0.0526|191.99%|23.66%|238.77%|\n|3|[CURO](https://member.fdscanner.com/ticker/CURO)|Put|$12.5|$16.51|$0.95|-0.1987|-0.0391|114.17%|24.29%|2%|\n|4|[CVM](https://member.fdscanner.com/ticker/CVM)|Put|$5|$13.1|$0.42|-0.0639|-0.0283|206.59%|61.83%|326.37%|\n|5|[RIG](https://member.fdscanner.com/ticker/RIG)|Put|$2|$2.48|$0.14|-0.2258|-0.0056|102.2%|19.35%|145.78%|\n|6|[FCEL](https://member.fdscanner.com/ticker/FCEL)|Put|$8|$9.45|$0.77|-0.2676|-0.0244|111.33%|15.34%|150.44%|\n|7|[QS](https://member.fdscanner.com/ticker/QS)|Put|$40|$79.75|$1.9|-0.0823|-0.1586|144.72%|49.84%|197.33%|\n|8|[RMG](https://member.fdscanner.com/ticker/RMG)|Put|$17.5|$21.91|$1.85|-0.2316|-0.0532|110.96%|20.13%|2%|\n|9|[PIC](https://member.fdscanner.com/ticker/PIC)|Put|$15|$18.4|$1.49|-0.2466|-0.0498|121.18%|18.48%|159.39%|\n|10|[IPOB](https://member.fdscanner.com/ticker/IPOB)|Put|$25|$29.49|$2.2|-0.2706|-0.0724|105.7%|15.23%|137.16%|\n|11|[QS](https://member.fdscanner.com/ticker/QS)|Put|$60|$79.75|$9.69|-0.2584|-0.3742|227.64%|24.76%|203.46%|\n|12|[HCAC](https://member.fdscanner.com/ticker/HCAC)|Put|$15|$20|$1.3|-0.2014|-0.0518|126.05%|25%|169.94%|\n|13|[QS](https://member.fdscanner.com/ticker/QS)|Put|$35|$79.75|$1.2|-0.0513|-0.1084|113.05%|56.11%|198.94%|\n|14|[BTU](https://member.fdscanner.com/ticker/BTU)|Put|$1|$2.1|$0.1|-0.0825|-0.0043|156.95%|52.38%|262.37%|\n|15|[QS](https://member.fdscanner.com/ticker/QS)|Put|$45|$79.75|$3.15|-0.1191|-0.2084|169.04%|43.57%|193.85%|\n|16|[QS](https://member.fdscanner.com/ticker/QS)|Put|$55|$79.75|$7.05|-0.2114|-0.3254|215.95%|31.03%|201.01%|\n|17|[SOL](https://member.fdscanner.com/ticker/SOL)|Put|$5|$8.21|$0.25|-0.1131|-0.0146|106.58%|39.1%|2%|\n|18|[QS](https://member.fdscanner.com/ticker/QS)|Put|$50|$79.75|$4.9|-0.1623|-0.2639|192.65%|37.3%|194.59%|\n|19|[RIOT](https://member.fdscanner.com/ticker/RIOT)|Put|$9|$10.38|$1.35|-0.2971|-0.0365|148.03%|13.29%|195.16%|\n|20|[RIOT](https://member.fdscanner.com/ticker/RIOT)|Put|$7|$10.38|$0.48|-0.1485|-0.0234|122.01%|32.56%|187.6%|\n\n\nImage: https://imgur.com/a/x2Cq5pk\n\nIf these companies are too volatile, I suggest layering a company profitability requirement\n\n- Expiry: 15 Jan 2021\n- Puts Only\n- Option Type: Puts only\n- Delta: Under 0.3\n- Theta Annual %: Above 100%\n\n\nHere's the top 20 that passed the list \n\n|No.|Ticker|Type|Strike|Share Price|Last|Delta|Theta|Theta Annual %|Theta Daily %|% OTM|IV|\n:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|\n|1|[HL](https://fdscanner.com/ticker/HL)|Put|$5.5|$6.1|$0.17|-0.2525|-0.0066|43.8%|0.12%|9.84%|64.98%|\n|2|[DQ](https://fdscanner.com/ticker/DQ)|Put|$45|$56.98|$1|-0.1278|-0.0538|43.64%|0.12%|21.02%|87.75%|\n|3|[CLR](https://fdscanner.com/ticker/CLR)|Put|$15|$16.81|$0.7|-0.2713|-0.0246|59.86%|0.164%|10.77%|85.98%|\n|4|[TRGP](https://fdscanner.com/ticker/TRGP)|Put|$22|$27|$0.4|-0.1195|-0.0195|32.35%|0.089%|18.52%|70.58%|\n|5|[TRGP](https://fdscanner.com/ticker/TRGP)|Put|$24|$27|$0.67|-0.2219|-0.0267|40.61%|0.111%|11.11%|64.78%|\n|6|[WFC](https://fdscanner.com/ticker/WFC)|Put|$27.5|$29.81|$0.55|-0.2382|-0.0227|30.13%|0.083%|7.75%|47.28%|\n|7|[CURO](https://fdscanner.com/ticker/CURO)|Put|$10|$16.51|$0.4|-0.0976|-0.0263|96%|0.263%|39.43%|2%|\n|8|[CURO](https://fdscanner.com/ticker/CURO)|Put|$12.5|$16.51|$0.95|-0.1987|-0.0391|114.17%|0.313%|24.29%|2%|\n|9|[YETI](https://fdscanner.com/ticker/YETI)|Put|$65|$72.36|$1.52|-0.2192|-0.0609|34.2%|0.094%|10.17%|56.56%|\n|10|[ET](https://fdscanner.com/ticker/ET)|Put|$6|$6.61|$0.11|-0.2169|-0.0052|31.63%|0.087%|9.23%|51.94%|\n|11|[CCS](https://fdscanner.com/ticker/CCS)|Put|$40|$47.57|$0.6|-0.1432|-0.0373|34.04%|0.093%|15.91%|66.58%|\n|12|[VLO](https://fdscanner.com/ticker/VLO)|Put|$50|$54.77|$1.18|-0.2413|-0.0478|34.89%|0.096%|8.71%|54.6%|\n|13|[NLS](https://fdscanner.com/ticker/NLS)|Put|$15|$18.71|$0.49|-0.1637|-0.023|55.97%|0.153%|19.83%|97.08%|\n|14|[TSLA](https://fdscanner.com/ticker/TSLA)|Put|$500|$652.22|$8.39|-0.1039|-0.5417|39.54%|0.108%|23.34%|88.4%|\n|15|[CURO](https://fdscanner.com/ticker/CURO)|Put|$5|$16.51|$0.1|-0.0219|-0.0121|88.33%|0.242%|69.72%|2%|\n|16|[GE](https://fdscanner.com/ticker/GE)|Put|$10|$10.58|$0.26|-0.2951|-0.0086|31.39%|0.086%|5.48%|45.14%|\n|17|[PSX](https://fdscanner.com/ticker/PSX)|Put|$62.5|$66.88|$1.7|-0.2809|-0.0572|33.4%|0.092%|6.55%|49.46%|\n|18|[UFS](https://fdscanner.com/ticker/UFS)|Put|$30|$32.19|$0.7|-0.2795|-0.0286|34.8%|0.095%|6.8%|51.57%|\n|19|[WES](https://fdscanner.com/ticker/WES)|Put|$13|$14.36|$0.4|-0.2542|-0.0158|44.36%|0.122%|9.47%|66.09%|\n|20|[ENPH](https://fdscanner.com/ticker/ENPH)|Put|$135|$164.62|$3|-0.1503|-0.156|42.18%|0.116%|17.99%|2%|",
        "subreddit": "options",
        "title": "List of Short Puts with over 100% Annualized Yield",
        "url": "https://www.reddit.com/r/options/comments/khjn5a/list_of_short_puts_with_over_100_annualized_yield/",
        "created": 1608593687.0
    },
    {
        "author": "scatterblooded",
        "created_utc": 1608752121,
        "id": "kizmqf",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "The clean energy sector has been heating up lately, with some companies up as much as 500% in the past few months. The ETF TAN has tripled over the past 6 months. I've been looking to start a new position in a clean energy sector, but having trouble with such high valuations on most of them. Companies like SEDG, ENPH, RUN, FSLR, most EV stocks are at prices hardly worth considering.\n\nI feel a bit better about CSIQ, MAXN, maybe SPWR, but I'm wondering if there's anything else worth considering despite current prices. I don't mind paying a relatively small premium so long as the company stands to grow a lot over the next 4 years, but looking for suggestions. Thanks in advance.",
        "subreddit": "ValueInvesting",
        "title": "Looking for renewable / clean energy stocks at a fair valuation: any recommendations?",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/kizmqf/looking_for_renewable_clean_energy_stocks_at_a/",
        "created": 1608780921.0
    },
    {
        "author": "sbayz92",
        "created_utc": 1608747132,
        "id": "kiy36g",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "I know there have been a lot of posts regarding this topic, but I am hoping this thread will catch a bit more traction.\n\nI am currently invested in ICLN and PBW. They have been great investments thus far, and I have confidence in both of them long term.\n\nI have a lot of my money I need to invest still, but I have been dollar cost averaging so I don't throw everything in all at once. \n\nAlthough it is certainly riskier picking 1 or 2 individual stock(s), I do want to invest, for the potential greater gains. \n\nI have been looking at RUN, NEE, ENPH, BEP, and SEDG but am open to other considerations. \n\nFor those of you who are invested in either of these or have other suggestions, I would really love to hear what you have to say, along with an explanation/info to back up your investment.\n\nThank you! Renewables to the moon   [🚀](https://emojipedia.org/rocket/)",
        "subreddit": "stocks",
        "title": "Renewable Energy stocks to buy in right now?",
        "url": "https://www.reddit.com/r/stocks/comments/kiy36g/renewable_energy_stocks_to_buy_in_right_now/",
        "created": 1608775932.0
    },
    {
        "author": "VeryOutsider",
        "created_utc": 1608745567,
        "id": "kixl5o",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "[https://www.barrons.com/articles/the-12-most-overvalued-stocks-in-america-yes-tesla-is-one-51608742949?mod=hp\\_LEAD\\_1](https://www.barrons.com/articles/the-12-most-overvalued-stocks-in-america-yes-tesla-is-one-51608742949?mod=hp_LEAD_1)\n\n&gt;The dozen most overvalued stocks are: SunPower, Editas Medicine (EDIT), Redfin (RDFN), Tesla, Stitch Fix (SFIX), Ultragenyx Pharmaceutical ( [RARE](https://qr.fidelity.com/embeddedquotes/redirect/research?symbol=RARE) ) , United States Steel (X), Denali Therapeutics (DNLI), Intellia Therapeutics (NTLA), Cree (CREE), Enphase Energy (ENPH), and Livent (LTHM).\n\nPersonally, I have been listening to people tell me TSLA is overvalued for almost 11 years now, and screw them, I'm not gonna any of it sell till I need the money for my cyber truck.",
        "subreddit": "stocks",
        "title": "Barron's list of 12 most overvalued stocks",
        "url": "https://www.reddit.com/r/stocks/comments/kixl5o/barrons_list_of_12_most_overvalued_stocks/",
        "created": 1608774367.0
    },
    {
        "author": "ThrowRAGlados",
        "created_utc": 1609366502,
        "id": "knc5ji",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "I was curious on how many holdings this community would consider too much, or if anyone has a target number. Far anyone curious, my portfolio consists of even proportions of companies trading above the EMA in my watchlist. They are as following:\n\nCERS\nZNGA\nSGMO\nIOVA\nENPH\nTGTX\nMYOV\nDAC\nPUMP\nPLAY\nROKU\nCHGG\nICLN\nBLDP\nKOD\nPLUG\nJKS\nNIO\nNET\nQCLN\nTAN\nTSM\nPLTR\nAPOG\nMAXN\nDIS\nAMD\nGME\nLMND\nJD\nHUBS\nFCEL\nCRSR\nCOUP\nCRWD\nOKTA\nADSK\nTSLA\nSHOP\n\nAre there any of these you would be nervous holding? Anything you would want to add?",
        "subreddit": "investing",
        "title": "How many holdings would you say are too many?/which of mine would you get rid of?",
        "url": "https://www.reddit.com/r/investing/comments/knc5ji/how_many_holdings_would_you_say_are_too_manywhich/",
        "created": 1609395302.0
    },
    {
        "author": "ptrader99",
        "created_utc": 1608820508,
        "id": "kjge88",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "First Solar (FSLR) will continue to rip into the foreseeable future and is the best short-term option play for solar energy. \n\n&amp;#x200B;\n\n**Macro Backdrop**\n\nThe Federal Reserve's accommodative interest rate policy and massive QE programs have fueled investor appetite for long duration cash flows. Corresponding speculative activity is already seen in several parts of the market. The EV space is probably the best example of this today, and many of its first derivatives have had absurd runs this year. Blink Charging and QuantumScape come to mind. \n\nIt seems that multiple expansion in the EV space has already begun to decelerate, and I expect it to continue while first/second derivative companies that rely similarly on long duration cash flows to thrive. Solar energy is a second derivative of a sort for EVs and itself has an incredibly large TAM. \n\n**Political Backdrop**\n\nIt's no secret that the Biden administration has emphasized renewable energy, and investors have noticed with solar etf TAN up nearly 3x YTD. There are wide ranging beliefs on how exactly the new administration will invest in renewables, but at the moment ignorance is bliss for investors (and autists like me who refuse to buy calls more than a month out). As long as Powell continues serving his QE party juice and the Biden administration focuses on renewables, I think the solar parties on until Biden's inauguration or until he takes a hard policy stance upon which investors might sell the news. \n\n**Undervalued Compared to Peers**\n\n**F****SLR Forward P/E - 30x**\n\nRun Forward P/E - 135.82x\n\nENPH Forward P/E - 99x\n\nSEDG Forward P/E - 72x\n\nSPWR Forward P/E - 71x\n\n**Relatively Low Implied Vol = Cheap Calls = Big Tendies**\n\nATM 1/15 FSLR implied vol is 55% vs. SPWR (96%), ENPH (72%), JKS (110%). If the entire solar sector is going to rally up to Biden's inauguration, cheap FSLR calls would pay bigly.\n\n**Final Thoughts**\n\nI'm not a huge believer in technical analysis, but FSLR just broke out of a near decade-long trading range. Reaching Obama-era levels of speculation at $290/share would be a lot, but given its relative valuation, First Solar has a lot of catching up to do. With extreme macro/political tailwinds, First Solar will outshine its peers in an already hot sector.\n\n**TLDR:** Buy FSLR calls because of political and macro tailwinds and relative valuation.\n\nPositions: FSLR 1/15 120c, FSLR 1/15 130c",
        "subreddit": "wallstreetbets",
        "title": "FSLR will Outshine its Peers into 2021",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kjge88/fslr_will_outshine_its_peers_into_2021/",
        "created": 1608849308.0
    },
    {
        "author": "Thetrader2896",
        "created_utc": 1607278022,
        "id": "k7ynek",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "I am done day trading and or loading up on options. I went from 7k to 30k. I do have options tho but only in ENPH and it is feb 125, two may 95s( definitely not selling those) and jan 2022 125. I want to cut my feb one for this reason. To buy SPCE shares, I do have 200 shares of pltr, should I sell 100 of those to buy 100 shares of spce to long both? Or move some money around and keep pltr at 200 shares..... I do think both companies are great, I start a fulltime job tmrw! Not worried about taxes this year income is under 40k. So I am just leveraging myself in this crazy market. I started with 12k went to 7k in June had all my money tied into one stock(never again lol) now at 30k. And I never deposited a single dollar the whole time. Ill definitely use this fulltime job to pay down debt and load up on spce.",
        "subreddit": "stocks",
        "title": "Spce or pltr long",
        "url": "https://www.reddit.com/r/stocks/comments/k7ynek/spce_or_pltr_long/",
        "created": 1607306822.0
    },
    {
        "author": "Tiny_Rick_C137",
        "created_utc": 1609389623,
        "id": "knj1ly",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "$2 to $176 in two years, I'm amazed I don't hear shit about it here. ENPH likely to see a bump from getting added to S&amp;P500, they're going to see a huge bump from solar tax credit extension that was just approved, and they're rolling out a new energy storage inverter line. All the while, they've shown all signs that they will continue to exceed guidance.\n\n$420 end of 2021.",
        "subreddit": "wallstreetbets",
        "title": "ENPH to the moon.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/knj1ly/enph_to_the_moon/",
        "created": 1609418423.0
    },
    {
        "author": "Yeasayer88",
        "created_utc": 1608141812,
        "id": "kee9hd",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "“Enphase designs and manufactures software-driven home energy solutions that span solar generation, home energy storage and web-based monitoring and control.”\n\nEnphase Energy has been exploding over the past several months due to Biden winning the election and several new micro inverter deals with countries across the globe. The stock currently trades at a P/E ratio of 109:1 but continues to rise each week.\n\nWhere do you see this stock going over the next year?",
        "subreddit": "stocks",
        "title": "ENPH - the future of solar power?",
        "url": "https://www.reddit.com/r/stocks/comments/kee9hd/enph_the_future_of_solar_power/",
        "created": 1608170612.0
    },
    {
        "author": "Sablja96",
        "created_utc": 1609274729,
        "id": "kmmk06",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "Hi everyone I joined stock market back in March during crash. Perfect timing someone would say, but I am a long term investor and I agree time in market is more important than timing the market. I would like to hear opinion what is over diversified portfolio. I have around 4000$ invested in market in time span from March to December. I currently own full or partial shares in 38 stocks. I red that 10 - 20 is enough to diversify, everything above that you can buy ETF to match performance. \n\nHere is dissection of my portfolio.\n\nRegional Diversification\n\n* US market 78,1%\n* China 20,5%\n* Asia 1,4%\n\nBlue Chip Stocks 60%, Growth Stocks 40%\n\nSector Diversification\n\n* Consumer Discretionary 29,18% (AMZN, BABA, ETSY, JD, LOW, MCD, NIO, NIU, TSLA)\n* Tech 28,88% (AAPL, ADBE, AMD, DBX, ENPH, MSFT, NVDA, SEDG, SHOP, SQ, XI)\n* Communications 19,26% (DIS, FB, FVRR, GOOG, NFLX, PINS, SE, Tencent, ZM)\n* Finance 11% (LMND, V, MA, PYPL)\n* Consumer Staples 5,06% (BYND, KO)\n* Real Estate 3,39% (O)\n* Healthcare 3,23% (ABBV, JNJ)\n\nIndustry Diversification\n\n* Internet Retail 16,37%\n* Internet Content&amp;Information 13,76%\n* Software-Infrastructure 13,40%\n* Credit Services 9,63%\n* Auto Manufacturer 9,63%\n* Semiconductors 5,50%\n* Consumer Electronics 4,48%\n* Solar 4,13%\n* REIT-retail 3,39%\n* Drug Manufacturers-General 3,23%\n* Entertainment 2,75%\n* Packaged Food 2,75%\n* Beverages 2,31%\n* Home Improvement Retail 1,80%\n* Restaurants 1,38%\n* Software-App 1,38%\n* Insurance 1,38%\n* Electronic Gaming&amp;Multimedia 1,38%\n* Telecom Services 1,38%\n\nAs you can see my portolio is a balanced mix between Dividend/Growth Blue chip stocks and growth stocks with big upside potential. Am I going to eat my potential gains if I have 38 stocks that I have listed above in my portfolio? My biggest holding is Alibaba (250$) and smallest holding is 50$, I aim to beat major indices (S&amp;P and NASDAQ). Will I be able to do it and do you have any advices? I dont plan to hold each stock in my portfolio for same time span, but I plan to hold some like APPLE and DIS for 5+years....",
        "subreddit": "stocks",
        "title": "What is over diverstified portfolio?",
        "url": "https://www.reddit.com/r/stocks/comments/kmmk06/what_is_over_diverstified_portfolio/",
        "created": 1609303529.0
    },
    {
        "author": "Dangula369",
        "created_utc": 1609215960,
        "id": "km70ir",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "Which Solar powered company do you traders believe has the best position to dominate the market in the upcoming years?\n\nHere is a list of chosen few Solar Power companies, feel free to mention add others:\n\nJinkoSolar Holding Co.\nClearway Energy Inc.\nDaqo New Energy Corp.\nEnphase Energy Inc.\nFirst Solar Inc.\nNextEra Energy Partners LP.\nSunrun Inc.\nSolarEdge Technologies Inc.",
        "subreddit": "stocks",
        "title": "A compilation of Solar Power Companies, which has the best position for 2021 and beyond",
        "url": "https://www.reddit.com/r/stocks/comments/km70ir/a_compilation_of_solar_power_companies_which_has/",
        "created": 1609244760.0
    },
    {
        "author": "shipping_addict",
        "created_utc": 1608609680,
        "id": "khxmi5",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Hi there everyone! So I'm 23 and I've been lurking on here for over a year now and it wasn't till this year that I actually made a profit. I recently opened another brokerage account and that'll be the account where I hold everything for 10+ years and in the past 2 years I've learned quite a bit just going with the stock market.\n\nI'd like some thoughts/advice on the stocks I'm currently holding, most of these stocks I'll be moving to my new brokerage account. \n\nMy plan for 2021 is to continue putting money into stocks I already own and after some time get rid of whatever few stocks that aren't doing too well, or just holding them. I also plan to invest in a few more ETF's but since they're a bit pricey rn I'm not sure which ones to invest in.\n\nOriginal Brokerage Account:\n\nDIS (1) +$56.17\n\nNFLX (1) +$188.62\n\nHON (1) +$42.40\n\nAAPL (7) +$257.88\n\nMSFT (1) +$31.99\n\nCOST (1) +$54.20\n\nAMZN ($589 partial share) +86.55\n\nCTAS (1) +$116.02\n\nGOOG (partial share) +$20.06\n\nFDX ($46 partial share) +$4.61\n\nBLFS (10) +$104.69\n\nVLRS (10) +$12.93\n\nGDRX (4) -$14.32\n\nDGX (1) -$1.59\n\nSGC (4) -$11.64\n\nQCLN (3) +$35.37\n\nPAYX (1) +$4.89\n\nHD (1) -$5.88\n\nLOW (1) +$2.81\n\nBJ (2) -$6.82\n\nSCHN (3) +$16.53\n\nADP (1) +$2.85\n\nAGI (free)\n\nZNGA (free)\n\nSWN (free)\n\n\nNew Brokerage Account:\n\nAAPL (1) +$4.19\n\nABBV (2) +$7.80\n\nALB (1) +$8.07\n\nAMZN ($127 partial share) +2.52\n\nBEP (1) +$0.14\n\nENPH (2) +$105.56\n\nMMEDF (84) +$8.40\n\nNIO (10) +$30.02\n\nNTDOY (3) +$24.14\n\nPLTR (4) -$3.05\n\nSOL (25) +$111.00\n\nSQ (1) +$28.26\n\nWM (1) -$0.71\n\nWMT ($122 partial share) -2.87\n\nETF's:\n\nICLN (8) +$36.00\n\nKGRN (5) +27.10\n\nROBO (1) +3.33\n\nSBIO (2) +7.78\n\nTAN (2) +50.84",
        "subreddit": "stocks",
        "title": "Portfolio advice?",
        "url": "https://www.reddit.com/r/stocks/comments/khxmi5/portfolio_advice/",
        "created": 1608638480.0
    },
    {
        "author": "sw1sh",
        "created_utc": 1609438066,
        "id": "knuvvy",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "ENPH joining the S&amp;P 500 from Jan 7th",
        "url": "https://www.thestreet.com/investing/enphase-to-join-sandp-500?puc=yahoo&amp;cm_ven=YAHOO&amp;yptr=yahoo",
        "created": 1609466866.0
    },
    {
        "author": "Calm-Dealer-4971",
        "created_utc": 1608200405,
        "id": "keuxmi",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Relatively new in terms of investing in stocks and looking to diversify with green energy stocks going into 2021. I can see that a fair few known names (such as ENPH) have already had a great run in 2020 so was wondering if you guys recommend diving into any going into the new year for the mid to long term hold. \n\nThank you.",
        "subreddit": "stocks",
        "title": "Green energy stocks for 2021",
        "url": "https://www.reddit.com/r/stocks/comments/keuxmi/green_energy_stocks_for_2021/",
        "created": 1608229205.0
    },
    {
        "author": "mightyduck19",
        "created_utc": 1609307261,
        "id": "kmw874",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Let's do a little thought exercise/game. Take a look at the chart pictured below and try to guess what company this is. I'll leave the answer and some thoughts in the comments....\n\n[https://imgur.com/ScVwDIl](https://imgur.com/ScVwDIl)\n\nMy intention in doing this is as follows: I have been seeing a TON of posts recently in various subs where new investors are looking for advice on what stocks to buy. Generally it goes something like this \"just inherited 20k and wondering what good growth companies to look at for the long term. Currently looking at TAN, TSLA, ARKG, ENPH, APHA, NVDA, JMIA, PLTR, \\*insert whatever high-flyer\\*, etc.\" \n\nIt just feels like there is a lot of blind chasing going on right now and this is just a reminder to folks to BE PATIENT. And really internalize what that actually means and what it would feel like to sit on your hands for 2 years waiting for something to come back to levels you like.",
        "subreddit": "investing",
        "title": "Guess the chart",
        "url": "https://www.reddit.com/r/investing/comments/kmw874/guess_the_chart/",
        "created": 1609336061.0
    },
    {
        "author": "romanedibrain",
        "created_utc": 1608220769,
        "id": "kf015n",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Was planning on making a portfolio of the 70% allocation to the top 10-15 better preforming S&amp;P 500 companies that still have a 10%+ growth potential within a year and 30 percent allocation to 3 to 5 riskier stocks with a 25%+ growth potential, I have mediocre experience in U.S stocks, any advice. \n\nI was recommended these before post was removed.\n\n*\\**\n\n***Safe****: MSFT, APPL. AMZN, GOOG, MA, V, FB, ADBE + ETFS*\n\n***Low Risk****: DIS, SNE, SE, BABA, NET, ENPH, SEDG, RTX, AMD, SQ, LULU, JD*\n\n***Moderate-High Risk****: SPCE, U, BB, NIO, PLTR, JMIA, LMND, DKNG, DAL, LUV, BA*\n\n***AUTISTIC:*** *MMEDF, Pennystocks, shixty weed stocks*\n\n*\\**\n\n *Just buy an Index fund and allocate just a small % of your portfolio for stock picking. Say 90/10 or 80/20 if you would like more risk.* \n\n*\\**\n\n *Build your base with some Large Cap Funds and spice it up with those ETF's perhaps.* \n\n**Would love some feedback on your favorite funds and etfs?**",
        "subreddit": "stocks",
        "title": "I need advice on how to create a safe yet possible lucrative portfolio. *repost",
        "url": "https://www.reddit.com/r/stocks/comments/kf015n/i_need_advice_on_how_to_create_a_safe_yet/",
        "created": 1608249569.0
    },
    {
        "author": "Maximum_Pudding",
        "created_utc": 1609437452,
        "id": "knuotf",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "$ENPH is being added to the S&amp;P 500. Popped to 183 this morning, currently trading close to 176. Calls for may at 250 have been swept. The street bought 8000+ calls this morning. Just sharing the news. Possible play. Article below from Bloomberg.\n\n[https://www.bloomberg.com/news/articles/2020-12-30/enphase-joins-tesla-as-latest-clean-tech-firm-to-enter-s-p-500](https://www.bloomberg.com/news/articles/2020-12-30/enphase-joins-tesla-as-latest-clean-tech-firm-to-enter-s-p-500)",
        "subreddit": "wallstreetbets",
        "title": "Enphase Joins Tesla as Latest Clean Tech Firm to Enter S&amp;P -- Calls have been swept",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/knuotf/enphase_joins_tesla_as_latest_clean_tech_firm_to/",
        "created": 1609466252.0
    },
    {
        "author": "Giuessepe",
        "created_utc": 1609434451,
        "id": "kntr4d",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "I bought fifteen shares of Enphase when it was $4.98 a share and five shares of Sedge when it was $27 a share.  I've made over $3,000 between both. Should I sell or can I expect these to keep climbing?",
        "subreddit": "stocks",
        "title": "Bought SEDG and ENPH when both were dirt cheap. Should I sell or hold?",
        "url": "https://www.reddit.com/r/stocks/comments/kntr4d/bought_sedg_and_enph_when_both_were_dirt_cheap/",
        "created": 1609463251.0
    },
    {
        "author": "Thetrader2896",
        "created_utc": 1606954737,
        "id": "k5m4d5",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Enph to the moon 160s dec 31 2020 or i will eat my own throw up and peg my own asshole. My positions been feb 130 call, 125 jan 2022 and may 95.",
        "subreddit": "wallstreetbets",
        "title": "Enph",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k5m4d5/enph/",
        "created": 1606983537.0
    },
    {
        "author": "ppcmitchell",
        "created_utc": 1609404538,
        "id": "knmjmm",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Take profits they said. It will pay off they said... ENPH",
        "url": "https://i.redd.it/lf5j2fygkh861.jpg",
        "created": 1609433338.0
    },
    {
        "author": "icaanddaed",
        "created_utc": 1608791343,
        "id": "kjae49",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Would like to hear what someone would do with this portfolio. My AAPL and SBUX have been long term holds and that’s why they’re such a large portion of my portfolio. I’m planning on adding money soon to beef up the ETFs and funds:\n\nAAPL 42% (up 920% from 2008)\n\nSBUX 18% (up 435% from 2008)\n\nENPH 10% (up 875% from 2019)\n\nStocks/funds added in 2020:\n\nSNXFX 6%\n\nRRREX 4%\n\nSWISX 3.5%\n\nARKF 3%\n\nARKG 3%\n\nICLN 3%\n\nPenny stocks are the rest",
        "subreddit": "stocks",
        "title": "Going in with 5k more over the new year",
        "url": "https://www.reddit.com/r/stocks/comments/kjae49/going_in_with_5k_more_over_the_new_year/",
        "created": 1608820143.0
    },
    {
        "author": "el_gato14",
        "created_utc": 1609393600,
        "id": "knk354",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Will this have a pre anticipatory run up until it’s inclusion date in January 7th?.",
        "subreddit": "wallstreetbets",
        "title": "ENPH S&amp;P inclusion announced after hours",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/knk354/enph_sp_inclusion_announced_after_hours/",
        "created": 1609422400.0
    },
    {
        "author": "Slim_Shady_2504",
        "created_utc": 1608049602,
        "id": "kdou92",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "$ENPH thoughts?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kdou92/enph_thoughts/",
        "created": 1608078402.0
    },
    {
        "author": "qwertyburds",
        "created_utc": 1607466497,
        "id": "k9en05",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "New meme stock ENPH Enphase Energy up 100% in last three months",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k9en05/new_meme_stock_enph_enphase_energy_up_100_in_last/",
        "created": 1607495297.0
    },
    {
        "author": "pipelinevictim",
        "created_utc": 1608354638,
        "id": "kg1s7r",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "I feel like I'm on to something [ENPH]",
        "url": "https://i.redd.it/kiqy67tku2661.jpg",
        "created": 1608383438.0
    },
    {
        "author": "MannerThink",
        "created_utc": 1609442942,
        "id": "knwcy4",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "ENPH joined SP500 on Jan 7th",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/knwcy4/enph_joined_sp500_on_jan_7th/",
        "created": 1609471742.0
    },
    {
        "author": "the_captain_ws",
        "created_utc": 1607296566,
        "id": "k84fx8",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Autist input needed. $ENPH",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k84fx8/autist_input_needed_enph/",
        "created": 1607325366.0
    },
    {
        "author": "bdambrosio94563",
        "created_utc": 1608160470,
        "id": "kekklm",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "StockMarket",
        "title": "@ENPH - outage?",
        "url": "https://www.reddit.com/r/StockMarket/comments/kekklm/enph_outage/",
        "created": 1608189270.0
    },
    {
        "author": "therealpanita",
        "created_utc": 1609436378,
        "id": "knud0f",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Enphase Energy to be added to the S&amp;P500 index next week. Ticker: ENPH",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/knud0f/enphase_energy_to_be_added_to_the_sp500_index/",
        "created": 1609465178.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1606824473,
        "id": "k4jnqt",
        "num_comments": 4571,
        "num_crossposts": 0,
        "selftext": "Please use this thread to discuss your portfolio, learn of other stock tickers, and help out users by giving constructive criticism.\n\nWhy quarterly?  Public companies report earnings quarterly; many investors take this as an opportunity to rebalance their portfolios.  We highly recommend you do some reading:  A list of [relevant posts &amp; book recommendations.](https://www.reddit.com/r/stocks/wiki/index#wiki_relevant_posts_.26amp.3B_book_recommendations)\n\nYou can find stocks on your own by using a scanner like your broker's or [Finviz.](https://finviz.com/screener.ashx)  To help further, here's a list of [relevant websites.](https://www.reddit.com/r/stocks/wiki/index#wiki_relevant_websites.2Fapps)\n\nIf you don't have a broker yet, see our [list of brokers](https://www.reddit.com/r/stocks/wiki/index#wiki_brokers_for_investing) or search old posts.  If you haven't started investing or trading yet, then setup your [paper trading.](https://www.reddit.com/r/stocks/wiki/index#wiki_is_there_a_way_to_practice.3F)\n\nBe aware of [Business Cycle Investing](https://eresearch.fidelity.com/eresearch/markets_sectors/sectors/si_business_cycle.jhtml?tab=sibusiness) which Fidelity issues updates to the state of global business cycles every 1 to 3 months (note: Fidelity changes their links often, so search for it since their take on it is enlightening).  [Investopedia's take on the Business Cycle](https://www.investopedia.com/articles/investing/061316/business-cycle-investing-ratios-use-each-cycle.asp) and their [video.](https://www.investopedia.com/video/play/business-cycle/)\n\nIf you need help with a falling stock price, check out Investopedia's [The Art of Selling A Losing Position](https://www.investopedia.com/articles/02/022002.asp) and their [list of biases.](https://www.investopedia.com/articles/stocks/08/capital-losses.asp)\n\nHere's a list of all the [previous portfolio stickies.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22Rate+My+Portfolio%22+-+r%2FStocks+Quarterly+Thread&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all)",
        "subreddit": "stocks",
        "title": "Rate My Portfolio - r/Stocks Quarterly Thread December 2020",
        "url": "https://www.reddit.com/r/stocks/comments/k4jnqt/rate_my_portfolio_rstocks_quarterly_thread/",
        "created": 1606853273.0
    },
    {
        "author": "cyanlce",
        "created_utc": 1607082851,
        "id": "k6jjm3",
        "num_comments": 815,
        "num_crossposts": 0,
        "selftext": "WSB is the 7th largest holder of GME.\n\n[**Top holders**](http://news.gamestop.com/stock-information/institutional-ownership)\n\nHolder|Shares|% O/S\n:--|--:|--:|\nFidelity|9,534,090|14.6%\nBlackRock|7,897,907|12.1%\nRC Ventures|6,500,000|10.0%\nVanguard|5,288,116|8.1%\nSusquehanna|4,444,128|6.8%\nDimensional Fund Adv|3,948,114|6.1%\nWall Street Bets|3,803,770|5.8%\nSenvest|3,610,740|5.5%\nDonald Foss|3,515,200|5.4%\nMust Asset Mgmt|3,300,000|5.1%\n\nIn case you're wondering, here are most commonly held number of shares:\n\nShares|Responses|% of Total Responses\n:--|--:|--:|\n100|137|5.7%\n200|86|3.6%\n50|69|2.9%\n300|64|2.7%\n10|54|2.3%\n1000|50|2.1%\n500|50|2.1%\n30|44|1.8%\n400|44|1.8%\n20|43|1.8%\nOther|1,756|73.3%\n\n**Please add or update your shares with this link**: https://forms.gle/kJFs1C8gURHA5a8g8\n\nLatest response with for an ID is the one that counts. Shares over 50K must be verified via screenshot.\n\n**Cleaned and filtered data without IDs:** https://docs.google.com/spreadsheets/d/e/2PACX-1vTf1Tpy7RUH6ZjeMhVRsj54WSDVCVEaWLLUPuAJBOOTH6lY2o9J8tzbehO9Z-ukbFrrzhjeXEID-rFx/pubhtml",
        "subreddit": "wallstreetbets",
        "title": "WSB owns 5.8% of GME (GME survey update)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k6jjm3/wsb_owns_58_of_gme_gme_survey_update/",
        "created": 1607111651.0
    },
    {
        "author": "EthLaw",
        "created_utc": 1607269474,
        "id": "k7vxyw",
        "num_comments": 422,
        "num_crossposts": 0,
        "selftext": "*#Clown Market DD:*# Buckle up buckaroos I'm gonna show you how to wine and dine on tendies at Wendys this very Wednesday. Neither Bull, nor Bear, I am full-on Clown and this is my native market. Given the recent Clownish trends, which unequivocally guarantee future results (*cf.* \"New Paradigm\" inflection point of [Figure A](https://transportgeography.org/?page_id=9035), the contents of Airbnb's S-1 disclosure statement (available [here](https://sec.report/Document/0001193125-20-306257/)) and other SEC filings (available [here](https://sec.report/CIK/0001559720)) are completely irrelevant, like seatbelts on a seadoo. \n\n**TLDR;** Imagine an amount of money you are willing to lose and then double it. Buy ABNB at Fidelity on IPO day, shares on Wednesday afternoon, and calls the following week.\n\nNow before you parade down the street blasting your kazoo, let's go over WHY to buy. UBER IPO'd last year at $41. This was a typical case of insider investors realizing their shares of a shitty, unprofitable company were better off in the hands of retail mothershmuckers. UBER has become even less profitable in the interim, so naturally the stock price has risen to $54. Now some of you bigbrains might be furrowing your fiveheads--ABNB has a clear path to profitability and has indeed [turned a profit](https://www.cnet.com/news/airbnb-first-profit-home-rental-travel-startups/) on multiple occasions. My elf ears hear you ask:\n\n&gt;\"Under Clownmarket rules doesn't this mean ABNB will trade flat like a boomer bond?\" \n\n\"Nein!\" is my reply. Fear not, for ABNB posted a [$322m loss](https://www.vox.com/2020/2/12/21134477/airbnb-loss-profit-ipo-safety-tech-marketing) last year. Although it's not as sexy as [TSLA's $862m loss](https://www.statista.com/statistics/272130/net-loss-of-tesla/) in the same year, we can hope ABNB's costs of expanding into China will swell like an ass-eater's lymph nodes. The analysts certainly think so. Cordwell has a price target of [$75 a share](https://www.marketbeat.com/stocks/NASDAQ/ABNB/price-target/) following the likely $45-$50 IPO target.\n\nAlthough Airbnb is clearly just Uber for your mattress, some skeptics demand more metrics. Compare Booking.com (BKNG) which IPO'd at $483.99 in 1999 and dropped to $7.88 by 2001. Could this happen to ABNB? Absolutely not. Why? Because I got bedbugs once at a booking.com dive with fake pics, and I didn't even call their customer service to get my eleven dollars back. Contrast that with when I got kicked out of an Airbnb in Bali six years ago, I got on the phone with a **specialist** who **investigated** my **case** and gave me a bunch of store credit for shit I didn't even ask for. Add in the fact that BKNG now trades at $2125 and you've got yourself a real *fuck it why not* scenario.  \n\nAnd finally, *Google Trends* [shows \"airbnb\" is half as hype as \"tesla\"](https://trends.google.com/trends/explore?geo=US&amp;q=airbnb,tesla) which logically puts ABNB at 50% of TSLA's $558b valuation, =$279b, which would put ABNB's share price at $465.\n\nPut the kazoos away boys, this 10-bagger calls for a fanfaronade of vuvuzelas!",
        "subreddit": "wallstreetbets",
        "title": "Airbnb IPO on Wednesday",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k7vxyw/airbnb_ipo_on_wednesday/",
        "created": 1607298274.0
    },
    {
        "author": "Happy_Pizza_",
        "created_utc": 1607005719,
        "id": "k5y6ka",
        "num_comments": 266,
        "num_crossposts": 0,
        "selftext": "[From the article](https://www.reuters.com/article/cryptocurrencies-sp/sp-dow-jones-indices-to-launch-cryptocurrency-indexes-in-2021-idUSL1N2IJ0TG):\n\n&gt; LONDON (Reuters) - S&amp;P Dow Jones Indices, a division of financial data provider S&amp;P Global Inc, said on Thursday that it will launch cryptocurrency indices in 2021, making it the latest major finance company to enter the nascent asset class.\n\n&gt; The S&amp;P DJI-branded products will use data from New York-based virtual currency company Lukka on more than 550 of the top traded coins, the companies said.  S&amp;P’s clients will be able to work with the index provider to create customized indices and other benchmarking tools on cryptocurrencies, S&amp;P and Lukka said in a joint statement.  S&amp;P and Lukka hope more reliable pricing data will make it easier for investors to access the new asset class, and reduce some of the risks of the very volatile and speculative market, they said.\n\n&gt; “With digital assets such as cryptocurrencies becoming a rapidly emerging asset class, the time is right for independent, reliable and user-friendly benchmarks,” said Peter Roffman, global head of innovation and strategy at S&amp;P Dow Jones Indices. The move by one of the world’s most well-known index providers could help cryptocurrencies become more mainstream investments. It comes as bitcoin continues to soar to record highs against the dollar, boosted by increased demand from investors who say the virtual currency is a hedge against inflation and a safe-haven asset.\n\n&gt; Bitcoin was trading at $19,300 in latest trading on Thursday, having soared around 170% this year. Cryptocurrencies have been around for more than a decade, but have started attracting more interest from large financial companies over the last few years.\n\n&gt; Large firms including Fidelity Investments and Japan’s Nomura Holdings Inc have starting safeguarding bitcoins and other cryptocurrencies for institutional investors, while major exchanges have started offering bitcoin derivatives. The emergence of more mainstream market infrastructure has made the asset class more accessible for institutional investors, with hedge fund managers such as Paul Tudor Jones and Stanley Druckenmiller saying they include bitcoin in their broad investment strategies.",
        "subreddit": "investing",
        "title": "S&amp;P Dow Jones Indices to launch cryptocurrency indexes in 2021",
        "url": "https://www.reddit.com/r/investing/comments/k5y6ka/sp_dow_jones_indices_to_launch_cryptocurrency/",
        "created": 1607034519.0
    },
    {
        "author": "cyanlce",
        "created_utc": 1607180045,
        "id": "k78srf",
        "num_comments": 149,
        "num_crossposts": 0,
        "selftext": "**Not even fake entries can stop us. We are now the 5th largest holder of GME.** \n\n&amp;nbsp;\n\n[**Top holders**](http://news.gamestop.com/stock-information/institutional-ownership)\n\nHolder|Shares|% O/S\n:--|--:|--:|\nFidelity|9,534,090|14.6%\nBlackRock|7,897,907|12.1%\nRC Ventures|6,500,000|10.0%\nVanguard|5,288,116|8.1%\n**Wall Street Bets**|**4,549,698**|**7.0%**\nSusquehanna|4,444,128|6.8%\nDimensional Fund Adv|3,948,114|6.1%\nSenvest|3,610,740|5.5%\nDonald Foss|3,515,200|5.4%\nMust Asset Mgmt|3,300,000|5.1%\n\n&amp;nbsp;\n\n**Breakdown by shares owned**\n\nShares Owned|Responses|Total Shares\n:--|--:|--:\n[0,100)|1,621|52,851\n[100,1K)|1,466|455,590\n[1K,10K)|504|1,357,723\n[10K,50K)|98|2,143,588\n[50K, ∞)|5|539,991\n**Total**|**3,694**|**4,549,742**\n\n&amp;nbsp;\n\nThere were a lot of fake entries, so let me address that.\n\n**1) These guys are not good at what they do**\n\nMost of the fake entries are obvious, for example [here](https://imgur.com/YDgeFOm) and [here](https://imgur.com/DamT0zE).\n\nOthers are less obvious, with random numbers spread out over a wider period of time. But it's not easy to create legit-looking entries and have an impact since they can't see the whole data set.\n\nThere were so many that I couldn't go through all the responses in a detailed way, and was more conservative to exclude more responses than necessary. Unfortunately, I'm also hiding the category column and grouped duplicates, outliers, fake entries into the Excluded category so that I don't provide any helpful feedback to fakers. Apologies for removing transparency for the sake of countering spoilers.\n\nIf we really wanted to stop the fakers, we would ask for email addresses, but then no one would fill out the form. But it doesn't matter anyways, because...\n\n**2) Fake entries don't even matter much, since it just has to be in the ballpark**\n\nSurveys have a huge margin of error and only have to be directionally correct (see recent political polls). The fakers think they're playing 4D chess but are actually playing Candyland... and losing to 4 year-olds. They have the logical skills of GME shorts (which they probably are). \n\n**3) The main benefit of the survey is social proof**\n\nFrom all the responses and all the shares, it's obvious we are a force to be reckoned with. We hold great power, and with great power come great tendies. The next time you get weak hands (next Wed), remember everyone else holding until a squeeze. Even if you have the most delicate, princess hands, hold at least through Q4 earnings and the annual shareholder meeting in April.\n\n&amp;nbsp;\n\n**Please add or update your shares with this link**: https://forms.gle/kJFs1C8gURHA5a8g8\n\nLatest response with for an ID is the one that counts. Shares 50K and up must be verified via screenshot.\n\n&amp;nbsp;\n\n**Cleaned and filtered data without IDs:** https://docs.google.com/spreadsheets/d/e/2PACX-1vTf1Tpy7RUH6ZjeMhVRsj54WSDVCVEaWLLUPuAJBOOTH6lY2o9J8tzbehO9Z-ukbFrrzhjeXEID-rFx/pubhtml",
        "subreddit": "wallstreetbets",
        "title": "When's the GME investor meeting for its 5th largest holder?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k78srf/whens_the_gme_investor_meeting_for_its_5th/",
        "created": 1607208845.0
    },
    {
        "author": "mazrim00",
        "created_utc": 1607270137,
        "id": "k7w502",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "I know this has been talked of before, but have had a lot of issues with my current account at Vanguard (constant website issues for the last 6 months or so, $300 fees to split units, taking forever for tickers to change with SPACS, unable to buy certain OTC stocks for \"my safety, etc.) but wanted to get a current synopsis on preferred brokers. Also having a hard time using search feature to specifically see if any recent questions on this.\n\n&amp;#x200B;\n\nWhat is your preferred brokerage? From what I remember seeing Fidelity and TD Ameritrade were a few but may be wrong on that.",
        "subreddit": "stocks",
        "title": "Brokerage question",
        "url": "https://www.reddit.com/r/stocks/comments/k7w502/brokerage_question/",
        "created": 1607298937.0
    },
    {
        "author": "royaIs",
        "created_utc": 1607191135,
        "id": "k7c6ee",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "I honestly hadn't heard about it, until I was looking at my fidelity dashboard and saw it was on of the top purchased stocks yesterday on the site. I did some quick research, and saw this article:\n\nhttps://www.marketwatch.com/story/this-25-year-old-is-now-a-billionaire-after-his-self-driving-car-company-luminar-went-public-11607114665\n\nI wanted to know what you all thought of it, before I really delved deep.",
        "subreddit": "stocks",
        "title": "What are your thoughts on LAZR? A meme stock or a legit investment opportunity?",
        "url": "https://www.reddit.com/r/stocks/comments/k7c6ee/what_are_your_thoughts_on_lazr_a_meme_stock_or_a/",
        "created": 1607219935.0
    },
    {
        "author": "msiekkinen",
        "created_utc": 1607091320,
        "id": "k6lnbe",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "I noticed in my Fidelity trading account it lists different traunches of buying power with government bonds being about 10x as much as general for regular securities.\n\nWhy would someone do this?  Even when interest rates weren't zero their return in no way would touch the margin costs?\n\nI'm not actually interested in doing this, just trying to understand the economic sense on why anyone would.  Is that part of some kind of complex trading scheme I'm just completely oblivious to?",
        "subreddit": "investing",
        "title": "Why would someone buy government bonds on margin?",
        "url": "https://www.reddit.com/r/investing/comments/k6lnbe/why_would_someone_buy_government_bonds_on_margin/",
        "created": 1607120120.0
    },
    {
        "author": "r2002",
        "created_utc": 1606952915,
        "id": "k5lkn3",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "While people are panicking on Reddit and Stocktwits...\n\n&gt;The bill won’t come as a surprise to investors. Emerging markets fund managers have been swapping U.S. listings of widely held stocks like Alibaba Group Holding (BABA), JD.com (JD), NetEase (NTES) for their secondary listings in Hong Kong listings for months, in anticipation of the measure. \n\nThat's right. The absolute *worst* thing that can happen is that your shares get swapped to Hong Kong's stock exchange. The article explained that Interactive Brokers, Fidelity, and Schwab, for example, already offer retail traders like us access to HK's exchange.\n\nGranted that NIO and XPEV are not on the Hong Kong exchange yet. But they have three years to comply with the US rule. That's plenty of time to secure a spot on the Hong Kong exchange. And Hong Kong would *love* to have them. This move could also benefit the companies themselves, as it makes them available to both American *and* Chinese investors:\n\n&gt;A Hong Kong listing means a company’s stock can be traded during the Asian day and is likely to broaden its investor base. If shares are later added to Hong Kong’s so-called stock connect program, they could also become accessible to investors in mainland China. [WSJ](https://archive.fo/XRXPe#selection-2677.0-2677.262)\n\n**tl;dr** Worst thing that happens is you have to open another account to give you access to HKEX. That's assuming a compromise doesn't get reached. And that's assuming Biden even signs this bill.",
        "subreddit": "stocks",
        "title": "Why professional traders are not worried about the Delisting Bill that passed today -- Barons",
        "url": "https://www.reddit.com/r/stocks/comments/k5lkn3/why_professional_traders_are_not_worried_about/",
        "created": 1606981715.0
    },
    {
        "author": "iamnotjedi",
        "created_utc": 1607294488,
        "id": "k83tm6",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Hello, \n\n[https://www.municipalbonds.com/bonds/issue/108472AA9/](https://www.municipalbonds.com/bonds/issue/108472AA9/)\n\nYIELD        : 22.964%   \nMATURITY: 2029 May  \nInvestment: $15,000\n\nI have been researching on MUNI bonds and came across this attractive bond, which is far more difficult to believe. \n\nMy requirements are: \n\n\\&gt; Tax free gains (I'm aware of Roth, Megaback door Roth,..etc). I live in a State tax free state, so my only concern is on Federal taxes \n\n\\&gt; Though, I love researching different stocks and index funds, if there is a 20% ROI on an index fund, I would love to go with that option. \n\n\\&gt; I'm 31 and I've emergency savings for 5 months and I've $20,000 extra cash which I would like to invest. Municipal bonds seems like a good option as it provides tax-free gains. \n\n&amp;#x200B;\n\nWhat are the issues that I need to be aware about while buying these type of bonds? \n\nI use Fidelity for my investments, but I'm not able to find these type of MUNI bonds, is there any other recommended brokers where I can buy these? \n\nIf MUNI bonds is not an option, what are the other options to invest the $20K? Stocks and ETFs are the ones I have in mind. Any help is greatly appreciated.\n\nThanks in advance :)",
        "subreddit": "investing",
        "title": "MUNI Bonds with 20+% yield?",
        "url": "https://www.reddit.com/r/investing/comments/k83tm6/muni_bonds_with_20_yield/",
        "created": 1607323288.0
    },
    {
        "author": "finadthrowaway",
        "created_utc": 1607398758,
        "id": "k8wmo9",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "Hello, I'm a minor and I have gotten lucky enough to earn a significant amount of money for my age. I'm interested in trading options, though I cannot do so with my current custodial account on Fidelity. I understand the risk involved with trading options, I plan to just throw play money at it for now, no serious amounts. I am not asking for advice either, I've already set aside money for taxes, maxed out my Roth IRA for this year, etc.\n\n&amp;#x200B;\n\nAre there any brokers that allow custodial accounts that are able to trade options?",
        "subreddit": "investing",
        "title": "Is there a way for a minor to (legally) trade options?",
        "url": "https://www.reddit.com/r/investing/comments/k8wmo9/is_there_a_way_for_a_minor_to_legally_trade/",
        "created": 1607427558.0
    },
    {
        "author": "Narf_hand",
        "created_utc": 1607352700,
        "id": "k8hyy3",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "I’m trying to buy my first stock valued under $0.001 and I’m getting errors in fidelity. I get this error: \n\n“(TC9052)Opening transactions for Pink Sheets (without information) are not permitted because of the risks associated with these securities and all Microcap securities.”\n\nAny idea how I can acquire this OTC penny? The ticker is RTON\n\nThanks.",
        "subreddit": "pennystocks",
        "title": "Question about trading “pennies” on Fidelity",
        "url": "https://www.reddit.com/r/pennystocks/comments/k8hyy3/question_about_trading_pennies_on_fidelity/",
        "created": 1607381500.0
    },
    {
        "author": "Reinbek",
        "created_utc": 1607240901,
        "id": "k7pju5",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "As the title says, I’d like to start soon. I’ve done my research but I still have some questions. Before asking I do want to say that I’m going to use Fidelity (seems easy to use) and I have about 3,000 dollars lying around that I can use to initiate investing. \n\nMy questions: \nBy imputing my bank info to create my account on fidelity, will I have to pay fees any time I purchase stock? I know it takes several days to get verified and actually start investing. \n\nAlso which companies are good for beginners like me? My peers say a bunch of different companies but I’m not sure which ones to look into but I always hear Tesla being mentioned. \n\nOverall I’m still a bit confused and I’d really appreciate any info. Thank you!",
        "subreddit": "stocks",
        "title": "Want to start in buying stock.",
        "url": "https://www.reddit.com/r/stocks/comments/k7pju5/want_to_start_in_buying_stock/",
        "created": 1607269701.0
    },
    {
        "author": "PeanutButterRedDirt",
        "created_utc": 1607347553,
        "id": "k8gkn6",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "So thanks to the end of day run up on Friday, I now realize I was assigned 300 shares of TGT due to the 175 strike calls I was letting expire worthless and taking the $250 loss. Obviously not the case now. \nI don’t hate TGT as a stock, it’s come off highs slightly after solid previous earnings, and we’re moving into heavy retail consumer season (but an unprecedented one at that)...should I just ride out this position even if short term things go south? Personally I see the market as a whole pulling back over this next week or two. \nMaybe fidelity will force the sale at open anyway, this position is now my largest by 2x. \nThoughts/advice from the boys???",
        "subreddit": "wallstreetbets",
        "title": "Assigned $50K in TGT shares...WWYD?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k8gkn6/assigned_50k_in_tgt_shareswwyd/",
        "created": 1607376353.0
    },
    {
        "author": "Crack_Fox-",
        "created_utc": 1606916942,
        "id": "k59iyq",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "What app do you use for penny stocks? \n\nI got ALPP on t212 but the majority of tickers mentioned here are not on there. (invest)\n\nCan't see an Ameritrade app. Is Fidelity the way to do it ?.",
        "subreddit": "pennystocks",
        "title": "Any UK on here?",
        "url": "https://www.reddit.com/r/pennystocks/comments/k59iyq/any_uk_on_here/",
        "created": 1606945742.0
    },
    {
        "author": "helpdadsstruck",
        "created_utc": 1607013693,
        "id": "k60q73",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "TL;DR: My dad had a stroke and can't move or see much. He really wants me to close out some small options positions, but when I try to 'sell to close' or 'buy to close' in his websites' interfaces, they tell me I've chosen wrong options and the trades can't go through. What should I do to turn those positions into cash, regardless of gain or loss? DMs are fine.\n\n&amp;#x200B;\n\nMy 75 year old dad had a couple pretty major strokes last week. He can talk, a little, and some things are clear on his mind while others (Like \"No, you really can't walk with your left side paralyzed\") are pretty muddy. He is really fixated on closing out a couple small (&lt; $1k) options positions he has on Schwab &amp; Fidelity.\n\nI'm not a sophisticated investor. (He's not either, from the numbers I can see, but he sure thinks he is. /familydrama&gt; ) I understand equities and what shorting is and the fact that options offer some leveraged access to future equities or commodities. TBH, I'm not looking to understand much more. I just want to zero out his accounts so he can die in a little more peace than he's in right now.  \n\nI don't \\*think\\* any of the positions are very complex. \"Long calls\" and \"Short calls\"? I have access to his computer where he's logged in to both Fidelity and Schwab. \n\nWould any of you knowledgeable people help an old guy out? DMs are fine.",
        "subreddit": "investing",
        "title": "My dad had a stroke. Can someone who knows options help me unwind his positions on Schwab &amp; Fidelity?",
        "url": "https://www.reddit.com/r/investing/comments/k60q73/my_dad_had_a_stroke_can_someone_who_knows_options/",
        "created": 1607042493.0
    },
    {
        "author": "redditvalemadre",
        "created_utc": 1607139378,
        "id": "k709rx",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "I have part of my portfolio in FSEAX (which I love.. or used to love five minutes ago)... but I just almost had a heart attack to learn that it's down about 11.6% ( https://finance.yahoo.com/quote/FSEAX/ )\n\n\nI verified some of its individual stocks like Alibaba, Samsung or Taiwan Semiconductor and they look okay.\n\nDo you know what is happening?",
        "subreddit": "stocks",
        "title": "FSEAX (Fidelity Emerging Asia Fund) down 11%!",
        "url": "https://www.reddit.com/r/stocks/comments/k709rx/fseax_fidelity_emerging_asia_fund_down_11/",
        "created": 1607168178.0
    },
    {
        "author": "BlueRiver4",
        "created_utc": 1606859091,
        "id": "k4uwmw",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": " I’m looking for a place to signup to, so I can transfer my 401k there - but I want somewhere that gives me access to the ENTIRE stock market and all ETFs like QQQ, VOO, etc.\n\nAnyone know of the best place? \n\nDo the main big companies all allow this? (Fidelity, Schwab, etc.)\n\nI have a self employment type of 401k through my own single member LLC.\n\nCurrently it is at a company called “Pioneer” which completely sucks - they only have a few proprietary mutual funds.",
        "subreddit": "stocks",
        "title": "Best 401k Company For Stocks, ETFs, etc.?",
        "url": "https://www.reddit.com/r/stocks/comments/k4uwmw/best_401k_company_for_stocks_etfs_etc/",
        "created": 1606887891.0
    },
    {
        "author": "matthia5",
        "created_utc": 1606978374,
        "id": "k5sc3t",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "I’m too retarded to draw a conclusion from this information. But I figured it’s such a popular stock that this could be significant. Is fidelity retarded or should I become a gay bear on Tesla?",
        "subreddit": "wallstreetbets",
        "title": "Fidelity rates Tesla at $247.28 - current market price is 568.82.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k5sc3t/fidelity_rates_tesla_at_24728_current_market/",
        "created": 1607007174.0
    },
    {
        "author": "IsThereCheese",
        "created_utc": 1607290585,
        "id": "k82mse",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Never traded options, looking on Fidelity.\n\nI think I’d like to open a put on MSTR because I’m betting it will drop drastically from its current price of 328.  For what I’m willing to risk at the moment, that would look like a 310p 1/15/21 (a little shorter than what I’d like, but contract is expensive..).\n\nThe bid/ask is 33.80/39.50 (this is the price I try to buy the contract for, is that correct?  Why is it a range?)\n\nSo if I were to buy this contract, it would be an option to sell x100 shares of MSTR at 310 up until 1/15/21, and it would cost $3,665 (the median of the spread?)?\n\nIs that accurate so far?\n\nIf so, let’s say on 1/15/21 that MSTR is at 300.  A difference of $10 x 100 shares for $1000 is far less than the $3,665 I mentioned above though, so a net loss.\n\nIn fact, by my math MSTR would have to drop to 273 to break even. (Is that right, or am I mistaken on the premium?)\n\nLastly..exercise vs. sell: I assume the vast majority of the time I would want to sell the contract rather than exercise.  \n\nSell: what kind of basis would the contract sell for?  Is there a good way to estimate before entering into a contract?\n\nExercise: if you don’t own shares of a put contract, how would you exercise it?  Buy for market, and then sell for contract price?\n\nThank you",
        "subreddit": "wallstreetbets",
        "title": "Can someone please answer some stupid questions for a stupid idiot?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k82mse/can_someone_please_answer_some_stupid_questions/",
        "created": 1607319385.0
    },
    {
        "author": "BostonBrakeJob",
        "created_utc": 1606819807,
        "id": "k4ioqt",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "I can't post pics here on Reddit, but check Fidelity and see if you guys see what I'm seeing.  $4.40 share price all of the sudden?  \n\nTried Google but no news showed up.\n\nOn www.otcmarkets.com when I type in QUTR the only option that pops up in the search bar is \"QUTRD\" and it's now showing up as Born Inc.\n\nI threw $80 bucks at it a few weeks ago for 7,840 shares.  Fidelity is now showing it's value at $34,496.00\n\nSomething isn't right here.  Only thing I can guess is the merger went through, along with a RS.  Only way the SP can go from $.0038 to $4.40 overnight.  And I assume Fidelity will adjust my share count sometime before the market opens.  \n\nAny info?",
        "subreddit": "pennystocks",
        "title": "QUTR showing $4.40 SP on Fidelity...?",
        "url": "https://www.reddit.com/r/pennystocks/comments/k4ioqt/qutr_showing_440_sp_on_fidelity/",
        "created": 1606848607.0
    },
    {
        "author": "truemeliorist",
        "created_utc": 1607010392,
        "id": "k5zmgn",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "I just had a rather frustrating call with TDA. I've been tinkering with options for a little under a year now. I started on fidelity selling CC's against a large position I owned. I also opened an account at TDA that was intended for more active options trading when that CC finally hit at Fidelity, since Fidelity's website is kinda wonky for options trading.\n\nWhen I opened the account at TDA, I selected options access, margin, futures, forex, margin, advanced features, etc. After opening the account, I saw that literally none of those were on the account (!). I called them, and they stated that they were approved and would show up the next day. Some did, some didn't. Options *looked* like it was.\n\nI've been daytrading stocks in the account in the interim. Not too bad either - doubled the account. Well, fast forward to this morning. I tried purchasing a 2022 LEAP with the intention of doing PMCCs, and I got an error that \"it would create an illegal position\" error (!!).\n\nSo, I get on the phone with TDA and they tell me that I was never approved for options (!!!). I explain the history. They say they don't see it (!!!!). They also say that during the application, the request for additional account features was never filled out (!!!!!), which is BS because I literally picked through it with a fine tooth comb.\n\nOk, fine. So I re-apply. This time, they only give me L1 options, and some L2. No ability to do spreads.\n\nAnd I'm locked there for another 90 days. After 3 attempts to enable options at my desired level now - at creation, after creation, and now this, I give TF up. I told the rep that I'm probably going to close the account since I have L3 options at fidelity, spreads were part of my strategy, and they gave me some spiel about \"well its for your own safety, we are much more strict than fidelity, we want you to have more experience, we aren't trying to win your business.\" (!!!!!!!)\n\nAt that line, I said \"well done then.\" and hung up.\n\nI'll pull my cash back out and either move back to Fidelity (though I hate their website for options trading, and I don't have a machine where I can run active trader pro). I've also heard a lot of love towards tastyworks, but the commissions see really high. I wanted to avoid RH because of really bad experiences there as an early user. I've also heard some love towards webull.\n\nI get there's an obligation to \"protect me from myself\" but GD this is frustrating when I already have that level of access elsewhere, and was told by their support that I was approved. It's even more frustrating when it feels like support is trying to gaslight you, and then waves you off like you aren't important when you point it out.",
        "subreddit": "options",
        "title": "Vent - Frustration with TDA and options level approval.",
        "url": "https://www.reddit.com/r/options/comments/k5zmgn/vent_frustration_with_tda_and_options_level/",
        "created": 1607039192.0
    },
    {
        "author": "monk_hasu",
        "created_utc": 1607333284,
        "id": "k8dhve",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Hi,\n\nI’m not sure if there are people here living in Japan, but this is a question for those who do and are investing from here.\n\nI’m a beginner here and if I’m going to learn how to invest. I want to start learning it in english then move to a Japanese version later down the road.\n\nLooking on Fidelity because of their “zero funds” offering.\nBut if you know a better platform (in English) please do let me know.\n\nThanks and advance!\n\nPS: Before anyone says “LEARN JAPANESE!”, I’m already an N2 Level, it’s just that the technical terms are getting in to my nerves and there’s not much people to talk about investments here. (At least not inside my circle of friends and relatives)",
        "subreddit": "investing",
        "title": "Fidelity Equivalent in Japan?",
        "url": "https://www.reddit.com/r/investing/comments/k8dhve/fidelity_equivalent_in_japan/",
        "created": 1607362084.0
    },
    {
        "author": "Zeus---GoDZ",
        "created_utc": 1606847141,
        "id": "k4qq2d",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "FXAIX in a Taxable Account\n\nCurrently hold FXAIX, a mutual fund, in a taxable account (Fidelity). \n\nShould I sell all my positions and instead buy VOO, due to it being an ETF and it being more tax efficient?\n\nPlan to hold the position for 10+ years while DCA.",
        "subreddit": "stocks",
        "title": "FXAIX in a Taxable Account",
        "url": "https://www.reddit.com/r/stocks/comments/k4qq2d/fxaix_in_a_taxable_account/",
        "created": 1606875941.0
    },
    {
        "author": "emp12775",
        "created_utc": 1606929945,
        "id": "k5dpdn",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Hello all, I have several accounts, TOS , Fidelity, E*TRADE. However I can’t find anywhere to purchase Hong Kong shares that use numerical values for tickers. I recall E*TRADE had an international trading platform years ago however now I’ve hit dead ends and only found ADRs and etfs for purchase..",
        "subreddit": "stocks",
        "title": "How to buy actual shares on on HK market when living in US",
        "url": "https://www.reddit.com/r/stocks/comments/k5dpdn/how_to_buy_actual_shares_on_on_hk_market_when/",
        "created": 1606958745.0
    },
    {
        "author": "biggertaint",
        "created_utc": 1606962940,
        "id": "k5oidm",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "I have a 401(k) set up with Vanguard and an individual broker acct setup with Fidelity.  \n\nI anticipate rolling over my Roth 401(k) \\~eventually\\~ into a Roth IRA and am curious to hear the benefits/drawbacks of starting that Roth IRA account with Vanguard versus Fidelity.  I've heard the rollover can get a little shifty, so I'm wondering if it would make it any easier to stick with the same company or not...\n\nWill it be costly to roll over the Vanguard 401(k) to a Fidelity IRA?\n\nI'd like to open the Roth IRA asap so the 5 year period in which I can't withdraw funds is over asap.  \n\nThanks",
        "subreddit": "investing",
        "title": "Which broker for Roth IRA?",
        "url": "https://www.reddit.com/r/investing/comments/k5oidm/which_broker_for_roth_ira/",
        "created": 1606991740.0
    },
    {
        "author": "Funkyfresh562",
        "created_utc": 1607195854,
        "id": "k7dprq",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Currently in a sticky situation at EOY (age 27). I’m a self employed 1099 (individual owner and only employee) with an S-Corp. I’ve paid myself a ‘reasonable salary’ this year. I have my Roth IRA in Fidelity, and I made the maximum contribution in early January. My personal ST gains from stock this year is around $200K (2000% YTD). I just realized that I will exceed the income contribution limit for Roth IRA. I spoke to Fidelity about this issue and they have given me two options: either withdraw the contribution and get penalized plus taxes at ordinary or do a conversion to traditional and then back to Roth IRA plus file Form 8606 every year.\n\nAs of right now, my Roth IRA has a 95% YTD return. Although I understand that this return may not be consistent and be lucky, and that I may have to rebalance as I get older, I still want to be able to aggressive and choose my own positions. Playing around with the compound interest calculator: maximum annual contribution, 15-20% average yield, and a 30 year period, this is a no brainer on after-tax savings. \n\nI specifically want a after-tax option to invest. Is the best way to continue funding traditional Roth and then convert every year or to open a Roth 401K employer side and fund it ($19K contribution limit?)? Secondly, where is the best option to open an employer Roth 401K, how much may it cost, and would I even be able to manage my own fund or does it have to be in a target/passive index?\n\nThank you",
        "subreddit": "investing",
        "title": "Where is the Best Option for Roth 401K?",
        "url": "https://www.reddit.com/r/investing/comments/k7dprq/where_is_the_best_option_for_roth_401k/",
        "created": 1607224654.0
    },
    {
        "author": "SarahInfinite",
        "created_utc": 1607388637,
        "id": "k8trye",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Can someone explain warrants and if its better for short to mid term as opposed to buying common stock.\n\nCan you purchase warrants directly thru your brokage app such as fidelity?\n\nAre you locked into you warrants for a certain time frame? Or can you sell them immediately?  Do they sell right away at their current market price when you do sell?",
        "subreddit": "SPACs",
        "title": "Can someone explain warrants",
        "url": "https://www.reddit.com/r/SPACs/comments/k8trye/can_someone_explain_warrants/",
        "created": 1607417437.0
    },
    {
        "author": "deltabengali",
        "created_utc": 1607351180,
        "id": "k8hj5a",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Hi.  Was hoping to get an ELI5 of math involved.\n\nI am comparing 2 funds in my 401k (they are not called mutual funds though in the description...)\n\nFund A has returned 65% YTD and has an expense ratio of 0.35%.  It is \"Fidelity Contrafund Commingled Pool Class 3\".\n\nFund B has returned 30% YTD and has an expense ratio of 0.020%.  It is \"Vanguard Russell 1000 Growth Index Trust\".\n\nBoth funds are in the category of Large Cap and have similar top holdings of stalwarts like Apple, Microsoft, Amazon, Alphabet, etc., but Fund A doesn't give me the percentage of the top 10 holdings for some reason.\n\nI'm assuming despite the way higher expense ratio of Fund A, that because of it's higher growth rate it still comes out ahead in terms of overall return.  How does one calculate the breakeven point for when a higher expense ratio can be justified for one investment over another?",
        "subreddit": "investing",
        "title": "Comparing 2 funds growth rate to find break even point with justifying higher expense ratio?",
        "url": "https://www.reddit.com/r/investing/comments/k8hj5a/comparing_2_funds_growth_rate_to_find_break_even/",
        "created": 1607379980.0
    },
    {
        "author": "mezirah",
        "created_utc": 1607012692,
        "id": "k60drh",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "I've been using this website (app) since it was just for couch surfing in other cities. I would love to get a piece of the stock at the priced value, but Fidelity won't let me get in because I don't have enough assets with them. (or at all). I need at least 500k in my account.  \n\nNow it's going to hit the market at like $100-$200 like SNOW, and I won't even get a chance to get it. Sad face.",
        "subreddit": "investing",
        "title": "I wish I could buy some AirBNB",
        "url": "https://www.reddit.com/r/investing/comments/k60drh/i_wish_i_could_buy_some_airbnb/",
        "created": 1607041492.0
    },
    {
        "author": "gurjitsk",
        "created_utc": 1607055073,
        "id": "k6dkwt",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "I moved from RH to Fidelity \nI just made a Roth IRA and maxed the 6k limit. Which I will most likely invest into FXAIX or FNILX. I don’t have a brokerage account yet. \n\nI have total for about 40k saved up I’m able to invest, should I make an brokerage account and use that to invest the rest or are their other accounts that are better for long term. Also which will be least tax safe.\n\nI know my Roth IRA gains won’t be taxed, is other best option a brokerage account to use for investing? \n\nI’m new to investing and looking to hold for long term. Any advice would be appreciated",
        "subreddit": "investing",
        "title": "Roth IRA and brokerage account for investing?",
        "url": "https://www.reddit.com/r/investing/comments/k6dkwt/roth_ira_and_brokerage_account_for_investing/",
        "created": 1607083873.0
    },
    {
        "author": "One-Tiger6793",
        "created_utc": 1606947067,
        "id": "k5jq3a",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Hello everyone, I’m 27 years old, pretty new to investing. I’m building a portfolio. My plan is investing ~$600 every month for the next 5 years and I need to cash out after that. Have done some research but more I read more questions accumulate and get confused, can’t choose anything. I use Fidelity platform for investing. \n\nSo I ended up with the next \n50% VOO\n30% QQQ\n5% ARKK\n5% ARKG\n5% ICLN\n5% QCLN\nAnd something else.\n\nVOO and QQQ seems like overlapping. Had a hard time deciding between VTI and VOO.\n\nWhat do you think about that? How aggressive is this? Should I go more aggressive? Please go easy on me it’s my first time posting on Reddit :)\nI appreciate your help and opinion!",
        "subreddit": "investing",
        "title": "Portfolio for the next 5 years",
        "url": "https://www.reddit.com/r/investing/comments/k5jq3a/portfolio_for_the_next_5_years/",
        "created": 1606975867.0
    },
    {
        "author": "madeafromtmnt",
        "created_utc": 1607308189,
        "id": "k87pkz",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Haven't checked on my ROTH in quite some time, checked on it and my 1-year return was 41.19%... is that like crazy? I feel like that's just stupid. I haven't done anything in contributions this year, is now the time to add just as much as I possibly can? Is 41.19% realistic for the future or was this just a fluke or does it somehow have something to do with the pandemic? Thank you for your help",
        "subreddit": "investing",
        "title": "Fidelity ROTH IRA",
        "url": "https://www.reddit.com/r/investing/comments/k87pkz/fidelity_roth_ira/",
        "created": 1607336989.0
    },
    {
        "author": "darth_faader",
        "created_utc": 1607273346,
        "id": "k7x4pr",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Between a recent inheritance, and cash I've been stockpiling in a savings account, I have \\~$325k cash collecting dust. I need your help! lol. I'm 40, no kids, no financial obligations. This money  is growing rapidly based on my income, at the rate of $5-10k/month. I need to put this money to work, and would really appreciate input from you all - especially people who've been in a similar situation where they've come into a large sum unexpectedly and didn't have prior experience with money on that scale. For context, I'm self-employed, and I've been maxing out my retirement contributions annually (in terms of the maximum I can contribute to have a tax advantage). I've even had crazy luck with my retirement account, it's up \\~25% on the year. I earn roughly $200k/yr, and COVID has not, and will not impact business (it's growing). I've put together roughly \\~450k in net worth in the past three years, starting at ground zero, so in relative terms all of this wealth is new. Other than my mortgage I'm debt free - my mortgage is 2.99 % fixed for 30 years, so paying this down doesn't seem like the right move, at least not right now.\n\nSome questions:\n\n* has anyone navigated this type of situation recently?\n* does anyone have experience having their savings/retirement actively managed? Fidelity offers this for a reasonable monthly fee\n* can I trust financial advisors? any 'tells' I can watch out for?\n* are there any mistakes / pitfalls you guys have made that you could help me avoid?\n* should I wait until after the transition of power before making any moves? politics aside, these are dicey times and whatever is going to happen will transpire by the end of next month\n* can anyone recommend effective means of giving? I'd like to take a slice of ROI and get that to people who need it. I read that 1 in 5 kids here is hungry, and that's criminal\n* Whether that's cash or gold bricks, I'm going to make a 'doomsday fund' to keep at home - I'm not a prepper, but banks have failed, once in my lifetime - can someone give some advice on this? Was thinking \\~10k in cash/gold\n\nMy goals:\n\n* would prefer this to be relatively hands off - get some safety nets in place (stop loss etc), stick to relatively boring equities, etc etc. my income is such I don't have to get aggressive here\n* early retirement - I'd love to scale back to a 3 day work ASAP, and I'm not materialistic - there will be no Mercedes in the driveway, no vacations in St. Tropez, it's just not my style\n* real estate - I'd like to expand into rental properties, I'm in the St. Pete FL area and there's no shortage of people looking to rent\n\nANY advice you all could share would truly be appreciated. Criticism/suggestion regarding my current thoughts and plans is also welcomed. I've done really well recently, but it's amateur hour and I'm aware of this. PLEASE share any mistakes major mistakes you've made in similar situations - IMO the best thing I can do is avoid common pitfalls, but I'm looking to do more than drop this into gov't bonds.\n\nThank you!",
        "subreddit": "investing",
        "title": "Inheritance Management (New Money Problems)",
        "url": "https://www.reddit.com/r/investing/comments/k7x4pr/inheritance_management_new_money_problems/",
        "created": 1607302146.0
    },
    {
        "author": "melissamunoz726",
        "created_utc": 1606856846,
        "id": "k4u5kc",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "\nJust got into investing this year (I’m 28) reading, learning, watching, &amp; bought very few shares &amp; an index fund within the last 2 weeks. I funded my fidelity account around $300, so nothing too crazy. I plan to hold my shares long term &amp; consistently invest in my index fund for the next 7-10 years. \n\nI’m seeing people buy shares &amp; then selling them fast on here. Maybe because of impulse or the rush of emotions. Which I get I have the same emotions seeing my gains go up &amp; down. \n\nI want to avoid taxes too which is why I plan to hold them long term. As much as I want to sell my shares where I do see a profit at times I know I’m going to be taxed because it’s been less than a year. \n\nHow do you get around that? Or are people not aware of that as they’re selling their PLTR’s, MRNA’s?",
        "subreddit": "investing",
        "title": "Short term capital gains &amp; taxes",
        "url": "https://www.reddit.com/r/investing/comments/k4u5kc/short_term_capital_gains_taxes/",
        "created": 1606885646.0
    },
    {
        "author": "filipM99",
        "created_utc": 1607256513,
        "id": "k7sob6",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Hi everybody, \n\nnot sure if this is right place to ask so sorry if not. I want to start my journey of learning how to handle money and got in touch with finance advisor. Guy seems fine and all but I'm still having doubts about whole process, mostly caused by lack of my experience. \n\nHis proposition is following portfolio, with his time-to-time advises about where to move the money around. Does it contain any red flag if meant for 23y with the basic steps covered (emergency fund, living costs, flat..)  with aim to save money for distant future/retirement?\n\nPayment around 450 dollars per month for 20 years, fees 3000 dollars. With following distribution: \n\n* 20,0% Conseq Invest bond fund ISIN: IE0031282662\n* 10,0% Fidelity Global High Yield ISIN: LU0740037022\n* 10,0% Trigea nemovitostní fond (CZK), ISIN: CZ0008043874\n* 10,0% Fidelity Global Property Fund (EUR), ISIN: LU0237698757\n* 10,0% Schroder ISF Global Sustainable Growth (USD), ISIN: LU0557290698\n* 10,0% CS (Lux) Global Value Equity B (EUR), ISIN: LU2066957221\n* 7,5% Aberdeen European Equity Fund (EUR), ISIN: LU0094541447\n* 7,5% Fidelity European Dynamic Growth (EUR), ISIN: LU0261959422\n* 7,5% BGF World Healthscience (USD), ISIN: LU0122379950\n* 7,5% Franklin Technology (USD), ISIN: LU0109392836",
        "subreddit": "investing",
        "title": "Fund portfolio in czech republic",
        "url": "https://www.reddit.com/r/investing/comments/k7sob6/fund_portfolio_in_czech_republic/",
        "created": 1607285313.0
    },
    {
        "author": "dbh2",
        "created_utc": 1607434278,
        "id": "k946wz",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Re-posted from daytrading, since it seems that it isn't the right subreddit. Sorry!\n--\n\nI use Ally now. Interface seems to work really well. It's polished and clean.\n\nI'm just wishing it had more on one pane of glass so to speak, so I can do what I need. My colleague has TOS open and it looks pretty sweet. CNBC stream works well too. \n\nConsidering switching there, but a few other buddies of mine say they like the Fidelity app. And one other buddy swears his soul on ETRADE.\n\nHow do you pick one, and/or what should I be looking for? I really only deal in shares and like to just do research and follow things. I'm not really day-trading. I usually am in a position for days to months, not minutes or hours.\n\nFWIW, I'm looking at moving about $45k of investments, if that helps.",
        "subreddit": "investing",
        "title": "How do you pick what org to go with for trading?",
        "url": "https://www.reddit.com/r/investing/comments/k946wz/how_do_you_pick_what_org_to_go_with_for_trading/",
        "created": 1607463078.0
    },
    {
        "author": "lewilewwho",
        "created_utc": 1607131758,
        "id": "k6yb14",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "Fidelity zero funds",
        "url": "https://www.reddit.com/r/investing/comments/k6yb14/fidelity_zero_funds/",
        "created": 1607160558.0
    },
    {
        "author": "honeykrepe",
        "created_utc": 1607325870,
        "id": "k8c20k",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "I'm interested in buying some shroom stocks, but my bank won't let me buy some of these because they are low prices securities. If I buy shares through fidelity and hold onto it until it becomes available to trade on my banking platform, can I eventually transfer those from fidelity to my bank?",
        "subreddit": "shroomstocks",
        "title": "Transferring Stocks from one platform to another",
        "url": "https://www.reddit.com/r/shroomstocks/comments/k8c20k/transferring_stocks_from_one_platform_to_another/",
        "created": 1607354670.0
    },
    {
        "author": "purpleyak0",
        "created_utc": 1607289733,
        "id": "k82dkw",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Hi, I am looking to transfer my regular stock portfolio (taxable) out of Firstrade to Fidelity but I am apprehensive about the move. I have been w/ Firstrade for over a decade but too many instances of meh customer service and outdated website security have me looking elsewhere. Anyone recently transfer out of Firstrade, if so how was the experience? \n\nHere are some of my main questions... \n\n1) Did Firstrade liquidate fractional shares from stocks w/ DRIP or over the counter or international stocks as a part of the transfer? \n\n2) Were cost basis records successfully transferred, or was it an accounting nightmare come tax time? \n\n3) Was the transfer smooth (taking ~6 business days) or was it exceptionally slow (weeks?) or required additional paperwork?\n\nThus far I have closed all open orders, sold all my oldest shares (&gt;3 years held), copied transaction history/cost basis notes, and made copies of all tax and monthly statements. Any other steps to consider so the process is clean and less stressful?",
        "subreddit": "investing",
        "title": "Any experiences transferring out of Firstrade?",
        "url": "https://www.reddit.com/r/investing/comments/k82dkw/any_experiences_transferring_out_of_firstrade/",
        "created": 1607318533.0
    },
    {
        "author": "CrawlThroughKnives",
        "created_utc": 1607174755,
        "id": "k77ft3",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "Can someone explain something fishy: How does FSKAX - Fidelity Total Market go up by 1.05% but FZROX - Fidelity Zero Total Market goes down by .30%? They are both supposed to be Total Market",
        "url": "https://www.reddit.com/r/investing/comments/k77ft3/can_someone_explain_something_fishy_how_does/",
        "created": 1607203555.0
    },
    {
        "author": "biggertaint",
        "created_utc": 1606962908,
        "id": "k5oi1p",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I have a 401(k) set up with Vanguard and an individual broker acct setup with Fidelity.  \n\nI anticipate rolling over my Roth 401(k) \\~eventually\\~ into a Roth IRA and am curious to hear the benefits/drawbacks of starting that Roth IRA account with Vanguard versus Fidelity.  I've heard the rollover can get a little shifty, so I'm wondering if it would make it any easier to stick with the same company or not...\n\nWill it be costly to roll over the Vanguard 401(k) to a Fidelity IRA?\n\nI'd like to open the Roth IRA asap so the 5 year period in which I can't withdraw funds is over asap.  \n\nThanks",
        "subreddit": "investing_discussion",
        "title": "Which broker for a Roth IRA?",
        "url": "https://www.reddit.com/r/investing_discussion/comments/k5oi1p/which_broker_for_a_roth_ira/",
        "created": 1606991708.0
    },
    {
        "author": "SWok68",
        "created_utc": 1606844883,
        "id": "k4px2l",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Sorry to take up time , but is anyone know if ETRADE is doing the ABNB IPO i saw fidelity is but I cant find it on Etrade...thank you for your time!",
        "subreddit": "wallstreetbets",
        "title": "ETrade ABNB IPO",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k4px2l/etrade_abnb_ipo/",
        "created": 1606873683.0
    },
    {
        "author": "melissamunoz726",
        "created_utc": 1606856654,
        "id": "k4u3cx",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Just got into investing this year (I’m 28) reading, learning, watching, &amp; bought very few shares &amp; an index fund within the last 2 weeks. I funded my fidelity account around $300, so nothing too crazy. I plan to hold my shares long term &amp; consistently invest in my index fund for the next 7-10 years. \n\nI’m seeing people buy shares &amp; then selling them fast on here. Maybe because of impulse or the rush of emotions. Which I get I have the same emotions seeing my gains go up &amp; down. \n\nI want to avoid taxes too which is why I plan to hold them long term. As much as I want to sell my shares where I do see a profit at times I know I’m going to be taxed because it’s been less than a year. \n\nHow do you get around that? Or are people aware of that?",
        "subreddit": "StockMarket",
        "title": "Short term capital gains &amp; taxes",
        "url": "https://www.reddit.com/r/StockMarket/comments/k4u3cx/short_term_capital_gains_taxes/",
        "created": 1606885454.0
    },
    {
        "author": "diglig",
        "created_utc": 1607352942,
        "id": "k8i1hh",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "RobinHood",
        "title": "Robinhood crashing left and right this morning. Time to switch to Fidelity or something more stable.",
        "url": "https://www.reddit.com/gallery/k8i1hh",
        "created": 1607381742.0
    },
    {
        "author": "johndoyle33",
        "created_utc": 1606897729,
        "id": "k55i9n",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "The basic premise is that you follow a trader and using api keys make identical trades. So you can find the top traders and follow their trades.\n\n&amp;#x200B;\n\nI interviewed for a company like this back in 2006 in Palo Alto but I think they eventually got acquired.",
        "subreddit": "investing",
        "title": "Is there a service like etoro or shrimpy but for stocks?",
        "url": "https://www.reddit.com/r/investing/comments/k55i9n/is_there_a_service_like_etoro_or_shrimpy_but_for/",
        "created": 1606926529.0
    },
    {
        "author": "fratbull67",
        "created_utc": 1606838959,
        "id": "k4ntrx",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " \n\nMomentus – (Stable Road Acquistion)\n\n[https://momentus.space/](https://momentus.space/)\n\nMomentus is a commercial space company that offers various services of in-space transportation and infrastructure services.\n\n“Momentus is creating the first hub and spoke model in space by offering last-mile delivery in partnership with key launch operators, including SpaceX. Momentus offers its customers significantly more affordable access to space by combining the capabilities of low-cost launch vehicles and Momentus’ transport and service vehicles, powered by water plasma propulsion technology. Momentus plans to expand its offerings by providing a satellite as a service model for hosted payloads and an in-orbit service model for satellite deorbiting, life extension, refueling, and repositioning. In 2019, the Company successfully tested its water plasma propulsion technology in space.”\n\nMomentus holds key partnerships with leaders in the aerospace industry, SpaceX, Lockheed Martin, and NASA\n\nThe global space economy is expected to grow from an estimated $415 billion to $1.4 trillion by 2030.\n\nThe company currently offers: “ in-space transportation, satellite as a service, and in-orbit services”\n\nMomentus is RAPIDLY expanding the small satellite market, which is in current high demand.\n\nMomentus with the global leaders in the aerospace industry, next generation technologies, and an expanding market in space technologies and exploration hold the keys to be a leader in global space transportation.\n\nStock information\n\nStable Road Acquisition and Momentus are in a definitive merger agreement, to create the first publicly traded space infrastructure company. Momentus will have a in cash balance of approx. $310 million, 172.5M cash held in a trust funded by Stable Road’s and 175M from a committed common stock PIPE at $10.00 a share.\n\nMomentus will have a market cap value of 1.2B at time of merger.\n\nThey are forecasting to have positive cash flow by 2023 and have annual revenues of 500M or exceed 500M.\n\nCompetitors in this market: possibly Virgin Galactic, Blue Origin, Boeing.\n\n[https://www.cnbc.com/2020/10/07/momentus-the-latest-space-stock-mnts-through-spac-deal.html#:\\~:text=Momentus%20pitches%20itself%20as%20a,revenue%20will%20exceed%20%24500%20million](https://www.cnbc.com/2020/10/07/momentus-the-latest-space-stock-mnts-through-spac-deal.html#:~:text=Momentus%20pitches%20itself%20as%20a,revenue%20will%20exceed%20%24500%20million).\n\n[https://www.businesswire.com/news/home/20201007005323/en/Momentus-to-Become-Public-Through-Merger-With-Stable-Road-Acquisition-Corp](https://www.businesswire.com/news/home/20201007005323/en/Momentus-to-Become-Public-Through-Merger-With-Stable-Road-Acquisition-Corp).\n\nMerger to happen early 2021, so Stable Road Acquisition Feb 19, 2021 20c",
        "subreddit": "wallstreetbets",
        "title": "Momentus DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k4ntrx/momentus_dd/",
        "created": 1606867759.0
    }
]