[
    {
        "author": "FundamentalsInvestor",
        "created_utc": 1586136962,
        "id": "fvppxq",
        "num_comments": 177,
        "num_crossposts": 0,
        "selftext": "Things continue to go well.  March was a great month, with most of my earlier [COVID-19 picks](https://www.reddit.com/r/stocks/comments/fp1yrx/my_march_25_covid19_stock_picks/?depth=2) going as expected and last week I got lucky going long oil.  This post is to share my next round of picks.  I will rotate my portfolio to ~10 long positions and ~3 short for next month.  Overall, my view is a rebound of broad US equity market +15% next two months, +25% by end of year.  I think the virus will hit hard in emerging markets and India and LatAm are going to get hammered.\n\n**Longs:  Marriott, Qualcomm, Twitter, Boeing, LibertyTripAdvisor, Cintas, TemperSeally**\n\n**Shorts:  Gold, VXX, Conagra, EWZ (Brazil), Inda (India)**\n\nFor some reason, Google sheets is not updating tonight so a few show blanks so pardon that error, but here are my [picks in Google sheets shared view](https://docs.google.com/spreadsheets/d/1ydAwqDUUAQ0M5R5_AkJVve-edsM7s1o0Ksh-710w5ps/edit?usp=sharing) and an \n[Image of same](https://i.imgur.com/zhFzIhJ.png)\n\nLet me know what you think!\n\nPS Dow is up [+550 in pre-market](https://www.investing.com/indices/us-30-futures) as of 930pm!!",
        "subreddit": "stocks",
        "title": "My April 05 Covid-19 Stock Picks",
        "url": "https://www.reddit.com/r/stocks/comments/fvppxq/my_april_05_covid19_stock_picks/",
        "created": 1586165762.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1587823275,
        "id": "g7tz2d",
        "num_comments": 59,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/wallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning April 27th, 2020.\n\n# **Stocks face headwinds as investors look forward to a big earnings week, a Fed meeting and state reopenings  - [(Source)](https://www.cnbc.com/2020/04/24/stocks-face-headwinds-as-investors-look-forward-to-a-big-earnings-week-a-fed-meeting-and-state-reopenings.html)**\n*****\n&gt; The stock market is struggling to make headway, as a big week of events rolls around, including a Federal Reserve meeting, the first look at post-shutdown economic growth and earnings from more than a fifth of the S&amp;P 500 companies.\n*****\n&gt; It’s a busy week for earnings, and some of the biggest blue chips are likely to join the growing list of companies withdrawing guidance amid the uncertainty of how the coronavirus and shutdowns are impacting their business. Apple, Microsoft, Amazon, Facebook, Boeing and McDonald’s are among about 140 S&amp;P 500 companies reporting first quarter results.\n*****\n&gt; Investors will also be watching the progress of the reopening of business activity in some states, like Georgia, Texas, Oklahoma and South Carolina. At the same time, President Donald Trump said he may extend social distancing guidelines into early summer. Many states, including the hardest hit, remain completely shut down.\n*****\n&gt; Stocks were higher Friday, but the major indices had their first negative week in three as oil prices cratered and then steadied in the mid-teens. The S&amp;P 500 has been trading on both sides of the key 2,800 level, as investors focused on murky corporate outlooks and uncertainty surrounding the timing of the reopening of the economy. Even though several states are resuming some activities, Trump said he disagreed with Georgia’s plan to reopen.\n*****\n&gt; On Friday, the S&amp;P closed at 2,836, down 1.3% for the week.\n*****\n&gt; Earnings for the first quarter have been bleak so far, down about 14% based on estimates and actual reports, according to Refinitiv. Second quarter results are expected to be far worse, declining 32.2%.\n*****\n&gt; “If you take a look where the real battle is in the market, it’s a fundamental story,” said Jonathan Golub, chief U.S. equity strategist at Credit Suisse. “The fundamentals are that the market should be lower, and on the other hand, the Fed is kind of putting their thumb on the scale in favor of the market.”\n*****\n&gt; Golub said it’s the potential for recurrences of the outbreak that’s being watched to see if businesses can remain open once they start back up. “People are watching what’s going on in places like Georgia, but they’re also watching what’s going on in Singapore and places in Asia that are opening up,” he said. “At the end of the day, there’s really one thing that really matters. It’s not the Fed. The virus is going to own the agenda, whether we want it to or not.”\n*****\n&gt; # Fed bazooka\n&gt; The Fed meets Tuesday and Wednesday, and while it’s not expected to take any new action, it will likely discuss the many programs it quickly rolled out to support the economy and provide liquidity.\n*****\n&gt; “I’m anticipating no actions in terms of anything with purchases or interest rate movements,” said Luke Tilley, chief economist at Wilmington Trust. “I think we’re going to hear a lot more in terms of their description of what’s working and the things that still need to happen.”\n*****\n&gt; Tilley said the Fed’s job is also to instill confidence, and its asset purchase and other programs to support mortgages, corporate credit and municipal bonds, helped bring back in spreads that had been widening out across the credit markets. “It looked like we were headed for a seizure in credit markets, but they’ve come back in,” he said, adding he expects the Fed to also discuss programs like its support for the small business lending program.\n*****\n&gt; Fed Chairman Jerome Powell is also expected to sound optimistic about the central bank’s ability to help the economy, despite the uncertainty as the economy falls into an unprecedented decline in the second quarter. Tilley said he expects the economy to contract in the second quarter by 40%.\n*****\n&gt; Golub said this Fed meeting isn’t as important as others have been, since the central bank has already taken so many extraordinary policy steps and promises to do more as needed.\n*****\n&gt; “The Fed has made it clear if they need to provide liquidity to the market, they’re not going to wait for a meeting to do it,” he said. “Whether you’re borrowing from a bank or whether you’re borrowing in the capital markets, that capital is available so the economy can move ... the net effect is it also pushes the stock market up.”\n*****\n&gt; # Economic impact\n&gt; First quarter gross domestic product numbers are expected Wednesday, and it will be the first look at how the early weeks of the shutdown impacted the broader economy. Forecasts are wide ranging, and the consensus forecast from Refinitiv is now for a contraction of 4.1%. Economists expect the second quarter to take the biggest hit of the recession, and it is forecast by many to show a contraction of more than 30%.\n*****\n&gt; Some of the early second-quarter data will be released in the coming week. Vehicle sales slowed to a trickle in April, and auto makers shut down production.\n*****\n&gt; The impact of that should show up in Friday’s April vehicle sales and ISM manufacturing, but the single-most important data point will be Thursday’s weekly jobless claims, expected again to show millions of workers signed up for unemployment benefits.\n*****\n&gt; So far, 26.5 million unemployment claims have been filed in the last five weeks, wiping out all the job gains made since the end of the Great Recession. The employment report for April will be released on May 8, and economists say unemployment will likely peak in April or May before falling off.\n*****\n&gt; “We’ll probably see an unemployment rate at 20% or a little higher,” Tilley said.\n*****\n&gt; # Earnings\n&gt; Earnings reports are expected from a range of industries, such as tech, health care, energy and defense. Merck, Pfizer, AstraZeneca, Humana and Anthem are among health care names reporting. Big oil companies, Exxon Mobil and Chevron both release results on Friday, and their comments on how they are reacting to the shocking decline in crude oil prices this past week will be important.\n*****\n&gt; An oil futures contract for May dove into negative territory Monday and Tuesday, as did prices in many spot markets. That contract expired Tuesday, and the June futures contract for West Texas Intermediate settled at $16.94 per barrel Friday, down about 7.3% for the week and about $5 lower than the price of Brent futures.\n*****\n&gt; “The most important earnings story is not what happens this quarter, It’s how long does it take to get back to peak earnings again,” said Golub. “My estimate is this is going to take three years to get back to peak profits. But the estimates right now are reflecting that it’s going to turn back to normal by something closer to the third quarter of next year. I think that’s too optimistic.The second part of the earnings story is how fast estimates are coming down.”\n*****\n&gt; He said first quarter earnings per share look to be down a little more than 12%, though some estimates have them down 16% or 17%. “We had 10 very healthy weeks and three not healthy weeks. The fact you could have such a negative quarter with only three bad week, that’s really bad.” Golub said. His forecast is for a 40% decline in second quarter profits.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/3vJvFZR.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/B4Di7Fh.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/7XXBq3H.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/QyE3rll.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/jyp5KqQ.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/fCYKkgg.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/PdPKvec.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/sEY6EDm.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/KKMTHHH.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/y2laKRP.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/QuCVREP.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/gkpOUiT.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/GrUMf6m.png))**\n\n*****\n\n# Election-year Mays: DJIA’s Second Worst Month\n\n&gt; May officially marks the beginning of the “Worst Six Months” for the DJIA and S&amp;P. To wit: “Sell in May and go away.” Our “Best Six Months Switching Strategy,” created in 1986, proves that there is merit to this old trader’s tale. A hypothetical $10,000 investment in the DJIA compounded to a gain of $1,068,826 for November-April in 69 years compared to just $1,461 for May-October. The same hypothetical $10,000 investment in the S&amp;P 500 compounded to $823,326 for November-April in 69 years compared to a gain of just $9,537 for May-October.\n\n&gt; May has been a tricky month over the years, a well-deserved reputation following the May 6, 2010 “flash crash”. It used to be part of what we called the “May/June disaster area.” From 1965 to 1984 the S&amp;P 500 was down during May fifteen out of twenty times. Then from 1985 through 1997 May was the best month, gaining ground every single year (13 straight gains) on the S&amp;P, up 3.3% on average with the DJIA falling once and two NASDAQ losses.\n\n&gt; In the years since 1997, May’s performance has been erratic; DJIA up eleven times in the past twenty-two years (three of the years had gains in excess of 4%). NASDAQ suffered five May losses in a row from 1998-2001, down – 11.9% in 2000, followed by twelve sizable gains in excess of 2.5% and five losses, the worst of which was 8.3% in 2010. Election Year Mays rank at or near the bottom, registering net losses on DJIA and S&amp;P 500 (since 1952), NASDAQ (since 1972) and Russell 1000 and 2000 (since 1980).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/fac23214c1353f0b68d7710f6f7886a1/2eed74513d6bc154-86/s400x600/2540f531fb63ceab611b44ad7e0a2c0165670319.jpg))**\n\n*****\n\n# LPL Office Talk: Putting The Rally In Perspective\n\n&gt; One month ago today the S&amp;P 500 Index bottomed after a vicious bear market. Was this the ultimate bottom? We’ll have to wait and see, but what we do know is the rally we’ve seen over the past month is nearly as historic as the drop coming into it was.\n\n&gt; “We recently had the best 20-day rally for the S&amp;P 500 since March 2009 and one of the best ever,” explained LPL Financial Senior Market Strategist Ryan Detrick. “Looking back at the previous best 20-day rallies, one thing is consistent: very strong returns going out a year.”\n\n&gt; As shown in the LPL Chart of the Day, the 10 previous best 20-day rallies for the S&amp;P 500 saw continued gains after some near-term volatility. In fact, six months later stocks were higher 9 of 10 times and a full year later higher 10 of 10 times.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/04/Picture-4.23.20.png?ssl=1))**\n\n*****\n\n# Why The Recent Strength Has Bulls Smiling\n\n&gt; The huge equity rally continued last week, with the S&amp;P 500 Index up another 3%, on the heels of adding more than 15% in the previous week. The gain during the past two weeks of 15.5% was the greatest since October 1974. Taking it a step further, the 15 trading days ending April 14 saw the S&amp;P 500 up more than 27%, one of the greatest rallies ever. What we’ve been seeing is truly historic, so the big question now is: What could happen next?\n\n&gt; “This remarkable rally has caught most off guard, but what might surprise many to hear is more gains could eventually be in store in 2020,” explained LPL Financial Senior Market Strategist Ryan Detrick. “When we’ve seen similar blasts of extreme short-term strength, stocks have been quite strong going out 6- to 12-months.”\n\n&gt; As shown in the LPL Chart of the Day, the S&amp;P 500 was up nine of 10 times six months later and higher every single time a year later after the previous best 15-day gains ever. Be aware though, some of the returns in the near-term were weak, suggesting a pullback after such a strong move is likely. Still, this much strength in such a short timeframe could very well suggest the rest of 2020 could have bulls smiling.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/04/Market-returns-4.20.20.png?ssl=1))**\n\n*****\n\n# Dogs of the Dow Performance So Far in 2020\n\n&gt; The average stock in the Dow Jones Industrial Average is down 16.24% on a total return basis so far in 2020. Below we take a look at how the \"Dogs of the Dow\" strategy has performed so far this year.\n\n&gt; The \"Dogs of the Dow\" strategy is a very passive approach that simply says to buy the 10 stocks in the Dow 30 that have the highest dividend yields at the start of each year. The Dogs list for 2020 was led by Dow Inc. (DOW) with a yield of 5.12% on January 1st. Exxon Mobil (XOM), IBM, Verizon (VZ), Chevron (CVX), Pfizer (PFE), 3M (MMM), Walgreens (WBA), Cisco (CSCO), and Coca-Cola (KO) are the nine other members of the Dogs for 2020.\n\n&gt; As shown in the table below, the Dogs are down an average of 19.37% on a total return basis in 2020, which is a little less than five percentage points worse than the 14.68% decline seen for the 20 non-Dogs this year. Dow Inc. (DOW) and Exxon Mobil (XOM) have been the two worst performing Dogs with respective YTD declines of 39.9% and 37.0%. Dow's dividend yield has risen from 5.12% up to 8.47%, while XOM's yield has risen from 4.99% up to 7.91%. There are no Dogs that are up on the year, but Verizon (VZ) and Pfizer (PFE) have been the best performers of the group with YTD declines of less than 5%.\n\n&gt; Of the non-Dogs, Boeing (BA) has been by far the worst performer with a YTD decline of 60.01%. At the start of 2020, BA had a dividend yield of 2.52%, but that dividend has been suspended. JP Morgan (JPM), American Express (AXP) and Disney (DIS) have all fallen more than 30% YTD, while Johnson &amp; Johnson (JNJ), Walmart (WMT), and Microsoft (MSFT) are the only three Dow stocks that are up on the year.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/2020dogs.png))**\n\n*****\n\n# Investors Giving Companies a Pass on Earnings So Far\n\n&gt; We're now two weeks into the Q1 2020 earnings season, and just over 200 companies have reported their numbers so far. The average one-day price change for the stocks that have reported earnings so far this season has been a gain of 0.89%. That's much stronger than the average one-day gain of 0.06% seen for all stocks that have reported earnings since 2001.\n\n&gt; As shown below, stocks that have beaten EPS estimates this season have averaged a one-day price gain of 2.16% on their earnings reaction days. That's stronger than the average one-day gain of 1.89% seen on earnings reaction days for all stocks that have reported since 2001. Stocks that have missed EPS estimates this season have seen a one-day decline of 0.72% on their earnings reaction days. Historically, the average stock that has missed EPS has fallen 3.56% on its earnings reaction day, so this season's decline of just 0.72% suggests that investors are basically giving a pass to companies missing estimates in Q1.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/avgearn.png))**\n\n*****\n\n# Next Week's Economic Indicators\n\n&gt; Even though most economic data releases this week that had forecasts exceeded those estimates (10 of 15), data continues to come in very weak. The Chicago Fed’s National Activity index started off the week coming in at –4.19 which was well below estimates of –3. Existing home sales followed up on Tuesday, and despite coming in above estimates, sales slowed considerably from February. Elsewhere in housing data, new home sales collapsed down to 627K SAAR compared to 765K last month. Meanwhile, February home prices showed some acceleration. Jobless claims also were better than expected, but they too remain at extremely elevated levels relative to the rest of history. Manufacturing data was a major area of weakness this week. Both the preliminary Markit PMI and Kansas City Fed reading fell significantly despite coming in better than forecast. Hard manufacturing data on Friday was likewise bad at the headline level though under the hood there were some silver linings.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/eco-1.png))**\n\n&gt; Turning to next week, like the earnings calendar, the economic calendar ramps up with a total of 34 releases. We will get the final two regional Federal Reserve indices from Dallas and Richmond on Monday and Tuesday, respectively, followed by the final Markit and ISM reading for April on Friday. Wednesday will be the most closely watched day of the week with the first release of Q1 GDP as well as an FOMC rate decision. Growth in the first quarter is expected to show a 3.8% contraction. Although no change in rates is being forecast, Fed Chair Powell’s following presser will likely be closely watched for a monetary policy update.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/eco-2.png))**\n\n*****\n\n# Biggest Companies Reporting Earnings Next Week (AAPL, AMZN, MSFT and More)\n\n&gt; The earnings calendar has begun to ramp up over the past two weeks and over the next two weeks we will see peak earnings season. Next week there are a total of 784 companies scheduled to release earnings. Of those, there are 178 S&amp;P 500 stocks, which is 35.% of the index.\n\n&gt; In the table below we show the 30 largest stocks (by market cap) that are scheduled to report next week. None of the largest stocks report on Monday, but the two Dow pharmaceutical stocks, Merck (MRK) and Pfizer (PFE), kick things off Tuesday morning. The trillion dollar market cap club will all report next week with Microsoft (MSFT) out with earnings Wednesday night and Apple (AAPL) and Amazon (AMZN) out the following evening. Two other notable releases Wednesday and Thursday, respectively, will be the major payment processors Visa (V) and Mastercard (MA). Friday will be capped off with two oil giants: Exxon Mobil (XOM) and Chevron (CVX). Other honorable mentions not on this list reporting next week include industrial bell-weather Caterpillar (CAT), stocks likely benefiting from the COVID economy like Colgate Palmolive (CL) and Clorox (CLX), and finally, some travel and leisure stocks like Expedia (EXPE), Royal Caribbean (RCL), United Airlines (UAL), and Southwest Airlines (LUV).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/Earnings-table.png))**\n\n*****\n\n# Gold Bounces Right Where It Was Supposed To\n\n&gt; With central banks around the world unleashing waves of liquidity, there have been heightened concerns that one result will be a decline in the purchasing power of our money. For that reason, a number of investors have been flocking to gold. Even before the COVID-19 crisis, gold prices had been in a solid uptrend, and while prices spiked as the crisis first began, they couldn't quite get above the $1,650 - $1,700 range. In mid-March even, prices plummeted with just about every other financial asset before quickly recovering. Once again, though, the rally stalled at resistance. This time around, though, the 50-day moving average was strong enough to provide support and after that test, gold finally got the long-awaited breakout that investors had been waiting for.\n\n&gt; Gold's price spiked as high as $1,787 per ounce in mid-April before running out of momentum. When a stock or commodity breaks out above resistance to new highs and then pulls back, the former resistance level should act as support, and that is exactly what we saw this time around. This week, gold bounced right on cue at around $1,700 and has since rallied 2.6%. With the first test of support proving successful, look for gold to now establish a new range with a floor at around $1,700. At least that's what the technical analysis textbooks would say.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/042320-Gold.png))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$AMZN** \n&gt; * **$TSLA** \n&gt; * **$MSFT** \n&gt; * **$AAPL** \n&gt; * **$AMD** \n&gt; * **$BA** \n&gt; * **$FB** \n&gt; * **$LUV** \n&gt; * **$MMM** \n&gt; * **$GE** \n&gt; * **$AAL** \n&gt; * **$UPS** \n&gt; * **$TWTR** \n&gt; * **$PFE** \n&gt; * **$CBSH** \n&gt; * **$PEP** \n&gt; * **$MA** \n&gt; * **$GOOGL** \n&gt; * **$GILD** \n&gt; * **$SBUX** \n&gt; * **$UAL** \n&gt; * **$V** \n&gt; * **$SPOT** \n&gt; * **$MCD** \n&gt; * **$XOM** \n&gt; * **$F** \n&gt; * **$CAT** \n&gt; * **$TDOC** \n&gt; * **$AMAT** \n&gt; * **$AWI** \n&gt; * **$CHKP** \n&gt; * **$MRK** \n&gt; * **$ABBV** \n&gt; * **$WHR** \n&gt; * **$QCOM** \n&gt; * **$BP** \n&gt; * **$KHC** \n&gt; * **$CLX** \n&gt; * **$HAS** \n&gt; * **$ANTM** \n&gt; * **$NOK** \n&gt; * **$CMS** \n&gt; * **$CNX** \n&gt; * **$APRN**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/KKMTHHH.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/lRp3xer.png))**\n###### **([CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES BEFORE MONDAY'S OPEN!](https://i.imgur.com/Yw1LKpH.jpg))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 4.27.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/HW4ersg.png))\n\n\n&gt; # ***Monday 4.27.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/KnhCH1m.png))\n\n\n*****\n\n&gt; # ***Tuesday 4.28.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/XeUrTNF.png))\n\n&gt; # ***Tuesday 4.28.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/20sK5un.png))\n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/QXrGzmn.png))\n\n*****\n\n&gt; # ***Wednesday 4.29.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/tSP1S0Y.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/Sn4QllI.png))\n\n&gt; # ***Wednesday 4.29.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/DhxQrOU.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/1CpjzdJ.png))\n\n*****\n\n&gt; # ***Thursday 4.30.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/raeflTF.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/43jb0Pu.png))\n\n&gt; # ***Thursday 4.30.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/axhdXpO.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/wiL7F9e.png))\n\n*****\n\n&gt; # ***Friday 5.1.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/HZkJ2ai.png))\n\n*****\n\n&gt; # ***Friday 5.1.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# Amazon.com, Inc. -\n&gt; **Amazon.com, Inc. (AMZN)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, April 30, 2020. The consensus earnings estimate is $6.35 per share on revenue of $73.42 billion and the Earnings Whisper ® number is $6.84 per share. Investor sentiment going into the company's earnings release has 80% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 11.81% with revenue increasing by 22.98%. Short interest has increased by 29.4% since the company's last earnings release while the stock has drifted higher by 17.5% from its open following the earnings release to be 29.0% above its 200 day moving average of $1,868.70. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, April 24, 2020 there was some notable buying of 3,068 contracts of the $2,400.00 call expiring on Friday, May 1, 2020. Option traders are pricing in a 7.2% move on earnings and the stock has averaged a 4.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AMZN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Tesla, Inc. $725.15\n&gt; **Tesla, Inc. (TSLA)** is confirmed to report earnings at approximately 4:15 PM ET on Wednesday, April 29, 2020. The consensus estimate is for a loss of $0.18 per share on revenue of $5.71 billion and the Earnings Whisper ® number is ($0.27) per share. Investor sentiment going into the company's earnings release has 25% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 92.31% with revenue increasing by 25.73%. Short interest has decreased by 21.1% since the company's last earnings release while the stock has drifted higher by 14.7% from its open following the earnings release to be 74.4% above its 200 day moving average of $415.82. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, April 24, 2020 there was some notable buying of 4,971 contracts of the $800.00 call expiring on Friday, May 1, 2020. Option traders are pricing in a 13.8% move on earnings and the stock has averaged a 9.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TSLA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Microsoft Corp. $174.55\n&gt; **Microsoft Corp. (MSFT)** is confirmed to report earnings at approximately 4:20 PM ET on Wednesday, April 29, 2020. The consensus earnings estimate is $1.27 per share on revenue of $34.05 billion and the Earnings Whisper ® number is $1.34 per share. Investor sentiment going into the company's earnings release has 74% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 11.40% with revenue increasing by 11.38%. Short interest has decreased by 7.7% since the company's last earnings release while the stock has drifted higher by 0.3% from its open following the earnings release to be 14.9% above its 200 day moving average of $151.97. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, April 24, 2020 there was some notable buying of 25,039 contracts of the $172.50 put expiring on Friday, May 15, 2020. Option traders are pricing in a 5.7% move on earnings and the stock has averaged a 2.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MSFT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Apple, Inc. $282.97\n&gt; **Apple, Inc. (AAPL)** is confirmed to report earnings at approximately 4:30 PM ET on Thursday, April 30, 2020. The consensus earnings estimate is $2.10 per share on revenue of $54.00 billion and the Earnings Whisper ® number is $2.25 per share. Investor sentiment going into the company's earnings release has 29% expecting an earnings beat The company's guidance was for earnings of $2.74 to $3.17 per share. Consensus estimates are for earnings to decline year-over-year by 14.63% with revenue decreasing by 6.92%. Short interest has decreased by 6.1% since the company's last earnings release while the stock has drifted lower by 12.8% from its open following the earnings release to be 10.8% above its 200 day moving average of $255.39. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, April 23, 2020 there was some notable buying of 17,749 contracts of the $300.00 call expiring on Friday, May 1, 2020. Option traders are pricing in a 5.2% move on earnings and the stock has averaged a 4.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AAPL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Advanced Micro Devices, Inc. $56.18\n&gt; **Advanced Micro Devices, Inc. (AMD)** is confirmed to report earnings at approximately 4:15 PM ET on Tuesday, April 28, 2020. The consensus earnings estimate is $0.18 per share on revenue of $1.78 billion and the Earnings Whisper ® number is $0.19 per share. Investor sentiment going into the company's earnings release has 67% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 200.00% with revenue increasing by 39.94%. Short interest has decreased by 24.4% since the company's last earnings release while the stock has drifted higher by 17.4% from its open following the earnings release to be 40.4% above its 200 day moving average of $40.01. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, April 15, 2020 there was some notable buying of 54,202 contracts of the $55.00 call and 47,486 contracts of the $55.00 put expiring on Friday, May 15, 2020. Option traders are pricing in a 9.8% move on earnings and the stock has averaged a 9.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AMD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Boeing Co. $128.98\n&gt; **Boeing Co. (BA)** is confirmed to report earnings at approximately 7:30 AM ET on Wednesday, April 29, 2020. The consensus estimate is for a loss of $2.04 per share on revenue of $17.17 billion and the Earnings Whisper ® number is ($2.21) per share. Investor sentiment going into the company's earnings release has 11% expecting an earnings miss. Consensus estimates are for earnings to decline year-over-year by 164.56% with revenue decreasing by 25.08%. Short interest has increased by 85.7% since the company's last earnings release while the stock has drifted lower by 60.2% from its open following the earnings release to be 58.5% below its 200 day moving average of $310.71. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, April 17, 2020 there was some notable buying of 16,626 contracts of the $150.00 call expiring on Friday, May 15, 2020. Option traders are pricing in a 12.0% move on earnings and the stock has averaged a 2.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Facebook Inc. $190.07\n&gt; **Facebook Inc. (FB)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, April 29, 2020. The consensus earnings estimate is $1.76 per share on revenue of $17.61 billion and the Earnings Whisper ® number is $1.81 per share. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 107.06% with revenue increasing by 16.80%. Short interest has increased by 20.4% since the company's last earnings release while the stock has drifted lower by 8.0% from its open following the earnings release to be 0.3% below its 200 day moving average of $190.55. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, April 14, 2020 there was some notable buying of 13,018 contracts of the $350.00 call expiring on Friday, January 21, 2022. Option traders are pricing in a 8.0% move on earnings and the stock has averaged a 5.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FB&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Southwest Airlines Co. $29.33\n&gt; **Southwest Airlines Co. (LUV)** is confirmed to report earnings at approximately 6:30 AM ET on Tuesday, April 28, 2020. The consensus estimate is for a loss of $0.48 per share on revenue of $5.01 billion and the Earnings Whisper ® number is ($0.46) per share. Investor sentiment going into the company's earnings release has 23% expecting an earnings miss. Consensus estimates are for earnings to decline year-over-year by 168.57% with revenue decreasing by 2.70%. Short interest has decreased by 47.9% since the company's last earnings release while the stock has drifted lower by 44.7% from its open following the earnings release to be 42.0% below its 200 day moving average of $50.54. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, April 21, 2020 there was some notable buying of 10,235 contracts of the $20.00 put expiring on Friday, January 15, 2021. Option traders are pricing in a 9.7% move on earnings and the stock has averaged a 4.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LUV&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# 3M Company $147.00\n&gt; **3M Company (MMM)** is confirmed to report earnings at approximately 6:30 AM ET on Tuesday, April 28, 2020. The consensus earnings estimate is $2.02 per share on revenue of $8.23 billion and the Earnings Whisper ® number is $2.05 per share. Investor sentiment going into the company's earnings release has 67% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 9.42% with revenue increasing by 4.67%. Short interest has decreased by 23.9% since the company's last earnings release while the stock has drifted lower by 14.5% from its open following the earnings release to be 8.9% below its 200 day moving average of $161.32. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, April 6, 2020 there was some notable buying of 3,493 contracts of the $160.00 call expiring on Friday, May 15, 2020. Option traders are pricing in a 6.5% move on earnings and the stock has averaged a 5.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MMM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# General Electric Co. $6.26\n&gt; **General Electric Co. (GE)** is confirmed to report earnings at approximately 6:30 AM ET on Wednesday, April 29, 2020. The consensus earnings estimate is $0.06 per share on revenue of $20.70 billion and the Earnings Whisper ® number is $0.05 per share. Investor sentiment going into the company's earnings release has 23% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 57.14% with revenue decreasing by 24.14%. Short interest has decreased by 1.3% since the company's last earnings release while the stock has drifted lower by 50.2% from its open following the earnings release to be 37.4% below its 200 day moving average of $10.00. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, April 17, 2020 there was some notable buying of 12,195 contracts of the $6.00 call expiring on Friday, May 15, 2020. Option traders are pricing in a 11.2% move on earnings and the stock has averaged a 7.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=GE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/wallstreetbets.",
        "subreddit": "wallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning April 27th, 2020",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/g7tz2d/wall_street_week_ahead_for_the_trading_week/",
        "created": 1587852075.0
    },
    {
        "author": "ajc1029",
        "created_utc": 1586479348,
        "id": "fy4evw",
        "num_comments": 56,
        "num_crossposts": 0,
        "selftext": "Looking to invest in some high-quality blue chippers to hold for the next 5+ years. Have about 12k to invest, so planning on putting half into individual stocks and the other half into VOO or SPY. Any recommendations/criticisms?\n\nMy picks are:\n\nMSFT\nGOOGL\nBRK.B\nV\nQCOM",
        "subreddit": "stocks",
        "title": "What are your top 4-5 Growth Stocks for the Next 5+ Years?",
        "url": "https://www.reddit.com/r/stocks/comments/fy4evw/what_are_your_top_45_growth_stocks_for_the_next_5/",
        "created": 1586508148.0
    },
    {
        "author": "closingbell",
        "created_utc": 1588191178,
        "id": "gagphq",
        "num_comments": 51,
        "num_crossposts": 0,
        "selftext": "On top of today's already large gains, and with actually reasonable forward looking guidance (even from FB, which rarely provides future looking info).  Read it and *weep*, bears....yet another talking point blowing up in your faces.  How sad.",
        "subreddit": "stocks",
        "title": "QCOM, MSFT and FB all SURGING AH after good earnings",
        "url": "https://www.reddit.com/r/stocks/comments/gagphq/qcom_msft_and_fb_all_surging_ah_after_good/",
        "created": 1588219978.0
    },
    {
        "author": "JasonColin",
        "created_utc": 1588192613,
        "id": "gah5rz",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": " \n\n\\*(According to Tradingview)\n\nWe already know that FB and Microsoft have benefitted from conferencing and everyone staying home during the lockdowns despite both (more the former than the later) having drops earlier this month.\n\nSo the earnings will be up (not that if they were negative it would change much) **so it's a very important thing to consider as the stock prices will likely go up.**\n\nWe already knew of the Qualcomm news with apple and factories in china starting to re-open production, will likely have a decent earnings which means the price will go up.\n\nTSLA is arguably a scam stock depending on who you talk to, but puts rarely if ever, work on it, and it continues to climb. If there is a bubble to pop it won't be happening until it hits around or near $1000 per share.\n\n***SPY was already up pre-market and continued climbing throughout the day today despite higher unemployment numbers, more business closures, and GDP contraction.***\n\nAll 5 will receive an ***additional benefit*** due to Dr.Jerome's **FED Promise Gurantee**, which will involve the fed continuing to pump money into the economy, help banks and larger corporations, and will be purchasing more junk bonds, along with other manipulation tactics.\n\nThis means that if you go in on all 5 of these with calls there is a 89% chance you will be ranking in massive dow either by the end of tomorrow trading day or until the end of Fridays trading day.\n\n**Never before has such a tsunami of money been (Potentially) on the table for free.** The only wild card is how much TSLA will climb, but you could remove that risk and still have a safe money making bet regardless.\n\n*Who is in?*",
        "subreddit": "wallstreetbets",
        "title": "$FB, $MSFT, $QCOM, $TSLA* earnings after hours, and Fed will continue zero interest rates and money printing. All in on calls for all 4 of them, plus calls on $SPY as well. Money Pump Bump!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gah5rz/fb_msft_qcom_tsla_earnings_after_hours_and_fed/",
        "created": 1588221413.0
    },
    {
        "author": "Affiliatebeshoy",
        "created_utc": 1586726220,
        "id": "g0502h",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "Hi guys,   \n\n\nNew Stock investor here, I have been thinking about going into the stock market since the big dip of feb 27, but I didn't know anything about stocks, and I am not US citizen so the process was much more complicated for me, now I am ready to go in, I have 9k USD available to invest and 4k more within 3 weeks (I will still have about 20k USD in saving don't worry).   \n\n\nI know dollar cost average is the way to go and I am planning to do that anyway, but since the market already regained a lot of the loss since the big dip I feel like a lot of the stocks are now overvalued as well, so I am not sure which stock should I start to buy first and which to hold off on, the more I read the more complicated everything seems to get. \n\n&amp;#x200B;\n\nI want my portfolio to consist of blue chip stocks with a lot of room for growth or with steady and increasing dividends, I am ok with the volatility in the short term but I want big gains long term (I will continue investing after the virus is gone), here is the list of stocks that is on my watch list that I thought match my criteria (most of them increased in double digits since I added them on the list so I am no sure anymore),    \n\n\nDIS (Disney) (I know that the parks are closed and their Cruz ships are not operating, but I feel like that will quickly be fixed with vaccine/cure)\n\nMSFT (Microsoft) (Pretty safe and have been growing for the past few years)\n\nQcom (Qualcomm) (it has a lot of ups and downs, but will likely have great revenue from 5G and Autopilot chips). \n\nV (Visa) (Pretty safe and have been growing for the past few years and I think will gain more internationally when people deal more with credit card instead of dirty cash)\n\nMA (MasterCard) (same as visa)\n\nHD (The Home Depot) (Good dividend, increases often, stock price is usually going up, dominant in its market).  \n\nNvidia nvda (still not sure about it, only here because it is dominant in its market).  \n\nShopify (great growth company and I feel they will continue to grow with more people buying online). \n\njnj (possible vaccine, still good company even without one). \n\npep (recession proof, more than just drinks). \n\nsq sqaure ((still not sure about it, only here because they will continue to grow with more people buying online). \n\nfb (growth company as people not really having a negative outlook on it with privacy issues any more)\n\nsbux (I feel like they will come back strong once everything is opened up again). \n\nwalmart (same as sbux).  \n\n\nI know it will be easier to invest in index fund, but I want to go the individual stocks route to increase gains since I will invest a lot of time in the near future to learn everything I can.   \n\n\nAny and all help is appreciated.",
        "subreddit": "stocks",
        "title": "How to choose which stock you should buy first ?",
        "url": "https://www.reddit.com/r/stocks/comments/g0502h/how_to_choose_which_stock_you_should_buy_first/",
        "created": 1586755020.0
    },
    {
        "author": "VeryTiredDad",
        "created_utc": 1585766328,
        "id": "ft5v92",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "I’m new to stocks, but I feel like it’s similar to sports betting. As long as you do your research on teams/companies, you have an opportunity to profit. I’m a bit of a nerd when it comes to fantasy sports and stats and was able to win $1,500 this year betting exclusively on odds boosts and live game bets. \n\nWith the stocks crashing, I feel like it’s a good opportunity to buy low and toss my $1,500 (and maybe some more) into some stocks. I don’t know much about stocks, but I want to invest in strong companies that are likely to bounce back even if it takes a year or two. Right now I’m leaning towards buying stock in Delta, Visa, Qualcomm, and some ETFs for Vanguard. Is there a sector that I should invest in like tech for my ETFs? Appreciate it and good luck everyone.",
        "subreddit": "stocks",
        "title": "Anyone else jumping from sports betting to stocks??",
        "url": "https://www.reddit.com/r/stocks/comments/ft5v92/anyone_else_jumping_from_sports_betting_to_stocks/",
        "created": 1585795128.0
    },
    {
        "author": "ProudResident",
        "created_utc": 1586102840,
        "id": "fvg5o6",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "kind of a noob, but I'm a long term buy and hold investor heres my list:\n\nDisney:\n\n$DIS\n\nRelatively good balance sheet  \nLots of valuable intellectual propertySmart acquisitions of marvel, Star Wars, and ESPN so they can keep pumping out tons of content with great brand name recognition  \nHad one of the most popular shows of 2020 with the Mandalorian  \nOwns majority stake in streaming service Hulu which is undoubtably flourishing during this quarantine.    \nParks are going to take a huge hit, but will eventually get back to full capacity  \nFair value of Disney with 0 free cash flow for 2020 is around $100  \n(Reddit won’t let me post the video link, but I can comment it if your skeptical)  \nDCA price point: under $90  \n—————————————————————————————————————————  \nBank of America:  \n$BAC  \nGreat balance sheet  \nBest online presence out of the large banks  \nInterest rates are already at 0 they could go negative, but will eventually be raised once again.  \nBanks are trying to get out ahead of the problem by suspending buybacks early, and working with the government. They aren’t the problem this time as in 2008.  \nMorningstar is bullish on banks  \n\"We remind investors a few bad quarters of earnings are not that important when it comes to the intrinsic value of a firm over its lifetime. When bank stock prices imply that bad times will never end, we think the odds shift in the favor of long-term investors. We believe investors should be seriously watching and considering bank stocks as this plays out.”  \nDCA price point: under $19  \n——————————————————————————————————————————  \nQualcomm:\n\n$QCOM\n\nGreat balance sheet  \n\n\nClear market leader in wireless chips   \n\n\nHas lots of money comping in from royalties   \n\n\nStands to benefit greatly from the impending 5g boom  \n\n\nDCA price point: under $60DCA price point: under $60",
        "subreddit": "stocks",
        "title": "I know someone post this everyday, but here are 3 stocks I'm planning to DCA into if they get to my price point. looking for some more ideas, so what are the top 3 stocks on your watchlist?",
        "url": "https://www.reddit.com/r/stocks/comments/fvg5o6/i_know_someone_post_this_everyday_but_here_are_3/",
        "created": 1586131640.0
    },
    {
        "author": "zandarkyn21",
        "created_utc": 1587937921,
        "id": "g8nb66",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "What on everyone’s watch list for 5G? What’s everyone looking to our money into? So far I’m watching NOK, ERIC, QCOM, MU, MRVL.",
        "subreddit": "stocks",
        "title": "5G",
        "url": "https://www.reddit.com/r/stocks/comments/g8nb66/5g/",
        "created": 1587966721.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1587823077,
        "id": "g7tx6k",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/StockMarket. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning April 27th, 2020.\n\n# **Stocks face headwinds as investors look forward to a big earnings week, a Fed meeting and state reopenings  - [(Source)](https://www.cnbc.com/2020/04/24/stocks-face-headwinds-as-investors-look-forward-to-a-big-earnings-week-a-fed-meeting-and-state-reopenings.html)**\n*****\n&gt; The stock market is struggling to make headway, as a big week of events rolls around, including a Federal Reserve meeting, the first look at post-shutdown economic growth and earnings from more than a fifth of the S&amp;P 500 companies.\n*****\n&gt; It’s a busy week for earnings, and some of the biggest blue chips are likely to join the growing list of companies withdrawing guidance amid the uncertainty of how the coronavirus and shutdowns are impacting their business. Apple, Microsoft, Amazon, Facebook, Boeing and McDonald’s are among about 140 S&amp;P 500 companies reporting first quarter results.\n*****\n&gt; Investors will also be watching the progress of the reopening of business activity in some states, like Georgia, Texas, Oklahoma and South Carolina. At the same time, President Donald Trump said he may extend social distancing guidelines into early summer. Many states, including the hardest hit, remain completely shut down.\n*****\n&gt; Stocks were higher Friday, but the major indices had their first negative week in three as oil prices cratered and then steadied in the mid-teens. The S&amp;P 500 has been trading on both sides of the key 2,800 level, as investors focused on murky corporate outlooks and uncertainty surrounding the timing of the reopening of the economy. Even though several states are resuming some activities, Trump said he disagreed with Georgia’s plan to reopen.\n*****\n&gt; On Friday, the S&amp;P closed at 2,836, down 1.3% for the week.\n*****\n&gt; Earnings for the first quarter have been bleak so far, down about 14% based on estimates and actual reports, according to Refinitiv. Second quarter results are expected to be far worse, declining 32.2%.\n*****\n&gt; “If you take a look where the real battle is in the market, it’s a fundamental story,” said Jonathan Golub, chief U.S. equity strategist at Credit Suisse. “The fundamentals are that the market should be lower, and on the other hand, the Fed is kind of putting their thumb on the scale in favor of the market.”\n*****\n&gt; Golub said it’s the potential for recurrences of the outbreak that’s being watched to see if businesses can remain open once they start back up. “People are watching what’s going on in places like Georgia, but they’re also watching what’s going on in Singapore and places in Asia that are opening up,” he said. “At the end of the day, there’s really one thing that really matters. It’s not the Fed. The virus is going to own the agenda, whether we want it to or not.”\n*****\n&gt; # Fed bazooka\n&gt; The Fed meets Tuesday and Wednesday, and while it’s not expected to take any new action, it will likely discuss the many programs it quickly rolled out to support the economy and provide liquidity.\n*****\n&gt; “I’m anticipating no actions in terms of anything with purchases or interest rate movements,” said Luke Tilley, chief economist at Wilmington Trust. “I think we’re going to hear a lot more in terms of their description of what’s working and the things that still need to happen.”\n*****\n&gt; Tilley said the Fed’s job is also to instill confidence, and its asset purchase and other programs to support mortgages, corporate credit and municipal bonds, helped bring back in spreads that had been widening out across the credit markets. “It looked like we were headed for a seizure in credit markets, but they’ve come back in,” he said, adding he expects the Fed to also discuss programs like its support for the small business lending program.\n*****\n&gt; Fed Chairman Jerome Powell is also expected to sound optimistic about the central bank’s ability to help the economy, despite the uncertainty as the economy falls into an unprecedented decline in the second quarter. Tilley said he expects the economy to contract in the second quarter by 40%.\n*****\n&gt; Golub said this Fed meeting isn’t as important as others have been, since the central bank has already taken so many extraordinary policy steps and promises to do more as needed.\n*****\n&gt; “The Fed has made it clear if they need to provide liquidity to the market, they’re not going to wait for a meeting to do it,” he said. “Whether you’re borrowing from a bank or whether you’re borrowing in the capital markets, that capital is available so the economy can move ... the net effect is it also pushes the stock market up.”\n*****\n&gt; # Economic impact\n&gt; First quarter gross domestic product numbers are expected Wednesday, and it will be the first look at how the early weeks of the shutdown impacted the broader economy. Forecasts are wide ranging, and the consensus forecast from Refinitiv is now for a contraction of 4.1%. Economists expect the second quarter to take the biggest hit of the recession, and it is forecast by many to show a contraction of more than 30%.\n*****\n&gt; Some of the early second-quarter data will be released in the coming week. Vehicle sales slowed to a trickle in April, and auto makers shut down production.\n*****\n&gt; The impact of that should show up in Friday’s April vehicle sales and ISM manufacturing, but the single-most important data point will be Thursday’s weekly jobless claims, expected again to show millions of workers signed up for unemployment benefits.\n*****\n&gt; So far, 26.5 million unemployment claims have been filed in the last five weeks, wiping out all the job gains made since the end of the Great Recession. The employment report for April will be released on May 8, and economists say unemployment will likely peak in April or May before falling off.\n*****\n&gt; “We’ll probably see an unemployment rate at 20% or a little higher,” Tilley said.\n*****\n&gt; # Earnings\n&gt; Earnings reports are expected from a range of industries, such as tech, health care, energy and defense. Merck, Pfizer, AstraZeneca, Humana and Anthem are among health care names reporting. Big oil companies, Exxon Mobil and Chevron both release results on Friday, and their comments on how they are reacting to the shocking decline in crude oil prices this past week will be important.\n*****\n&gt; An oil futures contract for May dove into negative territory Monday and Tuesday, as did prices in many spot markets. That contract expired Tuesday, and the June futures contract for West Texas Intermediate settled at $16.94 per barrel Friday, down about 7.3% for the week and about $5 lower than the price of Brent futures.\n*****\n&gt; “The most important earnings story is not what happens this quarter, It’s how long does it take to get back to peak earnings again,” said Golub. “My estimate is this is going to take three years to get back to peak profits. But the estimates right now are reflecting that it’s going to turn back to normal by something closer to the third quarter of next year. I think that’s too optimistic.The second part of the earnings story is how fast estimates are coming down.”\n*****\n&gt; He said first quarter earnings per share look to be down a little more than 12%, though some estimates have them down 16% or 17%. “We had 10 very healthy weeks and three not healthy weeks. The fact you could have such a negative quarter with only three bad week, that’s really bad.” Golub said. His forecast is for a 40% decline in second quarter profits.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/3vJvFZR.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/B4Di7Fh.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/7XXBq3H.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/QyE3rll.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/jyp5KqQ.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/fCYKkgg.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/PdPKvec.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/sEY6EDm.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/KKMTHHH.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/y2laKRP.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/QuCVREP.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/gkpOUiT.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/GrUMf6m.png))**\n\n*****\n\n# Election-year Mays: DJIA’s Second Worst Month\n\n&gt; May officially marks the beginning of the “Worst Six Months” for the DJIA and S&amp;P. To wit: “Sell in May and go away.” Our “Best Six Months Switching Strategy,” created in 1986, proves that there is merit to this old trader’s tale. A hypothetical $10,000 investment in the DJIA compounded to a gain of $1,068,826 for November-April in 69 years compared to just $1,461 for May-October. The same hypothetical $10,000 investment in the S&amp;P 500 compounded to $823,326 for November-April in 69 years compared to a gain of just $9,537 for May-October.\n\n&gt; May has been a tricky month over the years, a well-deserved reputation following the May 6, 2010 “flash crash”. It used to be part of what we called the “May/June disaster area.” From 1965 to 1984 the S&amp;P 500 was down during May fifteen out of twenty times. Then from 1985 through 1997 May was the best month, gaining ground every single year (13 straight gains) on the S&amp;P, up 3.3% on average with the DJIA falling once and two NASDAQ losses.\n\n&gt; In the years since 1997, May’s performance has been erratic; DJIA up eleven times in the past twenty-two years (three of the years had gains in excess of 4%). NASDAQ suffered five May losses in a row from 1998-2001, down – 11.9% in 2000, followed by twelve sizable gains in excess of 2.5% and five losses, the worst of which was 8.3% in 2010. Election Year Mays rank at or near the bottom, registering net losses on DJIA and S&amp;P 500 (since 1952), NASDAQ (since 1972) and Russell 1000 and 2000 (since 1980).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/fac23214c1353f0b68d7710f6f7886a1/2eed74513d6bc154-86/s400x600/2540f531fb63ceab611b44ad7e0a2c0165670319.jpg))**\n\n*****\n\n# LPL Office Talk: Putting The Rally In Perspective\n\n&gt; One month ago today the S&amp;P 500 Index bottomed after a vicious bear market. Was this the ultimate bottom? We’ll have to wait and see, but what we do know is the rally we’ve seen over the past month is nearly as historic as the drop coming into it was.\n\n&gt; “We recently had the best 20-day rally for the S&amp;P 500 since March 2009 and one of the best ever,” explained LPL Financial Senior Market Strategist Ryan Detrick. “Looking back at the previous best 20-day rallies, one thing is consistent: very strong returns going out a year.”\n\n&gt; As shown in the LPL Chart of the Day, the 10 previous best 20-day rallies for the S&amp;P 500 saw continued gains after some near-term volatility. In fact, six months later stocks were higher 9 of 10 times and a full year later higher 10 of 10 times.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/04/Picture-4.23.20.png?ssl=1))**\n\n*****\n\n# Why The Recent Strength Has Bulls Smiling\n\n&gt; The huge equity rally continued last week, with the S&amp;P 500 Index up another 3%, on the heels of adding more than 15% in the previous week. The gain during the past two weeks of 15.5% was the greatest since October 1974. Taking it a step further, the 15 trading days ending April 14 saw the S&amp;P 500 up more than 27%, one of the greatest rallies ever. What we’ve been seeing is truly historic, so the big question now is: What could happen next?\n\n&gt; “This remarkable rally has caught most off guard, but what might surprise many to hear is more gains could eventually be in store in 2020,” explained LPL Financial Senior Market Strategist Ryan Detrick. “When we’ve seen similar blasts of extreme short-term strength, stocks have been quite strong going out 6- to 12-months.”\n\n&gt; As shown in the LPL Chart of the Day, the S&amp;P 500 was up nine of 10 times six months later and higher every single time a year later after the previous best 15-day gains ever. Be aware though, some of the returns in the near-term were weak, suggesting a pullback after such a strong move is likely. Still, this much strength in such a short timeframe could very well suggest the rest of 2020 could have bulls smiling.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/04/Market-returns-4.20.20.png?ssl=1))**\n\n*****\n\n# Dogs of the Dow Performance So Far in 2020\n\n&gt; The average stock in the Dow Jones Industrial Average is down 16.24% on a total return basis so far in 2020. Below we take a look at how the \"Dogs of the Dow\" strategy has performed so far this year.\n\n&gt; The \"Dogs of the Dow\" strategy is a very passive approach that simply says to buy the 10 stocks in the Dow 30 that have the highest dividend yields at the start of each year. The Dogs list for 2020 was led by Dow Inc. (DOW) with a yield of 5.12% on January 1st. Exxon Mobil (XOM), IBM, Verizon (VZ), Chevron (CVX), Pfizer (PFE), 3M (MMM), Walgreens (WBA), Cisco (CSCO), and Coca-Cola (KO) are the nine other members of the Dogs for 2020.\n\n&gt; As shown in the table below, the Dogs are down an average of 19.37% on a total return basis in 2020, which is a little less than five percentage points worse than the 14.68% decline seen for the 20 non-Dogs this year. Dow Inc. (DOW) and Exxon Mobil (XOM) have been the two worst performing Dogs with respective YTD declines of 39.9% and 37.0%. Dow's dividend yield has risen from 5.12% up to 8.47%, while XOM's yield has risen from 4.99% up to 7.91%. There are no Dogs that are up on the year, but Verizon (VZ) and Pfizer (PFE) have been the best performers of the group with YTD declines of less than 5%.\n\n&gt; Of the non-Dogs, Boeing (BA) has been by far the worst performer with a YTD decline of 60.01%. At the start of 2020, BA had a dividend yield of 2.52%, but that dividend has been suspended. JP Morgan (JPM), American Express (AXP) and Disney (DIS) have all fallen more than 30% YTD, while Johnson &amp; Johnson (JNJ), Walmart (WMT), and Microsoft (MSFT) are the only three Dow stocks that are up on the year.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/2020dogs.png))**\n\n*****\n\n# Investors Giving Companies a Pass on Earnings So Far\n\n&gt; We're now two weeks into the Q1 2020 earnings season, and just over 200 companies have reported their numbers so far. The average one-day price change for the stocks that have reported earnings so far this season has been a gain of 0.89%. That's much stronger than the average one-day gain of 0.06% seen for all stocks that have reported earnings since 2001.\n\n&gt; As shown below, stocks that have beaten EPS estimates this season have averaged a one-day price gain of 2.16% on their earnings reaction days. That's stronger than the average one-day gain of 1.89% seen on earnings reaction days for all stocks that have reported since 2001. Stocks that have missed EPS estimates this season have seen a one-day decline of 0.72% on their earnings reaction days. Historically, the average stock that has missed EPS has fallen 3.56% on its earnings reaction day, so this season's decline of just 0.72% suggests that investors are basically giving a pass to companies missing estimates in Q1.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/avgearn.png))**\n\n*****\n\n# Next Week's Economic Indicators\n\n&gt; Even though most economic data releases this week that had forecasts exceeded those estimates (10 of 15), data continues to come in very weak. The Chicago Fed’s National Activity index started off the week coming in at –4.19 which was well below estimates of –3. Existing home sales followed up on Tuesday, and despite coming in above estimates, sales slowed considerably from February. Elsewhere in housing data, new home sales collapsed down to 627K SAAR compared to 765K last month. Meanwhile, February home prices showed some acceleration. Jobless claims also were better than expected, but they too remain at extremely elevated levels relative to the rest of history. Manufacturing data was a major area of weakness this week. Both the preliminary Markit PMI and Kansas City Fed reading fell significantly despite coming in better than forecast. Hard manufacturing data on Friday was likewise bad at the headline level though under the hood there were some silver linings.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/eco-1.png))**\n\n&gt; Turning to next week, like the earnings calendar, the economic calendar ramps up with a total of 34 releases. We will get the final two regional Federal Reserve indices from Dallas and Richmond on Monday and Tuesday, respectively, followed by the final Markit and ISM reading for April on Friday. Wednesday will be the most closely watched day of the week with the first release of Q1 GDP as well as an FOMC rate decision. Growth in the first quarter is expected to show a 3.8% contraction. Although no change in rates is being forecast, Fed Chair Powell’s following presser will likely be closely watched for a monetary policy update.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/eco-2.png))**\n\n*****\n\n# Biggest Companies Reporting Earnings Next Week (AAPL, AMZN, MSFT and More)\n\n&gt; The earnings calendar has begun to ramp up over the past two weeks and over the next two weeks we will see peak earnings season. Next week there are a total of 784 companies scheduled to release earnings. Of those, there are 178 S&amp;P 500 stocks, which is 35.% of the index.\n\n&gt; In the table below we show the 30 largest stocks (by market cap) that are scheduled to report next week. None of the largest stocks report on Monday, but the two Dow pharmaceutical stocks, Merck (MRK) and Pfizer (PFE), kick things off Tuesday morning. The trillion dollar market cap club will all report next week with Microsoft (MSFT) out with earnings Wednesday night and Apple (AAPL) and Amazon (AMZN) out the following evening. Two other notable releases Wednesday and Thursday, respectively, will be the major payment processors Visa (V) and Mastercard (MA). Friday will be capped off with two oil giants: Exxon Mobil (XOM) and Chevron (CVX). Other honorable mentions not on this list reporting next week include industrial bell-weather Caterpillar (CAT), stocks likely benefiting from the COVID economy like Colgate Palmolive (CL) and Clorox (CLX), and finally, some travel and leisure stocks like Expedia (EXPE), Royal Caribbean (RCL), United Airlines (UAL), and Southwest Airlines (LUV).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/Earnings-table.png))**\n\n*****\n\n# Gold Bounces Right Where It Was Supposed To\n\n&gt; With central banks around the world unleashing waves of liquidity, there have been heightened concerns that one result will be a decline in the purchasing power of our money. For that reason, a number of investors have been flocking to gold. Even before the COVID-19 crisis, gold prices had been in a solid uptrend, and while prices spiked as the crisis first began, they couldn't quite get above the $1,650 - $1,700 range. In mid-March even, prices plummeted with just about every other financial asset before quickly recovering. Once again, though, the rally stalled at resistance. This time around, though, the 50-day moving average was strong enough to provide support and after that test, gold finally got the long-awaited breakout that investors had been waiting for.\n\n&gt; Gold's price spiked as high as $1,787 per ounce in mid-April before running out of momentum. When a stock or commodity breaks out above resistance to new highs and then pulls back, the former resistance level should act as support, and that is exactly what we saw this time around. This week, gold bounced right on cue at around $1,700 and has since rallied 2.6%. With the first test of support proving successful, look for gold to now establish a new range with a floor at around $1,700. At least that's what the technical analysis textbooks would say.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/042320-Gold.png))**\n\n*****\n\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending April 24th, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=0YEYmZu0gJo))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 4.26.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=6p72X2AQhQg))**\n(VIDEO NOT YET POSTED.)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$AMZN** \n&gt; * **$TSLA** \n&gt; * **$MSFT** \n&gt; * **$AAPL** \n&gt; * **$AMD** \n&gt; * **$BA** \n&gt; * **$FB** \n&gt; * **$LUV** \n&gt; * **$MMM** \n&gt; * **$GE** \n&gt; * **$AAL** \n&gt; * **$UPS** \n&gt; * **$TWTR** \n&gt; * **$PFE** \n&gt; * **$CBSH** \n&gt; * **$PEP** \n&gt; * **$MA** \n&gt; * **$GOOGL** \n&gt; * **$GILD** \n&gt; * **$SBUX** \n&gt; * **$UAL** \n&gt; * **$V** \n&gt; * **$SPOT** \n&gt; * **$MCD** \n&gt; * **$XOM** \n&gt; * **$F** \n&gt; * **$CAT** \n&gt; * **$TDOC** \n&gt; * **$AMAT** \n&gt; * **$AWI** \n&gt; * **$CHKP** \n&gt; * **$MRK** \n&gt; * **$ABBV** \n&gt; * **$WHR** \n&gt; * **$QCOM** \n&gt; * **$BP** \n&gt; * **$KHC** \n&gt; * **$CLX** \n&gt; * **$HAS** \n&gt; * **$ANTM** \n&gt; * **$NOK** \n&gt; * **$CMS** \n&gt; * **$CNX** \n&gt; * **$APRN**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/KKMTHHH.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/lRp3xer.png))**\n###### **([CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES BEFORE MONDAY'S OPEN!](https://i.imgur.com/Yw1LKpH.jpg))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 4.27.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/HW4ersg.png))\n\n\n&gt; # ***Monday 4.27.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/KnhCH1m.png))\n\n\n*****\n\n&gt; # ***Tuesday 4.28.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/XeUrTNF.png))\n\n&gt; # ***Tuesday 4.28.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/20sK5un.png))\n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/QXrGzmn.png))\n\n*****\n\n&gt; # ***Wednesday 4.29.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/tSP1S0Y.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/Sn4QllI.png))\n\n&gt; # ***Wednesday 4.29.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/DhxQrOU.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/1CpjzdJ.png))\n\n*****\n\n&gt; # ***Thursday 4.30.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/raeflTF.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/43jb0Pu.png))\n\n&gt; # ***Thursday 4.30.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/axhdXpO.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/wiL7F9e.png))\n\n*****\n\n&gt; # ***Friday 5.1.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/HZkJ2ai.png))\n\n*****\n\n&gt; # ***Friday 5.1.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# Amazon.com, Inc. -\n&gt; **Amazon.com, Inc. (AMZN)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, April 30, 2020. The consensus earnings estimate is $6.35 per share on revenue of $73.42 billion and the Earnings Whisper ® number is $6.84 per share. Investor sentiment going into the company's earnings release has 80% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 11.81% with revenue increasing by 22.98%. Short interest has increased by 29.4% since the company's last earnings release while the stock has drifted higher by 17.5% from its open following the earnings release to be 29.0% above its 200 day moving average of $1,868.70. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, April 24, 2020 there was some notable buying of 3,068 contracts of the $2,400.00 call expiring on Friday, May 1, 2020. Option traders are pricing in a 7.2% move on earnings and the stock has averaged a 4.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AMZN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Tesla, Inc. $725.15\n&gt; **Tesla, Inc. (TSLA)** is confirmed to report earnings at approximately 4:15 PM ET on Wednesday, April 29, 2020. The consensus estimate is for a loss of $0.18 per share on revenue of $5.71 billion and the Earnings Whisper ® number is ($0.27) per share. Investor sentiment going into the company's earnings release has 25% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 92.31% with revenue increasing by 25.73%. Short interest has decreased by 21.1% since the company's last earnings release while the stock has drifted higher by 14.7% from its open following the earnings release to be 74.4% above its 200 day moving average of $415.82. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, April 24, 2020 there was some notable buying of 4,971 contracts of the $800.00 call expiring on Friday, May 1, 2020. Option traders are pricing in a 13.8% move on earnings and the stock has averaged a 9.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TSLA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Microsoft Corp. $174.55\n&gt; **Microsoft Corp. (MSFT)** is confirmed to report earnings at approximately 4:20 PM ET on Wednesday, April 29, 2020. The consensus earnings estimate is $1.27 per share on revenue of $34.05 billion and the Earnings Whisper ® number is $1.34 per share. Investor sentiment going into the company's earnings release has 74% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 11.40% with revenue increasing by 11.38%. Short interest has decreased by 7.7% since the company's last earnings release while the stock has drifted higher by 0.3% from its open following the earnings release to be 14.9% above its 200 day moving average of $151.97. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, April 24, 2020 there was some notable buying of 25,039 contracts of the $172.50 put expiring on Friday, May 15, 2020. Option traders are pricing in a 5.7% move on earnings and the stock has averaged a 2.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MSFT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Apple, Inc. $282.97\n&gt; **Apple, Inc. (AAPL)** is confirmed to report earnings at approximately 4:30 PM ET on Thursday, April 30, 2020. The consensus earnings estimate is $2.10 per share on revenue of $54.00 billion and the Earnings Whisper ® number is $2.25 per share. Investor sentiment going into the company's earnings release has 29% expecting an earnings beat The company's guidance was for earnings of $2.74 to $3.17 per share. Consensus estimates are for earnings to decline year-over-year by 14.63% with revenue decreasing by 6.92%. Short interest has decreased by 6.1% since the company's last earnings release while the stock has drifted lower by 12.8% from its open following the earnings release to be 10.8% above its 200 day moving average of $255.39. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, April 23, 2020 there was some notable buying of 17,749 contracts of the $300.00 call expiring on Friday, May 1, 2020. Option traders are pricing in a 5.2% move on earnings and the stock has averaged a 4.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AAPL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Advanced Micro Devices, Inc. $56.18\n&gt; **Advanced Micro Devices, Inc. (AMD)** is confirmed to report earnings at approximately 4:15 PM ET on Tuesday, April 28, 2020. The consensus earnings estimate is $0.18 per share on revenue of $1.78 billion and the Earnings Whisper ® number is $0.19 per share. Investor sentiment going into the company's earnings release has 67% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 200.00% with revenue increasing by 39.94%. Short interest has decreased by 24.4% since the company's last earnings release while the stock has drifted higher by 17.4% from its open following the earnings release to be 40.4% above its 200 day moving average of $40.01. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, April 15, 2020 there was some notable buying of 54,202 contracts of the $55.00 call and 47,486 contracts of the $55.00 put expiring on Friday, May 15, 2020. Option traders are pricing in a 9.8% move on earnings and the stock has averaged a 9.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AMD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Boeing Co. $128.98\n&gt; **Boeing Co. (BA)** is confirmed to report earnings at approximately 7:30 AM ET on Wednesday, April 29, 2020. The consensus estimate is for a loss of $2.04 per share on revenue of $17.17 billion and the Earnings Whisper ® number is ($2.21) per share. Investor sentiment going into the company's earnings release has 11% expecting an earnings miss. Consensus estimates are for earnings to decline year-over-year by 164.56% with revenue decreasing by 25.08%. Short interest has increased by 85.7% since the company's last earnings release while the stock has drifted lower by 60.2% from its open following the earnings release to be 58.5% below its 200 day moving average of $310.71. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, April 17, 2020 there was some notable buying of 16,626 contracts of the $150.00 call expiring on Friday, May 15, 2020. Option traders are pricing in a 12.0% move on earnings and the stock has averaged a 2.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Facebook Inc. $190.07\n&gt; **Facebook Inc. (FB)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, April 29, 2020. The consensus earnings estimate is $1.76 per share on revenue of $17.61 billion and the Earnings Whisper ® number is $1.81 per share. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 107.06% with revenue increasing by 16.80%. Short interest has increased by 20.4% since the company's last earnings release while the stock has drifted lower by 8.0% from its open following the earnings release to be 0.3% below its 200 day moving average of $190.55. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, April 14, 2020 there was some notable buying of 13,018 contracts of the $350.00 call expiring on Friday, January 21, 2022. Option traders are pricing in a 8.0% move on earnings and the stock has averaged a 5.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FB&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Southwest Airlines Co. $29.33\n&gt; **Southwest Airlines Co. (LUV)** is confirmed to report earnings at approximately 6:30 AM ET on Tuesday, April 28, 2020. The consensus estimate is for a loss of $0.48 per share on revenue of $5.01 billion and the Earnings Whisper ® number is ($0.46) per share. Investor sentiment going into the company's earnings release has 23% expecting an earnings miss. Consensus estimates are for earnings to decline year-over-year by 168.57% with revenue decreasing by 2.70%. Short interest has decreased by 47.9% since the company's last earnings release while the stock has drifted lower by 44.7% from its open following the earnings release to be 42.0% below its 200 day moving average of $50.54. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, April 21, 2020 there was some notable buying of 10,235 contracts of the $20.00 put expiring on Friday, January 15, 2021. Option traders are pricing in a 9.7% move on earnings and the stock has averaged a 4.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LUV&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# 3M Company $147.00\n&gt; **3M Company (MMM)** is confirmed to report earnings at approximately 6:30 AM ET on Tuesday, April 28, 2020. The consensus earnings estimate is $2.02 per share on revenue of $8.23 billion and the Earnings Whisper ® number is $2.05 per share. Investor sentiment going into the company's earnings release has 67% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 9.42% with revenue increasing by 4.67%. Short interest has decreased by 23.9% since the company's last earnings release while the stock has drifted lower by 14.5% from its open following the earnings release to be 8.9% below its 200 day moving average of $161.32. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, April 6, 2020 there was some notable buying of 3,493 contracts of the $160.00 call expiring on Friday, May 15, 2020. Option traders are pricing in a 6.5% move on earnings and the stock has averaged a 5.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MMM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# General Electric Co. $6.26\n&gt; **General Electric Co. (GE)** is confirmed to report earnings at approximately 6:30 AM ET on Wednesday, April 29, 2020. The consensus earnings estimate is $0.06 per share on revenue of $20.70 billion and the Earnings Whisper ® number is $0.05 per share. Investor sentiment going into the company's earnings release has 23% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 57.14% with revenue decreasing by 24.14%. Short interest has decreased by 1.3% since the company's last earnings release while the stock has drifted lower by 50.2% from its open following the earnings release to be 37.4% below its 200 day moving average of $10.00. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, April 17, 2020 there was some notable buying of 12,195 contracts of the $6.00 call expiring on Friday, May 15, 2020. Option traders are pricing in a 11.2% move on earnings and the stock has averaged a 7.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=GE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/StockMarket.",
        "subreddit": "StockMarket",
        "title": "Wall Street Week Ahead for the trading week beginning April 27th, 2020",
        "url": "https://www.reddit.com/r/StockMarket/comments/g7tx6k/wall_street_week_ahead_for_the_trading_week/",
        "created": 1587851877.0
    },
    {
        "author": "itskamon",
        "created_utc": 1588258718,
        "id": "gax7p1",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "$cien, $mrvl $acn $qcom. These are all stocks I’m about to do my DD on. So far, Marvell and Qualcomm are looking like good buys. Any other opinions or info would be greatly appreciated.",
        "subreddit": "stocks",
        "title": "5g stocks",
        "url": "https://www.reddit.com/r/stocks/comments/gax7p1/5g_stocks/",
        "created": 1588287518.0
    },
    {
        "author": "zandarkyn21",
        "created_utc": 1588130696,
        "id": "ga1x3c",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "I’ve got about 1200$ I’m looking to park into one of the two as a start in their stocks to hold long term. What’s everyone’s opinion on the two ?",
        "subreddit": "stocks",
        "title": "Considering two stocks : RTX and QCOM",
        "url": "https://www.reddit.com/r/stocks/comments/ga1x3c/considering_two_stocks_rtx_and_qcom/",
        "created": 1588159496.0
    },
    {
        "author": "zandarkyn21",
        "created_utc": 1585794936,
        "id": "fte9fm",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "Evening all!\nSuper green when it comes to investing but I have a little cash I wanna mess with and I’m looking into tech companies that will pave the way for 5G and AI. I’ve looked at chip makers like Qorvo, Skywork Solutions, Qualcomm and then also looking at Nvidia. What other tech companies should I be considering when it comes to these markets. Something I can buy now sit on for a bit while the technologies develop! Thanks everyone!",
        "subreddit": "StockMarket",
        "title": "5G Tech Stocks",
        "url": "https://www.reddit.com/r/StockMarket/comments/fte9fm/5g_tech_stocks/",
        "created": 1585823736.0
    },
    {
        "author": "zandarkyn21",
        "created_utc": 1586431336,
        "id": "fxqprf",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "I’m new to the market and I sprinkled some money around but have about 850$ left to invest atm and will be adding to that regularly hopefully every month. So I’m looking for something to invest in with long term in mind something with growth and dividends. It was suggested to me to look in a index fund like VTI. What are peoples thoughts on that? Should I invest in an index like VTI that has its own portfolio or do I keep dumping money into one company? I sprinkled about $6k into other companies like XOM, NOK, CCL, RCL, MU, MGM and QCOM already.",
        "subreddit": "StockMarket",
        "title": "Thoughts on VTI",
        "url": "https://www.reddit.com/r/StockMarket/comments/fxqprf/thoughts_on_vti/",
        "created": 1586460136.0
    },
    {
        "author": "HispanicStifler",
        "created_utc": 1587503850,
        "id": "g5nwyl",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Commission = $9.95CAD per. Trade  \n(Parentheses) = Shares  \n*Strikethrough =* ***Sold***\n\nTesla: $605.84 (9) - $698.65 (2)   \nAmazon: $2,130.84 (1) - $2,221.20 (2) - Amazon:  $2390.27 (2)   \nNetflix:  $428.4899 (5)   \nQualcomm: $76.75 (5)  \nAiki: $2.23 (5) &gt;&gt;&gt; lol\n\n~~Google: $1,249.99 (3)~~  \n~~Apple: $284.79 (3)~~  \n~~Wayfair: $80.44 (8)~~  \n~~Royal Caribbean: $37.898 (25)~~   \n~~Carnival Corp: $12.48 (50)~~\n\n**Liquid Cash: $1,059.38 USD**\n\nNotes **(a)** : Tesla @ $698.65 (2) was an accident in this account. Meant to keep (2) new shares in CAD TFSA and sell @ $750 to generate more cash towards another position. Now they're combined. Can't sell individually. \\[$605.84 (9) was meant to be a long-term position\\]\n\nNotes **(aa)** : Same deal with Amazon @ $2390.27 (2) .. target was $2450\n\nI'm expecting a market crash sometime soon. Probably once Q1 2020 earnings start to roll in and we have a better understanding of the *actual* impact from COVID-19, and once things start opening back up and people change their behavioural spending patterns for the first 4-6 months.. so probably somewhere in late Q2 - early Q3 we will see the actual bottom of the market. Unless there's another outbreak in fall, then it will again become totally unpredictable.\n\nThat being said, I'm trying to find the best course of action for this portfolio. I think keeping my main positions in Amazon/Tesla/Netflix is the best idea as of now. Amazon will only continue to grow regardless of lockdown or not. Lockdown continuance will obviously show heightened grow, but even post-lockdown they will have accelerated growth for a multitude of reasons. Tesla is announcing something big on Battery Day and Q1 earnings expected to be better than analyst estimates - also, after careful consideration I've realized that trouble in the oil industry could only be bad for tesla due to low gas prices; but on the flip side that means cheaper charges as well. I think overall, downfall of oil equates to an uprise in EV and sustainable energy as a whole. Can the auto industry really afford to sell cars at ridiculously low prices after this? Or will they be around the same if not higher to recoup losses, pay debt and stay afloat. Netflix I'm weary of, because yes they will break record subscription numbers.. but how much can they really continue to grow? They haven't been creating new content due to lockdown so how long until people start cancelling subscriptions? I read somewhere that subscription services are usually the first to go in economically troubling times. Lastly, they have really high debt and the company is already overvalued. So as of now, I will hold. But Q2-Q3 I'm expecting a sell-all in order to full-buy the bottom.\n\nI think taking a loss on Qualcomm to free up cash and swingtrading is the best bet. (Once I find a broker with lower fees). This allows me to accumulate more cash in the interim and also realize gains incase things go south on the longterm side. That should equal things out a little bit. But even selling Qualcomm, what can I really do with $1400USD swingtrading.. Should I add another 10-15gs into this portfolio? Or should I just do with what I have right now while we all await to see how the market plays out? I'm trying to hoard most of my cash for big positions in the travel/energy sector.\n\nWhat are your guys thoughts? What would you do?",
        "subreddit": "stocks",
        "title": "What would you do with this portfolio?",
        "url": "https://www.reddit.com/r/stocks/comments/g5nwyl/what_would_you_do_with_this_portfolio/",
        "created": 1587532650.0
    },
    {
        "author": "futureIsYes",
        "created_utc": 1587022977,
        "id": "g2aib5",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "I am 50% cash now. Some regrets (like offloading Tesla at 450, which I bought at 360, msft at 260, Amazon at1.9k etc...) but all sold while green, and averaged like 25% gain.\n\nNow I want to slowly start buying,  like half of my cash. Any suggestions? These are the stocks I own now (the number of stocks in brackets)\n\nBaba (47), goog (6), blue apron (160), canopy (20), co diagnostic (100), dansk bank (130), delta (30), ibio (600), interdigital (49), IBM (9), iqiy (210), Johnson and Johnson (10), Nokia (900), Pfizer (30), Qualcomm (30), resonant (1000), tpi (50), zebra (3)\n\nOf these, only baba(10%), Google(25%),  IBM (7%), Johnson(13%)  Pfizer (10%),  Qualcomm (15%),  and zebra (0.2%) are green compared to when I got them (percentage increase in  brackets). \n\nOn the red side are blue (-0.75%) canopy (-67%), codiag (-37%), dansk bank (-46%), delta (-57%), ibio( -64%), Interdigital (-24%), iqiy (-18%), Nokia (-21%), resonant (-22%), tpi (-30%)\n\nIs there any from the red ones that you think is worth getting rid of even after such a  loss? What about the greens, any you think is worth selling right now?",
        "subreddit": "stocks",
        "title": "Ideas for 1 to 2 years investments",
        "url": "https://www.reddit.com/r/stocks/comments/g2aib5/ideas_for_1_to_2_years_investments/",
        "created": 1587051777.0
    },
    {
        "author": "amst98",
        "created_utc": 1587626240,
        "id": "g6i7jw",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "I was wondering if anyone could give me some feedback and comment on what three companies you would choose from these watch list. (1 short term, 2 long term)\n\nMSFT\n\nDIS\n\nBA\n\nUBER\n\nXOM\n\nCRM\n\nABT\n\nABBVIE\n\nQCOM\n\nPENN\n\nMGM\n\nJPM\n\nMSGS\n\nThank you!",
        "subreddit": "stocks",
        "title": "Need Advice on my watchlist",
        "url": "https://www.reddit.com/r/stocks/comments/g6i7jw/need_advice_on_my_watchlist/",
        "created": 1587655040.0
    },
    {
        "author": "amst98",
        "created_utc": 1588198039,
        "id": "gaiwba",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Long term hold: \n\nQCOM vs RTX vs SQ vs XOM",
        "subreddit": "stocks",
        "title": "Trying to choose between these and buy one next week /any thoughts?",
        "url": "https://www.reddit.com/r/stocks/comments/gaiwba/trying_to_choose_between_these_and_buy_one_next/",
        "created": 1588226839.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1587823375,
        "id": "g7tzyp",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/smallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning April 27th, 2020.\n\n# **Stocks face headwinds as investors look forward to a big earnings week, a Fed meeting and state reopenings  - [(Source)](https://www.cnbc.com/2020/04/24/stocks-face-headwinds-as-investors-look-forward-to-a-big-earnings-week-a-fed-meeting-and-state-reopenings.html)**\n*****\n&gt; The stock market is struggling to make headway, as a big week of events rolls around, including a Federal Reserve meeting, the first look at post-shutdown economic growth and earnings from more than a fifth of the S&amp;P 500 companies.\n*****\n&gt; It’s a busy week for earnings, and some of the biggest blue chips are likely to join the growing list of companies withdrawing guidance amid the uncertainty of how the coronavirus and shutdowns are impacting their business. Apple, Microsoft, Amazon, Facebook, Boeing and McDonald’s are among about 140 S&amp;P 500 companies reporting first quarter results.\n*****\n&gt; Investors will also be watching the progress of the reopening of business activity in some states, like Georgia, Texas, Oklahoma and South Carolina. At the same time, President Donald Trump said he may extend social distancing guidelines into early summer. Many states, including the hardest hit, remain completely shut down.\n*****\n&gt; Stocks were higher Friday, but the major indices had their first negative week in three as oil prices cratered and then steadied in the mid-teens. The S&amp;P 500 has been trading on both sides of the key 2,800 level, as investors focused on murky corporate outlooks and uncertainty surrounding the timing of the reopening of the economy. Even though several states are resuming some activities, Trump said he disagreed with Georgia’s plan to reopen.\n*****\n&gt; On Friday, the S&amp;P closed at 2,836, down 1.3% for the week.\n*****\n&gt; Earnings for the first quarter have been bleak so far, down about 14% based on estimates and actual reports, according to Refinitiv. Second quarter results are expected to be far worse, declining 32.2%.\n*****\n&gt; “If you take a look where the real battle is in the market, it’s a fundamental story,” said Jonathan Golub, chief U.S. equity strategist at Credit Suisse. “The fundamentals are that the market should be lower, and on the other hand, the Fed is kind of putting their thumb on the scale in favor of the market.”\n*****\n&gt; Golub said it’s the potential for recurrences of the outbreak that’s being watched to see if businesses can remain open once they start back up. “People are watching what’s going on in places like Georgia, but they’re also watching what’s going on in Singapore and places in Asia that are opening up,” he said. “At the end of the day, there’s really one thing that really matters. It’s not the Fed. The virus is going to own the agenda, whether we want it to or not.”\n*****\n&gt; # Fed bazooka\n&gt; The Fed meets Tuesday and Wednesday, and while it’s not expected to take any new action, it will likely discuss the many programs it quickly rolled out to support the economy and provide liquidity.\n*****\n&gt; “I’m anticipating no actions in terms of anything with purchases or interest rate movements,” said Luke Tilley, chief economist at Wilmington Trust. “I think we’re going to hear a lot more in terms of their description of what’s working and the things that still need to happen.”\n*****\n&gt; Tilley said the Fed’s job is also to instill confidence, and its asset purchase and other programs to support mortgages, corporate credit and municipal bonds, helped bring back in spreads that had been widening out across the credit markets. “It looked like we were headed for a seizure in credit markets, but they’ve come back in,” he said, adding he expects the Fed to also discuss programs like its support for the small business lending program.\n*****\n&gt; Fed Chairman Jerome Powell is also expected to sound optimistic about the central bank’s ability to help the economy, despite the uncertainty as the economy falls into an unprecedented decline in the second quarter. Tilley said he expects the economy to contract in the second quarter by 40%.\n*****\n&gt; Golub said this Fed meeting isn’t as important as others have been, since the central bank has already taken so many extraordinary policy steps and promises to do more as needed.\n*****\n&gt; “The Fed has made it clear if they need to provide liquidity to the market, they’re not going to wait for a meeting to do it,” he said. “Whether you’re borrowing from a bank or whether you’re borrowing in the capital markets, that capital is available so the economy can move ... the net effect is it also pushes the stock market up.”\n*****\n&gt; # Economic impact\n&gt; First quarter gross domestic product numbers are expected Wednesday, and it will be the first look at how the early weeks of the shutdown impacted the broader economy. Forecasts are wide ranging, and the consensus forecast from Refinitiv is now for a contraction of 4.1%. Economists expect the second quarter to take the biggest hit of the recession, and it is forecast by many to show a contraction of more than 30%.\n*****\n&gt; Some of the early second-quarter data will be released in the coming week. Vehicle sales slowed to a trickle in April, and auto makers shut down production.\n*****\n&gt; The impact of that should show up in Friday’s April vehicle sales and ISM manufacturing, but the single-most important data point will be Thursday’s weekly jobless claims, expected again to show millions of workers signed up for unemployment benefits.\n*****\n&gt; So far, 26.5 million unemployment claims have been filed in the last five weeks, wiping out all the job gains made since the end of the Great Recession. The employment report for April will be released on May 8, and economists say unemployment will likely peak in April or May before falling off.\n*****\n&gt; “We’ll probably see an unemployment rate at 20% or a little higher,” Tilley said.\n*****\n&gt; # Earnings\n&gt; Earnings reports are expected from a range of industries, such as tech, health care, energy and defense. Merck, Pfizer, AstraZeneca, Humana and Anthem are among health care names reporting. Big oil companies, Exxon Mobil and Chevron both release results on Friday, and their comments on how they are reacting to the shocking decline in crude oil prices this past week will be important.\n*****\n&gt; An oil futures contract for May dove into negative territory Monday and Tuesday, as did prices in many spot markets. That contract expired Tuesday, and the June futures contract for West Texas Intermediate settled at $16.94 per barrel Friday, down about 7.3% for the week and about $5 lower than the price of Brent futures.\n*****\n&gt; “The most important earnings story is not what happens this quarter, It’s how long does it take to get back to peak earnings again,” said Golub. “My estimate is this is going to take three years to get back to peak profits. But the estimates right now are reflecting that it’s going to turn back to normal by something closer to the third quarter of next year. I think that’s too optimistic.The second part of the earnings story is how fast estimates are coming down.”\n*****\n&gt; He said first quarter earnings per share look to be down a little more than 12%, though some estimates have them down 16% or 17%. “We had 10 very healthy weeks and three not healthy weeks. The fact you could have such a negative quarter with only three bad week, that’s really bad.” Golub said. His forecast is for a 40% decline in second quarter profits.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/3vJvFZR.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/B4Di7Fh.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/7XXBq3H.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/QyE3rll.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/jyp5KqQ.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/fCYKkgg.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/PdPKvec.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/sEY6EDm.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/KKMTHHH.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/y2laKRP.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/QuCVREP.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/gkpOUiT.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/GrUMf6m.png))**\n\n*****\n\n# Election-year Mays: DJIA’s Second Worst Month\n\n&gt; May officially marks the beginning of the “Worst Six Months” for the DJIA and S&amp;P. To wit: “Sell in May and go away.” Our “Best Six Months Switching Strategy,” created in 1986, proves that there is merit to this old trader’s tale. A hypothetical $10,000 investment in the DJIA compounded to a gain of $1,068,826 for November-April in 69 years compared to just $1,461 for May-October. The same hypothetical $10,000 investment in the S&amp;P 500 compounded to $823,326 for November-April in 69 years compared to a gain of just $9,537 for May-October.\n\n&gt; May has been a tricky month over the years, a well-deserved reputation following the May 6, 2010 “flash crash”. It used to be part of what we called the “May/June disaster area.” From 1965 to 1984 the S&amp;P 500 was down during May fifteen out of twenty times. Then from 1985 through 1997 May was the best month, gaining ground every single year (13 straight gains) on the S&amp;P, up 3.3% on average with the DJIA falling once and two NASDAQ losses.\n\n&gt; In the years since 1997, May’s performance has been erratic; DJIA up eleven times in the past twenty-two years (three of the years had gains in excess of 4%). NASDAQ suffered five May losses in a row from 1998-2001, down – 11.9% in 2000, followed by twelve sizable gains in excess of 2.5% and five losses, the worst of which was 8.3% in 2010. Election Year Mays rank at or near the bottom, registering net losses on DJIA and S&amp;P 500 (since 1952), NASDAQ (since 1972) and Russell 1000 and 2000 (since 1980).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/fac23214c1353f0b68d7710f6f7886a1/2eed74513d6bc154-86/s400x600/2540f531fb63ceab611b44ad7e0a2c0165670319.jpg))**\n\n*****\n\n# LPL Office Talk: Putting The Rally In Perspective\n\n&gt; One month ago today the S&amp;P 500 Index bottomed after a vicious bear market. Was this the ultimate bottom? We’ll have to wait and see, but what we do know is the rally we’ve seen over the past month is nearly as historic as the drop coming into it was.\n\n&gt; “We recently had the best 20-day rally for the S&amp;P 500 since March 2009 and one of the best ever,” explained LPL Financial Senior Market Strategist Ryan Detrick. “Looking back at the previous best 20-day rallies, one thing is consistent: very strong returns going out a year.”\n\n&gt; As shown in the LPL Chart of the Day, the 10 previous best 20-day rallies for the S&amp;P 500 saw continued gains after some near-term volatility. In fact, six months later stocks were higher 9 of 10 times and a full year later higher 10 of 10 times.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/04/Picture-4.23.20.png?ssl=1))**\n\n*****\n\n# Why The Recent Strength Has Bulls Smiling\n\n&gt; The huge equity rally continued last week, with the S&amp;P 500 Index up another 3%, on the heels of adding more than 15% in the previous week. The gain during the past two weeks of 15.5% was the greatest since October 1974. Taking it a step further, the 15 trading days ending April 14 saw the S&amp;P 500 up more than 27%, one of the greatest rallies ever. What we’ve been seeing is truly historic, so the big question now is: What could happen next?\n\n&gt; “This remarkable rally has caught most off guard, but what might surprise many to hear is more gains could eventually be in store in 2020,” explained LPL Financial Senior Market Strategist Ryan Detrick. “When we’ve seen similar blasts of extreme short-term strength, stocks have been quite strong going out 6- to 12-months.”\n\n&gt; As shown in the LPL Chart of the Day, the S&amp;P 500 was up nine of 10 times six months later and higher every single time a year later after the previous best 15-day gains ever. Be aware though, some of the returns in the near-term were weak, suggesting a pullback after such a strong move is likely. Still, this much strength in such a short timeframe could very well suggest the rest of 2020 could have bulls smiling.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/04/Market-returns-4.20.20.png?ssl=1))**\n\n*****\n\n# Dogs of the Dow Performance So Far in 2020\n\n&gt; The average stock in the Dow Jones Industrial Average is down 16.24% on a total return basis so far in 2020. Below we take a look at how the \"Dogs of the Dow\" strategy has performed so far this year.\n\n&gt; The \"Dogs of the Dow\" strategy is a very passive approach that simply says to buy the 10 stocks in the Dow 30 that have the highest dividend yields at the start of each year. The Dogs list for 2020 was led by Dow Inc. (DOW) with a yield of 5.12% on January 1st. Exxon Mobil (XOM), IBM, Verizon (VZ), Chevron (CVX), Pfizer (PFE), 3M (MMM), Walgreens (WBA), Cisco (CSCO), and Coca-Cola (KO) are the nine other members of the Dogs for 2020.\n\n&gt; As shown in the table below, the Dogs are down an average of 19.37% on a total return basis in 2020, which is a little less than five percentage points worse than the 14.68% decline seen for the 20 non-Dogs this year. Dow Inc. (DOW) and Exxon Mobil (XOM) have been the two worst performing Dogs with respective YTD declines of 39.9% and 37.0%. Dow's dividend yield has risen from 5.12% up to 8.47%, while XOM's yield has risen from 4.99% up to 7.91%. There are no Dogs that are up on the year, but Verizon (VZ) and Pfizer (PFE) have been the best performers of the group with YTD declines of less than 5%.\n\n&gt; Of the non-Dogs, Boeing (BA) has been by far the worst performer with a YTD decline of 60.01%. At the start of 2020, BA had a dividend yield of 2.52%, but that dividend has been suspended. JP Morgan (JPM), American Express (AXP) and Disney (DIS) have all fallen more than 30% YTD, while Johnson &amp; Johnson (JNJ), Walmart (WMT), and Microsoft (MSFT) are the only three Dow stocks that are up on the year.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/2020dogs.png))**\n\n*****\n\n# Investors Giving Companies a Pass on Earnings So Far\n\n&gt; We're now two weeks into the Q1 2020 earnings season, and just over 200 companies have reported their numbers so far. The average one-day price change for the stocks that have reported earnings so far this season has been a gain of 0.89%. That's much stronger than the average one-day gain of 0.06% seen for all stocks that have reported earnings since 2001.\n\n&gt; As shown below, stocks that have beaten EPS estimates this season have averaged a one-day price gain of 2.16% on their earnings reaction days. That's stronger than the average one-day gain of 1.89% seen on earnings reaction days for all stocks that have reported since 2001. Stocks that have missed EPS estimates this season have seen a one-day decline of 0.72% on their earnings reaction days. Historically, the average stock that has missed EPS has fallen 3.56% on its earnings reaction day, so this season's decline of just 0.72% suggests that investors are basically giving a pass to companies missing estimates in Q1.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/avgearn.png))**\n\n*****\n\n# Next Week's Economic Indicators\n\n&gt; Even though most economic data releases this week that had forecasts exceeded those estimates (10 of 15), data continues to come in very weak. The Chicago Fed’s National Activity index started off the week coming in at –4.19 which was well below estimates of –3. Existing home sales followed up on Tuesday, and despite coming in above estimates, sales slowed considerably from February. Elsewhere in housing data, new home sales collapsed down to 627K SAAR compared to 765K last month. Meanwhile, February home prices showed some acceleration. Jobless claims also were better than expected, but they too remain at extremely elevated levels relative to the rest of history. Manufacturing data was a major area of weakness this week. Both the preliminary Markit PMI and Kansas City Fed reading fell significantly despite coming in better than forecast. Hard manufacturing data on Friday was likewise bad at the headline level though under the hood there were some silver linings.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/eco-1.png))**\n\n&gt; Turning to next week, like the earnings calendar, the economic calendar ramps up with a total of 34 releases. We will get the final two regional Federal Reserve indices from Dallas and Richmond on Monday and Tuesday, respectively, followed by the final Markit and ISM reading for April on Friday. Wednesday will be the most closely watched day of the week with the first release of Q1 GDP as well as an FOMC rate decision. Growth in the first quarter is expected to show a 3.8% contraction. Although no change in rates is being forecast, Fed Chair Powell’s following presser will likely be closely watched for a monetary policy update.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/eco-2.png))**\n\n*****\n\n# Biggest Companies Reporting Earnings Next Week (AAPL, AMZN, MSFT and More)\n\n&gt; The earnings calendar has begun to ramp up over the past two weeks and over the next two weeks we will see peak earnings season. Next week there are a total of 784 companies scheduled to release earnings. Of those, there are 178 S&amp;P 500 stocks, which is 35.% of the index.\n\n&gt; In the table below we show the 30 largest stocks (by market cap) that are scheduled to report next week. None of the largest stocks report on Monday, but the two Dow pharmaceutical stocks, Merck (MRK) and Pfizer (PFE), kick things off Tuesday morning. The trillion dollar market cap club will all report next week with Microsoft (MSFT) out with earnings Wednesday night and Apple (AAPL) and Amazon (AMZN) out the following evening. Two other notable releases Wednesday and Thursday, respectively, will be the major payment processors Visa (V) and Mastercard (MA). Friday will be capped off with two oil giants: Exxon Mobil (XOM) and Chevron (CVX). Other honorable mentions not on this list reporting next week include industrial bell-weather Caterpillar (CAT), stocks likely benefiting from the COVID economy like Colgate Palmolive (CL) and Clorox (CLX), and finally, some travel and leisure stocks like Expedia (EXPE), Royal Caribbean (RCL), United Airlines (UAL), and Southwest Airlines (LUV).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/Earnings-table.png))**\n\n*****\n\n# Gold Bounces Right Where It Was Supposed To\n\n&gt; With central banks around the world unleashing waves of liquidity, there have been heightened concerns that one result will be a decline in the purchasing power of our money. For that reason, a number of investors have been flocking to gold. Even before the COVID-19 crisis, gold prices had been in a solid uptrend, and while prices spiked as the crisis first began, they couldn't quite get above the $1,650 - $1,700 range. In mid-March even, prices plummeted with just about every other financial asset before quickly recovering. Once again, though, the rally stalled at resistance. This time around, though, the 50-day moving average was strong enough to provide support and after that test, gold finally got the long-awaited breakout that investors had been waiting for.\n\n&gt; Gold's price spiked as high as $1,787 per ounce in mid-April before running out of momentum. When a stock or commodity breaks out above resistance to new highs and then pulls back, the former resistance level should act as support, and that is exactly what we saw this time around. This week, gold bounced right on cue at around $1,700 and has since rallied 2.6%. With the first test of support proving successful, look for gold to now establish a new range with a floor at around $1,700. At least that's what the technical analysis textbooks would say.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/04/042320-Gold.png))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$AMZN** \n&gt; * **$TSLA** \n&gt; * **$MSFT** \n&gt; * **$AAPL** \n&gt; * **$AMD** \n&gt; * **$BA** \n&gt; * **$FB** \n&gt; * **$LUV** \n&gt; * **$MMM** \n&gt; * **$GE** \n&gt; * **$AAL** \n&gt; * **$UPS** \n&gt; * **$TWTR** \n&gt; * **$PFE** \n&gt; * **$CBSH** \n&gt; * **$PEP** \n&gt; * **$MA** \n&gt; * **$GOOGL** \n&gt; * **$GILD** \n&gt; * **$SBUX** \n&gt; * **$UAL** \n&gt; * **$V** \n&gt; * **$SPOT** \n&gt; * **$MCD** \n&gt; * **$XOM** \n&gt; * **$F** \n&gt; * **$CAT** \n&gt; * **$TDOC** \n&gt; * **$AMAT** \n&gt; * **$AWI** \n&gt; * **$CHKP** \n&gt; * **$MRK** \n&gt; * **$ABBV** \n&gt; * **$WHR** \n&gt; * **$QCOM** \n&gt; * **$BP** \n&gt; * **$KHC** \n&gt; * **$CLX** \n&gt; * **$HAS** \n&gt; * **$ANTM** \n&gt; * **$NOK** \n&gt; * **$CMS** \n&gt; * **$CNX** \n&gt; * **$APRN**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/KKMTHHH.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/lRp3xer.png))**\n###### **([CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES BEFORE MONDAY'S OPEN!](https://i.imgur.com/Yw1LKpH.jpg))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 4.27.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/HW4ersg.png))\n\n\n&gt; # ***Monday 4.27.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/KnhCH1m.png))\n\n\n*****\n\n&gt; # ***Tuesday 4.28.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/XeUrTNF.png))\n\n&gt; # ***Tuesday 4.28.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/20sK5un.png))\n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/QXrGzmn.png))\n\n*****\n\n&gt; # ***Wednesday 4.29.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/tSP1S0Y.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/Sn4QllI.png))\n\n&gt; # ***Wednesday 4.29.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/DhxQrOU.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/1CpjzdJ.png))\n\n*****\n\n&gt; # ***Thursday 4.30.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/raeflTF.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/43jb0Pu.png))\n\n&gt; # ***Thursday 4.30.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/axhdXpO.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/wiL7F9e.png))\n\n*****\n\n&gt; # ***Friday 5.1.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/HZkJ2ai.png))\n\n*****\n\n&gt; # ***Friday 5.1.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# Amazon.com, Inc. -\n&gt; **Amazon.com, Inc. (AMZN)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, April 30, 2020. The consensus earnings estimate is $6.35 per share on revenue of $73.42 billion and the Earnings Whisper ® number is $6.84 per share. Investor sentiment going into the company's earnings release has 80% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 11.81% with revenue increasing by 22.98%. Short interest has increased by 29.4% since the company's last earnings release while the stock has drifted higher by 17.5% from its open following the earnings release to be 29.0% above its 200 day moving average of $1,868.70. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, April 24, 2020 there was some notable buying of 3,068 contracts of the $2,400.00 call expiring on Friday, May 1, 2020. Option traders are pricing in a 7.2% move on earnings and the stock has averaged a 4.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AMZN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Tesla, Inc. $725.15\n&gt; **Tesla, Inc. (TSLA)** is confirmed to report earnings at approximately 4:15 PM ET on Wednesday, April 29, 2020. The consensus estimate is for a loss of $0.18 per share on revenue of $5.71 billion and the Earnings Whisper ® number is ($0.27) per share. Investor sentiment going into the company's earnings release has 25% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 92.31% with revenue increasing by 25.73%. Short interest has decreased by 21.1% since the company's last earnings release while the stock has drifted higher by 14.7% from its open following the earnings release to be 74.4% above its 200 day moving average of $415.82. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, April 24, 2020 there was some notable buying of 4,971 contracts of the $800.00 call expiring on Friday, May 1, 2020. Option traders are pricing in a 13.8% move on earnings and the stock has averaged a 9.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TSLA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Microsoft Corp. $174.55\n&gt; **Microsoft Corp. (MSFT)** is confirmed to report earnings at approximately 4:20 PM ET on Wednesday, April 29, 2020. The consensus earnings estimate is $1.27 per share on revenue of $34.05 billion and the Earnings Whisper ® number is $1.34 per share. Investor sentiment going into the company's earnings release has 74% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 11.40% with revenue increasing by 11.38%. Short interest has decreased by 7.7% since the company's last earnings release while the stock has drifted higher by 0.3% from its open following the earnings release to be 14.9% above its 200 day moving average of $151.97. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, April 24, 2020 there was some notable buying of 25,039 contracts of the $172.50 put expiring on Friday, May 15, 2020. Option traders are pricing in a 5.7% move on earnings and the stock has averaged a 2.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MSFT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Apple, Inc. $282.97\n&gt; **Apple, Inc. (AAPL)** is confirmed to report earnings at approximately 4:30 PM ET on Thursday, April 30, 2020. The consensus earnings estimate is $2.10 per share on revenue of $54.00 billion and the Earnings Whisper ® number is $2.25 per share. Investor sentiment going into the company's earnings release has 29% expecting an earnings beat The company's guidance was for earnings of $2.74 to $3.17 per share. Consensus estimates are for earnings to decline year-over-year by 14.63% with revenue decreasing by 6.92%. Short interest has decreased by 6.1% since the company's last earnings release while the stock has drifted lower by 12.8% from its open following the earnings release to be 10.8% above its 200 day moving average of $255.39. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, April 23, 2020 there was some notable buying of 17,749 contracts of the $300.00 call expiring on Friday, May 1, 2020. Option traders are pricing in a 5.2% move on earnings and the stock has averaged a 4.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AAPL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Advanced Micro Devices, Inc. $56.18\n&gt; **Advanced Micro Devices, Inc. (AMD)** is confirmed to report earnings at approximately 4:15 PM ET on Tuesday, April 28, 2020. The consensus earnings estimate is $0.18 per share on revenue of $1.78 billion and the Earnings Whisper ® number is $0.19 per share. Investor sentiment going into the company's earnings release has 67% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 200.00% with revenue increasing by 39.94%. Short interest has decreased by 24.4% since the company's last earnings release while the stock has drifted higher by 17.4% from its open following the earnings release to be 40.4% above its 200 day moving average of $40.01. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, April 15, 2020 there was some notable buying of 54,202 contracts of the $55.00 call and 47,486 contracts of the $55.00 put expiring on Friday, May 15, 2020. Option traders are pricing in a 9.8% move on earnings and the stock has averaged a 9.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AMD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Boeing Co. $128.98\n&gt; **Boeing Co. (BA)** is confirmed to report earnings at approximately 7:30 AM ET on Wednesday, April 29, 2020. The consensus estimate is for a loss of $2.04 per share on revenue of $17.17 billion and the Earnings Whisper ® number is ($2.21) per share. Investor sentiment going into the company's earnings release has 11% expecting an earnings miss. Consensus estimates are for earnings to decline year-over-year by 164.56% with revenue decreasing by 25.08%. Short interest has increased by 85.7% since the company's last earnings release while the stock has drifted lower by 60.2% from its open following the earnings release to be 58.5% below its 200 day moving average of $310.71. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, April 17, 2020 there was some notable buying of 16,626 contracts of the $150.00 call expiring on Friday, May 15, 2020. Option traders are pricing in a 12.0% move on earnings and the stock has averaged a 2.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Facebook Inc. $190.07\n&gt; **Facebook Inc. (FB)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, April 29, 2020. The consensus earnings estimate is $1.76 per share on revenue of $17.61 billion and the Earnings Whisper ® number is $1.81 per share. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 107.06% with revenue increasing by 16.80%. Short interest has increased by 20.4% since the company's last earnings release while the stock has drifted lower by 8.0% from its open following the earnings release to be 0.3% below its 200 day moving average of $190.55. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, April 14, 2020 there was some notable buying of 13,018 contracts of the $350.00 call expiring on Friday, January 21, 2022. Option traders are pricing in a 8.0% move on earnings and the stock has averaged a 5.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FB&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Southwest Airlines Co. $29.33\n&gt; **Southwest Airlines Co. (LUV)** is confirmed to report earnings at approximately 6:30 AM ET on Tuesday, April 28, 2020. The consensus estimate is for a loss of $0.48 per share on revenue of $5.01 billion and the Earnings Whisper ® number is ($0.46) per share. Investor sentiment going into the company's earnings release has 23% expecting an earnings miss. Consensus estimates are for earnings to decline year-over-year by 168.57% with revenue decreasing by 2.70%. Short interest has decreased by 47.9% since the company's last earnings release while the stock has drifted lower by 44.7% from its open following the earnings release to be 42.0% below its 200 day moving average of $50.54. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, April 21, 2020 there was some notable buying of 10,235 contracts of the $20.00 put expiring on Friday, January 15, 2021. Option traders are pricing in a 9.7% move on earnings and the stock has averaged a 4.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LUV&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# 3M Company $147.00\n&gt; **3M Company (MMM)** is confirmed to report earnings at approximately 6:30 AM ET on Tuesday, April 28, 2020. The consensus earnings estimate is $2.02 per share on revenue of $8.23 billion and the Earnings Whisper ® number is $2.05 per share. Investor sentiment going into the company's earnings release has 67% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 9.42% with revenue increasing by 4.67%. Short interest has decreased by 23.9% since the company's last earnings release while the stock has drifted lower by 14.5% from its open following the earnings release to be 8.9% below its 200 day moving average of $161.32. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, April 6, 2020 there was some notable buying of 3,493 contracts of the $160.00 call expiring on Friday, May 15, 2020. Option traders are pricing in a 6.5% move on earnings and the stock has averaged a 5.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MMM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# General Electric Co. $6.26\n&gt; **General Electric Co. (GE)** is confirmed to report earnings at approximately 6:30 AM ET on Wednesday, April 29, 2020. The consensus earnings estimate is $0.06 per share on revenue of $20.70 billion and the Earnings Whisper ® number is $0.05 per share. Investor sentiment going into the company's earnings release has 23% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 57.14% with revenue decreasing by 24.14%. Short interest has decreased by 1.3% since the company's last earnings release while the stock has drifted lower by 50.2% from its open following the earnings release to be 37.4% below its 200 day moving average of $10.00. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, April 17, 2020 there was some notable buying of 12,195 contracts of the $6.00 call expiring on Friday, May 15, 2020. Option traders are pricing in a 11.2% move on earnings and the stock has averaged a 7.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=GE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/smallstreetbets.",
        "subreddit": "smallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning April 27th, 2020",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/g7tzyp/wall_street_week_ahead_for_the_trading_week/",
        "created": 1587852175.0
    },
    {
        "author": "zandarkyn21",
        "created_utc": 1587987362,
        "id": "g8z2z4",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Ok I have $1k I’m going to drop into something 5G related. Am I better off going with one of the mentioned etfs or better off going with a single company like QCOM? Going with a single company is more risk reward correct while going with one of the etfs gives broad exposure but the value of the stock will go up slower than a single stock could potentially?",
        "subreddit": "stocks",
        "title": "5G - FIVG / NXTG / or single stock: $1k",
        "url": "https://www.reddit.com/r/stocks/comments/g8z2z4/5g_fivg_nxtg_or_single_stock_1k/",
        "created": 1588016162.0
    },
    {
        "author": "options-noob",
        "created_utc": 1586616179,
        "id": "fz6mkr",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "We see that US markets are recovering from COVID-19 mess. I'm not saying we are bullish again or this is a bull trap. Over the last 10 days, all the resistances were tested, retraced and broken upwards. I think the sentiment is that the end is in sight.\n\nHowever, I'm wondering how the market is considering the slow down of world economies from Germany to India and other developing countries.\n\nIf SPX is at 2019 levels near 2800, does it mean, the whole world is expected to see a similar economic situation like in May 2019 in near future?\n\nWhat is the thought process here? American economy is export oriented. Most of Apple sales are from overseas. QCOM generates most of its earning from China. Same with machinery exports (CAT, CMI, John Deere etc).\n\nWith trade drying up, what is going to keep the markets up? Long term prospects? Is everyone who is buying now are with 5 year horizon?\n\nI honestly thought 2500 would be the ceiling, but here we are talking about going up to ATH again in some threads.",
        "subreddit": "investing",
        "title": "Question from a noob on Worldwide recession and how it will impact american companies",
        "url": "https://www.reddit.com/r/investing/comments/fz6mkr/question_from_a_noob_on_worldwide_recession_and/",
        "created": 1586644979.0
    },
    {
        "author": "bubalina",
        "created_utc": 1586083447,
        "id": "fvbwsu",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "What will be the Qualcomm of 5G?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fvbwsu/what_will_be_the_qualcomm_of_5g/",
        "created": 1586112247.0
    },
    {
        "author": "BarcosMaltazar",
        "created_utc": 1587856219,
        "id": "g83ej3",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Hey everyone, I had a portfolio of \n\nJPM\nAMD\nDIS\nNVDA\nERI\nCVX\nPAYX\nQCOM\n\nI had bought them on the 24th of March &amp; sold my shares on the 27th for a profit. Thinking &amp; waiting for the quarterly drop.. I made a good profit but I was scared I was going to lose money on the next crash. I’ve been waiting but I’m thinking I should go back in as soon as the market opens this Monday. Most likely acquiring the same stocks &amp; then some. \n\nMy question is, what should I do? \nShould I wait for a crash, is there a crash coming?\nOr should I just go buy in &amp; not worry about it &amp; look at it as a long term &amp; just forget about my purchases. \n\nI only know so much, yet so little from a far cousin out of state but I feel I have harassed him long enough so I bring my questions here.  \n\nI want to get as much information as I can get; if given good advice, I’m looking to stay in the stock business &amp; stay here. I’m ready to make smart investments &amp; stick to the Gun &amp; Butter theory. \n\nAll in all, I’m open to any type of information.",
        "subreddit": "stocks",
        "title": "26 year old with 1.5k to play with",
        "url": "https://www.reddit.com/r/stocks/comments/g83ej3/26_year_old_with_15k_to_play_with/",
        "created": 1587885019.0
    }
]