[
    {
        "author": "nevyan17",
        "created_utc": 1607217441,
        "id": "k7jzvc",
        "num_comments": 46,
        "num_crossposts": 0,
        "selftext": "HPE is also planning on reducing its footprint in California by consolidating all of its Bay Area sites to San Jose. The move is expected to save the company tens of millions of dollars. \n\nCEO Antonio Neri also announced that sales had returned to \"pre-COVID levels\" signalling a strong financial outlook moving into 2021. Here are he company’s third quarter results:\n\n    Net Sales: $7.2 billion vs. $6.88 billion\n\n    Diluted EPS: 37 cents vs. $34 cents\n\nNeri struck a bullish tone of HPE’s top line momentum continuing into 2021. HPE Stock closed Friday at 12.34 (+6.29%).\n\nTime to strike? \n\n\nhttps://finance.yahoo.com/news/hpe-ceo-sales-have-gone-back-to-pre-covid-19-pandemic-levels-191350426.html\n\nTexas Governor Abbott announcing HPE move to Houston: https://twitter.com/GregAbbott_TX/status/1333886895064027136",
        "subreddit": "wallstreetbets",
        "title": "Hewlett-Packard Enterprises (HPE) announced its moving HQ from Silicon Valley, CA to Houston, TX",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k7jzvc/hewlettpackard_enterprises_hpe_announced_its/",
        "created": 1607246241.0
    },
    {
        "author": "FinTechBootCamp",
        "created_utc": 1606891565,
        "id": "k548ja",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "HPQ.V / URAGF / **HPQ-Silicon Resources Inc**\n\nHere's why I think we can get beyond 1.29 CAD / $1 USD on 12/2/2020. I've thought a lot about this, and have chosen this stock as what I foresee to be the next NIO stock in terms of gains and growth forward propulsion upwards. \n\nIf BioSolar (EV stock) can go from $0.010 to $0.020 on No News other than SunHydrogen (FCEV stock) investors pointing it out on yahoo finance/reddit/stocktwits, because SunHydrogen going from $0.02 to $0.12 on no news and dipping to $0.06 \n\nSo we have 2 EV-centric stocks that focus on upcoming battery tech and hydrogen generation for fueling: one about battery technology that doesn't have a strong product out and is doing pilot testing. That doubled in price only because it was hyped on the other. The other being an FCEV stock which uses Hydrogen not Electric Battery as fuel. So the FCEV stocks goes 5-6x in price and dips to 3x in price, based on pure speculation. Both these stock upticks are recent and major compared to HPQ.V's for the same timeline.\n\nMeanwhile we have HPQ.V which is a pioneer in its own niche category, a niche category highly coveted and desired by both the Electric AND the Hydrogen markets in addition to other niche submarkets. We've gone up, but we are undervalued momentum wise. There is more momentum going for us than these other companies. There's more rational and fundamental logic to this stock skyrocketing. The only difference between HPQ.V and BSRC &amp; also HYSR is visibility.\n\nBSRC and HYSR get talked about on reddit often. They get talked up on Stocktwits. The RobinHood-esque trader that gets hyped up on technology and momentum sees those conversations on those boards and pumps up the value, because they see value and know the stocks are undervalued.\n\nWe as HPQ.V investors don't have a Stocktwits page. No one has mentioned the stock on that stock forum except 2 people on the help page over a week asking for a page about the stock. There are some posts on reddit about the stock, but we don't have the hype on social media boards like Stocktwits and reddit because of a few reasons\n\n1. **Not really a Penny stock:** We aren't a small penny stock, so the pennystocks subreddit overlooks us. Yes I'm posting this in the Penny stock subreddit. We are a pennystock, but we aren't a yolo 100 dollars at 0.0002 stock.\n2. **Visbility:** We don't have visibility on Stocktwits. Yes the people there seem to get super hyped on buying into stocks based on perceived value and growth, but they don't seem to know about this stock at all.\n3. **Computer Stock Confusion:** American traders who do see us on reddit or other boards may confuse HPQ.V with Hewlett Packard.\n4. **Middle Ground:** While we aren't a small penny stock, we aren't at a value high enough for the \"Retail Normies\" to give us a deeper look on the due diligence, they pass us by.\n5. **Options:** I don't know if Canadians can trade options, or sell short on this stock, but as an American, We/I cannot buy options through brokers like Ameritrade. Even If I wanted to short this stock, I wouldn't be able to do it through my broker. So the pumpers on wall street bets won't give us a solid look because we don't fit their niche.\n\nSo all of these reasons sum up to impediments in getting tech-hypers on board. There are a lot of quiet buyers, but there aren't a lot of RobinHood-like fanboys who goes bonkers about the value of the stock, because they don't know about us. If they knew about us, and could trade us, you would see many posts on reddit and stocktwits promoting the stock. \n\nWe have a lot going for us. Even with all the impediments to what would make the stock explode upwards in value, we've gone up quite a bit already. I expect that trend to continue.\n\nI'm not looking at this stock as an opportunity to make a quick short term ordinary income gain of a couple thousands, because I don't think I could catch the knife back down and buy back in at a lower price. \n\nWe are relatively unnoticed by the vocal social media tech posters, and we're doing really fine. I expect that to change in the coming days, weeks, months, quarters. I'm looking at this stock as a once in a life-time opportunity to make an incredible gain. To get in on a ground breaking company at the ground level where everything is starting to come together. \n\nGood Luck to All.\n\nFurther DD Reading:  \n[https://www.reddit.com/r/pennystocks/comments/ivuddt/quite\\_possibly\\_the\\_biggest\\_battery\\_gamechanger/](https://www.reddit.com/r/pennystocks/comments/ivuddt/quite_possibly_the_biggest_battery_gamechanger/)  \n\n\n&gt;The solar and battery industries are continually growing, and HPQ, like Timminco \\[similar company went from a penny stock to \\~$30 USD\\], are saying that they are able to produce solar-grade silicon at a much cheaper cost than current methods.  \n&gt;  \n&gt;  \n&gt;  \n&gt;On a small scale, HPQ has shown that they are able to produce 2N to 4N silicon from low quality quartz metal which is incredible and will change the game forever... IF they are able to do it on an industrial scale.  \n&gt;  \n&gt;  \n&gt;  \n&gt;There were many delays but the pilot plant is built. We have yet to hear their latest findings.  \n&gt;  \n&gt;  \n&gt;  \n&gt;In the mean time, they have 2 NDA's signed with other companies in regards to their product. Many are hoping its Tesla. Could be, but it's not necessary for HPQ's success. Being able to convert low quality quartz into 4N silicon on a large scale will change the solar industry forever, making it much more affordable.  \n&gt;  \n&gt;  \n&gt;  \n&gt;To finish things off, they have a partnership with a French solar company Apollon. Their latest NR suggests they will also be working on another industry:  \n&gt;  \n&gt;  \n&gt;  \n&gt;HPQ and Apollon Solar Extend Agreement to Work on Porous Silicon for Batteries and Expand Collaboration to Include Hydrogen Production  \n&gt;  \n&gt;  \n&gt;  \n&gt;The addition of manufacturing hydrogen by hydrolysis to our collaboration opens up a new and unique business opportunity that could represent a second multibillion-dollar addressable marketfor the PUREVAPTM Nano Silicon (Si) Reactor (“NSiR”) nanopowders.”\n\n**Disclaimer:** I have small position in the stock under 10k USD. This is my own DD based on value and momentum factors that I have noticed. Do your own DD before making investments and don't take my post to be financial advice to increase or decrease your position, or financial advice to make any kind of trade based on what I've said. This post is my opinion; simply meant to be a thought post on where I think things are going, what's happening around us, and why.",
        "subreddit": "pennystocks",
        "title": "$HPQ.V aka $URAGF EV, FCEV &amp; More! Momentum &amp; Value Opportunity.",
        "url": "https://www.reddit.com/r/pennystocks/comments/k548ja/hpqv_aka_uragf_ev_fcev_more_momentum_value/",
        "created": 1606920365.0
    },
    {
        "author": "Sumoleon",
        "created_utc": 1607008653,
        "id": "k5z2aq",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": " \n\nHi,\n\nTake a look at HPE (thats just an example): [https://finance.yahoo.com/quote/HPE](https://finance.yahoo.com/quote/HPE)\n\nNow let's sum EPS for Q1-Q4 2020: 0.44+0.22+0.32+0.37=1,35 USD per Share\n\nAllright, so take shares outstanding and multiply it by calculated EPS: 1 286 384 000 \\* 1,35 = 1 736 618 400 USD earned in 2020\n\nAnd finally let's check annual earnings on yahoo: 2020 is \"-322M\".\n\nHelp  me understand why. If all EPS for quarters of 2020 were greater than  zero why final annual earnings is negative, and so much different for my  calculations?",
        "subreddit": "StockMarket",
        "title": "Question about EPS displayed on yahoo finance",
        "url": "https://www.reddit.com/r/StockMarket/comments/k5z2aq/question_about_eps_displayed_on_yahoo_finance/",
        "created": 1607037453.0
    },
    {
        "author": "give-me-a-dolla",
        "created_utc": 1606845485,
        "id": "k4q4rk",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Anyone playin the HPE Earnings?",
        "subreddit": "wallstreetbets",
        "title": "HPE Earnings",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k4q4rk/hpe_earnings/",
        "created": 1606874285.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1609452311,
        "id": "knz3qg",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Good Thursday evening to all of you here on r/StockMarket. Happy New Year's Eve! I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week, month and year ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning January 4th, 2021.\n\n# **Politics will be front and center as a catalyst in the first week of the new year  - [(Source)](https://www.cnbc.com/2020/12/31/politics-will-be-front-and-center-as-a-catalyst-in-the-first-week-of-the-new-year-.html)**\n*****\n&gt; Stocks exit 2020 with strong gains and are riding a tailwind, but already in the dawn of the new year, the market could face its first big challenge.\n*****\n&gt; The final outcome of the 2020 election plays out Tuesday, when voters in Georgia will pick their senators and decide which party controls the U.S. Senate.\n*****\n&gt; With President-elect Joe Biden heading to the White House and a Democratic-controlled House of Representatives, Wall Street has been comfortable with the view that Biden and the Democrats could not succeed with tax hikes and more progressive policy changes while Republicans hold the Senate.\n*****\n&gt; The runoff election for the two Senate seats Tuesday is widely expected to result in one or both of the incumbent Republican senators retaining their seats. But Democrats are close in the polls and should they win, each party would have 50 seats with Vice President-elect Kamala Harris the tie breaker.\n*****\n&gt; “Georgia is the most important thing to the Biden presidency for the next two years,” said Ed Mills, Washington policy analyst at Raymond James. “It’s going to determine what is the legislative agenda and who can get confirmed by the United States Senate.”\n*****\n&gt; Sen. David Perdue is being challenged by Democrat Jon Ossoff, while GOP Sen. Kelly Loeffler is running against Democrat Raphael Warnock. None of the candidates had more than 50% of the vote in the Nov. 3 election, so Georgia law requires a runoff election between the two leading candidates for each seat.\n*****\n&gt; “It’s a binary event,” said Mills, adding it’s of growing interest to markets. “The general sense for the market is that Republicans are well positioned to maintain their majority in the Senate. But I think the 2020 election as well as the 2016 election and to some extent, the 2018 election has humbled us … The Senate outcomes, in particular, seem to be less predictable than almost any other elections.”\n*****\n&gt; Mills said the results may take several days to determine, adding to the uncertainty the event could hold for markets. According to an RBC investor survey, 88% expect Republicans to maintain control, and most say that is a positive for the stock market.\n*****\n&gt; “The market tends to shoot first and ask questions later. There will certainly be a reaction if Democrats win both those seats,” said Peter Boockvar, chief investment officer at Bleakley Advisory Group. Strategists say there could be a relief rally if Republican incumbents see a clear victory.\n*****\n&gt; “That totally dominates [trading] because it’s about do we have status quo or do we have Democrats controlling all parts of Washington and what that means for spending and taxes,” Boockvar said. “I think you could see the worries about taxes overwhelming any thoughts on the benefits of more spending” by Democrats.\n*****\n&gt; # By the numbers\n&gt; A year of extreme volatility ended with a big win for stocks, as the pandemic steered the course for markets. The S&amp;P 500 was up 16.3% for the year, ending at 3,756. That gain comes after a 34% decline early in the year, followed by a powerful more-than 65% rebound. Technology was the big winner for the year, and the Nasdaq was up 43.6% at 12,888.\n*****\n&gt; Besides the runoff vote, the market will be watching a stream of data in the coming week, including the important December jobs report Friday. That could show fewer than 100,000 jobs were added as the spreading virus impacted hiring and layoffs. There were 245,000 jobs created in November.\n*****\n&gt; There is also ISM manufacturing data Tuesday, and a number of Fed speakers, including Vice Chairman Richard Clarida on Friday.\n*****\n&gt; The virus itself could also be a factor for stocks.\n*****\n&gt; Conventional wisdom for the coming year has been that vaccines will be widely distributed, and by the second half things will start to get back to normal and the economy will pick up. But the initial distribution has been slow, and far short of the 20 million targeted for December by President Donald Trump’s task force.\n*****\n&gt; In that recent RBC survey, three quarters of investors were optimistic about vaccine distribution with 80% expecting a majority to be vaccinated by the end of 2021. “We suspect that the positive outlook for the stock market and the economy would deteriorate if expectations for a smooth vaccine rollout are not met,” RBC strategists wrote.\n*****\n&gt; They also noted that nearly 60% of the investors surveyed believe high stock market valuations are problematic.\n*****\n&gt; “This suggests to us that any threat to the economic and earnings recovery story could spark profit-taking. On this point, it is worth noting that the vaccine was the No. 1 issue keeping investors up at night, closely followed by monetary policy and excessive optimism on the recovery,” the strategists noted.\n*****\n&gt; Chris Rupkey, chief financial economist at MUFG Union Bank, said investors will also be watching the formal acceptance of the Electoral College vote Wednesday. Strategists expect the vote count to confirm Biden’s presidency.\n*****\n&gt; However, Missouri Sen. Josh Hawley says he will challenge the certification, and several House Republicans have already vowed to contest the election at that time. If one House member and a senator jointly object to a state’s slate of electors, the two houses of Congress must separately debate and vote on the objection.\n*****\n&gt; Strategists see little chance of any impact on the election outcome, but there could be fireworks. Trump has been claiming since the election that there was fraud but multiple courts failed to find any truth to the claims.\n*****\n&gt; Rupkey said investors are not taking into account enough potential for political risk from the deep animosity between the two political parties.\n*****\n&gt; “I think the additional stimulus and hopes for additional stimulus, and infrastructure spending in 2021, I don’t know that that is such a slam dunk, because of the issue of political instability,” he said.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/cAXzkxf.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/HnhSggu.png))**\n\n# **Major Futures Markets as of Thursday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF THURSDAY!](https://i.imgur.com/5egoYkS.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/UlNY0Um.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/z4wSKuc.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/32Ma7rG.png))**\n\n# **Major Indices Pullback/Correction Levels as of Thursday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/mRJqU8A.png)**\n\n# **Major Indices Rally Levels as of Thursday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/J7B4Njx.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!]())**\n(T.B.A. THIS WEEKEND.)\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/JJmAiwp.png))**\n\n# **Thursday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/1ARzFfu.png))**\n\n*****\n\n&gt; # Why A Year-End Rally Bodes Well For 2021\n\n&gt; Welcome to the last day of 2020! It has been a devastating year in so many ways, yet for investors it has been quite rewarding. Much of the gains in 2020 have taken place the final two months, with the S&amp;P 500 Index up more than 14% in November and December so far, the best end to a year since WWII.\n\n&gt; A big end of year rally could have bulls smiling in 2021. “Turns out a 10% or more gain the final two months of the year has equaled a higher S&amp;P 500 the following year every single time since World War II,” explained LPL Financial Chief Market Strategist Ryan Detrick. “In fact, January was also higher every single time as well, so maybe this strong rally to end the year is a clue for higher prices into next year.”\n\n&gt; As shown in the LPL Chart of the Day, the S&amp;P 500 gained an average of more than 18% the year following a 10% or more surge during the final two months of the year. Meanwhile, January was up 5 for 5 as well, rising an impressive 3% on average.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/12/12.31.20-Blog-Chart-1.png?ssl=1))**\n\n&gt; Here’s what the average year looks like after the prior year gains 10% or more the final two months compared to a typical year. Once again, strong returns are the playbook historically.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/12/blog-12.31.20-2.png?ssl=1))**\n\n&gt; We wish everyone a happy and safe New Years Eve and we’ll see you in 2021!\n\n*****\n\n&gt; # Fifty to Zero in 283 Days\n\n&gt; In a year with some pretty crazy charts, the one below is right up there with some of the best. After all the markets have been through this year, bot the S&amp;P 500 and Long-Term Treasuries have seen nearly identical returns on a total return basis. That's right, with just a few hours left in the trading year, the S&amp;P 500's total return in 2020 has been a gain of 17.6%, while Long Term US Treasuries, as measured by the B of A Merrill Lynch Long-Term Treasury Index has rallied 17.3%. What makes this nearly identical performance all the more incredible is that on March 23rd, the performance gap between the two was more than 50 percentage points.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/123120-Stocks-Bonds.png))**\n\n&gt; The fact that stocks and bonds have essentially seen identical returns this year isn't typical. The chart below shows the annual performance spread between the S&amp;P 500 and long-term US Treasuries going back to 1978. During that time, the S&amp;P 500 has historically outperformed long-term US Treasuries by an average of 3.9 percentage points per year, but the average gap in performance between the two has been over 15 percentage points. In the 43 years since 1978, there have only been seven other years where the performance spread between the two asset classes was less than five percentage points and just two years (1985 and 1992) where the performance spread was less than a percentage point.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/123120-Stocks-Bonds-Annual-Spreads.png))**\n\n*****\n\n&gt; # Back-to-Back Big Years for Technology\n\n&gt; With just two trading days (including today) left in 2020, the S&amp;P 500 Technology sector is on pace for its second year in a row of rallying more than 40%. Going back to 1990, the only time the Technology sector experienced back-to-back returns of more than 40% was in 1998 and 1999. Back then, not only was the Technology sector up 40%+ in back-to-back years, but it was also up over 75% in both of those years. If you think markets are pretty crazy these days, they still have nothing on the last two years of the 1990s!\n\n&gt; In terms of cumulative returns, the Technology sector is up 210% since the last trading day of 2018, whereas in 1999 it was up 317% in a two-year span. What's also interesting to note about the last 31 years of returns for the Technology sector is how it has only experienced five down years, while the S&amp;P 500 has been down in ten different years during that span. Furthermore, since 2009 there has only been one down year and the decline was a paltry 1.6%. Not a bad 12-year run!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/123020-Technology-Sector-Performance.png))**\n\n&gt; Given that the sector has more than doubled in the last two years, there have been some big individual winners. Topping the list with a gain of just under 400% is Advanced Micro Devices (AMD). On the last day of 2018, AMD traded hands for under $20 per share. Today's it's over $90. AMD has a lead of more than 100 percentage points over the next closest stock - NVIDIA (NVDA) - which is up 288%. Interestingly, there aren't a lot of major outliers to the upside compared to the sector's 210% gain, but that's because Apple (AAPL), the sector's largest stock, has paced the sector's gains by rallying more than 240%.\n\n&gt; On the downside, just four stocks in the Technology sector have declined in the last two years. The worst of these has been DXC Technology (DXC) which has lost more than half of its value, while Juniper (JNPR) and HP Enterprise (HPE) are down between 10% and 20%. Lastly, FLIR Systems (FLIR) has declined less than 2%, so depending on how it acts in the next two days, it could move into positive territory just as Intel (INTC) did yesterday after Third Point bailed it out and moved the stock barely into positive territory for the last two years.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/123020-Technology-Sector-Stocks.png))**\n\n*****\n\n&gt; # Growth Dragging on Small Caps\n\n&gt; In the past couple of weeks, we have frequently been keeping tabs on small-cap equities which have been particularly strong performers of late resulting in very overbought readings as well as extended valuations. More specifically, taking a look at growth-oriented small-caps, with only a couple days left in the year small-cap growth stocks—proxied by the Russell 2000 Growth ETF (IWO)—are on pace to have outperformed large-cap equivalents in 2020. On December 10th, IWO surpassed the S&amp;P 500 Growth ETF (IVW) in terms of YTD performance, and even after pulling back in the past week, IWO is still in the lead.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/123020-Small-Large1.png))**\n\n&gt; As a result of recent moves, there has been a sharp reversal on a relative basis between the two ETFs in the past week. In the chart below, we show the ratio of the Russell 2000 Growth ETF (IWO) versus the S&amp;P 500 Growth ETF (IVW). This ratio took off beginning in the early fall meaning small-cap growth drastically outperformed large-cap growth. But the former's weakness in the past several days has put a halt to that move.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/123020-Small-Large2.png))**\n\n&gt; As to just how sharp of a reversal this was, in the five days through yesterday's close, the decline in the ratio of IWO to IVW was the largest since June. Before that, April and March saw declines that were even larger. Not only was this one of the biggest drops in the relative performance of small-cap growth to large-cap growth in the past few months, but that also stands in the bottom 0.5% of all readings going back to 2000 when the ETF first began trading. Outside of this past spring, the only other periods that have also experienced this type of underperformance of small-cap growth relative to large-cap growth was at various points in 2011, 2008, and a handful of times in the early 2000s.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/123020-Small-Large3.png))**\n\n&gt; Small-cap underperformance has not necessarily been broad though. For value stocks, small caps (IWN) have generally outperformed large caps (IVE) for the entirety of the new bull market. While there was a bit of a turn lower in recent days, it has been nowhere close to as dramatic of a move as growth stocks.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/123020-Small-Large4.png))**\n\n&gt; In the charts below, we show average performance over the past week of Russell 2000 stocks broken into deciles based on their price to sales and price to book ratios. As shown, the most aggressively valued deciles have averaged the worst performance in the past week. Stocks with low P/S and P/B ratios have not been immune from the weakness, but they have held up significantly better.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/123020-RTY-Decile.png))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending December 31st, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=oFRABTKrDl8))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 1.3.21**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED!)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **(T.B.A. THIS WEEKEND.)**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!]())**\n(T.B.A. THIS WEEKEND.)\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/JNknzoH.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 1.4.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n&gt; # ***Monday 1.4.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!]())\n(NONE.)\n\n*****\n\n&gt; # ***Tuesday  1.5.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ZAbC0jw.png))\n\n&gt; # ***Tuesday 1.5.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/wKzyMxp.png))\n\n*****\n\n&gt; # ***Wednesday 1.6.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/BUFtffd.png))\n\n&gt; # ***Wednesday 1.6.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/cDQHHqx.png))\n\n*****\n\n&gt; # ***Thursday 1.7.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/NhUT413.png))\n\n&gt; # ***Thursday 1.7.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/7p03h4M.png))\n\n*****\n\n&gt; # ***Friday 1.8.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Friday 1.8.21 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # (TB.A. THIS WEEKEND.)\n**(TB.A. THIS WEEKEND.)** (TB.A. THIS WEEKEND.)\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SPY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading year ahead r/StockMarket.",
        "subreddit": "StockMarket",
        "title": "Wall Street Week Ahead for the trading week beginning January 4th, 2021 (Happy New Year r/StockMarket!)",
        "url": "https://www.reddit.com/r/StockMarket/comments/knz3qg/wall_street_week_ahead_for_the_trading_week/",
        "created": 1609481111.0
    },
    {
        "author": "Sumoleon",
        "created_utc": 1606991117,
        "id": "k5urac",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Hi,\n\nTake a look at HPE (thats just an example): [https://finance.yahoo.com/quote/HPE](https://finance.yahoo.com/quote/HPE)\n\nNow let's sum EPS for Q1-Q4 2020: 0.44+0.22+0.32+0.37=1,35 USD per Share\n\nAllright, so take shares outstanding and multiply it by calculated EPS: 1 286 384 000 \\* 1,35 = 1 736 618 400 USD earned in 2020\n\nAnd finally let's check annual earnings on yahoo: 2020 is \"-322M\". \n\nHelp me understand why. If all EPS for quarters of 2020 were greater than zero why final annual earnings is negative, and so much different for my calculations?",
        "subreddit": "stocks",
        "title": "Question about EPS displayed on yahoo finance",
        "url": "https://www.reddit.com/r/stocks/comments/k5urac/question_about_eps_displayed_on_yahoo_finance/",
        "created": 1607019917.0
    },
    {
        "author": "Sumoleon",
        "created_utc": 1606919697,
        "id": "k5aati",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Hi,\n\nWhy some companies announce Q4 earnings now? I mean it's one month before q4 ends. For example HPE [https://finance.yahoo.com/quote/HPE](https://finance.yahoo.com/quote/HPE) \" HPE delivered fourth-quarter fiscal 2020 non-GAAP earnings of 37 cents per share \"\n\n&amp;#x200B;\n\nHow can they tell it already? I imagine that you need Q4 to end, and then like one or two weeks to calculate everything and only then you can announce your q4 earnings",
        "subreddit": "stocks",
        "title": "Quarter earnings question",
        "url": "https://www.reddit.com/r/stocks/comments/k5aati/quarter_earnings_question/",
        "created": 1606948497.0
    },
    {
        "author": "The-Techie",
        "created_utc": 1606902979,
        "id": "k56i1v",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "InvestmentClub",
        "title": "Tanium, HPE Move HQ From California",
        "url": "https://www.thetechee.com/2020/12/tanium-hpe-move-hq-from-california.html",
        "created": 1606931779.0
    }
]