[
    {
        "author": "ryan148h",
        "created_utc": 1604391087,
        "id": "jn6l3l",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Whatup Retards, \n\nFirst of all to make things clear i do not have any non-public information about this company so keep that in mind.\n\nSo my dad has been working for DXC (ex CSC) for more than 10 years working in a higher up Position for the European Part of the Company.\n\nThey will report earnings on the 5th of November.  \nThe Company has been cutting jobs and acquiring companies left and right.  \nAs a result of a ton of changes to the Leadership of the company the stock price has been slaughtered.\n\nThe Price to Book of this Company is 1.049 meaning if they were to liquidate or file for bankruptcy they would be able to get all of theit investors pretty much every cent back.  \nAlso they have acquired Luxoft which has a market cap of over 5 Billion Dollars.  \nKeep in mind that they have a ton of recurring Revenue from big Contracts with Government Organisation such as the NSA and huge Companies like .\n\nSo what is the company currently valued at?\n\n**5 Billion Dollars**\n\nMeaning that in the current stock price there is 0% Growth factored in.\n\nSo how can this be?\n\nWell all the Leadership Changes have destroyed the price of the stock which has only slowly been recovering from the Pandemic Lows.\n\nEarnings should be beat easily and Options are priced very low for the Stock.\n\nThis is not a hyped Stock play but a good earnings beat should easily propell the stock by 10-20 percent as investors gain faith in the new CEO Mike Salvino.\n\n&amp;#x200B;\n\nI have seen this stock be called a pump and dump in a post published about a month ago so i will dm you an image of my DXC Coffe Mug for proof of the things i have stated in this post.\n\n&gt;!Oh and fuck the SEC lmao!&lt;\n\nPositions:\n\nStock, 100x23 Calls expiring on the 11/20/2020 as well as  50x30 Calls for January 19th",
        "subreddit": "wallstreetbets",
        "title": "DXC Earnings YOLO",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jn6l3l/dxc_earnings_yolo/",
        "created": 1604419887.0
    }
]