[
    {
        "author": "WSBConsensus",
        "created_utc": 1580481911,
        "id": "ewpfo5",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "*Sorry it’s a tad bit late, maybe I’ll give you a muffin on the house later.* \n\n\n**Of note for large tech names (FB, AAPL, AMZN, GOOG)** FTC’s Phillips, a GOP member, stated antitrust enforcement is not an answer to privacy concerns surrounding the tech giants, questioning if it would lead to better privacy protections for the consumers, according to WSJ.\n\n#DOW\n\n**Caterpillar Inc. (CAT)** Q4 19 (USD): EPS 2.63 (exp. 2.37), Revenue 13.14bln (exp. 13.41bln). FY EPS view 8.50-10.00 (exp. 10.63) - Expects continued global economic uncertainty to pressure sales to users in 2020 and cause dealers to further reduce inventories. Machine Sales 3mth rolling: World -5%, NA -4%, APAC -5%, LATAM -12%.\n\n**Chevron Corp. (CVX)** Q4 19 (USD): Loss of 3.51; adj. EPS 1.49 (exp. 1.45), Revenue 35bln (exp. 38.64bln). Included in current quarter were previously announced upstream impairments and write-offs totalling 10.4bln. US upstream segment recorded 8.2bln in impairment charges mainly due to Appalachia Shale and Big Foot. Recognized 1.2bln gain on the sale of its UK Central North Sea assets. Refinery crude oil input rose by 69% to 975k BPD. Cash Flow from operations YTD 27.3bln (prev. 30.6bln). Global production of oil-equivalent was unchanged at 3.08mln BPD. FY20 production growth forecasted to rise by 3%.\n\n**Exxon Mobil Corp. (XOM)** Q4 19 (USD): EPS 1.33, Ex-items 0.41 (exp. 0.43), Revenue 67.17bln (exp. 64.17bln). Production was in line with Q4 '18 at 4mln BPD. Earnings included favourable identified items of about 3.9bln, mainly a gain of 3.7bln from its Norway upstream divestment. Affirms 2020 CapEX guidance.\n\n**International Business Machines (IBM)** named Arvind Krishna as its new CEO, who is currently Senior VP for Cloud and Cognitive software, and was a key figure in the RedHat acquisition.\n\n**Visa Inc. (V)** Q4 19 (USD): Adj. EPS 1.46 (exp. 1.46), Revenue 6.1bln (exp. 6.08bln). Announced 9.5bln share repurchase programme, FY20 revenue growth affirmed at low double digits and EPS growth affirmed in the mid-teens.  Payments volume +8%.\n\n\n#NASDAQ 100\n\n\n**Amazon.com Inc. (AMZN)** Q4 19 (USD): EPS 6.47 (exp. 4.04), Revenue 87.4bln (exp. 86.02bln). Q1 revenue view between 69-73bln (exp. 71.65bln), Subscription services sales 5.235bln (exp. 5.16bln), Online store sales 45.657bln (exp. 45.77bln), AWS sales 9.954bln (Exp. 9.84bln), Physical stores 4.365bln (prev. 4.401bln), 150mln prime members around the world, biggest quarterly gain in history. NA sales 53.67bln (prev. 44.124bln), International 23.8bln (exp. 20.83bln). Following the results Morgan Stanley increased its PT to USD 3000.\n\n**Amgen Inc. (AMGN)** Q4 19 (USD): Adj. EPS 3.64 (exp. 3.47), Revenue 6.2bln (exp. 6.06bln). FY20 EPS expected at 14.85-15.60 (exp. 15.98), FY20 revenue expected between 25-25.6bln (exp. 25.3bln). Enbrel sales 1.364bln (exp. 1.828bln), Prolia 752mln (exp. 724mln), Neulasta 665mln (exp. 676mln).\n\n**Charter Communications (CHTR)** Q4 19 (USD): Revenue 11.8bln (exp. 11.73bln). Residential customer relationships +240k (Prev. 207k Y/Y). Total customer relationships increased by 3.8% or 1mln to 27.3mln.\n\n**IDEXX Laboratories (IDXX)** Q4 19 (USD): EPS 1.04 (exp. 0.90), Revenue 0.605bln (exp. 0.6bln). Raised FY20 EPS view to 5.42-5.58 (exp. 5.41), raised FY20 revenue guidance to 2.62-2.66bln (exp. 2.63bln).\n\n**Tesla (TSLA)** plant in Germany could be postponed by 9 months if construction does not start by the middle of March, according to the Brandenburg economy minister.\n\n**Vertex Pharmaceuticals Inc (VRTX)** Q4 19 (USD): EPS 2.23 (exp. 1.20), Revenue 1.41bln (exp. 1.01bln). FY20 product revenue expected between 5.1-5.3bln (exp. 4.87bln).\n\n**Western Digital (WDC)** Q2 19 (USD): EPS 0.62 (exp. 0.58), Revenue 4.2bln (exp. 4.22bln). Q3 Adj. EPS 0.85-1.05 (exp. 0.73), and revenue between 4.1-4.3bln (exp. 4.06bln). Announced it successfully developed its fifth-generation 3D NAND technology, BiCS5.\n \n#S&amp;P 500\n\n\n**AbbVie Inc. (ABBV)** received a positive CHMP opinion for its Venclyxto drug , as a chemotherapy free combination regimen for patients with previously untreated chronic lympocytic leukemia. It also received position CHMP opinion for its MAVIRET to shorten once daily treatment for patients with hepatitis C and genotype 3 infection.\n\n**Arthur J. Gallagher &amp; Co. (AJG)** Q4 19 (USD): Adj. EPS 0.58 (exp. 0.52), Revenue 1.68bln (exp. 1.4bln).\n\n**Broadridge Financial Solutions (BR)** Q4 19 (USD): EPS 0.53 (exp. 0.71), Revenue 0.97bln (exp. 1.bln). FY EPS view at lower end of previous guidance.\n\n**Cardinal Health Inc. (CAH)** has initiated field action for company procedure packs which contains gowns that were recalled last week.\n\n**Celanese (CE)** Q4 19 (USD): Adj. EPS 1.99 (exp. 2.13), Revenue 1.43bln (exp. 1.53bln). FY20 EPS view 11.00 (exp. 11.00)\n\n**Church &amp; Dwight (CHD)** Q4 19 (USD): EPS 0.55 (exp. 0.55), Revenue 1.14bln (exp. 1.14bln). Increased dividend to USD 0.24/share, a 5.5% increase. 2020 EPS view 2.64-2.69 (exp. 2.69), revenue growth of 6.5% expected. Q1 EPS view 0.73 (exp. 0.76), revenue view growth of roughly 6.5%.\n\n**Citrix Systems (CTXS)** announced an accelerated USD 1bln share repurchase programme.\n\n**Colgate-Palmolive (CL)** Q4 19 (USD): EPS 0.73 (exp. 0.73), Revenue 4.015bln (exp. 3.93bln). Gross profit margin 60.1% (Prev. 59.1% Y/Y). expects FY20 net sales net growth of 4-6%.\n\n**Eastman Chemical (EMN)** Q4 19 (USD): EPS 1.42 (exp. 1.33), Revenue 1.33 (exp. 2.2bln). FY20 EPS view 7.20-7.60 (exp. 7.74).\n\n**Edwards Lifesciences (EW)** Q4 19 (USD): Adj. EPS 1.46 (exp. 1.49), Revenue 1.2bln (exp. 1.14bln). Raised FY20 EPS view 6.15-6.40 (exp. 6.16, prev. 6.05-6.30), raised FY20 revenue view 4.6-5bln (exp. 4.8bln, prev. 4.5-5bln)\n\n**Honeywell Int'l Inc. (HON)** Q4 19 (USD): EPS 2.06 (exp. 2.04), Revenue 9.496bln (exp. 9.61bln), FY EPS view 8.60-9.00 (exp. 8.14) - sees significant headwinds from 737 Max production delays to aerospace segment this year. Outlook assumes a minimal economic impact for China as well as the Global Economy.\n\n**Illinois Tool Works (ITW)** Q4 19 (USD): EPS 1.89 (exp. 1.85), Revenue 3.5bln (exp. 3.46bln). Plans to repurchase USD 2bln of its shares in 2020. FY20 EPS view 7.65-8.05 (exp. 7.98).\n\n**Johnson Controls International (JCI)** Q4 19 (USD): EPS 0.40 (exp. 0.38), Revenue 5.60bln (exp. 5.57bln)\n\n**LyondellBasell (LYB)** Q4 19 (USD): EPS 1.83 (exp. 2.25), Revenue 8.18bln (exp. 8.44bln). Expects typical seasonal improvements.\n\n**Marathon Petroleum (MPC)** is reportedly mulling the sale of its speedway unit, alongside an IPO.\n\n**Phillips 66 (PSX)** Q4 19 (USD): EPS 1.54 (exp. 1.63), Revenue (exp. 28.07bln).\n\n**ResMed (RMD)** Q4 19 (USD): Adj. EPS 1.21 (exp. 1.02), Revenue 0.736bln (exp. .73bln). Announced it is to acquire SnapWorx, a private software company.\n\n**Robert Half International (RHI)** Q4 19 (USD): EPS 0.98 (exp. 0.98), Revenue 1.54bln (exp. 1.54bln). Q1 EPS view 0.90-0.96 (exp. 3.92), FY Revenue view 1.51-1.58bln (exp. 6.08bln).    \n\n#OTHER\n\n**Booz Allen Hamilton Holding Corp (BAH)** \nQ3 19 (USD): Adj. EPS 0.80 (exp. 0.76), Revenue 1.8bln (exp. 1.82bln). Raised FY20 EPS view to 3.05-3.15 (exp. 3.15, prev. 3.00-3.10), raised FY Revenue growth view to 10-11.5% (prev. 9-11%).\n\n**Cypress Semiconductor Corp (CY)** Q4 19 (USD): EPS 0.28 (exp. 0.29), Revenue 0.56bln (exp. .56bln).\n\n**Deckers Outdoor Corp (DECK)** Q4 19 (USD): EPS 7.14 (exp. 6.55), Revenue 0.94bln (exp. .0.90bln). Raised FY20 EPS view to 9.40-9.50 (exp. 9.20, prev. 8.90-9.05), FY Revenue view raised to 2.15bln-2.16bln (exp. 2.14bln, prev. 2.115-2.14bln).\n\n**Dropbox (DBX)** announced Olivia Nottebohm as its new COO, Nottebohm is a former executive at **Google (GOOG)** and was Vice President of Google Cloud, SMB Sales and GTM operations.\n\n**Embraer (ERJ)** signed a contract with **SkyWest (SKYW)** for an order of 20 E175 jets for USD 972mln, according to list prices\n\n**KKR &amp; Co Inc (KKR)**  Q4 19 (USD): EPS 0.44 (exp. 0.42), Revenue 0.96bln (exp. .94bln).\n\n**Levi Strauss &amp; Co (LEVI)** Q4 19 (USD): Adj. EPS 0.26 (exp. 0.21), Revenue 1.57bln (exp. 1.58bln). Announced a USD 100mln share repurchase programme, Gross margin +110bps, FY20 EPS view 1.18-1.22 (exp. 1.17).\n\n**Match (MTCH) / The Meet Group (MEET)** dating apps, including Tinder and Bumble, are reportedly under investigation for allowing minors and sex offenders on the applications, according to AP.\n\n**Navistar (NAV)** – **Volkswagen (VOW3 GY)** truck unit, Traton, confirmed it is planning an offer to purchase the remaining shares of Navistar which it does not currently own for USD 35/shr in cash.\n\n**Nokia (NOK) and Orange (ORAN FP)** announced Nokia will provide a variety of products and services to parts of France, with items ranging from Single Radio Access Network, advanced automation tools as part of its 5G portfolio.\n\n**Phillips 66 Partners LP (PSXP)** Q4 19 (USD): EPS 1.06 (exp. 0.96), Revenue 0.43bln (exp. .42bln).\n\n**United States Steel Corp. (X)** Q4 19 (USD): EPS -0.64 (exp. -1.11), Revenue 2.82bln (exp. 3.56bln). Cut its dividend to 0.05 (prev. 0.06), expects Q1 to be trough for the year due to seasonal factors of its mining operations.\n\n**WWE (WWE)** announced its CFO and co-Presidents Barris and Wilson will be leaving the company and will no longer remain on the board of directors.\n\n\n#Additional US Equity Stories\n\n **(WWE)** downgraded to Equal Weight from Overweight at Morgan Stanley\n\n**Weyerhaeuser (WY)** Q4 19 (USD): Ex-items 0.03 (exp. 0.05), revenue 1.55bln (1.53bln). Sees Q1 Timberlands earnings adj. EBITDA slightly above Q4’s.\n\n**Pfizer (PFE)** announced it received a positive CHMP recommendation for its Tuxience drug, a biosimilar for rheumatoid arthritis. \n\n**UPS (UPS)** announced it will be providing over 2mln masks to China in wake of the coronavirus for free, along with other protective gear.",
        "subreddit": "wallstreetbets",
        "title": "Here’s ya coffee",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ewpfo5/heres_ya_coffee/",
        "created": 1580510711.0
    },
    {
        "author": "mytwm",
        "created_utc": 1579554989,
        "id": "erjtvx",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "## 🌱 Microsoft announces it will be carbon negative by 2030\nThe company announced an aggressive program to cut carbon emissions by more than half by 2030, both for their direct emissions and for their entire supply and value chain. It also announced a new initiative to use Microsoft technology to help their own suppliers and customers around the world reduce their own carbon footprints and a new $1 billion climate innovation fund to accelerate the global development of carbon reduction, capture and removal technologies.\n\n[Microsoft financial scores](https://inspectcompany.com/microsoft):\n* Profitability: **9.2**/10\n* Operating Efficiency: **9.2**/10\n* Liquidity: **8.7**/10\n* Solvency: **7.3**/10\n\n\n## 🛰 Lockheed Martin launched first smart satellite to enable Space Mesh Networking\nA new era of space-based computing is now being tested in-orbit that will enable artificial intelligence, data analytics, cloud networking and advanced satellite communications in a robust new software-defined architecture. Lockheed Martin launched the Pony Express 1, an example of rapid prototyping, which was developed, built and integrated in nine months. Future research missions this year, like Pony Express 2, will further advance cloud networking concepts among satellites, as well as validating Lockheed Martin’s SmartSat™ software-defined satellite architecture which enables streamlined hosting of flexible mission apps.\n\n[Lockheed Martin financial scores](https://inspectcompany.com/lockheed-martin):\n* Profitability: **7.9**/10\n* Operating Efficiency: **5.8**/10\n* Liquidity: **6.1**/10\n* Solvency: **4.2**/10\n\n\n## 💰 Visa acquired Plaid for $5.3 billion\nVisa announced it has signed a definitive agreement to acquire Plaid, a network that makes it easy for people to securely connect their financial accounts to the apps they use to manage their financial lives. Visa will pay total purchase consideration of $5.3 billion to acquire Plaid. Once closed, the combination of Visa and Plaid is expected to provide significant benefits to developers, financial institutions and consumers.\n\n[Visa financial scores](https://inspectcompany.com/visa):\n* Profitability: **9.8**/10\n* Operating Efficiency: **9.8**/10\n* Liquidity: **7.6**/10\n* Solvency: **3.7**/10\n\n\n## 🚀 Honeywell and Lockheed Martin to provide critical components for NASA’s Orion spacecraft\nHoneywell has been awarded a contract by Lockheed Martin to support production of NASA’s Orion spacecraft fleet for the upcoming Artemis missions, which will bring humans back to the moon for the first time since 1972. Honeywell will provide 14 product types for Artemis missions III through V, including both hardware and software solutions, to support NASA’s lunar missions. NASA awarded Lockheed Martin a long-term, multibillion-dollar production contract for the Orion spacecraft, aimed to meet the space agency’s anticipated needs into the 2030s.\n\n[Honeywell financial scores](https://inspectcompany.com/honeywell):\n* Profitability: **8.3**/10\n* Operating Efficiency: **7**/10\n* Liquidity: **4.8**/10\n* Solvency: **6.7**/10\n\n## 📊 Top earnings reports this week\n* January 21: Netflix\n* January 21: IBM\n* January 21: Capital One\n* January 21: Halliburton\n* January 21: Comerica\n* January 21: United Airlines\n* January 21: TD Ameritrade\n* January 21: Zions Bancorporation\n* January 22: Texas\n* January 22: Citrix\n* January 22: Progressive\n* January 22: Johnson &amp; Johnson\n* January 22: Fifth Third Bank\n* January 22: Abbott Laboratories\n* January 22: Raymond James Financial\n* January 23: Intel\n* January 23: JetBlue\n* January 23: American Airlines\n* January 23: Travelers\n* January 23: VF\n* January 23: Silicon Valley Bank\n* January 23: Comcast\n* January 23: Huntington\n* January 23: Union Pacific\n* January 23: Atlassian\n* January 24: Air Products and Chemicals\n* January 24: American Express",
        "subreddit": "StockMarket",
        "title": "What's happening this week? Headlines on Microsoft, Lockheed Martin, Visa and Honeywell",
        "url": "https://www.reddit.com/r/StockMarket/comments/erjtvx/whats_happening_this_week_headlines_on_microsoft/",
        "created": 1579583789.0
    },
    {
        "author": "sausisNL",
        "created_utc": 1579321562,
        "id": "eqbsqt",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Just saw this article about organizations running Cytrix systems:\n\n\nhttps://www.zdnet.com/article/proof-of-concept-code-published-for-citrix-bug-as-attacks-intensify/#ftag=CAD-00-10aag7e\n\nThe vulnerability has been discovered in December but the stock has been climbing since then. Thoughts why market hasn’t turned bearish yet?",
        "subreddit": "stocks",
        "title": "Citrix systems",
        "url": "https://www.reddit.com/r/stocks/comments/eqbsqt/citrix_systems/",
        "created": 1579350362.0
    },
    {
        "author": "JakeSmithsPhone",
        "created_utc": 1578594089,
        "id": "emdmiz",
        "num_comments": 49,
        "num_crossposts": 0,
        "selftext": "Hi fellow subredditors,  \n  \nAre you trying to become the next Warren Buffet? Are you trying to use fundamental analysis, using metrics like P/E to buy cheap stocks in order to gain long-term alpha? Is it not working out that well? If it isn't working, this PSA is for you.  \n  \nBuying a stock based on fundamentals with no context is like buying a house that's 3 bed, 2.5 bath, and 2000 square feet without knowing other important details. Sure, you could simply *pay less* for those walled-off requirements, but that doesn't make it a *good deal*. Location matters. Condition matters. Year built matters. The finishes matter. Special features matter. The size of the yard matters. Taxes and HOA matter. If all you look at is the beds, baths, and square footage, you would end up with ONLY run down houses in bad locations that cost you more in the long run. $HPQ with a lower P/E, higher dividend, and technically higher growth than $ADSK does not inherent make it a better stock to own. (Note: this is not an endorsement for either).  \n  \nAs much as fundamental analysis can do for us, it can also lead us widely astray. It's different than technical analysis, but don't think it is inherent *better*; used wrong, it can also be *objectively worse*. It mostly depends on how it is used. All that being said, please don't be afraid to run DCF or whatever, which is incredibly useful, but do it in context and with judgement.  \n  \nRegards.",
        "subreddit": "investing",
        "title": "Trying to beat the market through fundamental analysis",
        "url": "https://www.reddit.com/r/investing/comments/emdmiz/trying_to_beat_the_market_through_fundamental/",
        "created": 1578622889.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1578577546,
        "id": "em9u6b",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/wallstreetbets sub! Happy Thursday to all! Here are your pre-market movers and news this AM-\n\n*****\n\n#[Today's Top Headlines for Thursday, January 9th, 2020](https://www.cnbc.com/2020/01/09/dow-indicated-at-record-trump-war-powers-vote-and-tesla-new-high.html)\n\n* U.S. stock futures were pointing to more gains on Wall Street after Wednesday’s turnaround that saw the S&amp;P 500 and Nasdaq log new intraday highs. The Nasdaq also closed at a new high, and indications this morning point to the Dow joining the record run on an easing of fears about a possible escalation of U.S.-Iran hostilities. The projected gains for the Dow would be enough for it to set a new intraday high at the open. It needs a little less than 128 points. (CNBC)\n* On today’s economic calendar, the Labor Department is out with its weekly report on initial jobless claims at 8:30 a.m. ET. Additionally, Fed Vice Chair Richard Clarida, Minneapolis Fed President Neel Kashkari, New York Fed President John Williams, Richmond Fed President Tom Barkin, Chicago Fed President Charles Evans and St. Louis Fed President James Bullard all have public appearances today. (CNBC)\n* Lighting company Acuity Brands (AYI) is among the few companies issuing quarterly earnings this morning, while home builder KB Home (KBH) and lubricant producer WD-40 (WDFC) issue numbers after the closing bell.\n* For the first time, Tesla’s (TSLA) stock market value has eclipsed the combined values of General Motors (GM) and Ford (F). The electric car maker’s stock jumped nearly 5% on Wednesday, closing at a record $492.14 per share and elevating its market capitalization to almost $89 billion, or $2 billion larger than the sum of GM’s and Ford’s respective market caps of $50 billion and $37 billion. (Reuters)\n* The House will vote today on a resolution to curb President Donald Trump’s power to take military action against Iran. Nancy Pelosi said some members of Congress have “serious, urgent concerns” about Trump’s strategy, which the administration did not assuage with a briefing or its “insufficient” notification of the strike to Congress under the War Powers Act. (CNBC)\n* Trump pulls back from more military action in Iran crisis, promises new sanctions (Reuters)\n* GOP Sen. Mike Lee: Iran briefing from Trump administration was ‘insulting and demeaning’ (USA Today)\n* Two rockets reportedly hit the Green Zone in Iraq’s capital of Baghdad, a day after Iran launched missiles at bases housing U.S. and other coalition forces in Iraq. The rockets were fired several hours after Trump declared that Iran appeared to be standing down from military conflict with the U.S. (CNBC)\n* A Ukrainian International Airlines plane that crashed shortly after leaving Tehran on Wednesday, killing all 176 people on board, was reportedly on fire before impact, according to Iran’s civil aviation authority. The plane’s trajectory indicated it strayed from its route and was on its way back to a nearby airport at the time of the crash. (CNBC)\n* Here are the unanswered questions about the deadly plane crash in Iran (CNBC)\n* China’s Vice Premier Liu He, head of the country’s negotiation team in China-U.S. trade talks, will sign a “Phase One” deal in Washington next week. No version of the text has been made public, and Chinese officials have yet to publicly commit to key points such as increasing imports of U.S. goods and services by $200 billion over two years. (Reuters)\n* A federal appeals court allowed the Trump administration to move forward with plans to use billions of dollars in military construction money to build a long-promised wall along the border with Mexico. (WSJ)\n* Following a secretive escape last week from Japan to Lebanon, former Nissan chief Carlos Ghosn publicly defended himself Wednesday against accusations of financial misconduct and misuse of corporate resources. Ghosn adamantly denied all charges against him and defended his decision to become an international fugitive by fleeing Japan as a necessity to receive a fair trial and “escape injustice.” (CNBC)\n* Lebanese investigators finish questioning Ghosn, file referred to prosecutor: judicial source (Reuters)\n* Ghosn regrets not accepting US offer to lead GM for double his salary (CNBC)\n* Fugitive former Nissan exec feared he would ‘die in Japan’ if he didn’t escape (CNBC)\n* China’s popular video sharing app TikTok had “multiple” security vulnerabilities, said cybersecurity firm Check Point. It found flaws that could allow hackers to take control of TikTok accounts and manipulate the content, upload and delete videos and reveal personal information such as a private email address. (CNBC)\n* Twitter (TWTR) said it will test new features early this year that would allow users to control who can reply to their tweets, as it looks to limit abuse and harassment on the platform. Social media firms are under pressure to address harassment on their services. (Reuters)\n* Facebook’s final word on political ads: No changes to microtargeting but more control for users (NBC News)\n* Verizon Communications (VZ) is eliminating traditional cable bundles and the handcuffs that often came with them, making it easier for households to switch video packages in the hopes they won’t cut the cord entirely. (WSJ)\n* Accolade, a start-up that helps workers navigate their health benefits and dealings with insurance companies, has hired banks including Goldman Sachs and Morgan Stanley to advise ahead of a possible initial public offering, CNBC reported. The company is expected to file later this year.\n* Australian authorities urged another mass evacuation across the heavily populated southeast today as a return of hot weather fanned huge bushfires threatening several towns and communities. Thousands have been made homeless and thousands have had to evacuate repeatedly because of the volatility of the fires. (Reuters)\n* Many Puerto Ricans slept outside and woke up to an island still largely without power after a string of earthquakes rocked their home in recent days. The worst quake, a magnitude 6.4 that struck early Tuesday, killed at least one person, injured at least nine. (USA Today)\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](http://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://finviz.com/publish/010920/sec_all_080305611.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/sZHvc1C.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/YiiKcUc.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/QqYTbUD.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/V19lVTd.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/Trp0mo0.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/E61s8Js.png)**)\n\n*****\n\n#THIS AFTERNOON'S POST-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS CALENDAR!]()**)\nT.B.A.\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/v58ZYSC.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/dIdkC51.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/mMyLRRC.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/UwJvunN.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/RqwNP5t.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #4!](https://i.imgur.com/L3178XP.png)**)\n\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/tBdzeqm.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #1!](https://i.imgur.com/OydlZzb.png)**)\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #2!](https://i.imgur.com/8S5nHx0.png)**)\n\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS:\n\n* AGTC\n* BBBY\n* SNAP\n* KSS\n* TSLA\n* C\n* AMAG\n* SMPL\n* LB\n* AZZ\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2020/01/09/stocks-making-the-biggest-moves-premarket-hp-inc-bed-bath-beyond-alphabet-uber-more.html)**)\n\n*****\n\n&gt; **Bed Bath &amp; Beyond (BBBY)** – Bed Bath &amp; Beyond reported a quarterly loss of 38 cents per share, compared to forecasts of a profit of 2 cents per share. The housewares retailer’s revenue also came in below estimates, and the company has withdrawn its full-year forecast. New CEO Mark Tritton said the current quarter would remain pressured, and called the results “unsatisfactory.”\n\n&gt; #**STOCK SYMBOL:** BBBY\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BBBY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BBBY)**)\n\n*****\n\n&gt; **Occidental Petroleum (OXY)** – Occidental said it would begin a new round of job cuts, following its $38 billion buyout of Anadarko Petroleum. The energy producer did not give a specific number of jobs to be cut but has been selling assets and reducing expenses since completing the deal.\n\n&gt; #**STOCK SYMBOL:** OXY\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=OXY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/OXY)**)\n\n*****\n\n&gt; **HP Inc. (HPQ)** – HP has once again rejected a takeover bid by Xerox (XRX), saying the proposal undervalues the computer and printer maker. HP also said the fact that Xerox has secured financing for the $33 billion offer is not a basis for a takeover discussion.\n\n&gt; #**STOCK SYMBOL:** HPQ\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=HPQ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/HPQ)**)\n\n*****\n\n&gt; **Alphabet (GOOGL)** – Bank of America Securities raised its price target on the Google parent’s stock to $1,620 per share from $1,450 a share, noting a healthy ad business and saying the Google operation would benefit from a number of factors including the elevation of Sundar Pichai to Alphabet CEO.\n\n&gt; #**STOCK SYMBOL:** GOOGL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=GOOGL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/GOOGL)**)\n\n*****\n\n&gt; **Uber (UBER)** – Uber has discontinued upfront ride pricing in California, in response to a new law which requires the ride-hailing service to classify more of its drivers as employees rather than independent contractors.\n\n&gt; #**STOCK SYMBOL:** UBER\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=UBER&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/UBER)**)\n\n*****\n\n&gt; **Verizon (VZ)** – Verizon dropped annual contracts for Fios TV and internet customers, eliminating the traditional bundles and allowing customers to select internet, tv, and phone packages separately. Customers will also be allowed to change any selections monthly.\n\n&gt; #**STOCK SYMBOL:** VZ\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=VZ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/VZ)**)\n\n*****\n\n&gt; **Tesla (TSLA)** – Tesla remains on watch after rising to another all-time high and seeing its market cap exceed that of Ford (F) and General Motors (GM) combined. Baird Equity Research downgraded Tesla to “neutral” from “outperform,” saying the risk/reward is now more balanced following the stock’s recent runup.\n\n&gt; #**STOCK SYMBOL:** TSLA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TSLA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TSLA)**)\n\n*****\n\n&gt; **Walmart (WMT)** – Walmart said it opened 134 new stores in Mexico last year, the biggest expansion by the retailer in that country since 2013.\n\n&gt; #**STOCK SYMBOL:** WMT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WMT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WMT)**)\n\n*****\n\n&gt; **Voya Financial (VOYA)** – Voya is exploring a possible sale, according to people briefed on the matter who spoke to the Financial Times. The paper said the U.S.-based retirement plan provider could be valued at $10 billion or more.\n\n&gt; #**STOCK SYMBOL:** VOYA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=VOYA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/VOYA)**)\n\n*****\n\n&gt; **Costco (COST)** – The warehouse retailer reported a December comparable sales increase of 9%, exceeding the consensus StreetAccount estimate of 7.1%.\n\n&gt; #**STOCK SYMBOL:** COST\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=COST&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/COST)**)\n\n*****\n\n&gt; **Coca-Cola (KO)** – The beverage giant was upgraded to “outperform” from “neutral” at Credit Suisse, which said structural changes at the company should allow revenue and returns on investment to grow faster.\n\n&gt; #**STOCK SYMBOL:** KO\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=KO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/KO)**)\n\n*****\n\n&gt; **BlackRock (BLK)** – Deutsche Bank initiated a “Buy Catalyst Call” on the asset manager’s stock, saying it should outperform the overall market during quarterly earnings season.\n\n&gt; #**STOCK SYMBOL:** BLK\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BLK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BLK)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/wallstreetbets?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Thursday, January 9th, 2020! :)**",
        "subreddit": "wallstreetbets",
        "title": "Today's Pre-Market Movers &amp; News [Thursday, January 9th, 2020]",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/em9u6b/todays_premarket_movers_news_thursday_january_9th/",
        "created": 1578606346.0
    },
    {
        "author": "WSBConsensus",
        "created_utc": 1579014000,
        "id": "eomcha",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "14th January 2020\n\nGood luck guys, \n\n\n**Of note for PC names (HPQ, DELL, MSFT)**, traditional PC volumes in Q4 grew 4.8%, according to IDC preliminary results. Global shipments beat expectations at 71.8mln units, IDC Vice President highlights “The market will still have its challenges ahead, but this year was a clear sign that PC demand is still there despite the continued insurgence of emerging form factors and the demand for mobile computing.”\n \n**Of note for Pharmaceuticals and Technology names**, China Global Times note that as part of the Phase One deal, imports of other products like pharmaceuticals and advanced tech equipment could also expand.\n\n#DOW\n\n**Apple Inc. (AAPL)** could reach USD 400/shr in 2020, says Wedbush analyst Daniel Ives, whose channel checks for the iPhone 11 units heading into the March quarter “look robust”, the analyst is also constructive on AirpPods, noting when strong iPhone 11 units are joined with “jaw dropping” momentum from AirPods, Apple should post clear upside in the upcoming quarter with strong guidance for the next quarter. Elsewhere, UBS increased its PT for the name to USD 355 from USD 280 in anticipation of a strong 5G upgrade cycle, highlighting UBS research that 22% of responders indicated that 5G will be a factor when deciding to upgrade. \n\n**Boeing Company (BA)**  is reportedly offering very large discounts, as well as bulk buy deals and maintenance packages to keep orders for the grounded 737 MAX jet, according to the Telegraph, who note the discounts are greater than 50%. Elsewhere, BA could provide **Ryanair (RYA LN)** its first deliveries of up to ten 737 MAX jets by April, although the timing is dependent upon the regulator, according to RYA LN’s CMO.\n\n**JPMorgan Chase &amp; Co (JPM)** Q4 19 (USD): EPS 2.57 (exp. 2.30), Adj. Revenue 29.21bln (exp. 27.96bln). Net Interest Income (NII) 14.3bln (exp. 14.06bln); NIM 2.38% (exp. 2.365%), FICC sales &amp; Trading revenue 3.45bln (exp. 2.44bln), Investment Bank Revenue 1.82bln (exp. 1.84bln), Equity markets revenue USD 1.5bln, +15% YY due to higher revenue in prime and cash equities, Quarterly ROTCE 17% (prev. 18%). Quarterly markets businesses rebounded from a challenging previous year; resolution of some trade issues supported client activity towards year-end. Quarterly investment banking revenue growth driven by higher debt and equity underwriting fees which was partially offset by lower advisory fees. Guides Q1 2020 incremental NII ~USD 14bln (exp. 13.95bln), guides Q1 2020 adj. expense ~17.0bln (exp. 16.7bln).\n\n*McDonald's Corp. (MCD)** is reportedly testing chicken sandwiches with monosodium glutamate which adds taste, although has come under scrutiny regarding health concerns from consumers. \n\n**Visa Inc. (V)** is to acquire Plaid, a fin-tech start up, for USD 5.3bln. WSJ reported previously that in its 2018 funding round it was valued at USD 2.65bln.\n\n\n#NASDAQ 100\n\n**Amazon.com Inc. (AMZN)** will reportedly ask a judge to temporarily block **Microsoft Corp. (MSFT)** from working on the USD 10bln JEDI cloud contract, according to a court filing.\n\n**Amgen Inc. (AMGN) and Qiagen (QGEN)** announced a strategic collaboration for AMG 510, an investigational cancer treatment. \n\n**Tesla (TSLA)** had its PT increased to USD 600 from USD 500 by Jefferies, who maintain a Buy rating on the shares noting it would be wrong to exit the automaker on valuation. \n\n**T-Mobile (TMUS) and Sprint (S)** have asked a federal judge that their case to merge is provided with proper weight, stating the district AG’s who were suing over the merger did not consider the plans both companies had to preserve competition within the sector.\n\n#S &amp; P 500\n\n**Boston Scientific (BSX)** gave preliminary Q4 adj. EPS 0.42-0.45 (exp. 0.44), Q4 preliminary sales 2.9bln (exp. 2.93bln); believes it will exceed Q4 EPS guidance of 0.22-0.25/shr and FY19 EPS of 0.72-0.75. Estimates FY19 adj. EPS will be within USD 1.55-1.58, as per previously issued guidance.\n\n**Citigroup Inc (C)** Q4 19 (USD): EPS 2.15 (tax adj. ~1.90) (exp. 1.87), Revenue 18.38bln (exp. 17.89bln), FICC revenue 2.90bln (exp. 2.37bln), investment banking revenue 1.35bln (exp. 1.26bln), equity market revenue 516mln (-23%). Q4 results including circa a USD 0.25/shr benefit from tax matters.\n\n**Delta Air Lines Inc (DAL)** Q4 19 (USD): Adj. EPS 1.70 (exp. 1.38), Revenue 11.44bln (exp. 11.35bln). Q1 adj. TRASM view flat to +2%; total revenue growth view at 5-7%. Co says it is picking up new customers as rivals face **Boeing (BA)** 737 MAX woes (Note, DAL does not fly 737 MAX jets).\n\n**First Republic Bank (FRC)** Q4 19 (USD): EPS 1.39 (exp. 1.27), Revenue 0.878 (exp. 0.86bln).\n\n**Hess Corporation (HES)** – Elliott Associates exited its position in the company.\n\n**IHS Markit Ltd. (INFO)** Q4 19 (USD): EPS 0.65 (exp. 0.60), Revenue 1.12bln (exp. 1.12bln). Backs FY20 Adj. EPS forecast of 2.82 to 2.88 (exp. 2.86) and revenue of 4.52-4.59bln (exp. 4.58bln). Sees FY20 Adj. EBITDA between 1.86-1.89bln.\n\n**Lilly (Eli) &amp; Co. (LLY)** announced it added two more options for those who use its insulin, which will have 50% lower list prices than the original. LLY noted that 10% of those using the original Humalog insulin injector transferred to the cheaper option.\n\n**McKesson Corp. (MCK)** raises FY20 EPS view to between (USD) 14.60-14.80 (exp. 14.41, prev. 14.00-14.60)\n\n**MGM Resorts International (MGM)**  is nearing a deal to sell MGM Grand and Mandalay Bay resorts and casinos in Las Vegas to a JV which includes **Blackstone (BX)** , according to WSJ citing people familiar with the matter; Financial terms not disclosed but it could value MGM Grand a USD 2.5bln.\n\n**Ulta Beauty (ULTA)** had its PT upgraded to USD 310 from USD 275 at Oppenheimer, highlighting the management team and their ability to perform well in a challenging environment.\n\n**Wells Fargo (WFC)** Q4 19 (USD): EPS 0.60 (exp. 1.10); EPS includes impact of litigation accruals of loss of USD 0.33/shr, Revenue 19.9bln (exp. 20.1bln). NII 11.20bln (exp. 11.22bln), NIM 2.53% (exp. 2.54%), ROE 5.91% (prev. 12.89%)\n\n\n#OTHER\n\n**Aecom (ACM)** has been approached by rival WSP, a Canadian engineering services company, regarding a potential deal, according to people familiar with the matter.\n\n**Cloudera (CLDR)** has named its new CEO as Robert Bearden, an experienced enterprise software executive who was CEO of Hortwon works, which merged with CLDR last year.\n\n**Gamestop (GME)** total global holiday sales -27.5% at USD 1.83bln and thus cut its FY19 comparable sales forecast to down 19-21% (prev. decline in high teens) and expects an adjusted net loss for the fiscal year.\n\n**IAC (IAC)** wholly-owned subsidiary, Buzz Merger Sub, has started its tender offer to acquire all the outstanding shares of **Care.com (CRCM)** of USD 15/shr as previously announced.\n\n**Lyft (LYFT)** is putting together a number of council experts to help advise it on safety initiatives for both customers and drivers.\n\n**STAG Industrial (STAG)** 8.75mln spot secondary share offering (prev. 8mln) was priced at USD 31.40, within the USD 31.35-31.70 target range.\n\n**TreeHouse (THS) and Post Holdings (POST)** announced the termination of its agreement to sell it’s ready to eat cereal business to POST after coming to a mutual agreement; THS announced it will continue to look for a buyer for the unit.\n\n**Wipro Ltd (WIT)** Q4 19 (USD): EPS 0.06 (exp. 0.06), Revenue 2.2bln (exp. 2.2bln).",
        "subreddit": "wallstreetbets",
        "title": "Woke up late, need this coffee",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eomcha/woke_up_late_need_this_coffee/",
        "created": 1579042800.0
    },
    {
        "author": "soAsian",
        "created_utc": 1579371321,
        "id": "eqjzj9",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "https://news.ycombinator.com/item?id=22083121\n\n&gt;I absolutely love this model. I pay the minimal 2USD for it (if I exceed the monthly printable 50 pages, I get another 10p/$1, or upgrade my subscription. Unused quota accumulates up to 100p), and I get a monthly email about the detailed pricing.\n\nprinter have subscription? am i retarded to think this subscription model on printer is good for HP? like how many pages does a american family w/kids in school print per month?",
        "subreddit": "wallstreetbets",
        "title": "HP printer have a subscription?! $HPQ to MOON?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eqjzj9/hp_printer_have_a_subscription_hpq_to_moon/",
        "created": 1579400121.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1578577436,
        "id": "em9tfr",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/stocks sub! Happy Thursday to all! Here are your pre-market movers and news this AM-\n\n*****\n\n#[Today's Top Headlines for Thursday, January 9th, 2020](https://www.cnbc.com/2020/01/09/dow-indicated-at-record-trump-war-powers-vote-and-tesla-new-high.html)\n\n* U.S. stock futures were pointing to more gains on Wall Street after Wednesday’s turnaround that saw the S&amp;P 500 and Nasdaq log new intraday highs. The Nasdaq also closed at a new high, and indications this morning point to the Dow joining the record run on an easing of fears about a possible escalation of U.S.-Iran hostilities. The projected gains for the Dow would be enough for it to set a new intraday high at the open. It needs a little less than 128 points. (CNBC)\n* On today’s economic calendar, the Labor Department is out with its weekly report on initial jobless claims at 8:30 a.m. ET. Additionally, Fed Vice Chair Richard Clarida, Minneapolis Fed President Neel Kashkari, New York Fed President John Williams, Richmond Fed President Tom Barkin, Chicago Fed President Charles Evans and St. Louis Fed President James Bullard all have public appearances today. (CNBC)\n* Lighting company Acuity Brands (AYI) is among the few companies issuing quarterly earnings this morning, while home builder KB Home (KBH) and lubricant producer WD-40 (WDFC) issue numbers after the closing bell.\n* For the first time, Tesla’s (TSLA) stock market value has eclipsed the combined values of General Motors (GM) and Ford (F). The electric car maker’s stock jumped nearly 5% on Wednesday, closing at a record $492.14 per share and elevating its market capitalization to almost $89 billion, or $2 billion larger than the sum of GM’s and Ford’s respective market caps of $50 billion and $37 billion. (Reuters)\n* The House will vote today on a resolution to curb President Donald Trump’s power to take military action against Iran. Nancy Pelosi said some members of Congress have “serious, urgent concerns” about Trump’s strategy, which the administration did not assuage with a briefing or its “insufficient” notification of the strike to Congress under the War Powers Act. (CNBC)\n* Trump pulls back from more military action in Iran crisis, promises new sanctions (Reuters)\n* GOP Sen. Mike Lee: Iran briefing from Trump administration was ‘insulting and demeaning’ (USA Today)\n* Two rockets reportedly hit the Green Zone in Iraq’s capital of Baghdad, a day after Iran launched missiles at bases housing U.S. and other coalition forces in Iraq. The rockets were fired several hours after Trump declared that Iran appeared to be standing down from military conflict with the U.S. (CNBC)\n* A Ukrainian International Airlines plane that crashed shortly after leaving Tehran on Wednesday, killing all 176 people on board, was reportedly on fire before impact, according to Iran’s civil aviation authority. The plane’s trajectory indicated it strayed from its route and was on its way back to a nearby airport at the time of the crash. (CNBC)\n* Here are the unanswered questions about the deadly plane crash in Iran (CNBC)\n* China’s Vice Premier Liu He, head of the country’s negotiation team in China-U.S. trade talks, will sign a “Phase One” deal in Washington next week. No version of the text has been made public, and Chinese officials have yet to publicly commit to key points such as increasing imports of U.S. goods and services by $200 billion over two years. (Reuters)\n* A federal appeals court allowed the Trump administration to move forward with plans to use billions of dollars in military construction money to build a long-promised wall along the border with Mexico. (WSJ)\n* Following a secretive escape last week from Japan to Lebanon, former Nissan chief Carlos Ghosn publicly defended himself Wednesday against accusations of financial misconduct and misuse of corporate resources. Ghosn adamantly denied all charges against him and defended his decision to become an international fugitive by fleeing Japan as a necessity to receive a fair trial and “escape injustice.” (CNBC)\n* Lebanese investigators finish questioning Ghosn, file referred to prosecutor: judicial source (Reuters)\n* Ghosn regrets not accepting US offer to lead GM for double his salary (CNBC)\n* Fugitive former Nissan exec feared he would ‘die in Japan’ if he didn’t escape (CNBC)\n* China’s popular video sharing app TikTok had “multiple” security vulnerabilities, said cybersecurity firm Check Point. It found flaws that could allow hackers to take control of TikTok accounts and manipulate the content, upload and delete videos and reveal personal information such as a private email address. (CNBC)\n* Twitter (TWTR) said it will test new features early this year that would allow users to control who can reply to their tweets, as it looks to limit abuse and harassment on the platform. Social media firms are under pressure to address harassment on their services. (Reuters)\n* Facebook’s final word on political ads: No changes to microtargeting but more control for users (NBC News)\n* Verizon Communications (VZ) is eliminating traditional cable bundles and the handcuffs that often came with them, making it easier for households to switch video packages in the hopes they won’t cut the cord entirely. (WSJ)\n* Accolade, a start-up that helps workers navigate their health benefits and dealings with insurance companies, has hired banks including Goldman Sachs and Morgan Stanley to advise ahead of a possible initial public offering, CNBC reported. The company is expected to file later this year.\n* Australian authorities urged another mass evacuation across the heavily populated southeast today as a return of hot weather fanned huge bushfires threatening several towns and communities. Thousands have been made homeless and thousands have had to evacuate repeatedly because of the volatility of the fires. (Reuters)\n* Many Puerto Ricans slept outside and woke up to an island still largely without power after a string of earthquakes rocked their home in recent days. The worst quake, a magnitude 6.4 that struck early Tuesday, killed at least one person, injured at least nine. (USA Today)\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](http://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://finviz.com/publish/010920/sec_all_080305611.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/sZHvc1C.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/YiiKcUc.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/QqYTbUD.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/V19lVTd.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/Trp0mo0.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/E61s8Js.png)**)\n\n*****\n\n#THIS AFTERNOON'S POST-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS CALENDAR!]()**)\nT.B.A.\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/v58ZYSC.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/dIdkC51.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/mMyLRRC.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/UwJvunN.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/RqwNP5t.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #4!](https://i.imgur.com/L3178XP.png)**)\n\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/tBdzeqm.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #1!](https://i.imgur.com/OydlZzb.png)**)\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #2!](https://i.imgur.com/8S5nHx0.png)**)\n\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS:\n\n* AGTC\n* BBBY\n* SNAP\n* KSS\n* TSLA\n* C\n* AMAG\n* SMPL\n* LB\n* AZZ\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2020/01/09/stocks-making-the-biggest-moves-premarket-hp-inc-bed-bath-beyond-alphabet-uber-more.html)**)\n\n*****\n\n&gt; **Bed Bath &amp; Beyond (BBBY)** – Bed Bath &amp; Beyond reported a quarterly loss of 38 cents per share, compared to forecasts of a profit of 2 cents per share. The housewares retailer’s revenue also came in below estimates, and the company has withdrawn its full-year forecast. New CEO Mark Tritton said the current quarter would remain pressured, and called the results “unsatisfactory.”\n\n&gt; #**STOCK SYMBOL:** BBBY\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BBBY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BBBY)**)\n\n*****\n\n&gt; **Occidental Petroleum (OXY)** – Occidental said it would begin a new round of job cuts, following its $38 billion buyout of Anadarko Petroleum. The energy producer did not give a specific number of jobs to be cut but has been selling assets and reducing expenses since completing the deal.\n\n&gt; #**STOCK SYMBOL:** OXY\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=OXY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/OXY)**)\n\n*****\n\n&gt; **HP Inc. (HPQ)** – HP has once again rejected a takeover bid by Xerox (XRX), saying the proposal undervalues the computer and printer maker. HP also said the fact that Xerox has secured financing for the $33 billion offer is not a basis for a takeover discussion.\n\n&gt; #**STOCK SYMBOL:** HPQ\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=HPQ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/HPQ)**)\n\n*****\n\n&gt; **Alphabet (GOOGL)** – Bank of America Securities raised its price target on the Google parent’s stock to $1,620 per share from $1,450 a share, noting a healthy ad business and saying the Google operation would benefit from a number of factors including the elevation of Sundar Pichai to Alphabet CEO.\n\n&gt; #**STOCK SYMBOL:** GOOGL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=GOOGL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/GOOGL)**)\n\n*****\n\n&gt; **Uber (UBER)** – Uber has discontinued upfront ride pricing in California, in response to a new law which requires the ride-hailing service to classify more of its drivers as employees rather than independent contractors.\n\n&gt; #**STOCK SYMBOL:** UBER\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=UBER&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/UBER)**)\n\n*****\n\n&gt; **Verizon (VZ)** – Verizon dropped annual contracts for Fios TV and internet customers, eliminating the traditional bundles and allowing customers to select internet, tv, and phone packages separately. Customers will also be allowed to change any selections monthly.\n\n&gt; #**STOCK SYMBOL:** VZ\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=VZ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/VZ)**)\n\n*****\n\n&gt; **Tesla (TSLA)** – Tesla remains on watch after rising to another all-time high and seeing its market cap exceed that of Ford (F) and General Motors (GM) combined. Baird Equity Research downgraded Tesla to “neutral” from “outperform,” saying the risk/reward is now more balanced following the stock’s recent runup.\n\n&gt; #**STOCK SYMBOL:** TSLA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TSLA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TSLA)**)\n\n*****\n\n&gt; **Walmart (WMT)** – Walmart said it opened 134 new stores in Mexico last year, the biggest expansion by the retailer in that country since 2013.\n\n&gt; #**STOCK SYMBOL:** WMT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WMT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WMT)**)\n\n*****\n\n&gt; **Voya Financial (VOYA)** – Voya is exploring a possible sale, according to people briefed on the matter who spoke to the Financial Times. The paper said the U.S.-based retirement plan provider could be valued at $10 billion or more.\n\n&gt; #**STOCK SYMBOL:** VOYA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=VOYA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/VOYA)**)\n\n*****\n\n&gt; **Costco (COST)** – The warehouse retailer reported a December comparable sales increase of 9%, exceeding the consensus StreetAccount estimate of 7.1%.\n\n&gt; #**STOCK SYMBOL:** COST\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=COST&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/COST)**)\n\n*****\n\n&gt; **Coca-Cola (KO)** – The beverage giant was upgraded to “outperform” from “neutral” at Credit Suisse, which said structural changes at the company should allow revenue and returns on investment to grow faster.\n\n&gt; #**STOCK SYMBOL:** KO\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=KO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/KO)**)\n\n*****\n\n&gt; **BlackRock (BLK)** – Deutsche Bank initiated a “Buy Catalyst Call” on the asset manager’s stock, saying it should outperform the overall market during quarterly earnings season.\n\n&gt; #**STOCK SYMBOL:** BLK\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BLK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BLK)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/stocks?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Thursday, January 9th, 2020! :)**",
        "subreddit": "stocks",
        "title": "Today's Pre-Market Movers &amp; News [Thursday, January 9th, 2020]",
        "url": "https://www.reddit.com/r/stocks/comments/em9tfr/todays_premarket_movers_news_thursday_january_9th/",
        "created": 1578606236.0
    }
]