[
    {
        "author": "chiefqueef1",
        "created_utc": 1578926584,
        "id": "eo4zfq",
        "num_comments": 35,
        "num_crossposts": 0,
        "selftext": "Listen up retards. You ever want to play earnings for TSM, AMD, MU, Intel but can't choose which? What if I told you that you can play all of them, at the same damn time.\n\nVanEck Vectors Semiconductor ETF (SMH) is an index of the 25 largest semiconductor manufactures in the world. TSM, Intel, AMD, Texas Instruments, MU...you name it.\n\nThese two weeks are the time of the year when every company in the industry has their Q4 earnings. 10 out of the 25 companies in the index have earnings the next 2 weeks, accounting for 52% of the entire weighted average of the index.\n\nTSM, Intel, AMD, ASML, TXN, LRCX, XLNX, KLAC, STM and some others.\n\nThe semiconductor industry has been on fire, Q4 earnings are generally pumped up, the China deal on Wednesday will give a boost to the whole industry, and when paired with these earnings catalysts I see a bump coming through end of month. 1/31 calls look awfully tasty and are not expensive.",
        "subreddit": "wallstreetbets",
        "title": "Buy into the SMH ETF for end of month calls",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eo4zfq/buy_into_the_smh_etf_for_end_of_month_calls/",
        "created": 1578955384.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1580131398,
        "id": "euntzh",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/wallstreetbets sub! Welcome to the new trading week and a fresh start! Here are your pre-market news this AM-\n\n*****\n\n#[Today's Top Headlines for Monday, January 27th, 2020](https://www.cnbc.com/2020/01/27/dow-to-sink-kobe-bryant-remembered-and-wuhan-virus-spreads.html)\n\n* With the coronavirus spreading, world stocks are tumbling and perceived safer investments are rising. U.S. stock futures are sliding early Monday following Wall Street’s worst day of 2020 on Friday. The Dow already has a four-day losing streak in place, its longest since August, and is coming off its largest weekly loss in five months. The S&amp;P 500′s weekly decline last week was its largest in nearly four months. (CNBC)\n* Treasury yields move lower as coronavirus fears escalate (CNBC)\n* Gold climbs to 2-week high as virus fears spark safety buying (Reuters)\n* International oil prices drop below $60 as China virus drives demand concern (Reuters)\n* More than 2,800 people in China are now infected by the fast-spreading Wuhan coronavirus while more countries have reported their first confirmed cases. Chinese officials have said there are 2,862 confirmed cases, with the death toll rising to 81. On Sunday, the United States on Sunday reported its fifth confirmed case in Arizona. (CNBC)\n* Travel-related stocks are likely to be hit once again as coronavirus cases mount, including major airlines like United (UAL), Delta (DAL), American (AAL) and Southwest (LUV), and cruise line operators like Royal Caribbean (RCL), Norwegian (NCLH), and Carnival (CCL). Starbucks (SBUX) and McDonald’s have temporarily closed near the Chinese city of Wuhan.\n* On today’s U.S. economic calendar, the government will release its December report on new home sales at 10 a.m. ET. Arconic (ARNC), DR Horton (DH) and Sprint (S) are among the companies issuing quarterly earnings this morning, while Whirlpool (WHR), Juniper Networks (JNPR) and Rambus (RMBS) report after the bell.\n* Federal safety investigators launched a probe into a helicopter crash in the LA area that killed basketball legend Kobe Bryant and eight others, including his 13-year-old daughter, Gianna. The cause of the crash has not yet been determined. NBA athletes, officials and fans mourned Bryant’s death in messages and memorials across social media. (CNBC)\n* ‘Terrible,’ ‘heartbreaking,’ ‘devastated’ — World leaders and athletes mourn the death of Kobe Bryant (CNBC)\n* Athletes pay tribute to Kobe Bryant. ‘He was like a little brother to me’ Michael Jordan says (CNBC)\n* A passenger plane crashed in central Afghanistan, senior Afghan officials said today. According to local media, the plane went down in territory under Taliban control. It was initially reported to be a jet from state-owned Ariana Afghan Airlines. However, the airline’s acting CEO has denied that one of their planes has crashed. (CNBC)\n* President Donald Trump is expected to disclose details of his long-delayed Mideast peace proposal to Israeli leaders today. Trump will hold separate, back-to-back meetings with Israeli Prime Minister Benjamin Netanyahu and Benny Gantz, head of the centrist Blue and White Party. Gantz is Netanyahu’s rival in March 2 elections. (Reuters)\n* Trump’s impeachment trial enters a pivotal week as his defense team resumes its case and senators face a critical vote on whether to hear witnesses or proceed directly to a vote that is widely expected to end in his acquittal. The articles of impeachment charge Trump with abuse of power and obstruction of Congress. (AP)\n* Democrats stepped up their calls for former national security advisor John Bolton to testify at the trial after an explosive report alleged that in his unpublished book, he said Trump personally tied Ukraine aid to an investigation of the Bidens, an account that conflicts with the president’s. (NBC News)\n* Trump denies telling Bolton Ukraine aid was tied to investigations (The Hill)\n* Sen. Bernie Sanders holds an edge in the 2020 New Hampshire Democratic primary as the key presidential nominating contest nears, according to an NBC News/Marist poll. The Vermont senator garners the support of 22% of likely Democratic primary voters in the Granite State, the survey found. Ex-Mayor Pete Buttigieg trails at 17%. (CNBC)\n* Sen. Elizabeth Warren seeks spark in final Iowa push after getting Des Moines Register endorsement (AP)\n* U.S. state attorneys general will meet Justice Department attorneys next week to share information on their investigations into Google (GOOGL), Reuters reported. * The probes revolve around monopolistic behavior that may harm consumers through Google’s control of online advertising markets and search traffic.\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](https://finviz.com/futures.ashx)**)\n\n*****\n\n#LAST WEEK'S MARKET MAP:\n######(**[CLICK HERE FOR LAST WEEK'S MARKET MAP!](https://finviz.com/publish/012720/sec_all_w1_075397186.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#LAST WEEK'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR LAST WEEK'S S&amp;P SECTORS CHART!](https://i.imgur.com/6xYBiNo.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/g0O8Bke.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/mbOqHih.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/pT8VGHp.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n*($AAPL $TSLA $AMD $AMZN $MSFT $FB $BA $GE $MA $T $V $SBUX $PYPL $MCD $LMT $MMM $DHI $PFE $UTX $KO $UPS $S $NURO $HMST $VZ $HCA $XLNX $ARNC $XOM $CAT $BX $PGR $LRCX $GD $PHM $NVR $PII $SALT $BIIB $NOW $ANTM $NUE $ALK $PLUG $MPC)*\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/BhyYBqu.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n*($DHI $NURO $HMST $S $ARNC $NVR $SALT $BMRC $RDY $BOH $OPB $ARLP $PROV $NWBI)*\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/RExcdcI.jpg)**)\n\n*****\n\n#THIS AFTERNOON'S POST-MARKET EARNINGS CALENDAR:\n*()*\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS CALENDAR!]()**)\nT.B.A.\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/jPiSdVy.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/YRM412m.png)**)\nNONE.\n\n*****\n\n#FRIDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR FRIDAY'S UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/xc2z54D.png)**)\n######(**[CLICK HERE FOR FRIDAY'S UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/mFxq4a0.png)**)\n######(**[CLICK HERE FOR FRIDAY'S UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/XjxVPqW.png)**)\n######(**[CLICK HERE FOR FRIDAY'S UPGRADES/DOWNGRADES LINK #4!](https://i.imgur.com/uiduXrQ.png)**)\n\n*****\n\n#FRIDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR FRIDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/2nH33vr.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!](https://i.imgur.com/tXGwWol.png)**)\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS:\n\n* SPY\n* NNVC\n* BABA\n* QQQ\n* SPCE\n* TVIX\n* APT\n* ABBV\n* DJIA\n* DIA\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2020/01/27/stocks-making-the-biggest-moves-premarket-dr-horton-arconic-starbucks-boeing-more.html)**)\n\n*****\n\n&gt; **D.R. Horton (DHI)** – The homebuilder earned $1.16 per share for its fiscal first quarter, beating the consensus estimate of 92 cents a share. Revenue also topped forecasts. New orders were up 19% on a volume basis and up 22% in value. The company also raised the upper end of its full-year home sales forecast.\n\n&gt; #**STOCK SYMBOL:** DHI\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DHI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DHI)**)\n\n*****\n\n&gt; **Arconic (ARNC)** – Arconic missed estimates by a penny a share, with adjusted quarterly earnings of 53 cents per share. Revenue came in shy of Wall Street predictions. The maker of engineered metals products saw a 1% improvement in organic revenue on factors like favorable pricing and raw materials costs, partially offset by some weakness in its automotive and commercial transportation markets. Arconic also said it would complete its planned split of its aerospace components and aluminum rolling businesses into two companies on April 1.\n\n&gt; #**STOCK SYMBOL:** ARNC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ARNC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ARNC)**)\n\n*****\n\n&gt; **Travel-related stocks** – These are likely to be hit once again as coronavirus cases mount – including major airlines like United Airlines (UAL), Delta Air Lines (DAL), American Airlines (AAL), and Southwest (LUV), and cruise line operators like Royal Caribbean (RCL), Norwegian Cruise Line (NCLH), and Carnival Cruise Lines (CCL). Casino stocks like Wynn Resorts (WYNN) and Las Vegas Sands (LVS) are also being hit.\n\n&gt; #**STOCK SYMBOL:** UAL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=UAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/UAL)**)\n\n*****\n\n&gt; **Starbucks (SBUX)** – Starbucks has temporarily closed all its shots in China’s Hubei province and suspended delivery services, amid health concerns for customers and employees amid the spread of the coronavirus.\n\n&gt; #**STOCK SYMBOL:** SBUX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SBUX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SBUX)**)\n\n*****\n\n&gt; **Estee Lauder (EL)** – Oppenheimer downgraded the cosmetics maker to “perform” from “outperform.” The firm cited the stock’s premium valuation coupled with concerns about the coronavirus impact on a company that has seen China represent a key driver of recent growth.\n\n&gt; #**STOCK SYMBOL:** EL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=EL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/EL)**)\n\n*****\n\n&gt; **Boeing (BA)** – Boeing completed a successful maiden voyage of its 777-X jet over the weekend, a respite for the jet maker amid the ongoing grounding of its 737 Max jet.\n\n&gt; #**STOCK SYMBOL:** BA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BA)**)\n\n*****\n\n&gt; **AbbVie (ABBV)** – AbbVie sold a number of assets to Nestle and AstraZeneca (AZN), as it seeks to win regulatory approval for its $63 billion acquisition of drugmaker Allergan (AGN).\n\n&gt; #**STOCK SYMBOL:** ABBV\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ABBV&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ABBV)**)\n\n*****\n\n&gt; **Fiat Chrysler (FCAU)** – Fiat Chrysler filed court motions Friday to dismiss a lawsuit filed by rival automaker General Motors (GM). Fiat Chrysler said GM does not have sufficient grounds to bring a racketeering case that alleges bribery of union officials.\n\n&gt; #**STOCK SYMBOL:** FCAU\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=FCAU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/FCAU)**)\n\n*****\n\n&gt; **Kraft Heinz (KHC)** – Kraft Heinz CEO Miguel Patricio told The Wall Street Journal that he wants to food maker to make fewer but bigger bets on new products, as its older brands suffer a sales decline.\n\n&gt; #**STOCK SYMBOL:** KHC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=KHC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/KHC)**)\n\n*****\n\n&gt; **Alphabet (GOOGL)** – State attorneys general will meet with Justice Department officials to share investigative material involving Google, according to The Wall Street Journal.\n\n&gt; #**STOCK SYMBOL:** GOOGL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=GOOGL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/GOOGL)**)\n\n*****\n\n&gt; **Winnebago Industries (WGO)** – The RV maker was rated “overweight” in new coverage at KeyBanc, which sees recreational vehicle shipments stronger than consensus for 2020 and is also optimistic about the increasing benefits of Winnebago’s 2016 acquisition of towable vehicle maker Grand Design.\n\n&gt; #**STOCK SYMBOL:** WGO\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WGO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WGO)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat is on everyone's radar for today's trading day ahead here at r/wallstreetbets?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Monday, January 27th, 2020! :)**",
        "subreddit": "wallstreetbets",
        "title": "Today's Pre-Market Movers &amp; News [Monday, January 27th, 2020]",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/euntzh/todays_premarket_movers_news_monday_january_27th/",
        "created": 1580160198.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1579976709,
        "id": "etuepm",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "Good Saturday afternoon to all of you here on r/wallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning January 27th, 2020.\n\n# **After virus scare, markets look to Fed rate policy to keep stock rally going  - [(Source)](https://www.cnbc.com/2020/01/24/after-virus-scare-markets-look-to-fed-rate-policy-to-keep-rally-going.html)**\n*****\n&gt; With stocks coming off their first losing week of the year, investors will be looking for the Federal Reserve to soothe markets by reaffirming its position that interest rates will be low for a long time into the future.\n*****\n&gt; The outbreak of the coronavirus in China in the past week took the steam out of a market that has been repeatedly rallying to new highs since December. The S&amp;P 500 fell just about 1% for the week, amid fears the virus could lead to slower growth not only in China, but across the globe.\n*****\n&gt; Those concerns could continue to spook markets in the coming week, but stocks should be buffeted by the Fed’s anticipated commitment to low rates and its current Treasury bill buying program. The Fed meets Tuesday and Wednesday. Fed Chairman Jerome Powell is expected to emphasize that the Fed remains on a neutral policy path and that would only change if there was a significant change in the economic outlook.\n*****\n&gt; There are also some major earnings reports, including from Apple, which hit an all-time high Friday morning before closing lower with the broader market. It could have a big impact on sentiment and help influence trading across the technology sector.\n*****\n&gt; Stocks were choppy in the past week, and Treasury yields have been sinking on worries about the new virus. The 10-year yield sunk to a Nov. 1 low of 1.68% and investors drove gold prices higher in a flight-to-safety trade.\n*****\n&gt; “It’s overshadowing everything, and what the market is looking for is that the Chinese are containing it, and the spread is minimal,” said Quincy Krosby, chief market strategist at Prudential Financial. “The derivative of all of this is what does it do to growth? Traders and investors are hoping the stimulus that has been introduced into the Chinese economy is going to take hold, and this is not going to halt that turnaround.”\n*****\n&gt; Krosby said the market has been looking for an excuse to pull back. The S&amp;P 500 ended the week at 3,295, off 1%, but it is still up about 2% for the year so far.\n*****\n&gt; “You could see going into the weekend the 10-year Treasury yield is down, gold is higher, the market is in a text book defensive state,” said Krosby. “We had a market that was poised for a bout of profit-taking and this is it.”\n*****\n&gt; # Earnings roll out\n&gt; There are more than 135 S&amp;P companies reporting earnings in the week ahead, with a heavy focus on technology, industrials and consumer stocks. Apple reports Tuesday, and Microsoft and Facebook are Wednesday. Boeing and General Electric report Wednesday, while McDonald’s releases results Wednesday. On Friday, big oil reports with ExxonMobil and Chevron expected.\n*****\n&gt; Earnings reports so far have been mostly better than expected, with 68.2% of companies beating earnings per share estimates, according to Refinitiv. Earnings are expected to be down about a half percent for the fourth quarter, based on actual reports and estimates of companies yet to report.\n*****\n&gt; “Coming into any earnings season with stocks at all time highs is fraught with peril,” said Art Hogan, chief market strategist at National Securities. “It’s precarious because you have the opportunity for outsized moves if you miss earnings, revenues or guidance.”\n*****\n&gt; Hogan said companies may be able to give a better indication of the future, now that there’s a first phase trade deal between the U.S. and China. He said markets will also be looking for guidance from China and elsewhere on whether the virus appears to be containable or not.\n*****\n&gt;#  Fed is big story but won’t say much\nThe Federal Reserve is not likely to say much has changed in its outlook, except that it’s last three interest rate cuts may have helped the economy and financial conditions.\n*****\n&gt; “The big news is just talk on the balance sheet. I think that’s going to be the key messaging,” said Jim Caron, portfolio strategist at Morgan Stanley Investment Management. “I think the data has been okay. There’s really nothing new there. The only thing that’s really new or interesting is going to be what’s going on with the balance sheet.”\n*****\n&gt; The Fed has been buying about $60 billion in Treasury bills each month to expand its balance sheet, ending a program where it was shrinking the balance sheet. The Fed is adding reserves to end a problem in the repo market, which is basically the plumbing of the financial markets where institutions go to get short term cash.\n*****\n&gt; Many traders believe the program is adding liquidity to markets, and therefore driving investors into stocks.\n*****\n&gt; Mark Cabana, head of short rate strategy at BofA Securiteis, said the Fed is not changing its benchmark fed funds target rate, but the fixed income market has been expecting the Fed to make a technical adjustment to another rate. He said the fed funds rate, trading at about 1.55%, has come to the lower end of the Fed’s target range of 1.5 to 1.75%.\n*****\n&gt; For that reason it is likely to raise the interest rate on excess reserves by five basis points. “The intent is to affirm the bottom end of the Fed’s target range, ” he said.\n*****\n&gt; Besides the technical move, they “may be will provide a little more guidance on what it would take to vote rates one way or the other,” he said.\n*****\n&gt; # Economic data\n&gt; There’s an important data calendar in the coming week, including the first look at the fourth quarter’s gross domestic product on Thursday. Personal income and spending data is Friday, and that includes the personal consumption expenditure inflation deflator, watched by the Fed.\n*****\n&gt; New home sales could continue the string of positive news in housing, when they are released Monday, and there are durable goods Tuesday.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/Jh9TsGk.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/PC0Wzg3.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/HbDh9Vc.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/mbOqHih.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/vvAjRp1.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/H2E0IGA.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/EzxkRa0.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/D9nkFqV.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/BhyYBqu.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/ueyg2Ui.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/xc2z54D.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/mFxq4a0.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/XjxVPqW.png))**\n###### **([CLICK HERE FOR THE CHART LINK #4!](https://i.imgur.com/uiduXrQ.png))**\n\n*****\n\n# February Almanac: Weak Link in Best Six Months\n\n&gt; Even though February is right in the middle of the Best Six Months, its long-term track record, since 1950, is rather tepid. February ranks no better than sixth and has posted meager average gains except for the Russell 2000. Small cap stocks, benefiting from “January Effect” carry over; tend to outpace large cap stocks in February. The Russell 2000 index of small cap stocks turns in an average gain of 1.2% in February since 1979—just the sixth best month for that benchmark.\n\n&gt; A strong February in 2000 boosts NASDAQ and Russell 2000 rankings in election years. Otherwise, February’s performance, compared to other presidential-election-year months, is mediocre at best with no large-cap index ranked better than seventh (DJIA and S&amp;P 500 since 1950, Russell 1000 since 1979).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/9e34d983528dd8ba9318507afe5ab487/adc248f00c22c241-e9/s400x600/89582e679e67bdacb47f14034f5988f808a89164.jpg))**\n\n*****\n\n# Solid January Starts Not Rare, February Could Be Tepid\n\n&gt; Bullish sentiment is running high and why not. A new decade has begun, January has been bucking the recent trend of volatile performance and the market is trading at or near all-time record highs. Big round numbers like 29000, 3300 and 9000 are also emotionally satisfying. Our Santa Claus Rally and First Five Days indicators were both positive and the market is well on its way to completing a historically bullish January Trifecta. A positive January Barometer is all that remains to complete the January Trifecta.\n\n&gt; As of yesterday’s close DJIA was up 2.3% year-to-date. S&amp;P 500 was up 2.79% and NASDAQ stood at 4.44%. Although these gains are above average, they are actually not all that uncommon by the thirteenth trading day of the New Year. Since 1901 (119 years), DJIA has been up 2.3% or more on the thirteenth trading day 33 times before this year. DJIA’s largest gain on the thirteenth trading day was 11.4% in 1976 (+17.9% for the full-year). S&amp;P 500 has equaled or exceeded 2.79% on the thirteenth trading day 26 times since 1930 while NASDAQ has bested 4.44% 15 times since 1971. Depending on index, gains equal to or greater than this year come about approximately once every 3.3 to 3.6 years. 2012 was the last election year where all three indexes were up more on the thirteenth trading day than this year.\n\n&gt; In the following Seasonal Patten Charts of DJIA, S&amp;P 500 and NASDAQ, we compare 2020 (as of yesterday’s close) to All Years and Election Years. Here it is clear that the market has gotten off to a solid start with well above average gains so far. Throughout 2019, the market tracked its historical patterns quite closely which suggests some mean reversion could occur this February as the month has been historically tepid for DJIA and S&amp;P 500.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/40266be6ec0ea5254acf28b7b6d1382f/9bf6345fd07e4a41-a7/s500x750/adacad5fc51e44798ccb9e3f4f840aeb1cf88bad.jpg))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/64ed8994efe5e18c82cdb0e191844380/9bf6345fd07e4a41-00/s500x750/da09894ccf7e9c51f7a3814ee73a4a9e65fefeca.jpg))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/71145fa04257eb5aad5eec7945276aa7/9bf6345fd07e4a41-02/s500x750/48e6c017697fc7e130ffcdabcb46093f3c28522b.jpg))**\n\n*****\n\n# Another Look At Election Years\n\n&gt; Last week in our LPL Research blog, we took a closer look at how stocks have performed during an election year. We found that since 1940, the S&amp;P 500 Index hasn’t been lower during an election year when an incumbent president has been up for reelection.\n\n&gt; We’ve had many requests to look more into election years, so we thought we’d take another look at this impactful year.\n\n&gt; The S&amp;P 500’s track record for reelection years has been impressive, but its average path during these years has been quite interesting, as shown in the LPL Chart of the Day. In ten reelection years since 1950, the S&amp;P 500 on average has barely budged from February through June, before breaking out in the second half of the year.\n\n&gt; “Stocks actually have traded in a tight range from February through June during election years, with the big rally taking place during the second half of the year,” explained LPL Financial Senior Market Strategist Ryan Detrick.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/01/reelection-012220.jpg?ssl=1))**\n\n&gt; From a quarterly view, the S&amp;P 500 has historically posted modest returns in the four quarters of an election year, but the benchmark has been higher an impressive 82% of the time in the fourth quarter of all election years. That’s one of the best track records of any quarter in the four-year presidential cycle.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/01/quarterly-return-012220.png?ssl=1))**\n\n*****\n\n# Recession Watch Update\n\n&gt; As the economic expansion caps its first decade, we thought it’d be a good time to check on LPL Research’s leading indicators in our Recession Watch Dashboard.\n\n&gt; As you can see in our latest update and in the LPL Chart of the Day, the overall view hasn’t changed much. We believe we are in the later stages of this economic expansion, but we still see little threat of imminent recession. The current expansion is the longest on record, at 126 months, but the economy has grown at a slow and steady rate. We believe this measured pace, along with supportive fiscal policy, has contributed to this cycle’s continued durability.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/01/012120-recession-blog.png?ssl=1))**\n\n&gt; In the fourth quarter, the needle moved in different directions for two of our five forecasters:\n\n&gt; We removed the U.S. Treasury Yield Curve from On Watch status as the spread between the 3-month and 10-year yields moved back into positive territory. The spread between the 2-year and 10-year yields also climbed to an 18-month high following the Federal Reserve rate cuts. Going back to 1955, a yield curve inversion (long-term yields falling below short-term yields) has preceded each of the nine recessions. It’s important to note, however, that parts of the curve flickered between positive and inverted territory several times before the actual recession occurred.\n\n&gt; We added Market Valuations to On Watch status, as the S&amp;P 500 Index trailing price-to-earnings (P/E) ratio rose near cycle highs. The P/E ratio is now comfortably above our 2020 target of 18.75. With the S&amp;P 500 surpassing the upper end of our year-end fair value target of 3,300, we are watching closely to see if earnings growth is strong enough to justify these elevated valuations. The low interest-rate and inflation environment continue to be strong tailwinds for market valuations.\n\n&gt; “We remain optimistic of continued, albeit possibly slower, economic growth in the United States in the coming year, bolstered by recent progress on the U.S.-China trade deal,” said LPL Financial Chief Investment Strategist John Lynch. “While we continue to monitor the indicators closely, at the present time, we see only a modest chance of recession starting within the next year.”\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending January 24th, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=IqUWzJw_T-Y))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 1.26.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=7HXyp_tGZDQ))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$AAPL** \n&gt; * **$TSLA** \n&gt; * **$AMD** \n&gt; * **$AMZN** \n&gt; * **$MSFT** \n&gt; * **$FB** \n&gt; * **$BA** \n&gt; * **$GE** \n&gt; * **$MA** \n&gt; * **$T** \n&gt; * **$V** \n&gt; * **$SBUX** \n&gt; * **$PYPL** \n&gt; * **$MCD** \n&gt; * **$LMT** \n&gt; * **$MMM** \n&gt; * **$DHI** \n&gt; * **$PFE** \n&gt; * **$UTX** \n&gt; * **$KO** \n&gt; * **$UPS** \n&gt; * **$S** \n&gt; * **$NURO** \n&gt; * **$HMST** \n&gt; * **$VZ** \n&gt; * **$HCA** \n&gt; * **$XLNX** \n&gt; * **$ARNC** \n&gt; * **$XOM** \n&gt; * **$CAT** \n&gt; * **$BX** \n&gt; * **$PGR** \n&gt; * **$LRCX** \n&gt; * **$GD** \n&gt; * **$PHM** \n&gt; * **$NVR** \n&gt; * **$PII** \n&gt; * **$SALT** \n&gt; * **$BIIB** \n&gt; * **$NOW** \n&gt; * **$ANTM** \n&gt; * **$NUE** \n&gt; * **$ALK** \n&gt; * **$PLUG** \n&gt; * **$MPC**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/BhyYBqu.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/LryC0HR.png))**\n###### **([CLICK HERE FOR MOST ANTICIPATED EARNINGS RELEASES FOR THE NEXT 5 WEEKS!](https://i.imgur.com/UJ0XUOn.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 1.27.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/4WIKCya.png))\n\n&gt; # ***Monday 1.27.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ZqdHlAC.png))\n\n*****\n\n&gt; # ***Tuesday 1.28.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/uNAMC1F.png))\n\n&gt; # ***Tuesday 1.28.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/yyFyqKK.png))\n\n*****\n\n&gt; # ***Wednesday 1.29.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/nGue9UL.png))\n\n&gt; # ***Wednesday 1.29.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/D7CJT4Z.png))\n\n*****\n\n&gt; # ***Thursday 1.30.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/gAvYCNR.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/RKvojKG.png))\n\n&gt; # ***Thursday 1.30.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/1aQuGJs.png))\n\n*****\n\n&gt; # ***Friday 1.31.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/5YpKIPM.png))\n\n*****\n\n&gt; # ***Friday 1.31.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/r0KJmsx.png))\n\n*****\n\n# Apple, Inc. $318.31\n&gt; **Apple, Inc. (AAPL)** is confirmed to report earnings at approximately 4:30 PM ET on Tuesday, January 28, 2020. The consensus earnings estimate is $4.53 per share on revenue of $87.74 billion and the Earnings Whisper ® number is $4.80 per share. Investor sentiment going into the company's earnings release has 74% expecting an earnings beat The company's guidance was for earnings of $4.18 to $4.66 per share. Consensus estimates are for year-over-year earnings growth of 8.37% with revenue increasing by 4.07%. Short interest has decreased by 5.2% since the company's last earnings release while the stock has drifted higher by 28.7% from its open following the earnings release to be 39.6% above its 200 day moving average of $227.94. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, January 24, 2020 there was some notable buying of 10,425 contracts of the $320.00 call expiring on Friday, January 31, 2020. Option traders are pricing in a 5.4% move on earnings and the stock has averaged a 4.8% move in recent quarters.\n\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AAPL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Tesla, Inc. $564.82\n&gt; **Tesla, Inc. (TSLA)** is confirmed to report earnings at approximately 4:55 PM ET on Wednesday, January 29, 2020. The consensus earnings estimate is $2.03 per share on revenue of $6.99 billion and the Earnings Whisper ® number is $2.24 per share. Investor sentiment going into the company's earnings release has 43% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 6.84% with revenue decreasing by 3.26%. Short interest has decreased by 27.2% since the company's last earnings release while the stock has drifted higher by 87.7% from its open following the earnings release to be 100.1% above its 200 day moving average of $282.24. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, January 9, 2020 there was some notable buying of 12,168 contracts of the $700.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 12.8% move on earnings and the stock has averaged a 10.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TSLA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Advanced Micro Devices, Inc. $50.35\n&gt; **Advanced Micro Devices, Inc. (AMD)** is confirmed to report earnings at approximately 4:15 PM ET on Tuesday, January 28, 2020. The consensus earnings estimate is $0.31 per share on revenue of $2.10 billion and the Earnings Whisper ® number is $0.32 per share. Investor sentiment going into the company's earnings release has 71% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 287.50% with revenue increasing by 47.99%. Short interest has decreased by 34.0% since the company's last earnings release while the stock has drifted higher by 52.9% from its open following the earnings release to be 48.5% above its 200 day moving average of $33.91. Overall earnings estimates have been unchanged since the company's last earnings release. On Thursday, January 9, 2020 there was some notable buying of 16,799 contracts of the $60.00 call expiring on Friday, February 21, 2020. Option traders are pricing in a 9.7% move on earnings and the stock has averaged a 10.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AMD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Amazon.com, Inc. -\n&gt; **Amazon.com, Inc. (AMZN)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, January 30, 2020. The consensus earnings estimate is $3.98 per share on revenue of $86.00 billion and the Earnings Whisper ® number is $4.15 per share. Investor sentiment going into the company's earnings release has 71% expecting an earnings beat The company's guidance was for revenue of $80.00 million to $86.00 million. Consensus estimates are for earnings to decline year-over-year by 35.18% with revenue increasing by 18.81%. Short interest has increased by 22.4% since the company's last earnings release while the stock has drifted higher by 9.7% from its open following the earnings release to be 2.0% above its 200 day moving average of $1,824.47. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, January 21, 2020 there was some notable buying of 1,348 contracts of the $1,862.50 put expiring on Friday, January 31, 2020. Option traders are pricing in a 4.5% move on earnings and the stock has averaged a 3.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AMZN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Microsoft Corp. $165.04\n&gt; **Microsoft Corp. (MSFT)** is confirmed to report earnings at approximately 4:10 PM ET on Wednesday, January 29, 2020. The consensus earnings estimate is $1.32 per share on revenue of $35.69 billion and the Earnings Whisper ® number is $1.38 per share. Investor sentiment going into the company's earnings release has 87% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 20.00% with revenue increasing by 9.91%. Short interest has increased by 18.2% since the company's last earnings release while the stock has drifted higher by 18.9% from its open following the earnings release to be 18.6% above its 200 day moving average of $139.21. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, January 14, 2020 there was some notable buying of 11,176 contracts of the $165.00 call expiring on Friday, April 17, 2020. Option traders are pricing in a 4.0% move on earnings and the stock has averaged a 2.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MSFT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Facebook Inc. $217.94\n&gt; **Facebook Inc. (FB)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, January 29, 2020. The consensus earnings estimate is $2.51 per share on revenue of $20.83 billion and the Earnings Whisper ® number is $2.63 per share. Investor sentiment going into the company's earnings release has 83% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 5.46% with revenue increasing by 23.15%. Short interest has increased by 2.4% since the company's last earnings release while the stock has drifted higher by 10.8% from its open following the earnings release to be 14.2% above its 200 day moving average of $190.86. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, January 14, 2020 there was some notable buying of 9,443 contracts of the $200.00 put expiring on Friday, February 7, 2020. Option traders are pricing in a 5.8% move on earnings and the stock has averaged a 7.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FB&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Boeing Co. $323.05\n&gt; **Boeing Co. (BA)** is confirmed to report earnings at approximately 7:30 AM ET on Wednesday, January 29, 2020. The consensus earnings estimate is $1.73 per share on revenue of $21.67 billion and the Earnings Whisper ® number is $1.40 per share. Investor sentiment going into the company's earnings release has 2% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 68.43% with revenue decreasing by 23.54%. Short interest has increased by 8.9% since the company's last earnings release while the stock has drifted lower by 6.4% from its open following the earnings release to be 8.7% below its 200 day moving average of $353.77. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, January 24, 2020 there was some notable buying of 7,609 contracts of the $330.00 call expiring on Friday, January 31, 2020. Option traders are pricing in a 5.0% move on earnings and the stock has averaged a 2.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# General Electric Co. $11.71\n&gt; **General Electric Co. (GE)** is confirmed to report earnings at approximately 6:00 AM ET on Wednesday, January 29, 2020. The consensus earnings estimate is $0.18 per share on revenue of $26.16 billion and the Earnings Whisper ® number is $0.20 per share. Investor sentiment going into the company's earnings release has 70% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 14.29% with revenue decreasing by 21.39%. Short interest has decreased by 24.1% since the company's last earnings release while the stock has drifted higher by 19.7% from its open following the earnings release to be 15.0% above its 200 day moving average of $10.18. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, January 13, 2020 there was some notable buying of 18,933 contracts of the $11.00 call expiring on Friday, February 21, 2020. Option traders are pricing in a 7.2% move on earnings and the stock has averaged a 6.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=GE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Mastercard Inc $323.67\n&gt; **Mastercard Inc (MA)** is confirmed to report earnings at approximately 8:00 AM ET on Wednesday, January 29, 2020. The consensus earnings estimate is $1.87 per share on revenue of $4.39 billion and the Earnings Whisper ® number is $1.89 per share. Investor sentiment going into the company's earnings release has 81% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 20.65% with revenue increasing by 15.31%. Short interest has increased by 12.0% since the company's last earnings release while the stock has drifted higher by 16.6% from its open following the earnings release to be 18.7% above its 200 day moving average of $272.70. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, January 15, 2020 there was some notable buying of 2,162 contracts of the $200.00 put expiring on Friday, January 15, 2021. Option traders are pricing in a 3.5% move on earnings and the stock has averaged a 2.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# AT&amp;T Corp. $38.50\n&gt; **AT&amp;T Corp. (T)** is confirmed to report earnings at approximately 6:50 AM ET on Wednesday, January 29, 2020. The consensus earnings estimate is $0.87 per share on revenue of $46.97 billion and the Earnings Whisper ® number is $0.88 per share. Investor sentiment going into the company's earnings release has 63% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 1.16% with revenue decreasing by 2.13%. The stock has drifted higher by 0.5% from its open following the earnings release to be 8.0% above its 200 day moving average of $35.63. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, January 8, 2020 there was some notable buying of 5,621 contracts of the $42.00 call expiring on Friday, April 17, 2020. Option traders are pricing in a 3.9% move on earnings and the stock has averaged a 4.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=T&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/wallstreetbets.",
        "subreddit": "wallstreetbets",
        "title": "Stock Market Week Ahead for the trading week beginning January 27th, 2020",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/etuepm/stock_market_week_ahead_for_the_trading_week/",
        "created": 1580005509.0
    },
    {
        "author": "oranguthang87",
        "created_utc": 1579614121,
        "id": "eruuh8",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": " \n\n* Needham raised the price target for **Lam Research Corporation** (NASDAQ: LRCX) from $280 to $325. Lam Research shares closed at $308.00 on Friday.\n* KeyBanc boosted the price target for **Intuit Inc.** (NASDAQ: INTU) from $305 to $320. Intuit shares closed at $282.85 on Friday.\n* Goldman Sachs lifted **Ping Identity Holding Corp** (NYSE: PING) price target from $24 to $27. Ping Identity closed at $25.65 on Friday.\n* Jefferies cut **Liberty Global PLC** (NASDAQ: LBTYA) price target from $33 to $23. Liberty Global shares closed at $21.15 on Friday.\n* Credit Suisse lowered the price target for **U.S. Bancorp** (NYSE: USB) from $55 to $52. U.S. Bancorp closed at $55.35 on Friday.\n* Goldman Sachs lifted the price target on **RingCentral Inc** (NYSE: RNG) from $189 to $230. RingCentral closed at $192.89 on Friday.\n* JP Morgan boosted the price target for **TE Connectivity Ltd** (NYSE: TEL) from $98 to $117. TE Connectivity shares closed at $100.18 on Friday.\n* Daiwa Capital raised the price target on **Caterpillar Inc.**(NYSE: CAT) from $143 to $165. Caterpillar closed at $147.78 on Friday.\n* KeyBanc raised **Shopify Inc** (NYSE: SHOP) price target from $385 to $485. Shopify shares closed at $454.88 on Friday.\n* Needham raised the price target for **ACM Research Inc** (NASDAQ: ACMR) from $20 to $40. ACM Research shares closed at $36.09 on Friday.",
        "subreddit": "wallstreetbets",
        "title": "10 Biggest Price Target Changes For Tuesday",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eruuh8/10_biggest_price_target_changes_for_tuesday/",
        "created": 1579642921.0
    },
    {
        "author": "BigBloodyShark",
        "created_utc": 1578583507,
        "id": "emb3eq",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Greetings autistis,\n\nFor my less responsible stock activities, I use Revolut cuz I'm not gonna get addicted to options (I'm pretty addicted to day trading anyway which is why I keep my actual portfolio and this toy VERY separate) \n\nAnyway, I went to check in on the daily tendys, ate a McDonald's last night so brought some shares figuring other ppl were doing the same, turns out they were and its up a bit today.\n\nThen I noticed a divided had come in, with a company logo I didn't recognise. Opened it up, didn't say what company it was from and I checked my portfolio, nothing matched\n\n[The mysterious dividend](https://preview.redd.it/9kw9s1bssr941.png?width=534&amp;format=png&amp;auto=webp&amp;s=72754d60e7792fffba279f57d5d33914c146aee8)\n\n&amp;#x200B;\n\nSuper weird. Checked my transaction history, and then I saw it... That stock is for Lam research or whatever, I had brought it to impress a girl who's initials were LAM (it didn't work out - she was engaged hence I sold)\n\n&amp;#x200B;\n\n[I buy here...](https://preview.redd.it/faxrr4zctr941.jpg?width=1125&amp;format=pjpg&amp;auto=webp&amp;s=c87c8a247bee05e5eec52ed527218a0b69159c3c)\n\n&amp;#x200B;\n\n[And sell here...](https://preview.redd.it/343stdmctr941.jpg?width=1125&amp;format=pjpg&amp;auto=webp&amp;s=1b22655c8cb5da1140f27b7c1cd5aedb9ff1c18c)\n\n&amp;#x200B;\n\nSoooooo, I've sold it all, and they paid me a divided anyway? Thinking of buying and selling a load of dividend stocks and selling them immediately to get that sweet sweet free money",
        "subreddit": "wallstreetbets",
        "title": "I got a dividend from company I don't own",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/emb3eq/i_got_a_dividend_from_company_i_dont_own/",
        "created": 1578612307.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1580131483,
        "id": "eunulf",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/smallstreetbets sub! Welcome to the new trading week and a fresh start! Here are your pre-market news this AM-\n\n*****\n\n#[Today's Top Headlines for Monday, January 27th, 2020](https://www.cnbc.com/2020/01/27/dow-to-sink-kobe-bryant-remembered-and-wuhan-virus-spreads.html)\n\n* With the coronavirus spreading, world stocks are tumbling and perceived safer investments are rising. U.S. stock futures are sliding early Monday following Wall Street’s worst day of 2020 on Friday. The Dow already has a four-day losing streak in place, its longest since August, and is coming off its largest weekly loss in five months. The S&amp;P 500′s weekly decline last week was its largest in nearly four months. (CNBC)\n* Treasury yields move lower as coronavirus fears escalate (CNBC)\n* Gold climbs to 2-week high as virus fears spark safety buying (Reuters)\n* International oil prices drop below $60 as China virus drives demand concern (Reuters)\n* More than 2,800 people in China are now infected by the fast-spreading Wuhan coronavirus while more countries have reported their first confirmed cases. Chinese officials have said there are 2,862 confirmed cases, with the death toll rising to 81. On Sunday, the United States on Sunday reported its fifth confirmed case in Arizona. (CNBC)\n* Travel-related stocks are likely to be hit once again as coronavirus cases mount, including major airlines like United (UAL), Delta (DAL), American (AAL) and Southwest (LUV), and cruise line operators like Royal Caribbean (RCL), Norwegian (NCLH), and Carnival (CCL). Starbucks (SBUX) and McDonald’s have temporarily closed near the Chinese city of Wuhan.\n* On today’s U.S. economic calendar, the government will release its December report on new home sales at 10 a.m. ET. Arconic (ARNC), DR Horton (DH) and Sprint (S) are among the companies issuing quarterly earnings this morning, while Whirlpool (WHR), Juniper Networks (JNPR) and Rambus (RMBS) report after the bell.\n* Federal safety investigators launched a probe into a helicopter crash in the LA area that killed basketball legend Kobe Bryant and eight others, including his 13-year-old daughter, Gianna. The cause of the crash has not yet been determined. NBA athletes, officials and fans mourned Bryant’s death in messages and memorials across social media. (CNBC)\n* ‘Terrible,’ ‘heartbreaking,’ ‘devastated’ — World leaders and athletes mourn the death of Kobe Bryant (CNBC)\n* Athletes pay tribute to Kobe Bryant. ‘He was like a little brother to me’ Michael Jordan says (CNBC)\n* A passenger plane crashed in central Afghanistan, senior Afghan officials said today. According to local media, the plane went down in territory under Taliban control. It was initially reported to be a jet from state-owned Ariana Afghan Airlines. However, the airline’s acting CEO has denied that one of their planes has crashed. (CNBC)\n* President Donald Trump is expected to disclose details of his long-delayed Mideast peace proposal to Israeli leaders today. Trump will hold separate, back-to-back meetings with Israeli Prime Minister Benjamin Netanyahu and Benny Gantz, head of the centrist Blue and White Party. Gantz is Netanyahu’s rival in March 2 elections. (Reuters)\n* Trump’s impeachment trial enters a pivotal week as his defense team resumes its case and senators face a critical vote on whether to hear witnesses or proceed directly to a vote that is widely expected to end in his acquittal. The articles of impeachment charge Trump with abuse of power and obstruction of Congress. (AP)\n* Democrats stepped up their calls for former national security advisor John Bolton to testify at the trial after an explosive report alleged that in his unpublished book, he said Trump personally tied Ukraine aid to an investigation of the Bidens, an account that conflicts with the president’s. (NBC News)\n* Trump denies telling Bolton Ukraine aid was tied to investigations (The Hill)\n* Sen. Bernie Sanders holds an edge in the 2020 New Hampshire Democratic primary as the key presidential nominating contest nears, according to an NBC News/Marist poll. The Vermont senator garners the support of 22% of likely Democratic primary voters in the Granite State, the survey found. Ex-Mayor Pete Buttigieg trails at 17%. (CNBC)\n* Sen. Elizabeth Warren seeks spark in final Iowa push after getting Des Moines Register endorsement (AP)\n* U.S. state attorneys general will meet Justice Department attorneys next week to share information on their investigations into Google (GOOGL), Reuters reported. * The probes revolve around monopolistic behavior that may harm consumers through Google’s control of online advertising markets and search traffic.\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](https://finviz.com/futures.ashx)**)\n\n*****\n\n#LAST WEEK'S MARKET MAP:\n######(**[CLICK HERE FOR LAST WEEK'S MARKET MAP!](https://finviz.com/publish/012720/sec_all_w1_075397186.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#LAST WEEK'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR LAST WEEK'S S&amp;P SECTORS CHART!](https://i.imgur.com/6xYBiNo.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/g0O8Bke.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/mbOqHih.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/pT8VGHp.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n*($AAPL $TSLA $AMD $AMZN $MSFT $FB $BA $GE $MA $T $V $SBUX $PYPL $MCD $LMT $MMM $DHI $PFE $UTX $KO $UPS $S $NURO $HMST $VZ $HCA $XLNX $ARNC $XOM $CAT $BX $PGR $LRCX $GD $PHM $NVR $PII $SALT $BIIB $NOW $ANTM $NUE $ALK $PLUG $MPC)*\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/BhyYBqu.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n*($DHI $NURO $HMST $S $ARNC $NVR $SALT $BMRC $RDY $BOH $OPB $ARLP $PROV $NWBI)*\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/RExcdcI.jpg)**)\n\n*****\n\n#THIS AFTERNOON'S POST-MARKET EARNINGS CALENDAR:\n*()*\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS CALENDAR!]()**)\nT.B.A.\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/jPiSdVy.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/YRM412m.png)**)\nNONE.\n\n*****\n\n#FRIDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR FRIDAY'S UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/xc2z54D.png)**)\n######(**[CLICK HERE FOR FRIDAY'S UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/mFxq4a0.png)**)\n######(**[CLICK HERE FOR FRIDAY'S UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/XjxVPqW.png)**)\n######(**[CLICK HERE FOR FRIDAY'S UPGRADES/DOWNGRADES LINK #4!](https://i.imgur.com/uiduXrQ.png)**)\n\n*****\n\n#FRIDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR FRIDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/2nH33vr.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!](https://i.imgur.com/tXGwWol.png)**)\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS:\n\n* SPY\n* NNVC\n* BABA\n* QQQ\n* SPCE\n* TVIX\n* APT\n* ABBV\n* DJIA\n* DIA\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2020/01/27/stocks-making-the-biggest-moves-premarket-dr-horton-arconic-starbucks-boeing-more.html)**)\n\n*****\n\n&gt; **D.R. Horton (DHI)** – The homebuilder earned $1.16 per share for its fiscal first quarter, beating the consensus estimate of 92 cents a share. Revenue also topped forecasts. New orders were up 19% on a volume basis and up 22% in value. The company also raised the upper end of its full-year home sales forecast.\n\n&gt; #**STOCK SYMBOL:** DHI\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DHI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DHI)**)\n\n*****\n\n&gt; **Arconic (ARNC)** – Arconic missed estimates by a penny a share, with adjusted quarterly earnings of 53 cents per share. Revenue came in shy of Wall Street predictions. The maker of engineered metals products saw a 1% improvement in organic revenue on factors like favorable pricing and raw materials costs, partially offset by some weakness in its automotive and commercial transportation markets. Arconic also said it would complete its planned split of its aerospace components and aluminum rolling businesses into two companies on April 1.\n\n&gt; #**STOCK SYMBOL:** ARNC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ARNC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ARNC)**)\n\n*****\n\n&gt; **Travel-related stocks** – These are likely to be hit once again as coronavirus cases mount – including major airlines like United Airlines (UAL), Delta Air Lines (DAL), American Airlines (AAL), and Southwest (LUV), and cruise line operators like Royal Caribbean (RCL), Norwegian Cruise Line (NCLH), and Carnival Cruise Lines (CCL). Casino stocks like Wynn Resorts (WYNN) and Las Vegas Sands (LVS) are also being hit.\n\n&gt; #**STOCK SYMBOL:** UAL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=UAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/UAL)**)\n\n*****\n\n&gt; **Starbucks (SBUX)** – Starbucks has temporarily closed all its shots in China’s Hubei province and suspended delivery services, amid health concerns for customers and employees amid the spread of the coronavirus.\n\n&gt; #**STOCK SYMBOL:** SBUX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SBUX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SBUX)**)\n\n*****\n\n&gt; **Estee Lauder (EL)** – Oppenheimer downgraded the cosmetics maker to “perform” from “outperform.” The firm cited the stock’s premium valuation coupled with concerns about the coronavirus impact on a company that has seen China represent a key driver of recent growth.\n\n&gt; #**STOCK SYMBOL:** EL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=EL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/EL)**)\n\n*****\n\n&gt; **Boeing (BA)** – Boeing completed a successful maiden voyage of its 777-X jet over the weekend, a respite for the jet maker amid the ongoing grounding of its 737 Max jet.\n\n&gt; #**STOCK SYMBOL:** BA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BA)**)\n\n*****\n\n&gt; **AbbVie (ABBV)** – AbbVie sold a number of assets to Nestle and AstraZeneca (AZN), as it seeks to win regulatory approval for its $63 billion acquisition of drugmaker Allergan (AGN).\n\n&gt; #**STOCK SYMBOL:** ABBV\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ABBV&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ABBV)**)\n\n*****\n\n&gt; **Fiat Chrysler (FCAU)** – Fiat Chrysler filed court motions Friday to dismiss a lawsuit filed by rival automaker General Motors (GM). Fiat Chrysler said GM does not have sufficient grounds to bring a racketeering case that alleges bribery of union officials.\n\n&gt; #**STOCK SYMBOL:** FCAU\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=FCAU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/FCAU)**)\n\n*****\n\n&gt; **Kraft Heinz (KHC)** – Kraft Heinz CEO Miguel Patricio told The Wall Street Journal that he wants to food maker to make fewer but bigger bets on new products, as its older brands suffer a sales decline.\n\n&gt; #**STOCK SYMBOL:** KHC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=KHC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/KHC)**)\n\n*****\n\n&gt; **Alphabet (GOOGL)** – State attorneys general will meet with Justice Department officials to share investigative material involving Google, according to The Wall Street Journal.\n\n&gt; #**STOCK SYMBOL:** GOOGL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=GOOGL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/GOOGL)**)\n\n*****\n\n&gt; **Winnebago Industries (WGO)** – The RV maker was rated “overweight” in new coverage at KeyBanc, which sees recreational vehicle shipments stronger than consensus for 2020 and is also optimistic about the increasing benefits of Winnebago’s 2016 acquisition of towable vehicle maker Grand Design.\n\n&gt; #**STOCK SYMBOL:** WGO\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WGO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WGO)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat is on everyone's radar for today's trading day ahead here at r/smallstreetbets?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Monday, January 27th, 2020! :)**",
        "subreddit": "smallstreetbets",
        "title": "Today's Pre-Market Movers &amp; News [Monday, January 27th, 2020]",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/eunulf/todays_premarket_movers_news_monday_january_27th/",
        "created": 1580160283.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1579976253,
        "id": "etub2m",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Good Saturday afternoon to all of you here on r/StockMarket. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning January 27th, 2020.\n\n# **After virus scare, markets look to Fed rate policy to keep stock rally going  - [(Source)](https://www.cnbc.com/2020/01/24/after-virus-scare-markets-look-to-fed-rate-policy-to-keep-rally-going.html)**\n*****\n&gt; With stocks coming off their first losing week of the year, investors will be looking for the Federal Reserve to soothe markets by reaffirming its position that interest rates will be low for a long time into the future.\n*****\n&gt; The outbreak of the coronavirus in China in the past week took the steam out of a market that has been repeatedly rallying to new highs since December. The S&amp;P 500 fell just about 1% for the week, amid fears the virus could lead to slower growth not only in China, but across the globe.\n*****\n&gt; Those concerns could continue to spook markets in the coming week, but stocks should be buffeted by the Fed’s anticipated commitment to low rates and its current Treasury bill buying program. The Fed meets Tuesday and Wednesday. Fed Chairman Jerome Powell is expected to emphasize that the Fed remains on a neutral policy path and that would only change if there was a significant change in the economic outlook.\n*****\n&gt; There are also some major earnings reports, including from Apple, which hit an all-time high Friday morning before closing lower with the broader market. It could have a big impact on sentiment and help influence trading across the technology sector.\n*****\n&gt; Stocks were choppy in the past week, and Treasury yields have been sinking on worries about the new virus. The 10-year yield sunk to a Nov. 1 low of 1.68% and investors drove gold prices higher in a flight-to-safety trade.\n*****\n&gt; “It’s overshadowing everything, and what the market is looking for is that the Chinese are containing it, and the spread is minimal,” said Quincy Krosby, chief market strategist at Prudential Financial. “The derivative of all of this is what does it do to growth? Traders and investors are hoping the stimulus that has been introduced into the Chinese economy is going to take hold, and this is not going to halt that turnaround.”\n*****\n&gt; Krosby said the market has been looking for an excuse to pull back. The S&amp;P 500 ended the week at 3,295, off 1%, but it is still up about 2% for the year so far.\n*****\n&gt; “You could see going into the weekend the 10-year Treasury yield is down, gold is higher, the market is in a text book defensive state,” said Krosby. “We had a market that was poised for a bout of profit-taking and this is it.”\n*****\n&gt; # Earnings roll out\n&gt; There are more than 135 S&amp;P companies reporting earnings in the week ahead, with a heavy focus on technology, industrials and consumer stocks. Apple reports Tuesday, and Microsoft and Facebook are Wednesday. Boeing and General Electric report Wednesday, while McDonald’s releases results Wednesday. On Friday, big oil reports with ExxonMobil and Chevron expected.\n*****\n&gt; Earnings reports so far have been mostly better than expected, with 68.2% of companies beating earnings per share estimates, according to Refinitiv. Earnings are expected to be down about a half percent for the fourth quarter, based on actual reports and estimates of companies yet to report.\n*****\n&gt; “Coming into any earnings season with stocks at all time highs is fraught with peril,” said Art Hogan, chief market strategist at National Securities. “It’s precarious because you have the opportunity for outsized moves if you miss earnings, revenues or guidance.”\n*****\n&gt; Hogan said companies may be able to give a better indication of the future, now that there’s a first phase trade deal between the U.S. and China. He said markets will also be looking for guidance from China and elsewhere on whether the virus appears to be containable or not.\n*****\n&gt;#  Fed is big story but won’t say much\nThe Federal Reserve is not likely to say much has changed in its outlook, except that it’s last three interest rate cuts may have helped the economy and financial conditions.\n*****\n&gt; “The big news is just talk on the balance sheet. I think that’s going to be the key messaging,” said Jim Caron, portfolio strategist at Morgan Stanley Investment Management. “I think the data has been okay. There’s really nothing new there. The only thing that’s really new or interesting is going to be what’s going on with the balance sheet.”\n*****\n&gt; The Fed has been buying about $60 billion in Treasury bills each month to expand its balance sheet, ending a program where it was shrinking the balance sheet. The Fed is adding reserves to end a problem in the repo market, which is basically the plumbing of the financial markets where institutions go to get short term cash.\n*****\n&gt; Many traders believe the program is adding liquidity to markets, and therefore driving investors into stocks.\n*****\n&gt; Mark Cabana, head of short rate strategy at BofA Securiteis, said the Fed is not changing its benchmark fed funds target rate, but the fixed income market has been expecting the Fed to make a technical adjustment to another rate. He said the fed funds rate, trading at about 1.55%, has come to the lower end of the Fed’s target range of 1.5 to 1.75%.\n*****\n&gt; For that reason it is likely to raise the interest rate on excess reserves by five basis points. “The intent is to affirm the bottom end of the Fed’s target range, ” he said.\n*****\n&gt; Besides the technical move, they “may be will provide a little more guidance on what it would take to vote rates one way or the other,” he said.\n*****\n&gt; # Economic data\n&gt; There’s an important data calendar in the coming week, including the first look at the fourth quarter’s gross domestic product on Thursday. Personal income and spending data is Friday, and that includes the personal consumption expenditure inflation deflator, watched by the Fed.\n*****\n&gt; New home sales could continue the string of positive news in housing, when they are released Monday, and there are durable goods Tuesday.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/Jh9TsGk.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/PC0Wzg3.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/HbDh9Vc.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/mbOqHih.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/vvAjRp1.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/H2E0IGA.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/EzxkRa0.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/D9nkFqV.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/BhyYBqu.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/ueyg2Ui.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/xc2z54D.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/mFxq4a0.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/XjxVPqW.png))**\n###### **([CLICK HERE FOR THE CHART LINK #4!](https://i.imgur.com/uiduXrQ.png))**\n\n*****\n\n# February Almanac: Weak Link in Best Six Months\n\n&gt; Even though February is right in the middle of the Best Six Months, its long-term track record, since 1950, is rather tepid. February ranks no better than sixth and has posted meager average gains except for the Russell 2000. Small cap stocks, benefiting from “January Effect” carry over; tend to outpace large cap stocks in February. The Russell 2000 index of small cap stocks turns in an average gain of 1.2% in February since 1979—just the sixth best month for that benchmark.\n\n&gt; A strong February in 2000 boosts NASDAQ and Russell 2000 rankings in election years. Otherwise, February’s performance, compared to other presidential-election-year months, is mediocre at best with no large-cap index ranked better than seventh (DJIA and S&amp;P 500 since 1950, Russell 1000 since 1979).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/9e34d983528dd8ba9318507afe5ab487/adc248f00c22c241-e9/s400x600/89582e679e67bdacb47f14034f5988f808a89164.jpg))**\n\n*****\n\n# Solid January Starts Not Rare, February Could Be Tepid\n\n&gt; Bullish sentiment is running high and why not. A new decade has begun, January has been bucking the recent trend of volatile performance and the market is trading at or near all-time record highs. Big round numbers like 29000, 3300 and 9000 are also emotionally satisfying. Our Santa Claus Rally and First Five Days indicators were both positive and the market is well on its way to completing a historically bullish January Trifecta. A positive January Barometer is all that remains to complete the January Trifecta.\n\n&gt; As of yesterday’s close DJIA was up 2.3% year-to-date. S&amp;P 500 was up 2.79% and NASDAQ stood at 4.44%. Although these gains are above average, they are actually not all that uncommon by the thirteenth trading day of the New Year. Since 1901 (119 years), DJIA has been up 2.3% or more on the thirteenth trading day 33 times before this year. DJIA’s largest gain on the thirteenth trading day was 11.4% in 1976 (+17.9% for the full-year). S&amp;P 500 has equaled or exceeded 2.79% on the thirteenth trading day 26 times since 1930 while NASDAQ has bested 4.44% 15 times since 1971. Depending on index, gains equal to or greater than this year come about approximately once every 3.3 to 3.6 years. 2012 was the last election year where all three indexes were up more on the thirteenth trading day than this year.\n\n&gt; In the following Seasonal Patten Charts of DJIA, S&amp;P 500 and NASDAQ, we compare 2020 (as of yesterday’s close) to All Years and Election Years. Here it is clear that the market has gotten off to a solid start with well above average gains so far. Throughout 2019, the market tracked its historical patterns quite closely which suggests some mean reversion could occur this February as the month has been historically tepid for DJIA and S&amp;P 500.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/40266be6ec0ea5254acf28b7b6d1382f/9bf6345fd07e4a41-a7/s500x750/adacad5fc51e44798ccb9e3f4f840aeb1cf88bad.jpg))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/64ed8994efe5e18c82cdb0e191844380/9bf6345fd07e4a41-00/s500x750/da09894ccf7e9c51f7a3814ee73a4a9e65fefeca.jpg))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/71145fa04257eb5aad5eec7945276aa7/9bf6345fd07e4a41-02/s500x750/48e6c017697fc7e130ffcdabcb46093f3c28522b.jpg))**\n\n*****\n\n# Another Look At Election Years\n\n&gt; Last week in our LPL Research blog, we took a closer look at how stocks have performed during an election year. We found that since 1940, the S&amp;P 500 Index hasn’t been lower during an election year when an incumbent president has been up for reelection.\n\n&gt; We’ve had many requests to look more into election years, so we thought we’d take another look at this impactful year.\n\n&gt; The S&amp;P 500’s track record for reelection years has been impressive, but its average path during these years has been quite interesting, as shown in the LPL Chart of the Day. In ten reelection years since 1950, the S&amp;P 500 on average has barely budged from February through June, before breaking out in the second half of the year.\n\n&gt; “Stocks actually have traded in a tight range from February through June during election years, with the big rally taking place during the second half of the year,” explained LPL Financial Senior Market Strategist Ryan Detrick.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/01/reelection-012220.jpg?ssl=1))**\n\n&gt; From a quarterly view, the S&amp;P 500 has historically posted modest returns in the four quarters of an election year, but the benchmark has been higher an impressive 82% of the time in the fourth quarter of all election years. That’s one of the best track records of any quarter in the four-year presidential cycle.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/01/quarterly-return-012220.png?ssl=1))**\n\n*****\n\n# Recession Watch Update\n\n&gt; As the economic expansion caps its first decade, we thought it’d be a good time to check on LPL Research’s leading indicators in our Recession Watch Dashboard.\n\n&gt; As you can see in our latest update and in the LPL Chart of the Day, the overall view hasn’t changed much. We believe we are in the later stages of this economic expansion, but we still see little threat of imminent recession. The current expansion is the longest on record, at 126 months, but the economy has grown at a slow and steady rate. We believe this measured pace, along with supportive fiscal policy, has contributed to this cycle’s continued durability.\n\n&gt; ###### **([CLICK HERE FOR THE CHART LINK #1!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/01/012120-recession-blog.png?ssl=1))**\n\n&gt; In the fourth quarter, the needle moved in different directions for two of our five forecasters:\n\n&gt; We removed the U.S. Treasury Yield Curve from On Watch status as the spread between the 3-month and 10-year yields moved back into positive territory. The spread between the 2-year and 10-year yields also climbed to an 18-month high following the Federal Reserve rate cuts. Going back to 1955, a yield curve inversion (long-term yields falling below short-term yields) has preceded each of the nine recessions. It’s important to note, however, that parts of the curve flickered between positive and inverted territory several times before the actual recession occurred.\n\n&gt; We added Market Valuations to On Watch status, as the S&amp;P 500 Index trailing price-to-earnings (P/E) ratio rose near cycle highs. The P/E ratio is now comfortably above our 2020 target of 18.75. With the S&amp;P 500 surpassing the upper end of our year-end fair value target of 3,300, we are watching closely to see if earnings growth is strong enough to justify these elevated valuations. The low interest-rate and inflation environment continue to be strong tailwinds for market valuations.\n\n&gt; “We remain optimistic of continued, albeit possibly slower, economic growth in the United States in the coming year, bolstered by recent progress on the U.S.-China trade deal,” said LPL Financial Chief Investment Strategist John Lynch. “While we continue to monitor the indicators closely, at the present time, we see only a modest chance of recession starting within the next year.”\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending January 24th, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=IqUWzJw_T-Y))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 1.26.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=7HXyp_tGZDQ))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$AAPL** \n&gt; * **$TSLA** \n&gt; * **$AMD** \n&gt; * **$AMZN** \n&gt; * **$MSFT** \n&gt; * **$FB** \n&gt; * **$BA** \n&gt; * **$GE** \n&gt; * **$MA** \n&gt; * **$T** \n&gt; * **$V** \n&gt; * **$SBUX** \n&gt; * **$PYPL** \n&gt; * **$MCD** \n&gt; * **$LMT** \n&gt; * **$MMM** \n&gt; * **$DHI** \n&gt; * **$PFE** \n&gt; * **$UTX** \n&gt; * **$KO** \n&gt; * **$UPS** \n&gt; * **$S** \n&gt; * **$NURO** \n&gt; * **$HMST** \n&gt; * **$VZ** \n&gt; * **$HCA** \n&gt; * **$XLNX** \n&gt; * **$ARNC** \n&gt; * **$XOM** \n&gt; * **$CAT** \n&gt; * **$BX** \n&gt; * **$PGR** \n&gt; * **$LRCX** \n&gt; * **$GD** \n&gt; * **$PHM** \n&gt; * **$NVR** \n&gt; * **$PII** \n&gt; * **$SALT** \n&gt; * **$BIIB** \n&gt; * **$NOW** \n&gt; * **$ANTM** \n&gt; * **$NUE** \n&gt; * **$ALK** \n&gt; * **$PLUG** \n&gt; * **$MPC**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/BhyYBqu.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/LryC0HR.png))**\n###### **([CLICK HERE FOR MOST ANTICIPATED EARNINGS RELEASES FOR THE NEXT 5 WEEKS!](https://i.imgur.com/UJ0XUOn.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 1.27.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/4WIKCya.png))\n\n&gt; # ***Monday 1.27.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ZqdHlAC.png))\n\n*****\n\n&gt; # ***Tuesday 1.28.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/uNAMC1F.png))\n\n&gt; # ***Tuesday 1.28.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/yyFyqKK.png))\n\n*****\n\n&gt; # ***Wednesday 1.29.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/nGue9UL.png))\n\n&gt; # ***Wednesday 1.29.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/D7CJT4Z.png))\n\n*****\n\n&gt; # ***Thursday 1.30.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/gAvYCNR.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/RKvojKG.png))\n\n&gt; # ***Thursday 1.30.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/1aQuGJs.png))\n\n*****\n\n&gt; # ***Friday 1.31.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/5YpKIPM.png))\n\n*****\n\n&gt; # ***Friday 1.31.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/r0KJmsx.png))\n\n*****\n\n# Apple, Inc. $318.31\n&gt; **Apple, Inc. (AAPL)** is confirmed to report earnings at approximately 4:30 PM ET on Tuesday, January 28, 2020. The consensus earnings estimate is $4.53 per share on revenue of $87.74 billion and the Earnings Whisper ® number is $4.80 per share. Investor sentiment going into the company's earnings release has 74% expecting an earnings beat The company's guidance was for earnings of $4.18 to $4.66 per share. Consensus estimates are for year-over-year earnings growth of 8.37% with revenue increasing by 4.07%. Short interest has decreased by 5.2% since the company's last earnings release while the stock has drifted higher by 28.7% from its open following the earnings release to be 39.6% above its 200 day moving average of $227.94. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, January 24, 2020 there was some notable buying of 10,425 contracts of the $320.00 call expiring on Friday, January 31, 2020. Option traders are pricing in a 5.4% move on earnings and the stock has averaged a 4.8% move in recent quarters.\n\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AAPL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Tesla, Inc. $564.82\n&gt; **Tesla, Inc. (TSLA)** is confirmed to report earnings at approximately 4:55 PM ET on Wednesday, January 29, 2020. The consensus earnings estimate is $2.03 per share on revenue of $6.99 billion and the Earnings Whisper ® number is $2.24 per share. Investor sentiment going into the company's earnings release has 43% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 6.84% with revenue decreasing by 3.26%. Short interest has decreased by 27.2% since the company's last earnings release while the stock has drifted higher by 87.7% from its open following the earnings release to be 100.1% above its 200 day moving average of $282.24. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, January 9, 2020 there was some notable buying of 12,168 contracts of the $700.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 12.8% move on earnings and the stock has averaged a 10.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TSLA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Advanced Micro Devices, Inc. $50.35\n&gt; **Advanced Micro Devices, Inc. (AMD)** is confirmed to report earnings at approximately 4:15 PM ET on Tuesday, January 28, 2020. The consensus earnings estimate is $0.31 per share on revenue of $2.10 billion and the Earnings Whisper ® number is $0.32 per share. Investor sentiment going into the company's earnings release has 71% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 287.50% with revenue increasing by 47.99%. Short interest has decreased by 34.0% since the company's last earnings release while the stock has drifted higher by 52.9% from its open following the earnings release to be 48.5% above its 200 day moving average of $33.91. Overall earnings estimates have been unchanged since the company's last earnings release. On Thursday, January 9, 2020 there was some notable buying of 16,799 contracts of the $60.00 call expiring on Friday, February 21, 2020. Option traders are pricing in a 9.7% move on earnings and the stock has averaged a 10.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AMD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Amazon.com, Inc. -\n&gt; **Amazon.com, Inc. (AMZN)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, January 30, 2020. The consensus earnings estimate is $3.98 per share on revenue of $86.00 billion and the Earnings Whisper ® number is $4.15 per share. Investor sentiment going into the company's earnings release has 71% expecting an earnings beat The company's guidance was for revenue of $80.00 million to $86.00 million. Consensus estimates are for earnings to decline year-over-year by 35.18% with revenue increasing by 18.81%. Short interest has increased by 22.4% since the company's last earnings release while the stock has drifted higher by 9.7% from its open following the earnings release to be 2.0% above its 200 day moving average of $1,824.47. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, January 21, 2020 there was some notable buying of 1,348 contracts of the $1,862.50 put expiring on Friday, January 31, 2020. Option traders are pricing in a 4.5% move on earnings and the stock has averaged a 3.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AMZN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Microsoft Corp. $165.04\n&gt; **Microsoft Corp. (MSFT)** is confirmed to report earnings at approximately 4:10 PM ET on Wednesday, January 29, 2020. The consensus earnings estimate is $1.32 per share on revenue of $35.69 billion and the Earnings Whisper ® number is $1.38 per share. Investor sentiment going into the company's earnings release has 87% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 20.00% with revenue increasing by 9.91%. Short interest has increased by 18.2% since the company's last earnings release while the stock has drifted higher by 18.9% from its open following the earnings release to be 18.6% above its 200 day moving average of $139.21. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, January 14, 2020 there was some notable buying of 11,176 contracts of the $165.00 call expiring on Friday, April 17, 2020. Option traders are pricing in a 4.0% move on earnings and the stock has averaged a 2.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MSFT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Facebook Inc. $217.94\n&gt; **Facebook Inc. (FB)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, January 29, 2020. The consensus earnings estimate is $2.51 per share on revenue of $20.83 billion and the Earnings Whisper ® number is $2.63 per share. Investor sentiment going into the company's earnings release has 83% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 5.46% with revenue increasing by 23.15%. Short interest has increased by 2.4% since the company's last earnings release while the stock has drifted higher by 10.8% from its open following the earnings release to be 14.2% above its 200 day moving average of $190.86. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, January 14, 2020 there was some notable buying of 9,443 contracts of the $200.00 put expiring on Friday, February 7, 2020. Option traders are pricing in a 5.8% move on earnings and the stock has averaged a 7.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FB&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Boeing Co. $323.05\n&gt; **Boeing Co. (BA)** is confirmed to report earnings at approximately 7:30 AM ET on Wednesday, January 29, 2020. The consensus earnings estimate is $1.73 per share on revenue of $21.67 billion and the Earnings Whisper ® number is $1.40 per share. Investor sentiment going into the company's earnings release has 2% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 68.43% with revenue decreasing by 23.54%. Short interest has increased by 8.9% since the company's last earnings release while the stock has drifted lower by 6.4% from its open following the earnings release to be 8.7% below its 200 day moving average of $353.77. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, January 24, 2020 there was some notable buying of 7,609 contracts of the $330.00 call expiring on Friday, January 31, 2020. Option traders are pricing in a 5.0% move on earnings and the stock has averaged a 2.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# General Electric Co. $11.71\n&gt; **General Electric Co. (GE)** is confirmed to report earnings at approximately 6:00 AM ET on Wednesday, January 29, 2020. The consensus earnings estimate is $0.18 per share on revenue of $26.16 billion and the Earnings Whisper ® number is $0.20 per share. Investor sentiment going into the company's earnings release has 70% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 14.29% with revenue decreasing by 21.39%. Short interest has decreased by 24.1% since the company's last earnings release while the stock has drifted higher by 19.7% from its open following the earnings release to be 15.0% above its 200 day moving average of $10.18. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, January 13, 2020 there was some notable buying of 18,933 contracts of the $11.00 call expiring on Friday, February 21, 2020. Option traders are pricing in a 7.2% move on earnings and the stock has averaged a 6.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=GE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Mastercard Inc $323.67\n&gt; **Mastercard Inc (MA)** is confirmed to report earnings at approximately 8:00 AM ET on Wednesday, January 29, 2020. The consensus earnings estimate is $1.87 per share on revenue of $4.39 billion and the Earnings Whisper ® number is $1.89 per share. Investor sentiment going into the company's earnings release has 81% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 20.65% with revenue increasing by 15.31%. Short interest has increased by 12.0% since the company's last earnings release while the stock has drifted higher by 16.6% from its open following the earnings release to be 18.7% above its 200 day moving average of $272.70. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, January 15, 2020 there was some notable buying of 2,162 contracts of the $200.00 put expiring on Friday, January 15, 2021. Option traders are pricing in a 3.5% move on earnings and the stock has averaged a 2.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# AT&amp;T Corp. $38.50\n&gt; **AT&amp;T Corp. (T)** is confirmed to report earnings at approximately 6:50 AM ET on Wednesday, January 29, 2020. The consensus earnings estimate is $0.87 per share on revenue of $46.97 billion and the Earnings Whisper ® number is $0.88 per share. Investor sentiment going into the company's earnings release has 63% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 1.16% with revenue decreasing by 2.13%. The stock has drifted higher by 0.5% from its open following the earnings release to be 8.0% above its 200 day moving average of $35.63. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, January 8, 2020 there was some notable buying of 5,621 contracts of the $42.00 call expiring on Friday, April 17, 2020. Option traders are pricing in a 3.9% move on earnings and the stock has averaged a 4.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=T&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/StockMarket.",
        "subreddit": "StockMarket",
        "title": "Stock Market Week Ahead for the trading week beginning January 27th, 2020",
        "url": "https://www.reddit.com/r/StockMarket/comments/etub2m/stock_market_week_ahead_for_the_trading_week/",
        "created": 1580005053.0
    },
    {
        "author": "Alauer16",
        "created_utc": 1580343651,
        "id": "evw6of",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Seriously, this company is killing it and up 6.3% AH on earnings and guidance beats.",
        "subreddit": "wallstreetbets",
        "title": "Can we get some appreciation for $LRCX?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/evw6of/can_we_get_some_appreciation_for_lrcx/",
        "created": 1580372451.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1579976615,
        "id": "etudy3",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Good Saturday afternoon to all of you here on r/stocks. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning January 27th, 2020.\n\n# **After virus scare, markets look to Fed rate policy to keep stock rally going  - [(Source)](https://www.cnbc.com/2020/01/24/after-virus-scare-markets-look-to-fed-rate-policy-to-keep-rally-going.html)**\n*****\n&gt; With stocks coming off their first losing week of the year, investors will be looking for the Federal Reserve to soothe markets by reaffirming its position that interest rates will be low for a long time into the future.\n*****\n&gt; The outbreak of the coronavirus in China in the past week took the steam out of a market that has been repeatedly rallying to new highs since December. The S&amp;P 500 fell just about 1% for the week, amid fears the virus could lead to slower growth not only in China, but across the globe.\n*****\n&gt; Those concerns could continue to spook markets in the coming week, but stocks should be buffeted by the Fed’s anticipated commitment to low rates and its current Treasury bill buying program. The Fed meets Tuesday and Wednesday. Fed Chairman Jerome Powell is expected to emphasize that the Fed remains on a neutral policy path and that would only change if there was a significant change in the economic outlook.\n*****\n&gt; There are also some major earnings reports, including from Apple, which hit an all-time high Friday morning before closing lower with the broader market. It could have a big impact on sentiment and help influence trading across the technology sector.\n*****\n&gt; Stocks were choppy in the past week, and Treasury yields have been sinking on worries about the new virus. The 10-year yield sunk to a Nov. 1 low of 1.68% and investors drove gold prices higher in a flight-to-safety trade.\n*****\n&gt; “It’s overshadowing everything, and what the market is looking for is that the Chinese are containing it, and the spread is minimal,” said Quincy Krosby, chief market strategist at Prudential Financial. “The derivative of all of this is what does it do to growth? Traders and investors are hoping the stimulus that has been introduced into the Chinese economy is going to take hold, and this is not going to halt that turnaround.”\n*****\n&gt; Krosby said the market has been looking for an excuse to pull back. The S&amp;P 500 ended the week at 3,295, off 1%, but it is still up about 2% for the year so far.\n*****\n&gt; “You could see going into the weekend the 10-year Treasury yield is down, gold is higher, the market is in a text book defensive state,” said Krosby. “We had a market that was poised for a bout of profit-taking and this is it.”\n*****\n&gt; # Earnings roll out\n&gt; There are more than 135 S&amp;P companies reporting earnings in the week ahead, with a heavy focus on technology, industrials and consumer stocks. Apple reports Tuesday, and Microsoft and Facebook are Wednesday. Boeing and General Electric report Wednesday, while McDonald’s releases results Wednesday. On Friday, big oil reports with ExxonMobil and Chevron expected.\n*****\n&gt; Earnings reports so far have been mostly better than expected, with 68.2% of companies beating earnings per share estimates, according to Refinitiv. Earnings are expected to be down about a half percent for the fourth quarter, based on actual reports and estimates of companies yet to report.\n*****\n&gt; “Coming into any earnings season with stocks at all time highs is fraught with peril,” said Art Hogan, chief market strategist at National Securities. “It’s precarious because you have the opportunity for outsized moves if you miss earnings, revenues or guidance.”\n*****\n&gt; Hogan said companies may be able to give a better indication of the future, now that there’s a first phase trade deal between the U.S. and China. He said markets will also be looking for guidance from China and elsewhere on whether the virus appears to be containable or not.\n*****\n&gt;#  Fed is big story but won’t say much\nThe Federal Reserve is not likely to say much has changed in its outlook, except that it’s last three interest rate cuts may have helped the economy and financial conditions.\n*****\n&gt; “The big news is just talk on the balance sheet. I think that’s going to be the key messaging,” said Jim Caron, portfolio strategist at Morgan Stanley Investment Management. “I think the data has been okay. There’s really nothing new there. The only thing that’s really new or interesting is going to be what’s going on with the balance sheet.”\n*****\n&gt; The Fed has been buying about $60 billion in Treasury bills each month to expand its balance sheet, ending a program where it was shrinking the balance sheet. The Fed is adding reserves to end a problem in the repo market, which is basically the plumbing of the financial markets where institutions go to get short term cash.\n*****\n&gt; Many traders believe the program is adding liquidity to markets, and therefore driving investors into stocks.\n*****\n&gt; Mark Cabana, head of short rate strategy at BofA Securiteis, said the Fed is not changing its benchmark fed funds target rate, but the fixed income market has been expecting the Fed to make a technical adjustment to another rate. He said the fed funds rate, trading at about 1.55%, has come to the lower end of the Fed’s target range of 1.5 to 1.75%.\n*****\n&gt; For that reason it is likely to raise the interest rate on excess reserves by five basis points. “The intent is to affirm the bottom end of the Fed’s target range, ” he said.\n*****\n&gt; Besides the technical move, they “may be will provide a little more guidance on what it would take to vote rates one way or the other,” he said.\n*****\n&gt; # Economic data\n&gt; There’s an important data calendar in the coming week, including the first look at the fourth quarter’s gross domestic product on Thursday. Personal income and spending data is Friday, and that includes the personal consumption expenditure inflation deflator, watched by the Fed.\n*****\n&gt; New home sales could continue the string of positive news in housing, when they are released Monday, and there are durable goods Tuesday.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/Jh9TsGk.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/PC0Wzg3.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/HbDh9Vc.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/mbOqHih.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/vvAjRp1.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/H2E0IGA.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/EzxkRa0.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/D9nkFqV.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/BhyYBqu.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/ueyg2Ui.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/xc2z54D.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/mFxq4a0.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/XjxVPqW.png))**\n###### **([CLICK HERE FOR THE CHART LINK #4!](https://i.imgur.com/uiduXrQ.png))**\n\n*****\n\n# February Almanac: Weak Link in Best Six Months\n\n&gt; Even though February is right in the middle of the Best Six Months, its long-term track record, since 1950, is rather tepid. February ranks no better than sixth and has posted meager average gains except for the Russell 2000. Small cap stocks, benefiting from “January Effect” carry over; tend to outpace large cap stocks in February. The Russell 2000 index of small cap stocks turns in an average gain of 1.2% in February since 1979—just the sixth best month for that benchmark.\n\n&gt; A strong February in 2000 boosts NASDAQ and Russell 2000 rankings in election years. Otherwise, February’s performance, compared to other presidential-election-year months, is mediocre at best with no large-cap index ranked better than seventh (DJIA and S&amp;P 500 since 1950, Russell 1000 since 1979).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/9e34d983528dd8ba9318507afe5ab487/adc248f00c22c241-e9/s400x600/89582e679e67bdacb47f14034f5988f808a89164.jpg))**\n\n*****\n\n# Solid January Starts Not Rare, February Could Be Tepid\n\n&gt; Bullish sentiment is running high and why not. A new decade has begun, January has been bucking the recent trend of volatile performance and the market is trading at or near all-time record highs. Big round numbers like 29000, 3300 and 9000 are also emotionally satisfying. Our Santa Claus Rally and First Five Days indicators were both positive and the market is well on its way to completing a historically bullish January Trifecta. A positive January Barometer is all that remains to complete the January Trifecta.\n\n&gt; As of yesterday’s close DJIA was up 2.3% year-to-date. S&amp;P 500 was up 2.79% and NASDAQ stood at 4.44%. Although these gains are above average, they are actually not all that uncommon by the thirteenth trading day of the New Year. Since 1901 (119 years), DJIA has been up 2.3% or more on the thirteenth trading day 33 times before this year. DJIA’s largest gain on the thirteenth trading day was 11.4% in 1976 (+17.9% for the full-year). S&amp;P 500 has equaled or exceeded 2.79% on the thirteenth trading day 26 times since 1930 while NASDAQ has bested 4.44% 15 times since 1971. Depending on index, gains equal to or greater than this year come about approximately once every 3.3 to 3.6 years. 2012 was the last election year where all three indexes were up more on the thirteenth trading day than this year.\n\n&gt; In the following Seasonal Patten Charts of DJIA, S&amp;P 500 and NASDAQ, we compare 2020 (as of yesterday’s close) to All Years and Election Years. Here it is clear that the market has gotten off to a solid start with well above average gains so far. Throughout 2019, the market tracked its historical patterns quite closely which suggests some mean reversion could occur this February as the month has been historically tepid for DJIA and S&amp;P 500.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/40266be6ec0ea5254acf28b7b6d1382f/9bf6345fd07e4a41-a7/s500x750/adacad5fc51e44798ccb9e3f4f840aeb1cf88bad.jpg))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/64ed8994efe5e18c82cdb0e191844380/9bf6345fd07e4a41-00/s500x750/da09894ccf7e9c51f7a3814ee73a4a9e65fefeca.jpg))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/71145fa04257eb5aad5eec7945276aa7/9bf6345fd07e4a41-02/s500x750/48e6c017697fc7e130ffcdabcb46093f3c28522b.jpg))**\n\n*****\n\n# Another Look At Election Years\n\n&gt; Last week in our LPL Research blog, we took a closer look at how stocks have performed during an election year. We found that since 1940, the S&amp;P 500 Index hasn’t been lower during an election year when an incumbent president has been up for reelection.\n\n&gt; We’ve had many requests to look more into election years, so we thought we’d take another look at this impactful year.\n\n&gt; The S&amp;P 500’s track record for reelection years has been impressive, but its average path during these years has been quite interesting, as shown in the LPL Chart of the Day. In ten reelection years since 1950, the S&amp;P 500 on average has barely budged from February through June, before breaking out in the second half of the year.\n\n&gt; “Stocks actually have traded in a tight range from February through June during election years, with the big rally taking place during the second half of the year,” explained LPL Financial Senior Market Strategist Ryan Detrick.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/01/reelection-012220.jpg?ssl=1))**\n\n&gt; From a quarterly view, the S&amp;P 500 has historically posted modest returns in the four quarters of an election year, but the benchmark has been higher an impressive 82% of the time in the fourth quarter of all election years. That’s one of the best track records of any quarter in the four-year presidential cycle.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/01/quarterly-return-012220.png?ssl=1))**\n\n*****\n\n# Recession Watch Update\n\n&gt; As the economic expansion caps its first decade, we thought it’d be a good time to check on LPL Research’s leading indicators in our Recession Watch Dashboard.\n\n&gt; As you can see in our latest update and in the LPL Chart of the Day, the overall view hasn’t changed much. We believe we are in the later stages of this economic expansion, but we still see little threat of imminent recession. The current expansion is the longest on record, at 126 months, but the economy has grown at a slow and steady rate. We believe this measured pace, along with supportive fiscal policy, has contributed to this cycle’s continued durability.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/01/012120-recession-blog.png?ssl=1))**\n\n&gt; In the fourth quarter, the needle moved in different directions for two of our five forecasters:\n\n&gt; We removed the U.S. Treasury Yield Curve from On Watch status as the spread between the 3-month and 10-year yields moved back into positive territory. The spread between the 2-year and 10-year yields also climbed to an 18-month high following the Federal Reserve rate cuts. Going back to 1955, a yield curve inversion (long-term yields falling below short-term yields) has preceded each of the nine recessions. It’s important to note, however, that parts of the curve flickered between positive and inverted territory several times before the actual recession occurred.\n\n&gt; We added Market Valuations to On Watch status, as the S&amp;P 500 Index trailing price-to-earnings (P/E) ratio rose near cycle highs. The P/E ratio is now comfortably above our 2020 target of 18.75. With the S&amp;P 500 surpassing the upper end of our year-end fair value target of 3,300, we are watching closely to see if earnings growth is strong enough to justify these elevated valuations. The low interest-rate and inflation environment continue to be strong tailwinds for market valuations.\n\n&gt; “We remain optimistic of continued, albeit possibly slower, economic growth in the United States in the coming year, bolstered by recent progress on the U.S.-China trade deal,” said LPL Financial Chief Investment Strategist John Lynch. “While we continue to monitor the indicators closely, at the present time, we see only a modest chance of recession starting within the next year.”\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending January 24th, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED)\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 1.26.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$AAPL** \n&gt; * **$TSLA** \n&gt; * **$AMD** \n&gt; * **$AMZN** \n&gt; * **$MSFT** \n&gt; * **$FB** \n&gt; * **$BA** \n&gt; * **$GE** \n&gt; * **$MA** \n&gt; * **$T** \n&gt; * **$V** \n&gt; * **$SBUX** \n&gt; * **$PYPL** \n&gt; * **$MCD** \n&gt; * **$LMT** \n&gt; * **$MMM** \n&gt; * **$DHI** \n&gt; * **$PFE** \n&gt; * **$UTX** \n&gt; * **$KO** \n&gt; * **$UPS** \n&gt; * **$S** \n&gt; * **$NURO** \n&gt; * **$HMST** \n&gt; * **$VZ** \n&gt; * **$HCA** \n&gt; * **$XLNX** \n&gt; * **$ARNC** \n&gt; * **$XOM** \n&gt; * **$CAT** \n&gt; * **$BX** \n&gt; * **$PGR** \n&gt; * **$LRCX** \n&gt; * **$GD** \n&gt; * **$PHM** \n&gt; * **$NVR** \n&gt; * **$PII** \n&gt; * **$SALT** \n&gt; * **$BIIB** \n&gt; * **$NOW** \n&gt; * **$ANTM** \n&gt; * **$NUE** \n&gt; * **$ALK** \n&gt; * **$PLUG** \n&gt; * **$MPC**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/BhyYBqu.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/LryC0HR.png))**\n###### **([CLICK HERE FOR MOST ANTICIPATED EARNINGS RELEASES FOR THE NEXT 5 WEEKS!](https://i.imgur.com/UJ0XUOn.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 1.27.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/4WIKCya.png))\n\n&gt; # ***Monday 1.27.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ZqdHlAC.png))\n\n*****\n\n&gt; # ***Tuesday 1.28.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/uNAMC1F.png))\n\n&gt; # ***Tuesday 1.28.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/yyFyqKK.png))\n\n*****\n\n&gt; # ***Wednesday 1.29.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/nGue9UL.png))\n\n&gt; # ***Wednesday 1.29.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/D7CJT4Z.png))\n\n*****\n\n&gt; # ***Thursday 1.30.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/gAvYCNR.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/RKvojKG.png))\n\n&gt; # ***Thursday 1.30.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/1aQuGJs.png))\n\n*****\n\n&gt; # ***Friday 1.31.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/5YpKIPM.png))\n\n*****\n\n&gt; # ***Friday 1.31.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/r0KJmsx.png))\n\n*****\n\n# Apple, Inc. $318.31\n&gt; **Apple, Inc. (AAPL)** is confirmed to report earnings at approximately 4:30 PM ET on Tuesday, January 28, 2020. The consensus earnings estimate is $4.53 per share on revenue of $87.74 billion and the Earnings Whisper ® number is $4.80 per share. Investor sentiment going into the company's earnings release has 74% expecting an earnings beat The company's guidance was for earnings of $4.18 to $4.66 per share. Consensus estimates are for year-over-year earnings growth of 8.37% with revenue increasing by 4.07%. Short interest has decreased by 5.2% since the company's last earnings release while the stock has drifted higher by 28.7% from its open following the earnings release to be 39.6% above its 200 day moving average of $227.94. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, January 24, 2020 there was some notable buying of 10,425 contracts of the $320.00 call expiring on Friday, January 31, 2020. Option traders are pricing in a 5.4% move on earnings and the stock has averaged a 4.8% move in recent quarters.\n\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AAPL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Tesla, Inc. $564.82\n&gt; **Tesla, Inc. (TSLA)** is confirmed to report earnings at approximately 4:55 PM ET on Wednesday, January 29, 2020. The consensus earnings estimate is $2.03 per share on revenue of $6.99 billion and the Earnings Whisper ® number is $2.24 per share. Investor sentiment going into the company's earnings release has 43% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 6.84% with revenue decreasing by 3.26%. Short interest has decreased by 27.2% since the company's last earnings release while the stock has drifted higher by 87.7% from its open following the earnings release to be 100.1% above its 200 day moving average of $282.24. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, January 9, 2020 there was some notable buying of 12,168 contracts of the $700.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 12.8% move on earnings and the stock has averaged a 10.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TSLA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Advanced Micro Devices, Inc. $50.35\n&gt; **Advanced Micro Devices, Inc. (AMD)** is confirmed to report earnings at approximately 4:15 PM ET on Tuesday, January 28, 2020. The consensus earnings estimate is $0.31 per share on revenue of $2.10 billion and the Earnings Whisper ® number is $0.32 per share. Investor sentiment going into the company's earnings release has 71% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 287.50% with revenue increasing by 47.99%. Short interest has decreased by 34.0% since the company's last earnings release while the stock has drifted higher by 52.9% from its open following the earnings release to be 48.5% above its 200 day moving average of $33.91. Overall earnings estimates have been unchanged since the company's last earnings release. On Thursday, January 9, 2020 there was some notable buying of 16,799 contracts of the $60.00 call expiring on Friday, February 21, 2020. Option traders are pricing in a 9.7% move on earnings and the stock has averaged a 10.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AMD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Amazon.com, Inc. -\n&gt; **Amazon.com, Inc. (AMZN)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, January 30, 2020. The consensus earnings estimate is $3.98 per share on revenue of $86.00 billion and the Earnings Whisper ® number is $4.15 per share. Investor sentiment going into the company's earnings release has 71% expecting an earnings beat The company's guidance was for revenue of $80.00 million to $86.00 million. Consensus estimates are for earnings to decline year-over-year by 35.18% with revenue increasing by 18.81%. Short interest has increased by 22.4% since the company's last earnings release while the stock has drifted higher by 9.7% from its open following the earnings release to be 2.0% above its 200 day moving average of $1,824.47. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, January 21, 2020 there was some notable buying of 1,348 contracts of the $1,862.50 put expiring on Friday, January 31, 2020. Option traders are pricing in a 4.5% move on earnings and the stock has averaged a 3.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AMZN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Microsoft Corp. $165.04\n&gt; **Microsoft Corp. (MSFT)** is confirmed to report earnings at approximately 4:10 PM ET on Wednesday, January 29, 2020. The consensus earnings estimate is $1.32 per share on revenue of $35.69 billion and the Earnings Whisper ® number is $1.38 per share. Investor sentiment going into the company's earnings release has 87% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 20.00% with revenue increasing by 9.91%. Short interest has increased by 18.2% since the company's last earnings release while the stock has drifted higher by 18.9% from its open following the earnings release to be 18.6% above its 200 day moving average of $139.21. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, January 14, 2020 there was some notable buying of 11,176 contracts of the $165.00 call expiring on Friday, April 17, 2020. Option traders are pricing in a 4.0% move on earnings and the stock has averaged a 2.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MSFT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Facebook Inc. $217.94\n&gt; **Facebook Inc. (FB)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, January 29, 2020. The consensus earnings estimate is $2.51 per share on revenue of $20.83 billion and the Earnings Whisper ® number is $2.63 per share. Investor sentiment going into the company's earnings release has 83% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 5.46% with revenue increasing by 23.15%. Short interest has increased by 2.4% since the company's last earnings release while the stock has drifted higher by 10.8% from its open following the earnings release to be 14.2% above its 200 day moving average of $190.86. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, January 14, 2020 there was some notable buying of 9,443 contracts of the $200.00 put expiring on Friday, February 7, 2020. Option traders are pricing in a 5.8% move on earnings and the stock has averaged a 7.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FB&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Boeing Co. $323.05\n&gt; **Boeing Co. (BA)** is confirmed to report earnings at approximately 7:30 AM ET on Wednesday, January 29, 2020. The consensus earnings estimate is $1.73 per share on revenue of $21.67 billion and the Earnings Whisper ® number is $1.40 per share. Investor sentiment going into the company's earnings release has 2% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 68.43% with revenue decreasing by 23.54%. Short interest has increased by 8.9% since the company's last earnings release while the stock has drifted lower by 6.4% from its open following the earnings release to be 8.7% below its 200 day moving average of $353.77. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, January 24, 2020 there was some notable buying of 7,609 contracts of the $330.00 call expiring on Friday, January 31, 2020. Option traders are pricing in a 5.0% move on earnings and the stock has averaged a 2.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# General Electric Co. $11.71\n&gt; **General Electric Co. (GE)** is confirmed to report earnings at approximately 6:00 AM ET on Wednesday, January 29, 2020. The consensus earnings estimate is $0.18 per share on revenue of $26.16 billion and the Earnings Whisper ® number is $0.20 per share. Investor sentiment going into the company's earnings release has 70% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 14.29% with revenue decreasing by 21.39%. Short interest has decreased by 24.1% since the company's last earnings release while the stock has drifted higher by 19.7% from its open following the earnings release to be 15.0% above its 200 day moving average of $10.18. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, January 13, 2020 there was some notable buying of 18,933 contracts of the $11.00 call expiring on Friday, February 21, 2020. Option traders are pricing in a 7.2% move on earnings and the stock has averaged a 6.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=GE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Mastercard Inc $323.67\n&gt; **Mastercard Inc (MA)** is confirmed to report earnings at approximately 8:00 AM ET on Wednesday, January 29, 2020. The consensus earnings estimate is $1.87 per share on revenue of $4.39 billion and the Earnings Whisper ® number is $1.89 per share. Investor sentiment going into the company's earnings release has 81% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 20.65% with revenue increasing by 15.31%. Short interest has increased by 12.0% since the company's last earnings release while the stock has drifted higher by 16.6% from its open following the earnings release to be 18.7% above its 200 day moving average of $272.70. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, January 15, 2020 there was some notable buying of 2,162 contracts of the $200.00 put expiring on Friday, January 15, 2021. Option traders are pricing in a 3.5% move on earnings and the stock has averaged a 2.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# AT&amp;T Corp. $38.50\n&gt; **AT&amp;T Corp. (T)** is confirmed to report earnings at approximately 6:50 AM ET on Wednesday, January 29, 2020. The consensus earnings estimate is $0.87 per share on revenue of $46.97 billion and the Earnings Whisper ® number is $0.88 per share. Investor sentiment going into the company's earnings release has 63% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 1.16% with revenue decreasing by 2.13%. The stock has drifted higher by 0.5% from its open following the earnings release to be 8.0% above its 200 day moving average of $35.63. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, January 8, 2020 there was some notable buying of 5,621 contracts of the $42.00 call expiring on Friday, April 17, 2020. Option traders are pricing in a 3.9% move on earnings and the stock has averaged a 4.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=T&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/stocks.",
        "subreddit": "stocks",
        "title": "Stock Market Week Ahead for the trading week beginning January 27th, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/etudy3/stock_market_week_ahead_for_the_trading_week/",
        "created": 1580005415.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1579976833,
        "id": "etufpv",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Good Saturday afternoon to all of you here on r/smallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning January 27th, 2020.\n\n# **After virus scare, markets look to Fed rate policy to keep stock rally going  - [(Source)](https://www.cnbc.com/2020/01/24/after-virus-scare-markets-look-to-fed-rate-policy-to-keep-rally-going.html)**\n*****\n&gt; With stocks coming off their first losing week of the year, investors will be looking for the Federal Reserve to soothe markets by reaffirming its position that interest rates will be low for a long time into the future.\n*****\n&gt; The outbreak of the coronavirus in China in the past week took the steam out of a market that has been repeatedly rallying to new highs since December. The S&amp;P 500 fell just about 1% for the week, amid fears the virus could lead to slower growth not only in China, but across the globe.\n*****\n&gt; Those concerns could continue to spook markets in the coming week, but stocks should be buffeted by the Fed’s anticipated commitment to low rates and its current Treasury bill buying program. The Fed meets Tuesday and Wednesday. Fed Chairman Jerome Powell is expected to emphasize that the Fed remains on a neutral policy path and that would only change if there was a significant change in the economic outlook.\n*****\n&gt; There are also some major earnings reports, including from Apple, which hit an all-time high Friday morning before closing lower with the broader market. It could have a big impact on sentiment and help influence trading across the technology sector.\n*****\n&gt; Stocks were choppy in the past week, and Treasury yields have been sinking on worries about the new virus. The 10-year yield sunk to a Nov. 1 low of 1.68% and investors drove gold prices higher in a flight-to-safety trade.\n*****\n&gt; “It’s overshadowing everything, and what the market is looking for is that the Chinese are containing it, and the spread is minimal,” said Quincy Krosby, chief market strategist at Prudential Financial. “The derivative of all of this is what does it do to growth? Traders and investors are hoping the stimulus that has been introduced into the Chinese economy is going to take hold, and this is not going to halt that turnaround.”\n*****\n&gt; Krosby said the market has been looking for an excuse to pull back. The S&amp;P 500 ended the week at 3,295, off 1%, but it is still up about 2% for the year so far.\n*****\n&gt; “You could see going into the weekend the 10-year Treasury yield is down, gold is higher, the market is in a text book defensive state,” said Krosby. “We had a market that was poised for a bout of profit-taking and this is it.”\n*****\n&gt; # Earnings roll out\n&gt; There are more than 135 S&amp;P companies reporting earnings in the week ahead, with a heavy focus on technology, industrials and consumer stocks. Apple reports Tuesday, and Microsoft and Facebook are Wednesday. Boeing and General Electric report Wednesday, while McDonald’s releases results Wednesday. On Friday, big oil reports with ExxonMobil and Chevron expected.\n*****\n&gt; Earnings reports so far have been mostly better than expected, with 68.2% of companies beating earnings per share estimates, according to Refinitiv. Earnings are expected to be down about a half percent for the fourth quarter, based on actual reports and estimates of companies yet to report.\n*****\n&gt; “Coming into any earnings season with stocks at all time highs is fraught with peril,” said Art Hogan, chief market strategist at National Securities. “It’s precarious because you have the opportunity for outsized moves if you miss earnings, revenues or guidance.”\n*****\n&gt; Hogan said companies may be able to give a better indication of the future, now that there’s a first phase trade deal between the U.S. and China. He said markets will also be looking for guidance from China and elsewhere on whether the virus appears to be containable or not.\n*****\n&gt;#  Fed is big story but won’t say much\nThe Federal Reserve is not likely to say much has changed in its outlook, except that it’s last three interest rate cuts may have helped the economy and financial conditions.\n*****\n&gt; “The big news is just talk on the balance sheet. I think that’s going to be the key messaging,” said Jim Caron, portfolio strategist at Morgan Stanley Investment Management. “I think the data has been okay. There’s really nothing new there. The only thing that’s really new or interesting is going to be what’s going on with the balance sheet.”\n*****\n&gt; The Fed has been buying about $60 billion in Treasury bills each month to expand its balance sheet, ending a program where it was shrinking the balance sheet. The Fed is adding reserves to end a problem in the repo market, which is basically the plumbing of the financial markets where institutions go to get short term cash.\n*****\n&gt; Many traders believe the program is adding liquidity to markets, and therefore driving investors into stocks.\n*****\n&gt; Mark Cabana, head of short rate strategy at BofA Securiteis, said the Fed is not changing its benchmark fed funds target rate, but the fixed income market has been expecting the Fed to make a technical adjustment to another rate. He said the fed funds rate, trading at about 1.55%, has come to the lower end of the Fed’s target range of 1.5 to 1.75%.\n*****\n&gt; For that reason it is likely to raise the interest rate on excess reserves by five basis points. “The intent is to affirm the bottom end of the Fed’s target range, ” he said.\n*****\n&gt; Besides the technical move, they “may be will provide a little more guidance on what it would take to vote rates one way or the other,” he said.\n*****\n&gt; # Economic data\n&gt; There’s an important data calendar in the coming week, including the first look at the fourth quarter’s gross domestic product on Thursday. Personal income and spending data is Friday, and that includes the personal consumption expenditure inflation deflator, watched by the Fed.\n*****\n&gt; New home sales could continue the string of positive news in housing, when they are released Monday, and there are durable goods Tuesday.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/Jh9TsGk.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/PC0Wzg3.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/HbDh9Vc.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/mbOqHih.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/vvAjRp1.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/H2E0IGA.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/EzxkRa0.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/D9nkFqV.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/BhyYBqu.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/ueyg2Ui.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/xc2z54D.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/mFxq4a0.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/XjxVPqW.png))**\n###### **([CLICK HERE FOR THE CHART LINK #4!](https://i.imgur.com/uiduXrQ.png))**\n\n*****\n\n# February Almanac: Weak Link in Best Six Months\n\n&gt; Even though February is right in the middle of the Best Six Months, its long-term track record, since 1950, is rather tepid. February ranks no better than sixth and has posted meager average gains except for the Russell 2000. Small cap stocks, benefiting from “January Effect” carry over; tend to outpace large cap stocks in February. The Russell 2000 index of small cap stocks turns in an average gain of 1.2% in February since 1979—just the sixth best month for that benchmark.\n\n&gt; A strong February in 2000 boosts NASDAQ and Russell 2000 rankings in election years. Otherwise, February’s performance, compared to other presidential-election-year months, is mediocre at best with no large-cap index ranked better than seventh (DJIA and S&amp;P 500 since 1950, Russell 1000 since 1979).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/9e34d983528dd8ba9318507afe5ab487/adc248f00c22c241-e9/s400x600/89582e679e67bdacb47f14034f5988f808a89164.jpg))**\n\n*****\n\n# Solid January Starts Not Rare, February Could Be Tepid\n\n&gt; Bullish sentiment is running high and why not. A new decade has begun, January has been bucking the recent trend of volatile performance and the market is trading at or near all-time record highs. Big round numbers like 29000, 3300 and 9000 are also emotionally satisfying. Our Santa Claus Rally and First Five Days indicators were both positive and the market is well on its way to completing a historically bullish January Trifecta. A positive January Barometer is all that remains to complete the January Trifecta.\n\n&gt; As of yesterday’s close DJIA was up 2.3% year-to-date. S&amp;P 500 was up 2.79% and NASDAQ stood at 4.44%. Although these gains are above average, they are actually not all that uncommon by the thirteenth trading day of the New Year. Since 1901 (119 years), DJIA has been up 2.3% or more on the thirteenth trading day 33 times before this year. DJIA’s largest gain on the thirteenth trading day was 11.4% in 1976 (+17.9% for the full-year). S&amp;P 500 has equaled or exceeded 2.79% on the thirteenth trading day 26 times since 1930 while NASDAQ has bested 4.44% 15 times since 1971. Depending on index, gains equal to or greater than this year come about approximately once every 3.3 to 3.6 years. 2012 was the last election year where all three indexes were up more on the thirteenth trading day than this year.\n\n&gt; In the following Seasonal Patten Charts of DJIA, S&amp;P 500 and NASDAQ, we compare 2020 (as of yesterday’s close) to All Years and Election Years. Here it is clear that the market has gotten off to a solid start with well above average gains so far. Throughout 2019, the market tracked its historical patterns quite closely which suggests some mean reversion could occur this February as the month has been historically tepid for DJIA and S&amp;P 500.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/40266be6ec0ea5254acf28b7b6d1382f/9bf6345fd07e4a41-a7/s500x750/adacad5fc51e44798ccb9e3f4f840aeb1cf88bad.jpg))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/64ed8994efe5e18c82cdb0e191844380/9bf6345fd07e4a41-00/s500x750/da09894ccf7e9c51f7a3814ee73a4a9e65fefeca.jpg))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/71145fa04257eb5aad5eec7945276aa7/9bf6345fd07e4a41-02/s500x750/48e6c017697fc7e130ffcdabcb46093f3c28522b.jpg))**\n\n*****\n\n# Another Look At Election Years\n\n&gt; Last week in our LPL Research blog, we took a closer look at how stocks have performed during an election year. We found that since 1940, the S&amp;P 500 Index hasn’t been lower during an election year when an incumbent president has been up for reelection.\n\n&gt; We’ve had many requests to look more into election years, so we thought we’d take another look at this impactful year.\n\n&gt; The S&amp;P 500’s track record for reelection years has been impressive, but its average path during these years has been quite interesting, as shown in the LPL Chart of the Day. In ten reelection years since 1950, the S&amp;P 500 on average has barely budged from February through June, before breaking out in the second half of the year.\n\n&gt; “Stocks actually have traded in a tight range from February through June during election years, with the big rally taking place during the second half of the year,” explained LPL Financial Senior Market Strategist Ryan Detrick.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/01/reelection-012220.jpg?ssl=1))**\n\n&gt; From a quarterly view, the S&amp;P 500 has historically posted modest returns in the four quarters of an election year, but the benchmark has been higher an impressive 82% of the time in the fourth quarter of all election years. That’s one of the best track records of any quarter in the four-year presidential cycle.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/01/quarterly-return-012220.png?ssl=1))**\n\n*****\n\n# Recession Watch Update\n\n&gt; As the economic expansion caps its first decade, we thought it’d be a good time to check on LPL Research’s leading indicators in our Recession Watch Dashboard.\n\n&gt; As you can see in our latest update and in the LPL Chart of the Day, the overall view hasn’t changed much. We believe we are in the later stages of this economic expansion, but we still see little threat of imminent recession. The current expansion is the longest on record, at 126 months, but the economy has grown at a slow and steady rate. We believe this measured pace, along with supportive fiscal policy, has contributed to this cycle’s continued durability.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/01/012120-recession-blog.png?ssl=1))**\n\n&gt; In the fourth quarter, the needle moved in different directions for two of our five forecasters:\n\n&gt; We removed the U.S. Treasury Yield Curve from On Watch status as the spread between the 3-month and 10-year yields moved back into positive territory. The spread between the 2-year and 10-year yields also climbed to an 18-month high following the Federal Reserve rate cuts. Going back to 1955, a yield curve inversion (long-term yields falling below short-term yields) has preceded each of the nine recessions. It’s important to note, however, that parts of the curve flickered between positive and inverted territory several times before the actual recession occurred.\n\n&gt; We added Market Valuations to On Watch status, as the S&amp;P 500 Index trailing price-to-earnings (P/E) ratio rose near cycle highs. The P/E ratio is now comfortably above our 2020 target of 18.75. With the S&amp;P 500 surpassing the upper end of our year-end fair value target of 3,300, we are watching closely to see if earnings growth is strong enough to justify these elevated valuations. The low interest-rate and inflation environment continue to be strong tailwinds for market valuations.\n\n&gt; “We remain optimistic of continued, albeit possibly slower, economic growth in the United States in the coming year, bolstered by recent progress on the U.S.-China trade deal,” said LPL Financial Chief Investment Strategist John Lynch. “While we continue to monitor the indicators closely, at the present time, we see only a modest chance of recession starting within the next year.”\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending January 24th, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=IqUWzJw_T-Y))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 1.26.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=7HXyp_tGZDQ))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$AAPL** \n&gt; * **$TSLA** \n&gt; * **$AMD** \n&gt; * **$AMZN** \n&gt; * **$MSFT** \n&gt; * **$FB** \n&gt; * **$BA** \n&gt; * **$GE** \n&gt; * **$MA** \n&gt; * **$T** \n&gt; * **$V** \n&gt; * **$SBUX** \n&gt; * **$PYPL** \n&gt; * **$MCD** \n&gt; * **$LMT** \n&gt; * **$MMM** \n&gt; * **$DHI** \n&gt; * **$PFE** \n&gt; * **$UTX** \n&gt; * **$KO** \n&gt; * **$UPS** \n&gt; * **$S** \n&gt; * **$NURO** \n&gt; * **$HMST** \n&gt; * **$VZ** \n&gt; * **$HCA** \n&gt; * **$XLNX** \n&gt; * **$ARNC** \n&gt; * **$XOM** \n&gt; * **$CAT** \n&gt; * **$BX** \n&gt; * **$PGR** \n&gt; * **$LRCX** \n&gt; * **$GD** \n&gt; * **$PHM** \n&gt; * **$NVR** \n&gt; * **$PII** \n&gt; * **$SALT** \n&gt; * **$BIIB** \n&gt; * **$NOW** \n&gt; * **$ANTM** \n&gt; * **$NUE** \n&gt; * **$ALK** \n&gt; * **$PLUG** \n&gt; * **$MPC**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/BhyYBqu.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/LryC0HR.png))**\n###### **([CLICK HERE FOR MOST ANTICIPATED EARNINGS RELEASES FOR THE NEXT 5 WEEKS!](https://i.imgur.com/UJ0XUOn.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 1.27.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/4WIKCya.png))\n\n&gt; # ***Monday 1.27.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ZqdHlAC.png))\n\n*****\n\n&gt; # ***Tuesday 1.28.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/uNAMC1F.png))\n\n&gt; # ***Tuesday 1.28.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/yyFyqKK.png))\n\n*****\n\n&gt; # ***Wednesday 1.29.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/nGue9UL.png))\n\n&gt; # ***Wednesday 1.29.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/D7CJT4Z.png))\n\n*****\n\n&gt; # ***Thursday 1.30.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/gAvYCNR.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/RKvojKG.png))\n\n&gt; # ***Thursday 1.30.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/1aQuGJs.png))\n\n*****\n\n&gt; # ***Friday 1.31.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/5YpKIPM.png))\n\n*****\n\n&gt; # ***Friday 1.31.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/r0KJmsx.png))\n\n*****\n\n# Apple, Inc. $318.31\n&gt; **Apple, Inc. (AAPL)** is confirmed to report earnings at approximately 4:30 PM ET on Tuesday, January 28, 2020. The consensus earnings estimate is $4.53 per share on revenue of $87.74 billion and the Earnings Whisper ® number is $4.80 per share. Investor sentiment going into the company's earnings release has 74% expecting an earnings beat The company's guidance was for earnings of $4.18 to $4.66 per share. Consensus estimates are for year-over-year earnings growth of 8.37% with revenue increasing by 4.07%. Short interest has decreased by 5.2% since the company's last earnings release while the stock has drifted higher by 28.7% from its open following the earnings release to be 39.6% above its 200 day moving average of $227.94. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, January 24, 2020 there was some notable buying of 10,425 contracts of the $320.00 call expiring on Friday, January 31, 2020. Option traders are pricing in a 5.4% move on earnings and the stock has averaged a 4.8% move in recent quarters.\n\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AAPL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Tesla, Inc. $564.82\n&gt; **Tesla, Inc. (TSLA)** is confirmed to report earnings at approximately 4:55 PM ET on Wednesday, January 29, 2020. The consensus earnings estimate is $2.03 per share on revenue of $6.99 billion and the Earnings Whisper ® number is $2.24 per share. Investor sentiment going into the company's earnings release has 43% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 6.84% with revenue decreasing by 3.26%. Short interest has decreased by 27.2% since the company's last earnings release while the stock has drifted higher by 87.7% from its open following the earnings release to be 100.1% above its 200 day moving average of $282.24. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, January 9, 2020 there was some notable buying of 12,168 contracts of the $700.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 12.8% move on earnings and the stock has averaged a 10.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TSLA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Advanced Micro Devices, Inc. $50.35\n&gt; **Advanced Micro Devices, Inc. (AMD)** is confirmed to report earnings at approximately 4:15 PM ET on Tuesday, January 28, 2020. The consensus earnings estimate is $0.31 per share on revenue of $2.10 billion and the Earnings Whisper ® number is $0.32 per share. Investor sentiment going into the company's earnings release has 71% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 287.50% with revenue increasing by 47.99%. Short interest has decreased by 34.0% since the company's last earnings release while the stock has drifted higher by 52.9% from its open following the earnings release to be 48.5% above its 200 day moving average of $33.91. Overall earnings estimates have been unchanged since the company's last earnings release. On Thursday, January 9, 2020 there was some notable buying of 16,799 contracts of the $60.00 call expiring on Friday, February 21, 2020. Option traders are pricing in a 9.7% move on earnings and the stock has averaged a 10.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AMD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Amazon.com, Inc. -\n&gt; **Amazon.com, Inc. (AMZN)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, January 30, 2020. The consensus earnings estimate is $3.98 per share on revenue of $86.00 billion and the Earnings Whisper ® number is $4.15 per share. Investor sentiment going into the company's earnings release has 71% expecting an earnings beat The company's guidance was for revenue of $80.00 million to $86.00 million. Consensus estimates are for earnings to decline year-over-year by 35.18% with revenue increasing by 18.81%. Short interest has increased by 22.4% since the company's last earnings release while the stock has drifted higher by 9.7% from its open following the earnings release to be 2.0% above its 200 day moving average of $1,824.47. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, January 21, 2020 there was some notable buying of 1,348 contracts of the $1,862.50 put expiring on Friday, January 31, 2020. Option traders are pricing in a 4.5% move on earnings and the stock has averaged a 3.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AMZN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Microsoft Corp. $165.04\n&gt; **Microsoft Corp. (MSFT)** is confirmed to report earnings at approximately 4:10 PM ET on Wednesday, January 29, 2020. The consensus earnings estimate is $1.32 per share on revenue of $35.69 billion and the Earnings Whisper ® number is $1.38 per share. Investor sentiment going into the company's earnings release has 87% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 20.00% with revenue increasing by 9.91%. Short interest has increased by 18.2% since the company's last earnings release while the stock has drifted higher by 18.9% from its open following the earnings release to be 18.6% above its 200 day moving average of $139.21. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, January 14, 2020 there was some notable buying of 11,176 contracts of the $165.00 call expiring on Friday, April 17, 2020. Option traders are pricing in a 4.0% move on earnings and the stock has averaged a 2.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MSFT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Facebook Inc. $217.94\n&gt; **Facebook Inc. (FB)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, January 29, 2020. The consensus earnings estimate is $2.51 per share on revenue of $20.83 billion and the Earnings Whisper ® number is $2.63 per share. Investor sentiment going into the company's earnings release has 83% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 5.46% with revenue increasing by 23.15%. Short interest has increased by 2.4% since the company's last earnings release while the stock has drifted higher by 10.8% from its open following the earnings release to be 14.2% above its 200 day moving average of $190.86. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, January 14, 2020 there was some notable buying of 9,443 contracts of the $200.00 put expiring on Friday, February 7, 2020. Option traders are pricing in a 5.8% move on earnings and the stock has averaged a 7.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FB&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Boeing Co. $323.05\n&gt; **Boeing Co. (BA)** is confirmed to report earnings at approximately 7:30 AM ET on Wednesday, January 29, 2020. The consensus earnings estimate is $1.73 per share on revenue of $21.67 billion and the Earnings Whisper ® number is $1.40 per share. Investor sentiment going into the company's earnings release has 2% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 68.43% with revenue decreasing by 23.54%. Short interest has increased by 8.9% since the company's last earnings release while the stock has drifted lower by 6.4% from its open following the earnings release to be 8.7% below its 200 day moving average of $353.77. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, January 24, 2020 there was some notable buying of 7,609 contracts of the $330.00 call expiring on Friday, January 31, 2020. Option traders are pricing in a 5.0% move on earnings and the stock has averaged a 2.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# General Electric Co. $11.71\n&gt; **General Electric Co. (GE)** is confirmed to report earnings at approximately 6:00 AM ET on Wednesday, January 29, 2020. The consensus earnings estimate is $0.18 per share on revenue of $26.16 billion and the Earnings Whisper ® number is $0.20 per share. Investor sentiment going into the company's earnings release has 70% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 14.29% with revenue decreasing by 21.39%. Short interest has decreased by 24.1% since the company's last earnings release while the stock has drifted higher by 19.7% from its open following the earnings release to be 15.0% above its 200 day moving average of $10.18. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, January 13, 2020 there was some notable buying of 18,933 contracts of the $11.00 call expiring on Friday, February 21, 2020. Option traders are pricing in a 7.2% move on earnings and the stock has averaged a 6.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=GE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Mastercard Inc $323.67\n&gt; **Mastercard Inc (MA)** is confirmed to report earnings at approximately 8:00 AM ET on Wednesday, January 29, 2020. The consensus earnings estimate is $1.87 per share on revenue of $4.39 billion and the Earnings Whisper ® number is $1.89 per share. Investor sentiment going into the company's earnings release has 81% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 20.65% with revenue increasing by 15.31%. Short interest has increased by 12.0% since the company's last earnings release while the stock has drifted higher by 16.6% from its open following the earnings release to be 18.7% above its 200 day moving average of $272.70. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, January 15, 2020 there was some notable buying of 2,162 contracts of the $200.00 put expiring on Friday, January 15, 2021. Option traders are pricing in a 3.5% move on earnings and the stock has averaged a 2.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# AT&amp;T Corp. $38.50\n&gt; **AT&amp;T Corp. (T)** is confirmed to report earnings at approximately 6:50 AM ET on Wednesday, January 29, 2020. The consensus earnings estimate is $0.87 per share on revenue of $46.97 billion and the Earnings Whisper ® number is $0.88 per share. Investor sentiment going into the company's earnings release has 63% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 1.16% with revenue decreasing by 2.13%. The stock has drifted higher by 0.5% from its open following the earnings release to be 8.0% above its 200 day moving average of $35.63. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, January 8, 2020 there was some notable buying of 5,621 contracts of the $42.00 call expiring on Friday, April 17, 2020. Option traders are pricing in a 3.9% move on earnings and the stock has averaged a 4.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=T&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/smallstreetbets.",
        "subreddit": "smallstreetbets",
        "title": "Stock Market Week Ahead for the trading week beginning January 27th, 2020",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/etufpv/stock_market_week_ahead_for_the_trading_week/",
        "created": 1580005633.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1580131252,
        "id": "eunsx7",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/StockMarket sub! Welcome to the new trading week and a fresh start! Here are your pre-market news this AM-\n\n*****\n\n#(**[CLICK HERE TO VIEW THE FULL SOURCE!](https://www.stockaholics.net/threads/todays-pre-market-movers-news-monday-january-27th-2020.9390/)**)\n\n#[Today's Top Headlines for Monday, January 27th, 2020](https://www.cnbc.com/2020/01/27/dow-to-sink-kobe-bryant-remembered-and-wuhan-virus-spreads.html)\n\n* With the coronavirus spreading, world stocks are tumbling and perceived safer investments are rising. U.S. stock futures are sliding early Monday following Wall Street’s worst day of 2020 on Friday. The Dow already has a four-day losing streak in place, its longest since August, and is coming off its largest weekly loss in five months. The S&amp;P 500′s weekly decline last week was its largest in nearly four months. (CNBC)\n* Treasury yields move lower as coronavirus fears escalate (CNBC)\n* Gold climbs to 2-week high as virus fears spark safety buying (Reuters)\n* International oil prices drop below $60 as China virus drives demand concern (Reuters)\n* More than 2,800 people in China are now infected by the fast-spreading Wuhan coronavirus while more countries have reported their first confirmed cases. Chinese officials have said there are 2,862 confirmed cases, with the death toll rising to 81. On Sunday, the United States on Sunday reported its fifth confirmed case in Arizona. (CNBC)\n* Travel-related stocks are likely to be hit once again as coronavirus cases mount, including major airlines like United (UAL), Delta (DAL), American (AAL) and Southwest (LUV), and cruise line operators like Royal Caribbean (RCL), Norwegian (NCLH), and Carnival (CCL). Starbucks (SBUX) and McDonald’s have temporarily closed near the Chinese city of Wuhan.\n* On today’s U.S. economic calendar, the government will release its December report on new home sales at 10 a.m. ET. Arconic (ARNC), DR Horton (DH) and Sprint (S) are among the companies issuing quarterly earnings this morning, while Whirlpool (WHR), Juniper Networks (JNPR) and Rambus (RMBS) report after the bell.\n* Federal safety investigators launched a probe into a helicopter crash in the LA area that killed basketball legend Kobe Bryant and eight others, including his 13-year-old daughter, Gianna. The cause of the crash has not yet been determined. NBA athletes, officials and fans mourned Bryant’s death in messages and memorials across social media. (CNBC)\n* ‘Terrible,’ ‘heartbreaking,’ ‘devastated’ — World leaders and athletes mourn the death of Kobe Bryant (CNBC)\n* Athletes pay tribute to Kobe Bryant. ‘He was like a little brother to me’ Michael Jordan says (CNBC)\n* A passenger plane crashed in central Afghanistan, senior Afghan officials said today. According to local media, the plane went down in territory under Taliban control. It was initially reported to be a jet from state-owned Ariana Afghan Airlines. However, the airline’s acting CEO has denied that one of their planes has crashed. (CNBC)\n* President Donald Trump is expected to disclose details of his long-delayed Mideast peace proposal to Israeli leaders today. Trump will hold separate, back-to-back meetings with Israeli Prime Minister Benjamin Netanyahu and Benny Gantz, head of the centrist Blue and White Party. Gantz is Netanyahu’s rival in March 2 elections. (Reuters)\n* Trump’s impeachment trial enters a pivotal week as his defense team resumes its case and senators face a critical vote on whether to hear witnesses or proceed directly to a vote that is widely expected to end in his acquittal. The articles of impeachment charge Trump with abuse of power and obstruction of Congress. (AP)\n* Democrats stepped up their calls for former national security advisor John Bolton to testify at the trial after an explosive report alleged that in his unpublished book, he said Trump personally tied Ukraine aid to an investigation of the Bidens, an account that conflicts with the president’s. (NBC News)\n* Trump denies telling Bolton Ukraine aid was tied to investigations (The Hill)\n* Sen. Bernie Sanders holds an edge in the 2020 New Hampshire Democratic primary as the key presidential nominating contest nears, according to an NBC News/Marist poll. The Vermont senator garners the support of 22% of likely Democratic primary voters in the Granite State, the survey found. Ex-Mayor Pete Buttigieg trails at 17%. (CNBC)\n* Sen. Elizabeth Warren seeks spark in final Iowa push after getting Des Moines Register endorsement (AP)\n* U.S. state attorneys general will meet Justice Department attorneys next week to share information on their investigations into Google (GOOGL), Reuters reported. * The probes revolve around monopolistic behavior that may harm consumers through Google’s control of online advertising markets and search traffic.\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](https://finviz.com/futures.ashx)**)\n\n*****\n\n#LAST WEEK'S MARKET MAP:\n######(**[CLICK HERE FOR LAST WEEK'S MARKET MAP!](https://finviz.com/publish/012720/sec_all_w1_075397186.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#LAST WEEK'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR LAST WEEK'S S&amp;P SECTORS CHART!](https://i.imgur.com/6xYBiNo.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/g0O8Bke.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/mbOqHih.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/pT8VGHp.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n*($AAPL $TSLA $AMD $AMZN $MSFT $FB $BA $GE $MA $T $V $SBUX $PYPL $MCD $LMT $MMM $DHI $PFE $UTX $KO $UPS $S $NURO $HMST $VZ $HCA $XLNX $ARNC $XOM $CAT $BX $PGR $LRCX $GD $PHM $NVR $PII $SALT $BIIB $NOW $ANTM $NUE $ALK $PLUG $MPC)*\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/BhyYBqu.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n*($DHI $NURO $HMST $S $ARNC $NVR $SALT $BMRC $RDY $BOH $OPB $ARLP $PROV $NWBI)*\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/RExcdcI.jpg)**)\n\n*****\n\n#THIS AFTERNOON'S POST-MARKET EARNINGS CALENDAR:\n*()*\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS CALENDAR!]()**)\nT.B.A.\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/jPiSdVy.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/YRM412m.png)**)\nNONE.\n\n*****\n\n#FRIDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR FRIDAY'S UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/xc2z54D.png)**)\n######(**[CLICK HERE FOR FRIDAY'S UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/mFxq4a0.png)**)\n######(**[CLICK HERE FOR FRIDAY'S UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/XjxVPqW.png)**)\n######(**[CLICK HERE FOR FRIDAY'S UPGRADES/DOWNGRADES LINK #4!](https://i.imgur.com/uiduXrQ.png)**)\n\n*****\n\n#FRIDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR FRIDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/2nH33vr.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!](https://i.imgur.com/tXGwWol.png)**)\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS:\n\n* SPY\n* NNVC\n* BABA\n* QQQ\n* SPCE\n* TVIX\n* APT\n* ABBV\n* DJIA\n* DIA\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2020/01/27/stocks-making-the-biggest-moves-premarket-dr-horton-arconic-starbucks-boeing-more.html)**)\n\n*****\n\n&gt; **D.R. Horton (DHI)** – The homebuilder earned $1.16 per share for its fiscal first quarter, beating the consensus estimate of 92 cents a share. Revenue also topped forecasts. New orders were up 19% on a volume basis and up 22% in value. The company also raised the upper end of its full-year home sales forecast.\n\n&gt; #**STOCK SYMBOL:** DHI\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DHI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DHI)**)\n\n*****\n\n&gt; **Arconic (ARNC)** – Arconic missed estimates by a penny a share, with adjusted quarterly earnings of 53 cents per share. Revenue came in shy of Wall Street predictions. The maker of engineered metals products saw a 1% improvement in organic revenue on factors like favorable pricing and raw materials costs, partially offset by some weakness in its automotive and commercial transportation markets. Arconic also said it would complete its planned split of its aerospace components and aluminum rolling businesses into two companies on April 1.\n\n&gt; #**STOCK SYMBOL:** ARNC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ARNC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ARNC)**)\n\n*****\n\n&gt; **Travel-related stocks** – These are likely to be hit once again as coronavirus cases mount – including major airlines like United Airlines (UAL), Delta Air Lines (DAL), American Airlines (AAL), and Southwest (LUV), and cruise line operators like Royal Caribbean (RCL), Norwegian Cruise Line (NCLH), and Carnival Cruise Lines (CCL). Casino stocks like Wynn Resorts (WYNN) and Las Vegas Sands (LVS) are also being hit.\n\n&gt; #**STOCK SYMBOL:** UAL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=UAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/UAL)**)\n\n*****\n\n&gt; **Starbucks (SBUX)** – Starbucks has temporarily closed all its shots in China’s Hubei province and suspended delivery services, amid health concerns for customers and employees amid the spread of the coronavirus.\n\n&gt; #**STOCK SYMBOL:** SBUX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SBUX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SBUX)**)\n\n*****\n\n&gt; **Estee Lauder (EL)** – Oppenheimer downgraded the cosmetics maker to “perform” from “outperform.” The firm cited the stock’s premium valuation coupled with concerns about the coronavirus impact on a company that has seen China represent a key driver of recent growth.\n\n&gt; #**STOCK SYMBOL:** EL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=EL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/EL)**)\n\n*****\n\n&gt; **Boeing (BA)** – Boeing completed a successful maiden voyage of its 777-X jet over the weekend, a respite for the jet maker amid the ongoing grounding of its 737 Max jet.\n\n&gt; #**STOCK SYMBOL:** BA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BA)**)\n\n*****\n\n&gt; **AbbVie (ABBV)** – AbbVie sold a number of assets to Nestle and AstraZeneca (AZN), as it seeks to win regulatory approval for its $63 billion acquisition of drugmaker Allergan (AGN).\n\n&gt; #**STOCK SYMBOL:** ABBV\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ABBV&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ABBV)**)\n\n*****\n\n&gt; **Fiat Chrysler (FCAU)** – Fiat Chrysler filed court motions Friday to dismiss a lawsuit filed by rival automaker General Motors (GM). Fiat Chrysler said GM does not have sufficient grounds to bring a racketeering case that alleges bribery of union officials.\n\n&gt; #**STOCK SYMBOL:** FCAU\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=FCAU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/FCAU)**)\n\n*****\n\n&gt; **Kraft Heinz (KHC)** – Kraft Heinz CEO Miguel Patricio told The Wall Street Journal that he wants to food maker to make fewer but bigger bets on new products, as its older brands suffer a sales decline.\n\n&gt; #**STOCK SYMBOL:** KHC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=KHC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/KHC)**)\n\n*****\n\n&gt; **Alphabet (GOOGL)** – State attorneys general will meet with Justice Department officials to share investigative material involving Google, according to The Wall Street Journal.\n\n&gt; #**STOCK SYMBOL:** GOOGL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=GOOGL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/GOOGL)**)\n\n*****\n\n&gt; **Winnebago Industries (WGO)** – The RV maker was rated “overweight” in new coverage at KeyBanc, which sees recreational vehicle shipments stronger than consensus for 2020 and is also optimistic about the increasing benefits of Winnebago’s 2016 acquisition of towable vehicle maker Grand Design.\n\n&gt; #**STOCK SYMBOL:** WGO\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WGO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WGO)**)\n\n*****\n\n#**FULL DISCLOSURE:**\n\n&gt; /u/bigbear0083 has no positions in any stocks mentioned. Reddit, moderators, and the author do not advise making investment decisions based on discussion in these posts. Analysis is not subject to validation and users take action at their own risk. /u/bigbear0083 is an admin at the financial forums [Stockaholics.net](http://www.stockaholics.net/) where this content was originally posted.\n\n*****\n\n#**DISCUSS!**\n\nWhat is on everyone's radar for today's trading day ahead here at r/StockMarket?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Monday, January 27th, 2020! :)**",
        "subreddit": "StockMarket",
        "title": "Today's Pre-Market Movers &amp; News [Monday, January 27th, 2020]",
        "url": "https://www.reddit.com/r/StockMarket/comments/eunsx7/todays_premarket_movers_news_monday_january_27th/",
        "created": 1580160052.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1580131326,
        "id": "eunthk",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/stocks sub! Welcome to the new trading week and a fresh start! Here are your pre-market news this AM-\n\n*****\n\n#[Today's Top Headlines for Monday, January 27th, 2020](https://www.cnbc.com/2020/01/27/dow-to-sink-kobe-bryant-remembered-and-wuhan-virus-spreads.html)\n\n* With the coronavirus spreading, world stocks are tumbling and perceived safer investments are rising. U.S. stock futures are sliding early Monday following Wall Street’s worst day of 2020 on Friday. The Dow already has a four-day losing streak in place, its longest since August, and is coming off its largest weekly loss in five months. The S&amp;P 500′s weekly decline last week was its largest in nearly four months. (CNBC)\n* Treasury yields move lower as coronavirus fears escalate (CNBC)\n* Gold climbs to 2-week high as virus fears spark safety buying (Reuters)\n* International oil prices drop below $60 as China virus drives demand concern (Reuters)\n* More than 2,800 people in China are now infected by the fast-spreading Wuhan coronavirus while more countries have reported their first confirmed cases. Chinese officials have said there are 2,862 confirmed cases, with the death toll rising to 81. On Sunday, the United States on Sunday reported its fifth confirmed case in Arizona. (CNBC)\n* Travel-related stocks are likely to be hit once again as coronavirus cases mount, including major airlines like United (UAL), Delta (DAL), American (AAL) and Southwest (LUV), and cruise line operators like Royal Caribbean (RCL), Norwegian (NCLH), and Carnival (CCL). Starbucks (SBUX) and McDonald’s have temporarily closed near the Chinese city of Wuhan.\n* On today’s U.S. economic calendar, the government will release its December report on new home sales at 10 a.m. ET. Arconic (ARNC), DR Horton (DH) and Sprint (S) are among the companies issuing quarterly earnings this morning, while Whirlpool (WHR), Juniper Networks (JNPR) and Rambus (RMBS) report after the bell.\n* Federal safety investigators launched a probe into a helicopter crash in the LA area that killed basketball legend Kobe Bryant and eight others, including his 13-year-old daughter, Gianna. The cause of the crash has not yet been determined. NBA athletes, officials and fans mourned Bryant’s death in messages and memorials across social media. (CNBC)\n* ‘Terrible,’ ‘heartbreaking,’ ‘devastated’ — World leaders and athletes mourn the death of Kobe Bryant (CNBC)\n* Athletes pay tribute to Kobe Bryant. ‘He was like a little brother to me’ Michael Jordan says (CNBC)\n* A passenger plane crashed in central Afghanistan, senior Afghan officials said today. According to local media, the plane went down in territory under Taliban control. It was initially reported to be a jet from state-owned Ariana Afghan Airlines. However, the airline’s acting CEO has denied that one of their planes has crashed. (CNBC)\n* President Donald Trump is expected to disclose details of his long-delayed Mideast peace proposal to Israeli leaders today. Trump will hold separate, back-to-back meetings with Israeli Prime Minister Benjamin Netanyahu and Benny Gantz, head of the centrist Blue and White Party. Gantz is Netanyahu’s rival in March 2 elections. (Reuters)\n* Trump’s impeachment trial enters a pivotal week as his defense team resumes its case and senators face a critical vote on whether to hear witnesses or proceed directly to a vote that is widely expected to end in his acquittal. The articles of impeachment charge Trump with abuse of power and obstruction of Congress. (AP)\n* Democrats stepped up their calls for former national security advisor John Bolton to testify at the trial after an explosive report alleged that in his unpublished book, he said Trump personally tied Ukraine aid to an investigation of the Bidens, an account that conflicts with the president’s. (NBC News)\n* Trump denies telling Bolton Ukraine aid was tied to investigations (The Hill)\n* Sen. Bernie Sanders holds an edge in the 2020 New Hampshire Democratic primary as the key presidential nominating contest nears, according to an NBC News/Marist poll. The Vermont senator garners the support of 22% of likely Democratic primary voters in the Granite State, the survey found. Ex-Mayor Pete Buttigieg trails at 17%. (CNBC)\n* Sen. Elizabeth Warren seeks spark in final Iowa push after getting Des Moines Register endorsement (AP)\n* U.S. state attorneys general will meet Justice Department attorneys next week to share information on their investigations into Google (GOOGL), Reuters reported. * The probes revolve around monopolistic behavior that may harm consumers through Google’s control of online advertising markets and search traffic.\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](https://finviz.com/futures.ashx)**)\n\n*****\n\n#LAST WEEK'S MARKET MAP:\n######(**[CLICK HERE FOR LAST WEEK'S MARKET MAP!](https://finviz.com/publish/012720/sec_all_w1_075397186.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#LAST WEEK'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR LAST WEEK'S S&amp;P SECTORS CHART!](https://i.imgur.com/6xYBiNo.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/g0O8Bke.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/mbOqHih.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/pT8VGHp.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n*($AAPL $TSLA $AMD $AMZN $MSFT $FB $BA $GE $MA $T $V $SBUX $PYPL $MCD $LMT $MMM $DHI $PFE $UTX $KO $UPS $S $NURO $HMST $VZ $HCA $XLNX $ARNC $XOM $CAT $BX $PGR $LRCX $GD $PHM $NVR $PII $SALT $BIIB $NOW $ANTM $NUE $ALK $PLUG $MPC)*\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/BhyYBqu.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n*($DHI $NURO $HMST $S $ARNC $NVR $SALT $BMRC $RDY $BOH $OPB $ARLP $PROV $NWBI)*\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/RExcdcI.jpg)**)\n\n*****\n\n#THIS AFTERNOON'S POST-MARKET EARNINGS CALENDAR:\n*()*\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS CALENDAR!]()**)\nT.B.A.\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/jPiSdVy.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/YRM412m.png)**)\nNONE.\n\n*****\n\n#FRIDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR FRIDAY'S UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/xc2z54D.png)**)\n######(**[CLICK HERE FOR FRIDAY'S UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/mFxq4a0.png)**)\n######(**[CLICK HERE FOR FRIDAY'S UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/XjxVPqW.png)**)\n######(**[CLICK HERE FOR FRIDAY'S UPGRADES/DOWNGRADES LINK #4!](https://i.imgur.com/uiduXrQ.png)**)\n\n*****\n\n#FRIDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR FRIDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/2nH33vr.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!](https://i.imgur.com/tXGwWol.png)**)\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS:\n\n* SPY\n* NNVC\n* BABA\n* QQQ\n* SPCE\n* TVIX\n* APT\n* ABBV\n* DJIA\n* DIA\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2020/01/27/stocks-making-the-biggest-moves-premarket-dr-horton-arconic-starbucks-boeing-more.html)**)\n\n*****\n\n&gt; **D.R. Horton (DHI)** – The homebuilder earned $1.16 per share for its fiscal first quarter, beating the consensus estimate of 92 cents a share. Revenue also topped forecasts. New orders were up 19% on a volume basis and up 22% in value. The company also raised the upper end of its full-year home sales forecast.\n\n&gt; #**STOCK SYMBOL:** DHI\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DHI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DHI)**)\n\n*****\n\n&gt; **Arconic (ARNC)** – Arconic missed estimates by a penny a share, with adjusted quarterly earnings of 53 cents per share. Revenue came in shy of Wall Street predictions. The maker of engineered metals products saw a 1% improvement in organic revenue on factors like favorable pricing and raw materials costs, partially offset by some weakness in its automotive and commercial transportation markets. Arconic also said it would complete its planned split of its aerospace components and aluminum rolling businesses into two companies on April 1.\n\n&gt; #**STOCK SYMBOL:** ARNC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ARNC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ARNC)**)\n\n*****\n\n&gt; **Travel-related stocks** – These are likely to be hit once again as coronavirus cases mount – including major airlines like United Airlines (UAL), Delta Air Lines (DAL), American Airlines (AAL), and Southwest (LUV), and cruise line operators like Royal Caribbean (RCL), Norwegian Cruise Line (NCLH), and Carnival Cruise Lines (CCL). Casino stocks like Wynn Resorts (WYNN) and Las Vegas Sands (LVS) are also being hit.\n\n&gt; #**STOCK SYMBOL:** UAL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=UAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/UAL)**)\n\n*****\n\n&gt; **Starbucks (SBUX)** – Starbucks has temporarily closed all its shots in China’s Hubei province and suspended delivery services, amid health concerns for customers and employees amid the spread of the coronavirus.\n\n&gt; #**STOCK SYMBOL:** SBUX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SBUX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SBUX)**)\n\n*****\n\n&gt; **Estee Lauder (EL)** – Oppenheimer downgraded the cosmetics maker to “perform” from “outperform.” The firm cited the stock’s premium valuation coupled with concerns about the coronavirus impact on a company that has seen China represent a key driver of recent growth.\n\n&gt; #**STOCK SYMBOL:** EL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=EL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/EL)**)\n\n*****\n\n&gt; **Boeing (BA)** – Boeing completed a successful maiden voyage of its 777-X jet over the weekend, a respite for the jet maker amid the ongoing grounding of its 737 Max jet.\n\n&gt; #**STOCK SYMBOL:** BA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BA)**)\n\n*****\n\n&gt; **AbbVie (ABBV)** – AbbVie sold a number of assets to Nestle and AstraZeneca (AZN), as it seeks to win regulatory approval for its $63 billion acquisition of drugmaker Allergan (AGN).\n\n&gt; #**STOCK SYMBOL:** ABBV\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ABBV&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ABBV)**)\n\n*****\n\n&gt; **Fiat Chrysler (FCAU)** – Fiat Chrysler filed court motions Friday to dismiss a lawsuit filed by rival automaker General Motors (GM). Fiat Chrysler said GM does not have sufficient grounds to bring a racketeering case that alleges bribery of union officials.\n\n&gt; #**STOCK SYMBOL:** FCAU\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=FCAU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/FCAU)**)\n\n*****\n\n&gt; **Kraft Heinz (KHC)** – Kraft Heinz CEO Miguel Patricio told The Wall Street Journal that he wants to food maker to make fewer but bigger bets on new products, as its older brands suffer a sales decline.\n\n&gt; #**STOCK SYMBOL:** KHC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=KHC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/KHC)**)\n\n*****\n\n&gt; **Alphabet (GOOGL)** – State attorneys general will meet with Justice Department officials to share investigative material involving Google, according to The Wall Street Journal.\n\n&gt; #**STOCK SYMBOL:** GOOGL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=GOOGL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/GOOGL)**)\n\n*****\n\n&gt; **Winnebago Industries (WGO)** – The RV maker was rated “overweight” in new coverage at KeyBanc, which sees recreational vehicle shipments stronger than consensus for 2020 and is also optimistic about the increasing benefits of Winnebago’s 2016 acquisition of towable vehicle maker Grand Design.\n\n&gt; #**STOCK SYMBOL:** WGO\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WGO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WGO)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat is on everyone's radar for today's trading day ahead here at r/stocks?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Monday, January 27th, 2020! :)**",
        "subreddit": "stocks",
        "title": "Today's Pre-Market Movers &amp; News [Monday, January 27th, 2020]",
        "url": "https://www.reddit.com/r/stocks/comments/eunthk/todays_premarket_movers_news_monday_january_27th/",
        "created": 1580160126.0
    }
]