[
    {
        "author": "rangersfan1717",
        "created_utc": 1587291627,
        "id": "g45ffh",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Relatively new stock investor and am 22 years old. I have 22 different holdings at the moment, and I feel like 12-18 is the ideal range to shoot for based on what I've seen around here and other sites. Thoughts on whether I should sell any of these to consolidate? Primarily long term investor (5-10 year+)\n\nAAPL, GOOG, MSFT, AMD, ENPH, SEDG, FTNT, AMZN, CHGG, TTWO, CHE, ALXN, VEEV, VRTX, MDT, ISRG, COST, LULU, ADBE, BIIB, EQIX, TMO\n\nAlso have about 15% in a S&amp;P ETF\n\nI tried picking stocks primarily on strong balance sheets and financials. Any I should consolidate? Atm, I'm thinking to drop ALXN and maybe TTWO. Thanks!",
        "subreddit": "stocks",
        "title": "Do I own too many different stocks?",
        "url": "https://www.reddit.com/r/stocks/comments/g45ffh/do_i_own_too_many_different_stocks/",
        "created": 1587320427.0
    },
    {
        "author": "L3G4L_4SS4SSIN",
        "created_utc": 1587125668,
        "id": "g30uez",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "I have bought mostly all of the companies I aimed to get. My goal is to hold long term (10-15 years) and push for capital appreciation. I’m only 20 years old so have plenty of time to hold. \n\nMy portfolio consists of mainly blue chip companies with some other small gambles. I would like my last investment to be in a promising/strong stock so I’ve narrowed it down to these :\n\nMicrosoft - Rock solid stock with a good dividend history but could lack the capital growth I might be after.\n\nDisney - Significantly below pre-Covid value but has a while to go before the parks/full revenue streams open up. Launch of D+ has been okay so far but Netflix is still the king of streaming.\n\nNvidia - Riskier stock but has a lot of potential with popular and strong products. Expensive though. \n\nFortinet - Key provider of cyber security and this area is only going to get more needed with all this tech. Again riskier though.\n\nAMD - Hear a lot about this possibly promising stock but is it all speculation? Could the bubble burst? \n\nI’m open to any feedback, suggestions and criticism is encouraged!",
        "subreddit": "stocks",
        "title": "Last Piece of the Portfolio!",
        "url": "https://www.reddit.com/r/stocks/comments/g30uez/last_piece_of_the_portfolio/",
        "created": 1587154468.0
    },
    {
        "author": "TorpCat",
        "created_utc": 1588057938,
        "id": "g9iigz",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Currently I am looking at stocks in the cybersecurity sector ( FTNT and PANW ) as cybersecurity will become much more important with 5g &amp; an increased usage of cloud services. \n\nMy Question : what is your opinion on this sector and are you eyeing any stocks in particular, if so why?",
        "subreddit": "stocks",
        "title": "Cybersecurity",
        "url": "https://www.reddit.com/r/stocks/comments/g9iigz/cybersecurity/",
        "created": 1588086738.0
    },
    {
        "author": "counterfeittheory",
        "created_utc": 1588446345,
        "id": "gcbwpz",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Thoughts on MRO? \n\nChesapeake is going BR. MRO CO’s taking pay cuts through December to offset op’s costs. IMO, strong company with solid financial history. At &lt; $6 no where to go but up, and with dividends.",
        "subreddit": "stocks",
        "title": "Marathon",
        "url": "https://www.reddit.com/r/stocks/comments/gcbwpz/marathon/",
        "created": 1588475145.0
    }
]