[
    {
        "author": "strongest_nerd",
        "created_utc": 1592852718,
        "id": "hdyjqg",
        "num_comments": 41,
        "num_crossposts": 0,
        "selftext": "I made a giant post about this stock and the auto-mod deleted it, so I'm not going to put effort in, but if my post had gone through and you had invested you would be up 30% right now.\n\nThe calls are still pretty cheap, and this is a great stock that will very likely go above $100 before 7/17. The company has a great balance sheet, some very high profile customers, and they will benefit greatly from the 5G craze these boomers have right now.\n\n&amp;#x200B;\n\nJoin me for free tendies. $TER 7/17 $100c.",
        "subreddit": "smallstreetbets",
        "title": "$TER 7/17 $100 calls.",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/hdyjqg/ter_717_100_calls/",
        "created": 1592881518.0
    },
    {
        "author": "inthegreen07",
        "created_utc": 1592795533,
        "id": "hdk654",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "Built my bankroll swing trading and now it’s time to settle down and transfer my investments for the long haul. Love companies like NET, MSFT, DIS, RTX, DKNG, SHOP, TELSA. This would be my goal high risk high reward portfolio. \n\nI’ve always been anti ETF, seems like they never move and even if their biggest holdings do well they can go down.\n\nWell I cashed out my holdings in my trading app and am transferring to my big boy portfolio. Here are my holdings. \n\nFirst off screw spy and voo. Boring\n\nI went sectors I was interested in for example I love DraftKings and NET but who knows if the competition comes out of nowhere and eats them up. So let’s go with BETZ and WCLD\n\nSo here’s my ETFs I’ll be buying into and some of their top holdings.\n\nBUYZ- AMZN, SHOP, SE, BABA, Mercado\nOnline shopping if the future\n\nWCLD- Fastly, ZM, DDOG, DOCU, Wix\nEverything will be on the cloud \n\nBETZ- GAN, DKNG, Flutter, PENN\nIt’s like investing in alcohol during the prohibition \n\nXNTK- Telsa, SHOP, AMZN, AMD, Activison, NVDA\nWho doesn’t love those companies futures \n\nARKW- TSLA, SQ, PINS, ROKU\nYou had me at Telsa and square leading an ETF\n\nARKQ- TSLA, 2U, Autodesk, Teradyne\nIf telsa doesn’t moon one of these next gen stocks will\n\nQCLN- TSLA and bunch of clean energy stocks\nShut up I like telsa and oil will go dry eventually right?\n\nIETC - Microsoft, Apple , FB, google\nThis was my favorite MSFT heavy etf\n\nPPA- RTX, Lockheed, Honeywell, BA\nDefense stock of choice\n\nFDIS- AMZN, HD, Nike, telsa, McDonald’s \n30% Amazon\n\nPEJ- chipotle, DIS, PENN, LUV\nFavorite Disney etf (IYC gets a shoutout here)\n\nSHE- PayPal, V, MA, Gilead, HD\nMy banking etf with the most interesting holdings \n\nGERM- covid ETF\nI always wanted to invest in the cure(it’s in here) \n\nPW- my REIT, holds greenhouses for solar energy and marijuana. And railroads. None of which will be affected much when people can’t pay mortgage or start working from home.\n\nI went out of the box, some of these ETFs aren’t priced super high and make it easier for me to keep adding to positions. I think the total holdings were very unique that help with the potential.",
        "subreddit": "stocks",
        "title": "Making the switch to ETFs... here are my potential holdings. Let’s find gold",
        "url": "https://www.reddit.com/r/stocks/comments/hdk654/making_the_switch_to_etfs_here_are_my_potential/",
        "created": 1592824333.0
    },
    {
        "author": "billiebol",
        "created_utc": 1592715442,
        "id": "hd116w",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "Looking at SE, FSLY, DDOG, TER, CRWD, AYX, amongst others. Some of these like DDOG have gone steadily up. I remember looking at this one when it was $40 and now it has more than doubled. This is my evaluation if this sector of tech/cloud/data/mobile is worth it to get into now.\n\nThe good: \n\nThey are not impacted by COVID, no risk of second wave drops, no risk of bankruptcy. You can sleep better too.\n\nWe can expect them to continue to grow, to some degree, as tech grows in value over time, same as it has in the last decade. I'm expecting no reversal of this trend.\n\nThe risk:\n\nSince they are safer might be overbought and in a bubble to some degree. This might impact medium term returns.\n\nOnce life goes back to normal, the stocks that have seen heavy drops could be expected to significantly outperform over the small/medium term. Imagine REITs, retail, shipping, cruise lines etc going back to 80% of their pre-COVID values.",
        "subreddit": "stocks",
        "title": "Investing in cloud/data/mobile worth it or not",
        "url": "https://www.reddit.com/r/stocks/comments/hd116w/investing_in_clouddatamobile_worth_it_or_not/",
        "created": 1592744242.0
    },
    {
        "author": "vofsi",
        "created_utc": 1591490664,
        "id": "gy2mnq",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Hello Community,\n\nI'm new in the investing world and I really need to hear some of your opinion and comments. Maybe some advice? Regarding my draft portfolio that I'm constructing\n\nHere is a break down\n\nMy Draft Portfolio\n\nZAG 15% VFV 35% VRE 15%  XIC 15% \n\nVIU ??% OR  VGRO ??% OR 20% Individual Dividend Stock -&gt; still not sure.\n\nI'm just starting out 25 y/o and really overwhelmed with the investing world. I had an actively managed portfolio from the Bank for 2 years and really didn't pay much attention I just continue my monthly contribution of 10% of my income not knowing any of the MER stuff. (I'm stupid sorry)\n\nMER + TER 1.97% ( T\\_T )\n\nSo I decided to check out -  [https://canadiancouchpotato.com/](https://canadiancouchpotato.com/)  with so many articles to read I'm kind lost. \n\nI do understand some fundamentals such as \n\nDiversification - Do NOT put your eggs in one basket.\n\nMaximize TFSA RRSP (I have a lot of room)\n\nTime horizon (20+ years)\n\nEmotional Stress (looking to do a set it and forget it)\n\nMonthly Contribution (I'm confident with this) Income = Expenses + Investment(retirement+Big purchase) I have no debt \n\nCompound Interest (let the money work for you)\n\nI'm using WST so no commission fees. \n\nThank you in advance!",
        "subreddit": "CanadianInvestor",
        "title": "Please criticize my investment ETF portfolio (Seeking advise)",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/gy2mnq/please_criticize_my_investment_etf_portfolio/",
        "created": 1591519464.0
    },
    {
        "author": "ghostinthetree",
        "created_utc": 1592668062,
        "id": "hcofxo",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "I'm interested in IITU due to relatively low TER (0.15%) &amp; tech holdings. However, it only includes information tech companies (mainly MSFT &amp; AAPL) but I would also like exposure to tech related companies such as GOOGL &amp; AMZN.\n\nI found IETC which seems perfect &amp; it is actively managed to boot but there's no listing on the LSE (I'm UK based, trading GBP). Is there anything similar out there?",
        "subreddit": "stocks",
        "title": "Similar ETF to IETC on LSE?",
        "url": "https://www.reddit.com/r/stocks/comments/hcofxo/similar_etf_to_ietc_on_lse/",
        "created": 1592696862.0
    },
    {
        "author": "dhall0887491",
        "created_utc": 1593028261,
        "id": "hf81qg",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "pennystocks",
        "title": "TWIT(ter)",
        "url": "https://www.reddit.com/r/pennystocks/comments/hf81qg/twitter/",
        "created": 1593057061.0
    },
    {
        "author": "strongest_nerd",
        "created_utc": 1592616668,
        "id": "hcdaqc",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "smallstreetbets",
        "title": "YOLO with me - $TER $100 7/17 calls",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/hcdaqc/yolo_with_me_ter_100_717_calls/",
        "created": 1592645468.0
    }
]