[
    {
        "author": "patrickbateman02",
        "created_utc": 1591014624,
        "id": "gujsic",
        "num_comments": 110,
        "num_crossposts": 0,
        "selftext": "They did 323m in 2019. Q1 this year was a loss. Let’s take it off the table even though they had two months of sports \n\nSay they get into most states. Expand their brand. And in two - three years get up to an insane 1.5bil in revenue. Give them a huge margin rate of 20%. That’s 300 mil in profit. They have about 300 mil shares right now. Say that doesn’t increase. Which it will. But that’s $1 per share. \n\nSo right now you’re paying a multiple of 40 for that $1 current list. This is best case scenario being priced in\n\nSay they don’t get into all those states. Say it costs an insane amount to lobby and get into any other additional states. Stock dilution up the ass. Tons of other big casinos make their own apps to compete. Partner with sports analytical companies and have just as good of a product \n\nYou’re really telling me right now a multiple of 40 is legit ?\n\nSave yourself and take your profits off of this dumbass pump \n\nYou’re welcome \n\n🐻🌈",
        "subreddit": "wallstreetbets",
        "title": "Dkng valuation",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gujsic/dkng_valuation/",
        "created": 1591043424.0
    },
    {
        "author": "riceater97",
        "created_utc": 1591024176,
        "id": "gumatr",
        "num_comments": 48,
        "num_crossposts": 0,
        "selftext": "Right now I have $2000 and I am stumped as to what to buy.",
        "subreddit": "stocks",
        "title": "Good stocks to buy with $2000",
        "url": "https://www.reddit.com/r/stocks/comments/gumatr/good_stocks_to_buy_with_2000/",
        "created": 1591052976.0
    },
    {
        "author": "Xmrtraderlol",
        "created_utc": 1591019985,
        "id": "gul4e9",
        "num_comments": 40,
        "num_crossposts": 0,
        "selftext": " Hope all is well with you autists, I come here today to tell you all how we can print tendies off every single fucking piece of glass that is being broken at this very moment with HIGH UPSIDE POTENTIAL AND LOW DOWNSIDE RISK. As we watch the destruction of glass unfold before our very eyes, the result will be what we have longed for.. TENDIES. \n\nFOR TOO LONG WE HAVE SUFFERED AS BEARS, TODAY IS THE DAY WE PLANT OUR SEED, FOR WHEN TOMORROW COMES WE WILL PRINT AS BULLS\n\nTicker : $APOG \n\nWebsite : apog.com\n\nTLDR; commercial glass being broken = tendies , APOG HQ IS IN MINNESOTA, THE FUCKING CORE OF IT ALL, WHO WILL ALL THESE MINNESOTANS WITH FUCKED UP WINDOWS CALL UP WHEN THEIR WINDOWS ARE BROKEN?? A P O G. WHO WILL ALL THESE OTHER FUCKERS WITH FUCKED UP WINDOWS IN THE NEIGHBORING STATES CALL?!? A P O FUCKING G.\n\nShort DD for those interested: \n\nCommerical windows aint fucking cheap.\n\nTechnicals : Fuck your technicals, THE ONLY WAY WE’RE GOING IS UP. It may or may not be consolidating for a big move. Who knows.\n\nQ4 FY2020 Results: [https://www.apog.com/static-files/4a9e1b03-1334-429c-8cff-57ee8fcd3470](https://www.apog.com/static-files/4a9e1b03-1334-429c-8cff-57ee8fcd3470)\n\nThey bought and installed a Printer over the weekend : [https://finance.yahoo.com/news/apogee-enterprises-names-nisheet-gupta-110000824.html](https://finance.yahoo.com/news/apogee-enterprises-names-nisheet-gupta-110000824.html)\n\n* “Nisheet joins Apogee from Land O’ Lakes, Inc., a leading agribusiness and food company, where he has served as Vice President, Global Finance Operations since 2017, leading business unit finance and transformation.”\n* “Previously he served in numerous finance leadership roles with leading global companies including FirstData (now FISERV), Novartis, FedEx, and Ernst &amp; Young. He brings a wealth of diverse experiences, having worked and lived in nine different countries over the course of his career.”\n\nGo google Land O’ Lakes you autists. This man is the direct human descendant of a fucking printer. \n\nHow APOG prints tendies(10-K):\n\nArchitectural Framing: 49% of net sales\n\nArchitectural Glass: 25% of net sales\n\nArchitectural Services: 20% of net sales\n\nWhat else do you fucking need to know? LITERALLY CANNOT GO TITS UP. I AM not unCERTAIN\n\nAlso I hit up IR for you fucktards so ill update if they get back to me. I’ll leave you with a bible verse for blessings upon your portfolios. \n\nEcclesiastes 11:4-6 “Farmers who wait for perfect weather never plant, if they watch every cloud they never harvest” \n\n“Plant your seed in the morning and keep busy all afternoon, for you don’t know if profit will come from one activity or another—or maybe both.”\n\nAnyways, lemme know your thoughts\n\nGodspeed autists. Bless your hearts and God bless America",
        "subreddit": "wallstreetbets",
        "title": "What if I told you every piece of broken glass could be a tendie in your pocket?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gul4e9/what_if_i_told_you_every_piece_of_broken_glass/",
        "created": 1591048785.0
    },
    {
        "author": "Zeno3399",
        "created_utc": 1591024293,
        "id": "gumc5y",
        "num_comments": 39,
        "num_crossposts": 0,
        "selftext": "Im marked as a day trader so couldnt jump on the band wagon of dgly or prob wouldve lost money trying to wait a day to sell, whats a good buy right now for upcomming weeks",
        "subreddit": "pennystocks",
        "title": "Next plays",
        "url": "https://www.reddit.com/r/pennystocks/comments/gumc5y/next_plays/",
        "created": 1591053093.0
    },
    {
        "author": "Xadma24",
        "created_utc": 1591022951,
        "id": "guly1n",
        "num_comments": 35,
        "num_crossposts": 0,
        "selftext": "Unfortunately, a second wave of the virus seems imminent now in 2-3 weeks in the US based on protests (both from the left and right). Do you think this will cause another big dip in the market? Or is the market already accounting for this and so no correction will happen?",
        "subreddit": "stocks",
        "title": "Anybody Predicting a 2nd Major Dip from a 2nd Wave of the Virus?",
        "url": "https://www.reddit.com/r/stocks/comments/guly1n/anybody_predicting_a_2nd_major_dip_from_a_2nd/",
        "created": 1591051751.0
    },
    {
        "author": "Xmrtraderlol",
        "created_utc": 1591021336,
        "id": "guli18",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": " TLDR; APOG specializes in commercial glass, BASED in Minnesota\n\nTicker : $APOG \n\nWebsite : apog.com\n\nQ4 FY2020 Results: [https://www.apog.com/static-files/4a9e1b03-1334-429c-8cff-57ee8fcd3470](https://www.apog.com/static-files/4a9e1b03-1334-429c-8cff-57ee8fcd3470)\n\nThey got a new CFO over the weekend : [https://finance.yahoo.com/news/apogee-enterprises-names-nisheet-gupta-110000824.html](https://finance.yahoo.com/news/apogee-enterprises-names-nisheet-gupta-110000824.html)\n\n* “Nisheet joins Apogee from Land O’ Lakes, Inc., a leading agribusiness and food company, where he has served as Vice President, Global Finance Operations since 2017, leading business unit finance and transformation.”\n* “Previously he served in numerous finance leadership roles with leading global companies including FirstData (now FISERV), Novartis, FedEx, and Ernst &amp; Young. He brings a wealth of diverse experiences, having worked and lived in nine different countries over the course of his career.”\n\nHow APOG prints money(10-K):\n\nArchitectural Framing: 49% of net sales\n\nArchitectural Glass: 25% of net sales\n\nArchitectural Services: 20% of net sales\n\nLooking at June 19 25c, JULY 17 25c,AUG 21 30c\n\nWhat are your guy's thoughts",
        "subreddit": "options",
        "title": "$APOG for Glass/riot theme?",
        "url": "https://www.reddit.com/r/options/comments/guli18/apog_for_glassriot_theme/",
        "created": 1591050136.0
    },
    {
        "author": "ronald7777",
        "created_utc": 1591004018,
        "id": "guhje1",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "Listen to me guys\n\nSo i just rewatching the big short during my quaranteen for the 5th times, and i catch this golden easter egg\n \nnow look at this https://imgur.com/a/5lR2Qb7\n\nthis motherfucker already known something something scary pandemic is happening in the future, thats why he is wearing medical mask\n\n\"i may been early, but im not wrong\"\n\nnow is looting happening all over america + deadly pandemic, just dont dance. dont. fucking. dance.\n\nSPY 100c 31/12\n\ntldr : gay bear will win",
        "subreddit": "wallstreetbets",
        "title": "Its 2008 all over again..",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/guhje1/its_2008_all_over_again/",
        "created": 1591032818.0
    },
    {
        "author": "Marine4341",
        "created_utc": 1591021423,
        "id": "gulivf",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "SWBI is $13 bucks a share right now bois",
        "subreddit": "wallstreetbets",
        "title": "American Outdoors splits today, Smith and Wesson on the cheap",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gulivf/american_outdoors_splits_today_smith_and_wesson/",
        "created": 1591050223.0
    },
    {
        "author": "bailbondshman",
        "created_utc": 1591019122,
        "id": "gukwkr",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "This is the first month my distributions from XDIV and XDG have actually been reinvested into new shares. Previously the distributions would sit in cash which was inconvenient. [Their officlal DRIP list](https://www.rbcdirectinvesting.com/drip-list.html) hasn't been updated yet, but it finally works!",
        "subreddit": "CanadianInvestor",
        "title": "RBC DI now doing DRIP on XDIV, XDG, and probably other new ETFs.",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/gukwkr/rbc_di_now_doing_drip_on_xdiv_xdg_and_probably/",
        "created": 1591047922.0
    },
    {
        "author": "Dragx09",
        "created_utc": 1591023556,
        "id": "gum455",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "For those with the attention span of a methed up goldfish, **TLDR**:\n\nIncluded in last Thursday's vote was a provision where California's government could force PCG to become a nonprofit if the bankruptcy proceedings don't pan out, or more damage can be attributed to them.\n\n&amp;#x200B;\n\nArticle:[https://www.sfchronicle.com/business/article/PG-E-could-become-a-nonprofit-someday-under-15304905.php](https://www.sfchronicle.com/business/article/PG-E-could-become-a-nonprofit-someday-under-15304905.php)\n\n\"California lawmakers may still create a path to overhaul PG&amp;E Corp.’s structure even though the company is poised to remain an investor-owned business after its expected emergence from bankruptcy this year.\n\nState Sen. Jerry Hill, D-San Mateo, is carrying legislation that could make the utility subsidiary Pacific Gas and Electric Co. owned by a new nonprofit public benefit corporation called Golden State Energy. But it would only happen if the PG&amp;E’s bankruptcy implodes or state regulators take the drastic step of revoking the company’s operating license.\n\nWhile the bar for such a revocation is high, it is an option that the California Public Utilities Commission enshrined in a new enforcement process when it [approved PG&amp;E’s bankruptcy reorganization plan Thursday.](https://www.sfchronicle.com/business/article/Regulators-OK-PG-E-s-bankruptcy-plan-despite-15301790.php) Regulators at the commission could reconsider the license if the company causes more disasters and other enforcement measures prove insufficient.\"\n\nNow, I'm no expert, but this doesn't sound like it's very encouraging to shareholders, and even less encouraging to options addicted autists. Are there still hopes for printing tendies with the government putting such a damper on capitalism?\n\nPCG 9/18 20c and shares\n\n&amp;#x200B;\n\nEDIT: Including article link cause I'm retarded and forgot to do it in the first place.",
        "subreddit": "wallstreetbets",
        "title": "For My Fellow PCG Bagholding Autists",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gum455/for_my_fellow_pcg_bagholding_autists/",
        "created": 1591052356.0
    },
    {
        "author": "hins116",
        "created_utc": 1591021473,
        "id": "guljcz",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "I’m telling you guys get in now and ride the wave up to 0.01. Free money if you get in before mid week or before June 30.",
        "subreddit": "pennystocks",
        "title": "CBDD",
        "url": "https://www.reddit.com/r/pennystocks/comments/guljcz/cbdd/",
        "created": 1591050273.0
    },
    {
        "author": "Junior_Arino",
        "created_utc": 1591018478,
        "id": "gukqmo",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "Anyone else?",
        "subreddit": "pennystocks",
        "title": "Fidelity shitting the bed right now",
        "url": "https://www.reddit.com/r/pennystocks/comments/gukqmo/fidelity_shitting_the_bed_right_now/",
        "created": 1591047278.0
    },
    {
        "author": "Paul-Cheenis",
        "created_utc": 1591019207,
        "id": "gukxb0",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "After reading a previous post about $ITCI, I decided to dive into all of the data and break down all the technical jargon in an attempt to better understand the opportunity here. This is my first attempt at writing up my DD.\n\n**Positions:**\n\n**$ITCI Stock**\n\nPotential options:\n\n**$ITCI 6/19 $25c**\n\n**$ITCI 7/17 $25c**\n\n**Also a TL;DR at the bottom**\n\n&amp;#x200B;\n\n**WHAT is $ITCI?**\n\n$ITCI is Intra-Cellular Therapies, a biopharmaceutical company based in New York most known for its recently FDA-approved drug lumateperone (CAPLYTA), offering a unique take on schizophrenia treatment with very minimal side effects.\n\n**WHY are we looking at $ITCI?**\n\nThey have imminent data releases regarding large clinical trials that are expected to show positive results. One data release set for Q2, another set for mid-year 2020.\n\n**HOW do we profit from this?**\n\nHistorically, $ITCI has had large price spikes when positive data is released. Data release is imminent, likely beginning in June. Longer term outlook, if trial data is positive, further FDA approval and marketable drugs will provide ITCI with a much larger market in which to make money.\n\nLet's dive in.\n\nITCI has just recently had their drug, lumateperone (labeled CAPLYTA), approved by FDA for use at the end of 2019 after very positive clinical trials. This drug is used to treat schizophrenia, and compared to existing treatments, is novel in that the side effects are much more minimal. CAPLYTA sales/marketing began at the end of March, reporting \\~$880,000 in sales in just the last one or two weeks of Q1 (mainly to supply wholesalers). It's still early, but results from the clinical trials and the initial physician and patient reception has been positive.\n\nHowever, what we're looking at for the price spike is not the success of CAPLYTA, but rather the results of not one, but two upcoming data releases.\n\nThe first data release is regarding a clinical trial using lumateperone for treatment in bipolar disorder, which if successful, would greatly expand the market for ITCI's drug. This data release date per the most recent earnings call is “mid-year 2020”, however, another autist [makes the case for a June release here](https://medium.com/@codyenexile/another-itci-spike-incoming-diligence-done-8d625ff29754). The results of this trial are assumed to be positive because similar results were found in previous trials, [mentioned here](https://ir.intracellulartherapies.com/news-releases/news-release-details/intra-cellular-therapies-announces-positive-top-line-results-0).  This trial is Phase 3, which is the last step before FDA approval is granted.\n\nThe second release is regarding ITI-214, a separate treatment targeting patients with chronic systolic heart failure. This treatment acts as a PDE-1 inhibitor, which has shown positive results in heart treatment [example](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5513860/)\n\n[example 2](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6023290/).\n\nTI-214 has completed Phase 1-2 clinical trials and is awaiting results data “later this quarter” per the Q1 2020 earnings call this May (so, June 2020 release). Positive data from this trial would be very bullish for ITCI, as it could potentially open a whole new market for them - cardiac treatment in addition to psychoactive treatment.\n\n**ADDITIONAL PROS AND CONS:**\n\n**Pros:**\n\n1. Per the earnings call, the recent COVID events have not impeded the clinical trials. The launch of the CAPLYTA drug has also been successful in spite of COVID, thanks to telemedicine and online capability. In addition, patients have not stopped seeking treatment for mental conditions and physicians have not stopped providing care.\n2. Some large institutional investors, including BlackRock, have recently [increased their stake in ITCI](https://www.tickerreport.com/banking-finance/5649746/blackrock-inc-buys-527274-shares-of-intra-cellular-therapies-inc-nasdaqitci.html)\n3. In general, institutions have put in [$156M in Q2 2020 alone](https://www.marketbeat.com/stocks/NASDAQ/ITCI/institutional-ownership/), largest being Fidelity and BlackRock. This is much much larger than any other quarter so far\n4. Recent analyst price targets for ITCI have been positive, ranging from $26, to $35, to $50+.\n5. A competitor in schizophrenia treatment, Minerva Neurosciences ($NERV), recently reported disappointing Phase 3 trial results of their own, easing pressure on upcoming competitive threats.\n\n**Cons:**\n\n1. Despite reporting \\~$450 million in cash/cash equivalents and investment on the last earnings call, ITCI continues to burn money and is not yet in a position to reap big profits from CAPLYTA. Will need to keep an eye on financials if taking a long position.\n2. Although approved by the FDA and showing positive clinical trial results, CAPLYTA is very early and there are little real-world results to show for it as of now. Success of this drug is necessary for ITCI to stay relevant.\n3. Insider selling may be [a concern](https://www.gurufocus.com/stock/ITCI/insider). There has also been very recent [insider buying though](https://newsfilter.io/articles/4-form-ac9be466332a794a156140ff7d3f1e06),I don't know enough about this shit to form an opinion so I'm putting it in Cons because brainlet.\n\n**//--TL;DR--//**\n\n**The Good:** history of price spikes on positive data, drug recently approved by FDA, next data releases imminent and likely to be positive based on past results\n\n**The Bad:** company has $450 mil cash but isn't making money yet; drug released and approved only recently, little data available on sales outlook and patient reception. Questionable insider buys/sells?\n\n**The Ugly:** look in the mirror\n\n**Positions: $ITCI Stock** (for the longer hold)\n\n**$ITCI 6/19 $25c** (banking on June data releases)\n\n**$ITCI 7/17 $25c** (coverage in case data is released late June or early July)",
        "subreddit": "wallstreetbets",
        "title": "Taking a second look at $ITCI",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gukxb0/taking_a_second_look_at_itci/",
        "created": 1591048007.0
    },
    {
        "author": "After_Regular",
        "created_utc": 1591019753,
        "id": "gul27j",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "SKDI just put out a tweet this morning here [https://twitter.com/sunkissinc](https://twitter.com/sunkissinc) this kind of action is often the precursor to a pump. Said the same thing on GTEH before the move now I'm saying the same thing on SKDI. here is my alert post on GTEH when it was at .0011 before it hit highs last week of .0065 and it began with a tweet similar to this too   [https://www.reddit.com/r/pennystocks/comments/gr0k8s/gteh\\_total\\_beaten\\_down\\_dogshit\\_that\\_could\\_make\\_a/](https://www.reddit.com/r/pennystocks/comments/gr0k8s/gteh_total_beaten_down_dogshit_that_could_make_a/) \n\nhttps://preview.redd.it/zy80z5es0b251.jpg?width=1756&amp;format=pjpg&amp;auto=webp&amp;s=3b29004ca52e79e4413231500f1ee636e92096cd",
        "subreddit": "pennystocks",
        "title": "$SKDI more total dogshit it looks like they are getting ready to pump",
        "url": "https://www.reddit.com/r/pennystocks/comments/gul27j/skdi_more_total_dogshit_it_looks_like_they_are/",
        "created": 1591048553.0
    },
    {
        "author": "5blueberries",
        "created_utc": 1591019850,
        "id": "gul36a",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "You often see this classic example- You buy 100 stocks at $10. $1000. You get a 10% gain over the year. You now have $1100. The next year you gain %10 but now the 10% is applied to 1100 not 1000. And so on.\n\nHow does this actually work though? That's not really compounding. That is just a stock going up 10% per year. For it to compound you would need to reinvest your gains. Using the example you would take the $100 in gains and buy 10 more stocks. That wouldn't actually work though because the stock would now cost $11 so you wouldn't gain anything by selling off your gains and rebuying the stock.\n\nIm confused. How does this work?",
        "subreddit": "investing",
        "title": "Compounding gains. How does it work?",
        "url": "https://www.reddit.com/r/investing/comments/gul36a/compounding_gains_how_does_it_work/",
        "created": 1591048650.0
    },
    {
        "author": "Xmrtraderlol",
        "created_utc": 1591023643,
        "id": "gum4zz",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "TLDR; APOG specializes in commercial glass, BASED in Minnesota, has dividend. With all that glass being broken during protests.. seems like a good play?\n\nTicker : $APOG\n\nWebsite : apog.com\n\nQ4 FY2020 Results: [https://www.apog.com/static-files/4a9e1b03-1334-429c-8cff-57ee8fcd3470](https://www.apog.com/static-files/4a9e1b03-1334-429c-8cff-57ee8fcd3470)\n\nThey got a new CFO over the weekend : [https://finance.yahoo.com/news/apogee-enterprises-names-nisheet-gupta-110000824.html](https://finance.yahoo.com/news/apogee-enterprises-names-nisheet-gupta-110000824.html)\n\n* “Nisheet joins Apogee from Land O’ Lakes, Inc., a leading agribusiness and food company, where he has served as Vice President, Global Finance Operations since 2017, leading business unit finance and transformation.”\n* “Previously he served in numerous finance leadership roles with leading global companies including FirstData (now FISERV), Novartis, FedEx, and Ernst &amp; Young. He brings a wealth of diverse experiences, having worked and lived in nine different countries over the course of his career.”\n\nHow APOG prints money(10-K):\n\nArchitectural Framing: 49% of net sales\n\nArchitectural Glass: 25% of net sales\n\nArchitectural Services: 20% of net sales",
        "subreddit": "investing",
        "title": "Investing in $APOG? Thoughts?",
        "url": "https://www.reddit.com/r/investing/comments/gum4zz/investing_in_apog_thoughts/",
        "created": 1591052443.0
    },
    {
        "author": "FinancialLine7",
        "created_utc": 1591022911,
        "id": "gulxne",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "I bought at .16 saw it was climbing.. It hit .18 and now back down under .14\n\nMy question is should I have sold at .18?\nWas I wrong to hold on?",
        "subreddit": "pennystocks",
        "title": "Hold onto TLSS?",
        "url": "https://www.reddit.com/r/pennystocks/comments/gulxne/hold_onto_tlss/",
        "created": 1591051711.0
    },
    {
        "author": "IslandBulldog",
        "created_utc": 1591023807,
        "id": "gum6t4",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Hey kings &amp; queens &amp; royalty of WSB \n\nThis is not a post to promote something specific or a particular cause. \n\nThis is just a reminder that with great gains comes great responsibility. When you're making 75% on DKNG or GAN, please consider donating some (small or large) portion of your gains — there's obviously a lot of hurt &amp; pain in the world, especially right now. There's a lot out there that I'm sure you particularly care about that can use some help. Also, tax writeoffs.",
        "subreddit": "wallstreetbets",
        "title": "Being Good People",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gum6t4/being_good_people/",
        "created": 1591052607.0
    },
    {
        "author": "ralphredolawrencio",
        "created_utc": 1590995790,
        "id": "gufxkp",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Hello fellow autists,\n\nAs we all know there are riots going on throughout the country at the moment, and over the long-term this will cause the devaluation of the market as a whole.\n\nI will begin by stating that the majority of these rioters are liberals, who are notorious for having no money of their own and living at home with their parents. \n\nIf you've watched any videos of these riots you've noticed that there are large amounts of said liberals congregating while neither practicing social distancing nor wearing PPE which means that the virus is bound to spread faster than your wife's pussy for her boyfriend.\n\nWhen they go back to their homes, they will indubitably infect their boomer parents, causing a significant rise in cases, and certain amount of them to die, giving their inheritance to their liberal children.\n\nNow, how this ties all together: What do we know about boomers? They love keeping their retirement money in \"safe\" investments, SPY to be particular. And what do we know about liberals? They're stupid.\n\nHence, these liberals will take their parents money out of SPY, and bet it all on SPY calls because stonks only go up, but because so many people are withdrawing their deceased parents' 401(k)'s across the country, money will be leaving the market faster than JPow can print it.\n\ntl;dr SPY $225P 11/20",
        "subreddit": "wallstreetbets",
        "title": "Riots will cause the market to drop long-term",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gufxkp/riots_will_cause_the_market_to_drop_longterm/",
        "created": 1591024590.0
    },
    {
        "author": "WendellStuart",
        "created_utc": 1591016344,
        "id": "guk74m",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "It went up 300% on Friday, so I wonder if it's going to keep going? Having SERIOUS FOMO here guys since I laughed at it when it was .0019 per share, now up to .0041 - thoughts? \n\nThey signed a deal with California to use UV lighting to disinfect Covid 19. Not sure what's up with this one, if it's a pump or legit. Thoughts? Thanks.",
        "subreddit": "pennystocks",
        "title": "OPTI - is it going HAM or SPAM?",
        "url": "https://www.reddit.com/r/pennystocks/comments/guk74m/opti_is_it_going_ham_or_spam/",
        "created": 1591045144.0
    },
    {
        "author": "ifartmorethanhim",
        "created_utc": 1591019923,
        "id": "gul3ts",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "Whats going on with this? I was really excited about this stock all last week and coming into this week i was also really excited. Now im down 24% in 30 minutes. Anyone have a clue on why?\n\n&amp;#x200B;\n\nAlso have a good feeling about CBDD. Lets watch what that one can do.",
        "subreddit": "pennystocks",
        "title": "$BBRW",
        "url": "https://www.reddit.com/r/pennystocks/comments/gul3ts/bbrw/",
        "created": 1591048723.0
    },
    {
        "author": "dhonas",
        "created_utc": 1591022389,
        "id": "gulsdz",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "NVDA calls now at the dip?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gulsdz/nvda_calls_now_at_the_dip/",
        "created": 1591051189.0
    },
    {
        "author": "Stockleezy",
        "created_utc": 1591018181,
        "id": "gukns3",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Now I am fully convinced Brrrrr. Imma head out .",
        "url": "https://i.redd.it/i66sgw0ewa251.jpg",
        "created": 1591046981.0
    },
    {
        "author": "Kawawaza",
        "created_utc": 1591007575,
        "id": "gui8k2",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "I did DD on MNLO and posted it here twice, I really believe this stock will rise.\n\nAnyway, I want to say sorry if anyone followed my advice and is in red right now, I really didn't see this happening, I am afraid to baghold but I'll keep this stock here for long term.\n\nThanks to everyone that commented my DD in the past, happy trades today!",
        "subreddit": "pennystocks",
        "title": "MNLO",
        "url": "https://www.reddit.com/r/pennystocks/comments/gui8k2/mnlo/",
        "created": 1591036375.0
    },
    {
        "author": "tellg1291",
        "created_utc": 1591007259,
        "id": "gui69d",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "It's been really popular lately to cry wolf about the second wave of infections which will crush the markets. This will not happen because every country is closely monitoring infections and because part of this risk is still priced in.\n\nThe real fear I have of a market drop is Trump not being reelected. Beleive me, the market would not like that.\n\nI thought this was unlikely until this week. But now with Biden ahead and the Chinese trade war poised to continue, Trump's voting base is getting hurt (financially). And that's not to mention the pain in the oil industry or the local and international backlash from the way protests are being handled. \n\nI was quite bullish on his reelection with the stock market bounce. But if the real economy doesn't improve and fuel is added to the fire with protests and trade war, the man will not be reelected and our calls our fucked.",
        "subreddit": "investing",
        "title": "The real second wave - Trump not reelected",
        "url": "https://www.reddit.com/r/investing/comments/gui69d/the_real_second_wave_trump_not_reelected/",
        "created": 1591036059.0
    },
    {
        "author": "TransSpeciesDog",
        "created_utc": 1591015577,
        "id": "guk0lm",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "pennystocks",
        "title": "Rocket Express is now a GIF!",
        "url": "https://i.redd.it/8madhazgoa251.gif",
        "created": 1591044377.0
    },
    {
        "author": "Figgybaum",
        "created_utc": 1591019201,
        "id": "gukx9a",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": " \n\n6/5 88c @ $2.50 - now at 8.60\n\nand 85C at 3.70 now at 10.20\n\nI bought these because of someones post here... got them a couple of weeks back.\n\nthey are in the money.... they report earnings tomorrow.\n\nI have 1 buy at each strike so I can't just sell part and let the rest ride...\n\nDo I sell now and walk away or do I hold through earnings?\n\nI'm not used to making money on trades I make based on this sub. Please advise so I can get rid of this green and get back to losing.",
        "subreddit": "wallstreetbets",
        "title": "CRWD earnings tomorrow - help",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gukx9a/crwd_earnings_tomorrow_help/",
        "created": 1591048001.0
    },
    {
        "author": "Acuityus",
        "created_utc": 1591020668,
        "id": "gulbg8",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Nerv has had 5y resistance around where it is at right now. I know the bad news is scary but I believe no matter what the company isn’t gonna go under they will make a recovery. This isn’t the first time a trial has failed for them.",
        "subreddit": "pennystocks",
        "title": "Nerv",
        "url": "https://www.reddit.com/r/pennystocks/comments/gulbg8/nerv/",
        "created": 1591049468.0
    },
    {
        "author": "Mouse1701",
        "created_utc": 1591023765,
        "id": "gum6cj",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "What is McDonald's stock going to do if the riots continue?  I figure theres enough McDonald's out there that a few will get hit with rioters and vandalism. You can't get any more mainstreet then McDonald's. Yet we do have inflation and I do think that's what all the hype is all about when the market is going up but it's a false media narrative. Right now I trust gold is so much better than stocks. We have gone 6 months in the year 2020 yet I cant find any reason to be in this market unless you are day trading or going short. That being said there are few gems like gun manufacturers.",
        "subreddit": "StockMarket",
        "title": "McDonald's stock during the riots and inflation.",
        "url": "https://www.reddit.com/r/StockMarket/comments/gum6cj/mcdonalds_stock_during_the_riots_and_inflation/",
        "created": 1591052565.0
    },
    {
        "author": "tradingforkeeps",
        "created_utc": 1591009706,
        "id": "guiod5",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "**Market Notes:**\n\nLast week ended on a positive note as Trump's press conference was not very tough on China as many had feared.\n\nThe weekend was full of unrest in the US. International markets don't seem too concerned. Futures are a little choppy, looking to open near flat.\n\nWhile we have dealt with riots in the US before it is new to have them during a pandemic. I think the chances of a second spike of COVID-19 cases are more likely now as social distancing appears to have been completely disregarded by many different parts of our society.\n\n**Watchlist:**\n\n**GMBL** is a low float, resistance at $9.75\n\n**ALT** is a low float, resistance at $10\n\n**MLND** is a low float, resistance at $2.77\n\n**ALRN** is a lowish float, support at $1.60\n\n**STKL** has resistance at $5\n\n**AMRS** has resistance at $4\n\n**MEIP** watching for a setup above $3.80",
        "subreddit": "StockMarket",
        "title": "Watchlist: 6/1 The Second Spike",
        "url": "https://www.reddit.com/r/StockMarket/comments/guiod5/watchlist_61_the_second_spike/",
        "created": 1591038506.0
    },
    {
        "author": "nullcommanull",
        "created_utc": 1591011355,
        "id": "guj1ak",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "What do you think about the future of ZNGA now that they’ve bought Peak: https://www.bloomberg.com/amp/news/articles/2020-06-01/zynga-to-buy-peak-for-1-8-billion-in-its-largest-deal-ever?__twitter_impression=true\n\nGood deal? Bright future? I see some pre-market moves going up.",
        "subreddit": "stocks",
        "title": "Zynga buys Peak",
        "url": "https://www.reddit.com/r/stocks/comments/guj1ak/zynga_buys_peak/",
        "created": 1591040155.0
    },
    {
        "author": "pangolin12",
        "created_utc": 1591023290,
        "id": "gum1jv",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Hi r/stocks!\n\nNeed some advice! - I bought 4.04 amazon shares a week or so ago at $2455 ea, and since then the share price has risen to **$2468.61** However, on my trading app today (I use trading212), it show's that \"Market Value\" of these shares is now **8007.57** and the net result is **-138.79**...\n\nPlease find screenshot here... [https://imgur.com/a/WxcHvHl](https://imgur.com/a/WxcHvHl)\n\nCan anyone explain this to me, I'm not sure why I've lost money even though the stock price rose?\n\nThanks!",
        "subreddit": "stocks",
        "title": "Why has my net profit gone down even though stock price has gone up?!",
        "url": "https://www.reddit.com/r/stocks/comments/gum1jv/why_has_my_net_profit_gone_down_even_though_stock/",
        "created": 1591052090.0
    },
    {
        "author": "hammad626",
        "created_utc": 1591024283,
        "id": "gumc1t",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "ITRM had a big dip today, 65% or so before market open. Slowly moving its way up now. Bought a few shares and already in profit. Thoughts?",
        "subreddit": "pennystocks",
        "title": "ITRM big dip pre-market and moving up",
        "url": "https://www.reddit.com/r/pennystocks/comments/gumc1t/itrm_big_dip_premarket_and_moving_up/",
        "created": 1591053083.0
    },
    {
        "author": "gigaz13",
        "created_utc": 1591006084,
        "id": "guhxp1",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "I have been on this sub for over 3 months now since the virus.\n\nWhen SPY was trading below 250, everyone on this sub promoted buying puts, eventually we all lost everything. This stopped after SPY crossed 290.\n\nNow above 300 I see most posts promoting Calls.\n\nSo its time to see SPY bleeding. I guess about SPY options we are all wrong, and need to inverse the shit out of it. \n\nTime for SPY to go down and most people to lose money on this sub again.",
        "subreddit": "wallstreetbets",
        "title": "WEB Ideology",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/guhxp1/web_ideology/",
        "created": 1591034884.0
    },
    {
        "author": "tradingforkeeps",
        "created_utc": 1591009661,
        "id": "guio09",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "**Market Notes:**\n\nLast week ended on a positive note as Trump's press conference was not very tough on China as many had feared.\n\nThe weekend was full of unrest in the US. International markets don't seem too concerned. Futures are a little choppy, looking to open near flat.\n\nWhile we have dealt with riots in the US before it is new to have them during a pandemic. I think the chances of a second spike of COVID-19 cases are more likely now as social distancing appears to have been completely disregarded by many different parts of our society.\n\n**Watchlist:**\n\n**GMBL** is a low float, resistance at $9.75\n\n**ALT** is a low float, resistance at $10\n\n**MLND** is a low float, resistance at $2.77\n\n**ALRN** is a lowish float, support at $1.60\n\n**STKL** has resistance at $5\n\n**AMRS** has resistance at $4\n\n**MEIP** watching for a setup above $3.80",
        "subreddit": "pennystocks",
        "title": "Watchlist: 6/1 The Second Spike",
        "url": "https://www.reddit.com/r/pennystocks/comments/guio09/watchlist_61_the_second_spike/",
        "created": 1591038461.0
    },
    {
        "author": "valentinmuller",
        "created_utc": 1591022029,
        "id": "gulox1",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Is there a place where I could download ISM PMI / NMI historical data for free? I don't seem to find a place. As far as I know the official website had CSV but I cannot find it now.\n\n&amp;#x200B;\n\nThanks in advance",
        "subreddit": "investing",
        "title": "ISM PMI / NMI Historical Data to download",
        "url": "https://www.reddit.com/r/investing/comments/gulox1/ism_pmi_nmi_historical_data_to_download/",
        "created": 1591050829.0
    },
    {
        "author": "Truthhhurts",
        "created_utc": 1591001604,
        "id": "guh2nk",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Ive invested a small amount(around 500) into Whitbread some time ago and now they are raising capital by releasing new shares. Problem is the broker fee of participation, which is 50 eur. Normally, with reasonable amount invested, I would just take the offer, but considering the sum of money it makes little sense for me to pay 50eur fee.\n\nQuestion is, whats the best course of action?",
        "subreddit": "investing",
        "title": "Small investment and rights issue",
        "url": "https://www.reddit.com/r/investing/comments/guh2nk/small_investment_and_rights_issue/",
        "created": 1591030404.0
    },
    {
        "author": "5nickers",
        "created_utc": 1591004551,
        "id": "guhn17",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "I came across copenhagen atomics on funderbeam and it does sound really promising. They have developed components for a molten salt nuclear reactor which is safer and produces much less waste then gen 3 reactors. On top it can burn nuclear waste from gen 3 reactors.  \nThere are like 20 similar companies on the world and they seem to be the furthest right now, even bill gates is financing tech like that.  \n\n\n [https://www.funderbeam.com/syndicate/copenhagenatomics](https://www.funderbeam.com/syndicate/copenhagenatomics) \n\nCheck them out folks",
        "subreddit": "investing",
        "title": "Investing in new nuclear tech",
        "url": "https://www.reddit.com/r/investing/comments/guhn17/investing_in_new_nuclear_tech/",
        "created": 1591033351.0
    },
    {
        "author": "evry1knowseverything",
        "created_utc": 1590999067,
        "id": "guglch",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Found this on Twitter if anyone is interested. I've been holding for a week now and hope this news will relieve me of my bags soon. \n\nThis has the CFO of DECN describing the tests and how they work and he also talks about when they could possibly become available. We'll see!\n\n[https://app.criticalmention.com/app/#/report/0d5e3e82-8ecd-4ac6-aa2b-cfa28f08fb5d](https://app.criticalmention.com/app/#/report/0d5e3e82-8ecd-4ac6-aa2b-cfa28f08fb5d)",
        "subreddit": "pennystocks",
        "title": "$DECN Recording From CFO",
        "url": "https://www.reddit.com/r/pennystocks/comments/guglch/decn_recording_from_cfo/",
        "created": 1591027867.0
    },
    {
        "author": "brandydorandy",
        "created_utc": 1591023240,
        "id": "gum11c",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Was up 88% Friday and now up 34% today. Even reached up to 68% today already. Big things coming and huge volume.",
        "subreddit": "pennystocks",
        "title": "TPTW",
        "url": "https://www.reddit.com/r/pennystocks/comments/gum11c/tptw/",
        "created": 1591052040.0
    },
    {
        "author": "imperialfinsol",
        "created_utc": 1591010902,
        "id": "guixva",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "It’s all just on fingertips, No paperwork, No hassles, Invest in the best mutual funds using [Imperial Money.](https://play.google.com/store/apps/details?id=com.iw.imperialmoney) All Indian mutual funds are available in one single app. In Imperial money you can start SIP, lump-sum investment for free. Switching of the funds from one fund to other fund and Systematic withdrawal plan or funds from liquid to equity or equity to liquid while re-balancing of the portfolio you can just do it here anytime anywhere you are.\n\n**Investing becomes easy with your fingertips**\n\n· Get Sign up in minutes,\n\n· One time KYC process within the app\n\n· Buy, Sell, Shift mutual funds within fund family.\n\n· Buying Systematic investment plan or doing the STP or SWP is just simple and easy.\n\n**Invest in all mutual funds online for free**\n\n· You do not require paying any additional cost for buying funds from Imperial money!!\n\n· Most researched Mutual funds baskets are available.\n\n· Sell anytime - Money comes to your bank account directly\n\n· Learn to invest in mutual funds with as low as Amount of Rs.500/- with respect to your objective and planning of life the portfolio are builder for giving one of the state of art experience\n\n**Mutual Fund Investing for You:-**\n\n· Simple design, Easy to understand\n\n· Made for beginners and experts both\n\n· Financial planning you can do it here itself Invest in the researched and ready-made basket of mutual funds recommended by experts with years together experience bringing for you.\n\n· Latest finance news and insights, notifications\n\n· Most important is the teams of experts are available here to help you out in any type of Issues.\n\n**Steps After Imperial Money App Install:**\n\n· Verify your KYC\n\n· If the KYC is not available then use following process\n\n· PAN/KYC\n\n· Profile set up\n\n· Make an investment of sip or lumpsum\n\n**Need of KYC for mutual funds as per process of the Government of India for making a Tax saving funds (ELSS mutual funds):**\n\nInvest in tax saving mutual funds to get tax exemption under section 80c. The total exempt limit is 1.5 Lakhs. Invest in equity mutual funds - small cap, large cap, mid cap, multi-cap - for the long term and higher returns. Check out [SIP Calculator](https://www.imperialfin.com/calculator) to know how much returns you can make.\n\n**Safe &amp; Secure:** We use the latest security standards to keep your data safe and encrypted.\n\n**IMPERIAL MONEY** is secure and does not store any information on your device or SIM card. Download and stay connected to your Mutual Fund investments always. Imperial Money uses NSE (National Stock Exchange) for transactions. We support all RTAs - CAMS, Karvy and Franklin.\n\n**Following AMC’s are supported on IMPERIAL MONEY Mutual Fund App:**\n\nSBI Mutual Fund,NIPPON Mutual Fund,ICICI Prudential Mutual Fund,HDFC Mutual Fund,Aditya Birla Sun Life Mutual Fund,Franklin Templeton Mutual Fund DSP Mutual Fund,Kotak Mutual Fund, Mirae Asset Mutual Fund, Axis Mutual Fund Motilal Oswal Mutual Fund, L&amp;T Mutual Fund,IDFC Mutual Fund,INVESCO Mutual Fund UTI Mutual Fund,Sundaram Mutual Fund,Tata Mutual Fund,ITI MUTUAL FUND,BNP PARIBAS MUTUAL FUNDS,EDELWEISSS MUTUAL FUND,HSBC MUTUAL FUND MAHINDRA MUTUALA FUND,PGIM MUTUAL FUND,PRINCIPLE MUTUAL FUND UNION MUTUAL FUND\n\n**IMPERIAL MONEY - KEY FEATURES**\n\nAccess your investments across multiple Mutual Funds through a Single Gateway; No more managing multiple PINs, Folios numbers, login ids;\n\n· Mobile PIN &amp; Pattern login– Simplified your Imperial Money App login process now. Just pick your preferred login methods – Mobile PIN, Pattern or Password right away\n\n· Paperless Investing: Quick &amp; paperless account creation and instant Activation. Within a couple of minutes, you are all set to ride the new wave of investing.\n\n· Instant SIP: Once you are registered. It takes less than a minute to start a SIP.\n\n· SIP Calculators: With the help of our calculators plan your investment needs to achieve your Financial Goals. Happy investing with Imperial money!!!\n\n**Investment Sahi…Future Sahi**",
        "subreddit": "investing",
        "title": "Imperial Money offers the Simple, Free and most convenient way of Investing in Mutual Funds",
        "url": "https://www.reddit.com/r/investing/comments/guixva/imperial_money_offers_the_simple_free_and_most/",
        "created": 1591039702.0
    },
    {
        "author": "ExcessThoughts",
        "created_utc": 1591019409,
        "id": "gukz6s",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Both up 40%+ right now; Any known catalyst?",
        "subreddit": "pennystocks",
        "title": "TPTW and AMAZING",
        "url": "https://www.reddit.com/r/pennystocks/comments/gukz6s/tptw_and_amazing/",
        "created": 1591048209.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1591010209,
        "id": "guisgc",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "StockMarket",
        "title": "r/StockMarket June 2020 Stock Picking Contest Spreadsheet is now LIVE!",
        "url": "https://docs.google.com/spreadsheets/d/119jRV-wzKqm-At93YyivlOuL-1tSLWBTv28GhLt4v_8/edit?usp=sharing",
        "created": 1591039009.0
    },
    {
        "author": "kingofsnake96",
        "created_utc": 1591019495,
        "id": "gukzy0",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I don't know if you've been watching the likes of DKNG, GAN, GMBL etc but theve all been on an absolute tear recently.\n\nThis is one of the very few gambling stocks that hasn't popped yet with volume staying stagnant, it's just gaining some traction now get in while you can low float so has potential to soar big",
        "subreddit": "pennystocks",
        "title": "INSE 🚀 undiscovered gambling stock",
        "url": "https://www.reddit.com/r/pennystocks/comments/gukzy0/inse_undiscovered_gambling_stock/",
        "created": 1591048295.0
    },
    {
        "author": "DavidBoyer",
        "created_utc": 1591020366,
        "id": "gul8fk",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " [https://oracledispatch.com/2020/06/01/gearing-up-for-the-pot-stock-election-run-mjna-crlbf-mctc-curlf/](https://oracledispatch.com/2020/06/01/gearing-up-for-the-pot-stock-election-run-mjna-crlbf-mctc-curlf/) \n\n \n\nThe 2016 general election November vote was one of the biggest catalysts for the cannabis space. 2020 is shaping as potentially another similar situation, with 4 states already on the ballot for legalization (2 for recreational) and another 6 states pushing to get on the ballot (5 for recreational), making it potentially even more explosive for the overall legalization movement than we saw in the historic 2016 process.\n\nThe rationalization for this last claim is about percentage change: the ultimate shift would be to get cannabis legalized on a recreational basis in the majority of the US, thereby putting pressure on the federal government to accept the verdict by states and start removing federal statutes around cannabis, which would likely accelerate the dominoes as a “tipping point” phenomenon.\n\nIn percentage terms, if all states seeking to get on the ballot for recreational “adult use” legalization are successful in doing so, then 2020 will be a bigger shift (provided they all pass) than the movement in 2016.\n\nIn other words, start getting your pot stock portfolio picks together ASAP. Below you will find our thoughts and analysis on some of the more widely discussed names in the space, including: Medical Marijuana Inc (OTCMKTS:MJNA), CRLBF, MCTC Holdings Inc (OTCMKTS:MCTC) aka Cannabis Global Inc. (OTCMKTS:MCTC), and CURLF\n\n**Medical Marijuana Inc (OTCMKTS:MJNA)** isn’t what we would consider a “prime investment pick” in this space. The company has remained on the pink sheets, offering up unaudited financials only for all of its tenure as a publicly traded stock (and we’re talking about years here), despite claiming tens of millions in revenues. In case you’re wondering, this is not remotely typical. As far as we can tell, MJNA is the only stock in the history of the world that fits this description. And it’s certainly not a reassuring idea. Why would you hide on the pink sheets and avoid producing audited financial reports if you are seeing such success?\n\nTo underscore this, the stock has done nothing but slide lower despite the company’s proclamations of ever-growing revenues. Smoke equals fire. We would simply be careful with any company that seems to overpromise and overhype, and then claim the opaque lack of transparency afforded to companies trading on the pink sheets. While we have seen a recent spike following news that Aurora bought out a CBD name (CBD is the main focus of MJNA), we would remain skeptical that the long history here of underperformance in MJNA is likely to change on a sustained basis anytime soon.\n\nMedical Marijuana Inc (OTCMKTS:MJNA) bills itself as an investment holding company that operates in the medical marijuana and industrial hemp markets. Its products range from patented and proprietary based cannabinoid products to seed and stalk or isolated high value extracts manufactured and formulated for the pharmaceutical, nutraceutical, and cosmeceutical industries. The company licenses its proprietary testing, genetics, labeling and packaging, tracking, production, and standardization methods for the medicinal cannabinoid industry.\n\nIt engages in the research and development of cannabinoid-based pharmaceuticals; and marketing and distribution of cannabidiol hemp oil-based products. In addition, the company provides management support and services to cooperatives, collectives, health and wellness facilities, and medical clinics; and consulting and securities services to businesses and individuals in the legal cannabis industry.\n\nIt’s subsidiary, Kannaway, is a network sales and marketing company specializing in the sales and marketing of hemp-based botanical products. Kannaway currently hosts weekly online sales meetings and conferences across the United States, offering unique insight and opportunity to sales professionals who are desirous of becoming successful leaders in the sale and marketing of hemp-based botanical products.\n\nMJNA has been acting well over recent days, up something like 30% in that time. Shares of the stock have powered higher over the past month, rallying roughly 75% in that time on strong overall action.\n\nMedical Marijuana Inc (OTCMKTS:MJNA) managed to rope in revenues totaling $16.9M in overall sales during the company’s most recently reported quarterly financial data — a figure that represents a rate of top line growth of -4.2%, as compared to year-ago data in comparable terms. In addition, the company is battling some balance sheet hurdles, with cash levels struggling to keep up with current liabilities ($6.2M against $11M, respectively).\n\n**Cresco Labs Inc (OTCMKTS:CRLBF)** continues to act like a new leader in the making, with an expanding footprint in terms of market density and geographic range.\n\nMoreover, this is a company very much tied to the process of gradual legalization in the US marketplace, with a widely known brand and a growing scale in terms of distribution relationships.\n\nCresco Labs Inc (OTCMKTS:CRLBF) trumpets itself as a company that manufactures and sells medical cannabis products in the United States. It offers cannabis dry flower; vaporizer forms of cannabis; cannabis oil in capsule, oral and sublingual solutions; cannabis in topical; and other cannabis products.\n\nThe company also provides cannabis infused edibles, including chocolate and toffee confections, fruit-forward gummies, and hard sweet and chews. Cresco Labs Inc. sells its products under the Cresco brand. In addition, it operators a Hope Heal Health dispensary in Fall River, Bristol County, Massachusetts.\n\nIf you’re long this stock, then you’re liking how the stock has responded to the announcement. CRLBF shares have been moving higher over the past week overall, pushing about 8% to the upside on above average trading volume. Shares of the stock have powered higher over the past month, rallying roughly 24% in that time on strong overall action.\n\nCresco Labs Inc (OTCMKTS:CRLBF) generated sales of $54.6M, according to information released in the company’s most recent quarterly financial report. That adds up to a sequential quarter-over-quarter growth rate of 14.2% on the top line. In addition, the company is battling some balance sheet hurdles, with cash levels struggling to keep up with current liabilities ($70.2M against $194.7M, respectively).\n\n**MCTC Holdings Inc (OTCMKTS:MCTC)**, now doing business as Cannabis Global, Inc. (MCTC), has started to emerge as a new focus point for cannabis stock traders in the past few weeks. The company has been an IP leader, with a number of major patents related primarily to infusion technology for CBD, THC, CBG, and THC-V in the works. It’s rare to see substantive IP as a factor in the pot stock space – most of these names are basically commodity plays – but MCTC appears to be the genuine item on that note.\n\nTo help reinforce that idea, the company just announced it has completed product development and has begun distribution of its unique tetrahydrocannabivarin (THC-V) coffee and tea products to product beta testers. This comes on the heels of news that the company has been approved as an Amazon.com platform seller for its Hemp You Can Feel branded line of CBD products.\n\nAccording to the release, “Cannabis Global has integrated three internally developed technologies into the unique manufacturing process for the industry’s first THC-V beverages. The first of these is the process developed by the Company to produce 70%+ loaded THC-V, controlled release, nanoparticles utilizing laboratory-based, pharmaceutical-grade production equipment. The Company is also utilizing both its internally developed powerization and one step dosing system, ensuring precise dosing and significantly faster production. The Company has filed provisional patents on all three technologies.”\n\nAs noted, Cannabis Global (OTCMKTS:MCTC) has recently filed six patents on cannabinoid extraction technologies and delivery systems. Management is currently working with patent counsel to protect various other technologies it has developed or is currently developing, including its programs pertaining to cannabinoid glycosides, polymeric cannabinoid nanoparticles and nanofibers, and its hemp extract-based alcohol replacement technologies.\n\n“Our unique infusion and production technologies provide Cannabis Global with a product purity advantage as well as a clear path to low cost leadership,” commented CEO Arman Tabatabaei. “The THC-V cannabinoids are synthesized and entirely free of impurities. While there were some upfront technology development and intellectual property protection costs, we expect our ongoing variable production costs to be less than half of any potential competitor. Via our technologies, we turn one of the cannabis industry’s most expensive items – pure THC-V cannabinoids – into a cost-effective solution that sets a new standard for product purity in the cannabinoid-based products marketplace.”\n\nMCTC Holdings Inc (OTCMKTS:MCTC) had no reported sales in its last quarterly financial data. In addition, the company is battling some balance sheet hurdles, with cash levels struggling to keep up with current liabilities ($157K against $1.5M, respectively).\n\n**Curaleaf Holdings Inc (OTCMKTS:CURLF)** shares have been moving steadily higher as the company continues to expand and solidify itself as one of the primary leaders in the space, particularly in the US market.\n\nCURLF shares pushed above their key 200-day simple moving average line two weeks ago, and have held up above that key technical marker on a closing basis since, with two critical tests, both passed nicely thus far. At this point, all of the stock’s major MA’s are curving into a bullish posture on a long-term basis.\n\nCuraleaf Holdings Inc (OTCMKTS:CURLF) promulgates itself as a company that operates as an integrated medical and wellness cannabis operator in the United States. The Company is the parent of Curaleaf, Inc., a leading vertically integrated cannabis operator in the United States. Headquartered in Wakefield, Massachusetts, Curaleaf, Inc. has a presence in 12 states.\n\nCuraleaf, Inc. operates 30 dispensaries, 12 cultivation sites and 9 processing sites with a focus on highly populated, limited license states, including Florida, Massachusetts, New Jersey and New York. Curaleaf, Inc. leverages its extensive research and development capabilities to distribute cannabis products in multiple formats with the highest standard for safety, effectiveness, consistent quality and customer care. Curaleaf is committed to being the industry’s leading resource in education and advancement through research and advocacy.\n\nCuraleaf Inc.’s Florida operations were the first in the cannabis industry to receive the Safe Quality Food certification under the Global Food Safety Initiative, setting a new standard of excellence. It cultivates, processes, markets, and/or dispenses a range of cannabis products in various operating markets, including flower, pre-rolls and flower pods, dry-herb vaporizer cartridges, concentrates for vaporizing, concentrates for dabbing, tinctures, lozenges, capsules, and edibles.\n\nShares of the stock have powered higher over the past month, rallying roughly 26% in that time on strong overall action.\n\nCuraleaf Holdings Inc (OTCMKTS:CURLF) generated sales of $129.8M, according to information released in the company’s most recent quarterly financial report. That adds up to a sequential quarter-over-quarter growth rate of 30.3% on the top line. In addition, the company has a strong balance sheet, with cash levels far exceeding current liabilities ($251M against $177.1M).",
        "subreddit": "pennystocks",
        "title": "Gearing Up for the Pot Stock Election Run (MJNA, CRLBF, MCTC, CURLF)",
        "url": "https://www.reddit.com/r/pennystocks/comments/gul8fk/gearing_up_for_the_pot_stock_election_run_mjna/",
        "created": 1591049166.0
    },
    {
        "author": "SumantS",
        "created_utc": 1590997588,
        "id": "gugand",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "In the last few weeks, the Indian equity market swung and inched higher aligning to global cues. The domestic indices moved in synchronization with the developed market peers like the US despite the rising COVID casualties. Recently, the country has reported 7,964 new coronavirus cases in the last 24 hours, registered the record cases in a day since the first case reported in January month. However, a trend worth to observe is that stock markets in most countries, irrespective of COVID-19 casualties and stimulus package from their respective governments have proved to be more resilient. Dow Jones Industrial Average (DJIA) is one such example that has witnessed the strong recovery from its lows of March 2020.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[https://www.invest19.com/blog/lockdown-most-buzzing-word-in-the-stock-market-right-now/](https://www.invest19.com/blog/lockdown-most-buzzing-word-in-the-stock-market-right-now/)",
        "subreddit": "StockMarket",
        "title": "Lockdown: Most Buzzing Word in the Stock Market Right Now",
        "url": "https://www.reddit.com/r/StockMarket/comments/gugand/lockdown_most_buzzing_word_in_the_stock_market/",
        "created": 1591026388.0
    },
    {
        "author": "Thriftylearning",
        "created_utc": 1591023193,
        "id": "gum0jh",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "up 10% already \n\nCALGARY, May 27, 2020 /CNW/ - Inner Spirit Holdings Ltd. (\"**Inner Spirit**\" or the \"**Company**\") (CSE:[ISH.CN](https://ca.finance.yahoo.com/q?s=ish.cn) \\- [News](https://ca.finance.yahoo.com/q/h?s=ish.cn)), a Canadian company that has established a national network of Spiritleaf retail cannabis stores, today announced Retail Operator Licences (\"**ROLs**\") have been secured for a number of franchise partners who now meet Ontario's eligibility criteria for operating cannabis outlets in the province. The ROLs were granted by the Alcohol and Gaming Commission of Ontario (\"**AGCO**\") as part of the regulator's plan to expand the number of legal cannabis retail stores in the province. Earlier this month, the Company announced it had secured a ROL for corporate-owned Spiritleaf retail cannabis stores in Ontario. The next step in the approval process for Spiritleaf franchised and corporate-owned stores is to secure Retail Store Authorizations (\"**RSAs**\") prior to beginning operations with more than 20 potential locations under various stages of development and completion.",
        "subreddit": "pennystocks",
        "title": "$ISH is expanding",
        "url": "https://www.reddit.com/r/pennystocks/comments/gum0jh/ish_is_expanding/",
        "created": 1591051993.0
    },
    {
        "author": "AdditionalNarwhal9",
        "created_utc": 1591005567,
        "id": "guhu2r",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I told them I was a freelancer when I'm actually a student.\n\nNow they ask me the source of income, name of the business, turnover, profits etc\n\nWhat should I do ? Give up ?",
        "subreddit": "options",
        "title": "I don't know what to answer to IB",
        "url": "https://www.reddit.com/r/options/comments/guhu2r/i_dont_know_what_to_answer_to_ib/",
        "created": 1591034367.0
    }
]