[
    {
        "author": "stream5482",
        "created_utc": 1587647647,
        "id": "g6merb",
        "num_comments": 103,
        "num_crossposts": 0,
        "selftext": " This will be the first and last time I post. \n\nWhy first ? I’m posting because I’ve seen some retarded DD on here last 2 days that would offend retarded people. \n\nWhy Last ? I got better things to do. \n\nMy credentials ?  Insider in this space for over 10 years.    ( excuse the grammars. English is my fourth language). \n\nThis is a very dumbed down version as I can’t very well write 100 pages on wsb post.  There are books, seminars, certifications on this stuffs. \n\nCredit Card processing is very important as it’s a key indicator for consumers spending.   Scroll down for  Puts/Calls.\n\n**Parties Involved to make it work ?**\n\n1.) Consumer   --- end user. Credit Card holder. \n\n2.) Merchant   --- Business establishment accepting  payment. These guys pay out all the fees\n\n3.) Card Brand   ---- Visa, Mastercard, Discover (Diner Club,  Union Pay), American Express, \n\n4.) Sponsoring Bank   --- handles risks, daily balancing, funding the merchant. \n\n5.) Issuing Bank --- Issue the credit card. If your credit card say “ Chase”, then Chase is the issuing bank. \n\n6.) Processor  --- transactions run through these guys. Think of them as a highway to run  and verify transactions\n\n7.) ISO --- Independent sales office. These guys are the one who call business to sign them up with “ use my company  \n\n for cheaper rates” \n\n**How**  **does each Parties make money ?** \n\n1.) Consumer --- they don’t  anything as they are the purchaser.\n\n2.) Merchant --- they pay out all the fees. At the end of the month, they get a bill for the privilege of being able to accept credit card.  \n\n3.) Card Brand --- Card Brand is pretty much god. They make about 15% of total fees paid out to merchant.   Look up  FANF, dues &amp; assessments. If Visa need money, they just increase their rates, that’s it. More on this later. \n\n4.) Sponsoring Bank -- these guys make the least out of everyone in the group. About  0.01% -0.03%  ( 1 to 3 BP) of total processing volume.  \n\n5.) Issuing bank -- “interchange” is paid out to the issuing bank. These fees account for about 75% of all total fees.  Card Brand dictate interchange. I’m not going to go into qualifications, etc….. Interchange rates is publish for each card brand. Look it up. \n\n6.) Processor --- these guys usually make money on per transaction counts. About $0.02 -$0.05 per transaction and bunch of other misc fees. \n\n7.) ISO --- whatever is left over goes to the sales group.  In a normal business niche ( not high risk or CBD/ cannabis), profit is about 0.30% - 0.50% of total processing volume. \n\n**Profit Math**\n\nMerchant’s fee – ( issuing bank + card brand ) = ISO’ Gross - ( Processor + Sponsoring Bank) = ISO’s Net.\n\n \n\n**Fees:** \n\nAlways have 2 parts.   \n\na.)  Percentage  multiply by the processing volume. \n\nb.)  Fix charge multiply by the transaction.\n\nWhat if you as a sales office  charged merchant 2.75% ( SQUARE) and  nothing else? you would  net negative on any transactions under $10 and  net positive on any transaction over $40.00\n\nWhy ? because interchange for a signature regulated debit is  0.05%+ $0.22( per transaction) not including all the other costs. \n\n**State of the world.**\n\nAll 50 states have stay-at-home orders. Some states are talking about opening up again ( GA, FL).  Guess what ? it’s the Consumers who’s going to decide when to “open” up. Household spending account for 70% of annual GDP. \n\nThe rest of the world is on lock down. Even after opening up, it’s still bad. \n\n[https://www.barrons.com/articles/chinas-reopening-is-missing-consumers-thats-a-bad-sign-for-u-s-51587476793](https://www.barrons.com/articles/chinas-reopening-is-missing-consumers-thats-a-bad-sign-for-u-s-51587476793)\n\n**Great……**  **Give me puts or calls……………..**\n\n1.) Card Brand   ---- \n\na. Visa ( V)  -- earning is on 04/30. They are  the god in this business. They have the greatest exposure in US and overseas. There is no place in asia or Europe that does not take Visa. They increase their rates twice a year. Rate increases scheduled for this April was pushed back to July.  Their earnings will be absolutely horrible as the rest of the world started shutting down in Feb and US in march. \n\ni.  Waiting to be fill --- V 01 May $160P  \n\nii. Waiting to be fill --- V 19 June $135P \n\nb. Mastercard -- earning is on 04/29 -- They have the second highest processing in US. Also like Visa. If you are playing earning, any puts within 5% will be good. \n\nc. Discover ( DFS)  (Diner Club,  Union Pay) --- Earning  4/22 -- I had  15 X $2.72 01 May $34C going into earning. CALLS?? WTF?? 1.) they announced dividends right before earnings. 2.) They own debit networks. Think grocery stores, liquor stores, cannabis shops. 3.) Dinner club, union pay, paypal all goes through them to process on a traditional level. \n\nResults: \n\nQ1 GAAP EPS of -$0.25 misses by $1.61.\n\nRevenue of $2.89B (+4.7% Y/Y) beats by $10M.\n\nShares -5.3% AH.\n\nGoing to exit my position at open with probably 40% losses. \n\nThis is good, if  DFS  missed by bad, the rest will be way way worst. \n\nd. American Express ( AXP) ---  rich people’s credit card. \n\n2.) Sponsoring Bank   ---\n\na. FITB -- 4/21 --  missed earning. Went down on 4/21 then went back up. \n\n📷\n\n3.) Issuing Bank --- I would not touch issuing bank as they are too diversified.\n\na. Chase\n\nb. Bank of America\n\n4.) Processor  -- do your own research.  \n\na. Global Payments\n\nb. Fiserv\n\n**Other:** \n\nSQ ( Square) -- earning 05/06. I did not talked about Payment facilitator. Which is kinda of what they are.   Here was a post on here  “ Square InC, SQ Puts—let’s be rational. Right direction but wrong DD. \n\nSquare  is all domestic and make their money primary from \n\n1.)  Credit Card processing --- they will give merchant, 2.75% or $275 total fees. Their credit card processing  is net negative since inception. The reason is because of their client base ( mom and pop, start up, small transactions type businesses). 2.75% is a good percentage on volume but the $0.00 per swipe is killing them by the time they have to pay out interchanges  and dues assessments.  Their average ticket have to be over $25.00 to be profit. But the business model will not allow it. Small mom and pop go to them because lax underwriting,  and it’s a lot easier vs a traditional model. Most of their merchants is under 10k in processing. \n\n2.) Hardware sales  --- very minimal 1 time revenue \n\n3.) SAS ( Service as a subscription) -- Minimal revenue when comparing to credit card processing. They are also waiving all the software subscription fees for the month of April. \n\n4.) Others…………\n\n**I WOULD NOT TOUCH SQUARE.** \n\n1.)  In fintech, you don’t need to be making money. You can have years of losses and stock will go up. Why ? because it’s about acquiring a large merchant base. \n\n2.) Jack Dorsey -- yes the Twitter guy. He’s the founder and ceo of Square. He’s the Elon Musk of this  space. And you don’t mess with papa  Elon. \n\n3.)  SQ is  APPROVED to make Emergency Small-Business Coronavirus loans. [https://www.nasdaq.com/articles/heres-why-paypal-and-square-are-rising-today-2020-04-22](https://www.nasdaq.com/articles/heres-why-paypal-and-square-are-rising-today-2020-04-22)\n\nThe exposure they get from this is HUGGGGEEEEEEEE. \n\nAsk yourself, does bad earnings = STONK  go down ???????? \n\nGO with VISA puts, a lot safer. \n\nShouts out to: \n\nu/howgreatareyourdanes \\--- great post on “ Mortgage Servicing”\n\nu/carbonEmitter \\--- great  insight into “ Oil to crash again”\n\nu/Variation-Separate  \\--- great  insight into the Macro market.",
        "subreddit": "wallstreetbets",
        "title": "Credit Card Processing -- indicator for Consumers Spending",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/g6merb/credit_card_processing_indicator_for_consumers/",
        "created": 1587676447.0
    },
    {
        "author": "ScoMoTrudeauApricot",
        "created_utc": 1587627139,
        "id": "g6idj1",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "TLDR: 50% of Square's revenue comes from processing in-store transactions for physical merchants.  SQ said transactions volumes for all its merchants were down 25% on March 24th, but estimates from Opentable and other sources suggest things have gotten a lot worse since then.  45% of $SQ's transactions revenue comes from small merchants doing less than $125k in payments through it each year, and as much as 60% of SQ's overall revenues could come from restaurants, retail, and SMB \"services\" (like your wife's boyfriend).  Based on how Germany, China, and Korea have been recovering, small merchants will likely not get their in-store revenues back to normal until Spring 2021.  In spite of all this, since late Feb, the stock has outperformed its peers by 700 bps and the S%P by 1900 bps, as management talks up how their Cash App can earn a bunch of money being an intermediary for the JPOW SMB loans and TrumpBuxx.  However, even all that is unlikely to offset what very rough math indicates will be up to 75% of their EBITDA going away for the year.  SQ's next earnings call is May 6th.  \n1. What is Square?  \nSquare offers payment services for small businesses through credit card and touchless dongles it gives merchants.  It gets a \\~1% cut after interchange fees for this service.  \n[https://jumbotron-production-f.squarecdn.com/assets/84657895c610afea678d.jpg](https://jumbotron-production-f.squarecdn.com/assets/84657895c610afea678d.jpg)  \n[https://solidshop-production-f.squarecdn.com/spree/images/31/modal/tile-contactless-chip-reader.jpg](https://solidshop-production-f.squarecdn.com/spree/images/31/modal/tile-contactless-chip-reader.jpg)  \nIn case you're wondering, you have to be in a store to pay via these pieces of injection-molded art.  \nThey also offer a cash app and working capital loans to the small businesses they've signed up.  \n2. Who uses Square?  \nThis guy, and people like him:  \n[https://imgur.com/a/SIqjItY](https://imgur.com/a/SIqjItY)  \nMeet Chef Romeo of Romeo Chocolates in Long Beach, California.  When he's not busy making artisanal chocolate, he's getting his photo slapped onto page one of Square's 2019 Annual Report.  \n3. Are they still using Square?  \nNo. Square claims they have an ecommerce api like Paypal or Stripe / Shopify, but adoption is low.  Case in point, Romeo Chocolates:  \n[https://imgur.com/a/CSmn0ox](https://imgur.com/a/CSmn0ox)  \nIn these times of woe, Chef Romeo prefers you place your orders online.  For those orders, who helps process the payments? Google. Paypal. Shopify. Not Square.  \n4. How bad does it get?  \nVery bad. 50% of SQ's revenue comes from transaction payment processing (fees from Gross Payment Volume, or GPV); 45% of that comes from merchants who make less than 125k in payments volume through the platform and another 27% comes from merchants who make less than 500k in payments volume through the platform. Assuming half these smaller merchants are going to be doing minimal in-store business for the next 2 quarters, and most of these merchants will no longer use the SW services Square offers... you're looking at up to $350M of EBITDA impact, possibly more.  Square's FY20E was \\~$500M, so this is a \\~80% impact.  \n5. Why is SQ up?  \n[https://imgur.com/a/DqRR2Rq](https://imgur.com/a/DqRR2Rq)  \nFor some reason, investors are confusing SQ's customer base with those of First Data/Fiserv, Elavon, Paypal, and Adyen.  Those companies are not the same as Square.  Their merchants are not hip.  No, those merchants (ie Costco) are sell uncool but wildly profitable things like toilet paper and bottled water.  In the COVIDian Maslow hierarchy, Costco beats sub-125k GPV merchants like Romeo Chocolates.  And over 60% of Squares customers are small retailers and restaurants.  Not exactly COVID proof.  \n6. When is the shoe going to drop?  \nMay 6th is when Square releases earnings.  Investors will be looking for good vibes from the TrumpBuxx and JPOW SMB loans but all they will see - in the numbers - is a cavalcade of destruction.  I for one will enjoy watching management defend TEV/Forward Ebitda at 75x when Forward EBITDA is projected to drop 80% this year.  \nThis is what Opentable says around half of Square's customer base has become:  \n[https://imgur.com/a/myJWpTx](https://imgur.com/a/myJWpTx)  \nDoes this look like something worth 11x revenue to you?",
        "subreddit": "wallstreetbets",
        "title": "Why it's not hip to be Square ($SQ)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/g6idj1/why_its_not_hip_to_be_square_sq/",
        "created": 1587655939.0
    }
]