[
    {
        "author": "companion_2_the_wind",
        "created_utc": 1584153339,
        "id": "fibmb6",
        "num_comments": 120,
        "num_crossposts": 0,
        "selftext": "With Bill Gates at Microsoft and David Abney at UPS this week i remembered a list i saw... elsewhere on reddit and wanted to see if WSB had any thoughts.\n\n&amp;#x200B;\n\nList of CEOs stepping down this year leading up to and since the recent market turmoil:\n\n&amp;#x200B;\n\n1. Microsoft, Bill Gates, 3/13 after forever\n2. UPS, David Abney, 3/12 (after 6Y)\n3.  **Disney** CEO, Bob Iger, 2/25 (after 15 Y)\n4. **MasterCard** CEO, Ajay Banga, 2/25 (after 10 Y)\n5. **Salesforce** CEO, Keith Block, 2/25 (after 18 M)\n6. Uber Eats VP, Jason Droege, 2/25 (after 6 Y)\n7. Outdoor Voices CEO, Tyler Haney, 2/25 (after 8 Y)\n8. Cansortium Cannabis CEO, Jose Hidalgo, 2/25 (after 5 Y)\n9. **St. Luke's Hospital** CEO, Christine Candio, 2/25 (after 5 Y) (one of St. Louis' biggest hospitals)\n10. JCPenney CMO, Shawn Gensch, 2/25 (after 9 M)\n11.  Bowers &amp; Wilkins CEO Gregory Lee, 2/24 (after 2 M)\n12. Bowers &amp; Wilkins CFO Gideon Yu, 2/24 (after 4 Y)\n13.  **L Brands** CEO, Les Wexner, 2/20 (after 57 Y)\n14. **Credit Suisse** CEO, Tidjane Thiam, 2/13 (after 5 Y)\n15. **MGM** CEO, Jim Murren, 2/12 (after 12 Y)\n16. Aurora Cannabis CEO, Terry Booth, 2/6 (+other big cuts)\n17. **LinkedIn** CEO, Jeff Weiner, 2/5 (after 11 Y)\n18. **HULU** CEO, Randy Freer, 1/31 (after 2 Y)\n19. **IBM** CEO , Ginni Rometty, 1/30 (after 8 Y)\n20. Match.com CEO, Mandy Ginsberg, 1/29 (health) \n21.  **International Airlines Group (IAG)** CEO, Willie Walsh, 1/9 (after 9 Y)   \n\n&amp;#x200B;\n\nIs this par for the course? Seems like a lot to me.",
        "subreddit": "wallstreetbets",
        "title": "List of CEOs stepping down recently...",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fibmb6/list_of_ceos_stepping_down_recently/",
        "created": 1584182139.0
    },
    {
        "author": "TheBreadMakerr",
        "created_utc": 1584076341,
        "id": "fhuja2",
        "num_comments": 45,
        "num_crossposts": 0,
        "selftext": "So I wanted to share my thoughts on the overall market outlook and what to do with your money when it comes to stocks, 401k, IRAs, and Mortgages. I know most people reading this have probably never experienced anything remotely close to this before in their lifetime. The information I am going to go over below are just my personal opinions and what I would do.\n\n### Market Outlook\n\nI'm going to break this portion up into three sections. The first section I will discuss the earlier issues we experienced with COVID-19 in China. The second section will go over how COVID-19 impacts the market over the next 6-12 months. And the third section I will discuss what I call \"The Perfect Storm\".\n\n**Big Business Supply Chain**\n\nSo to start we need to understand how the original impacts of COVID-19 in China have and will impact our market. Over 75% of US companies had their supply chains disrupted due to China having to shut down during the outbreak. Why does this matter? Well think about some of the big companies that had this happen, Amazon, Google, Microsoft, IBM, Intel. A lot of these companies have already come out and said that they are going to miss their expected earnings during the next quarter. I believe this is already somewhat priced in but I believe the recovery time for these business will be much longer than 1 quarter. You can expect most of these companies to suffer from this for the next 6-9 months at least. So now you have to realize that a lot of large corporations are going to miss their quarterly earnings for up to the next year.\n\n**COVID-19 and the United States**\n\nWe just briefly went over how these businesses supply chains got thrown out of whack and could take up to a year to recover. Now COVID-19 has crept its way into the US and is already presenting some big time operational issues for these same businesses that are already dealing with supply chain problems. As you may have heard over the past couple days a lot of businesses are trying to find ways to allow employees to work remotely or sending people home, schools are shutting down, sporting leagues are getting suspended and this is just the first few thousand cases that have been identified. How does this impact the market? Well, let's think about tech companies, a lot of these companies have yearly computer, phone, smart device, tablet upgrades. How are they going to meet that demand when they had supply chain delays in China and are now experiencing operations slow downs in the US? Point blank - they aren't. Most of these companies are more than likely to announce significant delays in product launches which is going to trigger uncertainty from shareholders which will result in drop in stock prices. This is going to be a prevalent theme for quite a while. This is going to cause fear in investors and continue to see heavier sell volume than buy volume over the next 6-9 months until these companies stabilize again.\n\n**The Perfect Storm**\n\nLet me breakdown what I am calling the perfect storm and why I think it is going to shake things up further with the market. The first part of this perfect storm is what I covered above which is COVID-19, I already detailed why this is going to impact the market and have a lasting effect over the next 6 months. The second part is the recent Saudi Arabia and Russia oil price wars, the oil and gas sector has taken a huge hit due to this and combined that with COVID-19 and travel bans, you now have a pandemic across the world and a war on oil overseas. The third and final piece of this perfect storm is the upcoming election. The run-up to an election always shakes up the stock market because you have all these shareholders having uncertainty when it comes to the candidates and who is going to be best for businesses and who is projected to win and this causes major ebbs and flows in the market as we get closer to a presidential election. So now lets review, we have uncertainty with COVID-19 and what the current and future impacts will be. We have uncertainty on the oil price war overseas and how that's going to play out, and in about 3-4 months we will have uncertainty within the market around the election. Combining all these factors we will see some continued significant drops over the next 12 month period.\n\nAt this point I do believe we will fall into an economic recession based off the above information, we will be in a downtrend for at least the next 6 months and depending on how long it takes the US to recover from COVID-19 we could see the impact for at least 1 year potentially longer.\n\n### Ok, So What Do I Do With My Money?\n\nLet's kick things off by discussing your 401k, so I'm sure some of you that are younger may be freaking out a bit and wondering should I sell out of my 401k funds and just keep the account cash? Should I move the funds into bonds? Let me give you this to think on, so lets say you can't withdraw your 401k for at least another 10 years, in my opinion your best bet is to leave your 401k alone, don't touch it. You may think, how does that make any sense? Well for starters the market always bounces back so I wouldn't worry too much about seeing your account balance go down in the short term, always remember that your 401k is a long term play. The other factor is you can view this as an opportunity, I would recommend to continue to put money towards your 401k as it allows you to essentially average yourself down on the shares that you currently have. This presents a great opportunity for you to see a nice increase in the shares you buy now and for the foreseeable future because those shares will eventually become very profitable once the market comes out of the bear market/recession a few years from now. Think about the prices that people were able to buy their 401k shares at back in 2008 and how much of a come up they have seen since. Have that mindset going into this upcoming time.\n\nThe next topic I wanted to touch on is something I have gotten a lot of questions on the past few weeks, which is investors and traders asking me What Should I Buy Into? Well right now, I believe the answer is: Nothing! In my opinion COVID-19 news is going to get worse, more cases, more business and educational challenges, more high profile people getting diagnosed. Remember when China first had the outbreak it grew exponentially the first few weeks before leveling off, the same thing is going to happen in the US. Until we start to see it level off a bit, then market is going to see some violent swings to the downside, I don't believe a good buying opportunity will present itself for at least another 10-14 days maybe longer. Once we get past the brunt of it, I believe some of the best longer term plays to invest in will be the Oil and Gas sector. Two of the leaders in this sector are COP and XOM, these stocks pay a nice dividend, are sector leaders and have been around forever. They both have lost roughly 50% of their per share value and are setup well for you to make a healthy return within the next few years. Look back when these stocks took a dive in 2016 and the recovery they have had since. This presents another great opportunity to buy in and hold for some big returns. Just remember, you more than likely will not catch the very bottom on these stocks, I recommend entering with a starter position and gradually scale yourself in to maximize your potential returns.\n\nThe last thing I wanted to touch on is your mortgage. A lot of people are inquiring about refinancing their homes right now. This is not a bad idea if you can at least shave 0.75 points off your interest rate. However, I personally believe rates will continue to drop as we go through these trying times, I believe the opportunity will present itself over the next 6 months to get an even lower rate. I also believe we may see additional federal rate cuts to assist homeowners and help with the potential economic recession we will be entering. I would recommend if you really need to refinance to help out your financial situation right now then go ahead and do it if you will save more than 0.75 points by doing so. However, if you are in a more comfortable position currently you may want to hold out a little longer for the potential of snagging an even lower rate and presenting yourself with a better financial opportunity.\n\n### Final Thoughts\n\nThat about wraps up my market outlook and my thoughts on how to best handle your money during these times. I believe if you are on the younger side, don't get discouraged about what's happening, look at it as an opportunity to grow your financial wealth and knowledge. We are in weird time where a lot of uncertainty is entering the market and our daily lives. I recommend checking out some stock charts and information from back in the 1980s or 2008 to see what happened and how the market recovered and think about the opportunity you may presented with to capitalize on this and set yourself up well for the future.\n\nHope you enjoyed this information and found it informative. If you want to chat further about it feel free to provide some comments below or you can find me on Twitter: [**https://twitter.com/TheBreadMakerr**](https://twitter.com/TheBreadMakerr)\n\nAlso if you want to read this and more about the market you can here: [https://breadmakerpro.com/d/125-what-do-i-do-with-my-money-market-outlook](https://breadmakerpro.com/d/125-what-do-i-do-with-my-money-market-outlook)",
        "subreddit": "StockMarket",
        "title": "What Do I Do With My Money? - Market Outlook",
        "url": "https://www.reddit.com/r/StockMarket/comments/fhuja2/what_do_i_do_with_my_money_market_outlook/",
        "created": 1584105141.0
    },
    {
        "author": "drinkyafkingmilk",
        "created_utc": 1584381750,
        "id": "fjpawh",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "It was just an extremely unfortunate event that a couple days to a week after I had invested a significant amount of savings into stocks during the 2nd or 3rd week of February, this whole corona crisis blew up and destroyed the market. I definitely didn't see it coming. There are probably many others who are in the same boat as I am and I just had the mindset of \"gotta hold, it's gonna recover soon\" but now I'm really starting to feel that worry and fear that the market is not going to recover for a long time since according to many reports, we aren't even at the peak of the crisis yet. I'm down about an average of 10-12 percent from my initial buy in. Fortunately enough, I did buy actual \"good\" stocks (objectively speaking) most of which are technology stocks - MSFT, NVIDIA, AMD, IBM, etc. How worried should I be? Is the best idea to just hold?",
        "subreddit": "stocks",
        "title": "Put a significant amount of my savings into stocks during mid Feb before the whole corona crisis blew up - should I be worried?",
        "url": "https://www.reddit.com/r/stocks/comments/fjpawh/put_a_significant_amount_of_my_savings_into/",
        "created": 1584410550.0
    },
    {
        "author": "edouardh",
        "created_utc": 1583266481,
        "id": "fd0p1z",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "Just for the context, I'm discovering this company for the first time. But it seems to me that a 114 years old company successfully pivoting towards Quantum Computing is quite impressive. It remembers me IBM history and its ability to go throw any kind of crisis.  \n\n\nDuring this tough times, it looks like a solid pick but I may be missing some points in the picture.  \n\n\nSource:  [https://techcrunch.com/2020/03/03/honeywell-says-it-will-soon-launch-the-worlds-most-powerful-quantum-computer/](https://techcrunch.com/2020/03/03/honeywell-says-it-will-soon-launch-the-worlds-most-powerful-quantum-computer/)",
        "subreddit": "stocks",
        "title": "Honeywell says it will soon launch the world’s most powerful quantum computer for JPMorgan Chase, what are your thoughts?",
        "url": "https://www.reddit.com/r/stocks/comments/fd0p1z/honeywell_says_it_will_soon_launch_the_worlds/",
        "created": 1583295281.0
    },
    {
        "author": "TheBreadMakerr",
        "created_utc": 1584076900,
        "id": "fhumnu",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "So I wanted to share my thoughts on the overall market outlook and what to do with your money when it comes to stocks, 401k, IRAs, and Mortgages. I know most people reading this have probably never experienced anything remotely close to this before in their lifetime. The information I am going to go over below are just my personal opinions and what I would do.\n\nMarket Outlook\n\nI'm going to break this portion up into three sections. The first section I will discuss the earlier issues we experienced with COVID-19 in China. The second section will go over how COVID-19 impacts the market over the next 6-12 months. And the third section I will discuss what I call \"The Perfect Storm\".\n\n**Big Business Supply Chain**\n\nSo to start we need to understand how the original impacts of COVID-19 in China have and will impact our market. Over 75% of US companies had their supply chains disrupted due to China having to shut down during the outbreak. Why does this matter? Well think about some of the big companies that had this happen, Amazon, Google, Microsoft, IBM, Intel. A lot of these companies have already come out and said that they are going to miss their expected earnings during the next quarter. I believe this is already somewhat priced in but I believe the recovery time for these business will be much longer than 1 quarter. You can expect most of these companies to suffer from this for the next 6-9 months at least. So now you have to realize that a lot of large corporations are going to miss their quarterly earnings for up to the next year.\n\n**COVID-19 and the United States**\n\nWe just briefly went over how these businesses supply chains got thrown out of whack and could take up to a year to recover. Now COVID-19 has crept its way into the US and is already presenting some big time operational issues for these same businesses that are already dealing with supply chain problems. As you may have heard over the past couple days a lot of businesses are trying to find ways to allow employees to work remotely or sending people home, schools are shutting down, sporting leagues are getting suspended and this is just the first few thousand cases that have been identified. How does this impact the market? Well, let's think about tech companies, a lot of these companies have yearly computer, phone, smart device, tablet upgrades. How are they going to meet that demand when they had supply chain delays in China and are now experiencing operations slow downs in the US? Point blank - they aren't. Most of these companies are more than likely to announce significant delays in product launches which is going to trigger uncertainty from shareholders which will result in drop in stock prices. This is going to be a prevalent theme for quite a while. This is going to cause fear in investors and continue to see heavier sell volume than buy volume over the next 6-9 months until these companies stabilize again.\n\n**The Perfect Storm**\n\nLet me breakdown what I am calling the perfect storm and why I think it is going to shake things up further with the market. The first part of this perfect storm is what I covered above which is COVID-19, I already detailed why this is going to impact the market and have a lasting effect over the next 6 months. The second part is the recent Saudi Arabia and Russia oil price wars, the oil and gas sector has taken a huge hit due to this and combined that with COVID-19 and travel bans, you now have a pandemic across the world and a war on oil overseas. The third and final piece of this perfect storm is the upcoming election. The run-up to an election always shakes up the stock market because you have all these shareholders having uncertainty when it comes to the candidates and who is going to be best for businesses and who is projected to win and this causes major ebbs and flows in the market as we get closer to a presidential election. So now lets review, we have uncertainty with COVID-19 and what the current and future impacts will be. We have uncertainty on the oil price war overseas and how that's going to play out, and in about 3-4 months we will have uncertainty within the market around the election. Combining all these factors we will see some continued significant drops over the next 12 month period.\n\nAt this point I do believe we will fall into an economic recession based off the above information, we will be in a downtrend for at least the next 6 months and depending on how long it takes the US to recover from COVID-19 we could see the impact for at least 1 year potentially longer.\n\nOk, So What Do I Do With My Money?\n\nLet's kick things off by discussing your 401k, so I'm sure some of you that are younger may be freaking out a bit and wondering should I sell out of my 401k funds and just keep the account cash? Should I move the funds into bonds? Let me give you this to think on, so lets say you can't withdraw your 401k for at least another 10 years, in my opinion your best bet is to leave your 401k alone, don't touch it. You may think, how does that make any sense? Well for starters the market always bounces back so I wouldn't worry too much about seeing your account balance go down in the short term, always remember that your 401k is a long term play. The other factor is you can view this as an opportunity, I would recommend to continue to put money towards your 401k as it allows you to essentially average yourself down on the shares that you currently have. This presents a great opportunity for you to see a nice increase in the shares you buy now and for the foreseeable future because those shares will eventually become very profitable once the market comes out of the bear market/recession a few years from now. Think about the prices that people were able to buy their 401k shares at back in 2008 and how much of a come up they have seen since. Have that mindset going into this upcoming time.\n\nThe next topic I wanted to touch on is something I have gotten a lot of questions on the past few weeks, which is investors and traders asking me What Should I Buy Into? Well right now, I believe the answer is: Nothing! In my opinion COVID-19 news is going to get worse, more cases, more business and educational challenges, more high profile people getting diagnosed. Remember when China first had the outbreak it grew exponentially the first few weeks before leveling off, the same thing is going to happen in the US. Until we start to see it level off a bit, then market is going to see some violent swings to the downside, I don't believe a good buying opportunity will present itself for at least another 10-14 days maybe longer. Once we get past the brunt of it, I believe some of the best longer term plays to invest in will be the Oil and Gas sector. Two of the leaders in this sector are COP and XOM, these stocks pay a nice dividend, are sector leaders and have been around forever. They both have lost roughly 50% of their per share value and are setup well for you to make a healthy return within the next few years. Look back when these stocks took a dive in 2016 and the recovery they have had since. This presents another great opportunity to buy in and hold for some big returns. Just remember, you more than likely will not catch the very bottom on these stocks, I recommend entering with a starter position and gradually scale yourself in to maximize your potential returns.\n\nThe last thing I wanted to touch on is your mortgage. A lot of people are inquiring about refinancing their homes right now. This is not a bad idea if you can at least shave 0.75 points off your interest rate. However, I personally believe rates will continue to drop as we go through these trying times, I believe the opportunity will present itself over the next 6 months to get an even lower rate. I also believe we may see additional federal rate cuts to assist homeowners and help with the potential economic recession we will be entering. I would recommend if you really need to refinance to help out your financial situation right now then go ahead and do it if you will save more than 0.75 points by doing so. However, if you are in a more comfortable position currently you may want to hold out a little longer for the potential of snagging an even lower rate and presenting yourself with a better financial opportunity.\n\nFinal Thoughts\n\nThat about wraps up my market outlook and my thoughts on how to best handle your money during these times. I believe if you are on the younger side, don't get discouraged about what's happening, look at it as an opportunity to grow your financial wealth and knowledge. We are in weird time where a lot of uncertainty is entering the market and our daily lives. I recommend checking out some stock charts and information from back in the 1980s or 2008 to see what happened and how the market recovered and think about the opportunity you may presented with to capitalize on this and set yourself up well for the future.\n\nHope you enjoyed this information and found it informative. If you want to chat further about it feel free to provide some comments below or you can find me on Twitter: [**https://twitter.com/TheBreadMakerr**](https://twitter.com/TheBreadMakerr)\n\nAlso if you want to read this and more about the market you can here: [https://breadmakerpro.com/d/125-what-do-i-do-with-my-money-market-outlook](https://breadmakerpro.com/d/125-what-do-i-do-with-my-money-market-outlook)",
        "subreddit": "investing",
        "title": "What Do I Do With My Money? - Market Outlook",
        "url": "https://www.reddit.com/r/investing/comments/fhumnu/what_do_i_do_with_my_money_market_outlook/",
        "created": 1584105700.0
    },
    {
        "author": "Duck_Butt17",
        "created_utc": 1583788365,
        "id": "fg1z8z",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "From this list, what do the experienced investors out there think would be best to buy. I want to buy 1 or 2 to keep for the long run, and 1 that has a good chance at going up soon.\n\nIntel,\nAT&amp;T,\nIBM,\nIRobot,\nMicrosoft,\nTurtle beach,\nStitch fix,\nAmerican eagle,\nFord(prob not as it’s been crashing hard),\nUber,\nAIM,\nVaxart,\nVeritone, \nIEC,\n\nThanks to anyone who gives input or suggestions!",
        "subreddit": "stocks",
        "title": "Stock help needed",
        "url": "https://www.reddit.com/r/stocks/comments/fg1z8z/stock_help_needed/",
        "created": 1583817165.0
    },
    {
        "author": "kza1209891",
        "created_utc": 1585423877,
        "id": "fqqre6",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Hello. I have some questions please. What is a S&amp;P 500? Mutual fund? I read that if you invest in blue chips or any company listed on the dow jones ‘list’ that its a pretty safe bet. Sort of like investing in a roth ira. I have a roth ira, emergency funds. Ive got about 5k to invest in something long term, mostly safe, sort of like a set and forget thing, i dont want to lose my sanity lol. (Maybe ill fuck around with $500 or so but really idk even know about that...) Im just looking for a mostly safe way (unless all of society totally collapses then money will be the least or concerns) to invest some extra money. Been browsing here all day. Lol",
        "subreddit": "StockMarket",
        "title": "Are buying things like ETF, AMD, IBM, CVS, ATVI, NVDA, &amp; BAC investing or trading? I am looking for long term investments.",
        "url": "https://www.reddit.com/r/StockMarket/comments/fqqre6/are_buying_things_like_etf_amd_ibm_cvs_atvi_nvda/",
        "created": 1585452677.0
    },
    {
        "author": "Dashover",
        "created_utc": 1583801448,
        "id": "fg5cb8",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "\nFor Trading March 10th\n \nHISTORIC ACTION\n \nIs Cruising Over?\n \nEntire Yield Curve Under 1%\n \nToday’s market was down from overnight with the futures hitting “limit down” before 4:00AM.  The DJIA opened at 9:30, like always, but was halted within 4 minutes after hitting the “circuit-breakers” at -7% and trading was stopped for 15-minutes after which we reopened and headed lower again, touching -1946, and by noon we had recovered to only -1183, but by 3:00 we had made a new low of 23,706 -2158 before a rally to -1650 before another sell-off to close DJIA – 2013.76 (7.79%), NASDAQ -624.94 (7.29%), S&amp;P 500 -225.81 (7.60%), the Russell -135.79 (9.37%, and DJ Transports, the biggest loser -874.21 (9.76%).  Market internals were just short of absurd with numbers that I had to go to several sources to make sure were correct.  NYSE raw numbers were 70:2973 or 43:1 and NASDAQ was 169:3190 or 19:1. The DJIA was 30:0 after WMT, which held on all day fell into the red.  The biggest losers were not double, but triple-digit movers with BA -237, AAPL -155, GS -136, HD -123, CAT -117, and JPM -100DPs.  The only single digit losers were VZ and WMT.  It was an interesting day, but not one I’d like to see too often.  The market was influenced by not only COVID-19, but also the fact that OPEC couldn’t come up with an agreement to limit oil production.  Over the weekend Saudi Arabia declared a price war with Russia, the main opponent to any agreement.  Interest rates continued to fall, and that, along with the oil news sent the banking names down dramatically.  I’ll list those below in their sector.\n \nOur “open forum” on Discord, which allows me to interact with subscribers and others to allow direct questions and chart opinions on just about any stock, continues to grow with more participants every day.  It is informative and allows me to share insights as the market is open and moving.  The link is: https://discord.gg/ATvC7YZ  and I will be there and active from before the open and all day.  It’s a great place to share ideas and gain some insights.\n \nSECTORS: Other names in the news: It was a very tough day for everyone.  While we did have a “Merger Monday” deal between AON and WLTW, neither of the participants made any headway.  AON Plc, is buying Willis, Towers, Watson in the biggest insurance transaction ever and creating the world’s largest insurance broker, surpassing Marsh &amp; McLennan (MMC) and worth about $80Billion.\n \nThere were a couple of names higher, just a few, and the main ones were in the auto parts segment with ORLY finishing $373.63 +5.55 (1.51%), AZO, $1113.69 +53.38 (5.03%) and AAP $130.36 +2.45 (1.92%).  This group has been weak for the past 4-6 months.  Also higher was discounter DLTR, $83.51 +3.27 (4.08%).\n \nThe Cruise lines continued to fall with all making new lows.  RCL fell to $48.27 - 16.74 (25.75%) and down from $135 in January.  CCL fell to $21.74 -5.41 (19.93%) and down from $52, while NCLH was $19.81 – 7.29 (26.9%) and down from $60.  This is absolutely uninvestable. There will clearly be a point at which the shorts cover, but this group is dead money for a while.\n \nIn more COVID-19 news, Inovio (INO) which moved from $2.40 to $16.00 on the news that it would start human trials of its vaccine in April.  This morning at $19.36 before collapsing all the way back to $8.53 before closing $9.83 -4.26 (30.23%).\n \nBut the HOMERUN OF THE DAY was another name I talked about in this space, AIM Immuno-Tech, Inc (AIM).  The company said that its drug, Ampligen will begin testing at National Inst. Of Infectious Diseases in Japan that could play an important role in developing a protective early-onset therapy for COVID-19.  The stock has been reverse split both 1:12 in 2016 and more recently 1:44 last June and traded under $ .40 had moved up to $3.50 this month and traded up on the news finishing $6.10 +4.00 (190%) and is continuing in extended hours to $8.75 and is currently $7.69 up an additional $1.59 for a total gain of $5.59 (266%).  Quite a highlight on a dismal day.\n \n \nBIOPHARMA: was LOWER with all names falling hard with BIIB -20.76, ABBV -3.55, REGN -20.58, ISRG -44.48, MYL -1.19, TEVA -1.42, VRTX -13.85, BHC -2.69, INCY -4.42, ICPT -6.88, LABU -11.47 (24.95%), and IBB $109.80 -8.23 (6.97%).\n \nCANNABIS: stocks were LOWER with TLRY -2.47 (24.65%) and KERN -2.58 (37.34%) and none down less than 7.48%.  The ETF, MJ $11.74 -1.36 (10.38%).\n \nDEFENSE: was LOWER with some major loses by LMT -31.47, RTN -14.83, GD -13.01, TXT -5.48 (15.26%), UTX -12.48, NOC -15.58, BWXT -5.14, TDY -33.73, and ITA was $174.00 -21.04 (10.79%).\n \nRETAIL was LOWER with major losses. The brands were the biggest losers on the day.   M-1.12, JWN -1.88, KSS -2.84, DDS -2.37, JCP - .015, WMT -1.17, TGT -1.92, TJX -1.35, RL -10.78 (10.19%), UAA -1.46 (11.56%), LULU -22.44 (10.27%), TPR -3.35 (15.44%), CPRI -3.13 (13.65%) and XRT $37.01 -2.12 (5.42%).\n \nFAANG and Big Cap: were LOWER with GOOGL -80.14, AMZN -96.19, AAPL -21.42, FB -11.40, NFLX -22.48, NVDA -21.04, IBM -10.38, TSLA -92.48 (13.01%), BABA -7.24, BIDU -8.52, BA -36.22 (13.81%) on continuing problems with the 737MAX and the general market, CAT -16.42 (13.52%), DIS -10.55, and XLK $82.84 -6.07 (6.83%).\n \nFINANCIALS were LOWER with most down over 10% with the market and softness in rates with GS -19.14, JPM -13.53, BAC -3.59, MS -4.35, C -9.34, PNC -15.48, AIG -5.13, TRV -8.54, AXP -9.94, and XLF $22.80 -2.75 (10.76%).\n \nOIL, $31.13 -10.15 (24.58%) The stocks were LOWER with the dramatic fall on the “price war” between the Saudi’s and Putin.  It’s difficult to even relate to the prices I’m seeing.  In August when OXY bought APC for $57billion OXY was just over $50. Tonight it closed $12.51 –14.35 (53.43%) and the COMBINED market-cap is only $11.4Billion.  The rest of the list was equally bad with CVX -13.42, XOM -4.94, MRO 4.06 -2.77 (40.56%), MPC -5.43, APA 10.22 -10.48 (50.6%), BP -5.66 and XLE $34.98 -7.52 (17.69%).\n \nMETALS, GOLD: $1,675.70 +3.30. After the rebound, and the overnight move to $1,704.30 we sold off as liquidation hit even the yellow metal.  We managed to close up on the day, but it was a disappointment just the same.  Our $1.40 position in the GLD calls finished $1.65 +.11.\n \nBITCOIN: closed $7,850 -1,315. We broke to the downside overnight and fell to a low of $7,640, which closed a gap left on the breakout back in January.  While I want to add the 350 sold just over a week ago, I want to wait and see some stabilization.  We did have 2 subscribers add to new positions under the close today.  But we still own 400 GBTC with an average of $8.06. GBTC closed $8.86 – 1.72 today.\n \nTomorrow is another day.\n \nCAM",
        "subreddit": "options",
        "title": "Ouch!",
        "url": "https://www.reddit.com/r/options/comments/fg5cb8/ouch/",
        "created": 1583830248.0
    },
    {
        "author": "Dashover",
        "created_utc": 1584668979,
        "id": "flmgan",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "For Trading March 20th\n \nAnother Range Day\n \nYields Fall\n \nOil Rebounds\n \n \nYesterday I said that “today’s market was actually not as bad as it seemed.”  And today while we had a sharp decline early, we rallied back up toward yesterday’s  highs, and when the dust settled we were DJIA +188.27 (.95%), NASDAQ +160.74 (2.3%), S&amp;P 500 +11.29 (.47%), the Russell +67.52 (6.81%) and DJ Transports +107.29 (1.54%).  Also, yesterday I said “the obvious culprit was the Oil.  After the close, the oil bounced and held most of the gains until it had rallied up about 24% and closed $25.91 +5.08 after trading as high as $28.28.  Market internals were better with the A/D on NYSE at 3:1, and about the same on NASDAQ.  The DJIA was 17 Up, 13 Down, and for the first time in over a week, there were no triple-digit losers or gainers.  The biggest movers were MCD +83 and GS +64 on the upside and JNJ -54 DPs. Strong sectors included Energy and consumer discretionary, while the weak included utilities, consumer stables, health care and real estate.  The technology and small caps outperformed.  The thought that Mr. Trump has the relationship or talent as an arbitrator to settle a dispute between the Kingdom and Putin the thug is unlikely.  I also issued a YouTube video (#151) on today’s closing comments:  https://youtu.be/spf45YUFaxc\n \n \n \nOur “open forum” on Discord, which allows me to interact with subscribers and others to allow direct questions and chart opinions on just about any stock, continues to grow with more participants every day.  It is informative and allows me to share insights as the market is open and moving.  The link is: https://discord.gg/ATvC7YZ  and I will be there and active from before the open and all day.  It’s a great place to share ideas and gain some insights.\n \n \nSECTORS: Other names in the news: While there is plenty to discuss, I’ll just hit a few high points.  All U.S. industries are lining up with their hands out looking for their piece of however many trillions of dollars and favorable legislation they can extract through their state politicians.  While I get that nobody in the cruise industry, or the hotel and allied hospitality sectors or any manufacturing business had any fault in COVID-19, at some point in time, they must take responsibility for the cash they squandered on stock buybacks instead retaining earnings for when the business cycle went through a slowdown.  I know I’ve railed about this for a while, but Capitalism works because it enforces some degree of fiscal responsibility on the operators of business.  And if they fail, they fail.  That what the bankruptcy laws are about.  If you need a primer on it, just ask the president. If you run a business into the ground, by any means, you lose.\n \nOn the rocket to “almost the moon” followed by a crash and burn, we had Blue Apron (APRN) started the week at $2.28 and yesterday it closed $16.25 +9.70, but today after trading $28.84 before collapsing to finish $14.34 -1.91 (11.75%).  In case you forgot, this little beauty was reverse split 1:15 last year, so todays close is still under $1.00.\n \nBIOPHARMA: was HIGHER with TEVA the big winner @ $8.10 +1.41 (21.08%) on the news that it is a manufacturer of Hydroxychloroquine Sulfate, a potential treatment for COVID-19 and are donating the tablets to hospitals nationwide.  ICPT was +8.80 (18.20%), LABU +2.11 (14.36%) and IBB $99.51 +1.18 (1.2%).\n \n \nCANNABIS: Even this group had some winners with TLRY +1.16 (46.96%), PYX, yesterday’s biggest loser bounced back to close +.40 (27.59%) and MJ $9.65 +.55 (6.04%).\n \nDEFENSE: was MIXED with LMT -20.14 (6.12%), RTN +6.39, and yesterday’s big loser, TDY +25.06 (12.46%), and ITA $126.19 +2.78 (2.25%).\n \nRETAIL was MIXED with JWN +1.49 (7.54%), DDS +4.78 (12%), and WMT -3.34, RL –3.11, UAA +.94 (10.99%), CPRI +2.40 (31.91%) and XRT $29.27 +1.52 (5.48%).\n \n \nFAANG and Big Cap: were MOSTLY HIGHER with GOOGL +19.30, AMZN +43.00, AAPL -3.42, FB +3.94, NFLX +18.54, NVDA +7.48, IBM -4.50, TSLA +32.78(9.07%), BABA +1.00, BIDU +5.50, BA -7.08, CAT +1.69, DIS +4.45 and XLK $74.85 +.27 (.36%).\n \n \nFINANCIALS were MIXED with GS +4.70, JPM -.19, BAC -.04, MS -.14, C +2.57, PNC +4.76, AIG +1.77 (9.42%), TRV +4.38, AXP +1.65, and XLF $19.61 +.42 (2.19%).\n \n \nOIL, $5.91 +5.08. The stocks were HIGHER with the price of Oil trading as high as 28.28).  The oil is slightly higher in extended hours and XLE is $25.61 +1.63 (6.8%).\n \n \nMETALS, GOLD: $1,479.30 +1.40. After the liquidation of the past few day’s gold tried to work higher but gave it up closing barely changed.  I still expect a move back toward $1,600 to unfold.  \n \n \nBITCOIN: closed $6240 +900. We broke to the downside overnight and fell to a low of $4390, and for the first time in days did not make a new recent low.  Today was a strong move to the upside While I want to add the 350 sold just over a week ago, I want to wait and see some stabilization.  We still own 400 GBTC with an average of $8.06. GBTC closed $7.25 +1.24 today.\n \nTomorrow is another day.\n \nCAM",
        "subreddit": "options",
        "title": "For Trading March 20",
        "url": "https://www.reddit.com/r/options/comments/flmgan/for_trading_march_20/",
        "created": 1584697779.0
    },
    {
        "author": "TheBreadMakerr",
        "created_utc": 1584076381,
        "id": "fhujin",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "So I wanted to share my thoughts on the overall market outlook and what to do with your money when it comes to stocks, 401k, IRAs, and Mortgages. I know most people reading this have probably never experienced anything remotely close to this before in their lifetime. The information I am going to go over below are just my personal opinions and what I would do.\n\n### Market Outlook\n\nI'm going to break this portion up into three sections. The first section I will discuss the earlier issues we experienced with COVID-19 in China. The second section will go over how COVID-19 impacts the market over the next 6-12 months. And the third section I will discuss what I call \"The Perfect Storm\".\n\n**Big Business Supply Chain**\n\nSo to start we need to understand how the original impacts of COVID-19 in China have and will impact our market. Over 75% of US companies had their supply chains disrupted due to China having to shut down during the outbreak. Why does this matter? Well think about some of the big companies that had this happen, Amazon, Google, Microsoft, IBM, Intel. A lot of these companies have already come out and said that they are going to miss their expected earnings during the next quarter. I believe this is already somewhat priced in but I believe the recovery time for these business will be much longer than 1 quarter. You can expect most of these companies to suffer from this for the next 6-9 months at least. So now you have to realize that a lot of large corporations are going to miss their quarterly earnings for up to the next year.\n\n**COVID-19 and the United States**\n\nWe just briefly went over how these businesses supply chains got thrown out of whack and could take up to a year to recover. Now COVID-19 has crept its way into the US and is already presenting some big time operational issues for these same businesses that are already dealing with supply chain problems. As you may have heard over the past couple days a lot of businesses are trying to find ways to allow employees to work remotely or sending people home, schools are shutting down, sporting leagues are getting suspended and this is just the first few thousand cases that have been identified. How does this impact the market? Well, let's think about tech companies, a lot of these companies have yearly computer, phone, smart device, tablet upgrades. How are they going to meet that demand when they had supply chain delays in China and are now experiencing operations slow downs in the US? Point blank - they aren't. Most of these companies are more than likely to announce significant delays in product launches which is going to trigger uncertainty from shareholders which will result in drop in stock prices. This is going to be a prevalent theme for quite a while. This is going to cause fear in investors and continue to see heavier sell volume than buy volume over the next 6-9 months until these companies stabilize again.\n\n**The Perfect Storm**\n\nLet me breakdown what I am calling the perfect storm and why I think it is going to shake things up further with the market. The first part of this perfect storm is what I covered above which is COVID-19, I already detailed why this is going to impact the market and have a lasting effect over the next 6 months. The second part is the recent Saudi Arabia and Russia oil price wars, the oil and gas sector has taken a huge hit due to this and combined that with COVID-19 and travel bans, you now have a pandemic across the world and a war on oil overseas. The third and final piece of this perfect storm is the upcoming election. The run-up to an election always shakes up the stock market because you have all these shareholders having uncertainty when it comes to the candidates and who is going to be best for businesses and who is projected to win and this causes major ebbs and flows in the market as we get closer to a presidential election. So now lets review, we have uncertainty with COVID-19 and what the current and future impacts will be. We have uncertainty on the oil price war overseas and how that's going to play out, and in about 3-4 months we will have uncertainty within the market around the election. Combining all these factors we will see some continued significant drops over the next 12 month period.\n\nAt this point I do believe we will fall into an economic recession based off the above information, we will be in a downtrend for at least the next 6 months and depending on how long it takes the US to recover from COVID-19 we could see the impact for at least 1 year potentially longer.\n\n### Ok, So What Do I Do With My Money?\n\nLet's kick things off by discussing your 401k, so I'm sure some of you that are younger may be freaking out a bit and wondering should I sell out of my 401k funds and just keep the account cash? Should I move the funds into bonds? Let me give you this to think on, so lets say you can't withdraw your 401k for at least another 10 years, in my opinion your best bet is to leave your 401k alone, don't touch it. You may think, how does that make any sense? Well for starters the market always bounces back so I wouldn't worry too much about seeing your account balance go down in the short term, always remember that your 401k is a long term play. The other factor is you can view this as an opportunity, I would recommend to continue to put money towards your 401k as it allows you to essentially average yourself down on the shares that you currently have. This presents a great opportunity for you to see a nice increase in the shares you buy now and for the foreseeable future because those shares will eventually become very profitable once the market comes out of the bear market/recession a few years from now. Think about the prices that people were able to buy their 401k shares at back in 2008 and how much of a come up they have seen since. Have that mindset going into this upcoming time.\n\nThe next topic I wanted to touch on is something I have gotten a lot of questions on the past few weeks, which is investors and traders asking me What Should I Buy Into? Well right now, I believe the answer is: Nothing! In my opinion COVID-19 news is going to get worse, more cases, more business and educational challenges, more high profile people getting diagnosed. Remember when China first had the outbreak it grew exponentially the first few weeks before leveling off, the same thing is going to happen in the US. Until we start to see it level off a bit, then market is going to see some violent swings to the downside, I don't believe a good buying opportunity will present itself for at least another 10-14 days maybe longer. Once we get past the brunt of it, I believe some of the best longer term plays to invest in will be the Oil and Gas sector. Two of the leaders in this sector are COP and XOM, these stocks pay a nice dividend, are sector leaders and have been around forever. They both have lost roughly 50% of their per share value and are setup well for you to make a healthy return within the next few years. Look back when these stocks took a dive in 2016 and the recovery they have had since. This presents another great opportunity to buy in and hold for some big returns. Just remember, you more than likely will not catch the very bottom on these stocks, I recommend entering with a starter position and gradually scale yourself in to maximize your potential returns.\n\nThe last thing I wanted to touch on is your mortgage. A lot of people are inquiring about refinancing their homes right now. This is not a bad idea if you can at least shave 0.75 points off your interest rate. However, I personally believe rates will continue to drop as we go through these trying times, I believe the opportunity will present itself over the next 6 months to get an even lower rate. I also believe we may see additional federal rate cuts to assist homeowners and help with the potential economic recession we will be entering. I would recommend if you really need to refinance to help out your financial situation right now then go ahead and do it if you will save more than 0.75 points by doing so. However, if you are in a more comfortable position currently you may want to hold out a little longer for the potential of snagging an even lower rate and presenting yourself with a better financial opportunity.\n\n### Final Thoughts\n\nThat about wraps up my market outlook and my thoughts on how to best handle your money during these times. I believe if you are on the younger side, don't get discouraged about what's happening, look at it as an opportunity to grow your financial wealth and knowledge. We are in weird time where a lot of uncertainty is entering the market and our daily lives. I recommend checking out some stock charts and information from back in the 1980s or 2008 to see what happened and how the market recovered and think about the opportunity you may presented with to capitalize on this and set yourself up well for the future.\n\nHope you enjoyed this information and found it informative. If you want to chat further about it feel free to provide some comments below or you can find me on Twitter: [**https://twitter.com/TheBreadMakerr**](https://twitter.com/TheBreadMakerr)\n\nAlso if you want to read this and more about the market you can here: [https://breadmakerpro.com/d/125-what-do-i-do-with-my-money-market-outlook](https://breadmakerpro.com/d/125-what-do-i-do-with-my-money-market-outlook)",
        "subreddit": "pennystocks",
        "title": "What Do I Do With My Money? - Market Outlook",
        "url": "https://www.reddit.com/r/pennystocks/comments/fhujin/what_do_i_do_with_my_money_market_outlook/",
        "created": 1584105181.0
    },
    {
        "author": "Dashover",
        "created_utc": 1585181315,
        "id": "fp1dcj",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "For Trading March 26th\n \nSanders Foils Rally\n \nBA Drives the DJIA\n \n \n \nToday was driven early by BA and the statement that it would not need to accept the kind of share dilution that would be part of a government bailout.  The market seemed to take that as a good thing, at least for BA, which has rebounded from $89.00 to a high of $174.77 in the last week.  This dragged the DJIA higher but left the S&amp;P and NASDAQ down at the open.  We had a great deal of enthusiasm in both directions but by late in the day everyone was in the green.  While there were selloffs in all the indexes on the news that Bernie Sanders would oppose the current relief legislation because it gave corporations to easy a time, and Ms. AOC saying that she MAY oppose the unanimous consent resolution, which would delay financial relief, we finished with the DJIA +495.55 (2.39%), NASDAQ – 33.56 (.45%) and S&amp;P 500 +28.23 !.15%), the Russell +13.83 (1.26%) and the DJ Transports +184.07 (2.44%) the biggest winner, but off 424 off its high.  Market internals were okay, with NYSE 4:1 and NASDAQ only 1.7:1 up.  The DJIA was 18:12 higher but the biggest 5 gainers, BA +210, UNH +100, UTX +63, V +50 and AXP +24DP’s added up to a gain of $465.\nThis the link to my closing comment:  https://youtu.be/BW3S_KKvjAo\n \nUnfortunately we bought some SPY puts (a small position) at $3.20 that closed @ $2.91, and were stopped out @ $1.58 today.\n \n \nOur “open forum” on Discord, which allows me to interact with subscribers and others to allow direct questions and chart opinions on just about any stock, continues to grow with more participants every day.  It is informative and allows me to share insights as the market is open and moving.  The link is: https://discord.gg/ATvC7YZ  and I will be there and active from before the open and all day.  It’s a great place to share ideas and gain some insights, and we’ve grown to almost 800 members.\n \n \nSECTORS: Other names in the news: As mentioned above, we had the BA announcement, and after falling in the last 2 months from $350 to a low of $89, (75%), it was as high as $174.77 today but closed $155.00 +27.32 (21.4%).  NKE had earnings after the close last night and after falling from $95 to $60, has rebounded to close today $79.01 +6.68 (9.24%).  \n \n \nBIOPHARMA: was MIXED with ISRG the big gainer +28.41 (6.58%) and ICPT +3.97 (6.84%).  VRTX was the biggest loser -13.04 (5.84%). The IBB was $102.00 -.57 (.55%).\n \n \nCANNABIS: This group finally caught a bid on the news that several reported big jumps in revenues in California with TLRY + 1.38 (34.33%), still not impressive after falling from $300, CGC +1.02 (7.86%), CRON +.20, GWPH +1.25, ACB +.04, PYX +.14, NBEV +.05, CURLF -.38 (9.79%), KERN +.78 (18.13%) and MJ $11.45 +1.04 (9.99%).\n \n \nDEFENSE: was HIGHER with none up less than 5% and several gainers like LMT +33.34 (11.54%), TXT +3.05 (13.27%), UTX +9.43 (10.87% and 63 DPs), TDY +21.17 (7.97%) with ITA $147.97 +16.80 (12.81%).\n \n \nRETAIL was MIXED with the retailers mixed but the brands all higher.  M +.91 (16.06%), JWN -.26, KSS +1.25, DDS -2.29 (4.87%) and WMT -5.53 (4.81%) while RL +1.13, UAA +.14, LULU +2.51, TPR +1.18 (8.6%), CPRI +1.78 (16.02%) and XRT $30.26 +.52 (1.75%).\n \n \nFAANG and Big Cap: were MIXED with GOOGL -26.01, AMZN -46.10, AAPL +.18, FB -3.88, NFLX -14.71, NVDA -.95, IBM +.52, TSLA +35.00, BABA +4.25, BIDU +.82, BA +37.07, CAT +2.66, DIS +3.00, and XLK $77.50 -.11 (.14%).\n \n \nFINANCIALS were HIGHER with only TRV lower -2.05 (2.19%).  AIG was the biggest gainer +2.79 (12.17%) followed by AXP +6.59 (7.84%) and JPM +3.07 (3.47%).  XLF was $20.33 +.48 (2.42%).\n \n \nOIL, $24.49 +.48. The stocks were HIGHER with the price of Oil trading up slightly but the stocks trading with the overall market.  MPC was the leader +3.85 (22%), BP +2.35 (10.62%), CVX +2.74 (4.12% and XLE $28.33 +.98 (3.58%).\n \n \nMETALS, GOLD: $1,633.40 -27.40 After the biggest I’ve ever seen in 50+years of trading.  We sold our calls yesterday and after trading down to $1615, I am interested again.  I put out this short video this afternoon…  https://youtu.be/2vCymNxtNA4\n \n \nBITCOIN: closed $6630 -95. We traded in a short range again today and finished mid-range on the day. While I want to add the 350 sold just over a week ago, I want to wait and see some stabilization.  We still own 400 GBTC with an average of $8.06. GBTC closed $7.35 -.20 today.\n \nTomorrow is another day.\n \nCAM",
        "subreddit": "options",
        "title": "For Trading March 26th",
        "url": "https://www.reddit.com/r/options/comments/fp1dcj/for_trading_march_26th/",
        "created": 1585210115.0
    },
    {
        "author": "PhotopiaP",
        "created_utc": 1583242535,
        "id": "fcun7i",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Anyone got there eyes on something which is a buy right now due to the markets decline. I’m looking at ibm and Microsoft. Anyone see some value in something else?",
        "subreddit": "StockMarket",
        "title": "Any strong buys",
        "url": "https://www.reddit.com/r/StockMarket/comments/fcun7i/any_strong_buys/",
        "created": 1583271335.0
    },
    {
        "author": "Dashover",
        "created_utc": 1583975697,
        "id": "fh8525",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "\nFor Trading March 12th\n \nBA CRASHES MARKET\n \nTRAVEL BUSINESSES COLLAPSE\n \nYields Improve\n \nToday’s market was pounded from the start with the futures overnight falling on the lack of the president showing up after he said he would be appearing and the fact that there were no specifics of his “plan” to address the issues.  After trading down all morning to -1067 around 11:45 rates started to firm and we had a rally back to -787, but then rates slipped and we headed to 1665 before a close -1464.94 (5.86%), NASDAQ -382.20 (4.7%), S&amp;P 500 -140.86 (4.89%), the Russell -86.60 (6.41%) and the DJ Transports -394.75 (4.63%).  Clearly, the biggest drag on the market was BA -284 DP’s, one of the reasons that the DJIA was a bigger percentage leader on the downside.  Market internals were weak with the NYSE 18:1 and the NASDAQ 7.1:1 negative.  All of the DJIA stocks were lower with only 2 NOT down in double digits.  Between the declaration that the WHO put out calling the COVID-19 a “World-wide Pandemic,” and the banning of spectators at sports events in Washington State and bans on events in San Francisco of over 1000 people, things only got worse when BA declared that it was taking down a $13.8 billion line of credit and a hiring freeze.  Since the close, the NCAA has said that March Madness games will also be played without spectators.  Even the late- night TV shows are stopping live audiences by this weekend.  The one thing that I feel I have to stress here is that this IS NOT A FINANCIAL CRISIS, IT IS A HEALTH CRISIS.  While that does little to take the sting out of a 20% decline, it is not a bank (or banks) failure.  I know it doesn’t help, but it is the fact.  And frankly, the panic is overdone.\n \nOur “open forum” on Discord, which allows me to interact with subscribers and others to allow direct questions and chart opinions on just about any stock, continues to grow with more participants every day.  It is informative and allows me to share insights as the market is open and moving.  The link is: https://discord.gg/ATvC7YZ  and I will be there and active from before the open and all day.  It’s a great place to share ideas and gain some insights.\n \nSECTORS: Other names in the news: It was a debacle of a day for the same names as for the last 2 weeks with airlines, cruises, booking companies, and finally BA, the biggest aircraft manufacturer in the world falling.  In the airlines we had JBLU -1.01 (6.93%), UAL – 3.22 (6.13%), LUV -307 (6.74%) and DAL -2.80 (6.16%).  The cruise lines continued with all down dramatically, but none as bad as NCLH today -5.47 (26.7%), CCL -2.27 (9.45%), and RCL -7.30 (14.13%).  The bookers followed with BKNG -116.50 (7.47%) and EXPE –9.26 (10.7%).  \n \nAs mentioned, BA gets a double (or maybe triple) shot with their 737MAX troubles, yesterday’s issue with wiring bundles, the airlines canceling orders and the fact that they drew on a massive $13.8billion line of credit today.  The stock, the leader on the upside moving from $102 in 2016 to a peak of $446 last March has fallen back to 2017 levels, closing $189.08 -73.25 this week and -41.93 (18.15%) today.\n \n \nBIOPHARMA: was LOWER with none down less than 2.7% and BIIB -11.38, ABBV -2.53, REGN -10.32, ISRG -27.85, MYL -.58, TEVA -.35, VRTX -8.06, BHC -.61, INCY -2.41, ICPT -8.42 (9.29%), LABU -7.07 (18.72%) and IBB $107.70 -4.61 (4.10%).\n \nCANNABIS: stocks were LOWER again with TLRY -.69, CGC -.71, CRON -.03, GWPH -6.49, ACB -.09, PYX -.32, NBEV- .18, CURLF -.22 and the only winner KERN, maker of compliance software, 5.76 +.86 (17.55%) and MJ $11.34 -.80 (6.59%).\n \nDEFENSE: was SHARLY LOWER with -10.24, RTN -14.12, GD -6.85, TXT -3.85 (11.29%), UTX -11.71 (9.81%), NOC -17.04, BWXT -.34, TDY -15.98, and ITA $116.77 -16.54 (9.02%).\n \nRETAIL was LOWER with the brands only slightly better on the day.   M-.79, JWN -3.08 (11.36%), KSS -2.96, DDS -4.04, JCP -.068 (12.11%), WMT -4.81, TGT -2.75, TJX -2.36, RL -8.24, UAA -.37, LULU -10.38, TPR -1.59, CPRI -2.04 (9.97%), NKE -4.30 (4.87%) on Adidas earnings and guidance, and XRT $34.97 -2.70 (7.17%).\n \nFAANG and Big Cap: were LOWER with GOOGL -54.17, AMZN -57.62, AAPL -7.65, FB -6.64, NFLX -11.64, NVDA -12.39, IBM -5.51, TSLA –2.33, BABA -6.88, BIDU 2.51, BA (see above), CAT -5.80, DIS -5.27, and XLK $84.10 -3.54 (4.04%)\n \nFINANCIALS were LOWER with the market and a visit with the president didn’t seem to help.  GS -10.10, JMP -3.93, BAC -.81, MS -2.30, MS -2.30, C -4.26, PNC -6.10, AIG -2.64, TRV -5.77, AXP -6.85 and XLF $23.00 -1.15 (4.76%).\n \n \nOIL, $3432.98 -1.38 The stocks were LOWER with the price of Oil trying to rally and making it to $36.35 before turning back down and closing near the lows.  I’m still stand aside this market since it has a lot of work to do to rebuild a base to define the risk.  XLE finished $34.25 -1.30 (3.66%).\n \nMETALS, GOLD: $1,642 -13.80. After the rebound, and the overnight move to $1,704.30 we sold off as liquidation hit even the yellow metal.  We finished nearer the low, and we continued lower today.  \n \nBITCOIN: closed $7,855 -140. We broke to the downside overnight and fell to a low of $7,640, which closed a gap left on the breakout back in January.  While I want to add the 350 sold just over a week ago, I want to wait and see some stabilization.  We still own 400 GBTC with an average of $8.06. GBTC closed $8.64 -62 today.\n \nTomorrow is another day.\n \nCAM",
        "subreddit": "options",
        "title": "Bad Action!",
        "url": "https://www.reddit.com/r/options/comments/fh8525/bad_action/",
        "created": 1584004497.0
    },
    {
        "author": "Gunnerloco86",
        "created_utc": 1584725597,
        "id": "flz1ut",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "i bought today stocks of IBM and Google. I hope it was a good investment. What do you think?",
        "subreddit": "investing",
        "title": "Google and IBM",
        "url": "https://www.reddit.com/r/investing/comments/flz1ut/google_and_ibm/",
        "created": 1584754397.0
    },
    {
        "author": "VictimofKFC",
        "created_utc": 1584601740,
        "id": "fl5ryr",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Hi guys, I was wondering your opinions on IBM and their long term valuation. I bought in at 143 a while ago. I've seen a news report that a new CEO was stepping in in April, which made their stock surge before the coronavirus scare. I've also heard that they would have trouble competing in cloud against Amazon and Microsoft. Any opinions are greatly appreciated, thank you!",
        "subreddit": "stocks",
        "title": "Thoughts on IBM?",
        "url": "https://www.reddit.com/r/stocks/comments/fl5ryr/thoughts_on_ibm/",
        "created": 1584630540.0
    },
    {
        "author": "Dashover",
        "created_utc": 1584498604,
        "id": "fki44i",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "\n \nFor Trading March 18th\n \nFinally, A Range!\n \nYields Rise\n \nOil Defensive\n \nHAPPY ST. PATRICK’S DAY!!\n \nI can’t believe that I had to search around to find a restaurant that was open for me to pick up dinner since I wasn’t spending any time in a grocery store to buy the ingredients.  \n \nToday’s market was the first day that we had any real “horizontal” action, and frankly, it was a much calmer day.  We had a day that was higher at the open, fell back to -200 or so, but then something different happened, it went back to the plus side.  Here’s the video I did this evening: https://youtu.be/coWMsic-3xU .  Unfortunately, I also did one on the Oil, which concerns me since it looks to me as if it may be setting up for another down leg.  But for the day, we were higher across the board with DJIA +1048.86 (5.2%), NASDAQ +430.19 (6.23%), S&amp;P 500 +143.05 (6%), the Russell +69.09 (6.66%), and the DJ Transports +444.79 (6.33%).  Market internals were also tame (disappointing) with NYSE a subdued 1.5:1 up and the Naz. only slightly better at 2:1. The DJIA was 27:3 with only 4 single digit movers and, surprisingly only 1 triple-digit gainer, UNH +130DPs.  The biggest loser, as usual, was BA -40DPs.  \n \n \nOur “open forum” on Discord, which allows me to interact with subscribers and others to allow direct questions and chart opinions on just about any stock, continues to grow with more participants every day.  It is informative and allows me to share insights as the market is open and moving.  The link is: https://discord.gg/ATvC7YZ  and I will be there and active from before the open and all day.  It’s a great place to share ideas and gain some insights.\n \n \nSECTORS: Other names in the news: The news of the FED commercial paper facility was helpful, but the fall in retail sales was a disappointment and the direct payment to taxpayers or tax cuts helped, but Mayor De Blasio’s comments about residents going to “shelter in place” status, like San Francisco, was not taken well.  Energy concerns and defensiveness that is unknowable at this point sent MAR – 11.18 (12.9%) as it started to furlough workers.  DKS -2.59 (12.22%) got several downgrades in price objectives and after touching just under $40 last week on earnings has fallen all the way toward being a teenager at $18.60.  Housing starts, building permits and mortgage applications come tomorrow.  \n \n \nBIOPHARMA: was HIGHER with most rising only slightly, and the major multipoint gainer being REGN +56.17 (12.74%), BIIB +23.60 (8.38%), ABBV -2.32, ISRG +21.19, MYL +.22, TEVA +.19, VRTX +1.83, BHC -.76, INCY -1.23, ICPT +1.45, LABU +.18, and IBB $100.01 +5.62 (5.95%).\n \n \nCANNABIS: stocks were MIXED with TLRY -.11, CGC -.23, CRON -.26, GWPH, the big gainer, +9.52 (13.13%), ACB +.01, PYX +.23, NBEV +.05, CURLF -.17, KERN +.54 (12.98%), and MJ $9.95 +.51 (5.4%).\n \n \nDEFENSE: was MIXED with LMT +22.06, RTN -4.58, GD +1.20, TXT +1.20, UTX +1.04, NOC +27.41 (9.7%), BWXT -1.11, TDY +6.02, and ITA $133 -1.18 (.88%).\n \n \nRETAIL was MIXED with M-.31, JWN +1.17, KSS -2.40, DDS +2.24, JCP -.07 (12.28%), WMT +10.42 (9.76%), TGT +7.21 (7.69%), TJX unch., RL +1.91, UAA -.12, LULU +5.02, TPR +1.62 (14.11%), CPRI -1.69 (17.49%) and XRT $30.14 +1.48 (5.16%).\n \n \nFAANG and Big Cap: were HIGHER with GOOGL +45.06, AMZN +76.85, AAPL +1.79, FB -2.01, NFLX +11.16, NVDA +14.60, IBM +1.92, TSLA -37.50, BABA +3.21, BIDU -2.51, BA -17.31, CAT +1.60, DIS -3.76, and XLK 76.35 +3.79 (5.22%).\n \n \nFINANCIALS were MIXED with GS -.66, JPM +2.54, BAC +.69, MS +1.35, C -1.96, PNC +3.03, AIG -1.25, TRV +7.90, AXP -2.87 and XLF $20.20 +.31 (1.56%).\n \n \nOIL, $26.95 –1.75 The stocks were LOWER with the price of Oil trying to hold $30.00 initially but turning back down and breaking $29.00. This puts it back near the 2016 lows just under $27.00. Today’s move to below $27.00 is ominous. XLE finished $28.00 +.19 (.68%). Today’s Video  https://youtu.be/D4QXK21NMAs\n \nMETALS, GOLD: $1,1525.80 +39.30. After the liquidation of the past few day’s gold worked its way higher today.  I expect a move back toward $1,600 to unfold.  \n \n \nBITCOIN: closed $5,380 +450. We broke to the downside overnight and fell to a low of $4390, and for the first time in days did not make a new recent low.  Today was another “inside day” which is generally indecisive. While I want to add the 350 sold just over a week ago, I want to wait and see some stabilization.  We still own 400 GBTC with an average of $8.06. GBTC closed $6.10 +.56 today.\n \nTomorrow is another day.\n \nCAM",
        "subreddit": "options",
        "title": "For Trading March 18th",
        "url": "https://www.reddit.com/r/options/comments/fki44i/for_trading_march_18th/",
        "created": 1584527404.0
    },
    {
        "author": "TheBreadMakerr",
        "created_utc": 1584076308,
        "id": "fhuj2d",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "So I wanted to share my thoughts on the overall market outlook and what to do with your money when it comes to stocks, 401k, IRAs, and Mortgages. I know most people reading this have probably never experienced anything remotely close to this before in their lifetime. The information I am going to go over below are just my personal opinions and what I would do.\n\n### Market Outlook\n\nI'm going to break this portion up into three sections. The first section I will discuss the earlier issues we experienced with COVID-19 in China. The second section will go over how COVID-19 impacts the market over the next 6-12 months. And the third section I will discuss what I call \"The Perfect Storm\".\n\n**Big Business Supply Chain**\n\nSo to start we need to understand how the original impacts of COVID-19 in China have and will impact our market. Over 75% of US companies had their supply chains disrupted due to China having to shut down during the outbreak. Why does this matter? Well think about some of the big companies that had this happen, Amazon, Google, Microsoft, IBM, Intel. A lot of these companies have already come out and said that they are going to miss their expected earnings during the next quarter. I believe this is already somewhat priced in but I believe the recovery time for these business will be much longer than 1 quarter. You can expect most of these companies to suffer from this for the next 6-9 months at least. So now you have to realize that a lot of large corporations are going to miss their quarterly earnings for up to the next year.\n\n**COVID-19 and the United States**\n\nWe just briefly went over how these businesses supply chains got thrown out of whack and could take up to a year to recover. Now COVID-19 has crept its way into the US and is already presenting some big time operational issues for these same businesses that are already dealing with supply chain problems. As you may have heard over the past couple days a lot of businesses are trying to find ways to allow employees to work remotely or sending people home, schools are shutting down, sporting leagues are getting suspended and this is just the first few thousand cases that have been identified. How does this impact the market? Well, let's think about tech companies, a lot of these companies have yearly computer, phone, smart device, tablet upgrades. How are they going to meet that demand when they had supply chain delays in China and are now experiencing operations slow downs in the US? Point blank - they aren't. Most of these companies are more than likely to announce significant delays in product launches which is going to trigger uncertainty from shareholders which will result in drop in stock prices. This is going to be a prevalent theme for quite a while. This is going to cause fear in investors and continue to see heavier sell volume than buy volume over the next 6-9 months until these companies stabilize again.\n\n**The Perfect Storm**\n\nLet me breakdown what I am calling the perfect storm and why I think it is going to shake things up further with the market. The first part of this perfect storm is what I covered above which is COVID-19, I already detailed why this is going to impact the market and have a lasting effect over the next 6 months. The second part is the recent Saudi Arabia and Russia oil price wars, the oil and gas sector has taken a huge hit due to this and combined that with COVID-19 and travel bans, you now have a pandemic across the world and a war on oil overseas. The third and final piece of this perfect storm is the upcoming election. The run-up to an election always shakes up the stock market because you have all these shareholders having uncertainty when it comes to the candidates and who is going to be best for businesses and who is projected to win and this causes major ebbs and flows in the market as we get closer to a presidential election. So now lets review, we have uncertainty with COVID-19 and what the current and future impacts will be. We have uncertainty on the oil price war overseas and how that's going to play out, and in about 3-4 months we will have uncertainty within the market around the election. Combining all these factors we will see some continued significant drops over the next 12 month period.\n\nAt this point I do believe we will fall into an economic recession based off the above information, we will be in a downtrend for at least the next 6 months and depending on how long it takes the US to recover from COVID-19 we could see the impact for at least 1 year potentially longer.\n\n### Ok, So What Do I Do With My Money?\n\nLet's kick things off by discussing your 401k, so I'm sure some of you that are younger may be freaking out a bit and wondering should I sell out of my 401k funds and just keep the account cash? Should I move the funds into bonds? Let me give you this to think on, so lets say you can't withdraw your 401k for at least another 10 years, in my opinion your best bet is to leave your 401k alone, don't touch it. You may think, how does that make any sense? Well for starters the market always bounces back so I wouldn't worry too much about seeing your account balance go down in the short term, always remember that your 401k is a long term play. The other factor is you can view this as an opportunity, I would recommend to continue to put money towards your 401k as it allows you to essentially average yourself down on the shares that you currently have. This presents a great opportunity for you to see a nice increase in the shares you buy now and for the foreseeable future because those shares will eventually become very profitable once the market comes out of the bear market/recession a few years from now. Think about the prices that people were able to buy their 401k shares at back in 2008 and how much of a come up they have seen since. Have that mindset going into this upcoming time.\n\nThe next topic I wanted to touch on is something I have gotten a lot of questions on the past few weeks, which is investors and traders asking me What Should I Buy Into? Well right now, I believe the answer is: Nothing! In my opinion COVID-19 news is going to get worse, more cases, more business and educational challenges, more high profile people getting diagnosed. Remember when China first had the outbreak it grew exponentially the first few weeks before leveling off, the same thing is going to happen in the US. Until we start to see it level off a bit, then market is going to see some violent swings to the downside, I don't believe a good buying opportunity will present itself for at least another 10-14 days maybe longer. Once we get past the brunt of it, I believe some of the best longer term plays to invest in will be the Oil and Gas sector. Two of the leaders in this sector are COP and XOM, these stocks pay a nice dividend, are sector leaders and have been around forever. They both have lost roughly 50% of their per share value and are setup well for you to make a healthy return within the next few years. Look back when these stocks took a dive in 2016 and the recovery they have had since. This presents another great opportunity to buy in and hold for some big returns. Just remember, you more than likely will not catch the very bottom on these stocks, I recommend entering with a starter position and gradually scale yourself in to maximize your potential returns.\n\nThe last thing I wanted to touch on is your mortgage. A lot of people are inquiring about refinancing their homes right now. This is not a bad idea if you can at least shave 0.75 points off your interest rate. However, I personally believe rates will continue to drop as we go through these trying times, I believe the opportunity will present itself over the next 6 months to get an even lower rate. I also believe we may see additional federal rate cuts to assist homeowners and help with the potential economic recession we will be entering. I would recommend if you really need to refinance to help out your financial situation right now then go ahead and do it if you will save more than 0.75 points by doing so. However, if you are in a more comfortable position currently you may want to hold out a little longer for the potential of snagging an even lower rate and presenting yourself with a better financial opportunity.\n\n### Final Thoughts\n\nThat about wraps up my market outlook and my thoughts on how to best handle your money during these times. I believe if you are on the younger side, don't get discouraged about what's happening, look at it as an opportunity to grow your financial wealth and knowledge. We are in weird time where a lot of uncertainty is entering the market and our daily lives. I recommend checking out some stock charts and information from back in the 1980s or 2008 to see what happened and how the market recovered and think about the opportunity you may presented with to capitalize on this and set yourself up well for the future.\n\nHope you enjoyed this information and found it informative. If you want to chat further about it feel free to provide some comments below or you can find me on Twitter: [**https://twitter.com/TheBreadMakerr**](https://twitter.com/TheBreadMakerr)\n\nAlso if you want to read this and more about the market you can here: [https://breadmakerpro.com/d/125-what-do-i-do-with-my-money-market-outlook](https://breadmakerpro.com/d/125-what-do-i-do-with-my-money-market-outlook)",
        "subreddit": "stocks",
        "title": "What Do I Do With My Money? - Market Outlook",
        "url": "https://www.reddit.com/r/stocks/comments/fhuj2d/what_do_i_do_with_my_money_market_outlook/",
        "created": 1584105108.0
    },
    {
        "author": "Dashover",
        "created_utc": 1584408841,
        "id": "fjwnmr",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "\nFor Trading March 17th\n \nMarkets Halted Again\nFED Move Fails to Help\n \nYields Steady\n \nToday’s market was pounded from the start with the futures overnight falling to down “the limit” prior to our open and were halted almost immediately.  We came close to the second halt, but the market stabilized, sort of, and traded without much enthusiasm until Mr. Trump started to speak, and that took us to a new low of the day at -1050 or so.  For a while it looked as if we’d also see a new all-time loss on the NASDAQ 2hich looked like it would go -1000, but rallied a touch to close -970.29 (12.32%), DJIA -2997.11 (12.93%), SP 500 -324.90 (11.98%), the Russell -171.66 (14.2%) and the DJ Transports -916.76 (11.55%).  Market internals were not quite as bad as the decline would project with NYSE A/D 24:1 and NASDAQ 11:1, but the DJIA was a debacle with all stocks lower and the biggest losers being UNH -317DPs, HD-275, BA -274, AAPL -242, MCD-190, V -162, and MSFT -158.  In fact, 10 of the 30 were down triple digits while only 1, WBA was down a single digit.  The Fed’s dramatic 1% rate cut down to .25% did little to calm fears as did their open market infusions during the day.  The White House did little to engender any confidence, and their lack of any cohesive fiscal plans left the futures “limit down” from early last evening right up to the open, which lasted only a minute, literally, before level 1 circuit breakers halted the market for 15 minutes.  We came very close to the second breakers at -13%, but the market seemed to calm down a bit and while trading included more forced liquidation, but the decline was stopped at -2798 by 10:00 (including the 15 minute halt) and we rallied until topping out at 11:30 at -1417.  The rest of the day was uneventful until Trump started speaking and we sold off into the close with a new point loss record.  Briefing.com listed NO STRONG groups for the 3rd time in 3 days with the weakest including Info tech, financials, consumer discretionary, materials, real estate and of course, energy.\n \nOur “open forum” on Discord, which allows me to interact with subscribers and others to allow direct questions and chart opinions on just about any stock, continues to grow with more participants every day.  It is informative and allows me to share insights as the market is open and moving.  The link is: https://discord.gg/ATvC7YZ  and I will be there and active from before the open and all day.  It’s a great place to share ideas and gain some insights.\n \nSECTORS: Other names in the news: I’m not sure that there is really any point to listing all the names and declines here so I’m just going to hit the groups and highlight any outstanding issues.  But the main characteristic of this market is forced liquidation.  Whether for margin calls, or recently new investors throwing in the towel and leaving the market, it’s pretty extreme.  As I’ve said here before, the rallies in a bear market can be very deceptive.  Sharp and quick and with high volume, sucking you back in because everyone wants to believe the turn is here.\n \n \nBIOPHARMA: was LOWER with most down nearly 10% and the only multipoint gainer being REGN +4.45.  On the downside we had BIIB -21.71, ABBV -9.06 (10.16%), ISRG -66.69 (14.16%), MYL +.13, TEVA -.99 (11.79%), VRTX -21.09 (9.55%), BHC -3.48 (18.51%), INCY -2.34, ICPT -16.81 (23.41%), LABU -8.10 (33.37%) and IBB $95.90 -7.78 (7.5%).\n \nCANNABIS: stocks were LOWER again and it’s almost a waste to discuss the group, which is severely broken with TLRY, a former $300 stock that has fallen for 14 of the last 16 days from $20 to close today $3.05 -.875 (21.74%).  Even the medical company CURLF was $3.20 -.48 (12.83%) and KERN the compliance software $4.16 -.91 (17.95%) and MJ $9.54 -.80 (7.74%).\n \nDEFENSE: was SHARPLY LOWER with most down double digits LMT -33.08, RTN -16.29, GD -12.94, TXT -2.22, UTX -13.37, NOC -31.00, BWXT -3.79, TDY -37.18, and ITA $134.25 -23.12 (14.69%).\n \nRETAIL was LOWER with all down double-digit percentages. M -1.16 (14.45%), JWN -4.40 (20.38%), and on the brand side, TPR (COACH) -4.23 (26.06%), and CPRI (KORS), -4.27 (30.65%) and XRT $28.66 -4.08 (12.46%).\n \nFAANG and Big Cap: were LOWER with this group the highlight of the crowded trade problems.  GOOGL – 129.27, AMZN -40, AAPL -27.97 (10%), FB -21.28 (12.5%), NFLX-30.30 (after making a 52-wk high @393, 10 days ago and 95 higher), NVDA -34.94, IBM -5.71, TSLA -93.62, BABA -12.41, BIDU -8.84, BA -37.34, CAT -2.66, DIS -5.41, and XLK $72.56 -11.63 (13.81%).\n \nFINANCIALS were SHARPLY LOWER with the market and the FEDs big rate cut didn’t seem to help.  GS –18.60, JPM -13.16, BAC -3.28, MS -4.66 (after Cramer “sanctioned the purchase” last Tuesday at $37 ($6 ago), C -8.79, PNC -17.01, AIG -3.44, TRV -20.94 (19.49%), AXP -8.67, and XLF $20.35 -2.70 (11.71%).\n \n \nOIL, $28.70 -3.04 The stocks were LOWER with the price of Oil trying to hold $30.00 initially but turning back down and breaking $29.00. This puts it back near the 2016 lows just under $27.00. XLE finished $27.81 -4.38 (13.61%).\n \nMETALS, GOLD: $1,486.50 -30.20. After the overnight rally on the Fed news the Gold fell along with the S&amp;P, and other indexes.  Gold is clearly suffering through liquidation like the rest of the market, but the FED repo program should stoke the inflation fires, and any bounce in stocks will help.  \n \nBITCOIN: closed $4930 -400. We broke to the downside overnight and fell to a low of $4390, and for the first time in days did not make a new recent low.  While I want to add the 350 sold just over a week ago, I want to wait and see some stabilization.  We still own 400 GBTC with an average of $8.06. GBTC closed $5.44 -.73 today.\n \nTomorrow is another day.\n \nCAM",
        "subreddit": "options",
        "title": "OOF!",
        "url": "https://www.reddit.com/r/options/comments/fjwnmr/oof/",
        "created": 1584437641.0
    },
    {
        "author": "Dashover",
        "created_utc": 1583893395,
        "id": "fgpvkz",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "\nFor Trading March 11th\n \nAnother Day, Another 5%\n \nYields Improve\n \nToday’s market was interesting in that after it opened higher and was +945 within the first 15 minutes, and fell back to down on the day by 11:45, it actually made a slight new low vs. yesterday’s debacle and survived, spent 3 hours consolidating, and then started up again making a new high on the day and closing on that high with DJIA +1167.14 (4.89%), NASDAQ +393.57 (4.95%), S&amp;P 500 +4.94%), the Russell +37.47 (2.85%) and the DJ Transports +437.35 (5.41%).  The transports were the only index that had an “inside” day, while all the others made the lower low and finished at or near the highs.  While I don’t believe that the market is turning on a dime and heading higher, today’s action is constructive in that it is displaying the kind of action that occurs in a “bottoming” area.  The gap, followed by the selloff, and recovery to new highs for the day was impressive.  Market internals improved (it would have been hard for them not to) with NYSE A/D at 3:1 and the NASDAQ was 2:1.  Volume was good in both places and the DJIA was the mirror image of yesterday with all 30 names higher.  The biggest gainers were AAPL +130, HD +103, MCD +88 and GS +77DPs.  There were only 3 stocks up less than double digits.  These gains may not look very impressive when compared to yesterday’s losses, but what you need to remember is that on the downside, there need not be big sellers to depress prices.  The absence of buyers and the gaps down take little volume, while buying, in the face of depressed prices takes substantially greater conviction.  This is one of the reasons that the market goes up roughly 2/3 of the time and falls twice as fast.\n \nOur “open forum” on Discord, which allows me to interact with subscribers and others to allow direct questions and chart opinions on just about any stock, continues to grow with more participants every day.  It is informative and allows me to share insights as the market is open and moving.  The link is: https://discord.gg/ATvC7YZ  and I will be there and active from before the open and all day.  It’s a great place to share ideas and gain some insights.\n \nSECTORS: Other names in the news: It was a decent day for an earnings report for DKS.  They beat on every metric and raised the dividend, and then in a display of public awareness disclosed that they are discontinuing hunting and gun sales.  While the stock is down from $50 to $32 in January, today’s actions took it back as high as $39.14 and finished $35.87 +1.39 (4.03%).\n \nI want to take the time tonight to remind everyone that there have been a lot of companies that have made claims, or had claims made about them that have caused some major moves.  Some were warranted and some were not, but the point is that as a rule, they are dangerous unless you use stops and go into them with the knowledge that they can and do turn on a dime.\n \nHere are a few:\nINO  Started $4.00 went to $19, closed @$5.70 -4.13 today.\nSPEX  $1.03 to $3.75, back to .75, back to $5.50, closed today $1.83 -1.39 today\nOPK   $1.40 to $2.91, closed today $1.71 -.51\nAnd CODX $3.16 to $21.75, back to $8, back to $18, closed $6.89 -2.94 today.\n \nBIOPHARMA: was HIGHER with BIIB +1.81, ABBV +2.17, REGN +.58, ISRG +26.74 (5.24%), MYL +.70, TEVA +.28, VRTX +5.35, BHC +1.10, INCY +1.71, ICPT +5.47, LABU +1.82 and IBB $112.15 +2.15 (1.95%).\n \nCANNABIS: stocks were HIGHER with TLRY +.09, CGC +.80, CRON +.15, GWPH +5.79, ACB +.04, PYX +.01, NBEV + .13, CURLF +.21, KERN +.43 and MJ $12.14 +.39 (3.32%).\n \nDEFENSE: was HIGHER with LMT +8.47, RTN +4.89, GD +5.28, TXT +3.06, UTX +2.14, NOC +21.61 (6.9%), BWTX +2.72, TDY +11.92, and ITA $186.29 +9.95 (5.64%).\n \nRETAIL was LOWER with the brands were the biggest winners on the day.   M-.24, JWN +.32, KSS -1.50, JCP -.01, WMT +.59, TGT +1.98, TJX -.20, RL +3.92, UAA +.75, LULU +2.23, TPR +.62, CPRI +.66, and XRT $37.67 +.66 (1.78%).\n \nFAANG and Big Cap: were HIGHER with GOOGL +24.21, AMZN +56.55, AAPL +13.33, FB +5.22, NFLX +10.51, NVDA +9.76, IBM +5.69, TSLA +17.30, BABA +7.20, BIDU +3.35, BA -2.37, CAT +.43, DIS +4.86, and XLK $87.64 +5.48 (6.67%).\n \nFINANCIALS were HIGHER with the market and firming in rates with GS +7.19, JPM +5.11, BAC +1.08, MS +1.14, C +2.68, PNC +9.29, AIG +2.26, TRV +2.30, AXP +3.96 and XLF $23.77 +.96 (4.21%).\n \nOIL, $34.36 +3.23%) The stocks were HIGHER with the steadying of the Oil price and the overall market.  I’m still stand aside this market since it has a lot of work to do to rebuild a base to define the risk.  XLE finished $34.79 +.85 (2.5%).\n \nMETALS, GOLD: $1,660.30 -15.40. After the rebound, and the overnight move to $1,704.30 we sold off as liquidation hit even the yellow metal.  We finished nearer the low, and I feel like after a consolidation that we will head higher.\n \nBITCOIN: closed $7,995 +145. We broke to the downside overnight and fell to a low of $7,640, which closed a gap left on the breakout back in January.  While I want to add the 350 sold just over a week ago, I want to wait and see some stabilization.  We still own 400 GBTC with an average of $8.06. GBTC closed $9.27 +40 today.\n \nTomorrow is another day.\n \nCAM",
        "subreddit": "options",
        "title": "Up a Thou!",
        "url": "https://www.reddit.com/r/options/comments/fgpvkz/up_a_thou/",
        "created": 1583922195.0
    },
    {
        "author": "Duck_Butt17",
        "created_utc": 1583788254,
        "id": "fg1y5k",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "From this list, what do the experienced investors out there think would be best to buy. I want to buy 1 or 2 to keep for the long run, and 1 that has a good chance at going up soon.\n\nIntel\nAT&amp;T\nIBM\nIRobot\nMicrosoft\nTurtle beach\nStitch fix\nAmerican eagle\nFord(prob not as it’s been crashing hard)\nUber\nAIM\nVaxart\nVeritone\nIEC\n\nThanks to anyone who gives input or suggestions!",
        "subreddit": "stocks",
        "title": "1 long term, 1 short term",
        "url": "https://www.reddit.com/r/stocks/comments/fg1y5k/1_long_term_1_short_term/",
        "created": 1583817054.0
    },
    {
        "author": "vladimirpoopen",
        "created_utc": 1583366129,
        "id": "fdmano",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "So who gets the cloud contracts? AT&amp;T has a long history with IBM.",
        "url": "https://arstechnica.com/information-technology/2020/03/struggling-att-plans-tens-of-billions-in-cost-cuts-more-layoffs/",
        "created": 1583394929.0
    },
    {
        "author": "ewcikewqikd",
        "created_utc": 1583454344,
        "id": "fe50qt",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Quantum computing help cure coronavirus (long date IBM calls)",
        "url": "https://www.usatoday.com/story/tech/2020/03/05/how-quantum-computing-could-help-coronavirus-research/4931533002/",
        "created": 1583483144.0
    },
    {
        "author": "Dashover",
        "created_utc": 1585012749,
        "id": "fnw68j",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "\nFor Trading March 24th\n \nAnother Range Day\n \nYields Fall\n \nOil Rebounds\n \n \nLast week I said that “today’s market was actually not as bad as it seemed.”  And today while we had a sharp decline it feels to me that were have a slowing rate of decline and some good trading action, that we are setting up for a tradable rally.  Here’s my closing comments video from this evening:  https://www.youtube.com/watch?v=Cj7UI1dvLNk   Market internals were improved with A/D on NYSE 3.5:1 and NASDAQ 1.5:1, and volume slowed slightly.  We actually had a few Strong sectors, Consumer discretionary and Communication services while the weakest were (guess what) Energy and financials.  The DJIA was 26 down, 4 up with no triple-digit winners or losers and BA the big gainer +72 DPs and HD +69, and the biggest losers MCD -77, UNH -70, JNJ -60, UTX -51, and MMM -48 DP’s.  BA was up after a trading halt for news at which they announced they were suspending all production at the Seattle facility.  Semi’s (the chips not the trucks) were also higher by 3.4% and as I mentioned consumer discretionary was higher, but only by .4%.  The FED continues to prime the pump with as much cash as they can get into the market.  Neel Kashkari, ex-Goldman Sachs, brought on by Henry Paulson as an aide, and part of the TARP team, is now President of the Minneapolis Fed since January 1, 2016 and was on CNBC this morning, said that the Fed has the power to keep adding liquidity with as much as and whenever they feel it is needed.\n \n \nOur “open forum” on Discord, which allows me to interact with subscribers and others to allow direct questions and chart opinions on just about any stock, continues to grow with more participants every day.  It is informative and allows me to share insights as the market is open and moving.  The link is: https://discord.gg/ATvC7YZ  and I will be there and active from before the open and all day.  It’s a great place to share ideas and gain some insights, and we’ve grown to almost 800 members.\n \n \nSECTORS: Other names in the news: Last night, Inovio Pharmaceuticals was highlighted on a 60 Minutes story that would have made you think that they were the best buy in creation, but INO, which moved from $3.00 to a high of $19.36 in a week earlier this month had fallen back to close $7.22 opened up .22 today but finished $6.62 -.60 (8.31%).  Very disappointing.\n \n \nBIOPHARMA: was MIXED with MYL and TEVA the big winners.  MYL was +1.25 (8.2%) and TEVA +.53 (7.29%) after the news Thursday that it is a manufacturer of Hydroxychloroquine Sulfate, a potential treatment for COVID-19 and are donating the tablets to hospitals nationwide.  REGN, also in the COVID-19 space was +27.55 (6.28%) and IBB $97.50 -.54 (.55%).\n \n \nCANNABIS: Even this group had some winners with TLRY +.35, CGC +.85, CRON -.32, GWPH +3.51, ACB -.02, PYX -.18, NBEV -.03, CURLF +.30, KERN +.04 and MJ $9.71 -.01 (.10%).\n \n \nDEFENSE: was MIXED with LMT -8.61, RTN -7.18, GD -4.99, TXT unchanged, UTX -4.83, NOC -10.02, BWXT +.46, TDY +.74 and ITA $120.95 +.20 (.17%).\n \n \nRETAIL was MUCH LOWER with M -1.06 (17.61%), JWN -2.07 (11.59%), KSS -2.35 (14.83%), DDS -6.35 (15.15%), JCP -.034 (7.84%), WMT +2.52, TGT +.40, TJX +.13 LULU the only winner in the brands +12.84 (7.78%), TPR -1.24 (10.3%), CPRI -.65 (6.59%) and XRT $26.99 -.80 (2.86%).\n \n \nFAANG and Big Cap: were MOSTLY HIGHER with GOOGL +379, AMZN +76.91, AAPL -4.87, FB -1.63, NFLX + 27.44, NVDA +6.94, IBM -.63, TSLA +6.76, BABA -6.12, BIDU +3.79, BA +10.61, CAT -3.65, DIS -.22 and XLK $71.85 +.80 (1.13%).\n \n \nFINANCIALS were LOWER with GS -.91, JPM -2.43, BAC -1.14, MS -.84, C -1.64, PNC -6.99 (7.81%), AIG +.07, TRV -1.01, AXP -3.33, and XLF $17.66 -1.09 (5.82%).\n \n \nOIL, $23.36 +.73. The stocks were LOWER with the price of Oil trading up slightly but the stocks trading with the overall market.  BP was the only big gainer +1.23 (7.07%) and the XLE $24.05 +1.25 (4.92%).\n \n \nMETALS, GOLD: $1,567.60. After the liquidation of the past few week’s gold made a higher low and broke through resistance at $1,520 and rallied hard right through $1,540 and up towards $1,575.  I still expect a move back toward $1,600 to unfold.  \n \n \nBITCOIN: closed $6340 +90. We broke to the downside overnight and fell to a low of $4390, and for the first time in days did not make a new recent low.  Today was a strong move to the upside While I want to add the 350 sold just over a week ago, I want to wait and see some stabilization.  We still own 400 GBTC with an average of $8.06. GBTC closed $7.19 +.19 today.\n \nTomorrow is another day.\n \nCAM",
        "subreddit": "options",
        "title": "For Trading March 24th",
        "url": "https://www.reddit.com/r/options/comments/fnw68j/for_trading_march_24th/",
        "created": 1585041549.0
    }
]