[
    {
        "author": "CapitalC5",
        "created_utc": 1583548983,
        "id": "feougx",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "I'm working towards 1-5 yrs profit, so long term stock. Atm my portfolio contains DIS, SWKS, SQ, AMD, TWTR, INCY and NIO. To be clear, for example DIS is about 22% of my portfolio, NIO is 5%.\n\nToday I bought DAL and next week, I'll try to buy MA or V for a big amount. Leaves my account at 850 to spend from 8000. I looked at GILD for 68 rate, but they went up like 13% this week, don't think they'll come close again. Was also checking MRVL at 20.50, but they've also risen 11-12%.\n\nI think my portfolio is already pretty diverse, but any advice on a missing opportunity?\n\nAlso, do you have any tips on MA or V? Atm, I just have a target price for both of them and which one reaches it first is the one I will buy.",
        "subreddit": "stocks",
        "title": "Last stock to complete my portfolio?",
        "url": "https://www.reddit.com/r/stocks/comments/feougx/last_stock_to_complete_my_portfolio/",
        "created": 1583577783.0
    },
    {
        "author": "CapitalC5",
        "created_utc": 1586800793,
        "id": "g0o33t",
        "num_comments": 376,
        "num_crossposts": 2,
        "selftext": "After my last post, I had multiple people asking if I could take a deeper look into the renewable energy industry. Since I’m also very interested and I feel it will become a very important sector, I took the time to review it. First of all, let me explain why investing now is a good time. \n\nWhen you look at manufacturers, the biggest market cap is not even $5 billion. There is so much room for growth and there’s also a lot of competition. When you can point your finger at the best company, it might be the homerun for your portfolio in 10-15 years. Even if you don’t hit the right one, it’s still gonna be ok since the industry is only growing. To be clear, I only looked at manufacturers, not distributors. You won’t see any companies like NEE, DUK, BEP, etc. \n\nSecondly, you all know Trump doesn’t believe in environmentally issues, renewable energy and that sort of stuff. With elections coming up, investments might stay the same or they might go up drastically when the democrats win. Either way, the sector will continue to grow and you can’t really go bad with investing in it. \n\nLast argument, I feel like a lot of people don’t know the importance of solar energy yet. It goes beyond the industry, as it gets implemented more and more by other industries. It’s already a big item for giants like Google, Microsoft, Amazon,… to keep their cloud servers running for example. \n\n— — — — — — — — — —\n\nIn this post, I will focus on solar energy the most, as it is the biggest and most important part of renewable energy. Based on market cap from the solar industry, we have 3 leaders and 7 others on a significant distance, but still able to get to the top for the next 5-10 years. From that top 10, RUN, SPWR and VSLR fall off based on financials.  \n\n**ENPH**  \nMarket leader on micro-inverters (the things that convert solar charge into electricity). Even their inverters get used by big competitors like SPWR. Investing more and more into energy storage. It’s focussing on the private market, which might be a short term problem, but their inverters are definitely their big win. Not only do they receive revenue from their own installations, but they have other companies using their products as well when installing other products, making ENPH techniques present in an enormous amount of solar installations. The financials are great, they have a decent amount of cash to get investing and they’re only profitable since last year, giving them a lot of room to grow. They’re bound to get number one position in solar tech and they didn’t even launch their best technology yet. \n\n**SEDG**  \nGreat financials as well. Assets over double amount of liabilities, almost no long term debt and enough cash to get growing. Very big growth on revenue. They were planning to even double their production in 2020 and release some new products, but that’s gonna be delayed a bit. They are working with TSLA on batteries and charging stations. It all looks very positive, although I have to point out some people are calling SEDG ‘yesterday’s solution’. It might be up and keep growing a lot, but if you want the best 10 year investment, you should stick with ENPH. \n\n**FSLR**  \nVery inconsistent income, but a great balance sheet. Assets 3 times liabilities and loads of cash to get investing into the future. Their profit margins are pretty small though, in comparison to the industry. FSLR is the only company that works with utility companies to provide energy. To draw you a simple picture: if you get electric energy at home, it’s been delivered by utility companies and the energy itself is mostly created by FSLR. Over the past few years, utilities are losing market share because people are buying and setting up their own energy installations at home. Therefore utilities, and by extension FSLR, are losing market share. Because of the crisis, people will be less likely to install their own installations as unemployment numbers are rising. FSLR could be the better short term bet, but it’s hard to predict when it will turn around again and they will definitely lose long term. \n\n**JKS**  \nVery innovative techniques, one of the most efficient solar panels on the market. Therefore gaining a lot of advantage on their competitors, or ‘moat’ by Warren Buffett terms. If you feel like solar panels are the most important part of the industry, I would definitely suggest looking into JinkoSolar. They have a lot of cash to get investing, low on long term debt and I see them coming the closest to top 3 in the future.\n\n**CSIQ**  \nLooking for value, then this is the one. PEG ratio of only 0.19, the industrial average is 0.68. Have to point out as well that their growth rate isn’t that great and you might wait a long long time to get the gains going on this one. They also have a lawsuit running against them, claiming to steal Solaria’s patented module technology. \n\n**NOVA**  \nThey might get hit hard by covid-19. Sunnova is a pretty young company, full on investing and expanding, thus having low cash reserves. They might need to be backed by bailout money, putting them even further behind the top 5 solar companies. When they get back in 1-2 years, I feel like the other companies will have too much of a head start. \n\n**AZRE**  \nThey have experienced almost no impact from covid-19 as an Indian based company. Their projects have not been impacted and the plants are running full force. However there has been significant reduction in demand and they’ve been seeing delayed payments from customers. It operates like First Solar, selling energy to government utilities. Big profit margins as well, so they might get out of this crisis easily. That’s also the main reason why the stock didn’t drop that much. Growth will be limited, but a stable investment. \n\n— — — — — — — — — —\n\nNext, I’m gonna mention some other renewable energy resources. I took one of the best companies per industry as an example, but I’m not gonna go through those resources more deeply as I don’t believe in them.\n\n**VWDRY**  \nThe wind energy industry is more inconsistent than solar energy, therefore not the most favorable kind of resource to invest in. It also doesn’t have real potential to expand to private use, but whoever wants to invest in it, I suggest VWDRY. It is the biggest company in the world in terms of wind power. Apart from having the most and biggest wind farms, they also offer their maintenance and knowledge to help optimizing other wind farm locations. Vestas also just signed a great contract with a Danish energy company for delivery in the upcoming next years. They have a lot of cash ready to invest and they also have decent value, so you can’t really go wrong with them.\n\n**REGI**  \nREGI produces and sells biofuels and renewable chemicals. It produces biomass-based diesel, using corn oil, used cooking oil and inedible animal fat amongst other things. The company might be in bad weather, as they are low on cash. They are operating in an investment needing industry, so it’s definitely not the right moment for a financial crisis like this.\n\nAs you can see, I didn’t include nuclear energy companies. Nuclear energy is a green energy solution and definitely isn’t bad. However it’s not growing like solar and wind because it has a lot of negative feedback and image. There is more waste, it’s more expensive and therefore also less investments. It’s easy math, the more volume, the lower price. No one is investing in nuclear, so pricing can’t compete with other resources. \n\n— — — — — — — — — —\n\nFor me, this research was surprising. I was expecting to find more small companies with breaking innovative techniques, but it seems like the ones at the top are predicted to stay there and increase distance. If anyone has some valuable information on small companies, definitely share them in this thread.\n\nTo conclude, ENPH and SEDG are without a doubt the best investments right now. Depending on your timeline, you might want to sell SEDG in 5-10 years, while keeping ENPH for a lifetime. JKS is the higher risk, higher reward kinda bet here, with still decent coverage of risk.\n\nThere are of course way more other renewable energy resources, but I don’t know enough about them. If I would start researching them, I might be working like a professional broker/investor and I decided that I’ve put enough energy into stock research the past weeks. Right now, I’m gonna enjoy the weather, work a bit in the garden and passively buy some shares this week with all that info I’ve gathered over the past few months.",
        "subreddit": "stocks",
        "title": "You asked me to look into the renewable energy sector, so here it is.",
        "url": "https://www.reddit.com/r/stocks/comments/g0o33t/you_asked_me_to_look_into_the_renewable_energy/",
        "created": 1586829593.0
    },
    {
        "author": "thereifboy",
        "created_utc": 1586413434,
        "id": "fxn8pa",
        "num_comments": 62,
        "num_crossposts": 0,
        "selftext": "Man I swear when I first joined this subreddit I made so much off the meme stocks that were posted in here. So much off SPCE, ENPH, TESLA. I thought this subreddit was a hidden gem and unlimited money maker. Now all I see in here is Shit posts. When is the next meme stock that we all agree to rally on gonna come to life?",
        "subreddit": "wallstreetbets",
        "title": "Next profitable meme stock?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fxn8pa/next_profitable_meme_stock/",
        "created": 1586442234.0
    },
    {
        "author": "Gravidi",
        "created_utc": 1587052887,
        "id": "g2hofx",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "NFLX, AMZN, AMD, NVDA had massive growth in the last 5-10 years, so what are some companies that could look like that in the future?\n\nI’m thinking companies working on 5G tech like NOK and ERIC specifically. STM also has potential for a strong future and I think it’s undervalued right now. ENPH also looks promising. As solar power becomes more popular, it has potential to become the new standard. What are some names you’re looking at for large future growth?",
        "subreddit": "stocks",
        "title": "What Are Some Stocks With Potential To Have Massive Growth In the Next 5-10 Years?",
        "url": "https://www.reddit.com/r/stocks/comments/g2hofx/what_are_some_stocks_with_potential_to_have/",
        "created": 1587081687.0
    },
    {
        "author": "sweatythedawg",
        "created_utc": 1586232503,
        "id": "fwdqsc",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "Been doing options for quite sometime but want something more hands free, with this economic drop I’m thinking this may be the time to get into some long term shit\nRight now i have $1000 to invest here’s where I’m planning on putting it, if anyone has any critiques or advice I’d love to hear it \nAAL 20 shares- $200\nBA- 6 AMD- 5 $240\nPlug: 40 shares - $150\nFang: 10 shares- (if goes back down below 25) -$250\nEnph 8 shares 256 if gets down to 32 any suggestions?",
        "subreddit": "investing",
        "title": "I’ve been an options trader for a while",
        "url": "https://www.reddit.com/r/investing/comments/fwdqsc/ive_been_an_options_trader_for_a_while/",
        "created": 1586261303.0
    },
    {
        "author": "hockeyfan1990",
        "created_utc": 1586394108,
        "id": "fxitul",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "Hello Ladies &amp; Gents,\n\nThe market has truly been something over the past month and a half and seems to be riding on emotions and other plays rather so than fundamentals, even though market usually tends to be forward looking. Back in early March, I did my research and decided on a portfolio of stocks to go with as I believe in their growth. As is, I decided to play it out over time and DCA whenever it hits lows. So as search, I’ve only been able to deploy only about 10-15% of my cash so far and only have a few shares of some stocks. I’m glad it’s been going up, but now what should I do? I keep waiting and it keeps going up and it becomes further and further away from the targets I really wanted. I still think there is still some downs to come, but not sure if   It will go back to those same levels. So far my portfolio is as below:\n\n3 shares MSFT @ $136.90\n2 shares AAPL @ $239\n1 share TSLA @ $478\n10 shares AMD @ $37.70\n5 shares DIS @ 93\n3 shares SQ @ $43\n6 shares V @ $151\n25 shares AC.TO @ $15.35\n3 shares TD.TO @ $54\n11 shares RBC.TO @ $92\n30 shares DEAC @ $16.60\n25 shares ENPH @ $36.62 \n\nI’m looking to add specifically more of the first 7 stocks, not sure what to do at this point. I’m glad I was able to get in at least at the lows but just not enough because of my plan to DCA, and just waited and waited.",
        "subreddit": "CanadianInvestor",
        "title": "How Should I Play This In The Coming Weeks (Missed out a bit at low’s)",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/fxitul/how_should_i_play_this_in_the_coming_weeks_missed/",
        "created": 1586422908.0
    },
    {
        "author": "KNINV44",
        "created_utc": 1586098243,
        "id": "fvesae",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "FYI: I'm relatively new to stocks but I wanted to build a strong portfolio. I was going to go with 3 Bluechip stocks, 1-2 Dividend stocks and then use the rest of my money to invest in a couple small businesses that have a strong future during and after this pandemic. \n\nBluechips: AAPL,MSFT,SHOP or GOOG        ETF:SPHD or PCEF               Others: DENN,ENPH,LULU,SYY\n\n&amp;#x200B;\n\nI just wanted some opinions on what you think of these, I would love to share my reasoning/ hear your reasoning on why or why not to buy.",
        "subreddit": "stocks",
        "title": "Picks For The LongHaul? What are yours?",
        "url": "https://www.reddit.com/r/stocks/comments/fvesae/picks_for_the_longhaul_what_are_yours/",
        "created": 1586127043.0
    },
    {
        "author": "mightylfc",
        "created_utc": 1587768113,
        "id": "g7ib2i",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "Beginner investor with $10k to invest in a couple of months when the market dips again... Going to hold for long-term (10+ years). Any important sectors/companies I'm missing?\n\n24.5% AMZN\n\n18% ONEQ\n\n11.5% Healthcare ETFs (IHI, IHF, IEIH)\n\n8.5% FTEC\n\n8% Clean Energy (ENPH, SEDG, ICLN, QCLN)\n\n5.5% SHOP\n\n5.5% mix of Mastercard and Visa\n\n3% AMD\n\n3% TSLA\n\n3% Airlines (mix of DAL and JETS)\n\n3% COST\n\n2.5% SOXX\n\n2.5% AAPL\n\n1.5% MSFT",
        "subreddit": "stocks",
        "title": "How does my portfolio look?",
        "url": "https://www.reddit.com/r/stocks/comments/g7ib2i/how_does_my_portfolio_look/",
        "created": 1587796913.0
    },
    {
        "author": "lucafcawesome",
        "created_utc": 1586884755,
        "id": "g19oba",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "I have been doing a ton of research on tech stocks, and simplified ~40 stocks to 7.\n\nI am struggling to reduce the 7 further to 3/4, and I need your opinions.\n\nThe 7: $ASML $SEDG $FB $DIOD $ENPH $ADBE $MSFT\n\nI created a quick &amp; basic Tier 1 &amp; 2 from these stocks with Tier 1: $ASML $SEDG $FB - Tier 2: rest",
        "subreddit": "stocks",
        "title": "Choose your favourite tech stocks out of the following:",
        "url": "https://www.reddit.com/r/stocks/comments/g19oba/choose_your_favourite_tech_stocks_out_of_the/",
        "created": 1586913555.0
    },
    {
        "author": "rangersfan1717",
        "created_utc": 1587291627,
        "id": "g45ffh",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Relatively new stock investor and am 22 years old. I have 22 different holdings at the moment, and I feel like 12-18 is the ideal range to shoot for based on what I've seen around here and other sites. Thoughts on whether I should sell any of these to consolidate? Primarily long term investor (5-10 year+)\n\nAAPL, GOOG, MSFT, AMD, ENPH, SEDG, FTNT, AMZN, CHGG, TTWO, CHE, ALXN, VEEV, VRTX, MDT, ISRG, COST, LULU, ADBE, BIIB, EQIX, TMO\n\nAlso have about 15% in a S&amp;P ETF\n\nI tried picking stocks primarily on strong balance sheets and financials. Any I should consolidate? Atm, I'm thinking to drop ALXN and maybe TTWO. Thanks!",
        "subreddit": "stocks",
        "title": "Do I own too many different stocks?",
        "url": "https://www.reddit.com/r/stocks/comments/g45ffh/do_i_own_too_many_different_stocks/",
        "created": 1587320427.0
    },
    {
        "author": "charliebear_904",
        "created_utc": 1586958835,
        "id": "g1sc5r",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "I have been looking into ENPH and seems promising.",
        "subreddit": "stocks",
        "title": "Thoughts on SemiConductors? Which company is staged to have the most growth long term?",
        "url": "https://www.reddit.com/r/stocks/comments/g1sc5r/thoughts_on_semiconductors_which_company_is/",
        "created": 1586987635.0
    },
    {
        "author": "ftstacks",
        "created_utc": 1587515798,
        "id": "g5rbl1",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "I am currently watching SHOP, ROKU, TTD, and TSLA and debating on adding/replacing them into my portfolio. They all have big growth potential, but I am concerned about their risks regarding unprofitability, burning through cash, current weak financials, and overvaluation. What are your opinions on these companies?\n\nI'm 20 and looking for long term investments. I currently hold 14 stocks which are AAPL, ADBE, AMZN, DIS, ENPH, FB, GOOG, MA, MSFT, NFLX, NKE, NVDA, SBUX, SQ. Open to hearing what you guys think.",
        "subreddit": "stocks",
        "title": "Thoughts on my watchlist?",
        "url": "https://www.reddit.com/r/stocks/comments/g5rbl1/thoughts_on_my_watchlist/",
        "created": 1587544598.0
    },
    {
        "author": "Kant_sleep13",
        "created_utc": 1586263293,
        "id": "fwjtwr",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Good morning! Here's my watch list\n\nGap Ups: AAPL, AMD, BYND, ENPH, ERI, JACK, LABU, NVDA, RCL, RH, ROKU, TLRY, TSLA,TQQQ, ULTA, \n\nGap Downs: NONE\n\nPossible Day 2 plays: AKER\n\n&amp;#x200B;\n\nMy main watch list is huge today but I narrowed it down to the stocks on this list. There are many in play so if you don't like any of these, run a scan after the open. The market has printed the \"W\" reversal pattern that we talked about yesterday and is now sitting at the 272 pivot from June of 2019 which should act as resistance however this is a unique situation with the government stimulus/bailout so we will have to see if the market breaks over and can hold that level. Everything is gapping today with the market, yesterday turned out to be a strong day maybe today we see some follow through. Wait for good patterns with defined risk/reward before entering. Business as usual. Good luck trading.\n\nI created a community r/Kant_sleep13 where I share these watch lists and other trading related info. Feel free to check it out",
        "subreddit": "StockMarket",
        "title": "Stock watch List April 7, 2020",
        "url": "https://www.reddit.com/r/StockMarket/comments/fwjtwr/stock_watch_list_april_7_2020/",
        "created": 1586292093.0
    },
    {
        "author": "cafenegroporfa",
        "created_utc": 1587498090,
        "id": "g5m307",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Newish investor who went all cash on the first big red in March. \n\nI was wondering what stocks if any did you keep while liquidating your portfolio? Also what stocks are you watching for a good entry point?\n\nI currently have 2 shares of AMZN and 25 of AAAU.\n\nLooking to start buying MTCH, AMD, ALK, ENPH, YETI, MSFT, VWDRY &amp; possibly REGI",
        "subreddit": "stocks",
        "title": "For those of you who liquidated your portfolio..",
        "url": "https://www.reddit.com/r/stocks/comments/g5m307/for_those_of_you_who_liquidated_your_portfolio/",
        "created": 1587526890.0
    },
    {
        "author": "RodneyWayne_",
        "created_utc": 1585770976,
        "id": "ft7bqz",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "I’m getting an $831 tax return and I would like suggestions for where I should invest that money. \n\nI already have about $5k invested in FXAIX and own 12 shares of ENPH, and several shares of DIS, BABA, ROKU and more. Where should I invest it all?\n\nThanks!",
        "subreddit": "investing",
        "title": "What stock/ETF should I invest my tax return money in?",
        "url": "https://www.reddit.com/r/investing/comments/ft7bqz/what_stocketf_should_i_invest_my_tax_return_money/",
        "created": 1585799776.0
    },
    {
        "author": "LetsGetThisYeeet",
        "created_utc": 1586441496,
        "id": "fxt3qj",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "I have been looking at MSFT, ENPH, SQ, VOO. However, anymore more advice would be appreciated.",
        "subreddit": "stocks",
        "title": "Safe stocks to go into and pull out around late fall?",
        "url": "https://www.reddit.com/r/stocks/comments/fxt3qj/safe_stocks_to_go_into_and_pull_out_around_late/",
        "created": 1586470296.0
    },
    {
        "author": "Reanov7",
        "created_utc": 1586568194,
        "id": "fytlfg",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I am 19 years old and below is a couple companies I think are great buys at this point in time. Open to any opinions. I welcome any other companies that you think are great buys.\n\n\nThe list below is my growth stocks\n\nAMD = This company has established its presence in the processor industry. In the past year, they have reported their best earnings ever. They have a lot more room to grow.\nAAPL = Apple products will keep growing especially with 5G technology in their new phones. They are an extremely popular company and they have done a good job in diversifying their revenues sources. \nBA = Boing is a company that has a very big reputation that has been bashed for lots of errors. Their price is very attractive and I don't think this company is going anywhere, the government has contracted with them and won't let them go under.\nENPH =  Endphase is a renewable energy company based off of solar production. They are relatively new and are already turning a profit. Their financials are solid and I believe the importance of renewable energy will only grow.\nYUM = Yum has is an incredible corporation of fast food companies that are very popular in the US. Their price has taken a big hit and I see solid returns in the long term.\nBYND = Beyond produces food that is environmentally friendly. This trend of eating fake meat is growing and is displayed by fast-food chains selling this fake meat. In a way, this is a renewable energy company because of the meat production industry which is terrible for the environment.\nMAXR = Maxar technologies, in my opinion, is extremely undervalued. They are currently at $10 and was previously at $80. They have reached bottom support, I am not as confident in this company as my other ones on this list.\nTSLA = Tesla exemplifies how clean energy is going to be the next biggest thing. Tesla is expensive but everyone in the world knows what Tesla is because it is groundbreaking. Tesla is powerful because everyone and their mother thinks it is cool.\nAQN = Also a company that engages in energy. They have been minimally affected by the stock market dropping. They have deeply invested in renewable energy and are relatively new. They are turning a profit.\nVSLR = This is a riskier renewable energy stock. They are very new and have a lot to prove. Their price has been destroyed by the drop from $11 to $4.8, they also have very strong buy recommendations from multiple analysts. Big potential for this solar company.\nATVI = Activision is a company that makes very popular video games and has a big influence on young kids. Video games are only growing in popularity. Their balance sheet is incredible and they have been performing well because everyone is playing games and their release of COD.  \nMSFT = Microsoft is a monster of a company and has built a moat between them and their competition. They are well known and very consistent.\nBABA = The Amazon of China only recently added on the US stock market. They have incredible year over year growth and outstanding buy recommendations from over 50 analysts.\n\nETF's\n\nQQQ = A great measure of the market that is more weight on technology than the SPY\nSPY = Can't go wrong with this\nXAR = ETF based on space technology and defense. As technology grows humans will want to explore the possibilities of space more. War is a part of life, so is the money-making part of it.\n\nDividend Growth is below \n\nTGT = Excellent company that is doing a great job transferring onto the internet world.\nABT = Aristocrat legend\nWMT = Same thing as a target. Such a resilient price that the stock market drop has done virtually nothing to them.\nMCD = Who doesn't love a happy meal.\nDIS = Stock price has been absolutely destroyed. This company isn't going anywhere. They have been advancing by creating new movies and streaming services. Kids love Disney Fantasy.",
        "subreddit": "stocks",
        "title": "Companies that I consider as winners",
        "url": "https://www.reddit.com/r/stocks/comments/fytlfg/companies_that_i_consider_as_winners/",
        "created": 1586596994.0
    },
    {
        "author": "Kant_sleep13",
        "created_utc": 1586263295,
        "id": "fwjtxh",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Good morning! Here's my watch list\n\nGap Ups: AAPL, AMD, BYND, ENPH, ERI, JACK, LABU, NVDA, RCL, RH, ROKU, TLRY, TSLA,TQQQ, ULTA, \n\nGap Downs: NONE\n\nPossible Day 2 plays: AKER\n\n&amp;#x200B;\n\nMy main watch list is huge today but I narrowed it down to the stocks on this list. There are many in play so if you don't like any of these, run a scan after the open. The market has printed the \"W\" reversal pattern that we talked about yesterday and is now sitting at the 272 pivot from June of 2019 which should act as resistance however this is a unique situation with the government stimulus/bailout so we will have to see if the market breaks over and can hold that level. Everything is gapping today with the market, yesterday turned out to be a strong day maybe today we see some follow through. Wait for good patterns with defined risk/reward before entering. Business as usual. Good luck trading.\n\nI created a community r/Kant_sleep13 where I share these watch lists and other trading related info. Feel free to check it out",
        "subreddit": "stocks",
        "title": "Stock watch List April 7, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/fwjtxh/stock_watch_list_april_7_2020/",
        "created": 1586292095.0
    },
    {
        "author": "KNINV44",
        "created_utc": 1586098243,
        "id": "fves94",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "FYI: I'm relatively new to stocks but I wanted to build a strong portfolio. I was going to go with 3 Bluechip stocks, 1-2 Dividend stocks and then use the rest of my money to invest in a couple small businesses that have a strong future during and after this pandemic. \n\nBluechips: AAPL,MSFT,SHOP or GOOG        ETF:SPHD or PCEF               Others: DENN,ENPH,LULU,SYY\n\n&amp;#x200B;\n\nI just wanted some opinions on what you think of these, I would love to share my reasoning/ hear your reasoning on why or why not to buy.",
        "subreddit": "stocks",
        "title": "Picks For The LongHaul? What are yours?",
        "url": "https://www.reddit.com/r/stocks/comments/fves94/picks_for_the_longhaul_what_are_yours/",
        "created": 1586127043.0
    },
    {
        "author": "TXEngandInv",
        "created_utc": 1586460281,
        "id": "fxytw8",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Any opinions on holding these two over the long weekend?\nMade some good money on them so far this week. \nGot LPTH at 1.25 most recently\nENPH at 36.70",
        "subreddit": "stocks",
        "title": "ENPH and LPTH",
        "url": "https://www.reddit.com/r/stocks/comments/fxytw8/enph_and_lpth/",
        "created": 1586489081.0
    },
    {
        "author": "jross123456",
        "created_utc": 1587070859,
        "id": "g2njsp",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "ENPH",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/g2njsp/enph/",
        "created": 1587099659.0
    }
]