[
    {
        "author": "King_Tendie",
        "created_utc": 1599220763,
        "id": "imem38",
        "num_comments": 4776,
        "num_crossposts": 0,
        "selftext": "Title says it all. I'm a 20-something virgin. I was too scared to YOLO my own money so I \"borrowed\" £70 from my mum and told her I needed it for \"car repairs\".\n\nInstead I YOLO'ed it on a long TSLA position (CFDs) and will now use my money to hire a high end escort called \"Charlotte\" for 1 hour (£300) to take my virginity in a £150 per night penthouse suite at a local 5 star.\n\nThis is pre booked for September 10 and as proof I will pay her extra (£50) to write \"WSB\" on her boobs and post it on September 11 (no disrespect intended).\n\nThank you guys for inspiring me to YOLO. You made this possible.",
        "subreddit": "wallstreetbets",
        "title": "I made £540 on TSLA, I'm gonna spend £450 to lose my virginity in a penthouse suite.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/imem38/i_made_540_on_tsla_im_gonna_spend_450_to_lose_my/",
        "created": 1599249563.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1598962077,
        "id": "ikj1y5",
        "num_comments": 2579,
        "num_crossposts": 0,
        "selftext": "Please use this thread to discuss your portfolio, learn of other stock tickers, and help out users by giving constructive criticism.\n\nWhy quarterly?  Public companies report earnings quarterly; many investors take this as an opportunity to rebalance their portfolios.  We highly recommend you do some reading:  A list of [relevant posts &amp; book recommendations.](https://www.reddit.com/r/stocks/wiki/index#wiki_relevant_posts_.26amp.3B_book_recommendations)\n\nYou can find stocks on your own by using a scanner like your broker's or [Finviz.](https://finviz.com/screener.ashx)  To help further, here's a list of [relevant websites.](https://www.reddit.com/r/stocks/wiki/index#wiki_relevant_websites.2Fapps)\n\nIf you don't have a broker yet, see our [list of brokers](https://www.reddit.com/r/stocks/wiki/index#wiki_brokers_for_investing) or search old posts.  If you haven't started investing or trading yet, then setup your [paper trading.](https://www.reddit.com/r/stocks/wiki/index#wiki_is_there_a_way_to_practice.3F)\n\nBe aware of [Business Cycle Investing](https://eresearch.fidelity.com/eresearch/markets_sectors/sectors/si_business_cycle.jhtml?tab=sibusiness) which Fidelity issues updates to the state of global business cycles every 1 to 3 months (note: Fidelity changes their links often, so search for it since their take on it is enlightening).  [Investopedia's take on the Business Cycle](https://www.investopedia.com/articles/investing/061316/business-cycle-investing-ratios-use-each-cycle.asp) and their [video.](https://www.investopedia.com/video/play/business-cycle/)\n\nIf you need help with a falling stock price, check out Investopedia's [The Art of Selling A Losing Position](https://www.investopedia.com/articles/02/022002.asp) and their [list of biases.](https://www.investopedia.com/articles/stocks/08/capital-losses.asp)\n\nHere's a list of all the [previous portfolio stickies.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22Rate+My+Portfolio%22+-+r%2FStocks+Quarterly+Thread&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all)",
        "subreddit": "stocks",
        "title": "Rate My Portfolio - r/Stocks Quarterly Thread September 2020",
        "url": "https://www.reddit.com/r/stocks/comments/ikj1y5/rate_my_portfolio_rstocks_quarterly_thread/",
        "created": 1598990877.0
    },
    {
        "author": "Department-Hot",
        "created_utc": 1599146293,
        "id": "ilvdh4",
        "num_comments": 1115,
        "num_crossposts": 0,
        "selftext": "Decided to put 6K in the market yesterday.. (BABA, SQ, RKT, QQQ, Docu sign etc..) and this happens today. \n\nWho else literally feels like whenever they add or buy a stock or stocks it always dips after?\n\nIf so, welcome to investing... go enjoy the day :) or buy if you can.. just wish my timing was better or “luck” for these good buying days :(",
        "subreddit": "stocks",
        "title": "Just my luck...",
        "url": "https://www.reddit.com/r/stocks/comments/ilvdh4/just_my_luck/",
        "created": 1599175093.0
    },
    {
        "author": "Unmistakableo",
        "created_utc": 1599566031,
        "id": "ios6gz",
        "num_comments": 883,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Let it go my brothers",
        "url": "https://i.redd.it/pp022mfpvwl51.jpg",
        "created": 1599594831.0
    },
    {
        "author": "colorist_io",
        "created_utc": 1600461153,
        "id": "ivdz93",
        "num_comments": 778,
        "num_crossposts": 0,
        "selftext": "Hi, I just want to get some first-hand perspectives from people who've bought $TSLA recently or are considering buying. What are your reasons for buying it? \n\nTesla had been on a stock price hike of 8X compared to a year ago, there aren't any industry-changing events during this time (the kind that AMD/NVDA went through fews year back). I mean if someone buys the stock right now, it's not that far-fetched that it could just drop back to 50% or 25% of what it is (which is still a double of what it was a year ago), while the company wouldn't even have to be doing so much worse for that to happen.\n\nWhat gives you so much confidence in Tesla?",
        "subreddit": "investing",
        "title": "Why are you buying $TSLA now? (If you are)",
        "url": "https://www.reddit.com/r/investing/comments/ivdz93/why_are_you_buying_tsla_now_if_you_are/",
        "created": 1600489953.0
    },
    {
        "author": "Coda70",
        "created_utc": 1599009568,
        "id": "ikxalu",
        "num_comments": 748,
        "num_crossposts": 0,
        "selftext": "Coda code of conduct\n\n1)\tBuy calls on the best companies in the world 5-10% OTM six months or more until expiration.  FAANG, MSFT, TSLA, NIKE, WMT, JPM, PYPL, AXP, BABA, NVDA, AMD, SBUX, CRM.  Or ETF’s like MGK, FNGS, and SOXX if you don’t have the capital to get in on single equity options.\n\n2)\tHold for at least half of the 6 months until expiration.  \n\n3)\tThe long term goal is to buy and hold shares.  This is what rich people do.  Hard assets that can’t quickly evaporate like options can.  Same choice of companies as above.  Just the good shit. Hold assets that slowly grow. Cash gang = chicken coop.\n\n4)\tIn order to protect your winnings, make sure half of your account is shares.  \n\n5)\tUse margin sparingly.  Less than half of what they are offering you.\n\n6)\tIf you need to do a weekly just to have a little casino thrill in your life it should be less than a grand.  Weeklies are not how real wealth is built.  But it’s ok if you see a strong trend but don’t YOLO your whole stack.  That’s just dumb.\n\n7)\tSmoke weed every day.\n\n———\n\nSee, I got up to six figures buying puts in mid-march. But then I lost like 3/4’s of my stack staying short when the market bottomed on March 23rd.  So I needed to come up with a system to protect my gains.  Hence, the Coda code of conduct.\n\nFor example, I started with $75k but now I have around $162k in shares.  So, no matter what happens I’ll likely be ahead of where I started.  I’m slightly out of balance because I have more options than shares.  $196k in calls vs $162k in shares.  So I’m like $34k out of balance, somewhat breaking my own rule.  So I’m living a little dangerously until 9/18 at which time I’m going to execute 4 apple calls and 2 msft calls.  Which will bring my share total up like $65k.  I might have to sell some options so I have the buying power in my account to get this done.  At that point, I will have more shares than options so I’ll be green lit to buy more calls.  This is how I enforce discipline on myself to not get to overextended.  Leverage, but not too much leverage.  Good luck to us all!",
        "subreddit": "wallstreetbets",
        "title": "How to turn $75k into $325k while being high on edibles",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ikxalu/how_to_turn_75k_into_325k_while_being_high_on/",
        "created": 1599038368.0
    },
    {
        "author": "CumomEileen",
        "created_utc": 1600086598,
        "id": "isjxb1",
        "num_comments": 711,
        "num_crossposts": 0,
        "selftext": "Could hardly read it as I was crying so much through laughing\n\nActual quote:\n Nikola described this third-party video on the Company’s social media as “In Motion.” It was never described as “under its own propulsion” or “powertrain driven.”  🤣🤣🤣\n\nhttps://nikolamotor.com/press_releases/nikola-sets-the-record-straight-on-false-and-misleading-short-seller-report-96\n\nGoing all in on NKLA puts",
        "subreddit": "wallstreetbets",
        "title": "NKLA rebuttal is out",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/isjxb1/nkla_rebuttal_is_out/",
        "created": 1600115398.0
    },
    {
        "author": "CrosscourtFade",
        "created_utc": 1600004381,
        "id": "iryghr",
        "num_comments": 705,
        "num_crossposts": 2,
        "selftext": "*edit: thanks for the awards. I'd be a dick to take credit. Go check out the one-man-band who actually wrote it---I've been reading for a couple months, good stuff*   [*https://bestinterest.blog/explain-the-big-short/*](https://bestinterest.blog/explain-the-big-short/)\n\n(Best Interest) This post will **explain the Big Short and the 2008 subprime mortgage collapse in simple terms.**\n\nThis post is a little longer than usual–maybe give yourself 20 minutes to sift through it. But I promise you’ll leave feeling like you can tranche (that’s a verb, right?!) the whole financial system!\n\n**Key Players**\n\nFirst, I want to introduce the players in the financial crisis, as they might not make sense at first blush. One of the worst parts about the financial industry is how they use deliberately obtuse language to explain relatively simple ideas. Their financial acronyms are hard to keep track of. In order to explain the Big Short, these players–and their roles–are key.\n\n**Individuals**, a.k.a. regular people who take out mortgages to buy houses; for example, you and me!\n\n**Mortgage lenders**, like a local bank or a mortgage lending specialty shop, who give out mortgages to individuals. Either way, they’re probably local people that the individual home-buyer would meet in person.\n\n**Big** **banks**, such as Goldman Sachs and Morgan Stanley, who buy lots of mortgages from lenders. After this transaction, the homeowner would owe money to the big bank instead of the lender.\n\n**Collateralized debt obligations (CDOs)**—deep breath!—who take mortgages from big banks and bundle them all together into a bond (see below). And just like before, this step means that the home-buyer now owes money to the CDO. Why is this done?! I’ll explain, I promise.\n\n**Ratings agencies**, whose job is to determine the risk of a CDO—is it filled with safe mortgages, or risky mortgages?\n\n**Investors**, who buy part of a CDO and get repaid as the individual homeowners start paying back their mortgage.\n\nFeel lost already? I’m going to be a good jungle guide and get you through this. Stick with me.\n\n**Quick definition: Bonds**\n\nA **bond** can be thought of as a loan. When you buy a bond, you are *loaning* your money. The issuer of the bond is *borrowing* your money. In exchange for borrowing your money, the issuer promises to pay you back, plus interest, in a certain amount of time. Sometimes, the borrower cannot pay the investor back, and the bond *defaults,* or fails. Defaults are not good for the investor.\n\nThe CDO—which is a bond—could hold thousands of mortgages in it. It’s a mortgage-backed bond, and therefore a type of mortgage-backed security. If you bought 1% of a CDO, you were *loaning* money equivalent to 1% of all the mortgage principal, with the hope of collecting 1% of the principal *plus interest* as the mortgages got repaid.\n\nThere’s one more key player, but I’ll wait to introduce it. First…\n\n**The Whys**, Explained\n\n**Why does an individual take out a mortgage?** Because they want a home. Can you blame them?! A healthy housing market involves people buying and selling houses.\n\n**How about the lender; why do they lend?** It *used* to be so they would slowly make interest money as the mortgage got repaid. But nowadays, the lender takes a fee (from the homeowner) for creating (or *originating*) the mortgage, and then immediately sells to mortgage to…\n\n**A big bank. Why do they buy mortgages from lenders?** Starting in the 1970s, Wall St. started buying up groups of loans, tying them all together into one bond—the CDO—and selling slices of that collection to investors. When people buy and sell those slices, the big banks get a cut of the action—a commission.\n\n**Why would an investor want a slice of a mortgage CDO?** Because, like any other investment, the big banks promised that the investor would make their money back *plus interest* once the homeowners began repaying their mortgages.\n\nYou can almost trace the flow of money and risk from player to player.\n\nAt the end of the day, the investor needs to get repaid, and that money comes from homeowners.\n\n**CDOs are empty buckets**\n\nHomeowners and mortgage lenders are easy to understand. But a big question mark swirls around Wall Street’s CDOs.\n\nI like to think of the CDO as a football field full of empty buckets—one bucket per mortgage. As an investor, you don’t purchase one single bucket, or one mortgage. Instead, you purchase a thin horizontal slice across all the buckets—say, a half-inch slice right around the 1-gallon mark.\n\nAs the mortgages are repaid, it starts raining. The repayments—or rain—from **Mortgage A** doesn’t go solely into **Bucket A**, but rather is distributed across all the buckets, and all the buckets slowly get re-filled.\n\nAs long as your horizontal slice of the bucket is eventually surpassed, you get your money back plus interest. You don’t need *every* mortgage to be repaid. You just need *enough* mortgages to get to your slice.\n\nIt makes sense, then, that the tippy top of the bucket—which gets filled up last—is the highest risk. If too many of the mortgages in the CDO fail and aren’t repaid, then the tippy top of the bucket will never get filled up, and those investors won’t get their money back.\n\nThese horizontal slices are called ***tranches***, which might sound familiar if you’ve read the book or watched the movie.\n\nSo far, there’s nothing too wrong about this practice. It’s simply moving the risk from the mortgage lender to other investors. Sure, the middle-men (banks, lenders, CDOs) are all taking a cut out of all the buy and sell transactions. But that’s no different than buying lettuce at grocery store prices vs. buying straight from the farmer. Middle-men take a cut. It happens.\n\nBut now, our final player enters the stage…\n\n**Credit Default Swaps: The Lynchpin of the Big Short**\n\nScrew you, Wall Street nomenclature! A **credit default swap** sounds complicated, but it’s just **insurance**. Very simple, but they have a key role to explain the Big Short.\n\nInvestors thought, “Well, since I’m buying this **risky** tranche of a CDO, I might want to hedge my bets a bit and buy **insurance** in case it fails.” That’s what a credit default swap did. It’s insurance against something failing. But, there is a **vital** difference between a credit default swap and normal insurance.\n\nI can’t buy an insurance policy on *your* house, on *your* car, or on *your* life. Only *you* can buy those policies. But, I could buy insurance on a CDO mortgage bond, *even if I didn’t own that bond!*\n\nNot only that, but I could buy **billions** of dollars of insurance on a CDO that only contained **millions** of dollars of mortgages.\n\nIt’s like taking out a $1 million auto policy on a Honda Civic. No insurance company would allow you to do this, but it was happening all over Wall Street before 2008. This scenario essentially *is* “the big short” (see below)—making huge insurance bets that CDOs will fail—and many of the big banks were on the wrong side of this bet!\n\nCredit default swaps involved the largest amounts of money in the subprime mortgage crisis. This is where the big Wall Street bets were taking place.\n\nQuick definition: Short\n\nA short is a bet that something will fail, get worse, or go down. When most people invest, they buy **long** (“I want this stock price to go up!”). A **short** is the opposite of that.\n\nCertain individuals—like main characters Steve Eisman (aka Mark Baum in the movie, played by Steve Carrell) and Michael Burry (played by Christian Bale) in the 2015 Oscar-nominated film **The Big Short**—realized that tons of mortgages were being made to people who would never be able to pay them back.\n\nIf enough mortgages failed, then tranches of CDOs start to fail—no mortgage repayment means no rain, and no rain means the buckets stay empty. If CDOs fail, then the credit default swap insurance gets paid out. So what to do? ***Buy credit default swaps!*** That’s the quick and dirty way to explain the Big Short.\n\n**Why buy Dog Shit?**\n\nWait a second. Why did people originally invest in these CDO bonds if they were full of “dog shit mortgages” (direct quote from the book) in the first place? Since **The Big Short** protagonists knew what was happening, shouldn’t the investors also have realized that the buckets would never get refilled?\n\nFor one, the *prospectus*—a fancy word for “owner’s manual”—of a CDO was very difficult to parse through. It was hard to understand exactly which mortgages were in the CDO. *This is a skeevy big bank/CDO practice*. And even if you knew which mortgages were in a CDO, it was nearly impossible to realize that many of those mortgages were made *fraudulently*.\n\n**The mortgage lenders were knowingly creating bad mortgages**\\*.\\* They were giving loans to people with no hopes of repaying them. Why? Because the lenders knew they could immediately sell that mortgage—that *risk*—to a big bank, which would then *securitize* the mortgage into a CDO, and then sell that CDO to investors. Any risk that the lender took by creating a bad mortgage was quickly transferred to the investor.\n\nSo…because you can’t decipher the prospectus to tell which mortgages are in a CDO, it was easier to rely on the CDO’s **rating** than to evaluate each of the underlying mortgages. It’s the same reason why you don’t have to understand how engines work when you buy a car; you just look at Car &amp; Driver or Consumer Reports for their opinions, their ratings.\n\n**The Ratings Agencies**\n\nInvestors often relied on ratings to determine which bonds to buy. The two most well-known ratings agencies from 2008 were Moody’s and Standard &amp; Poor’s (heard of the **S&amp;P** 500?). The ratings agency’s job was to look at a CDO that a big bank created, understand the underlying assets (in this case, the mortgages), and give the CDO a rating to determine how safe it was. A good rating is “AAA”—so nice, it got ‘A’ thrice.\n\nSo, were the ratings agencies doing their jobs? **No!** There are a few explanations for this:\n\n1. Even they—the experts in charge of grading the bonds—didn’t understand what was going on inside a CDO. The owner’s manual descriptions (prospectuses) were too complicated. In fact, ratings agencies often *relied on big banks to teach seminars* about how to rate CDOs, which is like a teacher learning how to grade tests from Timmy, who still pees his pants. *Timmy just wants an A*.\n2. Ratings agencies are profit-driven companies. When they give a rating, they charge a fee. But if the agency hands out too many bad grades, then their customers—the big banks—will take their requests elsewhere in hopes of higher grades. The ratings agencies weren’t *objective*, but instead were biased by their need for profits.\n3. Remember those fraudulent mortgages that the lenders were making? Unless you did some boots-on-the-ground research, it was tough to uncover this fact. It’s hard to blame the ratings agencies for not catching this.\n\n**Who’s to blame?**\n\nEveryone? Let’s play devil’s advocate…\n\n&amp;#x200B;\n\n* **Individuals**: some people      point the finger at homeowners, saying, “You should know better than to      buy a $1 million house on a teacher’s salary.” I find this hard to      swallow. These people, surrounded by the American home-ownership dream,      were sold the idea that they would be fine. The mortgage lender had no      incentive to sell a *good* mortgage, they only had an      incentive to sell *a* mortgage. So, it’s hard for me to put      too much blame on the homeowners.\n* **Mortgage      lenders**: *someone* knew.      I’m not saying that all the mortgage lenders were fully aware of the      implications of their actions, but some people knew that fraudulent loans      were being made, and chose to ignore that fact. For example, check      out [whistleblower Eileen Foster](https://en.wikipedia.org/wiki/Eileen_Foster).\n* **Big      banks**:      Yes sir! There’s certainly blame here. Rather than get into all of the      various money-grubbing, I want to call out one specific anecdote. Back in      2010, Goldman Sachs CEO Lloyd Blankfein testified in front of Congress.      Here it is:\n\nTo explain further, there are two things going on here.\n\nFirst, Goldman Sachs bankers were selling CDOs to investors. They wanted to make a commission on the sale.\n\nAt the same time, other bankers **ALSO AT GOLDMAN SACHS** were buying credit default swaps, a.k.a. betting *against* the same CDOs that the first Goldman Sachs bankers were selling.\n\nThis is like selling someone a racehorse with cancer, and then immediately going to the track to bet against that horse. Blankfein’s defense in this video is, “But the horse seller and the bettor weren’t the same people!” And the Congressmen responds, “But they worked for the same stable, and collected the same paychecks!”\n\nSo do the big banks deserve blame? You tell me.\n\n**Inspecting Goldman Sachs**\n\nOne reason Goldman Sachs survived 2008 is that they began buying credit default swaps (insurance) *just* in time before the housing market crashed. They were still on the bad side of some bets, but mostly on the good side. They were net profitable.\n\nUnfortunately for them, the banks that owed Goldman money were going bankrupt from their *own* debt, and then Goldman never would have been able to collect on their insurance. Goldman would’ve had to payout on their “bad” bets, while not collecting on their “good” bets. In their own words, they were [“toast.”](https://bettermarkets.com/newsroom/email-shows-goldman-admitted-it-was-toast)\n\nThis is significant. Even banks in “good” positions would’ve gone bankrupt, because the people who owed the most money weren’t able to repay all their debts. Imagine a chain; Bank A owes money to Bank B, and B owes money to Bank C. If Bank A fails, then B can’t collect their debt, and B can’t pay C. Bank C made “good” bets, but aren’t able to collect on them, and then they go out of business.\n\nThese failures would’ve rippled throughout the world. This explains why the US government felt it necessary to bail-out the banks. That federal money allowed banks in “good” positions to collect their profits and “stop the ripple” from tearing apart the world economy. While CDOs and credit default swap explain the Big Short starting, this ripple of failure is the mechanism that affected the entire world.\n\nBetting more than you have\n\nBut if someone made a bad bet—sold bad insurance—why didn’t they have money to cover that bet? It all depends on [risk](https://bestinterest.blog/2019/10/18/risk-posture/). If you sell a $100 million insurance policy, and you think there’s a 1% chance of paying out that policy, what’s your exposure? It’s the potential loss multiplied by the probability = 1% times $100 million, or $1 million.\n\nThese banks sold billions of dollars of insurance under the assumption that there was a  5%, or 3%, or 1% chance of the housing market failing. So they had 20x, or 30x, or 100x **less** money on hand then they needed to cover these bets.\n\nTurns out, there was a 100% chance that the market would fail…**oops!**\n\nBlame, expounded\n\n**Ratings agencies**—they should be unbiased. But they sold themselves off for profit. They invited the wolves—big banks—into their homes to teach them how to grade CDOs. Maybe they should read a blog to explain the Big Short to them. Of course they deserve blame. Here’s another anecdote of terrible judgment from the ratings agencies:\n\nThink back to my analogy of the buckets and the rain. Sometimes, a ratings agency would look at a CDO and say, “You’re never going to fill up these buckets all the way. Those final tranches—the ones that won’t get filled—they’re **really** risky. So we’re going to give them a bad grade.”  There were “Dog Shit” tranches, and Dog Shit gets a bad grade.\n\nBut then the CDO managers would go back to their offices and cut off the top of the buckets. And they’d do this for all their CDOs—cutting off all the bucket-top rings from all the different CDO buckets. And then they’d super-glue the bucket-top rings together to create a field full of Frankenstein buckets, officially called a **CDO squared**. Because the Frankenstein buckets were originally part of other CDOs, the Frankenstein buckets could only start filling up once the original buckets (which now had the tops cut off) were filled. In other words, the CDO managers decided to concentrate all their Dog Shit in one place, and super glue it together.\n\nA reasonable person would look at the Frankenstein Dog Shit field of buckets and say, “That’s turrible, Kenny.”\n\n**BUT THE RATINGS AGENCIES GAVE CDO-SQUAREDs HIGH GRADES!!!** Oh I’m sorry, *was I yelling?!*\n\n“It’s *diversified*,” they would claim, as if Poodle shit mixed with Labrador shit is better than pure Poodle shit.\n\nAgain, you tell me. Do the ratings agencies deserve blame?!\n\nDoes the government deserve blame?\n\nYes and no.\n\nFor example, part of the **Housing and Community Development Act of 1992** mandated that the government mortgage finance firms (Freddie Mac and Fannie Mae) purchase a certain number of sub-prime mortgages.\n\nOn its surface, this seems like a good thing: it’s giving money to potential home-buyers who wouldn’t otherwise qualify for a mortgage. It’s providing the American Dream.\n\nBut as we’ve already covered today, it does nobody any good to provide a bad mortgage to someone who can’t repay it. That’s what caused this whole calamity. Freddie and Fannie and HUD were pumping money into the machine, helping to enable it. Good intentions, but they weren’t paying attention to the unintended outcomes.\n\nAnd what about the Securities &amp; Exchange Commission (SEC), the watchdogs of Wall Street. Do they have a role to explain the Big Short? Shouldn’t they have been aware of the Big Banks, the CDOs, the ratings agencies?\n\nYes, they deserve blame too. They’re supposed to do things like ensure that Big Banks have enough money on hand to cover their risky bets. This is called proper “risk management,” and it was *severely* lacking. The SEC also had the power to dig into the CDOs and ferret out the fraudulent mortgages that were creating them. Why didn’t they do that?\n\nPerhaps the issue is that the SEC was/is simply too close to Wall Street, similar to the ratings agencies getting advice from the big banks. Watchdogs shouldn’t get treats from those they’re watching. Or maybe it’s that the CDOs and credit default swaps were too hard for the SEC to understand.\n\nEither way, the SEC doesn’t have a good excuse. If you’re in bed with the people you’re regulating, then you’re doing a bad job. If you’re rubber stamping things you don’t understand, then you’re doing a bad job.\n\n**Explain the Big Short**, shortly\n\nYou’re about 2500 words into my “short summary.” But the important things to remember:\n\n&amp;#x200B;\n\n* Financial      acronyms suck.\n* Money      flowed from the investors down to the mortgage lenders, and the risk      flowed from the mortgage lenders up to the investors. In between, the big      banks and CDOs acted as middle men and intermediaries.\n* When      someone feels like their actions have no risk, or no consequences, they’ll      behave poorly (big banks, mortgage lenders)When someone is given what seems like an amazing deal, they’ll take it      (individual home owners).\n* CDOs      are like empty buckets. Mortgage payments are like rain, filling the      buckets. Investors buy tranches, or slices, across all the buckets. If      mortgages fail, then the buckets might not fill up, and the investors      won’t get their money back.\n* CDOs      are intentionally complex. So complex, that not even the people grading      them understood what was going on (ratings agencies).\n* Buying      insurance on something your do not own is a behavior with potential for      abuse (big banks)\n* Buying      insurance on something for more than it’s worth is a behavior with      potential for abuse (big banks). This is where most of the money in the      financial crisis switched hands.\n\nAnd with that, I’d like to announce the opening of the Best Interest CDO. Rather than invest in mortgages, I’ll be investing in race horses. Don’t ask my why, but the current top stallion is named ‘Dog Shit.’ He’ll take Wall Street by storm.\n\nIf you don’t mind my cussing but you do like this content, consider [**subscribing to the email list**](https://bestinterest.blog/subscribe/) to get these articles (and nothing more) sent to your inbox every week.\n\nI hope this post helped if you were looking for someone to explain the Big Short. Thanks for reading the **Best Interest**.\n\n&amp;#x200B;\n\nSource: [https://bestinterest.blog/explain-the-big-short/](https://bestinterest.blog/explain-the-big-short/)",
        "subreddit": "investing",
        "title": "This week 12 yrs ago--Lehman Bros collapsed......(Best Interest) Explaining the Big Short and the 2008 Crisis",
        "url": "https://www.reddit.com/r/investing/comments/iryghr/this_week_12_yrs_agolehman_bros_collapsedbest/",
        "created": 1600033181.0
    },
    {
        "author": "Brothanogood",
        "created_utc": 1599778400,
        "id": "iqebna",
        "num_comments": 675,
        "num_crossposts": 0,
        "selftext": "Tesla's exclusion from the S&amp;P 500 index on Friday was a surprise to many, given that the mega-cap electric-vehicle manufacturer ticked off all the eligibility requirements.\n\nTesla on Tuesday fell 21% from Friday's close as investors digested the S&amp;P 500 exclusion amid a tech-heavy market sell-off.\n\nBut the S&amp;P Dow Jones Indices index committee's decision to exclude Tesla despite its eligibility for inclusion was a \"brave\" one, DataTrek cofounder Nicholas Colas said in a note on Wednesday.\n\nThe decision by the committee could \"only have come from a collective and committed view that Tesla is profoundly overvalued,\" Colas said.\n\nTesla traded at a trailing 12-month price-earnings multiple of 913x on Wednesday, according to data from YCharts.com. The S&amp;P 500 traded at a trailing 12-month price-earnings multiple of 21.7x, according to JPMorgan.\n\nIn addition to a steep valuation, the committee likely thinks Tesla \"sits on shakier fundamentals\" than its August 31 market capitalization of $465.2 billion may indicate, DataTrek said.\n\nThat might refer to the fact that much of the profit Tesla has recorded over the past few quarters derives from the sale of green EV regulatory credits to other carmakers that don't meet the mandated annual EV production quota, and not from Tesla's main business of building and selling cars and solar panels.\n\nTesla will remain eligible for inclusion in the S&amp;P 500 index if it continues to stay profitable in future quarters.\n\nInstead of Tesla, the committee added Etsy, Teradyne, and Catalent to the S&amp;P 500 index.\n\nhttps://www.businessinsider.com/tesla-stock-sp500-exclusion-index-overvalued-profoundly-datatrek-committee-why-2020-9",
        "subreddit": "stocks",
        "title": "Tesla is 'profoundly overvalued,' and its exclusion from the S&amp;P 500 was a 'brave' decision by the index committee, DataTrek says",
        "url": "https://www.reddit.com/r/stocks/comments/iqebna/tesla_is_profoundly_overvalued_and_its_exclusion/",
        "created": 1599807200.0
    },
    {
        "author": "visvya",
        "created_utc": 1601340066,
        "id": "j1orad",
        "num_comments": 648,
        "num_crossposts": 0,
        "selftext": "Relevant articles: [NYTimes](https://www.nytimes.com/2020/09/28/technology/apple-epic-app-court.html), [CNN](https://www.cnn.com/2020/09/28/tech/apple-fortnite-epic-hearing/index.html), [CNBC](https://www.cnbc.com/2020/09/28/google-to-enforce-30percent-cut-on-in-app-purchases-next-year.html)\n\n* Apple and Epic went to court today so that Epic could argue for a temporary court order that would force Apple to unblock Fortnite from its iOS App Store. \n\n* \"The case is considered a potentially landmark suit, one that tests the frontiers of antitrust law, said Judge Yvonne Gonzalez Rogers of the United States District Court for the Northern District of California.\"\n\n* In the coming days, Gonzalez Rogers is expected to rule on whether Apple must allow Fortnite back into its App Store and support Unreal Engine, Epic’s software development tools, in the interim.\n\n* Judge Yvonne Gonzalez Rogers concluded the hearing by recommending a jury trial in the case in July. “It is important enough to understand what real people think,” she said. “Do these security issues concern people or not?” (in reference to Apple's argument that tight control over its App Store to keep customers’ data secure and private.)\n\n* Judge Gonzalez Rogers looked skeptically at many of Epic's claims, explicitly telling the company several times in the hearing she was not persuaded by its arguments or its strategy. Epic knew that it was breaching its contract with Apple when it published the update, but did it anyway, she said, accusing the company of dishonesty. She rejected claims that Apple's in-app payment system is a separate product an an example of illegal bundling, as well as that Apple's app store operates as a monopoly.\n\n* Fortnite players on iOS have a variety of choices to access the game even if it is no longer available on iOS, she said. \"Walled gardens have existed for decades,\" she said. \"Nintendo has had a walled garden. Sony has had a walled garden. Microsoft has had a walled garden. What Apple's doing is not much different... It's hard to ignore the economics of the industry, which is what you're asking me to do.\"\n\n* Separately on Monday, Google announced it will enforce rules that require app developers distributing Android software on the Google Play Store to use its in-app payment system. The move means that developers who have had customers pay them directly with a credit card for digital content will soon have to use Google’s billing system, which takes a 30% fee from payments.",
        "subreddit": "investing",
        "title": "Judge not convinced by Epic's arguments against Apple; Google to begin collecting 30% cut on in-app purchases in 2021",
        "url": "https://www.reddit.com/r/investing/comments/j1orad/judge_not_convinced_by_epics_arguments_against/",
        "created": 1601368866.0
    },
    {
        "author": "colorist_io",
        "created_utc": 1600367073,
        "id": "iup9ig",
        "num_comments": 642,
        "num_crossposts": 0,
        "selftext": "Apple's earning is up 18% from a year ago, but the stock price is up 100% from a year ago. Can someone shed some insights why that is (possibly)? It would seem fine if it's just 35% up, but 100%, that's like ... crazy. Consider that it's a blue-chip company and all.",
        "subreddit": "investing",
        "title": "$AAPL didn't double their profit, but doubled their stock price.",
        "url": "https://www.reddit.com/r/investing/comments/iup9ig/aapl_didnt_double_their_profit_but_doubled_their/",
        "created": 1600395873.0
    },
    {
        "author": "WowKay100",
        "created_utc": 1600209573,
        "id": "itjdnk",
        "num_comments": 633,
        "num_crossposts": 0,
        "selftext": "TL;DR Buy all NKLA puts, sell your NKLA shares, exit calls. Only reason stock hasn't collapsed yet is because retard cult following buying the dip. Tomorrow, the stock is no longer on limit down rule, meaning free fall down a hill, off a cliff, into the mariana trench.\n\nThis is for the special retards of WSB out there, exit your calls and sell your shares of this company, it's fucked. This stock is rolling down to delisted like it's shitty fake truck and you are dumb and in denial if you don't realise that.\n\nLet's look at the evidence.\n\nToday Hindenburg released a reply to NKLA rebuttal: [https://hindenburgresearch.com/nikola-response/](https://hindenburgresearch.com/nikola-response/) Please, just read this before you even reply. Anyone with any critical thinking skills can clearly see that this scam got caught with it's pants down at a child daycare. Remember TM pulled an allnighter after the report came out, another day and a whole weekend, just for that reply.\n\nSEC is investigating them: [https://www.thestreet.com/investing/nikola-shares-slump-amid-sec-probe-into-short-seller-claims](https://www.thestreet.com/investing/nikola-shares-slump-amid-sec-probe-into-short-seller-claims) \n\nDoJ is investigating them: [https://www.ft.com/content/a45a6638-167b-4e27-a9fd-576e7229f959](https://www.ft.com/content/a45a6638-167b-4e27-a9fd-576e7229f959)\n\n&amp;#x200B;\n\nThe argument that GM gives the company credibility is fundamentally untrue. GM is robbing this company of it's EV subsidy (First 200k cars sold), GM gets 11% of NKLA, GM gets 700 million from NKLA (lol how the fuck is NKLA gonna pay GM 700million) with no drawbacks. The only thing NKLA contributes to GM here is their brand name (marketting), that's literally it. If either the SEC or DoJ finds anything that they can use to bury NKLA, which they definitely will, GM is going to pull out of the deal. Remember, they have until 30th Dec to pull out, and I bet the board are talking about it and weighing up their options. If any of the other collaborations pull out, that would be a catalyst for others. This argument that GM is defending NKLA makes no sense. If they didn't defend NKLA, GM stock would collapse and CEO fired. GM has no downsides to defending NKLA at all, and gains so much from this deal.\n\nNow, lets value this stock. It's worth $13billion which is almost 1/3 GM. So what are we getting for 13 billion?\n\nA factory? No, it's dirt field that hasn't even gotten permits for construction.\n\nExclusive tech? No, as shown in Hindenburg they have no tech of their own. 11 patents to it's names and if you read the patents, they're literally junk\n\nTalented workforce? I don't even need to say anything here\n\nMarketting? Outsourced\n\nWorking prototype? Hill\n\nFuck this company, let's watch it burn tomorrow.",
        "subreddit": "wallstreetbets",
        "title": "NKLA is finished",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/itjdnk/nkla_is_finished/",
        "created": 1600238373.0
    },
    {
        "author": "Joeforce",
        "created_utc": 1599435722,
        "id": "inwoyz",
        "num_comments": 624,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "At least one you guys made it out on top.",
        "url": "https://i.redd.it/4p6crc826ml51.jpg",
        "created": 1599464522.0
    },
    {
        "author": "Roylainey",
        "created_utc": 1599955831,
        "id": "irnwlx",
        "num_comments": 621,
        "num_crossposts": 0,
        "selftext": "Posting from my Alt.\nIf you own Uber stock, gtfo and sell while you're still ahead.  \nCountless drivers are reporting on UP and other places that Uber is not paying cancel fees to drivers and not logging the cancelled ride.   Also recently Uber has not been paying tips to drivers and when reported by a driver of the issue, Uber responded \"We are working on a fix for tips not showing up for drivers\".  In the history of Uber this is first time they mentioned tips not showing need a fix.  And yet ride fares show up just fine for drivers.  There is good reason to believe Uber is troubled due to Covid19 and lack of people travelling so Uber got rid of all phone support and fired California and other US fulltime employees.  It has only a handful of offshore support pretty much handling all issues for low pay of a few dollars an hour.",
        "subreddit": "stocks",
        "title": "Uber is in deep shit.",
        "url": "https://www.reddit.com/r/stocks/comments/irnwlx/uber_is_in_deep_shit/",
        "created": 1599984631.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1599120366,
        "id": "ilpdid",
        "num_comments": 614,
        "num_crossposts": 0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on stock options, but if options aren't your thing then just ignore the theme and/or [post your arguments against options here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nRequired info to start understanding options:\n\n* [Call option Investopedia video](https://www.investopedia.com/terms/c/calloption.asp) basically a call option allows you to buy 100 shares of a stock at a certain price (strike price), but without the obligation to buy\n* [Put option Investopedia video](https://www.investopedia.com/terms/p/putoption.asp) a put option allows you to sell 100 shares of a stock at a certain price (strike price), but without the obligation to sell\n\nSee the following word cloud and click through for the wiki:\n\n[Call option - Put option - Exercising an option - Strike price - ITM - OTM - ATM - Long options - Short options - Combo - Debit - Credit or Premium - Covered call - Naked - Debit call spread - Credit call spread - Strangle - Iron condor - Vertical debit spreads - Iron Fly](https://www.reddit.com/r/stocks/wiki/options-themed-post)\n\nIf you have a basic question, for example \"what is delta,\" then google \"investopedia delta\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion &amp; Options Trading Thursday - Sep 03, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/ilpdid/rstocks_daily_discussion_options_trading_thursday/",
        "created": 1599149166.0
    },
    {
        "author": "SamHamou",
        "created_utc": 1599572001,
        "id": "iotmi6",
        "num_comments": 604,
        "num_crossposts": 0,
        "selftext": " \n\nUS stocks fell to their lowest level in two weeks, with the shares of major technology companies under pressure for the second day, due to concerns that valuations were too high for this year's performance.\n\nThe declines of Amazon, Microsoft and Facebook pushed the Nasdaq 100, the index of the 100 largest non-financial companies, down more than 5%, although it reduced those losses by more than half as the day progressed and investors found bargains. The broader market fared better, with the S&amp;P 500 index dropping just over 1% in the afternoon.\n\nUS Treasury yields increased while the dollar remained stable. Oil dropped to less than $ 40 a barrel for the first time in a month.\n\nAccording to Bloomberg, Friday's biggest sales appeared to stem from concerns that the recent surge in technology stocks was not linked to broad investor sentiment, but instead would have been driven by overseas options trading. a company.\n\nThe Financial Times reported that SoftBank bought billions of dollars in technology derivatives before the crash that started Thursday.\n\nOne-month chart for the Nasdaq 100 index. Source: Investing.com\n\nTraders are looking to find an appropriate valuation for technology stocks and assess the health of the US economy as the coronavirus pandemic progresses after killing more than 180,000 Americans.\n\nWhile the tech industry is generating huge profits during lockdowns, there is also evidence that high-profile companies are overbought.\n\nElsewhere, emerging market stocks fell for the third day. European stocks plunged. Asian stocks fell, with the Australian index registering the biggest drop since May. Meanwhile, the Ibovespa faced declines of more than 3%, and risks losing 100,000 points again.\n\n&amp;#x200B;\n\n[https://read.cash/@SamHamou/losses-of-apple-amazon-and-facebook-bring-down-stock-market-ab20655a](https://read.cash/@SamHamou/losses-of-apple-amazon-and-facebook-bring-down-stock-market-ab20655a)",
        "subreddit": "stocks",
        "title": "Losses of Apple, Amazon and Facebook bring down stock market",
        "url": "https://www.reddit.com/r/stocks/comments/iotmi6/losses_of_apple_amazon_and_facebook_bring_down/",
        "created": 1599600801.0
    },
    {
        "author": "closingbell",
        "created_utc": 1599933366,
        "id": "irhabh",
        "num_comments": 602,
        "num_crossposts": 0,
        "selftext": "(Bloomberg) -- Nikola Corp. has left a trail of inconsistent statements and contradictory announcements that are now coming under scrutiny from short-sellers eager to poke holes in the electric-vehicle company’s success story.\n\nHindenburg Research, which holds a short position in Nikola stock and stands to gain if the shares fall, released a report Thursday detailing what it called “dozens of lies” about the company’s capabilities, partnerships or products. The firm used internal emails, analyzed photos and even cited an investigator dispatched to rural Utah to test how far a car would roll down a hill. Nikola said Hindenburg’s report was full of falsehoods but hasn’t offered anything specific to rebut the allegations.\n\nIt doesn’t take a hedge fund or a private eye to determine that Nikola, which struck a partnership this week with General Motors Co., has a pattern of discrepancies. A look at some of its announcements and filings, along with statements and tweets by Chairman Trevor Milton and other executives over the past few years, yields other examples that weren’t part of Hindenburg’s report. “It’s a bit confusing trying to follow Trevor on his various social media outlets about the timing and cadence of communication of the different variables that you’re talking about,” Jeff Osborne, a Cowen &amp; Co. analyst, told executives on an Aug. 4 conference call.\n\nNikola’s shares have tumbled 24% since the Hindenburg report, which, among other sources, cited a Bloomberg story from June about the company exaggerating the capabilities of a truck.\n\n“We are committed to doing our best to keep the investing public and all of our stakeholders informed and up to date at all times,” Chief Executive Officer Mark Russell said Friday in an emailed response to questions from Bloomberg about the following items.\n\nUnder Construction\n\nAt a press event on July 22, ahead of the groundbreaking of Nikola’s Coolidge, Arizona, factory, Head of Global Manufacturing Mark Duchesne fielded a question on when construction would get underway. “That one is an easy answer,” he said. “Start of construction is tomorrow.”\n\nThe timeline was repeated by Milton the following day in a tweet. But “construction” turns out to be a broad term.\n\nTo facilitate the groundbreaking ceremony, the city of Coolidge issued Nikola a temporary use permit on July 13. The document, obtained by Bloomberg, allowed the company to do some limited ground clearing and preparation for holding the event, along with listing a plan for coronavirus safeguards. It didn’t allow further construction to start beyond that. The company also obtained a Pinal County dust permit around the same time, a legal requirement in Arizona.\n\nOn Aug. 7, the company received its at-risk grading and drainage permit, City Manager Rick Miller said by phone. The permit allows Nikola to clear dirt and do drainage work on the site, but as yet the company doesn’t have the permits required for foundation work, plumbing, electrical or vertical construction, Miller said. The permits are available through public-records requests.\n\nOn Wednesday, Nikola said in a tweet that Coolidge’s city council had approved the company’s “factory masterplan” and that “construction can now go forward.” This is only partly true, Miller said. It was the planning and zoning commission that approved a “major site plan.” The approval will allow Nikola and its architects and engineers to apply for the next batch of permits.\n\nIn a statement, Nikola said that by “construction” it meant everything from groundbreaking to seeking permits. Now that its building plan is approved, “the various permits will be obtained in cadence with the steps of the construction. We remain on schedule for Phase 1,” the company said in an email.\n\n”The factory will be up in 12 months,” Milton said in a live broadcast on Instagram on Friday night. “The permit was just issued by the city. We are all good to go.”\n\nPuzzling Partnership\n\nNikola has a stated ambition of manufacturing hydrogen-powered fuel cell semi trucks by 2023. Since 2017, it has had an agreement for German auto parts supplier Robert Bosch Gmbh to “develop, build, test and support” various components for Nikola’s prototypes including a fuel-cell system, battery packs, steering pumps and motors, according to a regulatory filing in March.\n\nThe details of which partner is contributing what to the project has shifted over time, and the future of the deal has gotten hazier.\n\nNikola agreed to pay Bosch around $40 million for the development, according to the filing. In a presentation to investors in April, Nikola described the agreement with Bosch as a “co-development” and strategic supply chain partnership and said the company would jointly own any intellectual property developed with Bosch.\n\nHowever, Nikola executives have regularly stated that Nikola designed, developed and will provide much of the technology for its vehicles -- not Bosch. On Friday, Chief Financial Officer Kim Brady said that Nikola will provide only 15% of the parts in battery electric pickups due to be built in Ulm, Germany, while partner Iveco provides the rest. However, he added that Nikola’s input represents 90% of the truck’s value.\n\n“We are responsible for Nikola Tre -- the batteries, e-axle, e-motors, inverters, BMS system, infotainment system,” Brady said. “All the key electric propulsion systems come from Nikola.”\n\nAs recently as Aug. 25, Bosch has said that it’s “working with the company to make the fuel-cell drive for trucks suitable for mass production.”\n\nOn Monday, Nikola announced that GM -- not Bosch -- will mass-supply a fuel cell system for Nikola’s Class 7 and 8 semi trucks, as well as the battery packs for its debut electric pickup, the Badger. On Friday, Nikola clarified that Bosch will supply semi truck fuel cells in Europe, while GM will have exclusivity everywhere else.\n\n“Bosch is an investor, board member and supplier to Nikola. They help us in many facets of our business as our partner,” Nikola said.\n\nMilton bristled at a claim by a Twitter user that Nikola was jilting Bosch in favor of GM.\n\n“Bosch as a company with a dedicated hydrogen strategy welcomes the decision of GM to enter this market as an important player,” Bosch spokesman Tim Wieland said in an email. “Beyond that, Nikola and Bosch have been working together for several years, not only on the fuel cell power train but also on other innovations like the steering system and the Mirror Cam System for the first prototypes of the Nikola trucks. The two companies will continue to cooperate in the future, also on fuel cells.”\n\nGame Changer\n\nNikola’s narrative about its battery strategy has also shifted over time.\n\nIn November 2019, Nikola issued a press release claiming to have “game-changing” battery cell technology that it would unveil at an event in 2020. Nikola also said it had entered into a letter of intent to acquire a “world-class battery engineering team” to help bring the new battery to pre-production.\n\n“We are talking about doubling the range of BEVs and hydrogen-electric vehicles around the world,” Milton said in the statement.\n\nIn July, Milton tweeted that Nikola would “make the entire pack like the top guys do” for its upcoming pickup truck, called the Badger. He said that all internal components, such as batteries, inverters, software and controls, are Nikola’s own intellectual property. “We own it all in house,” he said.\n\nMilton clarified in a tweet on Thursday that Nikola’s change of direction -- to use GM’s Ultium battery technology for the Badger -- was a result of cost analysis and cost savings.\n\nBeer Trucks\n\nBack in March, Nikola said in a presentation to investors that it has a “signed binding agreement” to provide Anheuser-Busch with as many as 800 hydrogen fuel cell electric semi trucks. What the presentation didn’t say was that Anheuser-Busch committed to buy fewer trucks than that, and doesn’t have to buy any at all.\n\nThe deal was first announced in May 2018 and stated the trucks were originally expected to be integrated into Anheuser-Busch’s dedicated fleet by the end of 2020, according to a press release.\n\nThat timeline isn’t going to be met. During the Aug. 4 earnings call, Russell, the CEO, updated investors on the deal, saying, “We do believe that we’ll be able to give them test prototypes before the end of 2021; serial production or mass production of the fuel cell truck will not begin until 2023.”\n\nThat does corroborate with the timeline for production set out in a July filing -- and to be fair, lots of people’s plans have changed this year. But in the same filing, Nikola revealed that Anheuser-Busch retains the right to cancel the truck order, though there’s no indication that will happen. The contract also has lease terms and rental rates that may be hard for Nikola to meet, according to the filing, “depending on our ability to develop our trucks and hydrogen network according to current design parameters and cost estimates.”\n\nThe agreement between the two companies states that Anheuser-Busch gets priority of delivery for as much as 20% of Nikola’s initial “production line of Class 8 vehicles.” To get production going by 2023, Nikola must work to have dedicated equipment in Anheuser Busch’s breweries and distribution centers by the end of 2021, according to the deal terms. Anheuser-Busch only agreed to use at least 600 trucks -- the 800 figure, according to the document, is an estimate of what the brewer will need.\n\n“They have been, and continue to be, a great long-term partner in our shared vision of a zero-emission future (a Nikola Two prototype hauled our first load over public roads for them in St. Louis not too long ago),” Russell said in the statement Friday, referring to Anheuser-Busch. “Our original agreement with them has been modified over time. The current agreement terms are as we set forth in our earnings call.”\n\nAnheuser-Busch didn’t respond to a request for comment. The partnership with Nikola will help the brewer transition its entire long-haul fleet to zero-emission vehicles, Anheuser-Busch said last November.\n\nPrototype Production\n\nOn July 13, Milton said European partner Iveco was already producing vehicle prototypes.\n\n“We have a truck coming in to production right now with 720KwH, the largest battery we know of anywhere in the world coming in to production,” Milton said on the TC’s Charcast Podcast. “We have five of them coming off the assembly line right now in Ulm, Germany.”\n\nOn Aug. 4, during the company’s debut earnings call, Russell echoed the sentiment, saying that the first five prototypes were “coming off the end of the facility at this point.”\n\nThose statements were a mischaracterization of Nikola and Iveco’s progress in Ulm, according to two people familiar with the matter. The assembly line is still under construction and not yet operational or building prototypes, the people said. There are prototypes being built by hand in a workshop, one of the people said.\n\n“As stated previously, the first five production prototypes of the Nikola Tre are being completed, by an assembly team at the Ulm facility. Also as stated previously, the Nikola/IVECO JV mass production line facility in Ulm is still under construction, and is on track for the start of regular serial production in 2021,” Russell said Friday. “We anticipate that a number of current IVECO personnel will join the Nikola/IVECO JV production team in Ulm.”\n\nNikola’s Guidance\n\nHere’s when Nikola has said it will hit its big milestones, based on filings, statements and interviews: [ ]\n\nhttps://www.bnnbloomberg.ca/nikola-s-history-of-discrepancies-has-been-hiding-in-plain-sight-1.1492855",
        "subreddit": "investing",
        "title": "Bloomberg: Nikola’s History of Discrepancies Has Been Hiding in Plain Sight",
        "url": "https://www.reddit.com/r/investing/comments/irhabh/bloomberg_nikolas_history_of_discrepancies_has/",
        "created": 1599962166.0
    },
    {
        "author": "Protomize",
        "created_utc": 1600172231,
        "id": "it7ldf",
        "num_comments": 582,
        "num_crossposts": 0,
        "selftext": "Took out a credit card loan to invest in stock market.\n\nSo, I just did it. My Discover Bank was offering a balance transfer of up to my credit limit which is $19,400 at a 3% fee and no interest until 12 months has passed and the balance hasn’t been re-payed. I took out a $5,000 loan with an upfront fee of $150 or 3%. I plan on investing this money into Apple, Tesla and QQQ with hopes that the return at the very least is 4% on that $5,000 to break even on the loan after IRS takes their taxes on those gains within the following year. I anticipate getting much more than 4% return on that $5,000 within a year which will effectively net me a profit. I’m new to investing and I believe this action is called investing on margin. I chose a $5,000 loan, because the monthly amount to pay it back within a year fits in my budget and I can stomach losing that much money as opposed to going all out with my $19,400 credit limit in which I can’t afford to lose that. What do you think?",
        "subreddit": "wallstreetbets",
        "title": "Took out a credit card loan to invest in stock market.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/it7ldf/took_out_a_credit_card_loan_to_invest_in_stock/",
        "created": 1600201031.0
    },
    {
        "author": "SnooCapers8443",
        "created_utc": 1599820367,
        "id": "iqnzsv",
        "num_comments": 570,
        "num_crossposts": 0,
        "selftext": "What kind of fucking retarded shit is this, 95% of posts are about Nvidia, AMD, Tesla or Apple.  \nEither it's retarded degenerate gamblers posting mad gains/losses or it's some fucking idiot savant that just found out Tesla's P/E is above 900.   \nCould you just fucking STOP panicking about your shitty overpriced tech stocks, I don't give a flying damn. What about the 99,9999% of other stocks you shittards aren't covering or buying? \n\n\"Ooh MaD gains thank you master elun\"\n\n\"OOh Tesla iis overPricCedD\"  \n\"OoohHh Tesla is the fUtUreE\" \n\n\"Don't buy Tesla or Apple every idiot and crackhead cashier is buying it\" \n\nYEAH we know. YOU are the crackhead buying Tesla.  \nFucking DD means nothing to you shitheads does it?  \n\n\nTLDR: Tech bubble, get over it you fucking homos",
        "subreddit": "wallstreetbets",
        "title": "I KNOW this isn't r/investing but fucking hell",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iqnzsv/i_know_this_isnt_rinvesting_but_fucking_hell/",
        "created": 1599849167.0
    },
    {
        "author": "Manureprenuer",
        "created_utc": 1599843987,
        "id": "iqumyl",
        "num_comments": 552,
        "num_crossposts": 0,
        "selftext": "Zero carbon emissions and 100% green energy. This is the prototype that I have. Haven't made or sold any yet, but it is clean energy. Can I have my 20B market cap now?\n\nhttps://preview.redd.it/o3k4j71pvjm51.jpg?width=576&amp;format=pjpg&amp;auto=webp&amp;s=31ecd8d9977db14ab9e8e3e5f6edf540e1b79239",
        "subreddit": "wallstreetbets",
        "title": "I started a new green energy car company called Edison",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iqumyl/i_started_a_new_green_energy_car_company_called/",
        "created": 1599872787.0
    },
    {
        "author": "BigSalad",
        "created_utc": 1601320701,
        "id": "j1iq64",
        "num_comments": 542,
        "num_crossposts": 0,
        "selftext": "Reddit is going to go Public within the next 2 years. They’ve pubicly stated their intents, without confirming a timeline, and they are also making. some key dank hires in their finance orgs to get the ball rolling. Its a matter of when, not if at this point. \nWill WSB make this more insanely valued than Tesla or snowflake? With our collective mighty morphin power pump Reddit stock to infinite?",
        "subreddit": "wallstreetbets",
        "title": "Reddit will IPO soon, will WSB meme it to an insane value?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j1iq64/reddit_will_ipo_soon_will_wsb_meme_it_to_an/",
        "created": 1601349501.0
    },
    {
        "author": "Tellafam",
        "created_utc": 1600959259,
        "id": "iyyq3g",
        "num_comments": 523,
        "num_crossposts": 0,
        "selftext": "The weekly jobless claims report from the Labor Department on Thursday, the most timely data on the economy’s health, also showed 26 million people were on unemployment benefits in early September. The faltering labor market recovery and a recent rise in new coronavirus infections has piled pressure on Congress and the White House to come up with another rescue package.\n\nFederal Reserve Chair Jerome Powell told lawmakers on Wednesday that Congress and the U.S. central bank needed to “stay with it” in working to support the economy’s recovery. More fiscal stimulus is looking increasingly unlikely before the Nov. 3 presidential election.\n\n“The high level of joblessness shows that the country isn’t out of the woods yet and it won’t be if the pleading of Fed officials for more stimulus isn’t heard by government officials down in Washington,” said Chris Rupkey, chief economist at MUFG in New York. “The economy is running on empty.”\n\nInitial claims for state unemployment benefits rose 4,000 to a seasonally adjusted 870,000 for the week ended Sept. 19. Data for the prior week was revised to show 6,000 more applications received than previously reported. Economists polled by Reuters had forecast 840,000 applications in the latest week.\n\n\n\n\n\n\n\n https://www.reuters.com/article/us-usa-economy/u-s-weekly-jobless-claims-unexpectedly-rise-idUSKCN26F249",
        "subreddit": "investing",
        "title": "U.S. labor jobless claims increase to 870,000. Total unemployment 26 million.",
        "url": "https://www.reddit.com/r/investing/comments/iyyq3g/us_labor_jobless_claims_increase_to_870000_total/",
        "created": 1600988059.0
    },
    {
        "author": "Avaronah",
        "created_utc": 1600261736,
        "id": "itv4t4",
        "num_comments": 507,
        "num_crossposts": 0,
        "selftext": "Snowflake (SNOW) will go public today. The data warehousing company will be the biggest IPO of the year and it has gotten a lot of attention lately. Salesforce and even Berkshire Hathaway will both be buying 3.1 million stocks, good for $500,000,000 in total. They got to buy them for $80 per share.\n\nThis week, the company's underwriters have upped the price range from $75-$85 to $100-$110, which is an increase of 31% due to greater demand. They then decided that this was still not good enough so the stock will go public at $120 per share.\n\nCan this be justified? Maybe. Their revenue increased with 130% in the first half of the year yoy. They're on track to bring in $500 mln in revenue this year. We all know that investors get really excited by cloud companies and pay a hefty premium for them, because they keep generating revenue during lockdowns and high growth rates are expected to continue over the coming years.\n\nNow, here's the quote we've all been waiting for:\n\n\"For the investor, a too-high purchase price for the stock of an excellent company can undo the effects of a subsequent decade of favorable business developments.\"\n\nThe irony is that Buffet himself is involved in this highly priced IPO. Yes, we all know that the company will probably do great over the next few years. The data warehousing industry will have a size of around $35 bln in 2025. That's just a little bigger than the current market cap of Snowflake($33.3 bln). Last February, they were only valued at $12.7 bln, and with a P/S ratio of 50, the stock is more expensive than Zoom. What you really should be asking yourself is: how much of their expected growth is already priced in? Are you willing to pay 50% more than that institutional parties had to?\n\nI'm not saying whether to buy in or not, I just wanted to give this piece of advice by the Oracle to you. Never buy out of FOMO and good luck investing y'all.",
        "subreddit": "investing",
        "title": "Let this Buffet quote guide you with your decision on $SNOW",
        "url": "https://www.reddit.com/r/investing/comments/itv4t4/let_this_buffet_quote_guide_you_with_your/",
        "created": 1600290536.0
    },
    {
        "author": "Alanle12",
        "created_utc": 1601391032,
        "id": "j20ofv",
        "num_comments": 494,
        "num_crossposts": 0,
        "selftext": "Went to the bank to deposit my check so I can yolo it on some DD calls. Started talking to the guy at the bank about stocks and what not. He asked where he can get some good advice for investing. I said WSB on reddit. Never heard someone laugh so hard in a mask since the pandemic started. My bank teller now knows I’m a retard thanks you lovely dick heads.",
        "subreddit": "wallstreetbets",
        "title": "Guy at bank laughed when I said I use info from you retards on WSB",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j20ofv/guy_at_bank_laughed_when_i_said_i_use_info_from/",
        "created": 1601419832.0
    },
    {
        "author": "kriptonicx",
        "created_utc": 1598959920,
        "id": "ikikmn",
        "num_comments": 493,
        "num_crossposts": 0,
        "selftext": "It shall be interesting to see how the market react to this and whether it will just shrug it off.\n\nThe price has dropped a little in after hours, but is still up 2% at time of posting.\n\nhttps://www.cnbc.com/2020/09/01/tesla-to-sell-up-to-5-billion-in-stock-amid-rally.html",
        "subreddit": "stocks",
        "title": "Tesla to sell up to $5 billion in stock amid rally",
        "url": "https://www.reddit.com/r/stocks/comments/ikikmn/tesla_to_sell_up_to_5_billion_in_stock_amid_rally/",
        "created": 1598988720.0
    },
    {
        "author": "addictedtostuckporn",
        "created_utc": 1599566389,
        "id": "ios954",
        "num_comments": 490,
        "num_crossposts": 0,
        "selftext": " \n\nNikola ([NKLA](https://finance.yahoo.com/quote/NKLA?p=NKLA&amp;.tsrc=fin-srch)📷) and GM ([GM](https://finance.yahoo.com/quote/GM)📷) are teaming up to take on Tesla’s cybertruck.\n\nThe electric truck startup announced Tuesday it has selected GM to be its manufacturing parter for its electric pickup truck dubbed the Badger. The Badger will use GM’s widely acclaimed Ultium battery technology. Additionally, Nikola will hand over $2 billion in stock to GM — giving the automaker an 11% stake in the company.\n\n“Nikola is one of the most innovative companies in the world. General Motors is one of the top engineering and manufacturing companies in the world. You couldn’t dream of a better partnership than this,” said Nikola founder and executive chairman Trevor Milton in a statement. “By joining together, we get access to their validated parts for all of our programs, General Motors’ Ultium battery technology and a multi-billion dollar fuel cell program ready for production. Nikola immediately gets decades of supplier and manufacturing knowledge, validated and tested production-ready EV propulsion, world-class engineering and investor confidence. Most importantly, General Motors has a vested interest to see Nikola succeed. We made three promises to our stakeholders and have now fulfilled two out of three promises ahead of schedule. What an exciting announcement.” \n\nAdded GM Chairman and CEO Mary Barra, “This strategic partnership with Nikola, an industry leading disrupter, continues the broader deployment of General Motors’ all-new Ultium battery and Hydrotec fuel cell systems. “We are growing our presence in multiple high-volume EV segments while building scale to lower battery and fuel cell costs and increase profitability. In addition, applying General Motors’ electrified technology solutions to the heavy-duty class of commercial vehicles is another important step in fulfilling our vision of a zero-emissions future.”\n\nThus far, the Badger has been a mere rendering that has lit-up social media feeds.\n\nThe company did begin taking pre-orders for the electric super pickup truck in late June. On paper, the truck stands to be a beast. It’s expected to have 906 horsepower and have a 600-mile range using both battery and hydrogen fuel cells. Nikola has said pricing will start at $60,000 for the electric vehicle version and $90,000 for the one that also includes the hydrogen cell.\n\nThe Badger is expected to be unveiled in early December. Production has been set for 2022.",
        "subreddit": "investing",
        "title": "Nikola and GM team up to make 900-horsepower super electric truck",
        "url": "https://www.reddit.com/r/investing/comments/ios954/nikola_and_gm_team_up_to_make_900horsepower_super/",
        "created": 1599595189.0
    },
    {
        "author": "Nillazek",
        "created_utc": 1601238349,
        "id": "j0y7ad",
        "num_comments": 481,
        "num_crossposts": 0,
        "selftext": "I'm in a finance class in college right now, and we are each paper trading $100,000. The student in the lead right now is up about 6%. (I feel confident I could beat this easily, but I want to do something a little more risky.) No effect on grade, but there is a prize at the end of the semester for whoever makes the most. The simulator allows us to trade options, which I'm fairly certain the rest of the class knows nothing about seeing as the lead right now is only up 6% overall. Give me some good plays! Mods, if this isn't allowed I'll happily take it down, just let me know.",
        "subreddit": "options",
        "title": "$100,000 college homework",
        "url": "https://www.reddit.com/r/options/comments/j0y7ad/100000_college_homework/",
        "created": 1601267149.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1600949794,
        "id": "iyw4q1",
        "num_comments": 468,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2020/09/23/mark-cuban-americans-should-get-a-1000-dollar-stimulus-check-every-2-weeks.html\n\nCuban says that all American households, no matter their income level, should receive a $1,000 stimulus check every two weeks for the next two months. He proposed this same idea in May and says \"I still believe in doing it the exact same way\" today.\n\nAdditionally, families would have to spend each check within 10 days, or they would lose the money, Cuban says. He believes this \"use it or lose it approach\" would be beneficial because it would promote spending, which would help businesses stay open and stimulate the economy.\n\nWithout mandating the money be spent within 10 days of receipt, Cuban believes many Americans will save it. \"People are uncertain about their future, so rather than spending, they save,\" he says. He has a point: Many Americans have been saving more amid the pandemic than ever. In April, the personal savings rate hit a record high, according to the U.S. Bureau of Economic Analysis.",
        "subreddit": "StockMarket",
        "title": "Mark Cuban: Every household in America should receive a $1,000 stimulus check every 2 weeks for the next 2 months",
        "url": "https://www.reddit.com/r/StockMarket/comments/iyw4q1/mark_cuban_every_household_in_america_should/",
        "created": 1600978594.0
    },
    {
        "author": "cannainform2",
        "created_utc": 1600274921,
        "id": "itzdp2",
        "num_comments": 463,
        "num_crossposts": 0,
        "selftext": "Snowflake opens at $245 per share in market debut, after pricing IPO at $120\n\nhttps://www.cnbc.com/2020/09/16/snowflake-snow-opening-trading-on-the-nyse.html?__source=androidappshare\n\n\n\nSnowflake shares surged more than 150% in its market debut on the New York Stock Exchange on Wednesday, in the largest ever software IPO. \n\nStock began trading at $245 per share before being halted due to volatility. Snowflake on Tuesday priced shares at $120, higher than the $100 to $110 range it estimated on Monday, and a huge bump from the $75 to $85 range it proposed in a filing last week. ",
        "subreddit": "investing",
        "title": "Snowflake opens at $245 per share in market debut, after pricing IPO at $120",
        "url": "https://www.reddit.com/r/investing/comments/itzdp2/snowflake_opens_at_245_per_share_in_market_debut/",
        "created": 1600303721.0
    },
    {
        "author": "bluejacket57",
        "created_utc": 1599515458,
        "id": "iogzhp",
        "num_comments": 461,
        "num_crossposts": 0,
        "selftext": "Disney releases D+ just in time for the pandemic is now highly competitive with Netflix which has 182.8 million globally compared with 104.5 million as of Q2 earnings report without even launching in international markets yet. \n\nThis weekend alone, D+ downloads rose +68% due to Mulan. Most importantly, with D+ launch access to Mulan at $30, they have complete ownership of all sales instead of sharing it with movie theaters.\n\nBut the key thing to my thinking is that while Disney’s stock has performed pretty well during the pandemic due to D+, post-lockdown they have pent-up demand for their parks, cruises, and theatrical releases too. They are both a pre-pandemic play and a post-pandemic play. The sun is worth a lot more than the parts in this case. Thoughts?",
        "subreddit": "investing",
        "title": "Disney will be WAY stronger post-covid",
        "url": "https://www.reddit.com/r/investing/comments/iogzhp/disney_will_be_way_stronger_postcovid/",
        "created": 1599544258.0
    },
    {
        "author": "NeoGenMike",
        "created_utc": 1599140114,
        "id": "iltht1",
        "num_comments": 455,
        "num_crossposts": 0,
        "selftext": "Kind of a relief, you know?\nWhen things just keep going up forever you get scared about how bad things are going to be and the more they go up the more you fear to lose. \nHaving a little balance reaffirms my faith in my positions to have consistent gains and not having me sweat about when I should sell.",
        "subreddit": "StockMarket",
        "title": "It feels kind of good to have a big red day again",
        "url": "https://www.reddit.com/r/StockMarket/comments/iltht1/it_feels_kind_of_good_to_have_a_big_red_day_again/",
        "created": 1599168914.0
    },
    {
        "author": "big-sexy89",
        "created_utc": 1601466588,
        "id": "j2kmw2",
        "num_comments": 443,
        "num_crossposts": 0,
        "selftext": "I bought 100 shares of $AMD for something like 2.95 probably 7 years ago or so. It was my first time investing and I had never researched the basics of the stock market. I didn’t really know much but many websites said something to the extent that they could be the next big thing.  So being a 22 year old, impulsive, and irresponsible I bought 100 shares for something like 305 with trading fee. I checked it for a few weeks regularly, nothing happens and I essentially forgot about it. I was discouraged that it didn’t explode to the moon right away and I didn’t do anything. I was very busy with work and school at the time and somehow I forgot that $300 dollars of mine was sitting in ameritrade  flash forward to roughly 2 years later or so and my phone updates the ameritrade app. I’m like “wait don’t I have money on here?”  I recover my password and username and log in to see it’s worth roughly 16 a share. I’m like “holy fuck I got like 1300 in here”. So now I’m hyped and checking it every day. One day it drops to 12 dollars and I panic and sell it all and felt like like wolf of Wall Street.  Well flash forward to last year and I get back into investing at a somewhat responsible and educated level and see that AMD is worth fuckin 88 a share. I contemplated layin down on the train tracks. AMD was one that got away.  Who knows if I’ll ever find another one. I just have to come to terms with the fact that I made a HUGE financial mistake at a young age. \n\nDon’t panic sell. My asshole puckers every time I see people blowing the dick of $AMD and on Reddit that is A LOT.",
        "subreddit": "stocks",
        "title": "Many years ago I bought $AMD for under $3.00....my devastating story and search for redemption",
        "url": "https://www.reddit.com/r/stocks/comments/j2kmw2/many_years_ago_i_bought_amd_for_under_300my/",
        "created": 1601495388.0
    },
    {
        "author": "rsoni1997",
        "created_utc": 1600815458,
        "id": "ixyb9q",
        "num_comments": 441,
        "num_crossposts": 0,
        "selftext": "First of all, here is the link to the YouTube Live stream : [https://www.youtube.com/watch?v=l6T9xIeZTds](https://www.youtube.com/watch?v=l6T9xIeZTds)\n\nNow, it sounds absolutely crazy when I say this, but the first thoughts that popped into my head when I was watching this live - as a non-engineer - if what Elon and his co-presenter are saying, they have a *massive* moat around them. That is, the engineering capabilities they demonstrated on stage were explained somewhat not terribly, but still made sense to me. With that said, what did you guys think?\n\nAlso, some questions for the electrical engineers/others who have experience in this field - how viable and how possible does this innovation seem to you? Is this revolutionary as Elon is saying?\n\nFor everyone else, does this make anyone else feel like they are undervaluing TSLA? I mean, it definitely put some doubt in me as to my current valuation. This morning, if you had asked me, I would’ve definitely said yes. After watching this, I am not so sure. I might even increase the value of the company.  Now, I am an Elon fan but I also know his tendency to not follow through with deadlines, yet still succeeding massively due to his ability to build things from ground up (his first-principles .\n\n Is the comprehensive innovation he is bringing to the whole of the batteries - all the components make TSLA worth more than it is currently? If not, how come?\n\n&amp;#x200B;\n\nThanks guys!",
        "subreddit": "investing",
        "title": "TSLA Battery Day - First Impressions! - Am I undervaluing TSLA? Is TSLA undervalued?",
        "url": "https://www.reddit.com/r/investing/comments/ixyb9q/tsla_battery_day_first_impressions_am_i/",
        "created": 1600844258.0
    },
    {
        "author": "thelunarlemur",
        "created_utc": 1599831013,
        "id": "iqqi3b",
        "num_comments": 435,
        "num_crossposts": 0,
        "selftext": "Nikola announced this morning that it has partnered with the sun to make it hydrogen powered by the year 2040. Reports say that after this partnership was formed, Trevor Milton found out seconds later that the sun was already hydrogen powered and immediately filed a lawsuit with the sun for infringing on his design patent.",
        "subreddit": "wallstreetbets",
        "title": "BREAKING NIKOLA NEWS",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iqqi3b/breaking_nikola_news/",
        "created": 1599859813.0
    },
    {
        "author": "Torlek1",
        "created_utc": 1601084195,
        "id": "izwmta",
        "num_comments": 428,
        "num_crossposts": 0,
        "selftext": "\n[As Electric Truck Startup Hyliion Goes Public, Founder Is Set To Be America’s Youngest Self-Made Billionaire](https://www.forbes.com/sites/christopherhelman/2020/09/25/as-electric-truck-startup-hyliion-goes-public-founder-is-set-to-be-americas-youngest-self-made-billionaire/#499fecc615c9)\n\nIntro:\n\n&gt; If all goes according to plan, Thomas Healy, 28, will become America’s youngest self-made billionaire next week\n\nExcerpts:\n\n&gt; According to SEC filings, Healy will be the biggest shareholder, with 22.9% of the company, or 34.97 million shares, worth nearly $1.5 billion. \n\nHe may not be as slick as the other billionaire electric truck impresarios Elon Musk or Nikola’s disgraced former CEO Trevor Milton, but Healy has one up on both Tesla and Nikola when it comes to getting revolutionary tech onto the road. There are already 20 trucks operating with Hyliion’s electric powertrains, built via ventures with Dana Corp. and Volvo. Tesla said this year it was delaying production of its Semi until 2021. Shares in Nikola meanwhile have collapsed from the $70s to less than $20 amid fraud allegations and the departure of Milton.\n\nAlso:\n\n&gt; Healy’s e-axle evolved into a complete drivetrain system that Hyliion calls the Hypertruck ERX. Replacing the diesel engine is a bank of electric batteries, which are charged via onboard generators that run on tanks of compressed natural gas. Healy’s approach contrasts with the field’s first movers, including Tesla and its all-electric, battery-centric approach, as well as Nikola, which aims to power its batteries using hydrogen fuel cells.\n\nAnd:\n\n&gt; Automotive parts giant Dana Inc. in March 2019 made an equity investment into Hyliion, and together they are manufacturing and marketing the device to Dana’s slate of customers, including truck giants Volvo, Navistar and Peterbilt. Today truck makers install engines from Cummins and transmissions from Allison. Hyliion hopes to someday join that echelon. First large deliveries of the Hypertruck ERX could come in 2021.",
        "subreddit": "stocks",
        "title": "Forbes on Electric Truck Startup Going Public and Youngest Self-Made Billionaire",
        "url": "https://www.reddit.com/r/stocks/comments/izwmta/forbes_on_electric_truck_startup_going_public_and/",
        "created": 1601112995.0
    },
    {
        "author": "LightningPlus",
        "created_utc": 1599010474,
        "id": "ikxj51",
        "num_comments": 424,
        "num_crossposts": 0,
        "selftext": "***‘A large market correction, should one materialise, would encourage more professional selling that could overwhelm the buy-the-dip retail investor.’***\n\nThat’s **Mohamed El-Erian, Allianz’s chief economic adviser**, explaining in [an op-ed for the Financial Times](https://www.ft.com/content/e50812f0-51c1-4f8c-9072-21eb0eb8cb9d) how action in the options pits should be taken as a warning by retail investors who have been cashing in on the stock market’s relentless push higher in recent months.\n\n“The seemingly endless rally… gives the impression that prices are endorsed and supported by the entire professional investment community,” he said. “After all, despite the vocal concerns over valuations having split away from underlying corporate and economic fundamentals, few fund managers have been willing to challenge the market by placing outright shorts. “\n\nHowever, “sophisticated investors” are expressing their cautious views with the use of derivatives, and El-Erian says the mom-and-pop types should take note.\n\n“It is hard to overstate the extent of today’s risk-taking in U.S. financial markets,” he wrote, pointing to the explosive moves in a small number of high-flyers, such as Apple [**AAPL,** **+3.98%**](https://www.marketwatch.com/investing/stock/AAPL?mod=MW_story_quote), Tesla [**TSLA,** **-4.67%**](https://www.marketwatch.com/investing/stock/TSLA?mod=MW_story_quote) and Amazon [**AMZN,** **+1.39%**](https://www.marketwatch.com/investing/stock/AMZN?mod=MW_story_quote).\n\n“Much of this could be seen as market deepening were it not for one troubling fact: corporate and economic fundamentals have yet to reflect a sustained and convincing recovery from COVID-related damage,” he said. The rebound in consumption is slowing, initial jobless claims are back to the 1 million level for a second straight week, bankruptcies are rising, and, according to El-Erian, it’s looking like these short-term disruptions are about to become long-term scars.\n\n“Rather than a well-thought-out bet on the future, stocks reflect many investors’ resolute faith in a consistently favourable and predictable liquidity environment,” he wrote. “It is a backdrop anchored by reliable stimulus from central banks.”\n\nOn the surface, the same can pretty much be said for what we’re seeing in the derivatives market, but there’s more to it than just that.\n\n“The fear of missing out on an unceasing equity rally has increasingly been expressed through call options,” El-Erian said. “Those who would normally short the market on concerns of excessive valuations appear to have no desire to be steamrollered once again by favourable liquidity and the strong ‘buy-the-dip’ conditioning that comes with that.”\n\nHe pointed out that buying call options limits risk and gives traders the ability to take strategic shots at capturing rallies. At the same time, the smart money is hedging bets with downside “tail protection” to guard against the inevitable sharp declines. That’s why we’re seeing the VIX volatility gauge [**VIX,** **-1.09%**](https://www.marketwatch.com/investing/index/VIX?mod=MW_story_quote) decouple from equities, another sign, according to El-Erian, that retail investors are particularly vulnerable when the sellers take the upper hand.\n\nRead More:   [https://www.marketwatch.com/story/the-pros-are-getting-ready-for-a-market-crash-retail-investors-not-so-much-top-economist-warns-11598970447](https://www.marketwatch.com/story/the-pros-are-getting-ready-for-a-market-crash-retail-investors-not-so-much-top-economist-warns-11598970447)",
        "subreddit": "StockMarket",
        "title": "The pros are getting ready for a market crash — retail investors, not so much, top economist warns",
        "url": "https://www.reddit.com/r/StockMarket/comments/ikxj51/the_pros_are_getting_ready_for_a_market_crash/",
        "created": 1599039274.0
    },
    {
        "author": "Thwitch",
        "created_utc": 1600916454,
        "id": "iyp171",
        "num_comments": 410,
        "num_crossposts": 0,
        "selftext": "Fuck you.\n\nYou retards have been pumping this stock for the past six fucking months and only NOW the dump happens. TSLA is up, what, 400% YTD? Without releasing a single new product? Their stock is now dropping after good news because people are starting to realize Elon is not actually going to usher in the second cumming of Christ. \n\nIn the end, this drop is not Elon's fault. Your losses are not Elon's fault. You have no one to blame but yourself, and honestly you should be happy this happened now and not after TSLA market cap gets pumped to $1T or you would be well and truly fucked.\n\nDA big funny \"I lost money on Tesla\" post was funny the first 20 times I saw it this morning. Now it is really just sad.\n\nTSLA 350P 10/1",
        "subreddit": "wallstreetbets",
        "title": "Literally No One Cares You Lost Money on Tesla",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iyp171/literally_no_one_cares_you_lost_money_on_tesla/",
        "created": 1600945254.0
    },
    {
        "author": "rugglenaut",
        "created_utc": 1599563822,
        "id": "iorqbw",
        "num_comments": 405,
        "num_crossposts": 0,
        "selftext": "You know all that nonsense from the Fed about average inflation and how they'll plan to let the economy run soooo hot that they break through the 2% target they never, ever achieved?\n\nWell guess what, there's no fucking way that happens, and the dollar index pump we're seeing right now reflects that. I think a lot of people here think that if the Fed prints money, more money = inflation. But actually that only happens when the average person has more money and increases their spending. But what's happened is that 100% of the money they print gets tied up in the banking system and never spent. This is the same reason there hasn't been significantly inflation in a decade: income inequality. And covid has only made that worse, which is why what we're up against is actually deflation.\n\nAnd why is deflation so shitty? Lower prices are awesome, right? Well, the reason inflation is so great for the US equities market is because (1) equities are inflation neutral and (2) companies are in shitloads of debt. Deflation makes the enormous debt bubble impossible to pay off. (In reality the relationship between the dollar and stocks is pretty complex, which is why you retards are only getting the ELI5.)\n\nIn short, the Fed's move is the same as saying \"we will no longer tax income over $5T.\" It sounds nice, but it doesn't fucking apply. The dollar tanking is a mirage and the bounce back will be swift and merciless. \n\nSPY 325p 11/20",
        "subreddit": "wallstreetbets",
        "title": "The dollar rally is going to kill you all.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iorqbw/the_dollar_rally_is_going_to_kill_you_all/",
        "created": 1599592622.0
    },
    {
        "author": "Lion75774",
        "created_utc": 1599897606,
        "id": "ir8lcs",
        "num_comments": 403,
        "num_crossposts": 0,
        "selftext": "\\&gt;Listen up retards, I want you to start making legitimate low risk guaranteed returns. This strategy if done correctly is actually the most profitable theta strategy, and the only one that can generate more then 70% if your investment consistently every month.    \n\n\\&gt;Quick Steps on how to do it and the TLDR is at the end, although i recommend reading through my explanation    \n\n\\&gt;Ok if you’re still reading we’ll need to establish a few things. A covered call is when you own 100 shares of a stock, and you sell a call against your position.     \n\n\\&gt;So basically if I own 100 shares of spy right now, I can sell a call at 335 giving the right to the buyer of the call to buy my 100 shares at 335 each, in exchange they will give me a premium to have that right, and hence I make money. This strategy works when you’re expecting the stock to be bearish or flat. However, if the call exercises when it is ITM, you will be forced to sell 100 shares of spy at 335 no matter what the price is.    \n\n\\&gt;Now a poor man's covered call uses the same strategy, however using a different collateral. You see, when you buy a call, you are buying the right to buy 100 shares of the underlying at an agreed upon price. Therefore lets take this example, I buy a 335 call on spy, if I exercise it, I can buy a 100 shares of spy for 335 each. Now this right gives us incredible leverage, because we are able to do this, at the same time we can sell another call, such a 335 call. Now if the 335 call we sold is ITM and we are forced to exercise, then we exercise the call we bought, buy 100 shares for 335, and sell it to the other guy for 335, then we’re released from all of its obligation. This also applies to call you sell that are at a higher strike price then the one you’re holding, see if you’re forced to exercise, you’ll make the difference in intrinsic value back as profit. Such as selling a call at the 336 strike price, if you’re forced to exercise then you’ll actually make a 100$.     \n\n\\&gt;Ok you’re with me so far? We have one more strategy to talk about, the diagonal spread. The diagonal spread is a strategy where you buy a long dated call say four months out, and sell another call at a higher strike price and shorter strike price. That way you make money from the premium of the short strike call, while simultaneously making money on the long dated call we bought.     \n\n\\&gt;So this strategy employs these two strategies together on SPY. So let's get started to how you would set this up. First of all, you’ll go to SPY, and look at the current price. Currently Spy closed at 333.91, so we will use this value for our calculations. Now the usual way to find the best long dated option to buy, is to find one that is very close to being OTM or even a dollar or two ITM. The best date is 4 months plus, because you'll have around two months of negligible theta.      \n\n\\&gt;An important point here, the further out the better as the less theta, the more money this will generate long term. In addition, the more ITM the call is the better because it gives you more leeway, I’ll explain how to use this to your advantage later.    \n\n\\&gt;So in our case, the best call to buy, is the 333c Jan 15 2021 for 1943$. Now you buy this, and you’re a proud owner of this call, now it’s time to start selling a call against it. The closest next expiry date is sep 14. Now the 336c call is looking pretty spicey with it’s 123$ premium, so we sell it.    \n\n\\&gt;Now a very simple plug in of the call you sold into a \\[profit calculator\\]([https://www.optionsprofitcalculator.com/](https://www.optionsprofitcalculator.com/)) we see that for this call to remain over the 123$ worth spy will have to open at 337.50 or higher which is more then 4$ increase, which isn’t always likely. Now let’s go over the few scenarios that might occur:    \n\n\\&gt;&gt;\\* spy opens below 337.50, in which case the call will lose its value. As long as spy doesn’t close above 336, then you get to keep the premium, and if spy hovers around the current price and up to 334, the call becomes worth less then 20$, which means you can buy it back and get to keep the 100$ + difference    \n\n\\&gt;&gt;\\*Spy moons 9 points to 342 in one day. To close the call it would cost you 553$ as it would be worth 675. However, keep in mind that our long dated call is now worth 2397. Therefore, if we closed both options we will be at a total loss of 50$. This happens due to gamma of the short call being higher, due to it's shorter expiry date. If you had cash, you can buy back that call you sold, and lose 553 cash on hand, and be 50$ negative on your entire portfolio. Then you can turn around and sell more calls    \n\n\\&gt;&gt;\\*Spy has a retarded correction, or even god forbid a crash. In which case your long dated call will rapidly lose value and if spy loses more then 15% of its value, such as below 280$ then you lose 85% of the value of the spread. On the other a correction of 10%, would make the spread lose 65% of its value    \n\n\\&gt;&gt;It’s very important to remember, the type of equity that spy represents, which is the entire US market. For context, in the last 5 years, spy has only had 7 instances of a correction over 10% which can result in a heavy loss with this strategy. Now let’s look at the possible actions to take in every scenario.    \n\n\\&gt;&gt;\\*If the call has lost more then 80% of its value, or really any amount where your profits are over 120, them buy it back and close it.    \n\n\\&gt;&gt;\\*If the call becomes ITM and you’re forced to close it, then look at your options(no pun intended)    \n\n\\&gt;&gt;&gt;\\*If you have enough cash to close it, and you don’t have any possible use for that available cash within the next two weeks then close it.     \n\n\\&gt;&gt;&gt;\\*If you don’t have enough money to close the call or you’re not willing to lose that available cash, then simply close both options with either a profit or a loss depending on how had spy mooned that day.        \n\n\\&gt;Now after you’ve done this once, let’s say you were successful and the call you sold was worth less and you made premium back. Now you have more cash on hand, and you’ve made money. Keep in mind, this also means more leeway, in case the next trade you might have to close the short call at a loss, either available cash loss, or net loss.     \n\n\\&gt;Doing the math on possible profits. In a single month, you are able to sell 12 spy calls. If a spy remains flat, or has a slow upwards trend, and says on average you sell your calls at a profit of 100$, then you can make 1200$ from the spy, on a 2000$ investment. Every month, until expiry on the long call. If spy rises, then your initial call would also increase in value, resulting in extra profits when you eventually close it.     \n\n\\&gt;\\_\\_NOW COMPARE THIS TO THE WHEEL STRATEGY\\_\\_ you would need a minimum of 33,000$ in order to buy a 100 shares of spy. Now first of all, the upfront collateral is ridiculous, and not many can afford it. If you’re asking yourself, well why can’t I use a cheaper stock, remember that only a spy has 12 contracts per month, every other etf and stock only has 4 per month. Furthermore, due to the sheer volume of spy, it's more reliable in terms of premiums.    \n\n\\&gt;Here’s the best part too, spy increasing in value won’t benefit you with the wheel strategy, as you’re forced to sell your shares at the strike price of the short call. On the other hand, let’s compare the potential losses with this strategy, If spy were to lose 10% of value down to 300, then you’ll lose 3000$ vs only 1600$ with our long call. In addition, if spy keeps losing value you’ll keep losing money, while your gains are capped with the long call.     \n\n\\&gt;Thereby the obvious advantages of this strategy:    \n\n\\&gt;&gt;\\*We profit from spy’s increase of value and its flatness        \n\n\\&gt;&gt;\\*Our maximum losses are capped, and the more successful calls we sell the less our risk becomes.        \n\n\\&gt;&gt;\\*Our total needed collateral is a fraction of spy, at usually around 6%. Keep in mind that the same call, 333c at an expiration of sep 17 2021, a leap year call, is only 3000$, which is still only 9% of the value we’d usually need.     \n\n\\&gt;And the best part, is how scalable this is, at an average of 100$ per contract sold profits, we can make back out entire about a month and a half, and we can buy another long contract. This way, spending 4000$, for an average return of 200$ per contract. This is ofcourse not counting our long dated calls increasing value with spy.     \n\n\\&gt;This is to make your mouth water at the possible tendies. A 10,000$ investment, which is 5 contracts, can generate 6000$ per month on average, or even higher depending on market conditions. Keep in mind, the same amount of money, the 33,000 needed to use the wheel strategy, can generate 20,000 a month, vs the regular 1200 it can generate.    \n\n\\&gt;Keep in mind, this only works if spy is in an flat and positive trend. To put things into perspective, it takes 1.5 months to generate enough money to buy a second contract.  Now that you’d be making double the money, that means you’ll need half the time, to get the second contract, and because we’re buying the contract at a higher strike price for the same price of around 2000, we keep covering higher and higher values of spy. So the second contract takes 1.5 months, the second would take three weeks, the third would take a week and half, the fourth would take 2 option dates, and them you’ll be making enough money to buy another call, every weekly option.    \n\n\\&gt;I’ll make a part 2 about how to take this strategy further if you are successful to layer calls upon calls, virtually building a tranche that becomes very profitable.     \n\n\\&gt;So I hope you employ this strategy to start making real money, and generating actual returns that are consistent, while still basking in the glory of theta gang, without needing the ridiculous amount of collateral\n\n\\&gt;TLDR : For the absolute retards who don't want to read but instead want to know positions: you’ll need around 2000 - 2500 $ to employ this strategy correctly        \n\n\\&gt;&gt;\\*Buy long dated spy call, 4+ months out such as 335c Spy Jan 15 2021     \n\n\\&gt;&gt;\\*Then sell calls on weekly spy, 3-5$ OTM     \n\n\\&gt;&gt;\\*If the call you sold becomes ITM, buy it back with the cash on hand, if you can't, close both positions, and re-enter your long position at a higher strike price\n\n\\&gt;&gt;\\*If not, buy the call back on the expiration day when it's lost 80% + of its value    \n\n\\&gt;&gt;\\*Rinse and repeat    \n\n\\&gt;&gt;\\*You’ll only be able to sell calls in this scenario, of 335c or higher, therefore if a spy's value drops where the 335c becomes worthless to sell, in this case if its value is less than a 100. Then exit your long dated call, and buy another one at spy’s current level",
        "subreddit": "wallstreetbets",
        "title": "Why the Poor Man's Covered Call is the most consistently profitable strategy in existence:",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ir8lcs/why_the_poor_mans_covered_call_is_the_most/",
        "created": 1599926406.0
    },
    {
        "author": "huntteerr",
        "created_utc": 1599538531,
        "id": "iomybc",
        "num_comments": 401,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "tesla call holders “it don’t go down”",
        "url": "https://v.redd.it/fqoibyilnul51",
        "created": 1599567331.0
    },
    {
        "author": "rhoadsalive",
        "created_utc": 1600173721,
        "id": "it7zdv",
        "num_comments": 396,
        "num_crossposts": 0,
        "selftext": "Nikola Failed to Address 43 of our 53 Questions. Of Those It Touched On, It Largely Confirmed Our Findings or Raised New Questions. \n\nNikola Admitted That Its Deceptive “Nikola One in Motion” Video Was, In Fact, Video of The Semi-Truck Simply Rolling Down A Hill. \n\nThe Company Says It Never Claimed the Truck Was Powering Itself, Despite Deceptive Editing and Claims That it Had “1,000 HP” With “Sports Performance”\n\n&amp;#x200B;\n\nThe whole response: \n\n[https://hindenburgresearch.com/nikola-response/](https://hindenburgresearch.com/nikola-response/)",
        "subreddit": "investing",
        "title": "Hindenburg: We View Nikola’s Response As a Tacit Admission of Securities Fraud",
        "url": "https://www.reddit.com/r/investing/comments/it7zdv/hindenburg_we_view_nikolas_response_as_a_tacit/",
        "created": 1600202521.0
    },
    {
        "author": "greeneverydayok",
        "created_utc": 1600018774,
        "id": "is2osy",
        "num_comments": 393,
        "num_crossposts": 0,
        "selftext": "Talked to a friend who works for fedex and he said that he can work 20 hours overtime everyweek. It is super busy. I am thinking of buying Yolo Fdx 300C this Friday. What do you guys think? Any ideas? Let's get these money. Stocks just go up right?\n\nStrange they say my post is too short and deleted first one. Second entry here... Let's do it guys.\n\nFdx 300 c\n\n\n\nLets go",
        "subreddit": "wallstreetbets",
        "title": "Fedex earning Tues. Boom or burst?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/is2osy/fedex_earning_tues_boom_or_burst/",
        "created": 1600047574.0
    },
    {
        "author": "Grumpy-james",
        "created_utc": 1599846891,
        "id": "iqvm3j",
        "num_comments": 391,
        "num_crossposts": 0,
        "selftext": "So mods have been having to remove to many posts, and ban to many people. This post goes into affect after i make and eat my breakfast. hope you tsla retards dont sort by new.\n\n*I am going to make this post.*\n\n*You are going to* ***read*** *this post.*\n\n*You are* ***not*** *going to be* ***banned***.\n\nIf you don't,\n\n*1st offence 1-3 days.*\n\n*2nd offence 7-10 days.*\n\n*3rd offence 30-90 days.*\n\n*4th offence permanent ban.*\n\n  \n\nPosts containing the following material **may** result in a ban. This is in order to keep the board organized and clean. \n\n* TSLA shit posts. \n   * *I am talking bottom of the barrel here. We have been getting way too many TSLA shit posts. This detracts from other yung autismo’s falling into their own little squares. You can still TSLA shit post, but if its total garbo and gets removed, don’t be surprised if you also get temp banned.*\n   * *Same goes for RKT*\n   * *Or NKLA (I know this is bad timing)*\n* Bad gain/loss porn screenshot.\n   * *The graph is really cool and all but what we really want to see are those big juicy retard strength options. For example, 400 contracts of AMD expiring right fucking now. That’s retarded!*\n* Low market cap stocks. Few billion is lowest. Low volume stocks are also subject to ban.\n* Posts that boil down to, “hurr durr im retarded, tell me what i buy?”\n* Reposting news articles without adding a discussion question to it / reposting garbage news articles.\n* Low tier shitposts. You just don’t need to make that post bro, try the daily tread. \n* Question that can be googled such as, “I’m Canadian, which broker do I use?” \n* Questions that could possibly serve as a promotion of some product. Such as but not limited to:\n   *  Which broker do I use in x country?\n   * What do you think about signal group / stock course?\n\nP.s. Use the daily thread for questions like what do i do etc. etc.",
        "subreddit": "wallstreetbets",
        "title": "Familiarize Yourself with the Rules",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iqvm3j/familiarize_yourself_with_the_rules/",
        "created": 1599875691.0
    },
    {
        "author": "RemarkableTry9",
        "created_utc": 1600039298,
        "id": "is95kv",
        "num_comments": 379,
        "num_crossposts": 1,
        "selftext": "[tiktok rejects Microsoft deal](https://www.google.ca/amp/s/www.nytimes.com/2020/09/13/technology/tiktok-microsoft-oracle-bytedance.amp.html)\n\nLooks like the Microsoft-Tiktok deal has fallen through. \n\n\n“The owner of the Chinese app TikTok rejected an offer on Sunday from Microsoft to take over the firm’s U.S. operations, according to Microsoft officials and other people involved in the negotiations, as time runs out on an executive order from President Trump threatening to ban the popular app unless its American operations are sold.”\n\nHowever, it appears Oracle is still in the running. \n\n“The move leaves Oracle — one of the few Silicon Valley firms to publicly ally with Mr. Trump — as the sole publicly known remaining bidder for TikTok.” \n\nOnce there were rumours going around of a potential deal MSFT share price began to rise, but now that the deal’s fallen through, what could this mean for MSFT tomorrow?",
        "subreddit": "stocks",
        "title": "TikTok rejects Microsoft deal",
        "url": "https://www.reddit.com/r/stocks/comments/is95kv/tiktok_rejects_microsoft_deal/",
        "created": 1600068098.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1601453177,
        "id": "j2i2ty",
        "num_comments": 379,
        "num_crossposts": 0,
        "selftext": "These daily discussions run from Monday to Friday including during our themed posts.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?sort=new&amp;q=Rate+My+Portfolio+-+r%2FStocks+Quarterly+Thread&amp;t=all&amp;restrict_sr=on).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion Wednesday - Sep 30, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/j2i2ty/rstocks_daily_discussion_wednesday_sep_30_2020/",
        "created": 1601481977.0
    },
    {
        "author": "welcometotheendguys",
        "created_utc": 1599141212,
        "id": "iltt53",
        "num_comments": 376,
        "num_crossposts": 0,
        "selftext": " We might be in a bubble. We’re not at the later stages yet, but we’re getting there. Here’s a quick refresh on the 5 stages of a bubble and where I think we are in the stages.\n\n**1. Displacement**\n\n**A displacement occurs when investors get enamored by a new paradigm, such as an innovative new technology or interest rates that are historically low. A classic example of displacement is the decline in the federal funds rate from 6.5% in July 2000, to 1.2% in June 2003. Over this three-year period, the interest rate on 30-year fixed-rate mortgages fell by 2.5 percentage points to a historic low of 5.23%, sowing the seeds for the subsequent housing bubble.**\n\nIn our case the displacement is the Coronavirus pandemic. It has completely shifted how we think about--and value--technology stocks. Everyone is talking about the “post COVID world” and how that has upended tech companies.\n\n**2. Boom**\n\n**Prices rise slowly at first, following a displacement, but then gain momentum as more and more participants enter the market, setting the stage for the boom phase. During this phase, the asset in question attracts widespread media coverage. Fear of missing out on what could be a once-in-a-lifetime opportunity spurs more speculation, drawing an increasing number of investors and traders into the fold.**\n\nWe’ve already seen record numbers of retail investors joining the ranks. Everyone is stuck at home with nothing else to do and a bit of extra money from the stimulus, so they are deciding to learn how to ~~gamble~~ invest.\n\n**3. Euphoria**\n\n**During this phase, caution is thrown to the wind, as asset prices skyrocket. Valuations reach extreme levels during this phase as new valuation measures and metrics are touted to justify the relentless rise, and the \"greater fool\" theory—the idea that no matter how prices go, there will always be a market of buyers willing to pay more—plays out everywhere. For example, at the peak of the Japanese real estate bubble in 1989, land in Tokyo sold for as much as $139,000 per square foot or more than 350 times the value of Manhattan property.﻿ Similarly, at the height of the internet bubble in March 2000, the combined value of all technology stocks on the Nasdaq was higher than the GDP of most nations.**\n\nIMO, we’re in the early to mid stages of euphoria. Asset prices aren’t skyrocketing, but they’re increasing rapidly. It’s not insane yet, but we’re getting there. \n\n**4. Profit-Taking**\n\n**In this phase, the smart money—heeding the warning signs that the bubble is about at its bursting point—starts selling positions and taking profits. But estimating the exact time when a bubble is due to collapse can be a difficult exercise because, as economist John Maynard Keynes put it, \"the markets can stay irrational longer than you can stay solvent.\" In August 2007, for example, French bank BNP Paribas halted withdrawals from three investment funds with substantial exposure to U.S. subprime mortgages because it could not value their holdings.**\n\n﻿ **While this development initially rattled financial markets, it was brushed aside over the next couple months, as global equity markets reached new highs. In retrospect, Paribas had the right idea, and this relatively minor event was indeed a warning sign of the turbulent times to come.**\n\nThis could be us if we’re smart about it. Now, obviously we can’t time the market perfectly. But we can play the odds and start hedging our bets when we get to a point where it seems likely that we’re in a bubble. In the meantime we can still ride it out for a bit more gains. \n\n**5. Panic**\n\n**It only takes a relatively minor event to prick a bubble, but once it is pricked, the bubble cannot inflate again. In the panic stage, asset prices reverse course and descend as rapidly as they had ascended. Investors and speculators, faced with margin calls and plunging values of their holdings, now want to liquidate at any price. As supply overwhelms demand, asset prices slide sharply. One of the most vivid examples of global panic in financial markets occurred in October 2008, weeks after Lehman Brothers declared bankruptcy and Fannie Mae, Freddie Mac and AIG almost collapsed. The S&amp;P 500 plunged almost 17% that month, its ninth-worst monthly performance.  In that single month, global equity markets lost a staggering $9.3 trillion of 22% of their combined market capitalization.**\n\nDon’t let this be you, but if it is, just sit tight and buy once prices drop. \n\n&amp;#x200B;\n\n**Finally**, a good warning sign that the market is entering bubble territory is the widespread use of the following expressions by supposed experts:\n\n* “Our only problems are the problems of success”\n* “Prices have adjusted to a new paradigm in which higher valuations will be the norm”\n* “Globalization/communications technology/freer trade/wealthy investors from some part of the world you’ve never heard of justify these higher prices”\n* And, of course, “this time, it’s different”.\n\nIt won’t be.\n\n**What you should do:**\n\n* Watch out for these warning signs\n* When we start seeing mass hysteria and even more inflated prices, start hedging your bets with shorts or put options\n\nLet me know your thoughts.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\*much of the information about the stages of bubbles was taken  from an Investopedia article. No plagiarism intended, they just have helpful information.",
        "subreddit": "stocks",
        "title": "Are we in a COVID/tech bubble? Here’s how to tell (+ my thoughts)",
        "url": "https://www.reddit.com/r/stocks/comments/iltt53/are_we_in_a_covidtech_bubble_heres_how_to_tell_my/",
        "created": 1599170012.0
    },
    {
        "author": "betcho",
        "created_utc": 1599051783,
        "id": "il6dao",
        "num_comments": 375,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2020/09/02/private-payrolls-grow-by-428000-but-miss-expectations-adp-report-says.html\n\nI suppose this means that the market will be green today?\n\nI've been watching the premarket closely this morning and it didn't even dent it.\n\nAre such news no longer relevant?",
        "subreddit": "investing",
        "title": "Private payrolls rose by 428,000 in August, coming short of expected 1.17 million",
        "url": "https://www.reddit.com/r/investing/comments/il6dao/private_payrolls_rose_by_428000_in_august_coming/",
        "created": 1599080583.0
    },
    {
        "author": "IronBlock",
        "created_utc": 1601330639,
        "id": "j1m1jx",
        "num_comments": 373,
        "num_crossposts": 0,
        "selftext": "I’ll keep it brief.\n\n#Why is it a big deal?\n\nAmerican home Internet is garbage. Even if you want your ISP to come upgrade your shit because your entire family is on zoom and Netflix 24/7, good luck. Long waits, and if you need a new modem to get the faster speeds, you may as well just walk out into traffic.\n\n#Who gives a shit about the iPhone?\nLots of people. It’s popular, and Joe and Stacy Sixpack aren’t switching to a 5G Android miPhone off AliExpress just because some neckbeard in their orbit is reeeing about muh Open Sores.\n\n#Why would anyone buy a $1500 fashion accessory during a pandemic?\n5G is pretty fast. Unlimited data is pretty cheap. Most carriers can enable it from their website. Daddy is getting the new iPhone so he can tether his laptop and watch myfreecams while mommy has a “one on one” with her boyfriend. Meanwhile, their eight kids can watch YouTube. Nobody buffering, domestic harmony restored.\n\n#Shut up and tell me how to make money off this\nApple is notoriously fussy about presentation dates. They’re pretty easy to predict, even without leaks.\n\nInvitations go out Oct 1 for an event on Oct 13 or Oct 8 for an event on Oct 20, preorders on Oct 16 or Oct 23 so they can announce numbers during Oct 28 earnings call.\n\nBased on how dicked down they got last time the exact microsecond Tim said “this event is about the iPad and the Watch”, expect the hype to be absolutely uncontainable this time - there’s no doubts, and we might see the first ARM Macs too.\n\nTL;DR: AAPL 135C 10/16-10/30 spreads, or just buy the 135C for 10/16 if you’re a mad lad (they’re still fucking cheap)",
        "subreddit": "wallstreetbets",
        "title": "iPhone 12 is a bigger deal than anyone realizes: how to time your play",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j1m1jx/iphone_12_is_a_bigger_deal_than_anyone_realizes/",
        "created": 1601359439.0
    },
    {
        "author": "Cory0527",
        "created_utc": 1599904794,
        "id": "ir9wnj",
        "num_comments": 373,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "RobinHood",
        "title": "Well, it was nice knowing ya. My wife is gonna kill me.",
        "url": "https://i.redd.it/yu4koreuwom51.jpg",
        "created": 1599933594.0
    },
    {
        "author": "M1st3r5",
        "created_utc": 1599746880,
        "id": "iq3yxm",
        "num_comments": 363,
        "num_crossposts": 0,
        "selftext": "“Short seller Hindenburg Research published a report on electric truck maker Nikola Inc. on Thursday, accusing it of being an \"intricate fraud\" built on lies told by its Founder and Executive Chairman Trevor Milton over many years. Nikola shares fell 3.7% on the news. \"We have gathered extensive evidence-including recorded phone calls, text messages, private emails and behind-the-scenes photographs-detailing dozens of false statements by Nikola Founder Trevor Milton,\" said the report. \"We have never seen this level of deception at a public company, especially of this size.\" Nikola has misled partners by making false claims about the company's technology, including its hydrogen fuel cell batteries, which Hindenburg says never existed. The company is now planning to use General Motors Co. battery technology after signing a deal with GM this week, under which it will issue $2 billion of new shares to GM. Nikola did not immediately respond to a MarketWatch email and telephone request for comment.”\n\n[Source](https://finance.yahoo.com/m/e2744fb5-baa3-38b8-8bb4-d235e63bc422/short-seller-hindenburg.html)\n\nTLDR;\n\nNikola/Trevor === scam/fraud.\n\nPositions: NKLA $30p 9/18",
        "subreddit": "wallstreetbets",
        "title": "Short seller Hindenburg Research published report accusing Nikola of being an “intricate fraud”",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iq3yxm/short_seller_hindenburg_research_published_report/",
        "created": 1599775680.0
    },
    {
        "author": "swaggymedia",
        "created_utc": 1599316192,
        "id": "in216f",
        "num_comments": 358,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "It was just SoftBank all along.",
        "url": "https://i.redd.it/8l5xn3zmacl51.jpg",
        "created": 1599344992.0
    },
    {
        "author": "Pfacejones",
        "created_utc": 1600544194,
        "id": "ivz8fu",
        "num_comments": 350,
        "num_crossposts": 0,
        "selftext": "\nThis makes me suspicious that they just took it instead of actually losing it. I realize it’s all the same and I fucked up royally and will never see the money again, but is there anything I can do to at least find out the truth of the matter. \n\nTheir excuse for not sending me the screenshots is that it will somehow incriminate them of illegal trading. But I’ve looked it up and it’s only an issue If you’re doing it for more than 15 people.\n\nI have been harassed for my idiocy plenty enough and would just appreciate any non-harassing replies.",
        "subreddit": "smallstreetbets",
        "title": "I gave someone on Reddit 1000 dollars to trade for me, and they claim to have lost it all, but refuse to show me screenshots of how they lost it.",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/ivz8fu/i_gave_someone_on_reddit_1000_dollars_to_trade/",
        "created": 1600572994.0
    },
    {
        "author": "reality72",
        "created_utc": 1601138464,
        "id": "j09ahe",
        "num_comments": 346,
        "num_crossposts": 0,
        "selftext": "Title says it all. Yes I agreed to have an unproven vaccine made by a company that has never produced a successful product and then let them inject it into my body. I’m also pretty sure I signed away my right to sue if things go horribly wrong. Yes, I am retarded. Ask me anything.",
        "subreddit": "wallstreetbets",
        "title": "I am a volunteer in Moderna’s phase 3 clinical trial for a Covid vaccine. Ask me anything.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j09ahe/i_am_a_volunteer_in_modernas_phase_3_clinical/",
        "created": 1601167264.0
    },
    {
        "author": "rubberfactory5",
        "created_utc": 1601225966,
        "id": "j0uj3s",
        "num_comments": 345,
        "num_crossposts": 0,
        "selftext": "Seriously. From March to now, at least fucking one of us average joes must’ve been able to get enough wins to be set for life. Like straight up able to play the system and win for once. It’s not me. It could’ve been. But it’s not.\n\nAnd I’m not talking about the motherfuckers who started with 100k play money and made a million. If that’s you, fuck you. You were always fine. \n\nIf there is no story like the one I’m describing? Then... well... we are one conglomerate of god damn losers. But Loss porn is always fun to watch.",
        "subreddit": "wallstreetbets",
        "title": "Fine. Fuck my losses. I hope one of us made covid into a life changing play.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j0uj3s/fine_fuck_my_losses_i_hope_one_of_us_made_covid/",
        "created": 1601254766.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1599490775,
        "id": "io8xqj",
        "num_comments": 343,
        "num_crossposts": 0,
        "selftext": "https://www.businessinsider.com/epic-games-apple-legal-battle-fortnite-usership-plummets-2020-9\n\nEpic wrote in its filing: \"Daily active 'Fortnite' users on iOS have already declined by more than 60% since Apple began its retaliatory campaign.\" The firm added that Apple's actions will \"wreak havoc on the existing Fortnite community.\"\n\nOut of 350 million registered users, more than 116 million are iOS users — equating to a third. \"Fortnite\" is also playable on Android, the Xbox One, PlayStation 4, Nintendo Switch, PCs, and macOS (from which it has also been booted).",
        "subreddit": "stocks",
        "title": "Epic Games says 'Fortnite' users on iPhone have plummeted 60%, and it's trying to force Apple to reinstate the game to the App Store",
        "url": "https://www.reddit.com/r/stocks/comments/io8xqj/epic_games_says_fortnite_users_on_iphone_have/",
        "created": 1599519575.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1600243579,
        "id": "itrfij",
        "num_comments": 342,
        "num_crossposts": 0,
        "selftext": "These daily discussions run from Monday to Friday including during our themed posts.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?sort=new&amp;q=Rate+My+Portfolio+-+r%2FStocks+Quarterly+Thread&amp;t=all&amp;restrict_sr=on).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion Wednesday - Sep 16, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/itrfij/rstocks_daily_discussion_wednesday_sep_16_2020/",
        "created": 1600272379.0
    },
    {
        "author": "port_vale",
        "created_utc": 1600346389,
        "id": "iuimoo",
        "num_comments": 337,
        "num_crossposts": 0,
        "selftext": "NEW YORK – Amid continued revelations over the outsized influence of Reddit’s r/wallstreetbets on the market, machine-learning trader Cedar Hill Capital declared bankruptcy this week after their algorithm learned how to YOLO 100% of the firm’s funds on a NKLA option expiring the next day. “As Bloomberg recently reported, the market’s big players are all watching and scraping popular forums like r/wallstreetbets for retail trading sentiment analysis,” our market expert noted. “The most advanced use machine learning to predict what moves the traders on Reddit might make next. After just a few hours of studying the forum, bankrupted Cedar Hill’s algo learned to spend literally every dollar the fund had, plus margin and an advance on the company credit card, on 0DTE 9/11 $45 NKLA calls which expired worthless several hours later.”\n\nObservers were quick to point out that Cedar Hill’s algorithm had done exactly what it was designed to do in modeling the behavior of a r/wallstreetbets user. Before being discontinued, the algo also posted a screenshot of its billions in losses to the forum and spent the next day suggesting that other users’ wives had boyfriends.\n\n[Source](https://www.reddit.com/r/TheHedge/comments/iuaiqt/trading_firm_bankrupted_after_machinelearning/)",
        "subreddit": "wallstreetbets",
        "title": "Trading Firm Bankrupted After Algorithm Tracking r/wallstreetbets Learns How To YOLO On Weekly Options",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iuimoo/trading_firm_bankrupted_after_algorithm_tracking/",
        "created": 1600375189.0
    },
    {
        "author": "jalapenojacker",
        "created_utc": 1601218083,
        "id": "j0sbbo",
        "num_comments": 336,
        "num_crossposts": 0,
        "selftext": "Take advantage of the EV goldrush by completing the EV Trifecta\n\nAs you may already know, we are currently in the midst of an EV goldrush. Early adopters, investors, and gamblers will be rewarded for identifying these opportunities and capitalizing on them. \n\nOne way to ensure that you gain enough exposure to capitalize on this this gold rush is by completing the EV Trifecta, which are:\n\n1. EV Manufacturers \n2. Raw materials for batteries\n3. EV charging stations\n\nI will go into a bit more detail on each component of the trifecta:\n\n \n\n1. EV Manufacturers - These are companies that develop and manufacturer EV for the public to new purchase. There is a lot of EV manufacturers that are going public, some of them will be achieve market dominance, while others will dwindle away \\*cough\\* NKLA. These are some of the EV manufacturers that are available for the public to invest in: TSLA, NIO, XPEV, KNDI, LI, SHLL, PIC, HCA(C), SPA(Q). Currently, TSLA is the market leader in this industry and also have the first mover advantage, and this is clearly reflected in their stock price. All the other EV manufacturers are up and coming and will have lots of run room as EVs become more prevalent in our day to day lives.\n\n2. Raw materials for batteries - The logic here is that as demand for EV increase, so will the demand for the raw materials used to create the batteries for the EVs. Simple economics 101 states that as demand increase and supply decreases, price should increase accordingly. These are the current raw materials companies that have a spotlight on them: LA(C), VAL(E), PLL. PLL is the only raw materials company that have a public contract with TSLA and has been halted for weeks because of this news. PLL will definitely be a hot buy once it unhalts. \n\n3. EV charging stations - In order for EVs to be come more prominent in our day to day lives, there needs to be a proper infrastructure that will enable that. One of the biggest concerns in regards to EV is range anxiety - drivers don't want to be left stranded if they forget to charge their vehicles overnight at home. Having charging stations that are widely available will help combat this risk. The EV charging station market is relatively untapped, and this market will grow along side the EV market. The key players in the EV Charging station are SBE, BLNK, SPl. SPl had an insane run up last week when they announced their EV initiative, their share price increased over 3000% from $1.50 to over $40 (this was short lived though). BLNK is a mixed bag, there are some complaints in regards to the quality of their charging stations, but hopefully they'll improve over time. SBE is a SPA(C) merger to bring Chargepoint public. Similar to TSLA, Chargepoint is the market leader in the charging station space and also have the first mover advantage. Chargepoint currently has hundred of thousands of charging stations across North America (US and Canada) and is expanding into Europe. Their products can be purchased via their home website or Amazon and have great reviews online. \n\nBy completing the EV Trifecta you'll ensure you have proper exposure to the EV goldrush. I'm sure I missed a few companies, so please feel free to mention them and add any additional details that I might have missed.",
        "subreddit": "investing",
        "title": "Take advantage of the EV goldrush by completing the EV Trifecta",
        "url": "https://www.reddit.com/r/investing/comments/j0sbbo/take_advantage_of_the_ev_goldrush_by_completing/",
        "created": 1601246883.0
    },
    {
        "author": "dudeitsadell",
        "created_utc": 1599106191,
        "id": "ilmhd6",
        "num_comments": 328,
        "num_crossposts": 0,
        "selftext": "I currently have a good chunk of money that I want to invest to hedge against inflation. I have a downpayment and a manageable mortgage and just want to grow my nest egg, so I invest ~40% of it. \n\n1. I have a rental property that most likely will be vacated due to coronavirus once evictions resume. I'm not collecting rent and will have to seek payment once the memorandium is removed. I'm currently paying two mortgages due to this. Because of this, it doesnt make a whole lot of sense to invest in more real estate. \n\n2. Home improvement material costs have risen terribly. Estimates to remodel my home are extremely high (30% higher than Dec) \n\n3. Small businesses are essentially dead in my area. Its been a dream of mine to invest in a resturant but that seems unrealistic for the time being. \n\nDoesn't it seem like the best investment these days is the stock market? I personally have been long since Jan in mostly Apple, but have started to dabble in options. The returns are great and researching companies, etc is fun. I get that he market poses a lot of uncertainity, but so does Housing, Cash, Inflation, etc.",
        "subreddit": "investing",
        "title": "Unpopular Opinion: The crazy run on stocks right now actually makes sense",
        "url": "https://www.reddit.com/r/investing/comments/ilmhd6/unpopular_opinion_the_crazy_run_on_stocks_right/",
        "created": 1599134991.0
    },
    {
        "author": "street-guru",
        "created_utc": 1600870678,
        "id": "iyazdx",
        "num_comments": 324,
        "num_crossposts": 0,
        "selftext": "**BULLS:**\n\n**Oppenheimer: \"Doing More With Less.** TSLA outlined a robust reimagining of battery design, manufacturing, and performance including targeting a $25K vehicle in three years and 20x capacity increase by 2030. It is ramping a pilot line featuring a comprehensive redesign of product architecture, basic materials, and process technology and expects to yield \\~56% cost declines, 54% range improvement, and 69% capex reduction, with initial benefits seen over 12–18 months, achieviing run-rate at \\~three years. TSLA reiterated 30–40% delivery growth in 2020 (implied 478–515K) ahead of consensus estimates. We are impressed with the ambition of the endeavor and believe this roadmap charts ongoing technology and cost leadership for TSLA enabling sales into the entire LDV market. While limited details may weigh on shares, we would be buyers on any near-tearm weakness.\"\n\n**ON THE FENCE:**\n\n**Morgan Stanley: \"A Call to Arms.** Tesla’s battery day largely lived up to the hype, but didn’t clearly exceed it. We think the main narrative is that Tesla’s battery tech is outpacing current growth in supply… and it's time to spend significantly.\"\n\n**Credit Suisse: \"Battery Day plan shows elevated growth narrative ahead, but consider challenges in manufacturing ramp.** Tesla’s much anticipated Battery Day brought several key positives: 1. Battery plans to support aggressive growth over next decade; 2. Growth unlocked via cost reductions on multiple fronts, highlighted by ambitious vertical integration plans; 3. Yet another reminder Tesla is well ahead of other automakers in the push to EV. However, the biggest driver of Tesla’s success in its strategy will be its ability to successfully ramp manufacturing, and we expect challenges along the way. Amid lofty expectations into the event, we see a ‘sell the news’ reaction on the stock given Tesla is still 3 years away from its planned $25,000 vehicle and full benefits from its battery strategy. That said, we ultimately expect weakness to be bought as the event highlighted Tesla’s robust growth narrative.\"\n\n**Canaccord Genuity: \"Battery Day hits on manufacturing strategies, but may disappoint for those that see a tech juggernaut.** As expected, Tesla’s Battery Day and shareholder meeting provided a trove of clues as to the direction of the company. For Bulls, the operational and systems approach to reduce manufacturing costs for autos and energy might be enough to warrant momentum. Bears, however, are likely to point the shift towards what looks increasingly like a modern day auto OEM than a tech company.\"\n\n**Goldman: \"Capacity, Battery Tech and Cost in focus.** Tesla believes that it will see the initial impact of these changes within 12-18 months, and the full impact in about 3 years. In addition, Tesla stated that it could release a $25,000 car in about 3 years as a result of the reduction in pack cost. We believe that a vehicle at this price point (coupled with Tesla's other products) would help Tesla to address a wide range of the light vehicle market (and furthermore EVs offer savings for the typical US driver in the form of lower maintenance and fuel costs that we have previously estimated are about $800 per year vs. an ICE vehicle). We expect the ability and timing for Tesla to fully achieve these targets to be one investor debate post the event, as Tesla has not always met its past targets. While we are incrementally positive on long-term EV adoption, we believe that the company's premium multiple (Exhibit 4 and Exhibit 5) currently reflects this.\"\n\n**BEARS:**\n\n\\*\\*Barclays: \"\\*\\*while it had the usual set of aggressive forward-looking targets, the key question of the stock is whether a more subdued Musk – who uncharacteristically cautioned that the battery innovations were ‘close to working’ – is enough to sustain the valuation. We can see a few days of ‘sell the news,’ especially as Musk did not forecast either the 1 million mile battery (which many Tesla fans expected) or using Tesla cars for vehicle to gird (which we expected), and the ‘one more thing’ was delayed Model S Plaid performance variant. Moreover, the Plaid variant was delayed. After that, however, attention will shift to delivery forecasts for 3Q20, where Musk was silent other than forecasting 30-40% unit growth for 2020.\"\n\n**Needham: \"Will Vertical Integration Make or Break Tesla? We Have 3 Years to Find Out.** At its well-hyped Battery Day yesterday, TSLA announced its transformational plans to more than halve the cost per $/KWH of its batteries through the strategy of vertical integration. The ultimate goal is to increase range by 54%, while cutting cost/KWh by 56% and investment per GWh by 69% in five steps: cell design, cell factory, anode materials, cathode materials and cell vehicle integration (outlined below). This plan will take three years to be fully implemented. While we applaud the company's ambitious plans, we believe it is an inherently risky move with steep execution and operational challenges.\"",
        "subreddit": "investing",
        "title": "$TSLA - summary of analyst thoughts following Battery Day",
        "url": "https://www.reddit.com/r/investing/comments/iyazdx/tsla_summary_of_analyst_thoughts_following/",
        "created": 1600899478.0
    },
    {
        "author": "fitnessfatness",
        "created_utc": 1599230638,
        "id": "imh7bx",
        "num_comments": 323,
        "num_crossposts": 0,
        "selftext": "[https://on.ft.com/3gUWUIZ](https://on.ft.com/3gUWUIZ)  \n\n\n&amp;#x200B;\n\nSoftBank is the “Nasdaq whale” that has bought billions of dollars’ worth of US equity derivatives in a move that stoked the fevered rally in big tech stocks before a sharp pullback on Thursday, according to people familiar with the matter.\n\nThe Japanese conglomerate has been snapping up options in tech stocks during the past month in huge amounts, contributing to the largest trading volumes in contracts linked to individual companies in at least 10 years, these people said. One banker described it as a “dangerous” bet.\n\nThe aggressive move into the options market marks a new chapter for the investment powerhouse, which in recent years has made huge bets on privately held technology start-ups through its $100bn Vision Fund. After the coronavirus market tumult hit those bets hard, the company established an asset management unit for public investments using capital contributed by its founder Masayoshi Son.\n\nNow it has also made a splash in trading derivatives linked to some of those new investments, which has shocked market veterans. “These are some of the biggest trades I’ve seen in 20 years of doing this,” said one derivatives-focused US hedge fund manager. “The flow is huge.”\n\nThe surge in purchases of call options — derivatives that give the user the right to buy a stock at a pre-agreed price — has been the talk of Wall Street in recent weeks, as the sheer size of the trades appears to have exacerbated a “melt-up” in many big technology stocks over the summer. Shares in Tesla soared 26 per cent in under a week to September 1, while Amazon and Google parent Alphabet gained about 9 per cent.\n\nOne person familiar with SoftBank’s trades said it was “gobbling up” options on a scale that was even making some people within the organisation nervous. “People are caught with their pants down, massively short. This can continue. The whale is still hungry.”\n\nThe options boom means that the US stock market remains vulnerable to further bursts of volatility, according to Charlie McElligott, a strategist at Nomura. “The street is still very much in a dangerous space, and that flow is still out there,” he said in a note on Friday, adding that this leaves the market open to swings higher or lower.\n\nThe overall nominal value of calls traded on individual US stocks has averaged $335bn a day over the past two weeks, according to Goldman Sachs. That is more than triple the rolling average in 2017 to 2019. The retail trading boom has played a big part of the frenzy, but investors say the size of many recent option purchases are far too big to be retail-driven.",
        "subreddit": "investing",
        "title": "SoftBank unmasked as ‘Nasdaq whale’ that stoked tech rally - Financial Times",
        "url": "https://www.reddit.com/r/investing/comments/imh7bx/softbank_unmasked_as_nasdaq_whale_that_stoked/",
        "created": 1599259438.0
    },
    {
        "author": "naeschll",
        "created_utc": 1599739651,
        "id": "iq21u1",
        "num_comments": 319,
        "num_crossposts": 0,
        "selftext": "I just finished reading '*The Intelligent Investor*' from Benjamin Graham. Afterwards, I tried my best to put Graham's advice into practice and analysed my portfolio thoroughly. As a sidenote, my portfolio was all US stocks (50% NASDAQ-100 and 50% single tech stocks as AMD, NVID, AMZN, ...). I looked at the balance sheets of the respective companies for the first time, with Graham's words in the back of my mind. After 2 days of analysis, I decided that none of my holdings is worth to hold at its current price. Sure, all of them are really good companies with great future prospects, but they are simply way too overpriced.\n\nOne sentences from Graham sticked to my mind the most:\n\n**The intelligent investor is a realist who sells to optimists and buys from pessimists.**\n\nThat sentence really hit me. It reminded me of the unrealistic optimism among todays \"investors\" that is most embodied in meme sentences like \"stonks only go up\", \"buy the dip\", and so on and so forth. It really made me realize that this whole game is really just nothing but a game anymore, pure speculation from people relying on the FED to keep their gains growing for another couple of month, before eventually everything has to fall apart.\n\nI think selling my positions was the right move as the market seems to be unsustainable and flooded by optimists these days. I know, timing the market is not Graham's advice either, but he certainly does not recommend a \"never sell anything and always try to buy the dip after a 5% correction\" strategy that most people promote on reddit these days. I feel smart and reliefed after selling to optimists.\n\nWhat do you guys think? Did I made a foolish move based on outdated knowledge? Will I get the opportunity to buy from pessimists in the next two years?",
        "subreddit": "stocks",
        "title": "Read 'The Intelligent Investor' &amp; Sold my Portfolio",
        "url": "https://www.reddit.com/r/stocks/comments/iq21u1/read_the_intelligent_investor_sold_my_portfolio/",
        "created": 1599768451.0
    },
    {
        "author": "pikindaguy",
        "created_utc": 1600891289,
        "id": "iyhtlj",
        "num_comments": 317,
        "num_crossposts": 0,
        "selftext": "No new news about it that I can find and it's been a steady drop since this morning.\n\nIt's down to its May levels which was shortly after it became public via SPAC. The drop itself shouldn't be surprising at all, it's that it took so long after all the allegations came out, its founder leaving the company immediately, and the fact that it has nothing to show for itself.",
        "subreddit": "investing",
        "title": "NKLA finishes the day down 26%, down 73% from its peak in June",
        "url": "https://www.reddit.com/r/investing/comments/iyhtlj/nkla_finishes_the_day_down_26_down_73_from_its/",
        "created": 1600920089.0
    },
    {
        "author": "ewemalts",
        "created_utc": 1599601440,
        "id": "ip2w12",
        "num_comments": 316,
        "num_crossposts": 0,
        "selftext": "I'm so fucking disappointed in myself. I was recovering, finally recovering some of my lost money. I lost a shit ton on SPY puts in March. I was retardedly bearish during the entire recovery and flipped a few weeks ago. Finally started seeing some green and was getting back to where I was in before March. And then the market tanked again and I was expecting at least modest green today recovering from the dramatic drop. Of course I was wrong and lost $7k. I'm just always late on the trend and overconfident. I can't imagine how I recover from this aside from years of saving and just never touching options again. You know, maybe that's just the way to go. There is no guaranteed get-rich-quick scheme. Please help me, and thanks in advance for anything you guys have to offer. Also fuck you and fuck me for trying to buy the dip without any sign of momentum change. And fuck SPY for continuing to drop after hours. I've been bag holding SPY $347c 9/11 NFLX $530c 9/11 and NVDA $495c 9/11. Should I just sell tomorrow and walk out with the $2k I'll have left?  \n\nAt least it was money I could afford to lose and I'm still young, but damn... I really messed up.\n\n https://imgur.com/W7Wpac3",
        "subreddit": "wallstreetbets",
        "title": "Help me... Down 95% All Time, 70% Just Today",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ip2w12/help_me_down_95_all_time_70_just_today/",
        "created": 1599630240.0
    },
    {
        "author": "Chango812",
        "created_utc": 1598987575,
        "id": "ikqq4q",
        "num_comments": 314,
        "num_crossposts": 0,
        "selftext": "Im prepared for the downvotes.\n\nLook at a specific digital coins chart pre-2017 and then look at the tesla chart.  We are in full on hype mode where anyone who holds the stock thinks that we are im a massive paradigm shift and that prices will only rise.  If you are able to separate yourself from the emotions of your wins, you'll see that a nearly 6x gain in 6 months is not sustainable.  \n\nThere has been no insane breakthroughs and nothing that fundamentally changed the future of the company. Some will say that \"People are adequately evaluating its potential now\".  Thats not a fundamental shift to its potential earnings, its just a shift to perceived value.  That is exactly what drove a specific digital coins rise too back in 2017... perceived value and hype.\n\nYes. Tesla is amazing. Elon musk is a visionary. They have incredible engineers and are more of a tech company than a car company. All of that is true. It is a fantastic company.\n\nAnd ya, one day i might actually earn its spot as the 7th largest market cap in the United States. But theres a whole lot that needs to go right between now and then.  Its priced for its 2025 or even its 2030 value.\n\nThis will absolutely dip and people who buy now will lose most of their money. It might be 1 month, it might be 3, but its nkt going to hold at 400B market cap.\n\nBE CAREFUL WITH HYPE.\n\nDisclosure: I hold one put. And ill probably lose because i wont time it right.",
        "subreddit": "stocks",
        "title": "Tesla - hype is fun, until its not",
        "url": "https://www.reddit.com/r/stocks/comments/ikqq4q/tesla_hype_is_fun_until_its_not/",
        "created": 1599016375.0
    },
    {
        "author": "mill40",
        "created_utc": 1600448378,
        "id": "iv9y63",
        "num_comments": 312,
        "num_crossposts": 0,
        "selftext": "I had the misfortune of materially entering the stock market for my first time two days before AAPL tanked. This was the first time I put a sizable chunk of cash into any stock. I was ecstatic when I made $100’s after the first day, but now I’m borderline panicking because I’ve now lost $1,000’s. The way I see it, it would have been better to sell at a loss a week ago, saved $1,000 bucks, then buy again once AAPL started to gain. \n\nAnother week has passed, and I’m down even further. \n\nProposed solution: If I sell now at a loss, my money stops shrinking. That way, I can be in a better position to buy when AAPL starts growing again. \n\nWould you sell now or would you hold on? Why?",
        "subreddit": "stocks",
        "title": "I bought A LOT of AAPL shares. Now I’m losing A LOT of money.",
        "url": "https://www.reddit.com/r/stocks/comments/iv9y63/i_bought_a_lot_of_aapl_shares_now_im_losing_a_lot/",
        "created": 1600477178.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1599811599,
        "id": "iqmejo",
        "num_comments": 312,
        "num_crossposts": 0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme and/or [post your arguments against fundamentals here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nMost fundamentals are updated every 3 months due to the fact that corporations release earnings reports every quarter, so traders are always speculating at what those earnings will say, and investors may change the size of their holdings based on those reports.  Expect a lot of volatility around earnings, but it usually doesn't matter if you're holding long term, but keep in mind the importance of earnings reports because a trend of declining earnings or a decline in some other fundamental will drive the stock down over the long term as well.\n\nSee the following word cloud and click through for the wiki:\n\n[Market Cap - Shares Outstanding - Volume - Dividend - EPS - P/E Ratio - EPS Q/Q - PEG - Sales Q/Q - Return on Assets (ROA) - Return on Equity (ROE) - BETA - SMA - quarterly earnings](https://www.reddit.com/r/stocks/wiki/fundamentals-themed-post)\n\nIf you have a basic question, for example \"what is EBITDA,\" then google \"investopedia EBITDA\" and click the Investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nUseful links:\n\n* [Investopedia Tuturiol](https://www.investopedia.com/university/all/fundamental-analysis/) on fundamental analysis including [Discounted Cash Flow](https://www.investopedia.com/university/dcf/) analysis; see [definition here](https://www.investopedia.com/terms/d/dcf.asp)\n* [FINVIZ](https://finviz.com/quote.ashx?t=aapl) for fundamental data, charts, and aggregated news\n* [Earnings Whisper](https://www.earningswhispers.com/stocks/aapl) for earnings details\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion &amp; Fundamentals Friday Sep 11, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/iqmejo/rstocks_daily_discussion_fundamentals_friday_sep/",
        "created": 1599840399.0
    },
    {
        "author": "ixamnis",
        "created_utc": 1601394366,
        "id": "j21rk1",
        "num_comments": 311,
        "num_crossposts": 0,
        "selftext": "A couple of weeks ago, I posted a comment in response to a question about ETFs. This question comes up very often; usually two or three times a week. Maybe more than than.  Several people suggested that it be \"pinned.\"  I obviously cannot do that, however if a mod wants to pin this, feel free to do so.  I did make a few modifications and additions to that comment and for those who haven't gone back to see the changes, I thought I'd post it again here.  Hopefully, this helps people who are interested in an investing approach that is either made up of ETFs or that includes ETFs as a part of their portfolio.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**QQQ** \\- This one uses the NASDAQ 100 as its benchmark. Obviously it's an Indexed, non-managed ETF. XTF used to rate this one as a perfect 10.0 out of 10 rating, but recently dropped it to 9.9 out of 10. It has one of the highest rates of return over the past 10 years of any ETF. It does tend to be tech-heavy, especially with the FAANG +M stocks. (Facebook, Apple, Amazon, Netflix, Google and Microsoft). Other top holdings include TSLA, NVDA and ADBE. (The rating dropped recently when the portfolio of the NASDAQ 100 was re-balanced).\n\n**VOO**/**SPY** \\- **VOO** and **SPY** are non-managed funds indexed to the S&amp;P 500 Index. These funds are very popular on this subreddit, for good reason. They are well diversified, broad market funds investing in mostly US stocks. XTF rates these funds at 9.6 out of 10 because their return on investment over the long term is somewhat tempered by some of the blue chip stocks in the funds. But those stocks also help reduce volatility relative to some other ETFs. These are solid investments, but keep in mind that in the top 10 holdings there will be a lot of crossover between these funds and other broad market funds that hold US stocks like **QQQ**, **VTI**, **VTG**, **VOOG** and **SPYG**. There are differences, of course, as well, but you always want to know where those duplications exist.\n\n**IWF** \\- This is a Russell 1000 indexed fund. It is one of my favorites that doesn't get talked about much. It does have a lot of crossover with the other funds mentioned above, but the mix is slightly different. I would describe this fund as more aggressive than **VOO/SPY**, less volatile than **QQQ**.\n\n**IWM** \\- for someone looking to diversify a little bit, this is a great fund to look into. This fund is a non-managed, indexed fund that uses the Russell 2000 index as its benchmark. The big difference between the Russell 2000 index and many of the the other indexes is that the Russell 2000 index looks at small and mid-cap companies, rather than large-cap companies. Thus, there is zero crossover between this one and the funds mentioned above. While this fund will move up and down with the market, it is often less volatile than the market overall. If you look at the charts, this fund has under-performed some of the other funds over the past few months while the market has been very volatile in an upward direction, but in a crash, this fund would probably outperform the rest of the market. It has a 9.0/10 XTF rating.\n\n**VXUS** \\- Vanguard Total International Index Fund ETF - top holdings include BABA, Tencent, Samsung, Taiwan Semiconductors, Novartis, Toyota. This is a broad market fund investing only in companies overseas. I'm not generally bullish on foreign markets, but this one is a very solid ETF with some companies that are likely to do extremely well for the foreseeable future. XTF rates this one a perfect 10.0 out of 10.\n\n**EEM** \\- iShares MSCI Emerging Markets ETF - This one is going to have a lot of crossover with **VXUS**. It is an Emerging Markets ETF with a lot of focus on China. It includes Alibaba, Tencent, [JD.com](https://jd.com/), along with companies like Samsung and Taiwan Semiconductors. This one should be a solid performer as long as our trade relations with China remain normal.\n\n**EFA** \\- This is another international ETF, but here the focus is mainly on more established companies in Europe and Japan. This is a Large Cap ETF that includes companies like Nestle SA, Roche, Toyota, Novartis and AstraZeneca.\n\n**S*****ector fund ETFs:***\n\n**ICLN**/**TAN/FAN** \\- These funds are clean/renewable energy ETFs. **ICLN** is more broad while **TAN** focuses more specifically on solar energy and **FAN** specifically on wind generated energy. I think renewable energy companies are the future. There is no crossover in the top holdings of this fund with the top holdings of **QQQ** and most of the other broad market funds. Also, these are global, not just US based companies. **QCLN** and **PBW** are also renewable energy funds, but they also contain a lot of TSLA, NIO and W.K. H.S. in their top holdings making them \"electric vehicle\" funds, as well. No problem if you want to add that, but you'll find a lot of Tesla in some of the funds mentioned above.\n\n**ARK** **group of funds:**  **ARKG**, **ARKF**, **ARKK ARKW**, **ARKQ**, **PRNT** and **IZRL**. These are managed funds investing in companies that invest in disruptive companies in their respective industries. Most posters on this subreddit are bullish on these funds. They are aggressive growth ETFs, but should be considered somewhat risky and volatile.\n\n* **ARKG** \\- Genomic Revolution\n* **ARKF** \\- Fintech\n* **ARKK** \\- Disruptive Companies (broader market)\n* **ARKW** \\- Internet/computer/technology (Telsa is a top holding)\n* **ARKQ** \\- Robotics and artificial intelligence\n* **PRNT** \\- 3D printing technology\n* **IZRL** \\- disruptive companies based in Israel\n\n**XL series of funds**. Similar to the ARK series, these tend to be more aggressive growth funds, however these are passively managed indexed funds with various benchmarks that usually are overloaded in the better companies within a sector:\n\n* **XLV** \\- Health Care\n* **XLK** \\- Technology\n* **XLI** \\- Industrial\n* **XLY** \\- Consumer Discretionary\n* **XLP** \\- Consumer Staples\n* **XLF** \\- Financial\n* **XLRE** \\- Real Estate\n* **XLU** \\- Utilities\n* **XLE** \\- Energy/Oil\n\n**Cloud Computing** is another sector to consider. Some tickers in that sector include: **WCLD**, **SKYY**, **CLOU**, **BUG** and **XIKT**. Of these **WCLD** has the best 52 week performance. Top holdings in **WCLD** include **ZM**, **PLAN**, **CRM**, **CRWD**, **ZEN**, **WDAY**, **TENB**, **PCTY**, **DDOG**, **BL**. Many of these are likely to also appear in **QQQ**, however, they would be in very small percentages as the Cap on these companies is much smaller.\n\n***Other sector funds include:***\n\n**Health Care:** FHLC, VHT, IYH\n\n**Utilities:** IDU, VPU, FUTY, RYU\n\n**Oil/Energy:** IYE, FENY, VDE\n\n**Consumer Staples:** FSTA, VDC, IECS\n\n**Real Estate:** ICF, USRT, VNQ, PSR, BBRE\n\n**Media/Entertainment:** IEME, PBS, PEJ, IYC\n\n**Gaming/Casinos:** BJK, BETZ, CARZ\n\n**Transportation (including airlines):** JETS, XTN, FTXR, VIS\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n***A nice portfolio might look something like this:***\n\n**20%** \\- Broad market US fund such as QQQ, VOO or IWF\n\n**20%** \\- VXUS or one of the other International ETFs\n\n**20%** \\- IWM - Small/Mid-cap broad market fund\n\n**10%** **each** in four sector funds of your choice\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n*I'm not a financial expert or advisor and this is not financial advice, just an opinion from a random internet person. I do own shares in several, but not all of the funds listed above, including QQQ, IWF, some ARK funds, ICLN, VXUS, etc.*",
        "subreddit": "stocks",
        "title": "Investing in ETFs",
        "url": "https://www.reddit.com/r/stocks/comments/j21rk1/investing_in_etfs/",
        "created": 1601423166.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1599638797,
        "id": "ipbv2u",
        "num_comments": 309,
        "num_crossposts": 0,
        "selftext": "These daily discussions run from Monday to Friday including during our themed posts.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?sort=new&amp;q=Rate+My+Portfolio+-+r%2FStocks+Quarterly+Thread&amp;t=all&amp;restrict_sr=on).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion Wednesday - Sep 09, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/ipbv2u/rstocks_daily_discussion_wednesday_sep_09_2020/",
        "created": 1599667597.0
    },
    {
        "author": "Player896",
        "created_utc": 1600520634,
        "id": "ivs6dw",
        "num_comments": 305,
        "num_crossposts": 0,
        "selftext": "**I. INTRODUCTION**\n\n* When I look at the sentiment surrounding GameStop, it doesn’t take very long to see [comments]( https://i.imgur.com/lndA70O.png) [like](https://i.imgur.com/Ec4z1fx.png) [these](https://i.imgur.com/6WoeXUS.png), yet here we [are](https://i.imgur.com/NpANVzR.png). What’s going on? Are people that stupid? Just jumping on the new console cycle? Idiots not pulling their gains and going to zero? When even r/wsb thinks the stock is a dud, it must be right? Nearly 120% short interest, yet the stock is up nearly 40% this week. \n* Its no secret GameStop has been hurting. The secular shift to digital has been pressuring them for some time with their highest margin category - used video software – under significant distress. Each year their gross margins contract with net income in the red these past few quarters. Everybody has written them off as the easiest short in the world, however I'm going to try to explain whats going on and tell you that buying GameStop may not be as bad as you think.\n\n**II. CONSOLES**\n\n* Just to start things off, you have to remember we’re in the beginnings of the new console cycle. But what does that even mean? Well the advent of new consoles means new trade-ins, new product, new customers, and a fresh spike in GameStop’s popularity. Sales have stagnated the years prior, and they are all but certain to go up and remain elevated for the next 1-2 years. Note that against all counts, the company was actually profitable during the 2019 holiday season, with new consoles you can bet that they will annihilate all expectations and proceed into 4-8 more positive quarters off the cyclic shift. This is pretty unanimous, and everyone accepts that they will start reporting positive going forward. In fact, new console cycles are where GME has historically [spiked](https://i.imgur.com/LOehh3E.png).\n\n**III. POST CONSOLE CYCLE**\n\n* At this point, the focus turns to what happens once the hype dies down. Digital will continue to erode upon physical, but the key factor here is that physical is not actually dying off. [Its not](https://i.imgur.com/kmVPF39.png) [going to](https://i.imgur.com/rfRRGC9.png) zero. **The biggest reason physical is sequentially a lower percentage of the market is because the total market size is increasing.** Digital is shooting off while physical is largely stagnant. Note that physical games admittedly have their strengths. Not only are they structurally cheaper because you can resell them, they also have clear definitions of ownership and the collectability factor where you *need* to have a physical copy you can hold. In fact, [two thirds](https://www.limelight.com/resources/white-paper/state-of-online-gaming-2019/) of console video game players prefer physical vs digital.\n* While physical is here to stay, albeit at a weaker level, that isn’t enough to turn the tides for GameStop. You see, GameStop knows digital is the trend and here to stay, they are not fighting it, **they are moving along the secular shift**. GameStop sells [digital games](https://i.imgur.com/RZJGjFE.png). GameStop is set to release a mobile app combining Game Informer and a online storefront by [month end](https://i.imgur.com/rdXejYc.png). They are doubling down on their online store with +500% ecommerce growth in [Q1]( http://news.gamestop.com/news-releases/news-release-details/gamestop-reports-first-quarter-results) and +800% growth in [Q2](http://news.gamestop.com/news-releases/news-release-details/gamestop-reports-second-quarter-results-and-strong-progress). Expanding into numerous other [categories](https://i.imgur.com/QSkZEAw.png). Nearly 70% of their online orders were fulfilled on the same [day](https://i.imgur.com/NK8lkqD.png) leveraging their wide network of stores, of which they are pruning the excess. Also, Game prices are set to [increase $10](https://technosports.co.in/2020/09/19/sony-confirms-that-ps5-games-will-cost-up-to-69-99/). \n* GameStop’s Loyalty Program accounts for over 55M [users](http://news.gamestop.com/fact-sheet-0). They intend on leveraging this network though a [company branded credit card](http://news.gamestop.com/news-releases/news-release-details/gamestop-now-taking-pre-orders-sony-playstationr5-and-sony) with spending rewards to grab market share and retain customers. Furthermore, a digital revenue sharing model continues to [grow](https://i.imgur.com/V94FWJC.png) as publishers understand the value of GameStop as a customer acquisition service and that keeping the company afloat is better for sales and the general video game industry. (*[See the fall of Toys R us and its impact on Mattel/Hasbro](https://www.retaildive.com/news/the-toy-category-still-hasnt-recovered-from-the-death-of-toys-r-us/571701/); turns out the manufacturers really needed ToysRUs*)\n\n**VI. BALANCE SHEET**\n\n* But wait, their financials must be shit right? They have to be losing money. How much longer can they last? \n* Well it turns out their books are rock solid. They offered their creditors a new set of terms to push back debt for 2 years, 50% of them [took it](http://news.gamestop.com/news-releases/news-release-details/gamestop-announces-expiration-and-final-results-exchange-offer). They have eliminated all excess goodwill impairments. They are in a [$300M net cash position](https://i.imgur.com/HhfHaIT.png) with significantly reduced inventory (which explains the sharp reduction in Q1/2 sales) and massively cut SG&amp;A by 28% in preparation for the console cycle. [FCF KING](https://i.imgur.com/LYyrrUm.png)\n* Many believe the days of their strong margins are long gone, but in fact its only beginning. You have to remember, digital is only outpacing NEW physical games. [Retro games](https://thenextweb.com/gaming/2019/02/01/retro-consoles-video-game-sales-nostalgia/) are a [huge untapped market](https://www.nintendolife.com/news/2020/01/talking_point_how_much_is_your_video_game_collection_really_worth_to_you) where GameStop can replicate their past success, and it is a category digital can never penetrate. [Jesus wtf.](https://www.pricecharting.com/game/nes/little-samson) GameStop is looking into [these already](https://www.gamestop.com/video-games/retro-gaming/pre-owned)\n\n**V. MAJOR BACKING**\n\n* In fact, their ecommerce prospects are so promising, Ryan Cohen bought a [10% stake](https://investorplace.com/2020/08/gamestop-news-sends-gme-stock-soaring/). This guy took on Amazon and [won](https://www.forbes.com/sites/joanverdon/2020/01/26/ryan-cohen-started-a-company-that-took-on-amazon-and-sold-it-for-3-billion-now-hes-thinking-about-whats-next/#7cdf60865579). [Jefferies](https://i.imgur.com/Duyxu1i.png) and [Talsey](https://i.imgur.com/K169L1N.png), wall street firms, came out with strong buy ratings citing company prospects. [Michael Burry](https://markets.businessinsider.com/news/stocks/michael-burry-top-portfolio-holdings-massive-bet-alphabet-google-scion-2020-8-1029517864#) still holds a 5% stake. This guy took on Wall Street and won. [Half their creditors](http://news.gamestop.com/news-releases/news-release-details/gamestop-announces-expiration-and-final-results-exchange-offer) ($200M worth) believe in GameStop’s prospects. Why would they defer their debt unless they believed the company will be in a paying position by 2023?\n\n**VI. THE SHORTS**\n\n* But here is the real kicker. GameStop’s short float. 120% has never been seen before. The short theory was that GameStop would not make it to the new console cycle and the shorters would collect their tendies. But GameStop made it. Current short fees are like 60% and from some figures we can draw on, we estimate that around 70% of the shorts got in [under $7](https://i.imgur.com/wRaMbLx.png), GameStop is currently nearing $10. **70% of the shorts are underwater.** Even if you don’t believe that any of their initiatives will work you have to admit that the company will be able to continue operating for another two years off the new console hype alone. When the stock hits roughly $15, we can expect to see several margin calls trigger a fucking massive short squeeze. For reference, [Blue Apron](https://i.imgur.com/6EqU417.png), [Volkswagen](https://i.imgur.com/S3DHn3j.gif).\n\n**VII. CONCLUSION**\n\n* Just the fact GME got to the new console cycle must be making the shorts cry. Add on that they’ve been making serious progress towards online and mobile presence, aligning themselves with industry trends, operating in a growing market, potential monopoly in the untapped retro market, solid financials, beginning their new upward cyclic cycle; you have the makings of a powerful ecommerce storefront just leaning into their growth period. Even post console hype, they should be able to leverage their branded credit card to retain a huge number of customers and bite off huge market share off other retailers. Lastly, remember that despite the trend towards digital, its in the gaming industry's best interest to keep GameStop going strong. The likelihood of additional revenue sharing agreements are fairly high.\n* For comparison GameStop has a P/S ratio 0.11. Chewy has a P/S ratio of 3.6. If GME begins to grow their revenue from this point its valuation will begin to normalize. Even a P/S of 0.2 would mean a stock price of ~$16, 0.4 would mean $32. The company is going to ride the console hype and likely trigger more than a few margin calls along the way. Everything management has been doing is to ride the new cycle into a fluid ecommerce business model, and everything I'm seeing suggests its going to work. \n\n[Tl;dr](https://i.redd.it/bxn2mf4bzoj41.jpg)\n\n10c 9/25 to play XBOX prerelease\n\n10c 10/2 to play Mobile App/Stimulus \n\n10c 11/20 to play Console Release Date\n\n10c 4/16 to play Holiday Earnings/short squeeze\n\n***most text references are from GameStop's Q2 transcript which you can find [here.](https://www.fool.com/earnings/call-transcripts/2020/09/10/gamestop-gme-q2-2020-earnings-call-transcript/)",
        "subreddit": "wallstreetbets",
        "title": "Bankrupting Institutional Investors for Dummies, ft GameStop",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ivs6dw/bankrupting_institutional_investors_for_dummies/",
        "created": 1600549434.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1599653519,
        "id": "ipeowz",
        "num_comments": 303,
        "num_crossposts": 0,
        "selftext": "If your question is \"I have $10,000, what do I do?\" or other \"advice for my personal situation\" questions. If you are going to ask how to invest you should include relevant information, such as the following:\n\n* How old are you?\n* Are you employed/making income? How much?\n* What are your objectives with this money? (buy a house? Retirement savings?)\n* What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know its 100% safe?)\n* What are you current holdings? (Do you already have exposure to specific funds and sectors?)\n* Any other assets? House paid off? Cars? Expensive significant other?\n* What is your time horizon? Do you need this money next month? Next 20yrs?\n* Any big debts?\n* Any other relevant financial information will be useful to give you a proper answer.\n\nPlease consider consulting our FAQ first - https://www.reddit.com/r/investing/wiki/faq \n\nBe aware that these answers are just opinions of Redditors and should be used as a starting point for your research. You should strongly consider seeing a registered financial rep before making any financial decisions!",
        "subreddit": "investing",
        "title": "Daily Advice Thread - All basic help or advice questions must be posted here.",
        "url": "https://www.reddit.com/r/investing/comments/ipeowz/daily_advice_thread_all_basic_help_or_advice/",
        "created": 1599682319.0
    },
    {
        "author": "ghathawayjunior",
        "created_utc": 1599380251,
        "id": "inifqy",
        "num_comments": 302,
        "num_crossposts": 0,
        "selftext": "&gt;Drugmakers are planning a public pledge to not send any Covid-19 vaccine to the FDA for review without extensive safety and efficacy data, according to people familiar with the effort.\n\n&gt;The joint stance is seen as a bulwark against political pressure being applied on the Food and Drug Administration to get a vaccine out as soon as possible. It is likely to be announced in a multi-company statement as soon as next week. The plans, which could still change, were described by people involved in the effort on condition of anonymity.\n\n&gt;The companies involved in the discussions include Pfizer Inc., Moderna Inc., Johnson &amp; Johnson, GlaxoSmithKline Plc, Sanofi and possibly others. All are developing vaccines for Covid-19.\n\n\nhttps://www.bloomberg.com/news/articles/2020-09-04/vaccine-makers-plan-public-stance-to-counter-pressure-on-fda",
        "subreddit": "investing",
        "title": "Per Bloomberg: Vaccine Makers Plan Public Stance to Counter Pressure on FDA",
        "url": "https://www.reddit.com/r/investing/comments/inifqy/per_bloomberg_vaccine_makers_plan_public_stance/",
        "created": 1599409051.0
    },
    {
        "author": "DetroitCity1999",
        "created_utc": 1600462543,
        "id": "iveedr",
        "num_comments": 298,
        "num_crossposts": 0,
        "selftext": "I have a bruised ego and $1000 left to trade. While losing $3500 wont bankrupt me it hurts a lot. Any tips for getting back to the top? Im holding shares of apple and RKT for longs. Im trading low risk SPY credit spreads a few times a week for extra cash. I truly believe I could come back from this and many others have had it far worse than me. In a way Im grateful to be in the position Im in. Just tell me it’ll be okay",
        "subreddit": "options",
        "title": "Went from $4500 to $1000 and learned many lessons along the way",
        "url": "https://www.reddit.com/r/options/comments/iveedr/went_from_4500_to_1000_and_learned_many_lessons/",
        "created": 1600491343.0
    },
    {
        "author": "closingbell",
        "created_utc": 1601297936,
        "id": "j1biar",
        "num_comments": 297,
        "num_crossposts": 0,
        "selftext": "Back in March, long before a short seller would raise questions about electric-truck company Nikola Corp. and hasten its founder’s exit, early investors in the company were expressing concerns of their own.Those investors, led by mutual-fund giant Fidelity Investments, were worried that Trevor Milton, for all his brash visionary talk and Twitter braggadocio, lacked the ability that Elon Musk possesses to deliver these sorts of newfangled products to market. They lobbied successfully to remove him as CEO before the company’s June IPO and for Milton’s father to leave the board, according to people familiar with the matter. When the deal was done, Milton only held the title of chairman, the post he resigned this month.\n\nThe back-room negotiations show that Milton’s past was a concern to investors months before General Motors Co. executives placed a bet on the company in a US$2 billion deal carved out after the IPO. They liked Milton’s vision and his ability to raise cash and felt the venture was safeguarded from his shortcomings in operations by his push upstairs, say people familiar with the matter. Nonetheless, the events that have unfolded since the short-seller report, with Nikola’s stock plunging amid a steady stream of negative headlines, have exposed just how high the risks still were.\n\nNow, it’s up to former GM Vice Chairman Steve Girsky, whose blank-check company VectoIQ took Nikola public via reverse merger in June, and Nikola CEO Mark Russell to stabilize the business and regain investor confidence. The plan with GM was to use Nikola’s hot stock and Milton’s ability to raise money to build a hydrogen-fueled trucking business with GM’s technology.\n\n“There is obviously someone on the diligence side who isn’t going to get a nice bonus this year,” said Reilly Brennan, founder of the venture capital fund Trucks Inc. “The best possible thing if you’re a shareholder is that Milton is no longer running the company and you have Girsky as chairman and GM providing technology.”\n\nThe GM deal was originally scheduled to close Sept. 30, and the automaker has said it plans to carry through, but that timing may slip, say people familiar with the matter. BP Plc is still engaged with Nikola in talks to partner on a network of hydrogen fueling stations for fuel-cell trucks the company hopes to sell, but also is slowing the pace for a deal, said the people, who asked not to be identified discussing private information. BP and GM declined to comment.\n\nMilton’s tale reads like a Greek tragedy. The report by short seller Hindenburg Research accused Milton of overhyping Nikola’s technology and has prompted investigations by the Justice Department and U.S. Securities and Exchange Commission. A cousin has accused him of a decades-ago sexual assault, which he denies. The company’s value peaked at US$30 billion and is now worth about US$7 billion.\n\nGirsky and GM Chief Executive Officer Mary Barra have both said publicly that they did plenty of due diligence. People familiar with the matter say that GM found out when scouting the deal that it had better batteries and fuel-cell technology but joined forces because Nikola had a working semi truck and access to capital markets. In addition, GM will get paid to build Nikola’s Badger pickup on existing assembly lines. Milton was so excited to get the Badger pickup program moving that he signed a deal that heavily favored GM, one of the people said.\n\nNikola’s stock and GM’s US$2 billion stake are worth less than half what they were on Sept. 8, when the deal was announced. Milton’s own stake is worth US$1.7 billion, down from almost US$5 billion at one point.\n\nMilton said in a June interview with Bloomberg News that he grew up in modest surroundings in Layton, Utah. His family moved to Las Vegas when he was very young and he lost his mother to cancer shortly after moving back to Utah in the sixth grade. He wrote on Twitter he didn’t finish high school, earning an equivalency certification instead, and later dropped out of college. His Twitter account has since been deleted.\n\nHe grew up in a tight-knit Mormon family, according to Aubrey Smith, his first cousin. She went on social media recently and accused him of sexually assaulting her in 1999 when she was 15 and he was 17.\n\nIn a public account on Facebook and Twitter, and repeated in a phone interview, Smith said that Milton came onto her at the funeral of their grandfather. He took her shirt off without permission, Smith wrote, and then he touched her inappropriately before someone knocked at the door and she ran out.\n\nMilton denied the allegations through a spokesman.\n\nSmith said Milton raised money from family members to get his start. He founded and ran several businesses, including a home-security company that Milton claims he sold for US$1.5 million. Next, in 2009, he founded an e-commerce platform called Upillar.com, which Milton claims “pioneered the shopping cart online.”\n\nThen he got into clean propulsion but ended up embroiled in litigation with dHybrid Inc., which he founded in 2009. The company retrofitted diesel vehicles with natural-gas-burning turbines, claiming the dual system had greater efficiency.\n\nBut a deal with Swift Transportation Co. in 2010 ended in court when Swift alleged dHybrid defaulted on a US$322,000 loan and that it retrofitted only half of the agreed vehicles. The case was dismissed in 2015.\n\nMilton later tried to sell dHybrid to a company called sPower in May 2012 but that, too, got mired in lawsuits after sPower backed out and accused Milton of exaggerating its technological capabilities.\n\nAmid the litigation, Milton started another company with a very similar name, dHybrid Systems, selling it in 2014 to Worthington Industries.\n\nDuring an interview with Bloomberg in June, Milton said that dHybrid Inc. was a success but conceded that, “we ended up closing that one down because of some litigation.”\n\nHis next startup was Nikola, founding it in 2014 in Salt Lake City before moving to Phoenix. Emulating Musk, he took the name from the electricity pioneer Nikola Tesla, and the company was soon billed as the Tesla of Trucks. His plan was seen as potentially disrupting the entire transportation industry by making trucks that ran on batteries or hydrogen-fuel cells. He also planned to build a network of hydrogen filling stations.\n\nFriends and Family\n\nMilton had friends and family members working for Nikola despite resumes that didn’t match the job. His brother, Travis Milton, is director of hydrogen and infrastructure. His LinkedIn profile shows that most of his experience was being “self-employed” in Maui. The short seller, Hindenburg Research, said that Travis Milton poured concrete as a contractor. Milton’s father Bill was originally on the board but stepped down when VectoIQ took the company public.\n\nThe company’s stock prospectus said that Nikola had awarded more than 3 million stock options “to recognize the superior performance and contribution of specific employees.” The list included Travis Milton and an uncle, Lance Milton, the document said, acknowledging that they are relatives.\n\nAs Milton went public with Nikola’s technology, questions soon arose involving his claims about the company’s fuel-cell system. He bragged in an investor video in 2019 that the company had created “what other manufacturers said was impossible to design.” But while Nikola holds patents in fuel-cell and battery technology, most of its planned hardware was coming from German supplier Robert Bosch Gmbh.\n\nNikola Demonstrations\n\nIt became clear that Milton had gotten ahead of himself. A 2016 demonstration showed a truck that didn’t have a working hydrogen-fuel-cell system and was missing key parts, people familiar with the matter said in June. Milton said at the time that the parts were removed as a safety precaution.\n\nIn July of this year, he recorded a video of the semi truck in which he ran alongside the vehicle as it coasted at low speeds in a parking lot. Aping Musk’s combative social-media persona, Milton took a shot at his detractors saying, “these damned trolls, I wonder if they are going to apologize to everyone for the lies they spread the tens of thousands of comments about how fake we are.”\n\nGirsky said in the webcast “Autoline This Week,” in which Bloomberg participated, that he has been in Nikola’s fuel-cell trucks and that they work.\n\nStill, when the GM deal was done, GM will be supplying all of the technology for every global market except Europe. Nikola’s pickup truck, called Badger, will use GM’s Ultium battery, and the semis will run on a fuel cell developed by GM and Honda Motor Co.\n\nSince Milton’s departure, Nikola has billed itself more as an integrator of other technologies into its Badger pickup and semi trucks.\n\nFor GM’s part, the automaker is protected from any financial downside. GM got 11 per cent of the stock for no cash investment and gets paid for its technology. If Nikola fails, GM won’t lose a dime.\n\nMilton has remained silent and is out of the company. He unknowingly presaged his own downfall in the June interview with Bloomberg: “Part of becoming a better person in life is losing everything you have got and having nothing left.”\n\nhttps://www.bnnbloomberg.ca/nikola-founder-milton-s-fall-reveals-what-his-backers-feared-1.1500376",
        "subreddit": "investing",
        "title": "Bloomberg: Nikola founder Milton's fall reveals what his backers feared",
        "url": "https://www.reddit.com/r/investing/comments/j1biar/bloomberg_nikola_founder_miltons_fall_reveals/",
        "created": 1601326736.0
    },
    {
        "author": "Mr_Find_Value",
        "created_utc": 1599023519,
        "id": "il0q0g",
        "num_comments": 296,
        "num_crossposts": 0,
        "selftext": "Maybe it's just me, and this is being said as someone who's nearly always bullish, does it not seem a little.. unnatural the lack of Red days we're having? The last even slightly significant Red day we've had was on July 22nd, a bit over 5 weeks ago, and that wasn't even bad.\n\nIt just seems really weird even given the Fed backstop that we've had really no Red days at all in over a month. This isn't a thorough or intellectual post, just an observation that makes me uneasy. I've been investing for 5 years now and this stretch is the only I can remember with 0 significant Red days in over a month. Even the greatest climbs I've seen have a sprinkling of a -1.5% or -2% day in there every now and then.\n\nIt just feels so unnatural. So odd. I'm not even Bearish. I have no puts, no reverse index positions. I just feel really uneasy. \n\nI'm not claiming we're in a Bubble, or this is the top, or that there's Euphoria. I'm just trying to gauge if anyone else has noticed this? This extremely unnatural stretch of 0 significant Red days at all.",
        "subreddit": "investing",
        "title": "Anyone else concerned with the lack of Red Days in the Market?",
        "url": "https://www.reddit.com/r/investing/comments/il0q0g/anyone_else_concerned_with_the_lack_of_red_days/",
        "created": 1599052319.0
    },
    {
        "author": "CCLyolo",
        "created_utc": 1600955271,
        "id": "iyxkwz",
        "num_comments": 295,
        "num_crossposts": 0,
        "selftext": "Closed everything. Lost a total of 60k my positions (25k yesterday, 35k today) me closing shoved the price to 16.99. NKLA is now of course likely to start rebounding. \n\nIdk how to come back from this..I short sold 2000 NKLA at 16.5  but even if it goes to 0 immediately I'll still be at a loss.\n\n[losses](https://imgur.com/gallery/ryquuWA)",
        "subreddit": "wallstreetbets",
        "title": "End result of my NKLA screwing (ongoing)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iyxkwz/end_result_of_my_nkla_screwing_ongoing/",
        "created": 1600984071.0
    },
    {
        "author": "ContentViolation1488",
        "created_utc": 1600982875,
        "id": "iz68r4",
        "num_comments": 294,
        "num_crossposts": 0,
        "selftext": "# Introduction\n\nThis will be long, but it will also be concise, and is filled with information. Do yourself a favor and read it thoroughly. Don't complain that I got something wrong if you only skimmed the post.\n\nI've been studying options for years, and have read great books such as OAASI cover to cover. In other words, I know some shit. My goal here is to impart a simple strategy that can significantly outperform a \"buy and hold\" strategy on any major index, both so you can make tendies SAFELY, but also to rub it in the faces of those no-nothing /r/investing types who shun options.\n\nOne final note before we begin. I realize you can potentially increase returns on this strategy by utilizing margin to sell naked options and such... but I don't want to advocate a strategy that could blow up retards accounts. What I will advocate here is a 100% cash strategy and has no risk of a margin call.\n\n**This strategy is necessarily no riskier than buying and holding an index fund.**\n\nIf you insist on using margin to increase your returns, I would suggest simply using margin to own double the amount of assigned and held stock, in order to sell double the number of covered calls. This is a relatively safe way to increase returns.\n\n# The Wheel: An IMPROVED \"Buy and Hold\" Strategy\n\nForget credit spreads, diagonal spreads, iron condors, and all that often complicated jazz. The absolute best and simplest theta gang strategy, in my humble opinion, is The Wheel. But I'm going to argue for a very specific version of The Wheel here, and that makes all the difference.\n\nWhile spreads can be effective, we want to maximize returns by collecting FULL PREMIUM for options, and not hedging like a pussy.\n\n**When you think about The Wheel, I want you to picture an IMPROVED \"buy and hold\" strategy.**\n\nThe tried and true advice of most financial advisors out there is to drop cash in something like an index fund and forget about it. While this is good and all, we can clearly do better, by utilizing options. What we are attempting here is to mimic a \"buy and hold\" strategy, while consistently augmenting returns by collecting option premium on top.\n\nThe Wheel is a simple concept. You sell cash-secured puts and collect premium. If you ever get assigned, you hold and sell covered calls on the assigned stock. If your stock ever gets called away, you go back to selling puts. Rinse and repeat, ad infinitum.\n\nThe question of which options to sell and why gets complicated, and I will go into details below, but for simplicity I am advocating simply sticking to 30-45 DTE \\~0.30 delta options on major ETFs.\n\nhttps://preview.redd.it/vntvxqycv5p51.png?width=1286&amp;format=png&amp;auto=webp&amp;s=c0b92bc6d4ecc345f07f4bf09ca2fd4f3f954f85\n\n# The Basic Concept\n\nYou want to get PAID to buy stock at a CHEAP price. You can do that by selling OTM cash-secured puts. And you want to get PAID to sell stock at a HIGH price. You can do that by selling OTM covered calls. When you understand this basic concept, you understand 90% of this strategy.\n\nThis will outperform \"buy and hold\" for two reasons: 1) It collects option premium on top of stock appreciation, 2) It reduces the cost basis for potential stock purchases. These factors also ensure reduced volatility compared with \"buy and hold,\" as both premium and reduced entry points offer downside protection from falling assets. This is inherently a long-term strategy; if you are unwilling to hold an ETF long-term through a drop or even a recession, don't waste your time... you WILL lose money.\n\nWhen I've looked for counter-arguments to The Wheel strategy, the common argument I hear is \"it works until it doesn't.\" In other words, these people argue that if you run The Wheel on a stock that drops hard and doesn't recover, you will lose money.\n\n**This argument completely falls apart if you run The Wheel on INDEX ETFs.**\n\nSPY and other major indices have recovered from every crash they have ever experienced. Individual stocks like Enron have not. If we want to mimic a conservative \"buy and hold\" strategy WITH diversification, we will only play major ETFs. This eliminates the major argument against The Wheel entirely, since it achieves instant diversification and will mimic the broader market. If you think the US economy will crash and never recover, you should be buying guns and ammo and not options.\n\nThe only REAL argument against The Wheel is that you could potentially lose out on stock appreciation during heavy bull runs. While this is true, we will show below that this argument doesn't hold much weight.\n\n# Calculating Returns\n\nIt is relatively simple to calculate potential returns for this strategy, so I will do that now using option prices on SPY as of 9/24/2020. Keep in mind IV is currently high, and so these returns will be inflated relative to a calmer market. Also keep in mind that annualizing returns based on one-month results can get wonky. *This is just an example to get a picture of how things work.*\n\nThere are two phases to this strategy: Selling CSP's and selling CC's. We will calculate each separately, using 30 DTE options and ignoring compounding for simplicity.\n\n**CSP Return (Conservative 0.30 delta):**\n\n\\[(CSP premium \\* 100 shares) / collateral\\] \\* 12 months = Return\n\n\\[($5.30 \\* 100) / $31,000\\] \\* 12 = **20.5% return**\n\n**CSP Return (Aggressive ATM/0.50 delta):**\n\n\\[(9.00 \\* 100) / $32,000\\] \\* 12 = **33.7% return**\n\n**CC Return (Conservative 0.30 delta):**\n\nS&amp;P500 return + \\[(CC premium \\* 100 shares) / collateral\\] \\* 12 months = Return\n\nS&amp;P500 return + \\[($4.12 \\* 100) / $32,500\\] \\* 12 = **S&amp;P return + 15.5%**\n\nNow there are a few caveats for the above calculations. The first is that if the S&amp;P500 rallies well past our CC strike price, we will lose out on those potential gains. This means the CC-side return for the S&amp;P is capped, which can be calculated as follows:\n\n**Maximum CC Return:**\n\n\\[(Strike price - stock price) \\* 100 shares + (CC premium \\* 100 shares)\\] / collateral = Return (one month)\n\n\\[($334 - $325) \\* 100 + ($4.12 \\* 100)\\] / $32,500 = **4.0% (48% annualized)**\n\nBy reversing this we can calculate how much SPY would have to rise to outperform us.\n\n$325 \\* 1.04 = $338\n\nIn other words, if SPY rises more than $13 in one month it will outperform us, but only for THAT MONTH. Obviously the S&amp;P doesn't achieve 48% returns annually and so bull months will be offset by flat and bear months. We will outperform the S&amp;P in both those categories as shown above, which will more than make up the difference in lost potential gains.\n\nOne final note: These calculations assume that all options are held until expiration. In practice, returns can be increased by closing winning positions early. If you achieve 70% gain in 10 days, it makes little sense to wait another 20 days to collect the remaining 30% premium. Simply close and roll as necessary.\n\n# A Guide for Smaller Accounts + Proof of Concept\n\nTo run the strategy I am advocating on SPY, you would need a minimum account size of \\~$35,000. I know a lot of you don't have that much money, so I've done a little experiment for smaller accounts.\n\nI set aside a fund to run The Wheel on smaller ETFs, such as XLE, XLF, and GDX. To run the wheel on these individually you would need an account size no bigger than \\~$4000. Even smaller ETFs such as SILJ could be run for as little as $1500, though they are more risky and less liquid. To prove the concept for smaller accounts, I set aside $10,000 and ran smaller ETFs such as these for 4 months.\n\n**After 4 months, I achieved a 41% annualized return. This outperformed the SPY ETF during the same period by around 5%, despite the fact the ETFs utilized underperformed relative to SPY. This, in my view, provides some proof of concept.**\n\nObviously this return would have dropped significantly during this recent market drop, which is why I stopped running the strategy on the 18th, to avoid losing my own money just for proof of concept. The best strategy will always be adaptive to market conditions, but if you want a one-size-fits-all approach, The Wheel is probably the best you can get.\n\nIn one instance I used margin to purchase an additional 100 shares of SILJ to sell a second CC for \"free\" (minus margin costs), just to offer an example of how margin can be safely used to increase returns. I also sold ATM options on SILJ shares because I wanted to dump it quickly before the crash, and to collect higher premiums. Got very lucky and sold right before the drop on Monday. This is an example of how to adapt the strategy based on your market predictions.\n\nHere is a complete breakdown of my trades during this 4 month period. **Notice that I usually closed positions early in order to increase my $/day return.**\n\nhttps://preview.redd.it/v80b50jfv5p51.png?width=1433&amp;format=png&amp;auto=webp&amp;s=469d57e6bcce2c51641a211801d5997f05675e4b\n\n# A Note on Past Wheel Guides\n\nA prominent past guide on running The Wheel argued that you should always avoid assignment. However, they never made a compelling case for WHY you should avoid assignment. There is an argument to be made for such a position, which I will provide soon. However, there are also a number of arguments to be made in favor of accepting or even seeking assignment. They run as follows:\n\n1) Time Premium is maximized when the strike price is ATM. If we are selling time premium (Theta), selling ATM will tend to maximize premium returns long-term.\n\n[Apparently this picture didn't exist on the internet until now...](https://preview.redd.it/16ijbdsgv5p51.jpg?width=4608&amp;format=pjpg&amp;auto=webp&amp;s=bb7fda8a060de84719695afc98c09f8bb7f644f9)\n\n2) If we are bullish on an Index long-term, we shouldn't have any problem accepting stock ownership. In fact, it will likely increase our returns due to stock appreciation on top of option premium.\n\n3) Stock can be more easily owned on margin than options. Holding double the stock on margin and selling twice as many covered-calls will outperform selling cash-secured puts long-term.\n\nThese past guides also focused on running The Wheel on individual stocks. I have so far not yet seen a guide advocating The Wheel purely on Index ETFs to mimic and outperform a \"buy and hold\" diversified strategy. **This is perhaps the most important takeaway from this guide.**\n\n&amp;#x200B;\n\n**Maximizing Returns: ATM vs. OTM?**\n\nThis strategy is simple enough... Where it gets complicated is in the details. And the most difficult question of all is whether to sell ATM, or OTM, and if so how deep?\n\nLet's start with the absolute ideal scenarios...\n\n**In a bull market: You want to sell ATM puts and OTM calls.**\n\n**In a bear market: You want to sell OTM puts and ATM calls.**\n\n**In a completely flat market: You want to sell ATM puts and ATM calls.**\n\nThe reasoning is simple. If the market is rising, you want to maximize premium on your puts by selling ATM. You also want OTM calls so you don't lose out on gains in stock appreciation when the price rises. The ideal depth for OTM calls would be just above the total underlying appreciation (which obviously is difficult to predict in advance).\n\nBy the same token, if the market is falling, you want to sell OTM puts for downside protection against assignment, and you want to sell ATM calls to maximize premium.\n\nIn a flat market you simply want to maximize premium and have no need for upside or downside protection, and so ATM will perform best.\n\nIf you are brilliant and prescient like me, you can navigate these complicated waters and adapt to the market accordingly. If you are a retard, on the other hand, you can't easily predict where the market is headed...\n\nIn that case, my advice is the following:\n\nALWAYS SELL OTM ON BOTH ENDS. This will give you downside protection from drops, and also give you upside protection from rallies. The consequence of this is your premium returns will be reduced relative to someone who strategically sells ATM options, but that is an acceptable loss for a safer and more conservative strategy if you don't know wtf you are doing. **You will still outperform \"buy and hold\" using this strategy, while also achieving reduced volatility.**\n\nAiming for selling .30 delta, or 70% Prob ITM options, seems conservative enough for me. You can adjust accordingly based on your personal risk tolerance. If you want a more conservative strategy, aim further OTM. If you want more aggressive strategy, aim closer ATM. Keep in mind you MUST be willing to hold stock long-term through a drop to make this strategy viable! If you aren't willing to actually \"buy and hold\" while selling covered calls, look to gamble elsewhere.\n\n# Other Details\n\nThe reasoning for selling 30-45 DTE options, which is advocated by TastyTrade among others, is because theta decay for ATM options accelerates around this range. However, this is only true for ATM options, and OTM options theta decay can actually decelerate closer to expiration. It is likely better to go for longer dated OTM options for this reason, though it won't make a huge difference imo. I would suggest keeping things simple and maintaining a habit around this range.\n\nhttps://preview.redd.it/s3hl0wekv5p51.png?width=586&amp;format=png&amp;auto=webp&amp;s=68e42cee750063a6932f96c151a8fb779f292467\n\nSome people attempt to run The Wheel by selling short-term weeklies/FDs. These individuals are not really selling theta so much as they are attempting to scalp gamma. While this can work, it is not really the consistent, safe, long-term strategy we are looking for here. It also suffers from the reduced theta decay for OTM options which I stated above. If you want to gamble, you might as well be BUYING the FD's, not SELLING them!\n\nI would usually close my options at 50%+ return and roll forward/up when necessary. This will tend to yield greater $/day returns if the underlying is moving in your direction. For example: If you make 80% return in 10 days, it makes little sense to hold another 20+ days for another 20% premium gain. Simply close the position and collect the secured premium to release collateral for another sell. If the underlying is moving against your direction, you generally want to hold until expiration and collect 100% of the premium, even if that means assignment. **Closing a sold option for a loss will DESTROY the returns of The Wheel! Do not do this!**\n\n&amp;#x200B;\n\n**This is probably already too long, so I will stop here. I apologize if I've made any mistakes while writing this. Feel free to ask any questions and I will do my best to answer them!**",
        "subreddit": "wallstreetbets",
        "title": "How to CONSISTENTLY Outperform the S&amp;P500 using Theta Gang Strategy. A Comprehensive Guide to Wheeling ETFs.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iz68r4/how_to_consistently_outperform_the_sp500_using/",
        "created": 1601011675.0
    },
    {
        "author": "maxprtr",
        "created_utc": 1601481395,
        "id": "j2ot11",
        "num_comments": 288,
        "num_crossposts": 0,
        "selftext": "Apparently, after CNBC's LeBeau commented \"Don't be surprised if $GM takes a greater than 11% stake\", NKLA has jumped 10% easy.\n\nUmmmm, for those buyers on this headline, do you still remember what the deal was?\n\nHere is the link to the SEC 8-K report [https://sec.report/Document/0001104659-20-102820/](https://sec.report/Document/0001104659-20-102820/), which should give you the most information on the deal.\n\nTo sum it up, NKLA was going to give, **GIVE, NOT SELL,** 2 billion USD worth of stocks to GM, **for 0 cent in return**. In addition, **GM will also** **be paid** to supply batteries,manufacture NKLA's trucks. **And GM will also receive Nikola's emission credits**. \n\nThis is a shit deal for Nikola. So why would NKLA have agreed to this? Because N**KLA has no capability to build a truck by itself**. It only knows how to integrate. In order to build the Nikola Badger, it has to partner up with GM. **NKLA simply CANNOT do this job by itself.**\n\nNow, frauds claims have plagued NKLA's stocks for weeks. If you are Mary Barra, do you have to walk away from the deal? Hmmm. Why would you? **Why would you walk away from 2 billion dollars for free PLUS a battery customer**? You have nothing to lose here, except for some reputation, since Barra said \"appropriate due-dillgence\" was done. But hey, what due-dilligence needs to be done? **NO DUE-DILLIGENCE needs to be done.** **If you have nothing to lose in a deal, and you can walk away freely, why would you need to do any due-dilligence?**\n\nNow, since the deal has not been closed, and NKLA's share has plummetted more than 50%. If you are Mary Barra, who wants to continue to pursue this \"no-lose\" deal anyway, WOULD YOU STILL ACCEPT THE OLD TERMS? Hey, Nikola, you agreed to give me 2 billion worth (or 11%) of stake when the company was worth 20B, now your company is worth 7B, **OF COURSE I WANT MORE THAN 11% OF YOUR DAMN STAKES NOW right**? Original 2 billion worth of stocks will now be 27% of the company.\n\nAnd now, CNBC's LeBeau speaks, \"GM may take more than 11% stake on NKLA\". Hey bro, **I need you to tell me this shit information**? Yeah, NKLA is 10% up now. But wait a minute, **how can this shitty deal, which now benefits GM even more, benefit NKLA in anyway at all**? Nope, I dont't see it.\n\nMaybe the LeBeau guy is long NKLA stocks, now he plays with words to fool you retards. Headlines easily fool retards. Why spend ten minutes reading into the story and doing the thinking, while you can simply make your investment decision after spending 10 seconds reading a headline? (I mean, just look at SNOW's rise 2 days ago)\n\nIn the end, I simply can't emphasize enough, **this deal is sweet for GM and horrible for NKL**A. But NKLA has to take it because it is desperate. It's simply unable to build trucks by itself. \n\n**Risk disclaimer: I am not telling you NKLA share will go down**. Although I am short NKLA, the greater fool theory tell us, as long as there are more people misunderstanding the headline, the stock may go up. **Invest with caution.**",
        "subreddit": "wallstreetbets",
        "title": "The NKLA-GM deal. In case you retard still don't understand it after all this time.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j2ot11/the_nklagm_deal_in_case_you_retard_still_dont/",
        "created": 1601510195.0
    },
    {
        "author": "GadnukBreakerOfWrlds",
        "created_utc": 1599254778,
        "id": "imooxk",
        "num_comments": 284,
        "num_crossposts": 0,
        "selftext": "Source: https://twitter.com/Fxhedgers/status/1301993263339982848?s=20  \n  \n**ETSY, TERADYNE AND CATALENT SET TO JOIN S&amp;P 500**  \n  \nOne of the big catalysts for TSLA going parabolic last week was of the rumor that it would be included today or very soon. And of course the anticipation for Battery Day.  \n  \nWhat do you guys think about this?  \n  \nPositions: TSLA 100P September 2022  \nProof: https://imgur.com/a/DVxdRez",
        "subreddit": "wallstreetbets",
        "title": "Tesla is not going to be included in the S&amp;P500",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/imooxk/tesla_is_not_going_to_be_included_in_the_sp500/",
        "created": 1599283578.0
    },
    {
        "author": "skillfulCouch",
        "created_utc": 1599670991,
        "id": "ipjzs0",
        "num_comments": 283,
        "num_crossposts": 0,
        "selftext": "Now I know everyone is just going to call me a 🌈🐻 but hear me out. This isn’t simply “just a dip”. People on here are saying “oh this is just another June 10”. No. It’s. Not. June 10 was a 1 day thing and had 4 green days after. If the market wants to be gay and rebound right now then let it, but I’m almost sure that tomorrow will be red again. Just look at the March crash. It started the same way- with a whole week of red days. You know what’s also strikingly similar? How there’s a big green day after the initial drop.  After every few red days in March, there was a massive green day that was followed by an even steeper drop. Like how in March SPY went from 289 to 308, then proceeded to drop to 260 the next day. Don’t get trapped. We’re not “going back to normal”. If this really IS the start of the recovery then... fuck.\n\nTSLA 310p 9/11",
        "subreddit": "wallstreetbets",
        "title": "Unpopular opinion: today is a bull trap.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ipjzs0/unpopular_opinion_today_is_a_bull_trap/",
        "created": 1599699791.0
    },
    {
        "author": "thisguy092",
        "created_utc": 1599327084,
        "id": "in56j7",
        "num_comments": 283,
        "num_crossposts": 0,
        "selftext": "I realize that a lot of people here must be new to WSB or options trading in general. As a long time observer of this fucking circus let me clue you in on some trends that you can laugh at and then ignore.\n\n                 -----□•□•□•□•□-----\n\nPhase 1 of WSB retards losing money: Weeks go by without a single red day. The gains get more and more insane with each passing day. Even red days are under 0.5%. You take out a fuck ton of margin and credit card loans to buy in. An insane bubble and price action to the upside forms and everyone complains about how unsustainable it is while simultaneously buying FDs. Tendies rain upon all the autists and random CEOs become WSB meme gods. No one cashes out, everyone posts unrealized gains. Life is good. But, the rug is finally pulled, and literally all the money you made is gone as you diamond hand your retarded OTM calls. All of your family laughs at your dumbass because you bragged to them about what a genius you were in the stock market. You bring shame to yourself, your village, and all of China.\n\nSee also: sToNkS oNlY gO uP, \"bears r kill\"\n\n\n\nYOU ARE NOW HERE \n  |\n V\nNow for phase 2: The market will flatten and begin to rise again, but not at the insane rate you were just used too. Furiously trying to trade your way back to even, you buy calls. But, all of your weeklies expire OTM because you're so used to 3-18% swings, and no red days for weeks. Even on green days, theta decay eats your ass alive. \n\nSee also: THETA GANG, $ROPE\n\n\n\n\n\nStay tuned for phase 3: capitulation of weaker bulls into bears straight into the next bubble. This is followed by phase one and the cycle continues. See also: rug pull / dont fight the fed/ economy_is_doing_bad_whyarestonksgoingup.exe\n\n\n\n\nThis post is made possible by your local MM's, the Bill and Melinda Gates Foundation, and retards like you. Thanks for reading and fuck you.",
        "subreddit": "wallstreetbets",
        "title": "The WSB Market cycle is about to begin again:",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/in56j7/the_wsb_market_cycle_is_about_to_begin_again/",
        "created": 1599355884.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1600848394,
        "id": "iy612p",
        "num_comments": 280,
        "num_crossposts": 0,
        "selftext": "These daily discussions run from Monday to Friday including during our themed posts.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?sort=new&amp;q=Rate+My+Portfolio+-+r%2FStocks+Quarterly+Thread&amp;t=all&amp;restrict_sr=on).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion Wednesday - Sep 23, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/iy612p/rstocks_daily_discussion_wednesday_sep_23_2020/",
        "created": 1600877194.0
    },
    {
        "author": "amdPCbro",
        "created_utc": 1601485323,
        "id": "j2q2wp",
        "num_comments": 280,
        "num_crossposts": 0,
        "selftext": "Hopefully, my name isn't too biased here. But I will reiterate what people talk about any time AMD is mentioned in the past two months.\n\n1: AMD's CPU leaked yesterday. And to say the least, it looks promising. Article below as I will not go into depth on this. In summary, Intel has had a better CPU for years but this looks like its changing. If priced similarly to previous CPU's, AMD will no doubt be the leader in this price range. \n\nhttps://www.techradar.com/news/amd-ryzen-7-5800x-leak-shows-a-powerhouse-gaming-cpu-that-could-embarrass-intels-core-i9-10900k\n\n\n\n2: AMD/NVIDIA battle. For a long time, NVIDIA has been the leader in the GPU battle. With the horrid launch of the 30xx series and recent leaks about AMD's GPU price to performance, its looking more and more like AMD will take market share from NVIDIA.\n      -Many retailers report not even getting 3000 series cards\n      -Huge driver issues making games unplayable\n      -Scalpers/bots taking all the available cards and reselling\n\n\n3: AMD is selling both XBOX and PS5 their Zen and RDNA chips. There is no other competition and production numbers are being met. \n\nhttps://www.pocket-lint.com/laptops/news/playstation/153151-amd-chips-xbox-series-x-playstation-5-ps5-schedule\n\n\n4. Lisa Su (AMD CEO). This summary below linked by u/Souskei about how she revived AMD is why I personally have so much faith in the company. \n\n\nhttps://medium.com/@jyjayy94/dr-lisa-su-the-living-legend-of-amd-7e0173d3a4a4\n\n\n\n**IMPORTANT DATES**\n\nAMD ZEN 3 reveal October 8th\n\nAMD GPU reveal October 28th\n\nAMD earnings announcement November 3rd (expected $.31 compared to $.14 for last year same quarter)\n\n\n\n\nhttps://www.tomshardware.com/news/amd-announces-keynote-dates-for-zen-3-and-big-navi\n\n\nThe next month is one of the most important months AMD has had in years. I am fully expecting them to crush it and finally be on Intel/Nvidia's level after years of playing catch up. \n\n*We don't need to bring up previous AMD driver issues* \n\n\n**My recommendations for options**\n\nFull disclaimer. I am in for 20 Nov 90C. Now let's look at Bid/ask spreads, volume, and the greeks below.\n\n\nI will only look at option chains expiring after November due to all the announcements in October. \n\n**6 Nov** is not worth it for reasons below.\n   - the average bid/ask spread is 40 cents for OTM/ITM calls. Personally I usually buy close ITM calls for the delta/theta movement as it is safer. \n   -Theta for closer OTM calls are already at .11\n   -Delta is hovering at about .5 which is okay, but preferably since its a month away, we would want it a little more. No doubt it will move up as AMD increases. But so will Theta for an option expiring a week after the announcements.\n\n\n**20 Nov**\n    -My position of choice due to much smaller bid/ask because I'm not a fan of losing money to MM's. \n    - Theta of .6/.7 right now which buys us more time. \n    -Since I plan on selling the options during early November, I still have adequate time to not get wrecked by theta and let delta move in my favor. \n\n\n**15 Jan 21**\n\n    - Another recommendation of mine. Earnings will be about to be fully reported. VOL will be high and so will the expectations. The play is up to you here. But i recommend anything over $95 at minimum.",
        "subreddit": "wallstreetbets",
        "title": "If you aren't in for AMD, you're missing out on free money",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j2q2wp/if_you_arent_in_for_amd_youre_missing_out_on_free/",
        "created": 1601514123.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1599567031,
        "id": "iosebr",
        "num_comments": 279,
        "num_crossposts": 0,
        "selftext": "If your question is \"I have $10,000, what do I do?\" or other \"advice for my personal situation\" questions. If you are going to ask how to invest you should include relevant information, such as the following:\n\n* How old are you?\n* Are you employed/making income? How much?\n* What are your objectives with this money? (buy a house? Retirement savings?)\n* What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know its 100% safe?)\n* What are you current holdings? (Do you already have exposure to specific funds and sectors?)\n* Any other assets? House paid off? Cars? Expensive significant other?\n* What is your time horizon? Do you need this money next month? Next 20yrs?\n* Any big debts?\n* Any other relevant financial information will be useful to give you a proper answer.\n\nPlease consider consulting our FAQ first - https://www.reddit.com/r/investing/wiki/faq \n\nBe aware that these answers are just opinions of Redditors and should be used as a starting point for your research. You should strongly consider seeing a registered financial rep before making any financial decisions!",
        "subreddit": "investing",
        "title": "Daily Advice Thread - All basic help or advice questions must be posted here.",
        "url": "https://www.reddit.com/r/investing/comments/iosebr/daily_advice_thread_all_basic_help_or_advice/",
        "created": 1599595831.0
    },
    {
        "author": "UnusualW_Mod",
        "created_utc": 1598978369,
        "id": "iknpp2",
        "num_comments": 277,
        "num_crossposts": 0,
        "selftext": "$ZM recently went from $1.60 ask to $80 per contract. For every 160 dollars, you got 8000 back; [or in short, 5246%](https://twitter.com/unusual_whales/status/1300834093425291265).\n\nWhy? Recent earnings on Monday showed that the revenue quadrupled from last year, with the stock itself [surging nearly 400%](https://ca.finance.yahoo.com/news/zoom-stock-has-surged-nearly-400-is-it-time-to-buy-hold-or-run-away-161839582.html).\n\nJust today, it’s up 40%, with no sign of stopping.\n\nWhat are your thoughts on it?",
        "subreddit": "options",
        "title": "ZM 5246% up",
        "url": "https://www.reddit.com/r/options/comments/iknpp2/zm_5246_up/",
        "created": 1599007169.0
    },
    {
        "author": "PalmTrees2284",
        "created_utc": 1601342986,
        "id": "j1pju7",
        "num_comments": 276,
        "num_crossposts": 0,
        "selftext": "Elon is tweeting to us:\n\n“We will probably IPO Starlink, but only several years in the future when revenue growth is smooth &amp; predictable. Public market does *not* like erratic cash flow haha. I’m a huge fan of small retail investors. Will make sure they get top priority. You can hold me to it.”\n\nTake my money...and take me to Mars 🚀🪐🛸",
        "subreddit": "wallstreetbets",
        "title": "Elon plans IPO for SpaceX’s Starlink",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j1pju7/elon_plans_ipo_for_spacexs_starlink/",
        "created": 1601371786.0
    },
    {
        "author": "el_diego",
        "created_utc": 1599597901,
        "id": "ip1sgx",
        "num_comments": 272,
        "num_crossposts": 0,
        "selftext": "Apple Inc. countersued Epic Games Inc. on Tuesday, claiming the maker of “Fortnite” breached a contract when it introduced a new in-app payment system within the popular videogame. \n\nThe iPhone maker ￼ asked U.S. District Judge Yvonne Gonzalez Rogers for punitive damages and to block Epic from continuing what it calls unfair business practices, in the escalating skirmish between the two companies. Late Friday, Epic sought an injunction to force Apple to put “Fortnite” back on the App Store, disclosing that roughly a third of “Fortnite” players access it through the App Store. \n\nhttps://on.mktw.net/3hbSDRR",
        "subreddit": "stocks",
        "title": "Apple countersues Epic Games for breach of contract",
        "url": "https://www.reddit.com/r/stocks/comments/ip1sgx/apple_countersues_epic_games_for_breach_of/",
        "created": 1599626701.0
    },
    {
        "author": "Jake_Surf",
        "created_utc": 1600480309,
        "id": "ivjg8s",
        "num_comments": 267,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "The last TikTok I’m watching before Donnie takes it away from me.",
        "url": "https://v.redd.it/5u5vhwq4g0o51",
        "created": 1600509109.0
    },
    {
        "author": "i-only-buy-leaps",
        "created_utc": 1600370138,
        "id": "iuqa41",
        "num_comments": 266,
        "num_crossposts": 0,
        "selftext": "I’ve made and lost a few hundred thousand dollars as part of this motley crew of idiots over the last year.\n\nI’ve got some gain posts where the ass was fat, and some loss porn posts where the ass was even fatter.\n\nBeing part of this community was great but also the absolute worst for my professional productivity and mental health.\nConstantly checking tickers for no good reason, trying to plan and strategize and divine what the fuck would happen, only to have paper hands and exit a DKNG position a month ago that would have been worth like $200-400k in gains today.\n\nI’ll say it again: *Being parT Of THiS COMmUnItY WaS GrEAT BuT aLSO tHe aBsOlUtE woRsT foR My pRoFeSsIonaL AnD prOfEsSiONal proDuCTIVItY anD MeNtAl hEaLtH.*\n\nI’m going back to boring theta gang shit to grind my way up $1-2k/week at a time, waiting for post election to buy some leaps, and I’ll enjoy the money I make along the way, rather than just adding to my hoard like Smaug, taking bigger and bigger risks.\n\nPeace out, fuck faces, you’re all bastards.\n\nBan if you think that’s the right thing, IDGAF.",
        "subreddit": "wallstreetbets",
        "title": "Get fucked. I’m out. 📈📉🧸🐂🐌",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iuqa41/get_fucked_im_out/",
        "created": 1600398938.0
    },
    {
        "author": "radarbot",
        "created_utc": 1599573239,
        "id": "iotyo6",
        "num_comments": 263,
        "num_crossposts": 0,
        "selftext": "Every week for the past 8 weeks, I've seen non-stop posts about how people are having great FOMO on TSLA. How they wish they had gotten in at $1000, $1300, $1500, $1750, $2000.\n\nEveryone asking about best price to get in, whether it will go higher, etc.\n\nWell, now TSLA is down almost 40% from its ATH post-split. Pre-split it was at $2200. Then there was a 5:1 split, which drove the price to $440, at which point it rocketed up to $500 (or $3000 pre-split).\n\nNow TSLA has cratered all the way to $340 (or $1700 pre-split). Its back at the price point it was at right after the split was announced. Its still high for some people here, but its trading at a discount from its ATH of $3000.\n\nTo all those TSLA FOMO-er's, its time to step up to their conviction. Do you believe in TSLA as the \"company of the future\" that has a valuation potential that can't be captured (ie. ARKK's perspective, and hence their $7000 pre-split price target potential).\n\nAdded fun: AMD, BA, MSFT, AAPL are all hammered right now. Again, these are all stocks that I've seen people have incredible FOMO about missing the August run up. If you genuinely believe these stocks have a future, and are thinking long term (ie. over 1 year holdings), these price points are good entries for a DCA strategy. Basically, all these stocks gave up ALL their August gains, which means if you missed the boat at the end of July, nows the time to get back in because the train came back to the station.\n\nIf you believe the valuations of these stocks are still too high, then feel free to disregard this entire post.",
        "subreddit": "stocks",
        "title": "All those TSLA FOMO's out there, it may be the time to get in",
        "url": "https://www.reddit.com/r/stocks/comments/iotyo6/all_those_tsla_fomos_out_there_it_may_be_the_time/",
        "created": 1599602039.0
    },
    {
        "author": "fickdichdock",
        "created_utc": 1599323719,
        "id": "in463n",
        "num_comments": 259,
        "num_crossposts": 0,
        "selftext": "Our devine overlords in Germany decided that you can't deduct your losses against your gains anymore. Or well only up to 10k within a year. Yes you read that right. You can lose money and still owe taxes. I expect some DP loss porn in 2022. You made 800k from your 10k through stupid trades and lost it all within the same year? You're in for a rude awakening after 2020 in Germany.\n\nThis retarded law means that your taxes trading derivatives can easily be multiple times higher than: your gains, your portfolio, your net worth. All possible with the buying power of a typical 4 digit account. Guaranteed financial disaster with the following single trade:\n\nBuy 100 AMZN 3010c AUG21, sell 100 AMZN  3000c AUG21 in one transaction. In other words, its an ITM bear call spread. Margin required to open this: probably below 10k. You tax bill if AMZN will trade below 3000 in August 2021: 1.8 million. \\~70.9k gain per lot on one side and a loss of \\~70k on the other derivative. Under  normal circumstances this means a gain of max 1k per contract and it depends on how much premium you got initially. Not with this new clever tax law, because you also \"gained\" money here!\n\nIts even more absurd if AMZN trades at like 8000 in August. Now  normally, you would have lost all the money on your bear call spread,  but now you also get to pay taxes on a gain of 5000\\*100\\*100 = 50 million,  too. Genius.\n\nIf you're an active trader, you can easily do worse than in this example. It's basically outlawing derivatives, \"because they are bad, mkay\". Because its going to be an absolute mine field after 2020 if you are German.\n\nGerman article (you can use Chrome to automatically translate this): [https://www.fundresearch.de/steuern/warum-die-neue-derivate-steuer-ab-januar-fatale-folgen-hat.php](https://www.fundresearch.de/steuern/warum-die-neue-derivate-steuer-ab-januar-fatale-folgen-hat.php)",
        "subreddit": "wallstreetbets",
        "title": "New draconian tax law in Germany for derivatives starts in 2021",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/in463n/new_draconian_tax_law_in_germany_for_derivatives/",
        "created": 1599352519.0
    },
    {
        "author": "companiesmarketcap",
        "created_utc": 1599163681,
        "id": "im13eb",
        "num_comments": 253,
        "num_crossposts": 0,
        "selftext": "Many tech company suffered large market cap wipe outs today, this includes:\n\nApple: -$179.92 B  \nMicrosoft: -$108.6 B  \nAmazon: -$81.88 B  \nAlphabet: -$58.61 B  \nTesla: -$37.62 B  \n[Source](https://companiesmarketcap.com/top-companies-by-market-cap-loss/)\n\n  \nIt even turns out that Apple's -$179.92 B drop is the largest single-day market cap drop in history.",
        "subreddit": "stocks",
        "title": "Today was one if not the largest market cap wipe outs in history",
        "url": "https://www.reddit.com/r/stocks/comments/im13eb/today_was_one_if_not_the_largest_market_cap_wipe/",
        "created": 1599192481.0
    },
    {
        "author": "bitbitbitbitcoin",
        "created_utc": 1600528396,
        "id": "ivub7b",
        "num_comments": 252,
        "num_crossposts": 0,
        "selftext": "I am not seeing any post discussing the current market pullback. We peaked at SPY 357 and now at 331.  We are approaching correction territory and we crossed the 50 day moving average. \n\nThe way I see it, we could easily test the 200 day moving average around 309, then the 300 wall, and quite possibly March lows. \n\nThoughts?",
        "subreddit": "investing",
        "title": "Is the current market pullback just a correction or are we headed toward SPY 300 and lower?",
        "url": "https://www.reddit.com/r/investing/comments/ivub7b/is_the_current_market_pullback_just_a_correction/",
        "created": 1600557196.0
    },
    {
        "author": "htotheizzostocks",
        "created_utc": 1600383659,
        "id": "iuug8l",
        "num_comments": 252,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\nLooks like I'm closing up shop soon fellas, I don't have much left to lose so if anyone has a play, any play, I'll do it. I just don't care anymore, like, the reason I didn't sell anything when I had so much profit is cause I was so greedy. The reason I was so greedy is because money means absolutely nothing when you have nothing to spend it on and nothing makes you happy. Haha, just kidding, kinda lol. Haha\n\n  \nAnyways guys, I need a good options play. I've attached the positions I have open below. As you can see, I am fucked. But I have $5000 in buying power left on the Casino and could use some advice to get back to at least 100,000 dollars, that's all I'm asking. A little 10x play, you know? For your boy.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/36hlnhqlgsn51.png?width=257&amp;format=png&amp;auto=webp&amp;s=3cc71302eef2a28d344ddcf785e478f82914f2dd\n\nhttps://preview.redd.it/tub66sj0gsn51.png?width=698&amp;format=png&amp;auto=webp&amp;s=9bc96d9c2c6e83f5fddc369ef1def9de3af7f5ce",
        "subreddit": "wallstreetbets",
        "title": "Update: 146k-&gt;10k Loss Porn, I think I lost the game guys",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iuug8l/update_146k10k_loss_porn_i_think_i_lost_the_game/",
        "created": 1600412459.0
    },
    {
        "author": "ThePracticalInvestor",
        "created_utc": 1599966168,
        "id": "irqiz1",
        "num_comments": 247,
        "num_crossposts": 1,
        "selftext": "It seems that options expire at market close on Friday but this is not the case. Options can be exercised until 5:30 pm the Friday of expiration. That means most traders have an hour and a half Friday after close to exercise their option. The reason this is important is because an option seller might think he’s clear of any obligation once the market closes. He is thinking about how much ice cream he can buy with the premium he has received but little does he know it can be exercised much later. The short put he sold at $100 seems to be expired but some bad news after hours leads the stock to tumble from $105 to $90 and the person who bought the put exercised it. Now the Option Writer has to take responsibility for these shares and is assigned shares at $100 when the underlying is trading for $90 for a loss of $10 per share. Be careful and aware my friends.",
        "subreddit": "options",
        "title": "When do options expire? (Important)",
        "url": "https://www.reddit.com/r/options/comments/irqiz1/when_do_options_expire_important/",
        "created": 1599994968.0
    },
    {
        "author": "arch000",
        "created_utc": 1599996041,
        "id": "irwj1w",
        "num_comments": 245,
        "num_crossposts": 0,
        "selftext": "As much as I regret to say it I was an ignorant teenager who didn't care for school or my education as you can probably tell from my poor grammar but recently my ignorance caught up to me I've been wanting to invest into the market for years now but im holding back because I feel that I wont be successful at it because of my poor mathematical skills or so I think so basically my question is can a regular person with not alot of education find success in the market and what other skills should I know before I start to invest \n\n(All advice and answers are much appreciated)",
        "subreddit": "StockMarket",
        "title": "Uneducated investor?",
        "url": "https://www.reddit.com/r/StockMarket/comments/irwj1w/uneducated_investor/",
        "created": 1600024841.0
    },
    {
        "author": "earman1234",
        "created_utc": 1600544636,
        "id": "ivzd8z",
        "num_comments": 244,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "YOU HEARD IT HERE FOLKS STRAIGHT FROM THE SOURCE ITSELF",
        "url": "https://i.redd.it/hnd380r3p5o51.jpg",
        "created": 1600573436.0
    },
    {
        "author": "FloydMCD",
        "created_utc": 1601082015,
        "id": "izw2gt",
        "num_comments": 241,
        "num_crossposts": 0,
        "selftext": "Shortsellers are going after our favorite stocks to profit therefore we should despise them right? But are they all really bad? \n\nDon’t just read articles and blog posts that confirm your view about a company. ***Right  now a lot of $TSLA &amp; $NKLA shareholders are mad about shortsellers  going after their stock but in fact you should embrace it.***\n\nShortsellers do research that you could ***never do on your own***.  In fact I would love it if someone would give me a 50 page report on  everything thats wrong with any of my holdings. I know whats right about  all the companies I own. What I want to know are the flaws, the  accounting issues ( if there are any ) etc.\n\nWith Luckin Coffee Muddy Waters Research bought thousands of cups of  coffee from different branches and kept an eye on the customers. Thats  invaluable research and in the end they were right that the numbers  don’t match up. \n\nThey probably saved a lot of Luckin Coffee Shareholders from bigger  losses ( those who read the report). And of course short sellers should  get compensated for this work. There have to be incentives to do this  kind of work. Else nobody would do it. Don’t count on auditors which are  incentivized to look the other way and keep a paying client.When you’re  an analyst you can just say you think revenue will go up but you don’t  need to back it up. \n\nThats it. But when you accuse someone of fraud then you better have a  lot of evidence to support this view. Short sellers face potential  losses &amp; lawsuit. If they are wrong they lose a lot. Thats why they  work hard and only release reports when they have enough to back up  their claim. Also what do Companies like Nikola have to worry about ? If  everything is fine then the Hindenburg report will turn out false and  they continue to enjoy a rising share price. **But what if the report is right?**\n\nIf you are a Nikola shareholder then you should pay attention to it.  Read it and work this into your thesis for owning the stock. Is it worth  the risk? Maybe limit your exposure.But don’t ridicule the people that  release those reports. There is a lot of hard work &amp; money behind  it.\n\n***Short sellers don’t do this for the fun of it.***  And if they are right they should be compensated for their work. I  would actually say that many short sellers work much harder on research  than a long analyst. After all they have to be right to make money. If  they’re wrong they won’t be able to enjoy market returns. They would  literally get wiped out. \n\n&amp;#x200B;\n\nsource: [https://welovevalue.com/short-sellers-are-good-for-the-market/](https://welovevalue.com/short-sellers-are-good-for-the-market/)",
        "subreddit": "investing",
        "title": "Short sellers are GOOD for the Market",
        "url": "https://www.reddit.com/r/investing/comments/izw2gt/short_sellers_are_good_for_the_market/",
        "created": 1601110815.0
    },
    {
        "author": "dontcareitsonlyreddi",
        "created_utc": 1599754581,
        "id": "iq6gma",
        "num_comments": 238,
        "num_crossposts": 0,
        "selftext": "I was looking at the their posts, and honestly it doesn't seem very reliable.  \n\nI compared last weeks stock to their predictions and activity and it was like 87% off. \n\nit doesn't seem very helpful, but I was looking at the free information",
        "subreddit": "options",
        "title": "Has anyone use the Unusual whales app.",
        "url": "https://www.reddit.com/r/options/comments/iq6gma/has_anyone_use_the_unusual_whales_app/",
        "created": 1599783381.0
    },
    {
        "author": "Zilllnaijaboy99",
        "created_utc": 1599443745,
        "id": "inyom9",
        "num_comments": 237,
        "num_crossposts": 0,
        "selftext": " \n\n[SoftBank Group Corp.](https://www.bloomberg.com/quote/9984:JP) shares tumbled in Tokyo trading after reports that the Japanese conglomerate made substantial bets on equity derivatives amid the surge in technology stocks.\n\nSoftBank shares dropped as much as 5.4%, the most on an intraday basis since April. The stock had gained 33% this year before Monday.\n\nThe Financial Times, Wall Street Journal and [Zero Hedge](https://www.bloomberg.com/news/terminal/QG8ZJIMB2SJO) reported that SoftBank was making massive bets on technology stocks using equity derivatives. The FT labeled SoftBank the “Nasdaq whale” that “stoked the fevered rally in big tech stocks,” though it didn’t include details of any trading. The FT later reported that SoftBank is sitting on trading gains of about $4 billion after founder Masayoshi Son’s bets on equity derivatives, citing people with direct knowledge of the matter.\n\n The Japanese conglomerate [said in August](https://www.bloomberg.com/news/articles/2020-08-11/softbank-returns-to-profit-after-record-losses-on-startup-bets) that it was starting a new unit to trade public securities, pushing beyond its traditional base in telecommunications and private startup investments. Bloomberg [reported](https://www.bloomberg.com/news/articles/2020-08-11/softbank-is-said-to-target-over-10-billion-in-public-investing) in August that SoftBank was targeting investments of more than $10 billion, perhaps tens of billions, and would use financing structures that would allow the company to avoid showing up in public disclosures of shareholding. \n\n \n\nThe Japanese company’s derivatives strategy has been built over the past few months, the FT cited the people as saying, adding that SoftBank has spent about $4 billion on options premiums focused on tech stocks over that time. SoftBank now has large but unrealized profits, and the trades have been deeply controversial even within SoftBank, the newspaper reported.\n\nSoftBank declined to comment.\n\nThe Wall Street Journal reported that SoftBank spent about $4 billion buying call options on stocks, while also selling call options at higher prices.\n\n \n\nThe idea that options buyers [could drive extreme rallies](https://www.bloomberg.com/news/articles/2020-09-04/option-traders-flex-market-muscles-with-focus-on-very-few-stocks) in technology stocks -- and push benchmark indexes to record highs -- would have drawn skepticism in the past. But as call volumes have exploded in stocks such as Apple Inc., Amazon.com Inc. and Tesla Inc., analysts are beginning to embrace the theory. They point out that traders could have outsize influence by concentrating their bets on a narrow set of high-profile names while other trading activity is reduced.\n\n“In a world where volumes are distorted by the frantic trading of algos, any real order flows may have surprisingly large impact on prices,” Peter Tchir, head of macro strategy at Academy Securities, wrote in a note Tuesday. “By trading options, they leverage their position.”\n\n[https://www.bloomberg.com/news/articles/2020-09-06/softbank-s-4-billion-trading-gains-on-u-s-stock-option-bet-ft](https://www.bloomberg.com/news/articles/2020-09-06/softbank-s-4-billion-trading-gains-on-u-s-stock-option-bet-ft)",
        "subreddit": "investing",
        "title": "SoftBank is sitting on trading gains of about $4 billion after founder Masayoshi Son’s bets on equity derivatives,",
        "url": "https://www.reddit.com/r/investing/comments/inyom9/softbank_is_sitting_on_trading_gains_of_about_4/",
        "created": 1599472545.0
    }
]