[
    {
        "author": "TriforceCaliban",
        "created_utc": 1583674481,
        "id": "ffclsf",
        "num_comments": 131,
        "num_crossposts": 0,
        "selftext": "\tAAPL\n\tACB\n\tADBE\n\tALLY\n\tAMD\n\tAMZN\n\tATVI\n\tBABA\n\tBABA\n\tMMM\n\tBAC\n\tBYND\n\tCCL\n\tCGC\n\tCMG\n\tCOST\n\tCRM\n\tCRON\n\tCZR\n\tDIS\n\tEA\n\tEBAY\n\tETSY\n\tFB\n\tGLD\n\tGOOGL\n\tGOOS\n\tHD\n\tINO\n\tINTC\n\tIQ\n\tJNJ\n\tJPM\n\tLULU\n\tLUV\n\tLVS\n\tM\n\tMCD\n\tMSFT\n\tMU\n\tNFLX\n\tNKE\n\tNVDA\n\tOPK\n\tPENN\n\tPINS\n\tPTON\n\tPYPL\n\tRCL\n\tROKU\n\tSBUX\n\tSHOP\n\tSNAP\n\tSPCE\n\tSQ\n\tSTMP\n\tTGT\n\tTLRY\n\tTLT\n\tTSLA\n\tTTD\n\tTWTR\n\tUBER\n\tULTA\n\tV\n\tWMT\n\tWYNN\n\nAny more to add?",
        "subreddit": "wallstreetbets",
        "title": "Current WSB Meme Stock List",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ffclsf/current_wsb_meme_stock_list/",
        "created": 1583703281.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1583588782,
        "id": "fevbei",
        "num_comments": 120,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/wallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week and month ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning March 9th, 2020.\n\n# **Wall Street braces for more market volatility as wild swings become the ‘new normal’ amid coronavirus  - [(Source)](https://www.cnbc.com/2020/03/06/investors-brace-for-more-volatility-as-wild-swings-become-new-normal.html)**\n*****\n&gt; The S&amp;P 500 has never behaved like this, but Wall Street strategists say get used to it.\n*****\n&gt; Investors just witnessed the equity benchmark swinging up or down 2% for four days straight in the face of the coronavirus panic.\n*****\n&gt; In the index’s history dating back to 1927, this is the first time the S&amp;P 500 had a week of alternating gains and losses of more than 2% from Monday through Thursday, according to Bespoke Investment Group. Daily swings like this over a two-week period were only seen at the peak of the financial crisis and in 2011 when U.S. sovereign debt got its first-ever downgrade, the firm said.\n*****\n&gt; “The message to all investors is that they should expect this volatility to continue. This should be considered the new normal going forward,” said Mike Loewengart, managing director of investment strategy at E-Trade.\n*****\n&gt; The Dow Jones Industrial Average jumped north of 1,000 points twice in the past week, only to erase the quadruple-digit gains in the subsequent sessions. The coronavirus outbreak kept investors on edge as global cases of the infections surpassed 100,000. It’s also spreading rapidly in the U.S. California has declared a state of emergency, while the number of cases in New York reached 33.\n*****\n&gt; “Uncertainty breeds greater market volatility,” Keith Lerner, SunTrust’s chief market strategist, said in a note. “Much is still unknown about how severe and widespread the coronavirus will become. From a market perspective, what we are seeing is uncomfortable but somewhat typical after shock periods.”\n*****\n&gt; # More stimulus?\n&gt; So far, the actions from global central banks and governments in response to the outbreak haven’t triggered a sustainable rebound.\n*****\n&gt; The Federal Reserve’s first emergency rate cut since the financial crisis did little to calm investor anxiety. President Donald Trump on Friday signed a sweeping spending bill with an$8.3 billion packageto aid prevention efforts to produce a vaccine for the deadly disease, but stocks extended their heavy rout that day.\n*****\n&gt; “The market is recognizing the global authorities are responding to this,” said Tom Essaye, founder of the Sevens Report. “If the market begins to worry they are not doing that sufficiently, then I think we are going to go down ugly. It is helping stocks hold up.”\n*****\n&gt; Essaye said any further stimulus from China and a decent-sized fiscal package from Germany would be positive to the market, but he doesn’t expect the moves to create a huge rebound.\n*****\n&gt; The fed funds future market is now pricing in the possibility of the U.S. central bank cutting by 75 basis points at its March 17-18 meeting.\n*****\n&gt; # Where is the bottom?\n&gt; Many on Wall Street expect the market to fall further before recovering as the health crisis unfolds.\n*****\n&gt; Binky Chadha, Deutsche Bank’s chief equity strategist, sees a bottom for the S&amp;P 500 in the second quarter after stocks falling as much as 20% from their recent peak.\n*****\n&gt; “The magnitude of the selloff in the S&amp;P 500 so far has further to go; and in terms of duration, just two weeks in, it is much too early to declare this episode as being done,” Chadha said in a note. “We do view the impacts on macro and earnings growth as being relatively short-lived and the market eventually looking through them.”\n*****\n&gt; Deutsche Bank maintained its year-end target of 3,250 for the S&amp;P 500, which would represent a 10% gain from here and a flat return for 2020.\n*****\n&gt; Strategists are also urging patience during this heightened volatility, cautioning against panic selling.\n*****\n&gt; “It is during times like these that investors need to maintain a longer-term perspective and stick to their investment process rather than making knee-jerk, binary decisions,” Brian Belski, chief investment strategist at BMO Capital Markets, said in a note.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/qgFoWQB.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/7eQW0Js.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/mFotkBJ.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/XSXVPJQ.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/deKt8eq.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/HYaxtrz.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/yygsO0C.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/oCNZNbl.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/4OOLYTY.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/y35bngj.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/E6twMcN.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/ttAWeD2.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/Dl7NlBA.png))**\n\n*****\n\n# A \"Run of the Mill\" Drawdown\n\n&gt; If you're like us, you've heard a lot of people reference the recent equity declines as a sign that the market is pricing in some sort of Armageddon in the US economy. While comments like that make for great soundbites, a little perspective is in order. Since the S&amp;P 500's high on February 19th, the S&amp;P 500 is down 12.8%. In the chart below, we show the S&amp;P 500's annual maximum drawdown by year going back to 1928. In the entire history of the index, the median maximum drawdown from a YTD high is 13.05%. In other words, this year's decline is actually less than normal. Perhaps due to the fact that we have only seen one larger-than-average drawdown in the last eight years is why this one feels so bad.\n\n&gt; The fact that the current decline has only been inline with the historical norm raises a number of questions. For example, if the market has already priced in the worst-case scenario, going out and adding some equity exposure would be a no brainer. However, if we're only in the midst of a 'normal' drawdown in the equity market as the coronavirus outbreak threatens to put the economy into a recession, one could argue that things for the stock market could get worse before they get better, especially when we know that the market can be prone to over-reaction in both directions. The fact is that nobody knows right now how this entire outbreak will play out. If it really is a black swan, the market definitely has further to fall and now would present a great opportunity to sell more equities. However, if it proves to be temporary and after a quarter or two resolves itself and the economy gets back on the path it was on at the start of the year, then the magnitude of the current decline is probably appropriate. As they say, that's what makes a market!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/030620-Drawdowns.png))**\n\n*****\n\n# Long-Term Treasuries Go Haywire\n\n&gt; Take a good luck at today's moves in long-term US Treasury yields, because chances are you won't see moves of this magnitude again soon. Let's start with the yield on the 30-year US Treasury. Today's decline of 29 basis points in the yield will go down as the largest one-day decline in the yield on the 30-year since 2009. For some perspective, there have only been 25 other days since 1977 where the yield saw a larger one day decline.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/030620-Change.png))**\n\n&gt; That doesn't even tell the whole story, though. As shown in the chart below, every other time the yield saw a sharper one-day decline, the actual yield of the 30-year was much higher, and in most other cases it was much, much higher.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/030620-Yield.png))**\n\n&gt; To show this another way, the percentage change in the yield on the 30-year has never been seen before, and it's not even close. Now, before the chart crime police come calling, we realize showing a percentage change of a percentage is not the most accurate representation, but we wanted to show this for illustrative purposes only.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/030620-Percent-change-in-yield.png))**\n\n&gt; Finally, with long-term interest rates plummetting we wanted to provide an update on the performance of the Austrian 100-year bond. That's now back at record highs, begging the question, why is the US not flooding the market with long-term debt?\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/030620-Austria.png))**\n\n*****\n\n# It Doesn't Get Much Worse Than This For Crude Oil\n\n&gt; Crude oil prices are down close to 10% today in what is shaping up to be the worst day for crude oil since late 2014. That's more than five years.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/030620-Crude-Oil-Daily-Changes.png))**\n\n&gt; Today's decline is pretty much a continuation of what has been a one-way trade for the commodity ever since the US drone strike on Iranian general Soleimani. The last time prices were this low was around Christmas 2018.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/030620-Crude-Oil.png))**\n\n&gt; With today's decline, crude oil is now off to its worst start to a year in a generation falling 32%. Since 1984, the only other year that was worse was 1986 when the year started out with a decline of 50% through March 6th. If you're looking for a bright spot, in 1986, prices rose 36% over the remainder of the year. The only other year where crude oil kicked off the year with a 30% decline was in 1991 after the first Iraq war. Over the remainder of that year, prices rose a more modest 5%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/030620-Crude-Oil-YTD-Starts.png))**\n\n*****\n\n# 10-Year Treasury Yield Breaks Below 1%\n\n&gt; Despite strong market gains on Wednesday, March 4, 2020, the on-the-run 10-year Treasury yield ended the day below 1% for the first time ever and has posted additional declines in real time, sitting at 0.92% intraday as this blog is being written. “The decline in yields has been remarkable,” said LPL Research Senior Market Strategist Ryan Detrick. “The 10-year Treasury yield has dipped below 1%, and today’s declines are likely to make the recent run lower the largest decline of the cycle.”\n\n&gt; As shown in LPL Research’s chart of the day, the current decline in the 10-year Treasury yield without a meaningful reversal (defined as at least 0.75%) is approaching the decline seen in 2011 and 2012 and would need about another two months to be the longest decline in length of time. At the same time, no prior decline has lasted forever and a pattern of declines and increases has been normal.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/03/Blog-chart-3.5.20.png?ssl=1))**\n\n&gt; What are some things that can push the 10-year Treasury yield lower?\n\n&gt; * A shrinking but still sizable yield advantage over other developed market sovereign debt\n&gt; * Added stock volatility if downside risks to economic growth from the coronavirus increase\n&gt; * A larger potential premium over shorter-term yields if the Federal Reserve aggressively cuts interest rates\n\n&gt; What are some things that can push the 10-year Treasury yield higher?\n\n&gt; * A second half economic rebound acting a catalyst for a Treasury sell-off\n&gt; * As yields move lower, investors may increasingly seek more attractive sources of income\n&gt; * Any dollar weakness could lead to some selling by international investors\n&gt; * Longer maturity Treasuries are looking like an increasingly crowded trade, potentially adding energy to any sell-off\n\n&gt; On balance, our view remains that the prospect of an economic rebound over the second half points to the potential for interest rates moving higher. At the same time, we still see some advantage in the potential diversification benefits of intermediate maturity high-quality bonds, especially during periods of market stress. We continue to recommend that suitable investors consider keeping a bond portfolio’s sensitivity to changes in interest rates below that of the benchmark Bloomberg Barclays U.S. Aggregate Bond Index by emphasizing short to intermediate maturity bonds, but do not believe it’s time to pile into very short maturities despite the 10-year Treasury yield sitting at historically low levels.\n\n*****\n\n# U.S. Jobs Growth Marches On\n\n&gt; While stock markets continue to be extremely volatile as they come to terms with how the coronavirus may affect global growth, the U.S. job market has remained remarkably robust. Continued U.S. jobs data resilience in the face of headwinds from the coronavirus outbreak may be a key factor in prolonging the expansion, given how important the strength of the U.S. consumer has been late into this expansion.\n\n&gt; The U.S. Department of Labor today reported that U.S. nonfarm payroll data had a strong showing of 273,000 jobs added in February, topping the expectation of every Bloomberg-surveyed economist, with an additional upward revision of 85,000 additional jobs for December 2019 and January 2020. This has brought the current unemployment rate back to its 50-year low of 3.5%. So far, it appears it’s too soon for any effects of the coronavirus to have been felt in the jobs numbers. (Note: The survey takes place in the middle of each month.)\n\n&gt; On Wednesday, ADP released its private payroll data (excluding government jobs), which increased by 183,000 in February, also handily beating market expectations. Most of these jobs were added in the service sector, with 44,000 added in the leisure and hospitality sector, and another 31,000 in trade/transportation/utilities. Both of these areas could be at risk of potential cutbacks if consumers start to avoid eating out or other leisure pursuits due to coronavirus fears.\n\n&gt; As shown in the LPL Chart of the Day, payrolls remain strong, and any effects of the virus outbreaks most likely would be felt in coming months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/03/US-Jobs-Data.png?ssl=1))**\n\n&gt; “February’s jobs report shows the 113th straight month that the U.S. jobs market has grown,” said LPL Financial Senior Market Strategist Ryan Detrick. “That’s an incredible run and highlights how the U.S. consumer has become key to extending the expansion, especially given setbacks to global growth from the coronavirus outbreak.”\n\n&gt; While there is bound to be some drag on future jobs data from the coronavirus-related slowdown, we would anticipate that the effects of this may be transitory. We believe economic fundamentals continue to suggest the possibility of a second-half-of-the–year economic rebound.\n\n*****\n\n# Down January &amp; Down February: S&amp;P 500 Posts Full-Year Gain Just 43.75% of Time\n\n&gt; The combination of a down January and a down February has come about 17 times, including this year, going back to 1950. Rest of the year and full-year performance has taken a rather sizable hit following the previous 16 occurrences. March through December S&amp;P 500 average performance drops to 2.32% compared to 7.69% in all years. Full-year performance is even worse with S&amp;P 500 average turning to a loss of 4.91% compared to an average gain of 9.14% in all years. All hope for 2020 is not lost as seven of the 16 past down January and down February years did go on to log gains over the last 10 months and full year while six enjoyed double-digit gains from March to December.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/781e034df22d242349ff3f8882653cec/b4f07d98317a2635-4d/s500x750/0ea61b1c01085e74593633995acba59fe8a96ce8.jpg))**\n\n*****\n\n# Take Caution After Emergency Rate Cut\n\n&gt; Today’s big rally was an encouraging sign that the markets are becoming more comfortable with the public health, monetary and political handling of the situation. But the history of these “emergency” or “surprise” rate cuts by the Fed between meetings suggest some caution remains in order.\n\n&gt; The table here shows that these surprise cuts between meetings have really only “worked” once in the past 20+ years. In 1998 when the Fed and the plunge protection team acted swiftly and in a coordinated manner to stave off the fallout from the financial crisis caused by the collapse of the Russian ruble and the highly leveraged Long Term Capital Management hedge fund markets responded well. This was not the case during the extended bear markets of 2001-2002 and 2007-2009.\n\n&gt; Bottom line: if this is a short-term impact like the 1998 financial crisis the market should recover sooner rather than later. But if the economic impact of coronavirus virus is prolonged, the market is more likely to languish.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/fd9ae8723eaf077f8baa56e384c8d8f7/e543b6eee32cdf93-81/s500x750/0f2b63108953c1e4cfb97da0a979d4ab3651cdeb.jpg))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$ADBE** \n&gt; * **$DKS**\n&gt; * **$AVGO** \n&gt; * **$THO** \n&gt; * **$ULTA** \n&gt; * **$WORK** \n&gt; * **$DG** \n&gt; * **$SFIX** \n&gt; * **$SOGO** \n&gt; * **$DOCU** \n&gt; * **$INO** \n&gt; * **$CLDR** \n&gt; * **$INSG** \n&gt; * **$SOHU** \n&gt; * **$BTAI** \n&gt; * **$ORCL** \n&gt; * **$HEAR** \n&gt; * **$NVAX** \n&gt; * **$ADDYY** \n&gt; * **$GPS** \n&gt; * **$AKBA** \n&gt; * **$PDD** \n&gt; * **$CYOU** \n&gt; * **$FNV** \n&gt; * **$MTNB** \n&gt; * **$NERV** \n&gt; * **$MTN** \n&gt; * **$BEST** \n&gt; * **$PRTY** \n&gt; * **$NINE** \n&gt; * **$AZUL** \n&gt; * **$UNFI** \n&gt; * **$PRPL** \n&gt; * **$VSLR** \n&gt; * **$KLZE** \n&gt; * **$ZUO** \n&gt; * **$DVAX** \n&gt; * **$EXPR** \n&gt; * **$VRA** \n&gt; * **$AXSM** \n&gt; * **$CDMO** \n&gt; * **$CASY**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/4OOLYTY.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/MY5URDI.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 3.9.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Fq1ixYG.png))\n\n\n&gt; # ***Monday 3.9.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/3QxCDMd.png))\n\n\n*****\n\n&gt; # ***Tuesday 3.10.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/kG5Cja7.png))\n\n&gt; # ***Tuesday 3.10.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/SWb2ADY.png))\n\n*****\n\n&gt; # ***Wednesday 3.11.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/SH8bsTn.png))\n\n&gt; # ***Wednesday 3.11.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/PH2Inly.png))\n\n*****\n\n&gt; # ***Thursday 3.12.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/RToRF8p.png))\n\n&gt; # ***Thursday 3.12.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/HECD2g3.png))\n\n*****\n\n&gt; # ***Friday 3.13.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/BvEJ9Vw.png))\n\n*****\n\n&gt; # ***Friday 3.13.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# Adobe Inc. $336.77\n&gt; **Adobe Inc. (ADBE)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, March 12, 2020. The consensus earnings estimate is $2.23 per share on revenue of $3.04 billion and the Earnings Whisper ® number is $2.29 per share. Investor sentiment going into the company's earnings release has 81% expecting an earnings beat The company's guidance was for earnings of approximately $2.23 per share. Consensus estimates are for year-over-year earnings growth of 29.65% with revenue increasing by 16.88%. Short interest has decreased by 38.4% since the company's last earnings release while the stock has drifted higher by 7.2% from its open following the earnings release to be 10.9% above its 200 day moving average of $303.70. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, February 24, 2020 there was some notable buying of 1,109 contracts of the $400.00 call expiring on Friday, March 20, 2020. Option traders are pricing in a 9.3% move on earnings and the stock has averaged a 4.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ADBE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DICK'S Sporting Goods, Inc. $34.98\n&gt; **DICK'S Sporting Goods, Inc. (DKS)** is confirmed to report earnings at approximately 7:30 AM ET on Tuesday, March 10, 2020. The consensus earnings estimate is $1.23 per share on revenue of $2.56 billion and the Earnings Whisper ® number is $1.28 per share. Investor sentiment going into the company's earnings release has 57% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 14.95% with revenue increasing by 2.73%. Short interest has decreased by 29.1% since the company's last earnings release while the stock has drifted lower by 20.3% from its open following the earnings release to be 12.0% below its 200 day moving average of $39.75. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, February 26, 2020 there was some notable buying of 848 contracts of the $39.00 put expiring on Friday, March 20, 2020. Option traders are pricing in a 14.4% move on earnings and the stock has averaged a 7.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DKS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Broadcom Limited $269.45\n&gt; **Broadcom Limited (AVGO)** is confirmed to report earnings at approximately 4:15 PM ET on Thursday, March 12, 2020. The consensus earnings estimate is $5.34 per share on revenue of $5.93 billion and the Earnings Whisper ® number is $5.45 per share. Investor sentiment going into the company's earnings release has 83% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 5.65% with revenue increasing by 2.44%. Short interest has decreased by 15.6% since the company's last earnings release while the stock has drifted lower by 15.3% from its open following the earnings release to be 7.7% below its 200 day moving average of $291.95. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, February 25, 2020 there was some notable buying of 1,197 contracts of the $260.00 put expiring on Friday, April 17, 2020. Option traders are pricing in a 11.1% move on earnings and the stock has averaged a 4.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AVGO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Thor Industries, Inc. $70.04\n&gt; **Thor Industries, Inc. (THO)** is confirmed to report earnings at approximately 6:45 AM ET on Monday, March 9, 2020. The consensus earnings estimate is $0.76 per share on revenue of $1.79 billion and the Earnings Whisper ® number is $0.84 per share. Investor sentiment going into the company's earnings release has 62% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 16.92% with revenue increasing by 38.70%. Short interest has decreased by 12.9% since the company's last earnings release while the stock has drifted higher by 5.4% from its open following the earnings release to be 12.0% above its 200 day moving average of $62.53. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 6.3% move on earnings and the stock has averaged a 8.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=THO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# ULTA Beauty $256.58\n&gt; **ULTA Beauty (ULTA)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, March 12, 2020. The consensus earnings estimate is $3.71 per share on revenue of $2.29 billion and the Earnings Whisper ® number is $3.75 per share. Investor sentiment going into the company's earnings release has 73% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 2.77% with revenue increasing by 7.78%. Short interest has increased by 8.7% since the company's last earnings release while the stock has drifted lower by 0.1% from its open following the earnings release to be 9.5% below its 200 day moving average of $283.43. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 15.3% move on earnings and the stock has averaged a 11.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ULTA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Slack Technologies, Inc. $26.42\n&gt; **Slack Technologies, Inc. (WORK)** is confirmed to report earnings at approximately 4:15 PM ET on Thursday, March 12, 2020. The consensus estimate is for a loss of $0.06 per share on revenue of $173.06 million and the Earnings Whisper ® number is ($0.04) per share. Investor sentiment going into the company's earnings release has 67% expecting an earnings beat The company's guidance was for a loss of $0.07 to $0.06 per share on revenue of $172.00 million to $174.00 million. Short interest has increased by 1.2% since the company's last earnings release while the stock has drifted higher by 19.0% from its open following the earnings release. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 4.3% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=WORK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Dollar General Corporation $158.38\n&gt; **Dollar General Corporation (DG)** is confirmed to report earnings at approximately 6:55 AM ET on Thursday, March 12, 2020. The consensus earnings estimate is $2.02 per share on revenue of $7.15 billion and the Earnings Whisper ® number is $2.05 per share. Investor sentiment going into the company's earnings release has 76% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 9.78% with revenue increasing by 7.52%. Short interest has increased by 16.2% since the company's last earnings release while the stock has drifted higher by 1.8% from its open following the earnings release to be 5.7% above its 200 day moving average of $149.88. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, February 28, 2020 there was some notable buying of 1,013 contracts of the $182.50 call expiring on Friday, March 20, 2020. Option traders are pricing in a 9.2% move on earnings and the stock has averaged a 5.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Stitch Fix, Inc. $22.78\n&gt; **Stitch Fix, Inc. (SFIX)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, March 9, 2020. The consensus earnings estimate is $0.06 per share on revenue of $452.96 million and the Earnings Whisper ® number is $0.09 per share. Investor sentiment going into the company's earnings release has 83% expecting an earnings beat The company's guidance was for revenue of $447.00 million to $455.00 million. Consensus estimates are for earnings to decline year-over-year by 50.00% with revenue increasing by 22.33%. Short interest has decreased by 4.6% since the company's last earnings release while the stock has drifted lower by 16.1% from its open following the earnings release to be 5.1% below its 200 day moving average of $24.01. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, February 19, 2020 there was some notable buying of 4,026 contracts of the $35.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 28.0% move on earnings and the stock has averaged a 15.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SFIX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Sogou Inc. $3.85\n&gt; **Sogou Inc. (SOGO)** is confirmed to report earnings at approximately 4:00 AM ET on Monday, March 9, 2020. The consensus earnings estimate is $0.09 per share on revenue of $303.08 million and the Earnings Whisper ® number is $0.10 per share. Investor sentiment going into the company's earnings release has 58% expecting an earnings beat The company's guidance was for revenue of $290.00 million to $310.00 million. Consensus estimates are for year-over-year earnings growth of 28.57% with revenue increasing by 1.78%. Short interest has increased by 6.6% since the company's last earnings release while the stock has drifted lower by 27.8% from its open following the earnings release to be 15.7% below its 200 day moving average of $4.57. Overall earnings estimates have been revised lower since the company's last earnings release. The stock has averaged a 3.8% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SOGO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DocuSign $84.02\n&gt; **DocuSign (DOCU)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, March 12, 2020. The consensus earnings estimate is $0.05 per share on revenue of $267.44 million and the Earnings Whisper ® number is $0.08 per share. Investor sentiment going into the company's earnings release has 81% expecting an earnings beat The company's guidance was for revenue of $263.00 million to $267.00 million. Consensus estimates are for year-over-year earnings growth of 600.00% with revenue increasing by 33.90%. Short interest has decreased by 37.7% since the company's last earnings release while the stock has drifted higher by 12.1% from its open following the earnings release to be 31.9% above its 200 day moving average of $63.71. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, March 4, 2020 there was some notable buying of 1,698 contracts of the $87.50 call expiring on Friday, March 20, 2020. Option traders are pricing in a 8.5% move on earnings and the stock has averaged a 10.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DOCU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/wallstreetbets.",
        "subreddit": "wallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning March 9th, 2020",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fevbei/wall_street_week_ahead_for_the_trading_week/",
        "created": 1583617582.0
    },
    {
        "author": "blazespinnaker",
        "created_utc": 1585261759,
        "id": "fpl5vz",
        "num_comments": 83,
        "num_crossposts": 0,
        "selftext": "Assume for a moment that recent technological advancements in cloud, AI, automation, etc has created a lot of excitement about the future and it wasn't just a bubble and rather good ol' exuberance, maybe a little excessive but not dangerously so.   Also, don't forget the Donald's  deregulation.   Yeah it's dangerous and stupid for the planet, but \\*\\*\\*\\* me, it really lets the capitalism roar loudly.    Tragedy of the commons can take awhile to bite you in the ass, especially at a global scale.\n\nOk, so the virus comes along and says \"look, any business that relies on human contact is totally \\*\\*\\*\\*ed.\"   So bang, market comes crashing down, because there are a lot of tickers in the S&amp;P that do rely on human contact.  You know, gaming / retail / restaurants -  MGM, WYNN, DRI, ULTA, HD, and yeah maybe even the health ones, but they have always been in a precarious spot - LNC, UHS, UNM.   DIS too got hit, but something tells me they will weather this.   They're more than just a bunch of resorts.\n\nBut those aside, really, if we assume the market was not really in a bubble before but merely a reflection of a society becoming wealthier due to tech and money was more free to do its thing.  Also, we see approval numbers come out that show Donald is actually pretty popular with his handling of the virus.\n\nWhy shouldn't the market take off like a rocket?  Yeah, those tickers above I think are still \\*\\*\\*\\*ed, but everything else should do OK.   Besides, they were stupid businesses anyway and did very little for over all social productivity.  They were just mostly expensive, time consuming entertainment and social waste- what does that really do anyways? \n\nWe may have to restructure our economy so that we're all more efficient in how we become entertained, but this actually may be a good thing, and reason to be optimistic about the future.\n\nI'm talking MSFT, AMZN, GOOG(L), AAPL, NFLX, INTC, T, VZ, NVDA, NFLX, ADBE,  etc.  XLK is a reasonable tracker here.\n\nI'm not saying buy calls, I'm just saying that the reports of death may have been exaggerated and Social distancing is not necessarily a bad thing.   Lots of very very productive people work and learn from home.\n\nAnd then, of course let's not forget - the money machines go BRRRR \\* 10\\^infinity.",
        "subreddit": "wallstreetbets",
        "title": "Assume for a moment the stock market was not in a bubble before",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fpl5vz/assume_for_a_moment_the_stock_market_was_not_in_a/",
        "created": 1585290559.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1583244877,
        "id": "fcv58s",
        "num_comments": 74,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/wallstreetbets sub! Welcome to Tuesday. Here is your stocks market news this AM-\n\n*****\n\n#[Today's Top Headlines for Tuesday, March 2nd, 2020](https://www.cnbc.com/2020/03/03/dow-to-drop-after-huge-monday-gain-as-g-7-statement-disappoints.html)\n\n*****\n\n&gt; * Dow futures, in another volatile overnight session, were pointing to losses at Tuesday’s open on Wall Street after a morning statement from G-7 central bankers and finance leaders contained no specific actions to combat the economic risks of the coronavirus. (CNBC)\n\n*****\n\n&gt; * Trump asks Fed for ‘big cut’ after Australia slashes rates on coronavirus impact (CNBC)\n\n*****\n\n&gt; * Hopes for action from the Fed and world central banks to mitigate the impact of the coronavirus sparked a powerful rally Monday. The Dow soared nearly 1,300 points or 5% after last week’s plunge.(CNBC)\n\n*****\n\n&gt; * 10-year Treasury yield moves higher after hitting a record low Monday (CNBC)\n\n*****\n\n&gt; * Investors will be looking for signs of how the coronavirus may be affecting retailers Target (TGT) and Kohl’s (KSS) when they hold conference calls after issuing earnings. Target reported mixed fourth-quarter results before the bell. Kohl’s beat on the top and bottom lines and hiked its dividend by 5%. Nordstrom leads Tuesday afternoon’s retail earnings reports. (CNBC)\n\n*****\n\n&gt; * Automakers are expected to report February sales throughout the day. There are no U.S. economic reports from the government this morning. Two regional central bank presidents, Chicago Fed President Charles Evans and Cleveland President Loretta Mester speak today.\n\n*****\n\n&gt; * The spread of the coronavirus in China is slowing while new cases in many other countries are accelerating. The vast majority of the more than 91,000 global cases and over 3,100 deaths are still in China. (CNBC)\n\n*****\n\n&gt; * Facebook, Google, Microsoft, Adobe pull out of more conferences as coronavirus spreads (CNBC)\n\n*****\n\n&gt; * Uber acknowledges coronavirus poses material risk to its business (CNBC)\n\n*****\n\n&gt; * Visa flags hit to Q2 revenue due to coronavirus outbreak (Reuters)\n\n*****\n\n&gt; * New cases in South Korea surged by 851 on Tuesday, bringing total infections there to more than 5,100, including 31 deaths. Italy’s cases rose to more than 2,000 with 52 deaths. (CNBC)\n\n*****\n\n&gt; * Pope tests negative for coronavirus, Italy report says (Reuters)\n\n*****\n\n&gt; * The U.S. has at least 91 coronavirus cases with at least six deaths. On Capitol Hill, aides said negotiations were nearing completion on an emergency funding bill to develop a vaccine and offer disaster loans to businesses hurt by the crisis. (AP)\n\n*****\n\n&gt; * How grocery stores are trying to prevent ‘panic buying’ as coronavirus causes stockpiling, emptying shelves (CNBC)\n\n*****\n\n&gt; * Vermont Sen. Bernie Sanders and former Vice President Joe Biden are vying for a victory in Texas, the second biggest delegate haul among the 14 states holding Democratic presidential nominating contests on Super Tuesday. (CNBC)\n\n*****\n\n&gt; * Super Tuesday polls are opening: Here are the states holding 2020 Democratic primaries and what’s at stake (CNBC)\n\n*****\n\n&gt; * Billionaire ex-New York City Mayor Mike Bloomberg, on ballots for the first Tuesday, and Massachusetts Sen. Elizabeth Warren could also win delegates as the primary field shrinks. (AP)\n\n*****\n\n&gt; * Tesla and SpaceX CEO Elon Musk jumped to the defense of fellow tech billionaire Jack Dorsey last night, as the latter faces pressure from an activist investor to step down as the CEO of Twitter. (CNBC)\n\n*****\n\n&gt; * JMP upgrades Tesla with highest price target on Wall Street, shares soar (CNBC)\n\n*****\n\n&gt; * Hundreds of angry Robinhood users took to Twitter and Reddit to blast the start-up after a technical outage kept users from trading during * Monday’s huge rally. Some threatened to leave the platform, while others called for a class-action lawsuit. (CNBC)\n\n*****\n\n&gt; * A bipartisan group of lawmakers unveiled legislation that would hold e-commerce companies like Amazon or eBay liable for counterfeit products sold on their platforms as U.S firms struggle to combat the sale of fake goods online. (CNBC)\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](http://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://i.imgur.com/nQpIMpX.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/QUBLcSG.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/30Sqf4m.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/zASmUSl.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/Y2ZRwLb.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n($TGT $PLUG $JD $ZM $COST $TLRY $AZO $KSS $SPLK $DLTR $VEEV $XRAY $SE $MRVL $FOLD $KR $OKTA $STNE $BLDP $BURL $CIEN $ALBO $MAXR $ANF $ITCI $FNKO $JWN $EPRT $VIPS $GTT $CORE $BNFT $LVGO $EVRG $ROST $EGRX $AOBC $TGLS $ATRS $HPE $NWN $WVE $WSC)\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/j7kavSk.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n($TGT $AZO $KSS $SE $ATRS $AUTL $IGT $AFI $INSW $TGTX $STIM $CHFS $MYE $SHLO $FOE $SCM $TDW $ITMR $NCSM $HCM)\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/t8b41yw.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/37PNS5r.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/n7eRcEA.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/Z7gWRZU.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/V13Lj1Q.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/c84OIKs.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #4!](https://i.imgur.com/KlF2tV6.png)**)\n\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS LINK #1!](https://i.imgur.com/jEbL2Ty.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS LINK #2!](https://i.imgur.com/wZOhonc.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #1!](https://i.imgur.com/fKr6MYB.png)**)\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #2!](https://i.imgur.com/xIcKC6O.png)**)\n\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS:\n\n* TGT\n* TLRY\n* TGTX\n* QGEN\n* GILD\n* KSS\n* SE\n* CVX\n* DAL\n* CRON\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2020/03/03/stocks-making-the-biggest-moves-premarket-target-kohls-uber-amd-tesla-more.html)**)\n\n*****\n\n&gt; **Target** — Target shares dipped about 0.8% in the premarket after the retailer reported disappointing revenue figures. The company posted revenue of $23.4 billion for the previous quarter. That’s slightly below a Refinitiv estimate of $23.5 billion. Same-store sales — a key metric for retailers — came in line with expectations.\n\n&gt; #**STOCK SYMBOL:** TGT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TGT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TGT)**)\n\n*****\n\n&gt; **Kohl’s** — Kohl’s rose 4% on the back of quarterly results that easily beat analysts’ expectations. The retailer reported earnings per share of $1.99 on $6.537 billion. Analysts polled by Refinitiv expected a profit of $1.88 per share on revenue of $6.523 billion. Same-store sales were flat while analysts expected a decline of 0.1%.\n\n&gt; #**STOCK SYMBOL:** KSS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=KSS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/KSS)**)\n\n*****\n\n&gt; **Uber** — The ride-sharing company acknowledged in a regulatory filing the coronavirus poses a material risk to its business in a regulatory filing. Uber mentioned the coronavirus five times in the filing, noting it could disrupt operations outside the U.S. Separately, an analyst at Needham put Uber in his “conviction list” as the coronavirus outbreak has “created a very attractive buying opportunity.”\n\n&gt; #**STOCK SYMBOL:** UBER\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=UBER&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/UBER)**)\n\n*****\n\n&gt; **AB InBev** — An analyst at Bank of America downgraded the beer-making giant to “neutral” from “buy,” citing “near term headwinds” such as lower earnings out of Brazil and the coronavirus outbreak.\n\n&gt; #**STOCK SYMBOL:** BUD\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BUD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BUD)**)\n\n*****\n\n&gt; **Advanced Micro Devices** — AMD was upgraded to “overweight” from “neutral” by an analyst at Piper Sandler who noted the broader market’s recent pullback “provides an attractive opportunity for long-term investors” who want to buy into the stock.\n\n&gt; #**STOCK SYMBOL:** AMD\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AMD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AMD)**)\n\n*****\n\n&gt; **Tesla** — The electric car maker was upgraded to “market outperform” from “market perform” by an analyst at JMP Securities. The analyst also issued a price target of $1,060 per share, which represents a 42.5% upside from Monday’s close of $743.62 per share. “Investors may find themselves with additional near-term opportunities to buy the stock as TSLA works through the first half of 2020 and the impact of COVID-19 becomes apparent,” the analyst said.\n\n&gt; #**STOCK SYMBOL:** TSLA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TSLA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TSLA)**)\n\n*****\n\n&gt; **Tilray** — Tilray tumbled more than 13% after the cannabis company reported quarterly revenue numbers that missed analysts’ expectations. The company posted sales of $46.9 million in the previous quarter. That’s below a Refinitiv estimate of $55.4 million. “We have faced industry challenges, but we remain committed to driving long-term value for our shareholders,” CEO Brendan Kennedy said in a statement.\n\n&gt; #**STOCK SYMBOL:** TLRY\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TLRY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TLRY)**)\n\n*****\n\n&gt; **Visa** — The credit card giant warned its second-quarter revenue growth could be about 2.5 to 3.5 percentage points below its previous guidance amid pressure from the coronavirus outbreak.\n\n&gt; #**STOCK SYMBOL:** V\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=V&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/V)**)\n\n*****\n\n&gt; **Microchip Technology** — The chipmaker’s stock dropped more than 1% after the company warned of flat sales for fiscal fourth quarter. “We see very weak demand in Asia, especially in China, driven by the COVID-19 fears, and customers returning to work at a slower pace than anticipated,” Microchip Technology said in a statement.\n\n&gt; #**STOCK SYMBOL:** MU\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=MU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/MU)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/wallstreetbets?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Tuesday, March 3rd, 2020! :)**",
        "subreddit": "wallstreetbets",
        "title": "Today's Stock Market News [Tuesday, March 3rd, 2020]",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fcv58s/todays_stock_market_news_tuesday_march_3rd_2020/",
        "created": 1583273677.0
    },
    {
        "author": "wiswiswiswis",
        "created_utc": 1585200671,
        "id": "fp5zha",
        "num_comments": 40,
        "num_crossposts": 0,
        "selftext": "I have been DCA’ing since feb 20th, putting more and more after every big drop. I’m 3.5k in so far, have like 6k more I’m willing to invest and not worry about for at least 2 years. I’ll list the stocks I have bought so far in order of what I have the most equity of:\n\nMicrosoft \nApple\nPENN National Gaming\nMasterCard\nJPM CHASE\nVisa\nBurlington Coat Factory\nDelta\nLulu lemon\nTesla\nPlanet fitness\nAllstate\nRoss \nLive Nation\nNVIDIA\nAramark\nShopify\nAmazon\nLowe’s\nHome Depot\nExxon Mobil\nRoku \nEldorado Resorts\nCarvana\nCinemark\nNike \nAfflack\nPepsico \nAlphabet\nRoyal Caribbean\nBerkshire Hathaway\nPhillips 66\nUnited \nHershey’s \nAdobe\nLam Research \nValero\nAlaskan Air\nCoca Cola\nAMD\nBoeing\nMcDonald’s\n... and plenty more but they are all $20 investments or less so I’m not about to list them all \n\nI also have some ETF’s I’m going to put more and more in.\n\nI’m also investing in some 3X Leveraged funds.. home builders, JNUG, and some other shit I don’t even know anything about",
        "subreddit": "investing",
        "title": "Am I buying the right stocks?",
        "url": "https://www.reddit.com/r/investing/comments/fp5zha/am_i_buying_the_right_stocks/",
        "created": 1585229471.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1583588542,
        "id": "fev9sm",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/StockMarket. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week and month ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning March 9th, 2020.\n\n# **Wall Street braces for more market volatility as wild swings become the ‘new normal’ amid coronavirus  - [(Source)](https://www.cnbc.com/2020/03/06/investors-brace-for-more-volatility-as-wild-swings-become-new-normal.html)**\n*****\n&gt; The S&amp;P 500 has never behaved like this, but Wall Street strategists say get used to it.\n*****\n&gt; Investors just witnessed the equity benchmark swinging up or down 2% for four days straight in the face of the coronavirus panic.\n*****\n&gt; In the index’s history dating back to 1927, this is the first time the S&amp;P 500 had a week of alternating gains and losses of more than 2% from Monday through Thursday, according to Bespoke Investment Group. Daily swings like this over a two-week period were only seen at the peak of the financial crisis and in 2011 when U.S. sovereign debt got its first-ever downgrade, the firm said.\n*****\n&gt; “The message to all investors is that they should expect this volatility to continue. This should be considered the new normal going forward,” said Mike Loewengart, managing director of investment strategy at E-Trade.\n*****\n&gt; The Dow Jones Industrial Average jumped north of 1,000 points twice in the past week, only to erase the quadruple-digit gains in the subsequent sessions. The coronavirus outbreak kept investors on edge as global cases of the infections surpassed 100,000. It’s also spreading rapidly in the U.S. California has declared a state of emergency, while the number of cases in New York reached 33.\n*****\n&gt; “Uncertainty breeds greater market volatility,” Keith Lerner, SunTrust’s chief market strategist, said in a note. “Much is still unknown about how severe and widespread the coronavirus will become. From a market perspective, what we are seeing is uncomfortable but somewhat typical after shock periods.”\n*****\n&gt; More stimulus?\n&gt; So far, the actions from global central banks and governments in response to the outbreak haven’t triggered a sustainable rebound.\n*****\n&gt; The Federal Reserve’s first emergency rate cut since the financial crisis did little to calm investor anxiety. President Donald Trump on Friday signed a sweeping spending bill with an$8.3 billion packageto aid prevention efforts to produce a vaccine for the deadly disease, but stocks extended their heavy rout that day.\n*****\n&gt; “The market is recognizing the global authorities are responding to this,” said Tom Essaye, founder of the Sevens Report. “If the market begins to worry they are not doing that sufficiently, then I think we are going to go down ugly. It is helping stocks hold up.”\n*****\n&gt; Essaye said any further stimulus from China and a decent-sized fiscal package from Germany would be positive to the market, but he doesn’t expect the moves to create a huge rebound.\n*****\n&gt; The fed funds future market is now pricing in the possibility of the U.S. central bank cutting by 75 basis points at its March 17-18 meeting.\n*****\n&gt; Where is the bottom?\n&gt; Many on Wall Street expect the market to fall further before recovering as the health crisis unfolds.\n*****\n&gt; Binky Chadha, Deutsche Bank’s chief equity strategist, sees a bottom for the S&amp;P 500 in the second quarter after stocks falling as much as 20% from their recent peak.\n*****\n&gt; “The magnitude of the selloff in the S&amp;P 500 so far has further to go; and in terms of duration, just two weeks in, it is much too early to declare this episode as being done,” Chadha said in a note. “We do view the impacts on macro and earnings growth as being relatively short-lived and the market eventually looking through them.”\n*****\n&gt; Deutsche Bank maintained its year-end target of 3,250 for the S&amp;P 500, which would represent a 10% gain from here and a flat return for 2020.\n*****\n&gt; Strategists are also urging patience during this heightened volatility, cautioning against panic selling.\n*****\n&gt; “It is during times like these that investors need to maintain a longer-term perspective and stick to their investment process rather than making knee-jerk, binary decisions,” Brian Belski, chief investment strategist at BMO Capital Markets, said in a note.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/qgFoWQB.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/7eQW0Js.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/mFotkBJ.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/XSXVPJQ.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/deKt8eq.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/HYaxtrz.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/yygsO0C.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/oCNZNbl.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/4OOLYTY.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/y35bngj.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/E6twMcN.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/ttAWeD2.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/Dl7NlBA.png))**\n\n*****\n\n# A \"Run of the Mill\" Drawdown\n\n&gt; If you're like us, you've heard a lot of people reference the recent equity declines as a sign that the market is pricing in some sort of Armageddon in the US economy. While comments like that make for great soundbites, a little perspective is in order. Since the S&amp;P 500's high on February 19th, the S&amp;P 500 is down 12.8%. In the chart below, we show the S&amp;P 500's annual maximum drawdown by year going back to 1928. In the entire history of the index, the median maximum drawdown from a YTD high is 13.05%. In other words, this year's decline is actually less than normal. Perhaps due to the fact that we have only seen one larger-than-average drawdown in the last eight years is why this one feels so bad.\n\n&gt; The fact that the current decline has only been inline with the historical norm raises a number of questions. For example, if the market has already priced in the worst-case scenario, going out and adding some equity exposure would be a no brainer. However, if we're only in the midst of a 'normal' drawdown in the equity market as the coronavirus outbreak threatens to put the economy into a recession, one could argue that things for the stock market could get worse before they get better, especially when we know that the market can be prone to over-reaction in both directions. The fact is that nobody knows right now how this entire outbreak will play out. If it really is a black swan, the market definitely has further to fall and now would present a great opportunity to sell more equities. However, if it proves to be temporary and after a quarter or two resolves itself and the economy gets back on the path it was on at the start of the year, then the magnitude of the current decline is probably appropriate. As they say, that's what makes a market!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/030620-Drawdowns.png))**\n\n*****\n\n# Long-Term Treasuries Go Haywire\n\n&gt; Take a good luck at today's moves in long-term US Treasury yields, because chances are you won't see moves of this magnitude again soon. Let's start with the yield on the 30-year US Treasury. Today's decline of 29 basis points in the yield will go down as the largest one-day decline in the yield on the 30-year since 2009. For some perspective, there have only been 25 other days since 1977 where the yield saw a larger one day decline.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/030620-Change.png))**\n\n&gt; That doesn't even tell the whole story, though. As shown in the chart below, every other time the yield saw a sharper one-day decline, the actual yield of the 30-year was much higher, and in most other cases it was much, much higher.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/030620-Yield.png))**\n\n&gt; To show this another way, the percentage change in the yield on the 30-year has never been seen before, and it's not even close. Now, before the chart crime police come calling, we realize showing a percentage change of a percentage is not the most accurate representation, but we wanted to show this for illustrative purposes only.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/030620-Percent-change-in-yield.png))**\n\n&gt; Finally, with long-term interest rates plummetting we wanted to provide an update on the performance of the Austrian 100-year bond. That's now back at record highs, begging the question, why is the US not flooding the market with long-term debt?\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/030620-Austria.png))**\n\n*****\n\n# It Doesn't Get Much Worse Than This For Crude Oil\n\n&gt; Crude oil prices are down close to 10% today in what is shaping up to be the worst day for crude oil since late 2014. That's more than five years.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/030620-Crude-Oil-Daily-Changes.png))**\n\n&gt; Today's decline is pretty much a continuation of what has been a one-way trade for the commodity ever since the US drone strike on Iranian general Soleimani. The last time prices were this low was around Christmas 2018.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/030620-Crude-Oil.png))**\n\n&gt; With today's decline, crude oil is now off to its worst start to a year in a generation falling 32%. Since 1984, the only other year that was worse was 1986 when the year started out with a decline of 50% through March 6th. If you're looking for a bright spot, in 1986, prices rose 36% over the remainder of the year. The only other year where crude oil kicked off the year with a 30% decline was in 1991 after the first Iraq war. Over the remainder of that year, prices rose a more modest 5%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/030620-Crude-Oil-YTD-Starts.png))**\n\n*****\n\n# 10-Year Treasury Yield Breaks Below 1%\n\n&gt; Despite strong market gains on Wednesday, March 4, 2020, the on-the-run 10-year Treasury yield ended the day below 1% for the first time ever and has posted additional declines in real time, sitting at 0.92% intraday as this blog is being written. “The decline in yields has been remarkable,” said LPL Research Senior Market Strategist Ryan Detrick. “The 10-year Treasury yield has dipped below 1%, and today’s declines are likely to make the recent run lower the largest decline of the cycle.”\n\n&gt; As shown in LPL Research’s chart of the day, the current decline in the 10-year Treasury yield without a meaningful reversal (defined as at least 0.75%) is approaching the decline seen in 2011 and 2012 and would need about another two months to be the longest decline in length of time. At the same time, no prior decline has lasted forever and a pattern of declines and increases has been normal.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/03/Blog-chart-3.5.20.png?ssl=1))**\n\n&gt; What are some things that can push the 10-year Treasury yield lower?\n\n&gt; * A shrinking but still sizable yield advantage over other developed market sovereign debt\n&gt; * Added stock volatility if downside risks to economic growth from the coronavirus increase\n&gt; * A larger potential premium over shorter-term yields if the Federal Reserve aggressively cuts interest rates\n\n&gt; What are some things that can push the 10-year Treasury yield higher?\n\n&gt; * A second half economic rebound acting a catalyst for a Treasury sell-off\n&gt; * As yields move lower, investors may increasingly seek more attractive sources of income\n&gt; * Any dollar weakness could lead to some selling by international investors\n&gt; * Longer maturity Treasuries are looking like an increasingly crowded trade, potentially adding energy to any sell-off\n\n&gt; On balance, our view remains that the prospect of an economic rebound over the second half points to the potential for interest rates moving higher. At the same time, we still see some advantage in the potential diversification benefits of intermediate maturity high-quality bonds, especially during periods of market stress. We continue to recommend that suitable investors consider keeping a bond portfolio’s sensitivity to changes in interest rates below that of the benchmark Bloomberg Barclays U.S. Aggregate Bond Index by emphasizing short to intermediate maturity bonds, but do not believe it’s time to pile into very short maturities despite the 10-year Treasury yield sitting at historically low levels.\n\n*****\n\n# U.S. Jobs Growth Marches On\n\n&gt; While stock markets continue to be extremely volatile as they come to terms with how the coronavirus may affect global growth, the U.S. job market has remained remarkably robust. Continued U.S. jobs data resilience in the face of headwinds from the coronavirus outbreak may be a key factor in prolonging the expansion, given how important the strength of the U.S. consumer has been late into this expansion.\n\n&gt; The U.S. Department of Labor today reported that U.S. nonfarm payroll data had a strong showing of 273,000 jobs added in February, topping the expectation of every Bloomberg-surveyed economist, with an additional upward revision of 85,000 additional jobs for December 2019 and January 2020. This has brought the current unemployment rate back to its 50-year low of 3.5%. So far, it appears it’s too soon for any effects of the coronavirus to have been felt in the jobs numbers. (Note: The survey takes place in the middle of each month.)\n\n&gt; On Wednesday, ADP released its private payroll data (excluding government jobs), which increased by 183,000 in February, also handily beating market expectations. Most of these jobs were added in the service sector, with 44,000 added in the leisure and hospitality sector, and another 31,000 in trade/transportation/utilities. Both of these areas could be at risk of potential cutbacks if consumers start to avoid eating out or other leisure pursuits due to coronavirus fears.\n\n&gt; As shown in the LPL Chart of the Day, payrolls remain strong, and any effects of the virus outbreaks most likely would be felt in coming months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/03/US-Jobs-Data.png?ssl=1))**\n\n&gt; “February’s jobs report shows the 113th straight month that the U.S. jobs market has grown,” said LPL Financial Senior Market Strategist Ryan Detrick. “That’s an incredible run and highlights how the U.S. consumer has become key to extending the expansion, especially given setbacks to global growth from the coronavirus outbreak.”\n\n&gt; While there is bound to be some drag on future jobs data from the coronavirus-related slowdown, we would anticipate that the effects of this may be transitory. We believe economic fundamentals continue to suggest the possibility of a second-half-of-the–year economic rebound.\n\n*****\n\n# Down January &amp; Down February: S&amp;P 500 Posts Full-Year Gain Just 43.75% of Time\n\n&gt; The combination of a down January and a down February has come about 17 times, including this year, going back to 1950. Rest of the year and full-year performance has taken a rather sizable hit following the previous 16 occurrences. March through December S&amp;P 500 average performance drops to 2.32% compared to 7.69% in all years. Full-year performance is even worse with S&amp;P 500 average turning to a loss of 4.91% compared to an average gain of 9.14% in all years. All hope for 2020 is not lost as seven of the 16 past down January and down February years did go on to log gains over the last 10 months and full year while six enjoyed double-digit gains from March to December.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/781e034df22d242349ff3f8882653cec/b4f07d98317a2635-4d/s500x750/0ea61b1c01085e74593633995acba59fe8a96ce8.jpg))**\n\n*****\n\n# Take Caution After Emergency Rate Cut\n\n&gt; Today’s big rally was an encouraging sign that the markets are becoming more comfortable with the public health, monetary and political handling of the situation. But the history of these “emergency” or “surprise” rate cuts by the Fed between meetings suggest some caution remains in order.\n\n&gt; The table here shows that these surprise cuts between meetings have really only “worked” once in the past 20+ years. In 1998 when the Fed and the plunge protection team acted swiftly and in a coordinated manner to stave off the fallout from the financial crisis caused by the collapse of the Russian ruble and the highly leveraged Long Term Capital Management hedge fund markets responded well. This was not the case during the extended bear markets of 2001-2002 and 2007-2009.\n\n&gt; Bottom line: if this is a short-term impact like the 1998 financial crisis the market should recover sooner rather than later. But if the economic impact of coronavirus virus is prolonged, the market is more likely to languish.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/fd9ae8723eaf077f8baa56e384c8d8f7/e543b6eee32cdf93-81/s500x750/0f2b63108953c1e4cfb97da0a979d4ab3651cdeb.jpg))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending March 6th, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=WonBP-yE0EI&amp;t=2s))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 3.8.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=Xpc7iemBajE))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$ADBE** \n&gt; * **$DKS**\n&gt; * **$AVGO** \n&gt; * **$THO** \n&gt; * **$ULTA** \n&gt; * **$WORK** \n&gt; * **$DG** \n&gt; * **$SFIX** \n&gt; * **$SOGO** \n&gt; * **$DOCU** \n&gt; * **$INO** \n&gt; * **$CLDR** \n&gt; * **$INSG** \n&gt; * **$SOHU** \n&gt; * **$BTAI** \n&gt; * **$ORCL** \n&gt; * **$HEAR** \n&gt; * **$NVAX** \n&gt; * **$ADDYY** \n&gt; * **$GPS** \n&gt; * **$AKBA** \n&gt; * **$PDD** \n&gt; * **$CYOU** \n&gt; * **$FNV** \n&gt; * **$MTNB** \n&gt; * **$NERV** \n&gt; * **$MTN** \n&gt; * **$BEST** \n&gt; * **$PRTY** \n&gt; * **$NINE** \n&gt; * **$AZUL** \n&gt; * **$UNFI** \n&gt; * **$PRPL** \n&gt; * **$VSLR** \n&gt; * **$KLZE** \n&gt; * **$ZUO** \n&gt; * **$DVAX** \n&gt; * **$EXPR** \n&gt; * **$VRA** \n&gt; * **$AXSM** \n&gt; * **$CDMO** \n&gt; * **$CASY**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/4OOLYTY.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/MY5URDI.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 3.9.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Fq1ixYG.png))\n\n\n&gt; # ***Monday 3.9.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/3QxCDMd.png))\n\n\n*****\n\n&gt; # ***Tuesday 3.10.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/kG5Cja7.png))\n\n&gt; # ***Tuesday 3.10.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/SWb2ADY.png))\n\n*****\n\n&gt; # ***Wednesday 3.11.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/SH8bsTn.png))\n\n&gt; # ***Wednesday 3.11.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/PH2Inly.png))\n\n*****\n\n&gt; # ***Thursday 3.12.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/RToRF8p.png))\n\n&gt; # ***Thursday 3.12.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/HECD2g3.png))\n\n*****\n\n&gt; # ***Friday 3.13.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/BvEJ9Vw.png))\n\n*****\n\n&gt; # ***Friday 3.13.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# Adobe Inc. $336.77\n&gt; **Adobe Inc. (ADBE)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, March 12, 2020. The consensus earnings estimate is $2.23 per share on revenue of $3.04 billion and the Earnings Whisper ® number is $2.29 per share. Investor sentiment going into the company's earnings release has 81% expecting an earnings beat The company's guidance was for earnings of approximately $2.23 per share. Consensus estimates are for year-over-year earnings growth of 29.65% with revenue increasing by 16.88%. Short interest has decreased by 38.4% since the company's last earnings release while the stock has drifted higher by 7.2% from its open following the earnings release to be 10.9% above its 200 day moving average of $303.70. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, February 24, 2020 there was some notable buying of 1,109 contracts of the $400.00 call expiring on Friday, March 20, 2020. Option traders are pricing in a 9.3% move on earnings and the stock has averaged a 4.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ADBE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DICK'S Sporting Goods, Inc. $34.98\n&gt; **DICK'S Sporting Goods, Inc. (DKS)** is confirmed to report earnings at approximately 7:30 AM ET on Tuesday, March 10, 2020. The consensus earnings estimate is $1.23 per share on revenue of $2.56 billion and the Earnings Whisper ® number is $1.28 per share. Investor sentiment going into the company's earnings release has 57% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 14.95% with revenue increasing by 2.73%. Short interest has decreased by 29.1% since the company's last earnings release while the stock has drifted lower by 20.3% from its open following the earnings release to be 12.0% below its 200 day moving average of $39.75. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, February 26, 2020 there was some notable buying of 848 contracts of the $39.00 put expiring on Friday, March 20, 2020. Option traders are pricing in a 14.4% move on earnings and the stock has averaged a 7.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DKS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Broadcom Limited $269.45\n&gt; **Broadcom Limited (AVGO)** is confirmed to report earnings at approximately 4:15 PM ET on Thursday, March 12, 2020. The consensus earnings estimate is $5.34 per share on revenue of $5.93 billion and the Earnings Whisper ® number is $5.45 per share. Investor sentiment going into the company's earnings release has 83% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 5.65% with revenue increasing by 2.44%. Short interest has decreased by 15.6% since the company's last earnings release while the stock has drifted lower by 15.3% from its open following the earnings release to be 7.7% below its 200 day moving average of $291.95. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, February 25, 2020 there was some notable buying of 1,197 contracts of the $260.00 put expiring on Friday, April 17, 2020. Option traders are pricing in a 11.1% move on earnings and the stock has averaged a 4.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AVGO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Thor Industries, Inc. $70.04\n&gt; **Thor Industries, Inc. (THO)** is confirmed to report earnings at approximately 6:45 AM ET on Monday, March 9, 2020. The consensus earnings estimate is $0.76 per share on revenue of $1.79 billion and the Earnings Whisper ® number is $0.84 per share. Investor sentiment going into the company's earnings release has 62% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 16.92% with revenue increasing by 38.70%. Short interest has decreased by 12.9% since the company's last earnings release while the stock has drifted higher by 5.4% from its open following the earnings release to be 12.0% above its 200 day moving average of $62.53. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 6.3% move on earnings and the stock has averaged a 8.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=THO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# ULTA Beauty $256.58\n&gt; **ULTA Beauty (ULTA)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, March 12, 2020. The consensus earnings estimate is $3.71 per share on revenue of $2.29 billion and the Earnings Whisper ® number is $3.75 per share. Investor sentiment going into the company's earnings release has 73% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 2.77% with revenue increasing by 7.78%. Short interest has increased by 8.7% since the company's last earnings release while the stock has drifted lower by 0.1% from its open following the earnings release to be 9.5% below its 200 day moving average of $283.43. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 15.3% move on earnings and the stock has averaged a 11.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ULTA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Slack Technologies, Inc. $26.42\n&gt; **Slack Technologies, Inc. (WORK)** is confirmed to report earnings at approximately 4:15 PM ET on Thursday, March 12, 2020. The consensus estimate is for a loss of $0.06 per share on revenue of $173.06 million and the Earnings Whisper ® number is ($0.04) per share. Investor sentiment going into the company's earnings release has 67% expecting an earnings beat The company's guidance was for a loss of $0.07 to $0.06 per share on revenue of $172.00 million to $174.00 million. Short interest has increased by 1.2% since the company's last earnings release while the stock has drifted higher by 19.0% from its open following the earnings release. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 4.3% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=WORK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Dollar General Corporation $158.38\n&gt; **Dollar General Corporation (DG)** is confirmed to report earnings at approximately 6:55 AM ET on Thursday, March 12, 2020. The consensus earnings estimate is $2.02 per share on revenue of $7.15 billion and the Earnings Whisper ® number is $2.05 per share. Investor sentiment going into the company's earnings release has 76% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 9.78% with revenue increasing by 7.52%. Short interest has increased by 16.2% since the company's last earnings release while the stock has drifted higher by 1.8% from its open following the earnings release to be 5.7% above its 200 day moving average of $149.88. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, February 28, 2020 there was some notable buying of 1,013 contracts of the $182.50 call expiring on Friday, March 20, 2020. Option traders are pricing in a 9.2% move on earnings and the stock has averaged a 5.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Stitch Fix, Inc. $22.78\n&gt; **Stitch Fix, Inc. (SFIX)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, March 9, 2020. The consensus earnings estimate is $0.06 per share on revenue of $452.96 million and the Earnings Whisper ® number is $0.09 per share. Investor sentiment going into the company's earnings release has 83% expecting an earnings beat The company's guidance was for revenue of $447.00 million to $455.00 million. Consensus estimates are for earnings to decline year-over-year by 50.00% with revenue increasing by 22.33%. Short interest has decreased by 4.6% since the company's last earnings release while the stock has drifted lower by 16.1% from its open following the earnings release to be 5.1% below its 200 day moving average of $24.01. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, February 19, 2020 there was some notable buying of 4,026 contracts of the $35.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 28.0% move on earnings and the stock has averaged a 15.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SFIX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Sogou Inc. $3.85\n&gt; **Sogou Inc. (SOGO)** is confirmed to report earnings at approximately 4:00 AM ET on Monday, March 9, 2020. The consensus earnings estimate is $0.09 per share on revenue of $303.08 million and the Earnings Whisper ® number is $0.10 per share. Investor sentiment going into the company's earnings release has 58% expecting an earnings beat The company's guidance was for revenue of $290.00 million to $310.00 million. Consensus estimates are for year-over-year earnings growth of 28.57% with revenue increasing by 1.78%. Short interest has increased by 6.6% since the company's last earnings release while the stock has drifted lower by 27.8% from its open following the earnings release to be 15.7% below its 200 day moving average of $4.57. Overall earnings estimates have been revised lower since the company's last earnings release. The stock has averaged a 3.8% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SOGO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DocuSign $84.02\n&gt; **DocuSign (DOCU)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, March 12, 2020. The consensus earnings estimate is $0.05 per share on revenue of $267.44 million and the Earnings Whisper ® number is $0.08 per share. Investor sentiment going into the company's earnings release has 81% expecting an earnings beat The company's guidance was for revenue of $263.00 million to $267.00 million. Consensus estimates are for year-over-year earnings growth of 600.00% with revenue increasing by 33.90%. Short interest has decreased by 37.7% since the company's last earnings release while the stock has drifted higher by 12.1% from its open following the earnings release to be 31.9% above its 200 day moving average of $63.71. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, March 4, 2020 there was some notable buying of 1,698 contracts of the $87.50 call expiring on Friday, March 20, 2020. Option traders are pricing in a 8.5% move on earnings and the stock has averaged a 10.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DOCU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/StockMarket.",
        "subreddit": "StockMarket",
        "title": "Wall Street Week Ahead for the trading week beginning March 9th, 2020",
        "url": "https://www.reddit.com/r/StockMarket/comments/fev9sm/wall_street_week_ahead_for_the_trading_week/",
        "created": 1583617342.0
    },
    {
        "author": "SeriousPuppet",
        "created_utc": 1583555222,
        "id": "feq2j6",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "I have some long term holdings. I've trimmed down a little and have some cash. But I'm wondering if, instead of selling more of my AMZN, AAPL, etc... if I short sold say a few tech stocks like ADBE, CRM, CRUS,  etc... if that would essentially act as a hedge for my longs with the reasoning that if my tech longs go down then most likely other tech stocks will as well and I'd make money by shorting them as I'm losing money on the longs. \n\n(I realize that I could buy puts as well, but I have never done that yet and am not familiar with that even though I did just get an options account. But I'm wondering if shorting can essentially accomplish a similar task as I don't know if I have the time to learn options.)",
        "subreddit": "stocks",
        "title": "Is shorting stocks a good way to hedge in this environment?",
        "url": "https://www.reddit.com/r/stocks/comments/feq2j6/is_shorting_stocks_a_good_way_to_hedge_in_this/",
        "created": 1583584022.0
    },
    {
        "author": "wiswiswiswis",
        "created_utc": 1585201000,
        "id": "fp620m",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "Am I buying the right stocks?\n\nI have been DCA’ing since feb 20th, putting more and more after every big drop. I’m 3.5k in so far, have like 6k more I’m willing to invest and not worry about for at least 2 years. I’ll list the stocks I have bought so far in order of what I have the most equity of:\n\nMicrosoft \nApple\nPENN National Gaming\nMasterCard\nJPM CHASE\nVisa\nBurlington Coat Factory\nDelta\nLulu lemon\nTesla\nPlanet fitness\nAllstate\nRoss \nLive Nation\nNVIDIA\nAramark\nShopify\nAmazon\nLowe’s\nHome Depot\nExxon Mobil\nRoku \nEldorado Resorts\nCarvana\nCinemark\nNike \nAfflack\nPepsico \nAlphabet\nRoyal Caribbean\nBerkshire Hathaway\nPhillips 66\nUnited \nHershey’s \nAdobe\nLam Research \nValero\nAlaskan Air\nCoca Cola\nAMD\nBoeing\nMcDonald’s\n... and plenty more but they are all $20 investments or less so I’m not about to list them all \n\nI also have some ETF’s I’m going to put more and more in.\n\nI’m also investing in some 3X Leveraged funds.. home builders, JNUG, and some other shit I don’t even know anything about",
        "subreddit": "stocks",
        "title": "Am I buying the right stocks in the right manner?",
        "url": "https://www.reddit.com/r/stocks/comments/fp620m/am_i_buying_the_right_stocks_in_the_right_manner/",
        "created": 1585229800.0
    },
    {
        "author": "JlNxTonic",
        "created_utc": 1583865840,
        "id": "fgipfi",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "China new cases are close to zero. You can say that you dont trust the numbers, but if you look at Twitter and other social networks, you see a lot of people from the most affected regions saying that things are slowly getting back to normal. South Korea also getting a lot better. New cases falling every day now.\n\nYes Italy is bad, yes cases are rising in Europe overall.\nYes the worst is yet to come for the US.\nBUT: We were down 20% from the highs just 3 weeks ago. Market has priced in a lot of economical damage.\nI mean look at cruises down 60%, airlines down 50%. Autos, Travel, Oil, Industrials all down 30-50%.\nYou really think that they will fall another 50% and that everybody will stop spending forever? \n\nNo. An incredible amount of bad news has been priced into these stocks. Ofc they will suffer, earnings will come way down. But guess what, thats why the stocks are now down 60%. Market knows this. No one will be suprised when they announce a 30% decline in revenue over the next quarters.\n\nAs for the rest of the market. Tech is holding up incredibly well. Look at Apple, Msft, Amazon, Netflix, Adobe.\nThey will see limited effects and they are massive growth machines. They will be back at all time highs later this year, no doubt!\n\nTldr: Buy your stocks now on discount. Market has priced in a lot, and China and South Korea are already getting better quickly. Give it another 30-60 days and we have the worst behind us in Europe and in the US aswell",
        "subreddit": "wallstreetbets",
        "title": "Now is the time to buy stocks!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fgipfi/now_is_the_time_to_buy_stocks/",
        "created": 1583894640.0
    },
    {
        "author": "ElectricOne55",
        "created_utc": 1584560316,
        "id": "fkvny7",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "Some stocks are really undervalued like Xerox, Big Lots, BJs restaurants, Aflac, brkb, crox, genworth financial, gnc, the gap, hanes brands, etc. Some of these stocks have p/es and prices under 5 which is rediculous. However, a lot of these weren't good names for instance the only really good stocks of the companies above are Brk and maybe aflac. However, with the market the way it is would it be better to buy companies that are almost at 0, or to still focus on good names that may still be slightly overvalued but have come down a lot. For example, Microsoft, Apple, Netflix, Lululemon, Adobe, cloud stocks etc. A lot of these still have rediculous P/E ratios and high prices compared to the stocks listed in the undervalued group, but even these stocks have come down greatly almost 40% or so in past month. So would investing in companies in the first group like Big Lots that were underperformers even before the coronavirus, but are now extremely cheap P.E. around 3 to 10, or would the second group of companies ex: Visa/Apple that had higher growth rates before coronavirus but have dropped to P.E.s that are around 20 to 40 be better? Also, what type of stocks are you all looking at investing in?",
        "subreddit": "investing",
        "title": "What stocks are you looking at now that the market is down big?",
        "url": "https://www.reddit.com/r/investing/comments/fkvny7/what_stocks_are_you_looking_at_now_that_the/",
        "created": 1584589116.0
    },
    {
        "author": "anon4secret",
        "created_utc": 1584077488,
        "id": "fhuqds",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "As the market drops lower and lower due to Covid-19, oil price wars and many other factors, some good stocks are going to be unfairly dragged down. These stocks will be less affected by the current situation and will be clear winners when it comes to picking stocks for investing (not yolo stocks).\n\nI personally understand tech and am therefore looking at MSFT, ADBE, NVDA, AMD, AMZN, GOOG, TWLO, CHGG, ROKU. I'm also getting to understand renewables and clean energy better and looking at some obvious tickets there. If nothing else, there's ICLN. Looking at DAL and JBLU for airlines which I think are generally good companies. I have been DCAing a bit in some of the above as the market drops though I should probably stop at this point looking at the general consensus that the market will drop much more. \n\nWhat companies are you guys holding cash for to jump into at 'the bottom'?",
        "subreddit": "stocks",
        "title": "What good stocks are you guys planning to buy at the bottom for investing?",
        "url": "https://www.reddit.com/r/stocks/comments/fhuqds/what_good_stocks_are_you_guys_planning_to_buy_at/",
        "created": 1584106288.0
    },
    {
        "author": "streetskaterln91",
        "created_utc": 1585362103,
        "id": "fqbfjn",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "These are the companies I've narrowed down to start investing in long-term after I feel the market start to turn back to the upside. I have a fair amount of experience with shorter term swing trading in the past few years, but want to take advantage of the drop and hold for however long it takes to get back to/above ATHs. Most of these companies I chose because of their strength in the past and leading up to the crash. I don't see any of them going under from this, even if it takes awhile to recover. Please feel free to share your thoughts and any info about the stocks that I may have overlooked. I plan to buy small amounts of maybe 7-10 of them depending how things go. Also feel free to share your own lists and ideas for when this all levels out.\n\nMA, V, ADBE, GOOG, AAPL, MSFT, ROST, ANSS, CHTR, TROW, WM, HD, AME, CABO, NKE, CLX, ARE\n\nI know retail might not be the best idea but NKE and ROST seem to hold up through hard times for whatever reason.",
        "subreddit": "StockMarket",
        "title": "Help me narrow/edit my watchlist",
        "url": "https://www.reddit.com/r/StockMarket/comments/fqbfjn/help_me_narrowedit_my_watchlist/",
        "created": 1585390903.0
    },
    {
        "author": "streetskaterln91",
        "created_utc": 1585344206,
        "id": "fq6435",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "These are the companies I've narrowed down to start investing in long-term after I feel the market start to turn back to the upside. I have a fair amount of experience with shorter term swing trading in the past few years, but want to take advantage of the drop and hold for however long it takes to get back to/above ATHs. Most of these companies I chose because of their strength in the past and leading up to the crash. I don't see any of them going under from this, even if it takes awhile to recover. Please feel free to share your thoughts and any info about the stocks that I may have overlooked. I plan to buy small amounts of maybe 7-10 of them depending how things go. Also feel free to share your own lists and ideas for when this all levels out.\n\nMA, V, ADBE, GOOG, AAPL, MSFT, ROST, ANSS, CHTR, TROW, WM, HD, AME, CABO, NKE, CLX, ARE\n\nI know retail might not be the best idea but NKE and ROST seem to hold up through hard times for whatever reason.",
        "subreddit": "investing",
        "title": "Help me narrow my watchlist",
        "url": "https://www.reddit.com/r/investing/comments/fq6435/help_me_narrow_my_watchlist/",
        "created": 1585373006.0
    },
    {
        "author": "myself09",
        "created_utc": 1584852018,
        "id": "fmu4qc",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "I am in my mid-20s and new to investing, below is my current portfolio which I am planning to hold **long-term**. I'd like to know what you think of it, and appreciate any feedback/comments. Thanks for the time.\n\n**Resources I use:** \n\n* Morningstar\n* YouTube\n* Reddit \n\n**Age of my portfolio:** 1 month.\n\n**Portfolio:**\n\n*ETFs*\n\n* **VTI**\n\n*stocks*\n\n**International stocks (2.67%)**\n\n* Alibaba Group Holding Ltd (**BABA**)\n* JD.com Inc (**JD**)\n\n**US Stocks (63.37%)**\n\n* Amazon.com Inc (**AMZN**) \n* Alphabet Inc (**GOOGL**)\n* Apple Inc (**AAPL**)\n* Microsoft Corp (**MSFT**)\n* Visa Inc (**V**)\n* Mastercard Inc (**MA**)\n* Advanced Micro Devices inc (**AMD**)\n* ServiceNow Inc (**NOW**)\n* Nvidia Corp (**NVDA**)\n* Tesla Inc (**TSLA**)\n* Adobe Inc (**ADBE**)\n* Costco Wholesale Corp (**COST**)\n* Thermo Fisher Scientific Inc (**TMO**)\n* Salesforce.com Inc (**CRM**)\n* McDonald's Corp (**MCD**)\n* Facebook Inc (**FB**)\n* Cigna Corp (**CI**)\n* Walmart Inc (**WMT**)\n* Boeing Co (**BA**)\n* Walt Disney Co (**DIS**)\n* Gilead Sciences Inc (**GILD**)\n* Square Inc (**SQ**)\n* Citigroup Inc (**C**)  \n \n\nAlthough the list is long, some of the stocks like TSLA, MCD, TMO, BA, FB, CI, WMT, MA, NOW are only **fractions** of a share. I plan to buy more fractions of those shares over a period.\n\nThe below mentioned stocks/ETFs are in my **watchlist**:\n\n* Vanguard S&amp;P 500 ETF (**VOO**)\n* Waste Management (**WM**) \n* PayPal Holdings Inc (**PYPL**)\n* 3M (**MMM**) \n* Berkshire Hathaway Inc (**BRK.B**) \n* Intuitive Surgical Inc (**ISRG**)\n* UnitedHealth Group (**UNH**)\n* CVS Health Corp. (**CVS**)\n* AT&amp;T (**T**)\n* The Trade Desk inc. (**TTD**)\n* Beyond Meat Inc. (**BYND**)\n* Intel Corp (**INTC**)\n* Bank of America (**BAC**)\n* Lockheed Martin Corp. (**LMT**)\n* Activision Blizzard (**ATVI**)\n\nThanks again.",
        "subreddit": "investing",
        "title": "Please rate my portfolio and watchlist.",
        "url": "https://www.reddit.com/r/investing/comments/fmu4qc/please_rate_my_portfolio_and_watchlist/",
        "created": 1584880818.0
    },
    {
        "author": "Tool03",
        "created_utc": 1585630904,
        "id": "fs6tfo",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "https://m.imgur.com/a/2d5ZilU\n\nI'm still new to stocks so forgive my ignorance but I noticed that at least Coke, Sprint, Amazon, and Google all have this strange dip (~3%) after hours all around the same time. Any idea what that is? Is this just how stocks move with far less volume?\n\nAlso found Verizon and  Adobe with the same deal.",
        "subreddit": "investing",
        "title": "Weird dip/blip after hours? Across a few companies",
        "url": "https://www.reddit.com/r/investing/comments/fs6tfo/weird_dipblip_after_hours_across_a_few_companies/",
        "created": 1585659704.0
    },
    {
        "author": "streetskaterln91",
        "created_utc": 1585340978,
        "id": "fq50iy",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "These are the companies over narrowed down to start investing in long-term after I feel the matter start to turn back to the upside. I have a fair amount of experience with shorter term swing trading in the past few years, but want to take advantage of the drop and hold for however long it tastes to get back to/above ATHs. Most of these companies I chose because of their strength in the past and leading up to the crash. I don't see any of them going under from this, they if it takes awhile to recover. Please feel free to share your thoughts and any info about the stocks that I may have overlooked. I plan to buy small amounts of maybe 7-10 of them depending how things go. Also feel free to share your own lists and ideas for when this all levels out.\n\nMA, V, ADBE, GOOG, AAPL, MSFT, ROST, ANSS, CHTR, TROW, WM, HD, AME, CABO, NKE, CLX, ARE\n\nI know retail might not be the best idea but NKE and ROST seem to hold up through hard times for whatever reason.",
        "subreddit": "stocks",
        "title": "Help me narrow my watchlist",
        "url": "https://www.reddit.com/r/stocks/comments/fq50iy/help_me_narrow_my_watchlist/",
        "created": 1585369778.0
    },
    {
        "author": "HFwizard",
        "created_utc": 1584700485,
        "id": "flsuvg",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "It's a great time to shop around for deals. Many companies are down 50-90%. Do you know any names that the market has been very wrong on? There are some interesting ones in Food, such as USFD and CHEF. Software/tech on the whole should be pretty insulated, names like HUBS, WIX, WORK, TWLO, AYX, ADBE, INTU, PLAN, ESTC, and more. In real estate, INVH, RP perhaps. Still like SPOT a lot. If you are betting this will pass over, UBER is interesting.",
        "subreddit": "investing",
        "title": "Top Buys In This Crisis",
        "url": "https://www.reddit.com/r/investing/comments/flsuvg/top_buys_in_this_crisis/",
        "created": 1584729285.0
    },
    {
        "author": "sarcastic_ergonomics",
        "created_utc": 1583683643,
        "id": "ffekqc",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "In light of Covid-19 (I'm sure you're getting sick of all these posts), there's 1 industry which I may or may not have made up that has gone uncovered. With the cancellations of major events like SXSW, Google I/O, Cisco Live, Adobe Summit, is there an opportunity to buy back into the market with companies that help the curation and coordination of events? Types of companies included are major event planners, entertainment companies, lighting vendors, companies that cater food + drinks etc. What companies exist on the NYSE in this industry, and how hard have they been hit by the breakout?",
        "subreddit": "investing",
        "title": "Investing in event-based companies",
        "url": "https://www.reddit.com/r/investing/comments/ffekqc/investing_in_eventbased_companies/",
        "created": 1583712443.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1583244628,
        "id": "fcv38s",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/StockMarket sub! Welcome to Tuesday. Here is your stocks market news this AM-\n\n*****\n\n#(**[CLICK HERE TO VIEW THE FULL SOURCE!](https://www.stockaholics.net/threads/todays-stock-market-news-tuesday-march-3rd-2020.9554/)**)\n\n#[Today's Top Headlines for Tuesday, March 2nd, 2020](https://www.cnbc.com/2020/03/03/dow-to-drop-after-huge-monday-gain-as-g-7-statement-disappoints.html)\n\n*****\n\n&gt; * Dow futures, in another volatile overnight session, were pointing to losses at Tuesday’s open on Wall Street after a morning statement from G-7 central bankers and finance leaders contained no specific actions to combat the economic risks of the coronavirus. (CNBC)\n\n*****\n\n&gt; * Trump asks Fed for ‘big cut’ after Australia slashes rates on coronavirus impact (CNBC)\n\n*****\n\n* Hopes for action from the Fed and world central banks to mitigate the impact of the coronavirus sparked a powerful rally Monday. The Dow soared nearly 1,300 points or 5% after last week’s plunge.(CNBC)\n\n*****\n\n&gt; * 10-year Treasury yield moves higher after hitting a record low Monday (CNBC)\n\n*****\n\n&gt; * Investors will be looking for signs of how the coronavirus may be affecting retailers Target (TGT) and Kohl’s (KSS) when they hold conference calls after issuing earnings. Target reported mixed fourth-quarter results before the bell. Kohl’s beat on the top and bottom lines and hiked its dividend by 5%. Nordstrom leads Tuesday afternoon’s retail earnings reports. (CNBC)\n\n*****\n\n&gt; * Automakers are expected to report February sales throughout the day. There are no U.S. economic reports from the government this morning. Two regional central bank presidents, Chicago Fed President Charles Evans and Cleveland President Loretta Mester speak today.\n\n*****\n\n&gt; * The spread of the coronavirus in China is slowing while new cases in many other countries are accelerating. The vast majority of the more than 91,000 global cases and over 3,100 deaths are still in China. (CNBC)\n\n*****\n\n&gt; * Facebook, Google, Microsoft, Adobe pull out of more conferences as coronavirus spreads (CNBC)\n\n*****\n\n&gt; * Uber acknowledges coronavirus poses material risk to its business (CNBC)\n\n*****\n\n&gt; * Visa flags hit to Q2 revenue due to coronavirus outbreak (Reuters)\n\n*****\n\n&gt; * New cases in South Korea surged by 851 on Tuesday, bringing total infections there to more than 5,100, including 31 deaths. Italy’s cases rose to more than 2,000 with 52 deaths. (CNBC)\n\n*****\n\n&gt; * Pope tests negative for coronavirus, Italy report says (Reuters)\n\n*****\n\n&gt; * The U.S. has at least 91 coronavirus cases with at least six deaths. On Capitol Hill, aides said negotiations were nearing completion on an emergency funding bill to develop a vaccine and offer disaster loans to businesses hurt by the crisis. (AP)\n\n*****\n\n&gt; * How grocery stores are trying to prevent ‘panic buying’ as coronavirus causes stockpiling, emptying shelves (CNBC)\n\n*****\n\n&gt; * Vermont Sen. Bernie Sanders and former Vice President Joe Biden are vying for a victory in Texas, the second biggest delegate haul among the 14 states holding Democratic presidential nominating contests on Super Tuesday. (CNBC)\n\n*****\n\n&gt; * Super Tuesday polls are opening: Here are the states holding 2020 Democratic primaries and what’s at stake (CNBC)\n\n*****\n\n&gt; * Billionaire ex-New York City Mayor Mike Bloomberg, on ballots for the first Tuesday, and Massachusetts Sen. Elizabeth Warren could also win delegates as the primary field shrinks. (AP)\n\n*****\n\n&gt; * Tesla and SpaceX CEO Elon Musk jumped to the defense of fellow tech billionaire Jack Dorsey last night, as the latter faces pressure from an activist investor to step down as the CEO of Twitter. (CNBC)\n\n*****\n\n&gt; * JMP upgrades Tesla with highest price target on Wall Street, shares soar (CNBC)\n\n*****\n\n&gt; * Hundreds of angry Robinhood users took to Twitter and Reddit to blast the start-up after a technical outage kept users from trading during * Monday’s huge rally. Some threatened to leave the platform, while others called for a class-action lawsuit. (CNBC)\n\n*****\n\n&gt; * A bipartisan group of lawmakers unveiled legislation that would hold e-commerce companies like Amazon or eBay liable for counterfeit products sold on their platforms as U.S firms struggle to combat the sale of fake goods online. (CNBC)\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](http://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://i.imgur.com/nQpIMpX.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/QUBLcSG.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/30Sqf4m.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/zASmUSl.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/Y2ZRwLb.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n($TGT $PLUG $JD $ZM $COST $TLRY $AZO $KSS $SPLK $DLTR $VEEV $XRAY $SE $MRVL $FOLD $KR $OKTA $STNE $BLDP $BURL $CIEN $ALBO $MAXR $ANF $ITCI $FNKO $JWN $EPRT $VIPS $GTT $CORE $BNFT $LVGO $EVRG $ROST $EGRX $AOBC $TGLS $ATRS $HPE $NWN $WVE $WSC)\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/j7kavSk.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n($TGT $AZO $KSS $SE $ATRS $AUTL $IGT $AFI $INSW $TGTX $STIM $CHFS $MYE $SHLO $FOE $SCM $TDW $ITMR $NCSM $HCM)\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/t8b41yw.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/37PNS5r.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/n7eRcEA.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/Z7gWRZU.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/V13Lj1Q.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/c84OIKs.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #4!](https://i.imgur.com/KlF2tV6.png)**)\n\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS LINK #1!](https://i.imgur.com/jEbL2Ty.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS LINK #2!](https://i.imgur.com/wZOhonc.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #1!](https://i.imgur.com/fKr6MYB.png)**)\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #2!](https://i.imgur.com/xIcKC6O.png)**)\n\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS:\n\n* TGT\n* TLRY\n* TGTX\n* QGEN\n* GILD\n* KSS\n* SE\n* CVX\n* DAL\n* CRON\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2020/03/03/stocks-making-the-biggest-moves-premarket-target-kohls-uber-amd-tesla-more.html)**)\n\n*****\n\n&gt; **Target** — Target shares dipped about 0.8% in the premarket after the retailer reported disappointing revenue figures. The company posted revenue of $23.4 billion for the previous quarter. That’s slightly below a Refinitiv estimate of $23.5 billion. Same-store sales — a key metric for retailers — came in line with expectations.\n\n&gt; #**STOCK SYMBOL:** TGT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TGT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TGT)**)\n\n*****\n\n&gt; **Kohl’s** — Kohl’s rose 4% on the back of quarterly results that easily beat analysts’ expectations. The retailer reported earnings per share of $1.99 on $6.537 billion. Analysts polled by Refinitiv expected a profit of $1.88 per share on revenue of $6.523 billion. Same-store sales were flat while analysts expected a decline of 0.1%.\n\n&gt; #**STOCK SYMBOL:** KSS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=KSS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/KSS)**)\n\n*****\n\n&gt; **Uber** — The ride-sharing company acknowledged in a regulatory filing the coronavirus poses a material risk to its business in a regulatory filing. Uber mentioned the coronavirus five times in the filing, noting it could disrupt operations outside the U.S. Separately, an analyst at Needham put Uber in his “conviction list” as the coronavirus outbreak has “created a very attractive buying opportunity.”\n\n&gt; #**STOCK SYMBOL:** UBER\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=UBER&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/UBER)**)\n\n*****\n\n&gt; **AB InBev** — An analyst at Bank of America downgraded the beer-making giant to “neutral” from “buy,” citing “near term headwinds” such as lower earnings out of Brazil and the coronavirus outbreak.\n\n&gt; #**STOCK SYMBOL:** BUD\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BUD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BUD)**)\n\n*****\n\n&gt; **Advanced Micro Devices** — AMD was upgraded to “overweight” from “neutral” by an analyst at Piper Sandler who noted the broader market’s recent pullback “provides an attractive opportunity for long-term investors” who want to buy into the stock.\n\n&gt; #**STOCK SYMBOL:** AMD\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AMD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AMD)**)\n\n*****\n\n&gt; **Tesla** — The electric car maker was upgraded to “market outperform” from “market perform” by an analyst at JMP Securities. The analyst also issued a price target of $1,060 per share, which represents a 42.5% upside from Monday’s close of $743.62 per share. “Investors may find themselves with additional near-term opportunities to buy the stock as TSLA works through the first half of 2020 and the impact of COVID-19 becomes apparent,” the analyst said.\n\n&gt; #**STOCK SYMBOL:** TSLA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TSLA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TSLA)**)\n\n*****\n\n&gt; **Tilray** — Tilray tumbled more than 13% after the cannabis company reported quarterly revenue numbers that missed analysts’ expectations. The company posted sales of $46.9 million in the previous quarter. That’s below a Refinitiv estimate of $55.4 million. “We have faced industry challenges, but we remain committed to driving long-term value for our shareholders,” CEO Brendan Kennedy said in a statement.\n\n&gt; #**STOCK SYMBOL:** TLRY\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TLRY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TLRY)**)\n\n*****\n\n&gt; **Visa** — The credit card giant warned its second-quarter revenue growth could be about 2.5 to 3.5 percentage points below its previous guidance amid pressure from the coronavirus outbreak.\n\n&gt; #**STOCK SYMBOL:** V\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=V&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/V)**)\n\n*****\n\n&gt; **Microchip Technology** — The chipmaker’s stock dropped more than 1% after the company warned of flat sales for fiscal fourth quarter. “We see very weak demand in Asia, especially in China, driven by the COVID-19 fears, and customers returning to work at a slower pace than anticipated,” Microchip Technology said in a statement.\n\n&gt; #**STOCK SYMBOL:** MU\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=MU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/MU)**)\n\n*****\n\n#**FULL DISCLOSURE:**\n\n&gt; /u/bigbear0083 has no positions in any stocks mentioned. Reddit, moderators, and the author do not advise making investment decisions based on discussion in these posts. Analysis is not subject to validation and users take action at their own risk. /u/bigbear0083 is an admin at the financial forums [Stockaholics.net](http://www.stockaholics.net/) where this content was originally posted.\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/StockMarket?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Tuesday, March 3rd, 2020! :)**",
        "subreddit": "StockMarket",
        "title": "Today's Stock Market News [Tuesday, March 3rd, 2020]",
        "url": "https://www.reddit.com/r/StockMarket/comments/fcv38s/todays_stock_market_news_tuesday_march_3rd_2020/",
        "created": 1583273428.0
    },
    {
        "author": "badpauly",
        "created_utc": 1584568374,
        "id": "fkxzj1",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "This is a list of the top 20 companies that experienced the largest change in insider shares in the last seven (7) days.\nThe SEC defines an insider as any officer, director or 10% shareholder. It is not illegal for these people to buy or sell their own shares.\nIn fact, since most of them get paid in stock options, it is expected. However, it is illegal for them to trade on inside information\nthat has not been made public. So for example if there are drug trial results that are bad and not public,\ninsiders cannot dump shares. That said, many people have observed that insiders - in general - seem to have a good\ntrack record at timing their purchases.  All trades that are marked as part of a 10b5 plan are excluded from this report.\n\n## Largest Insider Buying (Last 7 Days)\nCompany|Count|Shares Changed|Avg. Price|Value Change\n--------|-----:|-----:|-----:|--------:  \n[ECC / Eagle Point Credit Company Inc.](https://fintel.io/n/us/ecc)|9|538,148|50,870|74,180,027,842 \n[KALA / Kala Pharmaceuticals, Inc.](https://fintel.io/n/us/kala)|4|15,219,124|7|120,057,488   \n[IMRA / IMARA Inc.](https://fintel.io/n/us/imra)|11|4,600,000|16|73,600,000 \n[TDG / Transdigm Group, Inc.](https://fintel.io/n/us/tdg)|34|160,576|410|65,381,648 \n[PBB / Prospect Capital Corp. 6.25% Bond due 2024-06-15](https://fintel.io/n/us/pbb)|5|12,425,147|5|58,827,747 \n[HTZ / Hertz Global Holdings, Inc.](https://fintel.io/n/us/htz)|1|6,387,918|7|44,651,547 \n[HE / Hawaiian Electric Industries, Inc.](https://fintel.io/n/us/he)|2|942,312|40|38,130,355 \n[IFF / International Flavors &amp;amp; Fragrances, Inc](https://fintel.io/n/us/iff)|28|321,420|103|32,634,684 \n[AXS / AXIS Capital Holdings Ltd.](https://fintel.io/n/us/axs)|7|511,490|41|20,449,298 \n[SPG / Simon Property Group, Inc.](https://fintel.io/n/us/spg)|11|362,358|55|20,235,311  \n[WLK / Westlake Chemical Corp.](https://fintel.io/n/us/wlk)|12|490,000|32|15,933,989 \n[CDLX / Cardlytics, Inc.](https://fintel.io/n/us/cdlx)|8|272,740|45|11,965,044 \n[MHK / Mohawk Industries, Inc.](https://fintel.io/n/us/mhk)|2|97,500|97|10,035,865 \n[FSLY / Fastly, Inc.](https://fintel.io/n/us/fsly)|8|600,000|14|8,582,648 \n[EHC / Encompass Health Corporation](https://fintel.io/n/us/ehc)|7|125,000|58|7,336,848 \n[ET / Exacttarget, Inc.](https://fintel.io/n/us/et)|24|954,600|5|5,750,524 \n[WFC / Wells Fargo &amp;amp; Co.](https://fintel.io/n/us/wfc)|2|193,000|29|5,553,970 \n[CLDR / Cloudera, Inc.](https://fintel.io/n/us/cldr)|1|719,000|7|4,998,704 \n[HUBS / HubSpot, Inc.](https://fintel.io/n/us/hubs)|2|40,000|125|4,976,915 \n[OCUL / Ocular Therapeutix, Inc.](https://fintel.io/n/us/ocul)|3|955,062|4|4,346,090 \n[SBGI / Sinclair Broadcast Group, Inc.](https://fintel.io/n/us/sbgi)|3|300,000|14|4,062,000 \n[LGF.A / Lions Gate Entertainment Corp.](https://fintel.io/n/us/lgf.a)|4|789,320|5|3,785,668 \n[EPD / Enterprise Products Partners L.P.](https://fintel.io/n/us/epd)|17|252,073|14|3,602,612 \n[CODI / Compass Diversified Holdings](https://fintel.io/n/us/codi)|6|228,326|16|3,559,103 \n[BPR / Brookfield Property REIT Inc.](https://fintel.io/n/us/bpr)|4|287,500|12|3,556,488 \n[EXTN / Exterran Corp.](https://fintel.io/n/us/extn)|5|528,620|7|3,447,604 \n[HOME / At Home Group Inc.](https://fintel.io/n/us/home)|2|1,100,408|3|3,370,188 \n[SFIX / Stitch Fix, Inc.](https://fintel.io/n/us/sfix)|2|250,000|13|3,190,114 \n[APAM / Artisan Partners Asset Management Inc.](https://fintel.io/n/us/apam)|9|150,000|21|3,153,094 \n[MELI / MercadoLibre, Inc.](https://fintel.io/n/us/meli)|15|5,870|523|3,065,433 \n[AGO / Assured Guaranty Ltd.](https://fintel.io/n/us/ago)|9|96,068|31|3,001,020 \n[MCY / Mercury General Corp.](https://fintel.io/n/us/mcy)|2|75,669|39|2,945,743 \n[ATEX / pdvWireless, Inc.](https://fintel.io/n/us/atex)|1|75,200|39|2,919,272 \n[GTES / Gates Industrial Corporation plc](https://fintel.io/n/us/gtes)|6|360,000|8|2,878,524 \n[NCR / NCR Corp.](https://fintel.io/n/us/ncr)|6|158,000|18|2,799,917 \n[GLPI / Gaming and Leisure Properties, Inc.](https://fintel.io/n/us/glpi)|7|103,000|27|2,578,318 \n[NXRT / NexPoint Residential Trust, Inc.](https://fintel.io/n/us/nxrt)|1|73,100|35|2,534,377 \n[UHAL / AMERCO](https://fintel.io/n/us/uhal)|11|9,075|275|2,520,016\n\n## Largest Insider Selling (Last 7 Days)\nCompany|Count|Shares Change|Avg. Price|Value Change\n--------|-----:|-----:|-----:|--------:  \n[LULU / lululemon athletica inc.](https://fintel.io/n/us/lulu)|11|-173,544|143|-24,997,939 \n[RMK / Aramark Corp](https://fintel.io/n/us/rmk)|1|-874,149|23|-19,755,767 \n[DLR / Digital Realty Trust, Inc.](https://fintel.io/n/us/dlr)|2|-133,021|128|-16,870,230 \n[SBAC / SBA Communications Corp.](https://fintel.io/n/us/sbac)|3|-42,103|277|-11,770,265 \n[ADBE / Adobe Systems, Inc.](https://fintel.io/n/us/adbe)|1|-37,751|298|-11,255,921 \n[SWFT / Swift Transportation Company](https://fintel.io/n/us/swft)|1|-290,000|30|-8,629,762 \n[CMCSA] / COMCAST CORP](https://fintel.io/n/us/cmcsa])|2|-202,782|37|-7,512,136 \n[NXRT / NexPoint Residential Trust, Inc.](https://fintel.io/n/us/nxrt)|3|-209,000|35|-7,136,635 \n[NVDA / NVIDIA Corp.](https://fintel.io/n/us/nvda)|6|-20,000|223|-4,446,597 \n[LGIH / LGI Homes, Inc.](https://fintel.io/n/us/lgih)|50|-94,052|47|-4,272,505 \n[DISC / Discovery Communications, Inc.](https://fintel.io/n/us/disc)|2|-200,000|20|-3,853,080 \n[UNH / UnitedHealth Group Inc.](https://fintel.io/n/us/unh)|2|-15,000|239|-3,586,037 \n[RP / RealPage, Inc.](https://fintel.io/n/us/rp)|5|-62,829|55|-3,370,932 \n[BBY / Best Buy Co., Inc.](https://fintel.io/n/us/bby)|19|-58,217|56|-3,203,780 \n[JBGS / JBG SMITH Properties](https://fintel.io/n/us/jbgs)|3|-100,000|29|-2,893,688 \n[AYX / Alteryx Inc.](https://fintel.io/n/us/ayx)|15|-30,000|96|-2,862,958 \n[OKTA / Okta, Inc.](https://fintel.io/n/us/okta)|18|-28,070|98|-2,741,608 \n[HLI / Houlihan Lokey, Inc.](https://fintel.io/n/us/hli)|3|-50,000|49|-2,429,641 \n[SWCH / Switch Inc](https://fintel.io/n/us/swch)|6|-186,789|12|-2,228,153 \n[DDOG / Datadog, Inc. Class A](https://fintel.io/n/us/ddog)|2|-56,418|32|-1,826,143 \n[ROP / Roper Technologies, Inc.](https://fintel.io/n/us/rop)|2|-6,000|284|-1,705,695 \n[ETSY / Etsy, Inc.](https://fintel.io/n/us/etsy)|1|-34,976|47|-1,643,872 \n[SAIL / SailPoint Technologies Holdings](https://fintel.io/n/us/sail)|11|-98,000|16|-1,596,815 \n[NNN / National Retail Properties, Inc.](https://fintel.io/n/us/nnn)|3|-35,931|43|-1,540,279 \n[TZOO / Travelzoo, Inc.](https://fintel.io/n/us/tzoo)|2|-233,815|6|-1,366,509 \n[GWRE / Guidewire Software, Inc.](https://fintel.io/n/us/gwre)|6|-13,613|80|-1,086,931 \n[BDX / Becton Dickinson &amp;amp; Co.](https://fintel.io/n/us/bdx)|1|-4,349|225|-976,481 \n[ABT / Abbott Laboratories](https://fintel.io/n/us/abt)|1|-10,600|82|-869,200 \n[ET / Exacttarget, Inc.](https://fintel.io/n/us/et)|1|-128,000|6|-797,581 \n[NVTA / Invitae Corp.](https://fintel.io/n/us/nvta)|6|-63,989|12|-754,430 \n[ICTSF / ICTS International N.V.](https://fintel.io/n/us/ictsf)|1|-700,000|1|-700,000 \n[SNPS / Synopsys, Inc.](https://fintel.io/n/us/snps)|1|-5,000|127|-637,125 \n[AEE / Ameren Corp.](https://fintel.io/n/us/aee)|2|-8,650|73|-634,903 \n[BANF / BancFirst Corp.](https://fintel.io/n/us/banf)|1|-18,000|35|-628,058 \n[ALLO / Allogene Therapeutics, Inc.](https://fintel.io/n/us/allo)|5|-29,535|20|-572,103 \n[LM / Legg Mason, Inc.](https://fintel.io/n/us/lm)|1|-11,350|48|-548,432 \n[NFBK / Northfield Bancorp, Inc.](https://fintel.io/n/us/nfbk)|3|-40,000|12|-469,358 \n[SHW / Sherwin-Williams Co. (The)](https://fintel.io/n/us/shw)|1|-908|492|-446,863 \n[EBS / Emergent Biosolutions, Inc.](https://fintel.io/n/us/ebs)|1|-6,400|65|-416,000 \n[KNSL / Kinsale Capital Group, Inc.](https://fintel.io/n/us/knsl)|4|-4,000|102|-407,240 \n[GABC / German American Bancorp Inc.](https://fintel.io/n/us/gabc)|2|-15,992|25|-398,663\n\n*Count* column is number of transactions.\n\nSource: [Fintel.io/insiders](https://fintel.io/insiders)",
        "subreddit": "StockMarket",
        "title": "Significant Insider Trading Activity (Last 7 Days)",
        "url": "https://www.reddit.com/r/StockMarket/comments/fkxzj1/significant_insider_trading_activity_last_7_days/",
        "created": 1584597174.0
    },
    {
        "author": "gardenfordad",
        "created_utc": 1584028504,
        "id": "fhihjo",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I've gotta offload something....I'm slightly ahead in both of these stocks.  Which one should I dump?  I need to get some cash out for a family emergency....I know the timing stinks.",
        "subreddit": "stocks",
        "title": "Somethings gotta go....T or ADBE?",
        "url": "https://www.reddit.com/r/stocks/comments/fhihjo/somethings_gotta_got_or_adbe/",
        "created": 1584057304.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1583244763,
        "id": "fcv4b0",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/stocks sub! Welcome to Tuesday. Here is your stocks market news this AM-\n\n*****\n\n#[Today's Top Headlines for Tuesday, March 2nd, 2020](https://www.cnbc.com/2020/03/03/dow-to-drop-after-huge-monday-gain-as-g-7-statement-disappoints.html)\n\n*****\n\n&gt; * Dow futures, in another volatile overnight session, were pointing to losses at Tuesday’s open on Wall Street after a morning statement from G-7 central bankers and finance leaders contained no specific actions to combat the economic risks of the coronavirus. (CNBC)\n\n*****\n\n&gt; * Trump asks Fed for ‘big cut’ after Australia slashes rates on coronavirus impact (CNBC)\n\n*****\n\n&gt; * Hopes for action from the Fed and world central banks to mitigate the impact of the coronavirus sparked a powerful rally Monday. The Dow soared nearly 1,300 points or 5% after last week’s plunge.(CNBC)\n\n*****\n\n&gt; * 10-year Treasury yield moves higher after hitting a record low Monday (CNBC)\n\n*****\n\n&gt; * Investors will be looking for signs of how the coronavirus may be affecting retailers Target (TGT) and Kohl’s (KSS) when they hold conference calls after issuing earnings. Target reported mixed fourth-quarter results before the bell. Kohl’s beat on the top and bottom lines and hiked its dividend by 5%. Nordstrom leads Tuesday afternoon’s retail earnings reports. (CNBC)\n\n*****\n\n&gt; * Automakers are expected to report February sales throughout the day. There are no U.S. economic reports from the government this morning. Two regional central bank presidents, Chicago Fed President Charles Evans and Cleveland President Loretta Mester speak today.\n\n*****\n\n&gt; * The spread of the coronavirus in China is slowing while new cases in many other countries are accelerating. The vast majority of the more than 91,000 global cases and over 3,100 deaths are still in China. (CNBC)\n\n*****\n\n&gt; * Facebook, Google, Microsoft, Adobe pull out of more conferences as coronavirus spreads (CNBC)\n\n*****\n\n&gt; * Uber acknowledges coronavirus poses material risk to its business (CNBC)\n\n*****\n\n&gt; * Visa flags hit to Q2 revenue due to coronavirus outbreak (Reuters)\n\n*****\n\n&gt; * New cases in South Korea surged by 851 on Tuesday, bringing total infections there to more than 5,100, including 31 deaths. Italy’s cases rose to more than 2,000 with 52 deaths. (CNBC)\n\n*****\n\n&gt; * Pope tests negative for coronavirus, Italy report says (Reuters)\n\n*****\n\n&gt; * The U.S. has at least 91 coronavirus cases with at least six deaths. On Capitol Hill, aides said negotiations were nearing completion on an emergency funding bill to develop a vaccine and offer disaster loans to businesses hurt by the crisis. (AP)\n\n*****\n\n&gt; * How grocery stores are trying to prevent ‘panic buying’ as coronavirus causes stockpiling, emptying shelves (CNBC)\n\n*****\n\n&gt; * Vermont Sen. Bernie Sanders and former Vice President Joe Biden are vying for a victory in Texas, the second biggest delegate haul among the 14 states holding Democratic presidential nominating contests on Super Tuesday. (CNBC)\n\n*****\n\n&gt; * Super Tuesday polls are opening: Here are the states holding 2020 Democratic primaries and what’s at stake (CNBC)\n\n*****\n\n&gt; * Billionaire ex-New York City Mayor Mike Bloomberg, on ballots for the first Tuesday, and Massachusetts Sen. Elizabeth Warren could also win delegates as the primary field shrinks. (AP)\n\n*****\n\n&gt; * Tesla and SpaceX CEO Elon Musk jumped to the defense of fellow tech billionaire Jack Dorsey last night, as the latter faces pressure from an activist investor to step down as the CEO of Twitter. (CNBC)\n\n*****\n\n&gt; * JMP upgrades Tesla with highest price target on Wall Street, shares soar (CNBC)\n\n*****\n\n&gt; * Hundreds of angry Robinhood users took to Twitter and Reddit to blast the start-up after a technical outage kept users from trading during * Monday’s huge rally. Some threatened to leave the platform, while others called for a class-action lawsuit. (CNBC)\n\n*****\n\n&gt; * A bipartisan group of lawmakers unveiled legislation that would hold e-commerce companies like Amazon or eBay liable for counterfeit products sold on their platforms as U.S firms struggle to combat the sale of fake goods online. (CNBC)\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](http://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://i.imgur.com/nQpIMpX.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/QUBLcSG.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/30Sqf4m.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/zASmUSl.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/Y2ZRwLb.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n($TGT $PLUG $JD $ZM $COST $TLRY $AZO $KSS $SPLK $DLTR $VEEV $XRAY $SE $MRVL $FOLD $KR $OKTA $STNE $BLDP $BURL $CIEN $ALBO $MAXR $ANF $ITCI $FNKO $JWN $EPRT $VIPS $GTT $CORE $BNFT $LVGO $EVRG $ROST $EGRX $AOBC $TGLS $ATRS $HPE $NWN $WVE $WSC)\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/j7kavSk.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n($TGT $AZO $KSS $SE $ATRS $AUTL $IGT $AFI $INSW $TGTX $STIM $CHFS $MYE $SHLO $FOE $SCM $TDW $ITMR $NCSM $HCM)\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/t8b41yw.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/37PNS5r.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/n7eRcEA.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/Z7gWRZU.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/V13Lj1Q.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/c84OIKs.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #4!](https://i.imgur.com/KlF2tV6.png)**)\n\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS LINK #1!](https://i.imgur.com/jEbL2Ty.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS LINK #2!](https://i.imgur.com/wZOhonc.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #1!](https://i.imgur.com/fKr6MYB.png)**)\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #2!](https://i.imgur.com/xIcKC6O.png)**)\n\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS:\n\n* TGT\n* TLRY\n* TGTX\n* QGEN\n* GILD\n* KSS\n* SE\n* CVX\n* DAL\n* CRON\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2020/03/03/stocks-making-the-biggest-moves-premarket-target-kohls-uber-amd-tesla-more.html)**)\n\n*****\n\n&gt; **Target** — Target shares dipped about 0.8% in the premarket after the retailer reported disappointing revenue figures. The company posted revenue of $23.4 billion for the previous quarter. That’s slightly below a Refinitiv estimate of $23.5 billion. Same-store sales — a key metric for retailers — came in line with expectations.\n\n&gt; #**STOCK SYMBOL:** TGT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TGT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TGT)**)\n\n*****\n\n&gt; **Kohl’s** — Kohl’s rose 4% on the back of quarterly results that easily beat analysts’ expectations. The retailer reported earnings per share of $1.99 on $6.537 billion. Analysts polled by Refinitiv expected a profit of $1.88 per share on revenue of $6.523 billion. Same-store sales were flat while analysts expected a decline of 0.1%.\n\n&gt; #**STOCK SYMBOL:** KSS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=KSS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/KSS)**)\n\n*****\n\n&gt; **Uber** — The ride-sharing company acknowledged in a regulatory filing the coronavirus poses a material risk to its business in a regulatory filing. Uber mentioned the coronavirus five times in the filing, noting it could disrupt operations outside the U.S. Separately, an analyst at Needham put Uber in his “conviction list” as the coronavirus outbreak has “created a very attractive buying opportunity.”\n\n&gt; #**STOCK SYMBOL:** UBER\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=UBER&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/UBER)**)\n\n*****\n\n&gt; **AB InBev** — An analyst at Bank of America downgraded the beer-making giant to “neutral” from “buy,” citing “near term headwinds” such as lower earnings out of Brazil and the coronavirus outbreak.\n\n&gt; #**STOCK SYMBOL:** BUD\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BUD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BUD)**)\n\n*****\n\n&gt; **Advanced Micro Devices** — AMD was upgraded to “overweight” from “neutral” by an analyst at Piper Sandler who noted the broader market’s recent pullback “provides an attractive opportunity for long-term investors” who want to buy into the stock.\n\n&gt; #**STOCK SYMBOL:** AMD\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AMD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AMD)**)\n\n*****\n\n&gt; **Tesla** — The electric car maker was upgraded to “market outperform” from “market perform” by an analyst at JMP Securities. The analyst also issued a price target of $1,060 per share, which represents a 42.5% upside from Monday’s close of $743.62 per share. “Investors may find themselves with additional near-term opportunities to buy the stock as TSLA works through the first half of 2020 and the impact of COVID-19 becomes apparent,” the analyst said.\n\n&gt; #**STOCK SYMBOL:** TSLA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TSLA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TSLA)**)\n\n*****\n\n&gt; **Tilray** — Tilray tumbled more than 13% after the cannabis company reported quarterly revenue numbers that missed analysts’ expectations. The company posted sales of $46.9 million in the previous quarter. That’s below a Refinitiv estimate of $55.4 million. “We have faced industry challenges, but we remain committed to driving long-term value for our shareholders,” CEO Brendan Kennedy said in a statement.\n\n&gt; #**STOCK SYMBOL:** TLRY\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TLRY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TLRY)**)\n\n*****\n\n&gt; **Visa** — The credit card giant warned its second-quarter revenue growth could be about 2.5 to 3.5 percentage points below its previous guidance amid pressure from the coronavirus outbreak.\n\n&gt; #**STOCK SYMBOL:** V\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=V&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/V)**)\n\n*****\n\n&gt; **Microchip Technology** — The chipmaker’s stock dropped more than 1% after the company warned of flat sales for fiscal fourth quarter. “We see very weak demand in Asia, especially in China, driven by the COVID-19 fears, and customers returning to work at a slower pace than anticipated,” Microchip Technology said in a statement.\n\n&gt; #**STOCK SYMBOL:** MU\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=MU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/MU)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/stocks?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Tuesday, March 3rd, 2020! :)**",
        "subreddit": "stocks",
        "title": "Today's Stock Market News [Tuesday, March 3rd, 2020]",
        "url": "https://www.reddit.com/r/stocks/comments/fcv4b0/todays_stock_market_news_tuesday_march_3rd_2020/",
        "created": 1583273563.0
    },
    {
        "author": "1Athleticism1",
        "created_utc": 1584028817,
        "id": "fhikkw",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "ADBE earnings?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fhikkw/adbe_earnings/",
        "created": 1584057617.0
    },
    {
        "author": "1Athleticism1",
        "created_utc": 1584028990,
        "id": "fhimdy",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "ADBE Earnings",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fhimdy/adbe_earnings/",
        "created": 1584057790.0
    },
    {
        "author": "McSupergeil",
        "created_utc": 1585257726,
        "id": "fpjym8",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Puts make me tendies for Adobe",
        "url": "https://v.redd.it/9p8d8pbf33p41",
        "created": 1585286526.0
    },
    {
        "author": "peterjswift",
        "created_utc": 1583931479,
        "id": "fgwqk8",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "We all remember last April when Amazon pulled its plug on trying to have a major ecommerce presence in China.  We also know that the JEDI contract was going to AWS and not $MSFT if not for (legal or not) meddling from the President.\n\nYou would think everyone (Chinese government, Trump, Pentagon, etc) would know better than to get in Bezos way by now, but no...Bezos was put in a corner.\n\nWell, now we're all paying for it.  Literally and figuratively.  There is no business better positioned to take advantage of pandemic panic than a business that is hyperfocused on eliminating social interaction!  \n\nWhere can we safely get our toilet paper and hand sanitizer?  Amazon.  \n\nWhere can we order our cheetos late at night and have them delivered without having to touch cash or make eye contact with another human?   Amazon wins.   \n\nDiscussions of $MMM's record sales of masks and all things coronavirus related hide the fact that it is Amazon delivering it all to our doors.\n\nAnd it gets better...everyone has been talking for over a month about how Zoom ($ZM) and Slack ($WORK) are the big beneficiaries of the new norm of working at home - in fact, so much talk that it is not only priced in, it is way overpriced (PE 1500!?!).  But wait, both Slack and Zoom work on AWS.  Amazon wins again.\n\nNow colleges are closing and moving to remote learning left and right.  More than 20 major colleges and universities announced yesterday including Harvard, Bucknell, Yale, Amherst...  They're scrambling to increase their remote learning capabilities.  What are they using?\n\n* Zoom\n* Blackboard\n* Canvas\n* Adobe Connect\n* Litmos\n\nWhat do all of these have in common?  They use AWS!  Amazon keeps on winning.  Many of our state governments are telling folks to work from home.  They're using Zoom, Cisco's WebEx, GoToMeeting, LogMeIn, and others.  All of them use AWS (even Cisco!).  \n\nNot to mention, the first smart speaker system to work with WebEx and pretty much ALL of these online collaboration and meeting software providers was Amazon's Alexa.\n\nAnd then it gets even better.  Amazon announced their own online meeting system, Chime, a couple of years ago.  The flexible nature of the \"scale up/scale down\" pricing is about to make it an attractive option compared to the established solutions as businesses and colleges scramble to find ways to keep functioning from home.\n\nWhat about self-quarantining?  Who wins when we all have to stay at home all the time?  The obvious winners are content providers Netflix, Hulu, Disney+...maybe Amazon Prime video?   All running on AWS.\n\nAWS is the main profit driver of Amazon's growth.  AWS is about to have the biggest quarter in its history.  The downside is that it won't be clear what that looks like until earnings, since AWS is the least public facing of Amazon's businesses.\n\nAll this is to say, Amazon is still managing to make the government pay them without the JEDI contract, it is just indirect.  And every subscription businesses pay for or individuals can probably be traced back to AWS.  Jeff Bezos owns us, and I, for one, welcome our new Amazon overlords.\n\n\nTL;DR: $AMZN calls 4/25 and beyond.  $2000+",
        "subreddit": "wallstreetbets",
        "title": "Jeff Bezos orchestrated the Coronavirus to take over the world.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fgwqk8/jeff_bezos_orchestrated_the_coronavirus_to_take/",
        "created": 1583960279.0
    },
    {
        "author": "myself09",
        "created_utc": 1584851409,
        "id": "fmtzzl",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I am in my mid-20s and new to investing, below is my current portfolio which I am planning to hold **long-term**. I'd like to know what you think of it, and appreciate any feedback/comments. Thanks for the time.\n\n**Resources I use:** \n\n* Morningstar\n* YouTube\n* Reddit\n\n**Age of my portfolio:** 1 month.\n\n**Portfolio:**\n\n*ETFs*\n\n* VTI\n\n*stocks*\n\n**International stocks (2.67%)**\n\n* Alibaba Group Holding Ltd (**BABA**)\n* JD.com Inc (**JD**)\n\n**US Stocks (63.37%)**\n\n* Amazon.com Inc (**AMZN**) \n* Alphabet Inc (**GOOGL**)\n* Apple Inc (**AAPL**)\n* Microsoft Corp (**MSFT**)\n* Visa Inc (**V**)\n* Mastercard Inc (**MA**)\n* Advanced Micro Devices inc (**AMD**)\n* ServiceNow Inc (**NOW**)\n* Nvidia Corp (**NVDA**)\n* Tesla Inc (**TSLA**)\n* Adobe Inc (**ADBE**)\n* Costco Wholesale Corp (**COST**)\n* Thermo Fisher Scientific Inc (**TMO**)\n* Salesforce.com Inc (**CRM**)\n* McDonald's Corp (**MCD**)\n* Facebook Inc (**FB**)\n* Cigna Corp (**CI**)\n* Walmart Inc (**WMT**)\n* Boeing Co (**BA**)\n* Walt Disney Co (**DIS**)\n* Gilead Sciences Inc (**GILD**)\n* Square Inc (**SQ**)\n* Citigroup Inc (**C**)\n\nAlthough the list is long, some of the stocks like TSLA, MCD, TMO, BA, FB, CI, WMT, MA, NOW are only **fractions** of a share. I plan to buy more fractions of those shares over a period.\n\nThe below mentioned stocks/ETFs are in my **watchlist**:\n\n* Vanguard S&amp;P 500 ETF (**VOO**)\n* Waste Management (**WM**)\n* PayPal Holdings Inc (**PYPL**)\n* 3M (**MMM**)\n* Berkshire Hathaway Inc (**BRK.B**) \n* Intuitive Surgical Inc (**ISRG**)\n* UnitedHealth Group (**UNH**)\n* CVS Health Corp. (**CVS**)\n* AT&amp;T (**T**)\n* The Trade Desk inc. (TTD)\n* Beyond Meat Inc. (**BYND**)\n* Intel Corp (**INTC**)\n* Bank of America (**BAC**)\n* Lockheed Martin Corp. (**LMT**)\n* Activision Blizzard (**ATVI**)\n\nThanks again.",
        "subreddit": "stocks",
        "title": "Please rate my portfolio and watchlist",
        "url": "https://www.reddit.com/r/stocks/comments/fmtzzl/please_rate_my_portfolio_and_watchlist/",
        "created": 1584880209.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1583244981,
        "id": "fcv62i",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/smallstreetbets sub! Welcome to Tuesday. Here is your stock market news this AM-\n\n*****\n\n#[Today's Top Headlines for Tuesday, March 2nd, 2020](https://www.cnbc.com/2020/03/03/dow-to-drop-after-huge-monday-gain-as-g-7-statement-disappoints.html)\n\n*****\n\n&gt; * Dow futures, in another volatile overnight session, were pointing to losses at Tuesday’s open on Wall Street after a morning statement from G-7 central bankers and finance leaders contained no specific actions to combat the economic risks of the coronavirus. (CNBC)\n\n*****\n\n&gt; * Trump asks Fed for ‘big cut’ after Australia slashes rates on coronavirus impact (CNBC)\n\n*****\n\n&gt; * Hopes for action from the Fed and world central banks to mitigate the impact of the coronavirus sparked a powerful rally Monday. The Dow soared nearly 1,300 points or 5% after last week’s plunge.(CNBC)\n\n*****\n\n&gt; * 10-year Treasury yield moves higher after hitting a record low Monday (CNBC)\n\n*****\n\n&gt; * Investors will be looking for signs of how the coronavirus may be affecting retailers Target (TGT) and Kohl’s (KSS) when they hold conference calls after issuing earnings. Target reported mixed fourth-quarter results before the bell. Kohl’s beat on the top and bottom lines and hiked its dividend by 5%. Nordstrom leads Tuesday afternoon’s retail earnings reports. (CNBC)\n\n*****\n\n&gt; * Automakers are expected to report February sales throughout the day. There are no U.S. economic reports from the government this morning. Two regional central bank presidents, Chicago Fed President Charles Evans and Cleveland President Loretta Mester speak today.\n\n*****\n\n&gt; * The spread of the coronavirus in China is slowing while new cases in many other countries are accelerating. The vast majority of the more than 91,000 global cases and over 3,100 deaths are still in China. (CNBC)\n\n*****\n\n&gt; * Facebook, Google, Microsoft, Adobe pull out of more conferences as coronavirus spreads (CNBC)\n\n*****\n\n&gt; * Uber acknowledges coronavirus poses material risk to its business (CNBC)\n\n*****\n\n&gt; * Visa flags hit to Q2 revenue due to coronavirus outbreak (Reuters)\n\n*****\n\n&gt; * New cases in South Korea surged by 851 on Tuesday, bringing total infections there to more than 5,100, including 31 deaths. Italy’s cases rose to more than 2,000 with 52 deaths. (CNBC)\n\n*****\n\n&gt; * Pope tests negative for coronavirus, Italy report says (Reuters)\n\n*****\n\n&gt; * The U.S. has at least 91 coronavirus cases with at least six deaths. On Capitol Hill, aides said negotiations were nearing completion on an emergency funding bill to develop a vaccine and offer disaster loans to businesses hurt by the crisis. (AP)\n\n*****\n\n&gt; * How grocery stores are trying to prevent ‘panic buying’ as coronavirus causes stockpiling, emptying shelves (CNBC)\n\n*****\n\n&gt; * Vermont Sen. Bernie Sanders and former Vice President Joe Biden are vying for a victory in Texas, the second biggest delegate haul among the 14 states holding Democratic presidential nominating contests on Super Tuesday. (CNBC)\n\n*****\n\n&gt; * Super Tuesday polls are opening: Here are the states holding 2020 Democratic primaries and what’s at stake (CNBC)\n\n*****\n\n&gt; * Billionaire ex-New York City Mayor Mike Bloomberg, on ballots for the first Tuesday, and Massachusetts Sen. Elizabeth Warren could also win delegates as the primary field shrinks. (AP)\n\n*****\n\n&gt; * Tesla and SpaceX CEO Elon Musk jumped to the defense of fellow tech billionaire Jack Dorsey last night, as the latter faces pressure from an activist investor to step down as the CEO of Twitter. (CNBC)\n\n*****\n\n&gt; * JMP upgrades Tesla with highest price target on Wall Street, shares soar (CNBC)\n\n*****\n\n&gt; * Hundreds of angry Robinhood users took to Twitter and Reddit to blast the start-up after a technical outage kept users from trading during * Monday’s huge rally. Some threatened to leave the platform, while others called for a class-action lawsuit. (CNBC)\n\n*****\n\n&gt; * A bipartisan group of lawmakers unveiled legislation that would hold e-commerce companies like Amazon or eBay liable for counterfeit products sold on their platforms as U.S firms struggle to combat the sale of fake goods online. (CNBC)\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](http://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://i.imgur.com/nQpIMpX.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/QUBLcSG.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/30Sqf4m.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/zASmUSl.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/Y2ZRwLb.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n($TGT $PLUG $JD $ZM $COST $TLRY $AZO $KSS $SPLK $DLTR $VEEV $XRAY $SE $MRVL $FOLD $KR $OKTA $STNE $BLDP $BURL $CIEN $ALBO $MAXR $ANF $ITCI $FNKO $JWN $EPRT $VIPS $GTT $CORE $BNFT $LVGO $EVRG $ROST $EGRX $AOBC $TGLS $ATRS $HPE $NWN $WVE $WSC)\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/j7kavSk.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n($TGT $AZO $KSS $SE $ATRS $AUTL $IGT $AFI $INSW $TGTX $STIM $CHFS $MYE $SHLO $FOE $SCM $TDW $ITMR $NCSM $HCM)\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/t8b41yw.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/37PNS5r.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/n7eRcEA.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/Z7gWRZU.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/V13Lj1Q.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/c84OIKs.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #4!](https://i.imgur.com/KlF2tV6.png)**)\n\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS LINK #1!](https://i.imgur.com/jEbL2Ty.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS LINK #2!](https://i.imgur.com/wZOhonc.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #1!](https://i.imgur.com/fKr6MYB.png)**)\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #2!](https://i.imgur.com/xIcKC6O.png)**)\n\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS:\n\n* TGT\n* TLRY\n* TGTX\n* QGEN\n* GILD\n* KSS\n* SE\n* CVX\n* DAL\n* CRON\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2020/03/03/stocks-making-the-biggest-moves-premarket-target-kohls-uber-amd-tesla-more.html)**)\n\n*****\n\n&gt; **Target** — Target shares dipped about 0.8% in the premarket after the retailer reported disappointing revenue figures. The company posted revenue of $23.4 billion for the previous quarter. That’s slightly below a Refinitiv estimate of $23.5 billion. Same-store sales — a key metric for retailers — came in line with expectations.\n\n&gt; #**STOCK SYMBOL:** TGT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TGT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TGT)**)\n\n*****\n\n&gt; **Kohl’s** — Kohl’s rose 4% on the back of quarterly results that easily beat analysts’ expectations. The retailer reported earnings per share of $1.99 on $6.537 billion. Analysts polled by Refinitiv expected a profit of $1.88 per share on revenue of $6.523 billion. Same-store sales were flat while analysts expected a decline of 0.1%.\n\n&gt; #**STOCK SYMBOL:** KSS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=KSS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/KSS)**)\n\n*****\n\n&gt; **Uber** — The ride-sharing company acknowledged in a regulatory filing the coronavirus poses a material risk to its business in a regulatory filing. Uber mentioned the coronavirus five times in the filing, noting it could disrupt operations outside the U.S. Separately, an analyst at Needham put Uber in his “conviction list” as the coronavirus outbreak has “created a very attractive buying opportunity.”\n\n&gt; #**STOCK SYMBOL:** UBER\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=UBER&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/UBER)**)\n\n*****\n\n&gt; **AB InBev** — An analyst at Bank of America downgraded the beer-making giant to “neutral” from “buy,” citing “near term headwinds” such as lower earnings out of Brazil and the coronavirus outbreak.\n\n&gt; #**STOCK SYMBOL:** BUD\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BUD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BUD)**)\n\n*****\n\n&gt; **Advanced Micro Devices** — AMD was upgraded to “overweight” from “neutral” by an analyst at Piper Sandler who noted the broader market’s recent pullback “provides an attractive opportunity for long-term investors” who want to buy into the stock.\n\n&gt; #**STOCK SYMBOL:** AMD\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AMD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AMD)**)\n\n*****\n\n&gt; **Tesla** — The electric car maker was upgraded to “market outperform” from “market perform” by an analyst at JMP Securities. The analyst also issued a price target of $1,060 per share, which represents a 42.5% upside from Monday’s close of $743.62 per share. “Investors may find themselves with additional near-term opportunities to buy the stock as TSLA works through the first half of 2020 and the impact of COVID-19 becomes apparent,” the analyst said.\n\n&gt; #**STOCK SYMBOL:** TSLA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TSLA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TSLA)**)\n\n*****\n\n&gt; **Tilray** — Tilray tumbled more than 13% after the cannabis company reported quarterly revenue numbers that missed analysts’ expectations. The company posted sales of $46.9 million in the previous quarter. That’s below a Refinitiv estimate of $55.4 million. “We have faced industry challenges, but we remain committed to driving long-term value for our shareholders,” CEO Brendan Kennedy said in a statement.\n\n&gt; #**STOCK SYMBOL:** TLRY\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TLRY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TLRY)**)\n\n*****\n\n&gt; **Visa** — The credit card giant warned its second-quarter revenue growth could be about 2.5 to 3.5 percentage points below its previous guidance amid pressure from the coronavirus outbreak.\n\n&gt; #**STOCK SYMBOL:** V\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=V&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/V)**)\n\n*****\n\n&gt; **Microchip Technology** — The chipmaker’s stock dropped more than 1% after the company warned of flat sales for fiscal fourth quarter. “We see very weak demand in Asia, especially in China, driven by the COVID-19 fears, and customers returning to work at a slower pace than anticipated,” Microchip Technology said in a statement.\n\n&gt; #**STOCK SYMBOL:** MU\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=MU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/MU)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/smallstreetbets?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Tuesday, March 3rd, 2020! :)**",
        "subreddit": "smallstreetbets",
        "title": "Today's Stock Market News [Tuesday, March 3rd, 2020]",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/fcv62i/todays_stock_market_news_tuesday_march_3rd_2020/",
        "created": 1583273781.0
    }
]