[
    {
        "author": "codingprofessor",
        "created_utc": 1589524360,
        "id": "gk3xle",
        "num_comments": 74,
        "num_crossposts": 0,
        "selftext": "\\## **My history investing in college and my first month investing in February:**\n\nLearned about miners and blockchain validation with a chemical engineering friend before the rally.\n\n\\- Bought **XRP** at $.15 and $.25, sold at $3.28 (I valued at $4 or $5 dollars MAX in 10 years if blockchain found adoption)\n\n\\- Bought **AMD** after the rally at $11 because it was ridiculous how much cost efficiency they had introduced to the market to poor people like me unlike **NVIDIA** products which always seemed far removed and discouraged me.\n\n\\- I started with **Panasonic** because I had missed out on the window to invest in **Tesla** at 200-300 range. I believed **Panasonic** to be similar to **AMD's** relationship to **bitcoin**; while all eyes looked at the shiny object, I looked at the boring parts that built it.\n\n\\- The market crashed, so I DCA'd aggressively and controlled my emotions through out. I was more concerned with my performance to commitment rather than my returns at the time. I did well.\n\n\\- My investments in March 19 was **SQ** and **Lyft**\n\n\\## **My Strategy now that I have income**\n\n\\- I bought up to 5,000 dollars in stocks ranging from **FANUC** (industrial robotics) to **DENNYS** (logistics/real estate)\n\n\\- I trimmed down to $2,300 but will rapidly rebuild with a different approach:\n\n\\- I'm buying 1 stock in the company before making any further developments with. Following this, I will purchase ETFs in sectors that I **want** to see develop in the next 5-15 years. I will buy 1 stake into these ETFs and combine it with my 1 stock purchase to create the necessary offset.\n\n\\- For example, I bought 1 stock of **Texas Instruments**  for $109 followed by a purchase in **SOXX ETF** for semiconductors, which has the largest ETF allocation to **Texas Instruments.** I will apply similar logic to companies like **Facebook, Paypal,** etc.\n\n&amp;#x200B;\n\n\\- I do this \"1 chip\" start in multiple industries because I want to pick some arbitrary point in time but I have a lot of industries &amp; ecosystems that I would like to reasonably participate in. This will still cost a lot of money to start off with and buys me time to study company numbers and outlooks.\n\n&amp;#x200B;\n\n\\## **My current market sentiment**\n\n**-** I consider where you start on a graph as somewhat arbitrary and see the current market stability as somewhat of an exercise in game theory and rowing a boat throat a thick fog. I believe it's optimal to row cautiously forward and to not stay still. With cautious rowing, you'll be able to react appropriately if you are suddenly met by a waterfall or a path with clearer vision.\n\n&amp;#x200B;\n\n\\- I am **\\`*****BEARISH\\`*** on Amazon in the long term. I believe that slowly, but surely, the market will consume Amazon's hold on its markets. I don't believe Amazon will maintain the status quo on cloud computing due to the quality of its competitors. I absolutely LOVE **Google Cloud Platform** and utilize **Firebase real-time database** very often. **Microsoft** has made some extremely important acquisitions recently in **Github and NPM - that's enormous.**\n\n\\-  I have suspicions about **Amazon** will struggle internationally. I don't know if Amazon will penetrate China the way China does, or if it will succeed in locations south of Mexico against things like **Mercado Libre**\n\n\\- I have suspicions that tech platforms will soon integrate in a meaningful way with financials. As in, the virtualization of stores and forwarded payments in places like the **Facebook(Visa) Market Place, Twitter(Square) payment sending, Paypal(honey) &amp; Amazon purchasing, Gaming credits, etc.**\n\n**-** I am \\`**bullish**\\` on Facebook. Facebook is utterly invaluable and scales globally. The reason it's adopted in **Mexico**, for example, is because it's cheaper and faster than other services. They also service millions of developers with **React** and its growing development ecosystem. They provide a standardized marketting platform for small businesses on Instagram, Facebook, WhatsApp, and soon to be JIO. I would not be surprised if they soon enter the fintech sector.\n\n\\- I am \\`**bullish\\`** on **Paypal**. They are seemingly repeating their previous success by servicing large online commerce that are upgrading their systems. **Honey/Paypal** will scrape coupons for Amazon and force organizations like Visa to compete with  **real-time financial services**.\n\n&amp;#x200B;\n\n\\- I am **\\`bullish\\`** on cloud software and networking. I think **CDNs** and dedicated **services for Cybersecurity** will maintain. Sure Google provides these services but things like **Cloudflare** and **Fastly** have dedicated solutions to fast image processing, DDoS protection, and more that other platforms may not be able to **allocate their resources to**. **Cloudflare** has an enormous network, and **Fastly** provides a great system for you to enjoy content like **Reddit.** I think it's hard to miss the mark here - the highway of the internet is going to get faster and more assets will be maintained in the server's space - the ecosystem must grow with it.\n\n&amp;#x200B;\n\n\\- I am ***\\`EXTREMELY BEARISH***\\*\\*\\`\\*\\* on Beyond Meat. I've been vegetarian for 10 years. IT'S BAD. WE HAVE NOTHING ELSE TO BE EXCITED ABOUT AND WE'RE NOT USED TO HAVING ATTENTION. VEGETARIANS ARE LYING IF THEY SAY IT'S AMAZING. ***IT'S LITERALLY DOG FOOD***\n\n&amp;#x200B;\n\n\\- I am \\`**BULLISH\\`** on the long term development of **Mexico**. I think companies like **Kansas City Southern** that services **Mexican-American** relationships will grow well in the long run.\n\n\\- I am **\\`BULLISH\\`**  on Apple and Adobe. Amazing products.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\## **CURRENT HOLDINGS (ordered by priority &amp; checkup time):**\n\n&amp;#x200B;\n\n**GOOG &amp; AMZN exposure through tech ETFs** ::: priority FB\n\n**NVIDIA, AMD, Intel EXPOSURE through semiconductor ETFS** ::: priority Texas Instruments\n\n**Environmental Services exposure through Sanitation ETFS** ::: priority Waste Management\n\n**Adobe and AutoDesk exposure through cloud software ETFs** :: priority Adobe\n\n**Nintendo exposure through gaming ETFS ::** priority Nintendo\n\n**Cisco exposure through cloud networking and edge computing ETFS** Cicsco, Fastly, Cloudflare, etc\n\n**TELECOM networking ETFS** :: priority TMobile\n\n**Manufacturing technology, industrial sectors, and robotics exposure to**  Fanuc, ABB, Siemens, Sherwin-Williams, VW, GM, Nissan, Toyota, Panasonic,\n\n**Healthcare services ETF** :: priority Cigna\n\n**FB -- LONG**\n\n**PAYPAL --  LONG**\n\n**TEXAS INSTRUMENTS - LONG**\n\n**MSFT     --  LONG**\n\n**APPLE   --  LONG**\n\n**ADOBE -- LONG**\n\n**DISNEY -  LONG**\n\n**BITCOIN - LONG**\n\n**TMOBILE - 2 YEARS**\n\n**VISA -- 2 YEARS**\n\n**JPM - 2 YEARS**\n\n**TWITTER - 2 YEARS**\n\n**SQUARE - 1 YEAR**\n\n**LYFT - 1 YEAR**\n\n**FASTLY - QUARTERLY**\n\n**CLOUDFLARE - QUARTERLY**\n\n**1LIFE MEDICAL - QUARTERLY**\n\n**FIVERR - QUARTERLY**\n\n**DRAFT KING - QUARTERLY YEAR + CHICAGO POLITICS**\n\n**GROUPON - SPARE CHANGE JAR**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**## EXCITED TO ACQUIRE**\n\n**- ADOBE**\n\n\\- **QQQ**\n\n\\- **SHERWIN WILLIAMS**\n\n\\- **TOYOTA**\n\n\\- **KANSAS CITY SOUTHERN**\n\n\\-",
        "subreddit": "investing",
        "title": "I started my career in November and investing February 5th, 2020 - my strategy as a once peasant Mexican",
        "url": "https://www.reddit.com/r/investing/comments/gk3xle/i_started_my_career_in_november_and_investing/",
        "created": 1589553160.0
    },
    {
        "author": "RR_Davidson",
        "created_utc": 1588703371,
        "id": "ge389v",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "**\\[Source: Invezz found via Beeken io\\]**\n\nThe upcoming transition from 4G to 5G is likely to initiate a new vibration in the tech industry. In the same way that a transition to 4G opened up space for the emergence of smartphones, mobile commerce, and mobile banking, the introduction of 5G network is expected to usher the next wave of technological advancements.\n\n&amp;#x200B;\n\n**QCOM: Qualcomm**\n\nQualcomm has an agreement with Apple to produce 5G chips for the iPhone-maker until at least 2023. Apple is expected to rollout its new 5G-enabled smartphone later this year, which should also include Qualcomm’s Snapdragon X55 5G chip. \n\nTherefore, supplying Apple – which sold 72.9 million iPhones in the fourth quarter last year – with 5G chips should enable Qualcomm with enough revenue to continue investing in the 5G network. \n\n&amp;#x200B;\n\n**MRVL: Marvell**\n\nMarvell has been on a roll recently, striking a contract with Samsung to provide chips to power LTE and 5G base stations. Moreover, the California-based company was chosen by Nokia to help the Finnish telecom giant to solve its 5G chip problems.\n\nShares of Marvell are trading around 10% off the 2020 highs, with technicals aligning for a potential move to $32 later this year, a 24.5% premium on the current market price.\n\n&amp;#x200B;\n\n**TXN: Texas Instruments**\n\nAs a major player in the semiconductor industry, Texas Instruments is another company expected to benefit from an uptick in demand for chips it produces. \n\nTexas Instruments reported stronger-than-expected financial results for the first quarter, with revenues for the second quarter seen in the region of $3 billion. \n\n&amp;#x200B;\n\n**SWKS: Skyworks**\n\nSkyworks is one of the most prominent suppliers for Apple with nearly 50% of annual revenues coming from the iPhone producer. \n\n“I think the technologies that we’re working on in our ecosystem with partners like Verizon and infrastructure players and even the Chinese, we’re all coming together to make this work, but it’s a real indication of how necessary these applications are to the economy,” said Skyworks Solutions CEO Liam Griffin.\n\nThe tech giant also produces turnkey engines that are seen as a critical element of the wireless infrastructure.\n\nAfter a deep pullback in March, shares of Skyworks have since rebounded nearly 50%, trading above the $100 mark once again.\n\n&amp;#x200B;\n\n**My thoughts**\n\nQCOM for me seems like the safest bet. Texas Instruments looks really interesting as well. \n\n&amp;#x200B;\n\n**Which do you fancy?**",
        "subreddit": "investing",
        "title": "Best 5G stocks to buy right now",
        "url": "https://www.reddit.com/r/investing/comments/ge389v/best_5g_stocks_to_buy_right_now/",
        "created": 1588732171.0
    },
    {
        "author": "WYBJO",
        "created_utc": 1588345795,
        "id": "gbjuhd",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": " MPWR stock is too good. MPWR was 10% over all time high, even after yesterday's dip. Their stock price is an anomaly in their sector: $SOXX is up 30% from the march drop, still below february highs. MPRWs larger competitors like Analog devices($ADI), Texas Instruments($TXN), ON semiconductor(ON), and Intel show similar gains. This makes sense: these companies make fundamental manufacturing parts and are sensitive to weak global manufacturing and trade. So what makes MPWR so special? What do they do?\n\n90+% of MPWR's business is the design and sale of DC power supply/power converter chips, the rest is similar derived devices like motor drivers and power sensors. They do not actually manufacture chips themselves, instead contracting to semiconductor foundries. The vast majority of their customers are manufacturers of integrated circuits, mostly in china. This risk profile is common in the segment, but it does leave them exposed to China specific market forces like tariffs, quarantines.\n\nTheir product is so universal to electronic devices that they have a very broad customer base in consumer electronics, industrial automation,  automotive, computing and telecom infrastructure. This has insulated them from some of the cyclic boom-bust patterns of the sector, and historically MPWR's performance is consistently better than the semiconductor ETFs $SOXX.\n\nMPWRs recent history shows some decent management moves. 2018 was a banner year for MPWR. They posted 61% year over year profit growth and their stock price mostly traded sideways for the year. They invested heavily until q4 2019 tanked the sector. They were smart enough to see the contraction coming and were able to eke out 1% profit growth through investment returns and executive pay structure deferments. A better than expected Q1 earnings report helped kick them up over 200$.\n\nSo there's stuff to like. Seems like a good buy in the 150-160 range.nce it comes down, and I think it will come down, here's why:\n\nThe most basic indicators are wrong: P/E ratio is 83. This is 4x higher than typical for the sector, 2x higher than is normal for their closest competitors during the best times. Market analysts are not recommending this stock, it's not being pumped on twitter. MPWR stock looked pretty normal until the second week of april until april 9:\n\nAround April 9-10 MPWR begins to diverge from competitor $POSI after a press release announcing they built a ventilator gets picked up by a few news aggregators. I encourage you to go look at this ventilator:\n\nhttps://www.monolithicpower.com/en/mps-open-source-ventilator\n\nThis is not a remotely viable product. It doesn't even offer practical improvements on the open source ventilator it's based on. It's a medium quality arduino project put together using spare parts, lithium batteries, and MPWR off-the shelf hardware. To me this suggests MPWR has engineers and marketing staff short for paying work.\n\nYou have likely noticed ads/speculation/spam about making money from 5G networks and internet infrastructure. After the ventilator story brought attention to MPWR I expect unfamiliar traders began investigating and found MPWR's marketing materials about these products. MPWR makes almost all of its money from 5 markets:\n\n1) Computer/server gear at roughly 30% of their business\n\n2) Consumer Electronics at 25% of their business\n\n3) Industrial/Commercial Devices 15%\n\n4) Embedded Automotive Devices 15%\n\n5) Infrastructure to consumer scale Telecommunications gear, 15%\n\nNone of their markets are in great shape.\n\nComputer and semiconductor markets are projected to shrink this year, even with some cloud growth.  Unemployment is hurting consumer spending and with that Auto/Consumer electronics spending will shrink.  Telecommunications infrastructure spending could grow this year but broad 5g rollout is scheduled at least a year out. Industrial products might have opportunities with new customers who don't already know who they are, but a locked down sales force and the lack of variety in their product development are bad signs: their sales teams will be less effective globally and I don't expect viable new products from their engineering team.\n\nWithout good new revenue lines they'll need to cut costs. Signs point to them being fucked here. They bought a new US facility shortly before the crash/shelter in place. They purchase their silicon wafers in yearly installments based on sales projections, so inventory costs are locked in. They have an abysmal 1.94 inventory turnover ratio. Maybe this is secretly good: sucking that bad suggests ample room for supply chain improvements.\n\nFinally, their  Q1 earnings which kicked the stock to record highs might not be a good indicator of their health during that quarter. Earnings transcripts describe their sales are long cycle collaborations with oems, with orders taking 8-16 weeks to fulfill. With lead times that long new bookings could have dropped 90% during the end of Q1 and the signal wouldn't show up until next quarter.\n\nAlso: an aside: breathing equipment is a saturated and losing game. Thousands of people are working on solutions, but they won't beat the existing ventilator manufacturers. They are competing with tested, regulatory approved products manufactured with purpose built tooling and process. These companies have already multiplied their throughput with quick purchases of tooling and wiped out the supply of valves, instrumentation and raw materials needed to make that gear. The flattening of infection curves points to less gear being needed than was thought. Look for profits in suppliers of these raw parts.($PH)",
        "subreddit": "wallstreetbets",
        "title": "MPWR is beyond overpriced.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gbjuhd/mpwr_is_beyond_overpriced/",
        "created": 1588374595.0
    }
]