[
    {
        "author": "oranguthang87",
        "created_utc": 1579614121,
        "id": "eruuh8",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": " \n\n* Needham raised the price target for **Lam Research Corporation** (NASDAQ: LRCX) from $280 to $325. Lam Research shares closed at $308.00 on Friday.\n* KeyBanc boosted the price target for **Intuit Inc.** (NASDAQ: INTU) from $305 to $320. Intuit shares closed at $282.85 on Friday.\n* Goldman Sachs lifted **Ping Identity Holding Corp** (NYSE: PING) price target from $24 to $27. Ping Identity closed at $25.65 on Friday.\n* Jefferies cut **Liberty Global PLC** (NASDAQ: LBTYA) price target from $33 to $23. Liberty Global shares closed at $21.15 on Friday.\n* Credit Suisse lowered the price target for **U.S. Bancorp** (NYSE: USB) from $55 to $52. U.S. Bancorp closed at $55.35 on Friday.\n* Goldman Sachs lifted the price target on **RingCentral Inc** (NYSE: RNG) from $189 to $230. RingCentral closed at $192.89 on Friday.\n* JP Morgan boosted the price target for **TE Connectivity Ltd** (NYSE: TEL) from $98 to $117. TE Connectivity shares closed at $100.18 on Friday.\n* Daiwa Capital raised the price target on **Caterpillar Inc.**(NYSE: CAT) from $143 to $165. Caterpillar closed at $147.78 on Friday.\n* KeyBanc raised **Shopify Inc** (NYSE: SHOP) price target from $385 to $485. Shopify shares closed at $454.88 on Friday.\n* Needham raised the price target for **ACM Research Inc** (NASDAQ: ACMR) from $20 to $40. ACM Research shares closed at $36.09 on Friday.",
        "subreddit": "wallstreetbets",
        "title": "10 Biggest Price Target Changes For Tuesday",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eruuh8/10_biggest_price_target_changes_for_tuesday/",
        "created": 1579642921.0
    },
    {
        "author": "TheJerdAbides",
        "created_utc": 1579826599,
        "id": "et2ia5",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Robinhood, everyone's favorite brokerage, has just announced a partnership with INTU's turbo tax app at $20 off. \n\nAnd if people are autistic enough to use RH, they'll be autistic enough to use a TurboTax deal. \n\nNow go get some tendies. 6/19 $300 calls.\n\nLet's gooooooo gents.",
        "subreddit": "wallstreetbets",
        "title": "Long INTU",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/et2ia5/long_intu/",
        "created": 1579855399.0
    },
    {
        "author": "diabeticspecimen",
        "created_utc": 1579128498,
        "id": "ep9wj3",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Good Afternoon r/stocks\n\nThis is my first time suggesting a stock to buy and hold, and plan to do more in the near future.\n\nI've owned this stock for a couple months now and has been growing (and will continue to) very well!\n\nPING IDENTITY $PING\n\nThey are a software company who recently IPO'ed in Sept. 2019 that provides intelligent identity access for companies and customers. By doing so, they can easily and safely connect to their cloud, SaaS, and APIs. Their platform contains single sign-on, multi-factor authentication, data governance, directory, access security, and intelligent security that uses artificial intelligence to block cyberattacks. Their economic MOAT is that companies can easily integrate Ping into their existing infrastructure and their keen ability to use artificial intelligence to block cyberattacks that would affect a whole company sets them apart from competition. Ping Identity's main goal is to \"prevent security breaches, increase employee and partner productivity and provide personalized customer experiences.\" \n\nReasons why I like this stock is because \n\n-Showing positive growth with the company as a whole. Their first earnings call as a publicly traded stock which was Q3 2019 reported an EPS of .13 over the expected .04, beating expectations by 255%\n\n-Trusted and supplying to over 50% of the Fortune 100 with companies like Canon, Chevron, HP, Intuit, and Netflix\n\n-Certified Minority Business Enterprise (MBE) \n\n-A 2018 article from Business Wire stated that, \"With a focus on driving customer experiences, HP selected the Ping Identity platform deployed in Amazon Web Services (AWS). This achieved its goal of instituting a single and highly secure identity and access management (IAM) platform across its entire global customer and partner-facing platform. The HP ID platform is used by more than 100 business applications, and enables single sign-on for over 150 million customer and partner identities across the world, plus thousands more being added each day. \n\nHP Product Manager Jared Meier sums up the success of HP ID, “Ping’s customer IAM platform provides performance and scalability that can keep pace with HP’s continued innovation and growth. Now, customers have a seamless experience when they authenticate across our digital properties.”\n\nWith that said, Ping Identity's ability to partner and have success with top companies around the United States is an indication that there is a great future for them going forward.",
        "subreddit": "stocks",
        "title": "One of My Top Emerging Stocks Going Into 2020",
        "url": "https://www.reddit.com/r/stocks/comments/ep9wj3/one_of_my_top_emerging_stocks_going_into_2020/",
        "created": 1579157298.0
    }
]