[
    {
        "author": "thewedding_singer",
        "created_utc": 1591894060,
        "id": "h12yrn",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Edit: EV meaning Electric Vehicles in this case \n\nWould love to get some discussion going on some players in the EV industry that would be solid holds for a long period of time.  I personally see this industry being the way of the future and I’m looking to get into some companies now and hold potentially for decades.  Any company dealing with manufacturing, batteries, tech chips, components, service, lithium mining, let’s list them here.\n\nHere are some tickers on my watch list now, I would love to hear some of the subs other recommendations and thoughts.\n\n$MXIM\n\n$TSLA\n\n$NVDA\n\n$NXPI\n\n$PCRFY\n\n$LIT\n\n$NIO\n\n$TEL\n\n$BWA\n\n$APTV\n\n$ALB",
        "subreddit": "investing",
        "title": "Looking for some LONG term EV plays - talking years long holds, no penny stocks or swing trades.",
        "url": "https://www.reddit.com/r/investing/comments/h12yrn/looking_for_some_long_term_ev_plays_talking_years/",
        "created": 1591922860.0
    },
    {
        "author": "bruinsmashabs",
        "created_utc": 1593013862,
        "id": "hf3erx",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "correct me if i am wrong\n\nwasn’t the exercise price on KTOVW .40 ?\n\nnew offering says .90\n\nare people locked in at .40 that got in last week or is that bumped to .90 now? 🤢\n\n**i am talking about the warrants. W=WARRANTS**\n_____________________________________\n\n* \nTEL-AVIV, Israel, June 23, 2020 (GLOBE NEWSWIRE) -- Kitov Pharma Ltd. (“Kitov”) (NASDAQ/TASE: KTOV), a clinical-stage company advancing first-in-class therapies to overcome tumor immune evasion and drug resistance, today announced that it has entered into definitive agreements with several healthcare-focused institutional investors for the purchase and sale of 38,888,892 of the Company’s ordinary shares represented by American Depositary Shares (ADSs) and warrants to purchase up to an aggregate of 19,444,446 ADSs, at a combined purchase price of $0.90 per ADS and associated warrant, in a registered direct offering, for aggregate gross proceeds of approximately $35.0 million. Each ADS represents one ordinary share, no par value, of Kitov. \n\nThe offering is expected to close on or about June 25, 2020, subject to satisfaction of customary closing conditions.\nH.C. Wainwright &amp;amp; Co. is acting as the exclusive placement agent for the offering.\n\nThe warrants will have an exercise price of $0.90 per ADS and will be exercisable at any time upon issuance and will expire five years from the date of issuance.",
        "subreddit": "pennystocks",
        "title": "? on KTOVW, price change w/ new offering?",
        "url": "https://www.reddit.com/r/pennystocks/comments/hf3erx/on_ktovw_price_change_w_new_offering/",
        "created": 1593042662.0
    },
    {
        "author": "ShantaeHopton",
        "created_utc": 1591623130,
        "id": "gyzdyj",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": " [https://www.newsfilecorp.com/release/57430/Human-Unitec-International-Finalizes-NonDilutive-Acquisition-of-Arquata-Logistics-Services-in-Europe-Adding-Approximately-2.1-Million-USD-in-Annual-Revenues](https://www.newsfilecorp.com/release/57430/Human-Unitec-International-Finalizes-NonDilutive-Acquisition-of-Arquata-Logistics-Services-in-Europe-Adding-Approximately-2.1-Million-USD-in-Annual-Revenues) \n\n Boston, Massachusetts--(Newsfile Corp. - June 8, 2020) - Human Unitec International (OTC PINK: HMNU) (\"HMNU\" or \"The Company\") is pleased to announce that after 12 months of co-management with the sales partners and its corresponding group, it has finalized the acquisition of one of the fastest growing logistics company in Southern Europe, Arquata Logistics Services S.R.L. HMNU has acquired 60% of Arquata Logistics and all of its assets, for cash and exchange of assets. The Company previously had issued stock in 2017 which was allocated to the principals of Arquata Logistics. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/n6oynpz3vo351.png?width=200&amp;format=png&amp;auto=webp&amp;s=514e5e98399c8dd2e9b2b62b411b0b0692d7b389\n\n \n\nArquata has been on an upward trajectory for logistics services under the guidance of a team of proven professionals, whom have over thirty years of experience in the shipping and logistics sector. Arquata has specialized in the assessment and impact of the supply chain and its importance to customers. Thanks to several key partnerships, Arquata has a logistics area based in Castelnuovo Scrivia, where it organizes and manages between 100,000 to 160,000 sq ft of warehouses with an additional 100,000 sq ft dedicated to industrial packaging. ([https://www.arquatalogisticservices.com](https://www.newsfilecorp.com/redirect/EooacwVX))\n\n\"We are extremely excited about the acquisition for Arquata Logistics. I would like to confirm that this is a non-dilutive acquisition that will be completed for existing restricted stock,\" stated Fabrizio Bosticco, President of Human Unitec International. \"It has been one of the fastest growing logistics companies in the Mediterranean and accomplished 1.87 Million Euros (approx. $2.12 million USD) in official income for 2019. We believe with the strategic relationships and upcoming joint ventures Arquata has, this will add several more millions in income over the next several years.\"\n\nMr. Bosticco, continued \"this acquisition continues to build our portfolio in industries that will continue to grow in the future. As we continue to diversify, we will begin benefitting other areas of our business. For instance, we can use the 65,000 additional warehouse space in Capriata D'Orba to centralize the MSK Medical division and its inventory that will reduce overhead and operational costs, and further increase quality, service, while maximizing shareholder value and increasing our bottom line.\"\n\nAbout HMNU:\n\nHUMAN UNITEC INTERNATIONAL, INC. (HMNU) is a project finance, development, and asset management corporation, focused on medical and green energy projects, trading on Nasdaq OTC since 2009.HMNU owns and controls 100% of the assets and intellectual property acquired from MSK KINESIS CORP. (medical and wellness devices, exclusive commercial licence for Life science natural wellness products). 100% ENERGY SELCO SRL (Owner of large Romanian wind energy real estate assets with licenses and permits to build and operate up to 73 GW of wind energy).100% GRONE Technology (Intellectual Rights to waste management technologies). ECOSMART Tecnology (revolutionary device for carbon emission reduction. The device is able to reclassify Euro1 and Euro 2 vehicles into Euro 4 and Euro 5 class vehicles and reduce consumption of gas and diesel). Land in Tocco di Casauria (PS) with rural real estate, classified to optain permits and licenses to build 3GW of wind energy. Since 2017 HMNU has been supporting the MSK Kinesis Foundation operating with ESANGO, at the UN in New York for the health human rights of abused women. The foundation counts two missions in Congo and Liberia where almost 950 people have been assisted with MSK Kinesis medical equipment.\n\nCopyright May 2020 © Human Unitec International\n\n6 LIBERTY SQUARE, #2328 BOSTON, MA 02109\n\nTel: +1-917-821-9585 Fax: +1-857-350-3447\n\nEmail: [Hmnu@gmail.com](mailto:Hmnu@gmail.com)  \n[https://twitter.com/HMNU\\_1](https://www.newsfilecorp.com/redirect/xaaqUvnp)  \n[www.hmnuinc.com](https://www.newsfilecorp.com/redirect/7rr2fVyb)",
        "subreddit": "pennystocks",
        "title": "Human Unitec International Finalizes Non-Dilutive Acquisition of Arquata Logistics Services in Europe Adding Approximately $2.1 Million USD in Annual Revenues",
        "url": "https://www.reddit.com/r/pennystocks/comments/gyzdyj/human_unitec_international_finalizes_nondilutive/",
        "created": 1591651930.0
    },
    {
        "author": "yasinradif",
        "created_utc": 1591081274,
        "id": "gv2fy8",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "If I make profit on KTOV, how does my taxation work since this is foreign company based out of Tel Aviv.\n\nWould I be double taxed by U.S. and Tel Aviv ?",
        "subreddit": "investing",
        "title": "Taxes on KTOV",
        "url": "https://www.reddit.com/r/investing/comments/gv2fy8/taxes_on_ktov/",
        "created": 1591110074.0
    },
    {
        "author": "SqueezeTheShort",
        "created_utc": 1592956351,
        "id": "heq243",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Someone posted this and i looked for an answer on google and cant find anything. This makes no sense to me....",
        "subreddit": "stocks",
        "title": "Why is $KTOV selling for the equivalent of $107 USD on the Tel Aviv exchanges?",
        "url": "https://www.reddit.com/r/stocks/comments/heq243/why_is_ktov_selling_for_the_equivalent_of_107_usd/",
        "created": 1592985151.0
    },
    {
        "author": "LimeHeadHead",
        "created_utc": 1592831881,
        "id": "hds6f3",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "RobinHoodPennyStocks",
        "title": "How do I see actual prices when looking at stock graphs ... without numbers this chart doesn’t tel me much.",
        "url": "https://i.redd.it/fvnvmucgpg651.jpg",
        "created": 1592860681.0
    },
    {
        "author": "DavidBoyer",
        "created_utc": 1591711540,
        "id": "gznslb",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " [https://finance.yahoo.com/news/glory-star-media-group-holdings-120010570.html](https://finance.yahoo.com/news/glory-star-media-group-holdings-120010570.html) \n\n BEIJING, June 09, 2020 (GLOBE NEWSWIRE) -- Glory Star New Media Group Holdings Limited ([GSMG](https://finance.yahoo.com/q?s=gsmg)) (“Glory Star” or the “Company”), a leading mobile and online digital media and entertainment company in China, today announced that it has successfully completed content production programs for multiple international luxury brands, including Fendi, Prada, Gucci, and Burberry. \n\n \n\nAccording to the Luxury Goods Worldwide Market Study, Fall-Winter 2019 report produced by Bain &amp; Company, the worldwide demand for luxury goods continued to grow in 2019, which resulted in a global industry worth approximately €281 billion as of the end of the year. Currently, China has begun to lead the way toward recovery from the COVID-19 pandemic, and Chinese consumers are set to cement their status as crucial growth drivers for the industry going forward. According to Bain &amp; Company’s Luxury Study 2020 Spring Update released in May 2020, Chinese consumers are expected to account for approximately 50% of the total global market for luxury goods in 2025 compared to 35% in 2019. Based on data from data for the 2019 McKinsey China Luxury Report, the growth of China’s luxury spending will be primarily driven by a significant uptick of upper-middle-class households. The total number of China’s upper-middle-class households is expected to reach 350 million by 2025 with a compound annual growth rate of 28% from 2018 to 2025.\n\nAs part of Glory Star’s content production strategies with international luxury brands, Glory Star will leverage its award-winning lifestyle content production services and social media platforms to help expand the online presence of these brands in China. Glory Star will also utilize the leading traffic conversion capabilities and extensive content library of its CHEERS app to enable luxury brands to better penetrate China’s emerging luxury market more effectively.\n\nMr. Bing Zhang, Chairman and Chief Executive Officer of Glory Star, commented, “We are excited to work with such internationally renowned luxury brands. These working relationships will allow us to further solidify our leadership as a premium content provider in the high-end segment of the luxury e-commerce market. Meanwhile, our access to world-class brands and expanding library of custom content will further boost user retention, user engagement, and user stickiness on our platform. Looking ahead, we are confident that these working relationships will make meaningful contributions to our business expansion efforts as we advance through the rest of 2020 and beyond.”\n\n**About Glory Star New Media Group Holdings Limited**\n\nGlory Star New Media Group Holdings Limited is a leading mobile entertainment operator in China. Glory Star’s ability to integrate premium lifestyle content, including short videos, online variety shows, online dramas, live streaming, its Cheers lifestyle video series, e-Mall, and mobile app, along with innovative e-commerce offerings on its platform enables it to pursue its mission of enriching people’s lives. The company’s large and active user base creates valuable engagement opportunities with consumers and enhances platform stickiness with thousands of domestic and international brands.\n\n**Safe Harbor Statement**\n\nCertain statements made in this release are “forward looking statements” within the meaning of the “safe harbor” provisions of the United States Private Securities Litigation Reform Act of 1995. When used in this press release, the words “estimates,” “projected,” “expects,” “anticipates,” “forecasts,” “plans,” “intends,” “believes,” “seeks,” “may,” “will,” “should,” “future,” “propose” and variations of these words or similar expressions (or the negative versions of such words or expressions) are intended to identify forward-looking statements. These forward-looking statements are not guarantees of future performance, conditions or results, and involve a number of known and unknown risks, uncertainties, assumptions and other important factors, many of which are outside the Company’s control, that could cause actual results or outcomes to differ materially from those discussed in the forward-looking statements. Important factors, among others, are: the ability to manage growth; ability to identify and integrate other future acquisitions; ability to obtain additional financing in the future to fund capital expenditures; fluctuations in general economic and business conditions; costs or other factors adversely affecting our profitability; litigation involving patents, intellectual property, and other matters; potential changes in the legislative and regulatory environment; a pandemic or epidemic; and other factors listed in the Company’s Annual Report on Form 10-K for the year ending December 31, 2019 and in other filings made by the Company with the Securities and Exchange Commission from time to time. The Company undertakes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by applicable law. Such information speaks only as of the date of this release.\n\n **Contacts**  \nICR Inc.  \nJack Wang  \nTel: +1 (646) 308-0546  \nEmail: [gsnm@icrinc.com](https://www.globenewswire.com/Tracker?data=bc9i1zeyr1gEW_fZyLmCpJ6eUlRM0jx5T78ftV0bzmmBm8j-w63GZZPV3LtRsFmt7FBU_l0QZdQkI1AGCpoAQg==)",
        "subreddit": "pennystocks",
        "title": "Glory Star New Media Group Holdings Limited Completes Content Production Programs for Multiple International Luxury Brands",
        "url": "https://www.reddit.com/r/pennystocks/comments/gznslb/glory_star_new_media_group_holdings_limited/",
        "created": 1591740340.0
    }
]