[
    {
        "author": "Wild_Cat_Cory",
        "created_utc": 1578695049,
        "id": "emya47",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I’ve only been dabbling in invest for the past 12mths, and obviously with all the recession talk, China trade deal etc, I think everyone is a little nervous.\n\nBut ultimately I believe the world is becoming more of a cashless society, and it’s so easy with mobile payments etc, I believe it’s inevitable that this whole sector will sky rocket.\n\nI currently have positions in V , PYPL , SQ and taking more of a gamble on PAYS.\n\nI’m looking for thoughts on  taking my positions in the above stocks noted, and investing in the IPAY ETF which would give me coverage on those stocks plus others like M, AXP, GPN, FIS, FISV, DFS and a few more?,\nOr Keep my individual stocks and add to my portfolio like M , GPN etc when or if they ever have a dip?\n\nAnd help would be greatly appreciated, cheers",
        "subreddit": "stocks",
        "title": "IPAY ETF or Individual Stocks?",
        "url": "https://www.reddit.com/r/stocks/comments/emya47/ipay_etf_or_individual_stocks/",
        "created": 1578723849.0
    },
    {
        "author": "Noctumn",
        "created_utc": 1579297386,
        "id": "eq70fv",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "With earnings coming up on or around 2/12 this is one to watch. I've been in and out of this stock since it was $128 about a year ago. Great product and conservative targets this past year- which may mean great results at earnings. \n\nI currently hold several contracts for the 2/21 expiry and just cashed out of my 1/17 contracts with 100% gains since purchase on the 10th.",
        "subreddit": "options",
        "title": "$GPN Look out for this one",
        "url": "https://www.reddit.com/r/options/comments/eq70fv/gpn_look_out_for_this_one/",
        "created": 1579326186.0
    },
    {
        "author": "n0pen0tme",
        "created_utc": 1579526174,
        "id": "erd2is",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "[https://www.theregister.co.uk/2020/01/20/intel\\_hpe\\_xeon\\_shortage/](https://www.theregister.co.uk/2020/01/20/intel_hpe_xeon_shortage/)\n\nSo... Intel can't deliver enough CPUs to HP and others... \n\nIt seems like more manufactures are now offering AMD Epyc as an alternative and Zen3-based Epyc is around the corner.\n\nlong AMD, short Intel?",
        "subreddit": "wallstreetbets",
        "title": "Intel server chip shortages continue to bite: HPE warns of Xeon processor supply drought for the whole of 2020",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/erd2is/intel_server_chip_shortages_continue_to_bite_hpe/",
        "created": 1579554974.0
    }
]