[
    {
        "author": "crazypants003",
        "created_utc": 1598470073,
        "id": "ih5kdi",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "My family and I are all in business together. We are looking to invest a pretty decent amount of money. I’ve been looking at Vanguard funds and I’m comfortable moving into some large, mid, small cap funds, one that tracks the S&amp;P 500 and one aimed a dividends. \n\nMy dad prefers to invest through the bank and we have a guy that would help us place our money into various investments.\n\nHere is where we clash, I love vanguards low fees and I hate the idea of paying the fees our advisor charges (1 to 2%) a year (He is a fiduciary). Vanguard is way lower. Our advisor mentioned how he helps manage where our money is placed especially when times are bad. But his proposal looks like a general diversified portfolio. I just can’t justify paying him for that. I’m trying to tel my dad we can invest in the same type of funds with vanguard, with the advantage of way lower fees. He’s worried that we won’t have someone to tell us if we should move from one fund to a different fund. But my thinking is our financial advisor isn’t going to tel us to move money either, as we are investing more aggressively for the long long term. I guess I believe the financial advisor promotes himself as being more active than he actually is and he’s not worth it.  \n\nAm I crazy? I need some perspective on this. Much appreciated.",
        "subreddit": "investing",
        "title": "Is it unsafe to invest large amounts of money without a representative",
        "url": "https://www.reddit.com/r/investing/comments/ih5kdi/is_it_unsafe_to_invest_large_amounts_of_money/",
        "created": 1598498873.0
    },
    {
        "author": "gms2912",
        "created_utc": 1597846325,
        "id": "icod8o",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "“On Tuesday, Tennessee Education Lottery (TEL) CEO Rebecca Hargrove said it is aiming to launch the state’s sports betting market by 1 November at the latest.\n\nThis means that Tennessee residents will be able to legally bet on sports during the upcoming football season.\n\nSports betting became legal in Tennessee in May 2019 and since then, Colorado, Illinois, Iowa, Michigan, Montana and New Hampshire all managed to legalise and launch their sports betting markets.\n\nLicensing updates\n\nDuring Tuesday’s Sports Wagering Advisory Council meeting, Hargrove revealed that four operators and approximately 20 vendors and suppliers have applied for licenses.  The names of the operators were not disclosed; however, media sources say that BetMGM, DraftKings and FanDuel have applied for a license. The fourth company is Tennessee Action 24/7, a local Tennessee company that offers free-to-play games.\n\nOn Tennessee Action 24/7’s website, a message says that the TEL is “currently processing our Sports Gaming Operator license application.”\n\nIn its latest quarterly report, MGM resorts revealed that it currently has market access and plans to launch sports betting operations in Tennessee later this year.\n\nOnline sports betting only\n\nUnlike other states with legal betting, Tennessee’s sports betting laws only permit online and mobile sports betting. Tennessee is the only state to legalise online-only sports wagering, which makes it an outlier in the wider US gambling market.”\n\nhttps://www.compare.bet/news/tennessee-sports-betting-to-go-live-on-1-november",
        "subreddit": "wallstreetbets",
        "title": "Tennessee sports betting to go live on 1 November",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/icod8o/tennessee_sports_betting_to_go_live_on_1_november/",
        "created": 1597875125.0
    },
    {
        "author": "BrandonMarcoux",
        "created_utc": 1597419669,
        "id": "i9o90t",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Thank you to anyone who can tel me",
        "subreddit": "pennystocks",
        "title": "When is BKYI’s earnings announcement?",
        "url": "https://www.reddit.com/r/pennystocks/comments/i9o90t/when_is_bkyis_earnings_announcement/",
        "created": 1597448469.0
    },
    {
        "author": "ericwilliam1788",
        "created_utc": 1597481810,
        "id": "ia43np",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Hey guys have a sort of question/clarification.\n\nCan someone tel me if it makes sense and what has been your experience in selling covered puts with strike prices where you normally have a stop loss. And what should i take into consideration.\n\nThanks!",
        "subreddit": "options",
        "title": "Question on Portfolio Management",
        "url": "https://www.reddit.com/r/options/comments/ia43np/question_on_portfolio_management/",
        "created": 1597510610.0
    },
    {
        "author": "BrandonMarcoux",
        "created_utc": 1597419669,
        "id": "i9o90t",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Thank you to anyone who can tel me",
        "subreddit": "pennystocks",
        "title": "When is BKYI’s earnings announcement?",
        "url": "https://www.reddit.com/r/pennystocks/comments/i9o90t/when_is_bkyis_earnings_announcement/",
        "created": 1597448469.0
    }
]