[
    {
        "author": "Warzeal",
        "created_utc": 1588342689,
        "id": "gbiwq3",
        "num_comments": 13,
        "num_crossposts": 1,
        "selftext": "Good afternoon fellow autists and retards,\n\nAs we are entering earnings season, many companies have started to release their Q1’2020 earnings and I believe the general consensus is that, they’re going to suck, because you know, Covid-19 happened. But what about the rest of 2020?\n\n**Q2’2020, Q3’2020 earnings and possibly Q4’2020 earnings**\n\nHere’s a few things I’m expecting regarding Q2’2020 and Q3’2020\n\nI’m expecting many balance sheets using aggressive accounting methods to be “cleaned out”. This means that companies will switch from using aggressive revenue recognition, having inflated assets value and deferring their expenses to subsequent periods to recognizing their revenue when the payment is received, recognizing their assets at historical cost, and expensing their charges when they occur. \n\nI believe they will use the Covid-19 pandemic as scapegoat to finally clean their balance sheet/income statements. But why now? Because earnings were going to suck anyways, might as well throw everything out right? You fucking bet. Expect a lot of non-cash charges (changes in accounting methods) and legacy costs which are costs incurred by a company in prior years under different leadership or when the entity's priorities and resources were different. Key words here: Different. Leadership. I believe newly appointed CEOs will the opportunity Covid-19 provides and throw everything out. They’re going to clean the closet. Skeletons are coming out boys and gals.\n\nCEOs: “We were used to defer charges to next quarter? Yeah, let’s not fucking do that anymore. Who cares, earnings were going to fucking suck anyways. Oh, and by the way, I’m not the one to blame for this, it was past management’s fault.”\n\n**Q1’2021 earnings**\n\nSo we know both Q2’2020, Q3’2020 and possibly Q4’2020 are going to suck ass. But what about Q1’2021 earnings tho? The exact opposite; they’re going to be gangbusters. Why? Because not only Y/Y they’re being compared to Q1’2020 which were pretty much non-existent, but all those legacy costs and accounting changes will be accounted for/priced in. And the new CEOs will look like godsend individuals. And the hammered companies will bounce back.\n\nKnowing this, here’s a list of newly appointed CEOs (2019 and 2020) :\n\n· IBM (IBM)                               · Disney (DIS)\n\n· Rite Aid (RAD)                        · Accenture (ACN)\n\n· Fox Corportation (FOX)        · Cognizant (CTSH)\n\n· HSBC (HSBC)                          · ViacomCBS (VIAB)\n\n· SAP (SAP)\n\n**TLDR:** Worse than expected earnings for the rest of the year for companies with newly appointed CEOs, and gangbusters in 2021.",
        "subreddit": "wallstreetbets",
        "title": "The Great Blame Game of 2020",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gbiwq3/the_great_blame_game_of_2020/",
        "created": 1588371489.0
    },
    {
        "author": "Kant_sleep13",
        "created_utc": 1588941913,
        "id": "gfsjnk",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "Good morning, here's my watch list\n\nGap Ups: CWH, DBX, GH, HLF, IHPI, PSTI, PVAC, QRVO, SPWR, UBER, VIVO, WORK\n\nGap Downs: MSI, ROKU, SHOP, TTD\n\nPossible 2nd day play: TWLO\n\nSPY slightly gapping up and continuing the slow grind, Resistance at the 200 day moving average overhead at 300, nearest support around the 50 day moving average at 272. Not many stocks moving pre market and the list is not the greatest. Some stocks gaping down but gapping into support, may have to run some scans intraday to find decent movers. Todays Friday so stay disciplined and only trade the best setups with defined risk to reward calculated before entering into any positions. Good luck, stay safe.\n\n&amp;#x200B;\n\nI am not holding any positions in the stocks listed above. The purpose of this list is to watch these stocks for opportunities to make trades during the trading session",
        "subreddit": "stocks",
        "title": "Stock watch List May 8, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/gfsjnk/stock_watch_list_may_8_2020/",
        "created": 1588970713.0
    },
    {
        "author": "whossayn",
        "created_utc": 1588753644,
        "id": "geg2ax",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "hey guys.. pretty high right now so bare with me\n\ni was doin some thinking. i’m a pretty optimistic guy and like to think a decent amount of businesses will still be around after covid. but then it hit me, it all hit me. car dealerships/car company’s that directly sell, are shit. but if possible, go for smaller ones that are shit. let me explain.\n\nnow this may be obvious, but i am here so i am obviously not mentally capable of realizing the obvious- but car dealerships are slimy as fuck.\n\ni’m a uni student, and i have people i went to high school with who started working as car salesman. i remember hearing them flex this really concerning deals on his “business” instagram, that got weirder and weirder \n\n“get a new nissan shitstopper without paying for the 15 weeks!” \n\n“ride this zero down payment 1997 motorola civic for only $10000!”\n\nthe worst, i remember, was \n\n“dont qualify for a loan? don’t worry about it! our  *u n i q u e* financing allows you to lease one of our cars without any credit score!” \n\ni remember feeling like i was in the big short when i read that- was he bragging about that?? was i missing something?? \n\nanyhow, 1+1 became fish the same way all of us melancholic gambling assholes came together, with ideas that could be pretty well made up by some lsd guy. anyway, what i’m trying to say is, while it’s obvious- jimmy over there with his brand new 2010 nissan shitstopper that he can’t afford, is gonna default on his payments. *Especially for any kind of businesses that don’t necessarily consider clients/customers as credit worthy* it’s important to note that we have been allowing some fucked up shit to go on, and i’ll ipo the local shady car salesman just so i can buy puts\n\nanyway, i am a little too faded to find these tickers, but yes, short the corrupt car salesman and car business guys. also, when you read 10ks, (i know you don’t but humour me), press CTRL+F and search credit worthy. you’d be surprised how businesses are required to disclose whether they’re lending to your slightly fucked up cousin or not\n\nalso making this a discussion tag so ppl don’t go “hey man. this isn’t dd” cause man, idk. \n\nok guys, it was fun.",
        "subreddit": "wallstreetbets",
        "title": "car salesman are shit guys fuck",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/geg2ax/car_salesman_are_shit_guys_fuck/",
        "created": 1588782444.0
    },
    {
        "author": "andyjanderson255",
        "created_utc": 1589158029,
        "id": "ghdfm8",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Hi, I'm a beginner and what's the best software to use with all available tools (bollinger/30 day MA/MSI/MACD etc.)\n\nThanks in advance.",
        "subreddit": "stocks",
        "title": "Best Software to Use?",
        "url": "https://www.reddit.com/r/stocks/comments/ghdfm8/best_software_to_use/",
        "created": 1589186829.0
    },
    {
        "author": "c47v3770",
        "created_utc": 1588953319,
        "id": "gfvpij",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Thoughts on Motorola for long term hold?",
        "url": "https://www.reddit.com/r/stocks/comments/gfvpij/thoughts_on_motorola_for_long_term_hold/",
        "created": 1588982119.0
    },
    {
        "author": "SynFisa",
        "created_utc": 1588727611,
        "id": "geafjr",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "I've been a long time customer of Vanguard, and i've been trying to find an alternative. I don't feel the security at Vanguard is up to modern standards. They require/fall back to SMS for two factor authentication, which isn't really secure at all. And almost worse, to do a Wire i need to call them (inconvenient) and their only security is an SMS to my account. No password needed even, pretty insane. Was already turning a blind eye to SMS for too long, and then once i realized how poor the security was for wiring large amounts of money, i was pretty rattled. \n\n&amp;#x200B;\n\nI looked at some others like Fidelity and I don't really like their options. They require Symantec VIP for 2FA (much rather use traditional tokens like Authy). Saw reports of various companies that use Symantec VIP that just allow you to call to reset your account in case you lost the device the Symantec VIP app is on. \n\n&amp;#x200B;\n\nAre there any more modern companies that handle this stuff better?",
        "subreddit": "investing",
        "title": "Looking for Vanguard alternative (poor security options)",
        "url": "https://www.reddit.com/r/investing/comments/geafjr/looking_for_vanguard_alternative_poor_security/",
        "created": 1588756411.0
    },
    {
        "author": "SynFisa",
        "created_utc": 1588727597,
        "id": "geafen",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I've been a long time customer of Vanguard, and i've been trying to find an alternative. I don't feel the security at Vanguard is up to modern standards. They require/fall back to SMS for two factor authentication, which isn't really secure at all. And almost worse, to do a Wire i need to call them (inconvenient) and their only security is an SMS to my account. No password needed even, pretty insane. Was already turning a blind eye to SMS for too long, and then once i realized how poor the security was for wiring large amounts of money, i was pretty rattled. \n\n&amp;#x200B;\n\nI looked at some others like Fidelity and I don't really like their options. They require Symantec VIP for 2FA (much rather use traditional tokens like Authy). Saw reports of various companies that use Symantec VIP that just allow you to call to reset your account in case you lost the device the Symantec VIP app is on. \n\n&amp;#x200B;\n\nAre there any more modern companies that handle this stuff better?",
        "subreddit": "stocks",
        "title": "Looking for Vanguard alternative (poor security options)",
        "url": "https://www.reddit.com/r/stocks/comments/geafen/looking_for_vanguard_alternative_poor_security/",
        "created": 1588756397.0
    }
]