[
    {
        "author": "flatulent-noodle",
        "created_utc": 1592725830,
        "id": "hd2z6b",
        "num_comments": 316,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Texas new cases count, because the wu flu is cancelled.",
        "url": "https://i.redd.it/l4nk2gz3y7651.jpg",
        "created": 1592754630.0
    },
    {
        "author": "find_your_zen",
        "created_utc": 1592775407,
        "id": "hdf39h",
        "num_comments": 83,
        "num_crossposts": 0,
        "selftext": "I've seen a lot of confusion about how Ideanomics business model works and to be honest, it's just as complicated as it seemed, but way more impressive: \n\n[Flow Chart 1](https://prnewswire2-a.akamaihd.net/p/1893751/sp/189375100/thumbnail/entry_id/1_y95gxgbc/def_height/366/def_width/650/version/100011/type/1)\n\n\n[Flow Chart 2](https://prnewswire2-a.akamaihd.net/p/1893751/sp/189375100/thumbnail/entry_id/1_gmxd5m14/def_height/366/def_width/650/version/100011/type/1)\n\n\n[Apollo 11 For the New Gods](https://i5.walmartimages.com/asr/e2cb7752-40ac-4aa2-86ec-8502025b92e7_1.2506b061ad08eef821f42b67cb43fdd8.jpeg?odnWidth=463&amp;odnHeight=463&amp;odnBg=ffffff)\n\n\n\nOkay, okay. I can feel what you're probably already typing without reading this, \"Colorful pictures, science bitch, when my tendies coming in mail?\" The answer, of course is that depends on your level of autsie. \n\nPlan for any stock that does well to be short sold to hell. It's normal. If you're uncomfortable staying on, I advise you to trust yourself. This is play money for me so worst case scenario I'm disappointed. Secure gains while they're there and get back in if you too see the massive potential in this company.\n\nAs for all that technical flow chart shit, here it is in business speak:\n\n\"The group's 4 key business units are Energy Supply, which brings together leading electrical energy providers and technology for grid-based and on-site energy production; Battery Operations with leading fuel cell partners and fast-charging capabilities; Sales and Financing with leading financial partners and manufacturer alliance for group-buying and competitive financing solutions; and the IoV (Internet of Vehicles) business unit which combines real-time data services to assist with all aspects of fleet management from sales and financial services through to dealer management, built on a blockchain-based, data-driven, platform.\n\nAdditionally, the MEG group is positioning a concept for commercial vehicle and fleet markets based on fractional ownership of commercial vehicles, such as trucks, to democratize the ownership of profitable fleet activities and help manufacturers, distributors, and last-mile delivery providers achieve a more efficient ownership model.\n\n\"Now that we are underway with the new energy vehicle sales and financing activities, we felt it was the right rime to share our MEG activities in detail for the first time. The value chain you see in our model has been carefully constructed over the past 24 months, as we became aware of the opportunity to help the new energy vehicle industry come together in an innovative and cohesive manner that benefits participants at every level, whether parts suppliers and manufacturers, energy providers, or fleet managers,\" said Alf Poor, CEO of Ideanomics. \"We're focused on delivering value to each of our partners, and the broader industry in general, and we're excited to see our MEG division take shape and emerge with a strong thought leadership role in the future of the automotive industry. This model is a blueprint for efficiency, which we believe will serve the entire value chain and help new energy vehicles accelerate the pace of change in the automotive industry such that we reduce its reliance on fossil fuels. We're thrilled to share this with our partners and the broader investment community at this time.\"\n\nIdeanomics would also like to remind its partners and shareholders that it is not materially impacted by geopolitical activities, such as the recent announcements of reciprocal tariffs in relation to trade between the United States and China. The conversion of diesel and petroleum energy buses into EV and Hydrogen-powered buses under way in China is a government mandated initiative which is focused on the reduction of carbon emissions and pollution within a 2022 timeline, and is not subject to disruption by political or economic factors, such as trade talks or potential market downturns. The company does not anticipate any delays in its activities due to the broader geopolitical climate.\n\nTo that end, Ideanomics' Chairman, Dr. Bruno Wu, recently completed a private purchase of 1.7 Million shares at a price of $3.00 per share, which represents a premium to the current share price. Dr. Wu became aware of another investor requiring liquidity from their share holding in Ideanomics and negotiated to purchase those shares directly at a price which both sides agreed better represented the value of the shares. The total value of the transaction was $5.1 Million dollars and was reported in the company's recent 10-q filing for Q2.\"\n\n[Source](https://www.prnewswire.com/news-releases/ideanomics-outlines-its-mobile-energy-group-meg-activities-and-provides-updates-on-other-activities-300907067.html)\n\nTL;DR: Throw a dart at the board that is the tech industry, and you're likely to hit something they've got a hand in. Their business model seems most aggressively focused towards revenue and growth. With lots of additions and advancements since this piece was done.\n\n Several members of the board are literally putting their money where their mouths are. Bruno Wu bought 1.7m shares at 3.00 in August. He didn't become a billionaire by making stupid money moves.",
        "subreddit": "pennystocks",
        "title": "IDEX 101",
        "url": "https://www.reddit.com/r/pennystocks/comments/hdf39h/idex_101/",
        "created": 1592804207.0
    },
    {
        "author": "marksizzle",
        "created_utc": 1593092081,
        "id": "hfm6rv",
        "num_comments": 56,
        "num_crossposts": 0,
        "selftext": "**Disclaimer** To start, I am in on IDEX at 3.15 so I am positive on the company and have a small vested interest. Also, I am not a financial advisor so these are my opinions. That being said, I thought the interview was great so let's summarize and open it up for discussion.\n\n**Summary** Yates was a great moderator imo and Alf Poor was very on point. Yes, he had a majority of the questions prior to the interview, but you can tell when he talks that he is living and breathing this company daily. He knows his shit and wasn't reading from a page of notes. Exactly what we want from a CEO.\n\nThe gist of the interview in my eyes was this. They are getting their ducks in a row. Bruno Wu has a vision and Alf Poor is getting the pieces in place to execute on that. They have 2 (or more, 5g anyone towers anyone?) plays and 1 major play. The minors are EV manufacturing through partners and the dealerships for those cars and other companies cars. As Alf said, those two are the hook and the bait. They won't become huge on those, but what it does is leads into the 1 major play which is energy sales and management.\n\nThey will get small middleman fees on dealerships and probably small to medium revenue on cars they help manufacture. The big money is when they are selling energy, batteries, access to the grid, etc. As Alf said, its the same thing Tesla is trying to do (car batteries, to home batteries, to solar, etc) because there is a lot of money to be made there as there is going to be a MASSIVE seismic shift in the near future of how we create, access, and use energy to run the world. You want to have your hands in that when it happens. There is a lot of money to be made.\n\nOther notes:\n\n**Large Order Book** - Alf mentioned they have an order book that will keep them covered for a couple years. So they have high interest and expect PR drops to continue.\n\n**Shelf Offering** - Financial house cleaning. They still have money left on their previous, smaller shelf offering. This new larger one ($250 mil I believe) can be used any time in the next 3 years. No intent to use it immediately, but they need to have the ability to generate that revenue very quickly and move fast if the opportunity for something like an acquisition comes up, or building a new facility, or hiring en masse. Very smart and safe move. Most people here don't understand that. They just saw \"offering\" and panicked which dropped the price unfortunately.\n\n**5G** - First off, I work in wireless and telecom. All the 5G rumors are absolutely asinine. Secondly, you'll see that IDEX dropped a PR today [here](https://www.prnewswire.com/news-releases/ideanomics-meg-announces-the-official-launch-of-its-energy-services-unit-through-deal-with-new-infrastructure-service-provider-giant-zhongsen-tower-301083631.html). All you need to know about why they would get into this 5G thing is this:**MEG has taken a significant step to monetize its energy sales by powering Zhongsen's base stations.** See the trend? They are selling energy and/or managing it. Which is their major play I previously mentioned that is going to bring in bookoo bucks of recurring revenue. Think of that like Netflix recurring subscriptions at $15 a month. Multiply that by millions of customers and you have insane revenue, which is what IDEX is going for on energy sales/management.\n\nTL;DR - Alf and IDEX are getting their shit together. They will use EV manufacturing and sales (w/partners) to fund their real business which is energy sales/management. Getting recurring revenue on that every month or quarter is going to compound and add up. Think Netflix revenue/business model. $15 a month times millions of users = a ton of revenue, RECURRING.\n\nWhat do you all think? Is IDEX the future or just trash? I think they have a great vision and this is one you want to have in your portfolio, but what do I know?",
        "subreddit": "pennystocks",
        "title": "Quick IDEX Interview Summary and Discussion (now with 5G!)",
        "url": "https://www.reddit.com/r/pennystocks/comments/hfm6rv/quick_idex_interview_summary_and_discussion_now/",
        "created": 1593120881.0
    },
    {
        "author": "ManiaKzs",
        "created_utc": 1593028182,
        "id": "hf80sj",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "IDEX is bouncing back.(interview tomorrow with CEO Alfred Poor 8am EST.)\n\nAlf Poor the CEO just posted an interesting Tweet. https://twitter.com/alf_poor/status/1275787943840485383?s=21 This looks to be much bigger than a liquidation in my mind.\n\nHere is what I am thinking. Alf started as CEO in Feb last year. Fintech  Village was announced later in July but the article indicates Bruno Wu had been working on it for a year, so not Alf’s project and prior to his push to consolidate resources around EV.\n\nhttps://www.prnewswire.com/news-releases/ideanomics-unveils-plans-for-fintech-village-and-innovation-hub-300888429.html\n\nCEO’s are hired to look forward and grow the company. Looking forward, he sees the best opportunity developing in China EV market through pending olympics, sheer market size, growing pollution problems, and government mandates. He pivots and commits the strategic direction to EV with China as the proving ground. This plan did not include Fintech Village, which at this point becomes a thorn with the lawsuit, a distraction to the strategic direction, and a dilution of company resources. He puts it on the market to show for a buyer. The improvements that have been made are appealing to Hartford so it becomes a win win.\n\nBut, but their just abandoning the technology? Nope. Look at his tweet. This rolls up under everything they have alluded to. The EV focus means putting the technology where the need is. In the immediate future, the focus will be in applying the block chain to EV and battery manufacture, logistics, fleet support and financing. He intentionally mentions Treeletrik in Malaysia and that the manufacturers are ready to invest.\n\nThe Malaysian Treeletrik site is larger and provides convenient access to South Asian countries including India. The MEG provides direct access to mainland China. Where would you want your technology an intellectual property investments: communist China, or Malaysia which has developed a reputation for manufacturing, technology, and protecting businesses and investors?\n\nhttps://www.tmf-group.com/en/news-insights/business-culture/top-challenges-malaysia/\n\nIt is coming. They are simply trimming the fat and rearranging all their assets.\n\nPART 2. \n\nMedici Motor Works is focused on delivering the best truck and specialty vehicle experience for commercial fleet operators. Battery electric vehicles (\"BEV\") and hydrogen to fuel cell vehicles (\"H2FC\") are not an either / or decision for truck operators, the need for BEV or H2FC is dependent on the intended vehicle usage and to some extent the price point as well. BEV trucks are good for short haul and closed-circuit operations, such as mines, airports, steel mills, seaports, etc., and H2FC trucks are more suited to long distance haulage, offering the potential for reduced refueling stops and the introduction of self-driving autonomous vehicles as a solution to driver fatigue. Medici Motor **Works is already active in Asia and is looking to expand into Korea and the North American markets in the near future.**\n\nhttps://investors.ideanomics.com/2020-06-24-Ideanomics-MEG-Truck-Division-Medici-Motor-Works-Reveals-Branding-and-Positioning\n\nPART 3\n\nTomorrow 06/25 Stan The Man will interview CEO Alfred Poor at 8am EST. https://twitter.com/StanTradingMan/status/1275739371568795648?s=20",
        "subreddit": "RobinHoodPennyStocks",
        "title": "IDEX for the week of 06/22-06/26.",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/hf80sj/idex_for_the_week_of_06220626/",
        "created": 1593056982.0
    },
    {
        "author": "DueChampionship6",
        "created_utc": 1591956247,
        "id": "h7hxkr",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "Idex board of directors seem like the avengers squad. Dr Bruno Wu (chairman) is very powerful in China and his partner is basically the Oprah of China so no doubt this will be hyped to the mooooon. 🚀 🚀 \n\nI was wondering if anyone knows what are the chances of an offering or dilution?",
        "subreddit": "pennystocks",
        "title": "IDEX - big potential",
        "url": "https://www.reddit.com/r/pennystocks/comments/h7hxkr/idex_big_potential/",
        "created": 1591985047.0
    },
    {
        "author": "4ppleF4n",
        "created_utc": 1593112788,
        "id": "hfs9es",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "As is ascribed to Warren Buffett: \"Never invest in a business you cannot understand.\"\n\nIdeanomics, that darling of stonk-buyers, is currently taking a bit of a dump, as people question just what it does.\n\nBut true believers are holding strong, with \"diamond hands\" hoping against hope it will be the next Tesla, or Netflix, or cryptocoin play.\n\nIDEX has had four different names since it was started, and shifted its business model just as many.\n\n[On its website](https://ideanomics.com/about-us/founders-story/), the company now claims to have been founded in 2017 \"as a business transformation of an existing media company\" by Chinese billionaire Bruno Wu -- but it was actually founded in 2014 as \"YOU on Demand\" -- which later became \"WeCast Holdings\" -- by WWE pro wrestler Shane McMahon. \n\nThat's right, it was started by the son of Vince McMahon, owner of the WWE, as a way to stream movies in China.\n\nThat could have made for a compelling story, if they actually made any money doing it.\n\nBut after [Bruno Wu's Sun Seven Stars got involved with an investment](https://www.sec.gov/Archives/edgar/data/837852/000106299315006226/exhibit99-1.htm), it became \"Seven Stars Cloud Holdings.\"\n\nAnd now Ideanomics.\n\n(McMahon, incidentally, still sits on the board as \"Vice Chairman\" and is the second largest single shareholder.)\n\n## As real as Pro Wrestling. More pivots than a Heel Turn by Stone Cold Steve Austin.\n\nIt also changed from streaming web content, to streaming bullshit claims about what they do, like, \"the provision of business consulting services related to traditional financings, as well as in developing digital asset securitization services through artificial intelligence and blockchain enabled financial services platforms.\" (In its Robinhood profile.)\n\nYeah, that's total nonsense jargon that sounds impressive, but doesn't actually do anything. \n\nNow they claim to sell EV cars, but no one can actually find the \"MEG center\" showroom they claim to use, or get confirmation that any of the supposed sales they've been promoting have ever happened.\n\nOne diligent researcher discovered that the [promotional image is Photoshopped from a Chinese website](https://twitter.com/HindenburgRes/status/1276168357595799553). (Original on [Quindaonews.com](http://house.qingdaonews.com/xinloupan/showalbum219282.html))\n\nAnother tried to track down the companies and municipalities IDEX listed in its press releases as having contracts for EV vehicles. [None of them knew anything about the deals, or even who Ideanomics was](https://www.jcapitalresearch.com/uploads/2/0/0/3/20032477/2020_06_25_idex.pdf)-- except for one: \"Beijing Silk Road Rainbow said that the company\nhad indeed met IDEX but had told IDEX they could not work together.\"\n\nBack in February, before its sudden and meteoric rise, [one shortseller, Steven Cho questioned the company's finances](https://www.choresearch.com/2020/02/19/ideanomics-idex-is-almost-borderline-fraud-making-it-a-compelling-short-for-bears/), noting, that their \"Balance sheet looks borderline fraudulent\" -- with the company listing $40.7M of valuation on a mysterious cryptocurrency \"[GT Dollar](http://www.gtdollar.com/en)\" -- which no one has heard of or used. \n\nSo what's the real story? Is the entire company a Chinese sham, just used to extract funds from unsuspecting American stonkholders? How deep does this rabbit hole go?\n\n*Disclosure: I hold no positions in IDEX. And I pity the fool who does.*",
        "subreddit": "RobinHoodPennyStocks",
        "title": "$IDEX Ideanomics historic background and research - what they don't want you to see",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/hfs9es/idex_ideanomics_historic_background_and_research/",
        "created": 1593141588.0
    },
    {
        "author": "ManiaKzs",
        "created_utc": 1591822033,
        "id": "h0ju7y",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "So, if you haven't been paying attention, IDEX is the next Big thing. IDEX is a company which dabbles in many. The biggest being its EV sells and taxi business residing in China. On May 1st it began operating its newest business center in Qingdao, China. It sold 2139 vehicles which translates to 33 Million USD. First month. That's not including the money they made from their taxi business. Nor is it including the money they are making from their IN STORE INSURANCE options. Why is this good? Well the most important thing is that Oil prices are going up. It may only make a small difference but those with Funds will definitly switch over to EV, not only that but China is pushing hard on the enviromental issues. So far this month they are expected to EXCEED SALES of 2100. They currently have 11500+ orders on the way and secured. They are selling and providing services from vehicles made by Byd, Dong Feng NISSAN, Chery, Kia, Geely, and best of all TESLA. Yes the TESLA, not only that but they are in talks of a PARTNERSHIP! This is huge for both companies. But back to it being a company that dabbles in many markets. One of those is Microfluidics. A recent report came out expecting the market to be in between 15.6 BILLION -15.8 BILLION by the end of this year and expect it to grow to 44.0 BILLION by 2025. IDEX is one of the biggest competitors in China and the world. This only means if one business fails they have others to fall back on. The most important thing to realize is that not only is a short term winner but also a long term winner. From the top of the board (Bruno WU) to the bottom. I can't see it going wrong and definetly see it going up 40% to 60% in the next two days. Don't miss out. Links to more DD in the comments.",
        "subreddit": "RobinHood",
        "title": "IDEANOMICS(IDEX) - The future of China (TESLA)",
        "url": "https://www.reddit.com/r/RobinHood/comments/h0ju7y/ideanomicsidex_the_future_of_china_tesla/",
        "created": 1591850833.0
    },
    {
        "author": "AAA-Rated",
        "created_utc": 1591057821,
        "id": "guwrog",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "China is launching a crypto currency to displace the dollar and bitcoin. Heard it's going to be called 'Wu-ha-ha-ha'",
        "subreddit": "wallstreetbets",
        "title": "Word on the street is",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/guwrog/word_on_the_street_is/",
        "created": 1591086621.0
    },
    {
        "author": "3chmy",
        "created_utc": 1592855095,
        "id": "hdzbc4",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "[What do you think of this r/investing comment?](https://old.reddit.com/r/investing/comments/hcsmgw/ideanomics_idex_is_the_best_play_in_this_market/fvh9lnu/) There have been so many posts on IDEX, but none about Bruno Wu's past? I hold no positions in IDEX.\n\n&gt; [https://www.rosenlegal.com/media/casestudy/1733\\_Ideanomics%20-web.pdf](https://www.rosenlegal.com/media/casestudy/1733_Ideanomics%20-web.pdf)\n&gt; \n&gt; It's a class-action lawsuit which isn't 100% telling but note the revenue recognition in 2017 and 2018 which basically showed them \"making money\" with a 99.5% cost of goods sold lol, this inflated their revenues and is pretty shady.\n&gt; \n&gt; Bruno Wu also involved with a large ponzi scheme related to movie financing\n&gt; \n&gt; [https://www.straitstimes.com/asia/east-asia/chinas-largest-ponzi-scheme-shows-fraud-in-internet-financing](https://www.straitstimes.com/asia/east-asia/chinas-largest-ponzi-scheme-shows-fraud-in-internet-financing)\n&gt; \n&gt; The Connecticut HQ is a scam\n&gt; \n&gt; [http://www.ctvoterscount.org/west-hartford-scam-playing-out-as-we-predicted/](http://www.ctvoterscount.org/west-hartford-scam-playing-out-as-we-predicted/)\n&gt; \n&gt; These were all on the first page if you search for the founder. Playing with fire, imo",
        "subreddit": "pennystocks",
        "title": "IDEX's chairman's, Bruno Wu, past bankruptcies and lawsuits?",
        "url": "https://www.reddit.com/r/pennystocks/comments/hdzbc4/idexs_chairmans_bruno_wu_past_bankruptcies_and/",
        "created": 1592883895.0
    },
    {
        "author": "RUatrollorRUserious",
        "created_utc": 1593408100,
        "id": "hhtyzg",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "This is a total flyer and I almost flaired this as discussion.  I'd like to hear others thoughts, but it is so far out there it is as flaired.\n\nWhat happens when an elected official starts feeling the heat?  Declining poll numbers, mass protests, sad attendance at his rallies.  Does he bow out, double down, or change direction and claim that's where he was going all along?\n\nLaying out the changing direction option.  What happens if Donny becomes the new poster boy for the Covid crowd?  Wears a mask everywhere, executive orders shutting down public gatherings, leads the charge in congress to \"Stop the Spread!\"  Ignores the stock market, and focuses all of the government's efforts into eliminating/reducing the effect of C19.  To counter-act the negative impacts of that, he would focus on spending as much gov't money as possible by extending and increasing the unemployment payouts.\n\nI'm honestly not sure if this is a bear or bull's wet dream.  Despite my almost perma-bear status since the inception of Wu-flu, I think it'd be bullish in the short term and bearish much longer term.\n\nConsidering his \"white supremacy\" tweet this morning.  He's going to do something to distract the public from that.  Whatever it is, he needs something big.  Any bets on war with North Korea?  Never mind, he likes the despots.  How about war with ISIS?",
        "subreddit": "wallstreetbets",
        "title": "Beta-Carotene Man Going to Turn Up the Heat",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hhtyzg/betacarotene_man_going_to_turn_up_the_heat/",
        "created": 1593436900.0
    },
    {
        "author": "carrros",
        "created_utc": 1591833555,
        "id": "h0nohw",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "I know this probably is not the place to talk about this or ask this question, but I wonder if any of you guys are familiar with Western Union's business model? I don't really understand the service. Of course I get the fact that they transfer money, but I thought in this day and age with all of the online banks and things of that nature I was wondering why someone would send money through western union as opposed to just like sending it through the bank. Is their some type unique service that Western Union provides? If there is a better sub to direct this let me know.",
        "subreddit": "stocks",
        "title": "Western Union",
        "url": "https://www.reddit.com/r/stocks/comments/h0nohw/western_union/",
        "created": 1591862355.0
    },
    {
        "author": "marksizzle",
        "created_utc": 1593096786,
        "id": "hfng3v",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "**Disclaimer** To start, I am in on IDEX at 3.15 so I am positive on the company and have a small vested interest. Also, I am not a financial advisor so these are my opinions. That being said, I thought the interview was great so let's summarize and open it up for discussion.\n\n**Summary** Yates was a great moderator imo and Alf Poor was very on point. Yes, he had a majority of the questions prior to the interview, but you can tell when he talks that he is living and breathing this company daily. He knows his shit and wasn't reading from a page of notes. Exactly what we want from a CEO.\n\nThe gist of the interview in my eyes was this. They are getting their ducks in a row. Bruno Wu has a vision and Alf Poor is getting the pieces in place to execute on that. They have 2 (or more, 5g anyone towers anyone?) plays and 1 major play. The minors are EV manufacturing through partners and the dealerships for those cars and other companies cars. As Alf said, those two are the hook and the bait. They won't become huge on those, but what it does is leads into the 1 major play which is energy sales and management.\n\nThey will get small middleman fees on dealerships and probably small to medium revenue on cars they help manufacture. The big money is when they are selling energy, batteries, access to the grid, etc. As Alf said, its the same thing Tesla is trying to do (car batteries, to home batteries, to solar, etc) because there is a lot of money to be made there as there is going to be a MASSIVE seismic shift in the near future of how we create, access, and use energy to run the world. You want to have your hands in that when it happens. There is a lot of money to be made.\n\n**Other notes:**\n\n**Large Order Book** - Alf mentioned they have an order book that will keep them covered for a couple years. So they have high interest and expect PR drops to continue.\n\n**Shelf Offering** - Financial house cleaning. They still have money left on their previous, smaller shelf offering. This new larger one ($250 mil I believe) can be used any time in the next 3 years. No intent to use it immediately, but they need to have the ability to generate that revenue very quickly and move fast if the opportunity for something like an acquisition comes up, or building a new facility, or hiring en masse. Very smart and safe move. Most people here don't understand that. They just saw \"offering\" and panicked which dropped the price unfortunately.\n\n**5G** - First off, I work in wireless and telecom. All the 5G rumors are absolutely asinine. Secondly, you'll see that IDEX dropped a PR today [here](https://www.prnewswire.com/news-releases/ideanomics-meg-announces-the-official-launch-of-its-energy-services-unit-through-deal-with-new-infrastructure-service-provider-giant-zhongsen-tower-301083631.html). All you need to know about why they would get into this 5G thing is this:**MEG has taken a significant step to monetize its energy sales by powering Zhongsen's base stations.** See the trend? They are selling energy and/or managing it. Which is their major play I previously mentioned that is going to bring in bookoo bucks of recurring revenue. Think of that like Netflix recurring subscriptions at $15 a month. Multiply that by millions of customers and you have insane revenue, which is what IDEX is going for on energy sales/management.\n\n**TL;DR** - Alf and IDEX are getting their shit together. They will use EV manufacturing and sales (w/partners) to fund their real business which is energy sales/management. Getting recurring revenue on that every month or quarter is going to compound and add up. Think Netflix revenue/business model. $15 a month times millions of users = a ton of revenue, RECURRING.\n\nWhat do you all think? Is IDEX the future or just trash? I think they have a great vision and this is one you want to have in your portfolio, but what do I know?",
        "subreddit": "RobinHoodPennyStocks",
        "title": "IDEX Interview Summary (plus 5G and what it means!) xpost from pennystocks",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/hfng3v/idex_interview_summary_plus_5g_and_what_it_means/",
        "created": 1593125586.0
    },
    {
        "author": "4ppleF4n",
        "created_utc": 1593112223,
        "id": "hfs3ev",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "As is ascribed to Warren Buffett: \"Never invest in a business you cannot understand.\"\n\nIdeanomics, that darling of stonk-buyers, is currently taking a bit of a dump, as people question just what it does.\n\nBut true believers are holding strong, with \"diamond hands\" hoping against hope it will be the next Tesla, or Netflix, or cryptocoin play.\n\nIDEX has had four different names since it was started, and shifted its business model just as many.\n\n[On its website](https://ideanomics.com/about-us/founders-story/), the company now claims to have been founded in 2017 \"as a business transformation of an existing media company\" by Chinese billionaire Bruno Wu -- but it was actually founded in 2014 as \"YOU on Demand\" -- which later became \"WeCast Holdings\" -- by WWE pro wrestler Shane McMahon. \n\nThat's right, it was started by the son of Vince McMahon, owner of the WWE, as a way to stream movies in China.\n\nThat could have made for a compelling story, if they actually made any money doing it.\n\nBut after [Bruno Wu's Sun Seven Stars got involved with an investment](https://www.sec.gov/Archives/edgar/data/837852/000106299315006226/exhibit99-1.htm), it became \"Seven Stars Cloud Holdings.\"\n\nAnd now Ideanomics.\n\n(McMahon, incidentally, still sits on the board as \"Vice Chairman\" and is the second largest single shareholder.)\n\n## As real as Pro Wrestling. More pivots than a Heel Turn by Stone Cold Steve Austin.\n\nIt also changed from streaming web content, to streaming bullshit claims about what they do, like, \"the provision of business consulting services related to traditional financings, as well as in developing digital asset securitization services through artificial intelligence and blockchain enabled financial services platforms.\" (In its Robinhood profile.)\n\nYeah, that's total nonsense jargon that sounds impressive, but doesn't actually do anything. \n\nNow they claim to sell EV cars, but no one can actually find the \"MEG center\" showroom they claim to use, or get confirmation that any of the supposed sales they've been promoting have ever happened.\n\nOne diligent researcher discovered that the [promotional image is Photoshopped from a Chinese website](https://twitter.com/HindenburgRes/status/1276168357595799553). (Original on [Quindaonews.com](http://house.qingdaonews.com/xinloupan/showalbum219282.html))\n\nAnother tried to track down the companies and municipalities IDEX listed in its press releases as having contracts for EV vehicles. [None of them knew anything about the deals, or even who Ideanomics was](https://www.jcapitalresearch.com/uploads/2/0/0/3/20032477/2020_06_25_idex.pdf)-- except for one: \"Beijing Silk Road Rainbow said that the company\nhad indeed met IDEX but had told IDEX they could not work together.\"\n\nBack in February, before its sudden and meteoric rise, [one shortseller, Steven Cho questioned the company's finances](https://www.choresearch.com/2020/02/19/ideanomics-idex-is-almost-borderline-fraud-making-it-a-compelling-short-for-bears/), noting, that their \"Balance sheet looks borderline fraudulent\" -- with the company listing $40.7M of valuation on a mysterious cryptocurrency \"[GT Dollar](http://www.gtdollar.com/en)\" -- which no one has heard of or used. \n\nSo what's the real story? Is the entire company a Chinese sham, just used to extract funds from unsuspecting American stonkholders? How deep does this rabbit hole go?\n\n*Disclosure: I hold no positions in IDEX. And I pity the fool who does.*",
        "subreddit": "RobinHoodPennyStocks",
        "title": "$IDEX Ideanomics, as real as Pro Wrestling (which is what it was founded o",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/hfs3ev/idex_ideanomics_as_real_as_pro_wrestling_which_is/",
        "created": 1593141023.0
    },
    {
        "author": "sjybpysleep",
        "created_utc": 1591110478,
        "id": "gv8zkm",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Considering Alibaba's valuation of MGI, it should be close to $5 if WU is valuing them as such.",
        "subreddit": "stocks",
        "title": "MGI",
        "url": "https://www.reddit.com/r/stocks/comments/gv8zkm/mgi/",
        "created": 1591139278.0
    },
    {
        "author": "big-ol-brashear",
        "created_utc": 1593106204,
        "id": "hfq9v0",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "pennystocks",
        "title": "[IDEX] Alf and Wu spotted together",
        "url": "https://i.redd.it/0vikvtg3d3751.png",
        "created": 1593135004.0
    },
    {
        "author": "London_foodie",
        "created_utc": 1591860083,
        "id": "h0udms",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Western Union was reported by Bloomberg that it's working on a deal to buy out Moneygram. I believe the real negotiations started a month ago and recent news confirms the deal is much closer.\n\n1. News from 24 hour ago:  i believe one of MGI's partners (also significant shareholders) has cut ties about 3 weeks ago from providing any services to MGI to make it easier to pass regulatory hurdles and compliance audits. \n2. This partner already owns significant shares in MGI and would benefit from the sale greatly with other investors like Goldman Saches.\n\nBackground info:\nMGI was worth over $45 less than 2 years ago, today's it's at around $3.5 usd and most investors share holdings are above $10usd. It's growth of digital transaction is over 100% growth, ahead of WU &amp; other competitors.\n\nWU and MGI already shares a lot of similar service partners like VISA, so a merger between the two would enable them to reduce staff &amp; management numbers globally. It's a good fit.\n\nDYOR: this is not financial advice. Take from the rich 😎",
        "subreddit": "stocks",
        "title": "Hot: Moneygram update",
        "url": "https://www.reddit.com/r/stocks/comments/h0udms/hot_moneygram_update/",
        "created": 1591888883.0
    },
    {
        "author": "find_your_zen",
        "created_utc": 1592648681,
        "id": "hcjxeu",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Buckle up bitches, daddy's bringing you a lot.\n\n\nThe stock is IDEX.\n\nIdeanomics is a many headed hydra that used to be a big bag of shit called Seven Stars Cloud Group. In the last 18 months they have done a complete 180 and have started focusing on on their cash cow Mobile Energy Global. \n\nMEG is basically the Sam's Club of EVs, but on coke.\n\nThey act as a wholesaler to the vast Chinese market aimed at converting all it's fleet vehicles to EVs by 2022. The market for this is in the hundreds of billions. When IDEX was SSC, they landed a whale with China's largest electric bus full service operator:\n\n- Deal includes lease financing-based fixed income products, through SSC's [chains of block] ecosystem, to support large-scale upgrading of electric buses within China\n\n- Seven Stars Cloud to offer blockchain-based asset digitization services, based on strong underlying assets\n\n- 3-year total contract award for $24 Billion to be raised\n\nThey have also partnered with PertoChina, the 3rd largest oil company in the world and leading energy distributor in China, for a pilot project in Nanjing, China (pop. 8.5 mil) to convert gas stations to gas/charge stations. But these cunts are doing a bang up job because unlike Papa Elon who pays 150,000-250,000 to put up one of his charging stations, these assholes are converting the current gas stations to add charging stations with no major infrastructure needed because the chargers will be powered on site by methane provided by...Perto-fucking-China. This is fucking huge, and if thats not enough for your greedy grubby hands:\n\n\nIdeanomics' Announces Pilot Program to Monetize EV Energy Sales\n\n­- The pilot is based in the city of Nanjing, China and will focus on the interoperability of three critical components in EV energy consumption: payment systems, charging stations, and energy supply chains\n\n- ­Pilot will serve as a blueprint for its energy sales platform in other major cities throughout China\n\n\n\nRiding the wave of what works, these shitsticks opened a one million square foot expo center on some prime-ass real estate in Qingdao, Shandong Province that can hold 18,000 EV's. They opened the bitch in May and have reported that they have exceeded their aggressive sales goals. They have been dripping little nuggets of PR about 300 and 400 EV orders that they're filling by the end of June to get those million dollar sales in on this quarter.\n\nBitches are also trimming the fat, they're selling some asset they own called Grapevine and some other influencer related platforms to Techconn for a nice take:\n\n- Techconn vows to be one of the world's leading global influencer platforms boasting over 540,000 Key Opinion Leaders (KOL).\n\n- China's striving ecosystem of influencers could push IPO in 24 months\n\n- Ideanomics to divestment non-core assets and focus only on Electric Vehicle (EV) and New Energy Vehicle industries\n\nSo you're thinking, \"I'm a fag so I'm going to point out their limited market being focused in China, what about after Chyyyyna goes green in 2022?\" and I'm glad you asked, dickweasle, these mugs just copped a majority stake in THE ONLY LICENCED EV MANUFACTURER IN MALAYSIA, because it aims to sell 100 million EV mopeds across ASEAN countries.\n\nNow, I know what all you little autsies are saying, okay cunt, but this all seems too good to be true, who's behind it?\n\nCEO- Alf Poor: I didn't research him, fuck him.\n\nBoard includes-\n\nBruno Wu: Billionaire, Chinese media pioneer, married to Yan Lang (Forbes 100th most powerful women a few years back, talk show host, journalist, and oh yeah, chairwoman at the Sun Media group (one of China's biggest media companies))\n\nShane McMahon: son of the WWE's Vince McMahon\n\nSome other cunts: check for yourself, they're impressive.\n\nPoint is, these are very wealthy, incredibly connected people who have found the market of transferring some of that \"Old Oil\" money into the profitable-as-pussy green revolution are doing big things and word is getting out fast. Don't be the bad kind of retard and miss this.\n\nI'm basically handing you enough tendies with this to make you cum harder than my wife after her boyfriend gives her what we all joking call \"the best orgasms of her life.\"\n\nThe downsides: it's up 408% in the last month from 0.47 to 2.39.\nIf society collapses over Coronavirus scares over the weekend and the share price falls below $1 by OED Monday, it will fail to meet compliance and be delisted from the exchange.\n\n\nCalls weren't even available on this bitch until June 8th. I've gone in everything I can on the 2.5c for 10/16 when they were 0.73.  The 3c for 8/21 just got added today, and that's where the money is. Those will be deeper in the money than you need by their Earnings call on 8/10.\n\nLeadership: https://ideanomics.com/about-us/leadership/our-board-of-directors\n\nBus deal:\nhttps://www.prnewswire.com/news-releases/seven-stars-cloud-signs-exclusive-ground-breaking-three-year-24b-deal-with-chinas-largest-electric-bus-full-service-operator-300699270.html\n\nCharging station pilot:\nhttps://mobile.twitter.com/ideanomicshq/status/1238482986187870208\n\nExpo Center:\nhttps://www.proactiveinvestors.com/companies/news/920655/ideanomics-massive-ev-expo-center-in-qingdao-china-is-starting-to-generate-revenues-920655.html\n\nIt's sales:\nhttps://www.marketwatch.com/press-release/networknewsbreaks---ideanomics-nasdaq-idex-announces-strong-may-vehicle-sales-at-meg-center-2020-06-10?mod=mw_more_headlines&amp;tesla=y\n\nTrimming the fat:\nhttps://www.prnewswire.com/news-releases/ideanomics-to-sell-its-grapevine-and-related-influencer-platform-non-core-assets-301077102.html\n\nProof that SSC is IDEX:\nhttps://www.benzinga.com/news/18/10/12582006/seven-stars-changes-name-to-ideanomics-ticker-to-change-from-ssc-to-idex-effecti\n\nThe ASEAN thing:\nhttps://www.prnewswire.com/news-releases/ideanomics-announces-agreement-to-acquire-51-stake-in-the-exclusive-sales-arm-of-malaysias-only-licensed-ev-manufacturer-for-all-electric-powered-vehicles-300806752.html\n\nThe guarantee: If IDEX doesn't close above $5 (+100%ish) by their earnings call (8/10), I'll get the WSB guy permanently tattooed on my body with a caption that says \"I fucked up on IDEX!\"\n\nTL;DR: buy IDEX calls for every position under $5 for August or later and tell Chravis that you're gonna be fucking your wife tonight...if that's okay with them, or I explain to everyone I fuck forever what my stupid tattoo means.",
        "subreddit": "wallstreetbets",
        "title": "The easiest tendies you'll ever make, and a bet to boot!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hcjxeu/the_easiest_tendies_youll_ever_make_and_a_bet_to/",
        "created": 1592677481.0
    }
]