[
    {
        "author": "look_wide",
        "created_utc": 1586701343,
        "id": "fzxk3u",
        "num_comments": 165,
        "num_crossposts": 0,
        "selftext": "I thought markets tend upwards for 20 year periods. \n\nhttps://www.macrotrends.net/1319/dow-jones-100-year-historical-chart\n\n30 years after the crash, we got some upward movement, but then lost it and didn't get it again until the mid 1990s.\n\n-------\nedit: adding this link that perfectly gives us the answer - https://archive.is/DvBPs#selection-453.17-453.215 thanks to u/Senno_Ecto_Gammat\n\nedit 2: One of the take-aways from this thread is that reinvesting dividends for a very very long term index investment seems to make a HUGE difference.  But different S&amp;P indexes (e.g. Vanguard vs Schwab vs Fidelity) give different dividends. Should this influence my index choice? (self.StockMarket) How does this work? Should this matter in my choice of index fund / broker?",
        "subreddit": "investing",
        "title": "What am I missing here? A historic chart of the Dow (link inside) says we didn't make new all-time highs after 1930 for 30 years. And it didn't go up more than 50% until 60 years.",
        "url": "https://www.reddit.com/r/investing/comments/fzxk3u/what_am_i_missing_here_a_historic_chart_of_the/",
        "created": 1586730143.0
    },
    {
        "author": "bankeronwheels",
        "created_utc": 1586042303,
        "id": "fv3hkb",
        "num_comments": 84,
        "num_crossposts": 0,
        "selftext": "After having spent over 10 years working for the most prestigious names in the financial industry and having witnessed first hand two large financial stress periods (the Global Financial Crisis and the European Debt Crisis)  here are my ten suggestions you may potentially consider while investing\n\n [https://bankeronwheels.com/covid-19-investing-in-bear-market-crash-bottom/](https://bankeronwheels.com/covid-19-investing-in-bear-market-crash-bottom/) \n\n## 1. Buy gradually on the way down\n\nIf you have directly or indirectly prepared for a period of financial stress and have available cash you may consider starting investing now. A good strategy is to build rules and stick to them – either based on **certain index levels** e.g. S&amp;P 500 at 2500 invest 20% of savings, 2300 another 20% etc. or **based on timing** (slicing every few weeks since we have no clarity which way the market may go and when it will bottom out)\n\n## 2. Do not chase an upward trend in a bear market\n\nOne of the **common mistakes** we see is **people chasing upward trends** because of **FOMO – Fear of Missing Out** (when stock market recovers for a few days giving hope of long term gains). It takes more courage to buy according to predefined rules which often means buying when everything is gloomy and stocks lose massively. But in the long term it pays off. Do not be tempted by rebounds that may prove short-lived\n\n## 3. Do not try to time the market\n\nEven the best investors struggle with market timing. In fact most hedge funds (even the most prestigious ones) made substantial losses in the few past weeks.\n\nThe market can turn rapidly both ways and while you may avoid some bad days avoiding just a few good ones can be extremely detrimental to your long term performance as illustrated by a study done by Fidelity. \n\nIt is extremely **risky to use leverage today since additional debt implies you must be correct on timing**\n\n## 4. Invest, do not speculate\n\nYou may not get spectacular 300-400% returns but your money will be relatively safe if you base your decisions on sound financial statements and diversify. **ETFs are a great way to invest in indices without taking idiosyncratic risk** (e.g. Luckin Coffee (see right) recently dropped 80% in one day on uncovered fraud – as Warren Buffett says “Only when the tide goes out do you discover who’s been swimming naked”). \n\n**Ask yourself the question – am I more qualified than a professional investor** to predict which industry player may outperform the rest of the market? Do I know how the landscape post crisis will look like? Even if you suspect knowing first order effects are you sure of the second and higher order effect (to Nicholas Taleb’s point)?\n\n## 5. Avoid binary outcomes\n\nEach crisis has its own most **vulnerable industries where outcomes can be binary –** in 2008 some Banks went out of business and as an investor you may have lost everything. The Coronavirus crisis has other prime candidates for such outcomes, **airlines** can be nationalised and **hotel**/**tourism** industry players can go bankrupt should the distress last longer. You want to avoid these investments until there is more clarity on consumer confidence\n\n## 6. Look for financially resilient firms\n\nIf you do invest in single names, do not believe blindly in potentially meaningless dividend yields based on past data unless it has been confirmed by the management after incorporating all the outlook related to Covid-19. Instead look at **balance sheets with low debt and build-in resilience (cash)**. These firms may outperform and even acquire weaker competitors in the current environment\n\n## 7. Cash is King\n\nRay Dalio now infamously said a couple of months ago that ‘Cash is Trash’. While he is one of the best thinkers in Finance the remark was badly timed. Even in the most conservative scenarios keep some reserves. This is primarily a health crisis and while an economic crisis unfolds having a safety net is paramount. Additional unforeseen **tail risks always exists**\n\n## 8. Diversify in other assets including currencies, commodities and high quality debt products\n\nIt is difficult to predict which countries may relatively outperform. **Keep your portfolio diversified** geographically (e.g. Asia, Europe, US) and product-wise potentially including commodities like Gold that may outperform in low real rates / high inflation environments. Consider very high quality debt products (Treasuries or Investment Grade Debt)\n\n## 9. Stay informed but remain cautious\n\nAnd adjust your strategies accordingly. But be very careful with financial experts and consensus – **when you see opinions converging usually something else will happen**\n\n## 10. Duration of the coronavirus pandemic is key\n\nThe risks are still skewed to the downside. While there is an attractive discount to peak market values and positive catalysts may materialise (most pharmas are working on Coronavirus vaccines and mitigating drugs) the time it takes and the change of behaviour will alter the markets significantly. **The impact on people’s health even when cured and society at large is at this stage highly uncertain. Stay safe and healthy!** \\[Read [this](https://johnhcochrane.blogspot.com/2020/04/whack-mole-long-run-virus.html) post about potential way out\\]",
        "subreddit": "investing",
        "title": "COVID-19: 10 Investing rules in this bear market – conservative way of deploying your savings for long term returns [avoid reading if you are a short term speculator]",
        "url": "https://www.reddit.com/r/investing/comments/fv3hkb/covid19_10_investing_rules_in_this_bear_market/",
        "created": 1586071103.0
    },
    {
        "author": "Saap_ka_Baap",
        "created_utc": 1588044087,
        "id": "g9fmex",
        "num_comments": 77,
        "num_crossposts": 0,
        "selftext": "One day last September an unidentified trader pumped more than $3 billion into a tech fund run by State Street Corp. Two days later that trader pulled out a similar amount.\n\nWhy would someone make such a large bet—five times bigger than any previous transaction in the fund—and then reverse it so quickly? It turns out that transfusions like these are tax dodges, carried out by the world’s largest asset managers with help from investment banks. The beneficiaries are the long-term investors in exchange-traded funds. Such trades, nicknamed “heartbeats,” are rampant across the $4 trillion U.S. ETF market, with more than 500 made in the past year. One ETF manager calls them the industry’s “dirty little secret.”\n\nTypically, when you sell a stock for more than you paid, you owe tax on the gain. But thanks to a quirk in a Nixon-era tax law, funds can avoid that tax if they use the stock to pay off a withdrawing fund investor. Heartbeats come into play when there isn’t an exiting investor handy. A fund manager asks a friendly bank to create extra withdrawals by rapidly pumping assets in and out.\n\n“If the IRS were looking at it, they would say that’s a sham transaction,” says Peter Kraus, a former chief executive officer of mutual fund manager AllianceBernstein Holding LP who now runs Aperture Investors LLC.\n\nImagine that a grocer got a tax deduction every time someone returned a box of cornflakes to his store. Heartbeats are when the grocer asks a friend to buy all the boxes and return them, just to pocket more deductions.\n\n Fund managers and bankers say the trades are perfectly legal, and that most of the taxes that they help regular ETF investors avoid will be paid in later years. The biggest ETF managers, including BlackRock, State Street, and Vanguard Group, all use heartbeats, with help from banks such as Bank of America, Credit Suisse Group, and Goldman Sachs Group, according to market participants who spoke on condition of anonymity. Spokesmen for those companies either declined to comment on the trades or defended their use. The Internal Revenue Service says it’s aware of heartbeats and wouldn’t say whether it considers them an abuse.\n\nTo people in the industry, heartbeats are just smart tax strategy. “It’s removing a negative from the investment process,” says Bruce Bond, a pioneering ETF executive who was among the first regular users of heartbeat trades. “There really isn’t a need to have to pay the tax every year. The goal is the best investor experience you can have.”\n\nTo understand heartbeats, it helps to know that they’re just a supersize version of something ETFs do every day. ETFs are funds whose shares trade all day on stock exchanges. Unlike mutual funds, ETFs aren’t sold directly to regular investors. Instead, they use banks and brokerage firms as middlemen. These large traders don’t transact in cash. They make an ETF bigger or smaller by adding portfolio stocks to it, or by taking them out. They call this activity “creating” and “redeeming” ETF shares. (All this is invisible to small investors, who just buy ETFs from brokers.)\n\nEnter the Nixon-era tax law. In 1969, Congress decreed that mutual funds can hand over appreciated stocks to withdrawing investors without triggering a tax bill. Lawmakers never explained why they blessed the industry with this unique break, but back then, it didn’t seem like much of a giveaway. Mutual funds rarely took advantage of it, because their investors preferred cash payouts.\nFast forward to 1993, when American Stock Exchange executives devising the first U.S. exchange-traded fund realized they could put that old tax rule to a new use. Say an ETF needs to get rid of a stock that went up. Selling it would trigger a taxable gain that would ultimately be paid by fund investors. But handing the stock off to a broker who’s making a withdrawal achieves the same goal, tax-free. Every time a broker redeems a stake in a fund, it’s another chance to avoid taxes. That loophole gives ETFs a tax advantage over mutual funds. It went from a footnote in the tax code to the cornerstone of a new industry.\nFor some of the earliest ETFs, which followed broad indexes such as the S&amp;P 500 and rarely changed holdings, the daily process of brokers creating and redeeming was enough to wash away almost all capital gains. The first and largest ETF, State Street’s SPDR S&amp;P 500 ETF, hasn’t reported a taxable gain in 22 years. In contrast, a traditional mutual fund run by Fidelity Investments that tracks the same index had a taxable gain in 10 of those years.\n\nETFs proliferated, and some new entrants shuffled their holdings more frequently, so routine redemptions weren’t always enough to wipe out the taxes. The PowerShares funds, co-founded by Bond, started trading in 2003 and changed their portfolios every three months. He says his funds wouldn’t have kept capital-gains taxes away without heartbeats. “This tool was there,” says Bond, who sold PowerShares to Invesco Ltd. and now runs Innovator Capital Management LLC in Wheaton, Ill. “We were the ones to first really utilize it to its full potential.”\nU.S. stock ETFs avoided tax on more than $211 billion in gains last year, according to a Bloomberg Businessweek tally based on annual reports of more than 400 funds. The disclosures don’t show how much of that is from the funds’ routine use of the ETF loophole and how much is from special heartbeat trades that maximize the benefit. But heartbeats certainly contribute billions to the total.\nFunds pass taxable gains along to their investors, so by avoiding those gains, they’re allowing investors to defer the tax until they sell the ETF itself. The $211 billion in avoided fund gains probably translates to about $23 billion in deferred taxes last year. It’s the equivalent of a $23 billion, no-interest loan from the U.S. Treasury to ETF investors, with most of the benefit going to the wealthiest Americans.\nHeartbeats have had a few nicknames over the years, including “friendlies,” but they haven’t attracted much attention outside the industry. Elisabeth Kashner, an ETF specialist at FactSet Research Systems Inc., was the first to write about the practice in a December 2017 report. She called them heartbeats because the telltale blips in fund-flow data on her computer screen reminded her of a cardiac monitor. Bloomberg Businessweek identified 2,261 such blips in equity ETFs since 2000. Last year there were 548, worth a record $98 billion.\n\nMost heartbeats take place when an ETF has to get rid of stock because of a change in the index it tracks. That was the case in September with State Street’s $23 billion Technology Select Sector SPDR. Some of the fund’s largest holdings, including Facebook Inc. and Google parent Alphabet Inc., were being dropped from the portfolio because they were leaving the index the fund is designed to mimic. Both stocks had more than doubled since the fund first acquired them, so it probably faced a hefty tax bill if it sold them.\nOn Wednesday, Sept. 19, two days before the index change, $3.3 billion of new assets poured in, increasing the fund’s size by 14 percent. The additions came in the form of stock that matched the fund’s holdings at the time. The investor’s identity wasn’t disclosed, but market participants say that, given the size of the transaction, it was probably a large investment bank.\nOn Friday of that week, someone pulled more than $3 billion back out. Trading data suggest it was the same investor that had appeared two days before. Rather than take back the same shares of stock it had contributed 48 hours earlier, the investor appears to have walked away with the fund’s oldest shares of Facebook and Alphabet, the ones with the biggest capital gains. Thanks to winnings on stocks like that, the fund reported more than $4 billion in capital gains for the year. But since it used the ETF tax loophole to shield those gains from taxes, its annual report shows, it ended up reporting a $309 million capital loss to the IRS.",
        "subreddit": "investing",
        "title": "The ETF Tax Dodge Is Wall Street’s ‘Dirty Little Secret’. Banks are pumping billions of dollars into and out of funds with “heartbeat” trades.",
        "url": "https://www.reddit.com/r/investing/comments/g9fmex/the_etf_tax_dodge_is_wall_streets_dirty_little/",
        "created": 1588072887.0
    },
    {
        "author": "DorkHonor",
        "created_utc": 1588018756,
        "id": "g98iyv",
        "num_comments": 55,
        "num_crossposts": 1,
        "selftext": "Yeah, me neither until my puts on WLL didn't print.\n\nSo, in typical WSB fashion let's do some digging after we've already entered the trade. Who the actual fuck is buying this when they declared bankruptcy almost a month ago, and released their restructuring plan a couple days ago that includes wiping out the current shareholder's completely?\n\nGotta be dumbass retail investors right? Nope, they hold 1.03% of the shares and even the bagholders on Robinhood were selling today according to Robintrack. Mutual Funds hold 69.29% of the shares and other institutional investors hold 34.88%.\n\nSweet, smart money is holding the shares and they're clearly going to dump if the restructuring plan will wipe them out... um, turns out not so much. The 'smart' money guys are buying right now.\n\nFor example;\n\nFidelity Low Priced Stock Fund bought 206k shares today\n\nHwabao Upstream Oil and Gas bought 1.6m shares today\n\nDFA US small cap value bought 828k shares today\n\nSSga Funds bought 4.9m today\n\nBlackrock bought 310k today and is the largest individual shareholder at 14.41% of total outstanding shares, because of course they are. Fuckers own everything.\n\nMillennium Management LLC bought 3.9m shares\n\nThe list goes on. I'm not betting that retail investors will be smart enough to read the restructuring settlement and sell these shares. It turns out that I'm betting against mutual funds that don't give a fuck because it's not their money. Awesome.\n\nSomehow shorting a bankrupt company that's about to bend their shareholders over and fuck them bloody is a bad idea. The more you know.",
        "subreddit": "wallstreetbets",
        "title": "Ever wonder who buys shares in bankrupt companies?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/g98iyv/ever_wonder_who_buys_shares_in_bankrupt_companies/",
        "created": 1588047556.0
    },
    {
        "author": "wofulunicycle",
        "created_utc": 1586668758,
        "id": "fzqpwb",
        "num_comments": 44,
        "num_crossposts": 0,
        "selftext": "I use Fidelity and am looking for the best place to put cash to keep it liquid while earning a little interest. Need something I can sell very quickly. Was looking at FDRXX, a federal money market fund. Thoughts?",
        "subreddit": "investing",
        "title": "Where to park cash?",
        "url": "https://www.reddit.com/r/investing/comments/fzqpwb/where_to_park_cash/",
        "created": 1586697558.0
    },
    {
        "author": "k1tch3nMitts",
        "created_utc": 1587752062,
        "id": "g7dggb",
        "num_comments": 44,
        "num_crossposts": 0,
        "selftext": "Ok guys, I know Boeing is in a lot of shit now and was before Covid tanked the airline industry.\n\nBut it’s trading at about 70% of its 52-week high (400 to 120).\n\nFor those of you OK, with a long term hold (2-3 years), don’t you agree this could be quite profitable to go long on? The govt is not going to let Boeing go to shit; they make aircraft for our military.\n\n\nSecondly, the option premiums are ridiculous. They’re higher than those for SPY. I was even thinking about transferring about 12K into my fidelity and start selling weekly puts on BA to collect an extra $600/week.\n\n\nWhat are your thoughts ? I’ve been in options for about a good 1.5 years and still consider myself a novice so like to bounce ideas off people- preferably not the idiots in R/WSB; not that they don’t know anything, just that they are rude and never serious.\n\nThanks guys.",
        "subreddit": "investing",
        "title": "Boeing",
        "url": "https://www.reddit.com/r/investing/comments/g7dggb/boeing/",
        "created": 1587780862.0
    },
    {
        "author": "k1tch3nMitts",
        "created_utc": 1586525761,
        "id": "fyfy3q",
        "num_comments": 41,
        "num_crossposts": 0,
        "selftext": "So I sold my first put via fidelity and just wanted to make sure that I’m not missing out on anything.\n\nWhen I “sell to open” I collect the premium right off the bat, right?\nNo matter what happens to the option price , that money I collected up front doesn’t change right?\n\nI’m asking because I want to make sure I’m\nNot missing out on anything",
        "subreddit": "options",
        "title": "Selling puts",
        "url": "https://www.reddit.com/r/options/comments/fyfy3q/selling_puts/",
        "created": 1586554561.0
    },
    {
        "author": "ihabali2",
        "created_utc": 1587716749,
        "id": "g74pe9",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "‎‏Hi Everyone, yesterday was the worst day for me I lost almost my whole life savings $65k in Oil ETFs stocks and I wasn’t aware that using the margin balance would cause closing my position by the broker (TD Ameritrade) that fast when it goes so much down, and nobody expect those oil prices, TD Ameritrade made a margin call and closed my positions and wiped out my account without a notice, and sold my positions on the low, they know it’s unusual oil price and it will recover because there is an oil cut soon, but they still sold me very fast!! And ruined my life and my family savings! Not sure what do now? And if there is a lawyer can help me about closing my positions! I have a proof of everything!\n\nIf you can help with anything please message me!\n\n[This is a screenshot of positions before they close it](https://i.imgur.com/RDZ0Hdz_d.jpg?maxwidth=640&amp;shape=thumb&amp;fidelity=medium)",
        "subreddit": "investing",
        "title": "Lost all my life savings in the market, I don’t know what to do!",
        "url": "https://www.reddit.com/r/investing/comments/g74pe9/lost_all_my_life_savings_in_the_market_i_dont/",
        "created": 1587745549.0
    },
    {
        "author": "chinotruong",
        "created_utc": 1586911614,
        "id": "g1hq37",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "I just recently found out Fidelity drop their transaction fee so I’m thinking should I move Robinhood to them instead? Is $75 fee to move but the thing is fidelity have a customer support line and Robinhood doesn’t which suck. Also, Robinhood have a weird limit let say if a stock is $50 and I have $60 I can’t but it. It say something like I can only purchase 0.8474 of the stock. I never seen this happen to me I’m fidelity account. \n\nWhat are you guys preference ?",
        "subreddit": "StockMarket",
        "title": "Should I move my Robinhood stock account to fidelity ?",
        "url": "https://www.reddit.com/r/StockMarket/comments/g1hq37/should_i_move_my_robinhood_stock_account_to/",
        "created": 1586940414.0
    },
    {
        "author": "debsman20",
        "created_utc": 1588018326,
        "id": "g98dvz",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "After almost 4 days straight upward movement, spy is in oversold and trading against the 287 resistance.\n\nMay the Lord turn spy red tomorrow.\n\nA lot of you here are bleeding red and crying in your pillows. You shall see red soon to bring in some tendies  becuase we all know none of these make sense.\n\nMay Lord rescue his handmaids.",
        "subreddit": "wallstreetbets",
        "title": "The Ginie in my Fidelity Tech Analysis says tomorrow should be red.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/g98dvz/the_ginie_in_my_fidelity_tech_analysis_says/",
        "created": 1588047126.0
    },
    {
        "author": "7850443Reddit",
        "created_utc": 1587171878,
        "id": "g3em2d",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "Started with 6k turned it into 11k with SPY puts then quickly lost it all. Put my last tendies (2k) into amazon calls and made 16k which I held until it was 5k today and sold at a loss. Just bought back amazon calls before close today with what I had left. Monday will decide if I am sucking dick or getting my dick sucked.  \n\n3mo : https://i.imgur.com/wGZZc73_d.jpg?maxwidth=640&amp;shape=thumb&amp;fidelity=medium\n\nPositions : amzn 2700c 5/1\n\nEdit for the retards saying it’s a gain .. I started with 6k and now have 5k lmao",
        "subreddit": "wallstreetbets",
        "title": "Fuck amazon 2k &gt; 16k &gt; 5k",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/g3em2d/fuck_amazon_2k_16k_5k/",
        "created": 1587200678.0
    },
    {
        "author": "Uizdum",
        "created_utc": 1587175691,
        "id": "g3fkgf",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "I started Robinhooh a year ago. It makes everything so simple. I'm nervous about trying other platforms. I want to go with Fidelity, but E-Trade and TD Ameritrade also seem nice. I just get overwhelmed when trying to pick a new one. A more \"professional\" one I guess. \n\nSo what is your preferred trading platform? Why do you like it? Why did you change if you used another platform to your current one?",
        "subreddit": "investing",
        "title": "What's your preferred trading platform?",
        "url": "https://www.reddit.com/r/investing/comments/g3fkgf/whats_your_preferred_trading_platform/",
        "created": 1587204491.0
    },
    {
        "author": "ihabali2",
        "created_utc": 1587717479,
        "id": "g74u0m",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "‎‏Hi Everyone, yesterday was the worst day for me I lost almost my whole life savings $65k in Oil ETFs stocks and I wasn’t aware that using the margin balance would cause closing my position by the broker (TD Ameritrade) that fast when it goes so much down, and nobody expect those oil prices, TD Ameritrade made a margin call and closed my positions and wiped out my account without a notice, and sold my positions on the low, they know it’s unusual oil price and it will recover because there is an oil cut soon, but they still sold me very fast!! And ruined my life and my family savings! Not sure what do now? And if there is a lawyer can help me about closing my positions! I have a proof of everything!\n\nAlso, I wanted to note that I didn’t mean to use the margin, TD Ameritrade doesn’t show how much I am using from the margin until the stocks goes down and the margin calls shows up, I feel that they do that trap in purpose so they can take new investors money! I know I was greedy and I didn’t know how Oil ETFs works but they also trapping new users they should show how much I used from the margin \n\nIf you can help with anything please message me!\n\n[This is a screenshot of positions before they close it](https://i.imgur.com/RDZ0Hdz_d.jpg?maxwidth=640&amp;shape=thumb&amp;fidelity=medium)",
        "subreddit": "StockMarket",
        "title": "Lose all my saving money in the market, I don’t know what to do!",
        "url": "https://www.reddit.com/r/StockMarket/comments/g74u0m/lose_all_my_saving_money_in_the_market_i_dont/",
        "created": 1587746279.0
    },
    {
        "author": "cambarnett3",
        "created_utc": 1586562937,
        "id": "fys2gc",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "If I sell puts and get assigned the shares, what kind of fees will I get on Fidelity. I tried to look it up but couldn’t really find anything. Anything is helpful",
        "subreddit": "options",
        "title": "Question about selling puts",
        "url": "https://www.reddit.com/r/options/comments/fys2gc/question_about_selling_puts/",
        "created": 1586591737.0
    },
    {
        "author": "Saap_ka_Baap",
        "created_utc": 1588044263,
        "id": "g9fny2",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "One day last September an unidentified trader pumped more than $3 billion into a tech fund run by State Street Corp. Two days later that trader pulled out a similar amount.\n\nWhy would someone make such a large bet—five times bigger than any previous transaction in the fund—and then reverse it so quickly? It turns out that transfusions like these are tax dodges, carried out by the world’s largest asset managers with help from investment banks. The beneficiaries are the long-term investors in exchange-traded funds. Such trades, nicknamed “heartbeats,” are rampant across the $4 trillion U.S. ETF market, with more than 500 made in the past year. One ETF manager calls them the industry’s “dirty little secret.”\n\nTypically, when you sell a stock for more than you paid, you owe tax on the gain. But thanks to a quirk in a Nixon-era tax law, funds can avoid that tax if they use the stock to pay off a withdrawing fund investor. Heartbeats come into play when there isn’t an exiting investor handy. A fund manager asks a friendly bank to create extra withdrawals by rapidly pumping assets in and out.\n\n“If the IRS were looking at it, they would say that’s a sham transaction,” says Peter Kraus, a former chief executive officer of mutual fund manager AllianceBernstein Holding LP who now runs Aperture Investors LLC.\n\nImagine that a grocer got a tax deduction every time someone returned a box of cornflakes to his store. Heartbeats are when the grocer asks a friend to buy all the boxes and return them, just to pocket more deductions.\n\n Fund managers and bankers say the trades are perfectly legal, and that most of the taxes that they help regular ETF investors avoid will be paid in later years. The biggest ETF managers, including BlackRock, State Street, and Vanguard Group, all use heartbeats, with help from banks such as Bank of America, Credit Suisse Group, and Goldman Sachs Group, according to market participants who spoke on condition of anonymity. Spokesmen for those companies either declined to comment on the trades or defended their use. The Internal Revenue Service says it’s aware of heartbeats and wouldn’t say whether it considers them an abuse.\n\nTo people in the industry, heartbeats are just smart tax strategy. “It’s removing a negative from the investment process,” says Bruce Bond, a pioneering ETF executive who was among the first regular users of heartbeat trades. “There really isn’t a need to have to pay the tax every year. The goal is the best investor experience you can have.”\n\nTo understand heartbeats, it helps to know that they’re just a supersize version of something ETFs do every day. ETFs are funds whose shares trade all day on stock exchanges. Unlike mutual funds, ETFs aren’t sold directly to regular investors. Instead, they use banks and brokerage firms as middlemen. These large traders don’t transact in cash. They make an ETF bigger or smaller by adding portfolio stocks to it, or by taking them out. They call this activity “creating” and “redeeming” ETF shares. (All this is invisible to small investors, who just buy ETFs from brokers.)\n\nEnter the Nixon-era tax law. In 1969, Congress decreed that mutual funds can hand over appreciated stocks to withdrawing investors without triggering a tax bill. Lawmakers never explained why they blessed the industry with this unique break, but back then, it didn’t seem like much of a giveaway. Mutual funds rarely took advantage of it, because their investors preferred cash payouts.\nFast forward to 1993, when American Stock Exchange executives devising the first U.S. exchange-traded fund realized they could put that old tax rule to a new use. Say an ETF needs to get rid of a stock that went up. Selling it would trigger a taxable gain that would ultimately be paid by fund investors. But handing the stock off to a broker who’s making a withdrawal achieves the same goal, tax-free. Every time a broker redeems a stake in a fund, it’s another chance to avoid taxes. That loophole gives ETFs a tax advantage over mutual funds. It went from a footnote in the tax code to the cornerstone of a new industry.\nFor some of the earliest ETFs, which followed broad indexes such as the S&amp;P 500 and rarely changed holdings, the daily process of brokers creating and redeeming was enough to wash away almost all capital gains. The first and largest ETF, State Street’s SPDR S&amp;P 500 ETF, hasn’t reported a taxable gain in 22 years. In contrast, a traditional mutual fund run by Fidelity Investments that tracks the same index had a taxable gain in 10 of those years.\n\nETFs proliferated, and some new entrants shuffled their holdings more frequently, so routine redemptions weren’t always enough to wipe out the taxes. The PowerShares funds, co-founded by Bond, started trading in 2003 and changed their portfolios every three months. He says his funds wouldn’t have kept capital-gains taxes away without heartbeats. “This tool was there,” says Bond, who sold PowerShares to Invesco Ltd. and now runs Innovator Capital Management LLC in Wheaton, Ill. “We were the ones to first really utilize it to its full potential.”\nU.S. stock ETFs avoided tax on more than $211 billion in gains last year, according to a Bloomberg Businessweek tally based on annual reports of more than 400 funds. The disclosures don’t show how much of that is from the funds’ routine use of the ETF loophole and how much is from special heartbeat trades that maximize the benefit. But heartbeats certainly contribute billions to the total.\nFunds pass taxable gains along to their investors, so by avoiding those gains, they’re allowing investors to defer the tax until they sell the ETF itself. The $211 billion in avoided fund gains probably translates to about $23 billion in deferred taxes last year. It’s the equivalent of a $23 billion, no-interest loan from the U.S. Treasury to ETF investors, with most of the benefit going to the wealthiest Americans.\nHeartbeats have had a few nicknames over the years, including “friendlies,” but they haven’t attracted much attention outside the industry. Elisabeth Kashner, an ETF specialist at FactSet Research Systems Inc., was the first to write about the practice in a December 2017 report. She called them heartbeats because the telltale blips in fund-flow data on her computer screen reminded her of a cardiac monitor. Bloomberg Businessweek identified 2,261 such blips in equity ETFs since 2000. Last year there were 548, worth a record $98 billion.\n\nMost heartbeats take place when an ETF has to get rid of stock because of a change in the index it tracks. That was the case in September with State Street’s $23 billion Technology Select Sector SPDR. Some of the fund’s largest holdings, including Facebook Inc. and Google parent Alphabet Inc., were being dropped from the portfolio because they were leaving the index the fund is designed to mimic. Both stocks had more than doubled since the fund first acquired them, so it probably faced a hefty tax bill if it sold them.\nOn Wednesday, Sept. 19, two days before the index change, $3.3 billion of new assets poured in, increasing the fund’s size by 14 percent. The additions came in the form of stock that matched the fund’s holdings at the time. The investor’s identity wasn’t disclosed, but market participants say that, given the size of the transaction, it was probably a large investment bank.\nOn Friday of that week, someone pulled more than $3 billion back out. Trading data suggest it was the same investor that had appeared two days before. Rather than take back the same shares of stock it had contributed 48 hours earlier, the investor appears to have walked away with the fund’s oldest shares of Facebook and Alphabet, the ones with the biggest capital gains. Thanks to winnings on stocks like that, the fund reported more than $4 billion in capital gains for the year. But since it used the ETF tax loophole to shield those gains from taxes, its annual report shows, it ended up reporting a $309 million capital loss to the IRS.",
        "subreddit": "wallstreetbets",
        "title": "The ETF Tax Dodge Is Wall Street’s ‘Dirty Little Secret’. Banks are pumping billions of dollars into and out of funds with “heartbeat” trades.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/g9fny2/the_etf_tax_dodge_is_wall_streets_dirty_little/",
        "created": 1588073063.0
    },
    {
        "author": "Cumberland114",
        "created_utc": 1587500593,
        "id": "g5mw0h",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "Since Overstock announced the distribution of their digital dividend the other day, Fidelity is blocking all purchases of shares. Is that even legal for them to do? Isn’t this manipulation of a possible increase of share value?",
        "subreddit": "wallstreetbets",
        "title": "Fidelity suspends OSTK Purchases. Is that legal?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/g5mw0h/fidelity_suspends_ostk_purchases_is_that_legal/",
        "created": 1587529393.0
    },
    {
        "author": "landhag69",
        "created_utc": 1586369597,
        "id": "fxbkoq",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "As we all know toilet paper is gold in the times of the beer virus.\n\nBut seriously, Clearwater Paper is the largest supplier of private label toilet paper to retail and grocery chains. Last quarter they had the [biggest earnings beat in their history](https://www.fool.com/earnings/call-transcripts/2020/02/26/clearwater-paper-corp-clw-q4-2019-earnings-call-tr.aspx). Even before the coronavirus, toilet paper sales grew over 8% leading to earnings of $0.37 on an expected $0.16. These sales were partially offset by a decline in paper board products which has now boomed.\n\nThey're working at full capacity trying to meet the [massive increase in demand](https://www.shelbystar.com/news/20200331/clearwater-paper-sees-increase-in-demand) they're currently seeing. [\"Clearwater Paper has shipped 216,000 rolls of toilet paper to the Clarkston Costco so far this month, which is more than it took there for the entire year of 2019.\"](https://lmtribune.com/northwest/as-a-bonus-tp-is-more-than-ok/article_f43e7852-3604-532b-a9b5-118b5b4665ec.html). My fidelity alert says their paperboard products have also seen a \"significant increase\" for use shipping food and pharmaceuticals, which remember was the only thing holding back even bigger earnings last quarter.  [They're an essential business](https://www.eastidahonews.com/2020/03/idaho-has-a-giant-toilet-paper-factory-an-essential-business-amid-coronavirus-hoarding/) meaning operations are continuing as normal. Full disclosure, one employee [did test positive](https://www.bigcountrynewsconnection.com/idaho/clearwater-paper-says-employee-positive-for-covid-19/article_c9e40b3c-78f0-11ea-b86c-2f9b584282b9.html), but it's unlikely to have much if any impact on operations, and certainly won't effect Q1 2020 earnings.\n\nEarnings are on 4/29 and expected is only $0.09 compared to last quarters' $0.37 before the coronavirus even hit.\n\nTl;Dr toilet paper printers now printing money. 5/15 22.50, 25 calls.",
        "subreddit": "wallstreetbets",
        "title": "Toilet Paper Tendies (CLW",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fxbkoq/toilet_paper_tendies_clw/",
        "created": 1586398397.0
    },
    {
        "author": "MookSunk",
        "created_utc": 1587276007,
        "id": "g42mlu",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "I have 10k that I would like to stuff somewhere not in a savings account. What do you think is the best route for me to take? I just want to make as much money as possible with as little risk as possible over the next 5 years (like everybody else). Based on your experience as a savvy investor what would you recommend? REITs? Stocks? Mutual Funds? Is it really worth hiring a financial advisor or opening an account with one of the big firms?  TD Ameritrade/Fidelity etc... Or can I handle this myself with an E*TRADE account and some YouTube videos? Thank you all in advance. Stay safe!",
        "subreddit": "investing",
        "title": "I have $10,000 to Invest",
        "url": "https://www.reddit.com/r/investing/comments/g42mlu/i_have_10000_to_invest/",
        "created": 1587304807.0
    },
    {
        "author": "whoareyou31",
        "created_utc": 1588126030,
        "id": "ga0s27",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "For someone who’s young, wouldnt it be better to all in on SPXL. Yes you can lose 3x during a bear market but in the long term youll be ahead. \n\nAlso, why cant I put my 401k money in SPXL on fidelity? \n\nI plan to just all in SPXL with my roth every year from now on for the next 30+ years.",
        "subreddit": "investing",
        "title": "SP500 index vs SPY vs SPXL",
        "url": "https://www.reddit.com/r/investing/comments/ga0s27/sp500_index_vs_spy_vs_spxl/",
        "created": 1588154830.0
    },
    {
        "author": "Take_Notice_Walk",
        "created_utc": 1588080653,
        "id": "g9n7w4",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "I narrowed it down to these three: Fidelity, TD Ameritrade, and E\\*Trade.\n\nTell me which one you think is best for OTC penny stocks, day/trading fund transfers, and fees?\n\nAny help is greatly appreciated.",
        "subreddit": "pennystocks",
        "title": "Fidelity vs TD Ameritrade Vs. E*Trade; which is best for OTC penny stocks, day trading/fund transfers, fees?",
        "url": "https://www.reddit.com/r/pennystocks/comments/g9n7w4/fidelity_vs_td_ameritrade_vs_etrade_which_is_best/",
        "created": 1588109453.0
    },
    {
        "author": "verdict0224",
        "created_utc": 1587747655,
        "id": "g7c1si",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "I have a Fidelity account and I want to purchase a couple shares of Netflix and one of the options you gives me is to use my cash management account or my Roth IRA. I thought you had to use your Roth IRA or any other ira with the mutual fund or something or maybe like a target-date fund. I didn't know you could actually use funds from your IRA and purchase stocks. Is that allowed or will there be some financial penalty?",
        "subreddit": "investing",
        "title": "Does it cost anything to use your IRA to purchase stocks? Not sure if you can do this",
        "url": "https://www.reddit.com/r/investing/comments/g7c1si/does_it_cost_anything_to_use_your_ira_to_purchase/",
        "created": 1587776455.0
    },
    {
        "author": "thinkingahead7",
        "created_utc": 1588183279,
        "id": "gae63y",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "It's been a pretty wild journey. I should have started investing when I graduated high school. \n\nI never thought money could grow like how it has. I just wanna say that this is one of the more important sub-reddits. At least we're helping each other build for the future; and not just talking about random video games and memes.\n\nI learn a little bit of something with every thread in here. 2 years ago I was scared to invest, but I just stuck with it, read more and more, made contributions from my paycheck that would directly go into my Fidelity account. I guess you would say I'm a bit of an investing-binge now.\n\nJust an appreciation post!",
        "subreddit": "investing",
        "title": "Thank you Reddit investing fam. 2 years ago I wouldn't have even thought of investing.",
        "url": "https://www.reddit.com/r/investing/comments/gae63y/thank_you_reddit_investing_fam_2_years_ago_i/",
        "created": 1588212079.0
    },
    {
        "author": "ald021",
        "created_utc": 1585954035,
        "id": "fuiaix",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "So as a result of the pandemic my  employer will not be matching 401k distributions as it is suspended for the rest of the year until further notice.  They released a letter stating  it will suspend “safe harbor matching contributions” what does this mean? It also states that as result of the CARES ACT passed over the weekend if we were affected by covid-19, we can withdraw up to $100,000 without the 10% early withdrawal tax penalty. I currently have $150,000 in my 401k. Should I stop contributing and roll it over to a traditional IRA and continue to contribute there ?\n\n (im 52 and will retire in 5 more years, I also have a pension plan waiting)\n\n\nAlso my 401k through my job is with fidelity if this info helps. What do you recommend I do to continue investing in a retirement fund but I also want it to grow. Before all this happen my 401k would match me up to 6%",
        "subreddit": "investing",
        "title": "Employer is no longer matching 401k",
        "url": "https://www.reddit.com/r/investing/comments/fuiaix/employer_is_no_longer_matching_401k/",
        "created": 1585982835.0
    },
    {
        "author": "Bunburier",
        "created_utc": 1587389852,
        "id": "g4sx5x",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "I've only heard bad news about bonds, but I'm very uneducated about bond markets, and only want to balance out a portfolio I'm hoping to make about a 65/35 split between stocks and bonds for retirement. \n\nI've read businesses like Fidelity that can offer cheap index stock options might be a bad place to go to purchase bonds. Any advice on bonds would be appreciated, especially in context to the current state of US bonds.",
        "subreddit": "investing",
        "title": "Is now a bad time to purchase bonds? (Long-term investor)",
        "url": "https://www.reddit.com/r/investing/comments/g4sx5x/is_now_a_bad_time_to_purchase_bonds_longterm/",
        "created": 1587418652.0
    },
    {
        "author": "slinkystaircase",
        "created_utc": 1586308259,
        "id": "fwwud4",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "https://finance.yahoo.com/news/fidelity-shift-billions-retirement-assets-100000077.html\n\nYou banned me for saying this same thing. Apparently I’m an idiot though and shouldn’t be posting here. \n\nBecause I am now right, I’d appreciate the unban. Thanks.",
        "subreddit": "investing",
        "title": "FYI TARGET DATE TRUTHERS AND MODS...",
        "url": "https://www.reddit.com/r/investing/comments/fwwud4/fyi_target_date_truthers_and_mods/",
        "created": 1586337059.0
    },
    {
        "author": "songtailor",
        "created_utc": 1587099535,
        "id": "g2vcs5",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Lots  of mutual funds exist, but some of them have been around for so many  years that their prices are quite high per share. How do I find the ones  that are just starting out? For instance, I use Fidelity Investments.  When I look at certain funds, I see that they started in x year. How do I  find a fund to invest in that started say, this year or late last year and has a lower per share price?\n\nMaybe  I'm just confused and need a bit of explanation about the differences,  but it seems better to invest in a new fund (if it has reasonable  stocks, of course) with a much lower per-share rate if you already have  money vs trying to buy into something that is $60-100+ per share. To me, there's more growth potential going from $5 to a future $80 per share vs buying in at $60 a share and the future being $80 a share.\n\nAm I incorrect that the lower amount is better? Is there any compounding of a mutual fund if you get in it and stay in vs swing trading as it goes up and down?",
        "subreddit": "stocks",
        "title": "Do you have any advice on finding newly established funds?",
        "url": "https://www.reddit.com/r/stocks/comments/g2vcs5/do_you_have_any_advice_on_finding_newly/",
        "created": 1587128335.0
    },
    {
        "author": "Bluecyanide1",
        "created_utc": 1587683188,
        "id": "g6x2m5",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Hello, \n     The answer is fidelity because it is free, they don't charge, and you can make the account, add your funds, and trade instantly without any wait period.  \n\n*Other ones (charles shwab) make you wait 3 days before you can buy an OTC stock (DECN). \n*Other ones (TDameritrade) make charge you PER transaction, yes, they literally charge you 6.95$. so thats a big fat no for people only throwing a little money in.\n\nI don't know why nobody literally answered this question, I had to go through rabbit holes opening up accounts etc and talking to customer service to figure it out. \n\nSave yourself the trouble. Open a fidelity account, link it to bank, transfer funds, trade tomorrow morning instantly. Done, you're welcome.",
        "subreddit": "pennystocks",
        "title": "Answer for common question: How do I buy DECN and OTC stocks",
        "url": "https://www.reddit.com/r/pennystocks/comments/g6x2m5/answer_for_common_question_how_do_i_buy_decn_and/",
        "created": 1587711988.0
    },
    {
        "author": "ltgustin",
        "created_utc": 1587837719,
        "id": "g7y2o7",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "I’ve been wanting to get rid of my Discover card (basic 5% back on random things every quarter), and recently learned about the Fidelity Rewards Visa card. It looks like it gives back 2% into a Fidelity account (after you spend $1250...which for me would be every 3-4 months). \n\nDoes anyone have this card and recommend it?? If not, why not?",
        "subreddit": "investing",
        "title": "Fidelity Rewards Visa card - opinions?",
        "url": "https://www.reddit.com/r/investing/comments/g7y2o7/fidelity_rewards_visa_card_opinions/",
        "created": 1587866519.0
    },
    {
        "author": "TriggerWarning9",
        "created_utc": 1586976977,
        "id": "g1y8sw",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "I want to dca in spy or VOO. What’s the best way to put $50 a week in it? Cashapp? M1? Fidelity? Thanks",
        "subreddit": "stocks",
        "title": "Best app to buy fractional shares?",
        "url": "https://www.reddit.com/r/stocks/comments/g1y8sw/best_app_to_buy_fractional_shares/",
        "created": 1587005777.0
    },
    {
        "author": "cjbrigol",
        "created_utc": 1587046470,
        "id": "g2focv",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "Thanks for any help. I have 200 shares of GME I'd like to sell covered calls. For example, some settings I tried just playing around. \n\nAction: Sell to Open\n\nQuantity: 2\n\nStrike: $10\n\nC/P: Call\n\nLimit: 0.4\n\nRoute: auto\n\nWith these settings, it says max gain is 80, max loss is unlimited... Are they assuming I bought the shares ar my strike price, so someone buys my options, price goes to $100, I missed that $90 per share? I don't understand how I can lose unlimited here. I just don't want to end up owing if someone exercises. I don't even have permission to sell uncovered options so not sure how I could screw this up. \n\nThanks for any help.",
        "subreddit": "options",
        "title": "Just looking to sell some covered calls on Fidelity (have the shares) just a bit confused on which options to pick exactly",
        "url": "https://www.reddit.com/r/options/comments/g2focv/just_looking_to_sell_some_covered_calls_on/",
        "created": 1587075270.0
    },
    {
        "author": "tftciguess",
        "created_utc": 1588044741,
        "id": "g9frxw",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "So I have an HSA - currently sitting in cash, Fidelity is my provider.\n\nI've looked into SPRXX, but the net expense ratio is a little high for my taste. I'm not a yield chaser by any means, but Schwab has spoiled me with the low expense ratios.\n\nAny suggestions for low risk options to invest, with lower expense ratios?",
        "subreddit": "investing",
        "title": "HSA - suggestions on investment vehicles",
        "url": "https://www.reddit.com/r/investing/comments/g9frxw/hsa_suggestions_on_investment_vehicles/",
        "created": 1588073541.0
    },
    {
        "author": "sarnobat",
        "created_utc": 1586477240,
        "id": "fy3rn6",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "A couple of years ago I never used to consider purchasing company stocks because brokerages would charge ~$10 per transaction.\n\nAround early 2019 I suddenly noticed Fidelity, Vanguard and TD Ameritrade became 100% commission free which was a pleasant surprise (though it has made my choices more complicated).\n\nWhat made this possible? The only thing I can think of is that a whole generation of young people becoming educated in investing made the total available clients for brokerages so much bigger so they had to sacrifice transactional profit for customer lifetime profit. Is there more to the story than that, or is that even true?",
        "subreddit": "StockMarket",
        "title": "What made commission free trading so widescale?",
        "url": "https://www.reddit.com/r/StockMarket/comments/fy3rn6/what_made_commission_free_trading_so_widescale/",
        "created": 1586506040.0
    },
    {
        "author": "poshcard",
        "created_utc": 1588017377,
        "id": "g982lv",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "No fear: Vanguard, Fidelity customers moved into equities",
        "url": "https://finance.yahoo.com/news/vanguard-and-fidelity-investors-didnt-flinch-as-the-market-tanked-123748314.html",
        "created": 1588046177.0
    },
    {
        "author": "jammerdude",
        "created_utc": 1586883467,
        "id": "g19987",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "TL;DR -- Does index investing violate the principle of due diligence for the public investor, resulting in uncalculated systemic risk to the market? What exists for analyzing and protecting against this?\n\nHello, I am a Financial Advisor with 11 years of industry experience (7 managing client investment portfolios). As with most in my profession, I spend the majority of my time working with clients and helping them manage their relationship with their finances/investment capital, and rely very heavily on my firm's investment policy committee for guidance on portfolio management.\n\nFor the most part, I have appreciated the industry's shift over the past 20 years away from transactional investment brokerage relationships, and toward \"managed money\" through financial planners. I believe that overall, the effect has led to stability in the capital markets by encouraging public investors to view themselves as participating in the asset class as a whole, which ensures the commitment of true long-term investment capital, and enables broader adoption of efficient market theory.\n\nHowever... I have concerns that I am\nhoping a CFA, market economist, or anyone with depth in knowledge regarding the structural integrity and plumbing of the markets could potentially help address. \n\nWe have seen significant adoption of the concept that all public investors (i.e. people saving money regularly into their 401k's, IRA's, etc.) should essentially just put their money into an S&amp;P 500 index fund and ignore it, with common references to the idea that \"80% of portfolio managers historically do not outpace the index. So why pay fees for them to underperform?\" This makes sense... Until you think about it from a standpoint of blind market inflows. If conventional consumer wisdom leads to disproportion amount of capital going blindly into index funds (and thus buying the underlying securities held within) what is in place to keep prices in check with value?\n\nWhat I fear is that this concept violates the principle of due diligence, on a mass scale, and thus, could lead to systemic problems we are not yet fully aware of. Regardless, companies like Vangaurd and Fidelity lead market growth by helping average people invest into low-cost, passively diversified portfolios without much thought or due-diligence of their own on the underlying securities they are buying. I think it's great for the most part, but I'm just not sure how it will play out for market stability and balance of powers in the long run.\n\nAre you aware of any mechanisms or theories about where this behavior will lead the investment community (and global economy) if it continues to mature along its current continuum?\n\nI am also curious to know if there may be some convenient meta market analysis tools or reports for evaluating market inflows, outflows, and the current distribution of ownership within the capital markets (% owned by retail investors, vs institutional investors, vs where investors are at in life stage, etc.), -- I believe this would also inherently provide a snapshot of reality of the distribution of capital power. For example, broad distribution by owner type could help provide some clarity on what impact corporate stock buy-backs have on the market, by looking at it in terms of control as a % of the whole of market capital, rather than just looking at effect on stock price.\n\nI'm sorry this is so long, and I hope you appreciate the rabbit-hole thought train i'm headed down. Would love to hear your thoughts on any of this! -- Thanks",
        "subreddit": "investing",
        "title": "The Systemic Risk of Index/Passive Investing",
        "url": "https://www.reddit.com/r/investing/comments/g19987/the_systemic_risk_of_indexpassive_investing/",
        "created": 1586912267.0
    },
    {
        "author": "applesNoranges98487",
        "created_utc": 1587140291,
        "id": "g3542t",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "In times like there's where the environment is unprecedented and unstable, what happens behind the scene with actively managed mutual funds?\n\nAre these guys strategizing, cashing out, making moves? or do they sit back and weather the storm? and regroup afterward? Is this what the \"Turnover Rate\" is?\n\n&amp;#x200B;\n\nMy thought is, rather than the average person (DIY investors) trying to manage their own portfolio, wouldn't it be beneficial to just dump everything in one of these funds and let them handle the strategies and brain work?\n\n&amp;#x200B;\n\nno matter what, things will go up and go down in a similar trend in the short term. Mutual Fund/ETF vs the market. but in the long term, shouldn't a managed fund outperform?\n\n&amp;#x200B;\n\nI'm specifically looking at BFOCX, which i already hold a heft chunk of. but I'm considering dumping my S&amp;P and a few others to put into MXXVX. and I'm thinking just to leave that as my portfolio. the 10-Year performance on these two funds has been phenomenal and i can't find any other Fidelity managed funds that compete, the closest in performance i can find is FSCSX.\n\n&amp;#x200B;\n\nany insight and opinion is appreciated. thanks.\n\n&amp;#x200B;\n\nEdit: BFOCX - Fund Manager: Malcolm R. Fobes, $337m, Turnover 980%\n\nMXXVX - Fund Manager: Mark Mulholland, $241m, Turnover 11%",
        "subreddit": "investing",
        "title": "Actively Managed Mutual Funds - Behind The Scene [Seeking Insight]",
        "url": "https://www.reddit.com/r/investing/comments/g3542t/actively_managed_mutual_funds_behind_the_scene/",
        "created": 1587169091.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1587060864,
        "id": "g2kavq",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "options",
        "title": "Fidelity wouldn't allow me to write covered puts.",
        "url": "https://www.reddit.com/r/options/comments/g2kavq/fidelity_wouldnt_allow_me_to_write_covered_puts/",
        "created": 1587089664.0
    },
    {
        "author": "teekitaaka",
        "created_utc": 1587447936,
        "id": "g59kx0",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "For example if I have $5,000 in my trading account, will it not permit to place a limit order for the full value of the $5,000. I’m looking at the Fidelity platform.",
        "subreddit": "investing",
        "title": "Do I need to have excess balance than the total amount needed to purchase stocks?",
        "url": "https://www.reddit.com/r/investing/comments/g59kx0/do_i_need_to_have_excess_balance_than_the_total/",
        "created": 1587476736.0
    },
    {
        "author": "BornaRamblingMan",
        "created_utc": 1587966931,
        "id": "g8us48",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Hi all,\n\nI have mutual funds. My financial advisor sorta picked them for me based on my risk level. \n\nThe best performing fund right now is FIDELITY INSIGHTS CLASS SR B ISC. It's about 15-18% of my portfolio.\n\nMy other funds aren't doing as good right now\n and are below their book value.They are a mix of Canadian stocks, Us energy stocks, bonds, securities, and other funds.\n\nI'm just wondering what the hell I am supposed to think right now?? The only fund that is up rn is a medium risk one. What is the point of the other funds that are supposed to be low risk bonds/securities if they are losing money? I am thinking what I want to do is keep just 2 or 3 funds and turn the rest into passive index etf's. I have still a lot of research to do though. Or should I just get rid of all the funds and transfer the account over to a self managed account?\n\nI've read that the NASDAQ was up 35% last year and is only down 3.2% this year so far.. so if I was just in an index fund like that would I be better off?\n\nAny help/advice is appreciated.",
        "subreddit": "CanadianInvestor",
        "title": "Am I missing something?",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/g8us48/am_i_missing_something/",
        "created": 1587995731.0
    },
    {
        "author": "jhcooper_7",
        "created_utc": 1586082455,
        "id": "fvbqow",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "I was looking to invest in specific shares (e.g. $KO) but a search of investments doesn't bring it. Is it possible to do this?",
        "subreddit": "investing",
        "title": "How to buy specific shares with my Fidelity UK ISA? Am I missing something?",
        "url": "https://www.reddit.com/r/investing/comments/fvbqow/how_to_buy_specific_shares_with_my_fidelity_uk/",
        "created": 1586111255.0
    },
    {
        "author": "Zen_Flow",
        "created_utc": 1586416237,
        "id": "fxnt3r",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": " \n\nFirst time investor here; read Millionaire Teacher by Andrew Hallam a few months ago and it changed my life.  I’ve always been in demanding salary jobs and I’m looking to reclaim time in my life.  I’m in my early 30’s with zero baggage and I’m looking to potentially retire before 40 by moving to a much lower cost of living location somewhere in the world and travel around, plus take on a lower paying lower stress job just as supplemental income only.  Also looking to get into out of state real estate for additional passive income.  I’m not planning on kids, or settling down in one area.  I need freedom.  This virus is the perfect time to invest but I need a little guidance; no one in my network invests.    \n\nEmergency funds: &gt;1 year \n\nDebt: None\n\nTax Filing Status: Single\n\nTax Rate: 32% Federal, 9.3% State\n\nState of Residence: CA\n\nAge: 32\n\nDesired Asset allocation: 80% stocks / 20% bonds (not stuck on this)\n\nDesired International allocation: 15% but not stuck on this\n\nCurrent total portfolio: Haven't started investing yet, but I have low 6 figures cash available to invest immediately\n\nCurrent retirement assets\n\nTaxable - Fidelity\n\n$250K cash\n\nNothing invested yet\n\n&amp;#x200B;\n\n401k - Fidelity\n\n$33K cash\n\n$100K - FBGRX ( Fidelity® Blue Chip Growth Fund) (.8%)\n\nNo company match\n\n&amp;#x200B;\n\n401k - Betterment\n\n$5K - 90/10 stocks/bonds\n\nNo company match\n\n&amp;#x200B;\n\nNew annual Contributions\n\n$5K annually invested Betterment 401k (Zero employer match)\n\n$0 IRA/Roth IRA\n\nQuestions:\n\n1. For the Fidelity 401K, it seems to make sense to dump the FBGRX, and purchase a zero/low cost passive mutual fund to save .8% fees.  How about FNILX (Fidelity ZEROSM Large Cap Index Fund)?  Any suggestions for a bond fund that would complement this for the 401K?  Does it make sense to sell it all off and then buy in now?  \n2. Does it make sense to annually max out my 401K given my retirement goals?  I’d like to be able to pull money only if it’s absolutely needed but there’s still a chance it could happen.  The penalties seem high for early withdrawal.\n3. I’m stuck on choosing between ETFs and passive mutual funds, and it’s really holding me back from diving in.  I will buy and hold for several years, but it seems like the tax efficiency of ETFs may be worth it especially if they do dividend reinvestment.  Both Betterment and Wealthfront both use ETFs.  Does Fidelity offer dividend reinvestment plans on ETFs?  \n4. Can you give me feedback on the proposed allocation and funds for the taxable account.  I listed out options for either ETF for MF depending on which is more advantageous:\n   1. 40% US S&amp;P500 fund: \n      1. Mutual fund opton: FNILX (FIDELITY ZERO LARGE CAP INDEX; 0%); FXAIX (Fidelity® 500 Index Fund; .015%)\n      2. ETF option: VOO (Vanguard S&amp;P 500 ETF; .03%) including many other similar ones\n   2. 20% mid and small cap US fund\n      1. Mutual fund opton:FZIPX (Fidelity ZEROSM Extended Market Index Fund; 0%), FSMAX (Fidelity® Extended Market Index Fund; 0.045%) \n      2. ETF option: VO (VANGUARD MID CAP ETF; .04%); maybe others\n   3. 20% US bonds: \n      1. Mutual fund opton: FMBIX (Fidelity® Municipal Bond Index Fund; .07%), FLTMX (Fidelity® Intermediate Municipal Income Fund; .35%), FMNDX (Fidelity® Conservative Income Municipal Bond Fund - Institutional Class; .25%), FCRDX (Fidelity® Conservative Income Municipal Bond Fund; .35%)\n      2. ETF option: any recommendations?\n   4. 15% international stocks\n      1. Mutual fund opton: FZILX (Fidelity ZEROSM International Index Fund; 0%), FSPSX (Fidelity® International Index Fund; .035%), FSGGX (Fidelity® Global ex U.S. Index Fund; .056%), FTIHX (Fidelity® Total International Index Fund; .06%)\n      2. ETF option: any recommendations?  \n   5. 5% domestic REIT: should I even do this?  If not, I will use this for individual funds\n      1. Mutual fund opton: recommendation?\n      2. ETF option: recommendation?\n\nKey Points\n\n1. I don’t want to be super hands on with this portfolio.  I’d like to rebalance maybe once a month, or once every two months",
        "subreddit": "investing",
        "title": "FIRE 32 y/o First Time Investor Portfolio Review + Questions",
        "url": "https://www.reddit.com/r/investing/comments/fxnt3r/fire_32_yo_first_time_investor_portfolio_review/",
        "created": 1586445037.0
    },
    {
        "author": "Jatin19k",
        "created_utc": 1586074544,
        "id": "fvaesr",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Hi all,\n\nI am a newbie in stock trading. I have tried different brokers in USA i.e. Fidelity, Schwab, IB, Etrade. I want to find the the companies whose stocks had declined by particular % i.e. 50% or so over given period. What tool will be the best for me. I want to scan all the companies available on the stock market. The closest I came across is Fidelity's scanner but that is not meeting my requirement exactly. If anybody can code a piece of software or already has the proprietary tool, I will be happy to pay for it. I can code it by myself but that will take some time so I am willing to pay somebody if they can meet my requirements.  Thanks alot.",
        "subreddit": "stocks",
        "title": "Request for suggestion of a tool - finding biggest losers",
        "url": "https://www.reddit.com/r/stocks/comments/fvaesr/request_for_suggestion_of_a_tool_finding_biggest/",
        "created": 1586103344.0
    },
    {
        "author": "ignorantlearner",
        "created_utc": 1586359998,
        "id": "fx8k4e",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "There has been some talk about people using the CARES Act to take a penalty free distribution out of their 401k by self-certifying they were impacted by COVID-19, and then investing that money. Fidelity has the fine print that says all other methods of liquidity must be tried first and that receipts must be provided proving the funds were used for COVID-19 related hardships. This conflicts with all the reporting that these early penalty free withdraws were honor system based. Anyone tried to do one of these yet? Were receipts required?",
        "subreddit": "options",
        "title": "CARES Act 401k Distribution",
        "url": "https://www.reddit.com/r/options/comments/fx8k4e/cares_act_401k_distribution/",
        "created": 1586388798.0
    },
    {
        "author": "georgesteele130",
        "created_utc": 1585878762,
        "id": "ftzcth",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "I am starting a new job and the default 401k investment is a target date fund. That is what I did with my last job through vanguard but I looked at the performance and the 3 year is 2.58%, the 5 year is 3.8% and the life return is 3.83%. Why is this so low?? The market has been booming! Why should I invest in this?",
        "subreddit": "investing",
        "title": "Fidelity FIAM Index Target Date 2060 Poor Return",
        "url": "https://www.reddit.com/r/investing/comments/ftzcth/fidelity_fiam_index_target_date_2060_poor_return/",
        "created": 1585907562.0
    },
    {
        "author": "JPCary",
        "created_utc": 1586478518,
        "id": "fy45jk",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "I figured since I am mostly cash, besides a few options positions, now would be a good time to transfer brokerages. I’m looking to transfer from Fidelity to TD Ameritrade simply for think or swim. Fidelity has been great but active trader pro is terrible. My question is if I transfer accounts from one broker to the other will my position transfer with my account? Stocks and options?",
        "subreddit": "investing",
        "title": "Transferring brokerages",
        "url": "https://www.reddit.com/r/investing/comments/fy45jk/transferring_brokerages/",
        "created": 1586507318.0
    },
    {
        "author": "Youraverageaccccount",
        "created_utc": 1588183742,
        "id": "gaebcu",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "So there is this gaming company, CD Projekt, that I have had my eye on for some time. Their stock is very small, doesn’t exchange hands frequently. They tend to jump between 18$ and 22$, so I set an alert to let me know when it drops below 20$. It’s at 18.50 today and I can’t buy any shares due to “illiquidity”. I use fidelity by the way. I’ve been waiting a while to buy this stock, and I’d be willing to buy it at up to 20$ a share. Of course I’m only dealing with 150$ as I’ve spent most of my budget for stocks so far. So I placed a limit order of 6 shares at 19$. \n\nFor those seasoned in the stock market, what can I expect? Is there anything I can do to make sure I get some shares in this stock? My belief is that this is a very good company, with a solid balance sheet and good yearly growth. I think it has the chance to blow up over the years and would like to at least get a little money in it now. So any advice would be appreciated. The ticker is OTGLY by the way.",
        "subreddit": "StockMarket",
        "title": "Illiquid securities? Can’t buy a stock I’ve been wanting...",
        "url": "https://www.reddit.com/r/StockMarket/comments/gaebcu/illiquid_securities_cant_buy_a_stock_ive_been/",
        "created": 1588212542.0
    },
    {
        "author": "gypsyphotos",
        "created_utc": 1585963138,
        "id": "fukp6w",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Do any of you follow these SEC Form 4 postings closely? Fidelity posts these on my news feed whenever it happens which is great and cool to see. There were 4 insiders that sold over 38,000 worth of shares which all 4 were filed on April 1.\n\n[Source 1](http://archive.fast-edgar.com//20200403/AWZZE22C3M22AJE222292ZZ2AD5EZ22SYZ22/)\n\n[Source 2](http://archive.fast-edgar.com//20200403/AVZZT22C3M224JE2222U2ZZ2GTVNZ22SY522/)\n\n[Source 3](http://archive.fast-edgar.com//20200403/AWZS522C3M22TJE2222G2ZZ2WERPZ22SY222/)\n\n[Source 4](http://archive.fast-edgar.com//20200403/A2Z8N22C3M22EJE2222N2ZZ2FLDMZ22SY222/)",
        "subreddit": "stocks",
        "title": "Square ($SQ) SEC From 4 sell-offs, do you follow these?",
        "url": "https://www.reddit.com/r/stocks/comments/fukp6w/square_sq_sec_from_4_selloffs_do_you_follow_these/",
        "created": 1585991938.0
    },
    {
        "author": "us7idb",
        "created_utc": 1585873054,
        "id": "ftxuf0",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Anybody knows how to get access to option treding on Fidelity account?",
        "subreddit": "options",
        "title": "Fidelity option",
        "url": "https://www.reddit.com/r/options/comments/ftxuf0/fidelity_option/",
        "created": 1585901854.0
    },
    {
        "author": "DunkinStar",
        "created_utc": 1585940228,
        "id": "fue6ck",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Hello,\n\nI want to diversify my portfolio with around 30% of bonds. Fidelity has suggested to invest into bond ETFs but I was wondering if there are any other routes I could take?\n\nAny suggestions would be great! Thank you so much and stay safe!",
        "subreddit": "stocks",
        "title": "Bond ETF's vs Regular Bonds",
        "url": "https://www.reddit.com/r/stocks/comments/fue6ck/bond_etfs_vs_regular_bonds/",
        "created": 1585969028.0
    },
    {
        "author": "digjam",
        "created_utc": 1587737394,
        "id": "g790t7",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "I am on fidelity..f or stocks it seems fine but for options the researching tools are really clunky I feel. I havent used other ones so not sure whats out there. From my research\n\n* ThinkOrSwim is good and can trade there too\n* TastyWorks is good and can trade there too\n* Barcharts are good for research cant trade there. \n* Etrade seems decent but ToS seems a better option\n\n&amp;#x200B;\n\nAny other opinions?",
        "subreddit": "options",
        "title": "Please share the researching tools for options you use and also which brokerage ?",
        "url": "https://www.reddit.com/r/options/comments/g790t7/please_share_the_researching_tools_for_options/",
        "created": 1587766194.0
    },
    {
        "author": "j23k3jjfkf",
        "created_utc": 1586469470,
        "id": "fy1l6x",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "does anyone know why there is always 2 cents left over after buying partial shares with the fidelity mobile app? Its no big deal, just wondering.",
        "subreddit": "investing",
        "title": "partial shares with fidelity question",
        "url": "https://www.reddit.com/r/investing/comments/fy1l6x/partial_shares_with_fidelity_question/",
        "created": 1586498270.0
    },
    {
        "author": "MountainHawkII",
        "created_utc": 1587153265,
        "id": "g3976n",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Called their Tech Support about freezing charts, balances and stock market prices.\n\nCalled them 3 times in the last weeks.  Still no solution.\n\nAre you experiencing the same?",
        "subreddit": "investing",
        "title": "Rant about Fidelity Active Trader Pro",
        "url": "https://www.reddit.com/r/investing/comments/g3976n/rant_about_fidelity_active_trader_pro/",
        "created": 1587182065.0
    },
    {
        "author": "patsyl115",
        "created_utc": 1587838438,
        "id": "g7yato",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "I currently have my Roth IRA in the Fidelity Freedom® Index 2065 Fund and I was just wondering if it would be a good idea to change that at all (once I get all the money back I lost from carona) or if that is fine to just keep putting money in",
        "subreddit": "investing",
        "title": "Should my Roth IRA be in a target date fund?",
        "url": "https://www.reddit.com/r/investing/comments/g7yato/should_my_roth_ira_be_in_a_target_date_fund/",
        "created": 1587867238.0
    },
    {
        "author": "575MV12",
        "created_utc": 1587844322,
        "id": "g802ui",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "I want to make the jump from TD Ameritrade to Fidelity, but would like some confirmation first regarding their fee structure. \n\nCurrently, I have to profit **at least** $14.00 on a penny-stock before I can make *actually* sell it for a profit. \n\nIf Fidelity does, in fact, have commission-free OTC, then I can literally just make $0.10 on my entire shares combined and still sell for a 0.10 profit. \n\nPlease let me know. Thank you fellow stockers :)",
        "subreddit": "pennystocks",
        "title": "Can someone confirm whether Fidelity has commission-free OTC trades, unlike TD Ameritrade which charges $6.95 per buy and sell ($13.90 total)?",
        "url": "https://www.reddit.com/r/pennystocks/comments/g802ui/can_someone_confirm_whether_fidelity_has/",
        "created": 1587873122.0
    },
    {
        "author": "the_ultimate_trader",
        "created_utc": 1587055707,
        "id": "g2ilgv",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "I made a stupid mistake by placing 1 limit order for a position I had, then forgot about it and placed another one. Somehow fidelity executed both.  \n\nI essentially sold to close 1 contract twice.  \n\nWhat do I need to do to revert the second \"sell to close\"? Do I need to buy to open?",
        "subreddit": "options",
        "title": "Made a Mistake - Sell to Close twice for same contract!",
        "url": "https://www.reddit.com/r/options/comments/g2ilgv/made_a_mistake_sell_to_close_twice_for_same/",
        "created": 1587084507.0
    },
    {
        "author": "applesNoranges98487",
        "created_utc": 1586051061,
        "id": "fv5nl6",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Hi. I currently don't have children, but plan on it in the near future. I'm in a position to start preparing for this, so i was looking into a 529 account (through Fidelity). \n\nThis is something I would like to start investing towards, but due to the penalties, if I withdraw for other reasons, I'm wondering if there's a better way to go about this. say, the chance I don't have children in the future. \n\nWould just a regular account be a better idea and invest in a few mutual funds or ETFs? \n\nany thoughts or suggestions would be appreciated.",
        "subreddit": "investing",
        "title": "Investing in 529 for childs college - Planning, FL, No Kids",
        "url": "https://www.reddit.com/r/investing/comments/fv5nl6/investing_in_529_for_childs_college_planning_fl/",
        "created": 1586079861.0
    },
    {
        "author": "Lithium-Fluoride",
        "created_utc": 1588011222,
        "id": "g962mh",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "I’m looking into investing small amounts into a mutual fund every month, and I’m not sure where to go.\n\nI’ve been reading about RobinHood,  Ameritrade, Fidelity and the like, and I can’t tell which one would be best for my purposes. \n\nI’m pretty low on funds, so I’ll only be putting $100 or so in every month, at least at first. Also, I was thinking about investing a larger sum at first, while the prices are so low. \n\nAny advice on how I can best avoid fees and get the best prices?\n\nAlso, is there a downside to High Dividend mutual funds that I can’t see? They seem good, but I’m so green. My friend (finance major) said SPY and SPYG might be the way to go...",
        "subreddit": "StockMarket",
        "title": "First-time investor seeking advice",
        "url": "https://www.reddit.com/r/StockMarket/comments/g962mh/firsttime_investor_seeking_advice/",
        "created": 1588040022.0
    },
    {
        "author": "bd_1984",
        "created_utc": 1586534868,
        "id": "fyiopu",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "I contribute the max amount to my 401K, but that's about it. I'm looking to invest in some additional mutual funds in a Roth IRA. I'm specifically looking at the following to get me started (will add more later):\n\n1. FSCSX — Fidelity Select Software &amp; IT Services\n2. FSMEX — Fidelity Select Medical Technology and Devices\n\nI know noone can predict the market, but I'm wondering if now is a good time to get in or if I should wait until the market goes down again? Should I even be worrying about this when it comes to long term investments? Should I be talking to a financial advisor, since I don't really know what I'm doing?",
        "subreddit": "investing",
        "title": "New to investing. Is now a good time to start?",
        "url": "https://www.reddit.com/r/investing/comments/fyiopu/new_to_investing_is_now_a_good_time_to_start/",
        "created": 1586563668.0
    },
    {
        "author": "ScaryMonster3",
        "created_utc": 1587061650,
        "id": "g2kjw7",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "So most of my investment currently is in S&amp;P500 with Fidelity (FXIAX or IVV).\n\nI have been looking at all the favs (FAANG, Micrsoft, etc) and these are all stocks that have bounced back nicely, if not at ATH. They continue going up but i personally dont see any value in these. We are not getting a discount on these. Do I think they will continue going up for long term? Most likely, but I am also afraid that there is a tech buble that is forming. Hence, I am staying away from these for the time being. There may be another drop and will strongly consider these at that point.\n\nAnyways, these are the leaders from the S&amp;P500. The laggards are the obvious cruiselines, airlines, etc. I am also trying to avoid them with a 10 feet pole.\n\n My question is looking at these S&amp;P500 and trying to figure out where there is still value and try to pick these up. Nobody knows the extent of Coronavirus but these companies are significantly large and will bounce back in a couple months to a couple years. What do you guys think?? These are just some on top of my head\n\nKhols - 65% down\n\nMGM - 60% down\n\nNordstrom - 58% down\n\nWynn - 50% down\n\nGE - 44% down",
        "subreddit": "investing",
        "title": "Investing Strategy Feedback",
        "url": "https://www.reddit.com/r/investing/comments/g2kjw7/investing_strategy_feedback/",
        "created": 1587090450.0
    },
    {
        "author": "gtadominate",
        "created_utc": 1587841420,
        "id": "g7z7s7",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Ive spent the last few days researching but the more I read the more different takes I get. 34 year old with about 5k to start with.\n\nHere are my goals. I want to pick and choose the stocks I want to invest in by myself. A thousand in this, a hundred in that, etc. I want to watch my portfolio grow/contract with fancy graphs. I don't want to be charged fees and want flexibility on when I can move around my money in/out of stocks at will.\n\nIs fidelity for me? Thank you, any other advice I will take.",
        "subreddit": "stocks",
        "title": "Fidelity",
        "url": "https://www.reddit.com/r/stocks/comments/g7z7s7/fidelity/",
        "created": 1587870220.0
    },
    {
        "author": "king-henryXIV",
        "created_utc": 1587740294,
        "id": "g79u8c",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Hello everyone,\nSo I’m pretty new to the investment game and one of my good buddies was over one night and talking about Roth IRAs and why I should open one. I ended up doing a bit of research and decided it was the right call for me, so I opened one online through fidelity. I set it up and put money into it, but was a little confused about where/what to invest in and was wondering if anyone had any general tips for just starting out. This is pretty much my first experience with an account like this so all advice is welcome.",
        "subreddit": "investing",
        "title": "21 with my first Roth IRA",
        "url": "https://www.reddit.com/r/investing/comments/g79u8c/21_with_my_first_roth_ira/",
        "created": 1587769094.0
    },
    {
        "author": "Genericwhitemale86",
        "created_utc": 1587597271,
        "id": "g6bo5d",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Currently I have a 401k and IRA I contribute to, but I was wondering what the best type of account to use to trade regularly with low to be fees and no minimum balance required(I don’t want to just dump 25k into a fidelity active trader account to meet their minimum). Can someone explain the differences between a brokerage account and a day trading account and which may be best for someone who buys under and IRA for long term stuff, but is looking to get more aggressive? If this question would be better answered under another sub please let me know. Thank you!",
        "subreddit": "stocks",
        "title": "Types of trading accounts? Which is best for someone newer?",
        "url": "https://www.reddit.com/r/stocks/comments/g6bo5d/types_of_trading_accounts_which_is_best_for/",
        "created": 1587626071.0
    },
    {
        "author": "Kafka_Wildflower",
        "created_utc": 1587155553,
        "id": "g39w7u",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "I am currently invested in equity funds (such as the Fidelity Index World fund, which is largely concerned with global shares), and am unsure as to what exactly would happen to the value of my portfolio if there were to be a dollar collapse.  As this is in an ISA, I am reluctant to withdraw my investment.\n\n&amp;#x200B;\n\nIn the theoretical, although not impossible, scenario of the collapse of major fiat currencies around the world, how would my portfolio be valued?  Could it be revalued in the future in a separate currency, and retain some value?\n\n&amp;#x200B;\n\nI would appreciate it if someone could shed some light on this.\n\n&amp;#x200B;\n\nEdit \\~ Apologies for the mistakes in the title ",
        "subreddit": "investing",
        "title": "If there was a collapse of the dollar, what would happen to stock and shares shares?",
        "url": "https://www.reddit.com/r/investing/comments/g39w7u/if_there_was_a_collapse_of_the_dollar_what_would/",
        "created": 1587184353.0
    },
    {
        "author": "Marskid3165",
        "created_utc": 1587281057,
        "id": "g43jj5",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "I have a traditional IRA with $4k balance that was rolled over from my old job and it’s been sitting in my bank for years.\n\nI’m thinking about converting it to a Roth at Fidelity and pay the taxes now since I’m at a lower tax bracket (27y/o, $55k annual income) and then put that money to work by investing in the total stock market.\n\nIs it there advantages (or disadvantages) to making the move right now? I heard about CARES Act, but not enough to know if it will effect me in any way in my case...",
        "subreddit": "investing",
        "title": "Backdoor Roth during COVID-19",
        "url": "https://www.reddit.com/r/investing/comments/g43jj5/backdoor_roth_during_covid19/",
        "created": 1587309857.0
    },
    {
        "author": "carbonazo",
        "created_utc": 1587633744,
        "id": "g6jjzw",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Hi all. Sorry for the noob question but I’m holding DECN shares but I can’t find where to listen to the conference call live. I’m on fidelity but I was wondering at what time the conference call is scheduled on April 23rd and how can I listen to it live? Thanks!",
        "subreddit": "pennystocks",
        "title": "DECN: where to listen to news conference call?",
        "url": "https://www.reddit.com/r/pennystocks/comments/g6jjzw/decn_where_to_listen_to_news_conference_call/",
        "created": 1587662544.0
    },
    {
        "author": "Finance_Questions23",
        "created_utc": 1587522832,
        "id": "g5t1uu",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Fidelity just announced the creation of 8 new \"Thematic Disruptive Funds\", with decreasing expense ratios based on how long you own them. Basically a loyalty program for shareholders, for funds that invest in disruptive technology across different sectors (there's also an all in one fund). \n\n**Expense Ratios:** \n\nYear 1 - 1%\n\nYear 2 - .75%\n\nYear 3 - .50%\n\n**Here's the press release:** \n\n[https://www.fidelity.com/bin-public/060\\_www\\_fidelity\\_com/documents/press-release/thematic-funds-launch-042120.pdf?mod=article\\_inline](https://www.fidelity.com/bin-public/060_www_fidelity_com/documents/press-release/thematic-funds-launch-042120.pdf?mod=article_inline) \n\n**Corresponding Market Materials with links to individual funds objectives:**\n\n [https://www.fidelity.com/mutual-funds/investing-ideas/disruption](https://www.fidelity.com/mutual-funds/investing-ideas/disruption) \n\n**Thoughts?** \n\nI think this is a marketing gimmick like the Zero Index Funds personally. Curious to see what other people think. Interesting idea on the loyalty pricing, perhaps an evolution on Vanguards share pricing structure based on minimums. Don't know if I'm sold on the idea though with the race to zero.",
        "subreddit": "investing",
        "title": "Fidelity introduces loyalty based pricing for 8 \"Disruptive Funds\"",
        "url": "https://www.reddit.com/r/investing/comments/g5t1uu/fidelity_introduces_loyalty_based_pricing_for_8/",
        "created": 1587551632.0
    },
    {
        "author": "Mergoog",
        "created_utc": 1585951209,
        "id": "fuhgvr",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "I put in $5500 into Ally Invest then realized a few days later Ally's shortcomings. Since the $5500 has not changed, can I just withdraw and create a different Roth account or do I need to wait until next year to create another?\n\n&amp;#x200B;\n\nThanks ahead of time for tolerating my ignorance.",
        "subreddit": "investing",
        "title": "If I open a Roth IRA with Ally then want to switch to Schwab, Fidelity etc...how does that work tax wise?",
        "url": "https://www.reddit.com/r/investing/comments/fuhgvr/if_i_open_a_roth_ira_with_ally_then_want_to/",
        "created": 1585980009.0
    },
    {
        "author": "bisystemfail",
        "created_utc": 1588168896,
        "id": "ga9zu5",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Ok, so. I fell into the retail investor mistake of buying USO at around $3; after holding strong for a while I kept reading about how it wasn’t going up again and that it doesn’t work like a regular stock or ETF. I finally caved and sold yesterday at a loss (I had like 8 shares, it was honestly not a huge hit) \n\nMY QUESTION IS: \n\nShould I have braced the storm and held until today? What happened? The chart for the ETF isn’t showing the very low prices that were there (I trade through fidelity) as if it were never under $15. \n\nAm I just to ignorant to understand what’s going on? What would you have done?",
        "subreddit": "investing",
        "title": "USO opens at about $18",
        "url": "https://www.reddit.com/r/investing/comments/ga9zu5/uso_opens_at_about_18/",
        "created": 1588197696.0
    },
    {
        "author": "us7idb",
        "created_utc": 1585776008,
        "id": "ft8wzv",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "If I have to many brokerage account, TD Ameritrade, Fidelity, Schwab, Robinhood, it will somehow affect me, should I close them?",
        "subreddit": "options",
        "title": "Brokerage account",
        "url": "https://www.reddit.com/r/options/comments/ft8wzv/brokerage_account/",
        "created": 1585804808.0
    },
    {
        "author": "Diablo24Ever",
        "created_utc": 1585787848,
        "id": "ftcc1i",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Hey folks, I understand that investing is highly dependent on what your goals are. Much the same as choosing a car or a gun. Everyone has what they like or trust and that very much depends on what the use is. I think to get the point. So, here’s a bit about my goals, my portfolio and why I chose what I did. Please feel free to rip me apart, I can handle it.\n\n1) My reason for investing: guys, I was in middle school when 9/11 happened and something I’ll never forget is when 6 or 8 months after, I heard someone talking about what a great investment they made in airline stocks right after the terrorist attacks. I was like god damnit, that makes good sense. Fast forward, I’m watching this pandemic kick the worlds ass. Now, please, I’m not saying 9/11 and COVID19 are the same things, save your breath. I’m saying, I’m finally in a spot to POSSIBLY take advantage of irregular investment opportunities. \n\n2) My goal: I’m not nor will I ever have the cast iron balls to day trade or make r/wallstreetbets. I am willing and happy to put my money into conservative spots and let it rest for 1-2 maybe 5 years. This is not for retirement, I have a 401k through my employer for that, so keep that in mind. It is my intention to sell this portfolio after it has made some gains whenever that may be. I know I know, we may not have a v shaped recovery or whatever, I’m fine with that. I’m not putting rent money into my trading account.\n\n3) Portfolio: alright, here is where I need feedback. Without beating around the bush, here’s what I did... I decided to start with a broad set of ETFs. After lots of reading and combing through a HUGE watch list for weeks, I cannot find better price/quality in ETFs than Fidelity. Here’s why: expense/management ratios are low for most of their sector ETFs. They have decent asset holdings, most around 500M which should keep them afloat fine. They have great Morning Star ratings (not a huge deal to me, but okay). They have lower entry points than Vanguard which obviously I like a lot, but I feel are a bit spendy per share. And finally, they have good trade volume.\n\nHere are the ETFs I’ve selected with varying weight across them.\n\nDGRO\nFCOM\nFENY\nFHLC\nFMAT\nFNCL\nFSTA\nJETS\nFREL\nFDVV\nFUTY\nFIDU\nFTEC\nFDIS\n\n4) What’s next: my goal is to slowly add positions to these ETFs and hopefully dollar cost average as the market probably slides over the next month. After that, I will start isolating single stock shares and picking those up. I’m interested in oil tanker stocks, food delivery stocks and a few duh picks like Disney.\n\nTalk to me boys, any gaps in my logic?",
        "subreddit": "investing",
        "title": "Rate my portfolio, please",
        "url": "https://www.reddit.com/r/investing/comments/ftcc1i/rate_my_portfolio_please/",
        "created": 1585816648.0
    },
    {
        "author": "withthepotboy",
        "created_utc": 1586356954,
        "id": "fx7nt1",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "I'm trying to execute a short sale on Fidelity, and the customer service team is telling me that there are 0 commissions and 0 interest on the borrowed shares (assuming that there are enough securities to lend to). So essentially there are 0 transactions costs to the lender to borrow the shares or am I missing something?",
        "subreddit": "investing",
        "title": "Question about shortingy",
        "url": "https://www.reddit.com/r/investing/comments/fx7nt1/question_about_shortingy/",
        "created": 1586385754.0
    },
    {
        "author": "kway_lood",
        "created_utc": 1586697864,
        "id": "fzwp4y",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "I’m new stonks. I’ve been watching for a long time and given the current state of the market I decided it would be a good time to get some skin in the game. I transferred 1k (not much I know but I’m just trying to get my feet wet) to my Fidelity account. So let me get to the point here: Would it be a good strategy to play UCO and SCO off of each other this week? I think given the news we are gonna see huge gains and losses within a short time period. What do you guys think?",
        "subreddit": "stocks",
        "title": "UCO and SCO",
        "url": "https://www.reddit.com/r/stocks/comments/fzwp4y/uco_and_sco/",
        "created": 1586726664.0
    },
    {
        "author": "TimeToMakeD0nuts",
        "created_utc": 1588256540,
        "id": "gawkd8",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Hey Guys,\n\nFirst time poster on here and I had a question about my 401k allocation. I currently have a Roth 401k through my employer (they use Fidelity), and I'm heavily invested in stocks. I'm 27 and I'm trying to be aggressive in my investments so I think this is the right approach, but my portfolio is currently allocated between FXAIX (85%) and Vanguard 2055 target (15%). \n\nMy concern is if there is too much overlap between these two investments? For example, I don't have much foreign stock in my portfolio and the current allocation is heavily focused on domestic stock. I'm curious to hear what anyone's input is on this allocation? Relatively new to investing in general, so any input is greatly appreciated!",
        "subreddit": "investing",
        "title": "Change Roth 401k Investment Allocation?",
        "url": "https://www.reddit.com/r/investing/comments/gawkd8/change_roth_401k_investment_allocation/",
        "created": 1588285340.0
    },
    {
        "author": "ElJefeBets",
        "created_utc": 1585756571,
        "id": "ft2e4z",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Created in September 2018, this large cap index fund consists of just over 500 stocks with the highest market capitalizations in the U.S. market. What is most unique about it is that it has an expense ratio of 0%!\n\nZero costs for this fund means that shareholders get to keep every penny of what their stocks deliver in 2020 and beyond. Given its **strong** but **short** track record of delivering good returns, is this fund a good long term investment versus the other options out there? Which funds would you choose over this fund, and why?",
        "subreddit": "investing",
        "title": "Thoughts on the Fidelity ZERO Large Cap Index Fund (FNILX)?",
        "url": "https://www.reddit.com/r/investing/comments/ft2e4z/thoughts_on_the_fidelity_zero_large_cap_index/",
        "created": 1585785371.0
    },
    {
        "author": "the_underdog01",
        "created_utc": 1585771965,
        "id": "ft7mp0",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Lately, there’s a particular stock I’ve been playing with. Every few days, I may end up selling a little when I feel it is overpriced, then buy when it comes down a little. But I’ve noticed the cost basis on Fidelity is really inconsistent. Sometimes, it’ll add the cost basis onto a package that I bought for a higher price, and doesn’t even reflect the shares I just bought at the current price point. Does anyone know why??",
        "subreddit": "stocks",
        "title": "Cost basis is inconsistent on Fidelity?",
        "url": "https://www.reddit.com/r/stocks/comments/ft7mp0/cost_basis_is_inconsistent_on_fidelity/",
        "created": 1585800765.0
    },
    {
        "author": "NononoTHATSthegroom",
        "created_utc": 1585856845,
        "id": "ftt3hk",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Hello, \n\nI am new to investing, but know how it all works. I have a fidelity account from a previous employer (was first job out of school, only there for a year,) that had about $3500 in it. I forgot about this account and the money was sitting there not invested in anything (new employer doesn’t use fidelity)so I figured I’d jump on some stocks the last week. \n\nI made some moves and invested in a couple of strong companies. Up until yesterday I was in the green (think I was +300 at my highest). Now it seems prices are creeping down. \n\nMy question is, should I cut my losses (only down -97.21), sell and buy in at some of these of lower prices? All stocks I invested in the price hasn’t dropped more than  $10 so it seems I did invest close to the bottom ( I know it can/will get worse) so I think I’m still at a low enough place where I can make money when things start to trend upward again. \n\nI have been buying a small number of some stocks when they dipped again late yesterday/today , but do you think it would or would not be a waste to sell off these shares just to reinvest less than $10 lower?",
        "subreddit": "stocks",
        "title": "Cut my losses or stay in?",
        "url": "https://www.reddit.com/r/stocks/comments/ftt3hk/cut_my_losses_or_stay_in/",
        "created": 1585885645.0
    },
    {
        "author": "rb1754",
        "created_utc": 1587313344,
        "id": "g4afao",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Hi Folks,\n\nI'm by no means an expert, so I'm just looking for some advice. COVID-19 shut down my business probably for 8-12 months and I figure if there's another steep drop in the market I'd take whatever funds I was using for operation and dollar cost average into a few Fidelity ETF's / Funds. I do need this money though when things eventually return to normal, so because my outlook is so brief, I've also been struggling with the idea that maybe I should just leave it in cash and collect the interest.\n\n&amp;#x200B;\n\nAny opinions or advice would be appreciated.",
        "subreddit": "stocks",
        "title": "Need advice for short-term investing (8-12 month outlook)",
        "url": "https://www.reddit.com/r/stocks/comments/g4afao/need_advice_for_shortterm_investing_812_month/",
        "created": 1587342144.0
    },
    {
        "author": "sbacksch",
        "created_utc": 1587479456,
        "id": "g5g8we",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "Best Roth IRA Index Fund with Fidelity",
        "url": "https://www.reddit.com/r/investing/comments/g5g8we/best_roth_ira_index_fund_with_fidelity/",
        "created": 1587508256.0
    },
    {
        "author": "songtailor",
        "created_utc": 1587851273,
        "id": "g821oi",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "So I have some money in the OTC stock DECN. A bit over $1,500. They've been recently suspended by the SEC. CEO insists that they can get FDA clearance for their Covid-19 blood tests and they're already a diabetes testing supply company. However, the stocks hit the floor in a massive trade drop where somebody sold off like 1.6 million shares. It went up to $0.46 a share and fell back down to like $0.215. I bought in around $0.24 and $0.28. After it fell, the SEC suspended the stock and they have reset it to the $0.275 that it was at before and nullified the day before when it fell. \n\nApparently it is suspended until May 7. A PR report is supposed to come out Sunday per the CEO. Should I sell as fast as possible to recover what I can when it opens back up in May? Is that money officially \"mine\" once I sell or are they going to place this stock on  hold again and hold more transactions? Obviously, they have to release  it at some point or just refund everyone the $0.275 that they've reset it to. \n\nWondering  how fast this is going to drop at opening. Is there a way to pre-trade before the market opening with an OTC pink slip stock? I do have after hours trading with Fidelity,  but it always gives an error message if before 9:30am and says OTC pink  slips can't be traded before market opening.",
        "subreddit": "stocks",
        "title": "Is there a way to get money back from DECN?",
        "url": "https://www.reddit.com/r/stocks/comments/g821oi/is_there_a_way_to_get_money_back_from_decn/",
        "created": 1587880073.0
    },
    {
        "author": "jagerie",
        "created_utc": 1587750830,
        "id": "g7d1zy",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Wanted to know if the $19500 contribution limit is for all retirement accounts combined or only for 401(k). ?\n\nI have an employer-sponsored 401K at fidelity and I am planning to contribute the full $19500 pretax amount for the year 2020.\n\nI also have a ROTH IRA account at fidelity; can I contribute the maximum contribution limit of $6000  for the year 2020? \n\nDoing this will push my cumulative contribution to my retirement account to $25500.  Is this allowed?",
        "subreddit": "investing",
        "title": "[USA] Is maximum contribution to 401(k) + Roth IRA = $19500?",
        "url": "https://www.reddit.com/r/investing/comments/g7d1zy/usa_is_maximum_contribution_to_401k_roth_ira_19500/",
        "created": 1587779630.0
    },
    {
        "author": "verdict0224",
        "created_utc": 1587753841,
        "id": "g7e0tq",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "The specific one I'm looking into currently is the \\[FIDELITY INTERNATIONAL HIGH DIVIDEND ETF\\]([https://snapshot.fidelity.com/fidresearch/snapshot/landing.jhtml#/research?symbol=FIDI&amp;appCode=](https://snapshot.fidelity.com/fidresearch/snapshot/landing.jhtml#/research?symbol=FIDI&amp;appCode=)).\n\n&amp;#x200B;\n\n\\* YTD -30.33%\n\n\\* 6 Month -27.82%\n\n\\* 52 Week -26.06%\n\n&amp;#x200B;\n\n\\&amp;#x200B;\n\n&amp;#x200B;\n\nThe Fidelity chart shows it's basically tanked... it went from 22.00 in December to less than 14 as of this month. How do you know if something like this is good or bad to invest into? Like what would you weigh in your decision?",
        "subreddit": "investing",
        "title": "If an investment fund (ETF) has tanked over the past year, is it a bad idea to invest in it?",
        "url": "https://www.reddit.com/r/investing/comments/g7e0tq/if_an_investment_fund_etf_has_tanked_over_the/",
        "created": 1587782641.0
    },
    {
        "author": "ronnierobot",
        "created_utc": 1587184842,
        "id": "g3how0",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "These are what I am watching for upward trend next week.  I'll post an update on these next week.  FYI, Im not investing just watching these this week.\n\n$IWM \n\n$SPXL \n\n$TNA \n\n$UPRO \n\n$XLI \n\n$DIS \n\n$UDOW \n\n$IJR \n\n$SYY \n\n$CNK \n\n$WYNN \n\n$VLO \n\n$OKE \n\n$MAR \n\n$DISH \n\n$HILT \n\n$EXPE \n\n$EL \n\n$FIS \n\n$GPN \n\n$IJH \n\n$WM \n\n$PAYX \n\n$XEC \n\n$MMP",
        "subreddit": "stocks",
        "title": "New Trend Monitoring",
        "url": "https://www.reddit.com/r/stocks/comments/g3how0/new_trend_monitoring/",
        "created": 1587213642.0
    },
    {
        "author": "tepir",
        "created_utc": 1588268479,
        "id": "gb0dh7",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "I've been learning about options and I learn best by doing, so I've been experimenting with smaller options trades. I feel I have a good understanding of how buying and selling puts and calls both work, I have dabbled in all 4.   \n\nI currently own a put contract to sell 3 weeks from now. The contract is in the money. I understand that I have the option to Sell to Close, which will means another trader will now own the same contract, in exchange for a flat fee, same as when I bought the contract. The other option is to Exercise the contract. I do not see any button or option to \"Exercise\" these options. Do I have to separately buy the 100 shares first, and then the option will appear? Or do I buy the shares and then sell them and then I will get the option? Furthermore, as Fidelity by default will exercise the contract at close, does that mean they will buy the shares on my behalf and sell them immediately?  \n\nAnd one last question, will I be hit with the normal penalties that go with selling shares of an unsettled trade? This happened to me years ago when I was new to trading. I bought and sold a stock on the same day and my bank called me to issue a warning and suspended trading for 3 days. If this is the case do I have to buy the shares 3 days before exercising the put option?  \n\nThank you very much.",
        "subreddit": "options",
        "title": "Question about the mechanics of exercising options (possibly Fidelity specific)",
        "url": "https://www.reddit.com/r/options/comments/gb0dh7/question_about_the_mechanics_of_exercising/",
        "created": 1588297279.0
    },
    {
        "author": "whossayn",
        "created_utc": 1585795894,
        "id": "fteibo",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Cardlytics is an advertising company of sorts. They essentially partner up with financial services companies and get access to transaction information, which they turn into valuable information that can be used for high return on spend advertising. If you’ve gotten bank of america promotions, or chase bank promotions for certain discounted products- that’s been cardlytics. \n\nNow to my main theses about why i think they’re a great company.\n\n1. Network effects. \n\nNeedless to say, their business model suggests that the more (and larger) FI’s they partner up with, the more valuable they become to advertising customers, and the more advertising customers they attract the more attractive they become to FIs.\n\n2. Switching costs\n\nThe company has disclosed that it can take up to *years* to integrate into an FI partner, this makes sense seeing that their software is embedded deeply within FI’s. Given how lengthy the integration process is, would an FI really switch to a competitor just to get a similar result? (Also remember, network effects help suggest why FIs wouldn’t want to move)\n\n3. Exclusivity \n\nCardlytics has disclosed that FIs typically do not have the capability to integrate more than one advertiser into their business (only one business can be integrated to have access to the transactions). This point speaks for itself.\n\nThese three structural competitive advantages work together very nicely in my opinion to suggest favourable future prospects for this company.\n\n4. Debt Position\n\nIn our current environment it is safe to say lots of debt (obviously considering if lots of earnings can cover it) is not ideal. Cardlytics has almost no debt on its balance sheet. \n\n5. Potential disruptor?\n\nCardlytics is a very unique company and one of the first to engage in this sort of business. The company boasts returns as high at 30:1 for advertising spend. I can easily see this growing in popularity amongst advertisers who *especially coming out of this environment* want the most bang for their buck.\n\nLet me know what you think, this isn’t a “will it go up?” post, i just want to know if people agree with me on the quality of the business, or if there are concerns/ red flags i’ve overlooked.",
        "subreddit": "investing",
        "title": "Cardlytics (check my thinking?)",
        "url": "https://www.reddit.com/r/investing/comments/fteibo/cardlytics_check_my_thinking/",
        "created": 1585824694.0
    },
    {
        "author": "BillNye69",
        "created_utc": 1586013975,
        "id": "fuvj2a",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "I'm hoping to open a brokerage to start DCAing, and wondering how you all decided which one to go with. I've been paper trading with Thinkorswim, I am familiar with Vanguard and Fidelity from my Roth and 401k, and I used to use Robinhood. \n\nHow did you end up picking one?",
        "subreddit": "investing",
        "title": "How did you decide which brokerage to select?",
        "url": "https://www.reddit.com/r/investing/comments/fuvj2a/how_did_you_decide_which_brokerage_to_select/",
        "created": 1586042775.0
    },
    {
        "author": "bcimhappy",
        "created_utc": 1587007217,
        "id": "g27328",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "If we continue to see demand on the supply chain, won't this will make shipping barges more valuable? $DAC is trading pretty close to all time lows and owns and operates containerships in Australia, Asia, Europe, and the United States.\n\nTechnical analysis looks to be a strong buy. Also looks to be \"undervalued\" by [S&amp;P GLOBAL MARKET INTELLIGENCE](https://research2.fidelity.com/fidelity/research/reports/release2/Research/StandardAndPoors.asp)",
        "subreddit": "stocks",
        "title": "Thoughts on shipping barges? Looking at $DAC",
        "url": "https://www.reddit.com/r/stocks/comments/g27328/thoughts_on_shipping_barges_looking_at_dac/",
        "created": 1587036017.0
    },
    {
        "author": "_deathwatch",
        "created_utc": 1587412963,
        "id": "g501lo",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Hey All , \n\nLooking for some advice and opinions on these particular indexes. I want to invest money in them but I would like some honest feedbacks. There’s too many to choose from. \n\nVanguard\nVYM\nVTSMX\nVIGRX\nVEIRX\n\nFidelity\nFBGRX\nFXAIX\n\nSchwab\nSWTSX\nSNXFX",
        "subreddit": "stocks",
        "title": "Advice on these indexes",
        "url": "https://www.reddit.com/r/stocks/comments/g501lo/advice_on_these_indexes/",
        "created": 1587441763.0
    },
    {
        "author": "Harambe_Like_Baby",
        "created_utc": 1586271503,
        "id": "fwlxur",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "So fidelity does a really good job of building disallowed wash sales into your basis for equities and etfs. However,  I haven’t noticed this on options which leads to 1 of 2 possibilities:\n\n1. Fidelity doesn’t display the step up in basis on options\n2. Different strikes/expiries does not result in wash sale\n\nAny one have any experience with this in general or with fidelity specifically? The tax guidance for wash sale on options is pretty ambiguous and unclear.",
        "subreddit": "options",
        "title": "Wash Sale - Fidelity",
        "url": "https://www.reddit.com/r/options/comments/fwlxur/wash_sale_fidelity/",
        "created": 1586300303.0
    },
    {
        "author": "ImOnTheBus",
        "created_utc": 1587785923,
        "id": "g7msjk",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "This question might be too basic and get deleted... \n\nso I am new to this (just started 2 weeks ago but made a cool $800 bucks already AWW YEAH!) \n\nusing Fidelity\n\nSay I have $100 in my account total, and it's all in stock ABC. \n\nI want to sell all of stock ABC and buy $100 of new stock DEF. So I sell stock ABC but if I want to buy stock DEF right away I have to use margin (?) because the sale I just made of stock ABC doesn't settle for 2 or 3 days. (before Fidelity allowed me to use margin it was warning me that I would be breaking \"good faith\" agreement to buy another stock with unsettled funds)\n\n-Is there any increased risk for me to use margin to do that?\n\n-Once the sale of stock ABC settles: does my position with stock DEF automatically change to cash or do I need to do something to change it from margin to cash?\n\n\nAlso: I applied for margin and just got approved for it today and noticed 4 out of 5 of my stocks were tagged \"margin\"..... I don't really know what that means since I had enough money for everything in there... and there was no option to change it, and they all had the tag that they were \"traded today\" even though they were not. I don't really get this.",
        "subreddit": "stocks",
        "title": "Do you use margin? Is it risky if used only to cover what is settling?",
        "url": "https://www.reddit.com/r/stocks/comments/g7msjk/do_you_use_margin_is_it_risky_if_used_only_to/",
        "created": 1587814723.0
    },
    {
        "author": "lemoncakeandchill",
        "created_utc": 1588000402,
        "id": "g92ja4",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "I'm quite new to trading and wondering what happens now that the SEC suspension is over? When I try to do anything with my shares, Fidelity gives the error:\n\nError:(TC9050) Opening transactions for Caveat Emptor are not permitted  because of the risks associated with these securities and all Microcap  securities.",
        "subreddit": "pennystocks",
        "title": "$SOLI?",
        "url": "https://www.reddit.com/r/pennystocks/comments/g92ja4/soli/",
        "created": 1588029202.0
    },
    {
        "author": "syshjjn",
        "created_utc": 1588045681,
        "id": "g9fzpw",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "I have been investing through Betterment because I really like being hands-off and spending zero effort &amp; attention to my investments. However, my investable capital is growing to nearly 1M, so those Betterment's fees will matter more and more. Yet, I do not want to relinquish the simplicity and convenience of something like Betterment. Therefore, I was wondering whether there is any good brokerage (or other robo-like services) where I can hold a similar **taxable** portfolio (i.e. based on booglehead principles) but that it will result in lower fees and that comes with following robo-features that I love:  \n\n\n1) **auto-rebalancing**: Betterment and other robo-advisors have automatic portfolio rebalancing. Note that I do not refer to the type of rebalancing present in target date funds where the rebalancing's goal is to change the portfolio allocation to make it more and more conservative. Instead, I am referring to the rebalancing that preserves the portfolio allocation weights specified at the beginning (e.g. always keeping the portfolio at approximately 70% stock &amp; 30% bond weights). At these robo-advisors, events that trigger this auto-rebalancing include drift (deviation of each asset class from its specified weight), withdrawals/fees, deposits, and allocation change. Additionally, this auto-rebalancing is tax-efficient by minimizing tax costs. It does so by prioritizing selling shares with losses (resulting in realized losses), shares with no gain/loss, shares with long-term gain, and ultimately shares with short-term gain.  \n\n\n2) **fractional share**: Betterment and other robo-advisors are able to invest in fractional shares so that no cash is left uninvested  \n\n\n3) **convenient deposit &amp; withdrawal**: Betterment and other robo-advisors make deposits and withdrawals easy by just asking the amount and handle the rest. In the case of deposits, it will automatically distribute the capital in the portfolio according to the specified portfolio allocation weight (i.e. auto-rebalancing). In the case of withdrawals, it will automatically withdraw according to the same weights (i.e. auto-rebalancing).  \n\n\n4) **automatic dividend reinvesting**: Betterment and other robo-advisors automatically reinvest dividends so that no cash is left uninvested  \n\n\nI have never used a brokerage before, so I dont know whether it is unrealistic to find such features in them or whether they already have them. I have looked at the websites of traditional brokerages like Vanguard, Fidelity, and Charles Schwab, but I couldn't find anything on their website that indicates the presence of the aforementioned features. I have also looked at M1 Finance, and it seems to have everything I need, but they only take US citizens/permanent residents (green card), so it wont work for me.",
        "subreddit": "investing",
        "title": "Best brokerage with robo-like features",
        "url": "https://www.reddit.com/r/investing/comments/g9fzpw/best_brokerage_with_robolike_features/",
        "created": 1588074481.0
    },
    {
        "author": "ifreeski420",
        "created_utc": 1587665587,
        "id": "g6rpeg",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "For the first time in my life, I feel like I am on top of my finances and ready to start growing my wealth. I have $10K in a HYSA as an emergency fund, and enough cash for liquidity. I do not know my exact plans for the next 5 years, but will potentially want money for a big purchase such as a home. If I want to start putting money into the stock market, is it reasonable to just buy something like VTI in my individual account on Fidelity? Will the taxes I would have to pay when cashing out make it not worth it? Any tips would be appreciated. I only have a few thousand for now to invest anyway, but would like to add to that over time.",
        "subreddit": "investing",
        "title": "Where to invest for 0-5 year timeframe?",
        "url": "https://www.reddit.com/r/investing/comments/g6rpeg/where_to_invest_for_05_year_timeframe/",
        "created": 1587694387.0
    },
    {
        "author": "ihabali2",
        "created_utc": 1587716863,
        "id": "g74q5h",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Hi Everyone, yesterday was the worst day for me I lost almost my whole life savings $65k in Oil ETFs stocks and I wasn’t aware that using the margin balance would cause closing my position by the broker (TD Ameritrade) that fast when it goes so much down, and nobody expect those oil prices, TD Ameritrade made a margin call and closed my positions and wiped out my account without a notice, and sold my positions on the low, they know it’s unusual oil price and it will recover because there is an oil cut soon, but they still sold me very fast!! And ruined my life and my family savings! Not sure what do now? And if there is a lawyer can help me about closing my positions! I have a proof of everything!\n\nIf you can help with anything please message me!\n\n[This is a screenshot of positions before they close it](https://i.imgur.com/RDZ0Hdz_d.jpg?maxwidth=640&amp;shape=thumb&amp;fidelity=medium)",
        "subreddit": "stocks",
        "title": "Lost all my savings in the market, I don’t know what to do!",
        "url": "https://www.reddit.com/r/stocks/comments/g74q5h/lost_all_my_savings_in_the_market_i_dont_know/",
        "created": 1587745663.0
    },
    {
        "author": "Junior_Arino",
        "created_utc": 1585856514,
        "id": "ftszx6",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Im kind of new to investing. I'm wondering if the Fidelity Go robo advisor is a good option to use as my savings?\n\nI  invest in couple etfs separately and I also contribute to my 401k through my company. Just wondering if it's a good idea to use the robo advisor for a saving account or just let it sit in my bank.",
        "subreddit": "investing",
        "title": "Fidelity Go robo advisor?",
        "url": "https://www.reddit.com/r/investing/comments/ftszx6/fidelity_go_robo_advisor/",
        "created": 1585885314.0
    },
    {
        "author": "TheWorldConqueror",
        "created_utc": 1587330698,
        "id": "g4fjjc",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "I see some companies that I'm interested in have a direct purchase plan with Computershare. I don't get why I would choose that when there are so many investment fees associated with it. Fidelity on the other hand wouldn't charge me anything to trade shares of the same company.",
        "subreddit": "investing",
        "title": "Can someone explain to me what Computershare is, and why I would use that over something like Fidelity?",
        "url": "https://www.reddit.com/r/investing/comments/g4fjjc/can_someone_explain_to_me_what_computershare_is/",
        "created": 1587359498.0
    },
    {
        "author": "FinallyJoinedReddit0",
        "created_utc": 1586012876,
        "id": "fuv837",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Hello,\n\nFirst post here. 23 Y/O with a full time job in wealth management  looking to finally put about $20k of savings into the market at an opportune time. I can’t think of a better time to start thinking about an entry point for long term investing given the current environment. My personal opinion is that the market hasn’t bottomed from corona. Within the next 1-2 months we will see some serious continuous bleeding of the market due to the US corona virus implications with accelerating cases/numbers (I hope I am wrong).  A lot of it may already be priced in/the market has stabilized a bit and eased the volatility, but I think it’s gonna continue to get worse. \n\nIt is important to understand that investing for the long term does not involve predicting an exact entry point or a “bottom” in the market before we start seeing some rejuvenation.  With that said, I want to start dollar cost averaging into the market with my $20k but given the volatile market and outlook that we will likely bounce back in Q3/Q4 I am looking at a bit of an accelerated dollar cost averaging approach. Thinking like $3-5k at a time with 3-5 different influxes of cash into the market. Or maybe like 1/3 in the month of April, 1/3 in the month of May, and 1/3 in the month of June.\n\nI have maxed out 2019 and 2020 ROTH IRA contributions (6k each) and put another $8k into a taxable brokerage at Fidelity. This is all in cash right now and is my only investable money as of now. I don’t have an asset allocation yet, I’m all cash and this is my first real personal portfolio that I’m starting. My target allocation is probably 80/20 overall and I want to be like 85/90 aggressive in this Fidelity investable money.\n\nWhat ETFs would you suggest? Looking for something a little more outside the box than SPY or VOO for example. In my opinion ETFs are superior to mutual funds given the liquidity and tax advantaged characteristics. Obviously, there are different funds you would put in your IRA than your brokerage, but I am just looking for someone to guide me towards what they did in my position. \n\nIf you choose mutual funds or another vehicle geared towards long term investing, why did you go that route?\n\nThis is my first post and I hope to continue to post and contribute!! Thanks in advance guys!",
        "subreddit": "investing",
        "title": "First-time poster &amp; investor",
        "url": "https://www.reddit.com/r/investing/comments/fuv837/firsttime_poster_investor/",
        "created": 1586041676.0
    },
    {
        "author": "snakebyte0",
        "created_utc": 1585966640,
        "id": "fulkz2",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Hello community!\n\nNew to investing and looking for more knowledge from the community!\n\nI opened a Roth through fidelity and wondering how best to create a portfolio ( I understand it’s based off individual goal. * long term growth for retirement* ). \nIndex or ETF? Combination of the two? 3 fund portfolio?\n\nThank you for your insights",
        "subreddit": "investing",
        "title": "New to investing",
        "url": "https://www.reddit.com/r/investing/comments/fulkz2/new_to_investing/",
        "created": 1585995440.0
    },
    {
        "author": "DDahlman146",
        "created_utc": 1585783785,
        "id": "ftb7il",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Hi everyone,\n\nI’m somewhat of a new investor (been investing in my 401k for 6 years now, and as I reach 30 in October - and with the market at a discount right now (I’m not worried about timing the bottom out or anything. I’m adding money in every day that it’s lower to offset my cost basis), I’m starting to throw extra money into the market in a Fidelity individual brokerage account. \n\nI have a handful of individual stocks but I’m thinking long term growth as well. So I’ve researched Index Funds (ETFs as well) and have poured a couple hundred into FZROX. My question is this - would you advise investing in Index Funds in my individual account, or open an IRA and invest in it through that? I know you CAN do either or, but what would be the best way?",
        "subreddit": "investing",
        "title": "Index investing question",
        "url": "https://www.reddit.com/r/investing/comments/ftb7il/index_investing_question/",
        "created": 1585812585.0
    },
    {
        "author": "SeveralPlatform9",
        "created_utc": 1586788424,
        "id": "g0k2iu",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "RobinHood",
        "title": "Robinhood Vs Fidelity Question",
        "url": "https://www.reddit.com/r/RobinHood/comments/g0k2iu/robinhood_vs_fidelity_question/",
        "created": 1586817224.0
    },
    {
        "author": "jckonln",
        "created_utc": 1587093519,
        "id": "g2tyrr",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Am I right that these graphs mean that some huge institutional investor is making big buys in the aftermarket? Given the stair step look of them, it seems like it would have to be huge buys. Maybe it’s because it’s not based on real time info but Fidelity app shows similar graphs.\n\nI’ve seen it in several stocks. Mostly real estate, gaming, and oil.  \n\nhttps://imgur.com/a/B1VRVoL",
        "subreddit": "stocks",
        "title": "Am I right that these graphs mean that some huge institutional investor is making big moves in the aftermarket?",
        "url": "https://www.reddit.com/r/stocks/comments/g2tyrr/am_i_right_that_these_graphs_mean_that_some_huge/",
        "created": 1587122319.0
    },
    {
        "author": "Classicdink",
        "created_utc": 1588047268,
        "id": "g9gcvz",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Hello Reddit world,\nI am a college student who is seriously trying to look long term in life. I want to start investing early and maybe get involved in real estate, but I have a few questions.\n1) There are a lot of good stock investing websites, but it sounds like TD Ameritrade, Fidelity, and ETrade are the most talked about. What is the best choice here?\n2) Real estate seems intriguing to me, and I have been heavily thinking about flipping houses. The thing is, I have very little \"handyman skills\". I thought about committing this summer to learn a skill to help me, but I'm not sure what would help the most.\n3) Is there some website or some app that can help me do my own taxes and understand? I heard there are a lot of ways to save money by filing different ways, and am interesting in learning about these tax advantages.\n4) I want to start my own lawn care business because I think it will teach me good life skills, like planning and communication. I've heard of people doing this in the past, does anyone have any advice or life experiences here?\n5) I'm tempted to put social media aside and focus on the important things in life. Keeping important apps on my iPhone (productivity category) and deleting instagram, facebook, snapchat is a hard one because I am in group chats with a lot of different people including my family.\n6) I've heard a lot about oil prices dropping to an all tie low, how can i get involved while the price are low?\nPlease help a young college kid out with some free knowledge. Feel free to pick and choose questions, all stories and experiences welcome!",
        "subreddit": "investing",
        "title": "Investing Help",
        "url": "https://www.reddit.com/r/investing/comments/g9gcvz/investing_help/",
        "created": 1588076068.0
    },
    {
        "author": "stream5482",
        "created_utc": 1587647647,
        "id": "g6merb",
        "num_comments": 103,
        "num_crossposts": 0,
        "selftext": " This will be the first and last time I post. \n\nWhy first ? I’m posting because I’ve seen some retarded DD on here last 2 days that would offend retarded people. \n\nWhy Last ? I got better things to do. \n\nMy credentials ?  Insider in this space for over 10 years.    ( excuse the grammars. English is my fourth language). \n\nThis is a very dumbed down version as I can’t very well write 100 pages on wsb post.  There are books, seminars, certifications on this stuffs. \n\nCredit Card processing is very important as it’s a key indicator for consumers spending.   Scroll down for  Puts/Calls.\n\n**Parties Involved to make it work ?**\n\n1.) Consumer   --- end user. Credit Card holder. \n\n2.) Merchant   --- Business establishment accepting  payment. These guys pay out all the fees\n\n3.) Card Brand   ---- Visa, Mastercard, Discover (Diner Club,  Union Pay), American Express, \n\n4.) Sponsoring Bank   --- handles risks, daily balancing, funding the merchant. \n\n5.) Issuing Bank --- Issue the credit card. If your credit card say “ Chase”, then Chase is the issuing bank. \n\n6.) Processor  --- transactions run through these guys. Think of them as a highway to run  and verify transactions\n\n7.) ISO --- Independent sales office. These guys are the one who call business to sign them up with “ use my company  \n\n for cheaper rates” \n\n**How**  **does each Parties make money ?** \n\n1.) Consumer --- they don’t  anything as they are the purchaser.\n\n2.) Merchant --- they pay out all the fees. At the end of the month, they get a bill for the privilege of being able to accept credit card.  \n\n3.) Card Brand --- Card Brand is pretty much god. They make about 15% of total fees paid out to merchant.   Look up  FANF, dues &amp; assessments. If Visa need money, they just increase their rates, that’s it. More on this later. \n\n4.) Sponsoring Bank -- these guys make the least out of everyone in the group. About  0.01% -0.03%  ( 1 to 3 BP) of total processing volume.  \n\n5.) Issuing bank -- “interchange” is paid out to the issuing bank. These fees account for about 75% of all total fees.  Card Brand dictate interchange. I’m not going to go into qualifications, etc….. Interchange rates is publish for each card brand. Look it up. \n\n6.) Processor --- these guys usually make money on per transaction counts. About $0.02 -$0.05 per transaction and bunch of other misc fees. \n\n7.) ISO --- whatever is left over goes to the sales group.  In a normal business niche ( not high risk or CBD/ cannabis), profit is about 0.30% - 0.50% of total processing volume. \n\n**Profit Math**\n\nMerchant’s fee – ( issuing bank + card brand ) = ISO’ Gross - ( Processor + Sponsoring Bank) = ISO’s Net.\n\n \n\n**Fees:** \n\nAlways have 2 parts.   \n\na.)  Percentage  multiply by the processing volume. \n\nb.)  Fix charge multiply by the transaction.\n\nWhat if you as a sales office  charged merchant 2.75% ( SQUARE) and  nothing else? you would  net negative on any transactions under $10 and  net positive on any transaction over $40.00\n\nWhy ? because interchange for a signature regulated debit is  0.05%+ $0.22( per transaction) not including all the other costs. \n\n**State of the world.**\n\nAll 50 states have stay-at-home orders. Some states are talking about opening up again ( GA, FL).  Guess what ? it’s the Consumers who’s going to decide when to “open” up. Household spending account for 70% of annual GDP. \n\nThe rest of the world is on lock down. Even after opening up, it’s still bad. \n\n[https://www.barrons.com/articles/chinas-reopening-is-missing-consumers-thats-a-bad-sign-for-u-s-51587476793](https://www.barrons.com/articles/chinas-reopening-is-missing-consumers-thats-a-bad-sign-for-u-s-51587476793)\n\n**Great……**  **Give me puts or calls……………..**\n\n1.) Card Brand   ---- \n\na. Visa ( V)  -- earning is on 04/30. They are  the god in this business. They have the greatest exposure in US and overseas. There is no place in asia or Europe that does not take Visa. They increase their rates twice a year. Rate increases scheduled for this April was pushed back to July.  Their earnings will be absolutely horrible as the rest of the world started shutting down in Feb and US in march. \n\ni.  Waiting to be fill --- V 01 May $160P  \n\nii. Waiting to be fill --- V 19 June $135P \n\nb. Mastercard -- earning is on 04/29 -- They have the second highest processing in US. Also like Visa. If you are playing earning, any puts within 5% will be good. \n\nc. Discover ( DFS)  (Diner Club,  Union Pay) --- Earning  4/22 -- I had  15 X $2.72 01 May $34C going into earning. CALLS?? WTF?? 1.) they announced dividends right before earnings. 2.) They own debit networks. Think grocery stores, liquor stores, cannabis shops. 3.) Dinner club, union pay, paypal all goes through them to process on a traditional level. \n\nResults: \n\nQ1 GAAP EPS of -$0.25 misses by $1.61.\n\nRevenue of $2.89B (+4.7% Y/Y) beats by $10M.\n\nShares -5.3% AH.\n\nGoing to exit my position at open with probably 40% losses. \n\nThis is good, if  DFS  missed by bad, the rest will be way way worst. \n\nd. American Express ( AXP) ---  rich people’s credit card. \n\n2.) Sponsoring Bank   ---\n\na. FITB -- 4/21 --  missed earning. Went down on 4/21 then went back up. \n\n📷\n\n3.) Issuing Bank --- I would not touch issuing bank as they are too diversified.\n\na. Chase\n\nb. Bank of America\n\n4.) Processor  -- do your own research.  \n\na. Global Payments\n\nb. Fiserv\n\n**Other:** \n\nSQ ( Square) -- earning 05/06. I did not talked about Payment facilitator. Which is kinda of what they are.   Here was a post on here  “ Square InC, SQ Puts—let’s be rational. Right direction but wrong DD. \n\nSquare  is all domestic and make their money primary from \n\n1.)  Credit Card processing --- they will give merchant, 2.75% or $275 total fees. Their credit card processing  is net negative since inception. The reason is because of their client base ( mom and pop, start up, small transactions type businesses). 2.75% is a good percentage on volume but the $0.00 per swipe is killing them by the time they have to pay out interchanges  and dues assessments.  Their average ticket have to be over $25.00 to be profit. But the business model will not allow it. Small mom and pop go to them because lax underwriting,  and it’s a lot easier vs a traditional model. Most of their merchants is under 10k in processing. \n\n2.) Hardware sales  --- very minimal 1 time revenue \n\n3.) SAS ( Service as a subscription) -- Minimal revenue when comparing to credit card processing. They are also waiving all the software subscription fees for the month of April. \n\n4.) Others…………\n\n**I WOULD NOT TOUCH SQUARE.** \n\n1.)  In fintech, you don’t need to be making money. You can have years of losses and stock will go up. Why ? because it’s about acquiring a large merchant base. \n\n2.) Jack Dorsey -- yes the Twitter guy. He’s the founder and ceo of Square. He’s the Elon Musk of this  space. And you don’t mess with papa  Elon. \n\n3.)  SQ is  APPROVED to make Emergency Small-Business Coronavirus loans. [https://www.nasdaq.com/articles/heres-why-paypal-and-square-are-rising-today-2020-04-22](https://www.nasdaq.com/articles/heres-why-paypal-and-square-are-rising-today-2020-04-22)\n\nThe exposure they get from this is HUGGGGEEEEEEEE. \n\nAsk yourself, does bad earnings = STONK  go down ???????? \n\nGO with VISA puts, a lot safer. \n\nShouts out to: \n\nu/howgreatareyourdanes \\--- great post on “ Mortgage Servicing”\n\nu/carbonEmitter \\--- great  insight into “ Oil to crash again”\n\nu/Variation-Separate  \\--- great  insight into the Macro market.",
        "subreddit": "wallstreetbets",
        "title": "Credit Card Processing -- indicator for Consumers Spending",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/g6merb/credit_card_processing_indicator_for_consumers/",
        "created": 1587676447.0
    },
    {
        "author": "ScoMoTrudeauApricot",
        "created_utc": 1587627139,
        "id": "g6idj1",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "TLDR: 50% of Square's revenue comes from processing in-store transactions for physical merchants.  SQ said transactions volumes for all its merchants were down 25% on March 24th, but estimates from Opentable and other sources suggest things have gotten a lot worse since then.  45% of $SQ's transactions revenue comes from small merchants doing less than $125k in payments through it each year, and as much as 60% of SQ's overall revenues could come from restaurants, retail, and SMB \"services\" (like your wife's boyfriend).  Based on how Germany, China, and Korea have been recovering, small merchants will likely not get their in-store revenues back to normal until Spring 2021.  In spite of all this, since late Feb, the stock has outperformed its peers by 700 bps and the S%P by 1900 bps, as management talks up how their Cash App can earn a bunch of money being an intermediary for the JPOW SMB loans and TrumpBuxx.  However, even all that is unlikely to offset what very rough math indicates will be up to 75% of their EBITDA going away for the year.  SQ's next earnings call is May 6th.  \n1. What is Square?  \nSquare offers payment services for small businesses through credit card and touchless dongles it gives merchants.  It gets a \\~1% cut after interchange fees for this service.  \n[https://jumbotron-production-f.squarecdn.com/assets/84657895c610afea678d.jpg](https://jumbotron-production-f.squarecdn.com/assets/84657895c610afea678d.jpg)  \n[https://solidshop-production-f.squarecdn.com/spree/images/31/modal/tile-contactless-chip-reader.jpg](https://solidshop-production-f.squarecdn.com/spree/images/31/modal/tile-contactless-chip-reader.jpg)  \nIn case you're wondering, you have to be in a store to pay via these pieces of injection-molded art.  \nThey also offer a cash app and working capital loans to the small businesses they've signed up.  \n2. Who uses Square?  \nThis guy, and people like him:  \n[https://imgur.com/a/SIqjItY](https://imgur.com/a/SIqjItY)  \nMeet Chef Romeo of Romeo Chocolates in Long Beach, California.  When he's not busy making artisanal chocolate, he's getting his photo slapped onto page one of Square's 2019 Annual Report.  \n3. Are they still using Square?  \nNo. Square claims they have an ecommerce api like Paypal or Stripe / Shopify, but adoption is low.  Case in point, Romeo Chocolates:  \n[https://imgur.com/a/CSmn0ox](https://imgur.com/a/CSmn0ox)  \nIn these times of woe, Chef Romeo prefers you place your orders online.  For those orders, who helps process the payments? Google. Paypal. Shopify. Not Square.  \n4. How bad does it get?  \nVery bad. 50% of SQ's revenue comes from transaction payment processing (fees from Gross Payment Volume, or GPV); 45% of that comes from merchants who make less than 125k in payments volume through the platform and another 27% comes from merchants who make less than 500k in payments volume through the platform. Assuming half these smaller merchants are going to be doing minimal in-store business for the next 2 quarters, and most of these merchants will no longer use the SW services Square offers... you're looking at up to $350M of EBITDA impact, possibly more.  Square's FY20E was \\~$500M, so this is a \\~80% impact.  \n5. Why is SQ up?  \n[https://imgur.com/a/DqRR2Rq](https://imgur.com/a/DqRR2Rq)  \nFor some reason, investors are confusing SQ's customer base with those of First Data/Fiserv, Elavon, Paypal, and Adyen.  Those companies are not the same as Square.  Their merchants are not hip.  No, those merchants (ie Costco) are sell uncool but wildly profitable things like toilet paper and bottled water.  In the COVIDian Maslow hierarchy, Costco beats sub-125k GPV merchants like Romeo Chocolates.  And over 60% of Squares customers are small retailers and restaurants.  Not exactly COVID proof.  \n6. When is the shoe going to drop?  \nMay 6th is when Square releases earnings.  Investors will be looking for good vibes from the TrumpBuxx and JPOW SMB loans but all they will see - in the numbers - is a cavalcade of destruction.  I for one will enjoy watching management defend TEV/Forward Ebitda at 75x when Forward EBITDA is projected to drop 80% this year.  \nThis is what Opentable says around half of Square's customer base has become:  \n[https://imgur.com/a/myJWpTx](https://imgur.com/a/myJWpTx)  \nDoes this look like something worth 11x revenue to you?",
        "subreddit": "wallstreetbets",
        "title": "Why it's not hip to be Square ($SQ)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/g6idj1/why_its_not_hip_to_be_square_sq/",
        "created": 1587655939.0
    }
]