[
    {
        "author": "vadimyuryev",
        "created_utc": 1596694538,
        "id": "i4mgq1",
        "num_comments": 146,
        "num_crossposts": 0,
        "selftext": "Alright guys so I'm one of the hosts on a YouTube channel named \"Max Tech\".  \nI previously did YouTube work for the channel \"Appleinsider\" since 2016, making videos on Apple products which include Mac computers with Intel chips. \n\nI also grew up playing video games and building custom PCs right when AMD started to release six-core and 8-core processors that were cheaper than Intel CPUs and targeted towards gamers.  \n\nEven though the Intel chips were better for gaming, I still bought AMD because they were cheaper. Intel maintained the lead for many years since games really only used 4 cores, and Intel chips gave more consistent frame rates for gaming.\n\nAt one point, it was clear to me and to everyone else that Intel was intentionally holding off from innovating and improving their performance because they already owned a bulk of the market share. They realized that they could make more profit by making small improvements every year, while AMD was busting their ass trying to figure out how they can compete. (it was ultimately the gaming and custom PC market) \n\nMeanwhile.. Apple was using Intel chips quite successfully in their Mac computers the like MacBooks and iMacs. And Apple was also using their XEON chips for their higher-end machines. And of course, Intel was killing it in the server market.\n\nNow in 2013, Intel announced that they were working on their new 10nm chip process and that it should be ready to launch in 2015, and they said their 7nm chips should launch in 2017. \n\nBack to Intel, over the new few years, Intel delayed 10nm to 2016... and then to 2017.. and then to late 2019... We are now in 2020 and Intel is still shipping 14+++++ nm chips for high-end machines like the 2020 5K Apple iMac that was just released yesterday. Only laptops are getting the actual 10nm chips right now. \n\nIn 2017, AMD shocked the world by announcing their new Ryzen chips, and then also their Threadripper chips, and ever since then, they've been quickly catching up to Intel in terms of both performance and price. \n\nBecause of this, Intel instantly started lowering the price of their chips, and in 2018, they finally made 6-core chips for the MacBook Pro. 8-core chips in 2019, and now 10-core chips in 2020. This is an obvious and desperate move to try and compete with AMD. \n\nBecause Intel's 10nm chips were not ready in 2015 or 2016, Apple's redesigned 2016 MacBook Pro which was thinner than ever before, had overheating issues. The overheating was severe in 2018 with the 6-core chips that Intel made in fear of AMD. \n\nThere were even leaked emails from Intel executives worried about AMD's price to performance beating out Intel. \n\nAnd right now, it is well known that AMD is making BETTER price-to-performance x86 chips. \n\nThe MOST important part of this discussion is that the tech community as a whole, including or YouTube and Reddit, are now convinced that AMD is the way to go. I've seen countless comments on my videos that are dissing on Intel chips and wishing that Apple would switch to using Intel. \n\nIf we make a build guide video using an Intel processor, we get shamed and called dumb for not using an AMD chip. Our Mac Pro videos got a ton of negative feedback because Apple is stupid for using Intel chips. Our 2020 MacBook Pro videos were getting comments dissing on Intel's 10th-gen chips. The entire community is starting to hate Intel and preferring AMD.  \n\nAMD stock has increased over 11x since they announced the first Ryzen chips in August of 2016.  \nIntel stock has only increased 38% since that same date. \n\nAnd looking towards the future.. Intel has recently delayed their 7nm chips until late 2022 or 2023. This caused their stock price to tank at they last earnings call. \n\nThere's even now a class-action lawsuit against Intel because of this delay. \n\nThis also caused their chief of chip engineering to resign, and they reorganized their entire chip team. \n\nThey've even discussed outsourcing their future 6nm, 5nm and 3nm chip production to their rival foundry TSMC because they've lost confidence in their own foundry. \n\nSo it's clear that Intel is getting killed by AMD with each passing year, and the tech community knows it. (Which is VERY important)   \n\n\nThis brings us into the Apple and TSMC portion of this DD.   \n\n\nBack in 2013, Apple announced their A7 chip for their iPhone 5s, the first 64 bit smartphone chip, and ever since then, there was a massive performance war between Apple and Qualcomm, fighting to create the fastest smartphone chips, in which Apple ultimately won. \n\n(The A13 in the iPhone 11 Pro is still much faster than the Snapdragon 865+ which was just recently released this year) \n\nStuck in the middle of this battle was TSMC, which has been the EXCLUSIVE manufacturer of Apple Silicon chips for their iPhones and iPads since the A10 chip in 2016. \n\nAnd in 2018, Apple released their 11\" iPad Pro with the A12X chip manufactured by TSMC's 7nm process. This iPad from 2 years ago is so powerful that it still outperforms the new 2020 13\" MacBook Pro with Intel's 10th gen chip in both processor AND graphics performance. \n\nNow, Apple is about to announce their iPhone 12 in about a month that's gonna pack the A14 chip which is being built on TSMC's brand new 5nm process. \n\nAnd of course, the next iPad Pro will get a much improved A14X 5nm chip, and it's the same story for the Apple Silicon Mac chips that will start being released later this year in October/November. \n\nI'm of course, talking about Apple finally ditching Intel and moving forward with their own chips. This makes sense for Apple for various different reasons.\n\n1: They can run iPhone &amp; iPad apps on their Macs.\n\n2: They control both the software and hardware for incredibly amounts of performance optimization.\n\n3: They can make sure every new Mac update gets a new chip with performance improvements instead of relying on Intel to release improved chips. \n\n4: This is of course, much cheaper for Apple since they don't have to pay Intel the high price of their chips. \n\n5: They don't have to deal with overheating issues since most Intel chips are still on 14nm technology, therefore running very hot and using a lot of power.   \n\n\nAnd there's a good chance that the very first Apple Silicon Mac chips are gonna outperform the current Intel chips, stay much cooler and give you much better battery life. \n\nJust to give you some perspective in terms of how Intel's 10nm compares to TSMC's 5nm..\n\nIntel 10nm transistor density: around 100 million transistors per square millimeter.\n\nTSMC 5nm transistor density: around 171 million transistors per square millimeter. \n\n  \nTSMC has already confirmed that they're working on risk production of their new 3nm process in 2021,  with those chips going into 2022 iPhones, iPads and Macs. \n\nSo here's what the future looks like:\n\n  \nIntel 7nm in late 2022/2023 : 240 million transistors per square millimeter\n\nTSMC 3nm shipping in 2022 Apple products: 290 million transistors per square millimeter\n\nAnd apparently, TSMC is already working on plans for their 2nm process for 2024.   \n\n\nAnd due to Intel's past, there's a very good chance that Intel could delay 7nm even further, especially since they had to restructure their entire chip team, while TSMC has been on point.   \n\n\nSo the future isn't looking very bright for Intel's chip technology compared to TSMC. No wonder why they wanted to outsource their chips from them.   \n\n\nAnd one last bit on Apple's switch to their own chips built by TSMC. \n\nApple has already given developers their transition kit which is a Mac Mini with an A12Z chip from their iPad Pro. \n\nOne developer tweeted this: \"At this point, I think that the first gen Apple Silicon machines will be faster at running x86 code than an actual x86...\"  \n\n\nWhat he means is that Apple's new Rosetta 2 emulation software is so good that he thinks it'll outperform Intel chips even though it's not running natively for ARM. \n\nSo basically, Apple made the right choice by ditching Intel.   \n\n\nAnd if Apple proves everyone wrong by coming out with incredibly great Macs thanks to their switch to their own Apple Silicon ARM-based chips, then there's a VERY good chance that the rest of the market will follow them and start developing ARM-based chips for laptops.\n\nThis will force Windows to start heavily investing in their ARM-based Windows software. \n\nAnd if you didn't already know.. Intel is FAR behind in the ARM-based chip world.   \n\n\nNow, the most common argument I hear is this: Apple is only a tiny part of Intel's business, and while that may be true.. the MOST important thing is the public's view of Intel.  \n\n\nThe tech community is already starting to despise Intel as a brand name because of their overpriced processors and the fact that AMD is beginning to CRUSH them. \n\nJust wait until Apple Silicon Macs start getting released and people realize that ARM-chips have a ton of potential, and they'll start hating Intel even more. \n\nThis will cause Intel's brand recognition and reputation to get absolutely destroyed in favor of AMD and Apple Silicon. This alone will lead to less market share. And what will happen if Nvidia or Apple buy out ARM? \n\nAnd by the way, there are now more and more ARM-based servers popping up, so there's a good chance that Intel will start to lose market share on the server side if ARM-based servers prove themselves. (They use less power so this makes sense for server farms)\n\n&amp;#x200B;\n\nBasically, what I'm trying to say is that Intel just got ditched by Apple.. and they're getting killed by AMD and TSMC. ARM is coming VERY quickly and Intel is NOT ready. They have been plagued with delay after delay, and all of this drama will ruin the confidence of their staff, leading to lowered productivity. It's not looking good for Intel for the long-term.  \n\n\nAs of right now, Intel stock is very cheap, and you might make a few bucks if you trade short term.. but I wouldn't hold Intel stock long term.   \n\n\nIf you want more in-depth info with visuals and extra details, you can check out two videos I made on the Max Tech Youtube channel: \n\n\"How Intel Lost the CPU Race..\"\n\n\"Apple Silicon ARM Chips vs Intel x86 Processors for Mac?\"\n\nHopefully you enjoyed this DD.",
        "subreddit": "wallstreetbets",
        "title": "INTC - Why you Should NOT hold Intel stock long term!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i4mgq1/intc_why_you_should_not_hold_intel_stock_long_term/",
        "created": 1596723338.0
    },
    {
        "author": "Kokodokoe",
        "created_utc": 1596342287,
        "id": "i266ax",
        "num_comments": 87,
        "num_crossposts": 0,
        "selftext": "TLDR: Long AMD. AMD will hit $100 by Feb 2021.\n\nSamsung is ditching expensive Qualcom Snapdragon 875 chipset and they will be mounting Exynos 1000 chipset with AMD's RADEON GPU for the new Galaxy s21.\n\nQualcom announced their new Snapdragon 875 chipset to be at least 25% more expensive than previous generation. That is $250 phone manufactures have to pay. Smartphones are becoming more and more expensive, and most of the flagship phones cost around $1k. That price tag is too high for average Joe and this price will go higher as Qualcom increasing their chipset price.\n\nGoogle, Xiaomi, LG are all using Qualcom chipset and they will soon follow what Samsung is doing.\n\nAlso with screens getting bigger, more GPU power is needed. That's where AMD comes in with their affordable GPU. Whether Galaxy s21 success or not, CPU Chipset + GPU will be the new trend in smartphone market, and bet my ass AMD will lead market as the front runner.\n\nsources:\n\n[https://www.notebookcheck.net/Samsung-Exynos-1000-with-AMD-Radeon-GPU-rumored-to-feature-only-in-the-Galaxy-S21-Ultra-Exynos-brand-change-being-contemplated-too.483452.0.html](https://www.notebookcheck.net/Samsung-Exynos-1000-with-AMD-Radeon-GPU-rumored-to-feature-only-in-the-Galaxy-S21-Ultra-Exynos-brand-change-being-contemplated-too.483452.0.html)\n\n[https://www.digit.in/news/mobile-phones/qualcomm-snapdragon-875-price-leaked-55100.html](https://www.digit.in/news/mobile-phones/qualcomm-snapdragon-875-price-leaked-55100.html)",
        "subreddit": "wallstreetbets",
        "title": "Long AMD. New Exynos 1000 chipset will take AMD stock to THE MOON",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i266ax/long_amd_new_exynos_1000_chipset_will_take_amd/",
        "created": 1596371087.0
    },
    {
        "author": "vadimyuryev",
        "created_utc": 1596820991,
        "id": "i5hybj",
        "num_comments": 60,
        "num_crossposts": 0,
        "selftext": "Hey guys, I'm back from my last DD: [https://www.reddit.com/r/wallstreetbets/comments/i4mgq1/intc\\_why\\_you\\_should\\_not\\_hold\\_intel\\_stock\\_long\\_term/?utm\\_source=share&amp;utm\\_medium=web2x](https://www.reddit.com/r/wallstreetbets/comments/i4mgq1/intc_why_you_should_not_hold_intel_stock_long_term/?utm_source=share&amp;utm_medium=web2x)  \n\n\nI'll try and make this one a bit shorter.   \n\n\nVadim Yuryev here from the YouTube channel Max Tech.  \nI've been covering a lot of Apple products and Macs for the last 4 years ever since I started working for Appleinsider. \n\nAs you all know, Apple has recently announced that they're switching to their own custom Apple Silicon Mac chips, which will of course be built exclusively by TSMC on their brand new 5nm process (World's first)\n\nWhat most people don't know is that they've been working toward this transition for many years. For example, in 2017, they dropped 32 bit app support for iOS 11. In 2018, their macOS Mojave forced developers to use their Metal framework (That's why Nvidia cards don't work anymore in eGPUs) In 2019, macOS Catalina dropped support for 32 bit apps.\n\nThese 3 steps are incredibly important to the Apple Silicon Macs coming this Fall because one of the most important features is the ability to run completely unmodified iPhone and iPad apps on day 1, which of course, are 64 bit apps that run using the Metal framework on the current Apple Silicon chips. manufactured by TSMC. \n\nBecause of this, the transition from Intel to Apple Silicon chips is gonna be much more smooth compared to the previous transition from PowerPC to Intel chips. \n\nA major benefit for the future is that app developers can build apps that have most of the code shared across all Apple devices, which minor adjustments to get the UI to scale properly from the Mac, to the iPad, to the iPhone and of course the Apple TV.\n\nAnd a huge benefit will be the ability to fix bugs and optimize code for all platforms at once instead of having to do it all separately since the main code is shared.\n\nAnd unlike the last transition, Rosetta 2 can now translate x86 app code into ARM-supported code during the install time instead of using real-time emulation. And for plugins and drivers, Rosetta 2 emulates them as well.\n\nDevelopers who have been using Apple's Developer Transition Kit with the A12Z chip from the iPad Pro have already mentioned that Rosetta 2 works incredibly well, much better than expected:  \n[https://twitter.com/yiningkarlli/status/1278897047324602369?s=20](https://twitter.com/yiningkarlli/status/1278897047324602369?s=20)\n\n[https://twitter.com/never\\_released/status/1288658469827104769?s=20](https://twitter.com/never_released/status/1288658469827104769?s=20)\n\nAnd this is with the A12Z chip, which mind you, hasn't changed in terms of processing performance from the A12X chip from 2018. This is also a chip that comes in an iPad Pro that is thinner than any iPhone ever, and has absolutely zero active cooling. \n\nThat chip from 2018 currently outperforms Intel's brand new 10th-gen 10nm chip that came in the 2020 MacBook Pro in terms of both processing and Metal graphics performance.\n\nApple Silicon Macs will of course, have active fan cooling, and Apple has already stated that their Apple Silicon chips for their Macs will be a brand new family of chips, and each Mac will have a chip built specifically for it's enclosure and it's cooling capabilities.\n\nAnd Apple has mentioned that their Silicon has been built for years with easy scalability in mind, so they can add much more cores into the new Mac chips, especially since they'll have active fan cooling. \n\nBecause of the pandemic, Apple's original plans to release a new iPad Pro this Fall with the brand new A14X chip built on TSMC's new 5nm process and a new Mini-LED display were delayed, so that's why the released the 2020 iPad Pro in March, where they basically reused the A12X chip and rebranded it.\n\nSo right now, most investors have no idea how good the A14X is gonna be.\n\nThe A13 chip from last year's iPhones already performs incredibly well in terms of single-core performance, almost neck and neck with Intel's i9-9900K.\n\nThe new A14 chip will be a major improvement, due to being the first chip built on TSMC's 5nm chip.\n\nThere will also be an A14X chip will have a massive improvement over the current A12Z chip, and let me remind you that it will be in an iPad Pro that's thin and passively cooled.\n\nThis same 5nm technology is gonna be scaled up to fit active cooled Apple Silicon Mac computers, first coming into MacBooks like the MacBook Air and the 13\" MacBook Pro, and then into the redesigned 24\" iMac. \n\nOne of the first rumored chips will be a 12-core 5nm chip built by TSMC with 8 high performance cores and 4 efficiency cores. This will likely go into the MacBook Pro. \n\nI'm almost certain that it will outperform the previous Intel-based MacBook Pros in every way. And on top of that, the new Apple Silicon chips will come with Apple's Neural engine and machine learnings accelerations. Along with that, they'll get the same HEVC hardware accelerators as well, which is now becoming the standard for video recording. \n\nBasically, the point of all of this is that TSMC's new 5nm chips that will come in the Apple Silicon Macs are gonna be much faster than anyone is expecting, and those first Macs are rumored to be coming this October or November. \n\nThese chips will shake the entire industry due to the vast performance per watt improvements and the way Apple is gonna use them in terms of their Apple devices sharing the same code. \n\nAnd if Apple succeeds in this transition, there's a very good chance that the rest of the industry will start slowly switching to ARM-based chips, which TSMC is the leader in. (Intel is way behind in ARM chip technology)\n\nBecause of this, TSMC will be confirmed as the leader in chip-making technology, and investors will jump onboard.\n\nTheir main advantage is that they're the first to 5nm, and Samsung is currently having trouble with their 5nm process. Their Note 20 Ultra isn't launching with 5nm chips like people expected.  \n\"A new [report](https://www.zhitongcaijing.com/content/detail/324146.html) out of China (via [*GizmoChina*](https://www.gizmochina.com/2020/08/05/samsung-lost-qualcomm-5nm-orders-tsmc/)), however, suggests Samsung may have lost most, if not all, of that business to Taiwanese rival TSMC\"\n\n[https://www.androidcentral.com/qualcomm-reportedly-choose-tsmc-over-samsung-its-upcoming-snapdragon-875](https://www.androidcentral.com/qualcomm-reportedly-choose-tsmc-over-samsung-its-upcoming-snapdragon-875)\n\nSo Samsung is having trouble. Intel is having trouble, ordering wafers from TSMC. AMD is ordering wafers from TSMC. Qualcomm is ordering wafers from TSMC.\n\nTSMC is now becoming the Sony of the chip-making world. (Sony owns the camera sensor market by such a vast margin that a TON of cameras come with Sony sensors)\n\nWhat if TSMC becomes the next Sony and more companies rely on them for chips instead of investing into their own chip technology? \n\nSummary: Buy Long calls. Especially while the whole market is having a down day today. Buy the dip!\n\nPositions: TSM $100c 1/15/21",
        "subreddit": "wallstreetbets",
        "title": "$TSM - Why you should Buy LONG Calls! (Future leader in Silicon Chips)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i5hybj/tsm_why_you_should_buy_long_calls_future_leader/",
        "created": 1596849791.0
    },
    {
        "author": "ld_southfl",
        "created_utc": 1596389099,
        "id": "i2fue2",
        "num_comments": 50,
        "num_crossposts": 0,
        "selftext": "Microchip is a semiconductor company out of Arizona with a Mkt. Cap of about $26 Billion. They make chips for a bunch of products like Cyber Security, Wireless Products, and Telecommunications. The thing is that they earnings on 08/04 Tuesday after hours. It is very obvious that are going to beat earnings. Why? Because look at the rest of the industry: Qualcomm, Intel, AMD, Qorvo, and IBM have all destroyed earnings. And since Intel just told everyone that they're too retarded to even make potato chips all the smaller time semiconductor competitors are making bank, example: AMD and QCOM. \n\n&amp;#x200B;\n\nMicrochip isn't just your run of the mill small back water company. They actually make acquisitions of other chip companies and use their intellectual property to increase the quality and market share of their own chips. Microchip was found in 1989 and has since made 16 acquistions!!! \n\nYou may, for some reason, say that only big boy chip companies are gonna beat earnings. Well if you don't believe me think about the industries that depend on Microchip for their needs: online educational servicing companies, cloud servicing companies, cyber security companies, telecommunications companies, and just software/tech companies in general. What the hell do we already know about these industries from earnings season? We know they absolutely massacred earnings estimates as everything during COVID has gone tech. Yes, the age of actual industry is dead. Now there are only tech companies that get pumped because of sky high demand (looking at you Apple) and Amazon that sells random shit and still has a tech company valuation.\n\n&amp;#x200B;\n\nOh and you know what's awesome because we have all this knowledge? MCHP is expected to post $1.43 EPS on tuesday, but last year on this quarter they posted $1.41 EPS. What a fucking joke, we should expect at least 40-50% growth in that number from COVID induced semiconductor demand. Not to mention, I think MCHP is gaining market share and could be a big player in a few years in the semiconductor industry. \n\nYou might be hesitant because of my last post on $TER, a chip supplier that many people played incorrectly. I say to you, fuck you. I made money on that play because I sold directly at market open after they destroyed earnings like my data said they would. So if you feel even the slightest FOMO look at these charts from last week: QCOM, QRVO, and AMD; and then tell me what you think MCHP (the same industry) will do!!!\n\n&amp;#x200B;\n\nTLDR; MCHP $107c 08/07",
        "subreddit": "wallstreetbets",
        "title": "$MCHP is the next $QCOM, 300% gain potential after earnings",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i2fue2/mchp_is_the_next_qcom_300_gain_potential_after/",
        "created": 1596417899.0
    },
    {
        "author": "indonesian_activist",
        "created_utc": 1596415307,
        "id": "i2nbht",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "**Previous Posts**\n\n[https://www.reddit.com/r/wallstreetbets/comments/hx46k9/geopolitik\\_trumps\\_earnings\\_zombie\\_markets\\_part\\_vii/](https://www.reddit.com/r/wallstreetbets/comments/hx46k9/geopolitik_trumps_earnings_zombie_markets_part_vii/)\n\n**Last week Positions**\n\n&gt;SPY SELL 325C 7/31  \n&gt;  \n&gt;SPY BUY 330C 7/31\n\nWell, I think most of us managed to got out before 1 PM when it was already down to 0.02, Insane move by AAPL, never seen anything like it in decades.\n\n[https://ibb.co/GTdSXgR](https://ibb.co/GTdSXgR)\n\nSharing the image to highlight I didn't just threw darts on a map when I chose last week strike. You could've exited anytime on Friday for a profit except the last 15 mins of trading.  AAPL stock split enthusiasm and tiktok buyout rumors by MSFT(now canned) drove it past 325 eclipsing the stimulus paycheck pause\n\nLooking into next week, again for the SPY we need to think in terms of Geopolitik Say AMZN struck a deal in South Asia and MENA regions, they're set to dominate the ecommerce market there, oh just one problem. all the goods from vietnam / US can't get there because the South China Sea is being blockaded. Or GOOG invents an improvement to instant results, ie Mind Results, results pop up on your android even before you type anything, and it works on 50 different languages. Whoops won't matter if they are banned in Asia due to US loosing allies over there. Tiktok case is the reverse example of this.\n\nWho makes the most money ultimately comes down to who have MORE GUNS(and wins wars),  we will see how this play out over the next few months along with the rona pandemic. It's been this way for thousands of years ever since Roman times. This view is also echoed by the world's biggest Hedge Funds.\n\n***\"Ray Dalio's, chairman of Bridgewater capital(160B AUM) 2nd article on Geopolitics\"***\n\n[https://www.linkedin.com/pulse/big-cycle-united-states-dollar-part-2-ray-dalio/](https://www.linkedin.com/pulse/big-cycle-united-states-dollar-part-2-ray-dalio/)\n\n&gt;Governance between countries is very different from governance within countries.  That is because within countries there are laws and standards of behavior that govern, whereas between countries raw power matters most, and laws, rules, and even mutually agreed treaties and organizations for arbitration such as the League of Nations, the United Nations, and the World Trade Organization don't matter much.  Operating internationally is like operating in a jungle in which there is survival of the fittest and most anything goes.  That is what makes having a strong military so important.  \n&gt;  \n&gt;  \n&gt;  \n&gt;Where the US Is in Its Big Cycle The stats seem to suggest that the US is roughly 75% through that cycle, +/- 10%.  Is it reversible?\n\n***\"USA Net International investment position \"***\n\n[https://media-exp1.licdn.com/dms/image/C5612AQERAW2vfgiGAA/article-inline\\_image-shrink\\_1000\\_1488/0?e=1602115200&amp;v=beta&amp;t=96260dzAt3-N2pSRGOyCAdkO0I1R6WVpsXNmI04ql5A](https://media-exp1.licdn.com/dms/image/C5612AQERAW2vfgiGAA/article-inline_image-shrink_1000_1488/0?e=1602115200&amp;v=beta&amp;t=96260dzAt3-N2pSRGOyCAdkO0I1R6WVpsXNmI04ql5A)\n\n***\"EST Share of Global GDP PPP Adj\"***\n\n[https://media-exp1.licdn.com/dms/image/C5612AQHx-MIh208rUA/article-inline\\_image-shrink\\_1000\\_1488/0?e=1602115200&amp;v=beta&amp;t=kP-tyBY78SkyYmmtbCklQ4YT1PDsOmwGaYWV541bDdQ](https://media-exp1.licdn.com/dms/image/C5612AQHx-MIh208rUA/article-inline_image-shrink_1000_1488/0?e=1602115200&amp;v=beta&amp;t=kP-tyBY78SkyYmmtbCklQ4YT1PDsOmwGaYWV541bDdQ)\n\nRecall how after WW2 when everyone else was in shambles, US was gaining massively by exporting and lending, if America doesn't get it act together in facing rona, we will likely see reverse WW2 effect.\n\n**Exposure of top SPY companies revenue to China**\n\n**AAPL**\n\n[https://www.cnbc.com/2020/07/31/apple-grew-in-china-with-record-ipad-and-services-revenue.html](https://www.cnbc.com/2020/07/31/apple-grew-in-china-with-record-ipad-and-services-revenue.html)\n\n**9.33/59.7 Bn = 15.6%**\n\nIt looks like it's growing in China, but it does so by offering steep discount on BABA and JD online events.\n\n[https://www.cnbc.com/2020/06/02/apple-cuts-iphone-prices-in-china-to-keep-post-lockdown-momentum-going.html#:\\~:text=The%20iPhone%2011%20Pro%20starts,yuan%2C%20down%20from%203%2C299%20yuan](https://www.cnbc.com/2020/06/02/apple-cuts-iphone-prices-in-china-to-keep-post-lockdown-momentum-going.html#:~:text=The%20iPhone%2011%20Pro%20starts,yuan%2C%20down%20from%203%2C299%20yuan).\n\nThe pct regional revenue from China have actually decreased since 2019\n\n**YoY AAPL China's Revenue Change**\n\n[https://i1.wp.com/sixcolors.com/wp-content/uploads/2020/07/financials-2020-7-4-5.png?ssl=1](https://i1.wp.com/sixcolors.com/wp-content/uploads/2020/07/financials-2020-7-4-5.png?ssl=1)\n\n**AAPL Regional Revenue 4Q Avg**\n\n[https://i1.wp.com/sixcolors.com/wp-content/uploads/2020/07/financials-2020-7-4-3.png?ssl=1](https://i1.wp.com/sixcolors.com/wp-content/uploads/2020/07/financials-2020-7-4-3.png?ssl=1)\n\nOther S&amp;P500 companies with significant China revenue exposure includes :\n\n|Ticker|Rev Pct from China|Revenue From China|\n|:-|:-|:-|\n|INTC|23.6%|15Bn|\n|QCOM|65.4%|14.5Bn|\n|BA|12.8%|12Bn|\n|MU|51.1%|10Bn|\n|AVGO|53.7%|9.5Bn|\n|CSCO|15.9%|7.6Bn|\n|TXN|44.1%|6.6Bn|\n\nNote the above shows that China is dependent on US planes and  high tech electronics components like microprocessors and specialized boards, something that they are trying to rectify fast.\n\n***\"Huawei overtaking Samsung worldwide\"***\n\n[https://cdn.arstechnica.net/wp-content/uploads/2020/07/Screen-Shot-2020-07-31-at-10.58.08-AM.png](https://cdn.arstechnica.net/wp-content/uploads/2020/07/Screen-Shot-2020-07-31-at-10.58.08-AM.png)\n\n[https://www.cnbc.com/2020/07/30/huawei-overtakes-samsung-to-be-no-1-smartphone-maker-thanks-to-china.html](https://www.cnbc.com/2020/07/30/huawei-overtakes-samsung-to-be-no-1-smartphone-maker-thanks-to-china.html)\n\n***\"Homegrown CPUs\"***\n\n[https://technode.com/2020/02/20/silicon-chinas-progress-on-homegrown-cpus/](https://technode.com/2020/02/20/silicon-chinas-progress-on-homegrown-cpus/)\n\n***\"COMAC Passenger jets\"***\n\n[https://www.bizjournals.com/seattle/news/2020/07/17/comac-boeing-airbus-arj21-regional-jets-china-buys.html](https://www.bizjournals.com/seattle/news/2020/07/17/comac-boeing-airbus-arj21-regional-jets-china-buys.html)\n\n***\"ARM vs ARM China JV Dispute\"*** \n\nARM designs the CPUs used by smartphones both iPhones and Android.\n\n[https://www.zdnet.com/article/arms-fired-china-jv-head-refuses-to-leave-company-reps-banned-from-company-premises/](https://www.zdnet.com/article/arms-fired-china-jv-head-refuses-to-leave-company-reps-banned-from-company-premises/)\n\nYes, ARM China basically just revolted and declared independence from ARM UK lol, I guess de facto, now they have their own CPU.\n\n***SPY P/E historical***\n\nMedian PE : 14.83 Current PE 7/31 : 28.12\n\nThe only period where it has been higher was Nov 2008-Nov 2009 when a lot of companies were reporting losses and reduced earnings.\n\n&amp;#x200B;\n\nBut Printer Go Brrr you say ? It's not like the 70s or 80s anymore, there are alternatives to foreign reserves now like EUR and RMB, especially with China reducing dollar use on cross border trades with currency swap agreements.\n\n**Interactive Map: The Spread of Central Bank Currency Swaps (China)**\n\n[https://www.cfr.org/article/central-bank-currency-swaps-tracker#chapter-title-0-5](https://www.cfr.org/article/central-bank-currency-swaps-tracker#chapter-title-0-5)\n\n**USD share of world's central bank foreign reserve**\n\n[https://media-exp1.licdn.com/dms/image/C5612AQHzbe3-HcXWNw/article-inline\\_image-shrink\\_1000\\_1488/0?e=1602115200&amp;v=beta&amp;t=cBpEOd\\_M36fruplE4UZR3Os8VUZkVoViR26jq7a7WuE](https://media-exp1.licdn.com/dms/image/C5612AQHzbe3-HcXWNw/article-inline_image-shrink_1000_1488/0?e=1602115200&amp;v=beta&amp;t=cBpEOd_M36fruplE4UZR3Os8VUZkVoViR26jq7a7WuE)\n\nYeah, as the world reserve currency JPOW still needs to maintain a sense of stabiity, as in not drop &gt;5% in a single month.  Otherwise all those overseas dollars will come flooding back and bam we'll have hyperinflation. So no he won't push the printer much more, for the next few weeks at least.\n\n&gt;“The path of the economy will depend significantly on the course of the virus,”  \n&gt;  \n&gt;“It’s just such an important sentence, we decided it needed to be in our post-meeting statement,”\n\nWhat he said in the FOMC last wednesday was actually very bearish, he admitted the need to keep interest rate at zero and maintain current pace of bond buying just to keep markets from crashing.\n\n**July recap for futures**\n\nSP500 ES  O: 3085  C:3269 , :+5.9% \n\nUSD DX  O: 97.38 C:93.42, : -4.06%\n\n**Last week Recap**\n\nSP500 ES  \t\tO:3210 H:3273 L:3192 C:3269 , \t\t:+1.8% \n\nUSD DX \t\t \tO:94.35 H:94.38 L:92.51 C:93.42, \t:-0.98%\n\nAfter July, It's unlikely that FED will allow USD to fall &gt;3% in August\n\n**FED Market operation schedule for next week**\n\n|Date|Time|Securities|Size|\n|:-|:-|:-|:-|\n|8/4/2020|10:10 - 10:30 a.m.|TIPS 7.5 to 30\t2/5/2028 - 8/4/2050|$1.225 billion|\n|8/5/2020|10:10 -10:30 a.m.|Treasury Coupons 4.5 to 7\t2/6/2025 - 8/5/2027|$6.025 billion|\n|8/6/2020|10:10 - 10:30 a.m.|Treasury Coupons 20 to 30\t8/7/2040 - 8/6/2050|$1.750 billion|\n\n**Last week market operations**\n\n|Date|Time|Securities|Size|\n|:-|:-|:-|:-|\n|7/28/2020|10:10 -10:30 a.m.|Treasury Coupons 0\\* to 2.25 7/29/2020 - 10/28/2022|$12.825 billion|\n|7/30/2020|10:10 -10:30 a.m.|Treasury Coupons 20 to 30\t7/31/2040 - 7/30/2050|$1.750 billion|\n|7/31/2020|10:10 -10:30 a.m.|Treasury Coupons 2.25 to 4.5\t11/1/2022 - 1/31/2025|$8.825 billion|\n\n&amp;#x200B;\n\n**21 Bn Last week vs 9 Bn this coming week,**\n\nBased on that I'm assuming USD inflates &lt;1% next week And we've seen on some days with no company news and earnings that\n\n**The SPY vs DXY is inversely correlated**\n\nHere is an extreme example from June 14th when FED announced individual corporate bond buying\n\n[https://ibb.co/V23QMzQ](https://ibb.co/V23QMzQ)\n\nSP500 earnings for next week, no mega market caps set to announce\n\n[https://www.finscreener.com/earnings/earnings-calendar/sp500?tframe=NW](https://www.finscreener.com/earnings/earnings-calendar/sp500?tframe=NW)\n\n**Jobless Claim**\n\n[https://tradingeconomics.com/united-states/continuing-jobless-claims#:\\~:text=Looking%20forward%2C%20we%20estimate%20Continuing,according%20to%20our%20econometric%20models.](https://tradingeconomics.com/united-states/continuing-jobless-claims#:~:text=Looking%20forward%2C%20we%20estimate%20Continuing,according%20to%20our%20econometric%20models.)\n\nWe see a total of 17 million continuing jobless claims, with the CARES act expired on 7/31, no more 600 dollars a week to spend on necessities/iphones or for YOLO in RH. That just reduced about 10.2 Bn USD consumer purchases from circulating in the economy. These 17 mil people may be displaced structurally as in those jobs are not coming back even if the pandemic ends. Previous record was about 7 mil in 2009\n\n**GDP Growth rate**\n\n[https://tradingeconomics.com/united-states/gdp-growth-annual](https://tradingeconomics.com/united-states/gdp-growth-annual) Annualized was -32.9% but the actual growth rate for Q2 was -9.5%, doesn't sound as bad,  in line with Euro economies but still bad. \n\nDoing stupid simple math to illustrate a concept : \n\n(SPY before Rona) x GDP Change x USD value change \n\n**339 x 0.905 x (1 + (99.82-93.42)) = 326.42** \n\n***It doesn't actually work like this, models are complex, just an example to illustrate a concept of relative value*** Markets are forward looking so if you're planning to do something like the above you should forecast Q3 GDP growth.\n\n&amp;#x200B;\n\n**Sovereign Credit Rating**\n\n[https://www.bloomberg.com/news/articles/2020-07-31/united-states-outlook-revised-to-negative-from-stable-by-fitch](https://www.bloomberg.com/news/articles/2020-07-31/united-states-outlook-revised-to-negative-from-stable-by-fitch)\n\nAs a nation that can just basically print money, getting a negative outlook is a big deal, if the US were to lose its  AAA credit rating expect more expensive debt issuance and fiscal problems down the road.\n\n## In Summary\n\n**China Clash + Rona Pandemic + Fed maintain current pace + No new stimulus deal until 8/7**\\*\\*\n\nWith those factors  SPY will finish below 327 next week. For entry confirmation assuming no news of new stimulus deal reached  I'll wait until it  dips below 325 on Monday after lunch then If it does  get in\n\n**Vertical calls credit spreads :**\n\n# SPY SELL 327C 8/7\n\n# SPY BUY 332C 8/7 (Optional)\n\n***Note: When writing calls this close to the money, you should have enough capital to handle early assignments, if you don't then move the strike a few points back to your comfort level***\n\nWe might need to exit before 8/7 depending on the state of stimulus negotiations\n\n***Alternatively If you think there will be a surprise stimulus deal of more than  2 Trillion next week, then***\n\n**SPY SELL 331C 8/7**\n\n**SPY BUY 336C 8/7**\n\n&amp;#x200B;\n\n**You may ask  what is the opposite scenario that will propel the SPY to 400 this year ?**\n\nA military engagement in the South China Seas that is won swiftly and decisively  by the US.\n\n(As likely as Nancy Pelosi becoming Trump's 4th wife)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n*Obilgatory This is not an investment advice, bla bla bla..... , written by the autisticly retarded gambler*\n\n**APPENDIX**\n\n**Main Stimulus proposals**\n\n&amp;#x200B;\n\n||**CARES (from March)**|**Heroes (Democratic)**|**HEALS (Republican)**|\n|:-|:-|:-|:-|\n|Total cost of stimulus package|$2.2 trillion|$3 trillion|$1 trillion|\n|Enhanced unemployment benefit|$600 per week in addition to state benefits.|Same as CARES.|Initially $200 per week. Then up to $500 per week to match 70% of lost wages when added to state benefits.|\n|How long enhanced unemployment lasts|Expires July 31.|January 2021 for most workers, through March 2021 for gig workers, independent contractors, part-time workers and self-employed.|$200 per week bonus through September. Then 70% matching of lost wages. Extends expiration of federal benefits until Dec. 31.|\n|Paycheck Protection Program|Allocated $659 billion total in forgivable loans for small businesses, who must use 75% on payroll to be eligible for forgiveness. $130 billion remains, but expires Aug. 8.|Expands eligibility, eliminates 75% payroll requirement and extends application period to Dec. 31.|Injects another $190 billion into the PPP fund, expands eligibility and allows businesses to request a second loan. Eliminates 75% payroll requirement and expands approved uses of funds for loan forgiveness.|\n|Eviction protections and moratorium|Bans late fees until July 25 and evictions until Aug. 24 on properties backed by federal mortgage programs (Fannie Mae, etc.) or that receive federal funds (HUD, etc.)|Expands to cover nearly all rental properties in the US, extends eviction moratorium an additional 12 months, allocates $200 billion for housing programs and another $100 billion for rental assistance.|Does not address.|\n\n&amp;#x200B;\n\n**How much can you get currently (HEALS Act)?**\n\n|Desc|Scenario 1|Scenario 2|Scenario 3|Scenario 4|\n|:-|:-|:-|:-|:-|\n|Filed 2019 taxes?|YES|YES|NO|NO|\n|Filing Status|Single|Head of Household|Married|Married|\n|2018/2019 Tax AGI|80k|140k|130k|130k|\n|Dependents under 17|0|1|2|2|\n|Dependents over 17|0|0|0|2|\n|Amount|950|1325|3400|4400|",
        "subreddit": "wallstreetbets",
        "title": "⛼🌕🐺👻🧛🧟🧟‍♀ Everybody wants to rule the world, Zombie Markets Part VIII 🦇🐻",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i2nbht/everybody_wants_to_rule_the_world_zombie_markets/",
        "created": 1596444107.0
    },
    {
        "author": "kaushizzz",
        "created_utc": 1597118453,
        "id": "i7kq23",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "Hi all! I am a 29M and still in school pursuing a PhD in the USA. I have no student loans/cc debt etc.  I am living off a stipend, but I manage to put aside $600 each month to invest. I just started investing a couple of months ago and since I am not confident about what I am doing, I opened two brokerage accounts, one with Robinhood and the other with Chase. The Chase account is an “aggressive” (meaning approx. 90% stocks) portfolio account, in which the bank handles my entire portfolio and I simply put money in it every month. The RH account is, of course, handled by me. My idea is to continue this for a year or two and ultimately consolidate all my money into one account and close the other one, depending on which performs better. \n\nIn my RH account I have/planning to have the following stocks:\n\n**Technology:** GOOG, AAPL, MSFT, FB, AMZN, BABA, INTC, TSM, QCOM, NVDA\n\n**Finance:**  BAC, JPM, PYPL, BRK.B, V, AXP, C\n\n**Communications:** T, VZ\n\n**Consumer Discretionary:** PG, MCD, WMT, DIS, KO\n\n**Industrial:** BA, LMT, DAL, AER\n\n**Healthcare:** JNJ, UNH\n\nI do not plan to invest in ETFs as of now since I am young and able to take risks. Out of the $600 I am investing each month, $300 goes to my Chase investment account and $300 goes to my RH account. I am planning to DCA by investing an equal amount in each of the stock I own in RH, so I would like to own no more than 30 stocks, preferably 25.\n\nI have two questions:\n\n1) Is my strategy of having an RH account and another investing account with Chase a good one? Or should I just stick to one or the other from the get-go? Will having two investment accounts be an issue when I file my taxes?\n\n2) Does my portfolio look good? Am I well / over-diversified? Am I missing some obvious sectors? I think I might end up with way too many similar companies e.g. INTC, TSM, QCOM, and NVDA which is not really diversification. Maybe I should just pick one out of all such companies?\n\nAny other advice/comments about my portfolio are welcome. TIA!",
        "subreddit": "investing",
        "title": "Chase You Invest Portfolios account vs. Robinhood + Portfolio advice",
        "url": "https://www.reddit.com/r/investing/comments/i7kq23/chase_you_invest_portfolios_account_vs_robinhood/",
        "created": 1597147253.0
    },
    {
        "author": "pistonthru",
        "created_utc": 1596377653,
        "id": "i2cpec",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "The past couple month ive been really into the stock market. Ive been trading stocks only because i cannot seem to understand options (I wish i did), with some good success. Examples would be:  \n\n\nAMD = +37%   \nATVI = +28%   \nQCOM = +12%   \nRBC GLOBAL DIVIDEND GROWTH FUND = +12%  \nZDJ = +16%  \n\n\nIve had some a few losses but trying to keep a low loss so for that im okay. What im really wondering is when to get out a stock. I know im suppose to have a \"plan\" for when to get out but i mean these stocks have clear potential to go higher. Is there a rule of thumb of when to get out of a stock with profits ? or something like get out if you loose your porfits drop by 5 % ex +20% -&gt; +15% then go out. ?",
        "subreddit": "investing",
        "title": "When to get out of a stock ?",
        "url": "https://www.reddit.com/r/investing/comments/i2cpec/when_to_get_out_of_a_stock/",
        "created": 1596406453.0
    },
    {
        "author": "cambeiu",
        "created_utc": 1597381151,
        "id": "i9ft66",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "[ARTICLE](https://www.androidcentral.com/samsung-reportedly-partnering-arm-and-amd-beat-qualcomm)\n\nThis should be a red flag not only to Qualcomm but also to Intel, as it could eventually enable more laptops and even desktops to move to ARM.",
        "subreddit": "stocks",
        "title": "Samsung is reportedly teaming up with ARM and AMD to beat Qualcomm",
        "url": "https://www.reddit.com/r/stocks/comments/i9ft66/samsung_is_reportedly_teaming_up_with_arm_and_amd/",
        "created": 1597409951.0
    },
    {
        "author": "Shyamallamadingdong",
        "created_utc": 1596801583,
        "id": "i5chwc",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "US companies with highest revenue exposure to China [https://finance.yahoo.com/news/10-us-companies-highest-revenue-225350456.html](https://finance.yahoo.com/news/10-us-companies-highest-revenue-225350456.html) \n\nWhich of the high exposure companies are resistant to action by China? \n\nIs the market selloff of the highly exposed companies an opportunity to buy these stocks at undervalued prices?  \n\nFor example, Huawei accounts for something like  10% of Micron's sales. But even without Huawei business,  Micron might have significant headwinds into  2021 as  NAND gross margins have started recovering. More details: \n\n[https://finance.yahoo.com/news/micron-more-enough-tailwinds-offset-201000152.html](https://finance.yahoo.com/news/micron-more-enough-tailwinds-offset-201000152.html) \n\n [https://www.fool.com/investing/2020/08/06/why-micron-technology-stock-dropped-5-today.aspx](https://www.fool.com/investing/2020/08/06/why-micron-technology-stock-dropped-5-today.aspx) \n\nOpinions?",
        "subreddit": "investing",
        "title": "The growing anti-US sentiment in China could potentially hurt US companies with high revenue exposure to China (e.g. WYNN, QCOM, MU, QRVO) much more than companies who produce there (e.g. AAPL, NKE) and companies who make most of their money outside China (e.g. SBUX, GM, CAT, BA)",
        "url": "https://www.reddit.com/r/investing/comments/i5chwc/the_growing_antius_sentiment_in_china_could/",
        "created": 1596830383.0
    },
    {
        "author": "Trade_Theory",
        "created_utc": 1596513481,
        "id": "i3cbpg",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "The title says it all. Rate my portfolio. I've posted percent allocations of my stock portfolio. I do not plan to post dollar values in order to keep an unbiased opinion. My immediate plan is to sell out of PFF in its entirety and reallocate that position. If you could change one position, what would that be? I have no plans to withdraw funds or retire anytime in the near future. My primary investment objective is growth and secondary is income.\n\n&amp;#x200B;\n\n|PFF|12.2%|\n|:-|:-|\n|MSFT|10.1%|\n|SRET|9.1%|\n|V|5.7%|\n|NEE|4.6%|\n|AAPL|4.3%|\n|XLU|4.0%|\n|SOXX|3.0%|\n|WM|2.2%|\n|XLF|2.1%|\n|BRK.B|2.0%|\n|JJN|1.9%|\n|JPM|1.6%|\n|WFC|1.6%|\n|IWM|1.5%|\n|UAL|1.5%|\n|QCOM|1.5%|\n|NVDA|1.5%|\n|SPYG|1.4%|\n|MLHR|1.4%|\n|SLV|1.4%|\n|INTC|1.3%|\n|LRCX|1.3%|\n|GLD|1.2%|\n|XHB|1.2%|\n|DIS|1.2%|\n|AVGO|1.1%|\n|MA|1.0%|\n|C|1.0%|\n|QQQ|.9%|\n|PG|.9%|\n|AMD|.8%|\n|RTX|.8%|\n|XLE|.7%|\n|XOM|.7%|\n|MDT|.7%|\n|XLP|.6%|\n|BAC|.6%|\n|AEP|.6%|\n|JETS|.6%|\n|MGM|.5%|\n|RDFN|.5%|\n|BA|.5%|\n|XOP|.5%|\n|LOW|.5%|\n|JNJ|.5%|\n|STWD|.5%|\n|XLI|.5%|\n|KO|.5%|\n|TXN|.4%|\n|DAL|.4%|\n|MJ|.4%|\n|AAL|.4%|\n|SPG|.4%|\n|XLB|.4%|\n|XLV|.4%|\n|FISV|.3%|\n|T|.3%|\n|VNQ|.3%|\n|AMTD|.1%|",
        "subreddit": "investing",
        "title": "Rate my stock portfolio",
        "url": "https://www.reddit.com/r/investing/comments/i3cbpg/rate_my_stock_portfolio/",
        "created": 1596542281.0
    },
    {
        "author": "Trade_Theory",
        "created_utc": 1596513522,
        "id": "i3cc1k",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "The title says it all. Rate my portfolio. I've posted percent allocations of my stock portfolio. I do not plan to post dollar values in order to keep an unbiased opinion. My immediate plan is to sell out of PFF in its entirety and reallocate that position. If you could change one position, what would that be? I have no plans to withdraw funds or retire anytime in the near future. My primary investment objective is growth and secondary is income.\n\n&amp;#x200B;\n\n|PFF|12.2%|\n|:-|:-|\n|MSFT|10.1%|\n|SRET|9.1%|\n|V|5.7%|\n|NEE|4.6%|\n|AAPL|4.3%|\n|XLU|4.0%|\n|SOXX|3.0%|\n|WM|2.2%|\n|XLF|2.1%|\n|BRK.B|2.0%|\n|JJN|1.9%|\n|JPM|1.6%|\n|WFC|1.6%|\n|IWM|1.5%|\n|UAL|1.5%|\n|QCOM|1.5%|\n|NVDA|1.5%|\n|SPYG|1.4%|\n|MLHR|1.4%|\n|SLV|1.4%|\n|INTC|1.3%|\n|LRCX|1.3%|\n|GLD|1.2%|\n|XHB|1.2%|\n|DIS|1.2%|\n|AVGO|1.1%|\n|MA|1.0%|\n|C|1.0%|\n|QQQ|.9%|\n|PG|.9%|\n|AMD|.8%|\n|RTX|.8%|\n|XLE|.7%|\n|XOM|.7%|\n|MDT|.7%|\n|XLP|.6%|\n|BAC|.6%|\n|AEP|.6%|\n|JETS|.6%|\n|MGM|.5%|\n|RDFN|.5%|\n|BA|.5%|\n|XOP|.5%|\n|LOW|.5%|\n|JNJ|.5%|\n|STWD|.5%|\n|XLI|.5%|\n|KO|.5%|\n|TXN|.4%|\n|DAL|.4%|\n|MJ|.4%|\n|AAL|.4%|\n|SPG|.4%|\n|XLB|.4%|\n|XLV|.4%|\n|FISV|.3%|\n|T|.3%|\n|VNQ|.3%|\n|AMTD|.1%|",
        "subreddit": "StockMarket",
        "title": "Rate my stock portfolio",
        "url": "https://www.reddit.com/r/StockMarket/comments/i3cc1k/rate_my_stock_portfolio/",
        "created": 1596542322.0
    },
    {
        "author": "BK_Verbs",
        "created_utc": 1597256928,
        "id": "i8j6m3",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Anyone jump in on QCOM today?\n\nI picked up 8/14 115c this morning and just sold them off +250%. Wish I would have taken a bigger position. But hey, it was free money and I’ll take it.",
        "subreddit": "wallstreetbets",
        "title": "QCOM",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i8j6m3/qcom/",
        "created": 1597285728.0
    },
    {
        "author": "Dashover",
        "created_utc": 1597194839,
        "id": "i84d6i",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "\n \nFor Trading August 12th\n \nTSLA 5:1 SPLIT\n \nGOLD / SILVER COLLAPSE\n \nDJIA CLOSES 450 OFF HIGH\n \n \nToday’s market got off to a slightly higher start on DJIA and S&amp;P-500 but general weakness in the NASDAQ, again.  By the end of the day the DJIA -104.53 (.38%) was well off its +363 high and the NASDAQ was the big loser -185.54 (1.69%).  The S&amp;P 500 was -26.78 (.80) after being withing a few dollars of a new high, the Russell -9.57 (.6%), and the only winner the DJ Transports +24.59 (.23%).  Market internals were 1:1 on the NYSE but 1.5:1 down on the NASDAQ.  Volume was slightly higher than average for an August day.  The major feature of the day was the massive selloff in the precious metals.  Gold was down $125/oz. at the low and finished $1946.30 -93.40 (6%) while the Silver was lower by $3.21 to $26.049 after hitting an intraday low of $24.48.  The change at the close was 12%.  I would assume that we would see some follow-thru tonight and tomorrow early, but I bought the NEM September $65 / 70 call spread for $1.45.  This is basically the same trade I made last month on the August expo $60/65 spread @ $1.30 that we sold @ $3.20.  We also had the TBT 9/18 15 calls @ $ .40 that we sold today half @ $ .68, and the second half @ $ .74 just before they fell back to $ .55.  Not bad, with YTD now back to +34%.\n \n\nTonight’s closing comment video  https://youtu.be/EvsCZy_K1sw\n\n\nSECTORS: We didn’t have much corporate news today but QCOM won an appeals court ruling on an anti-trust case and the stock ignored the selloff and finished the day $108.83 +2.47 (2.3%).  That made it a standout as the rest of technology was hit hard again today.  It was the 3rd day down for the NASDAQ since its new closing high at $11,108.07 last Thursday.\nThe biggest news of the late day was the announcement that TESLA (TSLA) declared a 5:1 stock split.  While this is really just straight arithmetic, it does create some demand for the shares now, since when the stock split becomes effective at the end of August you would have 5 times the shares at 1/5 of the price.  But it does promote the purchase of “round lots” as opposed to “odd lots.”  Does it really increase demand?  Not really, but most stocks (like AAPL) do seem to rise on the news.  TSLA certainly did, closing $1374 -44, and then on the news rallied to its current $1467.20, over $90 higher.\nFOOD SUPPLY CHAIN was LOWER with TSN +.82, BGS -.46, FLO +.20, CPB -.63, CAG -.49, MDLZ -.49, KHC -.16, CALM +.19, JJSF -.35, SAFM +2.10, HRL -.31, SJM -.84, PPC +.27, KR -.58, and PBJ #33.32 -.37 (1.13%).\n \nBIOPHARMA was LOWER with BIIB -10.32, ABBV +.19, REGN -9.38, ISRG -8.00, GILD +.35, MYL +.39, TEVA -.07, VRTX -6.87, BHC +.16, INCY -1.32, ICPT -.25, LABU -6.96, and IBB $132.28-2.59 (1.92%).\nCANNABIS: was LOWER with TLRY -.95, CGC -.54, CRON -.06, GWPH -3.52, ACB -.14, NBEV -.02, CURLF -.38, KERN -.29, and MJ $12.95 +.01 (.08%).\n\nDEFENSE:  was HIGHER with LMT +3.03, GD +2.94, TXT -.18, NOC +6.27, BWXT +.22, TDY +1.75, RTX +.16, and ITA $172.14 +.91 (.53%).\n\n \nRETAIL: was HIGHER with M -.16, JWN +.07, KSS +.55, DDS +.66, WMT -1.33, TGT -1.22, TJX +1.08, RL +1.77, UAA +.27, LULU -8.95, TPR +.12, CPRI +.31, and XRT $50.60 -.39 (.76%).\n \nFAANG and Big Cap: were LOWER with GOOGL -12.81, AMZN -63.15, AAPL -10.52, FB -5.50, NFLX -14.89, NVDA -10.20, TSLA +50.43, BABA +.87, BIDU +.08, CMG -11.00, CAT +1.23, MSFT -3.,85, BA +.98, DIS +1.86, and XLK $112.00 -1.42 (1.25%).\nPLEASE BE AWARE THAT THESE PRICES ARE LATE MARKET QUOTES AND DO NOT REPRESENT THE 4:00 CLOSES.\n \n \nFINANCIALS were HIGHER with GS +2.42, JPM +3.58, BAC +.47, MS +1.22, C +1.17, PNC +3.32, AIG +.52, TRV +.80, AXP +1.70, V +1.46, and XLF $25.31 +.29 (1.16%).\n \nOIL, $41.61 -.33. Oil was higher in last night’s trading before we rallied in the morning on news of production cutbacks from Iraq. The stocks were HIGHER with XLE $38.20 -.13 (.34%).\n \n \nGOLD $1,946.30 -93.40, was a continuation rally and a new recovery high of $2,089.20, but we collapsed and fell as far as $1,919 -124 before coming back slightly.  Tonight, we are currently trading lower again at $1,915.70 – 30.00.  While I like the gold down here, I will have to wait and see how it acts overnight.\n \nBITCOIN: closed $11,435 -580. After breaking out over $10,000 we have had a “running correction” pushing prices toward $12,000, reaching a recovery high of $12220 yesterday. We had added 350 shares of GBTC @ $10.02 to our position of 400 @ $8.06, bringing our average price to $8.97, but sold 250 shares today @ $13.93. GBTC closed $12.54 -1.15 today.\n \n \nTomorrow is another day.\n \nCAM",
        "subreddit": "options",
        "title": "TESLA 5:1",
        "url": "https://www.reddit.com/r/options/comments/i84d6i/tesla_51/",
        "created": 1597223639.0
    },
    {
        "author": "radarbot",
        "created_utc": 1596671265,
        "id": "i4gq85",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "QCOM and Huawei just agreed to a $1.8B settlement on a patent infringement case thats been lingering:\nhttps://finance.yahoo.com/news/seismic-semi-shifts-qcom-nvda-211809341.html\n\nBeyond the settlement, it looks like QCOM is now open to supply chips to Huawei for their phones which opens up huge revenue opportunities.\n\nAlso, (I know seeking alpha is a speculative website...) there is good evidence that QCOM is a leader in 5G chips for mobile:\n\nhttps://seeking alpha.com/article/4364578-doubling-down-on-qualcomm\n\nQCOM is trading at $110 today after reporting great earnings last week. Their PE ratio looks high at 36 currently ($113 share price / 3.55 [2019 Annual EPS]) = 31.83. TDA has them at a PE of 41 but I don't know how they're doing their math.\n\nThe settlement will add $0.75 to annual EPS as paid out over multiple years. In addition to added markets, this may finally be a chance for QCOM to take off.\n\nIf the projections are true, the forward PE ratio of QCOM moves from around 31 to 19, as the price increase hasn't been factored in yet to accommodate the EPS projections.\n\nDoes anyone else feel bullish on QCOM in this competitive silicon manufacturing world?",
        "subreddit": "stocks",
        "title": "QCOM comes to deal with Huawei over patent infringement",
        "url": "https://www.reddit.com/r/stocks/comments/i4gq85/qcom_comes_to_deal_with_huawei_over_patent/",
        "created": 1596700065.0
    },
    {
        "author": "kutuzovgambit",
        "created_utc": 1596760482,
        "id": "i53v5c",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "TSMC just keeps gaining customers. They seem to be the only company doing die shrinks reliably anymore. I wish I had bought way more than $1K worth when they were sitting at $55 per share. Honestly though with Apple, Qualcomm and even Intel relying on them they could run up way more than they already have. Semiconductors are not going anywhere.\n\n [https://www.gizmochina.com/2020/08/05/samsung-lost-qualcomm-5nm-orders-tsmc/](https://www.gizmochina.com/2020/08/05/samsung-lost-qualcomm-5nm-orders-tsmc/)",
        "subreddit": "stocks",
        "title": "TSMC reportedly gains Qualcomm orders as Samsung 5nm production falters",
        "url": "https://www.reddit.com/r/stocks/comments/i53v5c/tsmc_reportedly_gains_qualcomm_orders_as_samsung/",
        "created": 1596789282.0
    },
    {
        "author": "kutuzovgambit",
        "created_utc": 1596759914,
        "id": "i53pvn",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "TSMC said to gain Qualcomm orders as Samsung 5nm falters",
        "url": "https://www.reddit.com/r/stocks/comments/i53pvn/tsmc_said_to_gain_qualcomm_orders_as_samsung_5nm/",
        "created": 1596788714.0
    }
]