[
    {
        "author": "Coda70",
        "created_utc": 1599009568,
        "id": "ikxalu",
        "num_comments": 748,
        "num_crossposts": 0,
        "selftext": "Coda code of conduct\n\n1)\tBuy calls on the best companies in the world 5-10% OTM six months or more until expiration.  FAANG, MSFT, TSLA, NIKE, WMT, JPM, PYPL, AXP, BABA, NVDA, AMD, SBUX, CRM.  Or ETF’s like MGK, FNGS, and SOXX if you don’t have the capital to get in on single equity options.\n\n2)\tHold for at least half of the 6 months until expiration.  \n\n3)\tThe long term goal is to buy and hold shares.  This is what rich people do.  Hard assets that can’t quickly evaporate like options can.  Same choice of companies as above.  Just the good shit. Hold assets that slowly grow. Cash gang = chicken coop.\n\n4)\tIn order to protect your winnings, make sure half of your account is shares.  \n\n5)\tUse margin sparingly.  Less than half of what they are offering you.\n\n6)\tIf you need to do a weekly just to have a little casino thrill in your life it should be less than a grand.  Weeklies are not how real wealth is built.  But it’s ok if you see a strong trend but don’t YOLO your whole stack.  That’s just dumb.\n\n7)\tSmoke weed every day.\n\n———\n\nSee, I got up to six figures buying puts in mid-march. But then I lost like 3/4’s of my stack staying short when the market bottomed on March 23rd.  So I needed to come up with a system to protect my gains.  Hence, the Coda code of conduct.\n\nFor example, I started with $75k but now I have around $162k in shares.  So, no matter what happens I’ll likely be ahead of where I started.  I’m slightly out of balance because I have more options than shares.  $196k in calls vs $162k in shares.  So I’m like $34k out of balance, somewhat breaking my own rule.  So I’m living a little dangerously until 9/18 at which time I’m going to execute 4 apple calls and 2 msft calls.  Which will bring my share total up like $65k.  I might have to sell some options so I have the buying power in my account to get this done.  At that point, I will have more shares than options so I’ll be green lit to buy more calls.  This is how I enforce discipline on myself to not get to overextended.  Leverage, but not too much leverage.  Good luck to us all!",
        "subreddit": "wallstreetbets",
        "title": "How to turn $75k into $325k while being high on edibles",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ikxalu/how_to_turn_75k_into_325k_while_being_high_on/",
        "created": 1599038368.0
    },
    {
        "author": "Annapurna__",
        "created_utc": 1601036226,
        "id": "izidim",
        "num_comments": 163,
        "num_crossposts": 0,
        "selftext": "https://nathantankus.substack.com/p/the-stock-market-is-less-disconnected\n\nIf you're not following Nathan Tankus by now, you're missing out on key, relevant economic commentary. \n\n&gt;There is one big area you can say that the stock market is disconnected from the economic outlook— size. By definition, it tends to be bigger companies which are on the stock market. So inevitably the stock market can’t capture the thousands of small businesses that are failing. Yet, even here, disaggregation of the S&amp;P tells us a lot. Again, there is a wide and sharp dispersion right now, with average returns for large firms a lot higher than smaller firms. This wasn’t the case in February. More than half the companies in the index have less than $25 billion in market capitalization, and the average year-to-date return for all these companies (equally-weighted) is negative.  \n\n&gt;Once returns are broken down by sales growth, we see dramatic differences based on sales growth and decline. Returns are in fact highest for companies with the strongest year-over-year sales growth. Among those with sales growth greater than 20% are familiar companies like Amazon and Netflix, but also much smaller companies like Nvidia and Paypal. In other words, tech stock returns are being driven by tech sales.\n\n&gt;This does not mean that stocks, especially the ones that have really run up in price, are avoiding overvaluation. However, that is a different question. If there are overvalued stocks, it is likely caused by companies that have seen the biggest sales growth leading to overoptimistic expectations of future sales growth. Overconfidence reflects the economy and beliefs about the economy, while none of us know the future. But this is a generic point, not an argument for setting aside consideration of the stock market. Stocks with the highest valuation, as measured by forward price to earnings ratio, have in fact gained the most year-to-date.",
        "subreddit": "investing",
        "title": "The Stock Market Is Less Disconnected From the “Real Economy” Than You Think",
        "url": "https://www.reddit.com/r/investing/comments/izidim/the_stock_market_is_less_disconnected_from_the/",
        "created": 1601065026.0
    },
    {
        "author": "jabcobjoseph",
        "created_utc": 1600365177,
        "id": "iuon7q",
        "num_comments": 144,
        "num_crossposts": 0,
        "selftext": "Need some advice. A broker called and said I should invest in Aerotyne International. He said its a cutting-edge tech firm out of the Midwest and they are awaiting patent approval on some cool new radars. Said that its gonna sky rocket, what do you guys think? He already sent me a PayPal payment request, just gotta pay and secure the spot. I’m gonna be using my tuition money so I just need some advice.",
        "subreddit": "wallstreetbets",
        "title": "Broker wants me to invest in Aerotyne International?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iuon7q/broker_wants_me_to_invest_in_aerotyne/",
        "created": 1600393977.0
    },
    {
        "author": "wildcomedy",
        "created_utc": 1601271331,
        "id": "j16dxx",
        "num_comments": 141,
        "num_crossposts": 0,
        "selftext": "I’ve been using PayPal for years as a payment gateway, and yesterday PayPal paid me $15 to do a 20 minute survey. Every question was tailored towards e-commerce, online marketplaces and payment gateways, and frequently mentioned Shopify, WooCommerce, Wix, Amazon, eBay etc, by asking about how I use the platforms, what tools do I use, what would I recommend, what it would take for me to switch to a competitor etc.\n\nEvery answer seemed to provide some sort of feedback as to what my perfect e-commerce platform would contain.\n\nI’ve just done some research and found that PayPal have actually openly said that they are developing an e-commerce platform which will bring together a comprehensive set of technology and tools to help businesses of all sizes.",
        "subreddit": "stocks",
        "title": "PYPL is developing an e-commerce platform",
        "url": "https://www.reddit.com/r/stocks/comments/j16dxx/pypl_is_developing_an_ecommerce_platform/",
        "created": 1601300131.0
    },
    {
        "author": "babybrazil",
        "created_utc": 1600819651,
        "id": "ixzh9w",
        "num_comments": 78,
        "num_crossposts": 0,
        "selftext": "Listen idiots, when the market goes full retard and becomes this volatile, you don't have to become a retard with it. Instead of throwing thousands on hourlies or on retarded OTM FDs expiring this friday, buy 1-2 long term calls or LEAPS. No, your fucking 10/16 or 9/20 calls aint LEAPS. LEAPs are options contracts with expiration dates that are longer than one year. Don't go all in at once. Shit is expensive but much much safer. LEAPS have a juicy delta and theta will be on your side. I know, this is unheard of on this sub but it's a thing. I'd recommend buying a LEAP as close to ATM as possible. Why? So you can sell weekly OTM calls on green days and profit off your fellow retards. You are basically converting your LEAP into a vertical spread and your long leg will act as collateral if shit goes wrong. If this is too technical for you, and are too retarded to google Options 101, just buy OTM 2022 LEAPs. There's a lot of shit on discount right now; $PYPL, $MSFT, $NVDA, $BA, etc. Since we are living on retarded times, be ready to average down when the market is period-red. Sell your average downs when green. Repeat.",
        "subreddit": "wallstreetbets",
        "title": "Hate losing money? Hate IV crush? Stocks only go up? Read this.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ixzh9w/hate_losing_money_hate_iv_crush_stocks_only_go_up/",
        "created": 1600848451.0
    },
    {
        "author": "Investor287",
        "created_utc": 1600192081,
        "id": "itdr15",
        "num_comments": 56,
        "num_crossposts": 0,
        "selftext": "Looking to see what your guys opinions are for your top five stocks to invest in now and not think about touching for the next 20 years minimum?\n\nI’m in my mid 20’s and will be investing a decent amount of money soon to start my portfolio. For the most part I will be playing it safe with my initial investments. The only stocks I’m set in stone on getting are Apple, Tesla, and Alibaba. After that I will likely be buying some Microsoft and PayPal.\n\nWhat do you guys think would be other stocks to buy in now on and “forget about” for a ling time? I don’t want to solely be in on big tech companies but they are safe bets. Curious to see what others will suggest.",
        "subreddit": "stocks",
        "title": "Best 20 Year Holds",
        "url": "https://www.reddit.com/r/stocks/comments/itdr15/best_20_year_holds/",
        "created": 1600220881.0
    },
    {
        "author": "AllanRonny",
        "created_utc": 1600313015,
        "id": "iubd1d",
        "num_comments": 51,
        "num_crossposts": 0,
        "selftext": "I see Microsoft, Amazon, and Alibaba as the 3 best \"big tech\" stocks out there today in terms of safety vs upside potential. With that said, I am struggling to pick which one I like more, and was wondering if you guys could give me your opinion. I have provided my assessment of each below-\n\n**Alibaba-** \n\nThe \"Amazon &amp; PayPal of China\", Alibaba is growing even faster than Amazon and yet has a Microsoft-level PE ratio of 30. Propped up by the Chinese government and tied to the future of China, which I see as more than likely continuing to grow into a global superpower. \n\nWith that said, it carries obvious risks. Americans need to buy on the Hong Kong exchange or else they risk owning fake shares. Alibaba could be cooking their books and we would have little legal protection/suing power. \n\nThe Chinese economy could slow down or have a Japan-type economic collapse, though that's unlikely in my opinion due to their superior ability to protect themselves militarily from US economic sabotage like we did to Japan with the Plaza Accords \n\nI see Alibaba as clearly the highest risk-highest reward of the 3 stocks listed here. The risks are extreme, but the fact remains that if it was priced like Amazon, BABA would be 300% higher than it is right now. The upside is higher than practically any tech company out there right now...but so is the downside.\n\n**Amazon-** \n\nAmazon has massive and sustainable revenue growth from its eCommerce business, but this is a relatively low margin business in the short term. However, with automation and an improving supply-chain strategy (where they own the entire supply chain and cut out UPS/Fedex), they are gonna start improving margins and revenue growth will turn into actual gross profit. \n\nAWS will continue to grow alongside the broader cloud market, though they will have to contend with stronger competition from Microsoft's Azure and Google Cloud going forward. \n\nI see advertising as a very strong future growth driver as well.\n\nThis is one of the fastest growing companies on Earth in terms of revenue and I see them as a potential world conqueror ala Genghis Khan. \n\nBiggest risk factors going forward are political ones, the CEO is a little too vocal for his own good and he has a target on his back from progressive politicians due to his immense wealth. I don't see any near-term risks facing them, but could easily see them growing to old Microsoft/AT&amp;T monopoly levels and then needing to be broken up. \n\n**Microsoft-** \n\nProbably the most stable big tech company there is. Strongly diversified revenue between gaming industry, cloud, office suite, etc. It would take a meteor striking the Earth for Microsoft to go bankrupt, and maybe even that might not be enough, with how intertwined it is with global b2b and government  contracts. Larger than Amazon, but seems to have no targets on its back politically. \n\nAdditionally, actually offers a decent dividend, and valuation is a little more down to Earth than Amazon's (30 P/E vs 120). Azure is growing rapidly, and they are trimming the fat of their business (such as their retail locations) indicating they want to focus on their winners instead of trying to salvage their losers, something I see as a positive. \n\nWith that said, their actual revenue growth (22%) isn't as hyperbolic as Amazon's (40.23%). In general, they are less imperialistic than Amazon (which sometimes actually serves in their favor regarding avoiding political targeting and allowing for relationships with big companies like Walmart). \n\n&amp;#x200B;\n\nTL;DR- I see Alibaba as an amazon-esque tech company with ludicrous upside potential, hindered by equally significant geo-political risk factors. \n\nAmazon as an imperialist juggernaut of the tech industry which more than likely has an incredibly bright future ahead of it, but that carries with it heightened risk of political targeting and general risk from having such a high p/e ratio. \n\nMicrosoft has strong growth prospects and a relatively reasonable valuation for a big tech player. However, upside is not as strong as Alibaba or Amazon. I see them as virtually risk free, but at the cost of that aforementioned lower upside.\n\nWhat do you guys think about my assessment? Do you have any opinions on which of these 3 I should go long on, or do you think I should just mix all of them or something along those lines? \n\nCurrently positions relating to these stocks- long Microsoft 20 grand, retirement accounts are split 50/50 between VGT (heavy Apple/Microsoft weighting) and QQQ.",
        "subreddit": "wallstreetbets",
        "title": "Alibaba vs Amazon vs Microsoft- trying to pick my favorite and seeking advice.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iubd1d/alibaba_vs_amazon_vs_microsoft_trying_to_pick_my/",
        "created": 1600341815.0
    },
    {
        "author": "heathermyllz",
        "created_utc": 1600530093,
        "id": "ivuuat",
        "num_comments": 45,
        "num_crossposts": 0,
        "selftext": "I believe it was September 3rd...my dumb ass lost patience and bought the following at their highest prices (literally an hour before the market started tanking) :\n\nDocusign - $275\nCrowdstrike - $155\nRocket - $29\nApple - $130\nPayPal - $209\nSquare - $167\nChegg - $75\n\nI have been averaging down very slowly over the past couple days as the market has been continuously red...I’m fearing another market crash so I’m not sure if I should wait awhile to average down or keep averaging down now...any advice?",
        "subreddit": "stocks",
        "title": "So I bought the tippy top of the market the morning before everything started tanking...advice?",
        "url": "https://www.reddit.com/r/stocks/comments/ivuuat/so_i_bought_the_tippy_top_of_the_market_the/",
        "created": 1600558893.0
    },
    {
        "author": "longlostmariobrother",
        "created_utc": 1599130962,
        "id": "ilrakw",
        "num_comments": 44,
        "num_crossposts": 0,
        "selftext": "K so here me out! I have a strong theory as to why you should get these [3 stocks](https://vm.tiktok.com/ZMJSYHk2R/). \n\nPayPal- first banks are getting out dated and the way PayPal is handling themselves might as well call them a bank. Second they released this QR payment technology that you can literally pay for anything with just a QR code. \n\nCVS - first they are 1 of the largest pharmacy chains in the US. Second PayPal’s QR tech will be tested in over 8300 CVS stores by the end of the year. \n\nTarget- besides their stellar earnings they are probably the largest retail chains. But Target and CVS entered in a partnership agreement which means PayPal could possibly adapt the QR tech in their stores. Possibly competing with Amazon go? \n\nAll of their financials are strong as well especially the balance sheet.",
        "subreddit": "wallstreetbets",
        "title": "These 3 stocks are planning",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ilrakw/these_3_stocks_are_planning/",
        "created": 1599159762.0
    },
    {
        "author": "iBifteki",
        "created_utc": 1599260931,
        "id": "imqfu6",
        "num_comments": 40,
        "num_crossposts": 0,
        "selftext": "Honestly, it's so amusing to see the general consensus of this sub change back and forth from bull to bear and bear to bull in a matter of hours during the day.\n\nSince most of you are unable to form a thesis and stick to it for more than a couple of hours, I'd like to take this opportunity to call you out. Yeah you, you absolute cuck of a man.\n\nYou can argue that this is the beginning of a bear phase as much as you can argue that it's a pull back for another bull phase. Both theses have merit.\n\nPositions 🖐️💎 (I buy shares, so I guess I am also a cuck)\n\n$AAPL - $124.37\n$AMD - $87.33\n$PYPL - $199.71\n$BYND - $123.29\n$SNE - $78.60\n$ASML - $376.58\n$TSM - $78.56\n$WORK - 29.85",
        "subreddit": "wallstreetbets",
        "title": "You are all cucks",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/imqfu6/you_are_all_cucks/",
        "created": 1599289731.0
    },
    {
        "author": "skywalker4588",
        "created_utc": 1600178663,
        "id": "it9eo6",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "Guys,\nI’m pretty much locked in most of my positions for my portfolio except picking between PYPL and SQ. Which one would you pick and why? Im not a big fan of SQ CEO but I don’t want to be stubborn on not buy SQ solely based on that. \n\nThanks!",
        "subreddit": "stocks",
        "title": "PYPL or SQ",
        "url": "https://www.reddit.com/r/stocks/comments/it9eo6/pypl_or_sq/",
        "created": 1600207463.0
    },
    {
        "author": "Ko_9999",
        "created_utc": 1599489082,
        "id": "io8ft8",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "Hi, I have about 1000 usd to invest and I need some help deciding. I am going to buy papers on Tuesday morning but I can’t decide between these 8 stocks and ETF’s\nAAPL\nICLN\nQCLN\nTSLAT\nTTWO\nAMD\nNVDA\nPYPL\nI’m mostly hot on apple, ICLN and QCLN, but I like the other ones too. I’m looking for a mid/long term investment. I have done some research, but I can’t figure out which one or two stocks/etf’s to get and I could really use some help, thanks.",
        "subreddit": "stocks",
        "title": "Need some help deciding...",
        "url": "https://www.reddit.com/r/stocks/comments/io8ft8/need_some_help_deciding/",
        "created": 1599517882.0
    },
    {
        "author": "tomorland",
        "created_utc": 1600144787,
        "id": "it1vm7",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "Yes,  NKLA seems shady as hell.  When I first heard of Nikola, It reminded me  of J. K. Rowling's agent declining to read the Harry Potter manuscript.  \"The title tells me all I need to know.\"  He said.\n\nThe  name Nikola screams \"Me too! Me too!\"  And when I heard it was Hydrogen  powered, I closed that book. Anyone who's done the energy equation on  hydrogen power knows it's not a compelling technology.\n\nBut,  NKLA surprised me. It's no small feat to get a company listed on the  exchange. Maybe there's something happening here after all.\n\nI'm  sure we've all heard the joke about the guy who looks at his loser son  and realizes he has to do something. So he calls Bill Gates and says,  \"your daughter is going to marry my son.\"\n\nBill gates says, \"No she's not.\"\n\nSo the man says, \"But he's the president of the world bank.\"\n\nBill says, \"ok.\"\n\nThen the man calls the world bank and says, \"My son is going to be the president of the world bank.\"\n\nThey say, \"No he's not.\"\n\nAnd the man says, \"But he's married to Bill Gates' daughter.\"\n\nSo the world bank says, \"ok.\" And everyone lived happily ever after.\n\nI  can't help but wonder if Trevor has something like that going on with  NKLA. The name is a good marketing gimmick. He's pulled off an  impressive operation so far. He probably wishes we'd all shut up so he  can get there, like Molly Ringwald in that movie The Pickup Artist.  (Y'all seen that movie, Right? Classic.)\n\nI'm  sure bigger long-shots have paid off in the past, probably only because  no one was looking too hard at it. (Paypal, for instance...)\n\nAnyone else think there may be hidden potential here. Or is the EV space getting too crowded already?",
        "subreddit": "wallstreetbets",
        "title": "In defense of Trevor",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/it1vm7/in_defense_of_trevor/",
        "created": 1600173587.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1599243008,
        "id": "iml3iq",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2020/09/04/disruptors-paypal-and-square-surpass-wall-street-giants-including-goldman-sachs-in-market-cap.html\n\nThis week, the market capitalization of fintech payments firm Square exceeded that of Goldman Sachs, the 151-year-old investment bank, for the first time.\n\nAlmost exactly two months earlier, PayPal surpassed Bank of America, the second biggest bank in the U.S., in market cap. That move made the online payments pioneer worth more than every American bank except for JPMorgan Chase.\n\nThe coronavirus pandemic has accelerated the penetration of digital payments across entire industries, resulting in double-digit revenue growth at PayPal and Square in the second quarter. Meanwhile, banks including JPMorgan and Bank of America have collectively set aside tens of billions of dollars for expected defaults.\n\n“It’s pretty stunning to look at some of these fintech companies and the credit they’re getting today,” Devin Ryan, analyst at JMP Securities, said in a telephone interview.",
        "subreddit": "stocks",
        "title": "Disruptors PayPal and Square surpass Wall Street giants including Goldman Sachs in market cap",
        "url": "https://www.reddit.com/r/stocks/comments/iml3iq/disruptors_paypal_and_square_surpass_wall_street/",
        "created": 1599271808.0
    },
    {
        "author": "Gothlander",
        "created_utc": 1599183611,
        "id": "im6ugd",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "I bought a share of AMZN last week and it went up 6% since then. It dropped 6% today. I sold right around where I bought it at. I also did this with SQ and SE.  I still have AAPL, MSFT, FB, PYPL above 5% for the year so I am holding on to them. I don't care about short term profits, I am in it for the long term. \n\nDid I do the right thing today or was it a rookie move? I am new to investing.",
        "subreddit": "investing",
        "title": "Sold my holdings that dropped to 1% P/L for the year. Is this a good strat?",
        "url": "https://www.reddit.com/r/investing/comments/im6ugd/sold_my_holdings_that_dropped_to_1_pl_for_the/",
        "created": 1599212411.0
    },
    {
        "author": "JoeBarth22",
        "created_utc": 1599657422,
        "id": "ipfozg",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "pennystocks",
        "title": "$CLIS - ClickStream Selects Paypal as WinQuik (TM)'s Cash Payment Processor to Contest Winners Press Release",
        "url": "/r/CLIS/comments/ipf3yg/clis_clickstream_selects_paypal_as_winquik_tms/",
        "created": 1599686222.0
    },
    {
        "author": "Rule_Of_72T",
        "created_utc": 1599069914,
        "id": "ilbyx7",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "TLDR: \nSalesforce (CRM) is the perfect company to buy during a tech bubble and is riding the COVID wave.  Their e-commerce platform, which is has about 3x the market share of the closest CRM competitor, is benefiting from the shift from Brick and Mortar to online sales.  Humana is now using Salesforce to deliver telemedicine.  The recent inclusion of CRM in the Dow is going to force buying.  Salesforce has a tech focused investment fund that is making big tendies.\n\nCRM 1/22/21 250c\n\nImagine the typical Black Friday.  Crowds shoulder to shoulder to get the best deals.  Thanks to COVID that’s not happening this year.  Those sales are shifting online.  Salesforce (CRM) has a 21% share of Customer Relationship Management market, which among other things, is the e-commerce platform for online retailers.  Salesforce is taking a tiny % of online sales from each retailer.  You know there’s going to be a crazy amount of emails sent out this holiday season.  Guess who gets paid based on volume of emails?\n\n\nSalesforce was just added to the Dow.  The Dow is weighted by share price.  As CRM increases, reweighing of the Dow caused forced buying.  \n\nAlso in the same link ATT and PayPal are recent new customers.\n\nhttps://www.nasdaq.com/articles/salesforce-was-just-added-to-the-dow-jones-industrial-average-and-its-q2-update-shows-why\n\nSalesforce (CRM) has a technology focused investment fund.  During a tech bubble, you want to own a basket of smaller tech companies, especially if there’s IPOs and acquisitions.  CRM made a bunch of money from the NCNO and ZM IPOs.\n\n“We're the leader in cloud computing helping others to become the same. Since 2009, we've funded over 400 entrepreneurs building the next generation of enterprise technology.”\n\nhttps://www.salesforce.com/company/ventures/portfolio/\n\nSalesforce is working with Humana to deliver telemedicine.  COVID has forced doctors and insurance companies to get comfortable with telemedicine.  That should jumpstart the trend going forward.\n\nhttps://investor.salesforce.com/press-releases/press-release-details/2020/Humana-Selects-Salesforce-to-Deliver-Connected-Personalized-Healthcare/default.aspx\n\nApparently CRM was 1 of 7 tech stocks that were included in a $1 billion option purchase.\n\nhttps://www.zerohedge.com/markets/whats-behind-last-weeks-meltup-vix-citadel-explains\n\nI want to own CRM for the Q3 earnings announcement in December.  E-commerce is having a big quarter.  The internal investment fund should be strong.  Headlines will be full of stories about online retail.  The stock is taking a breather after the huge post earnings run up.  I bought today and intend to hold through Q3 earnings.  During a bubble, I think the market cap could inflate from the current $250 billion to a $1 trillion.",
        "subreddit": "wallstreetbets",
        "title": "Salesforce is the ultimate stock to own during the tech bubble",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ilbyx7/salesforce_is_the_ultimate_stock_to_own_during/",
        "created": 1599098714.0
    },
    {
        "author": "UnpolishedPleb",
        "created_utc": 1600308693,
        "id": "iua6rr",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "JPow wants to keep interest rates low until 2023 and raise inflation to encourage more loans and spending. \n\nWhat does this mean for the Nasdaq 100? Just think about it. \n\nSPENDING:The holidays are just around the corner and everyone will want new Apple iPhone’s and Nvidia graphics card’s. Orders will be made on Amazon or on Ebay with Paypal all while using Google Chrome.\n\nLOW INTEREST RATES: Less money to pay back when taking out loans to yolo on Tesla.",
        "subreddit": "wallstreetbets",
        "title": "Nasdaq 100 will close green tomorrow",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iua6rr/nasdaq_100_will_close_green_tomorrow/",
        "created": 1600337493.0
    },
    {
        "author": "scatterblooded",
        "created_utc": 1600134318,
        "id": "isz4iv",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "For those holding MasterCard or Visa in their portfolio, or both, what are your thoughts on these companies? Which do you prefer if you had to choose and why?\n\nI have also given some thought to PYPL and SQ, decided on buying SQ a few months ago, so not looking into alternatives. I see MA/V as slow but stable growth stocks, but would prefer to choose the one poised for the most growth. \n\nStill doing my own research, just looking for opinions from others. Lots of great info in here.",
        "subreddit": "stocks",
        "title": "MA vs V - thoughts and comparison",
        "url": "https://www.reddit.com/r/stocks/comments/isz4iv/ma_vs_v_thoughts_and_comparison/",
        "created": 1600163118.0
    },
    {
        "author": "Tsubami",
        "created_utc": 1600270467,
        "id": "itxvf3",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\n[For part 1: https:\\/\\/www.reddit.com\\/r\\/wallstreetbets\\/comments\\/ithw0v\\/option\\_play\\_for\\_the\\_nkla\\_fire\\_dumpster\\_without\\/](https://preview.redd.it/1gizpzkx0jn51.png?width=1620&amp;format=png&amp;auto=webp&amp;s=f58500264d14231a65301c098370d9ae3db139da)\n\nThis is why you do a spreads on a dumpster fire that have tadpoles REEing their life savings even with a DOJ investigation looking into the company. Turd went up and still made money due to increased IV while thetagangin.\n\nSimply look at how bulls on NKLA process information [https://stocktwits.com/symbol/NKLA](https://stocktwits.com/symbol/NKLA) &amp; [https://www.reddit.com/r/NikolaCorporation/](https://www.reddit.com/r/NikolaCorporation/).\n\nI've closed my positions as NKLA is simply too unpredictable. I've made $$ on this. and it's time to move on. Good luck to the ones that are holding and awaiting for a possible halt. \n\n&amp;#x200B;\n\nTL;DR\n\nGTFO too unpredictable. DOJ investigation for NKLA tadpoles = Stonk up, prove innocence WTF \n\n&amp;#x200B;\n\nCurrent positions: PYPL hit my 184 fib rainbow lines\n\nPYPL -5 SEP 18 210C\n\nPYPL 5 OCT 16 210C",
        "subreddit": "wallstreetbets",
        "title": "*Update* Option play for the NKLA time to close",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/itxvf3/update_option_play_for_the_nkla_time_to_close/",
        "created": 1600299267.0
    },
    {
        "author": "hollaatyoself",
        "created_utc": 1600445693,
        "id": "iv933l",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "New to investing — have mostly been doing ETFs but was thinking of plunging into individual companies.\n\nThere are a few companies I think are solid/will remain solid but really unsure about how to go about figuring out when to buy in since I just feel like I missed the giant window from 6 months ago?\n\nI was considering some tech companies (Apple, Microsoft, google, AMD) vs. the listed credit card/e payment systems given covid, etc.\n\nThoughts on what might be a good place to start?\n\nThanks!\n\nEdit: not sure how to change post flair...",
        "subreddit": "RobinHood",
        "title": "New to investing - thoughts on V, MC, PYPL?",
        "url": "https://www.reddit.com/r/RobinHood/comments/iv933l/new_to_investing_thoughts_on_v_mc_pypl/",
        "created": 1600474493.0
    },
    {
        "author": "FilipeBarroso",
        "created_utc": 1600545499,
        "id": "ivzmp2",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "I come here after some time since my last post to update my you guys about my financial life.\n\nMy objective with this post is to receive criticisms and opinions about the portfolio that I am \"creating\". (don't be sweet)\n\nOn August 7th I turned 18 and the \"first\" thing I did besides enjoying the day with my family, etc ... was opening my account at Degiro and Trading 212.\n\nOn Degiro I have bought the ETF IWDA. I still have very little money (3 positions) but I intend to continue buying this ETF every month for the next few years. In other words, this will be my main investment focus.\n\nIn trading 212 I have in mind to do the following. I created with this new feature of the pies, 2 pies.\n\nOne with 10 stocks focused on Tech (Apple, Facebook, Amazon, Tesla, Google, Microsoft, Nvidia, Adobe, Paypal, Shopify) I do not intend to \"trade\" with these shares. The goal is to consistently invest and hold. No panic sells. I invest not because they are popular, but because I believe in the companies.\n\nThe other pie is aimed at ESG and renewable energy companies. Companies that, due to the little research I did, seem very promising (NextEra Energy, Brookfield Renewable Partners, Nvidia, PlugPower, FuelCell)\n\nResuming:\n\nDo you think it's a good strategy to do this?\n\nMy Investment focus on Degiro, putting most of my money on the IWDA, and on Trading, investing in the 2 pies I told you about. My idea is to have something safer at Degiro, and to be aggressive at Trading.\n\nLeave your opinions, criticisms and suggestions for portfolios.\n\nI still have time to change because I am very young and I only have 220 euros invested in total on both platforms.\n\nThank you!!!!",
        "subreddit": "investing",
        "title": "My portfolio at 18y",
        "url": "https://www.reddit.com/r/investing/comments/ivzmp2/my_portfolio_at_18y/",
        "created": 1600574299.0
    },
    {
        "author": "Vomojec554",
        "created_utc": 1599138003,
        "id": "ilsx0u",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Okay fellas. I'm sick of seeing the same shit here. You guys turned into Apple, Tesla, Nvidia, and Amazonbets. Here's a nugget of gold for you that most of you will ignore. Alibaba's financial/payment platform, Ant financial, spun off years ago. What's so great about them? Imagine purchasing shares in Visa and PayPal simultaneously. Theyre virtually the only game in town in China. Theyre seeking more than 30 billion in their IPO, making this the largest IPO in history with way more upside than Aramco ( 2nd largest IPO ever). They've filed for an IPO but they've refused to list on the NYSE. How do you buy? Thats a two-fold answer....if you only have Robinhood or Webull than you're fucked (sorta). You need a legitimate platform like Etrade or Charles Schwab. If you give a shit, you'll figure it out. Whats the second way to buy you ask? Alibaba has a 30% stake in Ant and they're destined to rise alongside Ant. Pick a call and strike date at least 90 days out. Your upside using option 1 is much higher buy option 2 will still make you a solid return. Please post the gain porn if you follow my advice. I'll do the same.\n\nTLDR: Read it fuckface",
        "subreddit": "wallstreetbets",
        "title": "Ant financial",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ilsx0u/ant_financial/",
        "created": 1599166803.0
    },
    {
        "author": "mcashgotpaid",
        "created_utc": 1599082313,
        "id": "ilg3i7",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Anyone want to bet please comment I take paypal. Anyone want to bet please comment I take paypal. Anyone want to bet please comment I take paypal. Anyone want to bet please comment I take paypal.\n\nAnyone want to bet please comment I take paypal.\n\nAnyone want to bet please comment I take paypal.\n\nAnyone want to bet please comment I take paypal.\n\nAnyone want to bet please comment I take paypal.\n\nAnyone want to bet please comment I take paypal.\n\nAnyone want to bet please comment I take paypal.\n\nAnyone want to bet please comment I take paypal.",
        "subreddit": "wallstreetbets",
        "title": "World Markets are going nosedive in the next two to three days. SPY will not cross 360. BET",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ilg3i7/world_markets_are_going_nosedive_in_the_next_two/",
        "created": 1599111113.0
    },
    {
        "author": "Igettheshow89",
        "created_utc": 1599104429,
        "id": "ilm25f",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "It’s done pretty well since then. I’m considering removing my gains, and a little bit of the initial capital, to start a position in PayPal. Thoughts?",
        "subreddit": "stocks",
        "title": "I bought Intel at the end of July right after the crash...",
        "url": "https://www.reddit.com/r/stocks/comments/ilm25f/i_bought_intel_at_the_end_of_july_right_after_the/",
        "created": 1599133229.0
    },
    {
        "author": "Didi_Sky007",
        "created_utc": 1599674881,
        "id": "ipl8nk",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "What’s your take for long term hold?",
        "subreddit": "wallstreetbets",
        "title": "PayPal v VISA v MasterCard",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ipl8nk/paypal_v_visa_v_mastercard/",
        "created": 1599703681.0
    },
    {
        "author": "SwooshMoose",
        "created_utc": 1600458731,
        "id": "ivd8co",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "So it has been a bit over a year investing for me. I have not been playing with a lot of capital, as I'm only 21 and don't have too much to spare, but needless to say I got a bit carried away with options trading (almost all just buying calls for earnings thanks wallstreetbets) and I am currently down about 5% all time. I really fear how rich some of my favorite companies (AAPL, MSFT, PYPL, TSLA) are trading these days, and decided its not worth holding my shares through what is about to come.\n\n&amp;#x200B;\n\n The strategy that I want to employ throughout the remainder of the year is this: Run a wheel strategy on low cost, high volatility companies by selling weekly cash covered puts and covered calls and use the premiums off of those to buy into companies hit hard\n\n&amp;#x200B;\n\nCurrently, I'm looking into running this wheel strategy on NIO and using the premiums to buy shares of BA, JPM, and XOM. These companies have been hit hard due to the pandemic and I see the most upside for them throughout recovery and the election, plus they pay quite sizeable dividends. I was just wondering if you guys had any advice as to different companies to run the wheel strategy on or other companies the invest the premiums into. Long term I would like to make big positions in the companies I listed before that I really like but I can't seem to buy them currently with them trading at such high forward PEs. Also if this strategy seems like a bad idea I would appreciate being told as well :)",
        "subreddit": "investing",
        "title": "Looking for any thoughts on my strategy playing the election/vaccine",
        "url": "https://www.reddit.com/r/investing/comments/ivd8co/looking_for_any_thoughts_on_my_strategy_playing/",
        "created": 1600487531.0
    },
    {
        "author": "Yiew33",
        "created_utc": 1599006983,
        "id": "ikwm6h",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "I was holding shares in Afterpay (ASX) but due to PayPal's announcement of releasing their 'Pay in 4' plan, the former has tanked, and the latter has jumped.\n\nWith the launch expected to be in October 2020, I'm just wondering whether it would make PayPal a smart investment since they already have a foundation behind them to work from.",
        "subreddit": "stocks",
        "title": "Opinions on PayPal after their 'Pay in 4' announcement.",
        "url": "https://www.reddit.com/r/stocks/comments/ikwm6h/opinions_on_paypal_after_their_pay_in_4/",
        "created": 1599035783.0
    },
    {
        "author": "SSB_123",
        "created_utc": 1599761664,
        "id": "iq8v4d",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Any opinions on Paypal and Visa on long term holds? I am looking to invest for the long run however I want to also know when the best time to buy is, we all know that we cannot time the market however do you guys feel like we're in a tech bubble waiting to burst? Just in need of a second opinion. Thank you.",
        "subreddit": "stocks",
        "title": "Long term holds",
        "url": "https://www.reddit.com/r/stocks/comments/iq8v4d/long_term_holds/",
        "created": 1599790464.0
    },
    {
        "author": "coughingcoffee01",
        "created_utc": 1600230836,
        "id": "itovm3",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "PayPal currently sits at 186.50$ per share, down 12-13% of its recent high. However, it’s way way up since the crash in March. Is the current price for PayPal a fair value? Is it overpriced? And do you think it’ll trend up or down over the early/medium/long term? Thanks guys! All input is appreciated (:",
        "subreddit": "stocks",
        "title": "What’s a fair value for PayPal?",
        "url": "https://www.reddit.com/r/stocks/comments/itovm3/whats_a_fair_value_for_paypal/",
        "created": 1600259636.0
    },
    {
        "author": "street-guru",
        "created_utc": 1600712467,
        "id": "ix607t",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Goldman:\n\n\"**Growth is more valuable to investors than ever in the low interest rate environment that is likely to persist for years.** Rates at the lower bound enhance the net present value of stocks with strong expected long-term growth. Growth has outperformed Value during the past 1, 3, 5, and 10 years. High growth stocks now trade at the largest valuation premium to low growth stocks in 20 years. Short-term disruptions may occur but investor demand for secular growth will persist.\"\n\n\"**This report refreshes our \"Rule of Ten\" secular growth analysis and highlights 21 firms in the S&amp;P 500 with the potential to be future index leaders**. These stocks will not necessarily supplant the current five largest stocks. But they have the potential to significantly increase their index rankings from the current median of 154, generating strong returns for portfolio managers along the way. From a sector perspective, Information Technology, Health Care, and Communication Services account for 19 of our 21 Rule of Ten stocks. The median stock has expected 2018-2022 annualized sales growth of 18% (vs. 4% for the S&amp;P 500), trades at 43x 2021E EPS (vs. 20x) and 9x EV/sales (vs. 3x), and has returned 21% YTD (vs. 0%).\"\n\n\"**Most of the stocks relate to five broad themes:** (1) Computerization of healthcare; (2) digital transformation of business; (3) workflow automation; (4) e-commerce and digital payments; and (5) advancements in life sciences.\"\n\n\"Among those five themes, we highlight potential \"future five\" stocks that our equity analysts believe have compelling secular growth opportunities: **ISRG, ADSK, NOW, PYPL, VRTX**. Common attribute: Large total addressable markets.\"",
        "subreddit": "investing",
        "title": "Goldman highlights \"The Future Five\" - 5 stocks that have compelling secular growth opportunities",
        "url": "https://www.reddit.com/r/investing/comments/ix607t/goldman_highlights_the_future_five_5_stocks_that/",
        "created": 1600741267.0
    },
    {
        "author": "Viridianimpact",
        "created_utc": 1601315471,
        "id": "j1gxqd",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Listen up retards, a lot of you whales are thinking \"ah a third up day in a row now is my chance to dump millions into YOLO positions that would make an autist look like Stephen Hawking.\" So instead, I propose you just give your money to me.  Its a much better investment, you wont necessarily LOSE money like you normally would, and hey maybe I'll give it back if you ask nicely. But regardless, I was just thinking only difference between me and the President is I havent asked for millions of dollars without any reason. So here I am. and here is my PayPal, paypal.me/viridianimpact . See you autists in the oval office! \n\n\nAlso my rent is due, and I wasted it all on TSLA puts.",
        "subreddit": "wallstreetbets",
        "title": "Don't waste your money!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j1gxqd/dont_waste_your_money/",
        "created": 1601344271.0
    },
    {
        "author": "Brothanogood",
        "created_utc": 1600976936,
        "id": "iz4cr3",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Square shares are up 146% in 2020 so far, and analysts at Oppenheimer think the stock can still go higher.\n\nOn Thursday, Oppenheimer upgraded Square ([SQ](https://finance.yahoo.com/quote/SQ?p=SQ&amp;.tsrc=fin-srch)) to outperform, with a price target of $185. (The all-time high was $166 on Sept. 1; shares were trading at around $152 on Thursday afternoon.) The upgrade is based on the growth of Square’s Cash App, and on the company’s opportunity to help merchants transition to e-commerce.\n\nBut really, the note is a post-pandemic vote of confidence.\n\nAs Oppenheimer writes, the COVID-19 pandemic has initiated a “massive shift in digital commerce, requiring merchants to rapidly adopt omni-channel solutions.” Of course, it was already obvious before the pandemic that the retail landscape was barreling toward e-commerce, but the pandemic has sent the trend into hyperdrive. [Walmart, Target, and Best Buy reported enormous surges](https://finance.yahoo.com/news/walmart-and-target-huge-ecommerce-gains-are-a-blaring-siren-to-brickandmortar-retail-192709224.html) (100%+) in digital sales in Q2; online-only retailers [Etsy](https://finance.yahoo.com/news/etsy-ceo-on-huge-q-2-etsy-is-becoming-much-more-mainstream-181632322.html) and [Wayfair](https://finance.yahoo.com/news/wayfair-stock-is-up-250-this-year-193131685.html) blew out their Q2 earnings; [Dick’s Sporting Goods is thriving](https://finance.yahoo.com/news/dicks-sporting-goods-is-wildly-outperforming-amid-the-pandemic-195504143.html) thanks to a combination of online sales and curbside pickup.\n\nAll of those are big retail names. Square’s bread and butter are SMBs (small and medium-sized businesses), which also need to immediately prioritize their e-commerce presence, if they didn’t already. Hundreds of thousands of small business have shut down due to the pandemic, but those that have survived will need to beef up their digital presence.\n\nOppenheimer believes Square is well-suited to serve those small businesses coming out of the pandemic, positioning Square “for outsized share gains as economic activity normalizes.”\n\nOppenheimer pegs Square’s TAM (total addressable market, [the “it” tech stat of the moment](https://finance.yahoo.com/news/what-cannabis-and-fake-meat-have-in-common-right-now-180741286.html)) at $160 billion, and within that, puts Cash App’s TAM at $63 billion, noting that “by reinvesting profits from prior Cash App cohorts, combined with its seller ecosystem, Square can develop significant network effects and products that will be challenging for other neo-banks to replicate in the digital wallet space.”\n\nIn other words, Square has an advantage over banks in the mobile payments race.\n\nOppenheimer also notes the “impressive volume and gross profit growth” of Cash App’s bitcoin trading feature. Square [enabled bitcoin trading within Cash App in 2018](https://finance.yahoo.com/news/why-square-embrace-bitcoin-brilliant-182530364.html). It reaped $875 million in bitcoin revenue in the second quarter, up 600% year over year, and $17 million in bitcoin gross profit, up 711% year over year. ($17 million is small for a company with $4.17 billion in revenue in 2019, but the growth is the point.) Oppenheimer cites the growth in bitcoin revenue as proof of “the scalability in the Cash App business model.”\n\nBitcoin has been a noted (and [some believe problematic](https://finance.yahoo.com/news/jack-dorseys-love-of-bitcoin-could-be-a-problem-for-square-122742500.html)) obsession of CEO Jack Dorsey.\n\nSquare has always touted that it serves both sides of the small business equation: sellers (i.e., businesses, through its point of sale hardware, payroll software, and Square Capital loan business) and shoppers (consumers paying with Square devices and/or using Cash App). Oppenheimer writes that this “two-sided network” will make Square “a structural winner during the recovery.”\n\nOf course, there’s an obvious downside case against Square: “Economic pressures persist longer than anticipated” if the pandemic drags on or even worsens, hitting small businesses harder; “competitive responses dampen growth,” and Square certainly has big competitors, including FIS (which acquired Worldpay last year), PayPal, ShopKeep, and Shopify; and if “new product launches and adoption slow,” which will be up to Dorsey and Square’s own pace of innovation.\n\nOppenheimer sees Square profit growing at a 37% annual rate from the end of 2020 through the end of 2022. Square was [Yahoo Finance’s Company of the Year in 2018](https://finance.yahoo.com/news/square-yahoo-finances-2018-company-133124167.html).\n\n—\n\n**Daniel Roberts is an editor-at-large at Yahoo Finance and closely covers fintech and payments. Follow him on Twitter at @**[**readDanwrite**](https://twitter.com/readDanwrite)**.**\n\n[**https://money.yahoo.com/square-is-positioned-to-be-a-winner-during-the-recovery-postpandemic-oppenheimer-191528365.html**](https://money.yahoo.com/square-is-positioned-to-be-a-winner-during-the-recovery-postpandemic-oppenheimer-191528365.html)",
        "subreddit": "stocks",
        "title": "Square is positioned to be a winner by helping small businesses digitize post-pandemic: Oppenheimer",
        "url": "https://www.reddit.com/r/stocks/comments/iz4cr3/square_is_positioned_to_be_a_winner_by_helping/",
        "created": 1601005736.0
    },
    {
        "author": "starwarscapital",
        "created_utc": 1599147294,
        "id": "ilvpbf",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Alright, listen up. If you're into DD and maths and shit like that, there is plenty of that on Cathie Arkk's website. It's her 3rd largest holding.\n\nIf you don't have the attention span to read all of that, basically what it says is that Square's user acquisition cost is a million times cheaper than traditional banks and they have a million times less overhead because they are all digital and have a huge payments ecosystem plus Cash App just makes things simple af.\n\nNow you're wondering, how high can this fucking thing go? Well let me tell you. Square is going to zoom right past $PYPL then $BAC and then $JPM's market cap real soon. It's currently at $67b market cap and $150 bucks... it hit $170 last week. \n\n… You might think I'm crazy, \n\nbut I don't even care'\n\nCause I can tell what's going on\n\n**It's hip to be square**\n\n$SQ 1/15 170c",
        "subreddit": "wallstreetbets",
        "title": "It's Hip To Be Square ($SQ)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ilvpbf/its_hip_to_be_square_sq/",
        "created": 1599176094.0
    },
    {
        "author": "Ironleg01",
        "created_utc": 1599740604,
        "id": "iq29t1",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "[https://www.bloomberg.com/news/articles/2020-09-09/jpmorgan-finds-some-workers-improperly-pocketed-relief-funds](https://www.bloomberg.com/news/articles/2020-09-09/jpmorgan-finds-some-workers-improperly-pocketed-relief-funds)\n\nWhile you eat each others assholes for pennies real professionals are at work.\n\n&amp;#x200B;\n\n&gt;[JPMorgan Chase &amp; Co](https://www.bloomberg.com/quote/JPM:US). found that some of its employees improperly applied for and received Covid-relief money that was intended for legitimate U.S. businesses\n\n&amp;#x200B;\n\nForget puts and calls and gamma and all that shit. All you have to do is to get employed by a major bank and literally PayPal money into your account. It's as simple as that.\n\n&amp;#x200B;\n\n&gt;noticing that suspicious amounts of money had been deposited into checking accounts owned by bank employees",
        "subreddit": "wallstreetbets",
        "title": "You fucking amateurs",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iq29t1/you_fucking_amateurs/",
        "created": 1599769404.0
    },
    {
        "author": "BeernerdoMazzeroli",
        "created_utc": 1600703350,
        "id": "ix2zq2",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Position: FEZ Jan15'21 42 PUT\n\nIt's time to get bearish boys. I will never bet against America because it's the greatest fucking country on earth, but our Euro brethren are fair game. \n\nThe Eurostoxx index have largely traded equally or somewhat better than the SNP thus far. I have taken a short position against the Eurostoxx due to the following reasons:\n\nHard Brexit: Two weeks ago prime minister Johnson introduced a bill that is in direct contradiction to previous agreements. His defense was basically that Europe can go eat shit, no reason needed. Germany is Europe's enforcer, however the COVID pandemic has lead to a dry run of a hard brexit and German exports largely survived. This time around they will be much less likely to fight against a hard Brexit seeing as how it's been in place for the majority of the year in any case.\n\nBanking scandals: Obvious reason. The EU economy is heavily reliant on it's banking sector. This sector is terrible and will continue lower.\n\nCOVID peeking it's ugly head again: The seven day MA of new covid cases are at all time highs in EU countries. I could give a shit about COVID, but our EU brethren are likely to implement another round of lockdowns, much more so than the USA.  American case counts are down but Europe has steadily been ticking higher.\n\nNo tech: No Amazon, no Adobe, no PayPal to save their market.\n\nCurrency: In a time of severely limited economic growth countries cannot afford to let their currencies rally, we've seen this before. I causes severe deflation and weakened financial asset prices.\n\nLack of fiscal stimulus: As usual the EU will be late to the party with further fiscal stimulus.\n\nThe timing seems perfect to open this position and option volatility on FEZ is still low. Cheers.",
        "subreddit": "wallstreetbets",
        "title": "Monday Night Bear Orgy: Time to short Europe",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ix2zq2/monday_night_bear_orgy_time_to_short_europe/",
        "created": 1600732150.0
    },
    {
        "author": "AlphaMaleMBC",
        "created_utc": 1600610602,
        "id": "iwee8h",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Can I get some suggestions for some Android apps that I can use, i would like to use my PayPal account for trading and I do not wish to invest a lot, my goal is to make a fixed income with stocks. I want to have a fixed income with stock trading, I'm willing to wait a few months, to have a decent amount of money to play around with, but I would like to start now with these $10 that I have. My goal is not to become rich with it but simply to have a passive income on the side that will help with my utility bills.",
        "subreddit": "investing",
        "title": "I'm 20 and a graduate, How do I get started with $10 in my PayPal account?",
        "url": "https://www.reddit.com/r/investing/comments/iwee8h/im_20_and_a_graduate_how_do_i_get_started_with_10/",
        "created": 1600639402.0
    },
    {
        "author": "Budd_Lee",
        "created_utc": 1600518875,
        "id": "ivrram",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Just recently started trading back seriously back in June of this year.   I brought a few stocks just based on hype, high dividend yield,  and even brought a few stocks at their highs.  As you would guess,  dividend cuts,  all time lows,  and in the red.  All in all, after 3 months of studying the in and outs out and doing my due diligence on particular stocks I have realize almost half my portfolio I should never invested into.  I have a few that I did do dd on and the are doing well.  \n\nWhat I really want to do is consolidate down to maybe 4-6 of my stocks that I feel are the future in terms of post pandemic.  SQ,  PYPL,  DOCU, TDOC, etc.  Trying to keep up with 12 stocks is too much right now.  \n\nMy only issue with selling the positions I currently have that I brought for reasons other than my own research is I may miss out on gains if they go up in a few months or years.  The other side of it is telling me sell and take on more shares of stocks that holds my interest after extensive research.  I feel the latter is a better decisions because I feel it’s guaranteed growth regardless of speculation?  \n\nAny suggestions?",
        "subreddit": "stocks",
        "title": "Consolidated Portfolio?",
        "url": "https://www.reddit.com/r/stocks/comments/ivrram/consolidated_portfolio/",
        "created": 1600547675.0
    },
    {
        "author": "tomorland",
        "created_utc": 1600143533,
        "id": "it1kg5",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Yes, NKLA seems shady as hell.  When I first heard of Nikola, It reminded me of J. K. Rowling's agent declining to read the Harry Potter manuscript. \"The title tells me all I need to know.\"  He said. \n\nThe name Nikola screams \"Me too! Me too!\"  And when I heard it was Hydrogen powered, I closed that book. Anyone who's done the energy equation on hydrogen power knows it's not a compelling technology.  \n\nBut, NKLA surprised me. It's no small feat to get a company listed on the exchange. Maybe there's something happening here after all. \n\nI'm sure we've all heard the joke about the guy who looks at his loser son and realizes he has to do something. So he calls Bill Gates and says, \"your daughter is going to marry my son.\"  \n\nBill gates says, \"No she's not.\" \n\nSo the man says, \"But he's the president of the world bank.\"  \n\nBill says, \"ok.\"\n\nThen the man calls the world bank and says, \"My son is going to be the president of the world bank.\" \n\nThey say, \"No he's not.\" \n\nAnd the man says, \"But he's married to Bill Gates' daughter.\"\n\nSo the world bank says, \"ok.\" And everyone lived happily ever after.\n\nI can't help but wonder if Trevor has something like that going on with NKLA. The name is a good marketing gimmick. He's pulled off an impressive operation so far. He probably wishes we'd all shut up so he can get there, like Molly Ringwald in that movie The Pickup Artist. (Y'all seen that movie, Right? Classic.) \n\nI'm sure bigger long-shots have paid off in the past, probably only because no one was looking too hard at it. Paypal, for instance...",
        "subreddit": "investing",
        "title": "In defense of Trevor",
        "url": "https://www.reddit.com/r/investing/comments/it1kg5/in_defense_of_trevor/",
        "created": 1600172333.0
    },
    {
        "author": "KeithLav",
        "created_utc": 1599593680,
        "id": "ip0f8s",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Hi all, looking for some advice on instruments to add to my high risk bucket. My plan would be to contribute some cash to it every month and rebalance every so often depending on performance.\n\nI've found most of these from growth threads but they're all companies I know about and have high hopes of. Overall I think it's a good list of strong potentials.\n\n$ETSY\n\n$PYPL\n\n$FSLY\n\n$SHOP\n\n$CRWD\n\n$CRM\n\n$SPCE\n\n$NET\n\n$SQ\n\nTell me what you think",
        "subreddit": "stocks",
        "title": "Thoughts on the following stocks for a high risk/high growth portfolio",
        "url": "https://www.reddit.com/r/stocks/comments/ip0f8s/thoughts_on_the_following_stocks_for_a_high/",
        "created": 1599622480.0
    },
    {
        "author": "PsychedelicInvest",
        "created_utc": 1599145463,
        "id": "ilv3rr",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "From the article: \n\n&gt;Mental health treatments startup Bionomics is hoping to execute a company turnaround and validate its treatment for post-traumatic stress disorder after securing funding from high profile biotech investors.  \n&gt;  \n&gt;The ASX-listed company has secured a subscription agreement worth up to $22 million with German financier and psychedelic treatments advocate Christian Angermayer, through his family office Apeiron Investment Group. Apeiron has also engaged other investors through this process and a group including PayPal co-founder Peter Thiel and former hedge fund manager Mike Novogratz will also come on board as investors.\n\n[https://www.smh.com.au/business/small-business/bionomics-secures-big-tech-investors-for-ptsd-treatment-20200901-p55r7o.html](https://www.smh.com.au/business/small-business/bionomics-secures-big-tech-investors-for-ptsd-treatment-20200901-p55r7o.html)\n\nProbably worth keeping an eye on.",
        "subreddit": "shroomstocks",
        "title": "Is Bionomics (BNO) pivoting to psychedelics? Christian Angermayer, Peter Thiel, Mike Novogratz now investors",
        "url": "https://www.reddit.com/r/shroomstocks/comments/ilv3rr/is_bionomics_bno_pivoting_to_psychedelics/",
        "created": 1599174263.0
    },
    {
        "author": "psr1029",
        "created_utc": 1599985698,
        "id": "irukdi",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "PayPal Credit and Synchrony Financial..",
        "url": "https://www.reddit.com/r/investing/comments/irukdi/paypal_credit_and_synchrony_financial/",
        "created": 1600014498.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1600609814,
        "id": "iwe67l",
        "num_comments": 2,
        "num_crossposts": 0,
        "subreddit": "investing",
        "title": "How do I get started with $10 in my PayPal account (I would like to invest in s&amp;p500 funds) ?",
        "url": "https://www.reddit.com/r/investing/comments/iwe67l/how_do_i_get_started_with_10_in_my_paypal_account/",
        "created": 1600638614.0
    },
    {
        "author": "Xckoro",
        "created_utc": 1601345478,
        "id": "j1q8qf",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Selling my entire domain portfolio which includes 30 premium .com domain names and portfolio website, all for only $1,500\n\n1. Seller Bio\n\nSelling my domain portfolio of 30 premium .com domain names. This sale includes all 30 domain names and the portfolio website. Sale also inludes every custom logo on each domain. All for only $1,500\n\n2. Executive Summary\n\nFor the new owners It will be easy to profit from these domains. You can easily make the money back by selling 1 or 2 domains. I am just short on time and do not have the time to promote each domain, due to having a baby on the way and my job cutting hours.\n\nThe total value of this protfolio is easily over $8,000. Some of the domain names included in this sale can be very valuable, for example StarRage.com previously sold for $2,095, just by selling that one for example you’ll make your initial money back and have  29 premium domains left to sell.\n\n3. How is it monetized?\n\nSite has not been monetized or advertised in any way. All traffic is organic.\n\n4. How much time does this site take to run?\n\nBesides adding new domains, no time. Website runs by itself and all domains have already been added to the major domain marketplaces like Sedo.com, Dan.com &amp; Afternic.com\n\nSale Page:\n\nhttps://flippa.com/10681347-tierdomains-com-premium-domain-portfolio-for-sale\n\n\nWhat included in the sale?\n\n- Main Website + Main Domain (TierDomains.com)\n- All custom logos\n- MentorCrypto.com - $1,000 value\n- CryptoThefts.com - $1,000 value\n- CounterHacks.com - $900 value\n- StarRage.com - This domain previously sold for $2,095!\n- SaleHats.com - $800 value\n- HackSleep.com - $800 value\n- JobOverview.com - $800 value\n- MaidsFinder.com - $700 value\n- ShillCrypto.com - $700 value\n- VirtualEpic.com - $700 value\n- ScriptMeds.com - Currently on sale for $5,995 on BrandBucket.com!\n- HowToJobSearch.com - $700 value\n- PurchasingBitcoin.com - $600 value\n- WildPorno.com - $600 value\n- PornoDomains.com - $600 value\n- MiamiMarinas.com - $550 value\n- FunnyStuffs.com - $500 value\n- BreastBud.com - $500 value\n- ZooTrek.com - $500 value\n- VirtualSiteDesign.com - $400 value\n- MatureJokes.com - $400 value\n- NameMates.com - $400 value\n- BuyJacuzzi.com - $400 value\n- ShyVirgin.com - $400 value\n- BirthdayShops.com - $400 value\n- PixelRave.com - $300 value\n- RobotFriendly.com - $300 value\n- TradingZilla.com - $200 value\n- AcesBets.com - $150 value\n\nEverything in this list is included in the sale. Buy Now price is only $1,500\n\n90% of the domains domains were registered using NameSilo, the other 10% using GoDaddy.\n\nI accept Paypal or Crypto (Bitcoin)\nPlease message me if you have any questions \n\nPortfolio is for sale over at Flippa \n\nhttps://flippa.com/10681347-tierdomains-com-premium-domain-portfolio-for-sale",
        "subreddit": "investing",
        "title": "TierDomaims.com - Premium Domains For SALE -Great Investment Opportunity",
        "url": "https://www.reddit.com/r/investing/comments/j1q8qf/tierdomaimscom_premium_domains_for_sale_great/",
        "created": 1601374278.0
    },
    {
        "author": "TheMarketCrash",
        "created_utc": 1599670094,
        "id": "ipjoos",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Ebay earnings eat Oct 21. With sells and sellers on the rise, expanding over seas, and phasing out PayPal from ebay I can't imagine what not going up a few bucks. Thoughts? Bonus meme elon propping tesla before cashing out",
        "url": "https://i.redd.it/twj5dysyi5m51.gif",
        "created": 1599698894.0
    },
    {
        "author": "vtx_peanut",
        "created_utc": 1599197914,
        "id": "imabr1",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "## What is Swagbucks?\n\nhow to make money online?&gt;  \nSwagbucks is a free online rewards membership program. Members simply sign-up with an email address and password. And, after members verify their account, they can start earning points in the Swagbucks rewards currency called SB. Once members have as few as 300 SB, they can redeem the points for [f](https://www.swagbucks.com/free-gift-cards)ree gift cards or free Paypal payments. here is a link; [press here](https://www.swagbucks.com/lp-savings-button?cmp=695&amp;cxid=swagbuttonref&amp;rb=82106871&amp;extRefCmp=1&amp;extRb=82106871)",
        "subreddit": "investing",
        "title": "how to make money online (swagbucks)",
        "url": "https://www.reddit.com/r/investing/comments/imabr1/how_to_make_money_online_swagbucks/",
        "created": 1599226714.0
    },
    {
        "author": "Keels219",
        "created_utc": 1599679099,
        "id": "ipmzuc",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Robinhood is fucking all of us how on earth is the share price of paypal higher than it was but the option is $250 less can anyone explain",
        "url": "https://v.redd.it/yrcl010d96m51",
        "created": 1599707899.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1601140295,
        "id": "j09tt6",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "https://www.thestreet.com/investing/paypal-and-square-could-gain-as-eu-mulls-iphone-payments-rules\n\nPayPal  (PYPL) - and Square  (SQ) - could be among the winners as the EU’s antitrust regulator mulls rules that could end Apple Pay’s monopoly on iPhone tap-to-pay services.\n\nHowever, with COVID-19 driving greater interest in contactless transactions, PayPal has been working hard to integrate QR code payment solutions within the PayPal and Venmo mobile apps (Apple Pay, it should be noted, might get QR code support as well). And CEO Dan Schulman has indicated PayPal is also interested in launching its own tap-to-pay service.\n\nSquare, which has seen tremendous usage growth for its Cash App in recent months, could also conceivably launch a tap-to-pay service if it gains access to iPhone NFC chips. Square could both integrate the service with its Cash App and -- given that its card readers already support Apple Pay and Google Pay -- push a software update to its mobile point-of-sale (POS) apps that allows the many businesses that use Square’s POS platform to support a Square tap-to-pay service.",
        "subreddit": "stocks",
        "title": "PayPal and Square Could Gain as EU Mulls iPhone Payments Rules",
        "url": "https://www.reddit.com/r/stocks/comments/j09tt6/paypal_and_square_could_gain_as_eu_mulls_iphone/",
        "created": 1601169095.0
    },
    {
        "author": "ghathawayjunior",
        "created_utc": 1600973232,
        "id": "iz36y4",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I was thinking stocks like zoom, docusign, Adobe, fedex, ups, PayPal, square, Apple, Nvidia, and numerous others seem like they have overextended themselves to unjustified valuations. Even after the 14% drop in the Nasdaq they still seem like they are overvalued. Are there other stocks that you think are overvalued? Any thoughts or ideas on this?",
        "subreddit": "stocks",
        "title": "What stocks seem like they are very overvalued to you compared to pre covid?",
        "url": "https://www.reddit.com/r/stocks/comments/iz36y4/what_stocks_seem_like_they_are_very_overvalued_to/",
        "created": 1601002032.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1599748310,
        "id": "iq4epk",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "https://techcrunch.com/2020/09/10/instant-transfers-visa-paypal/\n\nThis will mean that consumers and businesses globally that send or receive money by PayPal, Venmo or Xoom, or via Braintree, Hyperwallet and iZettle product solutions (all of which are part of PayPal), will now be able to opt for the Instant Transfer option to get electronic funds faster. PayPal’s services use Visa Direct for making the payouts.\n\nPayPal said that a recent survey it conducted found that 76% of small businesses in the US have reported that they are struggling with cash flow shortages, and 91% said the having real-time settlement could help with some of that.\n\n“Digital is quickly becoming the preferred way for people and businesses to move money,” said Jim Magats, SVP Omni Payments, PayPal, in a statement.  “While the global pandemic has dramatically accelerated the shift to digital, we see this move to digital as a long-term change that will outlast the pandemic. We’re excited to expand our partnership with Visa to help more customers around the world get faster access to their funds, which is all the more critical during these challenging times.”",
        "subreddit": "StockMarket",
        "title": "PayPal, Visa expand Instant Transfers for fast payouts globally on all PayPal’s networks",
        "url": "https://www.reddit.com/r/StockMarket/comments/iq4epk/paypal_visa_expand_instant_transfers_for_fast/",
        "created": 1599777110.0
    },
    {
        "author": "hollaatyoself",
        "created_utc": 1600445832,
        "id": "iv94os",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "New to investing - thoughts on V, MC, PYPL as entry point?",
        "url": "https://www.reddit.com/r/stocks/comments/iv94os/new_to_investing_thoughts_on_v_mc_pypl_as_entry/",
        "created": 1600474632.0
    },
    {
        "author": "Poopiebutthole00",
        "created_utc": 1600526332,
        "id": "ivtoz5",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Paypal or Square",
        "url": "https://www.reddit.com/r/stocks/comments/ivtoz5/paypal_or_square/",
        "created": 1600555132.0
    }
]