[
    {
        "author": "farting_tomato",
        "created_utc": 1597612865,
        "id": "ib0pdh",
        "num_comments": 79,
        "num_crossposts": 0,
        "selftext": " [https://www.zerohedge.com/markets/what-hedge-funds-bought-and-sold-second-quarter](https://www.zerohedge.com/markets/what-hedge-funds-bought-and-sold-second-quarter)\n\nTL;DR\n\nADAGE CAPITAL PARTNERS\n\n* Top new buys: RPRX, ABBV, W, HZNP, FIVE, ST, CCK, TRV, USB, JCI\n* Top exits: BMY, GILD, ETN, PNC, MAS, EXC, AON, CCMP, NI, CX\n* Boosted stakes in: BURL, PYPL, FTV, ITT, LOW, GOOGL, TMUS, EYE, AZO, BMRN\n* Cut stakes in: LMT, JNJ, PFE, HON, VZ, VRTX, TGT, VMC, PXD, LLY\n\nAPPALOOSA\n\n* Top new buys: T, V, MA, PYPL, DIS, SYY, EMR, MO, SQ, TEN\n* Top exits: INTEQ, XLU, BKLN\n* Boosted stakes in: TMUS, BABA, MU, HCA, MSFT, BSX, TWTR, WFC, CRM, GT\n* Cut stakes in: PCG, UNH, TSLA, HUM, VST, AMLP, AVGO, NFLX, QCOM, ADBE\n\nBALYASNY ASSET MANAGEMENT\n\n* Top new buys: SCHW, ABT, TGT, HD, ADBE, SHOP, ITW, COST, C\n* Top exits: JCI, AMTD, INTC, CHTR, KR, TMUS, TTWO, NVDA, ICE, ROST\n* Boosted stakes in: PYPL, FISV, BABA, JPM, FLT, NSC, LITE, DKS, QCOM, LHX\n* Cut stakes in: BSX, LOW, DG, FIS, ABBV, BAX, INTU, JD, BK, ETFC\n\nBAUPOST GROUP\n\n* Top new buys: HCA, VRNT, VTR, SSNC\n* Top exits: LNG, ET, XPO, SPR, CARS\n* Boosted stakes in: LBTYK, TBIO, QRVO, ATRA, HDS\n* Cut stakes in: FB, GOOG, PCG, UNVR, ABC, HPQ, CLNY, VIST, AKBA\n\nBERKSHIRE HATHAWAY\n\n* Top new buys: GOLD\n* Top exits: DAL, LUV, UAL, AAL, QSR, GS, OXY\n* Boosted stakes in: STOR, KR, SU\n* Cut stakes in: WFC, JPM, SIRI, PNC, MTB, BK, MA, V, CHTR, USB\n\nBRIDGEWATER ASSOCIATES\n\n* Top new buys: UPS, ZLAB, CSX, ECL, TT, RNG, PAYC, ROP, GWW, FICO\n* Top exits: TLT, HYG, EMB, RY, TD, TIP, CNI, BNS, TRP, BCE\n* Boosted stakes in: SPY, GLD, IVV, FXI, BABA, MCHI, IAU, JD, PDD, VEA\n* Cut stakes in: EWZ, LQD, INDA, EWY, EEM, IEMG, VWO, EWW, BAM, EWT\n\nCOATUE MANAGEMENT\n\n* Top new buys: BA, DOCU, INO, DXCM, WYNN, HWM, LYV, ALGN, TDG, DHT\n* Top exits: RNG, SNAP, BYND, LKNCY, GLUU, ISRG, CGC, STNE, MCD, VGK\n* Boosted stakes in: DIS, PYPL, ZM, SQ, CRWD, PTON, LRCX, SHOP, MU, PODD\n* Cut stakes in: MSFT, LBRDK, BABA, TWTR, JD, NKE, GPN, CREE, GH, NFLX\n\nCORSAIR CAPITAL MANAGEMENT\n\n* Top new buys: IWO, IWM, WMB, NATR, MFIN\n* Top exits: LAUR, RHP, ECPG, ATKR, NMRK, TROX, KRA, FSK, HHC, SATS\n* Boosted stakes in: VRT, WSC, GDDY, CC, BH, BBCP, METC, BRK/B\n* Cut stakes in: HGV, HMHC, FMC, NWSA, REPH, GOOG, CHDN, C, CUBI, PLYA\n\nCORVEX MANAGEMENT\n\n* Top new buys: TMUS, EXC, EVRG, CMCSA, JPM, IAA, TIF, LYV, PCG\n* Top exits: ZEN, CRM, FANG, UNP, VMC, MPC, UNH, ANTM, SPY\n* Boosted stakes in: MGM, GLD, BABA, CNP, NFLX, HUM, CNC, MSGS\n* Cut stakes in: ADBE, ATUS, ATVI, AMZN\n\nD1 CAPITAL PARTNERS\n\n* Top new buys: JPM, AVB, EXPE, TGT, DEI, AAP, ESS, CVNA, SMAR, PNC\n* Top exits: LIN, GWRE, TME, NKE, UNH, BAC, PDD, DHI, INMD\n* Boosted stakes in: BABA, USB, JD, LVS, MSFT, HPP, KRC, CCC, LYV, HLT\n* Cut stakes in: NFLX, FB, AMZN, DIS, RACE, ORLY, PPD, AZO, SBUX, GOOGL\n\nDUQUESNE FAMILY OFFICE\n\n* Top new buys: TMUS, JPM, XBI, SBUX, BKNG, SMAR, CCL, WFC, LYV, CB\n* Top exits: ABT, QCOM, NOW, ADBE, INDA, COUP, TWOU, EDU, SNE, TWLO\n* Boosted stakes in: MSFT, JD, FCX, FSLY, BABA, CRWD, RETA, PLAN, FLEX\n* Cut stakes in: NFLX, FB, AMZN, WDAY, ATVI, GOOGL, GE, IQV, FIS, DISH\n\nELLIOTT MANAGEMENT\n\n* Top new buys: WELL, FSCT\n* Top exits: LQD, RRTS, ESI, HYG, XOP, NEWR, CSOD, NTNX, CNHI, EGHT\n* Boosted stakes in: DELL, TWTR, RYAAY\n\nENGAGED CAPITAL\n\n* Top new buys: JACK, MGLN, SMPL, IWM\n* Top exits: APOG\n* Boosted stakes in: STKL, NCR\n* Cut stakes in: HAIN\n\nFIR TREE\n\n* Top new buys: SQ, LYV, PS, SNAP, VG, EIX, SABR, EXPE, J, PCPL\n* Top exits: FLT, FPAC, BKNG, SHLL, CCH, GOOG, APXT, OAC, DMS, EXPC\n* Boosted stakes in: CNC, CTXS\n* Cut stakes in: DIS, MSFT, TMUS, LAUR, ANTM, DELL, EXC, CMCSA, SLM, TRNE\n\nGREENLIGHT CAPITAL\n\n* Top new buys: GDX, AAWW, TECK, REZI, JACK, GLD, APG, TPX, SATS, WHR\n* Top exits: ATUS, ADNT, CNC, MO, PAYX, AXP, GS, DHR, BRK/B, DIS\n* Boosted stakes in: AER, CHNG, NBSE, GPOR\n* Cut stakes in: CNX, XELA, CC\n\nICAHN\n\n* Top exits: HPQ, HTZ, FCX\n* Boosted stakes in: IEP, LNG, TEN\n* Cut stakes in: CLDR\n\nIMPALA ASSET MANAGEMENT\n\n* Top new buys: LAD, DRI, NSC, HES, CMI, VAC, TOL, ADNT, DOOO, MU\n* Top exits: MSFT, PCAR, CSX, KBH, VMC, MA, AMZN, FDX, EXP\n* Boosted stakes in: HOG, RIO, AAWW, FUN, WYNN, UFI\n* Cut stakes in: TGT, QCOM, KSU, SBLK, TTWO, SIX, KNX, TCKRF, NVR, TECK\n\nJANA PARTNERS\n\n* Top exits: NEWR, JACK\n* Boosted stakes in: PRSP, SPY\n* Cut stakes in: AXTA, HDS, HI, BLMN, ELY, CAG\n\nLAKEWOOD CAPITAL MANAGEMENT\n\n* Top new buys: HDS, CRL, LBTYK, LBTYA, UE, CDK, NKLA, ABG, CROX, SHAK\n* Top exits: WUBA, AMZN, ICE, FNF, TWO, YY, RNR, TPR, WW, REAL\n* Boosted stakes in: FAF, BABA, ANTM, AXS, BIDU, BHC, HCA, SKX, C, ACGL\n* Cut stakes in: GOOGL, CI, FB, MA, DELL, GS, AGNC, APO, CMCSA, BC\n\nLANSDOWNE\n\n* Top new buys: C, VMC, LUV, ED, FCX, RYAAY, AES, COG, TMUS, BKNG\n* Top exits: DHT, NKLA, AGI, TT, IQ, BABA\n* Boosted stakes in: MU\n* Cut stakes in: UAL, DAL, FSLR, GE, ETN, ADI, REGI, LRCX, TSM, SMMT\n\nLONG POND\n\n* Top new buys: PEAK, LVS, DEI, EQR, SHO, WELL, SEAS, UDR, INVH, MAR\n* Top exits: H, DHI, VNO, PEB, PGRE, MGM, VAC, RRR, JLL, CUZ\n* Boosted stakes in: CPT, AVB, MAA, AIV, HLT, ESS, FR, KRC, JBGS\n* Cut stakes in: WH, HGV, RHP, HPP, SBRA\n\nMAGNETAR FINANCIAL\n\n* Top new buys: ADCT, NVS, PKI\n* Top exits: HPQ, TSG, DLR, DKNG, ET, EPD, KMI, LHCG, CRL\n* Boosted stakes in: GRUB, WLTW, LH, BDX, LCA, CPAA, SYNH, ABBV, CRSA, DGX\n* Cut stakes in: PFE, ADSW, TIF, UBER, NVST, BAX, WMB, PPD, MEET, FREE\n\nMAVERICK CAPITAL\n\n* Top new buys: AXP, LIVN, VFC, MKC, GE, BGS, THS, GIS, CRI, FL\n* Top exits: QSR, COMM, ALKS, H, BX, GME, WING, ARMK, ORCL, LB\n* Boosted stakes in: FB, AMZN, DLTR, MSFT, LRCX, APD, ATRA, NFLX, NKTR, UBER\n* Cut stakes in: FLT, BABA, DD, CCK, STNE, PRSP, TMUS, CNC, ADBE, KKR\n\nMELVIN CAPITAL MANAGEMENT\n\n* Top new buys: DOCU, TWLO, SE, GOOGL, AEO, LOW, NUAN, HLT, TPX, PINS\n* Top exits: TTWO, CPRT, EDU, DG, ADYEN, EFX, ADI, LKNCY, IQV, QSR\n* Boosted stakes in: FISV, AZO, BKNG, JD, PYPL, LB, AAP, MA, FICO, DPZ\n* Cut stakes in: FIS, FB, CSGP, LH, NFLX, DRI, VRSN, AMZN, EL, PLAN\n\nOAKTREE CAPITAL MANAGEMENT\n\n* Top new buys: PCG, GTH, API, SRNE\n* Top exits: CEO, SRLP, WMB, BRFS, ASRT, ORCC, PVAC, MDRIQ\n* Boosted stakes in: TMHC, AU, TSM, CX, ITUB, MELI, BIDU, AFYA, IBN, AZUL\n* Cut stakes in: BABA, BCEI, CZR, CCS, SMCI\n\nOMEGA ADVISORS\n\n* Top new buys: DNRCQ\n* Top exits: GOOGL, SSSS, TWO, GPMT\n* Boosted stakes in: COOP, JPM, FOE, GTN, MGY, SNR, SRGA, AMCX\n* Cut stakes in: VICI, GCI, FCRD, NBR, ASPU, OCN, EFC, MVC, PE, ABR\n\nNEVER MISS THE NEWS THAT MATTERS MOST\n\nZEROHEDGE DIRECTLY TO YOUR INBOX\n\n*Receive a daily recap featuring a curated list of must-read stories.*\n\nPERSHING SQUARE\n\n* Top exits: BRK/B, BX, PK\n* Boosted stakes in: QSR, LOW\n* Cut stakes in: HHC\n\nSOROBAN CAPITAL\n\n* Top new buys: RTX, CMCSA, HLT, MAR, YUM\n* Top exits: LHX, QSR, NSC\n* Boosted stakes in: BABA, SNE\n* Cut stakes in: NOC, UNP, CSX, ATUS, AMZN, MSFT\n\nSOROS FUND MANAGEMENT\n\n* Top new buys: IGSB, SLQT, HAIN, PCG, DKNG, DRI, SPSB, BAC, MS, C\n* Top exits: XLU, WMGI, UNH, LNT, SHW, ALL, CBOE, LEN, DIS, CVE\n* Boosted stakes in: LQD, TMUS, NLOK, VICI, TDG, ARMK, BK, GS, ETFC, FOCS\n* Cut stakes in: PTON, TIF, TCO, ORCC, VST, KKR, CLVS, AVTR, ATVI, DHI\n\nSTARBOARD\n\n* Top new buys: IWM, IWR\n* Top exits: REZI\n* Boosted stakes in: MD, ACIW\n* Cut stakes in: EBAY, IWN, CERN, NLOK, CVLT, BOX, MMSI, GDOT\n\nTEMASEK HOLDINGS\n\n* Top new buys: BLK, PDD, SBUX\n* Top exits: BMRN, UNVR, RDS/B, PAGS, STNE, TOUR, FSLY, WORK\n* Boosted stakes in: BGNE, HDB, IBN, CBPO, VMW\n* Cut stakes in: BABA, FIS, VIRT, NIO, DDOG, VNET, INFO\n\nTIGER GLOBAL\n\n* Top new buys: ZI, API, DADA\n* Top exits: IQ, LVGO, BILL, STG, JCPNQ\n* Boosted stakes in: JD, AMZN, MSFT, CRWD, SPOT, PDD, DDOG, CRM, WDAY, ZM\n* Cut stakes in: ATH, SVMK, RDFN, MA, STNE, PYPL\n\nTUDOR INVESTMENT\n\n* Top new buys: ADSW, PCG, TMUS, TME, LHX, ATHM, BXMT, NFLX, ESS, EQR\n* Top exits: TIP, DEI, ABBV, FHN, KRC, GLPI, COP, PEG, LAD, MS\n* Boosted stakes in: AMTD, ETFC, GLIBA, SOXX, X, O, AAPL, UBER, CRWD, TCO\n* Cut stakes in: SPY, JAZZ, CERN, TEAM, HPQ, MCD, EA, LRCX, CUZ, PSB\n\nVIKING GLOBAL INVESTORS\n\n* Top new buys: TMO, HLT, APG, NUAN, MCO, PH, ADI, SHW, DRI, ZNTL\n* Top exits: ANTM, GOOGL, FB, NSC, ORLY, A, NOW, PGR, BMRN, AJG\n* Boosted stakes in: AXP, CMCSA, FIS, LVS, TMUS, PLAN, JPM, AON, CB, SE\n* Cut stakes in: NFLX, BSX, JD, LOW, UBER, CME, MELI, MU, CRM, CHNG\n\nWHALE ROCK CAPITAL MANAGEMENT\n\n* Top new buys: SQ, NXPI, MELI, CREE, VRM, ZI\n* Top exits: DIS, BABA, INTC, MU, MIME, ZS, ATVI, TSM, KLIC, PLAN\n* Boosted stakes in: FSLY, SHOP, DOCU, TSLA, COUP, AMZN, W, FB, OKTA, BILL\n* Cut stakes in: NOW, MSFT, NET, PTON, SMAR, FTNT, CRWD, AVLR, ZM, DDOG",
        "subreddit": "StockMarket",
        "title": "This Is What Hedge Funds Bought And Sold In The Second Quarter",
        "url": "https://www.reddit.com/r/StockMarket/comments/ib0pdh/this_is_what_hedge_funds_bought_and_sold_in_the/",
        "created": 1597641665.0
    },
    {
        "author": "manwearshelmet",
        "created_utc": 1597587935,
        "id": "iat7at",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Trading at a P/E of 9 with a dividend close to 4% with a payout ratio of just 32%. I imagine printer sales will be on the decline in the future but that’s only a third of the business the rest is computer hardware and in my opinion there products are pretty good. It reported a profitable quarter through the pandemic and its also got 4 billion of cash on hand which they say there going to commit to buying back stock. I bought in at 14 and it still looks fairly undervalued to me, I think it’s worth somewhere in the mid 20s.",
        "subreddit": "investing",
        "title": "What’s everyone’s opinion on HPQ?",
        "url": "https://www.reddit.com/r/investing/comments/iat7at/whats_everyones_opinion_on_hpq/",
        "created": 1597616735.0
    },
    {
        "author": "daviddjg0033",
        "created_utc": 1597285727,
        "id": "i8rn9c",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "People ask, why should my \"checking account\" just be FAANMG, $TQQQ (fun to own 100 shares to wheel) and $SPY and forget about \"actively managed funds?\"  \n\nThis is the year of the active investor ETF and I have no time to rebalance all these positions PLUS my FANG (not included at all in all but one has GOOG in these ETFs.)   I suggest buying $TSLA and realize it is down to 5% in the $ARKK (these numbers below change because active management!  And that is why they are better than the $QQQ vs. $SPY or $VOO vs. $VOOG!\n\nARKK Top 10 Holdings Tesla Inc 8.75% Invitae Corp. 6.97% Square, Inc. Class A 6.75% CRISPR Therapeutics AG5.88% Roku, Inc. Class A4.99% Proto Labs, Inc. 3.87% 2U, Inc. 3.76% Illumina, Inc. 3.55%\n\nARKQ Top 10 Holdings Tesla Inc 9.83% 2U, Inc. Xilinx, Inc. Materialise NV Sponsored ADR 5.40% Stratasys Ltd. Proto Labs, Inc. Alphabet Inc. Class C 3.77% Kratos Defense &amp; Security Solutions, Inc.\n\n**ARKW Top** **10** **Holdings** Tesla Inc 8.92% Square, Inc. Class A 7.47% Roku, Inc. Class A 6.11% 2U, Inc. Zillow Group, Inc. Class C 3.14 Xilinx, Inc. LendingTree, Inc. Facebook, Inc. Class A 3.01%\n\nAgain, ARK has sold $TSLA to rebalance their actively managed fund because it is not just indexed equal weight ($QQQE and $QQEW equal weighted) vs large weighted heavy on FANG ($QQQ.)    \n\nARK is to be held in ADDITION to FAANMG.  \\[FB, Microsoft, Amazon, Netflix, Google\\] or just holding the $XLK (think $APPL about the same dividend) and $XLC (Netflix and Google exposure.)\n\nARKF Top 10 Holdings Square, Inc. Class A 12.72% MercadoLibre, Inc. Zillow Group, Inc. Class C 5.16% Apple Inc. Tencent Holdings Ltd. Unsponsored ADR 4.18% LendingTree, Inc. Pinterest, Inc. Class A 3.74% Adyen NV 3.72%\n\n**PRNT \\[This is an index fund but adding it in here\\] Top** **10** **Holdings** Renishaw plc 5.81% ExOne Co. Proto Labs, Inc. MGI Digital Graphic Technology 5.02% Straumann **Holding** AG 5.00% HP Inc. Stratasys Ltd. Materialise NV Sponsored ADR 4.58%\n\n**ARKG Top 10 Holdings Invitae Corp**. CRISPR Therapeutics AG 11.25% Arcturus Therapeutics Holdings, Inc. Illumina, Inc. Compugen Ltd. Twist Bioscience Corp. Iovance Biotherapeutics Inc 3.57% CareDx, Inc.\n\nNOTE:  $ARKG shares NOTHING but Illumina with the $IBB, and the $XBI has no Moderna, so buy all three!  Also, I would be buying shares of $DHR at $200, $TMO at $400, and Regeneron at $595 as they seem to not be loved by these ETFs.\n\n**IBB Top** **10** **Holdings** Gilead Sciences, Inc. 6.92% Regeneron Pharmaceuticals, Inc. 6.51% Illumina, Inc. 6.10% Biogen Inc. 3.54% Moderna, Inc. 3.05% Seattle Genetics, Inc. 2.98% Alexion Pharmaceuticals, Inc. 2.44% BioMarin Pharmaceutical Inc. 2.30%\n\n**XBI Top** **10** **Holdings** Novavax, Inc. 3.63% OPKO Health, Inc. 2.20% Emergent BioSolutions Inc. 1.84% Sorrento Therapeutics, Inc. 1.77% Invitae Corp. 1.71% Inovio Pharmaceuticals, Inc. 1.51% Amicus Therapeutics, Inc. 1.37% SAGE Therapeutics, Inc. 1.36%\n\nI prefer to have 100 shares of $ARKG and I cannot tell if the $IBB is breaking out or breaking down.\n\nSolar:  the myth is that $ARKK has solar in it.  I suggest both $ICLN at $12.50 and $TAN at $45.\n\nICLN Top 10 Holdings Sunrun Inc. 6.90% SolarEdge Technologies, Inc. 6.80% Plug Power Inc. 6.04% Xinyi Solar Holdings Ltd. 5.98% Enphase Energy, Inc. 5.96% First Solar, Inc. 5.05% Siemens Gamesa Renewable Energy, S.A.4.76% Vestas Wind Systems A/S4.51% Search Results\n\nTAN Top 10 Holdings SolarEdge Technologies, Inc. Sunrun Inc. First Solar, Inc. Enphase Energy, Inc. Xinyi Solar Holdings Ltd. Vivint Solar Inc 5.48% Daqo New Energy Corp. Sponsored ADR 5.02% Solaria Energia y Medio Ambiente, S.A. 4.22%\n\nTL;DR ONLY $TAN and $ICLN overlap because both are SOLAR. ARK are the best actively managed funds ever. You are getting zero exposure to the companies I listed if you do not add Solar. Also note $ARKK sold $TSLA so buy the stonk when it dips down to $1350 again. Please buy $PRNT and $ARKG as well, put them in a drawer, and hold them for 3-5 years.",
        "subreddit": "smallstreetbets",
        "title": "$ARKK massive inflows and divesting with $ARK ETFs (or buying the shares they hold)",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/i8rn9c/arkk_massive_inflows_and_divesting_with_ark_etfs/",
        "created": 1597314527.0
    },
    {
        "author": "Obariste",
        "created_utc": 1596653808,
        "id": "i4bdas",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Presently the stock is trading under $10 and seems to have never recovered after the coronvirus hit back in March off it's 52-week high of $17.59 \n\nI admittedly don't know a lot about their situation in recent years other then that recent earnings reported a loss and I'm curious if anyone knows the story here and why this stock is performing poorly when many other companies have either nearly recovered or even reached new highs. Not knowing a lot about the company I'd assume they'd be doing well in the lock down environment but that is clearly not the case.",
        "subreddit": "investing",
        "title": "Whats going on with Hewlett-Packard; HPE?",
        "url": "https://www.reddit.com/r/investing/comments/i4bdas/whats_going_on_with_hewlettpackard_hpe/",
        "created": 1596682608.0
    },
    {
        "author": "BTCfacePunch",
        "created_utc": 1597269181,
        "id": "i8n4d1",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "options",
        "title": "Straddled me some HPQ",
        "url": "https://www.reddit.com/r/options/comments/i8n4d1/straddled_me_some_hpq/",
        "created": 1597297981.0
    },
    {
        "author": "manwearshelmet",
        "created_utc": 1597587303,
        "id": "iat11h",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "What everyone’s opinion on HPQ?",
        "url": "https://www.reddit.com/r/investing/comments/iat11h/what_everyones_opinion_on_hpq/",
        "created": 1597616103.0
    },
    {
        "author": "manwearshelmet",
        "created_utc": 1597587524,
        "id": "iat35w",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "What’s everyone’s opinion on HPQ?",
        "url": "https://www.reddit.com/r/investing/comments/iat35w/whats_everyones_opinion_on_hpq/",
        "created": 1597616324.0
    },
    {
        "author": "manwearshelmet",
        "created_utc": 1597588933,
        "id": "iathgw",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "\nTrading at a P/E of 9 with a dividend close to 4% with a payout ratio of just 32%. I imagine printer sales will be on the decline in the future but that’s only a third of the business. It reported a profitable quarter through the pandemic and its also got 4 billion of cash on hand which they say there going to commit to buying back stock. I bought in at 14 and it still looks fairly undervalued to me I think it’s worth somewhere in the mid 20s.",
        "subreddit": "StockMarket",
        "title": "Opinions on HPQ?",
        "url": "https://www.reddit.com/r/StockMarket/comments/iathgw/opinions_on_hpq/",
        "created": 1597617733.0
    }
]