[
    {
        "author": "AutoModerator",
        "created_utc": 1593590848,
        "id": "hj63kf",
        "num_comments": 182,
        "num_crossposts": 0,
        "selftext": "These daily discussions run from Monday to Friday including during our themed posts.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?sort=new&amp;q=Rate+My+Portfolio+-+r%2FStocks+Quarterly+Thread&amp;t=all&amp;restrict_sr=on).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion Wednesday - Jul 01, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/hj63kf/rstocks_daily_discussion_wednesday_jul_01_2020/",
        "created": 1593619648.0
    },
    {
        "author": "Gode14",
        "created_utc": 1593622494,
        "id": "hje49z",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "I am a new trader, considering purchasing a deep ITM call (16 oct 40c @ 1400) on AMD to sell poor-man's covered calls against, weekly, until August. These are the ways the situation can play out as I understand them.\n\n* The stock rises gently or stays the same: I sell calls and make premium. My long call stays the same or declines slowly.\n* The stock rises rapidly: My short call is in the money. I have two choices.\n\n&gt;\tBuy to close and suffer loss, but the rising value of my long call will offset that a bit. Continue selling calls.  \n&gt;  \n&gt;\tIf I don't want to suffer that loss, I can keep the position and risk assignment. In the case of assignment, my broker will exercise my long call. I keep the premium from my short call but lose all the extrinsic value of my long call (which would have risen due to the sharp rise in underlying price). I exit the strategy.\n\n* The stock falls: I sell calls and make premium, but not enough to offset the declining value of my long call. At the start I set a threshold on how much I'm willing to lose (factoring in premium gained from shorting calls) and exit the position if that limit is passed, or exit if I don't have faith in the underlying.\n* The stock falls rapidly: Same as above but I lose more quickly.\n\nThe thing I am most unsure about is how the long call acts in this situation. Basically the point of this strategy is to sell risky enough calls to outpace theta decay on your long call? I'm making a lot of assumptions here because I lack experience, but this seems like a bad strategy with a lot of ways to go negative or barely make profit. Is that true?",
        "subreddit": "options",
        "title": "Selling calls against a long, deep ITM call (poor man's covered call) seems like a bad strategy - am I missing something?",
        "url": "https://www.reddit.com/r/options/comments/hje49z/selling_calls_against_a_long_deep_itm_call_poor/",
        "created": 1593651294.0
    },
    {
        "author": "HeavyG_93",
        "created_utc": 1593658951,
        "id": "hjp4kz",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "I’m 27 years old and managing a portfolio of 3 accounts worth roughly 30k total. My investment horizon is retirement by 55 at the latest. But my goal is to FIRE as soon as plausible, because I fucking hate being an employee. \n\n\n\nI have a Roth, and 2 brokerages. \n\nI have a RH account that I primarily utilize for investing in high priced growth stocks because of their great fractional shares options. Here I hold things like my Amazon, Spotify, Tesla, etc\n\nMy second Brokerage is with TD and it’s where I hold my Microsoft and Costco. 50/50 split between the two basically. I have no problem holding large positions in either company as I think they’re about as safe as it gets when it comes to equities. \n\nWhat I’m really struggling with is my Roth IRA strategy. Currently I’m thinking about using the Tax advantaged status to grow a passive income portfolio focused around dividend stocks with growth upside, DRIP’ing until I’m 59.5 years old. Here is where I hold my JNJ, MCD, WM, DIS, RTX, UNP, O, NXRT etc. \n\n\n\n\nI’m torn between chasing growth in my Roth too. Shopify salesforce twilio and AMD etc in a Tax advantaged account where I could freely take profits with no taxable events sounds nice too. \n\n\nWhat do y’all think, what would you guys do?",
        "subreddit": "investing",
        "title": "Struggling to decide between investment strategies for my Portfolio of Investment accounts",
        "url": "https://www.reddit.com/r/investing/comments/hjp4kz/struggling_to_decide_between_investment/",
        "created": 1593687751.0
    },
    {
        "author": "meatslinger27",
        "created_utc": 1593617105,
        "id": "hjccvi",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": " \n\nHolding all of these long term 15+ years with focus mostly on growth. Looking for advice on which of these holdings to sink about $5k into. Leaning AMZN but let's say I just buy one more share what do you recommend I put the other $2400 or so into and why?\n\nAAPL - 4\n\nAMD - 22\n\nBAC - 10\n\nBEP - 24\n\nBRKB - 4\n\nMTCH - 5\n\nNKLA - 2\n\nPINS - 37\n\nSPOT - 5\n\nTTWO - 8\n\nABT - 6\n\nGOOGL - 3\n\nAMZN - 6\n\nCOST - 8\n\nDFS - 3\n\nV - 1\n\nWMT - 4\n\nDIS - 34",
        "subreddit": "investing",
        "title": "Need advice",
        "url": "https://www.reddit.com/r/investing/comments/hjccvi/need_advice/",
        "created": 1593645905.0
    },
    {
        "author": "notbrokemexican",
        "created_utc": 1593672159,
        "id": "hjs0s5",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "# Note: for a better reading experience, please use the link to view a Markdown version of this file with images. The text version is below. It also includes research into KSU &amp; Cloudflare (also in my profile)\n\n[https://github.com/Sheilf/Investment-Research](https://github.com/Sheilf/Investment-Research)\n\n&amp;#x200B;\n\n# # Disclaimer\n\nI am very familiar with The Effecient Market Hypothesis. I use it for my retirement investments.\n\nI am using a mixture of influences from Renaissance Technologies &amp; John Neumann's Game Theory.\n\n&amp;#x200B;\n\nThis is **MY** strategy as my investment goals and motivations are most likely far different than yours. I use a mixture of options when I have really high confidence in my economic model (as evidence by holding through dips).\n\n&amp;#x200B;\n\nI started investing in February and aggressively purchased stocks in Facebook, Paypal, and Cloudflare.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86323590-f333eb80-bbf1-11ea-977b-f3df91980417.png](https://user-images.githubusercontent.com/37036296/86323590-f333eb80-bbf1-11ea-977b-f3df91980417.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # The Case For Mexican-American Investments\n\nI'm building a portfolio that revolves around developing the post-covid economic restructuring. The overarching theme behind these picks is **American Innovation &amp; Mexican Development.**\n\nI'm a 26 year old fintech engineer in the US and an avocado farmer in Mexico and I hold a strong conviction that investing in Mexican development will reward me well in the decades to come.\n\n**In a nutshell, the USMCA is a 1 trillion dollar trade restructuring and my strategy favors the Texas-Nuevo Leon economy and overall Mexican-American trade.**\n\n&amp;#x200B;\n\nHere is Monterrey, Nuevo Leon\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86219352-ec946e00-bb36-11ea-9fc3-b17c9e5b0597.png](https://user-images.githubusercontent.com/37036296/86219352-ec946e00-bb36-11ea-9fc3-b17c9e5b0597.png))\n\nI'm from a rural village south of Jalisco which produces far more agricultural goods like avocados alongside Michoacan.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86219771-7e9c7680-bb37-11ea-98b2-7e8c2833d99a.png](https://user-images.githubusercontent.com/37036296/86219771-7e9c7680-bb37-11ea-98b2-7e8c2833d99a.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nI am very aware of the problems that Mexico faces but I also view Mexico as a sleeping giant that the US utilizes for capital efficiency in global trade. Mexico is part of a puzzle that fits in a large scope that involves other bulwark nations like Germany, Japan, Brazil, and India.\n\n&amp;#x200B;\n\n!\\[Bulwark Trading Nations\\]([https://user-images.githubusercontent.com/37036296/86080247-51709b00-ba47-11ea-8d38-54da06916f57.png](https://user-images.githubusercontent.com/37036296/86080247-51709b00-ba47-11ea-8d38-54da06916f57.png))\n\n&amp;#x200B;\n\n!\\[The North American Trade Block\\]([https://preview.redd.it/c4ej9hcrki751.png?width=638&amp;format=png&amp;auto=webp&amp;s=0062950618749d315101fb97d09237db961e2d40](https://preview.redd.it/c4ej9hcrki751.png?width=638&amp;format=png&amp;auto=webp&amp;s=0062950618749d315101fb97d09237db961e2d40))\n\n&amp;#x200B;\n\nAt the same time, Mexico is a nation in crisis. The economic damage narcotrafficking has delivered has resulted in:\n\n\\- \\[An increasing black market integration into the global money supply, in the order of hundreds of billions of dollars, resulting in a growing vacuum of theft AKA the Drug War &amp; Economics of Peace\\]([https://en.wikipedia.org/wiki/Bank\\_Secrecy\\_Act#Sanctions](https://en.wikipedia.org/wiki/Bank_Secrecy_Act#Sanctions))\n\n\\- North American suppressed wage suppression\n\n\\- refugee style illegal immigration\n\n\\- NA workforce morale decrease\n\n\\- Mexican workforce morale decrease\n\n\\- A Mexican workforce and brain drain, as skilled and motivated laborers leave for opportunity and better pay who are loyal to both nations\n\n\\- Multiple events of civil unrest or civil disasters\n\n&amp;#x200B;\n\n\\- National cyncism against the current administration\n\n&amp;#x200B;\n\nI see this as a complex problem where most people's perspective is not complete or clouded by one of the reasons above. I hold admittedly extreme views toward this problem and I understand people's need to debate this. Half of my life is in Mexico and it's something has been omnipresent in my life. I have seen the military police the roads, I've seen fire fights, the robbery, the vigilante justice, and so on. My parents were robbed. My mother was threatened with rape. My dog was almost killed. It's something omnipresent.\n\n&amp;#x200B;\n\n\\- I believe that all drugs should be legalized and nations like Colombia are headed in the right direction.\n\n\\- I believe the path won't be clear but a solution must come in the following decades.\n\n\\- I  believe an important element to this solution is the integration of American technology &amp; innovation that will increase the industry standards of Mexico's workforce.\n\n\\- I believe that American integration will force increases in legal and regulatory body requirements like the compliance procedures required behind and American financial technology app like Square or Paypal. The PATRIOT act is omnipresent in trade, regardless of your opinion.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nThere are other major factors at play here.\n\n\\- Advanced education in Mexico is accelerating with International partnerships.\n\n\\- The USMCA is a 1 trillion dollar trade restructuring.\n\n\\- Mexico is rapidly developing its English speaking workforce\n\n\\- Mexico is positioned to be deeply invested and coupled to American economics.\n\n\\- Trump and AMLO are cooperative (Economics of Peace).\n\n&amp;#x200B;\n\nIn the end, I don't believe that the economics of the black market and drug trade will succeed in the continued suppression of the Mexican economy. It is certainly in a golden era of sorts, and Mexico reflects as a nation in decline.\n\n&amp;#x200B;\n\n# # The Economic Framework\n\nI am selecting industries that:\n\n&amp;#x200B;\n\n\\- Empower the US and have a rippling effect on Mexico\n\n\\- Will fundamentally continue to build and grow the future global supply\n\n\\- Are friendly to primarily German/Euro and Japanese/Asian trade.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # My Portfolio Structure \n\nThere are two systems at play at the same time.\n\n&amp;#x200B;\n\nThe 12 Primary Asset Collection - these are stocks I regularly invest in.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86082755-62bca600-ba4d-11ea-8857-95e902f8d0ce.png](https://user-images.githubusercontent.com/37036296/86082755-62bca600-ba4d-11ea-8857-95e902f8d0ce.png))\n\n&amp;#x200B;\n\nThe 12 Competitor Arenas (Cloud Infrastructure Group) - these are stocks that are competing for Primary Asset Allocation each quarter and receive less allocation.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86082923-c3e47980-ba4d-11ea-9543-b31eb000962d.png](https://user-images.githubusercontent.com/37036296/86082923-c3e47980-ba4d-11ea-9543-b31eb000962d.png))\n\n&amp;#x200B;\n\n\\- I own 12 primary companies. These are the companies that I believe satisfy a certain economic condition with respects to their industry group.\n\n**- These stocks are always in competition with other high quality competitors in the realms I determine.**\n\n**- They are also industries that I want to see grow (which is why I invest in them).**\n\n**-  I'm not always going for min-max profit.**\n\n&amp;#x200B;\n\nExample of Competition\n\n&amp;#x200B;\n\n**Augmented Reality Group**\n\n*Economic Condition*: The Augmented Reality Group are companies whos core products are AR-enhanced and have sufficient power for cultural impacts.\n\n&amp;#x200B;\n\nIn this case, Facebook would be my primary asset of this group. (discussed in selection breakdown)\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86082479-b67abf80-ba4c-11ea-815f-b2a84494c3fe.png](https://user-images.githubusercontent.com/37036296/86082479-b67abf80-ba4c-11ea-815f-b2a84494c3fe.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86082507-cd211680-ba4c-11ea-89d1-29bbedb75995.png](https://user-images.githubusercontent.com/37036296/86082507-cd211680-ba4c-11ea-89d1-29bbedb75995.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nI generally try to exercise these rules and concepts in my framework\n\n\\- Applications of common sense\n\n\\- Applications of game theory\n\n\\- Strongly positive relationships or increasing economic need\n\n\\- Modesty in asset allocation over aggression\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # Primary Group Breakdown\n\n&amp;#x200B;\n\nMy Preallocated Selection vs \\[SPY, NASDAQ, VOO\\]\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86091181-4bd37f00-ba60-11ea-9abe-fdbf8c48933e.png](https://user-images.githubusercontent.com/37036296/86091181-4bd37f00-ba60-11ea-9abe-fdbf8c48933e.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86091330-91904780-ba60-11ea-8660-2e2d0ea32dc0.png](https://user-images.githubusercontent.com/37036296/86091330-91904780-ba60-11ea-8660-2e2d0ea32dc0.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86091365-a66cdb00-ba60-11ea-9a5f-60e5cb06b0be.png](https://user-images.githubusercontent.com/37036296/86091365-a66cdb00-ba60-11ea-9a5f-60e5cb06b0be.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86091414-bb496e80-ba60-11ea-8822-c8a65bba83c6.png](https://user-images.githubusercontent.com/37036296/86091414-bb496e80-ba60-11ea-8822-c8a65bba83c6.png))\n\n&amp;#x200B;\n\nAs you can image, if I allocate too many resources to competitors, my investments become more inline with NASDAQ growth.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86091694-2eeb7b80-ba61-11ea-9afb-c8abd3c2459f.png](https://user-images.githubusercontent.com/37036296/86091694-2eeb7b80-ba61-11ea-9afb-c8abd3c2459f.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nPrimary Assets at a glance\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86085632-6dc70480-ba54-11ea-9d3c-a665fba9ac50.png](https://user-images.githubusercontent.com/37036296/86085632-6dc70480-ba54-11ea-9d3c-a665fba9ac50.png))\n\n&amp;#x200B;\n\n\\- Capitalist Monkey Casino Group\n\n\\- These stocks are my bucket of sinful allocations when my monkey brain loses control and takes over or when America does some crazy shit.\n\n&amp;#x200B;\n\n\\- Augmented Reality\n\n\\- The Augmented Reality Group are companies whos core products are AR-advantaged and sufficient power for cultural impacts.\n\n&amp;#x200B;\n\n\\- Financial Access\n\n\\- The Financial Access Group is concerned with the lowering barriers to banking &amp; financial utilization.\n\n&amp;#x200B;\n\n\\- Cloud Infrastructure\n\n\\-  The Cloud Infrastructure Group focuses on stabilizing and advancing network speeds &amp; security in cloud systems.\n\n&amp;#x200B;\n\n\\- Power Systems\n\n\\- The Power Systems Group is concerned with the development of alternate energy systems to power the supply chain.\n\n&amp;#x200B;\n\n\\- Consumer Supply\n\n\\- The Consumer Supply Group focuses on the happiness of customer at transaction time and the ability to scale that customer satisfaction\n\n&amp;#x200B;\n\n\\- Cloud Services\n\n\\- The Cloud Services Group are inelastic products that will either be consumed by larger industry or will continue to pioneer new demands.\n\n\\- Machine Learning\n\n\\- The ML Group are companies whos core products are significantly advantaged by AI/ML.\n\n&amp;#x200B;\n\n\\- Semiconductors\n\n\\- The Semiconductors Group focuses on the lowering barriers to advanced technology and computing.\n\n&amp;#x200B;\n\n\\- Industry\n\n\\- The Industry Group works on material development  and business exchanges of US and Mexico.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\- Industrial Robotics\n\n\\- The Industrial Robotics Group focuses on the increasing automation of labor.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\- Network Infrastructure\n\n\\- The Network Infrastructure Group focuses on the expansion of telecom services in the Americas.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\- ETF Diversification &amp; Asset Amplification\n\n\\- These are selections of industries I would like to generally participate in or bolster current investments.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nTotal assets at a glance (ETFs Excluded)\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86090992-fb5c2180-ba5f-11ea-988f-f21f771aaaf7.png](https://user-images.githubusercontent.com/37036296/86090992-fb5c2180-ba5f-11ea-988f-f21f771aaaf7.png))\n\n&amp;#x200B;\n\n# # Monkey Capitalist Casino\n\n\\- SPCE\n\n\\- DKNG\n\n\\- IPO ETF\n\n\\- Dennys\n\n\\- Bitcoin/BAT\n\n&amp;#x200B;\n\nThese stocks are my bucket of sinful allocations when my monkey brain loses control and takes over or when America does some crazy shit. I dont hold any of these right now.\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86098091-7e827500-ba6a-11ea-80be-7e73e6557326.png](https://user-images.githubusercontent.com/37036296/86098091-7e827500-ba6a-11ea-80be-7e73e6557326.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86098154-92c67200-ba6a-11ea-9c4c-17aef3908461.png](https://user-images.githubusercontent.com/37036296/86098154-92c67200-ba6a-11ea-9c4c-17aef3908461.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86098173-99ed8000-ba6a-11ea-9ea8-f691393683c1.png](https://user-images.githubusercontent.com/37036296/86098173-99ed8000-ba6a-11ea-9ea8-f691393683c1.png))\n\n&amp;#x200B;\n\n# # Augmented Reality Group\n\n**- FACEBOOK**\n\n\\- Adobe\n\n\\- Apple\n\n\\- Nintendo\n\n\\- Disney\n\n&amp;#x200B;\n\n*The Augmented Reality Group are companies with a vested interest in AR products and sufficient power for cultural impacts.*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86095490-d5864b00-ba66-11ea-8d32-bed356fb47ba.png](https://user-images.githubusercontent.com/37036296/86095490-d5864b00-ba66-11ea-8d32-bed356fb47ba.png))\n\n&amp;#x200B;\n\n\\- Facebook's outreach is unmatched. It currently takes priority in this group and it will maintain its position if Facebook can deliver and execute on e-commerce and small business support in the US, India, and Latin America through WhatsApp, FB, and Instragram Camera Commerce features. Their integration with Walmart, Rio, and Shopify was wise and will be my test to see if it can really master its scale. FB has also done incredible work in networking speeds on their product and has an excellent web kit with React, React Native, GraphQL, and more.\n\n&amp;#x200B;\n\n\\- Apple and Adobe have a tight and powerful relationship and are deeply integrated into various markets ranging from gaming studio development, marketing data, computer vision, and chip manufacturing.\n\n&amp;#x200B;\n\n\\- Disney and Nintendo are closer to defensive stocks as they are deeply integrated with unmatched branding in childhood &amp; families.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86090855-b6d08600-ba5f-11ea-87bf-a2c42b3e353b.png](https://user-images.githubusercontent.com/37036296/86090855-b6d08600-ba5f-11ea-87bf-a2c42b3e353b.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86090889-c8b22900-ba5f-11ea-8d20-4b3195076a00.png](https://user-images.githubusercontent.com/37036296/86090889-c8b22900-ba5f-11ea-8d20-4b3195076a00.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # Machine Learning Group\n\n**- MICROSOFT**\n\n\\- Google\n\n\\- Tesla\n\n*The ML Group are companies who's core products are significantly advantaged by AI/ML.*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86094462-69571780-ba65-11ea-91a8-79e523085204.png](https://user-images.githubusercontent.com/37036296/86094462-69571780-ba65-11ea-91a8-79e523085204.png))\n\n&amp;#x200B;\n\n\\- I'm excited to see Microsoft's software automation advancements across various tools ranging from Excel, internal Windows hardware management, to developer workflow solutions. I believe this move will separate them from the rest when it comes to long-form competitions of cloud computing and network optimizing.\n\n&amp;#x200B;\n\n\\- Google is a close second as they are already distributing ML solutions through Google Cloud Platform &amp; has extensive reach across various industries with LIDAR simulations, adtech, and an unholy amount of data. I fear Google's reach into too many markets, similar to Amazon.\n\n&amp;#x200B;\n\n\\- Tesla is an interesting use case as they do not rely on software simulations as much as Waymo or other ambitious mobility startups. I believe this will lead them to discover some really robust ML applications in their time investigate power management and secure driving solutions.\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86094391-4c224900-ba65-11ea-90f7-f2b7a5e021fd.png](https://user-images.githubusercontent.com/37036296/86094391-4c224900-ba65-11ea-90f7-f2b7a5e021fd.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86094423-593f3800-ba65-11ea-8f28-99dd6eae97dc.png](https://user-images.githubusercontent.com/37036296/86094423-593f3800-ba65-11ea-8f28-99dd6eae97dc.png))\n\n&amp;#x200B;\n\n# # Financial Access Group\n\n\\- **PAYPAL**\n\n\\- Square\n\n\\- Visa\n\n&amp;#x200B;\n\n*The Financial Access Group is concerned with the lowering barriers to banking &amp; transaction infrastructure.*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86095710-2f871080-ba67-11ea-8965-f3e2b99c821e.png](https://user-images.githubusercontent.com/37036296/86095710-2f871080-ba67-11ea-8965-f3e2b99c821e.png))\n\n&amp;#x200B;\n\n\\- Paypal has a really interesting history as a pioneer in the payment processing business. I'm really excited to see what they can do with their Honey acquisition in relation to e-commerce and Amazon commerce. Paypal also has an enormous catalog of services ranging from small business support to remittance sending.\n\n&amp;#x200B;\n\n\\- I believe it's a mistake to underestimate Square with respects to the younger generation who is enters the global market primarily through technology these days. Cash App is wonderfully designed, educational, chartered as a bank, and has a clear path forward as a financial services integrations. It can prove to be a valuable competitor to Paypal.\n\n&amp;#x200B;\n\n\\- Visa is the fingerprint into the banking system. They were wise to respect blockchain technology early and is an extremely trusted brand which has infinite value in the financial world. Visa grows with each transaction.\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86095751-3ca3ff80-ba67-11ea-9e2d-1d111f081948.png](https://user-images.githubusercontent.com/37036296/86095751-3ca3ff80-ba67-11ea-9e2d-1d111f081948.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86095793-4a598500-ba67-11ea-9826-6e9832fae0a3.png](https://user-images.githubusercontent.com/37036296/86095793-4a598500-ba67-11ea-9826-6e9832fae0a3.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # Semiconductors Group\n\n\\- **TEXAS INSTRUMENTS**\n\n\\- AMD\n\n\\- Nvidia\n\n&amp;#x200B;\n\n*The Semiconductors Group focuses on the lowering barriers to advanced technology and computing.*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86096614-5a259900-ba68-11ea-91d9-ce4772d51dda.png](https://user-images.githubusercontent.com/37036296/86096614-5a259900-ba68-11ea-91d9-ce4772d51dda.png))\n\n&amp;#x200B;\n\n\\- I have selected TI to lead for now as TI is found in just about anything ranging from Tesla dashboards to NASA rockets. TI is also important with respects to the Texas-Nuevo Leon model that I have written about that prioritizes Texas and Mexican growth potential.\n\n&amp;#x200B;\n\n\\- Nvidia is obviously a pioneer and leader in AI, cloud computing, and much more like GPU distribution.\n\n&amp;#x200B;\n\n\\- AMD has destabilized my perspective and this may be their opportunity to stick their growth. They have done remarkable work in the cloud computing and energy/cost reduction space.\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86096791-9953ea00-ba68-11ea-8db0-cfabf5983cf8.png](https://user-images.githubusercontent.com/37036296/86096791-9953ea00-ba68-11ea-8db0-cfabf5983cf8.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86096754-8c36fb00-ba68-11ea-8cdd-0715fe057975.png](https://user-images.githubusercontent.com/37036296/86096754-8c36fb00-ba68-11ea-8cdd-0715fe057975.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # Cloud Infrastructure Group\n\n\\- **CLOUDFLARE**\n\n\\- Fastly\n\n\\- Z-Scaler\n\n\\- Akamai\n\n&amp;#x200B;\n\n*The Cloud Infrastructure Group focuses on stabilizing and advancing network speeds&amp; security in cloud systems.*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86096907-c3a5a780-ba68-11ea-9e2e-f53455bfc172.png](https://user-images.githubusercontent.com/37036296/86096907-c3a5a780-ba68-11ea-9e2e-f53455bfc172.png))\n\n&amp;#x200B;\n\n\\- Cloudflare is selected for its ability to bring down price and grow infrastructure from the inside out. It's a riskier approach. I'm really excited to see their future prospects growing video streaming infrastructure and their path of distributing privacy &amp; security. They take the beacon of American privacy ideals to emerging markets.\\[ I have more extensive research on Cloudflare, CDNs, and cloud computing here.\\]([https://www.reddit.com/r/wallstreetbets/comments/h7x4l6/cloudflare\\_net\\_dd\\_cloud\\_infrastructure\\_security/](https://www.reddit.com/r/wallstreetbets/comments/h7x4l6/cloudflare_net_dd_cloud_infrastructure_security/))\n\n&amp;#x200B;\n\n\\- Fastly is an excellent product that optimizes media delivery in the network. I believe Fastly is most likely to compete with the likes of Akamai in their respective CDN space.\n\n&amp;#x200B;\n\n\\- Z-Scaler turns toward more industrial clients, gathering partners in energy, supply chain, manufacturing, and more. I think this is an underrated aspect to current cloud computing discussions. The security of networks that protect expensive industrial machines will be critically important when production speeds are extremely rapid between competitors.\n\n&amp;#x200B;\n\n\\- Akamai of course is the giant of the CDN space. I believe AKamai will also continue to grow in a much healthier manner in comparison to stocks like Fastly over the long term.\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86096938-d15b2d00-ba68-11ea-8a8d-eba84d2008e8.png](https://user-images.githubusercontent.com/37036296/86096938-d15b2d00-ba68-11ea-8a8d-eba84d2008e8.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86096958-dd46ef00-ba68-11ea-8f20-831af8f0a4a2.png](https://user-images.githubusercontent.com/37036296/86096958-dd46ef00-ba68-11ea-8f20-831af8f0a4a2.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # Cloud Services Group\n\n\\- **DOCUSIGN**\n\n\\- Twitter\n\n\\- Chegg\n\n\\- Dropbox\n\n\\- Lyft\n\n\\- 1Life Medical\n\n\\- Upwork\n\n\\- Autodesk\n\n*The Cloud Services Group are inelastic distributed products.*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097036-f64fa000-ba68-11ea-9a8c-07f2e0b06e68.png](https://user-images.githubusercontent.com/37036296/86097036-f64fa000-ba68-11ea-9a8c-07f2e0b06e68.png))\n\n&amp;#x200B;\n\nThis is a large set of stocks, so it doesn't receive as much allocation, with the exception of DocuSign. I believe all of these companies are robust technologies that do a pretty good job at solving their immediately problem.\n\n&amp;#x200B;\n\n\\- DocuSign is the current speculation as it can acquire stickiness through its legal procurements. I believe legal procurements is a necessary industry that will be amplified by cross-border trade.\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097076-036c8f00-ba69-11ea-92c0-b8e7fcf70d73.png](https://user-images.githubusercontent.com/37036296/86097076-036c8f00-ba69-11ea-92c0-b8e7fcf70d73.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097128-141d0500-ba69-11ea-867a-f7d404b5e6f3.png](https://user-images.githubusercontent.com/37036296/86097128-141d0500-ba69-11ea-867a-f7d404b5e6f3.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # Network Infrastructure Group\n\n\\- **CROWN CASTLE INTERNATIONAL (REIT)**\n\n\\- T-Mobile\n\n\\- America Movil\n\n&amp;#x200B;\n\n*The Network Infrastructure Group focuses on the expansion of telecommunications across the US and Mexico.*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097290-462e6700-ba69-11ea-9159-b1e5106bd07a.png](https://user-images.githubusercontent.com/37036296/86097290-462e6700-ba69-11ea-9159-b1e5106bd07a.png))\n\n&amp;#x200B;\n\n\\- CCI is the largest telecom network in the US that is headquartered in the US. It funnels much of the transmission of many ISPs.\n\n&amp;#x200B;\n\n\\- I really love T-Mobile's tech friendly CEO and approach to accessibility and customer experience. I think this will deliver in spades when Mexican markets grow.\n\n&amp;#x200B;\n\n\\- America Movil is Mexico's telecom and Mexico's largest company by market cap.\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097322-52b2bf80-ba69-11ea-9b37-88fa0bf3cb9e.png](https://user-images.githubusercontent.com/37036296/86097322-52b2bf80-ba69-11ea-9b37-88fa0bf3cb9e.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097351-5e05eb00-ba69-11ea-9e64-03ab766e9e3a.png](https://user-images.githubusercontent.com/37036296/86097351-5e05eb00-ba69-11ea-9e64-03ab766e9e3a.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # Power Systems Group\n\n\\- **PANASONIC**\n\n\\- Vestas\n\n\\- Plug Power\n\n\\- Siemens\n\n&amp;#x200B;\n\n*The Power Systems Group focuses on the growth of alternative energy systems.*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097422-7bd35000-ba69-11ea-9082-687bec03cbe5.png](https://user-images.githubusercontent.com/37036296/86097422-7bd35000-ba69-11ea-9082-687bec03cbe5.png))\n\n&amp;#x200B;\n\n\\- Panasonic has ventures in multiple energy systems but has exciting potential on healthy partnerships with Tesla, Toyota, and other large automotive groups. These are also organizations that manufacture in Mexico.\n\n&amp;#x200B;\n\n\\- Vestas has pioneered sales of wind energy systems and may prove valuable during infrastructure and energy restructures.\n\n&amp;#x200B;\n\n\\- Plug Power is focused on hydrogen fuel which complements battery systems in technologies like forklifts or last-mile delivery trucks.\n\n&amp;#x200B;\n\n\\- Siemens is an provider from Germany that is well integrated in Mexican &amp; Texas-Monterrey development.\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097453-8857a880-ba69-11ea-8e1b-d7ec4eade982.png](https://user-images.githubusercontent.com/37036296/86097453-8857a880-ba69-11ea-8e1b-d7ec4eade982.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097475-93aad400-ba69-11ea-9087-4e6260a77b68.png](https://user-images.githubusercontent.com/37036296/86097475-93aad400-ba69-11ea-9087-4e6260a77b68.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # Industry Group\n\n\\- **KANSAS CITY SOUTHERN**\n\n\\- Berkshire.B\n\n\\- XLB Materials ETF\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n*The Industry Group works on material development and business exchanges of US and Mexico.*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097528-a7eed100-ba69-11ea-89ff-455192cfa52c.png](https://user-images.githubusercontent.com/37036296/86097528-a7eed100-ba69-11ea-89ff-455192cfa52c.png))\n\n&amp;#x200B;\n\n\\[I got into the strategic advantage behind Kansas City Southern Rail here.\\]([https://www.reddit.com/r/wallstreetbets/comments/hh1t4k/all\\_aboard\\_the\\_trump\\_train\\_kansas\\_city\\_southern/](https://www.reddit.com/r/wallstreetbets/comments/hh1t4k/all_aboard_the_trump_train_kansas_city_southern/)) It is an important Class-I railroad that connects through Mexico, Texas, and the American Midwest.\n\n&amp;#x200B;\n\n\\- Berkshire.B is a business selector that invests in other sectors like Financials and value assement.\n\n&amp;#x200B;\n\n\\- XLB is a group of industries that produce materials standards, chemicals, paint, and other low-level materials.\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097559-b50bc000-ba69-11ea-92e9-67cce9bfeeb9.png](https://user-images.githubusercontent.com/37036296/86097559-b50bc000-ba69-11ea-92e9-67cce9bfeeb9.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097610-c1901880-ba69-11ea-9a8b-2cf581ff8f13.png](https://user-images.githubusercontent.com/37036296/86097610-c1901880-ba69-11ea-9a8b-2cf581ff8f13.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # Industrial Robotics Group\n\n\\- **FANUC**\n\n\\- ABB\n\n\\- Rockwell Automation\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n*The Industrial Robotics group focuses on the increasing automation of labor.*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097654-d371bb80-ba69-11ea-93a6-08e88dc1c89f.png](https://user-images.githubusercontent.com/37036296/86097654-d371bb80-ba69-11ea-93a6-08e88dc1c89f.png))\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097684-dff61400-ba69-11ea-813d-4750b876bb07.png](https://user-images.githubusercontent.com/37036296/86097684-dff61400-ba69-11ea-813d-4750b876bb07.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097712-ebe1d600-ba69-11ea-80b1-84babc271968.png](https://user-images.githubusercontent.com/37036296/86097712-ebe1d600-ba69-11ea-80b1-84babc271968.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # Consumer Supply Group\n\n\\- **COSTCO**\n\n\\- Amazon\n\n\\- Shopify\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n*The Consumer Supply has a similar focuses on customer satisfaction during purchase time.*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097793-09af3b00-ba6a-11ea-87a1-0f734225a821.png](https://user-images.githubusercontent.com/37036296/86097793-09af3b00-ba6a-11ea-87a1-0f734225a821.png))\n\n&amp;#x200B;\n\n\\- I view Costco as the leader in customer satisfaction at purchase time. I believe their business model and product selection process can be replicated in places like Mexico and continue its success without much disruption.\n\n&amp;#x200B;\n\n\\- Shopify is and a leader in small business opportunities.  Their partnership with Facebook and Walmart was an extremely wise choice given their momentum, which is also massively popular in Mexico.\n\n&amp;#x200B;\n\n\\- Amazon is also a pioneer in customer satisfaction with 2-day delivery. I'm unsure how this will execute over a long period of time in a country like Mexico, where truck traversal is quite dangerous and ineffecient. They also compete with regional players like Mercado Libre.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097809-12077600-ba6a-11ea-83fe-fd597b559148.png](https://user-images.githubusercontent.com/37036296/86097809-12077600-ba6a-11ea-83fe-fd597b559148.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097834-1a5fb100-ba6a-11ea-8066-87c16ba590fd.png](https://user-images.githubusercontent.com/37036296/86097834-1a5fb100-ba6a-11ea-8066-87c16ba590fd.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # ETF Diversification &amp; Asset Amplification\n\n\\- **SPY**\n\n\\- EWW Mexico\n\n\\- FIVG 5g\n\n\\- IPO Startup\n\n\\- WCLD Cloud\n\n\\- ESPO Gaming\n\n\\- CIBR Cybersecurity\n\n\\- HACK Cybersecurity\n\n\\- TPAY Financials\n\n\\- ARKF Financial Technology\n\n\\- IPAY Financial Services\n\n\\- DFNL Banking Services\n\n\\- SOXX Semiconductors\n\n\\- IYT Railroad\n\n\\- POTX Cannabis\n\n\\- BOTZ Automation\n\n&amp;#x200B;\n\nThese are selections of industries I would like to generally participate in or bolster current investments.\n\nThe ETF &amp; Asset Amplification is a group of industries I would like to factor uncertainties for or better capture. I will not be able to determine Cannabis leaders in 2023, for example. A lot of these ETFs fall under \"I'm not sure if some unknown player will suddenly rise 3 years from now in this industry\".\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86098011-64489700-ba6a-11ea-846a-0816cd3755b8.png](https://user-images.githubusercontent.com/37036296/86098011-64489700-ba6a-11ea-846a-0816cd3755b8.png))",
        "subreddit": "investing",
        "title": "My Portfolio Restructure Part II - Mexican American Investment Decisions",
        "url": "https://www.reddit.com/r/investing/comments/hjs0s5/my_portfolio_restructure_part_ii_mexican_american/",
        "created": 1593700959.0
    },
    {
        "author": "jv_e",
        "created_utc": 1593623766,
        "id": "hjeimo",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "\r\n\r\nADVANCED MICRO DEVICES  - 10 at 52,61 USD  \r\nALIBABA GROUP HOLDING -  3 at 215,70 USD \r\nISHARES US AGG BND USD ACC - 26 at 5,85 USD \r\nJD.COM INC. - 6 at 60,18 USD \r\nVANGUARD S&amp;P500 - 21 at 51,84 EUR \n\nAny input is greatly appreciated!!",
        "subreddit": "stocks",
        "title": "Beginning investor and I would like some input on my current portfolio",
        "url": "https://www.reddit.com/r/stocks/comments/hjeimo/beginning_investor_and_i_would_like_some_input_on/",
        "created": 1593652566.0
    },
    {
        "author": "meatslinger27",
        "created_utc": 1593617404,
        "id": "hjcgge",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": " \n\nHolding all of these long term 15+ years with focus mostly on growth. Looking for advice on which of these holdings to sink about $5-10k into. Leaning AMZN mostly but let's say I just buy one or two more shares what do you recommend I put the balance into and why?\n\nAAPL - 4\n\nAMD - 22\n\nBAC - 10\n\nBEP - 24\n\nBRKB - 4\n\nMTCH - 5\n\nNKLA - 2\n\nPINS - 37\n\nSPOT - 5\n\nTTWO - 8\n\nABT - 6\n\nGOOGL - 3\n\nAMZN - 6\n\nCOST - 8\n\nDFS - 3\n\nV - 1\n\nWMT - 4\n\nDIS - 34",
        "subreddit": "investing_discussion",
        "title": "Need Advice on what to buy",
        "url": "https://www.reddit.com/r/investing_discussion/comments/hjcgge/need_advice_on_what_to_buy/",
        "created": 1593646204.0
    },
    {
        "author": "notbrokemexican",
        "created_utc": 1593672327,
        "id": "hjs24t",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "# Note: for a better reading experience, please use the link to view a Markdown version of this file with images. The text version is below. It also includes research into KSU &amp; Cloudflare (also in my profile)\n\n [https://github.com/Sheilf/Investment-Research](https://github.com/Sheilf/Investment-Research)\n\n&amp;#x200B;\n\n# # Disclaimer \n\nI am very familiar with The Effecient Market Hypothesis. I use it for my retirement investments.\n\nI am using a mixture of influences from Renaissance Technologies &amp; John Neumann's Game Theory.\n\n&amp;#x200B;\n\nThis is **MY** strategy as my investment goals and motivations are most likely far different than yours. I use a mixture of options when I have really high confidence in my economic model (as evidence by holding through dips).\n\n&amp;#x200B;\n\nI started investing in February and aggressively purchased stocks in Facebook, Paypal, and Cloudflare.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86323590-f333eb80-bbf1-11ea-977b-f3df91980417.png](https://user-images.githubusercontent.com/37036296/86323590-f333eb80-bbf1-11ea-977b-f3df91980417.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# The Case For Mexican-American Investments\n\nI'm building a portfolio that revolves around developing the post-covid economic restructuring. The overarching theme behind these picks is **American Innovation &amp; Mexican Development.** \n\nI'm a 26 year old fintech engineer in the US and an avocado farmer in Mexico and I hold a strong conviction that investing in Mexican development will reward me well in the decades to come.  \n\n**In a nutshell, the USMCA is a 1 trillion dollar trade restructuring and my strategy favors the Texas-Nuevo Leon economy and overall Mexican-American trade.**\n\n&amp;#x200B;\n\nHere is Monterrey, Nuevo Leon\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86219352-ec946e00-bb36-11ea-9fc3-b17c9e5b0597.png](https://user-images.githubusercontent.com/37036296/86219352-ec946e00-bb36-11ea-9fc3-b17c9e5b0597.png))\n\n \n\nI'm from a rural village south of Jalisco which produces far more agricultural goods like avocados alongside Michoacan.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86219771-7e9c7680-bb37-11ea-98b2-7e8c2833d99a.png](https://user-images.githubusercontent.com/37036296/86219771-7e9c7680-bb37-11ea-98b2-7e8c2833d99a.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nI am very aware of the problems that Mexico faces but I also view Mexico as a sleeping giant that the US utilizes for capital efficiency in global trade. Mexico is part of a puzzle that fits in a large scope that involves other bulwark nations like Germany, Japan, Brazil, and India.\n\n&amp;#x200B;\n\n!\\[Bulwark Trading Nations\\]([https://user-images.githubusercontent.com/37036296/86080247-51709b00-ba47-11ea-8d38-54da06916f57.png](https://user-images.githubusercontent.com/37036296/86080247-51709b00-ba47-11ea-8d38-54da06916f57.png))\n\n&amp;#x200B;\n\n!\\[The North American Trade Block\\]([https://preview.redd.it/c4ej9hcrki751.png?width=638&amp;format=png&amp;auto=webp&amp;s=0062950618749d315101fb97d09237db961e2d40](https://preview.redd.it/c4ej9hcrki751.png?width=638&amp;format=png&amp;auto=webp&amp;s=0062950618749d315101fb97d09237db961e2d40))\n\n&amp;#x200B;\n\nAt the same time, Mexico is a nation in crisis. The economic damage narcotrafficking has delivered has resulted in:\n\n\\- \\[An increasing black market integration into the global money supply, in the order of hundreds of billions of dollars, resulting in a growing vacuum of theft AKA the Drug War &amp; Economics of Peace\\]([https://en.wikipedia.org/wiki/Bank\\_Secrecy\\_Act#Sanctions](https://en.wikipedia.org/wiki/Bank_Secrecy_Act#Sanctions))\n\n\\- North American suppressed wage suppression\n\n\\- refugee style illegal immigration\n\n\\- NA workforce morale decrease\n\n\\- Mexican workforce morale decrease\n\n\\- A Mexican workforce and brain drain, as skilled and motivated laborers leave for opportunity and better pay who are loyal to both nations\n\n\\- Multiple events of civil unrest or civil disasters\n\n&amp;#x200B;\n\n\\- National cyncism against the current administration\n\n&amp;#x200B;\n\nI see this as a complex problem where most people's perspective is not complete or clouded by one of the reasons above. I hold admittedly extreme views toward this problem and I understand people's need to debate this. Half of my life is in Mexico and it's something has been omnipresent in my life. I have seen the military police the roads, I've seen fire fights, the robbery, the vigilante justice, and so on. My parents were robbed. My mother was threatened with rape. My dog was almost killed. It's something omnipresent.\n\n&amp;#x200B;\n\n\\- I believe that all drugs should be legalized and nations like Colombia are headed in the right direction.\n\n\\- I believe the path won't be clear but a solution must come in the following decades.\n\n\\- I  believe an important element to this solution is the integration of American technology &amp; innovation that will increase the industry standards of Mexico's workforce.\n\n\\- I believe that American integration will force increases in legal and regulatory body requirements like the compliance procedures required behind and American financial technology app like Square or Paypal. The PATRIOT act is omnipresent in trade, regardless of your opinion.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nThere are other major factors at play here.\n\n\\- Advanced education in Mexico is accelerating with International partnerships.\n\n\\- The USMCA is a 1 trillion dollar trade restructuring.\n\n\\- Mexico is rapidly developing its English speaking workforce\n\n\\- Mexico is positioned to be deeply invested and coupled to American economics.\n\n\\- Trump and AMLO are cooperative (Economics of Peace).\n\n&amp;#x200B;\n\nIn the end, I don't believe that the economics of the black market and drug trade will succeed in the continued suppression of the Mexican economy. It is certainly in a golden era of sorts, and Mexico reflects as a nation in decline.\n\n&amp;#x200B;\n\n\\# The Economic Framework\n\nI am selecting industries that:\n\n&amp;#x200B;\n\n\\- Empower the US and have a rippling effect on Mexico\n\n\\- Will fundamentally continue to build and grow the future global supply\n\n\\- Are friendly to primarily German/Euro and Japanese/Asian trade.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# My Portfolio Structure\n\nThere are two systems at play at the same time.\n\n&amp;#x200B;\n\nThe 12 Primary Asset Collection - these are stocks I regularly invest in.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86082755-62bca600-ba4d-11ea-8857-95e902f8d0ce.png](https://user-images.githubusercontent.com/37036296/86082755-62bca600-ba4d-11ea-8857-95e902f8d0ce.png))\n\n&amp;#x200B;\n\nThe 12 Competitor Arenas (Cloud Infrastructure Group) - these are stocks that are competing for Primary Asset Allocation each quarter and receive less allocation.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86082923-c3e47980-ba4d-11ea-9543-b31eb000962d.png](https://user-images.githubusercontent.com/37036296/86082923-c3e47980-ba4d-11ea-9543-b31eb000962d.png))\n\n&amp;#x200B;\n\n\\- I own 12 primary companies. These are the companies that I believe satisfy a certain economic condition with respects to their industry group.\n\n**- These stocks are always in competition with other high quality competitors in the realms I determine.**\n\n**- They are also industries that I want to see grow (which is why I invest in them).**\n\n**-  I'm not always going for min-max profit.**\n\n&amp;#x200B;\n\nExample of Competition\n\n&amp;#x200B;\n\n**Augmented Reality Group**\n\n*Economic Condition*: The Augmented Reality Group are companies whos core products are AR-enhanced and have sufficient power for cultural impacts.\n\n&amp;#x200B;\n\nIn this case, Facebook would be my primary asset of this group. (discussed in selection breakdown)\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86082479-b67abf80-ba4c-11ea-815f-b2a84494c3fe.png](https://user-images.githubusercontent.com/37036296/86082479-b67abf80-ba4c-11ea-815f-b2a84494c3fe.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86082507-cd211680-ba4c-11ea-89d1-29bbedb75995.png](https://user-images.githubusercontent.com/37036296/86082507-cd211680-ba4c-11ea-89d1-29bbedb75995.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nI generally try to exercise these rules and concepts in my framework\n\n\\- Applications of common sense\n\n\\- Applications of game theory\n\n\\- Strongly positive relationships or increasing economic need\n\n\\- Modesty in asset allocation over aggression\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# Primary Group Breakdown\n\n&amp;#x200B;\n\nMy Preallocated Selection vs \\[SPY, NASDAQ, VOO\\]\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86091181-4bd37f00-ba60-11ea-9abe-fdbf8c48933e.png](https://user-images.githubusercontent.com/37036296/86091181-4bd37f00-ba60-11ea-9abe-fdbf8c48933e.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86091330-91904780-ba60-11ea-8660-2e2d0ea32dc0.png](https://user-images.githubusercontent.com/37036296/86091330-91904780-ba60-11ea-8660-2e2d0ea32dc0.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86091365-a66cdb00-ba60-11ea-9a5f-60e5cb06b0be.png](https://user-images.githubusercontent.com/37036296/86091365-a66cdb00-ba60-11ea-9a5f-60e5cb06b0be.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86091414-bb496e80-ba60-11ea-8822-c8a65bba83c6.png](https://user-images.githubusercontent.com/37036296/86091414-bb496e80-ba60-11ea-8822-c8a65bba83c6.png))\n\n&amp;#x200B;\n\nAs you can image, if I allocate too many resources to competitors, my investments become more inline with NASDAQ growth.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86091694-2eeb7b80-ba61-11ea-9afb-c8abd3c2459f.png](https://user-images.githubusercontent.com/37036296/86091694-2eeb7b80-ba61-11ea-9afb-c8abd3c2459f.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nPrimary Assets at a glance\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86085632-6dc70480-ba54-11ea-9d3c-a665fba9ac50.png](https://user-images.githubusercontent.com/37036296/86085632-6dc70480-ba54-11ea-9d3c-a665fba9ac50.png))\n\n&amp;#x200B;\n\n\\- Capitalist Monkey Casino Group\n\n  \\- These stocks are my bucket of sinful allocations when my monkey brain loses control and takes over or when America does some crazy shit.\n\n&amp;#x200B;\n\n\\- Augmented Reality\n\n  \\- The Augmented Reality Group are companies whos core products are AR-advantaged and sufficient power for cultural impacts.\n\n&amp;#x200B;\n\n\\- Financial Access\n\n  \\- The Financial Access Group is concerned with the lowering barriers to banking &amp; financial utilization.\n\n&amp;#x200B;\n\n\\- Cloud Infrastructure\n\n  \\-  The Cloud Infrastructure Group focuses on stabilizing and advancing network speeds &amp; security in cloud systems.\n\n&amp;#x200B;\n\n\\- Power Systems\n\n  \\- The Power Systems Group is concerned with the development of alternate energy systems to power the supply chain.\n\n&amp;#x200B;\n\n\\- Consumer Supply\n\n  \\- The Consumer Supply Group focuses on the happiness of customer at transaction time and the ability to scale that customer satisfaction\n\n&amp;#x200B;\n\n\\- Cloud Services\n\n  \\- The Cloud Services Group are inelastic products that will either be consumed by larger industry or will continue to pioneer new demands.\n\n \n\n\\- Machine Learning\n\n  \\- The ML Group are companies whos core products are significantly advantaged by AI/ML.\n\n&amp;#x200B;\n\n\\- Semiconductors\n\n  \\- The Semiconductors Group focuses on the lowering barriers to advanced technology and computing.\n\n&amp;#x200B;\n\n\\- Industry\n\n  \\- The Industry Group works on material development  and business exchanges of US and Mexico.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\- Industrial Robotics\n\n  \\- The Industrial Robotics Group focuses on the increasing automation of labor.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\- Network Infrastructure\n\n  \\- The Network Infrastructure Group focuses on the expansion of telecom services in the Americas.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\- ETF Diversification &amp; Asset Amplification\n\n  \\- These are selections of industries I would like to generally participate in or bolster current investments.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nTotal assets at a glance (ETFs Excluded)\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86090992-fb5c2180-ba5f-11ea-988f-f21f771aaaf7.png](https://user-images.githubusercontent.com/37036296/86090992-fb5c2180-ba5f-11ea-988f-f21f771aaaf7.png))\n\n&amp;#x200B;\n\n\\# Monkey Capitalist Casino\n\n\\- SPCE\n\n  \\- DKNG\n\n  \\- IPO ETF\n\n  \\- Dennys\n\n  \\- Bitcoin/BAT\n\n&amp;#x200B;\n\nThese stocks are my bucket of sinful allocations when my monkey brain loses control and takes over or when America does some crazy shit. I dont hold any of these right now.\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86098091-7e827500-ba6a-11ea-80be-7e73e6557326.png](https://user-images.githubusercontent.com/37036296/86098091-7e827500-ba6a-11ea-80be-7e73e6557326.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86098154-92c67200-ba6a-11ea-9c4c-17aef3908461.png](https://user-images.githubusercontent.com/37036296/86098154-92c67200-ba6a-11ea-9c4c-17aef3908461.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86098173-99ed8000-ba6a-11ea-9ea8-f691393683c1.png](https://user-images.githubusercontent.com/37036296/86098173-99ed8000-ba6a-11ea-9ea8-f691393683c1.png))\n\n&amp;#x200B;\n\n\\# Augmented Reality Group\n\n**- FACEBOOK**\n\n  \\- Adobe\n\n  \\- Apple\n\n  \\- Nintendo\n\n  \\- Disney\n\n&amp;#x200B;\n\n*The Augmented Reality Group are companies with a vested interest in AR products and sufficient power for cultural impacts.*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86095490-d5864b00-ba66-11ea-8d32-bed356fb47ba.png](https://user-images.githubusercontent.com/37036296/86095490-d5864b00-ba66-11ea-8d32-bed356fb47ba.png))\n\n&amp;#x200B;\n\n\\- Facebook's outreach is unmatched. It currently takes priority in this group and it will maintain its position if Facebook can deliver and execute on e-commerce and small business support in the US, India, and Latin America through WhatsApp, FB, and Instragram Camera Commerce features. Their integration with Walmart, Rio, and Shopify was wise and will be my test to see if it can really master its scale. FB has also done incredible work in networking speeds on their product and has an excellent web kit with React, React Native, GraphQL, and more.\n\n&amp;#x200B;\n\n\\- Apple and Adobe have a tight and powerful relationship and are deeply integrated into various markets ranging from gaming studio development, marketing data, computer vision, and chip manufacturing.\n\n&amp;#x200B;\n\n\\- Disney and Nintendo are closer to defensive stocks as they are deeply integrated with unmatched branding in childhood &amp; families.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86090855-b6d08600-ba5f-11ea-87bf-a2c42b3e353b.png](https://user-images.githubusercontent.com/37036296/86090855-b6d08600-ba5f-11ea-87bf-a2c42b3e353b.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86090889-c8b22900-ba5f-11ea-8d20-4b3195076a00.png](https://user-images.githubusercontent.com/37036296/86090889-c8b22900-ba5f-11ea-8d20-4b3195076a00.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# Machine Learning Group\n\n**- MICROSOFT**\n\n  \\- Google\n\n  \\- Tesla\n\n **The ML Group are companies who's core products are significantly advantaged by AI/ML.**\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86094462-69571780-ba65-11ea-91a8-79e523085204.png](https://user-images.githubusercontent.com/37036296/86094462-69571780-ba65-11ea-91a8-79e523085204.png))\n\n&amp;#x200B;\n\n\\- I'm excited to see Microsoft's software automation advancements across various tools ranging from Excel, internal Windows hardware management, to developer workflow solutions. I believe this move will separate them from the rest when it comes to long-form competitions of cloud computing and network optimizing.\n\n&amp;#x200B;\n\n\\- Google is a close second as they are already distributing ML solutions through Google Cloud Platform &amp; has extensive reach across various industries with LIDAR simulations, adtech, and an unholy amount of data. I fear Google's reach into too many markets, similar to Amazon.\n\n&amp;#x200B;\n\n\\- Tesla is an interesting use case as they do not rely on software simulations as much as Waymo or other ambitious mobility startups. I believe this will lead them to discover some really robust ML applications in their time investigate power management and secure driving solutions.\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86094391-4c224900-ba65-11ea-90f7-f2b7a5e021fd.png](https://user-images.githubusercontent.com/37036296/86094391-4c224900-ba65-11ea-90f7-f2b7a5e021fd.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86094423-593f3800-ba65-11ea-8f28-99dd6eae97dc.png](https://user-images.githubusercontent.com/37036296/86094423-593f3800-ba65-11ea-8f28-99dd6eae97dc.png))\n\n&amp;#x200B;\n\n\\# Financial Access Group\n\n\\- \\*\\*PAYPAL\\*\\*\n\n  \\- Square\n\n  \\- Visa\n\n&amp;#x200B;\n\n\\*\\*The Financial Access Group is concerned with the lowering barriers to banking &amp; transaction infrastructure.\\*\\*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86095710-2f871080-ba67-11ea-8965-f3e2b99c821e.png](https://user-images.githubusercontent.com/37036296/86095710-2f871080-ba67-11ea-8965-f3e2b99c821e.png))\n\n&amp;#x200B;\n\n\\- Paypal has a really interesting history as a pioneer in the payment processing business. I'm really excited to see what they can do with their Honey acquisition in relation to e-commerce and Amazon commerce. Paypal also has an enormous catalog of services ranging from small business support to remittance sending.\n\n&amp;#x200B;\n\n\\- I believe it's a mistake to underestimate Square with respects to the younger generation who is enters the global market primarily through technology these days. Cash App is wonderfully designed, educational, chartered as a bank, and has a clear path forward as a financial services integrations. It can prove to be a valuable competitor to Paypal.\n\n&amp;#x200B;\n\n\\- Visa is the fingerprint into the banking system. They were wise to respect blockchain technology early and is an extremely trusted brand which has infinite value in the financial world. Visa grows with each transaction.\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86095751-3ca3ff80-ba67-11ea-9e2d-1d111f081948.png](https://user-images.githubusercontent.com/37036296/86095751-3ca3ff80-ba67-11ea-9e2d-1d111f081948.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86095793-4a598500-ba67-11ea-9826-6e9832fae0a3.png](https://user-images.githubusercontent.com/37036296/86095793-4a598500-ba67-11ea-9826-6e9832fae0a3.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# Semiconductors Group\n\n\\- \\*\\*TEXAS INSTRUMENTS\\*\\*\n\n  \\- AMD\n\n  \\- Nvidia\n\n&amp;#x200B;\n\n  \\*\\*The Semiconductors Group focuses on the lowering barriers to advanced technology and computing.\\*\\*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86096614-5a259900-ba68-11ea-91d9-ce4772d51dda.png](https://user-images.githubusercontent.com/37036296/86096614-5a259900-ba68-11ea-91d9-ce4772d51dda.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\- I have selected TI to lead for now as TI is found in just about anything ranging from Tesla dashboards to NASA rockets. TI is also important with respects to the Texas-Nuevo Leon model that I have written about that prioritizes Texas and Mexican growth potential. \n\n&amp;#x200B;\n\n\\- Nvidia is obviously a pioneer and leader in AI, cloud computing, and much more like GPU distribution. \n\n&amp;#x200B;\n\n\\- AMD has destabilized my perspective and this may be their opportunity to stick their growth. They have done remarkable work in the cloud computing and energy/cost reduction space.\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86096791-9953ea00-ba68-11ea-8db0-cfabf5983cf8.png](https://user-images.githubusercontent.com/37036296/86096791-9953ea00-ba68-11ea-8db0-cfabf5983cf8.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86096754-8c36fb00-ba68-11ea-8cdd-0715fe057975.png](https://user-images.githubusercontent.com/37036296/86096754-8c36fb00-ba68-11ea-8cdd-0715fe057975.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# Cloud Infrastructure Group\n\n\\- \\*\\*CLOUDFLARE\\*\\*\n\n  \\- Fastly \n\n  \\- Z-Scaler\n\n  \\- Akamai\n\n&amp;#x200B;\n\n \\*\\*The Cloud Infrastructure Group focuses on stabilizing and advancing network speeds&amp; security in cloud systems.\\*\\*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86096907-c3a5a780-ba68-11ea-9e2e-f53455bfc172.png](https://user-images.githubusercontent.com/37036296/86096907-c3a5a780-ba68-11ea-9e2e-f53455bfc172.png))\n\n&amp;#x200B;\n\n\\- Cloudflare is selected for its ability to bring down price and grow infrastructure from the inside out. It's a riskier approach. I'm really excited to see their future prospects growing video streaming infrastructure and their path of distributing privacy &amp; security. They take the beacon of American privacy ideals to emerging markets.\\[ I have more extensive research on Cloudflare, CDNs, and cloud computing here.\\]([https://www.reddit.com/r/wallstreetbets/comments/h7x4l6/cloudflare\\_net\\_dd\\_cloud\\_infrastructure\\_security/](https://www.reddit.com/r/wallstreetbets/comments/h7x4l6/cloudflare_net_dd_cloud_infrastructure_security/))\n\n&amp;#x200B;\n\n\\- Fastly is an excellent product that optimizes media delivery in the network. I believe Fastly is most likely to compete with the likes of Akamai in their respective CDN space.\n\n&amp;#x200B;\n\n\\- Z-Scaler turns toward more industrial clients, gathering partners in energy, supply chain, manufacturing, and more. I think this is an underrated aspect to current cloud computing discussions. The security of networks that protect expensive industrial machines will be critically important when production speeds are extremely rapid between competitors.\n\n&amp;#x200B;\n\n\\- Akamai of course is the giant of the CDN space. I believe AKamai will also continue to grow in a much healthier manner in comparison to stocks like Fastly over the long term.\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86096938-d15b2d00-ba68-11ea-8a8d-eba84d2008e8.png](https://user-images.githubusercontent.com/37036296/86096938-d15b2d00-ba68-11ea-8a8d-eba84d2008e8.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86096958-dd46ef00-ba68-11ea-8f20-831af8f0a4a2.png](https://user-images.githubusercontent.com/37036296/86096958-dd46ef00-ba68-11ea-8f20-831af8f0a4a2.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# Cloud Services Group\n\n\\- \\*\\*DOCUSIGN\\*\\*\n\n  \\- Twitter\n\n  \\- Chegg\n\n  \\- Dropbox\n\n  \\- Lyft\n\n  \\- 1Life Medical\n\n  \\- Upwork\n\n  \\- Autodesk\n\n  \n\n \\*\\*The Cloud Services Group are inelastic distributed products.\\*\\* \n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097036-f64fa000-ba68-11ea-9a8c-07f2e0b06e68.png](https://user-images.githubusercontent.com/37036296/86097036-f64fa000-ba68-11ea-9a8c-07f2e0b06e68.png))\n\n&amp;#x200B;\n\nThis is a large set of stocks, so it doesn't receive as much allocation, with the exception of DocuSign. I believe all of these companies are robust technologies that can receive modest investments over time. This asset group will likely see more changes for the primary spot than others.\n\n&amp;#x200B;\n\n\\- DocuSign is the current speculation as it can acquire stickiness through its legal procurements. I believe legal procurements is a necessary industry that will be amplified by cross-border trade.\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097076-036c8f00-ba69-11ea-92c0-b8e7fcf70d73.png](https://user-images.githubusercontent.com/37036296/86097076-036c8f00-ba69-11ea-92c0-b8e7fcf70d73.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097128-141d0500-ba69-11ea-867a-f7d404b5e6f3.png](https://user-images.githubusercontent.com/37036296/86097128-141d0500-ba69-11ea-867a-f7d404b5e6f3.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# Network Infrastructure Group\n\n\\- \\*\\*CROWN CASTLE INTERNATIONAL (REIT)\\*\\*\n\n  \\- T-Mobile\n\n  \\- America Movil\n\n&amp;#x200B;\n\n\\*\\*The Network Infrastructure Group focuses on the expansion of telecommunications across the US and Mexico.\\*\\* \n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097290-462e6700-ba69-11ea-9159-b1e5106bd07a.png](https://user-images.githubusercontent.com/37036296/86097290-462e6700-ba69-11ea-9159-b1e5106bd07a.png))\n\n&amp;#x200B;\n\n\\- CCI is the largest telecom network in the US that is headquartered in the US. It funnels much of the transmission of many ISPs.\n\n&amp;#x200B;\n\n\\- I really love T-Mobile's tech friendly CEO and approach to accessibility and customer experience. I think this will deliver in spades when Mexican markets grow.\n\n&amp;#x200B;\n\n\\- America Movil is Mexico's telecom and Mexico's largest company by market cap.\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097322-52b2bf80-ba69-11ea-9b37-88fa0bf3cb9e.png](https://user-images.githubusercontent.com/37036296/86097322-52b2bf80-ba69-11ea-9b37-88fa0bf3cb9e.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097351-5e05eb00-ba69-11ea-9e64-03ab766e9e3a.png](https://user-images.githubusercontent.com/37036296/86097351-5e05eb00-ba69-11ea-9e64-03ab766e9e3a.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# Power Systems Group\n\n\\- \\*\\*PANASONIC\\*\\*\n\n  \\- Vestas\n\n  \\- Plug Power\n\n  \\- Siemens\n\n&amp;#x200B;\n\n\\*\\*The Power Systems Group focuses on the growth of alternative energy systems.\\*\\*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097422-7bd35000-ba69-11ea-9082-687bec03cbe5.png](https://user-images.githubusercontent.com/37036296/86097422-7bd35000-ba69-11ea-9082-687bec03cbe5.png))\n\n&amp;#x200B;\n\n\\- Panasonic has ventures in multiple energy systems but has exciting potential on healthy partnerships with Tesla, Toyota, and other large automotive groups. These are also organizations that manufacture in Mexico.\n\n&amp;#x200B;\n\n\\- Vestas has pioneered sales of wind energy systems and may prove valuable during infrastructure and energy restructures.\n\n&amp;#x200B;\n\n\\- Plug Power is focused on hydrogen fuel which complements battery systems in technologies like forklifts or last-mile delivery trucks.\n\n&amp;#x200B;\n\n\\- Siemens is an provider from Germany that is well integrated in Mexican &amp; Texas-Monterrey development.\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097453-8857a880-ba69-11ea-8e1b-d7ec4eade982.png](https://user-images.githubusercontent.com/37036296/86097453-8857a880-ba69-11ea-8e1b-d7ec4eade982.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097475-93aad400-ba69-11ea-9087-4e6260a77b68.png](https://user-images.githubusercontent.com/37036296/86097475-93aad400-ba69-11ea-9087-4e6260a77b68.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# Industry Group\n\n\\- \\*\\*KANSAS CITY SOUTHERN\\*\\*\n\n  \\- Berkshire.B\n\n  \\- XLB Materials ETF\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\*\\*The Industry Group works on material development and business exchanges of US and Mexico.\\*\\* \n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097528-a7eed100-ba69-11ea-89ff-455192cfa52c.png](https://user-images.githubusercontent.com/37036296/86097528-a7eed100-ba69-11ea-89ff-455192cfa52c.png))\n\n&amp;#x200B;\n\n\\[I got into the strategic advantage behind Kansas City Southern Rail here.\\]([https://www.reddit.com/r/wallstreetbets/comments/hh1t4k/all\\_aboard\\_the\\_trump\\_train\\_kansas\\_city\\_southern/](https://www.reddit.com/r/wallstreetbets/comments/hh1t4k/all_aboard_the_trump_train_kansas_city_southern/)) It is an important Class-I railroad that connects through Mexico, Texas, and the American Midwest.\n\n&amp;#x200B;\n\n\\- Berkshire.B is a business selector that invests in other sectors like Financials and value assement.\n\n&amp;#x200B;\n\n\\- XLB is a group of industries that produce materials standards, chemicals, paint, and other low-level materials.\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097559-b50bc000-ba69-11ea-92e9-67cce9bfeeb9.png](https://user-images.githubusercontent.com/37036296/86097559-b50bc000-ba69-11ea-92e9-67cce9bfeeb9.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097610-c1901880-ba69-11ea-9a8b-2cf581ff8f13.png](https://user-images.githubusercontent.com/37036296/86097610-c1901880-ba69-11ea-9a8b-2cf581ff8f13.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# Industrial Robotics Group \n\n\\- \\*\\*FANUC\\*\\*\n\n  \\- ABB\n\n  \\- Rockwell Automation\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\*\\*The Industrial Robotics group focuses on the increasing automation of labor.\\*\\*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097654-d371bb80-ba69-11ea-93a6-08e88dc1c89f.png](https://user-images.githubusercontent.com/37036296/86097654-d371bb80-ba69-11ea-93a6-08e88dc1c89f.png))\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097684-dff61400-ba69-11ea-813d-4750b876bb07.png](https://user-images.githubusercontent.com/37036296/86097684-dff61400-ba69-11ea-813d-4750b876bb07.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097712-ebe1d600-ba69-11ea-80b1-84babc271968.png](https://user-images.githubusercontent.com/37036296/86097712-ebe1d600-ba69-11ea-80b1-84babc271968.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# Consumer Supply Group\n\n\\- \\*\\*COSTCO\\*\\*\n\n  \\- Amazon\n\n  \\- Shopify\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\*\\*The Consumer Supply has a similar focuses on customer satisfaction during purchase time.\\*\\*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097793-09af3b00-ba6a-11ea-87a1-0f734225a821.png](https://user-images.githubusercontent.com/37036296/86097793-09af3b00-ba6a-11ea-87a1-0f734225a821.png))\n\n&amp;#x200B;\n\n\\- I view Costco as the leader in customer satisfaction at purchase time. I believe their business model and product selection process can be replicated in places like Mexico and continue its success without much disruption. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\- Shopify is and a leader in small business opportunities.  Their partnership with Facebook and Walmart was an extremely wise choice given their momentum, which is also massively popular in Mexico.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\- Amazon is also a pioneer in customer satisfaction with 2-day delivery. I'm unsure how this will execute over a long period of time in a country like Mexico, where truck traversal is quite dangerous and ineffecient. They also compete with regional players like Mercado Libre.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097809-12077600-ba6a-11ea-83fe-fd597b559148.png](https://user-images.githubusercontent.com/37036296/86097809-12077600-ba6a-11ea-83fe-fd597b559148.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097834-1a5fb100-ba6a-11ea-8066-87c16ba590fd.png](https://user-images.githubusercontent.com/37036296/86097834-1a5fb100-ba6a-11ea-8066-87c16ba590fd.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# ETF Diversification &amp; Asset Amplification\n\n\\- \\*\\*SPY\\*\\*\n\n  \\- EWW Mexico \n\n  \\- FIVG 5g \n\n  \\- IPO Startup \n\n  \\- WCLD Cloud \n\n  \\- ESPO Gaming\n\n  \\- CIBR Cybersecurity \n\n  \\- HACK Cybersecurity \n\n  \\- TPAY Financials\n\n  \\- ARKF Financial Technology\n\n  \\- IPAY Financial Services\n\n  \\- DFNL Banking Services\n\n  \\- SOXX Semiconductors\n\n  \\- IYT Railroad \n\n  \\- POTX Cannabis \n\n  \\- BOTZ Automation \n\n&amp;#x200B;\n\nThese are selections of industries I would like to generally participate in or bolster current investments.\n\nThe ETF &amp; Asset Amplification is a group of industries I would like to factor uncertainties for or better capture. I will not be able to determine Cannabis leaders in 2023, for example. A lot of these ETFs fall under \"I'm not sure if some unknown player will suddenly rise 3 years from now in this industry\".\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86098011-64489700-ba6a-11ea-846a-0816cd3755b8.png](https://user-images.githubusercontent.com/37036296/86098011-64489700-ba6a-11ea-846a-0816cd3755b8.png))",
        "subreddit": "StockMarket",
        "title": "My Portfolio Restructure - Mexican American Investment Decisions",
        "url": "https://www.reddit.com/r/StockMarket/comments/hjs24t/my_portfolio_restructure_mexican_american/",
        "created": 1593701127.0
    },
    {
        "author": "notbrokemexican",
        "created_utc": 1593672457,
        "id": "hjs32p",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "# Note: for a better reading experience, please use the link to view a Markdown version of this file with images. The text version is below. It also includes research into KSU &amp; Cloudflare (also in my profile)\n\n [https://github.com/Sheilf/Investment-Research](https://github.com/Sheilf/Investment-Research)\n\n&amp;#x200B;\n\n# # Disclaimer \n\nI am very familiar with The Effecient Market Hypothesis. I use it for my retirement investments.\n\nI am using a mixture of influences from Renaissance Technologies &amp; John Neumann's Game Theory.\n\n&amp;#x200B;\n\nThis is **MY** strategy as my investment goals and motivations are most likely far different than yours. I use a mixture of options when I have really high confidence in my economic model (as evidence by holding through dips).\n\n&amp;#x200B;\n\nI started investing in February and aggressively purchased stocks in Facebook, Paypal, and Cloudflare.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86323590-f333eb80-bbf1-11ea-977b-f3df91980417.png](https://user-images.githubusercontent.com/37036296/86323590-f333eb80-bbf1-11ea-977b-f3df91980417.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# The Case For Mexican-American Investments\n\nI'm building a portfolio that revolves around developing the post-covid economic restructuring. The overarching theme behind these picks is **American Innovation &amp; Mexican Development.** \n\nI'm a 26 year old fintech engineer in the US and an avocado farmer in Mexico and I hold a strong conviction that investing in Mexican development will reward me well in the decades to come.  \n\n**In a nutshell, the USMCA is a 1 trillion dollar trade restructuring and my strategy favors the Texas-Nuevo Leon economy and overall Mexican-American trade.**\n\n&amp;#x200B;\n\nHere is Monterrey, Nuevo Leon\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86219352-ec946e00-bb36-11ea-9fc3-b17c9e5b0597.png](https://user-images.githubusercontent.com/37036296/86219352-ec946e00-bb36-11ea-9fc3-b17c9e5b0597.png))\n\n \n\nI'm from a rural village south of Jalisco which produces far more agricultural goods like avocados alongside Michoacan.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86219771-7e9c7680-bb37-11ea-98b2-7e8c2833d99a.png](https://user-images.githubusercontent.com/37036296/86219771-7e9c7680-bb37-11ea-98b2-7e8c2833d99a.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nI am very aware of the problems that Mexico faces but I also view Mexico as a sleeping giant that the US utilizes for capital efficiency in global trade. Mexico is part of a puzzle that fits in a large scope that involves other bulwark nations like Germany, Japan, Brazil, and India.\n\n&amp;#x200B;\n\n!\\[Bulwark Trading Nations\\]([https://user-images.githubusercontent.com/37036296/86080247-51709b00-ba47-11ea-8d38-54da06916f57.png](https://user-images.githubusercontent.com/37036296/86080247-51709b00-ba47-11ea-8d38-54da06916f57.png))\n\n&amp;#x200B;\n\n!\\[The North American Trade Block\\]([https://preview.redd.it/c4ej9hcrki751.png?width=638&amp;format=png&amp;auto=webp&amp;s=0062950618749d315101fb97d09237db961e2d40](https://preview.redd.it/c4ej9hcrki751.png?width=638&amp;format=png&amp;auto=webp&amp;s=0062950618749d315101fb97d09237db961e2d40))\n\n&amp;#x200B;\n\nAt the same time, Mexico is a nation in crisis. The economic damage narcotrafficking has delivered has resulted in:\n\n\\- \\[An increasing black market integration into the global money supply, in the order of hundreds of billions of dollars, resulting in a growing vacuum of theft AKA the Drug War &amp; Economics of Peace\\]([https://en.wikipedia.org/wiki/Bank\\_Secrecy\\_Act#Sanctions](https://en.wikipedia.org/wiki/Bank_Secrecy_Act#Sanctions))\n\n\\- North American suppressed wage suppression\n\n\\- refugee style illegal immigration\n\n\\- NA workforce morale decrease\n\n\\- Mexican workforce morale decrease\n\n\\- A Mexican workforce and brain drain, as skilled and motivated laborers leave for opportunity and better pay who are loyal to both nations\n\n\\- Multiple events of civil unrest or civil disasters\n\n&amp;#x200B;\n\n\\- National cyncism against the current administration\n\n&amp;#x200B;\n\nI see this as a complex problem where most people's perspective is not complete or clouded by one of the reasons above. I hold admittedly extreme views toward this problem and I understand people's need to debate this. Half of my life is in Mexico and it's something has been omnipresent in my life. I have seen the military police the roads, I've seen fire fights, the robbery, the vigilante justice, and so on. My parents were robbed. My mother was threatened with rape. My dog was almost killed. It's something omnipresent.\n\n&amp;#x200B;\n\n\\- I believe that all drugs should be legalized and nations like Colombia are headed in the right direction.\n\n\\- I believe the path won't be clear but a solution must come in the following decades.\n\n\\- I  believe an important element to this solution is the integration of American technology &amp; innovation that will increase the industry standards of Mexico's workforce.\n\n\\- I believe that American integration will force increases in legal and regulatory body requirements like the compliance procedures required behind and American financial technology app like Square or Paypal. The PATRIOT act is omnipresent in trade, regardless of your opinion.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nThere are other major factors at play here.\n\n\\- Advanced education in Mexico is accelerating with International partnerships.\n\n\\- The USMCA is a 1 trillion dollar trade restructuring.\n\n\\- Mexico is rapidly developing its English speaking workforce\n\n\\- Mexico is positioned to be deeply invested and coupled to American economics.\n\n\\- Trump and AMLO are cooperative (Economics of Peace).\n\n&amp;#x200B;\n\nIn the end, I don't believe that the economics of the black market and drug trade will succeed in the continued suppression of the Mexican economy. It is certainly in a golden era of sorts, and Mexico reflects as a nation in decline.\n\n&amp;#x200B;\n\n\\# The Economic Framework\n\nI am selecting industries that:\n\n&amp;#x200B;\n\n\\- Empower the US and have a rippling effect on Mexico\n\n\\- Will fundamentally continue to build and grow the future global supply\n\n\\- Are friendly to primarily German/Euro and Japanese/Asian trade.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# My Portfolio Structure\n\nThere are two systems at play at the same time.\n\n&amp;#x200B;\n\nThe 12 Primary Asset Collection - these are stocks I regularly invest in.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86082755-62bca600-ba4d-11ea-8857-95e902f8d0ce.png](https://user-images.githubusercontent.com/37036296/86082755-62bca600-ba4d-11ea-8857-95e902f8d0ce.png))\n\n&amp;#x200B;\n\nThe 12 Competitor Arenas (Cloud Infrastructure Group) - these are stocks that are competing for Primary Asset Allocation each quarter and receive less allocation.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86082923-c3e47980-ba4d-11ea-9543-b31eb000962d.png](https://user-images.githubusercontent.com/37036296/86082923-c3e47980-ba4d-11ea-9543-b31eb000962d.png))\n\n&amp;#x200B;\n\n\\- I own 12 primary companies. These are the companies that I believe satisfy a certain economic condition with respects to their industry group.\n\n**- These stocks are always in competition with other high quality competitors in the realms I determine.**\n\n**- They are also industries that I want to see grow (which is why I invest in them).**\n\n**-  I'm not always going for min-max profit.**\n\n&amp;#x200B;\n\nExample of Competition\n\n&amp;#x200B;\n\n**Augmented Reality Group**\n\n*Economic Condition*: The Augmented Reality Group are companies whos core products are AR-enhanced and have sufficient power for cultural impacts.\n\n&amp;#x200B;\n\nIn this case, Facebook would be my primary asset of this group. (discussed in selection breakdown)\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86082479-b67abf80-ba4c-11ea-815f-b2a84494c3fe.png](https://user-images.githubusercontent.com/37036296/86082479-b67abf80-ba4c-11ea-815f-b2a84494c3fe.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86082507-cd211680-ba4c-11ea-89d1-29bbedb75995.png](https://user-images.githubusercontent.com/37036296/86082507-cd211680-ba4c-11ea-89d1-29bbedb75995.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nI generally try to exercise these rules and concepts in my framework\n\n\\- Applications of common sense\n\n\\- Applications of game theory\n\n\\- Strongly positive relationships or increasing economic need\n\n\\- Modesty in asset allocation over aggression\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# Primary Group Breakdown\n\n&amp;#x200B;\n\nMy Preallocated Selection vs \\[SPY, NASDAQ, VOO\\]\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86091181-4bd37f00-ba60-11ea-9abe-fdbf8c48933e.png](https://user-images.githubusercontent.com/37036296/86091181-4bd37f00-ba60-11ea-9abe-fdbf8c48933e.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86091330-91904780-ba60-11ea-8660-2e2d0ea32dc0.png](https://user-images.githubusercontent.com/37036296/86091330-91904780-ba60-11ea-8660-2e2d0ea32dc0.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86091365-a66cdb00-ba60-11ea-9a5f-60e5cb06b0be.png](https://user-images.githubusercontent.com/37036296/86091365-a66cdb00-ba60-11ea-9a5f-60e5cb06b0be.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86091414-bb496e80-ba60-11ea-8822-c8a65bba83c6.png](https://user-images.githubusercontent.com/37036296/86091414-bb496e80-ba60-11ea-8822-c8a65bba83c6.png))\n\n&amp;#x200B;\n\nAs you can image, if I allocate too many resources to competitors, my investments become more inline with NASDAQ growth.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86091694-2eeb7b80-ba61-11ea-9afb-c8abd3c2459f.png](https://user-images.githubusercontent.com/37036296/86091694-2eeb7b80-ba61-11ea-9afb-c8abd3c2459f.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nPrimary Assets at a glance\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86085632-6dc70480-ba54-11ea-9d3c-a665fba9ac50.png](https://user-images.githubusercontent.com/37036296/86085632-6dc70480-ba54-11ea-9d3c-a665fba9ac50.png))\n\n&amp;#x200B;\n\n\\- Capitalist Monkey Casino Group\n\n  \\- These stocks are my bucket of sinful allocations when my monkey brain loses control and takes over or when America does some crazy shit.\n\n&amp;#x200B;\n\n\\- Augmented Reality\n\n  \\- The Augmented Reality Group are companies whos core products are AR-advantaged and sufficient power for cultural impacts.\n\n&amp;#x200B;\n\n\\- Financial Access\n\n  \\- The Financial Access Group is concerned with the lowering barriers to banking &amp; financial utilization.\n\n&amp;#x200B;\n\n\\- Cloud Infrastructure\n\n  \\-  The Cloud Infrastructure Group focuses on stabilizing and advancing network speeds &amp; security in cloud systems.\n\n&amp;#x200B;\n\n\\- Power Systems\n\n  \\- The Power Systems Group is concerned with the development of alternate energy systems to power the supply chain.\n\n&amp;#x200B;\n\n\\- Consumer Supply\n\n  \\- The Consumer Supply Group focuses on the happiness of customer at transaction time and the ability to scale that customer satisfaction\n\n&amp;#x200B;\n\n\\- Cloud Services\n\n  \\- The Cloud Services Group are inelastic products that will either be consumed by larger industry or will continue to pioneer new demands.\n\n \n\n\\- Machine Learning\n\n  \\- The ML Group are companies whos core products are significantly advantaged by AI/ML.\n\n&amp;#x200B;\n\n\\- Semiconductors\n\n  \\- The Semiconductors Group focuses on the lowering barriers to advanced technology and computing.\n\n&amp;#x200B;\n\n\\- Industry\n\n  \\- The Industry Group works on material development  and business exchanges of US and Mexico.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\- Industrial Robotics\n\n  \\- The Industrial Robotics Group focuses on the increasing automation of labor.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\- Network Infrastructure\n\n  \\- The Network Infrastructure Group focuses on the expansion of telecom services in the Americas.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\- ETF Diversification &amp; Asset Amplification\n\n  \\- These are selections of industries I would like to generally participate in or bolster current investments.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nTotal assets at a glance (ETFs Excluded)\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86090992-fb5c2180-ba5f-11ea-988f-f21f771aaaf7.png](https://user-images.githubusercontent.com/37036296/86090992-fb5c2180-ba5f-11ea-988f-f21f771aaaf7.png))\n\n&amp;#x200B;\n\n\\# Monkey Capitalist Casino\n\n\\- SPCE\n\n  \\- DKNG\n\n  \\- IPO ETF\n\n  \\- Dennys\n\n  \\- Bitcoin/BAT\n\n&amp;#x200B;\n\nThese stocks are my bucket of sinful allocations when my monkey brain loses control and takes over or when America does some crazy shit. I dont hold any of these right now.\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86098091-7e827500-ba6a-11ea-80be-7e73e6557326.png](https://user-images.githubusercontent.com/37036296/86098091-7e827500-ba6a-11ea-80be-7e73e6557326.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86098154-92c67200-ba6a-11ea-9c4c-17aef3908461.png](https://user-images.githubusercontent.com/37036296/86098154-92c67200-ba6a-11ea-9c4c-17aef3908461.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86098173-99ed8000-ba6a-11ea-9ea8-f691393683c1.png](https://user-images.githubusercontent.com/37036296/86098173-99ed8000-ba6a-11ea-9ea8-f691393683c1.png))\n\n&amp;#x200B;\n\n\\# Augmented Reality Group\n\n**- FACEBOOK**\n\n  \\- Adobe\n\n  \\- Apple\n\n  \\- Nintendo\n\n  \\- Disney\n\n&amp;#x200B;\n\n*The Augmented Reality Group are companies with a vested interest in AR products and sufficient power for cultural impacts.*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86095490-d5864b00-ba66-11ea-8d32-bed356fb47ba.png](https://user-images.githubusercontent.com/37036296/86095490-d5864b00-ba66-11ea-8d32-bed356fb47ba.png))\n\n&amp;#x200B;\n\n\\- Facebook's outreach is unmatched. It currently takes priority in this group and it will maintain its position if Facebook can deliver and execute on e-commerce and small business support in the US, India, and Latin America through WhatsApp, FB, and Instragram Camera Commerce features. Their integration with Walmart, Rio, and Shopify was wise and will be my test to see if it can really master its scale. FB has also done incredible work in networking speeds on their product and has an excellent web kit with React, React Native, GraphQL, and more.\n\n&amp;#x200B;\n\n\\- Apple and Adobe have a tight and powerful relationship and are deeply integrated into various markets ranging from gaming studio development, marketing data, computer vision, and chip manufacturing.\n\n&amp;#x200B;\n\n\\- Disney and Nintendo are closer to defensive stocks as they are deeply integrated with unmatched branding in childhood &amp; families.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86090855-b6d08600-ba5f-11ea-87bf-a2c42b3e353b.png](https://user-images.githubusercontent.com/37036296/86090855-b6d08600-ba5f-11ea-87bf-a2c42b3e353b.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86090889-c8b22900-ba5f-11ea-8d20-4b3195076a00.png](https://user-images.githubusercontent.com/37036296/86090889-c8b22900-ba5f-11ea-8d20-4b3195076a00.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# Machine Learning Group\n\n**- MICROSOFT**\n\n  \\- Google\n\n  \\- Tesla\n\n **The ML Group are companies who's core products are significantly advantaged by AI/ML.**\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86094462-69571780-ba65-11ea-91a8-79e523085204.png](https://user-images.githubusercontent.com/37036296/86094462-69571780-ba65-11ea-91a8-79e523085204.png))\n\n&amp;#x200B;\n\n\\- I'm excited to see Microsoft's software automation advancements across various tools ranging from Excel, internal Windows hardware management, to developer workflow solutions. I believe this move will separate them from the rest when it comes to long-form competitions of cloud computing and network optimizing.\n\n&amp;#x200B;\n\n\\- Google is a close second as they are already distributing ML solutions through Google Cloud Platform &amp; has extensive reach across various industries with LIDAR simulations, adtech, and an unholy amount of data. I fear Google's reach into too many markets, similar to Amazon.\n\n&amp;#x200B;\n\n\\- Tesla is an interesting use case as they do not rely on software simulations as much as Waymo or other ambitious mobility startups. I believe this will lead them to discover some really robust ML applications in their time investigate power management and secure driving solutions.\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86094391-4c224900-ba65-11ea-90f7-f2b7a5e021fd.png](https://user-images.githubusercontent.com/37036296/86094391-4c224900-ba65-11ea-90f7-f2b7a5e021fd.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86094423-593f3800-ba65-11ea-8f28-99dd6eae97dc.png](https://user-images.githubusercontent.com/37036296/86094423-593f3800-ba65-11ea-8f28-99dd6eae97dc.png))\n\n&amp;#x200B;\n\n\\# Financial Access Group\n\n\\- \\*\\*PAYPAL\\*\\*\n\n  \\- Square\n\n  \\- Visa\n\n&amp;#x200B;\n\n\\*\\*The Financial Access Group is concerned with the lowering barriers to banking &amp; transaction infrastructure.\\*\\*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86095710-2f871080-ba67-11ea-8965-f3e2b99c821e.png](https://user-images.githubusercontent.com/37036296/86095710-2f871080-ba67-11ea-8965-f3e2b99c821e.png))\n\n&amp;#x200B;\n\n\\- Paypal has a really interesting history as a pioneer in the payment processing business. I'm really excited to see what they can do with their Honey acquisition in relation to e-commerce and Amazon commerce. Paypal also has an enormous catalog of services ranging from small business support to remittance sending.\n\n&amp;#x200B;\n\n\\- I believe it's a mistake to underestimate Square with respects to the younger generation who is enters the global market primarily through technology these days. Cash App is wonderfully designed, educational, chartered as a bank, and has a clear path forward as a financial services integrations. It can prove to be a valuable competitor to Paypal.\n\n&amp;#x200B;\n\n\\- Visa is the fingerprint into the banking system. They were wise to respect blockchain technology early and is an extremely trusted brand which has infinite value in the financial world. Visa grows with each transaction.\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86095751-3ca3ff80-ba67-11ea-9e2d-1d111f081948.png](https://user-images.githubusercontent.com/37036296/86095751-3ca3ff80-ba67-11ea-9e2d-1d111f081948.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86095793-4a598500-ba67-11ea-9826-6e9832fae0a3.png](https://user-images.githubusercontent.com/37036296/86095793-4a598500-ba67-11ea-9826-6e9832fae0a3.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# Semiconductors Group\n\n\\- \\*\\*TEXAS INSTRUMENTS\\*\\*\n\n  \\- AMD\n\n  \\- Nvidia\n\n&amp;#x200B;\n\n  \\*\\*The Semiconductors Group focuses on the lowering barriers to advanced technology and computing.\\*\\*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86096614-5a259900-ba68-11ea-91d9-ce4772d51dda.png](https://user-images.githubusercontent.com/37036296/86096614-5a259900-ba68-11ea-91d9-ce4772d51dda.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\- I have selected TI to lead for now as TI is found in just about anything ranging from Tesla dashboards to NASA rockets. TI is also important with respects to the Texas-Nuevo Leon model that I have written about that prioritizes Texas and Mexican growth potential. \n\n&amp;#x200B;\n\n\\- Nvidia is obviously a pioneer and leader in AI, cloud computing, and much more like GPU distribution. \n\n&amp;#x200B;\n\n\\- AMD has destabilized my perspective and this may be their opportunity to stick their growth. They have done remarkable work in the cloud computing and energy/cost reduction space.\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86096791-9953ea00-ba68-11ea-8db0-cfabf5983cf8.png](https://user-images.githubusercontent.com/37036296/86096791-9953ea00-ba68-11ea-8db0-cfabf5983cf8.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86096754-8c36fb00-ba68-11ea-8cdd-0715fe057975.png](https://user-images.githubusercontent.com/37036296/86096754-8c36fb00-ba68-11ea-8cdd-0715fe057975.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# Cloud Infrastructure Group\n\n\\- \\*\\*CLOUDFLARE\\*\\*\n\n  \\- Fastly \n\n  \\- Z-Scaler\n\n  \\- Akamai\n\n&amp;#x200B;\n\n \\*\\*The Cloud Infrastructure Group focuses on stabilizing and advancing network speeds&amp; security in cloud systems.\\*\\*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86096907-c3a5a780-ba68-11ea-9e2e-f53455bfc172.png](https://user-images.githubusercontent.com/37036296/86096907-c3a5a780-ba68-11ea-9e2e-f53455bfc172.png))\n\n&amp;#x200B;\n\n\\- Cloudflare is selected for its ability to bring down price and grow infrastructure from the inside out. It's a riskier approach. I'm really excited to see their future prospects growing video streaming infrastructure and their path of distributing privacy &amp; security. They take the beacon of American privacy ideals to emerging markets.\n\n&amp;#x200B;\n\n\\- Fastly is an excellent product that optimizes media delivery in the network. I believe Fastly is most likely to compete with the likes of Akamai in their respective CDN space.\n\n&amp;#x200B;\n\n\\- Z-Scaler turns toward more industrial clients, gathering partners in energy, supply chain, manufacturing, and more. I think this is an underrated aspect to current cloud computing discussions. The security of networks that protect expensive industrial machines will be critically important when production speeds are extremely rapid between competitors.\n\n&amp;#x200B;\n\n\\- Akamai of course is the giant of the CDN space. I believe AKamai will also continue to grow in a much healthier manner in comparison to stocks like Fastly over the long term.\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86096938-d15b2d00-ba68-11ea-8a8d-eba84d2008e8.png](https://user-images.githubusercontent.com/37036296/86096938-d15b2d00-ba68-11ea-8a8d-eba84d2008e8.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86096958-dd46ef00-ba68-11ea-8f20-831af8f0a4a2.png](https://user-images.githubusercontent.com/37036296/86096958-dd46ef00-ba68-11ea-8f20-831af8f0a4a2.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# Cloud Services Group\n\n\\- \\*\\*DOCUSIGN\\*\\*\n\n  \\- Twitter\n\n  \\- Chegg\n\n  \\- Dropbox\n\n  \\- Lyft\n\n  \\- 1Life Medical\n\n  \\- Upwork\n\n  \\- Autodesk\n\n  \n\n \\*\\*The Cloud Services Group are inelastic distributed products.\\*\\* \n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097036-f64fa000-ba68-11ea-9a8c-07f2e0b06e68.png](https://user-images.githubusercontent.com/37036296/86097036-f64fa000-ba68-11ea-9a8c-07f2e0b06e68.png))\n\n&amp;#x200B;\n\nThis is a large set of stocks, so it doesn't receive as much allocation, with the exception of DocuSign. I believe all of these companies are robust technologies that can receive modest investments over time. This asset group will likely see more changes for the primary spot than others.\n\n&amp;#x200B;\n\n\\- DocuSign is the current speculation as it can acquire stickiness through its legal procurements. I believe legal procurements is a necessary industry that will be amplified by cross-border trade.\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097076-036c8f00-ba69-11ea-92c0-b8e7fcf70d73.png](https://user-images.githubusercontent.com/37036296/86097076-036c8f00-ba69-11ea-92c0-b8e7fcf70d73.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097128-141d0500-ba69-11ea-867a-f7d404b5e6f3.png](https://user-images.githubusercontent.com/37036296/86097128-141d0500-ba69-11ea-867a-f7d404b5e6f3.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# Network Infrastructure Group\n\n\\- \\*\\*CROWN CASTLE INTERNATIONAL (REIT)\\*\\*\n\n  \\- T-Mobile\n\n  \\- America Movil\n\n&amp;#x200B;\n\n\\*\\*The Network Infrastructure Group focuses on the expansion of telecommunications across the US and Mexico.\\*\\* \n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097290-462e6700-ba69-11ea-9159-b1e5106bd07a.png](https://user-images.githubusercontent.com/37036296/86097290-462e6700-ba69-11ea-9159-b1e5106bd07a.png))\n\n&amp;#x200B;\n\n\\- CCI is the largest telecom network in the US that is headquartered in the US. It funnels much of the transmission of many ISPs.\n\n&amp;#x200B;\n\n\\- I really love T-Mobile's tech friendly CEO and approach to accessibility and customer experience. I think this will deliver in spades when Mexican markets grow.\n\n&amp;#x200B;\n\n\\- America Movil is Mexico's telecom and Mexico's largest company by market cap.\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097322-52b2bf80-ba69-11ea-9b37-88fa0bf3cb9e.png](https://user-images.githubusercontent.com/37036296/86097322-52b2bf80-ba69-11ea-9b37-88fa0bf3cb9e.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097351-5e05eb00-ba69-11ea-9e64-03ab766e9e3a.png](https://user-images.githubusercontent.com/37036296/86097351-5e05eb00-ba69-11ea-9e64-03ab766e9e3a.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# Power Systems Group\n\n\\- \\*\\*PANASONIC\\*\\*\n\n  \\- Vestas\n\n  \\- Plug Power\n\n  \\- Siemens\n\n&amp;#x200B;\n\n\\*\\*The Power Systems Group focuses on the growth of alternative energy systems.\\*\\*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097422-7bd35000-ba69-11ea-9082-687bec03cbe5.png](https://user-images.githubusercontent.com/37036296/86097422-7bd35000-ba69-11ea-9082-687bec03cbe5.png))\n\n&amp;#x200B;\n\n\\- Panasonic has ventures in multiple energy systems but has exciting potential on healthy partnerships with Tesla, Toyota, and other large automotive groups. These are also organizations that manufacture in Mexico.\n\n&amp;#x200B;\n\n\\- Vestas has pioneered sales of wind energy systems and may prove valuable during infrastructure and energy restructures.\n\n&amp;#x200B;\n\n\\- Plug Power is focused on hydrogen fuel which complements battery systems in technologies like forklifts or last-mile delivery trucks.\n\n&amp;#x200B;\n\n\\- Siemens is an provider from Germany that is well integrated in Mexican &amp; Texas-Monterrey development.\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097453-8857a880-ba69-11ea-8e1b-d7ec4eade982.png](https://user-images.githubusercontent.com/37036296/86097453-8857a880-ba69-11ea-8e1b-d7ec4eade982.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097475-93aad400-ba69-11ea-9087-4e6260a77b68.png](https://user-images.githubusercontent.com/37036296/86097475-93aad400-ba69-11ea-9087-4e6260a77b68.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# Industry Group\n\n\\- \\*\\*KANSAS CITY SOUTHERN\\*\\*\n\n  \\- Berkshire.B\n\n  \\- XLB Materials ETF\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\*\\*The Industry Group works on material development and business exchanges of US and Mexico.\\*\\* \n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097528-a7eed100-ba69-11ea-89ff-455192cfa52c.png](https://user-images.githubusercontent.com/37036296/86097528-a7eed100-ba69-11ea-89ff-455192cfa52c.png))\n\n&amp;#x200B;\n\n\\- KSU is an important Class-I railroad that connects through Mexico, Texas, and the American Midwest.\n\n&amp;#x200B;\n\n\\- Berkshire.B is a business selector that invests in other sectors like Financials and value assement.\n\n&amp;#x200B;\n\n\\- XLB is a group of industries that produce materials standards, chemicals, paint, and other low-level materials.\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097559-b50bc000-ba69-11ea-92e9-67cce9bfeeb9.png](https://user-images.githubusercontent.com/37036296/86097559-b50bc000-ba69-11ea-92e9-67cce9bfeeb9.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097610-c1901880-ba69-11ea-9a8b-2cf581ff8f13.png](https://user-images.githubusercontent.com/37036296/86097610-c1901880-ba69-11ea-9a8b-2cf581ff8f13.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# Industrial Robotics Group \n\n\\- \\*\\*FANUC\\*\\*\n\n  \\- ABB\n\n  \\- Rockwell Automation\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\*\\*The Industrial Robotics group focuses on the increasing automation of labor.\\*\\*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097654-d371bb80-ba69-11ea-93a6-08e88dc1c89f.png](https://user-images.githubusercontent.com/37036296/86097654-d371bb80-ba69-11ea-93a6-08e88dc1c89f.png))\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097684-dff61400-ba69-11ea-813d-4750b876bb07.png](https://user-images.githubusercontent.com/37036296/86097684-dff61400-ba69-11ea-813d-4750b876bb07.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097712-ebe1d600-ba69-11ea-80b1-84babc271968.png](https://user-images.githubusercontent.com/37036296/86097712-ebe1d600-ba69-11ea-80b1-84babc271968.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# Consumer Supply Group\n\n\\- \\*\\*COSTCO\\*\\*\n\n  \\- Amazon\n\n  \\- Shopify\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\*\\*The Consumer Supply has a similar focuses on customer satisfaction during purchase time.\\*\\*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097793-09af3b00-ba6a-11ea-87a1-0f734225a821.png](https://user-images.githubusercontent.com/37036296/86097793-09af3b00-ba6a-11ea-87a1-0f734225a821.png))\n\n&amp;#x200B;\n\n\\- I view Costco as the leader in customer satisfaction at purchase time. I believe their business model and product selection process can be replicated in places like Mexico and continue its success without much disruption. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\- Shopify is and a leader in small business opportunities.  Their partnership with Facebook and Walmart was an extremely wise choice given their momentum, which is also massively popular in Mexico.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\- Amazon is also a pioneer in customer satisfaction with 2-day delivery. I'm unsure how this will execute over a long period of time in a country like Mexico, where truck traversal is quite dangerous and ineffecient. They also compete with regional players like Mercado Libre.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097809-12077600-ba6a-11ea-83fe-fd597b559148.png](https://user-images.githubusercontent.com/37036296/86097809-12077600-ba6a-11ea-83fe-fd597b559148.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097834-1a5fb100-ba6a-11ea-8066-87c16ba590fd.png](https://user-images.githubusercontent.com/37036296/86097834-1a5fb100-ba6a-11ea-8066-87c16ba590fd.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# ETF Diversification &amp; Asset Amplification\n\n\\- \\*\\*SPY\\*\\*\n\n  \\- EWW Mexico \n\n  \\- FIVG 5g \n\n  \\- IPO Startup \n\n  \\- WCLD Cloud \n\n  \\- ESPO Gaming\n\n  \\- CIBR Cybersecurity \n\n  \\- HACK Cybersecurity \n\n  \\- TPAY Financials\n\n  \\- ARKF Financial Technology\n\n  \\- IPAY Financial Services\n\n  \\- DFNL Banking Services\n\n  \\- SOXX Semiconductors\n\n  \\- IYT Railroad \n\n  \\- POTX Cannabis \n\n  \\- BOTZ Automation \n\n&amp;#x200B;\n\nThese are selections of industries I would like to generally participate in or bolster current investments.\n\nThe ETF &amp; Asset Amplification is a group of industries I would like to factor uncertainties for or better capture. I will not be able to determine Cannabis leaders in 2023, for example. A lot of these ETFs fall under \"I'm not sure if some unknown player will suddenly rise 3 years from now in this industry\".\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86098011-64489700-ba6a-11ea-846a-0816cd3755b8.png](https://user-images.githubusercontent.com/37036296/86098011-64489700-ba6a-11ea-846a-0816cd3755b8.png))",
        "subreddit": "stocks",
        "title": "My Portfolio Restructure - Mexican American Investment Decisions",
        "url": "https://www.reddit.com/r/stocks/comments/hjs32p/my_portfolio_restructure_mexican_american/",
        "created": 1593701257.0
    },
    {
        "author": "notbrokemexican",
        "created_utc": 1593672288,
        "id": "hjs1sp",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "# Note: for a better reading experience, please use the link to view a Markdown version of this file with images. The text version is below. It also includes research into KSU &amp; Cloudflare (also in my profile)\n\n [https://github.com/Sheilf/Investment-Research](https://github.com/Sheilf/Investment-Research)\n\n&amp;#x200B;\n\n# # Disclaimer \n\nI am very familiar with The Effecient Market Hypothesis. I use it for my retirement investments.\n\nI am using a mixture of influences from Renaissance Technologies &amp; John Neumann's Game Theory.\n\n&amp;#x200B;\n\nThis is **MY** strategy as my investment goals and motivations are most likely far different than yours. I use a mixture of options when I have really high confidence in my economic model (as evidence by holding through dips).\n\n&amp;#x200B;\n\nI started investing in February and aggressively purchased stocks in Facebook, Paypal, and Cloudflare.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86323590-f333eb80-bbf1-11ea-977b-f3df91980417.png](https://user-images.githubusercontent.com/37036296/86323590-f333eb80-bbf1-11ea-977b-f3df91980417.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# The Case For Mexican-American Investments\n\nI'm building a portfolio that revolves around developing the post-covid economic restructuring. The overarching theme behind these picks is **American Innovation &amp; Mexican Development.** \n\nI'm a 26 year old fintech engineer in the US and an avocado farmer in Mexico and I hold a strong conviction that investing in Mexican development will reward me well in the decades to come.  \n\n**In a nutshell, the USMCA is a 1 trillion dollar trade restructuring and my strategy favors the Texas-Nuevo Leon economy and overall Mexican-American trade.**\n\n&amp;#x200B;\n\nHere is Monterrey, Nuevo Leon\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86219352-ec946e00-bb36-11ea-9fc3-b17c9e5b0597.png](https://user-images.githubusercontent.com/37036296/86219352-ec946e00-bb36-11ea-9fc3-b17c9e5b0597.png))\n\n \n\nI'm from a rural village south of Jalisco which produces far more agricultural goods like avocados alongside Michoacan.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86219771-7e9c7680-bb37-11ea-98b2-7e8c2833d99a.png](https://user-images.githubusercontent.com/37036296/86219771-7e9c7680-bb37-11ea-98b2-7e8c2833d99a.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nI am very aware of the problems that Mexico faces but I also view Mexico as a sleeping giant that the US utilizes for capital efficiency in global trade. Mexico is part of a puzzle that fits in a large scope that involves other bulwark nations like Germany, Japan, Brazil, and India.\n\n&amp;#x200B;\n\n!\\[Bulwark Trading Nations\\]([https://user-images.githubusercontent.com/37036296/86080247-51709b00-ba47-11ea-8d38-54da06916f57.png](https://user-images.githubusercontent.com/37036296/86080247-51709b00-ba47-11ea-8d38-54da06916f57.png))\n\n&amp;#x200B;\n\n!\\[The North American Trade Block\\]([https://preview.redd.it/c4ej9hcrki751.png?width=638&amp;format=png&amp;auto=webp&amp;s=0062950618749d315101fb97d09237db961e2d40](https://preview.redd.it/c4ej9hcrki751.png?width=638&amp;format=png&amp;auto=webp&amp;s=0062950618749d315101fb97d09237db961e2d40))\n\n&amp;#x200B;\n\nAt the same time, Mexico is a nation in crisis. The economic damage narcotrafficking has delivered has resulted in:\n\n\\- \\[An increasing black market integration into the global money supply, in the order of hundreds of billions of dollars, resulting in a growing vacuum of theft AKA the Drug War &amp; Economics of Peace\\]([https://en.wikipedia.org/wiki/Bank\\_Secrecy\\_Act#Sanctions](https://en.wikipedia.org/wiki/Bank_Secrecy_Act#Sanctions))\n\n\\- North American suppressed wage suppression\n\n\\- refugee style illegal immigration\n\n\\- NA workforce morale decrease\n\n\\- Mexican workforce morale decrease\n\n\\- A Mexican workforce and brain drain, as skilled and motivated laborers leave for opportunity and better pay who are loyal to both nations\n\n\\- Multiple events of civil unrest or civil disasters\n\n&amp;#x200B;\n\n\\- National cyncism against the current administration\n\n&amp;#x200B;\n\nI see this as a complex problem where most people's perspective is not complete or clouded by one of the reasons above. I hold admittedly extreme views toward this problem and I understand people's need to debate this. Half of my life is in Mexico and it's something has been omnipresent in my life. I have seen the military police the roads, I've seen fire fights, the robbery, the vigilante justice, and so on. My parents were robbed. My mother was threatened with rape. My dog was almost killed. It's something omnipresent.\n\n&amp;#x200B;\n\n\\- I believe that all drugs should be legalized and nations like Colombia are headed in the right direction.\n\n\\- I believe the path won't be clear but a solution must come in the following decades.\n\n\\- I  believe an important element to this solution is the integration of American technology &amp; innovation that will increase the industry standards of Mexico's workforce.\n\n\\- I believe that American integration will force increases in legal and regulatory body requirements like the compliance procedures required behind and American financial technology app like Square or Paypal. The PATRIOT act is omnipresent in trade, regardless of your opinion.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nThere are other major factors at play here.\n\n\\- Advanced education in Mexico is accelerating with International partnerships.\n\n\\- The USMCA is a 1 trillion dollar trade restructuring.\n\n\\- Mexico is rapidly developing its English speaking workforce\n\n\\- Mexico is positioned to be deeply invested and coupled to American economics.\n\n\\- Trump and AMLO are cooperative (Economics of Peace).\n\n&amp;#x200B;\n\nIn the end, I don't believe that the economics of the black market and drug trade will succeed in the continued suppression of the Mexican economy. It is certainly in a golden era of sorts, and Mexico reflects as a nation in decline.\n\n&amp;#x200B;\n\n\\# The Economic Framework\n\nI am selecting industries that:\n\n&amp;#x200B;\n\n\\- Empower the US and have a rippling effect on Mexico\n\n\\- Will fundamentally continue to build and grow the future global supply\n\n\\- Are friendly to primarily German/Euro and Japanese/Asian trade.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# My Portfolio Structure\n\nThere are two systems at play at the same time.\n\n&amp;#x200B;\n\nThe 12 Primary Asset Collection - these are stocks I regularly invest in.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86082755-62bca600-ba4d-11ea-8857-95e902f8d0ce.png](https://user-images.githubusercontent.com/37036296/86082755-62bca600-ba4d-11ea-8857-95e902f8d0ce.png))\n\n&amp;#x200B;\n\nThe 12 Competitor Arenas (Cloud Infrastructure Group) - these are stocks that are competing for Primary Asset Allocation each quarter and receive less allocation.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86082923-c3e47980-ba4d-11ea-9543-b31eb000962d.png](https://user-images.githubusercontent.com/37036296/86082923-c3e47980-ba4d-11ea-9543-b31eb000962d.png))\n\n&amp;#x200B;\n\n\\- I own 12 primary companies. These are the companies that I believe satisfy a certain economic condition with respects to their industry group.\n\n**- These stocks are always in competition with other high quality competitors in the realms I determine.**\n\n**- They are also industries that I want to see grow (which is why I invest in them).**\n\n**-  I'm not always going for min-max profit.**\n\n&amp;#x200B;\n\nExample of Competition\n\n&amp;#x200B;\n\n**Augmented Reality Group**\n\n*Economic Condition*: The Augmented Reality Group are companies whos core products are AR-enhanced and have sufficient power for cultural impacts.\n\n&amp;#x200B;\n\nIn this case, Facebook would be my primary asset of this group. (discussed in selection breakdown)\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86082479-b67abf80-ba4c-11ea-815f-b2a84494c3fe.png](https://user-images.githubusercontent.com/37036296/86082479-b67abf80-ba4c-11ea-815f-b2a84494c3fe.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86082507-cd211680-ba4c-11ea-89d1-29bbedb75995.png](https://user-images.githubusercontent.com/37036296/86082507-cd211680-ba4c-11ea-89d1-29bbedb75995.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nI generally try to exercise these rules and concepts in my framework\n\n\\- Applications of common sense\n\n\\- Applications of game theory\n\n\\- Strongly positive relationships or increasing economic need\n\n\\- Modesty in asset allocation over aggression\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# Primary Group Breakdown\n\n&amp;#x200B;\n\nMy Preallocated Selection vs \\[SPY, NASDAQ, VOO\\]\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86091181-4bd37f00-ba60-11ea-9abe-fdbf8c48933e.png](https://user-images.githubusercontent.com/37036296/86091181-4bd37f00-ba60-11ea-9abe-fdbf8c48933e.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86091330-91904780-ba60-11ea-8660-2e2d0ea32dc0.png](https://user-images.githubusercontent.com/37036296/86091330-91904780-ba60-11ea-8660-2e2d0ea32dc0.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86091365-a66cdb00-ba60-11ea-9a5f-60e5cb06b0be.png](https://user-images.githubusercontent.com/37036296/86091365-a66cdb00-ba60-11ea-9a5f-60e5cb06b0be.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86091414-bb496e80-ba60-11ea-8822-c8a65bba83c6.png](https://user-images.githubusercontent.com/37036296/86091414-bb496e80-ba60-11ea-8822-c8a65bba83c6.png))\n\n&amp;#x200B;\n\nAs you can image, if I allocate too many resources to competitors, my investments become more inline with NASDAQ growth.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86091694-2eeb7b80-ba61-11ea-9afb-c8abd3c2459f.png](https://user-images.githubusercontent.com/37036296/86091694-2eeb7b80-ba61-11ea-9afb-c8abd3c2459f.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nPrimary Assets at a glance\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86085632-6dc70480-ba54-11ea-9d3c-a665fba9ac50.png](https://user-images.githubusercontent.com/37036296/86085632-6dc70480-ba54-11ea-9d3c-a665fba9ac50.png))\n\n&amp;#x200B;\n\n\\- Capitalist Monkey Casino Group\n\n  \\- These stocks are my bucket of sinful allocations when my monkey brain loses control and takes over or when America does some crazy shit.\n\n&amp;#x200B;\n\n\\- Augmented Reality\n\n  \\- The Augmented Reality Group are companies whos core products are AR-advantaged and sufficient power for cultural impacts.\n\n&amp;#x200B;\n\n\\- Financial Access\n\n  \\- The Financial Access Group is concerned with the lowering barriers to banking &amp; financial utilization.\n\n&amp;#x200B;\n\n\\- Cloud Infrastructure\n\n  \\-  The Cloud Infrastructure Group focuses on stabilizing and advancing network speeds &amp; security in cloud systems.\n\n&amp;#x200B;\n\n\\- Power Systems\n\n  \\- The Power Systems Group is concerned with the development of alternate energy systems to power the supply chain.\n\n&amp;#x200B;\n\n\\- Consumer Supply\n\n  \\- The Consumer Supply Group focuses on the happiness of customer at transaction time and the ability to scale that customer satisfaction\n\n&amp;#x200B;\n\n\\- Cloud Services\n\n  \\- The Cloud Services Group are inelastic products that will either be consumed by larger industry or will continue to pioneer new demands.\n\n \n\n\\- Machine Learning\n\n  \\- The ML Group are companies whos core products are significantly advantaged by AI/ML.\n\n&amp;#x200B;\n\n\\- Semiconductors\n\n  \\- The Semiconductors Group focuses on the lowering barriers to advanced technology and computing.\n\n&amp;#x200B;\n\n\\- Industry\n\n  \\- The Industry Group works on material development  and business exchanges of US and Mexico.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\- Industrial Robotics\n\n  \\- The Industrial Robotics Group focuses on the increasing automation of labor.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\- Network Infrastructure\n\n  \\- The Network Infrastructure Group focuses on the expansion of telecom services in the Americas.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\- ETF Diversification &amp; Asset Amplification\n\n  \\- These are selections of industries I would like to generally participate in or bolster current investments.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nTotal assets at a glance (ETFs Excluded)\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86090992-fb5c2180-ba5f-11ea-988f-f21f771aaaf7.png](https://user-images.githubusercontent.com/37036296/86090992-fb5c2180-ba5f-11ea-988f-f21f771aaaf7.png))\n\n&amp;#x200B;\n\n\\# Monkey Capitalist Casino\n\n\\- SPCE\n\n  \\- DKNG\n\n  \\- IPO ETF\n\n  \\- Dennys\n\n  \\- Bitcoin/BAT\n\n&amp;#x200B;\n\nThese stocks are my bucket of sinful allocations when my monkey brain loses control and takes over or when America does some crazy shit. I dont hold any of these right now.\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86098091-7e827500-ba6a-11ea-80be-7e73e6557326.png](https://user-images.githubusercontent.com/37036296/86098091-7e827500-ba6a-11ea-80be-7e73e6557326.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86098154-92c67200-ba6a-11ea-9c4c-17aef3908461.png](https://user-images.githubusercontent.com/37036296/86098154-92c67200-ba6a-11ea-9c4c-17aef3908461.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86098173-99ed8000-ba6a-11ea-9ea8-f691393683c1.png](https://user-images.githubusercontent.com/37036296/86098173-99ed8000-ba6a-11ea-9ea8-f691393683c1.png))\n\n&amp;#x200B;\n\n\\# Augmented Reality Group\n\n**- FACEBOOK**\n\n  \\- Adobe\n\n  \\- Apple\n\n  \\- Nintendo\n\n  \\- Disney\n\n&amp;#x200B;\n\n*The Augmented Reality Group are companies with a vested interest in AR products and sufficient power for cultural impacts.*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86095490-d5864b00-ba66-11ea-8d32-bed356fb47ba.png](https://user-images.githubusercontent.com/37036296/86095490-d5864b00-ba66-11ea-8d32-bed356fb47ba.png))\n\n&amp;#x200B;\n\n\\- Facebook's outreach is unmatched. It currently takes priority in this group and it will maintain its position if Facebook can deliver and execute on e-commerce and small business support in the US, India, and Latin America through WhatsApp, FB, and Instragram Camera Commerce features. Their integration with Walmart, Rio, and Shopify was wise and will be my test to see if it can really master its scale. FB has also done incredible work in networking speeds on their product and has an excellent web kit with React, React Native, GraphQL, and more.\n\n&amp;#x200B;\n\n\\- Apple and Adobe have a tight and powerful relationship and are deeply integrated into various markets ranging from gaming studio development, marketing data, computer vision, and chip manufacturing.\n\n&amp;#x200B;\n\n\\- Disney and Nintendo are closer to defensive stocks as they are deeply integrated with unmatched branding in childhood &amp; families.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86090855-b6d08600-ba5f-11ea-87bf-a2c42b3e353b.png](https://user-images.githubusercontent.com/37036296/86090855-b6d08600-ba5f-11ea-87bf-a2c42b3e353b.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86090889-c8b22900-ba5f-11ea-8d20-4b3195076a00.png](https://user-images.githubusercontent.com/37036296/86090889-c8b22900-ba5f-11ea-8d20-4b3195076a00.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# Machine Learning Group\n\n**- MICROSOFT**\n\n  \\- Google\n\n  \\- Tesla\n\n **The ML Group are companies who's core products are significantly advantaged by AI/ML.**\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86094462-69571780-ba65-11ea-91a8-79e523085204.png](https://user-images.githubusercontent.com/37036296/86094462-69571780-ba65-11ea-91a8-79e523085204.png))\n\n&amp;#x200B;\n\n\\- I'm excited to see Microsoft's software automation advancements across various tools ranging from Excel, internal Windows hardware management, to developer workflow solutions. I believe this move will separate them from the rest when it comes to long-form competitions of cloud computing and network optimizing.\n\n&amp;#x200B;\n\n\\- Google is a close second as they are already distributing ML solutions through Google Cloud Platform &amp; has extensive reach across various industries with LIDAR simulations, adtech, and an unholy amount of data. I fear Google's reach into too many markets, similar to Amazon.\n\n&amp;#x200B;\n\n\\- Tesla is an interesting use case as they do not rely on software simulations as much as Waymo or other ambitious mobility startups. I believe this will lead them to discover some really robust ML applications in their time investigate power management and secure driving solutions.\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86094391-4c224900-ba65-11ea-90f7-f2b7a5e021fd.png](https://user-images.githubusercontent.com/37036296/86094391-4c224900-ba65-11ea-90f7-f2b7a5e021fd.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86094423-593f3800-ba65-11ea-8f28-99dd6eae97dc.png](https://user-images.githubusercontent.com/37036296/86094423-593f3800-ba65-11ea-8f28-99dd6eae97dc.png))\n\n&amp;#x200B;\n\n\\# Financial Access Group\n\n\\- \\*\\*PAYPAL\\*\\*\n\n  \\- Square\n\n  \\- Visa\n\n&amp;#x200B;\n\n\\*\\*The Financial Access Group is concerned with the lowering barriers to banking &amp; transaction infrastructure.\\*\\*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86095710-2f871080-ba67-11ea-8965-f3e2b99c821e.png](https://user-images.githubusercontent.com/37036296/86095710-2f871080-ba67-11ea-8965-f3e2b99c821e.png))\n\n&amp;#x200B;\n\n\\- Paypal has a really interesting history as a pioneer in the payment processing business. I'm really excited to see what they can do with their Honey acquisition in relation to e-commerce and Amazon commerce. Paypal also has an enormous catalog of services ranging from small business support to remittance sending.\n\n&amp;#x200B;\n\n\\- I believe it's a mistake to underestimate Square with respects to the younger generation who is enters the global market primarily through technology these days. Cash App is wonderfully designed, educational, chartered as a bank, and has a clear path forward as a financial services integrations. It can prove to be a valuable competitor to Paypal.\n\n&amp;#x200B;\n\n\\- Visa is the fingerprint into the banking system. They were wise to respect blockchain technology early and is an extremely trusted brand which has infinite value in the financial world. Visa grows with each transaction.\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86095751-3ca3ff80-ba67-11ea-9e2d-1d111f081948.png](https://user-images.githubusercontent.com/37036296/86095751-3ca3ff80-ba67-11ea-9e2d-1d111f081948.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86095793-4a598500-ba67-11ea-9826-6e9832fae0a3.png](https://user-images.githubusercontent.com/37036296/86095793-4a598500-ba67-11ea-9826-6e9832fae0a3.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# Semiconductors Group\n\n\\- \\*\\*TEXAS INSTRUMENTS\\*\\*\n\n  \\- AMD\n\n  \\- Nvidia\n\n&amp;#x200B;\n\n  \\*\\*The Semiconductors Group focuses on the lowering barriers to advanced technology and computing.\\*\\*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86096614-5a259900-ba68-11ea-91d9-ce4772d51dda.png](https://user-images.githubusercontent.com/37036296/86096614-5a259900-ba68-11ea-91d9-ce4772d51dda.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\- I have selected TI to lead for now as TI is found in just about anything ranging from Tesla dashboards to NASA rockets. TI is also important with respects to the Texas-Nuevo Leon model that I have written about that prioritizes Texas and Mexican growth potential. \n\n&amp;#x200B;\n\n\\- Nvidia is obviously a pioneer and leader in AI, cloud computing, and much more like GPU distribution. \n\n&amp;#x200B;\n\n\\- AMD has destabilized my perspective and this may be their opportunity to stick their growth. They have done remarkable work in the cloud computing and energy/cost reduction space.\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86096791-9953ea00-ba68-11ea-8db0-cfabf5983cf8.png](https://user-images.githubusercontent.com/37036296/86096791-9953ea00-ba68-11ea-8db0-cfabf5983cf8.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86096754-8c36fb00-ba68-11ea-8cdd-0715fe057975.png](https://user-images.githubusercontent.com/37036296/86096754-8c36fb00-ba68-11ea-8cdd-0715fe057975.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# Cloud Infrastructure Group\n\n\\- \\*\\*CLOUDFLARE\\*\\*\n\n  \\- Fastly \n\n  \\- Z-Scaler\n\n  \\- Akamai\n\n&amp;#x200B;\n\n \\*\\*The Cloud Infrastructure Group focuses on stabilizing and advancing network speeds&amp; security in cloud systems.\\*\\*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86096907-c3a5a780-ba68-11ea-9e2e-f53455bfc172.png](https://user-images.githubusercontent.com/37036296/86096907-c3a5a780-ba68-11ea-9e2e-f53455bfc172.png))\n\n&amp;#x200B;\n\n\\- Cloudflare is selected for its ability to bring down price and grow infrastructure from the inside out. It's a riskier approach. I'm really excited to see their future prospects growing video streaming infrastructure and their path of distributing privacy &amp; security. They take the beacon of American privacy ideals to emerging markets.\\[ I have more extensive research on Cloudflare, CDNs, and cloud computing here.\\]([https://www.reddit.com/r/wallstreetbets/comments/h7x4l6/cloudflare\\_net\\_dd\\_cloud\\_infrastructure\\_security/](https://www.reddit.com/r/wallstreetbets/comments/h7x4l6/cloudflare_net_dd_cloud_infrastructure_security/))\n\n&amp;#x200B;\n\n\\- Fastly is an excellent product that optimizes media delivery in the network. I believe Fastly is most likely to compete with the likes of Akamai in their respective CDN space.\n\n&amp;#x200B;\n\n\\- Z-Scaler turns toward more industrial clients, gathering partners in energy, supply chain, manufacturing, and more. I think this is an underrated aspect to current cloud computing discussions. The security of networks that protect expensive industrial machines will be critically important when production speeds are extremely rapid between competitors.\n\n&amp;#x200B;\n\n\\- Akamai of course is the giant of the CDN space. I believe AKamai will also continue to grow in a much healthier manner in comparison to stocks like Fastly over the long term.\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86096938-d15b2d00-ba68-11ea-8a8d-eba84d2008e8.png](https://user-images.githubusercontent.com/37036296/86096938-d15b2d00-ba68-11ea-8a8d-eba84d2008e8.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86096958-dd46ef00-ba68-11ea-8f20-831af8f0a4a2.png](https://user-images.githubusercontent.com/37036296/86096958-dd46ef00-ba68-11ea-8f20-831af8f0a4a2.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# Cloud Services Group\n\n\\- \\*\\*DOCUSIGN\\*\\*\n\n  \\- Twitter\n\n  \\- Chegg\n\n  \\- Dropbox\n\n  \\- Lyft\n\n  \\- 1Life Medical\n\n  \\- Upwork\n\n  \\- Autodesk\n\n  \n\n \\*\\*The Cloud Services Group are inelastic distributed products.\\*\\* \n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097036-f64fa000-ba68-11ea-9a8c-07f2e0b06e68.png](https://user-images.githubusercontent.com/37036296/86097036-f64fa000-ba68-11ea-9a8c-07f2e0b06e68.png))\n\n&amp;#x200B;\n\nThis is a large set of stocks, so it doesn't receive as much allocation, with the exception of DocuSign. I believe all of these companies are robust technologies that can receive modest investments over time. This asset group will likely see more changes for the primary spot than others.\n\n&amp;#x200B;\n\n\\- DocuSign is the current speculation as it can acquire stickiness through its legal procurements. I believe legal procurements is a necessary industry that will be amplified by cross-border trade.\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097076-036c8f00-ba69-11ea-92c0-b8e7fcf70d73.png](https://user-images.githubusercontent.com/37036296/86097076-036c8f00-ba69-11ea-92c0-b8e7fcf70d73.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097128-141d0500-ba69-11ea-867a-f7d404b5e6f3.png](https://user-images.githubusercontent.com/37036296/86097128-141d0500-ba69-11ea-867a-f7d404b5e6f3.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# Network Infrastructure Group\n\n\\- \\*\\*CROWN CASTLE INTERNATIONAL (REIT)\\*\\*\n\n  \\- T-Mobile\n\n  \\- America Movil\n\n&amp;#x200B;\n\n\\*\\*The Network Infrastructure Group focuses on the expansion of telecommunications across the US and Mexico.\\*\\* \n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097290-462e6700-ba69-11ea-9159-b1e5106bd07a.png](https://user-images.githubusercontent.com/37036296/86097290-462e6700-ba69-11ea-9159-b1e5106bd07a.png))\n\n&amp;#x200B;\n\n\\- CCI is the largest telecom network in the US that is headquartered in the US. It funnels much of the transmission of many ISPs.\n\n&amp;#x200B;\n\n\\- I really love T-Mobile's tech friendly CEO and approach to accessibility and customer experience. I think this will deliver in spades when Mexican markets grow.\n\n&amp;#x200B;\n\n\\- America Movil is Mexico's telecom and Mexico's largest company by market cap.\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097322-52b2bf80-ba69-11ea-9b37-88fa0bf3cb9e.png](https://user-images.githubusercontent.com/37036296/86097322-52b2bf80-ba69-11ea-9b37-88fa0bf3cb9e.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097351-5e05eb00-ba69-11ea-9e64-03ab766e9e3a.png](https://user-images.githubusercontent.com/37036296/86097351-5e05eb00-ba69-11ea-9e64-03ab766e9e3a.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# Power Systems Group\n\n\\- \\*\\*PANASONIC\\*\\*\n\n  \\- Vestas\n\n  \\- Plug Power\n\n  \\- Siemens\n\n&amp;#x200B;\n\n\\*\\*The Power Systems Group focuses on the growth of alternative energy systems.\\*\\*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097422-7bd35000-ba69-11ea-9082-687bec03cbe5.png](https://user-images.githubusercontent.com/37036296/86097422-7bd35000-ba69-11ea-9082-687bec03cbe5.png))\n\n&amp;#x200B;\n\n\\- Panasonic has ventures in multiple energy systems but has exciting potential on healthy partnerships with Tesla, Toyota, and other large automotive groups. These are also organizations that manufacture in Mexico.\n\n&amp;#x200B;\n\n\\- Vestas has pioneered sales of wind energy systems and may prove valuable during infrastructure and energy restructures.\n\n&amp;#x200B;\n\n\\- Plug Power is focused on hydrogen fuel which complements battery systems in technologies like forklifts or last-mile delivery trucks.\n\n&amp;#x200B;\n\n\\- Siemens is an provider from Germany that is well integrated in Mexican &amp; Texas-Monterrey development.\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097453-8857a880-ba69-11ea-8e1b-d7ec4eade982.png](https://user-images.githubusercontent.com/37036296/86097453-8857a880-ba69-11ea-8e1b-d7ec4eade982.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097475-93aad400-ba69-11ea-9087-4e6260a77b68.png](https://user-images.githubusercontent.com/37036296/86097475-93aad400-ba69-11ea-9087-4e6260a77b68.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# Industry Group\n\n\\- \\*\\*KANSAS CITY SOUTHERN\\*\\*\n\n  \\- Berkshire.B\n\n  \\- XLB Materials ETF\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\*\\*The Industry Group works on material development and business exchanges of US and Mexico.\\*\\* \n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097528-a7eed100-ba69-11ea-89ff-455192cfa52c.png](https://user-images.githubusercontent.com/37036296/86097528-a7eed100-ba69-11ea-89ff-455192cfa52c.png))\n\n&amp;#x200B;\n\n\\[I got into the strategic advantage behind Kansas City Southern Rail here.\\]([https://www.reddit.com/r/wallstreetbets/comments/hh1t4k/all\\_aboard\\_the\\_trump\\_train\\_kansas\\_city\\_southern/](https://www.reddit.com/r/wallstreetbets/comments/hh1t4k/all_aboard_the_trump_train_kansas_city_southern/)) It is an important Class-I railroad that connects through Mexico, Texas, and the American Midwest.\n\n&amp;#x200B;\n\n\\- Berkshire.B is a business selector that invests in other sectors like Financials and value assement.\n\n&amp;#x200B;\n\n\\- XLB is a group of industries that produce materials standards, chemicals, paint, and other low-level materials.\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097559-b50bc000-ba69-11ea-92e9-67cce9bfeeb9.png](https://user-images.githubusercontent.com/37036296/86097559-b50bc000-ba69-11ea-92e9-67cce9bfeeb9.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097610-c1901880-ba69-11ea-9a8b-2cf581ff8f13.png](https://user-images.githubusercontent.com/37036296/86097610-c1901880-ba69-11ea-9a8b-2cf581ff8f13.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# Industrial Robotics Group \n\n\\- \\*\\*FANUC\\*\\*\n\n  \\- ABB\n\n  \\- Rockwell Automation\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\*\\*The Industrial Robotics group focuses on the increasing automation of labor.\\*\\*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097654-d371bb80-ba69-11ea-93a6-08e88dc1c89f.png](https://user-images.githubusercontent.com/37036296/86097654-d371bb80-ba69-11ea-93a6-08e88dc1c89f.png))\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097684-dff61400-ba69-11ea-813d-4750b876bb07.png](https://user-images.githubusercontent.com/37036296/86097684-dff61400-ba69-11ea-813d-4750b876bb07.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097712-ebe1d600-ba69-11ea-80b1-84babc271968.png](https://user-images.githubusercontent.com/37036296/86097712-ebe1d600-ba69-11ea-80b1-84babc271968.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# Consumer Supply Group\n\n\\- \\*\\*COSTCO\\*\\*\n\n  \\- Amazon\n\n  \\- Shopify\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\*\\*The Consumer Supply has a similar focuses on customer satisfaction during purchase time.\\*\\*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097793-09af3b00-ba6a-11ea-87a1-0f734225a821.png](https://user-images.githubusercontent.com/37036296/86097793-09af3b00-ba6a-11ea-87a1-0f734225a821.png))\n\n&amp;#x200B;\n\n\\- I view Costco as the leader in customer satisfaction at purchase time. I believe their business model and product selection process can be replicated in places like Mexico and continue its success without much disruption. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\- Shopify is and a leader in small business opportunities.  Their partnership with Facebook and Walmart was an extremely wise choice given their momentum, which is also massively popular in Mexico.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\- Amazon is also a pioneer in customer satisfaction with 2-day delivery. I'm unsure how this will execute over a long period of time in a country like Mexico, where truck traversal is quite dangerous and ineffecient. They also compete with regional players like Mercado Libre.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097809-12077600-ba6a-11ea-83fe-fd597b559148.png](https://user-images.githubusercontent.com/37036296/86097809-12077600-ba6a-11ea-83fe-fd597b559148.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86097834-1a5fb100-ba6a-11ea-8066-87c16ba590fd.png](https://user-images.githubusercontent.com/37036296/86097834-1a5fb100-ba6a-11ea-8066-87c16ba590fd.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# ETF Diversification &amp; Asset Amplification\n\n\\- \\*\\*SPY\\*\\*\n\n  \\- EWW Mexico \n\n  \\- FIVG 5g \n\n  \\- IPO Startup \n\n  \\- WCLD Cloud \n\n  \\- ESPO Gaming\n\n  \\- CIBR Cybersecurity \n\n  \\- HACK Cybersecurity \n\n  \\- TPAY Financials\n\n  \\- ARKF Financial Technology\n\n  \\- IPAY Financial Services\n\n  \\- DFNL Banking Services\n\n  \\- SOXX Semiconductors\n\n  \\- IYT Railroad \n\n  \\- POTX Cannabis \n\n  \\- BOTZ Automation \n\n&amp;#x200B;\n\nThese are selections of industries I would like to generally participate in or bolster current investments.\n\nThe ETF &amp; Asset Amplification is a group of industries I would like to factor uncertainties for or better capture. I will not be able to determine Cannabis leaders in 2023, for example. A lot of these ETFs fall under \"I'm not sure if some unknown player will suddenly rise 3 years from now in this industry\".\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/86098011-64489700-ba6a-11ea-846a-0816cd3755b8.png](https://user-images.githubusercontent.com/37036296/86098011-64489700-ba6a-11ea-846a-0816cd3755b8.png))",
        "subreddit": "stocks",
        "title": "My Portfolio Restructure - Mexican-American Investment Decisions",
        "url": "https://www.reddit.com/r/stocks/comments/hjs1sp/my_portfolio_restructure_mexicanamerican/",
        "created": 1593701088.0
    }
]