[
    {
        "author": "kjulianthelemur",
        "created_utc": 1604331856,
        "id": "jmpsji",
        "num_comments": 178,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "options",
        "title": "fidelity no longer lets small accounts buy options that expire on that date",
        "url": "https://www.reddit.com/r/options/comments/jmpsji/fidelity_no_longer_lets_small_accounts_buy/",
        "created": 1604360656.0
    },
    {
        "author": "InvestingNerd2020",
        "created_utc": 1604276755,
        "id": "jmdfg1",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "I'm stuck in my ways with Charles Schwab, and a lit.tle bit with  Fidelity.  However, I have younger relatives finishing high school soon and Sofi is making a competitve case rivht now for best new investing platform ( not for day trader nor option traders).  Below is a list of their services.  What are your thoughts on it?\n\nSofi services:\n- Fractional shares for all stocks &amp; ETFs.\n\n- IRA accounts (Uses a weird name for IRA)\n\n- Automatic rebalancing\n\n- Learning materials\n\n- Crypto currency \n\n- 2% unlimited cashback credit card with World elite benefits.\n\n- Cash management account with a great debit card for world travelers.\n\n- Get free financial advice.\n\n- Get a will and estate planning for free.  It usually costs hundred or thousands of dollars.",
        "subreddit": "investing",
        "title": "Will Sofi become the new Robinhood for 2020 decade for generation Z?",
        "url": "https://www.reddit.com/r/investing/comments/jmdfg1/will_sofi_become_the_new_robinhood_for_2020/",
        "created": 1604305555.0
    },
    {
        "author": "jmr106",
        "created_utc": 1604296441,
        "id": "jmi57m",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Can someone buy hundreds of thousands or millions at once, for instance? The most I have bought of a penny stock so far have been 60,000 shares at once. I know that Fidelity Roth IRA limits how many shares you can buy at once because (the rep on the phone told me) \"buying that many affects the share price quickly\"....but TD Ameritrade lets me buy seemingly whatever. Anyone know from experience?",
        "subreddit": "pennystocks",
        "title": "Out of curiosity, is there a limit to how many shares of a microcap or penny stock can be purchased?",
        "url": "https://www.reddit.com/r/pennystocks/comments/jmi57m/out_of_curiosity_is_there_a_limit_to_how_many/",
        "created": 1604325241.0
    },
    {
        "author": "Rkpandey123",
        "created_utc": 1604299659,
        "id": "jmis5i",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "I am 22 and just started working in one of the top technology companies in the world.\n\nI have never bought any Indian or Foreign stocks before. But I am given stocks of the company that I am working for (which is listed on NASDAQ) through ESOP and ESPP in a fidelity account opened by the company. However, I cant see the option of buying any other stock from the Fidelity account that is given to me (maybe I need to sign up for it somewhere else?). \n\nPlease help! Also, I want to know what are the gotchas, as in deductions or something associated with trading with the forex.\n\nMany people have suggested to me in the past that I should focus on investing in the Indian market instead of the foreign market. My argument is that the stocks that I am mostly interested in (and know more about) are technology companies out of India.\n\nThank you.",
        "subreddit": "stocks",
        "title": "How can I invest in forex as an Indian and are there any gotchas?",
        "url": "https://www.reddit.com/r/stocks/comments/jmis5i/how_can_i_invest_in_forex_as_an_indian_and_are/",
        "created": 1604328459.0
    }
]