[
    {
        "author": "rgpace5",
        "created_utc": 1577930844,
        "id": "eirlng",
        "num_comments": 49,
        "num_crossposts": 0,
        "selftext": "When people discuss companies that will benefit from the introduction of 5G the same companies seem to come up...Apple, Qualcomm, Nokia, Ericcson, etc.\n\nPeople usually list companies providing the infrastructure for 5G,5G carriers like AT&amp;T or device companies like Apple. If you look at the companies that have benefited the most from increases WIFI and mobile internet speeds over the last decade it has been companies like Netflix, who have used advances in technology to disrupt traditional markets.\n\nThe effects have also been seen in cloud computing with Amazon and Microsoft, and advertising with Google/Amazon (faster networks/easier access = more searches)\n\nOver the next decade there will certainly be companies who leverage 5G to deepen their competitive advantages or new companies that emerge that will disrupt current markets. I would say remote health care might be an example of this,or companies that utilize increased speeds to monetize AI\n\nWhich companies do you all feel fit this description that you're holding for the long term (5 to 10 years and more)",
        "subreddit": "stocks",
        "title": "Companies that will benefit from 5G indirectly",
        "url": "https://www.reddit.com/r/stocks/comments/eirlng/companies_that_will_benefit_from_5g_indirectly/",
        "created": 1577959644.0
    },
    {
        "author": "Zonties",
        "created_utc": 1578096647,
        "id": "ejobq4",
        "num_comments": 46,
        "num_crossposts": 0,
        "selftext": "So, 2019 was a bit of a rocky year. I started off making an immense amount of money, lost all of my gain shorting Qualcomm on news of their apple settlement in April.  Took me months to recover, but I got stupid towards the end of the year shorting apple, thinking it HAD to go down and constantly in denial. Big share counts too. like 5 to 10000 shares short day trading\n\nThere would be enormous sums of trades to show in the whole account- but I did much better, ironically, in my account where I only day traded options.\n\nMy biggest lessons: cut the loss quickly.  Don't wait, don't guess. If I had done this, i would be much more green.\n\nLesson two: don't let a bias overrule you. I did this w apple towards the end of the year. Fortunately I did not get carried away and start buying puts as it was going up too. CNBC pushed it higher , and I ignored this. I could have easily flipped the trade.\n\nLesson three: listen to your instincts.  Don't get flustered or become a deer in headlights. I repeated these errors again on numerous occasions. Do not become fixated on a past price where you may have had a paper profit. Stock doesn't care about prior levels.\n\nAlso, I noticed the increasing effects cnbc can have on stocks. Lower float unusual options plays, and the time I lost on apple they kept talking of a super cycle.  This just caused me to lost 40k on a short in one day. I could have covered much sooner.\nNot a terrible year, but I repeated these mistakes more times than I should have.\n\nResults below:\n\nhttps://ibb.co/mJM6SzQ\n\nhttps://ibb.co/Qjxf026",
        "subreddit": "wallstreetbets",
        "title": "Real day trading results for 2019",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ejobq4/real_day_trading_results_for_2019/",
        "created": 1578125447.0
    },
    {
        "author": "clevelandtillidie90",
        "created_utc": 1577995997,
        "id": "ej3ind",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Hypothetically, using $5000 for long-term investments, where would you put your money? These are what I've been looking at:\n\n* Brookfield Infrastructure Partners (BIP)\n* iShares (DGRO)\n*  Vanguard Dividend (VIG)\n* Ingersoll Rand (IR)\n* Qualcom (QCOM)\n* American Water Works (AWK)",
        "subreddit": "StockMarket",
        "title": "Where would you put your money?",
        "url": "https://www.reddit.com/r/StockMarket/comments/ej3ind/where_would_you_put_your_money/",
        "created": 1578024797.0
    },
    {
        "author": "GeezIjustdontknow",
        "created_utc": 1578357113,
        "id": "el384w",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Does this mean QCOM to the moon??",
        "url": "https://i.redd.it/ag3pcb9j49941.jpg",
        "created": 1578385913.0
    },
    {
        "author": "forevalearning",
        "created_utc": 1578587804,
        "id": "emc44i",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "With AMD, Qualcomm 865 and Apple A14 productions lined up. TSMC looks solid than ever.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/emc44i/with_amd_qualcomm_865_and_apple_a14_productions/",
        "created": 1578616604.0
    },
    {
        "author": "tsf_peso",
        "created_utc": 1578345360,
        "id": "el0grr",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Thoughts on teradyne for long term? They specialize in Defense/aerospace,semiconductors,robots etc.",
        "subreddit": "stocks",
        "title": "Thoughts on $TER?",
        "url": "https://www.reddit.com/r/stocks/comments/el0grr/thoughts_on_ter/",
        "created": 1578374160.0
    }
]