[
    {
        "author": "ixamnis",
        "created_utc": 1601394366,
        "id": "j21rk1",
        "num_comments": 311,
        "num_crossposts": 0,
        "selftext": "A couple of weeks ago, I posted a comment in response to a question about ETFs. This question comes up very often; usually two or three times a week. Maybe more than than.  Several people suggested that it be \"pinned.\"  I obviously cannot do that, however if a mod wants to pin this, feel free to do so.  I did make a few modifications and additions to that comment and for those who haven't gone back to see the changes, I thought I'd post it again here.  Hopefully, this helps people who are interested in an investing approach that is either made up of ETFs or that includes ETFs as a part of their portfolio.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**QQQ** \\- This one uses the NASDAQ 100 as its benchmark. Obviously it's an Indexed, non-managed ETF. XTF used to rate this one as a perfect 10.0 out of 10 rating, but recently dropped it to 9.9 out of 10. It has one of the highest rates of return over the past 10 years of any ETF. It does tend to be tech-heavy, especially with the FAANG +M stocks. (Facebook, Apple, Amazon, Netflix, Google and Microsoft). Other top holdings include TSLA, NVDA and ADBE. (The rating dropped recently when the portfolio of the NASDAQ 100 was re-balanced).\n\n**VOO**/**SPY** \\- **VOO** and **SPY** are non-managed funds indexed to the S&amp;P 500 Index. These funds are very popular on this subreddit, for good reason. They are well diversified, broad market funds investing in mostly US stocks. XTF rates these funds at 9.6 out of 10 because their return on investment over the long term is somewhat tempered by some of the blue chip stocks in the funds. But those stocks also help reduce volatility relative to some other ETFs. These are solid investments, but keep in mind that in the top 10 holdings there will be a lot of crossover between these funds and other broad market funds that hold US stocks like **QQQ**, **VTI**, **VTG**, **VOOG** and **SPYG**. There are differences, of course, as well, but you always want to know where those duplications exist.\n\n**IWF** \\- This is a Russell 1000 indexed fund. It is one of my favorites that doesn't get talked about much. It does have a lot of crossover with the other funds mentioned above, but the mix is slightly different. I would describe this fund as more aggressive than **VOO/SPY**, less volatile than **QQQ**.\n\n**IWM** \\- for someone looking to diversify a little bit, this is a great fund to look into. This fund is a non-managed, indexed fund that uses the Russell 2000 index as its benchmark. The big difference between the Russell 2000 index and many of the the other indexes is that the Russell 2000 index looks at small and mid-cap companies, rather than large-cap companies. Thus, there is zero crossover between this one and the funds mentioned above. While this fund will move up and down with the market, it is often less volatile than the market overall. If you look at the charts, this fund has under-performed some of the other funds over the past few months while the market has been very volatile in an upward direction, but in a crash, this fund would probably outperform the rest of the market. It has a 9.0/10 XTF rating.\n\n**VXUS** \\- Vanguard Total International Index Fund ETF - top holdings include BABA, Tencent, Samsung, Taiwan Semiconductors, Novartis, Toyota. This is a broad market fund investing only in companies overseas. I'm not generally bullish on foreign markets, but this one is a very solid ETF with some companies that are likely to do extremely well for the foreseeable future. XTF rates this one a perfect 10.0 out of 10.\n\n**EEM** \\- iShares MSCI Emerging Markets ETF - This one is going to have a lot of crossover with **VXUS**. It is an Emerging Markets ETF with a lot of focus on China. It includes Alibaba, Tencent, [JD.com](https://jd.com/), along with companies like Samsung and Taiwan Semiconductors. This one should be a solid performer as long as our trade relations with China remain normal.\n\n**EFA** \\- This is another international ETF, but here the focus is mainly on more established companies in Europe and Japan. This is a Large Cap ETF that includes companies like Nestle SA, Roche, Toyota, Novartis and AstraZeneca.\n\n**S*****ector fund ETFs:***\n\n**ICLN**/**TAN/FAN** \\- These funds are clean/renewable energy ETFs. **ICLN** is more broad while **TAN** focuses more specifically on solar energy and **FAN** specifically on wind generated energy. I think renewable energy companies are the future. There is no crossover in the top holdings of this fund with the top holdings of **QQQ** and most of the other broad market funds. Also, these are global, not just US based companies. **QCLN** and **PBW** are also renewable energy funds, but they also contain a lot of TSLA, NIO and W.K. H.S. in their top holdings making them \"electric vehicle\" funds, as well. No problem if you want to add that, but you'll find a lot of Tesla in some of the funds mentioned above.\n\n**ARK** **group of funds:**  **ARKG**, **ARKF**, **ARKK ARKW**, **ARKQ**, **PRNT** and **IZRL**. These are managed funds investing in companies that invest in disruptive companies in their respective industries. Most posters on this subreddit are bullish on these funds. They are aggressive growth ETFs, but should be considered somewhat risky and volatile.\n\n* **ARKG** \\- Genomic Revolution\n* **ARKF** \\- Fintech\n* **ARKK** \\- Disruptive Companies (broader market)\n* **ARKW** \\- Internet/computer/technology (Telsa is a top holding)\n* **ARKQ** \\- Robotics and artificial intelligence\n* **PRNT** \\- 3D printing technology\n* **IZRL** \\- disruptive companies based in Israel\n\n**XL series of funds**. Similar to the ARK series, these tend to be more aggressive growth funds, however these are passively managed indexed funds with various benchmarks that usually are overloaded in the better companies within a sector:\n\n* **XLV** \\- Health Care\n* **XLK** \\- Technology\n* **XLI** \\- Industrial\n* **XLY** \\- Consumer Discretionary\n* **XLP** \\- Consumer Staples\n* **XLF** \\- Financial\n* **XLRE** \\- Real Estate\n* **XLU** \\- Utilities\n* **XLE** \\- Energy/Oil\n\n**Cloud Computing** is another sector to consider. Some tickers in that sector include: **WCLD**, **SKYY**, **CLOU**, **BUG** and **XIKT**. Of these **WCLD** has the best 52 week performance. Top holdings in **WCLD** include **ZM**, **PLAN**, **CRM**, **CRWD**, **ZEN**, **WDAY**, **TENB**, **PCTY**, **DDOG**, **BL**. Many of these are likely to also appear in **QQQ**, however, they would be in very small percentages as the Cap on these companies is much smaller.\n\n***Other sector funds include:***\n\n**Health Care:** FHLC, VHT, IYH\n\n**Utilities:** IDU, VPU, FUTY, RYU\n\n**Oil/Energy:** IYE, FENY, VDE\n\n**Consumer Staples:** FSTA, VDC, IECS\n\n**Real Estate:** ICF, USRT, VNQ, PSR, BBRE\n\n**Media/Entertainment:** IEME, PBS, PEJ, IYC\n\n**Gaming/Casinos:** BJK, BETZ, CARZ\n\n**Transportation (including airlines):** JETS, XTN, FTXR, VIS\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n***A nice portfolio might look something like this:***\n\n**20%** \\- Broad market US fund such as QQQ, VOO or IWF\n\n**20%** \\- VXUS or one of the other International ETFs\n\n**20%** \\- IWM - Small/Mid-cap broad market fund\n\n**10%** **each** in four sector funds of your choice\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n*I'm not a financial expert or advisor and this is not financial advice, just an opinion from a random internet person. I do own shares in several, but not all of the funds listed above, including QQQ, IWF, some ARK funds, ICLN, VXUS, etc.*",
        "subreddit": "stocks",
        "title": "Investing in ETFs",
        "url": "https://www.reddit.com/r/stocks/comments/j21rk1/investing_in_etfs/",
        "created": 1601423166.0
    },
    {
        "author": "bumblebear3012",
        "created_utc": 1599237740,
        "id": "imjehr",
        "num_comments": 163,
        "num_crossposts": 0,
        "selftext": "Back in July, Barron’s ran a story profiling the rise of Nvidia (NVDA) as the company moved past Intel (INTC) in market cap to become the most valuable US semiconductor company. The  article cited Nvidia’s favorable exposure to data center, gaming, and  AI as major reasons why the company overtook top spot from Intel. Only  two months later, Nvidia is now worth $107bn more than Intel. In other  words, Nvidia is worth more than an AMD more than its Santa Clara rival.  Around the same time, AMD (AMD)  also began to see significant out-performance relative to Intel shares.  With continued momentum in the PC market on the back of its Ryzen  processors and increased success in data center with the EPYC product  line, AMD has risen 57% since the start of July. Over that period, Intel  declined 15%. \n\nIn contrast to Nvidia and AMD, Intel is disproportionately associated with  the PC. Yet even within the PC market, analyst commentary has been  overwhelmingly positive on AMD whereas doubts have surfaced over Intel’s  ability to innovate and remain competitive. In the span of a week at  the end of July, Intel announced a major delay with its 7nm chips and  AMD beat Q2 earnings, raised guidance, and hit its highest PC market  share since 2013. However, the focus on Intel as a struggling PC player  has wrongly overlooked several important developments that set the company up for a near-term rebound in PC and [long-term revenue opportunities in the same higher growth end markets that have fueled premium valuations for both Nvidia and AMD](https://blackjacketco.com/f/new-brand-new-intel-growth-ahead-for-tiger-lake-edge-and-av). \n\n1. Release of Tiger Lake processor, expanded efforts in graphics via  Xe architecture, and development of discrete GPUs for data center and  desktop\n2. Continued momentum in company shift to data-centric business first and PC business second\n3. Expanded Total Addressable Market (TAM) associated with edge computing and edge-enabled technologies\n4. Competitive positioning in autonomous vehicle technology\n\nIntel is currently priced for stagnant to declining revenues, further market share erosion, and lower  relative probability of success compared to Nvidia and AMD. Given recent  product releases and refreshes, as well as a strong strategic vision to  increase share in these higher growth end markets, Intel revenue is  more likely to accelerate and lead to significant multiple expansion in  the coming years. \n\n* Assigning Intel CY23 PT of $125 per share\n* FY23 revenue projected at $100bn\n* FY23 net income projected at $34bn delivering 7.55 in EPS\n* Applying 16.55x P/E and 4.55 P/S \n\nFor an in-depth and comprehensive breakdown on Intel's competitive positioning, see below:\n\n**Tiger Lake and Renewed PC Innovation** \n\nYesterday  Intel finally revealed the highly anticipated Tiger Lake 11th  generation processors for ultra-thin high-performance laptops. Industry  reporting in previous months had speculated that the new system-on-chip  (SoC – incorporates different components like graphics and AI into one  integrated unit) would offer CPU performance advances and improvements  in graphics and AI. Intel even leaked some specs on Monday that seemed  to confirm some of the performance metrics. Although independent  industry studies are required to run Tiger Lake through its full paces,  the event demonstrated that not only can Intel still innovate, it is  more than premature to start counting the company out on PCs. \n\nTiger  Lake clocks up to 20% higher frequencies compared to the 10th  generation Ice Lake family and can reach a single core turbo of 4.8 GHz.  During the presentation, Intel noted that the integrated Iris Xe  graphics perform better than 90% of PCs sold last year, on-board AI is  up to 5x more effective, and WiFi connectivity is up to 3x faster. In a  like-for-like comparison to AMD, Tiger Lake enabled 4x faster photo  upscaling, 2x faster video processing and exporting via Adobe Pro, and  20% faster performance in both Microsoft Word and PowerPoint. For  gaming, Intel conducted side-by-side tests using Gears Tactics. Laptops  running AMD 4800U with integrated graphics and a Nvidia MX350 discrete  graphics card (with Intel 10th Gen i7) performed worse than Tiger Lake.  Intel’s test showed that Tiger Lake handled the game at up to 66% higher  frames per second versus the AMD and Nvidia-powered laptops. \n\nBarring significant discrepancies found during independent reviews, Intel just  delivered performance on 10nm that is equivalent to what is possible on  7nm. With the simultaneous launch of the Evo brand to encompass the new  11th generation-powered ultra-thin high-performance laptop range, Intel  can begin building customer brand recognition and altering perceptions  that Intel has lost competitive footing in the PC market. With 50 PC  designs set to ship with Tiger Lake as soon as this fall, and at least  150 designs anticipated from partner OEMs, Intel may see a very  near-term recovery in its PC market share even despite the 7nm delay.  \n\n**Transition to Data-Centric Business and Future at the Edge**\n\nMore  important to Intel’s future is the multi-year shift towards  higher-growth end markets associated with cloud, edge, and data. Rather  than PCs, Intel sees its primary business as the Data-Centric reporting  segment that now comprises 52% of revenues. That figure is likely to  expand in coming quarters following 34% YoY growth in the most recent  earnings report. In FY19 Q2, the Data-Centric segment only accounted for  46% of revenues. \n\nThat  Data-Centric segment includes: The Data Center Group (36.3% of total  Intel revenues); Non-Volatile Memory Storage Group (8.5%);  Internet-of-Things Group (3.4%); Programmable Solutions Group (2.6%);  and Mobileye (0.7%). The two largest contributors to the segment are  performing extremely well. The Data Center Group grew 43% YoY and saw  operating income climb 72%. The second largest business in the segment,  Non-Volatile Memory Storage, grew 76% YoY for record revenue on the back  of NAND demand growth and higher Average Selling Prices (ASPs). \n\nBy  2024, Intel expects its TAM to reach $300bn. But $230bn of this is  attributed to the Data-Centric TAM. And Intel’s own calculations may be  slightly conservative. In the company’s analysis of its various end  markets, Intel only mentioned the edge compute market in general terms.  Yet that market alone is projected to surpass $100bn by 2030. As much as  public cloud adoption drove demand for server-related products over the  past five years, the edge could end up being a far more important  trend. That is because, in addition to further server demand, the edge  will enable billions of IoT devices to finally become widespread after  years of hype. With TAM growth associated with edge server CPU, GPU, and  storage, plus IoT and edge AI solutions, Intel can achieve growth into  the 2030s so long as the company can execute on its strategic vision.  \n\n*Edge Server* \n\nAn S&amp;P Global study  in spring 2020 estimated that Intel has 90-95% share of the data center  CPU market despite recent share gains by AMD. While edge server  architectures and processes differ versus hyperscale cloud servers, this  figure is testament to the strength of Intel’s relationships with the  leading cloud providers that are also among the early movers in the edge  computing space – namely Amazon with its Lambda@Edge platform,  Microsoft with Azure Functions, and Google with Google Cloud Functions.  \n\nFor  smaller edge providers especially, like Fastly, Akamai, or Cloudflare,  there will be particular emphasis on price-per-performance for server  components. Until recently, that dynamic favored AMD whose EPYC Rome  7742 processor rivals Intel’s Xeon Platinum 8280 on performance yet  undercuts it on price by about 60%. The cost efficiency of EPYC led to  some important edge server design wins for AMD, including Cloudflare’s  new GenX server that excluded Intel parts for the first time. \n\nThe  latest Xeon processors had been on the market for a couple years,  though, and Intel refreshed the product line earlier this year in an  attempt to greatly reduce cost while maintaining performance. In its 24  February press release, Intel directly addressed the need to become more  competitive with AMD on price-per-performance noting that the Xeon  refresh: “…\\[reinforces\\] Intel’s data center leadership by providing  greater performance and performance-per-dollar choices for…customers  across cloud, network and edge.” While Intel compromised on  compatibility with certain server designs, the result is 1.42x better  price-per-core-performance and a cost of $141 per-core for the Gold  6258R. The price tag puts Xeon in a much stronger position relative to  EPYC Rome 7742 which goes for $108 per-core. \n\nDespite  early advantages in cost-per-performance for AMD, Intel still managed  to double its edge deployments year-over-year according to Forbes. And  its impressive partner list includes Lenovo, Red Hat, Advantech,  Caswell, Inventec, Lanner, Nexcom, World Wide Technology, Ericsson, ZTE,  Verizon, Vodafone, Nokia, and China Telecom, among others. With drastic  improvements in price-per-performance, Intel could very well see  additional customer wins in upcoming quarters. \n\nBeyond  CPU, edge applications will see an increase in demand for integrated  and hybrid GPUs. Between advancements in Intel Xe graphics and its  development of discrete graphics cards, the company will become better  positioned to take advantage of the more than 33% CAGR projected for  GPUs from 2020 to 2027 – taking the market from just under $20bn in 2019  to over $200bn according to Deloitte.  Even if Nvidia and AMD maintain large leads over Intel in GPU market  share for edge servers, even a marginal portion of the market could be  meaningful to the Data Center Group which measured around $7bn in Q2. \n\nIn  addition, edge servers present an unprecedented opportunity for NAND  solutions as well – specifically flash storage that utilizes the NVMe  (Non-Volatile Memory Express) protocol. Edge servers have strong need  for high-performance startup operations and extremely reliable storage.  That is because rapid startup times are critical for edge providers to  quickly launch computing instances and deliver the lowest possible  latency for their customers. Improvements in NVMe NAND greatly shrink  the physical storage footprint, reduce power and cooling costs, all the  while improving the overall speed, flexibility, and failure rates. And  Intel Optane and 3D NAND SSDs are exceptionally reliable for storage and  offer performance improvements over legacy storage solutions. \n\n*IoT and AI*\n\nMuch  like edge servers, edge deployed IoT devices will similarly boost  demand for Intel processors. For workload intensive industrial IoT,  Intel has its Core processor. And the Intel Atom processor is  purpose-built for lower-power or embedded applications. Because IoT  devices will collect and process vast amounts of data, these  applications will also require significant amounts of flash memory –  specifically NAND. On-device NAND SSD can increase data transfer speeds  while also integrating module-level security features, remote  management, and more flexible power configurations. Collectively,  improvements in NAND will lower total cost of ownership for these  machines.  \n\nThe edge will lead  to rapid growth for edge AI chipsets that enable IoT devices to deploy  machine learning at the edge without having to send data via internet  back to a centralized data center. Deloitte notes that around 300  million edge AI chips were sold in 2017, but this year could see more  than 750 million units hit the market. With compounded annual growth in  edge AI chipsets anticipated to outpace the broader semiconductor  industry by a considerable amount, ABI research predicts that these edge chips will surpass the market for cloud AI chips by 2025 – marking a massive shift. \n\n**Mobileye and Autonomous Driving Technology** \n\nIt  is interesting the extent to which mainstream conversations in media  and financial commentary largely exclude Intel’s Mobileye and instead  focus on Tesla as the technology leader in autonomous vehicles and  Nvidia as the chipmaker best positioned to disrupt. Although Telsa  claims to offer autonomous modes for its vehicles, based on the 5-level  autonomous capability hierarchy – the industry standard established by  the Society of Automotive Engineers – the most advanced cars currently  on the market only operate at level 2+. Level 2+ falls between levels 2  (partial automation) and 3 (conditional automation). The hardware to  support full level 5 autonomy does exist in 2020, and the software  necessary to manage these systems is not too far behind. However, it  will likely take 5-7 years before manufacturing volumes reach levels to  drive down hardware prices, the necessary regulatory frameworks come  into place, and fully autonomous vehicles gain broad consumer  acceptance.  \n\nIn the  intermediary period, the progression towards level 5 autonomy will  continue to be gradual and incremental. Higher degrees of autonomy will  be achieved by increasingly sophisticated advanced driver assistance  systems (ADAS) that prove out the viability of these technologies and  underpin the manufacturing, regulatory, and consumer environment that  will facilitate the future arrival of self-driving cars. Beyond this, in  many cases the same technology at the center of levels 4 and 5 builds  on the existing foundations of ADAS capabilities. And the dominant  player in the ADAS market is not Tesla, Waymo, or Nvidia. It is  Mobileye. \n\nMobileye’s market  share has consistently stayed above 70% for years, even as competition  from other players has ramped up – Nvidia in particular. The Mobileye  solution is noteworthy, pairing its SoC – the EyeQ family – to support a  range of ADAS capabilities using only a single camera sensor. This  differs from the LiDAR and radar-based systems favored by Waymo, Uber,  GM-owned Cruise, and Nvidia. Tesla – who previously used Mobileye  technology until the two parted ways in 2016 – also leverages a  camera-based system. However, Tesla deploys ultrasonic sensors and  radars in combination with billions of miles of driver data. \n\nMobileye’s  commanding market share in ADAS means that its technology is used by  more than 300 models from 25 global automakers, resulting in 60 million  vehicles on the road worldwide. In contrast, Tesla currently has fewer  than 1 million vehicles on the road equipped with variants of its  autopilot technology. And Mobileye is already working with 4 major OEMs  to soon provide level 3 autonomous solutions. As part of its  arrangements with OEMs, Mobileye receives access to sensor data from  customer vehicles. At present, Mobileye is collecting 3.7 million miles  per day and growing as another 2 million vehicles from these OEMs are  set to join the data-sharing program over the next two years. \n\nWhat  this translates to is a massive partner network with the world’s  leading auto OEMs who will all have a vested interest in competing with  Tesla both in autonomous but also electric vehicles. This also means  that Mobileye has a significant advantage over Nvidia in getting its  ADAS and future autonomous solutions on vehicles. As Mobileye further  prioritizes its fully autonomous solutions, its leading competitive  positioning in ADAS, as well its strong relationships with OEMs, gives  the company a strategic advantage over its competitors as higher levels  of autonomous technologies go to market. This is evidenced by Mobileye’s  strategic partnership with Tesla EV rival NIO to offer level 4 consumer  vehicles by 2022. \n\nEven though  Mobileye made its name based on its single camera platform, the company  is separately developing what is called a full autonomous stack,  incorporating the necessary LiDAR, radar, non-camera sensors, GPS,  modems, and other hardware components that will run on its 5thgeneration  EyeQ processor. In the meantime, Mobileye recently demoed a  self-driving vehicle that navigated the congested streets of Jerusalem  using only 12 cameras and no LiDAR, radar, or non-camera sensors. \n\nOn  the back of the hyperbolic move in Tesla shares YTD, numerous articles  have lauded the company’s so-called multi-year advantages over rivals in  the space. Notably, in July Elon Musk stated that Tesla is “very close”  to level 5 autonomy with no updates needed to hardware as the company’s  Tesla Computer processor currently supports full autonomy. Mobileye’s  EyeQ 5 also supports level 5 autonomy, however. And although the Tesla  Computer exceeds EyeQ 5 on tera operations per second (TOPS), EyeQ 5  offers footprint and power consumption advantages. Moreover, unlike most  other players in autonomous systems, Mobileye has opted for an open  architecture that enables OEMs to program their own software on top of  Mobileye hardware. \n\nTesla has a  lead in data collected per mile at over 3 billion miles, but Mobileye is  catching up and its data repositories also exceed the billion-mile mark  on an annual run rate basis. To deepen the data sets available to  Mobileye, Intel also bought Israeli mobility-as-a-service company Moovit  for $900mn this year. Like Tesla, Mobileye is set to offer its  technology in the important robotaxi market that many in the industry  view as the precursor to consumer-adopted fully autonomous vehicles down  the line. Mobileye is launching pilot robotaxi fleets in Tel Aviv,  Paris, and Daegu City in 2022. \n\nMobileye  still accounts for less than 1% of total Intel revenues despite  doubling sales since being acquired by Intel. Given the strength of  Mobileye’s position in the ADAS market that is expected to grow to more  than $80bn by 2030, as well as the prospects in robotaxis and level 4/5  autonomous systems, Mobileye has strong potential to develop into a  major growth engine for Intel over the next 4-5 years. \n\n**Conclusion**\n\nIntel  shares are roughly flat since early 2018 despite revenues up almost 20%  from FY19 Q2 to FY20 Q2. The relative out-performance in Nvidia and AMD  shares over that time has furthered perceptions that Intel could fall  behind as the former two companies achieve sustained revenue growth tied  to more attractive end markets like data center, gaming, AI, and  autonomous vehicles. \n\nHowever,  recent struggles with certain products and lost PC market share to AMD  have distracted investors from Intel’s ongoing transition to a more data-centric business. With a $230bn TAM projected by 2024 for this  operating segment alone, Intel has multiple opportunities to likewise  drive revenue growth over the long-term. \n\nGiven  the company’s recent advancements with its 11th generation Tiger Lake SoC, continued progress in improving price-per-performance for edge  server components, and the vastly underrated leadership of Mobileye in  the ADAS and autonomous vehicle markets, Intel offers an extremely  compelling opportunity for investors seeking exposure to these  technology trends at a more reasonable valuation. \n\n*You can find me on Twitter* [@BlackjacketCo](https://twitter.com/BlackjacketCo) *where I write about emerging technologies, industry news, and long-term market trends. Thanks for reading!*",
        "subreddit": "stocks",
        "title": "Intel: Recent Struggles Create Attractive Long-Term Buying Opportunity",
        "url": "https://www.reddit.com/r/stocks/comments/imjehr/intel_recent_struggles_create_attractive_longterm/",
        "created": 1599266540.0
    },
    {
        "author": "Zabit2",
        "created_utc": 1599956080,
        "id": "irnz8n",
        "num_comments": 91,
        "num_crossposts": 0,
        "selftext": "Hey guys this week could be very pivotal point in the stock market so I’ve been doing my research and getting ready for this coming week and for options traders I found the 3 most important stocks announcing earnings this week.\n\nADBE-\n\nIf you don’t know AAPL owns ADBE or supposedly 15% of it so let say ADBE has great earnings next week but then all of a sudden institutions start selling the hell out of it.. what does this mean for the rest of the market? You probably think it means nothing because it’s just ADBE right? But you are actually wrong. Knowing that AAPL owns adbe it would mean that if they take out of adbe they will also start selling aapl.. it’s a very simple correlation and you know what happens when institutions take out of AAPL right? The market drops because aapl has large stake in the indices and it will be a leading tech stock falling meaning that other tech stocks will follow lead. So just when people are thinking the market drop could be over and that tech can’t sell of any harder it actually can and it depends a lot on adobe and how it reacts after earnings.\n\nFDX- fedex is up 100% in just the last 3 months and almost 300% since the crash.. it hasn’t had a down week in about 7 weeks I think.. crazy growth.. why? Because they are expecting great earnings obviously.. accelerated growth and good guidance are why stocks go up but we all know that the stocks that have soared in these market conditions have not done well after earnings.. for example look how AMZN,TSLA,SHOP, ZM, PTON reacted after earnings.. they all dropped hard and despite their AMAZING earnings.. the reason is because the great earnings are already priced into the stock and they are already incredibly valued so when the great earnings come out it is just not enough to justify the crazy new price leading to the stock being overvalued after earnings causing it to drop. I see the same happening with FDX this next week or at least an extremely high probability\n\nCBRL- this is a restaurant stock that trades at about $130 a share and ur prob thinking what the fuck is CBRL? Don’t worry I didn’t know either but the little details abt the company are not what’s important.. what is important is how it will react after earnings and knowing that it is a RESTAURANT stock if we look back at some restaurant stocks post earnings like MCD, CMG you will notice that these also reversed by about 6%. On cmg we bounced at open and then dropped 70 points.. converted into percentage it would not be unreasonable to see CBRL bounce and form this double top and then drop 8 points after leading to some very profitable options day trades.. I explain the analysis over all these stocks and their earnings in detail if you want to see how I explain it over the actual charts but I hope this is helpful for anyone who wanted to keep track of the earnings this week and on top of that there is actually some significance and domino effect relying on how ADBE will react.. make it a great week guys let me know if you have any questions or if I’m forgetting any major earnings coming out this week\n\n[https://youtu.be/zSX5hw\\_NNEI](https://youtu.be/zSX5hw_NNEI)",
        "subreddit": "options",
        "title": "Most IMPORTANT earnings to keep track of this week (pivotal point in the market)",
        "url": "https://www.reddit.com/r/options/comments/irnz8n/most_important_earnings_to_keep_track_of_this/",
        "created": 1599984880.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1599912027,
        "id": "irbbmr",
        "num_comments": 89,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/wallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning September 14th, 2020.\n\n# **Investors will look to the Fed to soothe the market next week, but that may be a tall order  - [(Source)](https://www.cnbc.com/2020/09/11/investors-will-look-to-the-fed-to-soothe-the-market-next-week-but-that-may-be-a-tall-order.html)**\n*****\n&gt; Markets are looking to the Federal Reserve to be a soothing force when it meets in the week ahead, but stocks could remain choppy if the central bank disappoints and as investors focus on the election and the economic recovery.\n*****\n&gt; The Fed’s two-day meeting is expected to end Wednesday with minor tweaks to its statement and some clarity on how it plans to use forward guidance. The Fed also updates its economic and interest rate outlook, including forecasts for 2023 for the first time.\n*****\n&gt; But Quincy Krosby, chief investment strategist at Prudential Financial, said the stock market could easily be disappointed because the Fed is unlikely to offer more clarity on monetary policy, such as plans for bond buying.\n*****\n&gt; “The market is concerned the Fed is not going to give us explicit readings on their plans for monetary policy,″ she said. The Fed’s extraordinary policies have been an important factor behind the stock market’s 50% surge from the March 23 low, and it’s also seen as a major factor limiting the depth of the market’s sell-off.\n*****\n&gt; Peter Boockvar, chief investment officer at Bleakley Advisory Group, said the Fed is not likely to tweak much and it continues to buy $80 billion a month in Treasurys. “I don’t think they’ll do anything to the markets either way,” he said.\n*****\n&gt; Stocks were volatile in the past week, falling hard, rallying, falling and rallying again. That left the S&amp;P 500 with a weekly decline of about 2.5%, its worst week since June. The harder hit Nasdaq was down about 4.1% for the week, its worst weekly decline since March. The quadruple expiration of options and futures at the end of the coming week could add to the volatility.\n*****\n&gt; Bank of America strategists said the bond market is watching the Fed for any balance sheet adjustments and the changes to its forward guidance, which includes the Fed’s recent tweak in its inflation policy. The Fed changed its policy of focusing on a target inflation rate to an average rate, meaning it may not tighten policy if inflation overshoots its 2% target.\n*****\n&gt; “We see risk the rates market is underwhelmed by the guidance provided by the Fed, which would support higher back-end rates and a steeper curve,” the Bank of America strategists noted. The benchmark 10-year Treasury yield slid in the past week, touching 0.67% Friday, and it could move higher, meaning bonds may sell-off, if the Fed does not clarify policy around its bond buying program.\n*****\n&gt; Krosby said the stock market is hoping for a dovish Fed. “The market needs that now because fiscal policy is going nowhere,” she said.\n*****\n&gt; BTIG strategist Julian Emanuel said the market could focus on the fact that Congress failed to make headway on fiscal stimulus, if the economic data begins to disappoint.\n*****\n&gt; Retail sales for August are expected Wednesday morning, as the Fed meets. They are expected to rise by 1%, and that should be an important look at whether the lack of enhanced unemployment benefits, which expired July 31, impacted consumer spending. Among other things, Republicans and Democrats could not agree how to replace the $600 weekly payment to the unemployed.\n*****\n&gt; “Depending on the polls and the economic data, the probability of stimulus rises and falls,” said Emanuel, head of equity and derivatives strategy.\n*****\n&gt; “Our view is that next week is just going to be lots of back and forth with the potential for a further extension of the range for the downside, if the political narrative gets more inflamed,” said Emanuel. Emanuel expects the market to remain choppy and fall further into the month of October, as investors worry about the uncertainty around the presidential election.\n*****\n&gt; The Fed’s meeting this week is its last before the election, and analysts expect Fed Chairman Jerome Powell to sound reassuring that the Fed will do whatever it takes to support the economy. Powell holds a briefing after the meeting Wednesday, and he is expected to also be asked about the potential for higher inflation. The Fed has said it is more concerned about disinflation, but recent inflation data has been hotter than expected, though still well below 2%.\n*****\n&gt; “There is a tug of war between those who say buy chips now because inflation is moving higher, versus those why are saying deflationary forces are still weaving their way into the economy,” said Krosby.\n*****\n&gt; Marc Chandler, chief market strategist at Bannockburn Global Forex, said he expects the Fed to sound reassuring but it’s not likely to discuss a target for bond purchases or the yield curve controls some investors were hoping for. Yield curve control would mean the Fed would try to manage interest rates by targeting its purchases of specific Treasurys. For instance, it may focus on trying to keep longer duration yields lower, and buy the 10-year.\n*****\n&gt; Chandler also noted the Fed’s $7 trillion balance sheet has recently declined by about $100 billion from its peak, and its bond purchases are falling behind the European Central Bank.\n*****\n&gt; “My sense is the Fed is going to keep saying it’s not worried about inflation. Its bigger worry is downside risks. They’ll repeat their call for fiscal stimulus which after this week seems less likely,” he said.\n*****\n&gt; Chandler said the stock market could remain choppy in the coming week, but he does not expect a sharp selloff. The dollar could decline, if the Fed sounds dovish, and that is a positive for stocks.\n*****\n&gt; “I don’t think a 10% pullback [in Nasdaq] has caused enough pain to have people capitulate. This is just an ordinary correction, and we’re going to make new highs,” he said.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/N5HwCxp.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/jr7e4gT.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/z7gtiCt.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.postimg.cc/5tgPKm6Y/econcal1.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/LUUHMDE.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/CWgjO92.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/c37y9mp.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/Eau1B5A.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.postimg.cc/Mp84zhth/er1.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/SHieVRq.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.postimg.cc/fTBYdV6v/upgradesdowngrades1.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.postimg.cc/05GY8WnF/upgradesdowngrades2.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.postimg.cc/qMk8gsZR/upgradesdowngrades3.png))**\n\n*****\n\n&gt; # Election Charts You Need To See: Part 1\n\n&gt; First off, our thoughts go out to everyone who was impacted by the tragic events of September 11, 2001—19 years ago today. It is a day to reflect and remember those who were lost.\n\n&gt; One of the top requests we’ve had here at LPL Research is for more charts on the election. Over the next week, we will share some of our favorite charts on this very important subject.\n\n&gt; Here’s how the S&amp;P 500 Index performs under various presidents and congressional makeups. The best scenario has historically been a Democratic president and Republican Congress, while a Republican president and Democratic Congress has been the weakest.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.11.20-Blog-Chart-1.png?ssl=1))**\n\n&gt; Building on this, a split Congress historically has been one of the best scenarios for investors.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.11.20-Blog-Chart-2.png?ssl=1))**\n\n&gt; The best scenario under a Republican president is a split Congress, a potential positive for 2020 that has played out after the massive reversal in the stock market since March.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.11.20-Blog-Chart-3.png?ssl=1))**\n\n&gt; Looking at the four-year presidential cycle shows that stocks haven’t been down during a year the president was up for a re-election since FDR in the 1940s, another bullish tailwind for 2020.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.11.20-Blog-Chart-4.png?ssl=1))**\n\n&gt; Here’s another look at this, as stocks historically have done much better when there isn’t a lame duck president.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.11.20-Blog-Chart-5.png?ssl=1))**\n\n*****\n\n&gt; # Active Managers Do an About Face\n\n&gt; The National Association of Active Investment Managers (NAAIM) has an index which tracks the exposure of its members to US equity markets. Each week, members are asked to provide a number that represents their exposure to markets. A reading of -200 means they are leveraged short, -100 indicates fully short, 0 is neutral, 100% is fully invested, and 200% indicates leveraged long. Two weeks ago, in our Bespoke Report, we highlighted the fact that the exposure index had moved to one of the highest levels in its 15-year history. Now, just two weeks later, these same active managers have reigned in their exposure considerably as this week's reading dropped from just under 100 to 53.1.\n\n&gt; This week's drop was the second-largest one week decline in the index's history and just the 10th time that the index lost more than a third (33 points) in a single week. The most recent occurrence was back in early March in the middle of the Covid crash, and every other prior period where the index saw a similar drop, the S&amp;P 500 was also down every time by an average of 2.3%. Therefore, it's not much of a surprise to see the big drop this week given the big declines in the market. But what about going forward? Do big drops in the NAAIM Index mean a bounce back for markets or further declines?\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/09/091120-NAAIM.png))**\n\n*****\n\n&gt; # The Most and Least Heavily Shorted Stocks in the Russell 1,000\n\n&gt; Below is an updated look at the most heavily shorted stocks in the Russell 1,000. Each of these 30 stocks has at least 15% of its equity float sold short.\n\n&gt; At the top of the list is Nordstrom (JWN) with 38.66% of its float sold short. With a YTD decline of 61.86%, the shorts have crushed it with JWN this year.\n\n&gt; With its huge portfolio of office and retail real estate, Brookfield Property REIT(BPYU) has the second highest short interest in the Russell 1,000 at 33.7%. BPYU is down 35.7% YTD.\n\n&gt; There are plenty of other well-known companies on the list of the most heavily shorted stocks. Examples include American Airlines (AAL), Virgin Galactic (SPCE), LendingTree (TREE), Wayfair (W), Dick's Sporting Goods (DKS), ADT, TripAdvisor (TRIP), Beyond Meat (BYND), and Kohl's (KSS).\n\n&gt; One name that is no longer on the list of most shorted stocks is Tesla (TSLA). When we provided an update on short interest back in February (a pre-COVID world), Tesla (TSLA) had more than 17% of its float sold short, but that number is all the way down to 8.3% as of the most recent filing.\n\n&gt; These 30 stocks with the highest short interest are down an average of 3.01% since last Wednesday (9/2) when the S&amp;P 500 made its last closing high. That's actually a little bit better than the 3.55% average decline for the rest of the stocks in the Russell 1,000. And year-to-date, these 30 stocks are up an average of 0.60% versus an average gain of 0.81% for the rest of the index. That's not much of a difference!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/09/most-heavily-shorted.png))**\n\n&gt; Below is a list of the 30 least shorted stocks in the Russell 1,000 as a percentage of equity float. None of these stocks have more than 0.71% of their float sold short, and they're mostly made up of more conservative names in the Health Care and Consumer Staples sectors.\n\n&gt; Johnson &amp; Johnson (JNJ) has the lowest short interest as a percentage of float in the Russell 1,000 at just 0.36%. Microsoft (MSFT) -- one of the key mega-cap Tech names -- has the second lowest short interest, followed by Merck (MRK), Eli Lilly (LLY), and Medtronic (MDT).\n\n&gt; Somewhat surprisingly, Amazon (AMZN) is the sixth least shorted stock in the entire Russell 1,000. While AMZN is still thought of as a high-flying momentum name by many investors, its short interest levels tell a much different story, painting it as more of a non-cyclical stock like Pepsi (PEP), Procter &amp; Gamble (PG), or Coca- Cola (KO).\n\n&gt; While the 30 most heavily shorted stocks in the Russell 1,000 are up 0.60% YTD, the 30 least shorted stocks in the index are up much more at +8%. This group has MSFT, AMZN, HD, and AAPL to thank for that strong performance!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/09/leastshorted.png))**\n\n*****\n\n&gt; # 5 Lessons Learned About Rising Rates\n\n&gt; While the direction of the 10-year Treasury yield over the last cycle was decidedly lower, as shown in LPL’s Chart of the Day, there were still six extended periods where it rose at least 0.75%, and in two of those it rose almost 2%. Looking ahead, economic growth below potential, slack in the labor market, and an extremely supportive Federal Reserve (Fed) may limit rate pressure in the near term, but with interest rates already low and massive stimulus in place, we believe the overall direction is likely to be higher.\n\n&gt; “Even in a falling rate period there are lessons from the last cycle about rising rates,” said LPL Financial Chief Investment Officer Burt White. “Among them: Careful when the Fed stops buying and sometimes the best defense is a good offense.”\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.9.20-Blog-Chart-1.png?ssl=1))**\n\n&gt; While every economic cycle is unique, the last cycle highlighted these key takeaways about periods of rising rates:\n\n&gt; * **Careful when the Fed stops buying.**  The two drivers of rising rates last cycle were economic growth and Fed bond purchases, also known as quantitative easing (QE). The Fed buys bonds to keep rates down, but the start of Fed buying has actually been the time when rates rise—likely on expectations that the purchases would help strengthen the economy. These periods also often followed large rate declines either because markets anticipated the start of Fed buying or the economy was faltering. The takeaway: unless the economy is really taking off, any rising-rate period may pause for an extended period, or even reverse, when the Fed backs off bond purchases.\n&gt; * **Sometime the best defense is a good offense.** Lower-quality, more economically sensitive bond sectors actually performed well during periods of rising rates during the last cycle. Rate gains were largely driven by economic improvement rather than a large pick-up in inflation, and that’s typically a good environment for sectors like high-yield bonds and bank loans. The downside is that these are much riskier bond sectors and don’t provide the potential diversification benefits of higher-quality bonds during periods of stock declines.\n&gt; * **Don’t expect TIPS to provide much resilience because of their inflation adjustment.** Treasury Inflation-Protected Securities (TIPS) are high-quality bonds that have provided a little extra insulation against rising rates compared to similarly dated Treasuries when inflation expectations increased. TIPS prices are adjusted for inflation, but even with the adjustment, they are still very sensitive to rates.\n&gt; * **Investment-grade corporates can both hurt and help.** If credit spreads narrow when rates are rising, investment-grade corporates can post some solid gains in a rising-rate environment, but if spreads are holding steady or even widening, they can be very sensitive to changes in Treasury yields, potentially (although not often) even more sensitive than Treasuries.\n&gt; * **Mortgage-backed securities (MBS)** have not provided as much insulation as corporates, but they also have had less downside. While MBS have certainly outperformed Treasuries during periods of rising rates, they have not performed as well as investment-grade corporates. But they also have come with less downside, losing only 1.4% in their worst performing period compared to a 4% loss during the worst period for corporates.\nWith the Fed still providing strong stimulus and economic growth potentially poised to accelerate, we currently see an increased risk of rates moving higher. We are playing some offense with our equity exposure, which allows us to emphasize a focus on higher-quality bonds. Among bond sectors, we are emphasizing MBS and still prefer investment-grade corporates over Treasuries. History may not repeat, but if it rhymes, this positioning may help add resilience to a fixed income portfolio if rates extend their move off recent lows.\n\n&gt; With the Fed still providing strong stimulus and economic growth potentially poised to accelerate, we currently see an increased risk of rates moving higher. We are playing some offense with our equity exposure, which allows us to emphasize a focus on higher-quality bonds. Among bond sectors, we are emphasizing MBS and still prefer investment-grade corporates over Treasuries. History may not repeat, but if it rhymes, this positioning may help add resilience to a fixed income portfolio if rates extend their move off recent lows.\n\n*****\n\n&gt; # Best and Worst Performing Stocks Since the 9/2 High\n\n&gt; Since the S&amp;P 500 and Nasdaq peaked on September 2nd, we've seen rotation out of the post-COVID winners and rotation into laggards in the value space. Below we take a look at the best and worst performing stocks in the Russell 1,000 since the 9/2 high for the S&amp;P. For each stock, we also include its YTD total return and its percentage change from the 3/23 COVID Crash low through 9/2.\n\n&gt; Capri Holdings (CPRI) is up more than any other stock in the Russell 1,000 since 9/2 with a gain of 17.43%. Even after the recent gains, however, Capri -- the holding company for brands like Michael Kors, Jimmy Choo, and Versace -- is still down 52.9% year-to-date.\n\n&gt; Only four other stocks are up more than 10% since 9/2 -- Beyond Meat (BYND), PVH, Virtu Financial (VIRT), and Reinsurance Group (RGA). Interestingly, BYND and VIRT are also up big (~80%) year-to-date, while PVH and RGA are both down more than 35% year-to-date.\n\n&gt; What stands out the most about the list of winners is that only one Technology stock made the cut -- Sabre (SABR). Most names come from the two consumer sectors including cruise-liners like Carnival (CCL), Royal Caribbean (RCL) and Norwegian Cruise (NCLH), Kohl's (KSS), Williams-Sonoma (WSM), Six Flags (SIX), Foot Locker (FL), and Ralph Lauren (RL). Both UBER and LYFT also made the cut with gains of 6% since 9/2. The 30 biggest winners since 9/2 are still down an average of 20% year-to-date, while the rest of the stocks in the Russell 1,000 are up an average of 1.46% YTD.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/09/bestsince92.png))**\n\n&gt; While only one Technology stock made the list of biggest winners since 9/2, the sector accounts for two-thirds of the 30 biggest losers over the same time frame. As shown below, since 9/2, the six worst performing stocks in the Russell 1,000 and ten of the worst twelve all come from Tech. Notably, though, these 30 stocks that have all fallen more than 12% since 9/2 are still up an average of 5.6% YTD. Were it not for the horrid YTD performance of the Energy stocks that made the list, the average YTD gain would be even higher.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/09/worstsince92.png))**\n\n*****\n\n&gt; # Typical Early September Weakness Recovers Mid-Month Sells Off Month-End\n\n&gt; As of yesterday’s close the market was down more than the historical average performance in September. DJIA was down nearly -3.3%, S&amp;P 500 was down -4.8%, NASDAQ was off 7.9%, Russell 1000 was down -5.2% and Russell 2000 lost 3.7%. Today’s rally looks like the beginning of a textbook mid-month recovery rally However, the second half of September has historically been weaker than the first half. The week after options expiration week can be treacherous with S&amp;P 500 logging 23 weekly losses in 30 years since 1990. End-of-quarter portfolio restructuring, and window dressing can amplify the impacts of any negative headlines.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/75a927aee973e2c31a0d76ff0be15d59/fa78a7e1d90fbdef-fe/s500x750/8f217c04559740d2db6c24b7ea855ecd579ec195.jpg))**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.postimg.cc/Mp84zhth/er1.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.postimg.cc/3JGV5KjX/ervol1.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 9.14.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n&gt; # ***Monday 9.14.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/1LCuH7Z.png))\n\n*****\n\n&gt; # ***Tuesday  9.15.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/IU3xGVJ.png))\n\n&gt; # ***Tuesday 9.15.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/EOC9Qwy.png))\n\n*****\n\n&gt; # ***Wednesday 9.16.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/faX2lNR.png))\n\n&gt; # ***Wednesday 9.16.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Thursday 9.17.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/CdwssKa.png))\n\n&gt; # ***Thursday 9.17.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Friday 9.18.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Friday 9.18.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # FedEx Corp. $232.79\n**FedEx Corp. (FDX)** is confirmed to report earnings at approximately 4:00 PM ET on Tuesday, September 15, 2020. The consensus earnings estimate is $2.54 per share on revenue of $17.46 billion and the Earnings Whisper ® number is $2.78 per share. Investor sentiment going into the company's earnings release has 78% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 16.72% with revenue increasing by 2.42%. Short interest has decreased by 15.4% since the company's last earnings release while the stock has drifted higher by 46.5% from its open following the earnings release to be 54.3% above its 200 day moving average of $150.90. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, August 28, 2020 there was some notable buying of 3,504 contracts of the $250.00 call expiring on Friday, September 18, 2020. Option traders are pricing in a 10.7% move on earnings and the stock has averaged a 7.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FDX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Adobe Inc. $471.35\n**Adobe Inc. (ADBE)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, September 15, 2020. The consensus earnings estimate is $2.41 per share on revenue of $3.15 billion and the Earnings Whisper ® number is $2.47 per share. Investor sentiment going into the company's earnings release has 76% expecting an earnings beat The company's guidance was for earnings of approximately $2.40 per share. Consensus estimates are for year-over-year earnings growth of 12.62% with revenue increasing by 11.15%. Short interest has decreased by 14.1% since the company's last earnings release while the stock has drifted higher by 15.2% from its open following the earnings release to be 25.2% above its 200 day moving average of $376.45. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, August 27, 2020 there was some notable buying of 18,006 contracts of the $455.00 put expiring on Friday, September 25, 2020. Option traders are pricing in a 12.5% move on earnings and the stock has averaged a 6.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ADBE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Cracker Barrel Old Country Store, Inc. $136.79\n**Cracker Barrel Old Country Store, Inc. (CBRL)** is confirmed to report earnings at approximately 8:00 AM ET on Tuesday, September 15, 2020. The consensus estimate is for a loss of $0.55 per share on revenue of $483.68 million and the Earnings Whisper ® number is ($0.49) per share. Investor sentiment going into the company's earnings release has 28% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 120.37% with revenue decreasing by 38.55%. Short interest has decreased by 2.1% since the company's last earnings release while the stock has drifted higher by 30.0% from its open following the earnings release to be 12.5% above its 200 day moving average of $121.64. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, August 27, 2020 there was some notable buying of 1,012 contracts of the $190.00 call expiring on Friday, January 15, 2021. Option traders are pricing in a 10.6% move on earnings and the stock has averaged a 2.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CBRL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Aspen Group, Inc. $11.54\n**Aspen Group, Inc. (ASPU)** is confirmed to report earnings at approximately 4:00 PM ET on Monday, September 14, 2020. The consensus estimate is for a loss of $0.04 per share on revenue of $14.26 million and the Earnings Whisper ® number is ($0.03) per share. Investor sentiment going into the company's earnings release has 49% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 63.64% with revenue increasing by 37.67%. Short interest has increased by 56.8% since the company's last earnings release while the stock has drifted higher by 16.0% from its open following the earnings release to be 32.3% above its 200 day moving average of $8.72. The stock has averaged a 11.1% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ASPU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Lennar Corp. $77.48\n**Lennar Corp. (LEN)** is confirmed to report earnings at approximately 4:35 PM ET on Monday, September 14, 2020. The consensus earnings estimate is $1.51 per share on revenue of $5.33 billion and the Earnings Whisper ® number is $1.67 per share. Investor sentiment going into the company's earnings release has 65% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 5.03% with revenue decreasing by 9.00%. Short interest has decreased by 16.5% since the company's last earnings release while the stock has drifted higher by 20.2% from its open following the earnings release to be 29.6% above its 200 day moving average of $59.78. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 8.4% move on earnings and the stock has averaged a 2.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LEN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Endava $53.03\n**Endava (DAVA)** is confirmed to report earnings at approximately 7:20 AM ET on Tuesday, September 15, 2020. The consensus earnings estimate is $0.19 per share on revenue of $107.96 million and the Earnings Whisper ® number is $0.22 per share. Investor sentiment going into the company's earnings release has 33% expecting an earnings beat The company's guidance was for earnings of $0.18 to $0.20 per share on revenue of $105.00 million to $106.00 million. Consensus estimates are for earnings to decline year-over-year by 26.92% with revenue increasing by 9.61%. Short interest has increased by 56.2% since the company's last earnings release while the stock has drifted higher by 11.1% from its open following the earnings release to be 12.7% above its 200 day moving average of $47.06. Overall earnings estimates have been revised lower since the company's last earnings release. The stock has averaged a 6.7% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DAVA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Brady Corp. $45.34\n**Brady Corp. (BRC)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, September 16, 2020. The consensus earnings estimate is $0.55 per share on revenue of $260.00 million and the Earnings Whisper ® number is $0.56 per share. Investor sentiment going into the company's earnings release has 31% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 19.12% with revenue decreasing by 11.95%. Short interest has decreased by 37.3% since the company's last earnings release while the stock has drifted higher by 0.6% from its open following the earnings release to be 7.5% below its 200 day moving average of $49.01. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 5.3% move on earnings and the stock has averaged a 2.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BRC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Cantel Medical Corp. $49.12\n**Cantel Medical Corp. (CMD)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, September 17, 2020. The consensus earnings estimate is $0.08 per share on revenue of $232.80 million and the Earnings Whisper ® number is $0.09 per share. Investor sentiment going into the company's earnings release has 39% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 87.30% with revenue decreasing by 2.79%. Short interest has decreased by 19.9% since the company's last earnings release while the stock has drifted higher by 4.5% from its open following the earnings release to be 3.7% below its 200 day moving average of $51.02. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 17.8% move on earnings and the stock has averaged a 7.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CMD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # IsoRay Inc $0.63\n**IsoRay Inc (ISR)** is confirmed to report earnings at approximately 4:15 PM ET on Thursday, September 17, 2020. The consensus estimate is for a loss of $0.01 per share on revenue of $2.77 million. Investor sentiment going into the company's earnings release has 25% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 50.00% with revenue increasing by 43.97%. Short interest has decreased by 26.8% since the company's last earnings release while the stock has drifted lower by 33.7% from its open following the earnings release to be 6.7% below its 200 day moving average of $0.68. Overall earnings estimates have been unchanged since the company's last earnings release. The stock has averaged a 8.2% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ISR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Apogee Enterprises, Inc. $19.49\n**Apogee Enterprises, Inc. (APOG)** is confirmed to report earnings at approximately 6:30 AM ET on Thursday, September 17, 2020. The consensus earnings estimate is $0.34 per share. Investor sentiment going into the company's earnings release has 19% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 52.78% with revenue increasing by 179.79%. Short interest has decreased by 4.7% since the company's last earnings release while the stock has drifted lower by 7.2% from its open following the earnings release to be 23.9% below its 200 day moving average of $25.63. Option traders are pricing in a 10.1% move on earnings and the stock has averaged a 10.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=APOG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/wallstreetbets.",
        "subreddit": "wallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning September 14th, 2020",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/irbbmr/wall_street_week_ahead_for_the_trading_week/",
        "created": 1599940827.0
    },
    {
        "author": "bettybrighteye",
        "created_utc": 1599307218,
        "id": "imzxsp",
        "num_comments": 70,
        "num_crossposts": 0,
        "selftext": "I went to financial training seminar while in the military in November 1999 and the lady talked about how stocks like the second coming of christ as the only true path to increase your wealth. I sold all my silver age comics and things and sunk all my savings about 8000 dollars not much into the top growth stocks at the time. Nokia, JDSU, Qualcom (had a 5,000 percent spike that year), and GLW.    \n\n   Cell phones and fiber optics were where it was at in the late month of December Nokia was a 250 dollar a share darling at the time.  Well, one month later my portfolio was worth 1,500 dollars. I had one tech mutual fund i had sunk my whole paycheck of 1,500 dollars that was worth 200 dollars the next month. I held onto it for a while after the crash but by july I put 400 dollars each in XOm and LMT (20 dollars a share)  and rest in a Marvel trading around in the low 1 dollar range after the release of the first x-men movie. Now it was all about biotech companies and Yahoo post crash but i went for marvel. The stock was cheaper than the price of a comic book and  I thought, I was a genius when I sold marvel for 23 dollars a share a few years later such a bad decision. I used the money for my master's degree and housing.\n\nI invested a little in the 2000's, After 9/11 amazon was in the 25 dollar range and I picked up a few hundred dollars worth of it and google when it ipo'd at a 100 dollars a share. Google at the time was saying they were over priced at a hundred dollars a share. The hot stock at the time was Taser now AXXN. So, i've had a few years of success and decided sell my stocks to buy a car and put money toward my condo. I took all my saving and went all in october 2007. My dad convinced me to invest in Fannie Mae she looked so safe and respectable. I bought it at 61 dollars a share and it just started to decline right away but i held only to have my diamond hands cut off a few months later when the stock markets crashed in 2008 and I sold it at 60 cents a share. I was utterly destroyed and swore off stocks and cashed out till the recent market crash in march.  The only thing i had left were the stock certificates from Xom and LMT.\n\nI had developed what this one nurse i work with calls \"I want to see my money in front of me.\" I've had my money just sitting doing nothing in a money market for a decade.  i was just afraid to invest and i'd see facebook Ipo, apple's smartphone or the rise of netflix and think they'd be really good investments but was mortally afraid of repeating what happened twice before. But after the March crash I decided to jump back in and i've done really well these past few months with my early investments in NVDA, Adobe, apple, msft, apple and amazon. i've grown my portfolio from 5,000 dollars to 56k even after apple took a huge dive the past few days. Looking at the valuations of some of these stocks i did get the pangs of fear i felt in 99 and ended up selling nvda, adobe, amazon, msft and put it all on apple with 17k on the side for the future snowflake and air b&amp;b ipo. I did pick up more apple in the morning when it hit 113.  I feel staying the course even after a huge loss is the best long term strategy and avoid fannie mae she's a dirty dirty girl.    [https://imgur.com/a/cIfzN78](https://imgur.com/a/cIfzN78)",
        "subreddit": "wallstreetbets",
        "title": "Lost it all in 1999 again in 2008 and came back for March 2020",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/imzxsp/lost_it_all_in_1999_again_in_2008_and_came_back/",
        "created": 1599336018.0
    },
    {
        "author": "CreateNRG",
        "created_utc": 1600202062,
        "id": "ith3b9",
        "num_comments": 63,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Subtle flex... Even if he’s wrong #ADBE",
        "url": "https://i.redd.it/k8thep5sgdn51.jpg",
        "created": 1600230862.0
    },
    {
        "author": "thatpotato_",
        "created_utc": 1599500070,
        "id": "iobyko",
        "num_comments": 45,
        "num_crossposts": 0,
        "selftext": "23 year old, 30k capital (non-emergency funds). Looking to seek insights about how this hypothetical portfolio of mine will perform in your opinions (personally aiming for 30 ~ 35% yearly return), while keeping it moderately diversified. I know I'm quite heavy in tech, but I think I'm still somewhat diversifying by investing in tech companies of different areas (software, hardware, eCommerce, FinTech). \n\nAPPL\t10%\n\nMSFT 10%\n\nSQ 8%\n\nBABA 8%\n\nNVDA 8%\n\nADBE 8%\n\nSE 6%\n\nARKK 8%\n\nNIO\t3%\n\nJNJ\t3%\n\nTAN\t5%\n\nICLN\t5%\n\nRKT\t3%\n\nBRK.B 5%\n\nGLD\t5%\n\nWMT\t5%",
        "subreddit": "stocks",
        "title": "Opinions on my portfolio",
        "url": "https://www.reddit.com/r/stocks/comments/iobyko/opinions_on_my_portfolio/",
        "created": 1599528870.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1600203696,
        "id": "ithlpi",
        "num_comments": 45,
        "num_crossposts": 0,
        "selftext": "Psycho Market Recap for Tuesday, September 15, 2020\n\n**Summary**\n\nThe markets opened higher today, and traded mostly sideways, to show a bit of weakness towards the end of the session, but made a quick rebound 20 minutes before close to finish mostly green. The SPY was up 0.50%, the QQQ finished up 1.41%, and the DIA was even. In contrast to the unstoppable rally that the market has showcased in the last few months, we are now entering into consolidation territory.\n\nIn relation to another COVID-19 package, according to Yahoo, House Representative Nancy Pelosi has stated that the house will remain in session until lawmakers can deliver another round of relief. However, a report published today by Bloomberg that the FED’s main street lending program, which went live two months ago, and out of the $600B that was assigned, only $1.4 have been lent out under “onerous” terms.\n\nAPPL Apple Inc had its much anticipated #ApplEvent which had a muted impact on the stock price. Some highlights were that they unveiled new Ipads, a cheaper version of the Apple Watch, and announced a fitness service. TSLA Tesla Inc is set to have its Battery Day on September 22. In anticipation of the event Elon Musk has already tweeted that there will be many new and exciting things.\n\nOn another front, some wild news regarding EV company NKLA Nikola. There have been massive price swings, a deal announced with GM General Motors, then a report on NKLA fraud, a response from the CEO Trevor Milton, and now finally today a form-4 was published where Milton bought $1.3MM worth of shares.\n\nIn Europe, Germany is reporting good economic data. Spain is the first country to cross the 600k infection threshold. The UK is having problems with unemployment rising.\n\n**Highlights**\n\n* SNOW Snowflake makes tomorrow its much-anticipated debut tomorrow and is looking for around a $100 per share listing price.\n* NVDA Nvidia had target raised by Credit Suisse Group to $620 at BUY. Needham &amp; Co. raised the target to $700 at BUY. This is a major major one as the stock currently trades at $520. A lot of eyes on Nvidia lately.\n* MRNS Marinus Pharmaceuticals achieved positive stage 3 data and received many analyst upgrades today. The stock finished up 50%.\n* FDX FedEx Destroyed earnings after the bell! On earnings $4.72 actual vs $2.70 estimate and on Revenue $19B actual vs $17.5 estimated. Up 8% after hours\n* ADBE Adobe beats estimates as well. On Earnings $2.57 actual vs $2.41 estimate.on Revenue $3.23B actual vs $3.16 estimates. Stock was up 2% after hours.\n* NextEra Energy Inc raised its guidance for 2021 and 2022 and extended its longer-term growth forecast to 2023. Stock up 5% today.\n* JNCE Jounce Therapeutics finished up 23% on a licensing deal with GILD Gilead for an oncology treatment.\n* INO Inovio was up 20%, they presented yesterday at the H.C. Wainwright 22nd Annual Global Investment Conference.\n* APPS Digital Turbine has been on a tear! Today was up 13%\n* ABUS Arbutus Biopharma release positive data on hepatitis B study.\n* TSLA Tesla was up over 7%. They have upcoming battery day and a lot of hype around it.\n* SQ Square Inc was up 7% today on a monster run.",
        "subreddit": "StockMarket",
        "title": "Psycho Market Recap - Tue Sept 15",
        "url": "https://www.reddit.com/r/StockMarket/comments/ithlpi/psycho_market_recap_tue_sept_15/",
        "created": 1600232496.0
    },
    {
        "author": "Stupid-Dummy",
        "created_utc": 1599652470,
        "id": "ipefqh",
        "num_comments": 42,
        "num_crossposts": 0,
        "selftext": "ADBE earnings next week.  The WFH trend is huge for them and ADBE will crush their numbers.\n\nAdobe is in a number of hot businesses\n\nStock has come down $75 in the last 3 days.  I bought some calls near market close yesterday and it's not too late to:\n\nPaper hands --&gt;  Play the runup to earnings\n\nDiamond Hands --&gt; hold through earnings \n\nADBE 480C 9/18",
        "subreddit": "wallstreetbets",
        "title": "EASY Money this week -- Buy ADBE calls, make $",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ipefqh/easy_money_this_week_buy_adbe_calls_make/",
        "created": 1599681270.0
    },
    {
        "author": "Professor_Meteor",
        "created_utc": 1599959671,
        "id": "iroxre",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "This might be the only options play I’m excited for during ER. FDX and ADBE probably will sink because all the popular stocks seem to be a dying breed through this correction.",
        "subreddit": "options",
        "title": "LENNAR to the moon!!",
        "url": "https://www.reddit.com/r/options/comments/iroxre/lennar_to_the_moon/",
        "created": 1599988471.0
    },
    {
        "author": "karmaisinevitable",
        "created_utc": 1600453981,
        "id": "ivbqc1",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "What am I missing? Stocks like NVDVA, MSFT, AVGO, ADOBE and many many others have been dropping like hot potatoes for the past two-three weeks, where as a company like Peleton Inter. that has ridiculous valuation keeps on rising (I have puts of PTON and so the question)? What am I missing. \n\nP.S - I am a novice at valuation and of course can be absolutely wrong. And I am a part time investor with basic knowledge of markets. \n\nI truly appreciate any and all comments/knowledge. Thank you.",
        "subreddit": "stocks",
        "title": "Thinking out loud - NVDA, MSFT, AVGO etc VS PTON",
        "url": "https://www.reddit.com/r/stocks/comments/ivbqc1/thinking_out_loud_nvda_msft_avgo_etc_vs_pton/",
        "created": 1600482781.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1599912160,
        "id": "irbcnd",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "Good Friday evening to all of you here on r/smallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning September 14th, 2020.\n\n# **Investors will look to the Fed to soothe the market next week, but that may be a tall order  - [(Source)](https://www.cnbc.com/2020/09/11/investors-will-look-to-the-fed-to-soothe-the-market-next-week-but-that-may-be-a-tall-order.html)**\n*****\n&gt; Markets are looking to the Federal Reserve to be a soothing force when it meets in the week ahead, but stocks could remain choppy if the central bank disappoints and as investors focus on the election and the economic recovery.\n*****\n&gt; The Fed’s two-day meeting is expected to end Wednesday with minor tweaks to its statement and some clarity on how it plans to use forward guidance. The Fed also updates its economic and interest rate outlook, including forecasts for 2023 for the first time.\n*****\n&gt; But Quincy Krosby, chief investment strategist at Prudential Financial, said the stock market could easily be disappointed because the Fed is unlikely to offer more clarity on monetary policy, such as plans for bond buying.\n*****\n&gt; “The market is concerned the Fed is not going to give us explicit readings on their plans for monetary policy,″ she said. The Fed’s extraordinary policies have been an important factor behind the stock market’s 50% surge from the March 23 low, and it’s also seen as a major factor limiting the depth of the market’s sell-off.\n*****\n&gt; Peter Boockvar, chief investment officer at Bleakley Advisory Group, said the Fed is not likely to tweak much and it continues to buy $80 billion a month in Treasurys. “I don’t think they’ll do anything to the markets either way,” he said.\n*****\n&gt; Stocks were volatile in the past week, falling hard, rallying, falling and rallying again. That left the S&amp;P 500 with a weekly decline of about 2.5%, its worst week since June. The harder hit Nasdaq was down about 4.1% for the week, its worst weekly decline since March. The quadruple expiration of options and futures at the end of the coming week could add to the volatility.\n*****\n&gt; Bank of America strategists said the bond market is watching the Fed for any balance sheet adjustments and the changes to its forward guidance, which includes the Fed’s recent tweak in its inflation policy. The Fed changed its policy of focusing on a target inflation rate to an average rate, meaning it may not tighten policy if inflation overshoots its 2% target.\n*****\n&gt; “We see risk the rates market is underwhelmed by the guidance provided by the Fed, which would support higher back-end rates and a steeper curve,” the Bank of America strategists noted. The benchmark 10-year Treasury yield slid in the past week, touching 0.67% Friday, and it could move higher, meaning bonds may sell-off, if the Fed does not clarify policy around its bond buying program.\n*****\n&gt; Krosby said the stock market is hoping for a dovish Fed. “The market needs that now because fiscal policy is going nowhere,” she said.\n*****\n&gt; BTIG strategist Julian Emanuel said the market could focus on the fact that Congress failed to make headway on fiscal stimulus, if the economic data begins to disappoint.\n*****\n&gt; Retail sales for August are expected Wednesday morning, as the Fed meets. They are expected to rise by 1%, and that should be an important look at whether the lack of enhanced unemployment benefits, which expired July 31, impacted consumer spending. Among other things, Republicans and Democrats could not agree how to replace the $600 weekly payment to the unemployed.\n*****\n&gt; “Depending on the polls and the economic data, the probability of stimulus rises and falls,” said Emanuel, head of equity and derivatives strategy.\n*****\n&gt; “Our view is that next week is just going to be lots of back and forth with the potential for a further extension of the range for the downside, if the political narrative gets more inflamed,” said Emanuel. Emanuel expects the market to remain choppy and fall further into the month of October, as investors worry about the uncertainty around the presidential election.\n*****\n&gt; The Fed’s meeting this week is its last before the election, and analysts expect Fed Chairman Jerome Powell to sound reassuring that the Fed will do whatever it takes to support the economy. Powell holds a briefing after the meeting Wednesday, and he is expected to also be asked about the potential for higher inflation. The Fed has said it is more concerned about disinflation, but recent inflation data has been hotter than expected, though still well below 2%.\n*****\n&gt; “There is a tug of war between those who say buy chips now because inflation is moving higher, versus those why are saying deflationary forces are still weaving their way into the economy,” said Krosby.\n*****\n&gt; Marc Chandler, chief market strategist at Bannockburn Global Forex, said he expects the Fed to sound reassuring but it’s not likely to discuss a target for bond purchases or the yield curve controls some investors were hoping for. Yield curve control would mean the Fed would try to manage interest rates by targeting its purchases of specific Treasurys. For instance, it may focus on trying to keep longer duration yields lower, and buy the 10-year.\n*****\n&gt; Chandler also noted the Fed’s $7 trillion balance sheet has recently declined by about $100 billion from its peak, and its bond purchases are falling behind the European Central Bank.\n*****\n&gt; “My sense is the Fed is going to keep saying it’s not worried about inflation. Its bigger worry is downside risks. They’ll repeat their call for fiscal stimulus which after this week seems less likely,” he said.\n*****\n&gt; Chandler said the stock market could remain choppy in the coming week, but he does not expect a sharp selloff. The dollar could decline, if the Fed sounds dovish, and that is a positive for stocks.\n*****\n&gt; “I don’t think a 10% pullback [in Nasdaq] has caused enough pain to have people capitulate. This is just an ordinary correction, and we’re going to make new highs,” he said.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/N5HwCxp.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/jr7e4gT.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/z7gtiCt.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.postimg.cc/5tgPKm6Y/econcal1.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/LUUHMDE.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/CWgjO92.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/c37y9mp.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/Eau1B5A.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.postimg.cc/Mp84zhth/er1.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/SHieVRq.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.postimg.cc/fTBYdV6v/upgradesdowngrades1.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.postimg.cc/05GY8WnF/upgradesdowngrades2.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.postimg.cc/qMk8gsZR/upgradesdowngrades3.png))**\n\n*****\n\n&gt; # Election Charts You Need To See: Part 1\n\n&gt; First off, our thoughts go out to everyone who was impacted by the tragic events of September 11, 2001—19 years ago today. It is a day to reflect and remember those who were lost.\n\n&gt; One of the top requests we’ve had here at LPL Research is for more charts on the election. Over the next week, we will share some of our favorite charts on this very important subject.\n\n&gt; Here’s how the S&amp;P 500 Index performs under various presidents and congressional makeups. The best scenario has historically been a Democratic president and Republican Congress, while a Republican president and Democratic Congress has been the weakest.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.11.20-Blog-Chart-1.png?ssl=1))**\n\n&gt; Building on this, a split Congress historically has been one of the best scenarios for investors.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.11.20-Blog-Chart-2.png?ssl=1))**\n\n&gt; The best scenario under a Republican president is a split Congress, a potential positive for 2020 that has played out after the massive reversal in the stock market since March.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.11.20-Blog-Chart-3.png?ssl=1))**\n\n&gt; Looking at the four-year presidential cycle shows that stocks haven’t been down during a year the president was up for a re-election since FDR in the 1940s, another bullish tailwind for 2020.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.11.20-Blog-Chart-4.png?ssl=1))**\n\n&gt; Here’s another look at this, as stocks historically have done much better when there isn’t a lame duck president.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.11.20-Blog-Chart-5.png?ssl=1))**\n\n*****\n\n&gt; # Active Managers Do an About Face\n\n&gt; The National Association of Active Investment Managers (NAAIM) has an index which tracks the exposure of its members to US equity markets. Each week, members are asked to provide a number that represents their exposure to markets. A reading of -200 means they are leveraged short, -100 indicates fully short, 0 is neutral, 100% is fully invested, and 200% indicates leveraged long. Two weeks ago, in our Bespoke Report, we highlighted the fact that the exposure index had moved to one of the highest levels in its 15-year history. Now, just two weeks later, these same active managers have reigned in their exposure considerably as this week's reading dropped from just under 100 to 53.1.\n\n&gt; This week's drop was the second-largest one week decline in the index's history and just the 10th time that the index lost more than a third (33 points) in a single week. The most recent occurrence was back in early March in the middle of the Covid crash, and every other prior period where the index saw a similar drop, the S&amp;P 500 was also down every time by an average of 2.3%. Therefore, it's not much of a surprise to see the big drop this week given the big declines in the market. But what about going forward? Do big drops in the NAAIM Index mean a bounce back for markets or further declines?\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/09/091120-NAAIM.png))**\n\n*****\n\n&gt; # The Most and Least Heavily Shorted Stocks in the Russell 1,000\n\n&gt; Below is an updated look at the most heavily shorted stocks in the Russell 1,000. Each of these 30 stocks has at least 15% of its equity float sold short.\n\n&gt; At the top of the list is Nordstrom (JWN) with 38.66% of its float sold short. With a YTD decline of 61.86%, the shorts have crushed it with JWN this year.\n\n&gt; With its huge portfolio of office and retail real estate, Brookfield Property REIT(BPYU) has the second highest short interest in the Russell 1,000 at 33.7%. BPYU is down 35.7% YTD.\n\n&gt; There are plenty of other well-known companies on the list of the most heavily shorted stocks. Examples include American Airlines (AAL), Virgin Galactic (SPCE), LendingTree (TREE), Wayfair (W), Dick's Sporting Goods (DKS), ADT, TripAdvisor (TRIP), Beyond Meat (BYND), and Kohl's (KSS).\n\n&gt; One name that is no longer on the list of most shorted stocks is Tesla (TSLA). When we provided an update on short interest back in February (a pre-COVID world), Tesla (TSLA) had more than 17% of its float sold short, but that number is all the way down to 8.3% as of the most recent filing.\n\n&gt; These 30 stocks with the highest short interest are down an average of 3.01% since last Wednesday (9/2) when the S&amp;P 500 made its last closing high. That's actually a little bit better than the 3.55% average decline for the rest of the stocks in the Russell 1,000. And year-to-date, these 30 stocks are up an average of 0.60% versus an average gain of 0.81% for the rest of the index. That's not much of a difference!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/09/most-heavily-shorted.png))**\n\n&gt; Below is a list of the 30 least shorted stocks in the Russell 1,000 as a percentage of equity float. None of these stocks have more than 0.71% of their float sold short, and they're mostly made up of more conservative names in the Health Care and Consumer Staples sectors.\n\n&gt; Johnson &amp; Johnson (JNJ) has the lowest short interest as a percentage of float in the Russell 1,000 at just 0.36%. Microsoft (MSFT) -- one of the key mega-cap Tech names -- has the second lowest short interest, followed by Merck (MRK), Eli Lilly (LLY), and Medtronic (MDT).\n\n&gt; Somewhat surprisingly, Amazon (AMZN) is the sixth least shorted stock in the entire Russell 1,000. While AMZN is still thought of as a high-flying momentum name by many investors, its short interest levels tell a much different story, painting it as more of a non-cyclical stock like Pepsi (PEP), Procter &amp; Gamble (PG), or Coca- Cola (KO).\n\n&gt; While the 30 most heavily shorted stocks in the Russell 1,000 are up 0.60% YTD, the 30 least shorted stocks in the index are up much more at +8%. This group has MSFT, AMZN, HD, and AAPL to thank for that strong performance!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/09/leastshorted.png))**\n\n*****\n\n&gt; # 5 Lessons Learned About Rising Rates\n\n&gt; While the direction of the 10-year Treasury yield over the last cycle was decidedly lower, as shown in LPL’s Chart of the Day, there were still six extended periods where it rose at least 0.75%, and in two of those it rose almost 2%. Looking ahead, economic growth below potential, slack in the labor market, and an extremely supportive Federal Reserve (Fed) may limit rate pressure in the near term, but with interest rates already low and massive stimulus in place, we believe the overall direction is likely to be higher.\n\n&gt; “Even in a falling rate period there are lessons from the last cycle about rising rates,” said LPL Financial Chief Investment Officer Burt White. “Among them: Careful when the Fed stops buying and sometimes the best defense is a good offense.”\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.9.20-Blog-Chart-1.png?ssl=1))**\n\n&gt; While every economic cycle is unique, the last cycle highlighted these key takeaways about periods of rising rates:\n\n&gt; * **Careful when the Fed stops buying.**  The two drivers of rising rates last cycle were economic growth and Fed bond purchases, also known as quantitative easing (QE). The Fed buys bonds to keep rates down, but the start of Fed buying has actually been the time when rates rise—likely on expectations that the purchases would help strengthen the economy. These periods also often followed large rate declines either because markets anticipated the start of Fed buying or the economy was faltering. The takeaway: unless the economy is really taking off, any rising-rate period may pause for an extended period, or even reverse, when the Fed backs off bond purchases.\n&gt; * **Sometime the best defense is a good offense.** Lower-quality, more economically sensitive bond sectors actually performed well during periods of rising rates during the last cycle. Rate gains were largely driven by economic improvement rather than a large pick-up in inflation, and that’s typically a good environment for sectors like high-yield bonds and bank loans. The downside is that these are much riskier bond sectors and don’t provide the potential diversification benefits of higher-quality bonds during periods of stock declines.\n&gt; * **Don’t expect TIPS to provide much resilience because of their inflation adjustment.** Treasury Inflation-Protected Securities (TIPS) are high-quality bonds that have provided a little extra insulation against rising rates compared to similarly dated Treasuries when inflation expectations increased. TIPS prices are adjusted for inflation, but even with the adjustment, they are still very sensitive to rates.\n&gt; * **Investment-grade corporates can both hurt and help.** If credit spreads narrow when rates are rising, investment-grade corporates can post some solid gains in a rising-rate environment, but if spreads are holding steady or even widening, they can be very sensitive to changes in Treasury yields, potentially (although not often) even more sensitive than Treasuries.\n&gt; * **Mortgage-backed securities (MBS)** have not provided as much insulation as corporates, but they also have had less downside. While MBS have certainly outperformed Treasuries during periods of rising rates, they have not performed as well as investment-grade corporates. But they also have come with less downside, losing only 1.4% in their worst performing period compared to a 4% loss during the worst period for corporates.\nWith the Fed still providing strong stimulus and economic growth potentially poised to accelerate, we currently see an increased risk of rates moving higher. We are playing some offense with our equity exposure, which allows us to emphasize a focus on higher-quality bonds. Among bond sectors, we are emphasizing MBS and still prefer investment-grade corporates over Treasuries. History may not repeat, but if it rhymes, this positioning may help add resilience to a fixed income portfolio if rates extend their move off recent lows.\n\n&gt; With the Fed still providing strong stimulus and economic growth potentially poised to accelerate, we currently see an increased risk of rates moving higher. We are playing some offense with our equity exposure, which allows us to emphasize a focus on higher-quality bonds. Among bond sectors, we are emphasizing MBS and still prefer investment-grade corporates over Treasuries. History may not repeat, but if it rhymes, this positioning may help add resilience to a fixed income portfolio if rates extend their move off recent lows.\n\n*****\n\n&gt; # Best and Worst Performing Stocks Since the 9/2 High\n\n&gt; Since the S&amp;P 500 and Nasdaq peaked on September 2nd, we've seen rotation out of the post-COVID winners and rotation into laggards in the value space. Below we take a look at the best and worst performing stocks in the Russell 1,000 since the 9/2 high for the S&amp;P. For each stock, we also include its YTD total return and its percentage change from the 3/23 COVID Crash low through 9/2.\n\n&gt; Capri Holdings (CPRI) is up more than any other stock in the Russell 1,000 since 9/2 with a gain of 17.43%. Even after the recent gains, however, Capri -- the holding company for brands like Michael Kors, Jimmy Choo, and Versace -- is still down 52.9% year-to-date.\n\n&gt; Only four other stocks are up more than 10% since 9/2 -- Beyond Meat (BYND), PVH, Virtu Financial (VIRT), and Reinsurance Group (RGA). Interestingly, BYND and VIRT are also up big (~80%) year-to-date, while PVH and RGA are both down more than 35% year-to-date.\n\n&gt; What stands out the most about the list of winners is that only one Technology stock made the cut -- Sabre (SABR). Most names come from the two consumer sectors including cruise-liners like Carnival (CCL), Royal Caribbean (RCL) and Norwegian Cruise (NCLH), Kohl's (KSS), Williams-Sonoma (WSM), Six Flags (SIX), Foot Locker (FL), and Ralph Lauren (RL). Both UBER and LYFT also made the cut with gains of 6% since 9/2. The 30 biggest winners since 9/2 are still down an average of 20% year-to-date, while the rest of the stocks in the Russell 1,000 are up an average of 1.46% YTD.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/09/bestsince92.png))**\n\n&gt; While only one Technology stock made the list of biggest winners since 9/2, the sector accounts for two-thirds of the 30 biggest losers over the same time frame. As shown below, since 9/2, the six worst performing stocks in the Russell 1,000 and ten of the worst twelve all come from Tech. Notably, though, these 30 stocks that have all fallen more than 12% since 9/2 are still up an average of 5.6% YTD. Were it not for the horrid YTD performance of the Energy stocks that made the list, the average YTD gain would be even higher.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/09/worstsince92.png))**\n\n*****\n\n&gt; # Typical Early September Weakness Recovers Mid-Month Sells Off Month-End\n\n&gt; As of yesterday’s close the market was down more than the historical average performance in September. DJIA was down nearly -3.3%, S&amp;P 500 was down -4.8%, NASDAQ was off 7.9%, Russell 1000 was down -5.2% and Russell 2000 lost 3.7%. Today’s rally looks like the beginning of a textbook mid-month recovery rally However, the second half of September has historically been weaker than the first half. The week after options expiration week can be treacherous with S&amp;P 500 logging 23 weekly losses in 30 years since 1990. End-of-quarter portfolio restructuring, and window dressing can amplify the impacts of any negative headlines.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/75a927aee973e2c31a0d76ff0be15d59/fa78a7e1d90fbdef-fe/s500x750/8f217c04559740d2db6c24b7ea855ecd579ec195.jpg))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending September 11th, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=HKS55-50q60))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 9.13.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED!)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$FDX** \n&gt; * **$ADBE** \n&gt; * **$CBRL** \n&gt; * **$ASPU** \n&gt; * **$LEN** \n&gt; * **$DAVA** \n&gt; * **$BRC** \n&gt; * **$CMD** \n&gt; * **$ISR** \n&gt; * **$APOG** \n&gt; * **$ICMB** \n&gt; * **$HMY** \n&gt; * **$VNCE** \n&gt; * **$CSBR** \n&gt; * **$EARS** \n&gt; * **$AFIB** \n&gt; * **$OSH**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.postimg.cc/Mp84zhth/er1.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.postimg.cc/3JGV5KjX/ervol1.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 9.14.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n&gt; # ***Monday 9.14.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/1LCuH7Z.png))\n\n*****\n\n&gt; # ***Tuesday  9.15.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/IU3xGVJ.png))\n\n&gt; # ***Tuesday 9.15.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/EOC9Qwy.png))\n\n*****\n\n&gt; # ***Wednesday 9.16.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/faX2lNR.png))\n\n&gt; # ***Wednesday 9.16.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Thursday 9.17.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/CdwssKa.png))\n\n&gt; # ***Thursday 9.17.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Friday 9.18.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Friday 9.18.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # FedEx Corp. $232.79\n**FedEx Corp. (FDX)** is confirmed to report earnings at approximately 4:00 PM ET on Tuesday, September 15, 2020. The consensus earnings estimate is $2.54 per share on revenue of $17.46 billion and the Earnings Whisper ® number is $2.78 per share. Investor sentiment going into the company's earnings release has 78% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 16.72% with revenue increasing by 2.42%. Short interest has decreased by 15.4% since the company's last earnings release while the stock has drifted higher by 46.5% from its open following the earnings release to be 54.3% above its 200 day moving average of $150.90. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, August 28, 2020 there was some notable buying of 3,504 contracts of the $250.00 call expiring on Friday, September 18, 2020. Option traders are pricing in a 10.7% move on earnings and the stock has averaged a 7.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FDX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Adobe Inc. $471.35\n**Adobe Inc. (ADBE)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, September 15, 2020. The consensus earnings estimate is $2.41 per share on revenue of $3.15 billion and the Earnings Whisper ® number is $2.47 per share. Investor sentiment going into the company's earnings release has 76% expecting an earnings beat The company's guidance was for earnings of approximately $2.40 per share. Consensus estimates are for year-over-year earnings growth of 12.62% with revenue increasing by 11.15%. Short interest has decreased by 14.1% since the company's last earnings release while the stock has drifted higher by 15.2% from its open following the earnings release to be 25.2% above its 200 day moving average of $376.45. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, August 27, 2020 there was some notable buying of 18,006 contracts of the $455.00 put expiring on Friday, September 25, 2020. Option traders are pricing in a 12.5% move on earnings and the stock has averaged a 6.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ADBE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Cracker Barrel Old Country Store, Inc. $136.79\n**Cracker Barrel Old Country Store, Inc. (CBRL)** is confirmed to report earnings at approximately 8:00 AM ET on Tuesday, September 15, 2020. The consensus estimate is for a loss of $0.55 per share on revenue of $483.68 million and the Earnings Whisper ® number is ($0.49) per share. Investor sentiment going into the company's earnings release has 28% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 120.37% with revenue decreasing by 38.55%. Short interest has decreased by 2.1% since the company's last earnings release while the stock has drifted higher by 30.0% from its open following the earnings release to be 12.5% above its 200 day moving average of $121.64. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, August 27, 2020 there was some notable buying of 1,012 contracts of the $190.00 call expiring on Friday, January 15, 2021. Option traders are pricing in a 10.6% move on earnings and the stock has averaged a 2.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CBRL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Aspen Group, Inc. $11.54\n**Aspen Group, Inc. (ASPU)** is confirmed to report earnings at approximately 4:00 PM ET on Monday, September 14, 2020. The consensus estimate is for a loss of $0.04 per share on revenue of $14.26 million and the Earnings Whisper ® number is ($0.03) per share. Investor sentiment going into the company's earnings release has 49% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 63.64% with revenue increasing by 37.67%. Short interest has increased by 56.8% since the company's last earnings release while the stock has drifted higher by 16.0% from its open following the earnings release to be 32.3% above its 200 day moving average of $8.72. The stock has averaged a 11.1% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ASPU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Lennar Corp. $77.48\n**Lennar Corp. (LEN)** is confirmed to report earnings at approximately 4:35 PM ET on Monday, September 14, 2020. The consensus earnings estimate is $1.51 per share on revenue of $5.33 billion and the Earnings Whisper ® number is $1.67 per share. Investor sentiment going into the company's earnings release has 65% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 5.03% with revenue decreasing by 9.00%. Short interest has decreased by 16.5% since the company's last earnings release while the stock has drifted higher by 20.2% from its open following the earnings release to be 29.6% above its 200 day moving average of $59.78. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 8.4% move on earnings and the stock has averaged a 2.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LEN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Endava $53.03\n**Endava (DAVA)** is confirmed to report earnings at approximately 7:20 AM ET on Tuesday, September 15, 2020. The consensus earnings estimate is $0.19 per share on revenue of $107.96 million and the Earnings Whisper ® number is $0.22 per share. Investor sentiment going into the company's earnings release has 33% expecting an earnings beat The company's guidance was for earnings of $0.18 to $0.20 per share on revenue of $105.00 million to $106.00 million. Consensus estimates are for earnings to decline year-over-year by 26.92% with revenue increasing by 9.61%. Short interest has increased by 56.2% since the company's last earnings release while the stock has drifted higher by 11.1% from its open following the earnings release to be 12.7% above its 200 day moving average of $47.06. Overall earnings estimates have been revised lower since the company's last earnings release. The stock has averaged a 6.7% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DAVA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Brady Corp. $45.34\n**Brady Corp. (BRC)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, September 16, 2020. The consensus earnings estimate is $0.55 per share on revenue of $260.00 million and the Earnings Whisper ® number is $0.56 per share. Investor sentiment going into the company's earnings release has 31% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 19.12% with revenue decreasing by 11.95%. Short interest has decreased by 37.3% since the company's last earnings release while the stock has drifted higher by 0.6% from its open following the earnings release to be 7.5% below its 200 day moving average of $49.01. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 5.3% move on earnings and the stock has averaged a 2.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BRC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Cantel Medical Corp. $49.12\n**Cantel Medical Corp. (CMD)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, September 17, 2020. The consensus earnings estimate is $0.08 per share on revenue of $232.80 million and the Earnings Whisper ® number is $0.09 per share. Investor sentiment going into the company's earnings release has 39% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 87.30% with revenue decreasing by 2.79%. Short interest has decreased by 19.9% since the company's last earnings release while the stock has drifted higher by 4.5% from its open following the earnings release to be 3.7% below its 200 day moving average of $51.02. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 17.8% move on earnings and the stock has averaged a 7.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CMD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # IsoRay Inc $0.63\n**IsoRay Inc (ISR)** is confirmed to report earnings at approximately 4:15 PM ET on Thursday, September 17, 2020. The consensus estimate is for a loss of $0.01 per share on revenue of $2.77 million. Investor sentiment going into the company's earnings release has 25% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 50.00% with revenue increasing by 43.97%. Short interest has decreased by 26.8% since the company's last earnings release while the stock has drifted lower by 33.7% from its open following the earnings release to be 6.7% below its 200 day moving average of $0.68. Overall earnings estimates have been unchanged since the company's last earnings release. The stock has averaged a 8.2% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ISR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Apogee Enterprises, Inc. $19.49\n**Apogee Enterprises, Inc. (APOG)** is confirmed to report earnings at approximately 6:30 AM ET on Thursday, September 17, 2020. The consensus earnings estimate is $0.34 per share. Investor sentiment going into the company's earnings release has 19% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 52.78% with revenue increasing by 179.79%. Short interest has decreased by 4.7% since the company's last earnings release while the stock has drifted lower by 7.2% from its open following the earnings release to be 23.9% below its 200 day moving average of $25.63. Option traders are pricing in a 10.1% move on earnings and the stock has averaged a 10.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=APOG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/smallstreetbets.",
        "subreddit": "smallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning September 14th, 2020",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/irbcnd/wall_street_week_ahead_for_the_trading_week/",
        "created": 1599940960.0
    },
    {
        "author": "18845683",
        "created_utc": 1600116507,
        "id": "istrxj",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "I did some very unscientific google trends DD on ADBE to help justify my decision to hold through earnings. I took the average of 2020 Q3 and Q2 trends data, and compared to the prior year equivalent to find the increase/decrease multiple. (I frequently use this method and it has helped in the past, most recently to guide my decision to buy puts on CHWY ahead of earnings).\n\n\n[screenshot](https://i.imgur.com/nhQOEGN.png)\n\nSome points: \n\n* Very strong year over year search increase for pretty much all the major Creative Cloud apps. This is great because it's the core revenue generator for Adobe\n\n* Weaker activity for some search terms related to Enterprise. I used [this article](https://archive.is/DmcWM) to better understand Adobe's Enterprise segments. Principally Adobe provides tools to create advertising content (Creative Cloud), as well as ecommerce software analogous to Shopify (Magento), analytics software (\"Digital Experience\" entries), as well as document cloud software (Adobe Sign, Acrobat Pro, etc). \n\n&gt;* However it should be noted that using google trends is always going to be a pretty weak indicator for identifying interest in specialized B2B or data science software. It's possible search trends are mainly driven by when updates are released etc.\n\n&gt;* The weakness in the advertising industry may be hurting Adobe in the enterprise Adobe Experience Cloud segment. However, it should be noted that as far as the ad industry in general goes, [it's been display ads (image/video), as opposed to search ads, that have held up the best](https://www.emarketer.com/content/global-digital-ad-spending-update-q2-2020), explaining FB's outperformance of Google this year. Adobe serves the display ad market, with both Creative Cloud and Digital Experience applications.\n\n* Adobe Sign, analogous to Docusign's business, saw huge, sustained increase in search activity since March/April, although search trend absolute levels was much lower than Docusign. Whether that's significant or not I don't know, given that Adobe Sign may frequently be bundled with other Adobe licenses\n\n* [Q2 2020 (June) earnings call transcript](https://finance.yahoo.com/news/edited-transcript-adbe-earnings-conference-033423718.html): I haven't yet gone through and tried to tie back what I saw from my completely unscientific Trends analysis to what the expectations and successes from the Q2 earnings call were. I plan on doing this but thought I'd post what I have in case it helps anyone since earnings are 24 hours away. I recommend everyone do this at minimum if you want to use the Trends data to help inform your decision, particularly to try to interpret the apparent weakness in Enterprise trends.\n\nPositions: calls. Fuck off market makers.",
        "subreddit": "wallstreetbets",
        "title": "ADBE Q3 2020 google trends DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/istrxj/adbe_q3_2020_google_trends_dd/",
        "created": 1600145307.0
    },
    {
        "author": "rbriggs4",
        "created_utc": 1600451046,
        "id": "ivaszt",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "They just had earnings so some of the fun fun is gone, however, my friends wife who works at their place in Utah says they’re working on some pretty cool things so this might be one to at least add to your Robinhood favorites list for any upcoming bull run but right now there’s a decent dip to buy into it.\n\nPositions: ADBE 490p 9/18",
        "subreddit": "wallstreetbets",
        "title": "ADBE is the way",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ivaszt/adbe_is_the_way/",
        "created": 1600479846.0
    },
    {
        "author": "RobbBoth",
        "created_utc": 1599695704,
        "id": "ips76d",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "Hello fellow **autists** and retards, the **CORONAVIRUS** is continuously bending us over and f\\*cking us so I decided I was going to make some ***tendies*** this morning. Yall know **Adobe**, ER coming up fast and yall know how tech has been doing with these earning run ups. Jumped on it and went all in/full retard. Ik I only got $550 so if I end up broke, at least I know I got the chance to f\\*ck myself.\n\n&amp;#x200B;\n\n***Play: ADBE 570c 10/16 exp (5.20)***",
        "subreddit": "wallstreetbets",
        "title": "ADBE DD (Earnings Report 09/15) Next ZOOM (To The MOOOON)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ips76d/adbe_dd_earnings_report_0915_next_zoom_to_the/",
        "created": 1599724504.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1600203607,
        "id": "ithko3",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "Psycho Market Recap for Tuesday, September 15, 2020\n\n**Summary**\n\nThe markets opened higher today, and traded mostly sideways, to show a bit of weakness towards the end of the session, but made a quick rebound 20 minutes before close to finish mostly green. The SPY was up 0.50%, the QQQ finished up 1.41%, and the DIA was even. In contrast to the unstoppable rally that the market has showcased in the last few months, we are now entering into consolidation territory.\n\nIn relation to another COVID-19 package, according to Yahoo, House Representative Nancy Pelosi has stated that the house will remain in session until lawmakers can deliver another round of relief. However, a report published today by Bloomberg that the FED’s main street lending program, which went live two months ago, and out of the $600B that was assigned, only $1.4 have been lent out under “onerous” terms.\n\nAPPL Apple Inc had its much anticipated #ApplEvent which had a muted impact on the stock price. Some highlights were that they unveiled new Ipads, a cheaper version of the Apple Watch, and announced a fitness service. TSLA Tesla Inc is set to have its Battery Day on September 22. In anticipation of the event Elon Musk has already tweeted that there will be many new and exciting things.\n\nOn another front, some wild news regarding EV company NKLA Nikola. There have been massive price swings, a deal announced with GM General Motors, then a report on NKLA fraud, a response from the CEO Trevor Milton, and now finally today a form-4 was published where Milton bought $1.3MM worth of shares.\n\nIn Europe, Germany is reporting good economic data. Spain is the first country to cross the 600k infection threshold. The UK is having problems with unemployment rising.\n\n**Highlights**\n\n* SNOW Snowflake makes tomorrow its much-anticipated debut tomorrow and is looking for around a $100 per share listing price.\n* NVDA Nvidia had target raised by Credit Suisse Group to $620 at BUY. Needham &amp; Co. raised the target to $700 at BUY. This is a major major one as the stock currently trades at $520. A lot of eyes on Nvidia lately.\n* MRNS Maurinus Pharmaceuticals achieved positive stage 3 data and received many analyst upgrades today. The stock finished up 50%.\n* FDX FedEx Destoyed earnings after the bell! On earnings $4.72 actual vs $2.70 estimate and on Revenue $19B actual vs $17.5 estimated. Up 8% after hours\n* ADBE Adobe beats estimates as well. On Earnings $2.57 actual vs $2.41 estimate.on Revenue $3.23B actual vs $3.16 estimates. Stock was up 2% after hours.\n* NextEra Energy Inc raised its guidance for 2021 and 2022 and extended its longer-term growth forecast to 2023. Stock up 5% today.\n* JNCE Jounce Therapeutics finished up 23% on a licensing deal with GILD Gilead for an oncology treatment.\n* INO Innovio was up 20%, they presented yesterday at the H.C. Wainwright 22nd Annual Global Investment Conference.\n* APPS Digital Turbine has been on a tear! Today was up 13%\n* ABUS Arbutus Biopharma release positive data on hepatitis B study.\n* TSLA Tesla was up over 7%. They have upcoming battery day and a lot of hype around it.\n* SQ Square Inc was up 7% today on a monster run.",
        "subreddit": "stocks",
        "title": "Psycho Market Recap - Tue Sept 15 2020",
        "url": "https://www.reddit.com/r/stocks/comments/ithko3/psycho_market_recap_tue_sept_15_2020/",
        "created": 1600232407.0
    },
    {
        "author": "toughc0okies",
        "created_utc": 1600532488,
        "id": "ivvkqk",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "Listen up young autists, I am going to tell you how to make money so that you don't have to work at a Wendy's, my plan is simple.\n\n&amp;#x200B;\n\n1. Get yourself adobe creative cloud: easier if you're a student so you don't get totally cucked on the price.\n2. Start advertising your services here. People will spend their hard earned tendies and you can create memes for them. In turn you can take your proceeds and buy FDs.\n3. Profit\n\nPost in this thread if you're going to offer such a service, I need some memes made.",
        "subreddit": "wallstreetbets",
        "title": "Business Idea: Make Memes for WSB",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ivvkqk/business_idea_make_memes_for_wsb/",
        "created": 1600561288.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1599911939,
        "id": "irbaww",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/stocks. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning September 14th, 2020.\n\n# **Investors will look to the Fed to soothe the market next week, but that may be a tall order  - [(Source)](https://www.cnbc.com/2020/09/11/investors-will-look-to-the-fed-to-soothe-the-market-next-week-but-that-may-be-a-tall-order.html)**\n*****\n&gt; Markets are looking to the Federal Reserve to be a soothing force when it meets in the week ahead, but stocks could remain choppy if the central bank disappoints and as investors focus on the election and the economic recovery.\n*****\n&gt; The Fed’s two-day meeting is expected to end Wednesday with minor tweaks to its statement and some clarity on how it plans to use forward guidance. The Fed also updates its economic and interest rate outlook, including forecasts for 2023 for the first time.\n*****\n&gt; But Quincy Krosby, chief investment strategist at Prudential Financial, said the stock market could easily be disappointed because the Fed is unlikely to offer more clarity on monetary policy, such as plans for bond buying.\n*****\n&gt; “The market is concerned the Fed is not going to give us explicit readings on their plans for monetary policy,″ she said. The Fed’s extraordinary policies have been an important factor behind the stock market’s 50% surge from the March 23 low, and it’s also seen as a major factor limiting the depth of the market’s sell-off.\n*****\n&gt; Peter Boockvar, chief investment officer at Bleakley Advisory Group, said the Fed is not likely to tweak much and it continues to buy $80 billion a month in Treasurys. “I don’t think they’ll do anything to the markets either way,” he said.\n*****\n&gt; Stocks were volatile in the past week, falling hard, rallying, falling and rallying again. That left the S&amp;P 500 with a weekly decline of about 2.5%, its worst week since June. The harder hit Nasdaq was down about 4.1% for the week, its worst weekly decline since March. The quadruple expiration of options and futures at the end of the coming week could add to the volatility.\n*****\n&gt; Bank of America strategists said the bond market is watching the Fed for any balance sheet adjustments and the changes to its forward guidance, which includes the Fed’s recent tweak in its inflation policy. The Fed changed its policy of focusing on a target inflation rate to an average rate, meaning it may not tighten policy if inflation overshoots its 2% target.\n*****\n&gt; “We see risk the rates market is underwhelmed by the guidance provided by the Fed, which would support higher back-end rates and a steeper curve,” the Bank of America strategists noted. The benchmark 10-year Treasury yield slid in the past week, touching 0.67% Friday, and it could move higher, meaning bonds may sell-off, if the Fed does not clarify policy around its bond buying program.\n*****\n&gt; Krosby said the stock market is hoping for a dovish Fed. “The market needs that now because fiscal policy is going nowhere,” she said.\n*****\n&gt; BTIG strategist Julian Emanuel said the market could focus on the fact that Congress failed to make headway on fiscal stimulus, if the economic data begins to disappoint.\n*****\n&gt; Retail sales for August are expected Wednesday morning, as the Fed meets. They are expected to rise by 1%, and that should be an important look at whether the lack of enhanced unemployment benefits, which expired July 31, impacted consumer spending. Among other things, Republicans and Democrats could not agree how to replace the $600 weekly payment to the unemployed.\n*****\n&gt; “Depending on the polls and the economic data, the probability of stimulus rises and falls,” said Emanuel, head of equity and derivatives strategy.\n*****\n&gt; “Our view is that next week is just going to be lots of back and forth with the potential for a further extension of the range for the downside, if the political narrative gets more inflamed,” said Emanuel. Emanuel expects the market to remain choppy and fall further into the month of October, as investors worry about the uncertainty around the presidential election.\n*****\n&gt; The Fed’s meeting this week is its last before the election, and analysts expect Fed Chairman Jerome Powell to sound reassuring that the Fed will do whatever it takes to support the economy. Powell holds a briefing after the meeting Wednesday, and he is expected to also be asked about the potential for higher inflation. The Fed has said it is more concerned about disinflation, but recent inflation data has been hotter than expected, though still well below 2%.\n*****\n&gt; “There is a tug of war between those who say buy chips now because inflation is moving higher, versus those why are saying deflationary forces are still weaving their way into the economy,” said Krosby.\n*****\n&gt; Marc Chandler, chief market strategist at Bannockburn Global Forex, said he expects the Fed to sound reassuring but it’s not likely to discuss a target for bond purchases or the yield curve controls some investors were hoping for. Yield curve control would mean the Fed would try to manage interest rates by targeting its purchases of specific Treasurys. For instance, it may focus on trying to keep longer duration yields lower, and buy the 10-year.\n*****\n&gt; Chandler also noted the Fed’s $7 trillion balance sheet has recently declined by about $100 billion from its peak, and its bond purchases are falling behind the European Central Bank.\n*****\n&gt; “My sense is the Fed is going to keep saying it’s not worried about inflation. Its bigger worry is downside risks. They’ll repeat their call for fiscal stimulus which after this week seems less likely,” he said.\n*****\n&gt; Chandler said the stock market could remain choppy in the coming week, but he does not expect a sharp selloff. The dollar could decline, if the Fed sounds dovish, and that is a positive for stocks.\n*****\n&gt; “I don’t think a 10% pullback [in Nasdaq] has caused enough pain to have people capitulate. This is just an ordinary correction, and we’re going to make new highs,” he said.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/N5HwCxp.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/jr7e4gT.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/z7gtiCt.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.postimg.cc/5tgPKm6Y/econcal1.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/LUUHMDE.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/CWgjO92.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/c37y9mp.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/Eau1B5A.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.postimg.cc/Mp84zhth/er1.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/SHieVRq.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.postimg.cc/fTBYdV6v/upgradesdowngrades1.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.postimg.cc/05GY8WnF/upgradesdowngrades2.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.postimg.cc/qMk8gsZR/upgradesdowngrades3.png))**\n\n*****\n\n&gt; # Election Charts You Need To See: Part 1\n\n&gt; First off, our thoughts go out to everyone who was impacted by the tragic events of September 11, 2001—19 years ago today. It is a day to reflect and remember those who were lost.\n\n&gt; One of the top requests we’ve had here at LPL Research is for more charts on the election. Over the next week, we will share some of our favorite charts on this very important subject.\n\n&gt; Here’s how the S&amp;P 500 Index performs under various presidents and congressional makeups. The best scenario has historically been a Democratic president and Republican Congress, while a Republican president and Democratic Congress has been the weakest.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.11.20-Blog-Chart-1.png?ssl=1))**\n\n&gt; Building on this, a split Congress historically has been one of the best scenarios for investors.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.11.20-Blog-Chart-2.png?ssl=1))**\n\n&gt; The best scenario under a Republican president is a split Congress, a potential positive for 2020 that has played out after the massive reversal in the stock market since March.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.11.20-Blog-Chart-3.png?ssl=1))**\n\n&gt; Looking at the four-year presidential cycle shows that stocks haven’t been down during a year the president was up for a re-election since FDR in the 1940s, another bullish tailwind for 2020.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.11.20-Blog-Chart-4.png?ssl=1))**\n\n&gt; Here’s another look at this, as stocks historically have done much better when there isn’t a lame duck president.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.11.20-Blog-Chart-5.png?ssl=1))**\n\n*****\n\n&gt; # Active Managers Do an About Face\n\n&gt; The National Association of Active Investment Managers (NAAIM) has an index which tracks the exposure of its members to US equity markets. Each week, members are asked to provide a number that represents their exposure to markets. A reading of -200 means they are leveraged short, -100 indicates fully short, 0 is neutral, 100% is fully invested, and 200% indicates leveraged long. Two weeks ago, in our Bespoke Report, we highlighted the fact that the exposure index had moved to one of the highest levels in its 15-year history. Now, just two weeks later, these same active managers have reigned in their exposure considerably as this week's reading dropped from just under 100 to 53.1.\n\n&gt; This week's drop was the second-largest one week decline in the index's history and just the 10th time that the index lost more than a third (33 points) in a single week. The most recent occurrence was back in early March in the middle of the Covid crash, and every other prior period where the index saw a similar drop, the S&amp;P 500 was also down every time by an average of 2.3%. Therefore, it's not much of a surprise to see the big drop this week given the big declines in the market. But what about going forward? Do big drops in the NAAIM Index mean a bounce back for markets or further declines?\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/09/091120-NAAIM.png))**\n\n*****\n\n&gt; # The Most and Least Heavily Shorted Stocks in the Russell 1,000\n\n&gt; Below is an updated look at the most heavily shorted stocks in the Russell 1,000. Each of these 30 stocks has at least 15% of its equity float sold short.\n\n&gt; At the top of the list is Nordstrom (JWN) with 38.66% of its float sold short. With a YTD decline of 61.86%, the shorts have crushed it with JWN this year.\n\n&gt; With its huge portfolio of office and retail real estate, Brookfield Property REIT(BPYU) has the second highest short interest in the Russell 1,000 at 33.7%. BPYU is down 35.7% YTD.\n\n&gt; There are plenty of other well-known companies on the list of the most heavily shorted stocks. Examples include American Airlines (AAL), Virgin Galactic (SPCE), LendingTree (TREE), Wayfair (W), Dick's Sporting Goods (DKS), ADT, TripAdvisor (TRIP), Beyond Meat (BYND), and Kohl's (KSS).\n\n&gt; One name that is no longer on the list of most shorted stocks is Tesla (TSLA). When we provided an update on short interest back in February (a pre-COVID world), Tesla (TSLA) had more than 17% of its float sold short, but that number is all the way down to 8.3% as of the most recent filing.\n\n&gt; These 30 stocks with the highest short interest are down an average of 3.01% since last Wednesday (9/2) when the S&amp;P 500 made its last closing high. That's actually a little bit better than the 3.55% average decline for the rest of the stocks in the Russell 1,000. And year-to-date, these 30 stocks are up an average of 0.60% versus an average gain of 0.81% for the rest of the index. That's not much of a difference!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/09/most-heavily-shorted.png))**\n\n&gt; Below is a list of the 30 least shorted stocks in the Russell 1,000 as a percentage of equity float. None of these stocks have more than 0.71% of their float sold short, and they're mostly made up of more conservative names in the Health Care and Consumer Staples sectors.\n\n&gt; Johnson &amp; Johnson (JNJ) has the lowest short interest as a percentage of float in the Russell 1,000 at just 0.36%. Microsoft (MSFT) -- one of the key mega-cap Tech names -- has the second lowest short interest, followed by Merck (MRK), Eli Lilly (LLY), and Medtronic (MDT).\n\n&gt; Somewhat surprisingly, Amazon (AMZN) is the sixth least shorted stock in the entire Russell 1,000. While AMZN is still thought of as a high-flying momentum name by many investors, its short interest levels tell a much different story, painting it as more of a non-cyclical stock like Pepsi (PEP), Procter &amp; Gamble (PG), or Coca- Cola (KO).\n\n&gt; While the 30 most heavily shorted stocks in the Russell 1,000 are up 0.60% YTD, the 30 least shorted stocks in the index are up much more at +8%. This group has MSFT, AMZN, HD, and AAPL to thank for that strong performance!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/09/leastshorted.png))**\n\n*****\n\n&gt; # 5 Lessons Learned About Rising Rates\n\n&gt; While the direction of the 10-year Treasury yield over the last cycle was decidedly lower, as shown in LPL’s Chart of the Day, there were still six extended periods where it rose at least 0.75%, and in two of those it rose almost 2%. Looking ahead, economic growth below potential, slack in the labor market, and an extremely supportive Federal Reserve (Fed) may limit rate pressure in the near term, but with interest rates already low and massive stimulus in place, we believe the overall direction is likely to be higher.\n\n&gt; “Even in a falling rate period there are lessons from the last cycle about rising rates,” said LPL Financial Chief Investment Officer Burt White. “Among them: Careful when the Fed stops buying and sometimes the best defense is a good offense.”\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.9.20-Blog-Chart-1.png?ssl=1))**\n\n&gt; While every economic cycle is unique, the last cycle highlighted these key takeaways about periods of rising rates:\n\n&gt; * **Careful when the Fed stops buying.**  The two drivers of rising rates last cycle were economic growth and Fed bond purchases, also known as quantitative easing (QE). The Fed buys bonds to keep rates down, but the start of Fed buying has actually been the time when rates rise—likely on expectations that the purchases would help strengthen the economy. These periods also often followed large rate declines either because markets anticipated the start of Fed buying or the economy was faltering. The takeaway: unless the economy is really taking off, any rising-rate period may pause for an extended period, or even reverse, when the Fed backs off bond purchases.\n&gt; * **Sometime the best defense is a good offense.** Lower-quality, more economically sensitive bond sectors actually performed well during periods of rising rates during the last cycle. Rate gains were largely driven by economic improvement rather than a large pick-up in inflation, and that’s typically a good environment for sectors like high-yield bonds and bank loans. The downside is that these are much riskier bond sectors and don’t provide the potential diversification benefits of higher-quality bonds during periods of stock declines.\n&gt; * **Don’t expect TIPS to provide much resilience because of their inflation adjustment.** Treasury Inflation-Protected Securities (TIPS) are high-quality bonds that have provided a little extra insulation against rising rates compared to similarly dated Treasuries when inflation expectations increased. TIPS prices are adjusted for inflation, but even with the adjustment, they are still very sensitive to rates.\n&gt; * **Investment-grade corporates can both hurt and help.** If credit spreads narrow when rates are rising, investment-grade corporates can post some solid gains in a rising-rate environment, but if spreads are holding steady or even widening, they can be very sensitive to changes in Treasury yields, potentially (although not often) even more sensitive than Treasuries.\n&gt; * **Mortgage-backed securities (MBS)** have not provided as much insulation as corporates, but they also have had less downside. While MBS have certainly outperformed Treasuries during periods of rising rates, they have not performed as well as investment-grade corporates. But they also have come with less downside, losing only 1.4% in their worst performing period compared to a 4% loss during the worst period for corporates.\nWith the Fed still providing strong stimulus and economic growth potentially poised to accelerate, we currently see an increased risk of rates moving higher. We are playing some offense with our equity exposure, which allows us to emphasize a focus on higher-quality bonds. Among bond sectors, we are emphasizing MBS and still prefer investment-grade corporates over Treasuries. History may not repeat, but if it rhymes, this positioning may help add resilience to a fixed income portfolio if rates extend their move off recent lows.\n\n&gt; With the Fed still providing strong stimulus and economic growth potentially poised to accelerate, we currently see an increased risk of rates moving higher. We are playing some offense with our equity exposure, which allows us to emphasize a focus on higher-quality bonds. Among bond sectors, we are emphasizing MBS and still prefer investment-grade corporates over Treasuries. History may not repeat, but if it rhymes, this positioning may help add resilience to a fixed income portfolio if rates extend their move off recent lows.\n\n*****\n\n&gt; # Best and Worst Performing Stocks Since the 9/2 High\n\n&gt; Since the S&amp;P 500 and Nasdaq peaked on September 2nd, we've seen rotation out of the post-COVID winners and rotation into laggards in the value space. Below we take a look at the best and worst performing stocks in the Russell 1,000 since the 9/2 high for the S&amp;P. For each stock, we also include its YTD total return and its percentage change from the 3/23 COVID Crash low through 9/2.\n\n&gt; Capri Holdings (CPRI) is up more than any other stock in the Russell 1,000 since 9/2 with a gain of 17.43%. Even after the recent gains, however, Capri -- the holding company for brands like Michael Kors, Jimmy Choo, and Versace -- is still down 52.9% year-to-date.\n\n&gt; Only four other stocks are up more than 10% since 9/2 -- Beyond Meat (BYND), PVH, Virtu Financial (VIRT), and Reinsurance Group (RGA). Interestingly, BYND and VIRT are also up big (~80%) year-to-date, while PVH and RGA are both down more than 35% year-to-date.\n\n&gt; What stands out the most about the list of winners is that only one Technology stock made the cut -- Sabre (SABR). Most names come from the two consumer sectors including cruise-liners like Carnival (CCL), Royal Caribbean (RCL) and Norwegian Cruise (NCLH), Kohl's (KSS), Williams-Sonoma (WSM), Six Flags (SIX), Foot Locker (FL), and Ralph Lauren (RL). Both UBER and LYFT also made the cut with gains of 6% since 9/2. The 30 biggest winners since 9/2 are still down an average of 20% year-to-date, while the rest of the stocks in the Russell 1,000 are up an average of 1.46% YTD.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/09/bestsince92.png))**\n\n&gt; While only one Technology stock made the list of biggest winners since 9/2, the sector accounts for two-thirds of the 30 biggest losers over the same time frame. As shown below, since 9/2, the six worst performing stocks in the Russell 1,000 and ten of the worst twelve all come from Tech. Notably, though, these 30 stocks that have all fallen more than 12% since 9/2 are still up an average of 5.6% YTD. Were it not for the horrid YTD performance of the Energy stocks that made the list, the average YTD gain would be even higher.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/09/worstsince92.png))**\n\n*****\n\n&gt; # Typical Early September Weakness Recovers Mid-Month Sells Off Month-End\n\n&gt; As of yesterday’s close the market was down more than the historical average performance in September. DJIA was down nearly -3.3%, S&amp;P 500 was down -4.8%, NASDAQ was off 7.9%, Russell 1000 was down -5.2% and Russell 2000 lost 3.7%. Today’s rally looks like the beginning of a textbook mid-month recovery rally However, the second half of September has historically been weaker than the first half. The week after options expiration week can be treacherous with S&amp;P 500 logging 23 weekly losses in 30 years since 1990. End-of-quarter portfolio restructuring, and window dressing can amplify the impacts of any negative headlines.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/75a927aee973e2c31a0d76ff0be15d59/fa78a7e1d90fbdef-fe/s500x750/8f217c04559740d2db6c24b7ea855ecd579ec195.jpg))**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.postimg.cc/Mp84zhth/er1.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.postimg.cc/3JGV5KjX/ervol1.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 9.14.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n&gt; # ***Monday 9.14.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/1LCuH7Z.png))\n\n*****\n\n&gt; # ***Tuesday  9.15.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/IU3xGVJ.png))\n\n&gt; # ***Tuesday 9.15.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/EOC9Qwy.png))\n\n*****\n\n&gt; # ***Wednesday 9.16.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/faX2lNR.png))\n\n&gt; # ***Wednesday 9.16.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Thursday 9.17.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/CdwssKa.png))\n\n&gt; # ***Thursday 9.17.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Friday 9.18.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Friday 9.18.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # FedEx Corp. $232.79\n**FedEx Corp. (FDX)** is confirmed to report earnings at approximately 4:00 PM ET on Tuesday, September 15, 2020. The consensus earnings estimate is $2.54 per share on revenue of $17.46 billion and the Earnings Whisper ® number is $2.78 per share. Investor sentiment going into the company's earnings release has 78% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 16.72% with revenue increasing by 2.42%. Short interest has decreased by 15.4% since the company's last earnings release while the stock has drifted higher by 46.5% from its open following the earnings release to be 54.3% above its 200 day moving average of $150.90. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, August 28, 2020 there was some notable buying of 3,504 contracts of the $250.00 call expiring on Friday, September 18, 2020. Option traders are pricing in a 10.7% move on earnings and the stock has averaged a 7.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FDX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Adobe Inc. $471.35\n**Adobe Inc. (ADBE)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, September 15, 2020. The consensus earnings estimate is $2.41 per share on revenue of $3.15 billion and the Earnings Whisper ® number is $2.47 per share. Investor sentiment going into the company's earnings release has 76% expecting an earnings beat The company's guidance was for earnings of approximately $2.40 per share. Consensus estimates are for year-over-year earnings growth of 12.62% with revenue increasing by 11.15%. Short interest has decreased by 14.1% since the company's last earnings release while the stock has drifted higher by 15.2% from its open following the earnings release to be 25.2% above its 200 day moving average of $376.45. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, August 27, 2020 there was some notable buying of 18,006 contracts of the $455.00 put expiring on Friday, September 25, 2020. Option traders are pricing in a 12.5% move on earnings and the stock has averaged a 6.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ADBE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Cracker Barrel Old Country Store, Inc. $136.79\n**Cracker Barrel Old Country Store, Inc. (CBRL)** is confirmed to report earnings at approximately 8:00 AM ET on Tuesday, September 15, 2020. The consensus estimate is for a loss of $0.55 per share on revenue of $483.68 million and the Earnings Whisper ® number is ($0.49) per share. Investor sentiment going into the company's earnings release has 28% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 120.37% with revenue decreasing by 38.55%. Short interest has decreased by 2.1% since the company's last earnings release while the stock has drifted higher by 30.0% from its open following the earnings release to be 12.5% above its 200 day moving average of $121.64. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, August 27, 2020 there was some notable buying of 1,012 contracts of the $190.00 call expiring on Friday, January 15, 2021. Option traders are pricing in a 10.6% move on earnings and the stock has averaged a 2.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CBRL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Aspen Group, Inc. $11.54\n**Aspen Group, Inc. (ASPU)** is confirmed to report earnings at approximately 4:00 PM ET on Monday, September 14, 2020. The consensus estimate is for a loss of $0.04 per share on revenue of $14.26 million and the Earnings Whisper ® number is ($0.03) per share. Investor sentiment going into the company's earnings release has 49% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 63.64% with revenue increasing by 37.67%. Short interest has increased by 56.8% since the company's last earnings release while the stock has drifted higher by 16.0% from its open following the earnings release to be 32.3% above its 200 day moving average of $8.72. The stock has averaged a 11.1% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ASPU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Lennar Corp. $77.48\n**Lennar Corp. (LEN)** is confirmed to report earnings at approximately 4:35 PM ET on Monday, September 14, 2020. The consensus earnings estimate is $1.51 per share on revenue of $5.33 billion and the Earnings Whisper ® number is $1.67 per share. Investor sentiment going into the company's earnings release has 65% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 5.03% with revenue decreasing by 9.00%. Short interest has decreased by 16.5% since the company's last earnings release while the stock has drifted higher by 20.2% from its open following the earnings release to be 29.6% above its 200 day moving average of $59.78. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 8.4% move on earnings and the stock has averaged a 2.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LEN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Endava $53.03\n**Endava (DAVA)** is confirmed to report earnings at approximately 7:20 AM ET on Tuesday, September 15, 2020. The consensus earnings estimate is $0.19 per share on revenue of $107.96 million and the Earnings Whisper ® number is $0.22 per share. Investor sentiment going into the company's earnings release has 33% expecting an earnings beat The company's guidance was for earnings of $0.18 to $0.20 per share on revenue of $105.00 million to $106.00 million. Consensus estimates are for earnings to decline year-over-year by 26.92% with revenue increasing by 9.61%. Short interest has increased by 56.2% since the company's last earnings release while the stock has drifted higher by 11.1% from its open following the earnings release to be 12.7% above its 200 day moving average of $47.06. Overall earnings estimates have been revised lower since the company's last earnings release. The stock has averaged a 6.7% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DAVA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Brady Corp. $45.34\n**Brady Corp. (BRC)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, September 16, 2020. The consensus earnings estimate is $0.55 per share on revenue of $260.00 million and the Earnings Whisper ® number is $0.56 per share. Investor sentiment going into the company's earnings release has 31% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 19.12% with revenue decreasing by 11.95%. Short interest has decreased by 37.3% since the company's last earnings release while the stock has drifted higher by 0.6% from its open following the earnings release to be 7.5% below its 200 day moving average of $49.01. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 5.3% move on earnings and the stock has averaged a 2.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BRC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Cantel Medical Corp. $49.12\n**Cantel Medical Corp. (CMD)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, September 17, 2020. The consensus earnings estimate is $0.08 per share on revenue of $232.80 million and the Earnings Whisper ® number is $0.09 per share. Investor sentiment going into the company's earnings release has 39% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 87.30% with revenue decreasing by 2.79%. Short interest has decreased by 19.9% since the company's last earnings release while the stock has drifted higher by 4.5% from its open following the earnings release to be 3.7% below its 200 day moving average of $51.02. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 17.8% move on earnings and the stock has averaged a 7.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CMD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # IsoRay Inc $0.63\n**IsoRay Inc (ISR)** is confirmed to report earnings at approximately 4:15 PM ET on Thursday, September 17, 2020. The consensus estimate is for a loss of $0.01 per share on revenue of $2.77 million. Investor sentiment going into the company's earnings release has 25% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 50.00% with revenue increasing by 43.97%. Short interest has decreased by 26.8% since the company's last earnings release while the stock has drifted lower by 33.7% from its open following the earnings release to be 6.7% below its 200 day moving average of $0.68. Overall earnings estimates have been unchanged since the company's last earnings release. The stock has averaged a 8.2% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ISR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Apogee Enterprises, Inc. $19.49\n**Apogee Enterprises, Inc. (APOG)** is confirmed to report earnings at approximately 6:30 AM ET on Thursday, September 17, 2020. The consensus earnings estimate is $0.34 per share. Investor sentiment going into the company's earnings release has 19% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 52.78% with revenue increasing by 179.79%. Short interest has decreased by 4.7% since the company's last earnings release while the stock has drifted lower by 7.2% from its open following the earnings release to be 23.9% below its 200 day moving average of $25.63. Option traders are pricing in a 10.1% move on earnings and the stock has averaged a 10.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=APOG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/stocks.",
        "subreddit": "stocks",
        "title": "Wall Street Week Ahead for the trading week beginning September 14th, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/irbaww/wall_street_week_ahead_for_the_trading_week/",
        "created": 1599940739.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1600115739,
        "id": "istiiq",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": " **PyschoMarket Recap - Monday, September 14, 2020**\n\nStocks rose Monday as investors eyes newly announced mergers &amp; acquisitions, positive vaccine news, and a lowering coronavirus infection rate in hotspot states. Tech shares appear to be recovering, opening the day high before paring gains to finish mostly even.\n\nToday it was announced Oracle (ORCL) made a deal with TikTok parent company ByteDance to become the company’s “trusted technology provider.” The new deal between TikTok and Oracle comes after Microsoft Corporation (MSFT) said Sunday that ByteDance had rejected its buyout offer. National Security Concerns: On Monday, U.S. Treasury Secretary Steven Mnuchin said he will be reviewing the proposed deal between ByteDance and Oracle this week. “I will just say from our standpoint, we’ll need to make sure that the code is, one, secure, Americans’ data is secure, that the phones are secure and we’ll be looking to have discussions with Oracle over the next few days with our technical teams,” Mnuchin said.\n\nElsewhere, NVIDIA (NVDA) announced it was purchasing Arm, semiconductor and software design company from SoftBank Group for $40 billion, the largest ever M&amp;A in the semiconductor industry. Jensen Huang, the CEO of NVIDIA, said “ Uniting NVIDIA’s AI computing capabilities with the vast ecosystem of Arm’s CPU, we can advance computing from the cloud, smartphones, PCs, self-driving cars and robotics, to edge IoT, and expand AI computing to every corner of the globe. \n\nGilead (GILD) announced it was acquiring biotech company Immunomedics (IMMU) for $21 billion. Immunomedics developed Trodelvy, an antibody-drug conjugate used to treat triple-negative breast cancer. Trodelvy received FDA approval in April and recorded $20 million in sales in its first two months on the market. Shares of GILD were up 2.22% and IMMU finished 97% up.\n\nAstraZeneca (AZN) announced over the weekend that its late-stage Covid-19 vaccine trials with the University of Oxford resumed after safety concerns over a suspected adverse reaction from a participant made the company pause trials temporarily last week. Shares rose 0.52% today. \n\nAndrew Cuomo reported today, “Of the 63,358 tests reported yesterday, 583 were positive (0.92% of total). Total hospitalizations are at 464. Sadly, there were 4 COVID fatalities yesterday.” The numbers in New York have been steadily decreasing, according to a chart accompanying the statement.\n\n**Highlights**\n\n* DraftKings (DKNG) says it entered into a multi-year agreement with ESPN to become a co-exclusive sportsbook link-out provider and exclusive daily fantasy sports provider of the media giant. DKNG finished the day 17.27% up.\n* Nikola (NKLA), recently published their response to the fraud allegations being levied at the company and its founder, Trevor Milton.\n* NFL Media and DISH Network (DISH) have reached an agreement on a new multi-year contract for NFL Network and NFL RedZone.\n* Snowflake (SNOW) lifts IPO price to $100-110 range. IPO date expected Wednesday. Keep a close eye out!\n* Overstock (OSTK) coverage initiated by Needham &amp; Company Llc. $96 at BUY (implies a 20% upside). \n* Penn International Gaming (PENN) reiterated by Goldman Sachs $66 BUY\n* Micron Technology (MU) upgraded by[ ](https://twitter.com/search?q=%24GS&amp;src=cashtag_click)Goldman Sachs (GS) $58 NEUTRAL to BUY.\n* Apple (AAPL) reiterated by Oppenheimer at BUY $125\n* \\-Adobe (ADBE) Target Raised by Morgan Stanley (MS) $450 to $560 OVERWEIGHT",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today, Sept 14. Enjoy!",
        "url": "https://www.reddit.com/r/stocks/comments/istiiq/here_is_a_market_recap_for_today_sept_14_enjoy/",
        "created": 1600144539.0
    },
    {
        "author": "FilipeBarroso",
        "created_utc": 1600545499,
        "id": "ivzmp2",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "I come here after some time since my last post to update my you guys about my financial life.\n\nMy objective with this post is to receive criticisms and opinions about the portfolio that I am \"creating\". (don't be sweet)\n\nOn August 7th I turned 18 and the \"first\" thing I did besides enjoying the day with my family, etc ... was opening my account at Degiro and Trading 212.\n\nOn Degiro I have bought the ETF IWDA. I still have very little money (3 positions) but I intend to continue buying this ETF every month for the next few years. In other words, this will be my main investment focus.\n\nIn trading 212 I have in mind to do the following. I created with this new feature of the pies, 2 pies.\n\nOne with 10 stocks focused on Tech (Apple, Facebook, Amazon, Tesla, Google, Microsoft, Nvidia, Adobe, Paypal, Shopify) I do not intend to \"trade\" with these shares. The goal is to consistently invest and hold. No panic sells. I invest not because they are popular, but because I believe in the companies.\n\nThe other pie is aimed at ESG and renewable energy companies. Companies that, due to the little research I did, seem very promising (NextEra Energy, Brookfield Renewable Partners, Nvidia, PlugPower, FuelCell)\n\nResuming:\n\nDo you think it's a good strategy to do this?\n\nMy Investment focus on Degiro, putting most of my money on the IWDA, and on Trading, investing in the 2 pies I told you about. My idea is to have something safer at Degiro, and to be aggressive at Trading.\n\nLeave your opinions, criticisms and suggestions for portfolios.\n\nI still have time to change because I am very young and I only have 220 euros invested in total on both platforms.\n\nThank you!!!!",
        "subreddit": "investing",
        "title": "My portfolio at 18y",
        "url": "https://www.reddit.com/r/investing/comments/ivzmp2/my_portfolio_at_18y/",
        "created": 1600574299.0
    },
    {
        "author": "islandcactus",
        "created_utc": 1599754454,
        "id": "iq6f5h",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "Hey Folks,\n\nCan y’all please help me around these interwebs. I’m an old timer from a generation that’s lost.\n\nI bought a few shares and I need an app or website that can give me not only an updated value but also the current stock price.\n\nSo say if I bought one share at ACME at 10$ and it’s gone up to 25$ all I want is a a website that shows that and not just how many percentages it’s gone up.\n\nI have tried marketwatch, Yahoo finance but none of them have proper portfolio values.\n\nBonus question: what is that number next to the percentage, under the symbol in Yahoo finance mean? Ie: Adobe is +8.77.\n\nPlease help I fried my brains smoking some crap in the 60s then blew it in Nam!\n\nThank you!",
        "subreddit": "stocks",
        "title": "Please help an idiot?",
        "url": "https://www.reddit.com/r/stocks/comments/iq6f5h/please_help_an_idiot/",
        "created": 1599783254.0
    },
    {
        "author": "mihnealazar",
        "created_utc": 1599411661,
        "id": "inpkox",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Hi, I've been a long time fan and user of their products and now that I've started investing, I was thinking of buying some.\nThe price seems a little too high, but, in the long run I believe they will grow nicely.\nWhat do you guys think?\nThanks!",
        "subreddit": "stocks",
        "title": "Thoughts on Adobe?",
        "url": "https://www.reddit.com/r/stocks/comments/inpkox/thoughts_on_adobe/",
        "created": 1599440461.0
    },
    {
        "author": "cclagator",
        "created_utc": 1600103382,
        "id": "isp6cb",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Volatility spiked into last week expecting a follow-through to the tech sell-off that did not come to fruition. With the market bounce today VIX is even lower and expected moves continuing to contract. Below is a recap and a look ahead. Not a ton of earnings this week, overall market and economic trends will begin to dominate, but we will hear from Fedex and Adobe. Let me know if you have any questions or want to see something added. Links to images of expected moves charts. Full post on [optionseye](https://www.optionseye.com/expected-moves-for-the-week-ahead-spy-qqq-and-more/).\n\n&amp;#x200B;\n\n**Last Week**\n\nOptions prices started last week pricing in a possible big move lower in the indices. When that didn't come to fruition (actual moves finished the week much smaller than expected moves) volatility compressed a bit:\n\n* VIX closed Friday at 26.87, down on the week (from the low 30's).\n* Last week's expected move in SPY: 2.8%\n* Last week’s actual move SPY: -1.0%\n* Last week's expected move in QQQ: 4.6%\n* Last week's actual move in QQQ: -0.8%\n\n&amp;#x200B;\n\n**This Week**\n\nNote the smaller expected moves for this week, despite the fact that last week had one less day of trading:\n\nThis week’s expected move in SPY, via Options AI technology: 2.5% [chart](https://www.optionseye.com/content/images/2020/09/Screen-Shot-2020-09-14-at-7.02.32-AM.png)\n\nThis week’s expected move in QQQ: 3.3%\n\n&amp;#x200B;\n\nhttps://preview.redd.it/twkh0mrya5n51.png?width=507&amp;format=png&amp;auto=webp&amp;s=dc17bc8e75d14bedd9b92f3846e1ea2c88fd6491\n\nAnd here's how two of the most-watched stocks at the moment, Tesla and Apple's moves compare with the big indices over the next month, and for this week:\n\n&amp;#x200B;\n\nhttps://i.redd.it/nfnliex3b5n51.gif\n\n**Earnings of Note**\n\nEarnings announcements are light this week as we're in the lull between quarters. This week's earnings of note, expected move, and its actual move last earnings.\n\n**Monday 4:35pm - LEN |** expected move: 6.1%  (last earnings: +0.7%) [chart](https://www.optionseye.com/content/images/2020/09/Screen-Shot-2020-09-14-at-7.07.10-AM.png)\n\n**Tuesday 8:00am - CBRL |** expected move: 6.5%  (last earnings: -0.6%) [chart](https://www.optionseye.com/content/images/2020/09/Screen-Shot-2020-09-14-at-7.11.18-AM.png)\n\n**Tuesday 4:00pm - FDX |** expected move: 8.7%  (last earnings: +11.7%) [chart](https://www.optionseye.com/content/images/2020/09/Screen-Shot-2020-09-14-at-7.14.46-AM.png)\n\n**Tuesday 4:05pm - ADBE |** expected move: 7.0%  (last earnings: +4.9%) [chart](https://www.optionseye.com/content/images/2020/09/Screen-Shot-2020-09-14-at-7.16.21-AM.png)\n\n&amp;#x200B;\n\n**Economic Data of Note**\n\nOn the Economic Data front, we'll see retail sales on Wednesday (morn) and homebuilder and housing starts data on Wednesday and Thursday (morn).\n\n**XRT - Retail ETF** expected move: 2.9% [chart](https://www.optionseye.com/content/images/2020/09/Screen-Shot-2020-09-14-at-7.24.58-AM.png)\n\n**XHB - Homebuilders ETF** expected move: 2.6% [chart](https://www.optionseye.com/content/images/2020/09/Screen-Shot-2020-09-14-at-7.25.54-AM.png)",
        "subreddit": "options",
        "title": "Options moves for this week, SPY, QQQ AAPL, TSLA ADBE and more.",
        "url": "https://www.reddit.com/r/options/comments/isp6cb/options_moves_for_this_week_spy_qqq_aapl_tsla/",
        "created": 1600132182.0
    },
    {
        "author": "Summebride",
        "created_utc": 1599874767,
        "id": "ir3quq",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Even since March recovery, $ADBE seems less than fully valued.  They have no competition, crazy high margins, and an increasingly loyal and captive subscription base.  They benefit from having feet in both tech/software and cloud.  \n\nIt's down 10% from the prior high which indicates at least a credible floor for the next wave, and the price has held nicely during a week with a lot of blood.  \n\nLots of stocks can be over or under valued, but they don't get repriced until there's some event that makes market participants rethink their stance.  Sometimes it's analyst coverage, sometimes it's a market correction, and maybe, in this case, it's a strong earnings report?",
        "subreddit": "stocks",
        "title": "$ADBE into earnings?",
        "url": "https://www.reddit.com/r/stocks/comments/ir3quq/adbe_into_earnings/",
        "created": 1599903567.0
    },
    {
        "author": "Napalm32",
        "created_utc": 1600117242,
        "id": "isu0h9",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "ADBE earnings is happening tomorrow. This should be a wild ride. I'm bullish on ADBE. Their software is solid and I see them as a long term play. I think they'll see a pop in price if they don't disappoint tomorrow. Thoughts?",
        "subreddit": "stocks",
        "title": "ADBE Earnings Hype!",
        "url": "https://www.reddit.com/r/stocks/comments/isu0h9/adbe_earnings_hype/",
        "created": 1600146042.0
    },
    {
        "author": "swaggymedia",
        "created_utc": 1601215901,
        "id": "j0rqo7",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "What's up people of stocks, some of you may have seen my unusual options activity posts in other option's trading sub-reddits. I've decided to put together a little summary for the week that details some trending tickers, option activity, and some setups for next week ( + reasoning for the setup). Mods if this isn't allowed, I won't post again. Here we go:\n\n&amp;#x200B;\n\n# Upcoming Earnings\n\nMicron (MU) Earnings are coming up this week. The semi-conductor company has been consistently beating earnings and has seen some growth throughout the pandemic as more companies become increasingly tech-focused with work-from-home orders. Here’s a snapshot of their most recent earnings and performance moves day-after the report. \n\n[https://imgur.com/stDsUEx](https://imgur.com/stDsUEx)\n\n**What to look for**\n\nBy proxy, companies that will see some related movements to MU’s earnings are: AMD, INTC, and NVDA. A good showing from MU will also mean good things for other semi-conductor companies.\n\nHere’s a look at MU’s average options’ Implied Volatility (IV) over the last month. We can see that typical IV is in the 40-45% range. When the stock price dropped early September during the crash, we saw IV get up to the 60’s. IV has begun to dip back into the 40’s meaning there is not a huge move expected off the earnings report. (Stock price is gold vs IV blue line). \n\n[https://imgur.com/87nthwQ](https://imgur.com/87nthwQ)\n\n# Economic Calendar\n\nWe have some important economic data coming out this week. Here’s the outlook:\n\nTuesday 10am: Consumer Confidence\n\nWednesday 8:30am: GDP Q2, Pending Home Sales\n\nThursday 8:30am: Jobless claims\n\nFriday 8:30am: Unemployment Rate\n\n**Full Calendar of Important Events w/ Forecasts (via Bloomberg):** \n\n[https://imgur.com/1XEHPyC](https://imgur.com/1XEHPyC)\n\n# Trending Stocks\n\nMost Mentioned Tickers + Sentiment from Friday \n\n[https://imgur.com/jTw7JiO](https://imgur.com/jTw7JiO)\n\n# This week’s trend gainers and losers\n\n**Losing Hype:** TSLA, VALE, NKLA, MSFT, WMT, AAPL\\*\n\n[https://imgur.com/0wdvTJB](https://imgur.com/0wdvTJB)\n\n**Gaining Hype:** BA, VXX, ZM, AAL, UPS, PTON, MU\n\n[https://imgur.com/hpakS2h](https://imgur.com/hpakS2h)\n\n\\*AAPL was losing hype on the weekly trend, but up on the daily trend Thursday &amp; Friday from a good performance.  \n\n# Consolidating Tickers\n\nThese tickers are ones that have once been a “meme”, but have since settled down, and perhaps a good entry point if your technicals are right, it aligns with your strategy, and want to avoid FOMO-ing into hot stocks. \n\n[https://imgur.com/5YsYE1a](https://imgur.com/5YsYE1a)\n\n# The classic tale of doing the inverse of WSB\n\nToday we’ll take a look at VALE, a stock that was almost never mentioned a single time in the last month on r/WallStreetBets until September 18th. At that point, the stock had risen 10% in the week before and VALE was then seen all over the comment section of the sub. Comment volume for VALE jumped to 10% of total comment volume on the sub-reddit at which point many WSB members initiated positions. Within the next several trading days the stock tanked 15% leaving WSB holding the bag (yet again). For more details on this, please read “How not to FOMO into trades”. \n\n[https://imgur.com/oZ7xY0B](https://imgur.com/oZ7xY0B)\n\n**Swaggy DD (due diligence) released this week - GME (Gamestop)** \n\n**I. INTRODUCTION**\n\nWhen I look at the sentiment surrounding GameStop, it doesn’t take very long to see comments like these, yet here we are. What’s going on? Are people that stupid? Just jumping on the new console cycle? Idiots not pulling their gains and going to zero? When even r/wallstreetbets thinks the stock is a dud, it must be right? Nearly 120% short interest, yet the stock is up nearly 40% this week.\n\nIts no secret GameStop has been hurting. The secular shift to digital has been pressuring them for some time with their highest margin category - used video software – under significant distress. Each year their gross margins contract with net income in the red these past few quarters. Everybody has written them off as the easiest short in the world, however I'm going to try to explain whats going on and tell you that buying GameStop may not be as bad as you think.\n\n**II. CONSOLES**\n\nJust to start things off, you have to remember we’re in the beginnings of the new console cycle. But what does that even mean? Well the advent of new consoles means new trade-ins, new product, new customers, and a fresh spike in GameStop’s popularity. Sales have stagnated the years prior, and they are all but certain to go up and remain elevated for the next 1-2 years. Note that against all counts, the company was actually profitable during the 2019 holiday season, with new consoles you can bet that they will annihilate all expectations and proceed into 4-8 more positive quarters off the cyclic shift. This is pretty unanimous, and everyone accepts that they will start reporting positive going forward. In fact, new console cycles are where GME has historically spiked.\n\n[Click here to continue reading the DD](https://www.reddit.com/r/wallstreetbets/comments/ivs6dw/bankrupting_institutional_investors_for_dummies/)\n\n# Swaggy Play &amp; Trade Idea - JPM\n\nWhat's up everyone, market has been choppy as FK and almost un-tradeable the last several weeks. Still, not much has changed fundamentally over the last 3-4 weeks and here we are with a 10-20% haircut on stocks depending which tickers you follow. I've been sitting on my hands for a while, but entered a trade today. Keep in mind this is not advice on what or how to trade, simply posting my trade here and if you want to discuss some opinions, lets do it.\n\nWhy JPM? It has been in a fairly tight channel over the last 3-4 months, staying in the range of $90-100. I entered this exact play back in July when the stock dropped to similar levels to where it is currently at right now, and closed at max profit back then. \n\n[Check out the full play details (reasoning + risks)](https://www.reddit.com/r/SwaggyStocks/comments/izmt2r/swaggyplay_trade_idea_jpm/)\n\n# Unusual Option Activity\n\nSome big volume in option flow was spotted this week in some names: AAPL, ADBE, C, CLDR, ORCL, PBR, and WRTC.\n\n**ADBE – Adobe**\n\nADBE saw a massive call block come through on Friday. 5,000 January 2021 CALLs at the $420 strike (10% ITM). Total position size was $40 million. ADBE was about 10-15% off the recent highs and has bounced multiple times off the $470 level. IF this sell-off is truly over, we might see a good bounce in tech and some of these block purchases seem to be positioning for it. \n\n[Read Full Post: Weekly Option Flow Summary, Week of Sept 20-2020: AAPL, ADBE, C, CLDR, ORCL, PBR, WRTC](https://www.reddit.com/r/options/comments/j0rev4/unusual_option_flow_summary_for_the_week_aapl/)\n\n**What’s on the watchlist this week**\n\nStill looking for a bounce in tech. Here are some stocks I either like and have a position or I’m looking for entry points on (stock price + Implied Volatility charts)\n\n**AAPL - Apple**  \n\nAAPL is currently near a short-term low. Does it have room to go down more? Sure, but I think when you dig below the current levels you will be finding more buyers as we get closer to $100. IMO a good entry point for a long-term hold. IV is also moderately high for options. They are set to report earnings by end of October and also have catalyst of rumored 5g iPhone release.\n\n**AMD - Advanced Micro Devices**  \n\nAMD has shown some strength at the $78 level of support through these last few weeks of downside pressure. AMD also reports towards the end of October, but will have some volatility into MU (Micron Technology) earnings next week. IV is pretty high right now for AMD to buy calls. A more efficient play might be to sell CSP (cash-secured put), credit PUT spreads, or purchase shares.\n\n**DOCU - Docusign**  \n\nA second-wave covid-play I’m looking at is DOCU. DOCU just reported earnings that weren’t accepted well by Wall Street. The stock has dropped nearly 30% since it’s peak of $290 not long ago. You can also see the IV has dropped significantly after earnings. Average IV was as high as 140% pre-earnings and is now sitting around 55%. IMO this is a fundamentally strong company with solid branding. If you’ve ever needed to sign important documents online, chances are you’ve used Docusign before and it is quickly becoming a household name. I like this play for a long-term hold and also as we get into the fall months as a covid play.",
        "subreddit": "stocks",
        "title": "Swaggy's weekend summary of unusual option activity, trending tickers, and some setups for next week.",
        "url": "https://www.reddit.com/r/stocks/comments/j0rqo7/swaggys_weekend_summary_of_unusual_option/",
        "created": 1601244701.0
    },
    {
        "author": "BeernerdoMazzeroli",
        "created_utc": 1600703350,
        "id": "ix2zq2",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Position: FEZ Jan15'21 42 PUT\n\nIt's time to get bearish boys. I will never bet against America because it's the greatest fucking country on earth, but our Euro brethren are fair game. \n\nThe Eurostoxx index have largely traded equally or somewhat better than the SNP thus far. I have taken a short position against the Eurostoxx due to the following reasons:\n\nHard Brexit: Two weeks ago prime minister Johnson introduced a bill that is in direct contradiction to previous agreements. His defense was basically that Europe can go eat shit, no reason needed. Germany is Europe's enforcer, however the COVID pandemic has lead to a dry run of a hard brexit and German exports largely survived. This time around they will be much less likely to fight against a hard Brexit seeing as how it's been in place for the majority of the year in any case.\n\nBanking scandals: Obvious reason. The EU economy is heavily reliant on it's banking sector. This sector is terrible and will continue lower.\n\nCOVID peeking it's ugly head again: The seven day MA of new covid cases are at all time highs in EU countries. I could give a shit about COVID, but our EU brethren are likely to implement another round of lockdowns, much more so than the USA.  American case counts are down but Europe has steadily been ticking higher.\n\nNo tech: No Amazon, no Adobe, no PayPal to save their market.\n\nCurrency: In a time of severely limited economic growth countries cannot afford to let their currencies rally, we've seen this before. I causes severe deflation and weakened financial asset prices.\n\nLack of fiscal stimulus: As usual the EU will be late to the party with further fiscal stimulus.\n\nThe timing seems perfect to open this position and option volatility on FEZ is still low. Cheers.",
        "subreddit": "wallstreetbets",
        "title": "Monday Night Bear Orgy: Time to short Europe",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ix2zq2/monday_night_bear_orgy_time_to_short_europe/",
        "created": 1600732150.0
    },
    {
        "author": "babybrazil",
        "created_utc": 1599150130,
        "id": "ilwnmg",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Can you degenerates post your losses so us long term players feel better about our portfolio today? Haven’t been down 5 digits in a while. Cheer us up. Also load up on Nvidia and adobe calls.",
        "subreddit": "wallstreetbets",
        "title": "Dear FDs Players",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ilwnmg/dear_fds_players/",
        "created": 1599178930.0
    },
    {
        "author": "allpleasurenopain",
        "created_utc": 1600216197,
        "id": "itl4x4",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "U.S. stock futures were flat in overnight trading as investors readied for comments from the Federal Reserve on Wednesday. \n\nDow futures dipped 20 points. S&amp;P 500 and Nasdaq 100 futures were also set to open flat, with losses of 0.05% and 0.07%, respectively.\n\nBetter-than-expected earnings from FedEx and Adobe after the bell boosted sentiment. FedEx released a blowout quarter with earnings $2.18 per share above analyst estimates, fueled by the e-commerce boom. The shipping company rallied more than 9% in extended trading. Adobe jumped 2% after hours. \n\nOn Tuesday, the Dow closed up marginally, after gaining more than 200 points earlier in the session. Apple shares came off their highs following the technology giant’s new product event, dragging down the 30-stock average following its new product event.\n\nThe S&amp;P 500 climbed 0.5%, despite weakness in financials. Tuesday marked the third straight day of gains for the 500-stock index. \n\nTechnology stocks continued their broad based rally. The Nasdaq Composite rose 1.2%, bringing its week to date gain to more than 3%. The technology heavy index dipped in correction territory last week and suffered its worst weekly performance since March.\n\nPositive economic data in the U.S. and China on Tuesday boosted sentiment on Tuesday. \n\n“Optimism is being supported by a continual flow of good economic news, healthy earnings news and the prospect of getting more comforting news from the Federal Reserve tomorrow suggesting they remain committed to letting the recovery run hot while continuing to provide supportive policies,” Jim Paulsen, chief investment strategist at the Leuthold Group, told CNBC. \n\nWednesday marks the second day of the Federal Reserve policy’s meeting, the first since Chairman Jerome Powell unveiled a policy shift toward greater tolerance of inflation, effectively pledging to keep interest rates low for longer. Investors widely expect the central bank to maintain is downbeat stance on the economy.\n\nThe Federal Open Market Committee will provide its quarterly update on its estimates for GDP, unemployment and inflation. The central bank could provide clearer guidance on what it will take to raise rates in the future.\n\n“The Fed doesn’t like to be involved in politics, even though its inherently a political institution but two months before an election is a very difficult time to put your politics aside,” David Zervos, chief market strategist at Jefferies, said on CNBC’s “Closing Bell” on Tuesday. “You just have to expect that there’s going to be some thought to politics. \n\nOne of the hottest initial public offerings of 2020 will open for trading on Wednesday. Data storage software company Snowflake is priced at 30 times forward revenue and even got a rare vote of confidence from Berkshire Hathaway. Snowflake expects to go public at a share price between $100 and $110, according to an updated S-1 filing from Monday.\n\nAugust retail sales data will be released at 8:30 a.m. on Wednesday. Analysts polled by FactSet are expecting an increase of 1.1%, compared to July’s 1.2% rise. ",
        "subreddit": "StockMarket",
        "title": "Stock futures flat as investors await Fed meeting",
        "url": "https://www.reddit.com/r/StockMarket/comments/itl4x4/stock_futures_flat_as_investors_await_fed_meeting/",
        "created": 1600244997.0
    },
    {
        "author": "OP_rah",
        "created_utc": 1600265314,
        "id": "itw843",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Yesterday I sold a Sept 18 460/462.5/530/532.5 IC in ADBE for 91 cents. Right now the midpoint of my closing order is sitting around a .40 debit, which seems about right. However I noticed for about 15 minutes after market open it kept fluctuating between a range of about $1 credit and $1.50 debit. I'm on TastyWorks and it actually let me put in a closing limit of $1.05 cr, which the midpoint hit but didn't fill. (Normally on TW if you send a debit order for a net credit you'll get rejected, but I sent it while it was trading for a credit.)\n\nWould my closing order ever have actually been filled for a credit, or is the midpoint just a result of a wide bid-ask spread in the first 15 minutes of options trading after an earnings call? Would have been interesting to see it filled.",
        "subreddit": "options",
        "title": "Is it Possible to Close an Iron Condor for a Credit?",
        "url": "https://www.reddit.com/r/options/comments/itw843/is_it_possible_to_close_an_iron_condor_for_a/",
        "created": 1600294114.0
    },
    {
        "author": "bumblebear3012",
        "created_utc": 1599160579,
        "id": "im02di",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Back in July, Barron’s ran a story profiling the rise of Nvidia as the company moved past Intel in market cap to become the most valuable US semiconductor company. The article cited Nvidia’s favorable exposure to data center, gaming, and AI as major reasons why the company overtook top spot from Intel. Only two months later, Nvidia is now worth $107bn more than Intel. In other words, Nvidia is worth more than an AMD more than its Santa Clara rival. Around the same time, AMD also began to see significant outperformance relative to Intel shares. With continued momentum in the PC market on the back of its Ryzen processors and increased success in data center with the EPYC product line, AMD has risen 57% since the start of July. Over that period, Intel declined 15%. \n\nIn contrast to Nvidia and AMD, Intel is disproportionately associated with the PC. Yet even within the PC market, analyst commentary has been overwhelmingly positive on AMD whereas doubts have surfaced over Intel’s ability to innovate and remain competitive. In the span of a week at the end of July, Intel announced a major delay with its 7nm chips and AMD beat Q2 earnings, raised guidance, and hit its highest PC market share since 2013. However, the focus on Intel as a struggling PC player has wrongly overlooked several important developments that set the company up for a near-term rebound in PC and long-term revenue opportunities in the same higher growth end markets that have fueled premium valuations for both Nvidia and AMD. \n\n1. Release of Tiger Lake processor, expanded efforts in graphics via Xe architecture, and development of discrete GPUs for data center and desktop\n2. Continued momentum in company shift to data-centric business first and PC business second\n3. Expanded Total Addressable Market (TAM) associated with edge computing and edge-enabled technologies\n4. Competitive positioning in autonomous vehicle technology\n\nIntel is currently priced for stagnant to declining revenues, further market share erosion, and lower relative probability of success compared to Nvidia and AMD. Given recent product releases and refreshes, as well as a strong strategic vision to increase share in these higher growth end markets, [Intel revenue is more likely to accelerate and lead to significant multiple expansion in the coming years](https://blackjacketco.com/f/new-brand-new-intel-growth-ahead-for-tiger-lake-edge-and-av). \n\n* Assigning Intel CY23 PT of $125 per share\n* FY23 revenue projected at $100bn\n* FY23 net income projected at $34bn delivering 7.55 in EPS\n* Applying 16.55x P/E and 4.55 P/S \n\n**Tiger Lake and Renewed PC Innovation** \n\nYesterday Intel finally revealed the highly anticipated Tiger Lake 11th generation processors for ultra-thin high-performance laptops. Industry reporting in previous months had speculated that the new system-on-chip (SoC – incorporates different components like graphics and AI into one integrated unit) would offer CPU performance advances and improvements in graphics and AI. Intel even leaked some specs on Monday that seemed to confirm some of the performance metrics. Although independent industry studies are required to run Tiger Lake through its full paces, the event demonstrated that not only can Intel still innovate, it is more than premature to start counting the company out on PCs. \n\nTiger Lake clocks up to 20% higher frequencies compared to the 10th generation Ice Lake family and can reach a single core turbo of 4.8 GHz. During the presentation, Intel noted that the integrated Iris Xe graphics perform better than 90% of PCs sold last year, on-board AI is up to 5x more effective, and WiFi connectivity is up to 3x faster. In a like-for-like comparison to AMD, Tiger Lake enabled 4x faster photo upscaling, 2x faster video processing and exporting via Adobe Pro, and 20% faster performance in both Microsoft Word and PowerPoint. For gaming, Intel conducted side-by-side tests using Gears Tactics. Laptops running AMD 4800U with integrated graphics and a Nvidia MX350 discrete graphics card (with Intel 10th Gen i7) performed worse than Tiger Lake. Intel’s test showed that Tiger Lake handled the game at up to 66% higher frames per second versus the AMD and Nvidia-powered laptops. \n\nBarring significant discrepancies found during independent reviews, Intel just delivered performance on 10nm that is equivalent to what is possible on 7nm. With the simultaneous launch of the Evo brand to encompass the new 11th generation-powered ultra-thin high-performance laptop range, Intel can begin building customer brand recognition and altering perceptions that Intel has lost competitive footing in the PC market. With 50 PC designs set to ship with Tiger Lake as soon as this fall, and at least 150 designs anticipated from partner OEMs, Intel may see a very near-term recovery in its PC market share even despite the 7nm delay. \n\n**Transition to Data-Centric Business and Future at the Edge**\n\nMore important to Intel’s future is the multi-year shift towards higher-growth end markets associated with cloud, edge, and data. Rather than PCs, Intel sees its primary business as the Data-Centric reporting segment that now comprises 52% of revenues. That figure is likely to expand in coming quarters following 34% YoY growth in the most recent earnings report. In FY19 Q2, the Data-Centric segment only accounted for 46% of revenues. \n\nThat Data-Centric segment includes: The Data Center Group (36.3% of total Intel revenues); Non-Volatile Memory Storage Group (8.5%); Internet-of-Things Group (3.4%); Programmable Solutions Group (2.6%); and Mobileye (0.7%). The two largest contributors to the segment are performing extremely well. The Data Center Group grew 43% YoY and saw operating income climb 72%. The second largest business in the segment, Non-Volatile Memory Storage, grew 76% YoY for record revenue on the back of NAND demand growth and higher Average Selling Prices (ASPs). \n\nBy 2024, Intel expects its TAM to reach $300bn. But $230bn of this is attributed to the Data-Centric TAM. And Intel’s own calculations may be slightly conservative. In the company’s analysis of its various end markets, Intel only mentioned the edge compute market in general terms. Yet that market alone is projected to surpass $100bn by 2030. As much as public cloud adoption drove demand for server-related products over the past five years, the edge could end up being a far more important trend. That is because, in addition to further server demand, the edge will enable billions of IoT devices to finally become widespread after years of hype. With TAM growth associated with edge server CPU, GPU, and storage, plus IoT and edge AI solutions, Intel can achieve growth into the 2030s so long as the company can execute on its strategic vision.  \n\n*Edge Server* \n\nAn S&amp;P Global study in spring 2020 estimated that Intel has 90-95% share of the data center CPU market despite recent share gains by AMD. While edge server architectures and processes differ versus hyperscale cloud servers, this figure is testament to the strength of Intel’s relationships with the leading cloud providers that are also among the early movers in the edge computing space – namely Amazon with its Lambda@Edge platform, Microsoft with Azure Functions, and Google with Google Cloud Functions.  \n\nFor smaller edge providers especially, like Fastly, Akamai, or Cloudflare, there will be particular emphasis on price-per-performance for server components. Until recently, that dynamic favored AMD whose EPYC Rome 7742 processor rivals Intel’s Xeon Platinum 8280 on performance yet undercuts it on price by about 60%. The cost efficiency of EPYC led to some important edge server design wins for AMD, including Cloudflare’s new GenX server that excluded Intel parts for the first time. \n\nThe latest Xeon processors had been on the market for a couple years, though, and Intel refreshed the product line earlier this year in an attempt to greatly reduce cost while maintaining performance. In its 24 February press release, Intel directly addressed the need to become more competitive with AMD on price-per-performance noting that the Xeon refresh: “…\\[reinforces\\] Intel’s data center leadership by providing greater performance and performance-per-dollar choices for…customers across cloud, network and edge.” While Intel compromised on compatibility with certain server designs, the result is 1.42x better price-per-core-performance and a cost of $141 per-core for the Gold 6258R. The price tag puts Xeon in a much stronger position relative to EPYC Rome 7742 which goes for $108 per-core. \n\nDespite early advantages in cost-per-performance for AMD, Intel still managed to double its edge deployments year-over-year according to Forbes. And its impressive partner list includes Lenovo, Red Hat, Advantech, Caswell, Inventec, Lanner, Nexcom, World Wide Technology, Ericsson, ZTE, Verizon, Vodafone, Nokia, and China Telecom, among others. With drastic improvements in price-per-performance, Intel could very well see additional customer wins in upcoming quarters. \n\nBeyond CPU, edge applications will see an increase in demand for integrated and hybrid GPUs. Between advancements in Intel Xe graphics and its development of discrete graphics cards, the company will become better positioned to take advantage of the more than 33% CAGR projected for GPUs from 2020 to 2027 – taking the market from just under $20bn in 2019 to over $200bn according to Deloitte. Even if Nvidia and AMD maintain large leads over Intel in GPU market share for edge servers, even a marginal portion of the market could be meaningful to the Data Center Group which measured around $7bn in Q2. \n\nIn addition, edge servers present an unprecedented opportunity for NAND solutions as well – specifically flash storage that utilizes the NVMe (Non-Volatile Memory Express) protocol. Edge servers have strong need for high-performance startup operations and extremely reliable storage. That is because rapid startup times are critical for edge providers to quickly launch computing instances and deliver the lowest possible latency for their customers. Improvements in NVMe NAND greatly shrink the physical storage footprint, reduce power and cooling costs, all the while improving the overall speed, flexibility, and failure rates. And Intel Optane and 3D NAND SSDs are exceptionally reliable for storage and offer performance improvements over legacy storage solutions. \n\n*IoT and AI*\n\nMuch like edge servers, edge deployed IoT devices will similarly boost demand for Intel processors. For workload intensive industrial IoT, Intel has its Core processor. And the Intel Atom processor is purpose-built for lower-power or embedded applications. Because IoT devices will collect and process vast amounts of data, these applications will also require significant amounts of flash memory – specifically NAND. On-device NAND SSD can increase data transfer speeds while also integrating module-level security features, remote management, and more flexible power configurations. Collectively, improvements in NAND will lower total cost of ownership for these machines.  \n\nThe edge will lead to rapid growth for edge AI chipsets that enable IoT devices to deploy machine learning at the edge without having to send data via internet back to a centralized data center. Deloitte notes that around 300 million edge AI chips were sold in 2017, but this year could see more than 750 million units hit the market. With compounded annual growth in edge AI chipsets anticipated to outpace the broader semiconductor industry by a considerable amount, ABI research predicts that these edge chips will surpass the market for cloud AI chips by 2025 – marking a massive shift. \n\n**Mobileye and Autonomous Driving Technology** \n\nIt is interesting the extent to which mainstream conversations in media and financial commentary largely exclude Intel’s Mobileye and instead focus on Tesla as the technology leader in autonomous vehicles and Nvidia as the chipmaker best positioned to disrupt. Although Telsa claims to offer autonomous modes for its vehicles, based on the 5-level autonomous capability hierarchy – the industry standard established by the Society of Automotive Engineers – the most advanced cars currently on the market only operate at level 2+. Level 2+ falls between levels 2 (partial automation) and 3 (conditional automation). The hardware to support full level 5 autonomy does exist in 2020, and the software necessary to manage these systems is not too far behind. However, it will likely take 5-7 years before manufacturing volumes reach levels to drive down hardware prices, the necessary regulatory frameworks come into place, and fully autonomous vehicles gain broad consumer acceptance.  \n\nIn the intermediary period, the progression towards level 5 autonomy will continue to be gradual and incremental. Higher degrees of autonomy will be achieved by increasingly sophisticated advanced driver assistance systems (ADAS) that prove out the viability of these technologies and underpin the manufacturing, regulatory, and consumer environment that will facilitate the future arrival of self-driving cars. Beyond this, in many cases the same technology at the center of levels 4 and 5 builds on the existing foundations of ADAS capabilities. And the dominant player in the ADAS market is not Tesla, Waymo, or Nvidia. It is Mobileye. \n\nMobileye’s market share has consistently stayed above 70% for years, even as competition from other players has ramped up – Nvidia in particular. The Mobileye solution is noteworthy, pairing its SoC – the EyeQ family – to support a range of ADAS capabilities using only a single camera sensor. This differs from the LiDAR and radar-based systems favored by Waymo, Uber, GM-owned Cruise, and Nvidia. Tesla – who previously used Mobileye technology until the two parted ways in 2016 – also leverages a camera-based system. However, Tesla deploys ultrasonic sensors and radars in combination with billions of miles of driver data. \n\nMobileye’s commanding market share in ADAS means that its technology is used by more than 300 models from 25 global automakers, resulting in 60 million vehicles on the road worldwide. In contrast, Tesla currently has fewer than 1 million vehicles on the road equipped with variants of its autopilot technology. And Mobileye is already working with 4 major OEMs to soon provide level 3 autonomous solutions. As part of its arrangements with OEMs, Mobileye receives access to sensor data from customer vehicles. At present, Mobileye is collecting 3.7 million miles per day and growing as another 2 million vehicles from these OEMs are set to join the data-sharing program over the next two years. \n\nWhat this translates to is a massive partner network with the world’s leading auto OEMs who will all have a vested interest in competing with Tesla both in autonomous but also electric vehicles. This also means that Mobileye has a significant advantage over Nvidia in getting its ADAS and future autonomous solutions on vehicles. As Mobileye further prioritizes its fully autonomous solutions, its leading competitive positioning in ADAS, as well its strong relationships with OEMs, gives the company a strategic advantage over its competitors as higher levels of autonomous technologies go to market. This is evidenced by Mobileye’s strategic partnership with Tesla EV rival NIO to offer level 4 consumer vehicles by 2022. \n\nEven though Mobileye made its name based on its single camera platform, the company is separately developing what is called a full autonomous stack, incorporating the necessary LiDAR, radar, non-camera sensors, GPS, modems, and other hardware components that will run on its 5th generation EyeQ processor. In the meantime, Mobileye recently demoed a self-driving vehicle that navigated the congested streets of Jerusalem using only 12 cameras and no LiDAR, radar, or non-camera sensors. \n\nOn the back of the hyperbolic move in Tesla shares YTD, numerous articles have lauded the company’s so-called multi-year advantages over rivals in the space. Notably, in July Elon Musk stated that Tesla is “very close” to level 5 autonomy with no updates needed to hardware as the company’s Tesla Computer processor currently supports full autonomy. Mobileye’s EyeQ 5 also supports level 5 autonomy, however. And although the Tesla Computer exceeds EyeQ 5 on tera operations per second (TOPS), EyeQ 5 offers footprint and power consumption advantages. Moreover, unlike most other players in autonomous systems, Mobileye has opted for an open architecture that enables OEMs to program their own software on top of Mobileye hardware. \n\nTesla has a lead in data collected per mile at over 3 billion miles, but Mobileye is catching up and its data repositories also exceed the billion-mile mark on an annual run rate basis. To deepen the data sets available to Mobileye, Intel also bought Israeli mobility-as-a-service company Moovit for $900mn this year. Like Tesla, Mobileye is set to offer its technology in the important robotaxi market that many in the industry view as the precursor to consumer-adopted fully autonomous vehicles down the line. Mobileye is launching pilot robotaxi fleets in Tel Aviv, Paris, and Daegu City in 2022. \n\nMobileye still accounts for less than 1% of total Intel revenues despite doubling sales since being acquired by Intel. Given the strength of Mobileye’s position in the ADAS market that is expected to grow to more than $80bn by 2030, as well as the prospects in robotaxis and level 4/5 autonomous systems, Mobileye has strong potential to develop into a major growth engine for Intel over the next 4-5 years. \n\n**Conclusion**\n\nIntel shares are roughly flat since early 2018 despite revenues up almost 20% from FY19 Q2 to FY20 Q2. The relative outperformance in Nvidia and AMD shares over that time has furthered perceptions that Intel could fall behind as the former two companies achieve sustained revenue growth tied to more attractive end markets like data center, gaming, AI, and autonomous vehicles. \n\nHowever, recent struggles with certain products and lost PC market share to AMD have distracted investors from Intel’s ongoing transition to a more data-centric business. With a $230bn TAM projected by 2024 for this operating segment alone, Intel has multiple opportunities to likewise drive revenue growth over the long-term. \n\nGiven the company’s recent advancements with its 11th generation Tiger Lake SoC, continued progress in improving price-per-performance for edge server components, and the vastly underrated leadership of Mobileye in the ADAS and autonomous vehicle markets, Intel offers an extremely compelling opportunity for investors seeking exposure to these technology trends at a more reasonable valuation. \n\n**Disclosures**\n\nWe are long Cloudflare (NET). \n\n*You can also find me on Twitter* [*@BlackjacketCo*](https://twitter.com/BlackjacketCo) *where I write about emerging technologies and long-term market trends. If you're interested in particular stocks, don't hesitate to reach out. Thanks for reading everyone!*",
        "subreddit": "stocks",
        "title": "New Brand, New Intel: Growth Ahead for Tiger Lake, Edge, and Autonomous Vehicles",
        "url": "https://www.reddit.com/r/stocks/comments/im02di/new_brand_new_intel_growth_ahead_for_tiger_lake/",
        "created": 1599189379.0
    },
    {
        "author": "mihnealazar",
        "created_utc": 1599747935,
        "id": "iq4ady",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "What about buying Adobe before earnings?",
        "url": "https://www.reddit.com/r/stocks/comments/iq4ady/what_about_buying_adobe_before_earnings/",
        "created": 1599776735.0
    },
    {
        "author": "cclagator",
        "created_utc": 1600103063,
        "id": "isp2d4",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "options",
        "title": "What the options market expects this week - SPY, QQQ Tesla, Apple, FedEx, adobe and more",
        "url": "https://www.reddit.com/r/options/comments/isp2d4/what_the_options_market_expects_this_week_spy_qqq/",
        "created": 1600131863.0
    },
    {
        "author": "Wetstocks",
        "created_utc": 1600264237,
        "id": "itvwgn",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "ADBE crushed earnings (record highs) but is down (1.8%) today",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/itvwgn/adbe_crushed_earnings_record_highs_but_is_down_18/",
        "created": 1600293037.0
    },
    {
        "author": "noyesnoyesyesnoyes",
        "created_utc": 1600206199,
        "id": "itidxu",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Will Adobe and FedEx keep going higher or was this it?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/itidxu/will_adobe_and_fedex_keep_going_higher_or_was/",
        "created": 1600234999.0
    },
    {
        "author": "swaggymedia",
        "created_utc": 1601246075,
        "id": "j10clt",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "What's up people of r/StockMarket, some of you may have seen my unusual options activity posts in other option's trading sub-reddits. I've decided to put together a little summary for the week that details some trending tickers, option activity, and some setups for next week ( + reasoning for the setup). Mods if this isn't allowed, I won't post again. Here we go:\n\n# Upcoming Earnings\n\nMicron (MU) Earnings are coming up this week. The semi-conductor company has been consistently beating earnings and has seen some growth throughout the pandemic as more companies become increasingly tech-focused with work-from-home orders. Here’s a snapshot of their most recent earnings and performance moves day-after the report.\n\n[https://imgur.com/stDsUEx](https://imgur.com/stDsUEx)\n\n**What to look for**\n\nBy proxy, companies that will see some related movements to MU’s earnings are: AMD, INTC, and NVDA. A good showing from MU will also mean good things for other semi-conductor companies.\n\nHere’s a look at MU’s average options’ Implied Volatility (IV) over the last month. We can see that typical IV is in the 40-45% range. When the stock price dropped early September during the crash, we saw IV get up to the 60’s. IV has begun to dip back into the 40’s meaning there is not a huge move expected off the earnings report. (Stock price is gold vs IV blue line).\n\n[https://imgur.com/87nthwQ](https://imgur.com/87nthwQ)\n\n# \n\n# Economic Calendar\n\nWe have some important economic data coming out this week. Here’s the outlook:\n\nTuesday 10am: Consumer Confidence\n\nWednesday 8:30am: GDP Q2, Pending Home Sales\n\nThursday 8:30am: Jobless claims\n\nFriday 8:30am: Unemployment Rate\n\n**Full Calendar of Important Events w/ Forecasts (via Bloomberg):**\n\n[https://imgur.com/1XEHPyC](https://imgur.com/1XEHPyC)\n\n# \n\n# Trending Stocks\n\nMost Mentioned Tickers + Sentiment from Friday\n\n[https://imgur.com/jTw7JiO](https://imgur.com/jTw7JiO)\n\nThis week’s trend gainers and losers\n\n**Losing Hype:** TSLA, VALE, NKLA, MSFT, WMT, AAPL\\*\n\n[https://imgur.com/0wdvTJB](https://imgur.com/0wdvTJB)\n\n**Gaining Hype:** BA, VXX, ZM, AAL, UPS, PTON, MU\n\n[https://imgur.com/hpakS2h](https://imgur.com/hpakS2h)\n\n\\*AAPL was losing hype on the weekly trend, but up on the daily trend Thursday &amp; Friday from a good performance.\n\n&amp;#x200B;\n\n# Consolidating Tickers\n\nThese tickers are ones that have once been a “meme”, but have since settled down, and perhaps a good entry point if your technicals are right, it aligns with your strategy, and want to avoid FOMO-ing into hot stocks.\n\n[https://imgur.com/5YsYE1a](https://imgur.com/5YsYE1a)\n\n# \n\n# The classic tale of doing the inverse of WSB\n\nToday we’ll take a look at VALE, a stock that was almost never mentioned a single time in the last month on r/WallStreetBets until September 18th. At that point, the stock had risen 10% in the week before and VALE was then seen all over the comment section of the sub. Comment volume for VALE jumped to 10% of total comment volume on the sub-reddit at which point many WSB members initiated positions. Within the next several trading days the stock tanked 15% leaving WSB holding the bag (yet again). For more details on this, please read “How not to FOMO into trades”.\n\n[https://imgur.com/oZ7xY0B](https://imgur.com/oZ7xY0B)\n\n# \n\n# Swaggy DD (due diligence) released this week - GME (Gamestop)\n\n**I. INTRODUCTION**\n\nWhen I look at the sentiment surrounding GameStop, it doesn’t take very long to see comments like these, yet here we are. What’s going on? Are people that stupid? Just jumping on the new console cycle? Idiots not pulling their gains and going to zero? When even r/wallstreetbets thinks the stock is a dud, it must be right? Nearly 120% short interest, yet the stock is up nearly 40% this week.\n\nIts no secret GameStop has been hurting. The secular shift to digital has been pressuring them for some time with their highest margin category - used video software – under significant distress. Each year their gross margins contract with net income in the red these past few quarters. Everybody has written them off as the easiest short in the world, however I'm going to try to explain whats going on and tell you that buying GameStop may not be as bad as you think.\n\n**II. CONSOLES**\n\nJust to start things off, you have to remember we’re in the beginnings of the new console cycle. But what does that even mean? Well the advent of new consoles means new trade-ins, new product, new customers, and a fresh spike in GameStop’s popularity. Sales have stagnated the years prior, and they are all but certain to go up and remain elevated for the next 1-2 years. Note that against all counts, the company was actually profitable during the 2019 holiday season, with new consoles you can bet that they will annihilate all expectations and proceed into 4-8 more positive quarters off the cyclic shift. This is pretty unanimous, and everyone accepts that they will start reporting positive going forward. In fact, new console cycles are where GME has historically spiked.\n\n[Click here to continue reading the DD](https://www.reddit.com/r/wallstreetbets/comments/ivs6dw/bankrupting_institutional_investors_for_dummies/)\n\n# \n\n# Swaggy Play &amp; Trade Idea - JPM\n\nWhat's up everyone, market has been choppy as FK and almost un-tradeable the last several weeks. Still, not much has changed fundamentally over the last 3-4 weeks and here we are with a 10-20% haircut on stocks depending which tickers you follow. I've been sitting on my hands for a while, but entered a trade today. Keep in mind this is not advice on what or how to trade, simply posting my trade here and if you want to discuss some opinions, lets do it.\n\nWhy JPM? It has been in a fairly tight channel over the last 3-4 months, staying in the range of $90-100. I entered this exact play back in July when the stock dropped to similar levels to where it is currently at right now, and closed at max profit back then.\n\n[Check out the full play details (reasoning + risks)](https://www.reddit.com/r/SwaggyStocks/comments/izmt2r/swaggyplay_trade_idea_jpm/)\n\n# \n\n# Unusual Option Activity\n\nSome big volume in option flow was spotted this week in some names: AAPL, ADBE, C, CLDR, ORCL, PBR, and WRTC.\n\n**ADBE – Adobe**\n\nADBE saw a massive call block come through on Friday. 5,000 January 2021 CALLs at the $420 strike (10% ITM). Total position size was $40 million. ADBE was about 10-15% off the recent highs and has bounced multiple times off the $470 level. IF this sell-off is truly over, we might see a good bounce in tech and some of these block purchases seem to be positioning for it.\n\n[Read Full Post: Weekly Option Flow Summary, Week of Sept 20-2020: AAPL, ADBE, C, CLDR, ORCL, PBR, WRTC](https://www.reddit.com/r/options/comments/j0rev4/unusual_option_flow_summary_for_the_week_aapl/)\n\n# \n\n# What’s on the watchlist this week\n\nStill looking for a bounce in tech. Here are some stocks I either like and have a position or I’m looking for entry points on (stock price + Implied Volatility charts)\n\n**AAPL - Apple**\n\nAAPL is currently near a short-term low. Does it have room to go down more? Sure, but I think when you dig below the current levels you will be finding more buyers as we get closer to $100. IMO a good entry point for a long-term hold. IV is also moderately high for options. They are set to report earnings by end of October and also have catalyst of rumored 5g iPhone release.\n\n**AMD - Advanced Micro Devices**\n\nAMD has shown some strength at the $78 level of support through these last few weeks of downside pressure. AMD also reports towards the end of October, but will have some volatility into MU (Micron Technology) earnings next week. IV is pretty high right now for AMD to buy calls. A more efficient play might be to sell CSP (cash-secured put), credit PUT spreads, or purchase shares.\n\n**DOCU - Docusign**\n\nA second-wave covid-play I’m looking at is DOCU. DOCU just reported earnings that weren’t accepted well by Wall Street. The stock has dropped nearly 30% since it’s peak of $290 not long ago. You can also see the IV has dropped significantly after earnings. Average IV was as high as 140% pre-earnings and is now sitting around 55%. IMO this is a fundamentally strong company with solid branding. If you’ve ever needed to sign important documents online, chances are you’ve used Docusign before and it is quickly becoming a household name. I like this play for a long-term hold and also as we get into the fall months as a covid play.",
        "subreddit": "StockMarket",
        "title": "Swaggy's weekend summary of unusual option activity, trending tickers, and some setups for next week.",
        "url": "https://www.reddit.com/r/StockMarket/comments/j10clt/swaggys_weekend_summary_of_unusual_option/",
        "created": 1601274875.0
    },
    {
        "author": "pdwp90",
        "created_utc": 1600984864,
        "id": "iz6uxv",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "**Motivation**\n\nSites like PredictIt give you the ability to directly bet on 2020 election outcomes, but have unfavorable fee structures and restrictive limits on how much money you can put in. I wanted to take a quantitative approach in determining which stocks to buy based on my 2020 election predictions.\n\n**Background**\n\nI define \"Trump Beta\" as the correlation between a stock's daily prices changes and the daily changes in Trump’s election odds. Presidential election odds are calculated based off of trading on the PredictIt betting market, where over 100,000 users are buying and selling contracts on the outcome of this next election.\n\nI’ve been scraping the PredictIt website every day since June 2019, to get a complete picture of how each candidate's election odds have evolved over time.\n\nOf course, both stock market prices and PredictIt election odds are noisy numbers, and correlation does not necessarily indicate causation. However, I believe that political beta is still a powerful tool for quantifying the potential stock market impact of different election outcomes.\n\n**Results**\n\nI calculated the Trump Beta for &gt;5,000 publicly traded companies. I built a full dashboard from my results, which you can find down in the comments (mods willing). Below are insights into some of the industries whose performance I found to be highly correlated with the outcome of the election.\n\n&amp;#x200B;\n\n**Health Technology and Health Services**\n\nMost companies in both the health technology and the health services sectors have had a high positive correlation with a Trump re-election.\n\nThe effect of the election on health technology and health services stocks will likely depend not only on who wins the Presidency but also on whether or not Republicans maintain control of the Senate.\n\nIf Democrats win both the White House and the Senate (and maintain control of the House) you’ll see revived efforts to pick up the pieces of the Affordable Care Act and continue to transform the U.S. healthcare system. This transformation is likely to come at the expense of private healthcare companies' bottom lines.\n\nOn the other hand, Republicans maintaining control of the White House and/or Senate would likely result in a divided government, with no significant legislation on healthcare being passed.\n\n**Cannabis**\n\nNot surprisingly, most major cannabis stocks have a very low Trump Beta, meaning I think they are more likely to perform well if Biden is elected.\n\nCanopy Growth Corp ($CGC) has a Trump Beta of -0.20, GW Pharmaceuticals ($GWPH) comes in at -0.29, and Cronos Group ($CRON) has a Trump Beta of -0.31.\n\nThough Biden took a tough stance on federally controlled substances back in the 1980s and 1990s, he has recently embraced a platform of decriminalizing marijuana. Additionally, running mate Kamala Harris is known as an advocate for legalization. As a junior senator in California, she sponsored the Marijuana Opportunity Reinvestment and Expungement (MORE) Act, which the Democrat-controlled House Judiciary Committee passed last November. The bill hasn’t gotten anywhere yet, but many suppose that a democratic sweep this November could lead to marijuana legalization.\n\nOn the other hand, cannabis legislation has not been a priority under Trump, and there is no reason right now to believe that this will change during a second term.\n\n**Large-cap Tech Companies**\n\nCompanies in the technology services and electronic technology sectors have an average Trump Beta of 0.12 and 0.15, respectively. This is primarily driven by the large-cap tech companies that dominate their industries, with Microsoft, Google, Apple, and Adobe all showing strong positive correlations with a Trump re-election.\n\nDespite having been part of the tech-friendly Obama administration, Biden is expected to support stricter antitrust oversight of tech companies, which could pose a major threat to tech giants such as Google and Amazon.\n\nTrump’s current regulatory scrutiny around tech companies centers around allegations of anti-conservative bias (free speech concerns) and attempts to block Chinese-owned companies (TikTok, WeChat). Despite antitrust investigations into Google and Facebook during Trump's 1st term, there has been little serious action taken so far against major tech companies.\n\nBig Tech has enjoyed record business success so far during Trump’s presidency. Under Tax Cuts and Jobs Act (TCJA), passed in December 2017, taxes on cash repatriated from overseas were lowered, allowing tech executives to bring back hundreds of billions of dollars which were passed on to shareholders via buybacks. At the same time, the reduction on the corporate tax rate, from 35% to 21%, gave tech companies a serious boost to earnings.\n\n&amp;#x200B;\n\nThere's obviously a ton of things which determine whether stocks go up, down, sideways, or in circles, and I don't intend for this data to be used alone in making trading decisions. That being said, I hope you find it useful.",
        "subreddit": "wallstreetbets",
        "title": "Investing in the 2020 Election",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iz6uxv/investing_in_the_2020_election/",
        "created": 1601013664.0
    },
    {
        "author": "ghathawayjunior",
        "created_utc": 1600973232,
        "id": "iz36y4",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I was thinking stocks like zoom, docusign, Adobe, fedex, ups, PayPal, square, Apple, Nvidia, and numerous others seem like they have overextended themselves to unjustified valuations. Even after the 14% drop in the Nasdaq they still seem like they are overvalued. Are there other stocks that you think are overvalued? Any thoughts or ideas on this?",
        "subreddit": "stocks",
        "title": "What stocks seem like they are very overvalued to you compared to pre covid?",
        "url": "https://www.reddit.com/r/stocks/comments/iz36y4/what_stocks_seem_like_they_are_very_overvalued_to/",
        "created": 1601002032.0
    },
    {
        "author": "thoraway-1",
        "created_utc": 1600206125,
        "id": "itid09",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Will Adobe and FedEx keep going up or was this it?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/itid09/will_adobe_and_fedex_keep_going_up_or_was_this_it/",
        "created": 1600234925.0
    },
    {
        "author": "ijben",
        "created_utc": 1599123291,
        "id": "ilpvcr",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "options",
        "title": "$ADBE calls",
        "url": "https://i.redd.it/8uh8rkm1dwk51.jpg",
        "created": 1599152091.0
    }
]