[
    {
        "author": "trentfairley",
        "created_utc": 1582342672,
        "id": "f7mycl",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "My “trial year” , the first time investing in stock market, I’m going with just the technology sector very focused around the 5G wave.  My picks are mainly semiconductor companies and just Sprint.  All the company’s have a good 5 year track record, 4 are embedded with the Chinese market dealing with the virus but I believe they will still push through, and all have promise to rise with 5G, Would love to hear back from community with feedback or recommendations!\n\n1)Marvell Technology\n2)Applied Materials\n3)Appian\n4)Sprint\n5)Skyworks Solutions\n6)Corning\n7)AMD\n8)ON semiconductor",
        "subreddit": "StockMarket",
        "title": "My pick list in technology sector for the year!",
        "url": "https://www.reddit.com/r/StockMarket/comments/f7mycl/my_pick_list_in_technology_sector_for_the_year/",
        "created": 1582371472.0
    },
    {
        "author": "PocketMafia",
        "created_utc": 1581529403,
        "id": "f2uxpk",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "What do you guys think is a better for investing?\n\nI like Skyworks but 40% of their revenue came from Apple in 2018 which makes me worried. What if Apple backs out and keeps Skyworks out of the next cycle of iPhones. One contract loss means -40% revenue is extremely unsettling. \n\nOn the other hand Qualcomm is more diversified. Their chips are used by every major phone brand. However, it seems like Huawei is starting a shift to producing their own internals which will likely hurt Qualcomms earnings. \n\nPlease discuss. Which one are you guys taking for the 5G hype?",
        "subreddit": "stocks",
        "title": "Qualcomm vs Skyworks?",
        "url": "https://www.reddit.com/r/stocks/comments/f2uxpk/qualcomm_vs_skyworks/",
        "created": 1581558203.0
    },
    {
        "author": "Beagleoverlord33",
        "created_utc": 1581969195,
        "id": "f5ehf6",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Hi I was looking for peoples opinion on their favorite semi stocks. I was looking at starting a small position in QCOM and SWKS and maybe average down if the stocks come down a bit. I already have a position in Micron. Does anyone have thoughts on the these? in the next 1-5 years growth seems like it would be solid. Any other popular ones not looking to much at AMD or NVDA due to valuation at this point.",
        "subreddit": "stocks",
        "title": "Favorite semi stock and why",
        "url": "https://www.reddit.com/r/stocks/comments/f5ehf6/favorite_semi_stock_and_why/",
        "created": 1581997995.0
    },
    {
        "author": "PocketMafia",
        "created_utc": 1582150339,
        "id": "f6idsa",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Any kind of input is extremely appreciated...\n\n&amp;#x200B;\n\nJNJ - Johnson &amp; Johnson\n\nBABA - Alibaba \n\nNOK - Nokia \n\nERIC - Ericsson\n\nQCOM - Qualcomm \n\nSWKS - Skyworks \n\n&amp;#x200B;\n\nMy intent is to buy and hold for 3-5 years.",
        "subreddit": "stocks",
        "title": "Thoughts On These Prospect Stocks?",
        "url": "https://www.reddit.com/r/stocks/comments/f6idsa/thoughts_on_these_prospect_stocks/",
        "created": 1582179139.0
    },
    {
        "author": "achose111",
        "created_utc": 1580747565,
        "id": "ey9nxj",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "Dear fellow autists/Bear Gang Friends,\n\nI think is time now for the Bear Gang to realise that the US market is unstoppable and can't go tits up. \n\nWe should instead create a Bear Gang-Asia Divison and go short china/india etfs instead, It's obivious why we should short china, the indians on the otherhand is gonna attract the Wu-flu soon and their amzing hygiene standards means that india is gonna have so much fun and may even create a new variant, which would cycle endlessly bewteen china and india for unlimtied tendies. \n\nSo join me my fellow Bear members and short FIX, INDA, ASHR or buy YANG or CHAD!\n\nP.S. Long SPCE",
        "subreddit": "wallstreetbets",
        "title": "Bear Gang Asia Division is now open!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ey9nxj/bear_gang_asia_division_is_now_open/",
        "created": 1580776365.0
    },
    {
        "author": "InterestingNews1",
        "created_utc": 1581535873,
        "id": "f2wlm6",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "investing",
        "title": "Can anyone explain why MoneyGram is valued at just 13% of sales while Western Union goes for 200%?",
        "url": "https://www.reddit.com/r/investing/comments/f2wlm6/can_anyone_explain_why_moneygram_is_valued_at/",
        "created": 1581564673.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1581427479,
        "id": "f289kq",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/StockMarket sub! Welcome to Tuesday. Here is your pre-market news this AM-\n\n*****\n\n#(**[CLICK HERE TO VIEW THE FULL SOURCE!](https://www.stockaholics.net/threads/todays-pre-market-news-tuesday-february-11th-2020.9458/)**)\n\n#[Today's Top Headlines for Tuesday, February 11th, 2020](https://www.cnbc.com/2020/02/11/dow-to-rise-powell-testifies-coronavirus-death-toll-passes-1000.html)\n\n* U.S. stock futures point to a higher open, following record closes for the S&amp;P 500 and Nasdaq on Monday, as investors are encouraged by a slowdown in the number of new coronavirus cases. The Dow, S&amp;P 500 and Nasdaq are higher in five of the past six sessions, and four S&amp;P sectors are at record highs: Consumer Discretionary, Consumer Staples, Tech and Real Estate. (CNBC)\n* Ray Dalio thinks the coronavirus’ hit to global markets is probably exaggerated (CNBC)\n* The director-general of the World Health Organization reportedly warned that while almost all of the confirmed coronavirus cases are in China, the outbreak constitutes a “very grave threat” for the rest of the world. China’s National Health Commission reported that a total of 42,638 cases had been confirmed in the country, with 1,016 deaths. (CNBC)\n* Nearly 200 evacuees to leave cornavirus quarantine in US (AP)\n* Fed Chairman Jerome Powell testifies today and tomorrow in the first of his twice-a-year economic updates to Congress, with investors listening for commentary on any coronavirus impact on the U.S. economy. On today’s economic calendar, the government is out with JOLTS, the Job Openings and Labor Turnover Survey, for December at 10 a.m. ET. (CNBC)\n* AutoNation (AN), Hasbro (HAS), Hilton Worldwide (HLT), Tegna (TGNA) and Under Armour (UAA) are out with quarterly earnings this morning, while Denny’s (DENN), Groupon (GRPN), Lyft (LYFT), and Western Union (WU) are among the companies issuing quarterly numbers after the bell.\n* A U.S. district judge is expected to rule in favor of allowing Sprint (S) and T-Mobile (TMUS) to merge over the objections of a group of state attorneys general, Reuters reported. It’s a decision that’s supposed to be made today. Shares of Sprint surged 69% in Monday’s after-hours trade and T-Mobile stock rose 8%. (CNBC)\n* The Democratic presidential race is deeply unsettled heading into today’s New Hampshire primary. It may be up to the state to put some structure around the chaotic contest, with Iowa being unable to declare a clear winner. New Hampshire’s secretary of state has predicted a healthy 292,000 Democratic voters, which would be about 40,000 more than voted in 2016. (AP)\n* Small New Hampshire town of Dixville Notch votes for Bloomberg in primary (USA Today)\n* Pete Buttigieg sees surge in support from business execs after his strong showing in Iowa (CNBC)\n* Bernie Sanders hopes New Hampshire primary will tighten his early grip on 2020 race (CNBC)\n* Mike Bloomberg could ‘handily beat’ Trump in 2020, says ex-Trump aide Anthony Scaramucci (CNBC)\n* Amazon (AMZN) is seeking to question President Donald Trump, Defense Secretary Mark Esper and former Defense Secretary James Mattis over a $10 billion Pentagon cloud contract awarded to Microsoft (MSFT). Amazon’s cloud computing arm said it’s looking to depose seven “individuals who were instrumental” in the JEDI source selection. (CNBC)\n* The Justice Department indicted four members of China’s military for the cyberattack against credit ratings agency Equifax in 2017. The incident led to the loss of personal information belonging to 145 million people, mostly in the U.S. but also in Canada and Europe. (CNBC)\n* The FAA is narrowing the issues needed before it can conduct a certification test flight on the grounded Boeing (BA) 737 Max, but will not commit to a timetable for lifting a flight ban. The certification flight to be carried out by FAA pilots “is not scheduled yet because we still have a few issues to resolve, but we continue to narrow the issues,” FAA Administrator Steve Dickson said. (Reuters)\n* DOT watchdog probes FAA’s pilot training after 2 deadly crashes of Boeing 737 Max (CNBC)\n* Google (GOOGL) human resources chief Eileen Naughton is stepping down from her role as tensions grown between employees and management. Naughton, who has held various roles at the company since 2006, has led the company’s human resources department as the vice president of people operations since 2016. (CNBC)\n* Shares of Slack (WORK) fell over 7% in the premarket after it filed an 8-K on Monday downplaying a news report that sent its stock surging more than 15%. The statement was issued in response to an earlier report that a new deal had been struck that made IBM Slack’s largest customer, which had sent the stock surging in the regular session Monday. (CNBC)\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](http://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://finviz.com/publish/021120/sec_all_075437166.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/wteeBZT.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/OeoDGfL.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/yKvMhID.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/SNqq5HC.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/8e4snrC.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/azlFbrt.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/YNP3Pq5.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/Vv5WIT7.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/vpdF9tz.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/SvyrDnj.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/CBl5AFZ.png)**)\n\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/G5AF0Cr.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #1!](https://i.imgur.com/22zaDPV.png)**)\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #2!](https://i.imgur.com/KMtzoBJ.png)**)\n\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS:\n\n* MYO\n* FB\n* UAA\n* UBS\n* MA\n* MSFT\n* NVDA\n* WORK\n* HAS\n* TMUS\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2020/02/11/stocks-making-the-biggest-moves-in-the-premarket-hasbro-under-armour-slack-sprint-more.html)**)\n\n*****\n\n&gt; **Under Armour (UAA)** – The athletic apparel maker reported an overall loss for the quarter, and warned of a negative sale impact from the coronavirus. The company also said it is assessing a possible 2020 restructuring.\n\n&gt; #**STOCK SYMBOL:** UAA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=UAA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/UAA)**)\n\n*****\n\n&gt; **AutoNation (AN)** – The nation’s largest car retailer beat estimates on both the top and bottom lines for the fourth quarter, with results boosted by higher demand for pre-owned vehicles.\n\n&gt; #**STOCK SYMBOL:** AN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AN)**)\n\n*****\n\n&gt; **Hasbro (HAS)** – The toymaker reported a quarterly profit of $1.24 per share, well above the consensus estimate of 91 cents a share. Sales fell short of Street forecasts, however, but Hasbro’s bottom line got a boost from toys related to Disney’s “Frozen 2” and “Star Wars” movies.\n\n&gt; #**STOCK SYMBOL:** HAS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=HAS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/HAS)**)\n\n*****\n\n&gt; **Hilton Worldwide (HLT)** – The hotel operator earned $1.00 per share for the fourth quarter, 4 cents a share above estimates. Revenue also beat forecasts. Hilton’s 2020 earnings outlook was below analysts’ forecasts, however, and the company said the outlook does not include possible coronavirus impact.\n\n&gt; #**STOCK SYMBOL:** HLT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=HLT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/HLT)**)\n\n*****\n\n&gt; **T-Mobile US (TMUS), Sprint (S)** – The mobile service providers are expected to win the approval of a federal judge for their $26 billion merger deal today, according to sources. That would end an effort by state attorneys general to block the combination of the third- and fourth-largest wireless carriers.\n\n&gt; #**STOCK SYMBOL:** TMUS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TMUS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TMUS)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** S\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=S&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/S)**)\n\n*****\n\n&gt; **Slack Technologies (WORK)** – Slack said in a Securities and Exchange Commission filing that IBM (IBM) had been the messaging platform’s largest customer for several years and had expanded its use of Slack over that time. The statement was issued in response to an earlier report that a new deal had been struck that made IBM Slack’s largest customer, which had sent the stock surging in the regular session Monday.\n\n&gt; #**STOCK SYMBOL:** WORK\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WORK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WORK)**)\n\n*****\n\n&gt; **Callaway Golf (ELY) **– Callaway lost 26 cents per share for its fourth quarter, wider than the 23 cents a share loss that analysts were expecting. The golf club maker reported better-than-expected revenue but said the coronavirus will have a negative impact in terms of both sales in Asia and on supplies.\n\n&gt; #**STOCK SYMBOL:** ELY\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ELY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ELY)**)\n\n*****\n\n&gt; **ViacomCBS (VIACA)** – ViacomCBS unit CBS Sports has struck a deal with sports betting company William Hill, allowing William Hill to seek new customers among the CBS Sports audience. William Hill would seek to get CBS Sports users to download its app and deposit money in betting accounts.\n\n&gt; #**STOCK SYMBOL:** VIAC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=VIAC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/VIAC)**)\n\n*****\n\n&gt; **XPO Logistics (XPO)** – XPO beat estimates by 10 cents a share, with adjusted quarterly earnings of $1.12 per share. The transportation and delivery company’s revenue came fall below analysts’ forecasts, however. XPO also announced the appointment of a new chief financial officer.\n\n&gt; #**STOCK SYMBOL:** XPO\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=XPO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/XPO)**)\n\n*****\n\n&gt; **Boston Beer (SAM)** – Boston Beer was upgraded to “outperform” from “neutral” at Credit Suisse, which points to the company’s increasing involvement in the hard seltzer market. Credit Suisse also increased its price target on the beer brewer’s stock to $525 per share from $400.\n\n*****\n\n&gt; #**STOCK SYMBOL:** SAM\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SAM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SAM)**)\n\n*****\n\n#**FULL DISCLOSURE:**\n\n&gt; /u/bigbear0083 has no positions in any stocks mentioned. Reddit, moderators, and the author do not advise making investment decisions based on discussion in these posts. Analysis is not subject to validation and users take action at their own risk. /u/bigbear0083 is an admin at the financial forums [Stockaholics.net](http://www.stockaholics.net/) where this content was originally posted.\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/StockMarket?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Tuesday, February 11th, 2020! :)**",
        "subreddit": "StockMarket",
        "title": "Today's Pre-Market News [Tuesday, February 11th, 2020]",
        "url": "https://www.reddit.com/r/StockMarket/comments/f289kq/todays_premarket_news_tuesday_february_11th_2020/",
        "created": 1581456279.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1581427542,
        "id": "f28a1w",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/stocks sub! Welcome to Tuesday. Here is your pre-market news this AM-\n\n*****\n\n#[Today's Top Headlines for Tuesday, February 11th, 2020](https://www.cnbc.com/2020/02/11/dow-to-rise-powell-testifies-coronavirus-death-toll-passes-1000.html)\n\n* U.S. stock futures point to a higher open, following record closes for the S&amp;P 500 and Nasdaq on Monday, as investors are encouraged by a slowdown in the number of new coronavirus cases. The Dow, S&amp;P 500 and Nasdaq are higher in five of the past six sessions, and four S&amp;P sectors are at record highs: Consumer Discretionary, Consumer Staples, Tech and Real Estate. (CNBC)\n* Ray Dalio thinks the coronavirus’ hit to global markets is probably exaggerated (CNBC)\n* The director-general of the World Health Organization reportedly warned that while almost all of the confirmed coronavirus cases are in China, the outbreak constitutes a “very grave threat” for the rest of the world. China’s National Health Commission reported that a total of 42,638 cases had been confirmed in the country, with 1,016 deaths. (CNBC)\n* Nearly 200 evacuees to leave cornavirus quarantine in US (AP)\n* Fed Chairman Jerome Powell testifies today and tomorrow in the first of his twice-a-year economic updates to Congress, with investors listening for commentary on any coronavirus impact on the U.S. economy. On today’s economic calendar, the government is out with JOLTS, the Job Openings and Labor Turnover Survey, for December at 10 a.m. ET. (CNBC)\n* AutoNation (AN), Hasbro (HAS), Hilton Worldwide (HLT), Tegna (TGNA) and Under Armour (UAA) are out with quarterly earnings this morning, while Denny’s (DENN), Groupon (GRPN), Lyft (LYFT), and Western Union (WU) are among the companies issuing quarterly numbers after the bell.\n* A U.S. district judge is expected to rule in favor of allowing Sprint (S) and T-Mobile (TMUS) to merge over the objections of a group of state attorneys general, Reuters reported. It’s a decision that’s supposed to be made today. Shares of Sprint surged 69% in Monday’s after-hours trade and T-Mobile stock rose 8%. (CNBC)\n* The Democratic presidential race is deeply unsettled heading into today’s New Hampshire primary. It may be up to the state to put some structure around the chaotic contest, with Iowa being unable to declare a clear winner. New Hampshire’s secretary of state has predicted a healthy 292,000 Democratic voters, which would be about 40,000 more than voted in 2016. (AP)\n* Small New Hampshire town of Dixville Notch votes for Bloomberg in primary (USA Today)\n* Pete Buttigieg sees surge in support from business execs after his strong showing in Iowa (CNBC)\n* Bernie Sanders hopes New Hampshire primary will tighten his early grip on 2020 race (CNBC)\n* Mike Bloomberg could ‘handily beat’ Trump in 2020, says ex-Trump aide Anthony Scaramucci (CNBC)\n* Amazon (AMZN) is seeking to question President Donald Trump, Defense Secretary Mark Esper and former Defense Secretary James Mattis over a $10 billion Pentagon cloud contract awarded to Microsoft (MSFT). Amazon’s cloud computing arm said it’s looking to depose seven “individuals who were instrumental” in the JEDI source selection. (CNBC)\n* The Justice Department indicted four members of China’s military for the cyberattack against credit ratings agency Equifax in 2017. The incident led to the loss of personal information belonging to 145 million people, mostly in the U.S. but also in Canada and Europe. (CNBC)\n* The FAA is narrowing the issues needed before it can conduct a certification test flight on the grounded Boeing (BA) 737 Max, but will not commit to a timetable for lifting a flight ban. The certification flight to be carried out by FAA pilots “is not scheduled yet because we still have a few issues to resolve, but we continue to narrow the issues,” FAA Administrator Steve Dickson said. (Reuters)\n* DOT watchdog probes FAA’s pilot training after 2 deadly crashes of Boeing 737 Max (CNBC)\n* Google (GOOGL) human resources chief Eileen Naughton is stepping down from her role as tensions grown between employees and management. Naughton, who has held various roles at the company since 2006, has led the company’s human resources department as the vice president of people operations since 2016. (CNBC)\n* Shares of Slack (WORK) fell over 7% in the premarket after it filed an 8-K on Monday downplaying a news report that sent its stock surging more than 15%. The statement was issued in response to an earlier report that a new deal had been struck that made IBM Slack’s largest customer, which had sent the stock surging in the regular session Monday. (CNBC)\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](http://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://finviz.com/publish/021120/sec_all_075437166.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/wteeBZT.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/OeoDGfL.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/yKvMhID.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/SNqq5HC.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/8e4snrC.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/azlFbrt.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/YNP3Pq5.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/Vv5WIT7.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/vpdF9tz.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/SvyrDnj.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/CBl5AFZ.png)**)\n\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/G5AF0Cr.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #1!](https://i.imgur.com/22zaDPV.png)**)\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #2!](https://i.imgur.com/KMtzoBJ.png)**)\n\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS:\n\n* MYO\n* FB\n* UAA\n* UBS\n* MA\n* MSFT\n* NVDA\n* WORK\n* HAS\n* TMUS\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2020/02/11/stocks-making-the-biggest-moves-in-the-premarket-hasbro-under-armour-slack-sprint-more.html)**)\n\n*****\n\n&gt; **Under Armour (UAA)** – The athletic apparel maker reported an overall loss for the quarter, and warned of a negative sale impact from the coronavirus. The company also said it is assessing a possible 2020 restructuring.\n\n&gt; #**STOCK SYMBOL:** UAA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=UAA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/UAA)**)\n\n*****\n\n&gt; **AutoNation (AN)** – The nation’s largest car retailer beat estimates on both the top and bottom lines for the fourth quarter, with results boosted by higher demand for pre-owned vehicles.\n\n&gt; #**STOCK SYMBOL:** AN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AN)**)\n\n*****\n\n&gt; **Hasbro (HAS)** – The toymaker reported a quarterly profit of $1.24 per share, well above the consensus estimate of 91 cents a share. Sales fell short of Street forecasts, however, but Hasbro’s bottom line got a boost from toys related to Disney’s “Frozen 2” and “Star Wars” movies.\n\n&gt; #**STOCK SYMBOL:** HAS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=HAS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/HAS)**)\n\n*****\n\n&gt; **Hilton Worldwide (HLT)** – The hotel operator earned $1.00 per share for the fourth quarter, 4 cents a share above estimates. Revenue also beat forecasts. Hilton’s 2020 earnings outlook was below analysts’ forecasts, however, and the company said the outlook does not include possible coronavirus impact.\n\n&gt; #**STOCK SYMBOL:** HLT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=HLT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/HLT)**)\n\n*****\n\n&gt; **T-Mobile US (TMUS), Sprint (S)** – The mobile service providers are expected to win the approval of a federal judge for their $26 billion merger deal today, according to sources. That would end an effort by state attorneys general to block the combination of the third- and fourth-largest wireless carriers.\n\n&gt; #**STOCK SYMBOL:** TMUS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TMUS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TMUS)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** S\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=S&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/S)**)\n\n*****\n\n&gt; **Slack Technologies (WORK)** – Slack said in a Securities and Exchange Commission filing that IBM (IBM) had been the messaging platform’s largest customer for several years and had expanded its use of Slack over that time. The statement was issued in response to an earlier report that a new deal had been struck that made IBM Slack’s largest customer, which had sent the stock surging in the regular session Monday.\n\n&gt; #**STOCK SYMBOL:** WORK\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WORK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WORK)**)\n\n*****\n\n&gt; **Callaway Golf (ELY) **– Callaway lost 26 cents per share for its fourth quarter, wider than the 23 cents a share loss that analysts were expecting. The golf club maker reported better-than-expected revenue but said the coronavirus will have a negative impact in terms of both sales in Asia and on supplies.\n\n&gt; #**STOCK SYMBOL:** ELY\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ELY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ELY)**)\n\n*****\n\n&gt; **ViacomCBS (VIACA)** – ViacomCBS unit CBS Sports has struck a deal with sports betting company William Hill, allowing William Hill to seek new customers among the CBS Sports audience. William Hill would seek to get CBS Sports users to download its app and deposit money in betting accounts.\n\n&gt; #**STOCK SYMBOL:** VIAC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=VIAC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/VIAC)**)\n\n*****\n\n&gt; **XPO Logistics (XPO)** – XPO beat estimates by 10 cents a share, with adjusted quarterly earnings of $1.12 per share. The transportation and delivery company’s revenue came fall below analysts’ forecasts, however. XPO also announced the appointment of a new chief financial officer.\n\n&gt; #**STOCK SYMBOL:** XPO\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=XPO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/XPO)**)\n\n*****\n\n&gt; **Boston Beer (SAM)** – Boston Beer was upgraded to “outperform” from “neutral” at Credit Suisse, which points to the company’s increasing involvement in the hard seltzer market. Credit Suisse also increased its price target on the beer brewer’s stock to $525 per share from $400.\n\n*****\n\n&gt; #**STOCK SYMBOL:** SAM\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SAM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SAM)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/stocks?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Tuesday, February 11th, 2020! :)**",
        "subreddit": "stocks",
        "title": "Today's Pre-Market News [Tuesday, February 11th, 2020]",
        "url": "https://www.reddit.com/r/stocks/comments/f28a1w/todays_premarket_news_tuesday_february_11th_2020/",
        "created": 1581456342.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1581513902,
        "id": "f2r61e",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/smallstreetbets sub! Welcome to Wednesday. Here is your pre-market news this AM-\n\n*****\n\n#[Today's Top Headlines for Wednesday, February 12th, 2020](https://www.cnbc.com/2020/02/12/today-dow-to-rise-bernie-takes-new-hampshire-powell-back-on-the-hill.html)\n\n* After a decline that took the major averages well off their Tuesday session highs, U.S. stock futures point to a strong Wednesday open as investors become slightly less concerned about the coronavirus. The S&amp;P 500 and Nasdaq did manage to eke out record closes Tuesday despite the fall from their highs, and both are up in six of the past seven sessions. (CNBC)\n* On today’s economic calendar, Fed Chairman Jerome Powell will be back on Capitol Hill today, this time before the Senate Banking Committee in the second day of his semi-annual testimony on monetary policy. The Mortgage Bankers Association is out with its weekly report on mortgage applications at 10 a.m. ET, while the Energy Department releases its usual Wednesday look at oil inventories at 10:30 a.m. ET. (CNBC)\n* Bitcoin hits highest price this year, above $10,000 as Powell discusses cryptocurrencies (CNBC)\n* Powell says Fed ‘closely monitoring’ coronavirus for hit to China and the world (CNBC)\n* Earnings reports out before the opening bell include CVS Health (CVS), Molson Coors (TAP), Moody’s (MCO), and Teva Pharmaceutical (TEVA). After-the-bell reports will come today from Altice US (ATUS), Applied Materials (AMAT), Cisco Systems (CSCO), Equifax (EFX), International Flavors (IFF), Marathon Oil (MRO), MGM Resorts (MGM), Redfin (RDFN), and TripAdvisor (TRIP).\n* Shares of Bed Bath &amp; Beyond (BBBY) were losing about a quarter of their value in the premarket after the home goods retailer said same-store sales were down a greater-than-expected 5.4% in December and January. The company blamed increased promotional pricing, lower store traffic and issues with inventory management. (Reuters)\n* Shares of Lyft (LYFT) were down over 4% in the premarket despite a strong fourth-quarter report. The company’s earnings beat estimates on revenue and active riders and a lower-than-expected loss per share. However, Lyft did not give an update on its profitability timeline as its competitor Uber (UBER) did during its earnings report last week. (CNBC)\n* Sen. Bernie Sanders will win New Hampshire’s Democratic primary, NBC News projected, setting him up near the top of a fractured presidential field. The Vermont senator will edge out former Mayor Pete Buttigieg. Sen. Amy Klobuchar of Minnesota will come in third. Sen. Elizabeth Warren and former VP Joe Biden were vying for fourth place as results came in. (CNBC)\n* Joe Biden’s donors are divided on his 2020 prospects after New Hampshire, Iowa flops (CNBC)\n* Amy Klobuchar’s campaign gets a boost as Biden and Warren fizzle in New Hampshire (CNBC)\n* Presidential candidate Andrew Yang dropped out of the 2020 Democratic race after finishing well behind top-tier candidates in the Iowa caucus and New Hampshire primary. Sen. Michael Bennet also dropped out of the race as results started rolling in. (CNBC)\n* The flu-like coronavirus that has sickened more than 44,500 people in over two dozen countries now has a name: COVID-19. The new virus that emerged from a seafood market in Wuhan, China, likely originated in bats and then jumped to an “intermediate host” before infecting humans, World Health Organization officials said. (CNBC)\n* The coronavirus appears to be sparing one group of people: Kids (CNBC)\n* CDC says ‘mix-up’ led to early release of coronavirus patient in California (CNBC)\n* Nissan filed a civil lawsuit against former Chairman Carlos Ghosn today, seeking an initial amount of $90 million. The claimed damages are linked to Ghosn’s “breach of fiduciary duty as a company director and his misappropriation of Nissan’s resources and assets,” the Japanese automaker said in a statement. (CNBC)\nAirbnb reportedly lost money last year as costs outpaced revenue, casting doubt on the company’s private valuation and the timing of its planned public debut this year. The home-sharing start-up reportedly lost $322 million over the first nine months of last year.\n* Google (GOOGL) today will seek to overturn the first of three hefty EU antitrust fines at Europe’s second-highest court in a landmark case that could determine how EU enforcers take on U.S. tech giants for abuse of market power. In the U.S., the FTC said it will examine prior acquisitions by Alphabet, Amazon, Apple, Facebook and Microsoft. (Reuters &amp; CNBC)\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](http://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://finviz.com/publish/021220/sec_all_075545303.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/2NFklMI.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/JZvKQQF.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/yKvMhID.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/SNqq5HC.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/8e4snrC.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/fUJnHKf.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/e4k5yaU.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES LINK #1!](https://i.imgur.com/81YRY94.png)**)\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES LINK #2!](https://i.imgur.com/9oHPiEd.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/otKC51Z.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/UTuFNXH.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/4adkt39.png)**)\n\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/0I0C5zS.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #1!](https://i.imgur.com/ifUy0wj.png**)\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #2!](https://i.imgur.com/MXLqYuv.png)**)\n\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS:\n\n* SHOP\n* TEVA\n* CVS\n* LYFT\n* ROKU\n* BBBY\n* MRNA\n* CYBR\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2020/02/12/stocks-making-the-biggest-moves-in-the-premarket-cvs-health-molson-coors-moodys-more.html)**)\n\n*****\n\n&gt; **CVS Health (CVS)** – The drug store operator beat estimates by 5 cents a share, with quarterly earnings of $1.73 per share. Revenue also beat forecasts and CVS gave a full-year EPS outlook of $7.04 to $7.17, compared to a consensus estimate of $7.15 a share.\n\n&gt; #**STOCK SYMBOL:** CVS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=CVS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/CVS)**)\n\n*****\n\n&gt; **Molson Coors (TAP)** – The beer brewer earned $1.02 per share for the fourth quarter, well above the 78 cents a share consensus estimate. Revenue also beat Wall Street projections, despite what Molson Coors calls “significant headwinds and continued volume declines.”\n\n&gt; #**STOCK SYMBOL:** TAP\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TAP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TAP)**)\n\n*****\n\n&gt; **Teva Pharmaceutical (TEVA)** – The world’s largest generic drugmaker beat estimates by a penny a share, with quarterly profit of 62 cents per share. Revenue also topped expectations.\n\n&gt; #**STOCK SYMBOL:** TEVA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TEVA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TEVA)**)\n\n*****\n\n&gt; **Moody’s (MCO)** – The credit-rating agency earned $2.00 per share for the fourth quarter, 7 cents a share above estimates. Revenue also came in above analysts’ forecasts. The company’s full-year outlook for 2020 is also largely above consensus. Moody’s said it is benefiting from increased global bond issuance, as well as increasing demand for research from its Moody’s Analytics unit.\n\n&gt; #**STOCK SYMBOL:** MCO\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=MCO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/MCO)**)\n\n*****\n\n&gt; **Shopify (SHOP)** – The e-commerce platform company earned an adjusted 43 cents per share for its latest quarter, compared to a consensus estimate of 24 cents a share. Revenue also beat forecasts on strong Black Friday and Cyber Monday sales on Shopify’s platform.\n\n&gt; #**STOCK SYMBOL:** SHOP\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SHOP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SHOP)**)\n\n*****\n\n&gt; **CyberArk Software (CYBR)** – The cybersecurity company beat estimates by 16 cents A share, with quarterly earnings of 97 cents per share. Revenue also came in above consensus. CyberArk said, however, that its full-year adjusted EPS outlook is $2.26-$2.38, below the consensus estimate of $2.79 a share.\n\n&gt; #**STOCK SYMBOL:** CYBR\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=CYBR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/CYBR)**)\n\n*****\n\n&gt; **Lyft (LYFT)** – Lyft lost $1.19 per share for the fourth quarter, 20 cents a share less than Wall Street had been expecting. The ride-hailing service’s revenue beat consensus estimates. Lyft also said it is still on track to achieve a key measure of profitability by the end of 2021.\n\n&gt; #**STOCK SYMBOL:** LYFT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=LYFT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LYFT)**)\n\n*****\n\n&gt; **Bed Bath &amp; Beyond (BBBY)** – The housewares retailer said same-store sales were down a greater-than-expected 5.4% in December and January, amid increased promotional pricing, lower store traffic, and issues with inventory management.\n\n&gt; #**STOCK SYMBOL:** BBBY\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BBBY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BBBY)**)\n\n*****\n\n&gt; **Akamai Technologies (AKAM)** – Akamai reported adjusted quarterly earnings of $1.23 per share, 10 cents a share above estimates. Akamai’s ’s revenue also beat Street forecasts. Results were driven by strong growth in its cloud security unit, as well as upbeat results for its flagship content delivery platform business.\n\n&gt; #**STOCK SYMBOL:** AKAM\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AKAM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AKAM)**)\n\n*****\n\n&gt; **Alphabet (GOOGL)** – Alphabet’s Google unit will be in court today, seeking to overturn one of three record European Union antitrust fines. Google had been fined $2.6 billion for allegedly favoring its own price comparison shopping service over those of smaller European competitors.\n\n&gt; #**STOCK SYMBOL:** GOOGL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=GOOGL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/GOOGL)**)\n\n*****\n\n&gt; **NCR (NCR)** – NCR beat estimates by a penny a share, with quarterly profit of 85 cents per share. The payment processing software and services provider’s revenue was also above Street forecasts.\n\n&gt; #**STOCK SYMBOL:** NCR\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=NCR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/NCR)**)\n\n*****\n\n&gt; **Western Union (WU)** – Western Union reported quarterly earnings of 38 cents per share, 5 cents a share below estimates. The payment processing company’s revenue also beat forecasts, and Western Union gave an upbeat outlook for 2020. The company announced a 13% increase in its quarterly dividend as well.\n\n&gt; #**STOCK SYMBOL:** WU\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WU)**)\n\n*****\n\n&gt; **Macerich (MAC)** – Macerich was downgraded to “underweight” from “neutral” at Piper Sandler, which thinks Simon Property’s (SPG) acquisition of Taubman Centers (TCO) makes an acquisition of the shopping center operator less likely.\n\n&gt; #**STOCK SYMBOL:** MAC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=MAC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/MAC)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/smallstreetbets?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Wednesday, February 12th, 2020! :)**",
        "subreddit": "smallstreetbets",
        "title": "Today's Pre-Market News [Wednesday, February 12th, 2020]",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/f2r61e/todays_premarket_news_wednesday_february_12th_2020/",
        "created": 1581542702.0
    },
    {
        "author": "shortbyndlongmeat",
        "created_utc": 1581095918,
        "id": "f0dksw",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "The Wu Tang virus can only be cured by one man",
        "url": "https://i.redd.it/c23mmqsecjf41.jpg",
        "created": 1581124718.0
    },
    {
        "author": "BullSharkShark",
        "created_utc": 1581453733,
        "id": "f2en2i",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "WU puts for a tank after Bell??",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f2en2i/wu_puts_for_a_tank_after_bell/",
        "created": 1581482533.0
    }
]