[
    {
        "author": "GoodN1ght94",
        "created_utc": 1592081385,
        "id": "h8fjcj",
        "num_comments": 183,
        "num_crossposts": 0,
        "selftext": "Just try to remember how stupid some of the people in your college econ classes were. Now remind yourself a bunch of those people work for big hedge funds and big banks because of daddy's connections and the truly worthless go raise funds for charities or something. A guy I know works for JPMorgan and he could be mostly aptly described as a rock eater (well take any anecdotal evidence with a grain of salt but I'm sure I'm not the only one to know a glue sniffer who works on Wall St.)\n\nSome single individuals like Michael Burry (who's now bathing in his pre pump WYNN/LVS/FL calls) are able to beat the market consistently but those people are so fucking rare they generally can't overcome the mass of retards that usually compose the rest of their funds or bank (even then they can be wrong, hello GME). These people represent 0.00001% of institutional investors and most of the time the money they move is not enough to get things going\n\nAnd that truth is reflected when it's put under the microscope:\n\n'' From January 1994 to October 2018 – through both bull and bear markets – the passive [S&amp;P 500 Index](https://www.investopedia.com/terms/s/sp500.asp) outperformed every major hedge fund strategy by about 2.25 percent in annualized return ''\n\nSo stop worrying about ''the rug getting pulled'' in these times because they can't pull the rug on their own. We gotta pull it with them too. We saw that when even big Daddy Buff got out earned by mental retards for 2 months straight. He sure as fuck didn't want to tank that 20% loss on purpose. So stop worrying so much about how ''big money'' is gonna fuck us and enjoy the ride of the most roller-coaster market of our lifetimes.  \n\n\nEdit: Don't wanna get banned so positions here, mostly cash cuz switching brokers but\n\nHTZ 7/17 2$ and 3$ Ps\n\nMGM 6/26 21$ C\n\nRDSa 7/17 35$ C\n\nPFE 7/17 35$ C",
        "subreddit": "wallstreetbets",
        "title": "Stop pretending Hedge Funds and Big Banks aren't made of retards.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/h8fjcj/stop_pretending_hedge_funds_and_big_banks_arent/",
        "created": 1592110185.0
    },
    {
        "author": "TendiesCrusher",
        "created_utc": 1591299666,
        "id": "gwok28",
        "num_comments": 126,
        "num_crossposts": 0,
        "selftext": "Alright retards , I didnt do any DD on how they will do on earnings but im willing to gamble based on the high short interest and that Michael Burry (Christian Bale from big short) owns a 5% stake in this.\n\nBut hey, stonks only go up , so I'm in on 4.5 Calls expiring 6/12 \n\nBecause why the fuk not",
        "subreddit": "wallstreetbets",
        "title": "GME earnings on June 9. 55.6million shares short (total outstanding shares = 64.58) sitting at 86% short interest",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gwok28/gme_earnings_on_june_9_556million_shares_short/",
        "created": 1591328466.0
    },
    {
        "author": "Becausereasons1",
        "created_utc": 1592147395,
        "id": "h8via6",
        "num_comments": 51,
        "num_crossposts": 0,
        "selftext": "Alright,\n\nThis post was removed from “another subreddit” without explanation. Can’t get an answer on why, but I DID NOT delete that post and I WILL NOT delete this one. I’ve cleaned up the language and humorous insults so it’s geared toward a broader audience and will treat you all like adults. \n\nI'm here to crack open the matrix and give you a framework to draw conclusions and ideas from. Much of this is known information, but I’m putting it into a context that connects the dots. \n\nAlso, now that you're in here I'm going to convince you that it's going to be a long burn down from here. Circuit breakers? Very likely. New lows? Absolutely. Do I have your attention? Proceed.\n\n**I know what you're thinking....**\n\n*\"Nobody could have seen this coming!*\n\n*\"Buy the dip!\"*\n\n*\"institutions are selling!\"*\n\n*\"Rug pull\"*\n\n*\"JPow will save us!\"*\n\nRetail is all caught with their pants down and are going to be holding Wall Street’s and the corporation’s bags. We’re the only ones left with any faith in the market going up. This is a game of musical chairs and the smart money just took the chairs and left the room.\n\nI've never posted here. I comment, I learn, I steal ideas, and I've been building my thesis while Robinhooders buy Hertz. Maybe we can discuss that later, there's no time to waste.\n\n**Few things...Keep this all in mind while we go along and if you don't know what I'm talking about just google. It's all out there.**\n\n1. We're in a bubble. We have been for a long time. Valuations are stupid, PE ratios off the charts, Nikola is big enough to enter the S&amp;P - IF IT HAD ANY EARNINGS!\n2. Debt and leverage globally absolutely DWARF the 2008 problems surrounding CDO's. You think there was a little corruption and clever lending in America's banking system? Imagine what goes on in the rest of the world\n3. Pretend Covid-19 doesn't exist. The \"crash\" in Feb/March was coming no matter what. Governments, corporations, banks all knew it was inevitable and that there is chaos in the financial system. Let's just operate under that assumption.\n4. Think of right now as being the 2008 housing crisis, but instead of houses in America it's COMPANIES IN THE WORLD (hint: its a lot bigger problem)\n5. First Crash was a liquidity crisis. Nobody had enough cash on their balance sheet to hand over to the people they owed. Think of it like when you don't pay rent. Your landlord might be financially able to take the hit, but he really doesn't want to sell his Tesla stock to pay HIS landlord and so on and so on until the entire financial system seizes up. (psst that's why it's called \"liquidity\")\n6. The fed and central banks came to the rescue the only ways they are legally allowed to. Now that's taken care of and everyone is rife with liquidity to keep the system turning. Today, we are entering a SOLVENCY CRISIS.\n\n**Part 1 - What the Fed is REALLY doing**\n\nNow... let me enlighten you for a second... THE FED DOESN'T ‘BUY STOCKS’. Well, at least not directly. If you remember one thing about the fed, remember - they are bound by RULES. They MUST keep a balance sheet like any other bank. And the money they \"print\" cannot enter the market the same way your paycheck buys condoms for your wife's boyfriend. It's there to sit on the other side of the balance sheet of BANKS or the TREASURY who can then lend \"real\" money into the economy. There's no money that gets \"out\" - It's all \"loaned\" unless it comes from \"stimulus\" which still goes through Congress and the Treasury. More on that later.\n\n**THE POINT IS THERE'S ALWAYS AT LEAST ONE MIDDLE MAN. THIS IS MASSIVELY IMPORTANT LATER!!!**\n\nHere is the breakdown of the steps the fed MUST take when conducting those \"Open Market Operations\" we've all heard about.\n\n**1. When the Fed buys government securities through securities dealers in the bond market, it deposits the payment into the bank accounts of the banks, businesses, and individuals who sold the securities.**\n\n**2. Those deposits become part of the funds commercial banks hold at the Federal Reserve and thus part of the funds commercial banks have available to lend.**\n\n**3. Because banks want to lend money, to attract borrowers they decrease interest rates, including the rate banks charge each other for overnight loans (the federal funds rate).**\n\nSee? The fed only provides \"money\" to institutions they are legally allowed to give money to (Treasury and banks). For simplicity's sake just think of JPow going into his computer and typing in a few zeroes on JP Morgan’s Computer. Doesn't matter. The fed's hands are tied and they can only control rates and print money. Oh by the way... The Fed lowered banks' fractional reserve requirement to ZERO in March. **That means banks don't have to have ANY money in the vault.** Make of this what you will.\n\n**Part 2 - Why Stimulus is Different than printed liquidity**\n\nSo now we hopefully understand where the new printing is going and how it gets there. It's going to anyone who needs a little bump to their cash pile in order to fulfill their existing debt obligations **ONLY TO KEEP THE SYSTEM WORKING.** No more, no less. Fed prints $ and banks give loans. Fed prints $ and Treasury writes checks. **NOBODY** ***WANTS*** **TO DO THIS**\n\nRead this whole article if you want, but I'll pull out what matters.\n\n[The Great Leverage Unwind](https://www.guggenheiminvestments.com/perspectives/global-cio-outlook/the-great-leverage-unwind) \\- **March 22 Before the Stimulus!!**\n\n*\"In order to get a foundation under the markets, we’re going to need something very large, something in the $2 trillion range in the form of a pool of liquidity that can be made quickly available to businesses and corporations that need it, along with the financing facilities of $2 trillion–$4 trillion from the Fed.\"*\n\n**\"Liquidity that can be made quickly available\" = YOUR STIMULUS BABY**\n\n**When it comes to getting fed money to individual companies WE are that middle man I mentioned earlier. It takes the responsibility off of the Fed, so they can claim “free market”.**\n\n**Part 3 - Creating a generation of bagholders**\n\nNow here we are at the March lows. You're locked down, sitting on a Zoom conference call and life sucks. But you're alright. You’ve still got a job and aren't really spending money. And hey, you’re are about to have a stack deposited in your Chase account.\n\n\"LOOK HOW CHEAP GAMESTOP STOCK IS!!! AND THE GUY FROM THE BIG SHORT BOUGHT IT!!! I'M A GENIUS!!!\"\n\nNo, Burry is a genius. And he’s already been dumping his bag on you. Along with TLRD, BA, FB, MIK and DISCA. Just wait until you see Scion's next quarterly filings. Hint: It ain't gonna be those companies no more\n\nSame with Buffett.\n\nSame with Ackman.\n\nSame with Hertz. \n\nOH YEAH....[YOU SOLD YOUR APPLE back TO APPLE](https://www.marketwatch.com/story/apple-expected-to-add-up-to-100-billion-to-buyback-program-while-many-companies-halt-repurchases-2020-04-22)\n\nQ2 filings will be very informative regarding who holds what. I can’t wait.\n\n-I feel I need to highlight this more. What’s it say about Apple and their stock that they made a massive share buyback “because the price is good”? DYOR \n-Also see the latest from Hertz on their insiders and buybacks. They’re raising capital from you guys. Maybe they can get out of bankruptcy, but probably you just gave them a free lunch.\n\n\nTLDR; Global economy is in a corporate debt bubble that works like housing in 2008. Only way this can be fixed is by the measures we see being taken during Covid. Retail has been MANIPULATED AND REQUIRED to perform the functions the Fed cannot(buying individual stocks). This has led to billionaires and institutions leaving retail holding the bag. It’s going to follow a bursting bubble pattern. Nobody is left to prop up the markets nor do they want to because the leverage has to unwind. Dollar might surge like last time and collapse (milkshake theory).\n\nAddition: Futures being green headed into an open just means we open higher for everyone to get a chance to dump. If you were a fund manager would you want the market to open green and THEN sell? Or sit and wait around all day for a sell price you might not get? Remember it’s all about manipulating retail. The “bounce” you figure is coming already happened overnight. Or there was selling overnight and the bounce is coming at the open. Look at the /ES charts and the market hour charts. That price action that happens in between matters to the patterns. A regular S&amp;P chart is basically cut in half. \n\nMessage me if you are interested in what I’m doing through all this.",
        "subreddit": "stocks",
        "title": "A Generation of Bag-Holders - New lows coming",
        "url": "https://www.reddit.com/r/stocks/comments/h8via6/a_generation_of_bagholders_new_lows_coming/",
        "created": 1592176195.0
    },
    {
        "author": "MikeThePutz",
        "created_utc": 1592403712,
        "id": "has2kk",
        "num_comments": 47,
        "num_crossposts": 1,
        "selftext": "Looks like majority of people will opt for the disc version of the PS5. This will help prolong GME’s life cycle. In past console releases, GME’s stock typically peaked in the November around the launch of the console. If things go well, the stock could be a 10x between now and Xmas. But it’s only a small position for me. I own Oct $10 calls.\n\nhttps://www.reddit.com/r/PS5/comments/hao8gh/both_ps5_editions_placed_horizontally_new_pic/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf\n\nMake of that what you will, but GME has 105% of their float shorted at the moment and announcement of early tender offer for their debt (moving from 2021 maturity to 2023 maturity with no covenants) should be announced tomorrow morning).",
        "subreddit": "wallstreetbets",
        "title": "A wee bit DD on The new PS5 and how it affects SNE and Gamestop",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/has2kk/a_wee_bit_dd_on_the_new_ps5_and_how_it_affects/",
        "created": 1592432512.0
    },
    {
        "author": "GnarlyCharlie006",
        "created_utc": 1592502403,
        "id": "hbjfe9",
        "num_comments": 45,
        "num_crossposts": 1,
        "selftext": "It seems like GameStop is becoming obsolete. They have over 5000 stores which are mostly in malls in America and i dont know if youve ever been in one but in my opinion it sort of feels like a yard sale. They’re just flipping used games and used consoles for cheap.\n\nPeople don’t really buy disks for games anymore, and online game companies are growing and selling more games exponentially. \n\nGameStop will continue to sell used consoles, but they wont be able to sell (overpriced) games for them and as newer consoles get developed they will have fewer things to sell at all.\n\nI can also personally attest to the fact that you can get cheaper used consoles from amazon or other online sources. I bought an xbox one for 85 dollars that actually works pretty well. \n\nI loved going into GameStop as a kid, but the simple truth is that the world really doesn’t need them anymore. \n\nMy position: 10/16 1.5 puts at .14",
        "subreddit": "wallstreetbets",
        "title": "¿GME Puts",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hbjfe9/gme_puts/",
        "created": 1592531203.0
    },
    {
        "author": "danzf123",
        "created_utc": 1591897224,
        "id": "h13zum",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": "I sold my options contract of GME 4.5p 6/19 at .56. Order hasn’t been filled and price has since decreased. What did I do wrong? What’s going to happen to my money?",
        "subreddit": "options",
        "title": "My options contract sell order hasn’t been filled?",
        "url": "https://www.reddit.com/r/options/comments/h13zum/my_options_contract_sell_order_hasnt_been_filled/",
        "created": 1591926024.0
    },
    {
        "author": "HappoHero",
        "created_utc": 1591397733,
        "id": "gxf1pz",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "So I downloaded Robinhood as a second \"broker\" just to get myself that FREE share...exciting...create my account, did the \"pick your free share\". BAM! The sumbitch gave me a $GME share and I'm pissed...I hate gamestop and everything it stands for. So you bet your smallstreet ass I sold that single share as soon as I could..\n\nWhich leaves me with $4.05...i gotta play this one smart ya see? I'm definitely not putting my own money into a robinhood account, so we gotta take this $4.05 to the big leagues...where we startin?",
        "subreddit": "smallstreetbets",
        "title": "Robinhood free share...wanna turn it into $1million....guide me",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/gxf1pz/robinhood_free_sharewanna_turn_it_into/",
        "created": 1591426533.0
    },
    {
        "author": "spooncountry",
        "created_utc": 1592523965,
        "id": "hbpsha",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "\nNew consoles being released are backwards compatible (PS5, XBOX, etc)\n\n- Major seller of second-hand games\n\nNew Board of Directors (Paul Evens and Kurtis Wolf)\n\n- Their firms, Hestia Capital Partners and Permit Capital Enterprise Fund own about 7% of outstanding shares\n\n- Firms focus on deep value investing\n- https://realmoney.thestreet.com/investing/board-changes-make-gamestop-worth-following-15351034?puc=yahoo&amp;cm_ven=YAHOO&amp;yptr=yahoo\n- https://www.prnewswire.com/news-releases/permit-capital-and-hestia-capital-nominees-paul-j-evans-and-kurtis-j-wolf-elected-to-gamestop-board-based-on-preliminary-voting-results-301075094.html\n\n500m in cash and debt maturity is being pushed to 2023\n\n- \"As of May 2, 2020, the Company had $417.2 million of debt on the balance sheet and on June 4, 2020, the Company announced an exchange offer and consent solicitation for the remaining unsecured notes due to mature in March 2021.  The new notes, if issued, will provide additional financial flexibility by replacing and extending the maturity of the existing notes validly tendered in the exchange offer until 2023.  There can be no assurance that the exchange offer and consent solicitation will be consummated on the contemplated terms, or at all.”\n- http://news.gamestop.com/news-releases/news-release-details/gamestop-reports-first-quarter-results\n- https://finance.yahoo.com/news/gamestop-announces-receipt-requisite-consents-110734576.html\n\nMarket Cap is ½ of Book Value\n\n- Has cash $570 million in cash ($100M from revolving credit) vs its market cap $300M market cap\n\nShort Interest at 98%\n\n- Stock has been trading sideways (aside from earnings) for weeks —  shorts are paying short premiums and interest for little to no gain\n- Large buying activity after hours\n\nIncrease in online buying\n\n- “...we believe we sold more Nintendo Switch consoles than any other retailer or e-commerce business globally in the first quarter”\n\n- “Even more impressive is that our e-commerce sales grew 519% in the first quarter and over 1,000% during the six weeks that our store base temporarily closed to customer access.” - George Sherman (CEO of Gamestop)\n\n\n\nTDLR: Short squeeze coming, buy calls",
        "subreddit": "wallstreetbets",
        "title": "GME DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hbpsha/gme_dd/",
        "created": 1592552765.0
    },
    {
        "author": "ftball12",
        "created_utc": 1591547744,
        "id": "gyfjiy",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "What do you guys think about buying GameStop stock before PS5 and the new Xbox come out? Historically they’ve shot up incredibly when new consoles come out.",
        "subreddit": "pennystocks",
        "title": "$GME",
        "url": "https://www.reddit.com/r/pennystocks/comments/gyfjiy/gme/",
        "created": 1591576544.0
    },
    {
        "author": "r2434d",
        "created_utc": 1591640329,
        "id": "gz4olm",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Gamestop earnings call",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gz4olm/gamestop_earnings_call/",
        "created": 1591669129.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1591910588,
        "id": "h76toz",
        "num_comments": 23,
        "num_crossposts": 1,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "GME DD: GAMESTOP IS GOING TO 0",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/h76toz/gme_dd_gamestop_is_going_to_0/",
        "created": 1591939388.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1591459750,
        "id": "gxtpfc",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/StockMarket. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning June 8th, 2020.\n\n# **Look for the S&amp;P 500 to turn positive for the year with a boost from the Fed in the week ahead  - [(Source)](https://www.cnbc.com/2020/06/05/look-for-the-sp-500-to-turn-positive-for-the-year-with-a-boost-from-the-fed-in-the-week-ahead.html)**\n*****\n&gt; Federal Reserve Chairman Jerome Powell is expected to reassure markets next week the central bank will do whatever it takes to help the economy heal. That should be enough to keep investors moving into stocks that benefit from an economic rebound and push the S&amp;P 500 into the green for 2020.\n*****\n&gt; The Fed’s two-day meeting is the big event for markets in the coming week. There are a few economic reports, including inflation data, the consumer price index Wednesday and producer prices Thursday. Weekly jobless claims will be important Thursday to see if there’s a drop in continuing clams, after May’s employment report showed a surprising record gain of 2.5 million jobs.\n*****\n&gt; The reopening trade was in full swing in the past week, especially Friday when stocks surged on the jobs report, which was expected to show a loss of 8.3 million jobs. The Nasdaq broke above its record high set on Feb. 19, and the S&amp;P 500 was just 1.1% away from turning positive for 2020.\n*****\n&gt; Even before the jobs report, investors were loading up on financials, industrials, transports and small caps, which were up more than 8% for the week and 18.4% in the past month. S&amp;P financials were 12.1% higher on the week, S&amp;P industrials were up 10.5, and the NYSE airline index jumped more than 35.4.%.\n*****\n&gt; “I think next week is dominated by the reopening and it will be for another month,” said James Paulsen, chief investment strategist at Leuthold Group. “With cyclicals outperforming, small [caps] outperforming, credit spreads coming in and then the bond yields going up, everybody — all facets of the financial markets — are sort of suggesting the same outcome.”\n*****\n&gt; The S&amp;P 500 ended the week at 3,193, a gain of 4.9%, and now traders are watching to see if it can scale the psychological 3,200 level. The Dow closed Friday at 27,110, up 6.8% for the week, and the Nasdaq Composite was up 3.4%, at 9,814 after reaching an intraday record high of 9,845 Friday.\n*****\n&gt; Analysts say the market will likely look past the protests that broke out in cities across the U.S. after the death of George Floyd in Minneapolis. Four policemen were charged with murder in his death. Looters joined the protests, some of which turned violent, but they quieted down towards the end of the week.\n*****\n&gt; Stocks were higher for a third week in a row, but a change this past week has been the abrupt lurch higher in Treasury yields. The 10-year rose to a high of 0.95% Friday, a quarter-point move in just three sessions. The move was already underway but got a lift Wednesday when ADP jobs data was not nearly as bad as expected. Yields ripped even higher after the May employment report showed the unemployment rate actually fell to 13.3%, instead of climbing to 20%, as expected by economists.\n*****\n&gt; Bond strategists said the Treasury market was now acknowledging the potential for a recovery, but not in the exuberant way the stock market has been. Since March 23, the S&amp;P 500 has risen more than 45%, but it took the 10-year Treasury until this week to get back the yield level it was at when stocks bottomed.\n*****\n&gt; Paulsen said he believes a new bull market has been launched, but there could be pullbacks and some headwinds for the market coming up.\n*****\n&gt; “When GDP is minus 30%, other issues don’t matter. There’s just one issue. But as the economy reopens again, the trade battles will matter again, presidential politics will matter again,” said Paulsen, adding the budget deficit could also matter. “I think we’ll get removed from a sole focus. That isn’t quite there but I think it’s coming.”\n*****\n&gt; # Fed ahead\n&gt; The Fed begins its two-day meeting Tuesday, and will release its statement Wednesday afternoon, followed by a video briefing by Powell.\n*****\n&gt; “Whey would the Fed want to disrupt this with anything?” Paulsen said. “They’re still going to support the economy. They’re going to stay away from negative rates or yield curve management. They’re not going to do anything to scare the markets. They might certainly reassure people that they are still ready to provide support.”\n*****\n&gt; Ethan Harris, head of global economics at Bank of America, said the Fed may clarify where it stands on some of the extraordinary moves it has taken since it cut rates to zero. The Fed has been supporting the markets with asset purchases and multiple programs for commercial paper, corporate bonds, and municipal bonds, for example.\n*****\n&gt; “We think right now they’re just trying to get this Main Street lending program to work. The question is are they going to do more things around what they do in terms of forward guidance and next steps of macro easing,” Harris said.\n*****\n&gt; There has been speculation that the Fed would do some type of so-called yield curve control, a program to keep interest rates capped at certain levels. “I think it’s too early for that,” said Harris. He said the Fed would be guaranteeing low rates for a long period of time if it does yield curve control.\n*****\n&gt; “Yield curve control is basically open-ended quantitative easing,” he said. The Fed is currently buying Treasurys but if it wanted to stop yields from rising too much as the economy improves, it could make targeted purchases.\n*****\n&gt; Barclays chief U.S. economist Michael Gapen said it’s possible the Fed could announce the yield curve control. “We’ve said they could implement yield curve control out to three years,” he said. “In my mind that matches the length of the horizon of the economic projections.”\n*****\n&gt; Powell has said the economy needs more fiscal help, and he could reiterate those comments Wednesday. President Donald Trump on Friday said he backs more stimulus. So far, the Democrats have put out a marker with their wish list for further spending, but there have been no negotiations.\n*****\n&gt; There was concern the strong jobs report could make it harder to get buy in for another big spending package. But some economists say the recovery needs a boost and states need funding to fill the holes in their budgets from coronavirus-related spending and a lack of tax receipts.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/7klaXQm.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/PKTBzT2.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/a5JkAB6.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/M2x4Qoq.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/qtJYfXN.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/bjiJWjV.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/UAi19KJ.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/GQm4ruO.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/PQzyXLa.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/uV1U7FN.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/wm2XJND.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/yarkiMO.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/hFblu2G.png))**\n\n*****\n\n# S&amp;P 500 Stocks Outpacing Analyst Price Targets\n\n&gt; This morning's jobs report shocked the financial world -- most notably the economists whose job it is to provide estimates. The consensus estimate among economists for May nonfarm payrolls was projecting a loss of more than 7 million jobs. The actual number that was reported did not just show a smaller than expected job loss, but it actually showed a gain in jobs of more than 2.5 million.\n\n&gt; We're seeing a similar situation play out in the equity analyst community. With the S&amp;P 500 now up 40%+ since its low less than three months ago, the average stock in the index is now trading above its consensus analyst price target that looks 12 months out. Analysts have simply not been able to catch up to the rapid rise we've seen for equity prices.\n\n&gt; It's extremely rare to see share prices move above consensus analyst price targets. We don't have the historical daily data on this, but anecdotally we can't remember a time when the spread has been this wide. As shown below, at the end of 2019 when the S&amp;P finished a massive rally, equity prices were 5.5% below the consensus price target. That was seen as a very tight spread prior to what we're seeing now. At the lows in March, the average share price had dropped all the way to $92.50 compared to an average consensus price target of $143.20. That projected a gain of 54.9% at the time!\n\n&gt; Since March 23rd, the average share price has risen from $92.50 up to $138.40, while the average analyst price target has fallen from $143.20 to $136. Current price targets no longer project a gain for the average S&amp;P 500 stock, but rather a 1.7% drop.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/avgpricetarget.png))**\n\n&gt; # Nasdaq's Historical Run\n\n&gt; At its highs earlier this morning, the Nasdaq Composite was within 2% of its record high from earlier in the year. Besides the steep V-shape of the Nasdaq's pattern over the last four months, the other aspect of the chart that stands out is just how steep the 50-day moving average is trending lately.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060420-Nasdaq-50DMAa.png))**\n\n&gt; To illustrate just how steep the Nasdaq's 50-DMA has become, the chart below shows the daily percentage change of the 50-day going back to 1971. Currently, the Nasdaq 50-DMA is rising at an average of over 0.5% per day. That's an incredible slope and a level that has been exceeded only a handful of times in the Nasdaq's 50-year history.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060420-Nasdaq-Composite1.png))**\n\n*****\n\n# Big Gains From Smaller Tech\n\n&gt; It's still difficult to fathom the moves in the US equity market over the last four months. The fact that the Nasdaq and more specifically the Technology sector aren't far from record highs is definitely something no one was expecting two months ago. There's an old market saying that equities take the stairs up and the elevator down, but in the latest market cycle, the elevator up was almost as fast as the way down!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060320-Nasdaq.png))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060320-Technology-Sector.png))**\n\n&gt; If you've been following the markets, all you've likely heard up until recently is that large-cap tech, and more specifically, Microsoft (MSFT), Apple (AAPL), Amazon (AMZN), Alphabet (GOOGL), and Facebook (FB), are single-handedly driving the market higher. The reality is not nearly as clear-cut. Given their market caps, the \"Big 5\" (as they're often referred to) have done a lot of heavy lifting, but in terms of performance, they're hardly the only game in town.\n\n&gt; The table below lists Technology sector stocks in the Russell 3000 with market caps of more than $1 billion that are outperforming all of the 'big 5' tech stocks on a YTD basis. Actually, since Amazon is doing so well relative to the rest of the \"big 5\" these are all stocks that are outperforming Amazon. If we looked for stocks that were doing better than the average return of the \"big 5\" the list would be a lot, lot longer (+16.4%).\n\n&gt; Looking through the list of names below, the two top-performing names are Zscaler (ZS) and Twilio (TWLO), which have both more than doubled. Behind these two, DocuSign (DOCU) and Sprout Social (SPT) are both knocking on the door of triple-digits. All 28 of the names listed have market caps of $1 billion, but the average market cap is just over $21 billion, while Nvidia (NVDA) is the largest company on the list with a market cap of $216 billion. For the most part, these aren't names that have been driving the indices, but anyone holding these stocks in their portfolio probably doesn't care!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060320-Tech-Stocks.png))**\n\n*****\n\n# Best 50-Day Rally Ever\n\n&gt; In many ways, what we’ve seen so far in 2020 has been both record-breaking and devastating. From the S&amp;P 500 Index peak on February 19 to the bear market lows March 23, stocks lost 33.9%. Now, 50 trading days later, stocks have gained 39.6%, for the largest 50-day rally since the S&amp;P 500 moved to 500 stocks in 1957.\n\n&gt; “There are no rollercoasters that can replicate what stocks have done so far in 2020,” exclaimed LPL Financial Senior Market Strategist Ryan Detrick. “Here’s the catch though: Big 50-day rallies in the past have taken place near the start of new bull markets, and the returns going out a year were quite bullish.”\n\n&gt; As shown in the LPL Chart of the Day, the 39.6% gain in 50 days was the greatest 50-day rally ever, besting the previous best in October 1982. What’s important to note here is that many of these rallies took place coming off major market lows, and delivered quite strong returns going out 6 to 12 months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/06/best-fifty-days.png?ssl=1))**\n\n&gt; Although we have near-term worries given this historic run, as some sentiment indicators such as put/call ratios are showing some froth, from a bigger picture perspective, this strong 50-day rally offers a reason to think stock prices may be even higher this time next year.\n\n*****\n\n# 2020 In Charts\n\n&gt; 2020 is only five months old, but in many ways it is one of the most historic years we’ve ever seen. “2020 went from moving along nicely, to seeing the worst recession in a generation and the fastest bear market ever,” explained LPL Financial Senior Market Strategist Ryan Detrick. “Now stocks are in the midst of one of the best bull runs ever, even though the economy remains extremely weak, thanks to record stimulus and hopes over a vaccine.”\n&gt; \nTo best sum it all up, here are 10 charts that tell the picture of 2020 so far.\n\n&gt; 1.) The 2010s were the first decade in history to go all 10 years without a recession, which of course ended just months into the new decade, as the economy stopped. Stocks gained 13.5% on an annual basis last decade, surprisingly, only the third-best decade over the past four.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/06/1-blog-chart.png?ssl=1))**\n\n&gt; 2.) This is an election year, and the S&amp;P 500 Index hasn’t been lower when a President is up for reelection since FDR in 1940. Although this seemed nearly impossible at the March lows, it is looking like this incredible streak could have a chance in 2020.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/2-blog-chart.png?ssl=1))**\n\n&gt; 3.) One of the first signs something could go wrong in 2020 was stocks fell in January. Historically, this has meant potential trouble for the final 11 months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/3-blog-chart.png?ssl=1))**\n\n&gt; 4.) As fears over COVID-19 gripped the world, the Dow Jones Industrial Average had its fastest bear market ever, in only 19 days. To put this in perspective, this was the fastest bear market in the 124-year history of the Dow.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/4-blog-chart.png?ssl=1))**\n\n&gt; 5.) Mark Twain said “History doesn’t repeat itself, but it often rhymes”. Looking at history, every 50 years there has been a terrible pandemic and stocks fell more than 30%. We don’t know if the ultimate lows are in this time, but so far, history is rhyming.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/blog-chart-5.png?ssl=1))**\n\n&gt; 6.) More than 20 million people in the US lost their jobs in April, while the unemployment rate soared to near 15%, the highest since the Great Depression. Record drops in manufacturing, industrial production, retail sales, and consumer spending have all taken place in the past two months as well.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/6-blog-chart.png?ssl=1))**\n\n&gt; 7.) A recession is here, ending the streak of 128 months in a row without one. What is unique about the previous expansion was nominal gross domestic product (GDP) grew only 50%, about the average growth seen during the previous expansions, but this expansion was nearly twice as long as the average expansion (10 years versus 5 years).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/7-blog-chart.png?ssl=1))**\n\n&gt; 8.) The bounce off of the March 23 S&amp;P 500 lows has been historic in many ways. In fact, it was one of the best 20-day rallies ever, with previous best rallies seeing strong returns 6 and 12 months later.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/8-blog-chart.png?ssl=1))**\n\n&gt; 9.) As scary as it was on the way down, stocks have come roaring back, gaining more than 35% from the March 23 lows. This would classify as the greatest bear market bounce ever, which opens the question: is this more than a bear market bounce and instead the start of a new bull market?\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/9-blog-chart.png?ssl=1))**\n\n&gt; 10.) The number of COVID-19 tests in the US nearly doubled in May versus what was seen in April. Additionally, fewer and fewer tests are coming back positive. Testing is one of the key ways we will beat this and this is a step in the right direction. We’ve also seen new monthly lows in people on ventilators, in the ICU, and in hospitals.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/9-blog-chart.png?ssl=1))**\n\n&gt; Hard to believe, but there are still 7 months left in 2020. It hasn’t been easy for any of us, and we continue to keep everyone impacted by this pandemic in mind, but we continue to see the glass as half full. The dual benefit of record monetary and fiscal policy should help create a bridge to help those most impacted, while the economy can slowly come back online later this year.\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending June 5th, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=p1HAZbHiMUI))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 6.7.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n*(VIDEO NOT YET POSTED!)*\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$ADBE** \n&gt; * **$UNFI** \n&gt; * **$CHWY** \n&gt; * **$TIF** \n&gt; * **$LULU** \n&gt; * **$COUP** \n&gt; * **$SFIX** \n&gt; * **$LOVE** \n&gt; * **$NEPT** \n&gt; * **$GHM** \n&gt; * **$REVG** \n&gt; * **$GME** \n&gt; * **$HDS** \n&gt; * **$FIVE** \n&gt; * **$SIG** \n&gt; * **$CASY** \n&gt; * **$CVGW** \n&gt; * **$AMC** \n&gt; * **$FCEL** \n&gt; * **$QTNT** \n&gt; * **$PLCE** \n&gt; * **$CHS** \n&gt; * **$THO** \n&gt; * **$GCO** \n&gt; * **$BF.B** \n&gt; * **$LMNR** \n&gt; * **$WSG** \n&gt; * **$PRTY** \n&gt; * **$GES** \n&gt; * **$BBCP** \n&gt; * **$CONN** \n&gt; * **$HEXO** \n&gt; * **$PHR** \n&gt; * **$PVH** \n&gt; * **$RRGB** \n&gt; * **$PLAY** \n&gt; * **$TNP** \n&gt; * **$JW.A** \n&gt; * **$SB** \n&gt; * **$GSM** \n&gt; * **$SRT**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/PQzyXLa.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/bgPdMCr.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 6.8.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/d2EW1kr.png))\n\n&gt; # ***Monday 6.8.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/uxSiJJr.png))\n\n*****\n\n&gt; # ***Tuesday 6.9.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/3SIjcG7.png))\n\n&gt; # ***Tuesday 6.9.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/cRBrPlt.png))\n\n*****\n\n&gt; # ***Wednesday 6.10.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/DaheXAm.png))\n\n&gt; # ***Wednesday 6.10.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/9mcHxTl.png))\n\n*****\n\n&gt; # ***Thursday 6.11.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/i8SNjWM.png))\n\n&gt; # ***Thursday 6.11.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/9xcBZPK.png))\n\n*****\n\n&gt; # ***Friday 6.12.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n&gt; # ***Friday 6.12.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# Adobe Inc. $392.90\n&gt; **Adobe Inc. (ADBE)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, June 11, 2020. The consensus earnings estimate is $2.33 per share on revenue of $3.17 billion and the Earnings Whisper ® number is $2.39 per share. Investor sentiment going into the company's earnings release has 79% expecting an earnings beat The company's guidance was for earnings of approximately $2.35 per share. Consensus estimates are for year-over-year earnings growth of 26.63% with revenue increasing by 15.51%. Short interest has increased by 3.0% since the company's last earnings release while the stock has drifted higher by 25.6% from its open following the earnings release to be 23.1% above its 200 day moving average of $319.27. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, May 19, 2020 there was some notable buying of 3,194 contracts of the $410.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 4.8% move on earnings and the stock has averaged a 6.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ADBE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# United Natural Foods, Inc. $20.78\n&gt; **United Natural Foods, Inc. (UNFI)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, June 10, 2020. The consensus earnings estimate is $1.41 per share on revenue of $6.67 billion and the Earnings Whisper ® number is $1.42 per share. Investor sentiment going into the company's earnings release has 78% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 131.15% with revenue increasing by 11.86%. Short interest has decreased by 16.0% since the company's last earnings release while the stock has drifted higher by 202.5% from its open following the earnings release to be 96.1% above its 200 day moving average of $10.60. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, June 2, 2020 there was some notable buying of 2,226 contracts of the $22.50 call expiring on Friday, June 19, 2020. Option traders are pricing in a 17.7% move on earnings and the stock has averaged a 15.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=UNFI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Chewy, Inc. $48.44\n&gt; **Chewy, Inc. (CHWY)** is confirmed to report earnings at approximately 4:10 PM ET on Tuesday, June 9, 2020. The consensus estimate is for a loss of $0.11 per share on revenue of $1.55 billion and the Earnings Whisper ® number is ($0.09) per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 37.50% with revenue increasing by 39.78%. Short interest has increased by 37.9% since the company's last earnings release while the stock has drifted higher by 37.5% from its open following the earnings release to be 56.4% above its 200 day moving average of $30.97. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 5.8% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CHWY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Tiffany &amp; Co. $121.99\n&gt; **Tiffany &amp; Co. (TIF)** is confirmed to report earnings at approximately 6:40 AM ET on Tuesday, June 9, 2020. The consensus earnings estimate is $0.21 per share on revenue of $646.40 million. Investor sentiment going into the company's earnings release has 6% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 79.61% with revenue decreasing by 35.56%. Short interest has decreased by 26.5% since the company's last earnings release while the stock has drifted lower by 4.7% from its open following the earnings release to be 1.9% above its 200 day moving average of $119.75. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, June 5, 2020 there was some notable buying of 9,022 contracts of the $110.00 put expiring on Friday, August 21, 2020. Option traders are pricing in a 6.2% move on earnings and the stock has averaged a 3.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TIF&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# lululemon athletica inc. $319.78\n&gt; **lululemon athletica inc. (LULU)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, June 11, 2020. The consensus earnings estimate is $0.28 per share on revenue of $724.78 million and the Earnings Whisper ® number is $0.30 per share. Investor sentiment going into the company's earnings release has 47% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 62.16% with revenue decreasing by 7.35%. Short interest has increased by 53.3% since the company's last earnings release while the stock has drifted higher by 66.1% from its open following the earnings release to be 46.8% above its 200 day moving average of $217.77. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, June 4, 2020 there was some notable buying of 1,385 contracts of the $350.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 9.4% move on earnings and the stock has averaged a 7.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LULU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Coupa Software $216.94\n&gt; **Coupa Software (COUP)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, June 8, 2020. The consensus earnings estimate is $0.07 per share on revenue of $111.83 million and the Earnings Whisper ® number is $0.10 per share. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat The company's guidance was for earnings of $0.06 to $0.08 per share on revenue of $112.00 million to $112.00 million. Consensus estimates are for year-over-year earnings growth of 450.00% with revenue increasing by 37.48%. Short interest has increased by 7.9% since the company's last earnings release while the stock has drifted higher by 94.9% from its open following the earnings release to be 40.3% above its 200 day moving average of $154.59. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, June 4, 2020 there was some notable buying of 1,085 contracts of the $220.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 12.7% move on earnings and the stock has averaged a 9.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=COUP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Stitch Fix, Inc. $24.96\n&gt; **Stitch Fix, Inc. (SFIX)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, June 8, 2020. The consensus estimate is for a loss of $0.17 per share on revenue of $401.40 million and the Earnings Whisper ® number is ($0.13) per share. Investor sentiment going into the company's earnings release has 53% expecting an earnings beat The company's guidance was for revenue of $465.00 million to $475.00 million. Consensus estimates are for earnings to decline year-over-year by 342.86% with revenue decreasing by 1.83%. Short interest has increased by 4.0% since the company's last earnings release while the stock has drifted higher by 66.4% from its open following the earnings release to be 19.1% above its 200 day moving average of $20.96. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, June 2, 2020 there was some notable buying of 5,092 contracts of the $25.00 call expiring on Friday, June 12, 2020. Option traders are pricing in a 21.2% move on earnings and the stock has averaged a 13.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SFIX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Lovesac Company $17.84\n&gt; **Lovesac Company (LOVE)** is confirmed to report earnings at approximately 7:00 AM ET on Tuesday, June 9, 2020. The consensus estimate is for a loss of $0.69 per share on revenue of $48.22 million and the Earnings Whisper ® number is ($0.65) per share. Investor sentiment going into the company's earnings release has 52% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 2.99% with revenue increasing by 17.73%. Short interest has increased by 20.5% since the company's last earnings release while the stock has drifted higher by 109.9% from its open following the earnings release to be 31.5% above its 200 day moving average of $13.57. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 20.1% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LOVE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Neptune Wellness Solutions Inc. $3.14\n&gt; **Neptune Wellness Solutions Inc. (NEPT)** is confirmed to report earnings after the market closes on Wednesday, June 10, 2020. The consensus estimate is for a loss of $0.08 per share on revenue of $6.32 million and the Earnings Whisper ® number is ($0.10) per share. Investor sentiment going into the company's earnings release has 63% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 100.00% with revenue increasing by 48.36%. Short interest has decreased by 4.7% since the company's last earnings release while the stock has drifted higher by 56.2% from its open following the earnings release to be 6.4% above its 200 day moving average of $2.95. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, May 19, 2020 there was some notable buying of 2,960 contracts of the $3.00 call expiring on Friday, June 19, 2020. The stock has averaged a 8.1% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NEPT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Graham Corporation $15.58\n&gt; **Graham Corporation (GHM)** is confirmed to report earnings at approximately 6:30 AM ET on Wednesday, June 10, 2020. The consensus earnings estimate is $0.12 per share on revenue of $32.00 million. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 50.00% with revenue increasing by 35.36%. Short interest has increased by 89.8% since the company's last earnings release while the stock has drifted lower by 21.7% from its open following the earnings release. Overall earnings estimates have been revised lower since the company's last earnings release.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=GHM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/StockMarket.",
        "subreddit": "StockMarket",
        "title": "Wall Street Week Ahead for the trading week beginning June 8th, 2020",
        "url": "https://www.reddit.com/r/StockMarket/comments/gxtpfc/wall_street_week_ahead_for_the_trading_week/",
        "created": 1591488550.0
    },
    {
        "author": "cdraragon",
        "created_utc": 1592890640,
        "id": "he8ua4",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "pennystocks",
        "title": "GameStop looks ready for a break. DD",
        "url": "https://i.redd.it/d1dki626kl651.jpg",
        "created": 1592919440.0
    },
    {
        "author": "ahershy",
        "created_utc": 1592793611,
        "id": "hdjq6j",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "You guys think there's potential to make some tendies with the upcoming next gen gaming consoles this holiday season?\n\n\nPlays:\n- Call on Sony and Microsoft\n\n- Put on Gamestop (because the industry is pushing heavily towards downloadable digital games)\n\nAnyone have any additional insight?",
        "subreddit": "wallstreetbets",
        "title": "Gaming Investing: Ps5, Xbox Series X, Gamestop",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hdjq6j/gaming_investing_ps5_xbox_series_x_gamestop/",
        "created": 1592822411.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1591460250,
        "id": "gxtut4",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "Good Saturday afternoon to all of you here on r/smallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning June 8th, 2020.\n\n# **Look for the S&amp;P 500 to turn positive for the year with a boost from the Fed in the week ahead  - [(Source)](https://www.cnbc.com/2020/06/05/look-for-the-sp-500-to-turn-positive-for-the-year-with-a-boost-from-the-fed-in-the-week-ahead.html)**\n*****\n&gt; Federal Reserve Chairman Jerome Powell is expected to reassure markets next week the central bank will do whatever it takes to help the economy heal. That should be enough to keep investors moving into stocks that benefit from an economic rebound and push the S&amp;P 500 into the green for 2020.\n*****\n&gt; The Fed’s two-day meeting is the big event for markets in the coming week. There are a few economic reports, including inflation data, the consumer price index Wednesday and producer prices Thursday. Weekly jobless claims will be important Thursday to see if there’s a drop in continuing clams, after May’s employment report showed a surprising record gain of 2.5 million jobs.\n*****\n&gt; The reopening trade was in full swing in the past week, especially Friday when stocks surged on the jobs report, which was expected to show a loss of 8.3 million jobs. The Nasdaq broke above its record high set on Feb. 19, and the S&amp;P 500 was just 1.1% away from turning positive for 2020.\n*****\n&gt; Even before the jobs report, investors were loading up on financials, industrials, transports and small caps, which were up more than 8% for the week and 18.4% in the past month. S&amp;P financials were 12.1% higher on the week, S&amp;P industrials were up 10.5, and the NYSE airline index jumped more than 35.4.%.\n*****\n&gt; “I think next week is dominated by the reopening and it will be for another month,” said James Paulsen, chief investment strategist at Leuthold Group. “With cyclicals outperforming, small [caps] outperforming, credit spreads coming in and then the bond yields going up, everybody — all facets of the financial markets — are sort of suggesting the same outcome.”\n*****\n&gt; The S&amp;P 500 ended the week at 3,193, a gain of 4.9%, and now traders are watching to see if it can scale the psychological 3,200 level. The Dow closed Friday at 27,110, up 6.8% for the week, and the Nasdaq Composite was up 3.4%, at 9,814 after reaching an intraday record high of 9,845 Friday.\n*****\n&gt; Analysts say the market will likely look past the protests that broke out in cities across the U.S. after the death of George Floyd in Minneapolis. Four policemen were charged with murder in his death. Looters joined the protests, some of which turned violent, but they quieted down towards the end of the week.\n*****\n&gt; Stocks were higher for a third week in a row, but a change this past week has been the abrupt lurch higher in Treasury yields. The 10-year rose to a high of 0.95% Friday, a quarter-point move in just three sessions. The move was already underway but got a lift Wednesday when ADP jobs data was not nearly as bad as expected. Yields ripped even higher after the May employment report showed the unemployment rate actually fell to 13.3%, instead of climbing to 20%, as expected by economists.\n*****\n&gt; Bond strategists said the Treasury market was now acknowledging the potential for a recovery, but not in the exuberant way the stock market has been. Since March 23, the S&amp;P 500 has risen more than 45%, but it took the 10-year Treasury until this week to get back the yield level it was at when stocks bottomed.\n*****\n&gt; Paulsen said he believes a new bull market has been launched, but there could be pullbacks and some headwinds for the market coming up.\n*****\n&gt; “When GDP is minus 30%, other issues don’t matter. There’s just one issue. But as the economy reopens again, the trade battles will matter again, presidential politics will matter again,” said Paulsen, adding the budget deficit could also matter. “I think we’ll get removed from a sole focus. That isn’t quite there but I think it’s coming.”\n*****\n&gt; # Fed ahead\n&gt; The Fed begins its two-day meeting Tuesday, and will release its statement Wednesday afternoon, followed by a video briefing by Powell.\n*****\n&gt; “Whey would the Fed want to disrupt this with anything?” Paulsen said. “They’re still going to support the economy. They’re going to stay away from negative rates or yield curve management. They’re not going to do anything to scare the markets. They might certainly reassure people that they are still ready to provide support.”\n*****\n&gt; Ethan Harris, head of global economics at Bank of America, said the Fed may clarify where it stands on some of the extraordinary moves it has taken since it cut rates to zero. The Fed has been supporting the markets with asset purchases and multiple programs for commercial paper, corporate bonds, and municipal bonds, for example.\n*****\n&gt; “We think right now they’re just trying to get this Main Street lending program to work. The question is are they going to do more things around what they do in terms of forward guidance and next steps of macro easing,” Harris said.\n*****\n&gt; There has been speculation that the Fed would do some type of so-called yield curve control, a program to keep interest rates capped at certain levels. “I think it’s too early for that,” said Harris. He said the Fed would be guaranteeing low rates for a long period of time if it does yield curve control.\n*****\n&gt; “Yield curve control is basically open-ended quantitative easing,” he said. The Fed is currently buying Treasurys but if it wanted to stop yields from rising too much as the economy improves, it could make targeted purchases.\n*****\n&gt; Barclays chief U.S. economist Michael Gapen said it’s possible the Fed could announce the yield curve control. “We’ve said they could implement yield curve control out to three years,” he said. “In my mind that matches the length of the horizon of the economic projections.”\n*****\n&gt; Powell has said the economy needs more fiscal help, and he could reiterate those comments Wednesday. President Donald Trump on Friday said he backs more stimulus. So far, the Democrats have put out a marker with their wish list for further spending, but there have been no negotiations.\n*****\n&gt; There was concern the strong jobs report could make it harder to get buy in for another big spending package. But some economists say the recovery needs a boost and states need funding to fill the holes in their budgets from coronavirus-related spending and a lack of tax receipts.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/7klaXQm.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/PKTBzT2.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/a5JkAB6.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/M2x4Qoq.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/qtJYfXN.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/bjiJWjV.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/UAi19KJ.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/GQm4ruO.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/PQzyXLa.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/uV1U7FN.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/wm2XJND.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/yarkiMO.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/hFblu2G.png))**\n\n*****\n\n# S&amp;P 500 Stocks Outpacing Analyst Price Targets\n\n&gt; This morning's jobs report shocked the financial world -- most notably the economists whose job it is to provide estimates. The consensus estimate among economists for May nonfarm payrolls was projecting a loss of more than 7 million jobs. The actual number that was reported did not just show a smaller than expected job loss, but it actually showed a gain in jobs of more than 2.5 million.\n\n&gt; We're seeing a similar situation play out in the equity analyst community. With the S&amp;P 500 now up 40%+ since its low less than three months ago, the average stock in the index is now trading above its consensus analyst price target that looks 12 months out. Analysts have simply not been able to catch up to the rapid rise we've seen for equity prices.\n\n&gt; It's extremely rare to see share prices move above consensus analyst price targets. We don't have the historical daily data on this, but anecdotally we can't remember a time when the spread has been this wide. As shown below, at the end of 2019 when the S&amp;P finished a massive rally, equity prices were 5.5% below the consensus price target. That was seen as a very tight spread prior to what we're seeing now. At the lows in March, the average share price had dropped all the way to $92.50 compared to an average consensus price target of $143.20. That projected a gain of 54.9% at the time!\n\n&gt; Since March 23rd, the average share price has risen from $92.50 up to $138.40, while the average analyst price target has fallen from $143.20 to $136. Current price targets no longer project a gain for the average S&amp;P 500 stock, but rather a 1.7% drop.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/avgpricetarget.png))**\n\n&gt; # Nasdaq's Historical Run\n\n&gt; At its highs earlier this morning, the Nasdaq Composite was within 2% of its record high from earlier in the year. Besides the steep V-shape of the Nasdaq's pattern over the last four months, the other aspect of the chart that stands out is just how steep the 50-day moving average is trending lately.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060420-Nasdaq-50DMAa.png))**\n\n&gt; To illustrate just how steep the Nasdaq's 50-DMA has become, the chart below shows the daily percentage change of the 50-day going back to 1971. Currently, the Nasdaq 50-DMA is rising at an average of over 0.5% per day. That's an incredible slope and a level that has been exceeded only a handful of times in the Nasdaq's 50-year history.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060420-Nasdaq-Composite1.png))**\n\n*****\n\n# Big Gains From Smaller Tech\n\n&gt; It's still difficult to fathom the moves in the US equity market over the last four months. The fact that the Nasdaq and more specifically the Technology sector aren't far from record highs is definitely something no one was expecting two months ago. There's an old market saying that equities take the stairs up and the elevator down, but in the latest market cycle, the elevator up was almost as fast as the way down!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060320-Nasdaq.png))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060320-Technology-Sector.png))**\n\n&gt; If you've been following the markets, all you've likely heard up until recently is that large-cap tech, and more specifically, Microsoft (MSFT), Apple (AAPL), Amazon (AMZN), Alphabet (GOOGL), and Facebook (FB), are single-handedly driving the market higher. The reality is not nearly as clear-cut. Given their market caps, the \"Big 5\" (as they're often referred to) have done a lot of heavy lifting, but in terms of performance, they're hardly the only game in town.\n\n&gt; The table below lists Technology sector stocks in the Russell 3000 with market caps of more than $1 billion that are outperforming all of the 'big 5' tech stocks on a YTD basis. Actually, since Amazon is doing so well relative to the rest of the \"big 5\" these are all stocks that are outperforming Amazon. If we looked for stocks that were doing better than the average return of the \"big 5\" the list would be a lot, lot longer (+16.4%).\n\n&gt; Looking through the list of names below, the two top-performing names are Zscaler (ZS) and Twilio (TWLO), which have both more than doubled. Behind these two, DocuSign (DOCU) and Sprout Social (SPT) are both knocking on the door of triple-digits. All 28 of the names listed have market caps of $1 billion, but the average market cap is just over $21 billion, while Nvidia (NVDA) is the largest company on the list with a market cap of $216 billion. For the most part, these aren't names that have been driving the indices, but anyone holding these stocks in their portfolio probably doesn't care!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060320-Tech-Stocks.png))**\n\n*****\n\n# Best 50-Day Rally Ever\n\n&gt; In many ways, what we’ve seen so far in 2020 has been both record-breaking and devastating. From the S&amp;P 500 Index peak on February 19 to the bear market lows March 23, stocks lost 33.9%. Now, 50 trading days later, stocks have gained 39.6%, for the largest 50-day rally since the S&amp;P 500 moved to 500 stocks in 1957.\n\n&gt; “There are no rollercoasters that can replicate what stocks have done so far in 2020,” exclaimed LPL Financial Senior Market Strategist Ryan Detrick. “Here’s the catch though: Big 50-day rallies in the past have taken place near the start of new bull markets, and the returns going out a year were quite bullish.”\n\n&gt; As shown in the LPL Chart of the Day, the 39.6% gain in 50 days was the greatest 50-day rally ever, besting the previous best in October 1982. What’s important to note here is that many of these rallies took place coming off major market lows, and delivered quite strong returns going out 6 to 12 months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/06/best-fifty-days.png?ssl=1))**\n\n&gt; Although we have near-term worries given this historic run, as some sentiment indicators such as put/call ratios are showing some froth, from a bigger picture perspective, this strong 50-day rally offers a reason to think stock prices may be even higher this time next year.\n\n*****\n\n# 2020 In Charts\n\n&gt; 2020 is only five months old, but in many ways it is one of the most historic years we’ve ever seen. “2020 went from moving along nicely, to seeing the worst recession in a generation and the fastest bear market ever,” explained LPL Financial Senior Market Strategist Ryan Detrick. “Now stocks are in the midst of one of the best bull runs ever, even though the economy remains extremely weak, thanks to record stimulus and hopes over a vaccine.”\n&gt; \nTo best sum it all up, here are 10 charts that tell the picture of 2020 so far.\n\n&gt; 1.) The 2010s were the first decade in history to go all 10 years without a recession, which of course ended just months into the new decade, as the economy stopped. Stocks gained 13.5% on an annual basis last decade, surprisingly, only the third-best decade over the past four.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/06/1-blog-chart.png?ssl=1))**\n\n&gt; 2.) This is an election year, and the S&amp;P 500 Index hasn’t been lower when a President is up for reelection since FDR in 1940. Although this seemed nearly impossible at the March lows, it is looking like this incredible streak could have a chance in 2020.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/2-blog-chart.png?ssl=1))**\n\n&gt; 3.) One of the first signs something could go wrong in 2020 was stocks fell in January. Historically, this has meant potential trouble for the final 11 months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/3-blog-chart.png?ssl=1))**\n\n&gt; 4.) As fears over COVID-19 gripped the world, the Dow Jones Industrial Average had its fastest bear market ever, in only 19 days. To put this in perspective, this was the fastest bear market in the 124-year history of the Dow.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/4-blog-chart.png?ssl=1))**\n\n&gt; 5.) Mark Twain said “History doesn’t repeat itself, but it often rhymes”. Looking at history, every 50 years there has been a terrible pandemic and stocks fell more than 30%. We don’t know if the ultimate lows are in this time, but so far, history is rhyming.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/blog-chart-5.png?ssl=1))**\n\n&gt; 6.) More than 20 million people in the US lost their jobs in April, while the unemployment rate soared to near 15%, the highest since the Great Depression. Record drops in manufacturing, industrial production, retail sales, and consumer spending have all taken place in the past two months as well.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/6-blog-chart.png?ssl=1))**\n\n&gt; 7.) A recession is here, ending the streak of 128 months in a row without one. What is unique about the previous expansion was nominal gross domestic product (GDP) grew only 50%, about the average growth seen during the previous expansions, but this expansion was nearly twice as long as the average expansion (10 years versus 5 years).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/7-blog-chart.png?ssl=1))**\n\n&gt; 8.) The bounce off of the March 23 S&amp;P 500 lows has been historic in many ways. In fact, it was one of the best 20-day rallies ever, with previous best rallies seeing strong returns 6 and 12 months later.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/8-blog-chart.png?ssl=1))**\n\n&gt; 9.) As scary as it was on the way down, stocks have come roaring back, gaining more than 35% from the March 23 lows. This would classify as the greatest bear market bounce ever, which opens the question: is this more than a bear market bounce and instead the start of a new bull market?\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/9-blog-chart.png?ssl=1))**\n\n&gt; 10.) The number of COVID-19 tests in the US nearly doubled in May versus what was seen in April. Additionally, fewer and fewer tests are coming back positive. Testing is one of the key ways we will beat this and this is a step in the right direction. We’ve also seen new monthly lows in people on ventilators, in the ICU, and in hospitals.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/9-blog-chart.png?ssl=1))**\n\n&gt; Hard to believe, but there are still 7 months left in 2020. It hasn’t been easy for any of us, and we continue to keep everyone impacted by this pandemic in mind, but we continue to see the glass as half full. The dual benefit of record monetary and fiscal policy should help create a bridge to help those most impacted, while the economy can slowly come back online later this year.\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$ADBE** \n&gt; * **$UNFI** \n&gt; * **$CHWY** \n&gt; * **$TIF** \n&gt; * **$LULU** \n&gt; * **$COUP** \n&gt; * **$SFIX** \n&gt; * **$LOVE** \n&gt; * **$NEPT** \n&gt; * **$GHM** \n&gt; * **$REVG** \n&gt; * **$GME** \n&gt; * **$HDS** \n&gt; * **$FIVE** \n&gt; * **$SIG** \n&gt; * **$CASY** \n&gt; * **$CVGW** \n&gt; * **$AMC** \n&gt; * **$FCEL** \n&gt; * **$QTNT** \n&gt; * **$PLCE** \n&gt; * **$CHS** \n&gt; * **$THO** \n&gt; * **$GCO** \n&gt; * **$BF.B** \n&gt; * **$LMNR** \n&gt; * **$WSG** \n&gt; * **$PRTY** \n&gt; * **$GES** \n&gt; * **$BBCP** \n&gt; * **$CONN** \n&gt; * **$HEXO** \n&gt; * **$PHR** \n&gt; * **$PVH** \n&gt; * **$RRGB** \n&gt; * **$PLAY** \n&gt; * **$TNP** \n&gt; * **$JW.A** \n&gt; * **$SB** \n&gt; * **$GSM** \n&gt; * **$SRT**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/PQzyXLa.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/bgPdMCr.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 6.8.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/d2EW1kr.png))\n\n&gt; # ***Monday 6.8.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/uxSiJJr.png))\n\n*****\n\n&gt; # ***Tuesday 6.9.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/3SIjcG7.png))\n\n&gt; # ***Tuesday 6.9.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/cRBrPlt.png))\n\n*****\n\n&gt; # ***Wednesday 6.10.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/DaheXAm.png))\n\n&gt; # ***Wednesday 6.10.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/9mcHxTl.png))\n\n*****\n\n&gt; # ***Thursday 6.11.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/i8SNjWM.png))\n\n&gt; # ***Thursday 6.11.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/9xcBZPK.png))\n\n*****\n\n&gt; # ***Friday 6.12.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n&gt; # ***Friday 6.12.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# Adobe Inc. $392.90\n&gt; **Adobe Inc. (ADBE)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, June 11, 2020. The consensus earnings estimate is $2.33 per share on revenue of $3.17 billion and the Earnings Whisper ® number is $2.39 per share. Investor sentiment going into the company's earnings release has 79% expecting an earnings beat The company's guidance was for earnings of approximately $2.35 per share. Consensus estimates are for year-over-year earnings growth of 26.63% with revenue increasing by 15.51%. Short interest has increased by 3.0% since the company's last earnings release while the stock has drifted higher by 25.6% from its open following the earnings release to be 23.1% above its 200 day moving average of $319.27. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, May 19, 2020 there was some notable buying of 3,194 contracts of the $410.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 4.8% move on earnings and the stock has averaged a 6.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ADBE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# United Natural Foods, Inc. $20.78\n&gt; **United Natural Foods, Inc. (UNFI)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, June 10, 2020. The consensus earnings estimate is $1.41 per share on revenue of $6.67 billion and the Earnings Whisper ® number is $1.42 per share. Investor sentiment going into the company's earnings release has 78% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 131.15% with revenue increasing by 11.86%. Short interest has decreased by 16.0% since the company's last earnings release while the stock has drifted higher by 202.5% from its open following the earnings release to be 96.1% above its 200 day moving average of $10.60. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, June 2, 2020 there was some notable buying of 2,226 contracts of the $22.50 call expiring on Friday, June 19, 2020. Option traders are pricing in a 17.7% move on earnings and the stock has averaged a 15.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=UNFI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Chewy, Inc. $48.44\n&gt; **Chewy, Inc. (CHWY)** is confirmed to report earnings at approximately 4:10 PM ET on Tuesday, June 9, 2020. The consensus estimate is for a loss of $0.11 per share on revenue of $1.55 billion and the Earnings Whisper ® number is ($0.09) per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 37.50% with revenue increasing by 39.78%. Short interest has increased by 37.9% since the company's last earnings release while the stock has drifted higher by 37.5% from its open following the earnings release to be 56.4% above its 200 day moving average of $30.97. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 5.8% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CHWY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Tiffany &amp; Co. $121.99\n&gt; **Tiffany &amp; Co. (TIF)** is confirmed to report earnings at approximately 6:40 AM ET on Tuesday, June 9, 2020. The consensus earnings estimate is $0.21 per share on revenue of $646.40 million. Investor sentiment going into the company's earnings release has 6% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 79.61% with revenue decreasing by 35.56%. Short interest has decreased by 26.5% since the company's last earnings release while the stock has drifted lower by 4.7% from its open following the earnings release to be 1.9% above its 200 day moving average of $119.75. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, June 5, 2020 there was some notable buying of 9,022 contracts of the $110.00 put expiring on Friday, August 21, 2020. Option traders are pricing in a 6.2% move on earnings and the stock has averaged a 3.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TIF&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# lululemon athletica inc. $319.78\n&gt; **lululemon athletica inc. (LULU)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, June 11, 2020. The consensus earnings estimate is $0.28 per share on revenue of $724.78 million and the Earnings Whisper ® number is $0.30 per share. Investor sentiment going into the company's earnings release has 47% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 62.16% with revenue decreasing by 7.35%. Short interest has increased by 53.3% since the company's last earnings release while the stock has drifted higher by 66.1% from its open following the earnings release to be 46.8% above its 200 day moving average of $217.77. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, June 4, 2020 there was some notable buying of 1,385 contracts of the $350.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 9.4% move on earnings and the stock has averaged a 7.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LULU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Coupa Software $216.94\n&gt; **Coupa Software (COUP)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, June 8, 2020. The consensus earnings estimate is $0.07 per share on revenue of $111.83 million and the Earnings Whisper ® number is $0.10 per share. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat The company's guidance was for earnings of $0.06 to $0.08 per share on revenue of $112.00 million to $112.00 million. Consensus estimates are for year-over-year earnings growth of 450.00% with revenue increasing by 37.48%. Short interest has increased by 7.9% since the company's last earnings release while the stock has drifted higher by 94.9% from its open following the earnings release to be 40.3% above its 200 day moving average of $154.59. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, June 4, 2020 there was some notable buying of 1,085 contracts of the $220.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 12.7% move on earnings and the stock has averaged a 9.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=COUP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Stitch Fix, Inc. $24.96\n&gt; **Stitch Fix, Inc. (SFIX)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, June 8, 2020. The consensus estimate is for a loss of $0.17 per share on revenue of $401.40 million and the Earnings Whisper ® number is ($0.13) per share. Investor sentiment going into the company's earnings release has 53% expecting an earnings beat The company's guidance was for revenue of $465.00 million to $475.00 million. Consensus estimates are for earnings to decline year-over-year by 342.86% with revenue decreasing by 1.83%. Short interest has increased by 4.0% since the company's last earnings release while the stock has drifted higher by 66.4% from its open following the earnings release to be 19.1% above its 200 day moving average of $20.96. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, June 2, 2020 there was some notable buying of 5,092 contracts of the $25.00 call expiring on Friday, June 12, 2020. Option traders are pricing in a 21.2% move on earnings and the stock has averaged a 13.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SFIX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Lovesac Company $17.84\n&gt; **Lovesac Company (LOVE)** is confirmed to report earnings at approximately 7:00 AM ET on Tuesday, June 9, 2020. The consensus estimate is for a loss of $0.69 per share on revenue of $48.22 million and the Earnings Whisper ® number is ($0.65) per share. Investor sentiment going into the company's earnings release has 52% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 2.99% with revenue increasing by 17.73%. Short interest has increased by 20.5% since the company's last earnings release while the stock has drifted higher by 109.9% from its open following the earnings release to be 31.5% above its 200 day moving average of $13.57. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 20.1% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LOVE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Neptune Wellness Solutions Inc. $3.14\n&gt; **Neptune Wellness Solutions Inc. (NEPT)** is confirmed to report earnings after the market closes on Wednesday, June 10, 2020. The consensus estimate is for a loss of $0.08 per share on revenue of $6.32 million and the Earnings Whisper ® number is ($0.10) per share. Investor sentiment going into the company's earnings release has 63% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 100.00% with revenue increasing by 48.36%. Short interest has decreased by 4.7% since the company's last earnings release while the stock has drifted higher by 56.2% from its open following the earnings release to be 6.4% above its 200 day moving average of $2.95. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, May 19, 2020 there was some notable buying of 2,960 contracts of the $3.00 call expiring on Friday, June 19, 2020. The stock has averaged a 8.1% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NEPT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Graham Corporation $15.58\n&gt; **Graham Corporation (GHM)** is confirmed to report earnings at approximately 6:30 AM ET on Wednesday, June 10, 2020. The consensus earnings estimate is $0.12 per share on revenue of $32.00 million. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 50.00% with revenue increasing by 35.36%. Short interest has increased by 89.8% since the company's last earnings release while the stock has drifted lower by 21.7% from its open following the earnings release. Overall earnings estimates have been revised lower since the company's last earnings release.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=GHM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/smallstreetbets.",
        "subreddit": "smallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning June 8th, 2020",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/gxtut4/wall_street_week_ahead_for_the_trading_week/",
        "created": 1591489050.0
    },
    {
        "author": "gme_bull",
        "created_utc": 1591280539,
        "id": "gwidfe",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "I was worried he was dismissing his most valuable investment, but it looks like he focused a little and uncovered the power:\n\n&gt;Scion noted that Sherman, along with CFO Jim Bell, have revamped working capital management for improved efficiency. Most crucially, it appears to Scion that GameStop is now succeeding in transforming vendor partnerships to unlock high-margin revenue streams. Scion believes that this is a direct result of current management’s expertise and focus and is a complete gamechanger for GameStop beyond the coming console upgrade.\n\nHe notes the value in getting Reggie of Nintendo of America on board:\n\n&gt;In March 2020, GameStop announced the appointment of three new independent directors. These accomplished individuals – Reginald Fils-Aimé, William Simon and James Symancyk – have either video game industry experience or omnichannel retail experience, or both. All have terrific reputations and, in Scion’s view, will maximize GameStop’s odds of success.\n\nTrue business is grinding out high returns however you can.  These guys get it.\n\n[https://www.businesswire.com/news/home/20200603005929/en/Scion-Asset-Management-Voted-Support-GameStop%E2%80%99s-Board](https://www.businesswire.com/news/home/20200603005929/en/Scion-Asset-Management-Voted-Support-GameStop%E2%80%99s-Board)",
        "subreddit": "stocks",
        "title": "Burry has done his scuttlebutt: \"Scion Asset Management Voted in Support of GameStop’s Board and Management\"",
        "url": "https://www.reddit.com/r/stocks/comments/gwidfe/burry_has_done_his_scuttlebutt_scion_asset/",
        "created": 1591309339.0
    },
    {
        "author": "danzf123",
        "created_utc": 1591818387,
        "id": "h0ijpo",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "Here are my moves. Let's discuss. Also, advice is appreciated!\n\n&amp;#x200B;\n\nWGO\n\nWFC\n\nIVR\n\nMSFT\n\nATVI\n\nGME\n\n&amp;#x200B;\n\nOthers? Advice? What're y'all doing?",
        "subreddit": "options",
        "title": "Buy the dip? Moves for tomorrow?",
        "url": "https://www.reddit.com/r/options/comments/h0ijpo/buy_the_dip_moves_for_tomorrow/",
        "created": 1591847187.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1591460055,
        "id": "gxtspc",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "Good Saturday afternoon to all of you here on r/stocks. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning June 8th, 2020.\n\n# **Look for the S&amp;P 500 to turn positive for the year with a boost from the Fed in the week ahead  - [(Source)](https://www.cnbc.com/2020/06/05/look-for-the-sp-500-to-turn-positive-for-the-year-with-a-boost-from-the-fed-in-the-week-ahead.html)**\n*****\n&gt; Federal Reserve Chairman Jerome Powell is expected to reassure markets next week the central bank will do whatever it takes to help the economy heal. That should be enough to keep investors moving into stocks that benefit from an economic rebound and push the S&amp;P 500 into the green for 2020.\n*****\n&gt; The Fed’s two-day meeting is the big event for markets in the coming week. There are a few economic reports, including inflation data, the consumer price index Wednesday and producer prices Thursday. Weekly jobless claims will be important Thursday to see if there’s a drop in continuing clams, after May’s employment report showed a surprising record gain of 2.5 million jobs.\n*****\n&gt; The reopening trade was in full swing in the past week, especially Friday when stocks surged on the jobs report, which was expected to show a loss of 8.3 million jobs. The Nasdaq broke above its record high set on Feb. 19, and the S&amp;P 500 was just 1.1% away from turning positive for 2020.\n*****\n&gt; Even before the jobs report, investors were loading up on financials, industrials, transports and small caps, which were up more than 8% for the week and 18.4% in the past month. S&amp;P financials were 12.1% higher on the week, S&amp;P industrials were up 10.5, and the NYSE airline index jumped more than 35.4.%.\n*****\n&gt; “I think next week is dominated by the reopening and it will be for another month,” said James Paulsen, chief investment strategist at Leuthold Group. “With cyclicals outperforming, small [caps] outperforming, credit spreads coming in and then the bond yields going up, everybody — all facets of the financial markets — are sort of suggesting the same outcome.”\n*****\n&gt; The S&amp;P 500 ended the week at 3,193, a gain of 4.9%, and now traders are watching to see if it can scale the psychological 3,200 level. The Dow closed Friday at 27,110, up 6.8% for the week, and the Nasdaq Composite was up 3.4%, at 9,814 after reaching an intraday record high of 9,845 Friday.\n*****\n&gt; Analysts say the market will likely look past the protests that broke out in cities across the U.S. after the death of George Floyd in Minneapolis. Four policemen were charged with murder in his death. Looters joined the protests, some of which turned violent, but they quieted down towards the end of the week.\n*****\n&gt; Stocks were higher for a third week in a row, but a change this past week has been the abrupt lurch higher in Treasury yields. The 10-year rose to a high of 0.95% Friday, a quarter-point move in just three sessions. The move was already underway but got a lift Wednesday when ADP jobs data was not nearly as bad as expected. Yields ripped even higher after the May employment report showed the unemployment rate actually fell to 13.3%, instead of climbing to 20%, as expected by economists.\n*****\n&gt; Bond strategists said the Treasury market was now acknowledging the potential for a recovery, but not in the exuberant way the stock market has been. Since March 23, the S&amp;P 500 has risen more than 45%, but it took the 10-year Treasury until this week to get back the yield level it was at when stocks bottomed.\n*****\n&gt; Paulsen said he believes a new bull market has been launched, but there could be pullbacks and some headwinds for the market coming up.\n*****\n&gt; “When GDP is minus 30%, other issues don’t matter. There’s just one issue. But as the economy reopens again, the trade battles will matter again, presidential politics will matter again,” said Paulsen, adding the budget deficit could also matter. “I think we’ll get removed from a sole focus. That isn’t quite there but I think it’s coming.”\n*****\n&gt; # Fed ahead\n&gt; The Fed begins its two-day meeting Tuesday, and will release its statement Wednesday afternoon, followed by a video briefing by Powell.\n*****\n&gt; “Whey would the Fed want to disrupt this with anything?” Paulsen said. “They’re still going to support the economy. They’re going to stay away from negative rates or yield curve management. They’re not going to do anything to scare the markets. They might certainly reassure people that they are still ready to provide support.”\n*****\n&gt; Ethan Harris, head of global economics at Bank of America, said the Fed may clarify where it stands on some of the extraordinary moves it has taken since it cut rates to zero. The Fed has been supporting the markets with asset purchases and multiple programs for commercial paper, corporate bonds, and municipal bonds, for example.\n*****\n&gt; “We think right now they’re just trying to get this Main Street lending program to work. The question is are they going to do more things around what they do in terms of forward guidance and next steps of macro easing,” Harris said.\n*****\n&gt; There has been speculation that the Fed would do some type of so-called yield curve control, a program to keep interest rates capped at certain levels. “I think it’s too early for that,” said Harris. He said the Fed would be guaranteeing low rates for a long period of time if it does yield curve control.\n*****\n&gt; “Yield curve control is basically open-ended quantitative easing,” he said. The Fed is currently buying Treasurys but if it wanted to stop yields from rising too much as the economy improves, it could make targeted purchases.\n*****\n&gt; Barclays chief U.S. economist Michael Gapen said it’s possible the Fed could announce the yield curve control. “We’ve said they could implement yield curve control out to three years,” he said. “In my mind that matches the length of the horizon of the economic projections.”\n*****\n&gt; Powell has said the economy needs more fiscal help, and he could reiterate those comments Wednesday. President Donald Trump on Friday said he backs more stimulus. So far, the Democrats have put out a marker with their wish list for further spending, but there have been no negotiations.\n*****\n&gt; There was concern the strong jobs report could make it harder to get buy in for another big spending package. But some economists say the recovery needs a boost and states need funding to fill the holes in their budgets from coronavirus-related spending and a lack of tax receipts.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/7klaXQm.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/PKTBzT2.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/a5JkAB6.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/M2x4Qoq.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/qtJYfXN.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/bjiJWjV.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/UAi19KJ.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/GQm4ruO.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/PQzyXLa.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/uV1U7FN.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/wm2XJND.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/yarkiMO.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/hFblu2G.png))**\n\n*****\n\n# S&amp;P 500 Stocks Outpacing Analyst Price Targets\n\n&gt; This morning's jobs report shocked the financial world -- most notably the economists whose job it is to provide estimates. The consensus estimate among economists for May nonfarm payrolls was projecting a loss of more than 7 million jobs. The actual number that was reported did not just show a smaller than expected job loss, but it actually showed a gain in jobs of more than 2.5 million.\n\n&gt; We're seeing a similar situation play out in the equity analyst community. With the S&amp;P 500 now up 40%+ since its low less than three months ago, the average stock in the index is now trading above its consensus analyst price target that looks 12 months out. Analysts have simply not been able to catch up to the rapid rise we've seen for equity prices.\n\n&gt; It's extremely rare to see share prices move above consensus analyst price targets. We don't have the historical daily data on this, but anecdotally we can't remember a time when the spread has been this wide. As shown below, at the end of 2019 when the S&amp;P finished a massive rally, equity prices were 5.5% below the consensus price target. That was seen as a very tight spread prior to what we're seeing now. At the lows in March, the average share price had dropped all the way to $92.50 compared to an average consensus price target of $143.20. That projected a gain of 54.9% at the time!\n\n&gt; Since March 23rd, the average share price has risen from $92.50 up to $138.40, while the average analyst price target has fallen from $143.20 to $136. Current price targets no longer project a gain for the average S&amp;P 500 stock, but rather a 1.7% drop.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/avgpricetarget.png))**\n\n&gt; # Nasdaq's Historical Run\n\n&gt; At its highs earlier this morning, the Nasdaq Composite was within 2% of its record high from earlier in the year. Besides the steep V-shape of the Nasdaq's pattern over the last four months, the other aspect of the chart that stands out is just how steep the 50-day moving average is trending lately.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060420-Nasdaq-50DMAa.png))**\n\n&gt; To illustrate just how steep the Nasdaq's 50-DMA has become, the chart below shows the daily percentage change of the 50-day going back to 1971. Currently, the Nasdaq 50-DMA is rising at an average of over 0.5% per day. That's an incredible slope and a level that has been exceeded only a handful of times in the Nasdaq's 50-year history.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060420-Nasdaq-Composite1.png))**\n\n*****\n\n# Big Gains From Smaller Tech\n\n&gt; It's still difficult to fathom the moves in the US equity market over the last four months. The fact that the Nasdaq and more specifically the Technology sector aren't far from record highs is definitely something no one was expecting two months ago. There's an old market saying that equities take the stairs up and the elevator down, but in the latest market cycle, the elevator up was almost as fast as the way down!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060320-Nasdaq.png))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060320-Technology-Sector.png))**\n\n&gt; If you've been following the markets, all you've likely heard up until recently is that large-cap tech, and more specifically, Microsoft (MSFT), Apple (AAPL), Amazon (AMZN), Alphabet (GOOGL), and Facebook (FB), are single-handedly driving the market higher. The reality is not nearly as clear-cut. Given their market caps, the \"Big 5\" (as they're often referred to) have done a lot of heavy lifting, but in terms of performance, they're hardly the only game in town.\n\n&gt; The table below lists Technology sector stocks in the Russell 3000 with market caps of more than $1 billion that are outperforming all of the 'big 5' tech stocks on a YTD basis. Actually, since Amazon is doing so well relative to the rest of the \"big 5\" these are all stocks that are outperforming Amazon. If we looked for stocks that were doing better than the average return of the \"big 5\" the list would be a lot, lot longer (+16.4%).\n\n&gt; Looking through the list of names below, the two top-performing names are Zscaler (ZS) and Twilio (TWLO), which have both more than doubled. Behind these two, DocuSign (DOCU) and Sprout Social (SPT) are both knocking on the door of triple-digits. All 28 of the names listed have market caps of $1 billion, but the average market cap is just over $21 billion, while Nvidia (NVDA) is the largest company on the list with a market cap of $216 billion. For the most part, these aren't names that have been driving the indices, but anyone holding these stocks in their portfolio probably doesn't care!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060320-Tech-Stocks.png))**\n\n*****\n\n# Best 50-Day Rally Ever\n\n&gt; In many ways, what we’ve seen so far in 2020 has been both record-breaking and devastating. From the S&amp;P 500 Index peak on February 19 to the bear market lows March 23, stocks lost 33.9%. Now, 50 trading days later, stocks have gained 39.6%, for the largest 50-day rally since the S&amp;P 500 moved to 500 stocks in 1957.\n\n&gt; “There are no rollercoasters that can replicate what stocks have done so far in 2020,” exclaimed LPL Financial Senior Market Strategist Ryan Detrick. “Here’s the catch though: Big 50-day rallies in the past have taken place near the start of new bull markets, and the returns going out a year were quite bullish.”\n\n&gt; As shown in the LPL Chart of the Day, the 39.6% gain in 50 days was the greatest 50-day rally ever, besting the previous best in October 1982. What’s important to note here is that many of these rallies took place coming off major market lows, and delivered quite strong returns going out 6 to 12 months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/06/best-fifty-days.png?ssl=1))**\n\n&gt; Although we have near-term worries given this historic run, as some sentiment indicators such as put/call ratios are showing some froth, from a bigger picture perspective, this strong 50-day rally offers a reason to think stock prices may be even higher this time next year.\n\n*****\n\n# 2020 In Charts\n\n&gt; 2020 is only five months old, but in many ways it is one of the most historic years we’ve ever seen. “2020 went from moving along nicely, to seeing the worst recession in a generation and the fastest bear market ever,” explained LPL Financial Senior Market Strategist Ryan Detrick. “Now stocks are in the midst of one of the best bull runs ever, even though the economy remains extremely weak, thanks to record stimulus and hopes over a vaccine.”\n&gt; \nTo best sum it all up, here are 10 charts that tell the picture of 2020 so far.\n\n&gt; 1.) The 2010s were the first decade in history to go all 10 years without a recession, which of course ended just months into the new decade, as the economy stopped. Stocks gained 13.5% on an annual basis last decade, surprisingly, only the third-best decade over the past four.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/06/1-blog-chart.png?ssl=1))**\n\n&gt; 2.) This is an election year, and the S&amp;P 500 Index hasn’t been lower when a President is up for reelection since FDR in 1940. Although this seemed nearly impossible at the March lows, it is looking like this incredible streak could have a chance in 2020.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/2-blog-chart.png?ssl=1))**\n\n&gt; 3.) One of the first signs something could go wrong in 2020 was stocks fell in January. Historically, this has meant potential trouble for the final 11 months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/3-blog-chart.png?ssl=1))**\n\n&gt; 4.) As fears over COVID-19 gripped the world, the Dow Jones Industrial Average had its fastest bear market ever, in only 19 days. To put this in perspective, this was the fastest bear market in the 124-year history of the Dow.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/4-blog-chart.png?ssl=1))**\n\n&gt; 5.) Mark Twain said “History doesn’t repeat itself, but it often rhymes”. Looking at history, every 50 years there has been a terrible pandemic and stocks fell more than 30%. We don’t know if the ultimate lows are in this time, but so far, history is rhyming.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/blog-chart-5.png?ssl=1))**\n\n&gt; 6.) More than 20 million people in the US lost their jobs in April, while the unemployment rate soared to near 15%, the highest since the Great Depression. Record drops in manufacturing, industrial production, retail sales, and consumer spending have all taken place in the past two months as well.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/6-blog-chart.png?ssl=1))**\n\n&gt; 7.) A recession is here, ending the streak of 128 months in a row without one. What is unique about the previous expansion was nominal gross domestic product (GDP) grew only 50%, about the average growth seen during the previous expansions, but this expansion was nearly twice as long as the average expansion (10 years versus 5 years).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/7-blog-chart.png?ssl=1))**\n\n&gt; 8.) The bounce off of the March 23 S&amp;P 500 lows has been historic in many ways. In fact, it was one of the best 20-day rallies ever, with previous best rallies seeing strong returns 6 and 12 months later.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/8-blog-chart.png?ssl=1))**\n\n&gt; 9.) As scary as it was on the way down, stocks have come roaring back, gaining more than 35% from the March 23 lows. This would classify as the greatest bear market bounce ever, which opens the question: is this more than a bear market bounce and instead the start of a new bull market?\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/9-blog-chart.png?ssl=1))**\n\n&gt; 10.) The number of COVID-19 tests in the US nearly doubled in May versus what was seen in April. Additionally, fewer and fewer tests are coming back positive. Testing is one of the key ways we will beat this and this is a step in the right direction. We’ve also seen new monthly lows in people on ventilators, in the ICU, and in hospitals.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/9-blog-chart.png?ssl=1))**\n\n&gt; Hard to believe, but there are still 7 months left in 2020. It hasn’t been easy for any of us, and we continue to keep everyone impacted by this pandemic in mind, but we continue to see the glass as half full. The dual benefit of record monetary and fiscal policy should help create a bridge to help those most impacted, while the economy can slowly come back online later this year.\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$ADBE** \n&gt; * **$UNFI** \n&gt; * **$CHWY** \n&gt; * **$TIF** \n&gt; * **$LULU** \n&gt; * **$COUP** \n&gt; * **$SFIX** \n&gt; * **$LOVE** \n&gt; * **$NEPT** \n&gt; * **$GHM** \n&gt; * **$REVG** \n&gt; * **$GME** \n&gt; * **$HDS** \n&gt; * **$FIVE** \n&gt; * **$SIG** \n&gt; * **$CASY** \n&gt; * **$CVGW** \n&gt; * **$AMC** \n&gt; * **$FCEL** \n&gt; * **$QTNT** \n&gt; * **$PLCE** \n&gt; * **$CHS** \n&gt; * **$THO** \n&gt; * **$GCO** \n&gt; * **$BF.B** \n&gt; * **$LMNR** \n&gt; * **$WSG** \n&gt; * **$PRTY** \n&gt; * **$GES** \n&gt; * **$BBCP** \n&gt; * **$CONN** \n&gt; * **$HEXO** \n&gt; * **$PHR** \n&gt; * **$PVH** \n&gt; * **$RRGB** \n&gt; * **$PLAY** \n&gt; * **$TNP** \n&gt; * **$JW.A** \n&gt; * **$SB** \n&gt; * **$GSM** \n&gt; * **$SRT**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/PQzyXLa.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/bgPdMCr.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 6.8.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/d2EW1kr.png))\n\n&gt; # ***Monday 6.8.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/uxSiJJr.png))\n\n*****\n\n&gt; # ***Tuesday 6.9.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/3SIjcG7.png))\n\n&gt; # ***Tuesday 6.9.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/cRBrPlt.png))\n\n*****\n\n&gt; # ***Wednesday 6.10.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/DaheXAm.png))\n\n&gt; # ***Wednesday 6.10.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/9mcHxTl.png))\n\n*****\n\n&gt; # ***Thursday 6.11.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/i8SNjWM.png))\n\n&gt; # ***Thursday 6.11.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/9xcBZPK.png))\n\n*****\n\n&gt; # ***Friday 6.12.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n&gt; # ***Friday 6.12.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# Adobe Inc. $392.90\n&gt; **Adobe Inc. (ADBE)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, June 11, 2020. The consensus earnings estimate is $2.33 per share on revenue of $3.17 billion and the Earnings Whisper ® number is $2.39 per share. Investor sentiment going into the company's earnings release has 79% expecting an earnings beat The company's guidance was for earnings of approximately $2.35 per share. Consensus estimates are for year-over-year earnings growth of 26.63% with revenue increasing by 15.51%. Short interest has increased by 3.0% since the company's last earnings release while the stock has drifted higher by 25.6% from its open following the earnings release to be 23.1% above its 200 day moving average of $319.27. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, May 19, 2020 there was some notable buying of 3,194 contracts of the $410.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 4.8% move on earnings and the stock has averaged a 6.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ADBE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# United Natural Foods, Inc. $20.78\n&gt; **United Natural Foods, Inc. (UNFI)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, June 10, 2020. The consensus earnings estimate is $1.41 per share on revenue of $6.67 billion and the Earnings Whisper ® number is $1.42 per share. Investor sentiment going into the company's earnings release has 78% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 131.15% with revenue increasing by 11.86%. Short interest has decreased by 16.0% since the company's last earnings release while the stock has drifted higher by 202.5% from its open following the earnings release to be 96.1% above its 200 day moving average of $10.60. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, June 2, 2020 there was some notable buying of 2,226 contracts of the $22.50 call expiring on Friday, June 19, 2020. Option traders are pricing in a 17.7% move on earnings and the stock has averaged a 15.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=UNFI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Chewy, Inc. $48.44\n&gt; **Chewy, Inc. (CHWY)** is confirmed to report earnings at approximately 4:10 PM ET on Tuesday, June 9, 2020. The consensus estimate is for a loss of $0.11 per share on revenue of $1.55 billion and the Earnings Whisper ® number is ($0.09) per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 37.50% with revenue increasing by 39.78%. Short interest has increased by 37.9% since the company's last earnings release while the stock has drifted higher by 37.5% from its open following the earnings release to be 56.4% above its 200 day moving average of $30.97. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 5.8% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CHWY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Tiffany &amp; Co. $121.99\n&gt; **Tiffany &amp; Co. (TIF)** is confirmed to report earnings at approximately 6:40 AM ET on Tuesday, June 9, 2020. The consensus earnings estimate is $0.21 per share on revenue of $646.40 million. Investor sentiment going into the company's earnings release has 6% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 79.61% with revenue decreasing by 35.56%. Short interest has decreased by 26.5% since the company's last earnings release while the stock has drifted lower by 4.7% from its open following the earnings release to be 1.9% above its 200 day moving average of $119.75. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, June 5, 2020 there was some notable buying of 9,022 contracts of the $110.00 put expiring on Friday, August 21, 2020. Option traders are pricing in a 6.2% move on earnings and the stock has averaged a 3.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TIF&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# lululemon athletica inc. $319.78\n&gt; **lululemon athletica inc. (LULU)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, June 11, 2020. The consensus earnings estimate is $0.28 per share on revenue of $724.78 million and the Earnings Whisper ® number is $0.30 per share. Investor sentiment going into the company's earnings release has 47% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 62.16% with revenue decreasing by 7.35%. Short interest has increased by 53.3% since the company's last earnings release while the stock has drifted higher by 66.1% from its open following the earnings release to be 46.8% above its 200 day moving average of $217.77. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, June 4, 2020 there was some notable buying of 1,385 contracts of the $350.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 9.4% move on earnings and the stock has averaged a 7.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LULU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Coupa Software $216.94\n&gt; **Coupa Software (COUP)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, June 8, 2020. The consensus earnings estimate is $0.07 per share on revenue of $111.83 million and the Earnings Whisper ® number is $0.10 per share. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat The company's guidance was for earnings of $0.06 to $0.08 per share on revenue of $112.00 million to $112.00 million. Consensus estimates are for year-over-year earnings growth of 450.00% with revenue increasing by 37.48%. Short interest has increased by 7.9% since the company's last earnings release while the stock has drifted higher by 94.9% from its open following the earnings release to be 40.3% above its 200 day moving average of $154.59. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, June 4, 2020 there was some notable buying of 1,085 contracts of the $220.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 12.7% move on earnings and the stock has averaged a 9.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=COUP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Stitch Fix, Inc. $24.96\n&gt; **Stitch Fix, Inc. (SFIX)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, June 8, 2020. The consensus estimate is for a loss of $0.17 per share on revenue of $401.40 million and the Earnings Whisper ® number is ($0.13) per share. Investor sentiment going into the company's earnings release has 53% expecting an earnings beat The company's guidance was for revenue of $465.00 million to $475.00 million. Consensus estimates are for earnings to decline year-over-year by 342.86% with revenue decreasing by 1.83%. Short interest has increased by 4.0% since the company's last earnings release while the stock has drifted higher by 66.4% from its open following the earnings release to be 19.1% above its 200 day moving average of $20.96. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, June 2, 2020 there was some notable buying of 5,092 contracts of the $25.00 call expiring on Friday, June 12, 2020. Option traders are pricing in a 21.2% move on earnings and the stock has averaged a 13.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SFIX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Lovesac Company $17.84\n&gt; **Lovesac Company (LOVE)** is confirmed to report earnings at approximately 7:00 AM ET on Tuesday, June 9, 2020. The consensus estimate is for a loss of $0.69 per share on revenue of $48.22 million and the Earnings Whisper ® number is ($0.65) per share. Investor sentiment going into the company's earnings release has 52% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 2.99% with revenue increasing by 17.73%. Short interest has increased by 20.5% since the company's last earnings release while the stock has drifted higher by 109.9% from its open following the earnings release to be 31.5% above its 200 day moving average of $13.57. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 20.1% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LOVE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Neptune Wellness Solutions Inc. $3.14\n&gt; **Neptune Wellness Solutions Inc. (NEPT)** is confirmed to report earnings after the market closes on Wednesday, June 10, 2020. The consensus estimate is for a loss of $0.08 per share on revenue of $6.32 million and the Earnings Whisper ® number is ($0.10) per share. Investor sentiment going into the company's earnings release has 63% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 100.00% with revenue increasing by 48.36%. Short interest has decreased by 4.7% since the company's last earnings release while the stock has drifted higher by 56.2% from its open following the earnings release to be 6.4% above its 200 day moving average of $2.95. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, May 19, 2020 there was some notable buying of 2,960 contracts of the $3.00 call expiring on Friday, June 19, 2020. The stock has averaged a 8.1% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NEPT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Graham Corporation $15.58\n&gt; **Graham Corporation (GHM)** is confirmed to report earnings at approximately 6:30 AM ET on Wednesday, June 10, 2020. The consensus earnings estimate is $0.12 per share on revenue of $32.00 million. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 50.00% with revenue increasing by 35.36%. Short interest has increased by 89.8% since the company's last earnings release while the stock has drifted lower by 21.7% from its open following the earnings release. Overall earnings estimates have been revised lower since the company's last earnings release.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=GHM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/stocks.",
        "subreddit": "stocks",
        "title": "Wall Street Week Ahead for the trading week beginning June 8th, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/gxtspc/wall_street_week_ahead_for_the_trading_week/",
        "created": 1591488855.0
    },
    {
        "author": "ikemnuru",
        "created_utc": 1592377309,
        "id": "ham83z",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": " **I want to get assigned on my very deep ITM (.7delta 2DTE) SPY, QQQ, or WFC puts spreads (those are the positions I have right now lol).**\n\nI have been assigned rarely (less than 6 or 7 times), despite making hundreds of ITM spread trades each month, the last time I got assigned using RH I was on GME 3.5 CALLS in a debit spread a day after ERs. The problem is that RH won't let you buy back stock with the buying power you get from being assigned since they restrict accounts even if you have enough BP to cover it yourself, so I had to tell (email) them to do it for me manually which really sucked since the stock went back up at open before dropping back down to lows of yesterday and I missed out on some small gains. During the aftermath of the whole beyond meat stock craze, I got assigned on a deep ITM call calendar spread and the stock shot up 25$ bucks on 06/10/2019. if RH would have let me sell I would be up 9K that day and made back all my losses overnight. it seems call get assigned more often than puts for me, idk why but stats say that early exercise of calls doesn't make sense to do unlike for puts but it happens more often tho anyways. I want to know how to get assigned on puts tho since RH at least lets you sell back the shares you get assigned since they only allow for you to close positions in your account when you get assigned even if you have the BP to cover the assignment.\n\nTLDR: Which stock options have you guys gotten assigned on, what was the strategy behind them, and when/how long did you hold the position until the assignment occurred?",
        "subreddit": "wallstreetbets",
        "title": "Help!!! How can I get intentionally assigned stock, I need the low-risk leverage.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ham83z/help_how_can_i_get_intentionally_assigned_stock_i/",
        "created": 1592406109.0
    },
    {
        "author": "imattractedtodcfs",
        "created_utc": 1591349025,
        "id": "gx1ahu",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Historically, earnings have not been kind to Gamestop, and their upcoming report on June 28th is no exception. Below is a brief summary of GME's last four earnings reports, beat/miss, and the stock's reaction.\n\n|Date and Quarter|Suprise/Miss|Stock Reaction|\n|:-|:-|:-|\n|(3/26/20 Q4) |\\+51% surprise|\\-4.5% |\n|(12/10/19 Q3) |\\-916% miss |\\-15.5% |\n|(06/04/19 Q2)|\\+450% surprise |\\-35.5% |\n|(04/02/19 Q1)|\\-8.8% miss|\\-4.6% |\n\n  \nBecause in these last four quarters, long-term guidance has continued to deteriorate despite multiple earnings beats, there is a clear tendency for the stock to depreciate following earnings. Considering this bearish reality, there are four generalized scenarios I see coming out of Gamestop's upcoming earnings:  \n\n\n1. Gamestop, despite speculation that digital sales have driven stronger-than-expected earnings (in light of in-store sales tanking), will miss expectations.\n\n2. Gamestop's digital sales will prove to be a short-term saving grace for the company, driving an earnings beat but a less-than optimistic forward guidance for the remainder of the year.\n\n3. Gamestop's digital sales will prove to be a short-term saving grace for the company, driving an earnings beat and greater forward guidance for the upcoming console cycle.\n\n4. Gamestop will crush earnings with their spike in digital sales, improve forward guidance and expectations for the console cycle, and potentially have laid the framework for their 2.0 business model.\n\nBased on earnings estimates, it is more likely than not that Gamestop will either miss the high bar set by analysts following their spike in digital sales (1) or beat earnings with no significant improvement in full-year guidance (2). In both of these scenarios, there is significant downside that has followed the stock quarter to quarter the last few years. If Gamestop can somehow leverage the COVID pandemic to create the necessary foundation for their revised business model, this earnings report could result in the short-squeeze bulls have been speculating about since January (current short float of 96.8%), but it is less than likely.   \n\n\nOverall, considering that any sales boost resulting from COVID has been eagerly priced into earnings, there is significant short-term downside to $GME. We saw in early April that Gamestop is capable of dipping below $3.",
        "subreddit": "StockMarket",
        "title": "[$GME] [6/5/20] \"Despite Gamestop's irrationality over the last 6 months, there is rationality to the likelihood of a continued short-term decline.\"",
        "url": "https://www.reddit.com/r/StockMarket/comments/gx1ahu/gme_6520_despite_gamestops_irrationality_over_the/",
        "created": 1591377825.0
    },
    {
        "author": "BijalAZ",
        "created_utc": 1591684646,
        "id": "gzhng2",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Earnings tomorrow (PM)\nPre-announced negative earnings\nHave $500m cash (last reported)\nPS5 and Xbox coming soon \nBonds just got upgraded\n\nAnd stock float is 100% short\n\nThis will squeeze higher",
        "subreddit": "options",
        "title": "Speculative Short Squeeze Play: GME (Gamestop) - Buy Calls",
        "url": "https://www.reddit.com/r/options/comments/gzhng2/speculative_short_squeeze_play_gme_gamestop_buy/",
        "created": 1591713446.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1591723731,
        "id": "gzrpo4",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "stocks",
        "title": "Anyone buying GAMESTOP today? - Will their earnings beat expectations (they killed e-commerce apparently)",
        "url": "https://www.reddit.com/r/stocks/comments/gzrpo4/anyone_buying_gamestop_today_will_their_earnings/",
        "created": 1591752531.0
    },
    {
        "author": "ItsTrue102",
        "created_utc": 1591830517,
        "id": "h0mpb9",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "With the PS5 coming out, do you think GameStop gets even a minor pop back up?\n\nI know the company is dying because of the convenience of digital downloads for games. But many gamers will still buy their new consoles at the store.",
        "subreddit": "StockMarket",
        "title": "Let's talk about GameStop...can it recover with the PS5 coming soon?",
        "url": "https://www.reddit.com/r/StockMarket/comments/h0mpb9/lets_talk_about_gamestopcan_it_recover_with_the/",
        "created": 1591859317.0
    },
    {
        "author": "imlostandneedanadult",
        "created_utc": 1591007929,
        "id": "guib8p",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Is anyone throwing the dice on gamestop? I'm thinking of throwing a couple of hundred at it in the hopes that it will reach even half its former glory. Is anyone still holding?",
        "subreddit": "stocks",
        "title": "Gamestop roulette",
        "url": "https://www.reddit.com/r/stocks/comments/guib8p/gamestop_roulette/",
        "created": 1591036729.0
    },
    {
        "author": "Becausereasons1",
        "created_utc": 1592147529,
        "id": "h8vjsf",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Alright,\n\nThis post was removed from “another subreddit” without explanation. Can’t get an answer on why, but I DID NOT delete that post and I WILL NOT delete this one. I’ve cleaned up the language and humorous insults so it’s geared toward a broader audience and will treat you all like adults. \n\nI'm here to crack open the matrix and give you a framework to draw conclusions and ideas from. Much of this is known information, but I’m putting it into a context that connects the dots. \n\nAlso, now that you're in here I'm going to convince you that it's going to be a long burn down from here. Circuit breakers? Very likely. New lows? Absolutely. Do I have your attention? Proceed.\n\n**I know what you're thinking....**\n\n*\"Nobody could have seen this coming!*\n\n*\"Buy the dip!\"*\n\n*\"institutions are selling!\"*\n\n*\"Rug pull\"*\n\n*\"JPow will save us!\"*\n\nRetail is all caught with their pants down and are going to be holding Wall Street’s and the corporation’s bags. We’re the only ones left with any faith in the market going up. This is a game of musical chairs and the smart money just took the chairs and left the room.\n\nI've never posted here. I comment, I learn, I steal ideas, and I've been building my thesis while Robinhooders buy Hertz. Maybe we can discuss that later, there's no time to waste.\n\n**Few things...Keep this all in mind while we go along and if you don't know what I'm talking about just google. It's all out there.**\n\n1. We're in a bubble. We have been for a long time. Valuations are stupid, PE ratios off the charts, Nikola is big enough to enter the S&amp;P - IF IT HAD ANY EARNINGS!\n2. Debt and leverage globally absolutely DWARF the 2008 problems surrounding CDO's. You think there was a little corruption and clever lending in America's banking system? Imagine what goes on in the rest of the world\n3. Pretend Covid-19 doesn't exist. The \"crash\" in Feb/March was coming no matter what. Governments, corporations, banks all knew it was inevitable and that there is chaos in the financial system. Let's just operate under that assumption.\n4. Think of right now as being the 2008 housing crisis, but instead of houses in America it's COMPANIES IN THE WORLD (hint: its a lot bigger problem)\n5. First Crash was a liquidity crisis. Nobody had enough cash on their balance sheet to hand over to the people they owed. Think of it like when you don't pay rent. Your landlord might be financially able to take the hit, but he really doesn't want to sell his Tesla stock to pay HIS landlord and so on and so on until the entire financial system seizes up. (psst that's why it's called \"liquidity\")\n6. The fed and central banks came to the rescue the only ways they are legally allowed to. Now that's taken care of and everyone is rife with liquidity to keep the system turning. Today, we are entering a SOLVENCY CRISIS.\n\n**Part 1 - What the Fed is REALLY doing**\n\nNow... let me enlighten you for a second... THE FED DOESN'T ‘BUY STOCKS’. Well, at least not directly. If you remember one thing about the fed, remember - they are bound by RULES. They MUST keep a balance sheet like any other bank. And the money they \"print\" cannot enter the market the same way your paycheck buys condoms for your wife's boyfriend. It's there to sit on the other side of the balance sheet of BANKS or the TREASURY who can then lend \"real\" money into the economy. There's no money that gets \"out\" - It's all \"loaned\" unless it comes from \"stimulus\" which still goes through Congress and the Treasury. More on that later.\n\n**THE POINT IS THERE'S ALWAYS AT LEAST ONE MIDDLE MAN. THIS IS MASSIVELY IMPORTANT LATER!!!**\n\nHere is the breakdown of the steps the fed MUST take when conducting those \"Open Market Operations\" we've all heard about.\n\n**1. When the Fed buys government securities through securities dealers in the bond market, it deposits the payment into the bank accounts of the banks, businesses, and individuals who sold the securities.**\n\n**2. Those deposits become part of the funds commercial banks hold at the Federal Reserve and thus part of the funds commercial banks have available to lend.**\n\n**3. Because banks want to lend money, to attract borrowers they decrease interest rates, including the rate banks charge each other for overnight loans (the federal funds rate).**\n\nSee? The fed only provides \"money\" to institutions they are legally allowed to give money to (Treasury and banks). For simplicity's sake just think of JPow going into his computer and typing in a few zeroes on JP Morgan’s Computer. Doesn't matter. The fed's hands are tied and they can only control rates and print money. Oh by the way... The Fed lowered banks' fractional reserve requirement to ZERO in March. **That means banks don't have to have ANY money in the vault.** Make of this what you will.\n\n**Part 2 - Why Stimulus is Different than printed liquidity**\n\nSo now we hopefully understand where the new printing is going and how it gets there. It's going to anyone who needs a little bump to their cash pile in order to fulfill their existing debt obligations **ONLY TO KEEP THE SYSTEM WORKING.** No more, no less. Fed prints $ and banks give loans. Fed prints $ and Treasury writes checks. **NOBODY** ***WANTS*** **TO DO THIS**\n\nRead this whole article if you want, but I'll pull out what matters.\n\n[The Great Leverage Unwind](https://www.guggenheiminvestments.com/perspectives/global-cio-outlook/the-great-leverage-unwind) \\- **March 22 Before the Stimulus!!**\n\n*\"In order to get a foundation under the markets, we’re going to need something very large, something in the $2 trillion range in the form of a pool of liquidity that can be made quickly available to businesses and corporations that need it, along with the financing facilities of $2 trillion–$4 trillion from the Fed.\"*\n\n**\"Liquidity that can be made quickly available\" = YOUR STIMULUS BABY**\n\n**When it comes to getting fed money to individual companies WE are that middle man I mentioned earlier. It takes the responsibility off of the Fed, so they can claim “free market”.**\n\n**Part 3 - Creating a generation of bagholders**\n\nNow here we are at the March lows. You're locked down, sitting on a Zoom conference call and life sucks. But you're alright. You’ve still got a job and aren't really spending money. And hey, you’re are about to have a stack deposited in your Chase account.\n\n\"LOOK HOW CHEAP GAMESTOP STOCK IS!!! AND THE GUY FROM THE BIG SHORT BOUGHT IT!!! I'M A GENIUS!!!\"\n\nNo, Burry is a genius. And he’s already been dumping his bag on you. Along with TLRD, BA, FB, MIK and DISCA. Just wait until you see Scion's next quarterly filings. Hint: It ain't gonna be those companies no more\n\nSame with Buffett.\n\nSame with Ackman.\n\nSame with Hertz. \n\nOH YEAH....[YOU SOLD YOUR APPLE back TO APPLE](https://www.marketwatch.com/story/apple-expected-to-add-up-to-100-billion-to-buyback-program-while-many-companies-halt-repurchases-2020-04-22)\n\nQ2 filings will be very informative regarding who holds what. I can’t wait.\n\n-I feel I need to highlight this more. What’s it say about Apple and their stock that they made a massive share buyback “because the price is good”? DYOR \n-Also see the latest from Hertz on their insiders and buybacks. They’re raising capital from you guys. Maybe they can get out of bankruptcy, but probably you just gave them a free lunch.\n\n\nTLDR; Global economy is in a corporate debt bubble that works like housing in 2008. Only way this can be fixed is by the measures we see being taken during Covid. Retail has been MANIPULATED AND REQUIRED to perform the functions the Fed cannot(buying individual stocks). This has led to billionaires and institutions leaving retail holding the bag. It’s going to follow a bursting bubble pattern. Nobody is left to prop up the markets nor do they want to because the leverage has to unwind. Dollar might surge like last time and collapse (milkshake theory).\n\nAddition: Futures being green headed into an open just means we open higher for everyone to get a chance to dump. If you were a fund manager would you want the market to open green and THEN sell? Or sit and wait around all day for a sell price you might not get? Remember it’s all about manipulating retail. The “bounce” you figure is coming already happened overnight. Or there was selling overnight and the bounce is coming at the open. Look at the /ES charts and the market hour charts. That price action that happens in between matters to the patterns. A regular S&amp;P chart is basically cut in half. \n\nMessage me if you are interested in what I’m doing through all this.",
        "subreddit": "investing",
        "title": "A Generation of Bag-Holders - New lows incoming",
        "url": "https://www.reddit.com/r/investing/comments/h8vjsf/a_generation_of_bagholders_new_lows_incoming/",
        "created": 1592176329.0
    },
    {
        "author": "yolocr8m8",
        "created_utc": 1591650823,
        "id": "gz8b87",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Game gang (GME) mount up",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gz8b87/game_gang_gme_mount_up/",
        "created": 1591679623.0
    },
    {
        "author": "Volitank",
        "created_utc": 1591324150,
        "id": "gwvws8",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Gamestop Earnings DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gwvws8/gamestop_earnings_dd/",
        "created": 1591352950.0
    },
    {
        "author": "iamoftheway",
        "created_utc": 1591791673,
        "id": "h09s04",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "The biggest short squeeze of the century or the biggest blue balls of my life. GameStop DD inside",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/h09s04/the_biggest_short_squeeze_of_the_century_or_the/",
        "created": 1591820473.0
    },
    {
        "author": "kilographix",
        "created_utc": 1591716758,
        "id": "gzpe9q",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "GME 90% of float is short so any upside forces shorts to cover -&gt; free tendies from the \"smart money\" who pay attention to fUnDaMEnTaLs",
        "url": "https://i.redd.it/n9gpiqxllw351.jpg",
        "created": 1591745558.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1591859380,
        "id": "h0u84b",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "Yesterday GameStop announced negative earnings, missing expectations by 250%. This is today.",
        "url": "https://i.redd.it/fn9hsbipd8451.jpg",
        "created": 1591888180.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1591859332,
        "id": "h0u7p3",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "Yesterday after hours GameStop announced negative earnings, missing expectations by 250%. This is today.",
        "url": "https://i.redd.it/d3si8tckd8451.jpg",
        "created": 1591888132.0
    },
    {
        "author": "70238",
        "created_utc": 1591796252,
        "id": "h0b4rf",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Huge short squeeze for $GME today",
        "url": "https://www.reddit.com/r/stocks/comments/h0b4rf/huge_short_squeeze_for_gme_today/",
        "created": 1591825052.0
    },
    {
        "author": "gme_bull",
        "created_utc": 1591206189,
        "id": "gvyjzx",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "This is more advanced technique, but I just saw one the most self-sacrificing acts by a CEO ever, and it's so astounding that I wanted to share this prematurely since the coming glamour bust is attracting the next crop.  This is a Franchise technique which should not be attempted until NetNets, Special Situations, and Deep Value are reasonably mastered.\n\nCompare Warren Buffett to Mark Zuckerberg.  Who would you feel more comfortable entrusting your money?  Buffett takes a token salary which the cynic would write off as self-serving because he owns so many shares.  Zuckerberg is alleged to have chiseled his co-owners from the Winkelvoss twins, to his initial backer Saverin, to the guy who showed him the realities of VCs and public corporations Parker, which people might all excuse because of poor treatment.\n\nCompare Buffett to the typical hedge fund manager.  If Buffett were truly paid what he were worth, he would have taken hedge fund like compensation over the years.  Instead, he shared the wealth with all of the friends &amp; family he accumulated along the way.  Yes, he's had public spats.  Nobody's perfect.  But he never chiseled his partners even after one came to his office with a gun, demanding Buffett show him where the mystery Ponzi vault filled with the absconded money was.  Buffett simply got rid of him and kicked him out of the partnership.  No police.  No chiseling.  No petty vengeance.\n\nCompare Zuckerberg to the Home Depot's founders' never complaining about giving such a large chunk of initial equity to Kenneth Langone.  They made a deal, and they kept the deal.  In the end, they profited mightily, and Home Depot rarely sold at a good discount in their years.\n\nFB has never sold for full fair value while BRK rarely deviates from a good band of full fair value.  Zuckerberg's early spats with multiple co-owners over the years has manifested into a discount now worth another $650 billion in market cap.  That's a very, very painful set of mistakes.  No one will ever forget 3 different large incidents over the years, so if he ever does get full fair value based on the numbers alone, it's unlikely to expect them to remain for long.\n\nNow, forget I'm an investor who wholly supports the CEO, George Sherman, and his command over GME.  Forget that with the way compensation is structured for management: they have to hit very high financial quality standards and have elected to take the bulk of their compensation in future stock with 1 out of the 5 year compensation schedule already lost due to the console collapse.  Forget that a $1 million salary for a CEO of a company with $8 billion in normal sales is a pittance.  Even still, forget that they've already slashed that in half to support the company.\n\nAnd now, a man who has now staked everything he can for a bet on the company has apparently quietly informed employees that he will be donating the remainder of his S Corp owner/operator level salary to the employees' emergency fund.  No PR.  No great fanfare.  Nothing even highlighted on /r/GameStop.  You'll have to excuse me, but ALL HAIL CAESAR!!!  With how his compensation is structured, he is now dipping into savings for the privilege of working there on a cash basis.\n\nOnly the truly cynical and purely untrusting would look for conspiracy in that.  Maybe one could call the initial pay slash self-serving, but there really is nothing more anyone can ask from this man to prove he deserves the top spot.  He is tapped out, and I can't fault any executive who can't follow; the number 1 spot should be reserved only for the truly exceptional.\n\nNo one expected the console collapse, and most still aren't aware.  To management's credit, they fully expected a drop off and were prepared.  Absolutely no one was prepared for the magnitude of the drop off in anticipation of the new, record delayed consoles.  And it still persists until launch.  In light of the fact that the CEO essentially receives all of his pay in stock now which was the expressed intent to keep him thinking like an owner, would this company even still be around had they not prudently wiped away the debt and payables?  Had they used that money to buyback even more stock despite already retiring nearly 40% of it which is a feat by itself despite the horrific cash flow, the company would have already been in bankruptcy.  Either the interest expenses or a payables liquidation would have rendered the company insolvent due to onerous cash flow during both a pandemic and riots.  They elected to take a hit to cash flow last year despite what it would do to their bonuses to make working capital safer.  Since the company would not be here were it not for such measured prudence, I can safely say that Mr Sherman and his lieutenants are worth $6 billion in average market valuation.  By his entire record to date and reasonable expectations for a master and possibly legend value investor's return, I can also safely say this man is worth another $6 to $12 billion in market cap at present fair value to the company.\n\nI have never seen anything like this, and no one else has either.  This is certainly adding to the confusion and panic because we've never seen this in the wild.  It can only reasonably be a conspiracy because a CEO cannot be this good.  He is delivering so perfectly the spirit of value investing, that people must conclude this is some trick.  It's so bad, ISS needs details to understand management's general strategy of financial safety, cash flow, and high ROI despite the official statement being almost a word for word regurgitation of Buffett.  Someone's just going to have to show me how to fake donating all of your salary without already being exceptionally wealthy.\n\nThis is the kind of person you leave your money with when you're stuck on Buffett's Island for 10 years, all alone.  He will go on to do great things, especially now that he's had this exposure to value investing and has already added it to his repertoire.  I can't be certain of the same for GME without him.",
        "subreddit": "ValueInvesting",
        "title": "CEO character and betting on the jockey rather than the horse",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/gvyjzx/ceo_character_and_betting_on_the_jockey_rather/",
        "created": 1591234989.0
    },
    {
        "author": "shady226",
        "created_utc": 1591626285,
        "id": "gz0a38",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "GME undervalued prior to new console cycle upgrade",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gz0a38/gme_undervalued_prior_to_new_console_cycle_upgrade/",
        "created": 1591655085.0
    },
    {
        "author": "Soorena",
        "created_utc": 1591714703,
        "id": "gzoqjw",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Buy Gamestop Calls",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gzoqjw/buy_gamestop_calls/",
        "created": 1591743503.0
    },
    {
        "author": "danzf123",
        "created_utc": 1591897167,
        "id": "h13z6b",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I sold my options contract of GME 4.5p 6/19 at .56. Order hasn’t been filled and price has since decreased. What did I do wrong? What’s going to happen to my money?",
        "subreddit": "RobinHood",
        "title": "My options contracts aren’t selling?",
        "url": "https://www.reddit.com/r/RobinHood/comments/h13z6b/my_options_contracts_arent_selling/",
        "created": 1591925967.0
    },
    {
        "author": "bbbblahblahblah",
        "created_utc": 1591816650,
        "id": "h0hxqx",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "GME Short Squeeze",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/h0hxqx/gme_short_squeeze/",
        "created": 1591845450.0
    },
    {
        "author": "iamoftheway",
        "created_utc": 1591767007,
        "id": "h04joh",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "The biggest squeeze of the century or the biggest blue balls of my life: GameStop DD inside",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/h04joh/the_biggest_squeeze_of_the_century_or_the_biggest/",
        "created": 1591795807.0
    },
    {
        "author": "bbbblahblahblah",
        "created_utc": 1591816685,
        "id": "h0hy6q",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "GME",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/h0hy6q/gme/",
        "created": 1591845485.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1591859351,
        "id": "h0u7uq",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "Yesterday after hours GameStop announced negative earnings, missing expectations by 250%. This is today.",
        "url": "https://i.redd.it/tlrtj1hmd8451.jpg",
        "created": 1591888151.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1591859319,
        "id": "h0u7lf",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "Yesterday after hours GameStop announced negative earnings, missing expectations by 250%. This is today.",
        "url": "https://i.redd.it/yau34awid8451.jpg",
        "created": 1591888119.0
    },
    {
        "author": "imattractedtodcfs",
        "created_utc": 1591402577,
        "id": "gxgfta",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "[6/5/20] [$GME]: Despite Gamestop's irrationality over the last 6 months, there is rationality to the likelihood of a continued short-term decline.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gxgfta/6520_gme_despite_gamestops_irrationality_over_the/",
        "created": 1591431377.0
    },
    {
        "author": "imattractedtodcfs",
        "created_utc": 1591557787,
        "id": "gyijw9",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "[6/5/20] [$GME]: Despite Gamestop's irrationality over the last 6 months, there is rationality to the likelihood of a continued short-term decline.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gyijw9/6520_gme_despite_gamestops_irrationality_over_the/",
        "created": 1591586587.0
    },
    {
        "author": "BigShoots",
        "created_utc": 1591723009,
        "id": "gzrgo7",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "What are your plays for Gamestop earnings today? Could be a wild one!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gzrgo7/what_are_your_plays_for_gamestop_earnings_today/",
        "created": 1591751809.0
    },
    {
        "author": "DrFreakonomist",
        "created_utc": 1591707442,
        "id": "gzmmgn",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "GME earnings today - potential gains",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gzmmgn/gme_earnings_today_potential_gains/",
        "created": 1591736242.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1591460166,
        "id": "gxttxj",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Good Saturday afternoon to all of you here on r/wallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning June 8th, 2020.\n\n# **Look for the S&amp;P 500 to turn positive for the year with a boost from the Fed in the week ahead  - [(Source)](https://www.cnbc.com/2020/06/05/look-for-the-sp-500-to-turn-positive-for-the-year-with-a-boost-from-the-fed-in-the-week-ahead.html)**\n*****\n&gt; Federal Reserve Chairman Jerome Powell is expected to reassure markets next week the central bank will do whatever it takes to help the economy heal. That should be enough to keep investors moving into stocks that benefit from an economic rebound and push the S&amp;P 500 into the green for 2020.\n*****\n&gt; The Fed’s two-day meeting is the big event for markets in the coming week. There are a few economic reports, including inflation data, the consumer price index Wednesday and producer prices Thursday. Weekly jobless claims will be important Thursday to see if there’s a drop in continuing clams, after May’s employment report showed a surprising record gain of 2.5 million jobs.\n*****\n&gt; The reopening trade was in full swing in the past week, especially Friday when stocks surged on the jobs report, which was expected to show a loss of 8.3 million jobs. The Nasdaq broke above its record high set on Feb. 19, and the S&amp;P 500 was just 1.1% away from turning positive for 2020.\n*****\n&gt; Even before the jobs report, investors were loading up on financials, industrials, transports and small caps, which were up more than 8% for the week and 18.4% in the past month. S&amp;P financials were 12.1% higher on the week, S&amp;P industrials were up 10.5, and the NYSE airline index jumped more than 35.4.%.\n*****\n&gt; “I think next week is dominated by the reopening and it will be for another month,” said James Paulsen, chief investment strategist at Leuthold Group. “With cyclicals outperforming, small [caps] outperforming, credit spreads coming in and then the bond yields going up, everybody — all facets of the financial markets — are sort of suggesting the same outcome.”\n*****\n&gt; The S&amp;P 500 ended the week at 3,193, a gain of 4.9%, and now traders are watching to see if it can scale the psychological 3,200 level. The Dow closed Friday at 27,110, up 6.8% for the week, and the Nasdaq Composite was up 3.4%, at 9,814 after reaching an intraday record high of 9,845 Friday.\n*****\n&gt; Analysts say the market will likely look past the protests that broke out in cities across the U.S. after the death of George Floyd in Minneapolis. Four policemen were charged with murder in his death. Looters joined the protests, some of which turned violent, but they quieted down towards the end of the week.\n*****\n&gt; Stocks were higher for a third week in a row, but a change this past week has been the abrupt lurch higher in Treasury yields. The 10-year rose to a high of 0.95% Friday, a quarter-point move in just three sessions. The move was already underway but got a lift Wednesday when ADP jobs data was not nearly as bad as expected. Yields ripped even higher after the May employment report showed the unemployment rate actually fell to 13.3%, instead of climbing to 20%, as expected by economists.\n*****\n&gt; Bond strategists said the Treasury market was now acknowledging the potential for a recovery, but not in the exuberant way the stock market has been. Since March 23, the S&amp;P 500 has risen more than 45%, but it took the 10-year Treasury until this week to get back the yield level it was at when stocks bottomed.\n*****\n&gt; Paulsen said he believes a new bull market has been launched, but there could be pullbacks and some headwinds for the market coming up.\n*****\n&gt; “When GDP is minus 30%, other issues don’t matter. There’s just one issue. But as the economy reopens again, the trade battles will matter again, presidential politics will matter again,” said Paulsen, adding the budget deficit could also matter. “I think we’ll get removed from a sole focus. That isn’t quite there but I think it’s coming.”\n*****\n&gt; # Fed ahead\n&gt; The Fed begins its two-day meeting Tuesday, and will release its statement Wednesday afternoon, followed by a video briefing by Powell.\n*****\n&gt; “Whey would the Fed want to disrupt this with anything?” Paulsen said. “They’re still going to support the economy. They’re going to stay away from negative rates or yield curve management. They’re not going to do anything to scare the markets. They might certainly reassure people that they are still ready to provide support.”\n*****\n&gt; Ethan Harris, head of global economics at Bank of America, said the Fed may clarify where it stands on some of the extraordinary moves it has taken since it cut rates to zero. The Fed has been supporting the markets with asset purchases and multiple programs for commercial paper, corporate bonds, and municipal bonds, for example.\n*****\n&gt; “We think right now they’re just trying to get this Main Street lending program to work. The question is are they going to do more things around what they do in terms of forward guidance and next steps of macro easing,” Harris said.\n*****\n&gt; There has been speculation that the Fed would do some type of so-called yield curve control, a program to keep interest rates capped at certain levels. “I think it’s too early for that,” said Harris. He said the Fed would be guaranteeing low rates for a long period of time if it does yield curve control.\n*****\n&gt; “Yield curve control is basically open-ended quantitative easing,” he said. The Fed is currently buying Treasurys but if it wanted to stop yields from rising too much as the economy improves, it could make targeted purchases.\n*****\n&gt; Barclays chief U.S. economist Michael Gapen said it’s possible the Fed could announce the yield curve control. “We’ve said they could implement yield curve control out to three years,” he said. “In my mind that matches the length of the horizon of the economic projections.”\n*****\n&gt; Powell has said the economy needs more fiscal help, and he could reiterate those comments Wednesday. President Donald Trump on Friday said he backs more stimulus. So far, the Democrats have put out a marker with their wish list for further spending, but there have been no negotiations.\n*****\n&gt; There was concern the strong jobs report could make it harder to get buy in for another big spending package. But some economists say the recovery needs a boost and states need funding to fill the holes in their budgets from coronavirus-related spending and a lack of tax receipts.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/7klaXQm.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/PKTBzT2.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/a5JkAB6.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/M2x4Qoq.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/qtJYfXN.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/bjiJWjV.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/UAi19KJ.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/GQm4ruO.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/PQzyXLa.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/uV1U7FN.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/wm2XJND.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/yarkiMO.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/hFblu2G.png))**\n\n*****\n\n# S&amp;P 500 Stocks Outpacing Analyst Price Targets\n\n&gt; This morning's jobs report shocked the financial world -- most notably the economists whose job it is to provide estimates. The consensus estimate among economists for May nonfarm payrolls was projecting a loss of more than 7 million jobs. The actual number that was reported did not just show a smaller than expected job loss, but it actually showed a gain in jobs of more than 2.5 million.\n\n&gt; We're seeing a similar situation play out in the equity analyst community. With the S&amp;P 500 now up 40%+ since its low less than three months ago, the average stock in the index is now trading above its consensus analyst price target that looks 12 months out. Analysts have simply not been able to catch up to the rapid rise we've seen for equity prices.\n\n&gt; It's extremely rare to see share prices move above consensus analyst price targets. We don't have the historical daily data on this, but anecdotally we can't remember a time when the spread has been this wide. As shown below, at the end of 2019 when the S&amp;P finished a massive rally, equity prices were 5.5% below the consensus price target. That was seen as a very tight spread prior to what we're seeing now. At the lows in March, the average share price had dropped all the way to $92.50 compared to an average consensus price target of $143.20. That projected a gain of 54.9% at the time!\n\n&gt; Since March 23rd, the average share price has risen from $92.50 up to $138.40, while the average analyst price target has fallen from $143.20 to $136. Current price targets no longer project a gain for the average S&amp;P 500 stock, but rather a 1.7% drop.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/avgpricetarget.png))**\n\n&gt; # Nasdaq's Historical Run\n\n&gt; At its highs earlier this morning, the Nasdaq Composite was within 2% of its record high from earlier in the year. Besides the steep V-shape of the Nasdaq's pattern over the last four months, the other aspect of the chart that stands out is just how steep the 50-day moving average is trending lately.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060420-Nasdaq-50DMAa.png))**\n\n&gt; To illustrate just how steep the Nasdaq's 50-DMA has become, the chart below shows the daily percentage change of the 50-day going back to 1971. Currently, the Nasdaq 50-DMA is rising at an average of over 0.5% per day. That's an incredible slope and a level that has been exceeded only a handful of times in the Nasdaq's 50-year history.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060420-Nasdaq-Composite1.png))**\n\n*****\n\n# Big Gains From Smaller Tech\n\n&gt; It's still difficult to fathom the moves in the US equity market over the last four months. The fact that the Nasdaq and more specifically the Technology sector aren't far from record highs is definitely something no one was expecting two months ago. There's an old market saying that equities take the stairs up and the elevator down, but in the latest market cycle, the elevator up was almost as fast as the way down!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060320-Nasdaq.png))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060320-Technology-Sector.png))**\n\n&gt; If you've been following the markets, all you've likely heard up until recently is that large-cap tech, and more specifically, Microsoft (MSFT), Apple (AAPL), Amazon (AMZN), Alphabet (GOOGL), and Facebook (FB), are single-handedly driving the market higher. The reality is not nearly as clear-cut. Given their market caps, the \"Big 5\" (as they're often referred to) have done a lot of heavy lifting, but in terms of performance, they're hardly the only game in town.\n\n&gt; The table below lists Technology sector stocks in the Russell 3000 with market caps of more than $1 billion that are outperforming all of the 'big 5' tech stocks on a YTD basis. Actually, since Amazon is doing so well relative to the rest of the \"big 5\" these are all stocks that are outperforming Amazon. If we looked for stocks that were doing better than the average return of the \"big 5\" the list would be a lot, lot longer (+16.4%).\n\n&gt; Looking through the list of names below, the two top-performing names are Zscaler (ZS) and Twilio (TWLO), which have both more than doubled. Behind these two, DocuSign (DOCU) and Sprout Social (SPT) are both knocking on the door of triple-digits. All 28 of the names listed have market caps of $1 billion, but the average market cap is just over $21 billion, while Nvidia (NVDA) is the largest company on the list with a market cap of $216 billion. For the most part, these aren't names that have been driving the indices, but anyone holding these stocks in their portfolio probably doesn't care!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060320-Tech-Stocks.png))**\n\n*****\n\n# Best 50-Day Rally Ever\n\n&gt; In many ways, what we’ve seen so far in 2020 has been both record-breaking and devastating. From the S&amp;P 500 Index peak on February 19 to the bear market lows March 23, stocks lost 33.9%. Now, 50 trading days later, stocks have gained 39.6%, for the largest 50-day rally since the S&amp;P 500 moved to 500 stocks in 1957.\n\n&gt; “There are no rollercoasters that can replicate what stocks have done so far in 2020,” exclaimed LPL Financial Senior Market Strategist Ryan Detrick. “Here’s the catch though: Big 50-day rallies in the past have taken place near the start of new bull markets, and the returns going out a year were quite bullish.”\n\n&gt; As shown in the LPL Chart of the Day, the 39.6% gain in 50 days was the greatest 50-day rally ever, besting the previous best in October 1982. What’s important to note here is that many of these rallies took place coming off major market lows, and delivered quite strong returns going out 6 to 12 months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/06/best-fifty-days.png?ssl=1))**\n\n&gt; Although we have near-term worries given this historic run, as some sentiment indicators such as put/call ratios are showing some froth, from a bigger picture perspective, this strong 50-day rally offers a reason to think stock prices may be even higher this time next year.\n\n*****\n\n# 2020 In Charts\n\n&gt; 2020 is only five months old, but in many ways it is one of the most historic years we’ve ever seen. “2020 went from moving along nicely, to seeing the worst recession in a generation and the fastest bear market ever,” explained LPL Financial Senior Market Strategist Ryan Detrick. “Now stocks are in the midst of one of the best bull runs ever, even though the economy remains extremely weak, thanks to record stimulus and hopes over a vaccine.”\n&gt; \nTo best sum it all up, here are 10 charts that tell the picture of 2020 so far.\n\n&gt; 1.) The 2010s were the first decade in history to go all 10 years without a recession, which of course ended just months into the new decade, as the economy stopped. Stocks gained 13.5% on an annual basis last decade, surprisingly, only the third-best decade over the past four.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/06/1-blog-chart.png?ssl=1))**\n\n&gt; 2.) This is an election year, and the S&amp;P 500 Index hasn’t been lower when a President is up for reelection since FDR in 1940. Although this seemed nearly impossible at the March lows, it is looking like this incredible streak could have a chance in 2020.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/2-blog-chart.png?ssl=1))**\n\n&gt; 3.) One of the first signs something could go wrong in 2020 was stocks fell in January. Historically, this has meant potential trouble for the final 11 months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/3-blog-chart.png?ssl=1))**\n\n&gt; 4.) As fears over COVID-19 gripped the world, the Dow Jones Industrial Average had its fastest bear market ever, in only 19 days. To put this in perspective, this was the fastest bear market in the 124-year history of the Dow.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/4-blog-chart.png?ssl=1))**\n\n&gt; 5.) Mark Twain said “History doesn’t repeat itself, but it often rhymes”. Looking at history, every 50 years there has been a terrible pandemic and stocks fell more than 30%. We don’t know if the ultimate lows are in this time, but so far, history is rhyming.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/blog-chart-5.png?ssl=1))**\n\n&gt; 6.) More than 20 million people in the US lost their jobs in April, while the unemployment rate soared to near 15%, the highest since the Great Depression. Record drops in manufacturing, industrial production, retail sales, and consumer spending have all taken place in the past two months as well.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/6-blog-chart.png?ssl=1))**\n\n&gt; 7.) A recession is here, ending the streak of 128 months in a row without one. What is unique about the previous expansion was nominal gross domestic product (GDP) grew only 50%, about the average growth seen during the previous expansions, but this expansion was nearly twice as long as the average expansion (10 years versus 5 years).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/7-blog-chart.png?ssl=1))**\n\n&gt; 8.) The bounce off of the March 23 S&amp;P 500 lows has been historic in many ways. In fact, it was one of the best 20-day rallies ever, with previous best rallies seeing strong returns 6 and 12 months later.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/8-blog-chart.png?ssl=1))**\n\n&gt; 9.) As scary as it was on the way down, stocks have come roaring back, gaining more than 35% from the March 23 lows. This would classify as the greatest bear market bounce ever, which opens the question: is this more than a bear market bounce and instead the start of a new bull market?\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/9-blog-chart.png?ssl=1))**\n\n&gt; 10.) The number of COVID-19 tests in the US nearly doubled in May versus what was seen in April. Additionally, fewer and fewer tests are coming back positive. Testing is one of the key ways we will beat this and this is a step in the right direction. We’ve also seen new monthly lows in people on ventilators, in the ICU, and in hospitals.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/9-blog-chart.png?ssl=1))**\n\n&gt; Hard to believe, but there are still 7 months left in 2020. It hasn’t been easy for any of us, and we continue to keep everyone impacted by this pandemic in mind, but we continue to see the glass as half full. The dual benefit of record monetary and fiscal policy should help create a bridge to help those most impacted, while the economy can slowly come back online later this year.\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$ADBE** \n&gt; * **$CHWY** \n&gt; * **$TIF** \n&gt; * **$LULU** \n&gt; * **$COUP** \n&gt; * **$SFIX** \n&gt; * **$LOVE** \n&gt; * **$NEPT** \n&gt; * **$GHM** \n&gt; * **$REVG** \n&gt; * **$GME** \n&gt; * **$HDS** \n&gt; * **$FIVE** \n&gt; * **$SIG** \n&gt; * **$CASY** \n&gt; * **$CVGW** \n&gt; * **$AMC** \n&gt; * **$FCEL** \n&gt; * **$QTNT** \n&gt; * **$PLCE** \n&gt; * **$CHS** \n&gt; * **$THO** \n&gt; * **$GCO** \n&gt; * **$BF.B** \n&gt; * **$LMNR** \n&gt; * **$WSG** \n&gt; * **$PRTY** \n&gt; * **$GES** \n&gt; * **$BBCP** \n&gt; * **$CONN** \n&gt; * **$HEXO** \n&gt; * **$PHR** \n&gt; * **$PVH** \n&gt; * **$RRGB** \n&gt; * **$PLAY** \n&gt; * **$TNP** \n&gt; * **$JW.A** \n&gt; * **$SB** \n&gt; * **$GSM** \n&gt; * **$SRT**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/PQzyXLa.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/bgPdMCr.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 6.8.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/d2EW1kr.png))\n\n&gt; # ***Monday 6.8.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/uxSiJJr.png))\n\n*****\n\n&gt; # ***Tuesday 6.9.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/3SIjcG7.png))\n\n&gt; # ***Tuesday 6.9.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/cRBrPlt.png))\n\n*****\n\n&gt; # ***Wednesday 6.10.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/DaheXAm.png))\n\n&gt; # ***Wednesday 6.10.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/9mcHxTl.png))\n\n*****\n\n&gt; # ***Thursday 6.11.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/i8SNjWM.png))\n\n&gt; # ***Thursday 6.11.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/9xcBZPK.png))\n\n*****\n\n&gt; # ***Friday 6.12.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n&gt; # ***Friday 6.12.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# Adobe Inc. $392.90\n&gt; **Adobe Inc. (ADBE)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, June 11, 2020. The consensus earnings estimate is $2.33 per share on revenue of $3.17 billion and the Earnings Whisper ® number is $2.39 per share. Investor sentiment going into the company's earnings release has 79% expecting an earnings beat The company's guidance was for earnings of approximately $2.35 per share. Consensus estimates are for year-over-year earnings growth of 26.63% with revenue increasing by 15.51%. Short interest has increased by 3.0% since the company's last earnings release while the stock has drifted higher by 25.6% from its open following the earnings release to be 23.1% above its 200 day moving average of $319.27. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, May 19, 2020 there was some notable buying of 3,194 contracts of the $410.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 4.8% move on earnings and the stock has averaged a 6.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ADBE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# United Natural Foods, Inc. $20.78\n&gt; **United Natural Foods, Inc. (UNFI)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, June 10, 2020. The consensus earnings estimate is $1.41 per share on revenue of $6.67 billion and the Earnings Whisper ® number is $1.42 per share. Investor sentiment going into the company's earnings release has 78% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 131.15% with revenue increasing by 11.86%. Short interest has decreased by 16.0% since the company's last earnings release while the stock has drifted higher by 202.5% from its open following the earnings release to be 96.1% above its 200 day moving average of $10.60. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, June 2, 2020 there was some notable buying of 2,226 contracts of the $22.50 call expiring on Friday, June 19, 2020. Option traders are pricing in a 17.7% move on earnings and the stock has averaged a 15.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=UNFI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Chewy, Inc. $48.44\n&gt; **Chewy, Inc. (CHWY)** is confirmed to report earnings at approximately 4:10 PM ET on Tuesday, June 9, 2020. The consensus estimate is for a loss of $0.11 per share on revenue of $1.55 billion and the Earnings Whisper ® number is ($0.09) per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 37.50% with revenue increasing by 39.78%. Short interest has increased by 37.9% since the company's last earnings release while the stock has drifted higher by 37.5% from its open following the earnings release to be 56.4% above its 200 day moving average of $30.97. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 5.8% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CHWY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Tiffany &amp; Co. $121.99\n&gt; **Tiffany &amp; Co. (TIF)** is confirmed to report earnings at approximately 6:40 AM ET on Tuesday, June 9, 2020. The consensus earnings estimate is $0.21 per share on revenue of $646.40 million. Investor sentiment going into the company's earnings release has 6% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 79.61% with revenue decreasing by 35.56%. Short interest has decreased by 26.5% since the company's last earnings release while the stock has drifted lower by 4.7% from its open following the earnings release to be 1.9% above its 200 day moving average of $119.75. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, June 5, 2020 there was some notable buying of 9,022 contracts of the $110.00 put expiring on Friday, August 21, 2020. Option traders are pricing in a 6.2% move on earnings and the stock has averaged a 3.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TIF&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# lululemon athletica inc. $319.78\n&gt; **lululemon athletica inc. (LULU)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, June 11, 2020. The consensus earnings estimate is $0.28 per share on revenue of $724.78 million and the Earnings Whisper ® number is $0.30 per share. Investor sentiment going into the company's earnings release has 47% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 62.16% with revenue decreasing by 7.35%. Short interest has increased by 53.3% since the company's last earnings release while the stock has drifted higher by 66.1% from its open following the earnings release to be 46.8% above its 200 day moving average of $217.77. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, June 4, 2020 there was some notable buying of 1,385 contracts of the $350.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 9.4% move on earnings and the stock has averaged a 7.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LULU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Coupa Software $216.94\n&gt; **Coupa Software (COUP)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, June 8, 2020. The consensus earnings estimate is $0.07 per share on revenue of $111.83 million and the Earnings Whisper ® number is $0.10 per share. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat The company's guidance was for earnings of $0.06 to $0.08 per share on revenue of $112.00 million to $112.00 million. Consensus estimates are for year-over-year earnings growth of 450.00% with revenue increasing by 37.48%. Short interest has increased by 7.9% since the company's last earnings release while the stock has drifted higher by 94.9% from its open following the earnings release to be 40.3% above its 200 day moving average of $154.59. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, June 4, 2020 there was some notable buying of 1,085 contracts of the $220.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 12.7% move on earnings and the stock has averaged a 9.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=COUP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Stitch Fix, Inc. $24.96\n&gt; **Stitch Fix, Inc. (SFIX)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, June 8, 2020. The consensus estimate is for a loss of $0.17 per share on revenue of $401.40 million and the Earnings Whisper ® number is ($0.13) per share. Investor sentiment going into the company's earnings release has 53% expecting an earnings beat The company's guidance was for revenue of $465.00 million to $475.00 million. Consensus estimates are for earnings to decline year-over-year by 342.86% with revenue decreasing by 1.83%. Short interest has increased by 4.0% since the company's last earnings release while the stock has drifted higher by 66.4% from its open following the earnings release to be 19.1% above its 200 day moving average of $20.96. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, June 2, 2020 there was some notable buying of 5,092 contracts of the $25.00 call expiring on Friday, June 12, 2020. Option traders are pricing in a 21.2% move on earnings and the stock has averaged a 13.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SFIX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Lovesac Company $17.84\n&gt; **Lovesac Company (LOVE)** is confirmed to report earnings at approximately 7:00 AM ET on Tuesday, June 9, 2020. The consensus estimate is for a loss of $0.69 per share on revenue of $48.22 million and the Earnings Whisper ® number is ($0.65) per share. Investor sentiment going into the company's earnings release has 52% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 2.99% with revenue increasing by 17.73%. Short interest has increased by 20.5% since the company's last earnings release while the stock has drifted higher by 109.9% from its open following the earnings release to be 31.5% above its 200 day moving average of $13.57. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 20.1% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LOVE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Neptune Wellness Solutions Inc. $3.14\n&gt; **Neptune Wellness Solutions Inc. (NEPT)** is confirmed to report earnings after the market closes on Wednesday, June 10, 2020. The consensus estimate is for a loss of $0.08 per share on revenue of $6.32 million and the Earnings Whisper ® number is ($0.10) per share. Investor sentiment going into the company's earnings release has 63% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 100.00% with revenue increasing by 48.36%. Short interest has decreased by 4.7% since the company's last earnings release while the stock has drifted higher by 56.2% from its open following the earnings release to be 6.4% above its 200 day moving average of $2.95. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, May 19, 2020 there was some notable buying of 2,960 contracts of the $3.00 call expiring on Friday, June 19, 2020. The stock has averaged a 8.1% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NEPT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Graham Corporation $15.58\n&gt; **Graham Corporation (GHM)** is confirmed to report earnings at approximately 6:30 AM ET on Wednesday, June 10, 2020. The consensus earnings estimate is $0.12 per share on revenue of $32.00 million. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 50.00% with revenue increasing by 35.36%. Short interest has increased by 89.8% since the company's last earnings release while the stock has drifted lower by 21.7% from its open following the earnings release. Overall earnings estimates have been revised lower since the company's last earnings release.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=GHM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/wallstreetbets.",
        "subreddit": "wallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning June 8th, 2020",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gxttxj/wall_street_week_ahead_for_the_trading_week/",
        "created": 1591488966.0
    },
    {
        "author": "bbbblahblahblah",
        "created_utc": 1591818262,
        "id": "h0ii4v",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "pennystocks",
        "title": "GME",
        "url": "https://www.reddit.com/r/pennystocks/comments/h0ii4v/gme/",
        "created": 1591847062.0
    },
    {
        "author": "Cryptographer",
        "created_utc": 1591803270,
        "id": "h0db0i",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "GME Squeeze?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/h0db0i/gme_squeeze/",
        "created": 1591832070.0
    },
    {
        "author": "bbbblahblahblah",
        "created_utc": 1591803710,
        "id": "h0dgfm",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "pennystocks",
        "title": "GME Short Squeeze of a life time",
        "url": "https://www.reddit.com/r/pennystocks/comments/h0dgfm/gme_short_squeeze_of_a_life_time/",
        "created": 1591832510.0
    },
    {
        "author": "socialist_baby",
        "created_utc": 1591127269,
        "id": "gvec0m",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Long $GME?",
        "url": "https://i.imgur.com/mMMeFCa.jpg",
        "created": 1591156069.0
    },
    {
        "author": "imattractedtodcfs",
        "created_utc": 1591348979,
        "id": "gx1a5n",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "options",
        "title": "[$GME] [6/5/20] \"Despite Gamestop's irrationality over the last 6 months, there is rationality to the likelihood of a continued short-term decline.\"",
        "url": "/r/WallStreetIdeas/comments/gx19ea/gme_6520_despite_gamestops_irrationality_over_the/",
        "created": 1591377779.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1591707935,
        "id": "gzmrea",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "$GME to 20 by Friday",
        "url": "https://i.redd.it/qfgffw6bvv351.jpg",
        "created": 1591736735.0
    },
    {
        "author": "G23456789",
        "created_utc": 1591804792,
        "id": "h0dtsn",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "AMC and GameStop",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/h0dtsn/amc_and_gamestop/",
        "created": 1591833592.0
    },
    {
        "author": "Pschemm31",
        "created_utc": 1591800886,
        "id": "h0cmh5",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Is it safe to assume they aren’t going to be able to make their debt payments and have to file Ch11? \n\nI have been watching because I’m still amazed how they are still in business. They fall in the same category as a GameStop where their services have been unnecessary for the last 5-10 years.  \n\nI frequent the gym and haven’t purchased anything from them in over 10 years. I get all of protein supplements from other suppliers online. \n\nIs there anyway they could survive going forward? I couldn’t imagine anyone would come in to buy them out.",
        "subreddit": "stocks",
        "title": "GNC",
        "url": "https://www.reddit.com/r/stocks/comments/h0cmh5/gnc/",
        "created": 1591829686.0
    },
    {
        "author": "imattractedtodcfs",
        "created_utc": 1591349366,
        "id": "gx1crx",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "[$GME] [6/5/20] \"Despite Gamestop's irrationality over the last 6 months, there is rationality to the likelihood of a continued short-term decline.\"",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gx1crx/gme_6520_despite_gamestops_irrationality_over_the/",
        "created": 1591378166.0
    },
    {
        "author": "masyahmi",
        "created_utc": 1591623248,
        "id": "gyzf3g",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "\nIntrinsic value refers to the true value of a business. This essentially means, as Warren Buffett says in the Berkshire Hathaway owners manual “Intrinsic value is an all-important concept that offers the only logical approach to evaluating the relative attractiveness of investments and businesses. \n\nIntrinsic value can be defined simply: It is the discounted value of the cash that can be taken out of a business during its remaining life. \n\nThe calculation of intrinsic value, though, is not so simple. As our definition suggests, intrinsic value is an estimate rather than a precise figure, and it is additionally an estimate that must be changed if interest rates move or forecasts of future cash flows are revised.”\n\nThe BIG QUESTION is HOW do we calculate intrinsic value? We know for a fact that no one in the world knows when a company will end or how long it will last.\n\nThere are two methods to evaluate intrinsic value.\n\nNow lets begin with the second method, which is famously known as the cigar-butt style.  \n\nThis method is usually used at companies that do not have good management or on the verge of going bankrupt which was Ben Graham’s style (and initially Buffett’s). Benjamin Graham (known as the father of value investing) was Warren Buffett’s mentor before he past in September 21, 1976. It is called the “cigar-butt” style of investing as it essentially requires one to pick up discarded business cigar butts laying on the side of the road, selling them at deep discounts to book value with one good puff left in them. Ben Graham looked for “net-nets” or businesses priced below their net current assets which is current assets minus total liabilities. \n\nAs such, you can take advantage of the margin between liquidation value (intrinsic value) and market capitalization.  This is also known as Margin of Safety. A good guideline for Margin Of Safety is between 30%-50% for this method of evaluating intrinsic value which is known as Cigar-Butt Style. The range depends on how confident you as a value investor are in the company itself.   \n\nThe Formula is:  \n\nIntrinsic Value = Current Asset - Total Liabilities  \n\nAt the time of this blog, GameStop is an AMAZING example.  \n\nThe Current Asset as at 30/12/2019: $ 3,127,700,000  \n\nThe Total Liabilities as at 30/12/2019: $ 2,708,100,000  \n\nIntrinsic Value: $ 419,600,000\n\n  \n\nWith this, we can get the margin of safety with the formula:\n\nMargin Of Safety = 1 - (Market Capitalization / Intrinsic Value) \n\nIntrinsic Value: $ 419,600,000\n\nMarket Capitalization: $ 248,527,000\n\nMargin Of Safety: 40.77%\n\nDo take note that Warren Buffett no longer uses this method as he prefers to “buy great businesses at a fair price than a a good business at a wonderful price.” Another reason, is that with such a large amount of capital (over $100 Billion), and this method often is used at businesses that have a market capitalization approximately around the millions of dollars. it would not make sense as even if he gets a return of 50% on his investment. it would have almost zero impact on the return of his overall capital.",
        "subreddit": "ValueInvesting",
        "title": "How Warren Buffett Invests Early in His Career",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/gyzf3g/how_warren_buffett_invests_early_in_his_career/",
        "created": 1591652048.0
    },
    {
        "author": "farflungshow",
        "created_utc": 1591797084,
        "id": "h0bdz3",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Gamestop short squeeze starting now",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/h0bdz3/gamestop_short_squeeze_starting_now/",
        "created": 1591825884.0
    },
    {
        "author": "FrostedSapling",
        "created_utc": 1591797915,
        "id": "h0bnxc",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "GME EPS of $-1.61 when expected was $-.46 ¯\\_(ツ)_/¯",
        "url": "https://i.redd.it/ucar8vwxa3451.jpg",
        "created": 1591826715.0
    },
    {
        "author": "X_Red_Sun_X",
        "created_utc": 1591807438,
        "id": "h0emay",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "GameStop goes up after bad earnings",
        "url": "https://www.reddit.com/r/stocks/comments/h0emay/gamestop_goes_up_after_bad_earnings/",
        "created": 1591836238.0
    },
    {
        "author": "teslaputsordie",
        "created_utc": 1591762457,
        "id": "h03j05",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "The biggest squeeze of the century or the biggest blue balls of my life: GameStop DD inside",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/h03j05/the_biggest_squeeze_of_the_century_or_the_biggest/",
        "created": 1591791257.0
    },
    {
        "author": "70238",
        "created_utc": 1591707458,
        "id": "gzmmmm",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "$GME to 20 by Friday",
        "url": "https://i.imgur.com/fvSgOqq.jpg",
        "created": 1591736258.0
    },
    {
        "author": "edgarzev",
        "created_utc": 1591751846,
        "id": "h00utz",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Now that GameStop just had its earnings, what are the chances of a imminent short squeeze?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/h00utz/now_that_gamestop_just_had_its_earnings_what_are/",
        "created": 1591780646.0
    },
    {
        "author": "tendeeznuts",
        "created_utc": 1592347683,
        "id": "haepj1",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "RobinHood",
        "title": "GME - DD on The Big Short ( Squeeze! )",
        "url": "https://www.reddit.com/r/RobinHood/comments/haepj1/gme_dd_on_the_big_short_squeeze/",
        "created": 1592376483.0
    }
]