[
    {
        "author": "wizzo95",
        "created_utc": 1589666263,
        "id": "gl38aa",
        "num_comments": 87,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\nAnyone else think a crash is to come and plans to take short positions in stocks? I think a crash is coming. I think once the crash comes it may take years for the stock market to rebound to current levels. Unemployment is soaring, a vaccine seems like will take a long time to develop, and the unprecedented government stimulus payments (unemployment, PPP, ect) will eventually run out. Heck! The economy is in shambles even with these payments (things will be way worse once the run out). \n\nI do not know when it is going to crash, but I plan to take short positions on Monday. I plan to short stocks and buy put options in others.\n\nI will do some research tomorrow but have identified the below stocks as potential shorts. What are you shorting? Do you agree or disagree with any of the below?\n\n*Penn National Gaming, Virgin Space, Best Buy, Lululemon, Dillards, Square, Deutshe Bank, Wynn Resorts, National Retail Properties, Kimco Realty, Frankline Financial Network, Callaway, Simon Property Group, Vornado Real Estate Trust, BNY Mellon, JP Morgan, Independent Bank Corp, Sam Adams, American Airlinesm Aramark, Hilton, Booking Holdings, LYV, Credit Acceptance Corp, HSBC,* [*Trip.com*](https://Trip.com)*, Restaurant Brand International, Jack in the Box, Canada Goose, PNC Stock, Lloyds, UBS, Zillow, MGM Resorts, Five Below, Air Lease Corp, PTC, cinemark , Huazhu,* [*Alarm.com*](https://Alarm.com)*, Lyft, IAA Auto Auctions, Westpac, Genuine Parts CO, Hilton Grand Vacations, PK.*",
        "subreddit": "StockMarket",
        "title": "Any bears shorting stocks? What are you shorting?",
        "url": "https://www.reddit.com/r/StockMarket/comments/gl38aa/any_bears_shorting_stocks_what_are_you_shorting/",
        "created": 1589695063.0
    },
    {
        "author": "devandangers",
        "created_utc": 1589428251,
        "id": "gjeqj0",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "TLDR: Biotech industry vets drooling to jump on board of BSGM. Partnered with Mayo Clinic. Vicromax which has shown 98% elimination rate of COVID-19 in Trials. FDA apparel slated for 5/15/20. These Industry vets don’t choose losers. Plans already in motion to spin up a public offering for their COVID-19 Treatment company Vicromax.\n\nBioSig bought an antiviral which has shown great promise. Their study was just published in [medical journal](https://f1000research.com/articles/9-361). They submitted to be [approved for FDA Phase 2](https://www.biosig.com/news-media/press-releases/detail/188/mayo-clinic-preparing-to-commence-phase-ii-fda-clinical) Trials on April 16th. The FDA has 30 days to object or they are automatically approved to continue.\n\nOnce an IND is submitted, the FDA has 30 days to object to the IND or it automatically becomes effective and clinical trials may begin. If the FDA detects a problem, it may place a clinical hold on the IND, prohibiting the start of the clinical studies until the problem is resolved.\n\n**THE TEAM.**\n\no **Biotech Hall of Famer Dennis Purcell Founder of Aisling Capital** &amp; JPM Healthcare Conf in SF (when he was at H&amp;Q) Joins Yucaipa's Quintero ($35 Bill in M&amp;A) &amp; Sam Navarro (40 huge healthcare deals) for VCLR exit strategies/monetization\n\no **CEO Mayo Clinic**\n\no **Chairman Mayo Clinic COVID Task force** (expert in virus-host interactions chose Vicromax out of 70 apps to Mayo to bePrincipal Investigator)\n\no **Ex head of $180 billion Merck** Vaccines responsible 1 of the biggest vaccine blockbusters in history Gardasil 4 HPV\n\no **Ex-Celgene CMO responsible for number 1 cancer drug ever &amp; IND &amp; early trial designs for $12 bill Otezla just sold to AMGN**\n\no **Vice-Chairman NASDAQ**\n\no **Ex Wilmington Trust Chairman of Board**\n\no **PWC Life Sciences CEO of Year &amp; E&amp;Y Entrepreneur of Year**\n\no **Head of Morgan Stanley M&amp;A dept &amp; founder MS biotech practice Michael Schmertzler**\n\no **AZN EVP Global Commercial** **Ops**=&gt;**commercialized 10 blockbuster brands**, each $1 bill in sales\n\nTIMELINE - The Past Month Since they submitted to FDA.\n\n*April 21, 2020*\n\n**Anthony (‘Tony’) Zook**\n\n[**\\[LinkedIn\\]**](https://www.linkedin.com/in/tony-zook-10421566/)\n\nPR: “Brings to ViralClear a wealth of **commercialization experience in the pharmaceutical industry”**\n\n**AstraZeneca**\n\n· Executive Vice President of **Global Commercial Operations** from 2010 to 2013\n\n· President and CEO of the North American division from 2007 to 2010\n\n· President of Medimmune, the wholly owned biologics division of AstraZeneca, from 2008 to 2010\n\n· Under Mr. Zook’s leadership, **AstraZeneca commercialized ten blockbuster brands, each in excess of $1 billion in sales**.\n\n· Along with the CEO, CFO, and Head of R&amp;D, Mr. Zook sat on the Portfolio Investment Board (PIB), which **set and approved the overall strategy for Research and Development and allocated resources by therapeutic area**.\n\n**Served or Continues on Other Boards**\n\n· AltheRx,\n\n· Inhibikase,\n\n· Rib-X Pharmaceuticals,\n\n· National Pharmaceutical Council\n\n· PhRMA\n\n· Pennsylvania Division of the American Cancer Society\n\n· Frostburg State University (alma mater)\n\n**Tony Zook**: “I have been very impressed with what the ViralClear team achieved in just one month. The strong fundamentals of its product candidate, the safety it demonstrated in the previous trials and the recently secured clinical support of Mayo Clinic are very important elements needed to help take the product into FDA-approved clinical trials and then, hopefully, upon FDA approval, to the commercial market. I look forward to lending my expertise and see this company advance in the coming months.”\n\nMay 5, 2020\n\nDennis Purcell\n\n[\\[LinkedIn\\]](https://www.linkedin.com/in/dennis-purcell-96aab367/)\n\nPR: “Mr. Purcell brings to ViralClear a wealth of life science and investment experience.”\n\n· Mr. Purcell is the Founder of Aisling Capital LLC and previously served as Senior Managing Partner.\n\no Aisling Capital (formerly Perseus-Soros Bio-pharmaceutical Fund), formed in 2001, is a leading venture capital fund that has invested over $2 billion in emerging biopharmaceutical companies globally which has helped the industry to mature and become the main source of new innovative drugs and devices being used to treat diseases today.\n\n· Prior to Aisling Capital, Mr. Purcell served as Managing Director of the Life Sciences Investment Banking Group at Chase H&amp;Q (formerly Hambrecht &amp; Quist, “H&amp;Q”).\n\no While at H&amp;Q, Mr. Purcell was directly involved with over two hundred completed transactions and supervised over $10 billion of financing and advisory assignments in the Life Sciences industry.\n\n· Prior to joining H&amp;Q, Mr. Purcell was a Managing Director in the Healthcare Group at PaineWebber, Inc.\n\n· Mr. Purcell is a frequent commentator on the industry\n\n· Has been honored in the “Biotech Hall of Fame” by Genetic Engineering News,\n\n· Named to the Biotechnology All-Stars list by Forbes ASAP,\n\n· Honored as one of the top 50 Irish-American businessmen\n\n· Cited as one of the top 100 contributors to the biotechnology industry.\n\nDennis Purcell: “ViralClear assembled a team with a highly impressive collective skillset to address a very pressing public health issue. I look forward to joining the management and my fellow Board members as the Company seeks to translate the strong in vitro findings into clinically meaningful results.”\n\n*May 7, 2020*\n\n**Michael Schmertzler**\n\n**Currently**\n\n· **Chairman of the board of directors of PTC Therapeutics**, Inc. since 2004, where he was a founding institutional investor.\n\n· Independent director of Lehman Commercial Paper, Inc., the largest subsidiary of the liquidating post-bankruptcy Lehman Brothers estate.\n\n· Since 1998, he has also **taught private equity courses at Yale University**.\n\n· He has been actively involved in biotechnology as an investor and investment banker since **founding Morgan Stanley’s biotechnology industry practice in 1989**.\n\n· He is also now a Director of privately held SHY Therapeutics\n\n**Previously**\n\n· Served as CEO of a Yale University biotechnology spin-off and as a director of Cytokinetics and Idenix.\n\n· President of the **Morgan Stanley Leveraged Capital Funds** and later Co-Head of Credit Suisse First Boston Equity Partners.\n\n· **Managing Director in the Mergers and Acquisitions Department of Morgan Stanley** and headed its global insurance industry practice.\n\n· **Head of international investment banking** and capital markets of Shearson Lehman Brothers and, prior to its acquisition in 1984 by American Express, was the Chief Financial Officer and an investment banker at Lehman Brothers.\n\n**Has served as a director or lead investor at**\n\n· Cain Chemical\n\n· Colt Industries\n\n· Segway\n\n· Other industrial and technology companies.\n\n**Michael Schmertzler**: “I am very pleased to have the opportunity to contribute to the development of this young anti-viral company. The merimepodib findings to date are compelling, and I look forward to working with the ViralClear team at such a pivotal time for the global community.”\n\nDisclosure: There was a Article written on seeking alpha by a couple of admitted douche shorts, but ask yourself, there is no way these dudes would waste their time on something that wasnt worth their investment.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n12.50c 5/15\n\n12.50 6/19\n\n12.50 7/19",
        "subreddit": "wallstreetbets",
        "title": "BSGM - Quietly Building an Avengers Lineup, Board Stacking the past two weeks. FDA Clearance on 98% effective Covid-19 Treatment by 5/15/20.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gjeqj0/bsgm_quietly_building_an_avengers_lineup_board/",
        "created": 1589457051.0
    },
    {
        "author": "wizzo95",
        "created_utc": 1589672469,
        "id": "gl4xha",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\nAnyone else think a crash is to come and plans to take short positions in stocks? I think a crash is coming. I think once the crash comes it may take years for the stock market to rebound to current levels. Unemployment is soaring, a vaccine seems like will take a long time to develop, and the unprecedented government stimulus payments (unemployment, PPP, ect) will eventually run out. Heck! The economy is in shambles even with these payments (things will be way worse once the run out).\n\nI do not know when it is going to crash, but I plan to take short positions on Monday. I plan to short stocks and buy put options in others.\n\nI will do some research tomorrow but have identified the below stocks as potential shorts. What are you shorting? Do you agree or disagree with any of the below?\n\n*Penn National Gaming, Virgin Space, Best Buy, Lululemon, Dillards, Square, Deutshe Bank, Wynn Resorts, National Retail Properties, Kimco Realty, Frankline Financial Network, Callaway, Simon Property Group, Vornado Real Estate Trust, BNY Mellon, JP Morgan, Independent Bank Corp, Sam Adams, American Airlinesm Aramark, Hilton, Booking Holdings, LYV, Credit Acceptance Corp, HSBC,* [*Trip.com*](https://trip.com/)*, Restaurant Brand International, Jack in the Box, Canada Goose, PNC Stock, Lloyds, UBS, Zillow, MGM Resorts, Five Below, Air Lease Corp, PTC, cinemark , Huazhu,* [*Alarm.com*](https://alarm.com/)*, Lyft, IAA Auto Auctions, Westpac, Genuine Parts CO, Hilton Grand Vacations, PK.*",
        "subreddit": "stocks",
        "title": "Anyone bearish and shorting stocks? What are you shorting?",
        "url": "https://www.reddit.com/r/stocks/comments/gl4xha/anyone_bearish_and_shorting_stocks_what_are_you/",
        "created": 1589701269.0
    },
    {
        "author": "zman1175",
        "created_utc": 1588356780,
        "id": "gbn8kn",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "PTC: Long-Term IoT And AR Stock For The 2020s (NASDAQ:PTC)",
        "url": "https://seekingalpha.com/article/4341967-ptc-long-term-iot-and-ar-stock-for-2020s",
        "created": 1588385580.0
    }
]