[
    {
        "author": "BezosButthole",
        "created_utc": 1577997747,
        "id": "ej3xwd",
        "num_comments": 299,
        "num_crossposts": 0,
        "selftext": "I've been watching this site for forever and started trading in October with $5,000 and turned it into $40,000 trading earnings and Dis in Nov. It was awesome and I felt badass. \n\nAround Dec 1st I told my gf I would stop trading since I was having sleepless nights, stress headaches, and was somewhat obsessed with this shit. I had to get back in.... and that bad karma made me lose on almost every trade and added $30,000 of real money (to get above $25k) which I lost as well and am down currently $32,000 of real money in additions to all the gains from November. \n\nHere are some highlights: \n\nLulu earnings Dec 11th: I felt it would do well on earnings and lost $22,050 on a $25,000 yolo 10 minutes after purchasing. (My first big guh moment and I f'ing KNEW not to do this) \n\nNVDA Dec 23rd: Bought $25,000 of 1/10 calls that dipped 30 minutes after buying... got weak hands... and lost $13,384. (I bought at the ATH at the time and felt it would just keep going up) \n\nAMD Dec 26th: Bought $15,000 of AMD $50 calls at $47.10 (1/3 and 1/10)... dipped immediately after buying... got weak hands a couple days ago on Dec 30th... and sold around $45.80 for a $11,800 loss. Now I see that fucker is up around $49 today and figured it might since $50 seems doable next week. Fuck me and my shitty decisions... I knew I should have held until today with CES next week but Trump bombing Iraq got me twitchy and I just wanted out. (My $3k would be worth $18k if I would have stayed in one more day) \n\nThe highlight of November was selling my $28k of DIS fd's... 2 hours prior to the stock rocketing up once subscriber numbers were released. I took a $9,000 loss instead of a $150k+ gain. I still got in afterwards and it went up $40k.... which I held until it was a $12k gain and sold. (Selling 368 contracts 2 hours before subscriber numbers came out still makes my heart want to explode) \n\nWell that's my story. Not sure why I am posting but it kinda feels therapeutic in a way to let this shit out. I haven't told anyone since 1. Most my friends wouldn't understand 2. My gf would probably be pissed I lied to her. I have $3,200 left in my restricted from purchasing Robinhood account that I am transferring over to WeBull and the funds should be there in 2 days. I am thinking with earnings this month I can turn this $3,200 around with some smart purchases instead of yolo'ing stupidly. But maybe fucking not. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n [https://imgur.com/gallery/4kVnfVS](https://imgur.com/gallery/4kVnfVS)",
        "subreddit": "wallstreetbets",
        "title": "AMA: I am the world's worst trader - ASK ME ANYTHING",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ej3xwd/ama_i_am_the_worlds_worst_trader_ask_me_anything/",
        "created": 1578026547.0
    },
    {
        "author": "HappyCamper1980",
        "created_utc": 1579105078,
        "id": "ep4bok",
        "num_comments": 110,
        "num_crossposts": 0,
        "selftext": "After many years of autistic posting and taking huge ass losses in NVDA last year I finally made it to level 7.  https://imgur.com/a/UHT9pof  Couldn't have done it without you retards (also boring shit like COST AAPL NOW DIS HD GOOG FAST).  Thanks!",
        "subreddit": "wallstreetbets",
        "title": "After many years of autistic posting",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ep4bok/after_many_years_of_autistic_posting/",
        "created": 1579133878.0
    },
    {
        "author": "philmacrack123",
        "created_utc": 1578000426,
        "id": "ej4lcm",
        "num_comments": 80,
        "num_crossposts": 0,
        "selftext": "Alright you fucking autists, amd gained a bit more today but we have ces coming up next week and if I know anything, I know that the fucking nerds are gonna cream their pants over any thing amd announces and the stock will moon.\n\nFuck your \"high P/E\" bullshit, who cares, stonks go up not down. A high p/e is just a big number and we like big numbers here\n\nAMD will announce zen3 for laptops and other mobile devices, our Lord and savior Lisa su will tell us how much she loves fucking the CEO of TSMC while Intel watches further cementing them as the cuck to AMD, soon enough NVIDIA will be shitting their pants as amd announces a high end GPU to compete at half the price of the 2080ti and it'll moon more. All in AMD 1/10 calls thank me later when your banging hookers doing lines of coke off their asses while the captain of your yacht is watching.",
        "subreddit": "wallstreetbets",
        "title": "AMD to the fucking moon",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ej4lcm/amd_to_the_fucking_moon/",
        "created": 1578029226.0
    },
    {
        "author": "JTW318",
        "created_utc": 1579688774,
        "id": "esa34w",
        "num_comments": 49,
        "num_crossposts": 0,
        "selftext": " [https://finance.yahoo.com/news/amd-says-nvidia-killer-graphics-142010254.html](https://finance.yahoo.com/news/amd-says-nvidia-killer-graphics-142010254.html) \n\n&amp;#x200B;\n\nok thanks",
        "subreddit": "wallstreetbets",
        "title": "AMD TO THE MOON",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/esa34w/amd_to_the_moon/",
        "created": 1579717574.0
    },
    {
        "author": "succxss",
        "created_utc": 1579189274,
        "id": "epkyv5",
        "num_comments": 45,
        "num_crossposts": 0,
        "selftext": "Hey Su Bae, I was wondering if you could be my date to my winter work party. I'm a 22 year old intern and I'd love to show up with you in front of my IT guy who installed a shitty Nvidia GPU on my computer rather than opening his fucking eyes and seeing the light \n\nNot to boast but my Volvo will certainly be very comfortable for you to ride in and my apartment also has a mini fridge I've fully stocked with Bang Energy and that's it\n\nEmail me your acceptance at ChokeMeLisa@gmail.com",
        "subreddit": "wallstreetbets",
        "title": "Lisa Su, CEO and President of Advanced Micro Devices, hear my plea",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/epkyv5/lisa_su_ceo_and_president_of_advanced_micro/",
        "created": 1579218074.0
    },
    {
        "author": "Fargraven",
        "created_utc": 1578157780,
        "id": "ejz8c0",
        "num_comments": 35,
        "num_crossposts": 0,
        "selftext": "P/E of 237, and their biggest competitors are Intel and Nvidia, both of which have more cash to spend on marketing and R&amp;D, as well as a much stronger market presence.",
        "subreddit": "stocks",
        "title": "Why are investors so bullish on $AMD?",
        "url": "https://www.reddit.com/r/stocks/comments/ejz8c0/why_are_investors_so_bullish_on_amd/",
        "created": 1578186580.0
    },
    {
        "author": "CogitoErg0Sum",
        "created_utc": 1578246474,
        "id": "ekg9xw",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "Who do you guys have as the biggest gainers? \n\nAMD been on a run and Su Baes 🅱️ussy just won’t quit. \n\nNVDA will probably announce something good. \n\nTSLA probably does guerrilla marketing. \n\nTSM makes all of their chips anyways, but doesn’t move with news as much as others. 5nm architecture and commitment to more 7nm NVDA stuff most likely. \n\nI got 1/10 TSM 59 Calls, and any positive movement in AMD I’ll probably bite.",
        "subreddit": "wallstreetbets",
        "title": "CES Options Thread",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ekg9xw/ces_options_thread/",
        "created": 1578275274.0
    },
    {
        "author": "googlme",
        "created_utc": 1577930384,
        "id": "eiri78",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "Hi r/stocks, \n\nlast year I created a similar thread. ([https://www.reddit.com/r/stocks/comments/anbr7e/first\\_year\\_into\\_stocks\\_summary\\_all\\_tech/](https://www.reddit.com/r/stocks/comments/anbr7e/first_year_into_stocks_summary_all_tech/)). I still follow buy and hold strategy and only sell stocks when I don't like certain changes in a company. Sometimes those decisions paid off, sometimes (AAPL) I missed out a bit (nevertheless I don't regret those decisions). \n\nAt some point I was down 30-50% on both NVDA and TSLA, I do strongly believe in both those companies and will not sell either of them in the next 5y for sure. Hitting a bigger number on the portfolio I started diversifying a bit as well. (MA,V,MRK)\n\nStrategy for 2020 is pretty simple for me, I'll invest mostly in AI and cybersececurity companies: First priority is to add a ton of Tencent. Highly recommend the book: \"AI Superpowers Book by Kai-Fu Lee\". imo there is no way around AI and probably Asia will be in the driving seat for the first time in 5-10y.\n\n**Be patient, don't panic sell, it might be swingy here and there but if you invest in strong companies it will pay off.** \n\nCurrent portfolio:\n\n* TSLA +56%\n* CRM +46%\n* FTNT +37%\n* MSFT +35%\n* AMZN +31%\n* MRK +9%\n* MA + 9%\n* NNND +8%\n* NVDA +7%\n* V +1%\n\n[https://imgur.com/a/6RJNKXU](https://imgur.com/a/6RJNKXU)",
        "subreddit": "stocks",
        "title": "second year into stocks - mostly tech (summary)",
        "url": "https://www.reddit.com/r/stocks/comments/eiri78/second_year_into_stocks_mostly_tech_summary/",
        "created": 1577959184.0
    },
    {
        "author": "t3chb1zn3ss",
        "created_utc": 1580458094,
        "id": "ewl7aj",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "If you had 25K to enter the market tomorrow, what would you invest in?  Why?\n\nI'm interested in seeing what the responses will be.\n\nThese are the stocks I've been swinging lately:\n\nAAPL, ACN, ADSK, AMD, AMZN, BABA, BR, BZUN, C, COLL, CMG, CRM, CSCO, CTSH, DIS, DOX, EWZ, FB, GE, GOOGL, GPRO, GS, HTBX, MSFT, NET, NFLX, NKE, NVDA, OKTA, SBUX, SEIC, SHOP, SNA, SPOT, SQ, TEAM, TSLA, TTWO, TWTR, UBER, UPWK, V, WDAY, WORK, YEXT, ZEN, and ZS.\n\nMy largest position is in Apple, which I continue to add to and will hold until it reaches $1K per share.  At that point, I'll decide whether to sell.  $1K is a long ways away .... or is it?",
        "subreddit": "stocks",
        "title": "If you had 25K to enter the market tomorrow, what would you invest in?",
        "url": "https://www.reddit.com/r/stocks/comments/ewl7aj/if_you_had_25k_to_enter_the_market_tomorrow_what/",
        "created": 1580486894.0
    },
    {
        "author": "brosephjones77",
        "created_utc": 1578953858,
        "id": "eobepp",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "Here is estimate of money I want to invest in each stock:\n\nSTOCKS-\n——————————————\n\nVerizon (VZ)- $600\n\nVisa (V)- $800\n\nApple (AAPL)- $1,500\n\nAmazon (AMZN) - $1,900\n\nMicrosoft (MSFT)- $4,000\n\nTesla (TSLA)- $1,500\n\nAbbievie (ABBV)- $500\n\nChase (JPM)- $1,000\n\nSkyworks (SWKS) - $500\n\nCRISPR (CRSP) - $500\n\nNvidia (NVDA) - $750\n\nAlphabet (GOOGL)- $1,400\n\n——————————————\n\nTotal Cost ~ $15,000\n\nGood choices? What would be the best way to cut $3000 from this list? I only have $12,000 to invest",
        "subreddit": "stocks",
        "title": "How should I cut $3000 from this list!",
        "url": "https://www.reddit.com/r/stocks/comments/eobepp/how_should_i_cut_3000_from_this_list/",
        "created": 1578982658.0
    },
    {
        "author": "OmenReader",
        "created_utc": 1579838889,
        "id": "et51jv",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "Okay so stonks going up making the markup monsters Nvidia and Intel start to sweat. Being tendiless for years investing in team Red seems fitting. Most of my PC's have been amd based due to price. Now the silicon gods bleed from their $800 flagships. Prices drop making blue and green easier to get. Is it too late, did they take the gaming enthusiasts tendies for too long? Time will tell.",
        "subreddit": "wallstreetbets",
        "title": "AMD gains are win/win for gamers",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/et51jv/amd_gains_are_winwin_for_gamers/",
        "created": 1579867689.0
    },
    {
        "author": "Handapandaabanana",
        "created_utc": 1579064570,
        "id": "eoxs65",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "I grabbed:\n\nAAPL @ 187.90 - told myself next time it went under 200 id get in on it \n\nPLUG @ 2.11 - one of the leaders in replacing lead-acid batters and installing hydrogen and fuel-cell systems\n\nAMD @ 33.50 - one of the only real threats to Intel and Nvidia and their CPUs and GPUs are game changers\n\nNTDOY @ 41.90 - love the company, this was more just a fun one to get in on while I’m young and see where it goes \n\nACB @ 4.00 - ugh, but maybe in 10 years\n\nHEXO @ 3.29 - also ugh, but maybe in 11 years",
        "subreddit": "stocks",
        "title": "Excluding TSLA (for variety’s sake), what 2019 pickups are you planning on holding through 2020?",
        "url": "https://www.reddit.com/r/stocks/comments/eoxs65/excluding_tsla_for_varietys_sake_what_2019/",
        "created": 1579093370.0
    },
    {
        "author": "Ant0n61",
        "created_utc": 1580178804,
        "id": "euz42a",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "BUYING.\n\nIt's a bull market after all. A flu isn't going to stop it. So the wise thing to do would be buy the dips.\n\nWith AAPL having gapped down, i rescind my earlier weekend call for puts into ER and bought calls instead, it held with the market, anyone who was going to sell the news on ER did this morning. Strong hands remain and i doubt guidance could be lackluster enough to impede on blockbuster quarterly sales. \n\nI have calls on:\n\nAAPL NVDA MSFT SQ\n\nand puts on:\n\nTSLA",
        "subreddit": "wallstreetbets",
        "title": "Last time I checked, dips are for...",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/euz42a/last_time_i_checked_dips_are_for/",
        "created": 1580207604.0
    },
    {
        "author": "mytwm",
        "created_utc": 1578337518,
        "id": "ekykey",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "## 🚘 Tesla reported record production and delivery numbers\nIn the fourth quarter, Tesla achieved record production of almost 105,000 vehicles and record deliveries of approximately 112,000 vehicles. In 2019, Tesla delivered approximately 367,500 vehicles, 50% more than the previous year. While the results were in line with Tesla’s full year guidance, they beat analyst estimates.\n\n[Tesla financial scores](https://inspectcompany.com/tesla):\n* Profitability: **1**/10\n* Operating Efficiency: **1.2**/10\n* Liquidity: **2.4**/10\n* Solvency: **1.9**/10\n\n## 🎮 NVIDIA announced new G-SYNC Esports Displays\nNVIDIA unveiled new G-SYNC® displays with a 360Hz refresh rate, providing esports enthusiasts and competitive gamers with the fastest gaming displays ever made. At 360Hz, game frames are displayed once every 2.8ms — up to 6X faster than traditional gaming displays and TVs.\n\n[NVIDIA financial scores](https://inspectcompany.com/nvidia):\n* Profitability: **8.2**/10\n* Operating Efficiency: **7.9**/10\n* Liquidity: **9.9**/10\n* Solvency: **9.2**/10\n\n## 🛫 Lockheed Martin delivered 134 F-35s in 2019, exceeding annual commitment\nLockheed Martin delivered a total of 134 F-35 aircraft on 2019, exceeding the joint government and industry delivery goal of 131 aircraft. 134 deliveries represent a 47% increase from 2018 and nearly a 200% production increase from 2016. Next year, Lockheed Martin plans to deliver 141 F-35s and is prepared to increase production volume year-over-year to hit peak production in 2023.\n\n[Lockheed Martin financial scores](https://inspectcompany.com/lockheed-martin):\n* Profitability: **7.9**/10\n* Operating Efficiency: **5.8**/10\n* Liquidity: **6.1**/10\n* Solvency: **4.2**/10\n\n## 📺 Amazon announced an expansion of the Fire TV Edition program\nAmazon announced the expansion of the Fire TV Edition program, delivering a richer experience and more opportunities for developers, operators, device makers and manufacturers across multiple categories including automotive, smart TVs, soundbars and streaming media players. Fire TV has passed more than 40 million active users, and customers globally have access to tens of thousands of channels, apps, Alexa skills and more. With this expanded Fire TV Edition, it will be even easier for device makers to integrate Fire TV into their products, with new tools and services for each category that will enable companies to bring tailored entertainment experiences and great content to their customers.\n\n[Amazon financial scores](https://inspectcompany.com/amazon):\n* Profitability: **5.1**/10\n* Operating Efficiency: **2.5**/10\n* Liquidity: **3.7**/10\n* Solvency: **5.6**/10\n\n## ☕️ Farmer Connect uses IBM Blockchain to bridge the gap between consumers and smallholder coffee farmers\nAt the CES 2020, Farmer Connect and IBM announced a new consumer mobile application called “Thank My Farmer,” which will allow coffee drinkers to trace their coffee to understand its quality and origin, and even support the farmer who grew the beans. Farmer Connect is a traceability platform powered by IBM Blockchain designed to help increase traceability, efficiency and fairness in the coffee supply chain.\n\n[IBM financial scores](https://inspectcompany.com/ibm):\n* Profitability: **7.2**/10\n* Liquidity: **4.6**/10\n* Solvency: **3.7**/10",
        "subreddit": "StockMarket",
        "title": "What's happening this week? Headlines on Tesla, NVIDIA, Lockheed Martin, Amazon and IBM",
        "url": "https://www.reddit.com/r/StockMarket/comments/ekykey/whats_happening_this_week_headlines_on_tesla/",
        "created": 1578366318.0
    },
    {
        "author": "thehero7",
        "created_utc": 1579813068,
        "id": "eszbbo",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "Hello everyone\n\nYou could say i am a fund manager at 21 years old, i came here to discuss something controversial you could say.\nLet me explain!\nI recently switched broker and opened up an account on eToro and soon i found out that people can copy my investments and i can get paid monthly for it. \n\nThe thing here is that you invest your own money and if people like your performance and portfolio they can choose to copy you. That basically makes me a fund manager but the thing is that i have to perform well in order for people to copy me and meet the criteria to get paid by the company (it doesnt cost anything for anyone to copy me).\n\nI started to pursue this thing around the end of 2019. I rebalanced my whole portfolio in order to meet certain criteria while keeping me invested in what i believe in.\n\nI have 100+ people copying me with around 80.000$ in Assets Under Management and returns so far for the year are at +14%\n\n\nAs of today my portfolio is :\n30.76% Tesla\n18.63% Facebook\n17.47% Amazon\n10.90% Uber\n9.40% Nvidia\n8.56% Disney\n4.83% cash\n\nNow the million dollar question:\nI am a long term investor but man Tesla has gone up to the moon. If it was only me i would not mind holding through the earnings but now 109 people are essentially invested in me and hurting my current profitability will result in people stop copying me (from my experience so far people are way too fast to pull the trigger in and out of you).\n\nTesla has to deliever a crazy earnings report in order for the stock to not fall dramatically.\nOn the one hand i dont want to sell anything because whatever the report is the long term dream of the company is more alive than ever.\n\nOn the other hand i want to cash out around 5-10% of my stake just in case the stock falls like 20% on earnings. If i sell some shares and remain with a 20% stake and the stock falls -20% the overall impact will be -4% on my portfolio which is like the worst case senario in my head. \n\nPersonally i dont want to sell but in my situation i have to keep in mind other people's \"risk-tolerance\" , most of them are short term in nature and if the worst happens they will pull out of me immidiatelly.\n\nWhat would you do guys if you were in my shoes?\n\nThanks a lot for your time!\n\nTl:dr : Should i reduce my stake in Tesla to 20% just in case? (Other people's money involved)",
        "subreddit": "investing",
        "title": "I need some help regarding \"other peoples money\"",
        "url": "https://www.reddit.com/r/investing/comments/eszbbo/i_need_some_help_regarding_other_peoples_money/",
        "created": 1579841868.0
    },
    {
        "author": "Dismiss",
        "created_utc": 1580041304,
        "id": "eu61ml",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "You have to be literally autistic not to go all-in on these guys. Main supplier of AMD/AAPL/NVDA. Pretty much the main supplier for everyone aside from INTC or some shit, and who gives a shit about those clowns who can't even break 10nm. It's rumored they'll be manufacturing with TSMC too.\n\n5nm/3nm? Only 2 boys going hard on this, globalfoundries and TSMC. What the fuck is even a goldenfoundry, imagine actually paying Singaporean wages when you can pay Taiwanese wages.  Also Samsung apparently has some foundry or some shit but who cares about those gooks. \n\nEDA big boys - CDNS and SNPS - pretty much decide the market and no one even knows about them. They pretty much engineer the entire back end flow of IC manufacturing. What is their #1 foundry partnership? You guessed it. They don't even use technology libs from other foundries. If their customers go with alternative foundries they will spend millions resolving quality issues related to incompatibility between tools.\n\nWhen market goes into 5nm/3nm, 2-3 years from now, I bet these niggas at TSMC will completely dominate the market. Oh and coronavirus doesn't affect it, Taiwan is a literal island, but people will be scared of it because it's China, so I'm betting FEB/MAR will be the best months to buy, then it's moon only.",
        "subreddit": "wallstreetbets",
        "title": "$TSM",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eu61ml/tsm/",
        "created": 1580070104.0
    },
    {
        "author": "unbeat",
        "created_utc": 1578635723,
        "id": "emmrf2",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Nvidia mellanox deal with china should be approved anytime soon. Nvidia will control the entire data centers with ARM CPU. I would recommended buying as much as you can. Once they control this they will have a lead in all AI technologies in the future.",
        "subreddit": "wallstreetbets",
        "title": "Nvidia Mellanox Deal",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/emmrf2/nvidia_mellanox_deal/",
        "created": 1578664523.0
    },
    {
        "author": "omen_tenebris",
        "created_utc": 1578139187,
        "id": "ejvui0",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "Indexes that include AMD, Intel, Nvidia, TSMC, Samsung etc etc etc etc etc\n\n&amp;#x200B;\n\ngoogle didn't help",
        "subreddit": "investing",
        "title": "is there an index fund for the semiconductor industry?",
        "url": "https://www.reddit.com/r/investing/comments/ejvui0/is_there_an_index_fund_for_the_semiconductor/",
        "created": 1578167987.0
    },
    {
        "author": "IMeganNicole",
        "created_utc": 1578285138,
        "id": "ekouc8",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "As the title explains, if you were to put money into long dated puts, which company would you bet against in 2020?",
        "subreddit": "wallstreetbets",
        "title": "Long dated puts on AMD, FB or NVDA?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ekouc8/long_dated_puts_on_amd_fb_or_nvda/",
        "created": 1578313938.0
    },
    {
        "author": "OldTrillionaire",
        "created_utc": 1578985613,
        "id": "eohw5u",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "😠😤Lotta bull-bear he-said she-said “theta gang” 🌈-ery  going on when all this shit really matters most. I’m not seeing many well-documented positions. Will update results for inevitable gain/loss porn\n\nMonday: +136.12%\n\nMostly debit spreads, few straddles (aapl)\nTSLA\nNVDA\nAAPL\nPTON\nAPHA\nLMT\nWFC\nNKTR\nAMRN\n\n \nhttps://imgur.com/gallery/QbuSYMh",
        "subreddit": "wallstreetbets",
        "title": "Positions or GTFO",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eohw5u/positions_or_gtfo/",
        "created": 1579014413.0
    },
    {
        "author": "ErikBart23",
        "created_utc": 1579876012,
        "id": "etb373",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "““We think Intel is benefiting from an improving macroeconomic climate versus company-specific improvements at this time,” wrote RBC Capital Markets analyst Mitch Steves, who rates Intel’s stock at underperform but took his price target up to $56 from $48. If his thesis is correct, Steves said Intel would simply be riding a “rising tide” that’s lifting all data-center competitors, and he expects rivals Nvidia Corp. NVDA, +1.12%  and AMD to keep outperforming Intel by picking up share.”\n\nWhen Micron reported earnings in December they announced the bottom of the semiconductor market. And, they believe with their recent expansion in sales that the market it finally turning up due to 5G. With 5G more things are going to go into the cloud than we have now and new businesses will be born from this. You need data centers to power this. Micron makes the drives to hold the data for the data centers. AMD and Intel make the CPUs to process the data. \n\nIntel reported 1 billion in growth from the cycle turning out. Analysts are shrugging their shoulders because the conference call said they will experience a down turn in the second half, which is strange for a company that just beat by 1 billion. The banks grilled Intel about this and they answered that it is due to competition and they made their numbers “conservative.”\n\nAMD has released beefy 64 core processors so much cheaper than Intel and on 7nm technology, which Intel said won’t have until 2021. This is why AWS and Azure and even Google Cloud are buying so many of these processors. They get better margins for their investors and they get better efficiency. If the whole market is going up AMD has the most to gain because of this. \n\nWhat do y’all think?",
        "subreddit": "wallstreetbets",
        "title": "The case for a strong AMD bull run in 2021?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/etb373/the_case_for_a_strong_amd_bull_run_in_2021/",
        "created": 1579904812.0
    },
    {
        "author": "DarthBeast",
        "created_utc": 1579138046,
        "id": "epc04q",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "My holdings include the following:\n\n- SPY\n- MCD\n- AAPL\n- TSLA\n- MSFT\n- FB\n- RH\n- DIA\n- BRK.B\n- UNH\n- V\n- BMY\n- NVDA\n- LHX\n- ARWR\n- HD\n- BABA\n- ESPO\n- SBUX\n- WM\n- TGT\n- M\n- WMT\n- NIKE\n- DIS\n- AIMT\n- RVLV\n- TJX\n- ETSY\n- MRVL\n- MAT\n- AMD\n- ACB\n- ZS\n- MNK\n- MNKD\n- T\n- DLRT\n- BTC\n- ETH",
        "subreddit": "investing",
        "title": "Constructively criticize my holdings",
        "url": "https://www.reddit.com/r/investing/comments/epc04q/constructively_criticize_my_holdings/",
        "created": 1579166846.0
    },
    {
        "author": "Jfontak331",
        "created_utc": 1579703052,
        "id": "escmum",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "I’m 16, I’ve accumulated a couple thousand from working since I was 9. Currently I have my portfolio at 80% ETF (SCHB) and 20% Stocks, (NVDA, CMG, RH). Should I sell my stocks and go 100% ETF? Or sell some ETF and go 50/50?",
        "subreddit": "stocks",
        "title": "Should I invest in stocks or ETFS?",
        "url": "https://www.reddit.com/r/stocks/comments/escmum/should_i_invest_in_stocks_or_etfs/",
        "created": 1579731852.0
    },
    {
        "author": "lime-gt-lemon",
        "created_utc": 1579621505,
        "id": "erwc2r",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "TL:DR at the bottom.\n\nI have been studying options and practicing with paper trading, and I have gotten comfortable with picking successful, modest plays consistently. I'm trying to implement stop orders into my strategy to restrict the option moving against me. Let me give a practical example of a failure this morning.\n\n&amp;#x200B;\n\nOn 01/17/2020, I sold 10 vertical credit spreads for NVDA with strikes of 235|230 for the sell side and buy side respectively. \n\nUnfortunately, I can't see the exact trade price of the options in the TOS account summary, but I know the option had a credit value of .20, so this entire set would net me $200 at the end of the week. This morning NVDA is at $248.5 and the value of this contract was .16. Everything looks good.\n\nSince I'm experimenting (and it's just paper trading), I figured I would sacrifice this trade to try to figure out how stops work in the context of options, so I put in a stop over the weekend for .18.\n\n&amp;#x200B;\n\nMy thinking was, if this contract started to go against me due to NVDA decreasing, the extrinsic value of the options would increase making the value of the contract begin to approach .20. With a stop order of .18, if I sold when the contract reached this value, I would lose almost all of the money I made, but still have enough to cover the $.65/contract closing fee. However, if the contract is going below this value, that's good for me, and I would have no reason to sell.\n\n&amp;#x200B;\n\nThe problem seems to be that due to the nature of a stop, the system saw that .16 was less than .18, and it sold my contracts. In the context of normal stocks, this makes sense, but I wasn't sure of the behavior since with this credit spread an increase in contract value is actually a loss, and a decrease is a gain. Essentially, I didn't know which way the stop was protecting against. Now I do.\n\n&amp;#x200B;\n\n**TL:DR:**\n\nIs there an order that triggers when the contract value is greater than or equal to a certain value instead of less than or equal to? Alternatively, is there a trigger that has the stop associated with a stock price instead of an option contract price? My only thought is that using a limit is the proper way to go, but I'm not sure if there are better methods, since the limit could get blown by fast movement.\n\nThoughts?",
        "subreddit": "options",
        "title": "Need help understanding limits and stops in the context of options (TOS platform)",
        "url": "https://www.reddit.com/r/options/comments/erwc2r/need_help_understanding_limits_and_stops_in_the/",
        "created": 1579650305.0
    },
    {
        "author": "LeonardoDiCarryoohh",
        "created_utc": 1578196707,
        "id": "ek7ole",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Bought 30 shares in Activision blizzard at around 13 dollars a few years back! It's not much but it was my first and only stock! I didn't really think about it until it lost around 40% percent around a year ago. It has been slowly coming back up and they announced some promising stuff - but I'm not sure whether to hold or move on to something else.\n\nI'm currently still in school studying vfx - so I would like to keep my money in something tech related. Looking at nvidia or amd instead.\n\nAlso - is it possible to invest money in epic games? Unreal engine is looking really promising and I use it everyday - I think it has a future in movies as well, so it would be fun to have some money invested in it! I know tencent owns around 40% but I'm not sure about that one - so is there other options?",
        "subreddit": "stocks",
        "title": "Small amount of ATVI keep or sell?",
        "url": "https://www.reddit.com/r/stocks/comments/ek7ole/small_amount_of_atvi_keep_or_sell/",
        "created": 1578225507.0
    },
    {
        "author": "vatdog69",
        "created_utc": 1578612226,
        "id": "emhy13",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "So I started investing about 8 years ago, made a few thousand here and there but also lost the same. Anyways, I was always into shorting and making a few hundred dollars here and there. But 3 years ago I bought NVDA for $117 (100 shares) and I’m up 106%. Ive never held on to a stock this long (aside from losing positions). Should I be selling? Same situation with alibaba, bought when $98 and same situation with intel bought at $30. Ive made a good profit but I’m lost as to when to sell and make my next move vs long these positions as “retirement stocks”. \n \nI’ve researched and what I keep hearing is “it’s up to me” and “it’s up to what my goals are”. I’m 28, soon to be in a relatively higher than average salary job (doctor) and looking for extra revenue.",
        "subreddit": "stocks",
        "title": "When to sell nvda, baba, intel?",
        "url": "https://www.reddit.com/r/stocks/comments/emhy13/when_to_sell_nvda_baba_intel/",
        "created": 1578641026.0
    },
    {
        "author": "InterestingNews1",
        "created_utc": 1579343453,
        "id": "eqev5a",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "**Growth Stocks (Medifast and Cardlytics)**\n\n**Medifast** $MED, the weight management company, presented at the ICR conference on Monday and restated its goal to double in size every 3-4 years and targeted 2021 revenues of $1,000 million (2019 guidance $700-$710 million)  That’s reassuring after a disappointing Q3 when the company was hit by a credit card fraud.\n\nThe stock dropped 29% after those results which seemed a little harsh since the issue was fully resolved, revenues still managed to grow 36.5% and guidance for the full year forecast 40% revenue growth and 26% EPS growth.  It’s not as if Medifast was trading on a big multiple.  The stock has since recovered from the post release drop and then, as it is now, trades on around 2x trailing revenues and 20x trailing earnings.  Pretty reasonable for a growth stock.\n\nThe problem is is that Medifast has been tarred with the same brush as Herbalife and other multi level marketing schemes which use agents to promote sales.  However, the model is quite different. Medifast sells direct to the customer.  Its agents don’t get discounts or handle stock.  That means Medifast isn’t artificially boosting sales by recruiting and selling to its own agents.\n\nA few years ago the company was a quiet and essentially family run affair.  That was until Dan Chard was appointed in 2015.  Formerly the President of Global Sales and Operations at Nu Skin he was the right person for the job.  He developed the Optavia Diet brand and put in place the direct marketing business model. Sales exploded from $273 million to $689 million in less than four years.\n\nWith a product that works and a growing level of demand (driven by obesity) coupled with a capital light highly scalable business model and effective management, Medifast looks very attractive.  The company also has a potentially huge global opportunity but only recently moved to grow internationally with expansion into Hong Kong and Singapore 2019.  Europe and South America and Australia would also make excellent markets.\n\nCEO Dan Chard’s comments this week suggest the bright outlook has not changed.  2021 targets for revenue of $1,000 million and 15% operational margins remain.  That  would generate net income of $115 million if we apply the current effective tax rate.  The $115.58 stock price at Fridays close would represent a forward earnings multiple of just 11.7 (TTM PE 19). With a strong growth forecast, the stock looks cheap.  \n\n&amp;#x200B;\n\n**Cardlytics** $CDLX reported preliminary Q4 revenues this week that were up 44% at $69 million and thrashed estimates of $59 million.  The digital advertiser uses a proprietary native bank advertising channel that enables marketers to reach consumers through their trusted and frequently visited online and mobile banking channels.\n\nHowever Cardlytics’ main advantage is the use of purchase intelligence outside the banking channel to boost advertising effectiveness. It’s not difficult to see why knowing what customers have bought in the past is a good predictor of what they will buy in the future.  The company claims that its return on ad spend (ROAS) is 10x the industry average at $30 for each $1 spent. \n\nThe stock price has risen 22% since the announcement but (valued at 11.3x revenues) still looks reasonable compared to peers such as The Trade Desk (valued at 21x). With a huge ROAS advantage, it seems likely that strong growth will continue.\n\n&amp;#x200B;\n\n**Value Stocks (Samsung, Signet and Fluent)**\n\nFool.com reported that this is an exciting and pivotal time for NVIDIA. The company remains at the forefront of gaming and is well placed to thrive in the new frontiers which lie in data center, artificial intelligence, and automotive applications.  However, if the valuation at 35x forward earnings is too much for you (and you don’t mind looking abroad) then perhaps **Samsung Electronics** ($005930.KS) is a better buy. \n\nSamsung has a dominant position in memory chips and memory demand is exploding with the roll out of 5G and applications in artificial intelligence and the Internet of Things. The company is currently trading on just 9x last years earnings. Additionally, net cash (including short term investments) is equivalent to a remarkable 25% of its total valuation.\n\n&amp;#x200B;\n\n**Signet Jewelers** $SIG stock price jumped 40% on Thursday after the company reported a significant beat and raise. The company, whose outlets include Kay Jewelers, Zales and Jared, said comps were up 1.6% as a 13.5% growth in digital sales helped offset a 0.2% decline in brick and mortar sales.  That’s encouraging as it seems jewelry buyers switching to online channels prefer to buy from names they know and trust.  The retailer still faces headwinds but its valuation doesn’t look expensive.  EPS guidance was raised to $3.42 to $3.56 from $2.99 to $3.26 meaning, even after the recent price jump, the $29.52 stock is valued at just 8.4x earnings.  \n\n&amp;#x200B;\n\n**Fluent, Inc**. $FLNT announced on Tuesday that it expects to exceed its previously provided guidance for full-year 2019 with revenue now anticipated to be $280.8 - $281.8 million, representing growth of 12% and an increase from previous guidance of $265 - $267 million. \n\nThe company operates in a fast growing, fast changing and competitive sector - digital marketing. It has built up a huge database of (150 million+) that it can target on behalf of clients. It uses competitions to get details and, importantly, gets consent from clients to contact them. A former CEO has said that if European data protection laws were introduced in the US it would give Fluent a huge advantage as it (largely) already has consent. Indeed Europe offers a huge potential market for Fluent and the company has already reportedly started testing in the UK.\n\nThe news this week is an important development for Fluent whose stock has not had a good year. The data driven digital marketer is down 60% (with a valuation of 0.8x sales and 1.1x book) from the years highs after reducing guidance, not once but twice.\n\nIn fairness, management have been clear throughout that the outlook for the core advertising platform remains very good. The drop in revenues and rising costs are due to the company exiting peripheral ventures that have been explored and not met revenue/return targets (as well as a couple of bad debts deemed unrecoverable). \n\nThe recent results support that thesis and suggests growth should accelerate once the headwind of exiting non core businesses passes. \n\n&amp;#x200B;\n\n**Insider (RumbleOn)**\n\nBoth the CFO and a director at **RumbleOn** $RMBL each picked up $114,000 of stock on Tuesday following $90,000 of purchases by the CEO last month.  (Warning RumbleOn is a high risk nano cap stock)\n\nMake no mistake RumbleOn is tiny with a market cap of just $16 million.  A development stage e-commerce platform that facilitates consumers and dealers to buy, sell, trade, and finance pre-owned recreational vehicles. It primarily focuses on pre-owned Harley-Davidson motorcycles and other powersports and also provides third-party financing services.  However, it is growing rapidly leveraging its capital-light network of 17 regional partnerships and disrupting the old-school pre-owned vehicle dealerships.  Thats a massive and highly fragmented market with around $1 trillion of sales.\n\nRumbleOn expects to achieve its first quarter of EBITDA profitability in 2020 and have a full year of EBITDA profitability in 2021. That seems reasonable given recent growth.  In November Q3 results reported revenues of $220 million compared to just $19 million in 2018. Last week the company reported preliminary results expecting full year 2019 revenue range to $837.7 million to $840.7 million compared to $156 million in 2018.  Margins are tight but the company is moving swiftly from dealers to consumer sales which are almost three times are profitable.  \n\nRumbleOn CEO Marshall Chesrown said “We are pleased with the progress we are making” going on to add “We continue to expect an acceleration in unit and revenue growth in the first half of 2020”.   \n\nThe company is a high risk development stage nano cap with dilution being more of a certainty than a risk.  However its fast growth suggests it is resonating well with users and, if it is even slightly successful in winning a small share of the huge vehicle sales market, current stock holders should do very well.\n\n&amp;#x200B;\n\n\"Follow\" me if you would like to be informed of updates during the week.\n\nThis is not a recommendation to buy or sell.  Stocks are not suitable for everyone.  Some of the stocks mentioned are risky small cap and/or highly speculative.  Please do your own research.",
        "subreddit": "stocks",
        "title": "Some interesting news in the stock market this week",
        "url": "https://www.reddit.com/r/stocks/comments/eqev5a/some_interesting_news_in_the_stock_market_this/",
        "created": 1579372253.0
    },
    {
        "author": "yhu8786",
        "created_utc": 1580374332,
        "id": "ew2hva",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "I am holding FB JUN 245C. I was essentially even going into earnings yesterday, but it is down 5%+ after hours, so I am expecting it to be down 30% or more in a few hours. Given I am still long the investment thesis (the ER didn't change anything in my opinion as to why I am bullish), should I hold these calls for sure given so much time to expiration? Or sell it and try to find a new entry after it sets up again? I cut a few more that were down 40-50% that weren't expiring until June (QCOM, NVDA). I am rethinking that decision and maybe I should have let it run due to the time premium I purchased.\n\nThank you in advance for your thoughts.",
        "subreddit": "options",
        "title": "Selling or hold June calls that are not performing?",
        "url": "https://www.reddit.com/r/options/comments/ew2hva/selling_or_hold_june_calls_that_are_not_performing/",
        "created": 1580403132.0
    },
    {
        "author": "tsf_peso",
        "created_utc": 1579036686,
        "id": "eorod7",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Down 2% in one day,I know it’ll go back up but does anyone know what happened specifically?",
        "subreddit": "stocks",
        "title": "What happened to $nvda today?",
        "url": "https://www.reddit.com/r/stocks/comments/eorod7/what_happened_to_nvda_today/",
        "created": 1579065486.0
    },
    {
        "author": "Dirty-Dan24",
        "created_utc": 1578932396,
        "id": "eo69bj",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "I bought the dip a little over a year ago on NVIDIA and have made over 500$ on it (I’m 19 so 500$ is still a big deal to me). I know I’m supposed to hold things long term but I’m scared NVIDIA will crash unexpectedly crash like they did before and I’ll go back to 0.",
        "subreddit": "stocks",
        "title": "Is there any reason to sell NVIDIA?",
        "url": "https://www.reddit.com/r/stocks/comments/eo69bj/is_there_any_reason_to_sell_nvidia/",
        "created": 1578961196.0
    },
    {
        "author": "RobotSquid_",
        "created_utc": 1578684789,
        "id": "emvx0u",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "This just in autists, Su Bae is saving us again and dropping a thicc new GPU to finally end Nvidia too\n\n[https://www.youtube.com/watch?v=aBIrEZHju-E](https://www.youtube.com/watch?v=aBIrEZHju-E)\n\nStonks only go up, get that sweet $AMD tendies while they are hot",
        "subreddit": "wallstreetbets",
        "title": "Su Bae will save us with AMD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/emvx0u/su_bae_will_save_us_with_amd/",
        "created": 1578713589.0
    },
    {
        "author": "SeaOtterReddit",
        "created_utc": 1578937738,
        "id": "eo7iu0",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "I’m very interested in one of these companies.\n\nOnly starting off with 1 or 2 shares. (Maybe a couple on the less priced ones)\n\nApple\nMicrosoft\nDisney\nIntel\nAMD\nNvidia\n\nJust looking to kind of hold them for the long haul. Who would be best and why?",
        "subreddit": "stocks",
        "title": "Which of these stocks should I buy?",
        "url": "https://www.reddit.com/r/stocks/comments/eo7iu0/which_of_these_stocks_should_i_buy/",
        "created": 1578966538.0
    },
    {
        "author": "MajesticalMuffin",
        "created_utc": 1578219135,
        "id": "ekb96g",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Hey investors!\nI have a little money left over in my account and I'm not which stocks to invest in.\nAPPLE - I already hold two shares but have performed very well +13% in the short time I've had it\nNVIDIA\nAMD (I would buy several as it's less)",
        "subreddit": "stocks",
        "title": "Which of these stock picks? 🤔",
        "url": "https://www.reddit.com/r/stocks/comments/ekb96g/which_of_these_stock_picks/",
        "created": 1578247935.0
    },
    {
        "author": "iLikeSourBeer",
        "created_utc": 1579193864,
        "id": "epm11l",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "What does the community think on entering new positions?\n\nI think given the troubles in China &amp; elections in the US, trade-related activity could be quite subdued in 2020. The narrative may increasingly focus on 5G/AI.\n\nThe stocks have had quite the run already though.",
        "subreddit": "wallstreetbets",
        "title": "AMD, NVDA, MU QCOM for 2020?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/epm11l/amd_nvda_mu_qcom_for_2020/",
        "created": 1579222664.0
    },
    {
        "author": "TimAppleBurner",
        "created_utc": 1578600835,
        "id": "emf7gt",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Finally broke even on my all time chart today. Learned a lot about options along the way, but in the last 7 days Apple and Nvidia long calls pulled me out of my spiral. Started trading options right before the October crash in September 2018.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/emf7gt/finally_broke_even_on_my_all_time_chart_today/",
        "created": 1578629635.0
    },
    {
        "author": "oranguthang87",
        "created_utc": 1578923847,
        "id": "eo4fmg",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": " \n\n* Argus Research boosted the price target on **NVIDIA Corporation** (NASDAQ: NVDA) from $240 to $300. NVIDIA closed at $244.32 on Friday.\n* Credit Suisse raised the price target on **Hexcel Corporation** (NYSE: HXL) from $78 to $91. Hexcel closed at $72.91 on Friday.\n* DA Davidson lifted **Apple Inc.** (NASDAQ: AAPL) price target from $300 to $375. Apple shares closed at $310.33 on Friday.\n* Oppenheimer raised the price target for **Tesla Inc** (NASDAQ: TSLA) from $385 to $612. Tesla shares closed at $478.15 on Friday.\n* Goldman Sachs lowered the price target for **Granite Construction Inc.** (NYSE: GVA) from $29 to $26. Granite Construction closed at $27.68 on Friday.\n* Bernstein raised **Autodesk, Inc.** (NASDAQ: ADSK) price target from $189 to $197. Autodesk shares closed at $192.36 on Friday.\n* Morgan Stanley boosted the price target for **Veeva Systems Inc** (NYSE: VEEV) from $160 to $175. Veeva shares closed at $145.51 on Friday.\n* JP Morgan cut the price target for **Advance Auto Parts, Inc.** (NYSE: AAP) from $168 to $163. Advance Auto Parts shares closed at $149.01 on Friday.\n* Raymond James lifted **Texas Roadhouse Inc** (NASDAQ: TXRH) price target from $63 to $68. Texas Roadhouse closed at $55.97 on Friday.\n* Credit Suisse raised the price target for **Woodward, Inc.** (NASDAQ: WWD) from $110 to $145. Woodward shares closed at $121.96 on Friday.",
        "subreddit": "wallstreetbets",
        "title": "10 Biggest Price Target Changes For Monday",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eo4fmg/10_biggest_price_target_changes_for_monday/",
        "created": 1578952647.0
    },
    {
        "author": "manbuckets2001",
        "created_utc": 1577937725,
        "id": "eiszrm",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Is buying 2 contracts of NVDA at 237.50 for 1/3 a bad idea right now? Looking for any advice in general about options trading as well, thank you.",
        "subreddit": "investing",
        "title": "Dumb trade?",
        "url": "https://www.reddit.com/r/investing/comments/eiszrm/dumb_trade/",
        "created": 1577966525.0
    },
    {
        "author": "bigboiindawest",
        "created_utc": 1579573859,
        "id": "ero29u",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Where do you see NVDA stock heading in 2020?\n\nI think it could reach $350 based on the things said in this vid: http://y2u.be/F6B4HGMF-u0",
        "subreddit": "StockMarket",
        "title": "Nvidia Stock Analysis + Price Prediction In 2020!",
        "url": "https://www.reddit.com/r/StockMarket/comments/ero29u/nvidia_stock_analysis_price_prediction_in_2020/",
        "created": 1579602659.0
    },
    {
        "author": "rosen178",
        "created_utc": 1578935049,
        "id": "eo6vme",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "I've been reading up a lot on ADBE's forecast for 2020 and people are VERY bull on them.\n\nA lot of the advisors I know say its one of those stocks they'll never sell. Hear that about NVDA too.\n\n&amp;#x200B;\n\nWhat are all of your thoughts on ADBE? How much room for growth is there left?",
        "subreddit": "stocks",
        "title": "$ADBE 2020 - Projections",
        "url": "https://www.reddit.com/r/stocks/comments/eo6vme/adbe_2020_projections/",
        "created": 1578963849.0
    },
    {
        "author": "tsf_peso",
        "created_utc": 1579035656,
        "id": "eorf39",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "What happened to $NVDA today?",
        "url": "https://www.reddit.com/r/stocks/comments/eorf39/what_happened_to_nvda_today/",
        "created": 1579064456.0
    },
    {
        "author": "Random-Guy-555",
        "created_utc": 1577979800,
        "id": "eizs2s",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "I was going to buy a little IHI, NVDA, and possibly more TSM.\n\nWhile I'm waiting for the buy and sell capabilities to come back up, anyone have any better investments to choose for the New Year?  I've got time.",
        "subreddit": "investing",
        "title": "TD Ameritrade orders are down. Can't buy or sell right now.",
        "url": "https://www.reddit.com/r/investing/comments/eizs2s/td_ameritrade_orders_are_down_cant_buy_or_sell/",
        "created": 1578008600.0
    },
    {
        "author": "Anaranovski",
        "created_utc": 1579965115,
        "id": "etrvwk",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Summary from the post to avoid copyright issues.  I can say that, as of this writing, except for AMZN, they have outperformed the S&amp;P 500 for the 1- and 5-year period.  AMZN outperformed for 5-year but underperformed for 1-year period\n\nYMMV\n\n&gt; **Amazon.com (NASDAQ: AMZN)** is one of the best companies in the world, one we've recommended multiple times in Stock Advisor. And it's still one of our top investing opportunities today, because it's keeping up a fast pace of innovation. Consider ongoing successes like Amazon Web Services, the company's cloud service — AWS has captured roughly half of the cloud infrastructure market, and it's still Amazon's fastest-growing segment.\n \n&gt; It's been almost a year since we last named **Idexx Laboratories (NASDAQ: IDXX)** a Best Buy Now. Back then, I wrote that it had more than tripled for members who bought shares when we recommended it in July 2014. Well, Idexx has spent the last 11 months going even higher — it's now up 330% since that initial recommendation, better than a 4-bagger.\n&gt; \n&gt; It's been more than two years since **McCormick (NYSE: MKC)** last appeared as a Best Buy Now in Stock Advisor. Over that period, its stock is up roughly 70% versus the market's nearly 30% — and that's just in stock gains alone. This dividend aristocrat's total returns outperform the market by a whopping 44 percentage points over that same time period.\n&gt; \n&gt; In November 2018, **NVIDIA (NASDAQ: NVDA)** fell from grace, never to recover — or so the talking heads would have told you. Back then, the company was dealing with the fallout of an unexpected drop in demand for its cryptocurrency mining products. Nowadays, the chipmaker's world couldn't look brighter. Its graphics, high-performance computing, and artificial intelligence chips are key to advances in gaming, cloud computing, automotive connectivity, manufacturing, and healthcare.\n&gt; \n&gt; There's an unquenchable thirst for data around the world, which is triggering an intense, high-stakes race in the semiconductor industry. That's great news for **Synopsys (NASDAQ: SNPS)**, a kind of behind-the-scenes quality assurance specialist that can benefit no matter which chipmakers have the upper hand.",
        "subreddit": "investing",
        "title": "Motley Fool - David's Best Buy Now",
        "url": "https://www.reddit.com/r/investing/comments/etrvwk/motley_fool_davids_best_buy_now/",
        "created": 1579993915.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1578922898,
        "id": "eo491b",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/StockMarket sub! Happy Monday to all! Here are your pre-market movers and news this AM-\n\n*****\n\n#(**[CLICK HERE TO VIEW THE FULL SOURCE!](https://www.stockaholics.net/threads/todays-pre-market-movers-news-monday-january-13th-2020.9325/)**)\n\n#[Today's Top Headlines for Monday, January 13th, 2020](https://www.cnbc.com/2020/01/13/dow-to-rise-buttigiegs-big-endorsement-and-boeings-new-ceo.html)\n\n* U.S. stock futures were pointing to a Wall Street rebound this morning that would erase most of Friday’s losses, ahead of this week’s signing of a U.S.-China phase one trade deal. The major averages set record intraday highs early in Friday’s session, with the Dow topping 29,000 for the first time, but then slid the rest of the day to finish lower. Nonetheless, the S&amp;P 500 has posted weekly gains in six of the past seven weeks, while the Nasdaq is up for five straight weeks. (CNBC)\n* U.S.-China trade war taking a toll, but a minor one: Much of economy unscathed (WSJ)\n* No major economic reports are due today, but three Fed officials are set to make public appearances during trading hours: Boston Fed President Eric Rosengren, Atlanta Fed President Raphael Bostic and Minneapolis Fed President Neel Kashkari. Meanwhile, no earnings reports are on today’s calendar. (CNBC)\n* Boeing’s (BA) new Chief Executive David Calhoun assumes the job today as the U.S. planemaker battles to recover from two fatal crashes of 737 Max planes that killed 346 people in five months and led to the model’s worldwide grounding in March. Calhoun was named CEO in December after the board stripped Dennis Muilenburg of the title. (Reuters)\n* Mnuchin: Boeing 737 Max crisis could slow US growth by a half point in 2020 (CNBC)\n* President Donald Trump authorized the killing of Iranian Gen. Qassem Soleimani seven months ago if Iran’s increased aggression resulted in the death of an American, NBC News reported. The presidential directive in June came with the condition that Trump would have final sign-off on any specific operation to kill Soleimani, officials said.\n* Defense Secretary Esper ‘didn’t see’ specific evidence of Trump claim that Iran planned embassy attacks (CNBC)\n* Trump expressed solidarity with Iranian protesters as they took to the streets of Tehran over the weekend, after the Islamic Republic admitted it accidentally shot down a Ukraine-bound airliner, killing all 176 people on board the Boeing aircraft. Trump also warned the Iranian government that the “world is watching.\n* Iran denies shooting at protesters amid fury over downing of passenger plane (Reuters)\n* The U.S. has reportedly reached out to North Korea to restart diplomatic talks that stalled last October. Washington wants to get negotiations with Pyongyang “back on track” and implement leader Kim Jong Un’s “commitment” to the denuclearization of the Korean Peninsula, White House national security advisor Robert O’Brien told Axios. (CNBC)\n* Democratic presidential candidate Pete Buttigieg was endorsed by veteran Iowa Congressman Dave Loebsack, just three weeks before the party’s nominating contest begins in Iowa on Feb. 3. Sen. Bernie Sanders gained the support of an influential labor union in New Hampshire, which holds the second primary contest. (Reuters)\n* Britain’s Queen Elizabeth II is set to hold talks today with Prince Harry for the first time since he and his wife, Meghan, unveiled their controversial plan to walk away from royal roles, a dramatic family summit meant to chart a future course for the couple. Harry and Meghan announced last week they wanted to “step back” as senior royals. (AP)\n* Japanese billionaire Yusaku Maezawa is looking for a female “life partner” to accompany him on Space X’s maiden tourist voyage to the Moon. Meanwhile, Maezawa is due to announce which of his Twitter followers will receive a share of the $9 million he promised to give away as part of a social experiment. (BBC and CNBC’s Make It)\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](http://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://finviz.com/publish/011320/sec_all_080266167.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=637144994396023348)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/XjTBCVB.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/4GkiL8Z.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/lm2IGKk.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/zi8Gzi5.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!]()**)\nN/A.\n\n*****\n\n#THIS AFTERNOON'S POST-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS CALENDAR!]()**)\nT.B.A.\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/WitmZNv.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/83rb9W4.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/YDrQkZN.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/VzMB0Wn.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/V8ea808.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #4!](https://i.imgur.com/HXQ4K2F.png)**)\n\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/sTjycfD.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!](https://i.imgur.com/8ipW96p.png)**)\n\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS:\n\n* SPCE\n* AQST\n* VRNA\n* LULU\n* TERP\n* NVDA\n* EXAS\n* BAC\n* LCI\n* PBYI\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2020/01/13/stocks-making-the-biggest-moves-premarket-lululemon-boeing-tesla-ford-more.html)**)\n\n*****\n\n&gt; **Lululemon (LULU)** – The apparel maker raised its earnings and revenue guidance for the fourth quarter, citing holiday season momentum. Lululemon now expects a profit of $2.22 to $2.25 per share for the quarter, compared to a previous range of $2.10-$2.13 and a consensus estimate of $2.15.\n\n&gt; #**STOCK SYMBOL:** LULU\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=LULU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LULU)**)\n\n*****\n\n&gt; **Anixter International (AXE)** – The networking products maker agreed to a $100 per share cash-and-stock takeover by Wesco International (WCC), ending a back-and-forth bidding war between Wesco and private equity firm Clayton Dubilier &amp; Rice. Clayton Dubilier first offered $82 per share for Anixter and raised its bid several times, but has now waived its right to match Wesco’s latest offer.\n\n&gt; #**STOCK SYMBOL:** AXE\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AXE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AXE)**)\n\n*****\n\n&gt; **Boeing (BA)** – Former CEO Dennis Muilenburg will receive $62 million in incentives, stock awards, and pension benefits, but forfeited $14.6 million in pay and will not receive any severance after being fired last month.\n\n&gt; #**STOCK SYMBOL:** BA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BA)**)\n\n*****\n\n&gt; **Tesla (TSLA)** – Major stakeholder Baillie Gifford considered selling its 10% stake the automaker last year after a series of setbacks, according to an executive of the fund management group who spoke to The Times of London. The executive told the paper that while the case to keep the stake was “debatable,” the case against it wasn’t strong enough to sell. Separately, Oppenheimer raised its price target on the stock to $612 per share from $385, based on Tesla reaching scale sufficient to support positive free cash flow.\n\n&gt; #**STOCK SYMBOL:** TSLA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TSLA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TSLA)**)\n\n*****\n\n&gt; **Ford (F)** – Ford sales in China fell 26.1% in 2019, marking the third consecutive year of sales declines in that country. Sales had fallen 37% in 2019 and 6% in 2017. Ford did say its market share in the premium segment stabilized during the year.\n\n&gt; #**STOCK SYMBOL:** F\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=F&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/F)**)\n\n*****\n\n&gt; **Goldman Sachs (GS)** – JMP Securities upgraded Goldman to “market outperform” from “market perform,” saying the company is in the early stages of the most meaningful transformations in the financial services industry.\n\n&gt; #**STOCK SYMBOL:** GS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=GS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/GS)**)\n\n*****\n\n&gt; **Hexcel (HXL), Woodward (WWD)** – The two aerospace components makers – both suppliers to Boeing – announced plans for an all-stock merger. Woodward shareholders will own about 55 percent of the combined company while Hexcel stockholders would own the rest.\n\n&gt; #**STOCK SYMBOL:** HXL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=HXL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/HXL)**)\n\n*****\n\n&gt; **Newmont Goldcorp (NEM)** – Newmont Goldcorp was upgraded to “buy” from “neutral” at B Riley FBR, which expects the mining company to outperform its large-cap gold peers.\n\n&gt; #**STOCK SYMBOL:** NEM\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=NEM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/NEM)**)\n\n*****\n\n&gt; **General Electric (GE)** – GE was named a “catalyst call” buy at Deutsche Bank, which thinks the company could post a better-than-expected fourth quarter as well as upbeat guidance when it issues its next earnings report on Jan. 29.\n\n&gt; #**STOCK SYMBOL:** GE\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=GE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/GE)**)\n\n*****\n\n&gt; **IBM (IBM)** – IBM was downgraded to “in line” from “outperform” at Evercore ISI, pointing to macro headwinds as well as market circumstances that set up a difficult first half of 2020.\n\n&gt; #**STOCK SYMBOL:** IBM\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=IBM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/IBM)**)\n\n*****\n\n&gt; **Fiat Chrysler (FCAU)** – The Peugeot family plans to raise the 6.2% stake it will have in the planned combination of Peugeot Parent PSA and Fiat Chrysler as soon as possible, according to a family representative quoted in a French newspaper.\n\n&gt; #**STOCK SYMBOL:** FCAU\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=FCAU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/FCAU)**)\n\n*****\n\n&gt; **Teladoc Health (TDOC)** – Teladoc Health will acquire privately held InTouch Health for $600 million, in a combination of virtual health-care companies.\n\n&gt; #**STOCK SYMBOL:** TDOC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TDOC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TDOC)**)\n\n*****\n\n#**FULL DISCLOSURE:**\n\n&gt; /u/bigbear0083 has no positions in any stocks mentioned. Reddit, moderators, and the author do not advise making investment decisions based on discussion in these posts. Analysis is not subject to validation and users take action at their own risk. /u/bigbear0083 is an admin at the financial forums [Stockaholics.net](http://www.stockaholics.net/) where this content was originally posted.\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/StockMarket?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Monday, January 13th, 2020! :)**",
        "subreddit": "StockMarket",
        "title": "Today's Pre-Market Movers &amp; News [Monday, January 13th, 2020]",
        "url": "https://www.reddit.com/r/StockMarket/comments/eo491b/todays_premarket_movers_news_monday_january_13th/",
        "created": 1578951698.0
    },
    {
        "author": "WSBAutistWSB",
        "created_utc": 1579082430,
        "id": "ep0es3",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "NVDA $300 Calls",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ep0es3/nvda_300_calls/",
        "created": 1579111230.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1578923218,
        "id": "eo4b6u",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/smallstreetbets sub! Happy Monday to all! Here are your pre-market movers and news this AM-\n\n*****\n\n#[Today's Top Headlines for Monday, January 13th, 2020](https://www.cnbc.com/2020/01/13/dow-to-rise-buttigiegs-big-endorsement-and-boeings-new-ceo.html)\n\n* U.S. stock futures were pointing to a Wall Street rebound this morning that would erase most of Friday’s losses, ahead of this week’s signing of a U.S.-China phase one trade deal. The major averages set record intraday highs early in Friday’s session, with the Dow topping 29,000 for the first time, but then slid the rest of the day to finish lower. Nonetheless, the S&amp;P 500 has posted weekly gains in six of the past seven weeks, while the Nasdaq is up for five straight weeks. (CNBC)\n* U.S.-China trade war taking a toll, but a minor one: Much of economy unscathed (WSJ)\n* No major economic reports are due today, but three Fed officials are set to make public appearances during trading hours: Boston Fed President Eric Rosengren, Atlanta Fed President Raphael Bostic and Minneapolis Fed President Neel Kashkari. Meanwhile, no earnings reports are on today’s calendar. (CNBC)\n* Boeing’s (BA) new Chief Executive David Calhoun assumes the job today as the U.S. planemaker battles to recover from two fatal crashes of 737 Max planes that killed 346 people in five months and led to the model’s worldwide grounding in March. Calhoun was named CEO in December after the board stripped Dennis Muilenburg of the title. (Reuters)\n* Mnuchin: Boeing 737 Max crisis could slow US growth by a half point in 2020 (CNBC)\n* President Donald Trump authorized the killing of Iranian Gen. Qassem Soleimani seven months ago if Iran’s increased aggression resulted in the death of an American, NBC News reported. The presidential directive in June came with the condition that Trump would have final sign-off on any specific operation to kill Soleimani, officials said.\n* Defense Secretary Esper ‘didn’t see’ specific evidence of Trump claim that Iran planned embassy attacks (CNBC)\n* Trump expressed solidarity with Iranian protesters as they took to the streets of Tehran over the weekend, after the Islamic Republic admitted it accidentally shot down a Ukraine-bound airliner, killing all 176 people on board the Boeing aircraft. Trump also warned the Iranian government that the “world is watching.\n* Iran denies shooting at protesters amid fury over downing of passenger plane (Reuters)\n* The U.S. has reportedly reached out to North Korea to restart diplomatic talks that stalled last October. Washington wants to get negotiations with Pyongyang “back on track” and implement leader Kim Jong Un’s “commitment” to the denuclearization of the Korean Peninsula, White House national security advisor Robert O’Brien told Axios. (CNBC)\n* Democratic presidential candidate Pete Buttigieg was endorsed by veteran Iowa Congressman Dave Loebsack, just three weeks before the party’s nominating contest begins in Iowa on Feb. 3. Sen. Bernie Sanders gained the support of an influential labor union in New Hampshire, which holds the second primary contest. (Reuters)\n* Britain’s Queen Elizabeth II is set to hold talks today with Prince Harry for the first time since he and his wife, Meghan, unveiled their controversial plan to walk away from royal roles, a dramatic family summit meant to chart a future course for the couple. Harry and Meghan announced last week they wanted to “step back” as senior royals. (AP)\n* Japanese billionaire Yusaku Maezawa is looking for a female “life partner” to accompany him on Space X’s maiden tourist voyage to the Moon. Meanwhile, Maezawa is due to announce which of his Twitter followers will receive a share of the $9 million he promised to give away as part of a social experiment. (BBC and CNBC’s Make It)\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](http://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://finviz.com/publish/011320/sec_all_080266167.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=637144994396023348)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/XjTBCVB.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/4GkiL8Z.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/lm2IGKk.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/zi8Gzi5.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!]()**)\nN/A.\n\n*****\n\n#THIS AFTERNOON'S POST-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS CALENDAR!]()**)\nT.B.A.\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/WitmZNv.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/83rb9W4.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/YDrQkZN.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/VzMB0Wn.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/V8ea808.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #4!](https://i.imgur.com/HXQ4K2F.png)**)\n\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/sTjycfD.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!](https://i.imgur.com/8ipW96p.png)**)\n\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS:\n\n* SPCE\n* AQST\n* VRNA\n* LULU\n* TERP\n* NVDA\n* EXAS\n* BAC\n* LCI\n* PBYI\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2020/01/13/stocks-making-the-biggest-moves-premarket-lululemon-boeing-tesla-ford-more.html)**)\n\n*****\n\n&gt; **Lululemon (LULU)** – The apparel maker raised its earnings and revenue guidance for the fourth quarter, citing holiday season momentum. Lululemon now expects a profit of $2.22 to $2.25 per share for the quarter, compared to a previous range of $2.10-$2.13 and a consensus estimate of $2.15.\n\n&gt; #**STOCK SYMBOL:** LULU\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=LULU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LULU)**)\n\n*****\n\n&gt; **Anixter International (AXE)** – The networking products maker agreed to a $100 per share cash-and-stock takeover by Wesco International (WCC), ending a back-and-forth bidding war between Wesco and private equity firm Clayton Dubilier &amp; Rice. Clayton Dubilier first offered $82 per share for Anixter and raised its bid several times, but has now waived its right to match Wesco’s latest offer.\n\n&gt; #**STOCK SYMBOL:** AXE\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AXE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AXE)**)\n\n*****\n\n&gt; **Boeing (BA)** – Former CEO Dennis Muilenburg will receive $62 million in incentives, stock awards, and pension benefits, but forfeited $14.6 million in pay and will not receive any severance after being fired last month.\n\n&gt; #**STOCK SYMBOL:** BA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BA)**)\n\n*****\n\n&gt; **Tesla (TSLA)** – Major stakeholder Baillie Gifford considered selling its 10% stake the automaker last year after a series of setbacks, according to an executive of the fund management group who spoke to The Times of London. The executive told the paper that while the case to keep the stake was “debatable,” the case against it wasn’t strong enough to sell. Separately, Oppenheimer raised its price target on the stock to $612 per share from $385, based on Tesla reaching scale sufficient to support positive free cash flow.\n\n&gt; #**STOCK SYMBOL:** TSLA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TSLA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TSLA)**)\n\n*****\n\n&gt; **Ford (F)** – Ford sales in China fell 26.1% in 2019, marking the third consecutive year of sales declines in that country. Sales had fallen 37% in 2019 and 6% in 2017. Ford did say its market share in the premium segment stabilized during the year.\n\n&gt; #**STOCK SYMBOL:** F\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=F&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/F)**)\n\n*****\n\n&gt; **Goldman Sachs (GS)** – JMP Securities upgraded Goldman to “market outperform” from “market perform,” saying the company is in the early stages of the most meaningful transformations in the financial services industry.\n\n&gt; #**STOCK SYMBOL:** GS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=GS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/GS)**)\n\n*****\n\n&gt; **Hexcel (HXL), Woodward (WWD)** – The two aerospace components makers – both suppliers to Boeing – announced plans for an all-stock merger. Woodward shareholders will own about 55 percent of the combined company while Hexcel stockholders would own the rest.\n\n&gt; #**STOCK SYMBOL:** HXL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=HXL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/HXL)**)\n\n*****\n\n&gt; **Newmont Goldcorp (NEM)** – Newmont Goldcorp was upgraded to “buy” from “neutral” at B Riley FBR, which expects the mining company to outperform its large-cap gold peers.\n\n&gt; #**STOCK SYMBOL:** NEM\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=NEM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/NEM)**)\n\n*****\n\n&gt; **General Electric (GE)** – GE was named a “catalyst call” buy at Deutsche Bank, which thinks the company could post a better-than-expected fourth quarter as well as upbeat guidance when it issues its next earnings report on Jan. 29.\n\n&gt; #**STOCK SYMBOL:** GE\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=GE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/GE)**)\n\n*****\n\n&gt; **IBM (IBM)** – IBM was downgraded to “in line” from “outperform” at Evercore ISI, pointing to macro headwinds as well as market circumstances that set up a difficult first half of 2020.\n\n&gt; #**STOCK SYMBOL:** IBM\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=IBM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/IBM)**)\n\n*****\n\n&gt; **Fiat Chrysler (FCAU)** – The Peugeot family plans to raise the 6.2% stake it will have in the planned combination of Peugeot Parent PSA and Fiat Chrysler as soon as possible, according to a family representative quoted in a French newspaper.\n\n&gt; #**STOCK SYMBOL:** FCAU\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=FCAU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/FCAU)**)\n\n*****\n\n&gt; **Teladoc Health (TDOC)** – Teladoc Health will acquire privately held InTouch Health for $600 million, in a combination of virtual health-care companies.\n\n&gt; #**STOCK SYMBOL:** TDOC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TDOC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TDOC)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/smallstreetbets?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Monday, January 13th, 2020! :)**",
        "subreddit": "smallstreetbets",
        "title": "Today's Pre-Market Movers &amp; News [Monday, January 13th, 2020]",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/eo4b6u/todays_premarket_movers_news_monday_january_13th/",
        "created": 1578952018.0
    },
    {
        "author": "world_is_a_throwAway",
        "created_utc": 1579426913,
        "id": "equdwh",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I think you guys are missing the point. Without the current necessity for monster crypto bonairrz, graphics cards are easily clustered. \n\nAny of you dumshits can log onto AWS  or Azure or GCP, right this very moment, and spin up   \n4+ NVDA Tesla GPU's at one time, at your convenience. \n\nTL:DR \n\nWhen you can uber 24 virtual cores, 1.25 TB (temp storage), 224GB RAM, and a matrix mapping speed that your brain isn't capable of reconciling....  single Hardware sticks just aren't that cool anymore. \n\n**Buy Cloud, Hold Graphics, Tweet Mnuchin.**   \n\n\n***i don't fucking know*** \n\n*I guess if I had tendiez i would iron condorz AMD at Feb. 1 $3.00 +- from the market and a dollar further for the safetyz. It won't move. It never does after earnings.*",
        "subreddit": "wallstreetbets",
        "title": "NVDA / AMD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/equdwh/nvda_amd/",
        "created": 1579455713.0
    },
    {
        "author": "world_is_a_throwAway",
        "created_utc": 1579427511,
        "id": "equgm8",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I think you guys are missing the point. Without the current necessity for monster crypto bonairrz, graphics cards are easily clustered.\nAny of you dumshits can log onto AWS  or Azure or GCP, right this very moment, and spin up4+ NVDA Tesla GPU's at one time, at your convenience.\nTL:DR\nWhen you can uber 24 virtual cores, 1.25 TB (temp storage), 224GB RAM, and a matrix mapping speed that your brain isn't capable of reconciling....  single hardware sticks just aren't that cool anymore.\nBuy Cloud, Hold Graphics, Tweet Mnuchin.\ni don't  know\nI guess if I had tendiez i would iron condorz AMD at Feb. 1 $3.00 +- from the market and a dollar further for the safetyz. It won't move. It never does after earnings.",
        "subreddit": "wallstreetbets",
        "title": "AMD Eaernings",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/equgm8/amd_eaernings/",
        "created": 1579456311.0
    },
    {
        "author": "FirstShotHan",
        "created_utc": 1579115521,
        "id": "ep6s2e",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Shitpost: Robinhood can see into the future - has 2020 NVDA earnings. Literally can't go tits up",
        "url": "https://i.redd.it/9mmv3f99rza41.png",
        "created": 1579144321.0
    },
    {
        "author": "brosephjones77",
        "created_utc": 1578953179,
        "id": "eob8p3",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Here is estimate of money I want to invest in each stock:\n\nSTOCKS-\n\nVerizon (VZ)- $600\nVisa (V)- $800\nApple (AAPL)- $1,500\nAmazon (AMZN) - $1,900\nMicrosoft (MSFT)- $4,000\nTesla (TSLA)- $1,500\nAbbievie (ABBV)- $500\nChase (JPM)- $1,000\nSkyworks (SWKS) - $500\nCRISPR (CRSP) - $500\nNvidia (NVDA) - $750\nAlphabet (GOOGL)- $1,400\n\nTotal Cost ~ $15,000\n\nAre these good choices? Also, the cost of all those stocks tally up to $15000. What would be the best way to cut $3000 form this list? Any suggestions helpful!",
        "subreddit": "stocks",
        "title": "First Time Investor with $12000 to Invest! Need help!",
        "url": "https://www.reddit.com/r/stocks/comments/eob8p3/first_time_investor_with_12000_to_invest_need_help/",
        "created": 1578981979.0
    },
    {
        "author": "Fukklebeez",
        "created_utc": 1580421731,
        "id": "ewd6rv",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Important $NVDA TA/DD for today 30 Jan 2020",
        "url": "https://i.redd.it/f6i3px5lnzd41.jpg",
        "created": 1580450531.0
    }
]