[
    {
        "author": "notbrokemexican",
        "created_utc": 1602430981,
        "id": "j97m8q",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\n&amp;#x200B;\n\n[AMD introduction to REDACTED](https://preview.redd.it/8elzjikqjhs51.png?width=3724&amp;format=png&amp;auto=webp&amp;s=c6197b87c2def8e59619d3a94e43762f842ee4eb)\n\n# AMD 120c 12/18\n\nBullish sentiment:\n\n\\- AMD\n\n\\- Bank of America\n\n\\- Microsoft\n\n\\- Paypal\n\n\\- Teradyne\n\n\\- Texas Instruments\n\n\\- General Electric (small nuclear reactors 2023)\n\nMy interest in AMD started around 2016 when I started to seriously learn about operating systems in my computer science courses. I sincerely found my study in operating systems to be absolutely profound when I was seeing the web and gaming world development ultra fast. I'm still totally blown away by it and I currently work for a fintech API. It's beautiful and has drawn my imagination for years.\n\n[Big tech dominance in the web](https://preview.redd.it/bwzq52qtjhs51.png?width=1439&amp;format=png&amp;auto=webp&amp;s=b722c3c49f6aed0f2e90472a779d7ab4a560b57c)\n\nI valued the \\[redacted\\] a lot at the time because I thought that the relationship between its cryptography and heat was significant and I wondered what would become of that.\n\nToday, I still value \\[redacted\\] and I don't believe that the energy required for \\[redacted\\] is trivial. I think the software that governs it is consequential. It opens up limitations of the financial sector with respects to machine-to-machine or network-to-network communications. I always believed that the \\[redacted\\] had a serious intent in the industrial sector by being able to record work generated and output by machines. As in, \\[redacted\\] is not a currency for people, but for machines.\n\n\\- What is the recorded work of a Walmart with a digital redesign that records QR codes on Paypal and the machining that protects it?\n\n\\- What is the recorded work of a truck that drives itself?\n\n\\- What is the recorded work of multiple automated machines working together in succession to complete a task?\n\n\\- What is the recorded work of a server that computes information that's increasingly more meaningful to you?\n\n**I decided to follow this stock seriously after learning about Lisa Su's history at Texas Instruments.** If you look at my research in my profile, you'll see that I'm profoundly interested in the development of Mexican-American modernization and synergy efforts. Texas Instruments was a core element to that due to their deep roots in embedded systems across multiple sectors (automotive and energy consumption).\n\n**I sincerely believe that AMD will acquire Xilinx for far less than 30B** and I believe that the strategy will be an entrance into the industrial automation sector in an aggressive shift while primarily focusing on energy efficiency, international compliance and regulatory needs, graphics processing, and machine-to-machine communications.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[Teradyne on System-on-Chip and chip needs](https://preview.redd.it/a7bwys2wjhs51.png?width=1164&amp;format=png&amp;auto=webp&amp;s=9f682177468e3e962b1364c84939337ec5570126)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/n03uposyjhs51.png?width=1965&amp;format=png&amp;auto=webp&amp;s=75a1e1528e1383f9a4352c777acdd77e55ab43c0\n\n[Texas instruments on industrial automation](https://preview.redd.it/3flaqr8ekhs51.png?width=1997&amp;format=png&amp;auto=webp&amp;s=30dce954817e515e6f7e5513c2dbaec8351e9848)\n\nCloudflare's relationship with requests made per unit of energy",
        "subreddit": "wallstreetbets",
        "title": "AMD: The Green New Deal and Redacted",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j97m8q/amd_the_green_new_deal_and_redacted/",
        "created": 1602459781.0
    },
    {
        "author": "oj88",
        "created_utc": 1605649416,
        "id": "jw296h",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Because I saw [this post](https://www.reddit.com/r/pennystocks/comments/gnwgj4/the_phun_just_wont_stop_it_took_a_huge_dive/) among many but it has [this reply to it which made me curious](https://www.reddit.com/r/pennystocks/comments/gnwgj4/comment/frelygf). **SO TO THE FACTS:**\n\nAfter writing already June 14 that a deal Phunware (NASDAQ:PHUN) announced was suspicious, I asked a journalist to look into that deal, with Hewlett Packard Enterprise (NASDAQ:HPE) which Phunware announced May 20.\n\nCaused its stock to jump from 0.67 to 1.57 after announcing this, *getting them above the Delisting Notice from NASDAQ they received April 17*.\n\n**IT'S FAKE. SOURCE:**\n\n[It's in the article linked to in my Tweet in my Thread here](https://twitter.com/olejonbj/status/1328789813378551809?s=19) or [read it directly here](https://www.miamiherald.com/article247234629.html).\n\nWhat would the market &amp; company situation have been for Phunware if investors knew back then?\n\nAfter e.g. [Honeywell confirmed the partnership Phunware claimed they have gotten with them was FAKE](https://twitter.com/honeywell/status/1313952992991870982?s=19), asking Phunware over a month ago to take it down, *but they don't*, getting a similar answer from HPE would be much bigger.\n\nThis is kind of a follow-up to an [article in The New Yorker I was a main source to](https://www.newyorker.com/news/campaign-chronicles/the-trump-campaigns-mobile-app-is-collecting-massive-amounts-of-voter-data), published September 13 (yes I have clearance to take credit in public as my name was supposed to be there - it accidentally was taken out), but the *Actual News Outlet behind this article*, has obviously, well, more resources. I've been contacted because of my Thread by journalists, though can't say which ones, but I do help out wherever I can. \n\nMy Thread was really just going to look into the app, but Phunware popped up immediately and had to be looked into. A lot outside my knowledge there, so little by little in the Thread, with help from some anonymous sources and journalists. As you may know, Twitter Threads can't be edited later, so, *better look from the Last to the First Tweet in the Thread*.\n\n*DISCLAIMER: I'm not an investor, not a US Citizen, although Phunware thinks so, that I am 2 actually, with my skills it's not that hard. Reason for posting here: I kept getting results from this subreddit on certain searches when searching basics.*",
        "subreddit": "pennystocks",
        "title": "Phunware Fake Press Releases: Partnership with HPE is a Fake Press Release, as well as Honeywell and likely many more",
        "url": "https://www.reddit.com/r/pennystocks/comments/jw296h/phunware_fake_press_releases_partnership_with_hpe/",
        "created": 1605678216.0
    },
    {
        "author": "TheTrueMarketMaker",
        "created_utc": 1604365803,
        "id": "jn0qdh",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**After Hours News (2 November 2020, Just The Headlines)**\n\n$AMC AMC Entertainment Hldgs Q3 Adj. EPS $(5.70) Misses $(4.95) Estimate, Sales $119.50M Miss $160.89M Estimate \n\n$CGIX Cancer  Genetics, Inc. Announces Closing of Public Offering and Full Exercise  of the Underwriter's Option to Purchase Additional Shares\n\n$CRIS Curis to Release Third Quarter 2020 Financial Results and Hold Conference Call on November 10, 2020\n\n$CDEV Centennial Resource Dev Q3 EPS $(0.19), Inline, Sales $149.10M Beat $115.26M Estimate \n\n$CORR CorEnergy Infr Trust Q3 EPS $(0.31) Down From $0.94 YoY, Sales $4.63M Miss $5.55M Estimate \n\n$DRRX Durect Q3 EPS $(0.05) Misses $(0.04) Estimate, Sales $2.70M Miss $3.56M Estimate \n\n$EEX Emerald Expositions Q3 Adj. EPS $(0.08) Misses $0.08 Estimate, Sales $8.50M Down From $75.60M YoY\n\n$EIGR Eiger  Announces Abstracts Highlighting Peginterferon Lambda And Lonafarnib in  Chronic Hepatitis Delta Virus (HDV) Infection Accepted For Presentation  At The Liver Meeting Digital Experience™ 2020\n\n$GIFI Gulf Island Fabrication Q3 EPS $(0.81) Down From $(0.44) YoY, Sales $54.87M Down From $75.80M YoY\n\n$GRIL Muscle Maker Grill Acquires Previously Franchise-Owned  Philadelphia Location\n\n$HPE Global Biotech Firm Macrogen Selects HPE GreenLake to Accelerate Genomic Analysis and DNA Sequencing\n\n$HTGM HTG Demonstrates Technical Feasibility For A Whole Transcriptome Panel Using HTG EdgeSeq Technology\n\n$IEA Infrastructure and Energy Alternatives, Inc. Enters Into $550 Million Joint Venture With F.H. Paschen For the West Lake Corridor Rail Expansion in Indiana\n\n$IMMP Immutep's TACTI-002 Data to Be Presented at Society for Immunotherapy of Cancer 2020 Annual Meeting\n\n$JAKK Jakks Pacific Q3 EPS $4.76 Beats $3.09 Estimate, Sales $242.30M Beat $230.10M Estimate \n\n$MDWD MediWound to Report Third Quarter 2020 Financial Results and Host a Conference Call and Webcast on November 10, 2020\n\n$MNXXF Manganese X Receives Eligibility for DTC Trading in the U.S.\n\n$NCMI National CineMedia Q3 EPS $(0.16) Beats $(0.17) Estimate, Sales $6.00M Miss $11.03M Estimate\n\n$ORGO Organogenesis  Holdings Announces Research On Its PuraPly AM, Affinity, Apligraf,  NuShield And Dermagraft Will Be Presented At 2020 Symposium on Advanced  Wound Care (SAWC) Fall Virtual Meeting Nov. 4-6\n\n$OXBR Oxbridge Re Announce 2020 Third Quarter Results on November 10, 2020\n\n$PGEN Precigen to Announce Third Quarter 2020 Financial Results on November 9th: Will host Pipeline and Data Update Call in Early December\n\n$PRQR ProQR Therapeutics Shares Higher After Hours As Hearing Cantor Assuming Coverage With Overweight Rating, $22 Price Target\n\n$PUMP ProPetro Holding Q3 EPS $(0.29) Misses $(0.25) Estimate, Sales $133.70M Miss $138.20M Estimate \n\n$SANW S&amp;W Seed Company to Report First Quarter Fiscal Year 2021 Financial Results on Wednesday, November 11, 2020\n\n$STIM Neuronetics Q3 EPS $(0.18) Beats $(0.27) Estimate, Sales $12.40M Beat $11.56M Estimate \n\n$UROV Urovant Sciences Q2 EPS $(1.12) Beats $(1.50) Estimate \n\n$VNOM Viper Energy Partners Q3 EPS $(0.01) Beats $(0.07) Estimate, Sales $62.94M Beat $49.43M Estimate \n\n$WPX WPX Energy Q3 Adj. EPS $0.11 Beats $0.06 Estimate, Sales $473.00M Miss $593.02M Estimate\n\n$YRCW YRC Worldwide Q3 EPS $(0.04) Beats $(0.28) Estimate, Sales $1.18B Beat $1.18B Estimate \n\n \n\n**Penny Stock Earnings for 3 November 2020**\n\n**Pre-Market**\n\n$ATAX $BBGI $EAF $FI $GCI $HUD $ICD $KOPN $TRMT $TTI $WBT\n\n&amp;#x200B;\n\n**After Hours**\n\n$AAIC $ACOR $ANH $BRY $BTG $DS $FPRX $FSP $HBM $INN $ITUB \n\n$KRMD $METC $NEX $NR $QUAD $RNWK $RYAM $TREC $WTTR\n\n&amp;#x200B;\n\n**Potential Near Future Catalysts**\n\n**$VTVT**\n\n**Drug:** *Azeliragon*\n\n**Date:** *Phase 2 Presentation On 4 November 2020*\n\n**$BLPH**\n\n**Drug:** *INOpulse delivery device*\n\n**Date:** *Phase 2 Data On 5 November 2020*\n\n&amp;#x200B;\n\n**Pre-Market Opening Watch List for 3 November 2020**\n\n***(This  list  should be mainly used by people who have access to 4am trading,  as that  is when the second run/pop is likely to occur, IF it occurs.)*** \n\n&amp;#x200B;\n\n***$ACOR $DGLY $IEA $JAKK $VISL***\n\n&amp;#x200B;\n\n***Creator of the Above Content (Slightly Edited By Me)***\n\nhttps://preview.redd.it/kdjt1oqjyww51.jpg?width=476&amp;format=pjpg&amp;auto=webp&amp;s=33081053599b107e345b6464442c02d4b4d01778",
        "subreddit": "pennystocks",
        "title": "After Hours News (2 November 2020, Just The Headlines), Penny Stock Earnings, Near Future Potential Catalysts and Pre-Market Opening Watch List for 3 November 2020",
        "url": "https://www.reddit.com/r/pennystocks/comments/jn0qdh/after_hours_news_2_november_2020_just_the/",
        "created": 1604394603.0
    },
    {
        "author": "Brothanogood",
        "created_utc": 1604340141,
        "id": "jmsln8",
        "num_comments": 186,
        "num_crossposts": 0,
        "selftext": "Apple announced on Monday an event for Nov. 10 where it’s expected to announce new Macs.\n\nApple said earlier this year that it planned to release Mac computers with its own Apple-designed chips based on ARM, instead of Intel processors. Apple’s iPhones and iPads have long used Apple-designed processors, which the company says helps extend battery life and provide faster performance.\n\nApple could launch a iMac desktop with a new design and laptops using Apple chips, according to a research note from TF Securities analyst Ming-Chi Kuo published earlier this year.\n\nMac sales have been a highlight for Apple during the pandemic. In the quarter ending in June, Apple reported $9 billion in Mac sales, which was up 28% year-over-year.\n\n[Source](https://www.cnbc.com/2020/11/02/apple-announces-event-for-nov-10-where-new-macs-with-apple-chips-expected.html)",
        "subreddit": "stocks",
        "title": "Apple announces event for Nov. 10 where new Macs with Apple chips expected",
        "url": "https://www.reddit.com/r/stocks/comments/jmsln8/apple_announces_event_for_nov_10_where_new_macs/",
        "created": 1604368941.0
    },
    {
        "author": "birdy10007",
        "created_utc": 1604292207,
        "id": "jmh8m5",
        "num_comments": 45,
        "num_crossposts": 0,
        "selftext": "I’m very worried I just bought a shit tone on the dip on Friday.\n\nTesla\nApple\nFacebook\nMicrosoft \nAMD\nINTC",
        "subreddit": "wallstreetbets",
        "title": "Do you guys think trump can still win the election.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jmh8m5/do_you_guys_think_trump_can_still_win_the_election/",
        "created": 1604321007.0
    },
    {
        "author": "hhh888hhhh",
        "created_utc": 1604379743,
        "id": "jn4bkd",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "This can’t be good news for [INTC](https://www.bloomberg.com/news/articles/2020-11-02/apple-to-hold-nov-10-event-to-announce-macs-with-own-chips) \n“The change highlights a crisis engulfing the world’s largest chipmaker. It has delayed a new manufacturing process, giving rivals a chance to catch up. These problems are at least partly behind Apple’s decision to move to in-house chips, although the company has been steadily shifting to this approach for years.”\n\nI was about to buy INTC at it’s current 52 week low price, but now I no longer know what to do. If it goes lower, 35$ looks like the next support.",
        "subreddit": "investing",
        "title": "Apple Inc.’s 15-year relationship with Intel Corp. will officially begin to unwind next week when new Mac computers are revealed.",
        "url": "https://www.reddit.com/r/investing/comments/jn4bkd/apple_incs_15year_relationship_with_intel_corp/",
        "created": 1604408543.0
    },
    {
        "author": "6ixSwings",
        "created_utc": 1604292020,
        "id": "jmh73z",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "title says it all. markets were pumped obnoxiously throughout the few months or so. my portfolio is eating shit. my calls vanishing in thin air. i want to hedge. regardless the winner and whoever they air on the news, I see the markets reacting, in a negative way. just like covid, when officially aired on the news, the markets reacted. here's my problem. i don't know which markets that will react to the news. for covid, it was the travel sector. not sure where my post is, but i bet roughly 3.7k on airlines and cruise line puts (RCL DAL UAL CCL) which accumulated to roughly 40k. that was my only win and lost it all. the first one is free and now I fully understand what that means. i followed some autist named wsbgod during the travel sector puts and now he has been banished. intel on stocks here on wsb has been pretty limited and disappointing throughout the last months or years for some of you. i learned a lot about options back during phase 1 covid days. im trying to duplicate that this week but not with covid news, but with what's happening in america this coming week.  the travel sector was given due to lockdowns and restrictions DUE to covid. now what markets will get affected DUE to the winner of the elections. \n\ntl;dr i need ticker symbols for puts IF markets reacts in a negative way to the election winner. let's just get rich. im tired of losing. just dead out tired. need a couple W's you fucking retards",
        "subreddit": "wallstreetbets",
        "title": "If Biden or Trump wins, how will markets react? and what puts are you buying?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jmh73z/if_biden_or_trump_wins_how_will_markets_react_and/",
        "created": 1604320820.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1604351118,
        "id": "jmw6mo",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Monday, November 2, 2020**\n\nStocks opened today’s session higher before paring some gains ahead of an extremely busy week, with market participants closely monitoring the results of the US presidential election, a meeting of the Federal Reserve, and the October jobs report, and rising coronavirus numbers in the US and Europe.\n\nAfter an extremely choppy day, the Nasdaq (QQQ) finished 0.22% up, the S&amp;P 500 (SPY) finished 1.11% up, and the Dow Jones (DIA) performed the best, finishing 1.56% up.\n\nOn Tuesday is the US presidential election between incumbent Donald Trump and Democrat Joe Biden. Needless to say, given the political divide, the coronavirus pandemic, and social unrest that exists in the United States right now, the outcome of this election will be extremely significant. According to a study done by Edward Jones, since 1932, the stock market has dipped 64% percent of the time the day after a presidential election. This likely reflects anxiety about the future if a large cohort of the population is unhappy with the election result. Regardless of the election result,  it's likely a large section of the population will be unhappy. Moreover, given the surge of early and mail-in ballots due to the pandemic, the possibility exists that the outcome may not be clear after Tuesday. This scenario would certainly cause a massive spike in volatility and uncertainty in the markets. According to the US Elections Project at the University of Florida, as of Friday of last week, around 85 million individuals have cast their ballots, over half of the total turnout in 2016. If this pace picks up, this election could have the highest voter participation rate in over 100 years.\n\nRegardless of the outcome, the election will have a number of consequences for Corporate America. For example, a change in the political control in either the Senate or the White House (which are Republican-controlled right now) could potentially alter corporate tax rates, increase or decrease regulation in some industries, affect trade relations with other countries, and changes in capital gains tax, which is important for market participants. Moreover, the outcome of the election will likely influence the timing and size of much-needed additional fiscal stimulus \n\nThe Federal Open Market Committee (FOMC) is set to hold the first of its two-day rate-setting meeting the day after Election Day, with the twelve FOMC meeting Wednesday and monetary policy statement and press conference from Federal Reserve Chair Jerome Powell on Thursday. Going off previous meetings, the Fed is virtually guaranteed to keep interest rates, near zero. After their last meeting in September, the Fed signaled that it would maintain interest rates are current levels until “at least 2023”. Throughout these meetings, FOMC members, including Powell, have increasingly escalated their calls for further fiscal stimulus to complement the Fed’s monetary support. In early October, Powell said, “too little support would lead to a weak recovery, creating unnecessary hardships for households and businesses.”\n\nOn Friday, the Department of Labor is set to release the October job report, a crucial piece of data to understand the state of the labor market and gauge the pace of recovery. According to Bloomberg consensus data, non-farm payrolls are expected to increase by around 600,000. While this estimate would the sixth month of net payroll gains, it would also be the four, straight month of deceleration, indicating the pace of recovery is slowing. The unemployment rate is also predicted to tick lower, from 7.9% to 7.6%. However, worryingly, there appears to be a trend towards long-term unemployment for many Americans. The number of individuals filing continuing claims, people filing for unemployment benefits who have already filed an initial claim, has continued to increase the past several weeks. This means that people who lost their job due to the pandemic are having an increasing harder time finding new employment quickly.\n\nThe US just set a new record for the highest seven-day average of daily new cases: 81,336 as of Sunday. That's the first time the number has ever topped 80,000, according to data from Johns Hopkins University. new cases are far exceeding new testing. Over the past week, new cases have increased 18%, according to Johns Hopkins. But the number of new tests performed has increased only 4.29%, according to the Covid Tracking Project. \n\nLast week, Europe recorded around 1.5 million new cases of coronavirus, a new record, according to data from Johns Hopkins. Trends are worrying across the continent now, including in countries such as Greece and the Czech Republic, where infection rates had been low until recently. Measures are tightening up everywhere. England, in response to the surge, announced a nationwide lockdown for at least the next four weeks.\n\n**Highlights**\n\n* Apple (AAPL) announced on Monday an event for Nov. 10 where it’s expected to announce new Macs that are powered by their own chips powered by ARM processors, instead of the Intel chips it had been using. Could impact Nvidia (NVDA) stock, which owns ARM chips, and Intel, who has not been doing very well lately, judging from last earnings report and stock price action (INTC).\n* Images for the updated Tesla Cybertruck could come next Musk, according to CEO Elon Musk.\n* Chinese electric vehicle maker NIO announced its October deliveries, and the number has shares on the move, again. NIO delivered 5,055 vehicles in October, doubling from a year ago. The result is doubly impressive because NIO very recently raised its manufacturing capacity to 5,000 vehicles a month. The company is selling all the cars it can make. This stock is an absolute monster and is one we love at PsychoTrader!\n* Alibaba (BABA), is doubling its Singles’ Day offerings this year, running the massive online sales event across two periods rather than one. Alibaba says it expanded the shopping window for Singles’ Day to provide more relief for merchants that have been hit hard by the pandemic. Single’s day is a counter to Valentine’s Day that celebrates being single. Normally it’s held on Nov 11. This is the world’s largest shopping festival. According to Fortune Magazine, BABA shipped $38.4 billion in gross merchandise value on Singles’ Day last year. Amazon’s Prime Day, by comparison, sold around $6 billion in goods last year.\n* Asian shares were mostly higher on Monday buoyed by further signs of recovery in China's manufacturing sector. The Caixin manufacturing PMI, a major indicator for China's manufacturing sector, rose in October, showing that domestic demand is holding up, reports said over the weekend.\n* Allegiant Travel (ALGT) upgraded by Morgan Stanley (MS) to $175 OVERWEIGHT. Stock currently around $131\n* Alibaba (BABA) target raised by Keycorp from $330 to $350 OVERWEIGHT. Stock currently around $310\n* ChampionX (CHX) target raised by Barclays from $16 to $19 OUTPERFORM. Notable because stock currently around $9\n* Carvana (CVNA) target raised by Morgan Stanley (MS) from $215 to $225. Stock currently around $190.\n* Floor &amp; Decor (FND) target raised by Raymond James from $75 to $100. Stock currently around $75.\n* Alphabet (GOOG, $GOOGL) target rasied by Argus from $1620 to $1850 at BUY. Stock currently around $1650.\n* Cloudfare (NET) target raised by two notable institutions. Stock currently around $53.\n   * Royal Bank of Canada frm $50 to $55 OUTPERFROM \n   * Oppenheimer from $55 to $65 OUTPERFORM \n* Peleton (PTON) target raised by Needham from $110 to $125 at BUY. Stock currently around $115. \n* Paypal (PYPL) target raised by Morgan Stanley (MS) from $210 to $229 at OUTPERFORM. Stock currently around $192.\n* Solaredge (SEDG) with massive target increase by Roth Capital from $191 to $300 at BUY. Stock currently around $266.\n* Vipshop (VIPS) target raised by Keycorp from $22 to $24 at OUTPERFORM. Stock currently around $21. This is one we have been looking at for a while\n\n\"Strive not to be a success, but rather to be of value.\" –Albert Einstein",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Monday, November 2, 2020. Please enjoy!",
        "url": "https://www.reddit.com/r/stocks/comments/jmw6mo/here_is_a_market_recap_for_today_monday_november/",
        "created": 1604379918.0
    },
    {
        "author": "hugosilvarocha",
        "created_utc": 1604310139,
        "id": "jmkmcv",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Hi, here some heads up for this week, we have 5 great stocks with ex-dividend date this week on the 05/11/2020.\n\n$MET - MetLife Inc with dividend yield of 4.49% and $0.46 pay per stock\n\n$BP - BP Plc with dividend yield of 12.16% and $0.31 pay per stock\n\n$CIT - CIT Group Inc with dividend yield of 4.90% and $0.35 pay per stock\n\n$PFE - Pfizer Inc with dividend yield of 4.06% and $0.38 pay per stock\n\n$INTC - Intel Corp with dividend yield of 2.86% and $0.33 pay per stock\n\nDon't forget to check this week video: [https://youtu.be/W1Vb95kIDlA](https://youtu.be/W1Vb95kIDlA)",
        "subreddit": "StockMarket",
        "title": "Best stocks with ex-dividend date this week.",
        "url": "https://www.reddit.com/r/StockMarket/comments/jmkmcv/best_stocks_with_exdividend_date_this_week/",
        "created": 1604338939.0
    },
    {
        "author": "esInvests",
        "created_utc": 1604285451,
        "id": "jmfmyi",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "October was a productive month while maintaining limited exposure into the end. Primary core products were IWM and QQQ. Speculative trade products were NFLX, ABBV, PFE, INTC, MOS, and / GC. Primary strategy (shocker) short puts. I also traded long calls, long call diagonals, and short calls. \n\nGoing into November, I will be managing a handful of trades that are threatened from the recent downmoves and positioning to take long stock on the short calls if there is a continued downmove. Otherwise, I will modulate risk keeping smaller exposure into the end of the year. I am ahead of my return schedule and have limited incentive to take unnecessary risk. \n\nI'm also looking to build out my veteran one on one schedule for November so if you are or know any veterans that would be interested in a 45min one on one session with me, drop me a line in the GForm below. If there's anything that anyone would like to see me cover, drop it in the GForm below. \n\nHow did everyone else make out in October? What would you have done differently? \n\nVideo review: [https://youtu.be/BYCZklqdMHg](https://youtu.be/BYCZklqdMHg)  \nGForm (no personal info required): [https://forms.gle/Ge5tEgzKjmfYj3SUA](https://forms.gle/Ge5tEgzKjmfYj3SUA)\n\n\\-Erik",
        "subreddit": "options",
        "title": "October Performance Review - 106% ROIC | 3.6% ROC",
        "url": "https://www.reddit.com/r/options/comments/jmfmyi/october_performance_review_106_roic_36_roc/",
        "created": 1604314251.0
    },
    {
        "author": "esInvests",
        "created_utc": 1604285496,
        "id": "jmfndh",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "October was a productive month while maintaining limited exposure into the end. Primary core products were IWM and QQQ. Speculative trade products were NFLX, ABBV, PFE, INTC, MOS, and / GC. Primary strategy (shocker) short puts. I also traded long calls, long call diagonals, and short calls. \n\nGoing into November, I will be managing a handful of trades that are threatened from the recent downmoves and positioning to take long stock on the short calls if there is a continued downmove. Otherwise, I will modulate risk keeping smaller exposure into the end of the year. I am ahead of my return schedule and have limited incentive to take unnecessary risk. \n\nI'm also looking to build out my veteran one on one schedule for November so if you are or know any veterans that would be interested in a 45min one on one session with me, drop me a line in the GForm below. If there's anything that anyone would like to see me cover, drop it in the GForm below. \n\nHow did everyone else make out in October? What would you have done differently? \n\nVideo review: [https://youtu.be/BYCZklqdMHg](https://youtu.be/BYCZklqdMHg)  \nGForm (no personal info required): [https://forms.gle/Ge5tEgzKjmfYj3SUA](https://forms.gle/Ge5tEgzKjmfYj3SUA)\n\n\\-Erik",
        "subreddit": "pennystocks",
        "title": "October Performance Review - 106% ROIC | 3.6% ROC",
        "url": "https://www.reddit.com/r/pennystocks/comments/jmfndh/october_performance_review_106_roic_36_roc/",
        "created": 1604314296.0
    }
]