[
    {
        "author": "___AJ___",
        "created_utc": 1588100205,
        "id": "g9t5h3",
        "num_comments": 55,
        "num_crossposts": 1,
        "selftext": "Marvell is developing the 5G chips Nokia will be using. They beat out Intel in this deal which is pretty significant. \n\nConsidering Nokia has earnings this Thursday before open, I'm almost certain they will mention their expansion into 5G and shine the light into their partnership with Marvell. Premiums are pretty reasonable at the moment too.\n\nhttps://www.reuters.com/article/us-nokia-5g-marvell/finlands-nokia-enters-5g-partnership-with-marvell-technology-idUSKBN20R2BL\n\nhttps://thefly.com/landingPageNews.php?id=2980744&amp;headline=MRVL;XLNX;NOK;SSNLF-Xilinx-ASIC-displacement-Nokia-cost-pressures-to-benefit-Marvell-says-Needham",
        "subreddit": "wallstreetbets",
        "title": "$MRVL is going to moon",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/g9t5h3/mrvl_is_going_to_moon/",
        "created": 1588129005.0
    },
    {
        "author": "Kant_sleep13",
        "created_utc": 1587127835,
        "id": "g31e2u",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Good morning, here's the watch list\n\nGap Ups: AMC, BA, DIS, GILD, JACK, LABU, LYV, MRNA, MSFT, PLNT, SOXL, TSLA, WYNN, XLNX\n\nGap Downs: NONE\n\nDay 2 plays: CODX, RCUS (day 2 means it had a strong day yesterday and could be in play today as well)\n\nSPY gapping right into the 50 day moving average. Many times the 50 DMA will act as resistance, hard to say in this market as QQQ moved right though it with ease. Most stocks are gapping with the market as well. We are seeing buying happening before earnings, ROKU had a real strong day yesterday as well as most of big tech names, individual stocks performing well. I added only the stocks I liked best but there are plenty of stocks to choose from. Business as usual, before you enter trades have defined risk to reward in mind. Good luck trading",
        "subreddit": "stocks",
        "title": "Stock Watch list April 17, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/g31e2u/stock_watch_list_april_17_2020/",
        "created": 1587156635.0
    },
    {
        "author": "Unhealing",
        "created_utc": 1588354255,
        "id": "gbmgeq",
        "num_comments": 1372,
        "num_crossposts": 0,
        "selftext": "Regardless of how stoned out of his mind he probably was during this most recent twitter incident, you can't deny that Elon's tweets have an air of WSB-tier autism to them. The grandiose edginess, the kamikazi-esque yoloing, general lack of any impulse control, etc. Tbqh I've always had some sort of inherent dislike towards Elon that I couldn't explain... but he's grown on me, in a weird way. I don't know why, there's just something quaint about his autism. I think I must find it familiar, comforting.\n\nWhat do you think are the odds that Elon lurks in this sub? I doubt we could ever coax him out of hiding, but imagine the sheer unbridled retard influence he might have left upon our community, right under our noses. Like a little guardian angel. He might even be that weirdo who gilds everyones posts in the discussion thread at odd hours of the night. That seems on-brand.\n\nAnyway, Elon, I'm sorry that I said the only cool thing about you is that you're dating an alien. After some reflection, I've come to realize that I have some deep-seated jealousy to work through. Retardation is, in a way, an art, and not everyone can ascend to be one of the greats. Indeed, it takes someone special to post a video of themselves drinking their own piss in their parents basement because SPY opened green, or to yolo into tweets self-destructive enough to bring the entire market down with them. I feel like an imposter among these gods. But they give me something to strive for... and I feel a bit humbled just by the knowledge of their presence.",
        "subreddit": "wallstreetbets",
        "title": "What are the odds that Elon Musk is one of us?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gbmgeq/what_are_the_odds_that_elon_musk_is_one_of_us/",
        "created": 1588383055.0
    },
    {
        "author": "sAfuRos",
        "created_utc": 1588546508,
        "id": "gd01t7",
        "num_comments": 1099,
        "num_crossposts": 0,
        "selftext": "Okay you gang of deluded retards, I'm going to drop some actual useful DD for you. tl;dr and positions at the top, because I know that for the majority of you, \"Fedex parked in front of White House, buy calls\", is as sophisticated DD as your deformed cuckold brains can handle. This is a long post so for those of you who actually want to understand why you're taking a position and learn about a commodity, read on; for those of you who don't, fuck off.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**TL;DR AND POSITIONS**\n\nTankers will have their best earnings call in at least 5 years, if not the last decade, due to all-time-high tanker rates that began spiking towards mid-March. Rates are so high that, say, companies with clean LR2 tankers currently run a spot price of 8x the 5 year historical average and 1 single 2 month voyage is enough to be profitable on the entire year. You're looking to make bets on tanker companies that are trading below their NAV, will post strong FCF, were well positioned for the spike in prices, have large fleets, and have the right types of ships. $NAT is literally the meme-iest stock because it's actually the worst across every single one of these dimensions of any tanker company.\n\n**TL;DR ON WHY NAT IS A MEME:**\n\nLet me draw you an analogy:\n\nWSB is a class in school, and you've all decided not to be homosexual for a day, and NAT is a girl in class. As a result, you all start sending her dick pics and showering NAT with attention, assuming that she is extremely high value. However, in your autistic haste, you all forgot to look around and actually there are 15 other girls in the classroom, and they are all way hotter than NAT. NAT is actually ugly and fat, but you're too busy tunnel visioning in on NAT while you beat off to realize that literally every option is better. As a result, NAT is now overvalued, but a bunch of you are stubborn fuckfaces who continue to shower her with attention because you're too autistic to admit you had no fucking idea what you were doing this whole time.\n\n**POSITIONS:**\n\n**Lowest Risk Position Examples**\n\n* EuroNav ($EURN) $12.50C 6/15\n* Scorpio Tankers ($STNG) $23C 6/15\n\n**Moderate Risk Positions**\n\n* $EURN $12.50C 5/15\n* $STNG $25C 5/15\n\n**Higher Risk Positions**\n\n* $EURN $15C 5/15\n* $STNG $30C 5/15\n\n**Legendary Autistic Risk Positions**\n\n* $EURN $17.50C 5/15\n* $STNG $35C 5/15\n* $NAT, any calls\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**SECTION 1: Overview on Oil Demand Crisis**\n\nIf you understand oil demand destruction and contango, skip ahead. However, based on the fact that people continue to pile in on USO and UCO calls and leaps under the justification of \"hurr durr oil must go up, right, so cheap\", and half of you are bagholding $NAT still, I assume 75%+ of you are retarded.\n\nMany of you still probably have no idea what's happening with oil and why it's fucked long-term. The tl;dr here is that even with OPEC+'s historical cuts, we're still drastically oversupplied. The problem with oil is it's not your meme SPY calls that are in the cloud; oil is a physical product and when you trade USO, you're trading (theoretically) on receiving delivery of oil. We are almost completely out of oil storage already.\n\nYou may ask, well [u/safuros](https://www.reddit.com/u/safuros/), if that's true, why don't we turn off the wells? Markets naturally handle supply and demand. Well, you worthless piece of shit, while your child-groping Honors Econ teacher may have drawn a graph once upon a time in high school when you still had the potential not to be a useless person as you are now, oil production isn't that simple. The reason every country is sandbagging and trying to get other countries to cut oil is that there's a game theory element in play, as well as an oil well intrinsic function issue.\n\nOnce oil wells reduce their production to roughly 50-60% of output, they *cannot go any lower* without risking destroying the well, which is extraordinarily expensive to get the rights to drill on and also is like throwing out a gallon of water when you've only taken a sip. Thus, the only option to reduce further is to entirely stop production and cap the well, and then, assuming your lease on the well hasn't lapsed by the time you can re-open it, uncap it, both of which are extraordinarily expensive. Therefore, most oil companies are far, far better off continuing to produce oil at a loss, because that's still a long-term better play than turning off. Moreover, why the fuck should you be the well to turn off, if other's aren't? Add in the fact that everyone cheats on oil production cuts and the Saudis and Russians are trying to fuck each other and the US in the ass, and you've got a nice oil crisis.\n\nThis leads to the USO/UCO shit show and negative WTI price. Normally, futures holders offload their contracts to buyers who intend to actually take physical delivery as the option expiration date draws near. However, because there is no storage and no demand, none of the typical buyers actually wanted to buy, so you had a bunch of tendie seeking autists desperately trying to offload their contracts so that they wouldn't have 5 dumptrucks of oil barrels delivered to their homes and be completely fucked, such that they were willing to *pay* people (i.e. negative price) to take their contracts. As for contango, well, google it.\n\nFinally, this problem isn't going away any time soon because unless you're so truly deluded as to believe that we'll not only have a V shaped re-opening in terms of social, commercial, and consumer behavior, but that fuel consumption across airlines and cars will rebound immediately, we're on a long term path to recovery, and we're already out of supply. This is like having a clogged bathtub full of water and turning the faucet from 100% on to 50% on - you're still fucked until the faucet turns off (impossible) or the clog goes away more than enough to offset the faucet (not happening for a while). This is why experts broadly agree that [the OPEC+ cuts are meaningless](https://www.worldoil.com/news/2020/4/21/opecplus-mega-deal-rendered-meaningless-by-demand-destruction) and that groups like Morgan Stanley believe [demand destruction of oil will persist until well into 2021](https://oilprice.com/Energy/Crude-Oil/Morgan-Stanley-Oil-Demand-Wont-Return-To-Normal-Until-End-2021.html).\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**SECTION 2: A brief overview of Tankers**\n\nYou don't need much of a brain to understand, given the above, why tankers stand to benefit from demand destruction. However, there are many types of tankers, and it's not as obvious as hurr durr buy tankers. Each tanker type carries a different type of product, has a different size, and commands a different rate. Here is the current rates:\n\n[3 key types of tanker business models, spread across a variety of tanker variants](https://preview.redd.it/hd3q2ncaqmw41.png?width=720&amp;format=png&amp;auto=webp&amp;s=fca616d8afc83afa14721af8e2e5bd1bf243fadd)\n\nAt this point I'm realizing that this post is getting way too long and i'm tired of typing it already, but do your own research on types of tankers. You can see though that tankers are commanding a stupidly high rate compared to their historical values:\n\nhttps://preview.redd.it/q8u5q1odqmw41.jpg?width=1081&amp;format=pjpg&amp;auto=webp&amp;s=5bc3668993ed1965a45f8c9af5a7a07f16e851b5\n\nThe current rates are so high that [one spot voyage is profitable on the entire year](https://www.tradewindsnews.com/tankers/tanker-rates-one-spot-voyage-makes-the-whole-year-in-red-hot-market/2-1-801368).\n\n&gt;\"If an MR can get $30,000 per day on a spot voyage, it covers its costs for a year...If an LR2 gets $150,000 or $160,000 a day, it’s the same...you could lay the ship up, earn zero for the next ten months, and still make a profit on the ship.\"\n\n&amp;#x200B;\n\n[Guess who owns the most clean-fuel ready LR2's that are exposed to the spot price? $STNG](https://preview.redd.it/iyeeu45gqmw41.jpg?width=894&amp;format=pjpg&amp;auto=webp&amp;s=b23175ca9c77eb406cadc5b01411c22545e72d59)\n\nNow, don't be stupid and assume that rates will hold this high all year. That said, even if rates went to $0 by mid summer, the rates for Q2 are so high such that it'd still be a higher revenue year than last year. And rates aren't going to $0...they're going to continue to stay above the historical average, just not as high as now, due to the crazy demand destruction.\n\n* **Miscellaneous point of clarification:** I see a lot of dumbasses posting about what numbers will look like if the entire fleet is booked out for, say, NAT. That's ridiculous and not how it works, so don't just go number of tankers x spot rate = revenue for year = tendies.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**Section 3: Why $STNG and $EURN?**\n\nI really need to go fuck your wife soon, so I'm making the sections shorter and shorter. But i'll still tell you way $STNG and $EURN are good bets. First, let's start with NAV - **N**et **A**sset **V**alue. If you don't know what this means, Google it.\n\nAs you (should) know, NAV is something you estimate and can be calculated differently based on different assumptions. Trading below NAV means the stock is underpriced as is, and that's before record earnings and guidance. By most accounts, $EURNs NAV is at least $13 currently, and $STNG is close to $30. They trade at $10 and $21, respectively, right now.  \n\n&amp;#x200B;\n\n[$STNG isn't even at it's average price for 2019, but 2020 is objectively a better year unless a meteor blows up their fleet](https://preview.redd.it/smsydzfnqmw41.jpg?width=2001&amp;format=pjpg&amp;auto=webp&amp;s=8b4de32295c00a853844ad5de51c44e7aeabbe0c)\n\nSecondly, fleet size and type. $STNG has one of the largest fleets in the world, and in particular, they have the most LR2 tankers. If you go back up to the graph, you'll see that clean LR2 tankers are commanding an absurd rate, spiking to as high as $250,000 for a few days and currently settled around $150-175k/day, compared to a 5-year historical value of below $25k. $EURN has a solid fleet of VLCC's which are commanding a strong rate, and EURN has good financials - most their boats are fairly new, they don't have a ton of debt.\n\nLastly, they're among the first up on the earnings block, with STNG reporting 5/6 this week and EURN reporting on 5/7. Compare that to NAT, who reports the 23rd, so theta will eat away at what remains of your atrophied testicles every day. That said, regardless of theta, STNG and EURN are really strongly positioned.\n\nI expect that earnings will be solid and likely beat, but not by a crazy amount because rates only started really jacking up in late March, and rates in early Q1 were actually pretty low. However, as many of you still don't fucking understand, **earnings don't matter nearly as much as** **guidance.** That's why you dumbfucks all complain about companies beating earnings but still tanking and then creating stupid conspiracy theories about \"MM is fucking rigging this market\". Guidance for tankers is going to be **euphoric**.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**Section 4: Why is $NAT a meme, and mistakes I see people making**\n\nUltimately, this comes down to people angling towards the right space (tankers) but you've been too stupid to do any research. You probably do this for all your bets, because you're a fucking autist, but you should stop.\n\n1. Fleet size misconception: Cramer meme'd NAT, infamously calling out that they have the largest fleet in the world. In fact, if you actually tried to verify anything you ever fucking did, you could have googled this and realized that NAT has a fleet that, just like your dick, is one of the smallest around. Moreover, they have the wrong type of boats - they primarily have Suezmax boats, which command an okay rate, but aren't close to the best boats to have right now.\n2. No investigation of NAV: NAT's NAV, by all accounts, is close to $3. They are trading at close to $6, and were nearing $8-9 at peak pump. Why the fuck on god's green earth would you buy a company with the wrong type of boats, the wrong fleet size, trading at over 2x NAV, when everyone else is around or below their NAV and has a better fleet?\n3. Massive debt and shitty assets: NAT is saddled in debt, is historically shittily managed (read their earnings report if you know how, but you probably don't know how), and all their boats are at the end of their lifetime, meaning NAT not only has horrible debt but will need to buy a shit ton of new boats very soon\n4. Stupid assumptions on revenue: We covered this earlier, but no, just because demand is high, it doesn't mean every boat is going to get booked at the spot price. Many boats are on existing contracted rates from last quarter, and the ones who are not are not all getting booked out at once.\n5. Looking at ATH as an indicator: If i see another one of you dumb fucks pointing out that NAT used to trade at $16 5 years ago, I will personally find you, tape you to a chair, and shit down your mouth. NAT has issued a shit ton more shares. You are probably the same group who thinks that USO went from $2 to $18 last week.\n\nThe ONLY justification for NAT is now that it's been memed and retail knows all about it, it will probably rise again if the other tankers do well. You can make that play, and you might even make money. Just make sure to dump that shit before earnings because they're not going to be good enough to justify the rise and there's going to be a stupid dump.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**MY POSITIONS:**\n\n\\- 40 $STNG 5/15 $23C\n\n\\- 200 $EURN 5/15 $12.5C\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**CONCLUSION:**\n\nFuck you",
        "subreddit": "wallstreetbets",
        "title": "[Serious] On the oil demand crisis and why you should buy tanker calls this week, but why $NAT is a meme you should dump",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gd01t7/serious_on_the_oil_demand_crisis_and_why_you/",
        "created": 1588575308.0
    },
    {
        "author": "Noexit007",
        "created_utc": 1588704021,
        "id": "ge3fgx",
        "num_comments": 669,
        "num_crossposts": 2,
        "selftext": "A 700k share sale was made by a single seller. This was likely an INTENTIONAL scare tactic to shock smaller buyers. It caused many stop losses to trigger which snowballed things.\n\nWhy would a seller do such a thing?\n\nSimple.\n\n1. The Whale sells 700k shares\n2. Stop losses are triggered making things worse\n3. Other buyers panic and sell (possibly even for losses)\n4. When the time is right and it's low enough, the whale buys back in chunks so the price doesn't sky again.\n\n5. Profit for the whale.\n\nBasically some person with 700k shares just punked a lot of investors into selling in one way or another so they could buy back cheaper.  There was no news. There was no reason for this drop.  Just investors trying to get the stock cheaper in later hours or after hours trading.\n\nEDIT:\n\nAdding a useful link from user u/Ex__\n\n&gt;For those who don't know this, is called a stop hunt:\n&gt;\n&gt;https://www.investopedia.com/terms/s/stophunting.asp",
        "subreddit": "pennystocks",
        "title": "For those wondering WHY MVIS dropped",
        "url": "https://www.reddit.com/r/pennystocks/comments/ge3fgx/for_those_wondering_why_mvis_dropped/",
        "created": 1588732821.0
    },
    {
        "author": "hdigga",
        "created_utc": 1588391710,
        "id": "gbzxft",
        "num_comments": 669,
        "num_crossposts": 0,
        "selftext": "**TL;DR**: China needs dollars badly, not gay little treasuries yielding 1%. They will not purchase treasuries at the next auctions and interest rates will spike. Chaos in the bonds market will lead to chaos in the stock market. Bears,go in for the kill. Bulls, close your long positions on the 11th and reopen them at noon on the 13th. What makes this play so beautiful is just how well it can be timed. $TLT ATM put 5/15 purchased 5/11.\n\n&amp;#x200B;\n\n*\\*\\*Automod didn't like the full post, I'm going to be editing this together in parts to figure out what word or phrase is triggering it, bare with me here\\*\\**\n\nThis post will start off with some ECON 101 shit for the autists who never learned the basics. If you already know why bond prices move in  the opposite direction as interest rates and why China buys so much US debt, then skip ahead. The bond market dwarfs the size of the stock market, there is about 9 times as much outstanding bond value as there is total market cap. Bonds are where the big boys play.\n\n&amp;#x200B;\n\n# Interest rates and bond pricing\n\n**When interest rates rise, the prices of old bonds fall, and when interest rates fall, the prices of old bonds rise.**\n\nConsider a zero coupon bond, one where you pay a certain amount and at the end of the bond term you get paid back more (unless you’re a cucked German bond buyer). For a one year bond with a 5% yield, you would pay$95.24 for the privilege of redeeming the bond for $100 in one year\\[Formula:(end value – price)/price = interest rate\\]. But what if the next day interest rates fall to 3%? The bond you just bought suddenly looks a lot more attractive. Its yielding a lot more than the bonds the suckas are buying today. If you turned around and sold it the next day, you could scalp off the extra yield and sell it as though it were 3% bond. Using the same formula, you could sell it for $97.04. Nice. If on the other hand, the interest rate rose to 7%then everyone trying to make a buck would want the bonds they buy to yield 7%. In order to sell your 5% bond, you would have to take a loss to make it attractive. The new price of the same bond would be $93.48.\n\n**The sensitivity of a bond’s price to interest rates, depends on the bond’s time to maturation.**\n\nThe more years a bond has to collect interest, the more the rates affect the bond’s price. Consider a bond that pays 5% a year, compounded annually. In practice, only savings bonds compound, but any bond can be recalculated as if they compound. That bond would cost $231.38 and pay out$1000 at maturation \\[Formula: end value = price \\* interest rate \\^ years\\]. If the next day, interest rates increased to 7%, U R FUK. That bond would now sell for a paltry $131.37. If interest rates fell to 3%, your investment would nearly double to $411.99. If they fell to 1% you could sell that bond for$741.93. Damn WSBGod. That’s the power of compound interest. Below in the DD section, there’s a more realistic graph showing approximately how $TLT will respond to interest rate movements.\n\n**Interest rates depend upon supply and demand for a bond.**\n\nThe fundamental rule of microeconomics: prices are set by supply and demand. Therefore, the discount and interest payments of a bond depend crucially on what market participants want, their *demand*.  Suppose you know a company, Widgettech, that sells widgets is run by a  complete moron and that Widgettech is trying to raise capital by selling bonds. There’s another company WidgetDotCom, run competently, that currently sells their zero coupon bonds with a 3% discount. Would you buy Widgettech bonds at 3%? Hell no. You need to receive a premium for that. The same is true for government bonds: th eUS 10 year is trading at 0.6% interest while the Brazilian 10 year is trading at 8% interest. Investors need to be compensated for the risk that Brazil can’t pay them back. Demand for crappy bonds is low. Demand for good bonds is high\n\n*Supply* is another fundamental issue. If you want $100 to YOLO, you could probably get a loan from your dad. If you want to YOLO $10 million you’re going to need to look elsewhere. The larger the loan you want, the more market participants you’re going to need to engage. To get that  $10 million you’re probably going to need to put your tin cup before a bunch of banks and all your friends and family. To make them pay any attention to you, you’re going to need to make them a damn good offer. It can’t be the “I’ll pay you back next week” that you might do with your dad. It would have to be “I’ll pay you back an additional 50%.” When a company or nation wants to take on substantially more debt, they will need to raise the interest rate to get more people to drop some change in the tin cup they’re rattling.",
        "subreddit": "wallstreetbets",
        "title": "The Bond Market Crash Begins on May 12th and 13th",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gbzxft/the_bond_market_crash_begins_on_may_12th_and_13th/",
        "created": 1588420510.0
    },
    {
        "author": "ArganButterOil",
        "created_utc": 1588421079,
        "id": "gc5co7",
        "num_comments": 650,
        "num_crossposts": 0,
        "selftext": "Hello everyone, it is my first post here so please go easy on me.\n\nCame across an article today on Business Insider Singapore that the Buffet Indicator divides the total value of publicly trading stocks by quarterly GDP. At this point in time, it has climbed to a record high and it is used to gauge whether the stock market is overvalued or undervalued.\n\nExamples, it surged to 118% before the dot-com bubble burst in 2000 a, and topped 100% before the 2008 financial crisis.\n\nIt now sits at 179%, question is, can we rely on this measure? Looking forward to hearing from the community.\n\nSource:\nhttps://www.businessinsider.sg/buffett-indicator-surges-record-high-signaling-potential-crash-2020-4?r=US&amp;IR=T",
        "subreddit": "stocks",
        "title": "Buffet's stock market indicator is signalling an imminent crash",
        "url": "https://www.reddit.com/r/stocks/comments/gc5co7/buffets_stock_market_indicator_is_signalling_an/",
        "created": 1588449879.0
    },
    {
        "author": "BobaAmerican",
        "created_utc": 1588954988,
        "id": "gfw84z",
        "num_comments": 632,
        "num_crossposts": 0,
        "selftext": "I know many of us here are confused by the apparent disconnect between the market and real boots on the ground economy. A report just came out showing over 20.5 million Americans lost their jobs in April. We're now at a a top level unemployment rate of 14.7%. The Dow is up over 350 points as I type this.\n\nWhat CNBC and other media outlets won't tell you in their hacky \"[Why the stock market is up even with historic job losses](https://www.cnbc.com/2020/05/08/why-the-market-is-up-even-with-historic-job-losses.html)\" articles, is that quite a few public companies can weather the storm, while many main street businesses will close permanently. In other words, large corporations are essentially \"buying out\" these small businesses in the long run. Throw in automation and an increasingly specialized workforce, and we are witnessing the acceleration of the 4th industrial revolution, which ultimately benefits Wall Street.\n\nWhile everyone's distracted with bitter partisan politics, global mortality leaderboards and the usual nonsense in popular media, the largest wealth exchange in history is going completely unnoticed right under our noses. I don't think many of us plebs can appreciate the magnitude of what's going on. If I was a conspiracy theorist, which I most definitely am not, I would say they couldn't have dreamt up a more perfect scenario for the wholesale theft of main street businesses.\n\nI don't have time to get into the numbers, but that's the gist of it. The smart money knows this. While we may see more dips in the coming months, you can be sure the corporate titans will come out on top as they always do.",
        "subreddit": "investing",
        "title": "Why the stock market is going up even as unemployment goes up",
        "url": "https://www.reddit.com/r/investing/comments/gfw84z/why_the_stock_market_is_going_up_even_as/",
        "created": 1588983788.0
    },
    {
        "author": "Misterangry11",
        "created_utc": 1588858606,
        "id": "gf6ofa",
        "num_comments": 602,
        "num_crossposts": 0,
        "selftext": "Then Berkshire Hathaway has their annual meeting and [Buffett](https://youtu.be/ofuItaTVzC8) says he sold out his ENTIRE position in the airline industry !! And to top it off he actually sounds scared of the market at these prices. Sitting on 134 BILLION IN CASH.  Part of me wants to sell all my stocks now and wait for the crash, other part just wants to hold and see what the fuck happens since Murphy’s law has always fucked me over.",
        "subreddit": "StockMarket",
        "title": "Stock market has basically recovered completely. The economy is suffering huge. Record unemployment. WHAT IN THE ACTUAL FUCK IS GOING ON!?",
        "url": "https://www.reddit.com/r/StockMarket/comments/gf6ofa/stock_market_has_basically_recovered_completely/",
        "created": 1588887406.0
    },
    {
        "author": "astrophysics23",
        "created_utc": 1588637712,
        "id": "gdnell",
        "num_comments": 569,
        "num_crossposts": 0,
        "selftext": "During one of the coronavirus task force briefings, an admiral came up and detailed how he was getting ventilators into the system. Much of the press was outraged when he detailed it out because the government was using a middle man that was profiting off it. The admiral’s response? “My job is not to invent a system. My job is to put volume in the system.”\n\nSuch is the realities of leadership in a time of crisis.\n\nSo. When the Fed went into ‘save everything mode,’ they did so with a desire to unfreeze credit markets and make sure markets functioned. Powell’s job was to put volume into the system.\n\nThat system now has volume. And plenty of it. Everyone is buying everyone else’s debt. Disney wants five billion for a year? Wells Fargo says ‘COUNT ME IN.’ Boeing is issuing bonds? ‘IT’S A RAID,’ says every person with access to debt markets. Delta can’t fly 10% capacity this quarter. People buy their debt like it’s the liftoff of the 747.\n\nSo the system now has ample volume going back and forth. Everyone’s leveraged to the tits in new debt. What could possibly go wrong?\n\n30-50 million unemployed is what’s wrong.\n\nAlready high household debt continues to skyrocket as new income falls off a cliff is what’s wrong.\n\nReckless debt issuance and a borrowing system that never really reset after 2008-9 is what’s wrong.\n\nIn what will likely go down as the dumbest FOMO among smart money of all time, every major institution has tried its best to get in on every company’s debt offerings. But what happens if Delta sees just 30% of flying traffic in the third quarter? What if California and France refuse to open Disney’s parks until early July and shut them down again in September as precaution? And would anyone really be surprised if Boeing doesn’t get the 737 max off the ground until 2021?\n\nThese events have a decent probability of happening. And such companies as Delta and Boeing may not be able to service their debt at the end of 2020 if, say, we have to shut everything back down to prevent a second wave.\n\nNot every bond holder is going to get screwed. But the rate of defaults on loans is going to be much higher than the laughable estimates JPM and Well’s have set cash aside for.\n\nLet’s keep in mind: it wasn’t the Fed’s job to invent a new system. Its job was to keep the current system functioning.\n\nSo what is the system they’re pumping? The debt system. And all they’ve really done is re-inflate a debt bubble to a much bigger size than it was in February. And given the details released today by the Fed essentially announcing they'll be buying HYG and LQD, this bubble is growing to hindenburg-sized levels.\n\nWith people putting their rent on credit cards, our system is just surviving right now. But what happens in wave two?\n\nBoeing can’t pay its coupon as Delta withdraws all orders so it can attempt to service debt too big to pay itself. An empire like Disney looks at risk for shuttering. Restaurants are seen as germ lands by the average consumer and nobody goes dining in for several years. Housing construction companies simply cannot survive the epic demand and supply destruction with defaults on mortgages skyrocketing as well. Fannie and Freddie make 2008 look like a prelude to the real story. And the Fed may have to try and get out of HYG as companies in the ETF fail and they have to preserve tax payer dollars as per their legal obligation, which will only further feed the negative feedback loop.\n\nAt Buffet’s shareholder meeting saturday, he praised Powell’s speed to get credit markets functioning again. On top of that, he said March was the highest bond issuance month of all time, followed by April breaking that record.\n\nBut here’s what’s interesting in what he said: “We don’t know what the consequences of this will be.”\n\nSo perhaps we are somehow able to punt the debt bubble pop down the road by allowing all loans to defer for extended periods. Perhaps the US government is able to find some way to write off certain types of debt in a last resort effort to avoid economic catastrophe. They will certainly get creative as everyone becomes desperate. But in all likelihood, these kinds of ideas are untenable without resulting in extreme damage to other segments of the economy.\n\nWe are on the brink of the debt bubble collapse. And given a second wave, we will create a negative feedback loop that will slump the United States Markets for years.\n\nI don't believe we will have a 10 year great depression. We learned so much from that time period and we will use that knowledge to recover faster, and maybe even better. But like the civil war, world war one, and world war two: everyone thought at the beginning of each outbreak it was only going to last a few months. We think the same thing now about this crisis.\n\nTL;DR: Often when you are operating in a paradigm you don’t realize the flaw of that paradigm until you are forced to shift into a new paradigm. The debt bubble paradigm is about to shift, but not before it pops.",
        "subreddit": "wallstreetbets",
        "title": "Why The United States Cannot Shut Down For A Second Wave Even Though It Will",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gdnell/why_the_united_states_cannot_shut_down_for_a/",
        "created": 1588666512.0
    },
    {
        "author": "MaxAds1",
        "created_utc": 1588893638,
        "id": "gfhmnn",
        "num_comments": 556,
        "num_crossposts": 0,
        "selftext": "I will eat a handful of sand and upload it here. If y’all would rather see something else throw a suggestion out.\n\nIf spy opens under 286, I will pick one random commenter and buy them something of their choosing within reason. 1-200 dollars.\n\nSpoiler alert, whatever you choose doesn’t matter, it’s going to be a dildo. \n\nI bet pretty heavy on a red day for tomorrow.\n\nSPY 286p x 50 5/8, SPY 288p x 30 5/8, MSFT 182.5p x 120 5/8, IWM Credit Call Spread 127.5/128 x 100 5/15.\n\nThere’s a million ways to fuck this goat, I’m just holding the legs.",
        "subreddit": "wallstreetbets",
        "title": "If SPY opens above 286",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gfhmnn/if_spy_opens_above_286/",
        "created": 1588922438.0
    },
    {
        "author": "kafkagoeswest",
        "created_utc": 1588800987,
        "id": "get5pu",
        "num_comments": 554,
        "num_crossposts": 0,
        "selftext": "TLDR: we're all sheep heading to the slaughter.\n\nWhat do you remember about March 23rd, 2020? If you're on this sub, you remember the sky was falling, we were facing systemic collapse, and we were trading around 18,000 on the Dow Jones, under 2200 on the S&amp;P. The chart looked like this:\n\n[End of week March 20th](https://preview.redd.it/bupxssadn7x41.png?width=1300&amp;format=png&amp;auto=webp&amp;s=6c85dbdef1e3d68a93b5a4972168df2100340943)\n\nSince then, the Fed has announced trillions in monetary stimulus, numerous programs, the SEC relaxed all sorts of rules, Congress passed 2 trillion in relief, and markets have rallied a historic amount. All bullish things, yes. But how bullish can they be, amidst a 1Q GDP blowing by the expected -3.5% to -4.8%, disastrous earnings reports, 30 million jobless claims in that same timespan, the oil sector CRASHING and trading negative for the first time ever, every economic forecasting model projecting a longer and deeper recession than previously thought, as well as every standard data point (ISM, housing, manu, etc) being more negative than the expectation. For every positive event the market has seen, there have been numerous negative events and data points, and yet this market has rallied at a historic rate: even the NASDAQ is now positive for the year. 6000 points in the Dow Jones. the S&amp;P has rallied nearly 700 points off the lows.\n\nSO let me ask that question again: what do you remember about march 18th? Well, how about this to refresh your memory:\n\nhttps://preview.redd.it/5sjcbrhkm7x41.png?width=1850&amp;format=png&amp;auto=webp&amp;s=6614cc36bb9fa85c4a0d66f8fb0a09fe0aed29e4\n\nSo, let's take a look at the chart since March 23rd, the day humans were no longer allowed to be on the trading floor, the day we decided, okay we'll trust the computers and do everything digitally, we can trust those billionaires and Market Makers and institutions regulated by a government whose very survival depends on the markets going higher regardless of the economic devastation they're going through. Let's take a look at the chart THE EXACT DAY the human element of trading was removed: \n\nhttps://preview.redd.it/n2a8qb7np7x41.png?width=2399&amp;format=png&amp;auto=webp&amp;s=15f58eb9435214ff3691fd1f81bf2af3af6037f1\n\nYahoo Finance sucks, but I like the color feature and percentage filled in for you: a 23.58% gain. Fucking ROCKET ship. Disney has disastrous earnings, fuck it let's stay above 100. GDP blows by expectations at probably the biggest surprise in history comparing real number versus expected? Fuck it let's moon. Powell keeps printing, right, that's driving it higher, right? \n\nNo. What's driving it higher, is MMs and HFTs using programs to inflate the stocks. Retail traders make up a sliver of volume and portion of the markets. If you think some college kid YOLOing his stimulus check on options is what's bringing this market money, you're smoking crack and exactly the kind of autist we expect here on WSB. But if you're able to think critically for yourself, you'll realize why this is the biggest con we're going through:\n\nPension funds (federal state and local), Billion dollar university endowments, financial investment institutions, Hedge Funds, hold the vast majority of wealth in the markets, and they have decided along with the government, to fuck fundamentals, fuck reality, fuck the real economy, we're going to inflate the shit out of these markets and prop them up. Algorthimic trading from HFTs can easily manipulate buys back and forth. The SEC has removed all sorts of rules and regulations, and the government is going to intentionally turn a blind eye, because Capitalism itself was at stake. They're letting the market makers dictate their own reality, and we have severed ourselves from all fundamentals. \n\nSo what are the implications? For one, the market is going to trend higher until some big dog up top says it's time for a taste of reality. My guess is honestly when people return to the floors, and these funds and players have all properly hedged and prepared. They're doing some illegal shit, insane manipulation, and they're going to get away with it. To fight them, is to fight the system, and some WSB autist or Robinhood options trader aren't ever going to win that battle. One of two things is going to happen: they're going to get away with it and we accept the reality of living in a rigged market, the free market being completely dead, OR: someone comes out with a documentary exposing all this a few years from now, and gets depressed and commits suicide with a bullet to the back of their head. \n\nThe con is in, the rigging has been done, jump on board or be crushed by the corrupt who wield all that power. Prepare to do nothing but shop online with Amazon and Wayfair. Prepare to eat your veggie meat to feed the world in Beyond Meat, prepare to always watch your content heavily regulated by the Mouse, prepare to live on an internet censored by Big Tech pro China companies, and  watch as all those people who can live free thanks to Jeffrey Epstein's suicide live like gods above you.",
        "subreddit": "wallstreetbets",
        "title": "You are living in the greatest con of all time. An explanation of how this market is rigged and tied to Corona",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/get5pu/you_are_living_in_the_greatest_con_of_all_time_an/",
        "created": 1588829787.0
    },
    {
        "author": "closingbell",
        "created_utc": 1588346379,
        "id": "gbk13c",
        "num_comments": 526,
        "num_crossposts": 0,
        "selftext": "Gotta love it...LOL\n\nhttps://www.cnbc.com/2020/05/01/tesla-ceo-elon-musk-says-stock-price-is-too-high-shares-fall.html",
        "subreddit": "stocks",
        "title": "Elon Musk says \"stock price is too high\" - shares tank 7%",
        "url": "https://www.reddit.com/r/stocks/comments/gbk13c/elon_musk_says_stock_price_is_too_high_shares/",
        "created": 1588375179.0
    },
    {
        "author": "Dc1993x",
        "created_utc": 1588646120,
        "id": "gdpjk6",
        "num_comments": 520,
        "num_crossposts": 0,
        "selftext": "Seriously.. short selling was literally not allowed today...\n\nI decided to post this because I noticed that lot of people on this sub are unaware of how exchanges such as NYSE, NASDAQ, etc. operate\n\n**Here are the facts:**\n\n* After the financial crisis, the SEC created rules to help protect long-term investors \n* This was done to maintain investor confidence &amp; to prevent large intra-day crashes\n\n **Don't believe me? See for yourself:**\n\n*  [https://www.sec.gov/rules/final/2010/34-61595.pdf](https://www.sec.gov/rules/final/2010/34-61595.pdf) \n\n**I know you lazy fucks aren't going to read that, so let me summarize:**\n\n* If a security drops more than 10% in a day, a short sale circuit breaker is triggered\n* The breaker lasts 2 days (current day through end of \"next-day\" trading session)\n* The rule gives priority to long sellers and imposes an uptick rule on additional short sales\n* An uptick rule means that to sell short, your \"ask\" must be at least 1 tick higher than the current \"national best bid\"\n\n**Here's a quote directly from the SEC document:**  \n\n*\"We believe it is appropriate at this time to adopt a short sale-related circuit breaker because, when triggered, it will prevent short selling, including potentially manipulative or abusive short selling,   from driving down further the price of a security that has already experienced a significant intraday price decline, and will facilitate the ability of long sellers to sell first upon such a decline.\"*\n\n**Why is this important?**\n\n* Because price can't be driven down further for at least 2 days\n* This usually leads to a rebound / reversal rally\n\n**Let's take a look at what happened to Tesla**\n\n* Tesla triggered the circuit breaker at 11:39 on Friday\n\n*Proof:*  [https://www.nasdaqtrader.com/dynamic/symdir/shorthalts/shorthalts20200504.txt](https://www.nasdaqtrader.com/dynamic/symdir/shorthalts/shorthalts20200504.txt) \n\nhttps://preview.redd.it/6acn6f7mwuw41.png?width=413&amp;format=png&amp;auto=webp&amp;s=33183220d4518cac36c60c1ed16365b0f01c3dfa\n\n**What was the price at 11:38?**\n\n* Approximately 700\n\nhttps://preview.redd.it/ongs8yv7xuw41.png?width=610&amp;format=png&amp;auto=webp&amp;s=086624c2c85a6c52638cce3700b607c47bda714e\n\n**Now let's take a look at what happened the rest of the day:**\n\n* Notice how it struggled to stay below that amount\n\nhttps://preview.redd.it/ifx5d9ylxuw41.png?width=556&amp;format=png&amp;auto=webp&amp;s=c35d86719342773c0ea3093fc93db25022d95a33\n\n**Now what happened today?** \n\n* Tesla mooned to 769... 10% gain\n* Without any downward pressure, the rebound easily gained momentum and continued throughout the day\n\n**Before you criticize me.. I'm fully aware that there are other rules / regulations that also play a role.. I just wanted to point out one of the reasons why Tesla mooned today..**\n\nIf you want to beat the exchange, you need to understand every rule... inside and out",
        "subreddit": "wallstreetbets",
        "title": "TSLA mooned today because short selling was BANNED",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gdpjk6/tsla_mooned_today_because_short_selling_was_banned/",
        "created": 1588674920.0
    },
    {
        "author": "agebronze",
        "created_utc": 1588680731,
        "id": "gdwlzc",
        "num_comments": 490,
        "num_crossposts": 0,
        "selftext": "You're supposed to exit the curve when it gets better than when you got in, not worse. \n\nTexas entered with less than 100 identified cases. Exits with 1000 a day.\n\nFlorida started with less than 100 a day too. Exists with 800 a day. \n\nI can keep going on. Even in March I wasn't as pessimistic as today - I assumed the worse will be either sensible lockdown until it's over, or half a million dead. \n\nSeems like the direction is getting both at the same time, and then probably getting stuck in a swedish deadlock: Sweden didn't reach herd immunity, they didn't lockdown but there's no public trust in going out so they are stuck at constant infection rate at the equilibrium between public fear and virus spread. \n\n [https://www.worldometers.info/coronavirus/country/sweden/](https://www.worldometers.info/coronavirus/country/sweden/) \n\nsee the wave-like graph with 7 days cycle? That's the feedback loop of fear=&gt; spread reduces =&gt; easing of fear =&gt; spread resumes =&gt; fear. \n\nSweden can't say they are reopening to ease up economic burden because there is nothing to reopen. Reopening is just a rug pull to the poor - from now on, you're on your own economically.",
        "subreddit": "wallstreetbets",
        "title": "Just like WSB buying high and selling low, states reopen with more sick people than when they closed",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gdwlzc/just_like_wsb_buying_high_and_selling_low_states/",
        "created": 1588709531.0
    },
    {
        "author": "IGkingofengagement",
        "created_utc": 1588941682,
        "id": "gfshkh",
        "num_comments": 482,
        "num_crossposts": 0,
        "selftext": "Forecasts expected it to be 16% \n\nSource: https://www.bls.gov/news.release/empsit.nr0.htm",
        "subreddit": "investing",
        "title": "US unemployment rate reaches 14,7% in April",
        "url": "https://www.reddit.com/r/investing/comments/gfshkh/us_unemployment_rate_reaches_147_in_april/",
        "created": 1588970482.0
    },
    {
        "author": "hooverFlags",
        "created_utc": 1588798395,
        "id": "gesc4c",
        "num_comments": 468,
        "num_crossposts": 0,
        "selftext": "Thats it for me boys. I finally admit i have a gambling problem. In the past year and a half, ive lost almost 40k, which, for someone whos living somewhat paycheck to paycheck, thats not nothing. \n\nStarted off playing every 2 weeks when my paycheck came in and before i knew it, i lost 20k. Had 5k left and yolod it and lost it again. Took a break and was supposed to be done with trading and options but reading here gave me an itch seeing so much gain porn, so after saving up 5k, i tried it again and lost it all. I swore i was done.\n\nI became frugal as shit and started doing side jobs to start my savings back up, but seeing my balance sitting there at 8k making shit for interest, i decided to play it safe with the wheel strategy. After being assigned and seeing all gains wiped in one go, i said fuck it, yolod it on some tsla puts when musk saud the stick price was too high. Go figure, stonks only goes up.\n\nUnless tsla dies and goes to 680s, im giving up on trading. Good luck to everyone, and a word of advice to people who arent already wealthy with money to blow. Youre way more likely to blow up than you are to hit those 10 baggers.",
        "subreddit": "wallstreetbets",
        "title": "Deleting everything including reddit to stop my gambling addiction.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gesc4c/deleting_everything_including_reddit_to_stop_my/",
        "created": 1588827195.0
    },
    {
        "author": "soAsian",
        "created_utc": 1589215807,
        "id": "ghraem",
        "num_comments": 432,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Mnuchin says he’s comfortable spending $3 trillion because Treasury can lock in very low rates - I'm glad my grand children gonna pay for it.",
        "url": "https://www.cnbc.com/2020/05/11/mnuchin-says-hes-comfortable-spending-3-trillion-because-treasury-can-lock-in-very-low-rates.html",
        "created": 1589244607.0
    },
    {
        "author": "zjz",
        "created_utc": 1588794695,
        "id": "ger55c",
        "num_comments": 432,
        "num_crossposts": 0,
        "selftext": "I have no idea what this does. Let's try it shall we?",
        "subreddit": "wallstreetbets",
        "title": "5/6 Earnings Collection Thread",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ger55c/56_earnings_collection_thread/",
        "created": 1588823495.0
    },
    {
        "author": "Panosmek",
        "created_utc": 1588423319,
        "id": "gc5tfm",
        "num_comments": 412,
        "num_crossposts": 0,
        "selftext": "Warren Buffett’s Berkshire Hathaway Inc. spent the first quarter building up cash as the coronavirus slowdown started to grip the U.S.\n\n* Berkshire ended the period with $137 billion of cash, a record for the conglomerate. That was up almost $10 billion from the end of 2019, while the famed investor spent just a net $3.5 billion buying shares of his and other companies.\n\n### Key Insights\n\n* Buffett, Berkshire’s chairman and chief executive officer, has been on the hunt for higher-returning investments such as acquisitions or stock purchases for years, but has struggled amid what he called “sky-high” prices.\n* Buffett will host Berkshire’s annual meeting virtually on Saturday, starting at 3:45 p.m. in Omaha with key deputy Greg Abel by his side. Buffett’s longtime business partner, Charlie Munger, won’t be in attendance. Follow the TopLive blog here.\n* Berkshire’s first-quarter net income plunged to a loss of $49.7 billion, driven by unrealized losses in the massive stock portfolio.\n* Berkshire bought $1.8 billion of stocks on a net basis in the period as the market plunged amid widespread fallout from Covid-19.\n* Berkshire took a more cautious approach to stock buybacks in the first quarter, repurchasing just $1.7 billion. It spent a [record](https://www.bloomberg.com/news/articles/2020-02-22/buffett-spends-record-2-2-billion-buying-up-berkshire-shares) $2.2 billion on buybacks during the last three months of 2019.\n\nSource:  [https://www.bloomberg.com/news/articles/2020-05-02/buffett-stays-on-the-sidelines-amid-market-tumble-as-cash-climbs](https://www.bloomberg.com/news/articles/2020-05-02/buffett-stays-on-the-sidelines-amid-market-tumble-as-cash-climbs)",
        "subreddit": "investing",
        "title": "Warren Buffet's Cash Pile Surges to Record $137 Billion",
        "url": "https://www.reddit.com/r/investing/comments/gc5tfm/warren_buffets_cash_pile_surges_to_record_137/",
        "created": 1588452119.0
    },
    {
        "author": "just_eat_my_ass",
        "created_utc": 1588642341,
        "id": "gdolv5",
        "num_comments": 411,
        "num_crossposts": 0,
        "selftext": "It’s like no bad news matters anymore. Unemployment, oil, new deaths, trillions borrowed more by the fed, etc. Nothing seems to shake the market. Just look at today. Started red and rallied like crazy. Why? Things aren’t returning to normal anytime soon. It just doesn’t make any sense.",
        "subreddit": "options",
        "title": "Does anyone else think the rally of the past month is just ridiculous?",
        "url": "https://www.reddit.com/r/options/comments/gdolv5/does_anyone_else_think_the_rally_of_the_past/",
        "created": 1588671141.0
    },
    {
        "author": "speaknovel",
        "created_utc": 1589163632,
        "id": "ghew38",
        "num_comments": 372,
        "num_crossposts": 0,
        "selftext": "In 2019 investors pulled their money out of the stock market en masse in reaction to the yield curve inverting and the high interest rates that caused the market to dip in Sep, 2018. \n\nThey never put it back in, rather stock buy-backs fueled the 2019 and 2020 rally. \n\n[https://www.bloomberg.com/news/articles/2019-09-23/biggest-ever-move-out-of-stocks-could-foreshadow-gains-ahead](https://www.bloomberg.com/news/articles/2019-09-23/biggest-ever-move-out-of-stocks-could-foreshadow-gains-ahead)",
        "subreddit": "investing",
        "title": "A record 1.1 Trillion left stocks 1 year before the crises started. Rising stock prices in 2019 and 2020 were the result of stock buy-backs and mergers, not investor inflows.",
        "url": "https://www.reddit.com/r/investing/comments/ghew38/a_record_11_trillion_left_stocks_1_year_before/",
        "created": 1589192432.0
    },
    {
        "author": "Sasuke797979",
        "created_utc": 1589258262,
        "id": "gi466g",
        "num_comments": 341,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Why didn’t I do it 😭",
        "url": "https://i.redd.it/a3e7a919j9y41.jpg",
        "created": 1589287062.0
    },
    {
        "author": "expander2",
        "created_utc": 1588693690,
        "id": "ge06g7",
        "num_comments": 338,
        "num_crossposts": 0,
        "selftext": "Hello you dirty little bastards it’s me, u/expander2 from the DD summaries that clog up your feed three times a week. I'm here with something a little different from what I normally do. I’m gonna learn ya how to play earnings like the big shots down in NYC. Okay not really like them but I am going to teach you how to do it like you aren't the stupidest crayon in the pencil box.\n\nSo let me lay out a little table of contents for you first. I am going to;\n\n* Explain what goes into picking a play\n* Go through how to know when to sell and when to have diamond hands\n* Show some examples of earnings plays I have advocated for in the past\n* Give general pointers/ a wrap up\n* Be incredibly crude and border on stage 4 autism\n\nSo let's get right into it shall we?\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**How do I pick an earnings play?**\n\nFirst things first, what is an earnings play? An earnings play is when you bet, either using options or buying shares, that a company is going to either do good or bad when they report their earnings. Earnings are reported quarterly which, for most companies, means they are reported April/May for Quarter 1, July/August for Quarter 2, October/November for Quarter 3, and January/February for Quarter 4. These months are called “Earnings Season”. We can use earnings to decide if a company is doing good or bad and if they will do good or bad in the future. Good quarter (increased revenue, profit, etc.) stock price usually goes up. Bad quarter (net loss, supply problems, scandels, etc.) stock price usually goes down.\n\nSo how do I pick one? Well my little shit-stain, you pick a company or industry that you feel you can anticipate easily. It sounds easier than it is, I know. So let's run through a little example. You start hearing about this Covid thing in March. You think, “Hey, if medical PPE (personal protective equipment) is hard to come by right now, then a lot of people must be buying it!” That's the first step, put two and two together and realize that world events do, in fact, influence the economy. So now that we know PPE must have a high demand, we can look to the next step which is research companies that will benefit (or do bad) if the situation in question happens.\n\nThis research is a BIG part of an earnings play. I know that here on WSB we like to jump headfirst into plays without doing any research whatsoever, but if you want to make money then I would do at least a little bit. Research;\n\n* What a company does\n* What their main sources of revenue are\n* HOW MUCH DEBT THEY HAVE\n* How much cash they have\n* And what influences their sources of revenue\n\nThe debt part is very important along with the sources of revenue and their influences. With debt you want to look for if it is manageable or not. I wont get into that here but my boy u/fuzzyblankeet writes many a great post about how to read a corporate debt sheet. Try [this post about PLAY](https://www.reddit.com/r/wallstreetbets/comments/fx6b0t/playtimes_over_fuzzy_does_db/) and you should have a good bit of information for that smooth brain to digest. The key takeaway is that debt and when it expires drives how a company spends their money and if they can profit in the long run. Of course, know where the company's revenue comes from. Does it come from what they produce? Does it come from advertising? Where do they attract the most customers from? What geographical area does the majority of their sales come from? Blah, blah, blah, you guys get the gist. You don't need to understand every aspect of the company, not even the CEO’s know everything about their companies. You just need to know enough to comprehend where a company can go if they have a good or bad quarter.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**When do I sell and when do I hold?**\n\nNow that we have a company we want to play, we buy in and wait until we get close to earnings. Unless I am getting ridiculous returns way before earnings, like 200%, I hold until I get within a few days of earnings. Now here is the tricky part. The obvious thing to do is that if you think a company is going to have a good quarter, you hold through earnings and ride that price sky high. Well, that can be true but a lot goes into it. Let's go through a few scenarios.\n\nA company is trading pretty sideways for days and days. It gets to the day before earnings and is still trading sideways, doesn’t have a lot of volatility. This is a prime example of investors not really being worried about earnings at all. Earnings will still influence the price but major swings aren’t likely. Earnings being good will lead to new investors buying in and bad earnings will mean investors will sell but for the most part the market doesn’t anticipate anything big happening. It's best just to hold these through earnings and hope it goes the way you anticipate.\n\nThis next scenario deals with you thinking a stock is going to go up because of earnings but it will also work in reverse when dealing with put options. So earnings come out tomorrow. The price was trading steadily around $69 for the past few days. All of the sudden, the day before earnings, the price begins to shoot up to $71, then $73, then by 3 o’clock it's at $75 a share. This is evidence of the market ANTICIPATING good earnings. Earnings haven't come out yet but, as we say all too often, they are already “priced in”. Now when earnings come out things can pretty much go two ways. The price can continue to go up because earnings were somehow BETTER than anticipated. Or, (and this is the more likely scenario) the price will drop after earnings because they weren't quite as good as the market anticipated. This is what happens when your calls rocket in value before earnings then bottom out after, and you sit there sobbing with your tendies out the window saying, “bUT EarNInGs wERe gOOD!” It sucks, but I’ve seen this exact scenario happen many times and it has happened to me too. So the best thing to do here is if there is a large run-up the day BEFORE earnings, take your gains before they release and don't be greedy (we will get more into that later).\n\nThe last scenario deals with more volatile stocks. Let's say you bought calls on a stock that you think is going to go up after earnings. The week of earnings it is jumping around like a nutsack on a jog. It started at $20, then dropped to $17, then up to $24, back down to $19, all the way to $27, then back down to $16 before earnings are reported. We can gather from these crazy fluctuations that there are conflicting ideas on what the results of earnings will be. From here, the best thing to do is to just stick with your DD and hold through earnings, because clearly nobody fucking knows whats gonna happen.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Some real world examples**\n\nI'll break down some lingo here real quick. If you already know just skip to the next header where it says LAKE. When I say I bought calls for a certain date (4/17), I mean they expire that day and I can no longer trade them. Strike, is the number I think the share price can rise to or be on the way to when I sell. The decimal numbers (.70, 1.10) are the premium you pay per share to buy an option contract. So a .70 premium will cost $70 to buy, 1.10 will cost $110. That should let you understand a little more.\n\n**LAKE;** First, let's look at the Lakeland Industries play I advocated for a while ago. We go through the research process and decide that a medical PPE company will make money because of the coronavirus. I'll go ahead and use my own plays so I don't have to make a bunch of shit up.\n\nEarnings for LAKE came out on 4/15 after hours. On 4/8 they were trading at a low around $14.95. I bought calls for 4/17 (after earnings) at $17.5 strike for .70. Then on 4/14 I doubled down and bought calls for 4/17 at $20 strike for .30 and at that point they were trading around $16.50. Then comes 4/15, they have a run-up all day and at one point hit $18. THIS IS THE POINT I SOLD. I sold BEFORE earnings and took my profits. The $17.5 strike had jumped to 1.45 and the $20 had jumped to .65. These are both over a 100% gain.\n\nAfter close earnings were released. They were great. It showed an increase in revenue, less debt, and a bunch of other good shit. The only problem was it wasn't as high as people anticipated. On 4/16 LAKE hit lows of $15. This is just how it happens sometimes.\n\n**JNJ;** We also have the Johnson and Johnson play from the 4/9-4/13 post. They make medical stuff, home staples, you know what JNJ is.\n\nEarnings came out 4/14 before open. On 4/13 they were trading around $139.77 and this is when I bought in. I got calls for 4/17 at $147 strike for .60. That day it stayed pretty low because no one expected earnings to be fantastic. They were fantastic and the price soared to $146 on 4/14. I sold that day to lock in gains and protect myself from a sudden drop of other people cashing out their gains. The value went from .60 to 1.10 for an 83% gain.\n\nNow the price kept going up in the following days and honestly I should have held for longer. I would have if I would have bought longer dated calls. Overall, what I did here was a good choice but I could have squeezed more money out of it if I was more reckless. That is the key word, reckless. Not taking such a large gain and hoping that it will go up just a little more is reckless in the long run even if it would have worked out this time.\n\n**HAS;** Last we will look at Hasbro which a few of us got burned on last week. I bought some HAS calls for 5/8 at $85 strike for 1.10. Earnings were set to come out 4/29.\n\nThe day before earnings the price went way up for my options. I was looking at over 100% profits. This should have been the perfect sign for me to sell because earnings can't be good enough to rationalize such a run-up. I didn't sell. Earnings came out and they reported barely breaking even. Investors thought it would be a good quarter, it wasn't. Now I’m stuck bagholding these options waiting for them to expire at the end of the week so they can get the fuck out of my portfolio. DON'T BE GREEDY.\n\n&amp;#x200B;\n\n**General pointers/ Wrap up**\n\nTruly, the best thing you can take away from this is to not be greedy. Take the profits you get. The difference between a 100% gain and a 100% loss can be holding just one day too long. Take in the signs and learn how to read the market trends. Price goes up before earnings? Sell and lock in gains. Price goes stagnant? Hold. Price goes opposite where you thought it would? You are either very wrong or know something that no one else does and you might as well hold.\n\nHere on WSB, the consensus is usually to make as much as possible for the meme. Well, do you want to be a meme or do you want to consistently make money. I know your answer is you want to be a meme but you know what the smart answer is. If you have over 50% gains (which is more than most professional investors make) take it. Protect yourself.\n\nAlso, if you can't afford to lose your entire account then you shouldn't be doing this. If your Robinhood balance hits $0 you should not be worrying about how you are going to pay bills it should just be an “oh well” moment. And remember for the few and far in between moments that you do make money, put some back for capital gains taxes so you don't get fucking audited.  [This post explains](https://www.reddit.com/r/wallstreetbets/comments/fgfr97/taxes_how_to_treat_those_sweet_tendie_gains/) a lot that you need to know in regards to taxes. \n\nThat's all I really have for you. I hope this makes earnings plays a little easier to understand. It takes practice and practice leads to losses, just don't get too butt hurt. We all lose at some point and the only way to consistently win is to not play.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**TLDR;** Fuck you, read it. You need all the help you can get.",
        "subreddit": "wallstreetbets",
        "title": "How to play earnings like you're not a retard; TLDR included",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ge06g7/how_to_play_earnings_like_youre_not_a_retard_tldr/",
        "created": 1588722490.0
    },
    {
        "author": "agebronze",
        "created_utc": 1589057623,
        "id": "ggngse",
        "num_comments": 334,
        "num_crossposts": 0,
        "selftext": "What people right now are expecting to happen, is that states will reopen, and people will wait and see if there are news of a \"second wave\" or new infections. And then people will all panic and realize that we're either back to lockdown or half a million people will die, or it magically \"disappear\". Only then, people are assuming that the market will react.\n\nBut the other investors on the other side are just as smart as you. There are probably very few people who think reopening will not cause a rise in infection. The smart money is definitely not that dumb. This is hot potato and the first to leave wins. \n\nThis has to happen before you're expecting it, because the smart money has no reason to stay that long if they can leave before it. Why would they? Would you do it? They won't wait for the news they know will come. Hell I bet some of them even control when the media calls it \"second wave\". It's all very arbitrary, calling it waves gives the media the power over public opinion. It's open to interpretation. But call it a second wave and there you go, you have the public primed for a sell sign. That sell sign will come as a scare, to squeeze people to panic sell, not as the trigger to the initial selloff. Prices will be already low when that happens and they will use that to maximize buying. They would want those headlines to come when they can push stocks below their worth, not as a reminder to correct their prices.\n\nA \"second wave\" headline will happen because the media won't be silent over fast increasing case counts. Retail investors will sell on that news. Smart money won't let other investors pull out before the headline comes, if they can maximize their sell before. \n\nSo the question, what is the timeline you think this will happen. And then the smartest reaction is to exit this earlier than all people here think.\n\n**So when do you think news will announce \"second wave\" ?**\n\nIt's also OK to post \"I don't think there will be a second wave\", or \"second wave won't crash the market, it's priced in\", or \"The market will crash only after we know states reaction to the second wave\". Would you sell on \"second wave\" news?\n\nI'm guessing not more than 2-3 weeks until someone says Texas has a \"second wave\" (A rise in infections, although they never really reduced them anyway).",
        "subreddit": "wallstreetbets",
        "title": "Smart money will exit before you expect it (before \"second wave\" news)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ggngse/smart_money_will_exit_before_you_expect_it_before/",
        "created": 1589086423.0
    },
    {
        "author": "Scorp63",
        "created_utc": 1588601452,
        "id": "gdcanj",
        "num_comments": 333,
        "num_crossposts": 0,
        "selftext": "News just broke about CCL planning to start cruises back on Aug 1. [Here's an article about it. ](https://www.usatoday.com/story/travel/cruises/2020/05/04/coronavirus-carnival-resume-some-north-american-cruises-summer/3077060001/)\n\nStock prices have began sharp increase already as of the news breaking.",
        "subreddit": "stocks",
        "title": "Carnival Cruise Lines to begin phasing in cruises starting Aug 1",
        "url": "https://www.reddit.com/r/stocks/comments/gdcanj/carnival_cruise_lines_to_begin_phasing_in_cruises/",
        "created": 1588630252.0
    },
    {
        "author": "o_ohi",
        "created_utc": 1589275169,
        "id": "gi7tp7",
        "num_comments": 330,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\n[How did I spend 20 minutes in Photoshop makin this trash?](https://preview.redd.it/se8178ouway41.png?width=1000&amp;format=png&amp;auto=webp&amp;s=c0e3186708cbe3691e7403be7bc4934558a5f8d6)\n\nI learned about Robinhood a few month ago when WSBgod’s (bamboozle) post went viral. With dollar signs in my eyes I tried my hardest to unlock the green RH theme buying $ROPE and $CSV like the memes said, but I was #redgang until all my savings were gone. So I studied all the DD posts for months, made new savings, and set out to lose that too. I found a JavaScript machine learning tutorial on YouTube and got to work, mostly watching tendie porn on wsb every few minutes to refresh my false sense of hope.\n\nNow my script is finished, using machine learning on every DD thread I could find, analyzing the resistance, taking into account I, II, III, IV crush groups like they said, and cross referencing the greeks against fibonacci sequencing models. Everything I could possibly learn from WSB, I fed into the machine learning script so it generates a list of the top 69,420 positions on the market every time I open Internet Explorer. Then I inversed the list order, flipped the strike projections, watched The Big Short for the 3rd time that morning, and started trading. This shitter bot then somehow pulled off three consecutive weeks of 100% returns paper trading, so I decided to share the automated autism with you broke fucks so we can all lose our money together. For you retards, $5K +25% weekly compounded is a million in 24 weeks.\n\nHere are the positions for this week, selected by Retard Bot on Monday:\n\n&amp;#x200B;\n\n[I should flair this shit as DD.](https://preview.redd.it/ypt8ubl0xay41.png?width=1000&amp;format=png&amp;auto=webp&amp;s=bd3980d41aff851b55848a1fa57e0c8c981e3c67)\n\nCRM 187.5c 6/26 | projections:\n\n* $198 @ exp\n* \\+69% tendies\n\nCRM 200c 7/17 | projections:\n\n* $212 @ exp\n* \\+214% tendies\n\n&amp;#x200B;\n\n[Here's to drinking away our losses.](https://preview.redd.it/2f4d4bd2xay41.png?width=1000&amp;format=png&amp;auto=webp&amp;s=af96b8d99da6e13f06b9a2a47619eb05d984b0ef)\n\nCLX 200c 7/17 | projections:\n\n* $228 @ exp\n* \\+124% tendies\n\n&amp;#x200B;\n\n[Recession who?](https://preview.redd.it/bh4af0s3xay41.png?width=1000&amp;format=png&amp;auto=webp&amp;s=1a5f2896d7ac21f04d0953953cd54e5ef80bd861)\n\nRNG 320c 7/17\n\n* ???\n* idk… the script stopped giving projections around this point\n\nTECH 280c 7/17\n\n* stonks only go up\n* what does DD actually stand for?\n\nTECH 330c 7/17\n\n* cool name\n* saw a vaguely positive blog post on it\n\nHD 260c 7/17\n\n* if this works my dad might finally understand RH is not a gambling addiction\n* GUH\n\nWhy do I trust these positions? What do I know about them? Absolutely fucking nothing. The bot could literally pick positions at random and make more tendies than me. Who fucking cares.\n\nSo yeah, thank you autists for all the meme positions. At least you gay fucks make the losses worth it. I’ll be posting every friday with POV RH porn of returns for the positions here and mondays with new positions. According to my script’s projections of upcoming high efficiency SPY IV crush waves I’ll be at 1Mil tendies in 6 months, so enjoy calling me a retard, send gay emojis, and feel free to share the loot.\n\nAiming for 3% weekly with the bot, which, for you  🌈 🐻 s that failed 4th grade math, would turn $25K into 30 million dollars in 5 years. Since we're in a stupid synthetic JPOW bull-market rn, I think this thing's gonna keep printing 100% weekly for a while.",
        "subreddit": "wallstreetbets",
        "title": "Climbing from $5K to $1Mil in 24 weeks with a retard bot [ week 1 ]",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gi7tp7/climbing_from_5k_to_1mil_in_24_weeks_with_a/",
        "created": 1589303969.0
    },
    {
        "author": "HugeCanoe",
        "created_utc": 1589235799,
        "id": "ghxwi6",
        "num_comments": 329,
        "num_crossposts": 0,
        "selftext": "In the equity market, fear of missing out seems to be overshadowing fear of all that’s wrong with the economy. Goldman Sachs Group Inc. says pessimism will soon get the upper hand and send the S&amp;P 500 Index down almost 20% in the next three months.\n\nFiscal and monetary support over the past few weeks of the coronavirus pandemic successfully warded off a financial crisis, but a return to economic normalcy is still a long ways away and investors have gotten ahead of themselves, the bank’s chief U.S. equity strategist, David Kostin, wrote in a report.\n\nFinancial, economic and political risks darken the outlook for domestic equities, Goldman warns. The bank cites the lack of flattening in the U.S. infection curve outside of New York, what promises to be a lengthy re-start process, a 50% hit to buybacks in 2020 and the risk of higher corporate taxes and de facto consumption taxes if U.S.-China trade tensions bubble up again.\n\n“A single catalyst may not spark a pullback, but a number of concerns and risks exist that we believe, and our client discussions confirm, investors are downplaying,” Kostin wrote. Goldman says the S&amp;P 500 will probably drop to 2,400 over the next three months before it rebounds to 3,000 by year end.\n\nThe index slumped 0.5% Monday to 2,914 as of 9:45 a.m. in New York.\n\n\nKostin notes that large swaths of the investor community have failed to cash in on the S&amp;P 500’s 31% surge since its trough on March 23. He points out that most mutual funds have underperformed since the bear market low, with long/short and macro hedge funds posting single-digit returns as a group, and investors may face pressure to chase the rally.\n\n“The ‘fear of missing out’ best describes the thought process,” Kostin said.\n\nFutures positioning shows investors still doubt S&amp;P 500 rebound\n\nBut he warns that it’s a risky move. Even with measures of the breadth of the recent rally improving in recent days -- potentially signaling more buy-in on the idea the gains will last -- Goldman Sachs’ sentiment indicator has barely improved since mid-March.\n\n“Skepticism abounds regarding the likelihood the rally will continue,” the strategist writes.\n\nrelates to Goldman Says Stocks Due for 18% Drop After Rally Driven by FOMO\nKostin is pessimistic on the outlook for corporate profits, citing frozen growth plans and capital expenditures will drop 27% this year. He points out that the only encouraging driver for earnings is the swelling federal deficit, which in effect acts as substantial support for demand.\n\nCaution on equities may also be warranted in the face of stretched valuations -- to the extent that anything about 2021’s bottom-line outlook can be discerned.\n\nThe benchmark U.S. stock gauge trades at 19.5 times the buy side’s estimate of next year’s earnings, Kostin concludes, the highest level since 2002.\n\nhttps://www.bloomberg.com/news/articles/2020-05-11/goldman-says-stocks-due-for-18-drop-after-rally-driven-by-fomo?sref=s0L1qQ1H",
        "subreddit": "investing",
        "title": "Goldman Says Stocks Due for 18% Drop After Rally Driven by FOMO",
        "url": "https://www.reddit.com/r/investing/comments/ghxwi6/goldman_says_stocks_due_for_18_drop_after_rally/",
        "created": 1589264599.0
    },
    {
        "author": "eth_trader_12",
        "created_utc": 1589136947,
        "id": "gh7690",
        "num_comments": 321,
        "num_crossposts": 0,
        "selftext": "One thing I have learned trading this market for many years is that the fundamentals always play out. The question is all about timing. If you sold when SPX was near the bottom, you’d be massively screwed. \n\nThe fundamentals are bad. Unemployment figures are rising. Many companies have slashed a ton of their profits. Even though the economy is about to re-open, the impact of this on the stock market hasn’t been felt yet and the effects will last a long time. \n\nThe truth is that this drop never happened because of COVID in the first place. It happened because of companies being overvalued and inflated resulting in an eventual collapse. COVID was just a trigger and those fundamentals are still in play. Just two years ago, nearly half of unicorns overstated their valuations, and it got much worse last year and this year: https://www.barrons.com/amp/articles/the-vc-bubble-is-going-to-burst-51553077853. The VC bubble still hasn’t popped yet. \n\nNow, why do I think it is finally time that we drop now, and why do I think we drop this fast? Why do I think this is not just another one of those “Haha it’s going to crash” posts we’ve seen over the last two months? It’s simple. Retail volume has been washed out and reached a peak last week. You can see this through aggregate order flow on stocks most traded by retail such as TSLA (which will drop the hardest). You can see this through the number of people holding stocks like that on Robinhood which has the most retail volume. The influx of retail traders reaching a peak during a rise or during a drop (which occurred at low 220s) is generally indicative of a top or bottom in case of a downtrend. \n\nWhen retail volume peaks in a market where the fundamentals are telling the opposite story, you go short, and you go bigly short.\n\nTL;DR P SPY 240 MAY 22",
        "subreddit": "wallstreetbets",
        "title": "Why SPY will drop to 230 within two weeks",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gh7690/why_spy_will_drop_to_230_within_two_weeks/",
        "created": 1589165747.0
    },
    {
        "author": "bardsmanship",
        "created_utc": 1589160043,
        "id": "ghdyps",
        "num_comments": 316,
        "num_crossposts": 0,
        "selftext": "Investors pulled $16.2 billion from stocks in the past week, and added $11.3 billion into bonds and $53.5 billion into cash.\n\nBoFA said 9 of 10 clients believed the current market recover was a “bear market rally” and 7 out of 10 said they would only buy the assets that the U.S. Federal Reserve purchases through it various stimulus schemes.\n\nThoughts?\n\n[https://www.reuters.com/article/us-global-markets-flows-bofa/investors-exit-stocks-at-fastest-rate-since-march-tech-fatigue-sets-in-bofa-idUSKBN22K163](https://www.reuters.com/article/us-global-markets-flows-bofa/investors-exit-stocks-at-fastest-rate-since-march-tech-fatigue-sets-in-bofa-idUSKBN22K163)",
        "subreddit": "investing",
        "title": "Investors exit stocks at fastest rate since March, 'tech fatigue' sets in: BOFA",
        "url": "https://www.reddit.com/r/investing/comments/ghdyps/investors_exit_stocks_at_fastest_rate_since_march/",
        "created": 1589188843.0
    },
    {
        "author": "amped242424",
        "created_utc": 1588600370,
        "id": "gdbzyn",
        "num_comments": 312,
        "num_crossposts": 0,
        "selftext": "New report from Zillow \n\nhttps://www.zillow.com/research/prices-sales-forecast-coronavirus-26975/\n\nSays itll take until 2021 to recover.  It would be super unfortunately if you were a company who's never been profitable and jumped into the house buying/flipping market and shuttered the division half way through the quarter. \n\nwhile the average home sold for $317,155 — a loss of $1,512 with each sale. And that's before accounting for interest expenses and holding costs, which amounted to an additional $4,895 in losses per home.\nOverall, Zillow's Homes division lost $312 million in 2019, before taxes.\n\nZillow is stuck with thousands of homes its unable to sell in over 17 markets while still liable for taxes. they still need to be remodeled in order to be sold.\n\n\nTLDR\n\nZ 38P 05/08\n\nHemorrhaging money. Never been profitable. The uber of house sales.",
        "subreddit": "wallstreetbets",
        "title": "Home sales to fall up to 60%",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gdbzyn/home_sales_to_fall_up_to_60/",
        "created": 1588629170.0
    },
    {
        "author": "wang4e",
        "created_utc": 1588960303,
        "id": "gfxwfd",
        "num_comments": 300,
        "num_crossposts": 0,
        "selftext": "Meanwhile, many of my stocks have already recovered. I get that stocks are forward looking. I also get that there’s no better place to invest at the moment, but it all still seems to soon and people are too eager for a recovery.\n\nArticle linked below.\n\nCoronavirus: Pandemic sends US jobless rate to 14.7%\nhttps://www.bbc.co.uk/news/business-52591262",
        "subreddit": "StockMarket",
        "title": "US unemployment at 14.7%, worst since the Great Depression. Don’t worry. Nothing to see here.",
        "url": "https://www.reddit.com/r/StockMarket/comments/gfxwfd/us_unemployment_at_147_worst_since_the_great/",
        "created": 1588989103.0
    },
    {
        "author": "kingbout",
        "created_utc": 1589040976,
        "id": "ggi7zy",
        "num_comments": 294,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\nToday market is closed, so boring day. So read last 10-k statement, in my opinion ZOOM is pure trash company with losses, lots of competitors and nothing really new to come, and you what do you think??",
        "subreddit": "stocks",
        "title": "ZooM, is it pure trash after reading 10-K statement ? any advice?",
        "url": "https://www.reddit.com/r/stocks/comments/ggi7zy/zoom_is_it_pure_trash_after_reading_10k_statement/",
        "created": 1589069776.0
    },
    {
        "author": "HarbingersRefuge",
        "created_utc": 1588497550,
        "id": "gcnni3",
        "num_comments": 287,
        "num_crossposts": 0,
        "selftext": "# Background\n\nThere's a 2007 study on the economy during, and the economic recovery following, the 1918 Spanish Influenza Pandemic (sourced below). The study concluded that employment *increased* in the US during the pandemic due to a plethora of new jobs created specific to the problem. There was no shutdown of the economy. I then looked at historical unemployment figures. It's clear to me now that there's absolutely no basis for a quick recovery of employment, especially following black swan events. The V-shaped recovery narrative is bullshit.\n\n[https://www.stlouisfed.org/\\~/media/files/pdfs/community-development/research-reports/pandemic\\_flu\\_report.pdf?la=en](https://www.stlouisfed.org/~/media/files/pdfs/community-development/research-reports/pandemic_flu_report.pdf?la=en)\n\n&amp;#x200B;\n\n# Employment will take years to recover\n\nEmployment can't recover overnight. There's no basis for it. Proportional to the current workforce, the most jobs we've ever gained in a single month was in September of 1983 at 1.18 Million. After that, the jobs gain at the end of WW2 at a little over 951,000 when soldiers returned home from the war. \n\nWe're currently sitting at 36.4 Million unemployed and counting. Hourly employees have been let off; we know white collar is next (see below). The number is only going to expand in the short term. Even if it were to stop at only 40 Million (one more week of job losses), it would take 36 months of the best jobs gain ever in the history of the US to recover to February's employment levels. The argument for a quicker recovery is that many of these people will be immediately rehired. Based on my arguments below for a delayed recovery of many different businesses and significantly reduced demand, many if not most will not be. \n\n&amp;#x200B;\n\n# The Q1 numbers were worse than you think.\n\nQ1 saw a 4.8% GDP drop, despite a positive January &amp; February. If January and February had positive GDP growth, then the March drop was proportionally equivalent to a 15-19% contraction.\n\n&amp;#x200B;\n\n# Analyst Q2 GDP projections are too optimistic\n\nA complete shut down of our economy has never happened before. Analysts are claiming a \\~20%+ GDP drop. It will be greater than that by as much as 10 percentage points based on unprecedented negative economic reflexivity, which is not addressed in any of these analyst models. It strains credulity to believe that people will flock to restaurants, theme parks, travel locations, community centers, festivals, concerts, sports games, etc in droves. \n\nIn fact, I think every large gathering will have low attendance and the companies that host events as their main business may find themselves without sufficient revenue to continue operations. This effect will lead to declines in revenue for many different other industries and businesses directly and indirectly. The many small businesses which profit from events, fairs, and festivals rely on a certain amount of revenue to pay for their spot at the event. These businesses will largely be defunct. \n\nOnce people decide to venture out, they'll be unable to spend at pre-covid levels due to massive unemployment. Fear will set in as revenues decline. Investment sentiment will turn negative, and low interest rates won't even be able to keep asset prices from crashing. \n\n&amp;#x200B;\n\n# White collar layoffs are next\n\nPeople making \\~$250k-$1M+ at Fortune 500 firms are taking 20-50% salary reductions. Global businesses with domestic headquarters are first laying off their employees abroad, and next they will start trimming operations domestically. That's the word. On face value, it appears bullish, due to lower labor costs, but instead it shows weakness in these firms and will lead to overall declines in demand across the broad economy. There will be many companies that will find their business in shambles in this quarter, which will drag down the indexes, even if a handful sectors happen to perform well by Q2 earnings at the latest. Although, news in the interim may accelerate the timeline. \n\nCompanies with recurring revenues sourced from customers with inelastic demand, such as pharmaceutical firms and military contractors will do fine for a while, but will eventually fall as well due to high p/e relative to other income producing assets and equities.\n\n&amp;#x200B;\n\n# Conclusion\n\nA nationwide economic shutdown, in the manner it has been done, is like stopping a truck by running it into a wall. Large swathes of the economy have been effectively destroyed. They will have to be completely rebuilt. Demand will drop significantly for years. Employment will likely increase higher even after the economy is reopened.",
        "subreddit": "wallstreetbets",
        "title": "2020 is the beginning of the 2nd great depression",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gcnni3/2020_is_the_beginning_of_the_2nd_great_depression/",
        "created": 1588526350.0
    },
    {
        "author": "WentBrokeDec2018",
        "created_utc": 1588775148,
        "id": "gekz7l",
        "num_comments": 278,
        "num_crossposts": 0,
        "selftext": "**Vague Statements**\n\nSo many technical analysts talk like the Oracle at Delphi.  \"These are interesting levels to look at\" or \"This day/week/month is going to be really pivotal!\"\n\nUmm okay?  What in the fuck does that mean?  How does any of that possibly generate any trade-able insight?  Of course, it's not meant to, its purpose is to make the person sound like a wise timeless sage.  Oh how brilliant are the technical analysts that can easily discern \"interesting\" levels!\n\n**Weasel language**\n\nAnother favorite tool of technical analysts.  Saying what 'could' happen instead of what 'will' happen.  Write a long diatribe about how the current level **could** be either resistance **or** support.  Wait awhile until an up trend or down trend is clearly visible, then point to your useless piece of shit writing and say, \"you see?  What did I tell you!\"\n\n**Unfalsifiable claims**\n\nThis is a big one.  Any sleazy snake oil salesman worth his salt knows to make unfalsifiable claims.  Never ever talk about what **will** happen or even what is **probable**, but only what the **potential** is.  \"If things break down here, there is potential for further downside\" or \"Potentially, this could be massive support. Let's see what happens.\"\n\nOn the rare occasion where technical analysts go out on a limb, they always have an excuse at the ready, such as:\n\n* Technical analysis is about probability, nothing is 100%.\n* The pattern wasn't subsequently \"confirmed\".\n* There were unforseen factors.  Fuck you Fed! (When everyone and their grandma can see the continual Fed balance sheet expansion).\n* Hey man, you always have to set your stops.  \n* I was mistaken, it happens, but technical analysis works and look at all these (cherry picked) predictions that I (vaguely) got right!\n\n**Survivorship Bias**\n\nTechnical analysts **love** to bring up things that they got 'correct'.  \"Hey I told you that could be support and look at the rally since!\".  When someone is selectively bringing up their past record, they almost always leave out the ones they got dead wrong.  For example, every single month, post a quarter about how you're 'skeptical' of the market, that a collapse in equity prices is 'in the cards', and then after the 27th article, when there is finally a significant decline, make sure to bring up that article from now until kingdom fucking come.  Pin that article to the top of your twitter feed or link to it on reddit.  Doesn't matter if it took you 20 accounts to get a spectacular prediction right, people will follow a 2 week old account like lemmings.  \n\n**Analysis in Hindsight**\n\nThis by far, is imo the most annoying.  Many technical analysts, with the benefit of hindsight, like to opine about how past moves were oh so obvious well after the fact.  Whether this is done to intentionally mislead people or is the genuine expression of someone with delusional faith in magic lines can only be determined on a case by case basis, largely depending on whether or not they are selling a subscription service.  They will rarely, if ever, talk about how \"obvious\" a move **will** be but will drone on endlessly about how obvious **past** moves are.  \n\nI will say one thing about the fucking jackasses that post on loss threads with comments like \"duhhhhh you couldn't see the future!  How stupid!\": at least they are not sleazy scam artists.",
        "subreddit": "wallstreetbets",
        "title": "Why I hate Technical Analysis and think Technical Analysts are full of shit",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gekz7l/why_i_hate_technical_analysis_and_think_technical/",
        "created": 1588803948.0
    },
    {
        "author": "flyhotman",
        "created_utc": 1589018963,
        "id": "ggcxmr",
        "num_comments": 267,
        "num_crossposts": 0,
        "selftext": "Please share your story about how you found the WSB sub, then made bad moves, lost all your money, and how it destroyed your life.",
        "subreddit": "wallstreetbets",
        "title": "Lost all your savings and destroyed your life because of WSB Support Thread",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ggcxmr/lost_all_your_savings_and_destroyed_your_life/",
        "created": 1589047763.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1589199472,
        "id": "ghmgt7",
        "num_comments": 267,
        "num_crossposts": 0,
        "selftext": "If your question is \"I have $10,000, what do I do?\" or other \"advice for my personal situation\" questions. If you are going to ask how to invest you should include relevant information, such as the following:\n\n* How old are you?\n* Are you employed/making income? How much?\n* What are your objectives with this money? (buy a house? Retirement savings?)\n* What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know its 100% safe?)\n* What are you current holdings? (Do you already have exposure to specific funds and sectors?)\n* Any other assets? House paid off? Cars? Expensive significant other?\n* What is your time horizon? Do you need this money next month? Next 20yrs?\n* Any big debts?\n* Any other relevant financial information will be useful to give you a proper answer.\n\nPlease consider consulting our FAQ first - https://www.reddit.com/r/investing/wiki/faq \n\nBe aware that these answers are just opinions of Redditors and should be used as a starting point for your research. You should strongly consider seeing a registered financial rep before making any financial decisions!",
        "subreddit": "investing",
        "title": "Daily Advice Thread - All basic help or advice questions must be posted here.",
        "url": "https://www.reddit.com/r/investing/comments/ghmgt7/daily_advice_thread_all_basic_help_or_advice/",
        "created": 1589228272.0
    },
    {
        "author": "DivineMomentsOfWhoa",
        "created_utc": 1588954979,
        "id": "gfw806",
        "num_comments": 267,
        "num_crossposts": 0,
        "selftext": "Firstly, if this is against the rules please remove this. I'm not promoting a channel because I don't have one yet, just gauging if people would even watch. I have actually never made youtube videos at all hah.\n\nI love this community, I've learned a lot here and I've started to give a little back to the very new people. I've only been trading a little over a month and I'm learning lessons every day in the market. I wonder if people would be interested in some fairly short videos of me putting on some trades, talking about enter/exit strategies, then talk about the trade as it progresses and finally management and closing/trades.\n\nWould you be interested in this?",
        "subreddit": "options",
        "title": "Is there any interest in a \"watch me learn to trade\" options series?",
        "url": "https://www.reddit.com/r/options/comments/gfw806/is_there_any_interest_in_a_watch_me_learn_to/",
        "created": 1588983779.0
    },
    {
        "author": "andynyc",
        "created_utc": 1588528662,
        "id": "gcuzdn",
        "num_comments": 263,
        "num_crossposts": 0,
        "selftext": "Mickey Mouse reported 50 million Disney Plus subscribers on April 8th only like 6 weeks after reporting 28 million on Feb 20th.   \n\nIt's about 4 weeks later so you could see at least 15 million more subscribers not even accounting for the 20% coronavirus boost. And Similarweb shows traffic up 81% see here: https://i.imgur.com/7SWoNYb.png   \n\nIf they hit 70 million subscribers that's likely profitable. Yeah parks are going to be down, but only closed on March 12th so the impact will be barely felt into earnings. The only thing that will matter is this subscriber number. Disney will easily show that they are well capitalized and the transition to digital will show that they can weather the next year. The timing of Disney Plus is near perfect. Disney has already quickly moved movie debuts online including the amazing Artemis Fowl (if you dont have this on your calendar put it on for June 12 and then buy DIS calls then too cuz that shit is tight).\n\nHere are my bets. Had to try all the strikes and dates that way I won't get screwed by the theta meta greeks. Cant catch me on all of them you market maker Elon Musk tweet China tarrifs sons of bitches!!!!\n\nMy plays ($26k): https://i.imgur.com/Z2iDSUf.png   \n\ncrazy people: dis jun 19 $135   \nbitch asses: dis 5/15 $110",
        "subreddit": "wallstreetbets",
        "title": "DIS yolo on earnings and DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gcuzdn/dis_yolo_on_earnings_and_dd/",
        "created": 1588557462.0
    },
    {
        "author": "Chicken65",
        "created_utc": 1589269882,
        "id": "gi6qf6",
        "num_comments": 262,
        "num_crossposts": 0,
        "selftext": "[This is the most damning thing I have read in a while for the U.S. economy.](https://wallethub.com/blog/coronavirus-relief-survey/73544/)  How has this not taken over the news cycle? We get that Teflon Don messed it up, we get that bad dudes killed that guy unjustly now can we talk about everyone running out of money, this should be the biggest story in America. It's not a huge story because people think a flip will switch and everyone will get their paychecks flowing back again \"when this is over\", but we know many of the jobs have disappeared for good.\n\nOf course, we have been around long enough to know that it means more stimulus checks will come soon which will need to be fatter than last time. Which in turn means the current bull run is safe for the time being. \n\nMandatory Position: ATM $HTZ Straddle June 2020.",
        "subreddit": "wallstreetbets",
        "title": "Nearly 160 million Americans are less than three months away from running out of money.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gi6qf6/nearly_160_million_americans_are_less_than_three/",
        "created": 1589298682.0
    },
    {
        "author": "veritasinvestments",
        "created_utc": 1589204336,
        "id": "ghnp4d",
        "num_comments": 259,
        "num_crossposts": 0,
        "selftext": "TLDR: PCG 20 strike september or PCG 15 calls for may 29 should print. \n\nPCG is about to climb out of bankruptcy with an impending vote coming out soon. The deadline for the victims’ vote on the settlement agreement is this Friday. \n\nPCG will rise (much like it did in January) due to anticipation for the vote. Given that 98% of victims thus far that have caster votes are in favor of the settlement, we will most likely see a case where PCG will exit bankruptcy by June 30. That’s why big whales have parked themselves in OTM september 20 strike calls. However, the near term momentum that the positive vote will provide will also make sure that we see a rally in PCG’s stock through the end of may. Given that analysts have slapped new price targets despite the possibility that the vote may not be a done deal, you can probably expect higher price targets when the vote actually goes through. \n\nTimeline: last vote by may 15 and results will come out the week after, so may 29 calls are good for this. September 20 strike also has incredible OI and liquidity so those are most likely going to rocket if PCG picks momentum to 17 during May (much like the runup from early Jan to mid February that was caused by the anticipation of pcg leaving bankruptcy. \n\nBasically, buy pcg calls for end of may and september",
        "subreddit": "wallstreetbets",
        "title": "Why PCG will rise to 17 in the near future",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ghnp4d/why_pcg_will_rise_to_17_in_the_near_future/",
        "created": 1589233136.0
    },
    {
        "author": "qwertyrayz",
        "created_utc": 1588695463,
        "id": "ge0qql",
        "num_comments": 257,
        "num_crossposts": 0,
        "selftext": "Shoutout to u/absolutcity for beating me to the punch on this, but my team followed this one pretty heavily and I decided to give my own thoughts on the trade. \n\n \n\n**DISCLAIMER: This is an earnings play, there is always a risk of us or the institution getting it wrong. Enter at your own risk.**\n\n&amp;#x200B;\n\nTL,DR: Title you dipshit\n\n&amp;#x200B;\n\n**Company Overview**\n\nNYT, or New York Times, is a paper and web-based news service, and like all news publications have been heavily covering the COVID-19 crisis. NYT has its earnings later today, and we've spotted some unusual activity surrounding the 31p.\n\n**Options Activity**\n\nToday throughout the day we've seen massive sweep orders bought at the bid on the May 15th expiry 31 puts, the three largest orders being 2702, 1183, and 1374, all with aggressive purchase prices. Option volume as of 8:45 is near 11k, representing over 50% of the average daily traded volume of NYT. The large sweeps themselves are valued at over 4 million dollars in premiums paid, and our in house industry veteran has informed us this does seem like a directional play rather than a hedge for earnings due to the extremely expensive premium paid (&gt;2% of underlying).\n\nAs you read this more sweeps are coming in gradually.\n\n**Thesis**\n\nIt seems like the big boys know that NYT may not beat earnings expectations. Because of the COVID crisis most people expect news outlets to perform well, so the proper contrarian move here would be to initiate short positions. We also saw large selling action throughout the day as well, perhaps the big boys unloading their positions.\n\n**Risks:** \n\nThere is always the risk that this could be an IV momentum play, where the institutions pump up the action on the option then dump once volume picks up. Judging by the lot sizes, order flow, and fundamentals however, this seems more and more like an earnings bet.",
        "subreddit": "wallstreetbets",
        "title": "NYT 5/15 31p Unusual Options Activity",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ge0qql/nyt_515_31p_unusual_options_activity/",
        "created": 1588724263.0
    },
    {
        "author": "spidytrades",
        "created_utc": 1588732678,
        "id": "gebop7",
        "num_comments": 251,
        "num_crossposts": 0,
        "selftext": "Guys there’s so much info and ppl arguing about MVIS is it true is it not. Should I sell tomorrow, should I sell before call, should I risk it all and wait. \n\nTruth is no one can tell you, but here are some pointers from the past 24hrs.\n\nMVIS is tied to MSFT, just look at their product it’s literally the same thing. https://youtu.be/uIHPPtPBgHk\n\nThe volume on this guy has 190 million more than S&amp;P!!! That’s 3x the amount in just one day!!\n\nThere was for a fact a whale that manipulated the price, this cause triggers to offset, with a panic sell for ppl trying to short this thing.\n\nPatent was approved today, even if you think it’s false, read it carful and you’ll see MVIS referenced. Again Holo lens comparison.\n\nMany MVIS employees are NOW MSFT employees, one in particular is a senior researcher (hint hint)\n\nThey are in the process to updating the holo lens to holo lens 2.\n\nMSFT can continue to pay royalties, buy them out after they’ve paid their debt off, or honestly this company continues to grow because holo lens is the future.\n\nI don’t believe this is a pump and dump, I believe this is to good to be true. If you want to sell to make a quick buck fine, but my own opinion, do your own DD, this guy is a win-win-win. Yes, there will be a bumpy road to the upside, but after the news either announced on the 7th after hours at 5pm, or 19th, I think based on the CEOs letter for exploring potential acquisition or merger on 5/1. We have good evidence to believe this is the real deal.\n\nMore info from investors hub\n\n”Ex Microsoft (MSFT) Employees now work at MicroVision (MVIS) \nAfter some research by the community, a staggering amount of ex Microvision employees have been scooped up by Microsoft over the years. This growing list leads to suggest that Microsoft is very interested in MicroVisions technology and capabilities. \n\nJosh Miller – Director of Engineering at Microsoft and former Lead Systems Engineer – HoloLens (6 years at MVIS as Director of System Engineering) \n\nScott Woltman – Director Hardware Engineering at Microsoft (5 years at MVIS as Senior Staff Engineer, Systems) \n\nRichard James – Director of Optical Engineering HoloLens, former Director of Sourcing – Advanced Optics (14 years at MVIS as Director, Opto-Mechanical Engineering) \n\nWyatt Davis – Principal Engineer at Microsoft (15 years at MVIS as Principal Engineer/MEMS Technical Lead) \n\nJeb Wu – Principal Hardware Engineer HoloLens HW Design at Microsoft (5 years at MVIS as Sr. Staff Engineer) \n\nJohnson Liu – Principal Optical Engineer (3 months at MVIS as Staff Engineer) \n\nMark Champion – Principal Systems Engineer (6 years at MVIS as Principal Engineer) \n\nMason Thomas – Principal Program Manager (3 1/2 years at MVIS as Lead Systems Engineer for DARPA eye ware display) \n\nGreg Gibson – Senior Electrical Engineer at Microsoft (11 years at MVIS as Electronics Engineering Manager) \n\nDaniel Nevistic – Hardware Development Engineer – (2 years at MVIS as Electronics Engineer) \n\nMichael Beard – Senior Optics Test Manager – HoloLens, Senior Hardware Engineer (8 years at MVIS as Lead Systems Engineer of Image Quality) \n\nShawn Swilley – Senior Hardware Engineering Manager, former Sr. Hardware Engineer (7 years at MVIS as Senior Staff Engineer) \n\nJustin Zilke – Embedded Systems Engineer (4 years at MVIS as Lead Engineer, Embedded Firmware) \n\nMinhua Liang – Optical Engineer (6 years at MVIS as Sr. Staff Engineer) \n\nDamon Domjan – Senior Embedded Systems Engineer (5 years at MVIS as Firmware Engineer) \n\nRobert Hilker – Manager HW Test Engineering at Microsoft (11 years at MVIS as Director, Global Manufacturing Technology) \n\nBill Woodland – Sr. Director Strategic Sourcing (9 years at MVIS as Sr. Director) \n\nTaha Masood – Sr. Manager for Strategic Technology Sourcing for Augmented &amp; Mixed Reality Products at Microsoft (6 years at MVIS as Director, System Engineering, Design-Win and Technology Integration) \n\nJack Clevenger – Sr. Program Manager (12 years at MVIS as Sr. Program Manager) \n\nMoh Eslamy – Process development working for both Microsoft and MicroVision (6 years at MVIS managing high volume manufacturing/assembly processing for laser projector) \n\nKarlton Powell – Senior Researcher (8 years at MVIS as Senior Research Engineer) \n\nGiven both companies are headquartered in Redmond, WA, a Microsoft acquisition of MicroVision could be an extremely easy transition for both the company and employees. \n\nMicrosoft (MSFT) currently using MicroVision (MVIS) Technology in HoloLens \nOn March 31, 2020, Microvision agreed to an agreement for its April 2017 customer to take over production of the components MicroVision had been producing for the customer. Beginning in March MicroVision started earning a royalty on each component shipped that was approximately equal to the gross profit it earned on each component it had previously produced. \n\nAround the same exact time, Microsoft started expanding production capabilities for its Hololens in order to meet higher demands for the product. \n\nAnd to follow that up, the Army which is currently planing to equip its first units with the Integrated Visual Augmentation System toward the end of next year, thanked Microsoft for the expanded commitment to meet production demands. \n\n“Our Microsoft partners have been outstanding in reforming the supply chain where necessary and continuing on with the development in their production and manufacturing facility in California” \n\nAnd if the dots aren’t connecting enough, immediately after this on April 6th, MicroVision stated their first clue of possibly entering a buyout of some sort. “As we reported on March 11, we are actively engaged with multiple interested parties to evaluate various opportunities to license our IP as well as other strategic alternatives.” \n\nWhile no one knows for sure if MicroVision’s technology is in the Hololens, there have been some confirming reports stating that may be the case (found under Hybrid Arrive section). \n\nMicrosoft (MSFT)’s Possible Expanded Use of MicroVision (MVIS) Technology \nThe connection between MicroVision and Microsoft is almost undeniable when it comes to the Hololens reports and timelines. But an additional use of their tech may change everything. \n\n\n\nThere are rumors and evidence that Microsoft is using MicroVision technology in their new expanded capability with the Xbox. Microsoft expanding their use of MicroVision technology can show us their interest and commitment to the technology, and also validate why they might think about buying MicroVision out. \n\nIt’s interesting to note that Microsoft announced an Xbox Series X gameplay reveal event for Thursday, May 7, the same day as MicroVisions conference call. Whether anything of substance is announced is yet to be seen”\n\nBelow are some links! Please share info, news and insight. This is not financial advice, do your homework, I believe this is going to the sun.\n\nhttps://en.wikipedia.org/wiki/Microsoft_HoloLens\n\nhttps://hololens.reality.news/news/microsoft-applies-for-another-patent-enlarge-field-view-ar-displays-0185475/\n\nhttps://youtu.be/uIHPPtPBgHk \n\nhttp://www.globenewswire.com/news-release/2020/04/06/2011978/0/en/MicroVision-Retains-Craig-Hallum-Capital-Group-LLC-as-Financial-Advisor.html\n\n https://www.reddit.com/r/pennystocks/comments/gdih4t/mvis_is_no_joke/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf \n\n https://alphastocknews.com/microvision-mvis-stock-heres-whats-coming/3292/\n\nhttps://twitter.com/alexcutler247/status/1256429636365488129",
        "subreddit": "pennystocks",
        "title": "MVIS EVERYBODY WAKE UP AND SMELL THE COFFEE - RESEARCH POST",
        "url": "https://www.reddit.com/r/pennystocks/comments/gebop7/mvis_everybody_wake_up_and_smell_the_coffee/",
        "created": 1588761478.0
    },
    {
        "author": "XPgains",
        "created_utc": 1588698556,
        "id": "ge1qam",
        "num_comments": 244,
        "num_crossposts": 1,
        "selftext": "What I'm seeing is that people are panic buying and selling losing money to fees, and losing into their emotions. In order to combat this, think long-term, sure the stock price seems like it could be dropping or rising, if you made a decision to buy a stock, you should hold on to it. \n\nNo sense making a few bucks here and there. In Canada for example using TD Web Broker, it costs $9.99 per stock transaction. Let's say for DIS, you buy at $100, sell at $105 and re-buy at $108 are you really making anything worth staring at? Having an understanding of the business model and cash flow of a company is very important in making a decision. Do you see the company being in business for the next 1-5-10 years? If yes, just let it sit and let your money work for you.",
        "subreddit": "stocks",
        "title": "Unpopular Opinion: Keep buying stocks at prices you are comfortable with and stay with them.",
        "url": "https://www.reddit.com/r/stocks/comments/ge1qam/unpopular_opinion_keep_buying_stocks_at_prices/",
        "created": 1588727356.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1588940019,
        "id": "gfs392",
        "num_comments": 242,
        "num_crossposts": 0,
        "selftext": "If your question is \"I have $10,000, what do I do?\" or other \"advice for my personal situation\" questions. If you are going to ask how to invest you should include relevant information, such as the following:\n\n* How old are you?\n* Are you employed/making income? How much?\n* What are your objectives with this money? (buy a house? Retirement savings?)\n* What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know its 100% safe?)\n* What are you current holdings? (Do you already have exposure to specific funds and sectors?)\n* Any other assets? House paid off? Cars? Expensive significant other?\n* What is your time horizon? Do you need this money next month? Next 20yrs?\n* Any big debts?\n* Any other relevant financial information will be useful to give you a proper answer.\n\nPlease consider consulting our FAQ first - https://www.reddit.com/r/investing/wiki/faq \n\nBe aware that these answers are just opinions of Redditors and should be used as a starting point for your research. You should strongly consider seeing a registered financial rep before making any financial decisions!",
        "subreddit": "investing",
        "title": "Daily Advice Thread - All basic help or advice questions must be posted here.",
        "url": "https://www.reddit.com/r/investing/comments/gfs392/daily_advice_thread_all_basic_help_or_advice/",
        "created": 1588968819.0
    },
    {
        "author": "houseme",
        "created_utc": 1588936973,
        "id": "gfreor",
        "num_comments": 241,
        "num_crossposts": 0,
        "selftext": "Maybe its the ones in my profile but basically my profile is back to what it was before those whole pandemic and its starting to make me question.. what the hell? I mean i am happy but at same time i am just watching every day when the sky falls.",
        "subreddit": "stocks",
        "title": "No one is worried that a lot of stocks are back to almost ATH?",
        "url": "https://www.reddit.com/r/stocks/comments/gfreor/no_one_is_worried_that_a_lot_of_stocks_are_back/",
        "created": 1588965773.0
    },
    {
        "author": "msnf",
        "created_utc": 1588348322,
        "id": "gbkmc7",
        "num_comments": 234,
        "num_crossposts": 0,
        "selftext": "I think it has to be considered a personal milestone when your portfolio could buy 1 share of BRK-A. Today is that day for me!\n\nBut while noticing that, I also noticed that BRK-A, which has tracked the S&amp;P 500 fairly closely in recent years has lagged in the last month of the recovery. BRK-A put in its all-time high close on the same day the market peaked (February 19) at 344k vs. 3386 for the market. However BRK-A is currently trading at 276k vs. 2843 for the market, which represents about a 3.5% under-performance, all of which accrued during the month of April. Berkshire's defensive posture paid off during the crash, as it bottomed at around -30% vs. the market's -35%, but that seems to have reversed in April. I'm not sure what that means for the market, but I found it interesting.",
        "subreddit": "investing",
        "title": "Berkshire Hathaway, with a portfolio of value investments and $100B+ cash on hand, has under-performed the market during the Covid crisis.",
        "url": "https://www.reddit.com/r/investing/comments/gbkmc7/berkshire_hathaway_with_a_portfolio_of_value/",
        "created": 1588377122.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1588335401,
        "id": "gbh0y3",
        "num_comments": 224,
        "num_crossposts": 0,
        "selftext": "If your question is \"I have $10,000, what do I do?\" or other \"advice for my personal situation\" questions. If you are going to ask how to invest you should include relevant information, such as the following:\n\n* How old are you?\n* Are you employed/making income? How much?\n* What are your objectives with this money? (buy a house? Retirement savings?)\n* What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know its 100% safe?)\n* What are you current holdings? (Do you already have exposure to specific funds and sectors?)\n* Any other assets? House paid off? Cars? Expensive significant other?\n* What is your time horizon? Do you need this money next month? Next 20yrs?\n* Any big debts?\n* Any other relevant financial information will be useful to give you a proper answer.\n\nPlease consider consulting our FAQ first - https://www.reddit.com/r/investing/wiki/faq \n\nBe aware that these answers are just opinions of Redditors and should be used as a starting point for your research. You should strongly consider seeing a registered financial rep before making any financial decisions!",
        "subreddit": "investing",
        "title": "Daily Advice Thread - All basic help or advice questions must be posted here.",
        "url": "https://www.reddit.com/r/investing/comments/gbh0y3/daily_advice_thread_all_basic_help_or_advice/",
        "created": 1588364201.0
    },
    {
        "author": "SafariFeelsSnappier",
        "created_utc": 1589303341,
        "id": "gifdwc",
        "num_comments": 220,
        "num_crossposts": 0,
        "selftext": "The fundamentals and the “feel” of the markets are broken right now. Just like Goldman Sachs announced yesterday (5/11/2020), I think that there is a very good chance of a second crash coming to the markets.\n\nSo far, I trust my gut. I've been correct many, many times so far. In early January, I knew the market was coming down. On February 3rd, I even made a video (https://www.youtube.com/watch?v=gRmJPgljdG4) to sell stonks. I got laughed at.\n\nTurns out, a few weeks later exactly what I said would occur happened. Early March, Markets Crashed \\~30%. Based on a text I sent on Sunday, March 22, I said “I don’t see it dropping much further.” I came to this conclusion because I got news alerts that “Powell: Federal Reserve Pledges Unlimited Quantitative Easing to Keep Markets Functioning” and gut feeling the CARES ACT was nearing from drafting to negotiation phase. I bought, and told people to buy now.\n\nEnough humble bragging. As soon as this happened, the FED bailed out the market. **RULE #1**: DON'T FIGHT THE FED.\n\nAnyway, the next day (Monday, March 23rd) the Fed did come in. Since that day, the Markets have “recovered”.\n\nThe markets are going to experience a second dip. Since early April, I’ve expected a “W” recovery rather than a “V”, “U” or “√” recovery. Every day we move on, the more confident I become. Here are some reasons I predict a second dip:\n\n1. States will issue a second lockdown phase. High chance this may happen very soon (people freak out over confirmed cases/deaths next week as there is a 2week incubation period) or a spike in the fall. Prediction: 50%.\n2. The shutdown is dragged out way too long. States are crazy enough to extend until mid June. Who’s gonna stop them from shifting the goalposts into August, November, 2021? I see draconian states being crazy enough to do this. Prediction: 100%.\n3. People will realize unemployment numbers are not “temporary”, but permanent. The market seems to expect a quick bounce in the unemployment numbers, but I truly do not think this will happen. Prediction: 95%.\n4. Consumer spending/demand does not return. I see Q2 financial reports being a much bigger dumpster fire than predicted. April is expected to be bad, but May and June are expected to be a return to normal. I do not see this. Prediction: 80%.\n\nWith one of these  or a mix of these happening, I see a second dip in July/August.\n\nWhat will cause this second dip to recover? The Fed. Markets will keep falling, until then they drop \\~20% and the Fed comes back again.\n\nI predict the Fed will announce negative interest rates. President Trump wants this so badly, and it's one of the most powerful tools the Fed has to pump the market. I don’t even think the market needs to dip again for this to happen in the near future.\n\nI predict this will happen before the election. (September/October). Once this happens, there is no stopping how high stocks will go. As the great Warren Buffett says “Interest rates are like gravity in valuation. If interest rates are nothing, values can be almost infinite. If interest rates are extremely high, that's a huge gravitational pull on value”.\n\nGet those financial news apps installed on your phone ASAP. Fox Business, CNBC, etc. I DON'T CARE. Even if my prediction of a second dip is wrong, as soon as you hear that the Fed announces negative interest rates, go ALL IN. I won't tell you what stocks to buy, but as I said before: **DON'T FIGHT THE FED**. \n\n&amp;#x200B;\n\n\\&gt;in before \"this guy is full of shit\". I'm just writing my prediction",
        "subreddit": "wallstreetbets",
        "title": "My Prediction for the market after correctly calling the COVID Crash and Bottom",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gifdwc/my_prediction_for_the_market_after_correctly/",
        "created": 1589332141.0
    },
    {
        "author": "SpiderSaurusTron",
        "created_utc": 1588608251,
        "id": "gdeaop",
        "num_comments": 217,
        "num_crossposts": 0,
        "selftext": "I own a lot of UAL stock and am currently down about 50%.  I certainly dont mind waiting 4-5 years for it to recover if the return is like 70% by the end.  I'm currently in a position to keep dumpting 5-10k per month.  Is this a smart medium-term investment or am I deep into a sunk cost fallacy?",
        "subreddit": "investing",
        "title": "Double down on airline stock?",
        "url": "https://www.reddit.com/r/investing/comments/gdeaop/double_down_on_airline_stock/",
        "created": 1588637051.0
    },
    {
        "author": "prince-of-provi",
        "created_utc": 1588894078,
        "id": "gfhqyk",
        "num_comments": 217,
        "num_crossposts": 0,
        "selftext": "I’m looking to put 10k in to a stock in the next week but I have a few stocks I have in mind but I want to see what you guys think🤔 that way I can expand my watchlist and study which one seems to be the most beneficial. Thanks people !",
        "subreddit": "stocks",
        "title": "If you could put 10k in any stock right now with the mind of taking out in 6 to 18months which stock would you choose to risk it on ?",
        "url": "https://www.reddit.com/r/stocks/comments/gfhqyk/if_you_could_put_10k_in_any_stock_right_now_with/",
        "created": 1588922878.0
    },
    {
        "author": "11protons",
        "created_utc": 1588851612,
        "id": "gf4xep",
        "num_comments": 216,
        "num_crossposts": 0,
        "selftext": "A lot of traders like to make fun of this mentality. They say “set your stop losses tight, get out if it goes against you two ticks and move on.” This is a glue-guzzling retarded thing to say and I’m about to tell you why. \n\nBefore you say “Oh they’re professional traders, they know what they’re talking about,” do me a favor and shut the fuck up. This is the market that’s on it’s way to ATH. We’ve seen companies do the exact opposite of what they should do. STNG came out and made earnings their bitch and lost 10% in one day because the algos saw a downward dog trendline and a negative 50SMA. HOG came out and said they have no customers, no money, and no idea when they’ll make money again and they popped 20%. \n\nIf you start with an account of $1000 and make a stupid play, you might lose 80%. Say you invested in literally anything on march 23rd. However, if you decided to be retarded like Warren Buffett and sell at rock bottom, you would have a portfolio that’s worth 20% of what you started with. Why not sell and move into a different play? Because for you to take that $200 back to $1000, you would need 500% gains in a comparable amount of time as it would take for your original security to recover. \n\n“There’s no chance that the original security will recover fully!” Fucking wrong. Unless it’s Luckin Coffee or some other radioactive dogshit, we’ve seen time and again that stocks are only gonna go straight fuckin up for the next infinity years. Long after humans are gone algos are gonna be trading the last securities back and forth with digital money. \n\n“This is WSB, options or ban.” Someone rack this faggot. I’ve been on WSB for years and shares have always been part of the play. Especially right now, with IV insanely high, option premiums are through the roof and nothing is moving the way you expect it to. Buy shares in something with a low RSI, wait till it pops, and sell that shit. If it goes down, pretend its fucking bitcoin and hold it. \n\n If you wanna bitch and moan about only making 30% on a play, go to your all-time record on Robinhood and remind yourself that you’re down 94% all time and you would suck a bleeding hobo dick for 10% gains. Take your favorite lipstick and write “YOU ARE NOT FUCKING SMART ENOUGH FOR A TEN BAGGER” on your mirror until you learn to walk away from the table with 15% in a week. \n\n\nTL;DR buy shares, hold them till they go up, sell them, repeat. If they don’t go up, don’t fucking sell them, and maybe your kids will sell for a gain. \n\nPositions: STNG, DHT, GLOG, UIS, INFY, MPLX.",
        "subreddit": "wallstreetbets",
        "title": "Why “it’s not a loss until you sell” is 2020’s YOLO.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gf4xep/why_its_not_a_loss_until_you_sell_is_2020s_yolo/",
        "created": 1588880412.0
    },
    {
        "author": "ScaryPillow",
        "created_utc": 1588515156,
        "id": "gcr9ab",
        "num_comments": 215,
        "num_crossposts": 0,
        "selftext": "If not collapse at the very least, we would see extreme stagnation. I'd assume puts, but any particular established plays?  \n\nThere are so many geopolitical cliffhangers right now that could just go Mad Max in the medium-term:       \n  \n- Venezuela on the brink of political collapse. Low oil prices give no incentive for outsiders to come stabilize the country to get it. Could spill into guerilla warfare that plagues many regions in S. America.         \n- Whole swathes of countries that require oil revenue to maintain economic stability that will revert into ethnic conflict without the good times.       \n- Countries that depend on globalized trade and exports to support their economy due to no domestic consumption base: e.g. Germany.      \n- China, a country that is fucked politically, historically, ethnically, and that depends on globalization and exports to get foreign currency to obtain the raw materials it has none of.         \n- US withdrawing its military global police, allowing conflicts to spring up again.           \n- Mass collapse of demand for the products of many firms, including in the US.     \n\nHow does one profit from these geopolitical developements?",
        "subreddit": "wallstreetbets",
        "title": "How to profit off global geopolitical collapse?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gcr9ab/how_to_profit_off_global_geopolitical_collapse/",
        "created": 1588543956.0
    },
    {
        "author": "foxyfox71",
        "created_utc": 1588951528,
        "id": "gfv64m",
        "num_comments": 211,
        "num_crossposts": 1,
        "selftext": " I have another DD for those who want to ride the last bit of tech ER opportunity left out there.\n\nCSCO to announce their earnings on 5/13. Here's the optimal strategy:\n\n* Step 1: Go to CSCO 5/29 options, select the lowest premium possible which is 50c @ $0.06 atm\n* Step 2: Buy loads of contracts. Lets assume we buy 80 contracts for $480\n* Step 3: CSCO is currently $42.00... Let it climb to $45 until Wednesday 5/13. Ride the IV fluctuations until 5/13\n* Step 4: CSCO goes up by a mere 8% to $45 (which is extremely possible given how undervalued it is). The value of your stock is 2.5x your investment, you get $1,250. If it goes up to $46.33, your stock is up 6x times and your return is $2880.\n* Step 5: Sell your CSCO calls and take a lil break\n\nYou can see it for yourself using this calculator:  [https://www.optionsprofitcalculator.com/calculator/long-call.html](https://www.optionsprofitcalculator.com/calculator/long-call.html)\n\nTake my advice but use your own judgement. Good luck dickheads.",
        "subreddit": "wallstreetbets",
        "title": "Ok... Here's another good DD for you twats: CSCO 5/29 calls",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gfv64m/ok_heres_another_good_dd_for_you_twats_csco_529/",
        "created": 1588980328.0
    },
    {
        "author": "AngelaTheRipper",
        "created_utc": 1588816191,
        "id": "gexi90",
        "num_comments": 208,
        "num_crossposts": 0,
        "selftext": "To open I will make a bold claim, the rumors are true. Why do I think so, because that’s a pre-requirement for what follows to make sense. You can call me insane, idgaf. \n\nSomeone knows the above and has orchestrated a massive scheme to profit on this fact. We’ll call them whales. \n\nWhales started the buyout rumor in order to get the volume up. Nobody knows where this rumor started, MSFT using MVIS technology in their shit has been public knowledge for years. Probably pumped the stock a bit themselves, FOMO in full effect, then pumped it some more in extended hours using the fact that the volume is low, most stocks don’t move much in extended hours mind you. If you look at the past few days majority of gains happened during extended hours. Let it run for a few days to further build up the volume. Pump again during extended hours, keep that FOMO going. This was Friday and Monday.\n\nThen came yesterday (Tuesday), normal start although the momentum started to fizzle down. Then came the stop raid. Why, a few reasons, get some cheap stocks, shake off a chunk of the weaker hands, get an estimate of how much you can really crash it, trigger an SSR breaker, and lower the confidence into the stock which in turn lowers the volume. Then just let it recover or pump it up a bit, you need less volume but you still need a lot of volume to pull this shit off.\n\nThis brings us into today (Wednesday), not much growth since yesterday, the momentum fizzled out but those who were holding were holding hoping to sell during late Wednesday or early Thursday or push their luck and sell before the call, few planned to actually brave the earnings report and conference call. None of us believed the rumor to be true. \n\nThen came the massive dip, courtesy of a fake news headline, bots/trolls spreading it around, and probably some good old fashioned market manipulation. \n\nThis brings us to accumulation. The chart behaved weird, frequently just trading in a 2 cent range for hours, like there were points where it broke out in either direction but it basically stayed in 1.08 to 1.10 range for a large chunk of the trading session. This brings us to the SSR breaker, once that’s tripped for the rest of the trading day and the next day you can only place a short sale order at a higher price than the current price. So shorts had to play ball and sell for 1.10 or 1.09 when the price was at 1.08. A dip like that attracted a lot of shorts looking for a quick buck. The whales have eaten up all the short sales coming in and the weak hands getting out and are holding millions of shares. There was no recovery in the after hours today. Why, cause they don’t need it. The minor spike in AH was probably some dumber shorts getting burned and having to cover.\n\nTomorrow (Thursday) the trading day is going to be a sideways slide with close to 0 net change, it’s gonna look like the tail end of a one day runner after its done spiking, whoever was going to panic sell panic sold already. SSR breaker got tripped and volume is going to be in the gutter (buyers have no confidence in this bullshit anymore, shorts can’t bring it down, whales have fed).\n\nAfter hours the rumors will be confirmed to true. Yes Microsoft or at least someone is buying, might be Facebook, might be Amazon, might be Tesla, might be someone else. Price will absolutely explode between the moment that’s said and 8 PM. \n\nFriday, FOMO is again in full effect, everyone is chasing the stock, whales will either unload or just hold until buyout comes. Past Friday, who fucking cares, this is penny land after all.",
        "subreddit": "pennystocks",
        "title": "[Tinfoil hat time] The MVIS Rumor is true",
        "url": "https://www.reddit.com/r/pennystocks/comments/gexi90/tinfoil_hat_time_the_mvis_rumor_is_true/",
        "created": 1588844991.0
    },
    {
        "author": "acceler8td",
        "created_utc": 1588458553,
        "id": "gcfb27",
        "num_comments": 206,
        "num_crossposts": 0,
        "selftext": "-Literally nobody is using ridesharing given the worldwide lockdown\n-[They've laid off 17% of their workforce](https://techcrunch.com/2020/04/29/lyft-is-laying-off-982-employees-furloughing-a-further-288-due-to-covid-19-pandemic/)\n-Uber has Eats going for it and has a more diversified income stream. Lyft has nothing. It's literally ridesharing. \n-Q1 2019 earnings were 739.87M, Q4 2019 was 984.25M. Estimate for Q1 2020? 905.73M LMAO. \n-This POS was at $15.54 in March, now its back up to $29.48?? \n-They literally have no path to profitability.\n-Earnings on 5/6. They're gonna miss so fucking hard its a joke. \n-I honestly don't think it's priced in cause if it was this shit would be trading sub $10. Q2 will be even worse. \n\nTLDR LYFT 25P 5/15",
        "subreddit": "wallstreetbets",
        "title": "Goodnight Lyft",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gcfb27/goodnight_lyft/",
        "created": 1588487353.0
    },
    {
        "author": "Elyos92",
        "created_utc": 1588469583,
        "id": "gci4wn",
        "num_comments": 205,
        "num_crossposts": 0,
        "selftext": "I really don't get it. Every period had its well-running stocks like in the nifty fifty.   \nBut nowadays I don't say any reason why those companies would loose somehow their value. Can anyone give me a few scenarios besides government regulations?  \nI mean take GOOG, FB, AMZN and partly MSFT. They all basically have huge monopolies, let's say not including China.  \nGOOG and FB and somewhat AMZN are basically data mining, means the more data they have, the more valuable they get. How should they ever lose value as they are monopolies and get more data over time? I just don't get it.",
        "subreddit": "investing",
        "title": "How will GOOG, AMZN, MSFT, AAPL and FB ever lose value?",
        "url": "https://www.reddit.com/r/investing/comments/gci4wn/how_will_goog_amzn_msft_aapl_and_fb_ever_lose/",
        "created": 1588498383.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1588680683,
        "id": "gdwlkv",
        "num_comments": 205,
        "num_crossposts": 0,
        "selftext": "If your question is \"I have $10,000, what do I do?\" or other \"advice for my personal situation\" questions. If you are going to ask how to invest you should include relevant information, such as the following:\n\n* How old are you?\n* Are you employed/making income? How much?\n* What are your objectives with this money? (buy a house? Retirement savings?)\n* What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know its 100% safe?)\n* What are you current holdings? (Do you already have exposure to specific funds and sectors?)\n* Any other assets? House paid off? Cars? Expensive significant other?\n* What is your time horizon? Do you need this money next month? Next 20yrs?\n* Any big debts?\n* Any other relevant financial information will be useful to give you a proper answer.\n\nPlease consider consulting our FAQ first - https://www.reddit.com/r/investing/wiki/faq \n\nBe aware that these answers are just opinions of Redditors and should be used as a starting point for your research. You should strongly consider seeing a registered financial rep before making any financial decisions!",
        "subreddit": "investing",
        "title": "Daily Advice Thread - All basic help or advice questions must be posted here.",
        "url": "https://www.reddit.com/r/investing/comments/gdwlkv/daily_advice_thread_all_basic_help_or_advice/",
        "created": 1588709483.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1588752423,
        "id": "gefu3d",
        "num_comments": 201,
        "num_crossposts": 0,
        "selftext": "These daily discussions run from Monday to Friday including during our themed posts.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?sort=new&amp;q=Rate+My+Portfolio+-+r%2FStocks+Quarterly+Thread&amp;t=all&amp;restrict_sr=on).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion Wednesday - May 06, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/gefu3d/rstocks_daily_discussion_wednesday_may_06_2020/",
        "created": 1588781223.0
    },
    {
        "author": "Chas74124",
        "created_utc": 1588781349,
        "id": "gemwf9",
        "num_comments": 200,
        "num_crossposts": 0,
        "selftext": "Those DD posts all spammed yesterday. So much evidence the stock is going higher.\n\n-12% today.\n\nGreat work guys. DD is another way of saying \"I have no idea what I'm doing, so I'll rationalize why my trade will work.\" The mob of reddit upvotes it, because they're clueless, and now you got yourself a bunch of new bagholders.\n\nPerhaps it's a good thing these traders lose. Buying long on some of these companies, just downright stupid. \n\nStupid money is good. While it's sometimes painful to read the overwhelming amount of bullshit on this subreddit, every now and then something new comes along. Nowadays, we have the next hype stock posted daily. It's comical. \n\nHere's each point broken down:\n\n**Recklessly long-biased**\n-\n\n99.85% of all posts on here are long biased \"hot stock picks.\" I suspect many traders wouldn't be long if they had the choice. Unfortunately, robinhood and most mainstream brokers don't have the shares to borrow. So, instead of admitting it's impossible to profit long-term by swinging these pumps long, these traders double down. Like playing slots, they are always the losers, because they don't even know they are playing against the house.\n\n**Incompetent**\n-\n\nEver notice how each stock pick, those hype picks that you see on the front page, always fail? They always drop, even after a week. Those, like myself, who bring up the fact they fail, are met with usual replies:\n\n* You need to sell sooner rather than later\n\n* I bought before the pump even started\n\n* Gibberish about how the company is great\n\n* I'm a bad person for even suggesting the idea they'll fail\n\nNow all these vapid arguments all have one thing in common, the person has a vested interest in the stock. It's pretty amusing, because they create posts that are entirely emotion based. Some are more clever. Emotional based posts under the auspices of \"DD.\" I'll get to why this subreddits \"DD\" is nothing more than confirmation bias.\n\n**Shockingly uniformed**\n-\n\nNewbie traders, who admit they're new, should be given the benefit of the doubt. Although, newbies helping newbies create more newbie decisions, perhaps this is a bad cycle. While I can't prove it, sometimes there are manipulative forces that jump into subreddits like this. They mask themselves as \"arbiters of preforming proper DD.\" These people are nothing more than newsletter frauds, who have blended in to almost seem real. \n\nRead into astroturfing.\n\nEver notice how many DD posts contain a laundry list of reasons why a company is a good buy. Where is that short-biased DD? One side of the trade is correct, so perhaps there's more to it then \"microsoft may have a stake in it.\" Ironically, if you keep track of these hype stocks posted on here, all that DD is laughable. Re-read a few from a couple months ago. Check where those stocks ended up. \n\n**Never profitable long term**\n-\n\nOver the past 5 years, I've seen this subreddit grow into something pretty insane. A new stocktwits has formed. Pumpers, gullible sheep, and the occasional good trader make up the population on here. I remember posting similar things 5 years ago. These traders, who were confident in their positions at the time, would fire back at my contrarian arguments by saying my arguments are wrong. How many of these traders survived?\n\nNone.\n\nNone of those accounts, over 100 traders, survived.... except myself. I was short-biased, they were long-biased. Wave after wave, month after month, newbie traders are flushed out. Gullible traders, otherwise known as sheep, are the first ones to blow up. They are the slot machine players. The buyers into these hype stocks creating \"DD\" as a mask for their confirmation bias. \n\nCMV.",
        "subreddit": "pennystocks",
        "title": "CMV: This subreddit is recklessly long-biased, incompetent, shockingly uniformed, and never profitable long term",
        "url": "https://www.reddit.com/r/pennystocks/comments/gemwf9/cmv_this_subreddit_is_recklessly_longbiased/",
        "created": 1588810149.0
    },
    {
        "author": "The_moogeyBan",
        "created_utc": 1588814681,
        "id": "gex3ne",
        "num_comments": 198,
        "num_crossposts": 0,
        "selftext": " Alright autists and retards, everybody has been losing money on tankers this last week but I have news for you: your weak hands are the only reason you are losing money on tankers.\n\nIt may be a surprise to everyone under the age of 14 that the situation the tanker industry is in has happened twice in the past decade. There is a strong correlation between the oil contango and the market price of tanker stocks.\n\nAs you can see here from Euronav's investor update in April\n\n[https://imgur.com/UFgjZa5](https://imgur.com/UFgjZa5)\n\nNow that I have shown that the two are related let's take a look at the contango history:\n\n[https://imgur.com/e4Jwn76](https://imgur.com/e4Jwn76)\n\nLet's compare that to the stock price history of say STNG, NAT, ASC, FRO, and DHT:\n\n[https://imgur.com/iruMQGf](https://imgur.com/iruMQGf)\n\nIn 2008 and 2015 when the oil contango was at its highest (UNTIL NOW) these stocks were at 5-10 times what they are valued at now. It is important to note that the contango spike precedes the tanker stock price by about 6 months. But how is the contango rising compared to 2008? much faster and steadier ([https://imgur.com/oz4DplY](https://imgur.com/oz4DplY) ) What I am saying now is that these stocks are apollo 11 and you still have a chance to jump on the shuttle.\n\nLooking at earnings reports from STNG and DHT we see that they nearly made as much as the entire fiscal year of 2018 IN ONE QUARTER. No link cause I'm lazy and you people need to learn to do your own DD.\n\nSo everyone knows that the spot price is for these ships is up to as much as $110,000 (or at least you should know this because its over twice the standard rate and is RIDICULOUS) but what does that mean. Looking at ACG earnings report (I picked this one to show because its the most clear and easy to read) we can see \"Any increase in TCE goes fully to the bottom line, with every $10,000 / day increase in TCE adding approximately $90 million in earnings and cashflow annually.\"\n\nfrom ASC's highlights in the earnings report: [https://imgur.com/FNXyDMC](https://imgur.com/FNXyDMC)\n\nSo lets say they only are making $20,000 more per day per ship (its much more) and lets pick a small company like ACG that has a very small fleet of 20 tankers. That's a lot of tendies.\n\nWhat's the risk? U.S. tensions with the middle east could escalate and cut of transportation routes but I think this is very unlikely considering the pandemic.\n\nAre you worried COVID will bounce back and tank the economy so you don't want to invest? If that happens oil will go down again, storage will increase again and you will be drowning in so much cocaine and hookers you'll literally die.\n\nBuy the dip faggots.",
        "subreddit": "wallstreetbets",
        "title": "Update on Tankers",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gex3ne/update_on_tankers/",
        "created": 1588843481.0
    },
    {
        "author": "stonksmarket",
        "created_utc": 1588616522,
        "id": "gdgzh4",
        "num_comments": 192,
        "num_crossposts": 0,
        "selftext": "* Tim Bray, a senior engineer at Amazon, resigned on Friday over concerns about the company’s decision to fire workers who were outspoken critics of its labor practices. \n* In a blog post, Bray said he “snapped” when he learned Amazon fired Maren Costa and Emily Cunningham, two former user experience designers who criticized Amazon’s climate stance and treatment of warehouse workers.\n* Amazon has also fired multiple warehouse employees who criticized working conditions at its facilities. [(source)](https://www.cnbc.com/2020/05/04/amazon-engineer-resigns-over-companys-treatment-of-workers.html)\n\n [https://www.theverge.com/2020/5/4/21246284/amazon-vp-resign-whistleblower-firings-warehouse-workers](https://www.theverge.com/2020/5/4/21246284/amazon-vp-resign-whistleblower-firings-warehouse-workers) \n\nhe wrote a post on his blog, but that website is down, bet it was hosted on AWS they got shut it down lol",
        "subreddit": "investing",
        "title": "Amazon's VP of AWS quits after he ‘snapped’ when the company fired workers who called for coronavirus protections",
        "url": "https://www.reddit.com/r/investing/comments/gdgzh4/amazons_vp_of_aws_quits_after_he_snapped_when_the/",
        "created": 1588645322.0
    },
    {
        "author": "PotatoeFlavor",
        "created_utc": 1588727897,
        "id": "geai52",
        "num_comments": 191,
        "num_crossposts": 0,
        "selftext": "I want to say this is the last time I blindly skip through a long page of DD and think to myself \"that's a lot of words. He must be right.\"\n\n&amp;#x200B;\n\nBut I know I'll just do it again. Well played WSB. I love you.",
        "subreddit": "wallstreetbets",
        "title": "Buy tankers they said. Here DD they said. Can't go tits up they said.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/geai52/buy_tankers_they_said_here_dd_they_said_cant_go/",
        "created": 1588756697.0
    },
    {
        "author": "i-play-only-CV",
        "created_utc": 1588926734,
        "id": "gfpask",
        "num_comments": 191,
        "num_crossposts": 0,
        "selftext": " I pasted [the article](https://www.economist.com/leaders/2020/05/07/the-market-v-the-real-economy), to exempt you from registering an account to read it.\n\n##Financial markets have got out of whack with the economy. Something has to give\n\nSTOCK MARKET HISTORY is packed with drama: the 1929 crash; Black Monday in 1987, when share prices lost 20% in a day; the dotcom mania in 1999. With such precedents, nothing should come as a surprise, but the past eight weeks have been remarkable, nonetheless. A gut-wrenching sell-off in shares has been followed by a delirious rally in America. Between February 19th and March 23rd, the S&amp;P 500 index lost a third of its value. With barely a pause it has since rocketed, recovering more than half its loss. The catalyst was news that the Federal Reserve would buy corporate bonds, helping big firms finance their debts. Investors shifted from panic to optimism without missing a beat.\n\nThis rosy view from Wall Street should make you uneasy (see article). It contrasts with markets elsewhere. Shares in Britain and continental Europe, for example, have recovered more sluggishly. And it is a world away from life on Main Street. Even as the lockdown eases in America, the blow to jobs has been savage, with unemployment rising from 4% to about 16%, the highest rate since records began in 1948. While big firms’ shares soar and they get help from the Fed, small businesses are struggling to get cash from Uncle Sam.\n\nWounds from the financial crisis of 2007-09 are being reopened. “This is the second time we’ve bailed their asses out,” grumbled Joe Biden, the Democratic presidential candidate, last month. The battle over who pays for the fiscal burdens of the pandemic is just beginning. On the present trajectory, a backlash against big business is likely.\n\nStart with events in the markets. Much of the improved mood is because of the Fed, which has acted more dramatically than other central banks, buying up assets on an unimagined scale. It is committed to purchasing even more corporate debt, including high-yield “junk” bonds. The market for new issues of corporate bonds, which froze in February, has reopened in spectacular style. Companies have issued $560bn of bonds in the past six weeks, double the normal level. Even beached cruise-line firms have been able to raise cash, albeit at a high price. A cascade of bankruptcies at big firms has been forestalled. The central bank has, in effect, backstopped the cashflow of America Inc. The stockmarket has taken the hint and climbed.\n\nThe Fed has little choice—a run on the corporate-bond market would worsen a deep recession. Investors have cheered it on by piling into shares. They have nowhere else good to put their cash. Government-bond yields are barely positive in America. They are negative in Japan and much of Europe. You are guaranteed to lose money by holding them to maturity, and if inflation rises the losses would be painful. So stocks are appealing. By late March prices had fallen by enough to tempt the braver sort. They steeled themselves with the observation that much of the stockmarket’s value is tied to profits that will be made long after the covid-19 slump has given way to recovery.\n\nTellingly, though, the recent rise in share prices has been uneven. Even before the pandemic the market was lopsided, and it has become more so. Bourses in Britain and continental Europe, chock-full of troubled industries like carmaking, banking and energy, have lagged behind, and there are renewed jitters over the single currency (see article). In America investors have put even more faith in a tiny group of tech darlings—Alphabet, Amazon, Apple, Facebook and Microsoft—which now make up a fifth of the S&amp;P 500 index. There is little euphoria, just a despairing reach for the handful of businesses judged to be all-weather survivors.\n\nAt one level, this makes good sense. Asset managers have to put money to work as best they can. But there is something wrong with how fast stock prices have moved and where they have got back to. American shares are now higher than they were in August. This would seem to imply that commerce and the broader economy can get back to business as usual. There are countless threats to such a prospect, but three stand out.\n\nThe first is the risk of an aftershock. It is entirely possible that there will be a second wave of infections. And there are also the consequences of a steep recession to contend with—American GDP is expected to drop by about 10% in the second quarter compared with a year earlier. Many individual bosses hope that ruthless cost-cutting can help protect their margins and pay down the debts accumulated through the furlough. But in aggregate this corporate austerity will depress demand. The likely outcome is a 90% economy, running far below normal levels.\n\nA second hazard to reckon with is fraud. Extended booms tend to encourage shifty behaviour, and the expansion before the covid crash was the longest on record. Years of cheap money and financial engineering mean that accounting shenanigans may now be laid bare. Already there have been two notable scandals in Asia in recent weeks, at Luckin Coffee, a Chinese Starbucks wannabe, and Hin Leong, a Singaporean energy trader that has been hiding giant losses (see article). A big fraud or corporate collapse in America could rock the markets’ confidence, much as the demise of Enron shredded investors’ nerves in 2001 and Lehman Brothers led the stockmarket down in 2008.\n\nThe most overlooked risk is of a political backlash. The slump will hurt smaller firms and leave the bigger corporate survivors in a stronger position, increasing the concentration of some industries that was already a problem before the pandemic. A crisis demands sacrifice and will leave behind a big bill. The clamour for payback will only grow louder if big business has hogged more than its share of the subsidies on offer. It is easy to imagine windfall taxes on bailed-out industries, or a sharp reversal of the steady drop in the statutory federal corporate-tax rate, which fell to 21% in 2017 after President Donald Trump’s tax reforms, from a long-term average of well over 30%. Some Democrats want to limit mergers and stop firms returning cash to their owners.\n\nFor now, equity investors judge that the Fed has their back. But the mood of the markets can shift suddenly, as an extraordinary couple of months has proved. A one-month bear market scarcely seems enough time to absorb all the possible bad news from the pandemic and the huge uncertainty it has created. This stock market drama has a few more acts yet.■",
        "subreddit": "investing",
        "title": "A dangerous gap: The market v the real economy — The Economist, May 7 2020 edn.",
        "url": "https://www.reddit.com/r/investing/comments/gfpask/a_dangerous_gap_the_market_v_the_real_economy_the/",
        "created": 1588955534.0
    },
    {
        "author": "laminin1",
        "created_utc": 1589122059,
        "id": "gh2rxr",
        "num_comments": 189,
        "num_crossposts": 0,
        "selftext": "I ask this because all of the investing sub reddits I follow keep saying, \"the next down turn is around the corner\". Is it though? I would say that what the Fed has already done was pretty irresponsible. Whats to prevent them from continuing to pump up the markets and continue to see ATH? I am not trying to get politial. Just from an investing stand point what is actually going to make the markets go down if everytime bad news is produced, the Fed prints more money? Its like inflation has hit the stock market. How does a bubble actually pop if we just continue to pump it?",
        "subreddit": "StockMarket",
        "title": "Whats preventing the FED from printing more money and creating a larger bubble?",
        "url": "https://www.reddit.com/r/StockMarket/comments/gh2rxr/whats_preventing_the_fed_from_printing_more_money/",
        "created": 1589150859.0
    },
    {
        "author": "BoredMisanthrope",
        "created_utc": 1588459738,
        "id": "gcfm84",
        "num_comments": 189,
        "num_crossposts": 0,
        "selftext": " [https://www.cnbc.com/2020/05/02/warren-buffett-berkshire-hathaway-annual-meeting-live-updates.html](https://www.cnbc.com/2020/05/02/warren-buffett-berkshire-hathaway-annual-meeting-live-updates.html) \n\n\" Warren Buffett said he made an “understandable mistake” when valuing the airline stocks as a near-global halt in travel due to the coronavirus sent their prices sharply lower. “When we bought \\[airlines\\], we were getting an attractive amount for our money when investing across the airlines,” he said. “It turned out I was wrong about that business because of something that was not in any way the fault of four excellent CEOs. Believe me. No joy of being a CEO of an airline.” \n\nThought this would be worthwhile to post up here given the amount of discussion around airlines.",
        "subreddit": "stocks",
        "title": "Buffett says he was ‘wrong’ about the airlines",
        "url": "https://www.reddit.com/r/stocks/comments/gcfm84/buffett_says_he_was_wrong_about_the_airlines/",
        "created": 1588488538.0
    },
    {
        "author": "Spuri0n",
        "created_utc": 1588940252,
        "id": "gfs575",
        "num_comments": 188,
        "num_crossposts": 0,
        "selftext": "[Hi Billy Mays here](https://southparkstudios.mtvnimages.com/images/shows/south-park/clip-thumbnails/season-13/1308/south-park-s13e08c03-billy-mays-here-16x9.jpg?quality=0.8) and let me tell, have you heard about $CSOD and everyone instantly reaping 100% gains? Who doesn't want that? Well if you do I have the play for you! First let's catch you up to speed on this 2 week old post, which if you would have followed me, you to would be enjoying over 800% gains at this point.\n\n[Original DD Thread](https://www.reddit.com/r/wallstreetbets/comments/g7ifvr/cornerstone_ondemand_csdo_dd_undervalued_gem_in_a/)\n\n**but wait there's more!**\n\n&gt; Private reports of the SABA acquisition in relation to CSOD's overall revenue forecast a 25-33% increase, this will officially be detailed in Q1 earnings report.\n\n&gt; SABA has a very large clientele base which is apt for cross-selling $CSOD's exisiting products\n\n&gt; CSOD is mostly institutional buys. They are looking for safe-havens in this risky environment, $CSOD has a HUGE cash flow. Cash is king in a recession. They are also primarily catering to essential employees, their cash flow will not be as affected. SABA acquisition also represents a large percentage increase in free cash flow.\n\n&gt; CSOD already has most of its annualized returns locked in due to contracts and will be able to provide stable, if not forward-looking guidance.\n\n&gt; [Please see this additional comment DD, holy fucking shit just buy calls](https://www.reddit.com/r/wallstreetbets/comments/g7ifvr/cornerstone_ondemand_csdo_dd_undervalued_gem_in_a/folrklv/)\n\nSo what we have here is a undervalued, heavily hit company during the crash which has yet to make it's checkmark recovery like so many other stocks. What's difference?\n\nWell people are now finally realizing how strong the tech sector is, and how valuable remotely-engaged businesses will be in the future. This pandemic just caused a paradigm shift in how humans will work in the future, companies like $CSOD will profit from this immensely in the next 2-4 quarters which investors will EAT UP.\n\nNow let me answer some questions that I frequently see...\n\n&gt; *hurr durrr I saw the executives selling shares?* well yeah no shit, they were about to announce an acquisition which usually tanks share prices short-term. The next time they sold was the actual market crash, who wouldn't?\n\n&gt; *but what if this is another NET?* $CSOD is still significantly down from its share price before the crash and acquisition. Once we see how the new acquisition will help CSOD in the medium-term, institutions will be eating this stock up for its MASSIVE FREE CASH FLOW. Also this is mostly institutional buyers, this ain't a meme stock (except now it is...)\n\n&gt; *how are you sure they beat?* if you take a look at the current expectations for Q1, they are relatively low in a quarter where all of America, and the World was sent into lockdown resulting in a MASSIVE shift to online-based learning, trainings and work. I believe they beat handily and their SABA acquisition models are icing on the cake for the BREAKOUT OF THE CENTURY.\n\n&gt; *is it to late to join the party?* no but you now have to account for IV, don't pick retardly OTM 5/15 calls, stick to 6/19s at strikes $40 or $42.5, maybe $45 for a daytrade.\n\n&gt; *when are you selling?* I bet my short-term livelihood on this play, I can't leave it all on the table and will take some profits EOD Monday. I will be remaining in a $5k-$7.5k long-term play for earnings. Literally I bet my savings on this shit.\n\nI am glad my first $DD has been so profitable for so many, and I hope it continues to pay y'all out, it sure has for me. I can't wait to see what is in store on Monday night. What's next? Find out this weekend on another edition of Baked Morning.\n\nGood luck, and may your portfolio finally go green.\n\nTLDR: avoid IV, stick with June 19 $37.50c / $40c / $42.50c as many as you can buy.",
        "subreddit": "wallstreetbets",
        "title": "Baked Morning: Cornerstone On-Demand ($CSOD) - how did such a low-volume turd, give everyone 100%+ gains in a day?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gfs575/baked_morning_cornerstone_ondemand_csod_how_did/",
        "created": 1588969052.0
    },
    {
        "author": "Chas74124",
        "created_utc": 1589226677,
        "id": "ghv282",
        "num_comments": 186,
        "num_crossposts": 0,
        "selftext": "\nNew wave of players in this market, and a new wave of stupidity. With stupidity comes those who are without morals, and will trick you into believing nonsense. They will gladly take your money if you handed it to them. \n\nNew promoters pop up all the time. Sometimes with fancy indicators. Sometimes with \"well constructed DD.\" Sometimes they simply promote themselves as being fantastic traders. \n\nSome of us, who've been on this subreddit long enough, have seen these promoters come and go. Users like CaptainWeee, who was a glorified pump and dump artist, Tuffadams, etc. All scam artists. You'll even notice comments of sheep DEFENDING these charlatans. These commenters all no longer trade. If you defend these scam artists, you'll be on the wrong side of history.\n\nThe new nonsense is a no-name stocktwit user. We will call him scammer salm. Scammer salm fancies himself as a great trader. He frequently posts on alt accounts to push his own stock picks. This is known as astroturfing in the political realm. \n\nWhere did he come from? Why are there redditors RAVING about his picks? Do his picks work? All these questions will be answered in the piece below.\n\n**Where did he come from?**\n-\n\nMost promoters do the exact same things. They sell a service or promote a stock. They use alternate accounts to push their posts. They don't just \"spawn\" out of no where. They don't gain traction naturally. In fact, Scammy Salm is yet another pump and dump artist, using the same tricks that anyone could do. Buying upvotes, using alternative accounts, and giving a false perception of what's truly the case. Like the idea you can be profitable by following his callouts. Some promoters are more cleaver. Intentionally create controversy about their stock pick. That's smart, because it baits in more clicks and buyers. None of these traders who \"buy early on the pumps\" survive. Never.\n\n**Why are there redditors RAVING about his picks?**\n-\n\nIt's a trick. Some are genuinely invested in his picks. Sorry to say, these are the sheep that'll took the bait hook line and sinker. Most aren't raving. Most are actually him. His posts. His upvotes. His promotion.\n\nScammer salm creates a false perception by pushing his own material through manipulative means. This is what others on here have done. It's nothing new. In fact, you can find tons of evidence on older 2000s message boards. See the promoters job is to promote. They know they can make money by convincing as many people as possible. Before the contrarians fire back and say that's what I'm doing, I have no financial incentive. \n\n**Do his picks work?**\n-\n\nStudy history. Not only have promoters, and the sheep following them, all failed off, but they've created the next wave. The next wave of people who're just as gullible. I can't comment on the longevity of following a promoters picks. Many people are fooled by survivorship bias. They're convinced that their 2 - 10 profitable trades will lead to longevity. It doesn't. It will fail given enough variables and time.\n\nThese stocktwit screenshots and other promotions aren't spawning randomly. I think many are beginning to question why the moderators approved of image posting. Couldn't they see it was bound to be subject to manipulation? Probably. Perhaps shorting these posters is a better and more reliable method of profiting then doing \"DD\" on a long.\n\nIf you follow someones stock picks once, and it works, great! The more you follow their picks, the lower your account value will fall. \n\nYou can, however, profit by figuring out who the house is. \n\nThat's your edge.\n\nI've never touched, long or short, any of these promoters picks (including scammer salm).\n\nBest of luck.\n\n\n\n**Sources:**\n-\n\n* [Survivorship Bias](https://www.investopedia.com/terms/s/survivorshipbias.asp)\n* [Good read about pump and dump artists](https://investorshub.advfn.com/Dump-The-Pump-9311/)",
        "subreddit": "pennystocks",
        "title": "We've Got A Manipulation Problem",
        "url": "https://www.reddit.com/r/pennystocks/comments/ghv282/weve_got_a_manipulation_problem/",
        "created": 1589255477.0
    },
    {
        "author": "rieslingmagic",
        "created_utc": 1588798476,
        "id": "gesd22",
        "num_comments": 185,
        "num_crossposts": 0,
        "selftext": "I'll be honest, I have no position on this stock but I've been seeing it everywhere. All I heard was, wait for the big $MVIS news on Thursday, today is Wednesday and everyone's giving up? You're 1 day away, LOL\n\nAnyways, good luck, you guys at /r/pennystocks are funny",
        "subreddit": "pennystocks",
        "title": "$MVIS Hold",
        "url": "https://www.reddit.com/r/pennystocks/comments/gesd22/mvis_hold/",
        "created": 1588827276.0
    },
    {
        "author": "financeoptimum",
        "created_utc": 1588690931,
        "id": "gdzbx2",
        "num_comments": 184,
        "num_crossposts": 0,
        "selftext": "Warren Buffett made headlines recently after his recent [virtual Berkshire Hathaway Annual Shareholders Meeting](https://www.youtube.com/watch?v=69rm13iUUgE).\n\nBuffett sold of all his shares in the major US airlines, and Berkshire announced a record quarterly net loss of nearly $50BN. Berkshire *had* held sizeable positions (around 10%) in the major US airlines.\n\nAs well as this, Buffett also allowed Berkshire's cash stake to rise to a record $137.3BN from $128BN at the end of 2019.\n\nClearly, as he is selling at a significant loss, Buffett believes that there is further pain ahead for the airlines. \n\nThe GOAT is not one to fall for the sunk cost fallacy...\n\nMoreover, his cash position indicates that he doesn't believe that we have reached the stock market bottom yet, although he wouldn't give specifics.\n\nOthers however are more explicitly bearish.\n\nThe numbers are certainly [not looking good](https://fortune.com/2020/03/20/recession-us-gdp-negative-growth-q2-predictions/)...\n\n**TRUTH 1/2:**\n\n[1640 CEOs left their posts in 2019](https://www.cnbc.com/2020/01/07/2019-had-the-most-ceo-departures-on-record-with-more-than-1600.html), the highest year on record since tracking began in 2002.\n\nFor context, there were 1484 exits in *2008* when the country was embroiled in the financial crisis.\n\nThis trend has continued in 2020, [in January a record 219 CEOs left their posts](https://www.cnbc.com/2020/02/12/rapid-ceo-turnover-continues-with-a-record-number-of-top-executives-departing-in-january.html), the highest month on record.\n\nThe economy was going to crash anyway. It was inevitable.\n\nHowever, they were afraid of massive protests against corporate greed, massive social unrest, etc so they needed a diversion that would provide an excuse.\n\nPeople will think the crash was solely due to the virus and not the numerous fundamental economic and structural issues at play.\n\nTo highlight just a few: we've had the [yield curve inversion](https://www.businessinsider.de/international/yield-curve-inversion-explained-what-it-is-what-it-means-2019-8/?r=US&amp;IR=T), the [repo madness](https://www.bloomberg.com/news/articles/2019-12-08/repo-blowup-was-fueled-by-big-banks-and-hedge-funds-bis-says), the [record corporate debt](https://www.businessinsider.de/international/us-corporate-debt-10-trillion-record-percentage-economy-expert-warnings-2019-12/?r=US&amp;IR=T), and [corporations being the main source of demand for equities via stock buybacks](https://www.nytimes.com/2019/02/25/business/stock-market-buybacks.html) which enrich executives that hit certain earnings per share targets.\n\nLast year billionaire Peter Thiel, who was part of the notorious Paypal Mafia, [spoke on the dangers of American Exceptionalism](https://www.youtube.com/watch?v=7JRyy2MM-rI). He argues that this has made America \"exceptionally un-self-critical\"\n\nWarren Buffett concluded in his virtual meeting: \"Never bet against America\"\n\nIn other words, never bet against the military industrial complex to enforce American superiority and the power of the dollar as the de facto unit of exchange globally.\n\n**TRUTH 2/2:**\n\nAs smart contracts pioneer Nick Szabo has stated:\n\n\"Buffett's wealth can be measured less in present cash than in the future cash from the Fed he is right up there at the front of the Cantillon line to get.\"\n\n[The Cantillon Effect](https://www.youtube.com/watch?v=rv5xl1AEeQs) essentially refers to the fact that fiat printing itself increases inequality. \n\nOn a more general note, it is important to remember that, despite his gentle image, Buffett is ruthless in his craft. \n\nA [New York magazine profile from 1991](https://books.google.de/books?id=veTPZA9TWxsC&amp;pg=PA45&amp;lpg=PA45&amp;dq=1991+new+york+magazine+warren+buffett+Warren+looks+like+a+teddy+bear,+but+mentally+is+he+ever+tough&amp;source=bl&amp;ots=OT8xAOp_-y&amp;sig=ACfU3U2s1_9PvAvkaw4w5BSh0l1KgG1yhA&amp;hl=en&amp;sa=X&amp;ved=2ahUKEwjtvP2__ZzpAhUG3aQKHfcYA1kQ6AEwFXoECAkQAQ#v=onepage&amp;q=1991%20new%20york%20magazine%20warren%20buffett%20Warren%20looks%20like%20a%20teddy%20bear%2C%20but%20mentally%20is%20he%20ever%20tough&amp;f=false) stated: \n\n\"Though he appears homey and guileless and cultivates a hayseed image, Buffett can be iron-fisted.\"\n\nAccording to a senior Salomon trader: \"Warren looks like a teddy bear, but mentally is he ever tough.\"\n\nYes, Buffett has dropped numerous gems throughout the years, but ultimately his responsibility is to Berkshire Hathaway and his own, sizeable, bags.\n\nOverall, it would be foolish to overlook Buffett's current cash position.\n\nWhen everything is dirt cheap and we do eventually hit the bottom, he will be flush with cash and ready to aggressively sweep up bargains. \n\nAt the moment, it is clear that he believes these bargains are not present, and therefore it would be wise to consider the fact that we may have further downside in store...\n\n[https://www.youtube.com/watch?v=OsAfJMNtxsU](https://www.youtube.com/watch?v=OsAfJMNtxsU)",
        "subreddit": "StockMarket",
        "title": "Warren Buffett and the Stock Market Crash",
        "url": "https://www.reddit.com/r/StockMarket/comments/gdzbx2/warren_buffett_and_the_stock_market_crash/",
        "created": 1588719731.0
    },
    {
        "author": "hipotamer",
        "created_utc": 1588708639,
        "id": "ge4u1k",
        "num_comments": 178,
        "num_crossposts": 0,
        "selftext": "Am I retarded? Yes\nAm I maxed out on day trades and stuck with 2k in MVIS until tomorrow morning at least? Yes \nBasically what I’m saying is MVIS is gonna go to the moon because daddy Bill Gates taking over the company or I’m losing every single dollar wish me luck\n\nEdit: Oh shit It looking kinda good rn",
        "subreddit": "pennystocks",
        "title": "MVIS to the moon",
        "url": "https://www.reddit.com/r/pennystocks/comments/ge4u1k/mvis_to_the_moon/",
        "created": 1588737439.0
    },
    {
        "author": "20Hounds",
        "created_utc": 1588879142,
        "id": "gfd5so",
        "num_comments": 178,
        "num_crossposts": 0,
        "selftext": "Moving up from .80 to $1, let's stay on it and get up there!",
        "subreddit": "pennystocks",
        "title": "$MVIS Coming up, fellow bag holders let's stick together",
        "url": "https://www.reddit.com/r/pennystocks/comments/gfd5so/mvis_coming_up_fellow_bag_holders_lets_stick/",
        "created": 1588907942.0
    },
    {
        "author": "semen_biscuit",
        "created_utc": 1588595748,
        "id": "gdastt",
        "num_comments": 177,
        "num_crossposts": 0,
        "selftext": "I originally [posted](https://www.reddit.com/r/wallstreetbets/comments/fux17s/buy_tanker_stocks_if_you_like_tendies/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf) about buying tanker stocks four weeks ago. We’ve since seen these stocks appreciate considerably. \n\nI again [posted](https://www.reddit.com/r/wallstreetbets/comments/g2zhb0/taking_stock_of_tanker_stocks/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf) about tanker stocks again two weeks ago encouraging many of you to hold these stocks for longer than your usual holding period of two minutes. Many of you couldn’t resist the urge to take profit in advance of earnings. \n\nThat was a mistake. \n\nEarnings is the catalyst that will drive these companies higher. It’s when management will reveal not only the extent to which they’ve already captured outsized profits on elevated day rates but also when they will guide the market on 2Q and 3Q earnings based on the date rates they’re currently contracted on. I happen to have access to that data, and those contracts happen to be at very high rates. In short, street estimates of earnings are still way too low. \n\nIn my last post I made it clear that street analysts have been too conservative in raising their earnings estimates on tanker stocks. Finally today we have Jefferies analyst raising his PTs and estimates across every tanker stock in his coverage. Just before earnings, of course.\n\nDHT PT raised from $8 to $9, 2020 EPS raised from $2.20 to $2.89.\n\nEURN PT raised from $13 to $15, 2020 EPs raised from $2.66 to $3.89.\n\nFRO PT raised from $10 to $12, 2020 EPS raised from $2.82 to $3.87\n\nTNP PT raised from $5 to $5.50, 2020 EPS raised from $1.50 to $2.13\n\nSTNG PT raised from $30 to $32, 2020 EPS raised from $6.04 to $10.59.\n\nMy plan is to hold through 2Q earnings release, but I do expect this week to be a major week for tankers with multiple names reporting. Specifically, on the calendar this week we got DHT releasing tomorrow (5/5), then STNG (5/6) and EURN (5/7). Should be wild. LFG!",
        "subreddit": "wallstreetbets",
        "title": "Many of you took profits on tanker stocks ahead of earnings. That was dumb.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gdastt/many_of_you_took_profits_on_tanker_stocks_ahead/",
        "created": 1588624548.0
    },
    {
        "author": "GromGrommeta",
        "created_utc": 1588804234,
        "id": "geu5e2",
        "num_comments": 173,
        "num_crossposts": 0,
        "selftext": "Getting tired of reading posts from people who clearly didn't watch or read this earnings report or probably any earnings reports so here we go. Tldr: His cash position (actually t-bills) is not large compared to the entirety of Berk's assets. Now can you all stop with the \"But Buffett's holding cash\" meme?\n\n\"Now, I show on the slide that’s up, I show our… Well, let’s go back one. Yeah. I show our net, our cash and Treasury bill position on March 31st. And you might look at that and say, “Well, you’ve got $125 billion or so in cash and Treasury bills. And you’ve got…” At least at that point, we had about, I don’t know, $180 billion or so in equities. And you can say, “Well, that’s a huge position to have in Treasury bills versus just $180 billion in equities.” But we really have far more than that in equities because we own a lot of businesses. We own 100% of the stock of a great many businesses, which to us are very similar to the marketable stocks we own. We just don’t own them all. They don’t have a quote on them. But we have hundreds of billions of wholly owned businesses. So our $124 billion is not some 40% or so cash positions, it’s far less than that. And we will always keep plenty of cash on hand, and for any circumstances, with a 9/11 comes along, if the stock market is closed, as it was in World War I—it’s not going to be, but I didn’t think we were going to be having a pandemic when I watched that Creighton-Villanova game in January either.\"\n\n[Full Transcript](https://www.rev.com/blog/transcripts/warren-buffett-berkshire-hathaway-annual-meeting-transcript-2020)",
        "subreddit": "investing",
        "title": "What Buffett actually said about Berkshire's Cash Position",
        "url": "https://www.reddit.com/r/investing/comments/geu5e2/what_buffett_actually_said_about_berkshires_cash/",
        "created": 1588833034.0
    },
    {
        "author": "Iskippedfaceday",
        "created_utc": 1588888206,
        "id": "gfg18c",
        "num_comments": 172,
        "num_crossposts": 0,
        "selftext": "@Salm10 on Stocktwits\n\nIf you use ST, look through his profile and comments. He is insane. Idk how he does it, but he announces tickers that will likely run a certain amount, and he’s almost always right.\n\nHe doesn’t even really talk about the same stocks that get mentioned here, they’re often sleeper companies and have runs in all different kinds of sectors.\n\nJust look through his profile and look at his past predictions and compare it to the charts that followed. Dude is crazy good. \n\nJust my $0.02 and wondering if you guys know others that are like this as well.",
        "subreddit": "pennystocks",
        "title": "This Guy Calls Breakouts Before They Happen",
        "url": "https://www.reddit.com/r/pennystocks/comments/gfg18c/this_guy_calls_breakouts_before_they_happen/",
        "created": 1588917006.0
    },
    {
        "author": "Titz_up420",
        "created_utc": 1588774449,
        "id": "geks1b",
        "num_comments": 170,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Tanker calls. Managed to get my money back and then proceeded to lose it again. I’m big sad rn.",
        "url": "https://i.redd.it/vqyd9gimk5x41.jpg",
        "created": 1588803249.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1588925260,
        "id": "gfp02m",
        "num_comments": 168,
        "num_crossposts": 0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme and/or [post your arguments against fundamentals here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nMost fundamentals are updated every 3 months due to the fact that corporations release earnings reports every quarter, so traders are always speculating at what those earnings will say, and investors may change the size of their holdings based on those reports.  Expect a lot of volatility around earnings, but it usually doesn't matter if you're holding long term, but keep in mind the importance of earnings reports because a trend of declining earnings or a decline in some other fundamental will drive the stock down over the long term as well.\n\nSee the following word cloud and click through for the wiki:\n\n[Market Cap - Shares Outstanding - Volume - Dividend - EPS - P/E Ratio - EPS Q/Q - PEG - Sales Q/Q - Return on Assets (ROA) - Return on Equity (ROE) - BETA - SMA - quarterly earnings](https://www.reddit.com/r/stocks/wiki/fundamentals-themed-post)\n\nIf you have a basic question, for example \"what is EBITDA,\" then google \"investopedia EBITDA\" and click the Investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nUseful links:\n\n* [Investopedia Tuturiol](https://www.investopedia.com/university/all/fundamental-analysis/) on fundamental analysis including [Discounted Cash Flow](https://www.investopedia.com/university/dcf/) analysis; see [definition here](https://www.investopedia.com/terms/d/dcf.asp)\n* [FINVIZ](https://finviz.com/quote.ashx?t=aapl) for fundamental data, charts, and aggregated news\n* [Earnings Whisper](https://www.earningswhispers.com/stocks/aapl) for earnings details\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion &amp; Fundamentals Friday May 08, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/gfp02m/rstocks_daily_discussion_fundamentals_friday_may/",
        "created": 1588954060.0
    },
    {
        "author": "CokeAndPuppiies",
        "created_utc": 1588713122,
        "id": "ge69yb",
        "num_comments": 165,
        "num_crossposts": 0,
        "selftext": "feel victimized?\n\nhaving nightmares with evil tankers touching your tendies?\n\ncome join and share your pain, wont do shit about it but at least it will bring lolz",
        "subreddit": "wallstreetbets",
        "title": "Tanker Survivor Support Group (TRANNY for short)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ge69yb/tanker_survivor_support_group_tranny_for_short/",
        "created": 1588741922.0
    },
    {
        "author": "randomdudeinFL",
        "created_utc": 1588636743,
        "id": "gdn5mf",
        "num_comments": 164,
        "num_crossposts": 0,
        "selftext": "I’ve been trading for a decade now, and to be honest I was highly skeptical of advice coming from this sub when I joined.  The first 3 stocks I saw in here, since joining, though, have been legit gainers.  You’ve got my attention, for sure.  I almost pulled the trigger on MVIS, today, and actually regret that I didn’t.  That’s ok, though.  \n\nKudos to the folks doing serious DD and identifying potential opportunities for the group.",
        "subreddit": "pennystocks",
        "title": "Got to hand it to this sub",
        "url": "https://www.reddit.com/r/pennystocks/comments/gdn5mf/got_to_hand_it_to_this_sub/",
        "created": 1588665543.0
    },
    {
        "author": "Studmuffin1989",
        "created_utc": 1589313843,
        "id": "gij5zv",
        "num_comments": 164,
        "num_crossposts": 0,
        "selftext": "In the past 1.5 hours of trading almost every stock on my watch list drops down into the negative. Does anyone else find this enormously shady? Any logical reason for this to happen? It just seems like precise coordination by big money interests to me. Is this the beginning of the dump after they pumped it up?",
        "subreddit": "investing",
        "title": "And all of a sudden almost every stock on my watchlist drops?",
        "url": "https://www.reddit.com/r/investing/comments/gij5zv/and_all_of_a_sudden_almost_every_stock_on_my/",
        "created": 1589342643.0
    },
    {
        "author": "YungDonaldDarko",
        "created_utc": 1588791044,
        "id": "gepz13",
        "num_comments": 159,
        "num_crossposts": 0,
        "selftext": "Specifically the scene where Michael Burry (fellow autist) is trying to rationalize his position to his employee as the underlying mortgages that composed the infamous Credit Default Swaps started to default but the securities themselves continued to grow in value thanks to the whores at the ratings agencies.\n\n\"It is my understanding that we are in a completely fraudulent system!\"\n\n\"Or... or your wrong\"\n\nI see this viewpoint in r/stocks and here from so many traders in a contemporary viewpoint. Why isn't the sky falling?? Are we too early like the characters in this movie? J Pow's money printing will HAVE to catch up to us at some point right? These artificially inflated prices and metrics are completely backwards in the reflection of the actual fucking economy. No free lunch, its ECON 101. Not to mention all of the other external factors applying pressure onto the market (trade war, oil price war/demand issues, Rona, Brexit, etc). I genuinely feel the consistent frustration that they try to portray in the movie. I have no answers only aggravated questions! Fuck!!",
        "subreddit": "wallstreetbets",
        "title": "I keep having flashbacks to \"The Big Short\"",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gepz13/i_keep_having_flashbacks_to_the_big_short/",
        "created": 1588819844.0
    },
    {
        "author": "WhenThatBotlinePing",
        "created_utc": 1589095741,
        "id": "ggx1il",
        "num_comments": 159,
        "num_crossposts": 0,
        "selftext": "I don't have any positions for this, except to say that if Real Estate takes a shit, it will be massive on a scale that makes 2008 look cute.\n\nSo my Dad is a planner for a suburban city, and this will be a summary of what he's been telling me for the last decade.  Suburbs have been using development fees to fund maintenance in already existing communities.  Not a bit, totally.  The maintenance in any existing community is \\*totally\\* funded by development fees in new communities.  New developments will build the infrastructure for which the city will then be liable, and they intend to repair and maintain that infrastructure with development fees in the future.  Suburban communities are straight up incapable of paying for themselves, the cost in infrastructure maintenance absolutely dwarfs what they can bring in with property taxes.  If you ever wondered why the property taxes in New Jersey are so punishing, this is why.  It's an entire state of property owners, expensive infrastructure, and no businesses to tax.\n\n&amp;#x200B;\n\nSuburbs absolutely cannot survive any kind of cessation of development, and long term, they cannot survive at all.  The tax base to infrastructure ratio just doesn't fucking work.",
        "subreddit": "wallstreetbets",
        "title": "Suburban Communities are a Straight Up Ponzi Scheme",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ggx1il/suburban_communities_are_a_straight_up_ponzi/",
        "created": 1589124541.0
    },
    {
        "author": "devilmaskrascal",
        "created_utc": 1589229255,
        "id": "ghvwmv",
        "num_comments": 159,
        "num_crossposts": 0,
        "selftext": "Is Berkshire on it's way out or are investors sleeping on it? \n\nI'm tracking about 50 stocks with the hope of increasing my long-term positions and it's literally the only one still &lt;17% above 52 week lows (only 9.45% above). Do people think the value goes out the window when Buffett passes away? That Buffett has lost his touch? Is it the government's QE and bailouts that has hurt their ability to operate in normal fashion and buy up troubled companies? \n\nThey're essentially the biggest hedge fund in the world and sitting on billions but they seem to think we haven't hit a point where there were any fair values on companies they were interested in. Are they a dinosaur on the decline, or the best deal out there? If they don't find any good deals with all their cash, won't they start doing share buybacks to increase the value internally?",
        "subreddit": "stocks",
        "title": "BRK-B worst performer out of 50 stock watchlist",
        "url": "https://www.reddit.com/r/stocks/comments/ghvwmv/brkb_worst_performer_out_of_50_stock_watchlist/",
        "created": 1589258055.0
    },
    {
        "author": "Doing-the-most",
        "created_utc": 1588717456,
        "id": "ge7lia",
        "num_comments": 158,
        "num_crossposts": 0,
        "selftext": "So I’ve decided to sell off all my positions today and have a grand total of 3k. I’ve decided to become an autist and yolo it all and maybe make it to the WSB hall of fame for being a genius because it worked or apart of the rest of you peasants that failed at attempting this. Shoutout any tickers you have in mind were I should yolo this",
        "subreddit": "wallstreetbets",
        "title": "Yoloing 3k tomorrow!!!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ge7lia/yoloing_3k_tomorrow/",
        "created": 1588746256.0
    },
    {
        "author": "TJSCrypto",
        "created_utc": 1588467054,
        "id": "gchij6",
        "num_comments": 157,
        "num_crossposts": 0,
        "selftext": "I'm just reading that Warren Buffet dumped his entire stake of airlines in April, saying that \"I was wrong about that business\". What do you think of this news, and might it cause airline stocks like AC to drop on Monday?\n\n[https://www.marketwatch.com/story/buffett-dumps-entire-airline-stake-saying-the-world-changed-for-airlines-2020-05-02?mod=mw\\_latestnews](https://www.marketwatch.com/story/buffett-dumps-entire-airline-stake-saying-the-world-changed-for-airlines-2020-05-02?mod=mw_latestnews)",
        "subreddit": "CanadianInvestor",
        "title": "'Buffett Says He Dumped Entire Airline Sector Stake' - Will Airline Stocks Drop on This?",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/gchij6/buffett_says_he_dumped_entire_airline_sector/",
        "created": 1588495854.0
    },
    {
        "author": "2020sbear",
        "created_utc": 1588765366,
        "id": "geifnw",
        "num_comments": 157,
        "num_crossposts": 0,
        "selftext": "Daily overview heading into the US open. The US options market opens in about 2 hours from now. Futures are up. [Prices trade on resistance](https://www.reddit.com/user/2020sbear/comments/gehuxi/were_now_back_to_2890_spx/). Our outlook for the day is bearish.\n\n&amp;#x200B;\n\n**Day opportunity rank: 1**\n\n&amp;#x200B;\n\nExpected opening action:\n\nSPX is trading 2890 in the futures market.  Prices making a double top in this area would signal a  downtrend through the day most likely.  I expect to see the market continue to  fall in the coming couple of hours and the US open  to be lower than the current price.  My estimate  at this point is a  low around 2865 - 2860.\n\nIf we see prices falling a bit in futures and then breaking under this level our best bet for the day is probably going to be found around the retest of the 2880 area. Here we can buy puts and use moderate strikes  of 2865 - 2860 or aggressive strikes of 2845.  This is a level where I want to take daily, weekly and monthly options.\n\n&amp;#x200B;\n\n**Risk assessment of the day;**\n\n&amp;#x200B;\n\nBullish risk:\n\nTo gain any sort of control over the market the bulls have to be able to take the 2890 area.  Above the 2899 level the bulls could have a firmer grip on the market until at lest 2910.  All risk today should be confined to under the 2890 level.  2899 is the stop loss level on the day.  As the market trades right now, I think the bull risk is low,  and lower still if we fall to  2865 sort of level.\n\n&amp;#x200B;\n\nRange risk:\n\nI think  today has a very low probability of being a ranging day. I do think the market can range for a while around the 2890 price point, and I'd not expect to see this for more than 8 - 9 hours. We've been there around 6 hours now and I think (at least one way or the other) a break of the range is due and a trending day will follow.\n\n&amp;#x200B;\n\nI think it is very likely some sort of news that will start to make the market very volatile is due some time in the coming days or week ahead. Today we have a big opportunity to position ourselves for this. Taking quite a low  risk entry that we can cut loss on quickly if need be, and get in to the trades before the premiums rocket.\n\n&amp;#x200B;\n\n \n\n\\----\n\nOptions trading can be very profitable but is also something that can have a lot of (especially short-term) variance. To trade options without any losses is impossible and even profitable options trading strategies are going to experience some runs of losing trades. Here are some risk awareness points anyone considering options trades based upon ideas and information posted here;\n\nDaily options 3 times rule:\n\nDaily options can produce either reasonable or exceptional gains in a small period of time. The right option on the right day is worth a fortune, but these are also the trades most likely to produce losses. When taking daily options it's best to adopt a mindset of being willing to lose the option on three attempts if required. That's not to say risk everything over three bets, it's to say bet an amount you can lose 3 times and still be fine to take other trades later.\n\nOpportunity Ranks;\n\nThere is always the option to trade, but the best opportunities to trade come along far more infrequently. Many days and weeks or trading will not present extremely high probability options trades. Using smaller bets during times when the market is offering lower odds (which is most of the time) allows for the riding of more ups and downs in losses while waiting for clearer opportunities. At times when more things line up to support the trade, it makes more sense to bet bigger on these. These are rarer opportunities.\n\nMarket conditions will be ranked as being low (3), medium (2) or high (1) probability. High probability rankings do not remove the requirement or usefulness of the three times rule. Often a big move is going to happen, but getting it on the nose first time is difficult. Hedging and Protecting Positions; It is best to ensure there is capital available to place hedge trades against options you have open if required. This should be considered before opening any trades.\n\nEverything here's educational only. You have to make your own decisions",
        "subreddit": "options",
        "title": "My options trade plan for the day 6th May",
        "url": "https://www.reddit.com/r/options/comments/geifnw/my_options_trade_plan_for_the_day_6th_may/",
        "created": 1588794166.0
    },
    {
        "author": "Euphemistic_Chicken",
        "created_utc": 1589139800,
        "id": "gh81gu",
        "num_comments": 156,
        "num_crossposts": 0,
        "selftext": "Two weeks ago it was UAVS\nThis past week was definitely MVIS",
        "subreddit": "pennystocks",
        "title": "What’s the stock of the week this week?",
        "url": "https://www.reddit.com/r/pennystocks/comments/gh81gu/whats_the_stock_of_the_week_this_week/",
        "created": 1589168600.0
    },
    {
        "author": "timftw9001",
        "created_utc": 1589130597,
        "id": "gh59o0",
        "num_comments": 155,
        "num_crossposts": 0,
        "selftext": "TLDR: people catch falling knifes on robinhood\n\n [https://robintrack.net/symbol/SAVE](https://robintrack.net/symbol/SAVE) \n\n [https://robintrack.net/symbol/AAL](https://robintrack.net/symbol/AAL) \n\n [https://robintrack.net/symbol/DAL](https://robintrack.net/symbol/DAL) \n\n [https://robintrack.net/symbol/UAL](https://robintrack.net/symbol/UAL) \n\n [https://robintrack.net/symbol/LUV](https://robintrack.net/symbol/LUV) \n\n [https://robintrack.net/symbol/ALK](https://robintrack.net/symbol/ALK) \n\n [https://robintrack.net/symbol/JBLU](https://robintrack.net/symbol/JBLU) \n\n [https://robintrack.net/symbol/VLRS](https://robintrack.net/symbol/VLRS) \n\n [https://robintrack.net/symbol/ALGT](https://robintrack.net/symbol/ALGT) \n\nAll the charts show the airlines stocks taking a shit febuary-march, then realivitly flatlining since apirl.\n\nThey show Robinhood owners of these stock increasing 10-20 fold since pre-pandemic level, and at no point does the number of owners ever decrease. \n\nThere is an infinite supply of people who think it is a good idea to start buying airline and other failing industries right now.\n\nBecause every Robinhood owner including myself is dumb as bricks we SHOULD inverse them, but I do not think daddy trump will let them go lower.",
        "subreddit": "wallstreetbets",
        "title": "Robinhood investors love airlines",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gh59o0/robinhood_investors_love_airlines/",
        "created": 1589159397.0
    },
    {
        "author": "TrueCryptoFan",
        "created_utc": 1589221595,
        "id": "ghta1l",
        "num_comments": 154,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Should I sell or hold through earnings lol...I gambled my last $5k on this after being down from $35k so I’m worried I should cash in. and was going to give up if this investment didn’t work out. Or should I dump it at the open tomorrow.",
        "url": "https://i.redd.it/9w2lagr7i6y41.jpg",
        "created": 1589250395.0
    },
    {
        "author": "Onetapfapnap",
        "created_utc": 1589143556,
        "id": "gh97ya",
        "num_comments": 154,
        "num_crossposts": 0,
        "selftext": "Title says it all; this rally was driven by Institutions and Brokers taking advantage of all the bearish outlook post-March. They saw the opportunity in our dumbasses desiring a complete economic fallout and an ever greater Great Depression. All they had to do is push the market up and watch the naive Bears capitulate.\n\nI've seen a few posts mention WSB is starting to turn Bullish, which I agree. It's hard for the retail investor/autist to not want to be a Bull especially since the big boys fucked them over and they stupidly jumped in to a Bear position at the end of March playing catch-up (FOMO really). \n\nOnce everyone is talking about DOW 30,000 or SPY 420 or NASDAQ 10,000, the Institutions and Brokers will know exactly what to do. They're just waiting for our money to present itself for the taking by accumulating in one direction again. They need to cover their losses too!\n\nTLDR: You'll probably go bust (SPY 1000 Calls 5/15)",
        "subreddit": "wallstreetbets",
        "title": "The market will move in the direction that fucks the most of us over",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gh97ya/the_market_will_move_in_the_direction_that_fucks/",
        "created": 1589172356.0
    },
    {
        "author": "ModernDayHippi",
        "created_utc": 1589258415,
        "id": "gi47fx",
        "num_comments": 152,
        "num_crossposts": 0,
        "selftext": "Like what do they plan on doing with the trillions of assets that they have absorbed in the past month?  Are they just gonna hold this dogshit on their books until the end of time?  What about all the junk bonds and ETFs BlackRock has been buying up?  Where do these go?  In an ideal world, they would slowly be introduced back into the market once the market is \"standing on it's own\" again, whatever the fuck that means. \n\nExcept I don't think this is possible. [From 2008 to 2014, the Fed radically increased their balance sheet](https://thesoundingline.com/wp-content/uploads/2020/05/Balance-Sheet-of-the-Federal-Reserve-Total-Assets-1914-through-May-6th-2020.png) and only after **9 years** were they even able *to begin* to sell off a fraction of these holdings. \n\nNow here they are *again* holding the fucking bag that's looking to be multiples bigger.  If they even mention the possibility of selling this dogshit, the market is gonna crash.  So what's the plan? Is there even a plan?  I haven't seen this mentioned once and I'm hoping the wsb hivemind can soothe my fears.  \n\nMy personal opinion is they will inflate the mother of all bubbles to stave off a crash for possibly a few years which will crush all the bears’ hopes.  By then, the balance sheet will be around 10-12 trillion and rates will be a 25 bps negative.  At this point, the Fed will *actually be out of ammo*.  When the next disruption hits, I'm not really sure what they can do from there.  That's when the mother of all crashes happens and it's probably guns and ammo time.  For a brief moment you'll be rich on your shitty RH account until you're gunned down shortly after by roving gangs.  The level of irresponsibility we're seeing is truly unrivaled.  They are playing with our economy like it literally can't go tits up which makes me fear for the worst.  Or maybe i'm retarded like [this guy](https://media3.giphy.com/media/G8ebH5TOE3pde/source.gif).\n\nWait for us to hit 315 and then go in on some SPY 180 P 2022 strike",
        "subreddit": "wallstreetbets",
        "title": "What's the Fed's end game here?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gi47fx/whats_the_feds_end_game_here/",
        "created": 1589287215.0
    },
    {
        "author": "lurkingsince2006",
        "created_utc": 1589251556,
        "id": "gi2hed",
        "num_comments": 150,
        "num_crossposts": 0,
        "selftext": "# tl; dr\n\nSeriously, just go away.  If you can't be bothered to read for 5 minutes before putting money on something, you don't belong here.   You're not an autist; you're just a full blown retard.\n\nWhat you should do first is go read the post where I called the price of the stock pre-earnings and as a great [COVID Recovery Play: PRPL to $12-$14 by 5/12 and $20-$24 by end of Q1 2021](https://www.reddit.com/r/wallstreetbets/comments/g30vst/covid_recovery_play_prpl_to_1214_by_512_and_2024/)**.**\n\nAfter that, you need to go read how I predicted the beat on earnings consensus over the weekend here:   [Purple (PRPL) Earnings is Monday After Hours: Here's What to Expect](https://www.reddit.com/r/wallstreetbets/comments/ggp2vx/purple_prpl_earnings_is_monday_after_hours_heres/)**.**\n\nOnly after reading and understanding those two things will you be capable of making tendies as described below because you will actually know what you are doing.\n\nIf I've already exceeded your maximum word count, go back to reading the memes on the sub so you can cool your overheated brain.\n\n&amp;#x200B;\n\nNote:  all quotes below are paraphrased from the earnings call.  I am not transcribing that thing.\n\n# 2020 Q1 Earnings Release\n\nEarnings could not have gone better.  PRPL is literally a brand new business that should catch your eye for investment.  I am solidly in the $19+ camp [from my last post](https://www.reddit.com/r/wallstreetbets/comments/ggp2vx/purple_prpl_earnings_is_monday_after_hours_heres/) based upon results and the guidance given.   You can still make tendies on this play because PRPL builds its price action over time, which I will cover below.   Let's look at some numbers first.\n\n&amp;#x200B;\n\n||Consensus|Actuals|\n|:-|:-|:-|\n|Revenue|$106.97M|$122.4M|\n|EPS|$0.05|$0.11|\n\nA solid beat on Revenue, EPS, EBITDA and Adj. EBITDA.   Just an amazing quarter, but the historical isn't the best part.   The forward looking is ***amazing***.  Before we get into that, a few more numbers that matter.\n\n**Receivables**\n\nPRPL has a large wholesale business which means it has significant exposure to bad debts due to retail brick and mortar locations closing and retailers who are obviously cash starved.   Joe told us on the call  that their wholesale accounts are \"largely current on their receivables\" and Purple is \"continuing to get paid almost entirely across the board\".\n\nAwesome.  This means very little bad debt and the revenue earned will convert to cash.\n\n**Warrant Liability Accrual**\n\nYeah, I called this one.   It was material to the shift in EPS, but you are an idiot if you care.   This stuff is equity and should be treated as equity.   Yes, GAAP requires otherwise, but the FASB doesn't always make the best decisions.\n\n**Supply Chain**\n\n&gt;Our supply chain has not as yet been significantly affected by COVID-19. Currently, our domestic suppliers are able to continue operations and provide necessary materials when needed. Suppliers in China were temporarily closed as a result of the pandemic but we had sufficient inventory on hand. Many of our suppliers resumed production in March and are able to supply materials as needed. As a result, we don’t expect supply to have a material impact on our ability to meet anticipated demand.\n\nThere you have it.  Pretty much no supply chain risk.\n\n# Forward Looking Guidance\n\nPRPL did not provide formal guidance for the rest of the year, but the rest of the year is what they mostly talked about on the call, and the management team clearly wanted you to understand April with their \"[Second Quarter Preview](https://investors.purple.com/press-releases/news-details/2020/Purple-Innovation-Reports-Record-First-Quarter-2020-Results/default.aspx)\".  Let's look at what they said.\n\n**Cash**\n\nThey ended Q1 with $26.4M in cash (down from Q4's $33.5M in cash); however, **they ended April with $62.5M in cash**!  Management really wanted to call it out so they put the April cash number at the top with all of the Q1 numbers on the earnings release, which I thought was funny.  In reality, they've done a fantastic job at managing expenses and converting inventory on hand into cash during the quarter.   This should give you quite a bit of confidence in the management team.  This is probably more cash on hand than they have ever had, which means they are well weathered to not just manage this storm (which is a storm that is cash flow positive for them), but to invest ahead of the competition for the future.\n\n**Hiring and Capacity**\n\nJoe confirmed that \"the furlough is all but over\" and Purple is \"actually in hiring mode right now to bring people in fairly aggressively\" in order to expand capacity.   According to Joe, \"***demand has not waned at all***\".  Purple is still selling very near capacity (they brought a new machine online and are expanding their hiring aggressively to fill the capacity).\n\nPRPL announced previously, as a result of COVID, that they were deferring all capital expenditures.They've now done a 180 on that statement.  PRPL is accelerating the completion of the Max 7 machine in order to increase capacity another 20% over last year, which should be done this quarter.  The Max 8 &amp; 9 machines are still happening, but because they are being built in their new east coast manufacturing facility, it is unknown whether they will get them done this year.\n\nIf you have been paying attention to my previous posts, you will remember that ***the Max 8 &amp; 9 machines were not necessary to meet the pre-COVID guidance*** provided for the year.  This is part of why ***PRPL is going to beat their original pre-COVID guidance this year***.  Read on.\n\n**Wholesale Sales**\n\nWholesale is down dramatically.  Duh.  85% of wholesale doors were closed during April, but they have seen through April that sequential wholesale orders have been increasing.   **Believe it or not, we are happy for wholesale to stay closed longer for PRPL.**   What!?!   Yep.  We'll get into that more in a second, but let's talk about the hedge to revenue that wholesale provides.\n\nI strongly inferred in a previously post that PRPL can simply expand wholesale doors to make up for lost same store sells.   Joe just came out and said it on the call:  if wholesale sales are slow to recover on a same store basis, the could just expand to more doors.\n\nAdditionally, their wholesale partners burned through their safety stock of Purple mattresses.  As wholesale doors are opening up, large orders are coming in to restock their inventory.  The trend for wholesale remains to be seen as doors reopen and Memorial Day weekend comes in.  Wholesale doors are achieving up to 85% of demand at most right now and this is a good thing.\n\nThis means our worst case scenario is that PRPL will meet their pre-COVID guidance for the year by simply expanding wholesale doors.  The hedge.\n\n**Direct to Consumer Sales**\n\nTHIS is why PRPL is going to BEAT their pre-COVID guidance for the year.  I'm calling it now.\n\nApril DTC sales were up 170% YoY for the full month.   170%!!!  Not only that, Joe explained that:\n\n&gt;It has been remarkebly consistent.   Briefly saw DTC retract at the end of March.  PRPL saw pretty consistent DTC performance at the beginning of April, but a retraction in wholesale as stores shut down.  ***About the time the stimulus checks hit, we saw a pretty significant increase in our DTC business***\\*\\*.\\*\\*   We did some surveying and we don't think its entirely related to the stimulus checks themselves, but really some sentiment and people settle into the new normal. Since that time, ***we've seen a consistent but eleveated performance on DTC***.  It has really be pretty remarkable on how consistent it has been.\n\nThis means the run rate exiting April was greater than 170% YoY for DTC (if the average of 170% includes half the month at a lower rate).   Joe told us that this is more than offsetting the decline in wholesale.\n\nPRPL will beat pre-COVID guidance for the quarter and for the year because:\n\n* They have a new Mattress Max machine as of the beginning of the quarter (20% increase over last year's unit manufacturing capacity)\n* They are still selling everything they can make.\n* They receive greater revenue and margin from every DTC unit relative to wholesale.\n\nTherefore, we will see a revenue and earnings beat for the next quarter and likely the rest of the year.\n\nPRPL management believes that unit demand never disappeared and that they've seen a shift of demand from their brick and mortar partners to online (which means PRPL makes more money per mattress).\n\nAdditionally, they've seen a decline in marketing acquisition costs as many competitors are struggling and overall advertising costs are dropping nationwide.  The acquistion model online is much more simple than attempting to spend to get people to go into stores (for anyone who understands modern digital marketing, these means they will be able to scale their spend and revenue justifiably easier and faster).  New customers as a % of all customers (in terms of traffic and purchases) has gone up as they have been able to cast a wider net digitally and had a higher conversion rate.\n\nJoe's words about the boost in revenue caused by the shift to DTC are:  \"it is distorting revenue up\".   Joe, this is going to distort the stock price up too.\n\nLastly, Joe stated very clearly their plans for wholesale reopening offsetting DTC revenue in their manufacturing constrained world:  \"they would throttle their wholesale growth until they could continue to expand their capacity\".  DTC for the win!\n\n**A slow return to normal will benefit Purple by boosting per unit revenue and margin.**\n\nLike I said, this is a brand new business.\n\n# Forward Looking Price Action - More Tendies!\n\nThere are still opportunities to make tendies with PRPL tomorrow and over the next quarter.  Here is why.\n\n**PRPL Builds Price Momentum**\n\nBecause PRPL is a mid-market stock with not a lot of following and mid-market volume, its price actions are not immediate.  The typical pattern after earnings is that the price adjustment builds slowly over the next day to whatever direction earnings dictates.   Then, the price action continues to build over the next quarter.  Look at the price action after the Q3 2019 earnings call if you want the most pronounced example of this.\n\nWherever we start tomorrow, I'll bet money that we end much higher.\n\n**PRPLW Lag**\n\nPRPLW warrants do not behave like your typical CBOE options where market makers have algorithms changing the bid/ask on every strike with every movement of the stock.   Typical market makers accept those prices at every level because they are delta hedging with your play.\n\nPRPLW warrants are OTC and there is no options chain currently, which means not a whole lot of market making.   While this makes them less liquid, it also means that PRPLW warrants typically lag the price of PRPL stock on the way up as you are trading against other people.   Plenty of scalping opportunities on big price movement days if you know what you are doing.   If you don't know, it means you can usually get a good deal if you buy into a longer-term hold.\n\n**Short Interest**\n\nSHORT INTEREST INCREASED!!!  The 4/30 numbers are out tonight and short interest increased a whopping 33.5%!   That means we have a short float of 10.72%.\n\nIf you recall my weekend post,  only 16.44% of float is left with non-institutionals.   Those 2,439,121 short shares are going to get squeezed.   The shorts got hurt today with ER and they are going to want to slowly exit their position over the next day or so, which is another reason why we may see momentum in the stock tomorrow.   If there is a push behind it, we may see a much more dramatic squeeze.\n\nhttps://preview.redd.it/yqo6ilxgv8y41.png?width=791&amp;format=png&amp;auto=webp&amp;s=6bcdb6ded74c2d3281d7a98717e11aad72e17975\n\nWe still saw a significant amount of short volume through today.  As the stock gaps up, margin calls are going to happen.   As shorts cover and new buyers buy in, this will accelerate.   Depending on your broker, margin calls could have days to cover, which means we will see upward pressure over a few days.\n\n**Press Coverage**\n\nPRPL is still not a well known stock.  It will likely get some better press coverage over the next few days for two reasons:\n\n1. It slaughtered earnings better than most companies this season.\n2. Casper, a media darling, reports tomorrow morning.\n\nIt is Casper's first earnings release since IPOing.   Whether or not it is a disaster, most reporters will start drawing comparisons to PRPL.   More visibility through the day tomorrow and weeks to come will drive further new investment as people start to understand what is happening here.\n\n**Index Additions**\n\nPRPL gapping up and growing will only increase the number of indexes it gets added to and therefore funds that are required to buy in.   More cash investment required over the next few months will only support a growing stock price.\n\n**Great Fundamentals**\n\nLastly, this stock had great fundamentals before this huge earnings beat, and fundamentals always win in the long run.\n\n&amp;#x200B;\n\nGood luck tomorrow and let's get some tendies!\n\n&amp;#x200B;\n\n# Positions\n\nI have one share of PRPL.   I made $2 on it today and am up $1.91 since open.   In great wsb tradition, I'll probably do a gain post on that.\n\nThe PRPLW warrant prices don't update AH.   That's where I ended the day.   I had a steak dinner tonight to celebrate.   The wife tried to give me a chicken salad from Panera, but I wasn't having it.\n\nhttps://preview.redd.it/p8xftnpzz8y41.png?width=1242&amp;format=png&amp;auto=webp&amp;s=005bd6c3156a79eeab3d4ec007858cb6efb94c73",
        "subreddit": "wallstreetbets",
        "title": "PRPL KILLED earnings! Tendies can still be made. Here's how.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gi2hed/prpl_killed_earnings_tendies_can_still_be_made/",
        "created": 1589280356.0
    },
    {
        "author": "__justsayin__",
        "created_utc": 1588597409,
        "id": "gdb7vv",
        "num_comments": 148,
        "num_crossposts": 0,
        "selftext": "(Bloomberg) -- Air Canada said it expects the impact of the pandemic to last at least three years and predicted large job cuts as it hunkers down to survive “the darkest period ever” for the industry.\n\nThe country’s biggest airline, which on Monday reported a first-quarter loss, said it expects capacity in the third quarter to be 75% below last year’s level, from a 85-90% drop in the current quarter. It is accelerating plans to retire 79 planes and continues to look for ways to reduce costs and boost liquidity, it said.\n\n“We expect that both the overall industry and our airline will be considerably smaller for some time, which will unfortunately result in significant reductions in both fleet and employee levels,” Chief Executive Calin Rovinescu said in a statement. He described the situation as “the darkest period ever in the history of commercial aviation.”\n\nAir Canada’s “determination is to ensure that our company is positioned to emerge in the post-Covid-19 world as strong as possible and capitalize on the opportunities that will inevitably arise,” he said.\n\nIn contrast to major competitors around the world, Canadian airlines haven’t yet received industry-specific support from the government. So far Air Canada has said it will use a 75% wage subsidy to keep or recall most of the 36,000 employees in Canada who were furloughed.\n\nFor the first quarter, Air Canada reported a loss of C$1.05 billion ($745 million) compared to a profit of C$345 million last year. On an adjusted basis, the loss was C$392 million versus a profit of C$17 million last year.\n\n\nhttps://www.bnnbloomberg.ca/air-canada-sees-pandemic-impact-lasting-at-least-three-years-1.1431037",
        "subreddit": "CanadianInvestor",
        "title": "Air Canada Sees Pandemic Impact Lasting at Least Three Years &amp; Predicts \"large job cuts\"",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/gdb7vv/air_canada_sees_pandemic_impact_lasting_at_least/",
        "created": 1588626209.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1589112777,
        "id": "gh0fgr",
        "num_comments": 147,
        "num_crossposts": 0,
        "selftext": "If your question is \"I have $10,000, what do I do?\" or other \"advice for my personal situation\" questions. If you are going to ask how to invest you should include relevant information, such as the following:\n\n* How old are you?\n* Are you employed/making income? How much?\n* What are your objectives with this money? (buy a house? Retirement savings?)\n* What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know its 100% safe?)\n* What are you current holdings? (Do you already have exposure to specific funds and sectors?)\n* Any other assets? House paid off? Cars? Expensive significant other?\n* What is your time horizon? Do you need this money next month? Next 20yrs?\n* Any big debts?\n* Any other relevant financial information will be useful to give you a proper answer.\n\nPlease consider consulting our FAQ first - https://www.reddit.com/r/investing/wiki/faq \n\nBe aware that these answers are just opinions of Redditors and should be used as a starting point for your research. You should strongly consider seeing a registered financial rep before making any financial decisions!",
        "subreddit": "investing",
        "title": "Daily Advice Thread - All basic help or advice questions must be posted here.",
        "url": "https://www.reddit.com/r/investing/comments/gh0fgr/daily_advice_thread_all_basic_help_or_advice/",
        "created": 1589141577.0
    },
    {
        "author": "expander2",
        "created_utc": 1588628733,
        "id": "gdkvqf",
        "num_comments": 146,
        "num_crossposts": 0,
        "selftext": "Welcome back to the WSB DD Summary! This is for 5/2-5/4. I’m your host and resident autist u/expander2. You have to be able to read to gain anything from this so that rules out about half of you. As always, ticker is in bold on the left and what I deem \"important\" is near the top of the post. A TLDR, plays, and previous DD summaries will be at the bottom. My last posts still stand and hold some good info so check it out for more plays if this isn't enough for you greedy fucks.\n\n&amp;#x200B;\n\nFirst things first. Remember that we are reading *Money; A Suicide Note* for the [WSB Books event](https://www.reddit.com/r/wallstreetbets/comments/g85inu/wsbooks_vol_1_money_a_suicide_note_4pm_et_516/). It can be bought (which is recommended) or [downloaded here](https://epdf.pub/money-a-suicide-note129e7b0df400a345810ae585631783a94603.html). It will download as a LIT file then upload it to [this site](https://anyconv.com/lit-to-pdf-converter/) and re-download as a PDF. This event is aimed at making everyone a better trader and having a little autistic fun at the same time.  Now for the DD.\n\n&amp;#x200B;\n\n**Z;**  Let's take a look at Zillow. They are an interesting company. This is an excerpt straight from their website;\n\n&gt;Zillow serves the full lifecycle of owning and living in a home: buying, selling, renting, financing, remodeling and more. It starts with Zillow's living database of more than 110 million U.S. homes - including homes for sale, homes for rent and homes not currently on the market\n\nThey are a big business raking in $2.7 billion in 2019. However, looking at [their 10-K](https://last10k.com/sec-filings/z#link_fullReport) from that same year shows a $300 million loss which is up about $180 million from 2018. That's not good. They are consistently spending much more than they bring in but somehow are still seen as a good company. Their debt also rose in 2019 from about $700 million in long term debt to a whopping $1.5 BILLION. All these numbers are straight from their 10-K (Feel free to thank me and thank u/fuzzyblankeet too for teaching me how to understand this shit). At the end of 2019 they had 2,707 homes in their inventory. \n\nNow you ask, “What do we do with all these big numbers that I don't understand?”, and I say, “You just fucking look at them.” So here is what we can take away from this. This is a company that is consistently losing money, has more than doubled their debt in a year, and much of their asset value comes from owning 2,707 houses. What happens to the price of homes in a recession? It fucking drops… like a lot. [This post](https://www.reddit.com/r/wallstreetbets/comments/gdbzyn/home_sales_to_fall_up_to_60/) goes over some basic stuff but more importantly it shows what they just released which is a statement saying it might take UNTIL 2021 TO RECOVER. Damn, that sucks. Earnings come out on 5/7 after close so puts for 5/15 because you can't sell options that expire that day. But more than that, this is a long term play too. Zillow will not do well in a recession and we haven't quite entered one yet. If you want, look far out for puts. Could be a smart thing especially given all this information.\n\n&amp;#x200B;\n\n**Next Leg Down;** For another explanation on why we are rising in the midst of a pandemic, read this post or read the last few lines right here;\n\n&gt;This entire bull rally has been fueled by new retail investors buying the dip, bringing the stock price to euphoric levels. Over the past few weeks, we’ve been seeing the people waiting at the sidelines for years to get into the stock market slowly FOMO into the rally in smaller and smaller volumes, while the smart money have been locking in their profits at an even slower rate - hence an ascending wedge. As the amount of new retail interest in the stock market started slowed down, the amount of new bulls started to decline. This doesn’t mean we’ll instantly go back to circuit breakers, we might see 282 -&gt; 274 -&gt; 284 -&gt; 274 happen before panic, this time by the first-time investors, eventually bringing us down.\n\nI cut a couple things out so this isn't a direct quote but it's what you need to understand. Millions of first time investors are “buying the dip” and when they stop doing this in such large numbers then the real gravity of the situation we are in will hit. It will be all Uh-oh’s and fuck-me’s from then till we hit the bottom.\n\n&amp;#x200B;\n\n**Oil Reminder;**  Oh and remember those tanker plays I recommended on the [4/9-4/13](https://www.reddit.com/r/wallstreetbets/comments/g0nkrl/summary_of_dd_from_49413_insider_trading_oil/) post? Those fucking printed. So remember the [4/23-4/24](https://www.reddit.com/r/wallstreetbets/comments/g7f1m6/dd_from_423424_live_nation_oil_starbucks_and/) post I made about land based oil storage? Those are going to print too so get in while you can. \n\n&amp;#x200B;\n\n**Unusual Activity;** This isn't a big thing for me but it may help a few of you.  CNX Resources (CNX) is an oil and gas company and their earnings were terrible. Here's what is interesting; there was 32K open interest for Jul 6P, 28k puts for Oct 5p, and only 10k calls for Oct. Isn't that a little strange. That a lot of volume for a small company, seems like someone knows something we don't. \n\nThen there is Wright Medical Group NV (WMGI) which makes medical devices like joint implants and bone fixation devices for the foot and ankle and some other shit. They have 10k Aug 25P, 10k Aug 30p, and less than 4k volume for every other month. Weird. Do what you want with this information. I don't plan to do anything with these and wont include them in the TLDR or Plays. Here is [the original post](https://www.reddit.com/r/wallstreetbets/comments/gcgyg5/3_unusual_options_activity_from_last_week/) going into more detail about this.\n\n&amp;#x200B;\n\nLast thing, I plan to make an entire separate post detailing my strategy when doing earnings plays tomorrow. I will go over how I decide when to sell and what it looks like when things go wrong. I decided to leave it out of the DD summaries because it is its own category and would take up a lot of space in already long posts. Let me know if you guys are interested in this!\n\n&amp;#x200B;\n\nGood luck fuckers and tune in on Mondays, Wednesdays, and Fridays for more WSB DD Summaries!\n\n&amp;#x200B;\n\n**TLDR;** Zillow is absolute horse shit, next leg down is because of all the new money, land based oil is a good idea along with tankers, earnings play information session will come out tomorrow.\n\n**Plays;** Z puts for 5/15 and much farther out if you are willing to wait, MPLX, PAA, PBFX, DKL, SHLX, CNXM, MMP, and PAGP calls for late May/early June.\n\n**Previous WSB DD Summaries;** [4/23-4/24](https://www.reddit.com/r/wallstreetbets/comments/g7f1m6/dd_from_423424_live_nation_oil_starbucks_and/), [4/25-4/27](https://www.reddit.com/r/wallstreetbets/comments/g9a05f/dd_from_425427_the_markets_future_wingstop_huazhu/),[ 4/28-5/1](https://www.reddit.com/r/wallstreetbets/comments/gby6ez/dd_from_42851_match_alphabet_and_a_reminder_tldr/)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nDISCLAIMER; I am not personally advocating for any play that I add to this list. I merely go through a couple of days of posts and find what I think is competent DD. PLAY AT YOUR OWN RISK.",
        "subreddit": "wallstreetbets",
        "title": "DD from 5/2-5/4, Zillow, Next Leg Down, Oil Reminder, Unusual Activity, and more, TLDR and Plays included",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gdkvqf/dd_from_5254_zillow_next_leg_down_oil_reminder/",
        "created": 1588657533.0
    },
    {
        "author": "_WinnerTakesAll_",
        "created_utc": 1588691574,
        "id": "gdzjau",
        "num_comments": 144,
        "num_crossposts": 0,
        "selftext": "Yesterday a post about PTON caught my attention. It was by [/u/The\\_Big\\_Short\\_2020](https://www.reddit.com/user/The_Big_Short_2020), a new account that had lost money on Blue Apron and zero previous winning trades. Naturally I was intrigued. He is going long with over 50k in calls into Peloton's earnings call on May 6th. IV is nuts at 190% for options due May 8th. The stock is up 19.7% in the past week. He owns one of their bikes, so you already know he is biased and brainwashed. Peloton is just like a cult. Beckies and sissies paying to ride an overpriced stationary bike. Never go against a cult stock, a lesson Tesla shorts forgot about. So I had to match his retardedness by going long 53k [https://imgur.com/a/my7JJXm](https://imgur.com/a/my7JJXm) . We will see if our cumulative 6 figure investment pays off. The following is the copy past of the his position and following that the DD he posted:\n\n  [https://www.reddit.com/r/wallstreetbets/comments/gdj3zw/holding\\_over\\_50k\\_of\\_pton\\_calls\\_ahead\\_of\\_earnings/](https://www.reddit.com/r/wallstreetbets/comments/gdj3zw/holding_over_50k_of_pton_calls_ahead_of_earnings/) \n\nPeloton is growing rapidly - app downloads have grown tenfold. Their stock popped 5 percent when they announced that they had their largest live class (23,000 riders) over a week ago. Their previous largest live class was 19k the day after Thanksgiving.\n\nFYI - I just did a live class and there were 29k riders present; this is 20 percent higher than their previous record which again caused their stock to surge when announced - Pton chose not to announce this. Why? I’m not sure, maybe saving the good news for earnings?\n\nIm also bullish after calling the peloton delivery man who set up my peloton in February. During the phone call I had with him in late March, he said that they are 3x busier than the Christmas season and that he’s never seen demand like this during the two years he’s been with peloton. Though anecdotal, this tells me the lead time (in my area at least) is caused by the unprecedented demand for the bike. Demand during spring is huge because typically this is Peloton’s offseason. If they have christmas like demand for all of 2020, they will destroy their revenue guidance. Let’s also not forget that peloton lowered their revenue guidance during their last earnings call on Feb 5th before this pandemic hit. They will absolutely crush this lowered guidance, that would have never been lowered if they knew Mother Nature was going to give them the most ideal pandemic for their business model.\n\nLastly PTON CEO John Foley said in 2018 that if peloton wanted to turn a profit, they could do so tomorrow. The reason they don’t is because they want to aggressively capture market share which is why they spent nearly all their profit on commercials. Notice anything lately? Peloton hasn’t been airing commercials because there is no need with demand outstripping Manufactuing. This cut in add spending, coupled with unprecedented demand will allow them to reach profitably much sooner - if they announce that they expect to be profitable in 2021 - two years earlier than planned - than this stock will fucking soar.\n\n&amp;#x200B;\n\n \n\nA lot of people see the treadmill cancellation as a negative but I’ll argue it is a positive for two reasons:\n\n1) it is a lot larger and bulkier than the bikes. One treadmill takes the space of two bikes. Also the tread is a lot more time consuming to set up - even though Pton isn’t stepping inside their customers houses, they still set up the equipment outside. Bikes only allow for a greater amount of deliveries at a more efficient rate per delivery.\n\n2) Pton has better margins on their bikes versus their treads.\n\n&amp;#x200B;\n\nTDLR: Pton lowered revenue guidance in February - before the pandemic hit. If they had 20/20 vision they would have raised their guidance. Cuts in add spending, coupled with high demand will allow Pton to reach profitability MUCH sooner than originally believed. Their live rider class counts have grown over 20 percent WITHIN THE PAST WEEK. The cancellation of Pton treadmills allow for more deliveries and better margins. The guy who set up my Pton (I live in metro Detroit) told me that demand is Christmas x3 right now which tells me the long lead time is more likely caused by the spike in demand, rather than supply chain issues.",
        "subreddit": "wallstreetbets",
        "title": "Peloton earnings (190% IV) (6 figure invested)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gdzjau/peloton_earnings_190_iv_6_figure_invested/",
        "created": 1588720374.0
    },
    {
        "author": "2020sbear",
        "created_utc": 1588447379,
        "id": "gcc6zc",
        "num_comments": 143,
        "num_crossposts": 0,
        "selftext": "Hasn't the bull trap been fascinating to  watch?  What an incredible pendulum swing from the peak of pessimism in March to the wild splendour of predictions of the 'V' shaped recovery.\n\n&amp;#x200B;\n\nBull charge headfirst into red flags, and bear hibernate.  Here we are in the weekend of the first week of May, people's businesses are folding, renters demanding rent breaks, landlords sweating over insolvency and heart attacks just lost top spot in killer diseases to the most contagious virus any of us have ever seen in our lives; but none of this matter. Fed make market big big! Big big forever!\n\nThe bull [died  on the 28th of March](https://www.reddit.com/user/2020sbear/comments/g23ueb/the_bull_market_is_a_headless_chicken_and_the/).   The market *did break.* Just because people jumped in to short too early and have been getting roughed up 'Fighting the Fed' it does not change anything.  This spectacular 'Unprecedented' rally has not went up any more than historic bull traps.  The spiral of reduced wages &gt; reduced spending &gt; reduced business profits &gt; reduced wages (Loop) is still spinning. '[BRR BRR big big](https://imgur.com/a/S1T7IQQ)' is not improving real  GDP.\n\n&amp;#x200B;\n\nPeople think the market is not making sense, or not doing what it'd do if it was going to crash. This is not true. It's only not doing what you think it should do based upon what the news is telling you.  Once we'd seen the drop  of March what was to be expected was a bounce from the low and a [strong rally up to about 25,000  on the Dow peppered with positive news events.](https://bearmarketsprofits.com/2020/03/16/dow-jones-enters-end-of-denial-stage-and-start-of-the-bull-trap/)  All  of us who know how to trade have been waiting for that.\n\nThe market crash is going to be brutal. The second leg of the move will be bigger than the first one.  The low of the next drop can be under 50% from the high, and all the reasons people say that can't happen they said for the 2019 low breaking in  January, 2020.   A time when a 0.5% drop was considered buying the dip.\n\nWhat has taken weeks to go up will take hours to come down.  [A headline will come from no-where](https://www.reddit.com/user/2020sbear/comments/gatjxp/whatever_it_is_will_be_on_the_news/) and everything you think you know one day means nothing tomorrow.\n\n&amp;#x200B;\n\nI've done a lot of work on this trade.  How a trend fails and reverses is something I know a lot about. Whatever you do as an occupation and hobby - I know as much about this as you do about that. This is both my job and passion.  [I'm betting a lot of money on it,](https://www.reddit.com/user/2020sbear/comments/gbq6eu/big_short_end_of_day_3/) and I got my money by being really good at betting money in markets.\n\nI think the market is setting up to wipe people out.  Your warning sign of this is going to be the arrival of bad news in the coming week and a fall down to break the low of March. Around this time the news may seem to get better - but this will be your final chance to get out at a cheap loss (and yes, I consider a March low exit cheap relative to what June can bring).\n\n&amp;#x200B;\n\nI'm not saying my forecasts are perfect. They are not, but they really have been good enough to do sensationally well during 2020. I've been short from feb. Long during early April and built up a short in the 24,000 - 25,000 Dow range.   I'll paste below a walk through of analysis and trades to this point. If you care to, you can check the accuracy of it and decide how useful my perspective is.\n\n&amp;#x200B;\n\n\\---\n\nFind a three year forecast of the [Dow Jones bear market of the 2020's here.](https://bearmarketsprofits.com/2020/04/16/three-year-forecast-of-dow-jones-crash/)\n\n\\---\n\n\\-----------------------------------------------------------------------------------------------------------------------------------------------------\n\nThe US indices have been [forming a bubble](https://bearmarketsprofits.com/2020/02/29/formingbubbles/) over the last 50 years. In 2000 and 2008 we seen the early 'Bear trap' sections of the bubble and then in the following decade we seen enthusiasm become greed and greed become delusion. The 30% gain in the S&amp;P500 through the year 2019 was the final stages of this bubble.\n\nHere is a post describing us being in the ['Delusion' stage of the bubble in January of 2020](https://uk.tradingview.com/chart/SPX/KY1p7aZa-50-Years-Could-End-in-Tears-for-US-Indices/).\n\nThe pop of this bubble and the following bear market will not be a nice fast one like the crashes of 2000 and 2008, it will be a more drawn out affair where prices drop far lower. The crash of the 2020's will be more like the crash of the 1930's depression. See the analysis [leading to this conclusion here.](https://bearmarketsprofits.com/2020/03/01/us-indices-bubble-in-style-reflecting-the-great-depression-of-1930/)\n\nIn the months of January and February major US indices traded into the zone where a bubble template would be looking for the top to be made. Read about how this method has [worked in previous crashes here.](https://bearmarketsprofits.com/2020/04/05/how-technical-analysis-has-signalled-previous-stock-market-highs-and-now-again-in-2020/) First forecasts in late January were mostly stopped out. There were losing signals on the Dow [around 29,300](https://uk.tradingview.com/chart/DJI/RGkn3RjW-Dow-Jones-Crucial-Support-Levels-in-the-Week-Ahead/) and some in [February at 28,900](https://uk.tradingview.com/chart/DJI/xWSFpsRi-Selling-Dow-28-900/). Individual stocks shorts done poorly, One exception was the Vanguard dividends index VYM. This did make it's high on the [exact price first posted.](https://uk.tradingview.com/chart/VYM/BlWd0mFm-Popular-Vanguard-Has-High-Exposure-to-Bad-Market-Conditions/)\n\nIndividual stocks picks done particularly poorly in January. TSLA almost doubled from the first [shorting price of 510.](https://uk.tradingview.com/chart/TSLA/FOs1PP5d-Tesla-Could-Breakdown-Soon/) Some did a bit better. [Like shorting T at 39.](https://uk.tradingview.com/chart/T/IUgQyy8k-AT-T-Vulnerable-Debt-Cash-Flow-Leaks/)\n\nLater in February more sell signals were generated as price traded briefly over important resistance levels. If price broke back under these it would suggest market weakness. These were [170 on VTI](https://uk.tradingview.com/chart/VTI/IPRCTQh9-VTI-Enters-the-Stubborn-Stage-of-a-Possible-Reversal/) and [29,000 on the Dow.](https://uk.tradingview.com/chart/DJI/LiV4pmmH-Dow-Jones-Crucial-Downside-Break-Possible/) Once these levels were broken the bear market began. In the following days a signal for a [30% drop on the Dow Jones came](https://uk.tradingview.com/chart/DJI/Cd6Il3np-Next-Series-of-Falls-Can-Take-Dow-Down-10-000-Points/) (and was successful).\n\nIndividual stock picks did much better in February. High prices were signalled in [MSFT](https://uk.tradingview.com/chart/MSFT/LWCMh0jH-Microsoft-Setting-Up-For-Hard-Landing/), [BRK](https://uk.tradingview.com/chart/BRK.A/bHDf6D7j-Buffet-s-the-King-of-the-Bag-Holders/), [SPCE](https://uk.tradingview.com/chart/SPCE/uFAroqOi-SPCE-and-Gravity/), [GOOG](https://uk.tradingview.com/chart/GOOG/m56g98mU-Weekly-Bearish-Butterfly-Pattern/). A high on [AMZN was called](https://uk.tradingview.com/chart/AMZN/b4DOD5dy-The-Amazon-Bubble/), but price later traded higher. The best signal generated was a buy on the [TVIX from 34 to 800.](https://uk.tradingview.com/chart/TVIX/ts9VcIlG-TVIX-Long-Term-Trend-Line-Break/)\n\nIn the month of March , 2020, the bubble popped. Most risk based assets and indices crashed over 30%. First analysis post said to [wait for a bounce to sell into](https://uk.tradingview.com/chart/DJI/nVbfBVXn-Dow-Bounces-Like-a-Brick-While-Making-Big-Breakout/), but this was updated before the market opened to say prices could fall [8% and then 30% in March.](https://bearmarketsprofits.com/2020/03/01/30-dow-jones-drop/) At this point the TradingView account was suspended. Only one account is allowed, and this was set up specifically for a 2020's bear market. So no further posts or updates were made there.\n\nOn the 3rd of March came the first signal to [look for the down move entering somewhere in the 16,000 - 18,000 area](https://bearmarketsprofits.com/2020/03/16/dow-jones-enters-end-of-denial-stage-and-start-of-the-bull-trap/) on the Dow Jones. Followed by a post on the 16th of March saying [we're entering into the bull trap.](https://bearmarketsprofits.com/2020/03/31/optimism-in-the-air-as-end-of-bull-trap-approaches/) The low on the Dow would be made around 18,250 on the 23rd of March. From here a rally began which has made a current high of 24,500.\n\nApril of 2020 has been the bull trap month. Some losing signals have been generated in the later couple weeks of April. A few calls on the top of the bull trap have been made. Prices have not went substantially higher, they've just not dropped. A forecast on the [17th of April marks the current high](https://bearmarketsprofits.com/2020/04/16/17th-april-2020-the-bull-trap-completes/), but it looks like price can trade a bit higher. A post on the 19th of April calls for a crash in the S&amp;P500 to [1,600 within the next 5 - 10 weeks](https://bearmarketsprofits.com/2020/04/19/19th-of-april-here-comes-an-attitude-readjustment/).\n\nToday is the 25th of April. Over the last two weeks forecasts of a big drop starting have been inaccurate. I very strongly suspect this is akin to the sell signals generated in late January and early February. It's the right idea, but it's just the wrong time. A top in the Dow Jones somewhere in the 24,000 - 25,000",
        "subreddit": "stocks",
        "title": "You've heard of April fools, and you know what they say about May.",
        "url": "https://www.reddit.com/r/stocks/comments/gcc6zc/youve_heard_of_april_fools_and_you_know_what_they/",
        "created": 1588476179.0
    },
    {
        "author": "lizeskiman97",
        "created_utc": 1589243495,
        "id": "gi085f",
        "num_comments": 143,
        "num_crossposts": 0,
        "selftext": "\n\n\n\nHave been playing with options for just two weeks now. Still learning a lot about them but in the last two weeks I have become rich. I used my $1200 stimulus check and in two weeks I have turned it into $6,000 and placing calls on the sp500. The average American has $3000 in their savings account so I’m double that. At 29.\n\nJust wanted to say thanks to the haters. They really gave me the motivation to learn how to get rich. My friend literally just told me today that he has $300 to his name and his rent is coming up soon. So think about how much more I have than him. I’m gonna keep grinding and using this stock market to get rich. It’s easy for me. Once I hit $10k I am in the top 7 percent of Americans.",
        "subreddit": "stocks",
        "title": "Stocks made me rich. Just a self reflection on how I got here",
        "url": "https://www.reddit.com/r/stocks/comments/gi085f/stocks_made_me_rich_just_a_self_reflection_on_how/",
        "created": 1589272295.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1589026265,
        "id": "ggeebs",
        "num_comments": 142,
        "num_crossposts": 0,
        "selftext": "If your question is \"I have $10,000, what do I do?\" or other \"advice for my personal situation\" questions. If you are going to ask how to invest you should include relevant information, such as the following:\n\n* How old are you?\n* Are you employed/making income? How much?\n* What are your objectives with this money? (buy a house? Retirement savings?)\n* What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know its 100% safe?)\n* What are you current holdings? (Do you already have exposure to specific funds and sectors?)\n* Any other assets? House paid off? Cars? Expensive significant other?\n* What is your time horizon? Do you need this money next month? Next 20yrs?\n* Any big debts?\n* Any other relevant financial information will be useful to give you a proper answer.\n\nPlease consider consulting our FAQ first - https://www.reddit.com/r/investing/wiki/faq \n\nBe aware that these answers are just opinions of Redditors and should be used as a starting point for your research. You should strongly consider seeing a registered financial rep before making any financial decisions!",
        "subreddit": "investing",
        "title": "Daily Advice Thread - All basic help or advice questions must be posted here.",
        "url": "https://www.reddit.com/r/investing/comments/ggeebs/daily_advice_thread_all_basic_help_or_advice/",
        "created": 1589055065.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1589285448,
        "id": "gia0t2",
        "num_comments": 142,
        "num_crossposts": 0,
        "selftext": "If your question is \"I have $10,000, what do I do?\" or other \"advice for my personal situation\" questions. If you are going to ask how to invest you should include relevant information, such as the following:\n\n* How old are you?\n* Are you employed/making income? How much?\n* What are your objectives with this money? (buy a house? Retirement savings?)\n* What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know its 100% safe?)\n* What are you current holdings? (Do you already have exposure to specific funds and sectors?)\n* Any other assets? House paid off? Cars? Expensive significant other?\n* What is your time horizon? Do you need this money next month? Next 20yrs?\n* Any big debts?\n* Any other relevant financial information will be useful to give you a proper answer.\n\nPlease consider consulting our FAQ first - https://www.reddit.com/r/investing/wiki/faq \n\nBe aware that these answers are just opinions of Redditors and should be used as a starting point for your research. You should strongly consider seeing a registered financial rep before making any financial decisions!",
        "subreddit": "investing",
        "title": "Daily Advice Thread - All basic help or advice questions must be posted here.",
        "url": "https://www.reddit.com/r/investing/comments/gia0t2/daily_advice_thread_all_basic_help_or_advice/",
        "created": 1589314248.0
    },
    {
        "author": "XxDustinxx-S",
        "created_utc": 1588824944,
        "id": "geznab",
        "num_comments": 141,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Calls/Puts on which of these guys.....Let’s hear it.",
        "url": "https://i.redd.it/3sesu6qrq9x41.jpg",
        "created": 1588853744.0
    },
    {
        "author": "cancelmyfamily",
        "created_utc": 1589133858,
        "id": "gh68bo",
        "num_comments": 141,
        "num_crossposts": 0,
        "selftext": "I follow big &amp; unusual options activity in the market &amp; make trades when I see big money hit a name combined with a nice technical setup. When big money hits the options market it is often the smart money that knows something we tards dont, so I try to follow those moves. There was a number of stonks on Friday (and last week) that were seeing high unusual options activity - see https://www.barchart.com/options/volume-leaders/stocks?page=1 for end of day data.\n\nOf many options that stood out to me (many of which I got into as well), $DIS call buying really stood out to me for a couple reasons. \n\n1. Technical setup is beautiful. DIS held $100 after poor ER &amp; is now pushing higher on positive reopening news. There is a gap that will lead us to $120 if we can break out past $113. \n2. On Friday alone the May15 $110s &amp; $112s were traded in high volume. The $110s traded 16k to oi of 20k and the $112s traded nearly 20k compared to an oi of just over 1k. When volume exceed oi like this it is a clear sign big traders are moving in. The $112s represent a trade of over $1M on OTM &lt;30delta that expires in a week.\n3. While the two prior points are really what I look for to execute a trade it is worth mentioning that laggards are beginning to come up, and leisure related stocks are rallying big time, DIS included. If this money flow/trade continues next week these calls will do nicely. \n\nI have 40 $112s @ .8 &amp; looking to add more Monday if it doesn't open up - not a huge trade right now but looking to double or triple up if I get the entry. If you can't control your tism &amp; want more unusual activity trades check out these (all calls).\n\nJD May15 $45, June19 $41, $45, $47, July $47\n\nTWTR May15 $30, May29 $33 &amp; $35\n\nLVS (similar momentum trade as DIS) May15 $53, June $50 $55 $60\n\nCCL May22 $15 &amp; $17\n\nDDOG May15 $60\n\nATVI May15 $74\n\nSDC May15 $7 $8.50 $9, June19 $10 &amp; $13\n\nMU May15 $48.50 &amp; $50\n\nON May15 $17\n\nWORK May15 $32\n\nTLRY May15 $8\n\nSNAP May15 $18.50\n\nTldr: A couple million dollars has gone into OTM DIS calls expiry Friday &amp; I am following the big money. Long DIS May15 $110, $112.\n\nE: Formatting",
        "subreddit": "wallstreetbets",
        "title": "The Mickey Trade",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gh68bo/the_mickey_trade/",
        "created": 1589162658.0
    }
]