[
    {
        "author": "dlkdev",
        "created_utc": 1590583928,
        "id": "grj5fa",
        "num_comments": 367,
        "num_crossposts": 0,
        "selftext": "Alright CYKAS, Drill Sgt. Retarded TQQQ Burry is in the house. Listen up, I'm gonna train yo monkey asses to make some motherfucking money.\n\n&amp;#x200B;\n\n&gt;“Reeee can’t read, strike?” - /u/random_wsb_autist\n\nBitch you better read if you want your Robinhood to look like this:  \n \n\n![img](l2fpr4qd85151 \"gainz, bitch\")\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nWhy am I telling you this?\n\nBecause I like your dumb asses. Even dickbutts like /u/cscqb4. And because I like seeing Wall St. fucking get rekt. Y’all did good until now, and Wall St. is salty af. Just google for “retail traders” news if you haven’t seen it, and you’ll see the salty tears of Wall Street assholes. And I like salty Wall St. assholes crying like bitches.\n\n[https://www.zerohedge.com/markets/retail-investors-are-crushing-hedge-funds-again](https://www.zerohedge.com/markets/retail-investors-are-crushing-hedge-funds-again)\n\n&amp;#x200B;\n\nThat said, some of you here are really motherfucking dense &amp; the sheer influx of retardation has been driving away some of the more knowledgeable folks on this sub. In fact, in my last post, y'all somehow managed to downvote to shit the few guys that really understood the points I was making and tried to explain it to you poo-slinging apes. Stop that shit yo! A lot of you need to sit the fuck down, shut your fucking mouth and listen.  \n\nSo I'm going to try and turn you rag-tag band of dimwits into a respectable army of peasants that can clap some motherfucking Wall Street cheeks. Then, I'm going to give you a mouthbreather-proof trade that I don't think even you knuckleheads can mess up (though I may be underestimating you). \n\nIf you keep PM-ing me about your stupid ass losses after this, I will find out where you live and personally, **PERSONALLY**, shit on your doorstep.\n\nThis is going to be a long ass post. Read the damned post. I don't care if you're dyslexic, use text-to-speech. Got ADHD? Pop your addys, rub one out, and focus! Are you 12? Make sure to go post in the paper trading contest thread first.\n\n&amp;#x200B;\n\n**THE RULES:**\n\n1. Understand that most of this sub has the critical reading skills of a 6 year old and the attention span of a goldfish. As such, my posts are usually written with a level of detail aimed at the lowest common denominator. A lot of details on the thesis are omitted, but that doesn't mean that the contents in the post are all there is to it. If I didn't do that, every post'd have to be longer than this one, and 98% of you fucks wouldn't read it anyway. Fuck that.\n\n2. Understand that my style of making plays is finding the &gt;10+ baggers that are underpriced. As such, **ALL THE GOD DAMN PLAYS I POST ARE HIGH-RISK / HIGH-REWARD**. Only play what you can afford to risk. And stop PM-ing me the second the market goes the other way, god damn it! If you can't manage your own positions, I'm going to teach your ass the basics.\n\n3. Do you have no idea what you're doing and have a question? Google it first. Then google it again. Then Bing it, for good measure. Might as well check PornHub too, you never know. THEN, if you still didn't find the answer, you ask.\n\n4. This sub gives me Tourette's. If you got a problem with that, well fuck you. \n\n&amp;#x200B;\n\nThis shit is targeted at the mouthbreathers, but maybe more knowledgeable folk’ll find some useful info, idk.  How do you know if you’re in the mouthbreather category? If your answer to any of the following questions is yes, then you are:\n\n* Are you new to trading?\n* Are you unable to manage your own positions?\n* Did you score into the negatives on the SAT Critical Reading section?  \t\n* Do you think Delta is just an airline?\n* Do you buy high &amp; sell low?\n* Do you want to buy garbage like Hertz or American Airlines because it's cheap?\n* Did you buy USO at the bottom and are now proud of yourself for making $2?\n* Do you think stOnKs oNLy Go uP because Fed brrr? \n* Do you think I'm trying to sell you puts? \t\n* If you take a trade you see posted on this sub and are down, do you PM the guy posting it?\n* Do you generally PM people on this sub to ask them basic questions?  \n* Is your mouth your primary breathing apparatus?\t  \n \n\nWell I have just the thing for you!\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Table of Contents:**\n\nI. Maybe, just maybe, I know what I’m talking about\n\nII. Post-mortem of the February - March 2020 Great Depression\n\nIII. Mouthbreather's bootcamp on managing a position – THE TECHNICALS\n\nIV. Busting your retarded myths\n\nV. LIQUIDITY NUKE INBOUND\n\nVI. The mouthbreather-proof trade - The Akimbo\n\nVII. Quick hints for non-mouthbreathers\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Chapter I - Maybe, just maybe, I know what I’m talking about**\n\nI'm not here to rip you off. Every fucking time I post something, a bunch of dumbasses show up saying I'm selling you puts or whatever the fuck retarded thoughts come through their caveman brains.\n\n&gt;\"hurr durr OP retarded, OP sell puts\" - /u/random_wsb_autist\n\nSit down, Barney, I'm not here to scam you for your 3 cents on OTM puts. Do I always get it right? Of course not, dumbasses. Eurodollar play didn't work out (yet). Last TQQQ didn't work out (yet). That’s just how it goes. Papa Buffet got fucked on airlines. Plain retard Burry bought GME. What do you fucking expect?\n\nMeanwhile, I keep giving y'all good motherfucking plays:\n\n  \n\n1. 28/10/2019: \"I'ma say this again, in case you haven't heard me the first time. BUY $JNK PUTS NOW!\". Strike: \"11/15, 1/17 and 6/19\". \"This thing can easily go below 50, so whatever floats your boat. Around $100 strike is a good entry point.\"\n2. 3/9/2020:  \"I mean it's a pretty obvious move, but $JNK puts.\"\n3. 3/19/2020, 12pm: \"UVXY put FDs are free money.\" &amp; “Buy $UVXY puts expiring tomorrow if we're still green at 3pm. Trust me.”\n4. 3/24/2020: “$UUP 3/27 puts at $27.5 or $27 should be 10-baggers \tonce the bill passes. I'd expect it to go to around $26.”  \n \n\nAnd of course, the masterpiece that was the TQQQ put play.    \n \n\n \n\n**Chapter II. Post-mortem of the February - March 2020 Great Depression**\n\nDo you really understand what happened? Let's go through it.\n\nI got in puts on 2/19, right at the motherfucking top, TQQQ at $118. I told you on 2/24 TQQQ ($108) was going to shit, and to buy fucking puts, $90ps, $70ps, $50ps, all the way to 3/20 $30ps. You think I just pulled that out of my ass? You think I just keep getting lucky, punks? Do you have any idea how unlikely that is?\n\n \n\nWell, let's take a look at what the fuckstick Kevin Cook from Zacks wrote on 3/5:  \n\n[How Many Sigmas Was the Flash Correction Plunge?](https://finance.yahoo.com/news/many-sigmas-flash-correction-plunge-222010752.html) \n\n&gt;\"Did you know that last week's 14% plunge in the S&amp;P 500 SPY was so rare, by statistical  measures, that it shouldn't happen once but every 14,000 years?\"  \n&gt;  \n&gt;\"By several measures, it was about a 5-sigma move, something that's not \"supposed to\" happen more than once in your lifetime -- or your prehistoric ancestors' lifetimes!  \n&gt;  \n&gt;\"According to general statistical principles, a 4-sigma event is to be expected about every 31,560 days, or about 1 trading day in 126 years. And a 5-sigma event is to be expected every 3,483,046 days, or about 1 day every 13,932 years.\"\n\n&amp;#x200B;\n\nOn 3/5, TQQQ closed at $81. I just got lucky, right? You should buy after a 5-sigma move, right? That's what fuckstick says:\n\n&gt;\"Big sigma moves happen all the time in markets, more than any other field where we collect and analyze historical data, because markets are social beasts subject to \"wild randomness\" that is not found in the physical sciences.  \n&gt;  \n&gt;This was the primary lesson of Nassim Taleb's 2007 book The Black Swan, written before the financial crisis that found Wall Street bankers completely ignorant of randomness and the risks of ruin.\"  \n&gt;  \n&gt;I also took advantage of the extreme 5-sigma sell-off by grabbing a leveraged ETF on the Nasdaq 100, the ProShares UltraPro QQQ TQQQ. In my plan, while I might debate the merits of buying AAPL or MSFT for hours, I knew I could immediately buy them both with TQQQ and be rewarded very quickly after the 14% plunge.\"\n\nAhahaha, fuckstick bought TQQQ at $70, cuz that's what you do after a random 5-sigma move, right? How many of you dumbasses did the same thing? Don't lie, I see you buying 3/5 on this TQQQ chart: \n\n![img](9ks35zdla5151)\n\nMeanwhile, on 3/3, I answered the question \"Where do you see this ending up at in the next couple weeks? I have 3/20s\" with \"under 30 imo\".\n\n&amp;#x200B;\n\nWell good fucking job, because a week later on 3/11, TQQQ closed at $61, and it kept going.\n\n[Nomura: Market staring into the abyss](https://www.macrobusiness.com.au/2020/03/nomura-market-staring-into-the-abyss/) \n\n&gt;\"The plunge in US equities yesterday (12 March) pushed weekly returns down to 7.7 standard deviations below the norm. In statistical science, the odds of a greater-than seven-sigma event of this kind are astronomical to the point of being comical (about one such event every 160 billion years).\n\nLet's see what Stephen Mathai-Davis, CFA, CQF, WTF, BBQ, Founder and CEO of Q.ai - Investing Reimagined, a Forbes Company, and a major fucktard [has to say at this point](https://www.forbes.com/sites/stephenmathaidavis/2020/03/11/time-to-buy-stocks-selling-otm-put-spreads-looks-better/):\n\n&amp;#x200B;\n\n&gt;\"Our AI models are telling us to buy SPY (the SPDR S&amp;P500 ETF and a great proxy for US large-cap stocks) but since all models are based on past data, does it really make sense? \"  \n&gt;  \n&gt;\"While it may or may not make sense to buy stocks, it definitely is a good time to sell “volatility.” And yes, you can do it in your brokerage account! Or, you can ask your personal finance advisor about it.\"  \n&gt;  \n&gt;\"So what is the takeaway? I don’t know if now is the right time to start buying stocks again but it sure looks like the probabilities are in your favor to say that we are not going to experience another 7 standard deviation move in U.S. Stocks. OTM (out-of-the-money) Put Spreads are a great way to get some bullish exposure to a rally in the SPY while also shorting such rich volatility levels.\"\n\nGood job, fuckfaces. Y'all bought this one too, admit it. I see you buying on this chart:  \n \n\n![img](s9344geza5151)\n\nWell guess what, by 3/18, a week later, we did get another 5 standard deviation move. TQQQ bottomed on 3/18 at $32.73. Still think that was just luck, punk? You know how many sigmas that was? Over 12 god-damn sigmas. 12 standard deviations. I'd have a much better chance of guessing everyone's buttcoin private key, in a row, on the first try. That's how unlikely that is.\n\n![img](luz0s3kbb5151)\n\n \n\n&gt;\"Hurr durr you said it's going to 0, so you're retarded because it didn't go to 0\" - /u/random_wsb_autist\n\nYeah, fuckface, because the Fed bailed ‘em out. Remember the $150b “overnight repo” bazooka on 3/17? That’s what that was, a bailout. A bailout for shitty funds and market makers like Trump's handjob buddy Kenny Griffin from Citadel. Why do you think Jamie Dimon had a heart attack in early March? He saw all the dogshit that everyone put on his books.\n\n&amp;#x200B;\n\n![img](8fqvt37ama151)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nRead:\n\n[https://dealbreaker.com/2020/01/griffin-no-show-at-white-house](https://dealbreaker.com/2020/01/griffin-no-show-at-white-house)\n\n[https://www.cnbc.com/2020/03/11/bank-ceos-convene-in-washington-with-president-trump-on-coronavirus.html](https://www.cnbc.com/2020/03/11/bank-ceos-convene-in-washington-with-president-trump-on-coronavirus.html)\n\n[https://www.proactiveinvestors.co.uk/companies/news/914736/market-makers--didn-t-show-up-for-work--macro-risk-ceo-says-914736.html](https://www.proactiveinvestors.co.uk/companies/news/914736/market-makers--didn-t-show-up-for-work--macro-risk-ceo-says-914736.html)\n\n[https://www.chicagobusiness.com/finance-banking/chicago-trading-firms-seek-more-capital](https://www.chicagobusiness.com/finance-banking/chicago-trading-firms-seek-more-capital)\n\n[https://www.housingwire.com/articles/did-non-qm-just-disappear-from-the-market/](https://www.housingwire.com/articles/did-non-qm-just-disappear-from-the-market/)\n\n[https://www.bloomberg.com/news/articles/2020-03-22/bruised-hedge-funds-ask-clients-for-fresh-cash-to-buy-the-dip](https://www.bloomberg.com/news/articles/2020-03-22/bruised-hedge-funds-ask-clients-for-fresh-cash-to-buy-the-dip)\n\n[https://fin24.com/Markets/Bonds/rand-bonds-rally-after-reserve-bank-intervention-20200320](https://fin24.com/Markets/Bonds/rand-bonds-rally-after-reserve-bank-intervention-20200320)\n\n&amp;#x200B;\n\nYup, everyone got clapped on their stupidly leveraged derivatives books. It seems Citadel is “too big to fail”.  On 3/18, the payout on 3/20 TQQQ puts alone if it went to 0 was $468m. And every single TQQQ put expiration would have had to be paid. Tens or hundreds of billions on TQQQ puts alone. I’d bet my ass Citadel was on the hook for a big chunk of those. **And that’s just a drop in the bucket compared to all the other blown derivative trades out there.**\n\n&amp;#x200B;\n\n![img](9ww27p2qb5151)\n\nY’all still did good, 3/20 closed at $35. That’s $161m/$468m payoff just there. I even called you the bottom on 3/17, when I saw that bailout:\n\n&amp;#x200B;\n\n&gt;\"tinygiraffe21 1 point 2 months ago    \n&gt;  \n&gt;Haha when? I’m loading up in 4/17 25 puts\"  \n&gt;  \n&gt;\"dlkdev    \n&gt;  \n&gt;Scratch that, helicopter money is here.\"  \n&gt;  \n&gt;\"AfgCric 1 point 2 months ago    \n&gt;  \n&gt;What does that mean?\"  \n&gt;  \n&gt;\"It means the Fed &amp; Trump are printing trillions with no end in sight. If they go through with this, this was probably the bottom.\"\n\n&amp;#x200B;\n\n&gt;\"hurr durr, it went lower on 3/18 so 3/17 wasn't the bottom\" - /u/random_wsb_autist\n\nIdiot, I have no way of knowing that Billy boy Ackman was going to go on CNBC and cry like a little bitch to make everyone dump, so he can get out of his shorts. Just like I have no way of knowing when the Fed decides to do a bailout. But you react to that, when you see it.\n\nDo you think \"Oh no world's ending\" and go sell everything? No, dumbass, you try to figure out what Billy's doing. And in this case it was pretty obvious, Billy saw the Fed train coming and wanted to close his shorts. So you give the dude a hand, quick short in and out, and position for Billy dumping his short bags.  \n\n[Video of Billy &amp; the Fed train](https://giphy.com/gifs/cheezburger-fail-train-near-miss-l2Sq3kNYfshvzwoBq)\n\n&amp;#x200B;\n\nHere's what Billy boy says:\n\n&gt;“But if they don’t, and the government takes the right steps, this hedge could be worth zero, and the stock market could go right back up to where it was. So we made the decision to exit.”\n\n[https://www.businessinsider.sg/bill-ackman-explains-coronavirus-trade-single-best-all-time-podcast-2020-5](https://www.businessinsider.sg/bill-ackman-explains-coronavirus-trade-single-best-all-time-podcast-2020-5)\n\nAlso, “the single best trade of all time.” my ass, it was only a 100-bagger. I gave y’all a 150-bagger.  \n\nSo how could I catch that? Because it wasn't random, yo. And I'm here to teach your asses how to try to spot such potential moves. But first, the technical bootcamp.  \n\n&amp;#x200B;\n\n**Chapter III. Mouthbreather's bootcamp on managing a position – THE TECHNICALS**\n\n&amp;#x200B;\n\n**RULE 1. YOU NEVER BUY OPTIONS AT OPEN.** You NEVER OVERPAY for an option. You never FOMO into buying too fast. You NEVER EVER NEVER pump the premium on a play.\n\nI saw you fuckers buying over 4k TQQQ 5/22 $45 puts in the first minutes of trading. You pumped the premium to over $0.50 dudes. The play's never going to work if you do that, because you give the market maker free delta, and he's going to hedge that against you. Let me explain simply:\n\n&amp;#x200B;\n\nLet's say a put on ticker $X at strike $50 is worth $1, and a put at strike $51 is worth $2. \n\nIf you all fomo in at once into the same strike, the market maker algos will just pull the asks higher. If you overpay at $2 for the $50p, the market maker will just buy $51ps for $2 and sell you $50ps for 2$. Or he'll buy longer-dated $50ps and sell you shorter-dated $50ps. Max risk for him is now 0, max gain is $1. You just gave him free downside insurance, so of course he's going to start going long. And you just traded against yourself, congrats.\n\n&amp;#x200B;\n\nYou need to get in with patience, especially if you see other autists here wanting to go in at the same time. Don't step on each other's toes. You put in an order, and you wait for it to fill for a couple of seconds. If it doesn't fill, AND the price of the option hasn't moved much recently, you can bump the bid $0.01. And you keep doing that a few times. Move your strikes, if needed. Only get a partial fill or don't get a fill at all? You cancel your bid. Don't fucking leave it hanging there, or you're going to put a floor on the price. Let the mm algos chill out and go again later. \n\n&amp;#x200B;\n\n**RULE 2. WATCH THE TIME**. Algos are especially active at x:00, x:02, x:08, x:12, x:30 and x:58. Try not to buy at those times.\n\n**RULE 3. YOU USE MULTIPLE BROKERS.** Don't just roll with Robinhood, you're just gimping yourself. If you don't have another one, open up a tasty, IB, TD, Schwab, whatever. But for cheap faggy puts (or calls), Robinhood is the best. If you want to make a play for which the other side would think \"That's free money!\", Robinhood is the best. Because Citadel will snag that free money shit like no other. Seriously, if you don't have a RH account, open one. It's great for making meme plays.\n\n&amp;#x200B;\n\n**RULE 4. YOU DON'T START A TRADE WITH BIG POSITIONS.** Doesn't matter how big or small your bankroll is. If you go all-in, you're just gambling, and the odds are stacked against you. You need to have extra cash to manage your positions. Which leads to\n\n**RULE 5. MANAGING YOUR WINNERS**: Your position going for you? Good job! Now **POUND THAT SHIT!** And again. Move your strikes to cheaper puts/calls, and pound again. And again. Snowball those gains. \n\n \n\n**RULE 6A. POUND THOSE $0.01 PUTS:**  \n\nSo you bought some puts and they’re going down? Well, the moment they reach $0.01, **YOU POUND THOSE PUTS** (assuming there’s enough time left on them, not shit expiring in 2h). $0.01 puts have amazing risk/return around the time they reach $0.01. This is not as valid for calls. Long explanation why, but the gist of it is this: you know how calls have unlimited upside while puts have limited upside? Well it’s the reverse of that.\n\n**RULE 6B. MANAGING YOUR LOSERS:** \n\nYour position going against you? Do you close the position, take your loss porn and post it on wsb? **WRONG DUMBASS**. You manage that by **POUNDING THAT SHIT**. Again and again. You don't manage losing positions by closing. That removes your gainz when the market turns around. You ever close a position, just to have it turn out it would have been a winner afterwards? Yeah, don't do that. You manage it by opening other positions. Got puts? Buy calls. Got calls? Buy puts. Turn positions into spreads. Buy spreads. Buy the VIX. Sell the VIX. They wanna pin for OPEX? Sell them options. Not enough bankroll to sell naked? Sell spreads. Make them fight you for your money, motherfuckers, don't just give it away for free. When you trade, YOU have the advantage of choosing when and where to engage. The market can only react. That's your edge, so USE IT! Like this:\n\n&amp;#x200B;\n\nExample 1: \n\nInitial TQQQ 5/22 position = $5,000. Starts losing? You pound it. \n\n&amp;#x200B;\n\n![img](gq938ty8e5151)\n\nTotal pounded in 5/22 TQQQ puts = $10,824. Unfortunately expired worthless (but also goes to show I'm not selling you puts, dickwads)\n\nThen the autists show up:\n\n&gt;\"Hahaha you lost all your money nice job you fucking idiot why do you even live?\" - /u/cscqb4\n\nWrong fuckface. You see the max pain at SPX 2975 &amp; OPEX pin coming? Sell them some calls or puts (or spreads). \n\n&amp;#x200B;\n\n![img](7nv23fr41a151)\n\nSold 9x5/20 SPX calls@2975, bam +$6,390. Still wanna pin? Well have some 80x5/22 TQQQ $80cs, bam anotha +$14,700.\n\n&amp;#x200B;\n\n![img](1iqtpmc71a151)\n\n\\+$21,090 - $10,824 = +$10,266 =&gt; Turned that shit into a +94.85% gain. \n\n&amp;#x200B;\n\n&gt;[./u/cscqb4 rn](https://giphy.com/gifs/smile-angry-kanye-west-ZI88V08ZzgMWA) \n\n&amp;#x200B;\n\nYou have a downside position, but market going up or nowhere? You play that as well. At least make some money back, if not profit. \n\n&amp;#x200B;\n\nExample 2:\n\n&amp;#x200B;\n\n5/22, long weekend coming right? So you use your brain &amp; try to predict what could happen over the 3-day weekend. Hmm, 3 day weekend, well you should expect either a shitty theta-burn or maybe the pajama traders will try to pooomp that shite on the low volume. Well make your play. I bet on the shitty theta burn, but could be the other, idk, so make a small play. \n\n&amp;#x200B;\n\nSold some ES\\_F spreads (for those unaware, ES is a 50x multiplier, so 1 SPX = 2 ES = 10 SPY, approximately). -47x 2955/2960 bear call spreads for $2.5. Max gain is $2.5, max loss is 2960-2955 = $5. A double-or-nothing basically. That's $5,875 in premium, max loss = 2x premium = $11,750. \n\nWell, today comes around and futures are pumping. Up to 3,014 now. Do you just roll over? You think I'm gonna sit and take it up the ass? Nah bros that's not how you trade, you fucking fight them. How?\n\nI have:\n\n47x 2960 calls\n\n\\-47x 2955 calls\n\n&amp;#x200B;\n\nPajama traders getting all up in my grill? Well then I buy back 1 of the 2955 calls. Did that shit yesterday when futures were a little over 2980, around 2982-ish. Paid $34.75, initially shorted at $16.95, so booked a -$892 loss, for now. But now what do I have?\n\n&amp;#x200B;\n\n46x 2955/2960 bear calls\n\n1x 2960 long call\n\n&amp;#x200B;\n\nSo the fuckers can pump it. In fact, the harder they pump it, the more I make. Each $2.5 move up in the futures covers the max loss for 1 spread. With SPX now at \\~3015, that call is $55 ITM. Covers 24/46 contracts rn. If they wanna run it up, at 3070 it's break-even. Over that, it's profit. I'll sell them some bear call spreads over 3050 if they run it there too. They gonna dump it? well under 2960 it's profit time again. They wanna do a shitty pin at 3000 today? Well then I'll sell them some theta there.\n\nLater edit: that was written yesterday. Got out with a loss of only $1.5k out of the max $5,875. Not bad.\n\nAnd that, my dudes, is how you manage a position.\n\n&amp;#x200B;\n\n**RULE 7 (ESPECIALLY FOR BEARS). YOU DON'T KEEP EXTRA CASH IN YOUR BROKER ACCOUNT.** You don't do it with Robinhood, because it's a shitty dumpsterfire of a broker. But you don't do it with other brokers either. Pull that shit out. Preferably to a bank that doesn't play in the markets either, use a credit union or some shit. Why? Because you're giving the market free liquidity. Free margin loans. Squeeze that shit out, make them work for it. Your individual cash probably doesn't make a dent, but a million autists with an extra $1200 trumpbucks means $1.2b. That's starting to move the needle. You wanna make a play, use instant deposits. And that way you don't lose your shit when your crappy ass broker or bank gets its ass blown up on derivative trades. Even if it's FDIC or SIPC insured, it's gonna take time until you see that money again.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Chapter IV. BUSTING YOUR RETARDED MYTHS**\n\n&amp;#x200B;\n\n**MYTH 1 - STONKS ONLY GO UP**\n\n&amp;#x200B;\n\nDo you think the market can go up forever? Do you think stOnKs oNLy Go uP because Fed brrr? Do you think SPX will be at 5000 by the end of the month? Do you think $1.5 trillion is a good entry point for stonks like AAPL or MSFT? Do you want to buy garbage like Hertz or American Airlines because it's cheap? Did you buy USO at the bottom and are now proud of yourself for making $2? Well, this section is for you!\n\nLet's clear up the misconception that stonks only go up while Fed brrrs.\n\n&amp;#x200B;\n\nWhat's your target for the SPX top? Think 3500 by the end of the year? 3500 by September? 4000? 4500? 5000? Doesn't matter, you can plug in your own variables. \n\n&amp;#x200B;\n\nLet's say SPX only goes up, a moderate 0.5% each period as a compounded avg. (i.e. up a bit down a bit whatever, doesn't matter as long as at the end of your period, if you look back and do the math, you'll get that number). Let's call this variable BRRR = 0.005.\n\n&amp;#x200B;\n\nCan you do the basic math to calculate the value at the end of x periods? Or did you drop out in 5th grade? Doesn't matter if not, I'll teach you. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\nLet's say our period is one week. That is, SPX goes up on average 0.5% each week on Fed BRRR:\n\n2950 \\* (1.005\\^x), where x is the number of periods (weeks in this case)\n\n&amp;#x200B;\n\nSo, after 1 month, you have: 2950 \\* (1.005\\^4) = 3009\n\nAfter 2 months: 2950 \\* (1.005\\^8) = 3070\n\nEnd of the year? 2950 \\* (1.005\\^28) = 3392\n\n&amp;#x200B;\n\nNow clearly, we're already at 3015 on the futures, so we're moving way faster than that. More like at a speed of BRRR = 1%/wk\n\n&amp;#x200B;\n\n2950 \\* (1.01\\^4) = 3069\n\n2950 \\* (1.01\\^8) = 3194\n\n2950 \\* (1.01\\^28) = 3897\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nBetter, but still slower than a lot of permabulls would expect. In fact, some legit fucks are seriously predicting SPX 4000-4500 by September. Like this dude, David Hunter, \"Contrarian Macro Strategist w/40+ years on Wall Street\". IDIOTIC.\n\n[https://twitter.com/DaveHcontrarian/status/1263066368414568448](https://twitter.com/DaveHcontrarian/status/1263066368414568448)\n\n&amp;#x200B;\n\nThat'd be 2950 \\* (BRRR\\^12) = 4000 =&gt; BRRR = 1.0257 and 2950 \\* (BRRR\\^12) = 4500 =&gt; BRRR = 1.0358, respectively. \n\n&amp;#x200B;\n\nHere's why that can't happen, no matter the amount of FED BRRR: **Leverage. Compounded Leverage.**\n\n&amp;#x200B;\n\nThere's currently over $100b in leveraged etfs with a 2.5x avg. leverage. And that's just the ones I managed to tally, there's a lot of dogshit small ones on top of that. TQQQ alone is now at almost $6b in AUM (topped in Fed at a little over $7b).\n\n&amp;#x200B;\n\nNow, let's try to estimate what happens to TQQQ's AUM when BRRR = 1.0257. 3XBRRR = 1.0771. Take it at 3XBRRR = 1.07 to account for slippage in a medium-volatility environment and ignore the fact that the Nasdaq-100 would go up more than SPX anyway.\n\n&amp;#x200B;\n\n$6,000,000,000 \\* (1.07\\^4) = $7,864,776,060\n\n$6,000,000,000 \\* (1.07\\^8) = $10,309,100,000\n\n$6,000,000,000 \\* (1.07\\^12) = $13,513,100,000\n\n$6,000,000,000 \\* (1.07\\^28) = $39,893,000,000. \n\n&amp;#x200B;\n\nWhat if BRRR = 1.0358? =&gt; 3XBRR = 1.1074. Take 3XBRRR = 1.10.\n\n$6,000,000,000 \\* (1.1\\^4) = $8,784,600,000\n\n$6,000,000,000 \\* (1.1\\^8) = $12,861,500,000\n\n$6,000,000,000 \\* (1.1\\^12) = $18,830,600,000\n\n$6,000,000,000 \\* (1.1\\^28) = $86,526,000,000\n\n&amp;#x200B;\n\nAnd this would have to get 3x leveraged every day. And this is just for TQQQ.\n\n&amp;#x200B;\n\nLet's do an estimation for all leveraged funds. $100b AUM, 2.5 avg. leverage factor, BRRR = 1.0257 =&gt; 2.5BRRR = 1.06425\n\n&amp;#x200B;\n\n$100b \\* (1.06\\^4) = $128.285b\n\n$100b \\* (1.06\\^8) = $159.385b\n\n$100b \\* (1.06\\^12) = $201.22b\n\n$100b \\* (1.06\\^28) = $511.169b\n\n&amp;#x200B;\n\nThat'd be $1.25 trillion sloshing around each day. And the market would have to lose each respective amount of cash into these leveraged funds. Think the market can do that? You can play around with your own variables. But understand that this is just a small part of the whole picture, many other factors go into this. It's a way to put a simple upper limit on an assumption, to check if it's reasonable.\n\n&amp;#x200B;\n\nIn the long run, it doesn't matter if the Fed goes BRRR, if TQQQ takes in it's share of 3XBRRR. And the Fed can't go 3XBRRR, because then TQQQ would take in 9XBRRR. And on top of this, you have a whole pile of leveraged derivatives on top of these leveraged things. Watch (or rewatch) this: [Selena Gomez &amp; Richard H. Thaler Explaining Synthetic CDO through BLACKJACK](https://www.youtube.com/watch?v=AUM59Eh6vTw) \n\n&amp;#x200B;\n\nMy general point, at the mouth-breather level, is that Fed BRRR cannot be infinite, because leverage.\n\nAnd these leveraged ETFs are flawed instruments in the first place. It didn't matter when they started out. TQQQ and SQQQ started out at $8m each. For the banks providing the swaps, for the market providing the futures contracts, whatever counter-party to whatever instrument they would use, that was fine. Because it balanced out. When TQQQ made a million, SQQQ lost a million (minus a small spread, which was the bank's profit). Bank was happy, in the long run things would even out. Slippage and spreads and fees would make them money. But then something happened. Stonks only went up. And leveraged ETFs got bigger and more and more popular. \n\nAnd so, TQQQ ended up being $6-7b, while SQQQ was at $1b. And the same goes for all the other ETFs. Long leveraged ETF AUM became disproportionate to short AUM. And it matters a whole fucking lot. Because if you think of the casino, TQQQ walks up every day and says \"I'd like to put $18b on red\", while SQQQ walks up and says \"I'd only like to put $3b on black\". And that, in turn, forces the banks providing the swaps to either eat shit with massive losses, or go out and hedge. Probably a mix of both. But it doesn't matter if the banks are hedged, someone else is on the other side of those hedges anyway. Someone's eating a loss. Can think of it as \"The Market\", in general, eating the loss. And there's only so much loss the market can eat before it craps itself.\n\n&amp;#x200B;\n\nIf you were a time traveller, how much money do you think you could make by trading derivatives? Do you think you could make $20 trillion? You know the future prices after all... But no, you couldn't. There isn't enough money out there to pay you. So you'd move the markets by blowing them up. Call it the Time-travelling WSB Autist Paradox. \n\n&amp;#x200B;\n\nIf you had a bucket with a hole in the bottom, even if you poured an infinite amount of water into it, it would never be full. Because there's a **LIQUIDITY SINK**, just like there is one in the markets.\n\nAnd that, my mouth-breathing friends, is the reason why FED BRRR cannot be infinite. Or alternatively, \"**STONKS MUST GO BOTH UP AND DOWN**\".\n\n&amp;#x200B;\n\n**MYTH 2 - YOU CAN'T TIME THE MARKET**\n\n&amp;#x200B;\n\nOn Jan 14, 2020, I predicted this: Assuming that corona doesn't become a problem, \"AAPL: Jan 28 $328.3, Jan 31 $316.5, April 1 $365.7, May 1 $386, July 1 $429 December 31 $200.\"\n\nNow take a look at the AAPL chart in January. After earnings AAPL peaked at $327.85. On 1/31, after the 1st hour of trading, when the big boys make moves, it was at $315.63. Closed 1/31 at $309.51. Ya think I pulled this one out of my ass too? \n\nYes you can time it. Flows, motherfucker, flows. Money flow moves everything. And these days, we have a whole lot of **RETARDED FLOW**. Can't even call it dumb flow, because it literally doesn't think. Stuff like:\n\n&amp;#x200B;\n\n* ETF flows. If MSFT goes up and AAPL goes down, part of that flow is going to move from AAPL to MSFT. Even if MSFT flash-crashes up to $1000, the ETF will still \"buy\". Because it's passive. \n* Option settlement flows. Once options expire, money is going to flow from one side to another, and that my friends is accurately predictable from the data.\n* Index rebalancing flows\n* Buyback flows\n* 401k passive flows\n* Carry trade flows\n* Tax day flows\n* Flows of people front-running the flows\n\n&amp;#x200B;\n\nAnd many many others. Spot the flow, and you get an edge. How could I predict where AAPL would be after earnings within 50 cents and then reverse down to $316 2 days later? **FLOWS MOTHERFUCKER FLOWS**. The market was so quiet in that period, that is was possible to precisely figure out where it ended up. Why the dump after? Well, AAPL earnings (The 8-K) come out on a Wednesday. The next morning, after market opens the 10-Q comes out. And that 10-Q contains a very important nugget of information: the latest number of outstanding shares.  But AAPL buybacks are regular as fuck. You can predict the outstanding shares before the market gets the 10-Q. And that gives you EDGE. Which leads to\n\n&amp;#x200B;\n\n**MYTH 3 - BUYBACKS DON'T MATTER** \n\n&amp;#x200B;\n\nAre you one of those mouthbreathers that parrots the phrase \"buybacks are just a tax-efficient way to return capital to shareholders\"? Well sit the fuck down, I have news for you. First bit of news, you're dumb as shit. Second bit:\n\n&amp;#x200B;\n\nOn 1/28, AAPL's market cap is closing\\_price x free\\_float\\_outstanding\\_shares. But that's not the REAL MARKET CAP. Because the number of outstanding shares is OLD AS FUCK. When the latest number comes out, the market cap changes instantly. And ETFs start moving, and hedges start being changed, and so on. \n\n&amp;#x200B;\n\n&gt;\"But ETFs won't change the number of shares they hold, they will still hold the same % of AAPL in the index\" - /u/random_wsb_autist\n\n&amp;#x200B;\n\nOh my fucking god you're dumb as fuck. FLOWS change. And the next day, when TQQQ comes by and puts its massive $18b dong on the table, the market will hedge that differently. And THAT CAN BE PREDICTED. That's why AAPL was exactly at $316 1 hour after the market opened on 1/31. \n\n&amp;#x200B;\n\nSo, what can you use to spot moves? Let me show you:\n\n \n\nMarket topped on 2/19. Here’s SPY. I even marked interesting dates for you with vertical lines.\n\n&amp;#x200B;\n\n![img](7agm171eh5151)\n\nNobody could have seen it coming, right? WRONG AGAIN. Here:\n\n&amp;#x200B;\n\n![img](i1kdp3cgh5151)\n\nIn fact, JPYUSD gave you two whole days to see it. Those are NOT normal JPYUSD moves. But hey maybe it’s just a fluke?  Wrong again.  \n\n&amp;#x200B;\n\n![img](fsyhenckh5151)\n\nForex showed you that all over the place. Why? FLOWS MOTHERFUCKER FLOWS. When everything moves like that, it means the market needs CASH. It doesn’t matter why, but remember people pulling cash out of ATMs all over the world?  Companies drawing massive revolvers? Just understand what this flow means.  \n\nThe reversal: \n\n![img](4xe97l0oh5151)\n\n![img](v6i0pdmoh5151)\n\nBut it wasn’t just forex. Gold showed it to you as well. Bonds showed it to you as well.\n\n![img](40j53u8th5151)\n\nEven god damn buttcoin showed it to you.\n\n![img](43lvafhvh5151)\n\nAnd they all did it for 2 days before the move hit equities.  \n\n&amp;#x200B;\n\n **Chapter V. LIQUIDITY NUKE INBOUND**\n\n \n\nYou see all these bankruptcies that happened so far, and all the ones that are going to follow? Do you think that’s just dogshit companies and it won’t have major effects on anything outside them? WRONG.\n\nBecause there’s a lot of leveraged instruments on top of those equities. When the stock goes to 0, all  those outstanding puts across all expirations get instantly paid.   \n\nUnderstand that Feb-March was a liquidity MOAB. But this will end with a liquidity nuke.  \n\nHere’s just HTZ for example: $239,763,550 in outstanding puts. Just on a single dogshit small-cap company (this thing was like $400m mkt. cap last week).\n\nAnd that’s just the options on the equity. There’s also instruments on etfs that hold HTZ, on the bonds, on the ETFs that hold their bonds, swaps, warrants, whatever. It’s a massive pile of leverage.  \n\nThen there’s also the ripple effects. Were you holding a lot of HTZ in your brokerage margin  account? Well guess what big boi, when that gaps to 0 you get a margin call, and then you become a liquidity drain. Holding long calls? 0. Bonds 0. **DOG SHIT!**\n\nAnd the market instantly goes from holding $x in assets (HTZ equity / bonds / calls) to holding many multiples of x in LIABILITIES (puts gone wrong, margin loans, derivatives books, revolvers, all that crap). And it doesn’t matter if the Fed buys crap like HTZ bonds. You short them some. Because when it hits 0, it’s no longer about supply and demand. You get paid full price, straight from Jerome’s printer. Is the Fed going to buy every blown up derivative too? Because that's what they'd have to do.\n\nThink of liquidity as a car. The faster it goes, the harder it becomes to go even faster. At some point, you can only go faster by driving off a cliff. THE SQUEEZE. But you stop instantly when you hit the ground eventually. And that’s what shit’s doing all over the place right now.\n\nRewatch: [https://www.youtube.com/watch?v=3hG4X5iTK8M](https://www.youtube.com/watch?v=3hG4X5iTK8M)\n\nAnd just like that fucker, “I’m standing in front of a burning house, and I’m offering you fire insurance on it.”\n\n&amp;#x200B;\n\n**Don’t baghold!**\n\nNow is not the time to baghold junk. Take your cash. Not the time to buy cheap crap. You don’t buy Hertz. You don’t buy USO. You don’t buy airlines, or cruises, or GE, or motherfucking Disney. And if you have it, dump that shit.  \n\nAnd the other dogshit that’s at ATH, congrats you’re in the green. Now you take your profits and fucking dump that shit. I’m talking shit like garbage SaaS, app shit, AI shit, etc. Garbage like MDB, OKTA, SNAP, TWLO, ZM, CHGG etc.\n\nAnd you dump those garbage ass leveraged ETFs. SQQQ, TQQQ, whatever, they’re all dogshit now.  \n\nThe leverage MUST unwind. And once that’s done, some of you will no longer be among us if you don’t listen. A lot of leveraged ETFs will be gone. Even some non-leveraged ETFs will be gone. Some brokers will be gone, some market makers will be gone, hell maybe even some big bank has to go under. I can’t know which ones will go poof, but I can guarantee you that some will. Another reason to diversify your shit. There’s a reason papa Warrant Buffet dumped his bags, don’t think you’re smarter than him. He may be senile, but he’s still a snake.\n\nAnd once the unwind is done, THEN you buy whatever cheap dogshit’s still standing.  \n\nGot it? Good.\n\nYou feel ready to play yet?  Alright, so you catch a move. Or I post a move and you wanna play it. You put on a small position. When it’s going your way, **YOU POUND DAT SHIT.** Still going? Well **RUSH B CYKA BLYAT AND PLANT THE GOD DAMN 3/20 $30p BOMB.**\n\n&amp;#x200B;\n\n**Chapter VI - The mouthbreather-proof play - THE AKIMBO**\n\n \n\nStill a dumbass that can’t make a play? Still want to go long? Well then, I got a dumbass-proof trade for you. I present to you THE AKIMBO:\n\n&amp;#x200B;\n\nSTEP 1.  You play [this](https://www.youtube.com/watch?v=3hE2O2FjZ-g) full blast. You need some real Russian hardbass to get you in the right mood for trading, cyka.\n\nSTEP 2. Split your play money in 3. Remember to keep extra bankroll for POUNDING THAT SHIT.\n\nSTEP 3. Use 1/3 of your cash to buy SQQQ 9/18 $5p, pay $0.05. Not more than $0.10.\n\nSTEP 4. Use 1/3 of your cash to buy TQQQ 9/18 $20p, pay around $0.45. Alternatively, if you’re feeling adventurous, 7/17 $35p’s for around $0.5.\n\nSTEP 5. Use 1/3 of your cash to buy VIX PUT SPREADS 9/15 $21/$20 spread for around $0.15, no more than $0.25. That is, you BUY the 21p and SELL the 20p. Only using Robinhood and don’t have the VIX? What did I just tell you? Well fine, use UVXY then. Just make sure you don’t overpay.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Chapter VII - Quick hints for non-mouthbreathers**\n\nQuick tips, cuz apparently I'm out of space, there's a 40k character limit on reddit posts. Who knew? \n\n&amp;#x200B;\n\n1. Proshares is dogshit. If you don't understand the point in my last post, do this: download [https://accounts.profunds.com/etfdata/ByFund/SQQQ-historical\\_nav.csv](https://accounts.profunds.com/etfdata/ByFund/SQQQ-historical_nav.csv) and [https://accounts.profunds.com/etfdata/ByFund/SQQQ-psdlyhld.csv](https://accounts.profunds.com/etfdata/ByFund/SQQQ-psdlyhld.csv).  Easier to see than with TQQQ. AUM: 1,174,940,072. Add up the value of all the t-bills = 1,686,478,417.49  and \"Net other assets / cash\". It should equal the AUM, but you get 2,861,340,576.  Why? Because that line should read: NET CASH = -$511,538,344.85\n2. Major index rebalancing June 22.\n3. Watch the violent forex moves.\n4. 6/25 will be red. Don't ask, play a spread, bag a 2x-er.\n5. 6/19 will be red.\n6. Not settled yet, but a good chance 5/28 is red.\n7. Front run the rebalance. Front-run the front-runners of the rebalance too. TQQQ puts. \n8. Major retard flow in financials yesterday. Downward pressure now. GS 180 next weeks looks good.\n9. Buy leaps puts on dogshit bond ETFs (check holdings for dogshit)\n10. Buy TLT 1/15/2021 $85ps for cheap, sell over $1 when the Fed stops the ass rape, rinse and repeat\n11. TQQQ flow looks good:\n\n![img](untvykuxea151)\n\n&amp;#x200B;\n\nGood luck. Dr. Retard TQQQ Burry out.",
        "subreddit": "wallstreetbets",
        "title": "The Mouthbreather's Guide to the Galaxy",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/grj5fa/the_mouthbreathers_guide_to_the_galaxy/",
        "created": 1590612728.0
    },
    {
        "author": "lawrencea1997",
        "created_utc": 1590875000,
        "id": "gtmike",
        "num_comments": 209,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "GameStop 20k YOLO time to pray",
        "url": "https://i.redd.it/mu4faq0n2z151.jpg",
        "created": 1590903800.0
    },
    {
        "author": "ykcir23",
        "created_utc": 1590437385,
        "id": "gqiavz",
        "num_comments": 87,
        "num_crossposts": 0,
        "selftext": "Not exaggerating, went to 8 stores today to find a Xbox controller cause I'm a MAN. Every single store was out of them.\n\nStores include Meijer, Walmart, Target, BestBuy, GameStop. \n\nTLDR; MFST 200C 6/26 cause why not.\n\nOther positions for clarification of retardation;\nSpy 300c 05/29\nCost 340c 06/05 (pure reeree)\nAbbv 110c 06/19 (I'm a lemming)",
        "subreddit": "wallstreetbets",
        "title": "Literally did the legwork for you pussies: MSFT 200c 06/26",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gqiavz/literally_did_the_legwork_for_you_pussies_msft/",
        "created": 1590466185.0
    },
    {
        "author": "gme_bull",
        "created_utc": 1590863711,
        "id": "gtj8gr",
        "num_comments": 42,
        "num_crossposts": 0,
        "selftext": "Don't worry.  You've come to the right place, and it's easier than you might think.\n\nFrom the words of the master:\n\n&gt;Rule number one: never lose money. Rule number two: never forget rule number one.\n\n*-Warren Buffett*\n\nSo you found a super cheap stock with growth potential.  How do you know if it's safe?\n\nFrom the words of another master:\n\n&gt;Companies that have no debt can't go bankrupt.\n\n*-Peter Lynch*\n\nIf you have a cheap company that makes good money, you're halfway done.  The next step is to see if it's safe.  It doesn't matter how much money they make if they're about to go into bankruptcy.\n\nThe sources of immediate, apparent financial risk are liabilities and accrued assets, fake money and real debts.  If a company doesn't owe anyone anything, and no one owes it, it cannot get into financial trouble.\n\nThe more complex the financial structure, the more likely it will get into trouble or even be a fraud.  The only non-financial companies (financials are more advanced than non-financials) that should have apparently high levels of debt are capital intensive industry.  In this case, good financial management is much more critical because these businesses simply cannot compete with the rest of the market without financing a portion of their assets.  The returns are too low to attract equity capital debt-free.  Here, internal returns on capital become a safety issue.  If cash ROA is less than the rate paid on debt, the company will have to unwind over the long run.  Conversely, in times like these, these highly financed companies can buyback a ton of debt while rates collapse and sell debt later at normal rates again once the drama passes.\n\nThe ultimate tool of the value investor should be in examining past cases by the legends.  Don't just look at their grand slams.  Look at their biggest mistakes, and avoid repeating them.  Look at their biggest disappointments and try to find out why.\n\nIn that vein, I'm going to shamelessly shill my biggest holding GME as a case study in financial prudence.\n\nCompare the financials of this year to last: [https://www.sec.gov/ix?doc=/Archives/edgar/data/1326380/000132638020000022/a10k-fy19q4.htm#sF080EC46346F5C99B645C708B514DD4C](https://www.sec.gov/ix?doc=/Archives/edgar/data/1326380/000132638020000022/a10k-fy19q4.htm#sF080EC46346F5C99B645C708B514DD4C)\n\nWhich one is safer?  Should this company have 20% of normal sales invested in inventory totally financed with payables?  Is that the kind loose and aggressive play we want to see from a CEO of a no growth cash cow?  Fancy play in a simple game is expensive.  A no growing cash cow is limit poker not no limit.  Why would the company hold $1.8 billion in cash while it has $800 million in debt?  Shouldn't it put that cash to work towards the highest returning investment which in this case just happens to be the stock issuance?\n\nThe 2020 balance sheet is clearly much cleaner and stronger, and I would call it \"pristine\".  Not only did this management pay down debt but they also bought back almost 40% of the stock, which is nearly a 70% increase in per share intrinsic value, while reducing working capital leverage by an enormous amount.  And assuming normal business conditions once the new PlayStations and Xboxes are released, return on assets will be much higher than in the past due better inventory management.  The remaining debt on the books is trading at around 70c on the Dollar for a 55% yield, so needless to say, they have shifted their immediate focus to that buyback opportunity before going back to equity buybacks.\n\nThe goto books on financial safety are The Interpretation of Financial Statements and the early Security Analysis editions by Benjamin Graham, the first one being more basic with the latter being what should be required to receive a PhD in value investing.  I cannot stress their importance enough.",
        "subreddit": "ValueInvesting",
        "title": "Great, price and value are almost never equal. Now what? WHERE DO I BEGIN?!?!?",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/gtj8gr/great_price_and_value_are_almost_never_equal_now/",
        "created": 1590892511.0
    },
    {
        "author": "adamj495",
        "created_utc": 1590877759,
        "id": "gtnag8",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "It seems to be a trend that relatively large public companies going bankrupt each week, I want to have a discussion on what companies are in line to go bankrupt soon so we can play some Puts on them. We know JPow can't prevent downplays, so the bears should take on bankruptcy!\n\nAny news, hype, or gossip related to legitimate potential bankruptcies in the short term (less than 6 months) are welcome!\n\nPlease leave your MSFT, AMZN, and Apple bankruptcy jokes for other threads, although I know this statement will backfire on me.\n\nPositions\nGME $3P 10/16\nBBBY $2P 11/20\nGPS $4P 12/18\nHOG $10 1/15/21\nLB $5 1/15/21\nM $5 1/15/21\nOXY $5 1/15/21",
        "subreddit": "wallstreetbets",
        "title": "Weekly Bankruptcy Discussion June 1 to June 5",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gtnag8/weekly_bankruptcy_discussion_june_1_to_june_5/",
        "created": 1590906559.0
    },
    {
        "author": "Leapfrog25",
        "created_utc": 1588675967,
        "id": "gdvlkz",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "Hi guys, I'm long GameStop and have been long for about a month now. I swooped in on a bunch of shares a month ago when the price was thrown down to $2.80, and have a cost basis now around $3.50. I am still long, as I think this stock is way oversold with nearly 100% short interest and unlike other retailers, I think this company has actually benefitted from the coronavirus lockdown. \n\nWith new consoles coming out, good management focusing on paying down debt and the coronavirus allowing the company to clear out old outdated gaming inventory and close brick and mortar locations that are cash flow negative, GameStop will have a headstart in a post-corona world. I also find their vision of \"becoming the social and cultural hub for gaming\" pretty interesting. People have mentioned that gaming cafes fail, but GameStop is also a retailer who thrives off of foot traffic. GameStop was cheap last month, and is still cheap now trading at a P/B of 0.87. \n\nI would also like to note that a lot of the time, being right and a contrarian is one of the only ways to profit immensely on the stock market.  Last month, when I was doubling down on my position, when popular opinion on this forum was talking about how GameStop is failing.  [https://www.reddit.com/r/investing/comments/ft0uev/the\\_end\\_of\\_gamestop/](https://www.reddit.com/r/investing/comments/ft0uev/the_end_of_gamestop/)",
        "subreddit": "investing",
        "title": "Long GameStop",
        "url": "https://www.reddit.com/r/investing/comments/gdvlkz/long_gamestop/",
        "created": 1588704767.0
    },
    {
        "author": "RipplesZerp",
        "created_utc": 1588536312,
        "id": "gcx72p",
        "num_comments": 35,
        "num_crossposts": 0,
        "selftext": "The world has already moved towards digitalization, with everything.\n\nSocialization, Shopping, Entertainment, Dating, and most of all G A M I N G.  \n\nWhen is the last time you went to a store to buy a physical copy of a game? For me it’s been about 4 years, every game I purchase is always digital through Microsoft and Steam, benefits are it’s more convenient, you can share your games with your family/friends, and the thing is never going to break it will always be under your ownership. I guess the one con is that you can’t sell it to anyone when your done with it.\n\nNext thing, gaming devices and accessories, well I got amazon for that. At least for me if I need a tech accessory, I always go online, better prices and I can stay sitting on my ass\n\nThe new consoles won’t come out for a while as well so GameStop has the upper hand on NOTHING. and who the hell is buying current gen consoles with all this pandemic/recession crap? If people want them they probably go to a second hand market anyway\n\nQ/Q earnings are terrible and it seems like someone is keeping the company open for a tax deduction, but IRS only allows that for 3 years. \n\nI bought medium term puts on GME, so the price will probably go sky high",
        "subreddit": "wallstreetbets",
        "title": "$GME to Zero?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gcx72p/gme_to_zero/",
        "created": 1588565112.0
    },
    {
        "author": "DeepFuckingValue",
        "created_utc": 1590955884,
        "id": "gu60lb",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "GME YOLO month-end update — May 2020",
        "url": "https://i.redd.it/2xmlne1xq5251.png",
        "created": 1590984684.0
    },
    {
        "author": "Bul1994",
        "created_utc": 1588494706,
        "id": "gcn6o2",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "What are your thoughts on GME going into the holidays?",
        "subreddit": "stocks",
        "title": "Young investors only!!!",
        "url": "https://www.reddit.com/r/stocks/comments/gcn6o2/young_investors_only/",
        "created": 1588523506.0
    },
    {
        "author": "timftw9001",
        "created_utc": 1588972985,
        "id": "gg201a",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "$GME Michael Burry Manipulation",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gg201a/gme_michael_burry_manipulation/",
        "created": 1589001785.0
    },
    {
        "author": "tatmanblue",
        "created_utc": 1590586210,
        "id": "grjr4h",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "[Michael Burry](https://markets.businessinsider.com/news/stocks/big-short-investor-michael-burry-added-5-stocks-in-q1-2020-5-1029227882#1-jack-in-the-box1) is has a big stake in Gamestop.  What could the be reasoning behind such an big investment?",
        "subreddit": "stocks",
        "title": "Gamestop stock?",
        "url": "https://www.reddit.com/r/stocks/comments/grjr4h/gamestop_stock/",
        "created": 1590615010.0
    },
    {
        "author": "josh3684",
        "created_utc": 1588339056,
        "id": "gbhxgj",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Came in here in March and asked about GameStop GME... I know about all the big changes they have made and I thought it would be a good short term investment, maybe on into Christmas.\nWas told by everyone how horrible a idea this was, and i might as well buy blockbuster stock.\n\nWell I’ve doubled my money since investing.\n\nIf you have a good idea.. go with it. Most people don’t know what they are talking about",
        "subreddit": "stocks",
        "title": "GameStop stock",
        "url": "https://www.reddit.com/r/stocks/comments/gbhxgj/gamestop_stock/",
        "created": 1588367856.0
    },
    {
        "author": "EmployerOfTheMonth",
        "created_utc": 1590144580,
        "id": "goh49i",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "https://imgur.com/a/TrVx86R\n\nSource: https://f0c5bbc0-bc47-4244-ac04-93b6e88189dc.filesusr.com/ugd/b68ea3_2bb819bb66064decaae48fbb198ae0ac.pdf\n\nSource for presentation: https://www.restoregamestop.com/presentation",
        "subreddit": "investing",
        "title": "GameStop Still owns a jet",
        "url": "https://www.reddit.com/r/investing/comments/goh49i/gamestop_still_owns_a_jet/",
        "created": 1590173380.0
    },
    {
        "author": "gme_bull",
        "created_utc": 1589994411,
        "id": "gnfaft",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "SecurityAnalysis",
        "title": "An unpopular yet most value-oriented analysis of GME",
        "url": "https://www.reddit.com/r/SecurityAnalysis/comments/gnfaft/an_unpopular_yet_most_valueoriented_analysis_of/",
        "created": 1590023211.0
    },
    {
        "author": "EmployerOfTheMonth",
        "created_utc": 1588757592,
        "id": "gegt32",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "April 6th: 3.09\n\nMay 6th: 5.39",
        "subreddit": "investing",
        "title": "GameStop is up 74% in the last month",
        "url": "https://www.reddit.com/r/investing/comments/gegt32/gamestop_is_up_74_in_the_last_month/",
        "created": 1588786392.0
    },
    {
        "author": "gme_bull",
        "created_utc": 1590120382,
        "id": "goc8ve",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Sales collapsed last year, and the shareholders are panicking because value investors are starting to lose their nerve due to the record spread between glamour and value like how people gave up on growth stocks at the end of 2007.\n\nNo one, not even the excellent employees over at /r/GameStop, has realized that the collapse in demand for Xboxes and PlayStations due to the delayed yet again end of cycle was the cause.  They're selling Switches like hotcakes while barely even mentioning the others despite their being the vast majority of the overall normal console business.\n\nSo since last year's sales dumped to $6.5 billion from the previous year's $8.3 billion due solely to the crash in consoles and associated business, I expect those lost sales to be reclaimed this year, pushing total revenue up to $10 billion.\n\nIf the shareholders can keep from dumping their star CEO who has already bought back nearly 40% of the shares into the short sellers so that they are around 100% short the entire company all while paying off almost all of the debt at a discount and cutting working capital to the bone, he should steer the company into a record year, piled on top of all the changes they've been making.",
        "subreddit": "ValueInvesting",
        "title": "I'm going on record for around $10 billion in sales for GME this year",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/goc8ve/im_going_on_record_for_around_10_billion_in_sales/",
        "created": 1590149182.0
    },
    {
        "author": "badpauly",
        "created_utc": 1589386754,
        "id": "gj26dw",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "These are the latest Schedule 13D forms filed by activist investors in the last 7 days. Activist\ninvestors are investors that make an investment with the intention of influencing management in some way.\nThere is evidence that following activist investors into investments can generate excess returns.\nSchedule 13G forms, in contrast, are filed by significant investors with no intention of influencing management\n(such as Index funds).\n\nThere is always a lot of interest in insider trades, but what a lot of people probably don't realize\nis that hedge fund activity is probably more predictive of future returns than insider activity.\nThe reason is that hedge funds (a) have large research budgets, and (b) have a choice where to put their money.\nIn contract, insiders have no choice where to put their money, but only when to time their transactions.\n\n## New Filings\nThis table lists new 13D filings in the last week. A new filing does not necessarily indicate a new position,\nas investors frequently accumulate in advance before reaching the filing threshold.\n\nDate|Form|Company|Investor|Shares|Ownership|Change\n----|----|-------|--------|-----:|--------:|----:  \n05&amp;#8209;12|13D|[WTRH / Waitr Holdings Inc.](https://fintel.io/so/us/wtrh)|[Luxor Capital Group, LP](https://fintel.io/i/luxor-capital-group-lp)| 9,894,506|9.99%|0.00 \n05&amp;#8209;12|13D|[DHR / Danaher Corp.](https://fintel.io/so/us/dhr)|[RALES MITCHELL P](https://fintel.io/i/rales-mitchell-p)| 35,472,803|5.0%|0.00 \n05&amp;#8209;11|13D|[MIGT / Mi1 Global TelCo., Inc.](https://fintel.io/so/us/migt)|[Kok Seng Yeap](https://fintel.io/i/kok-seng-yeap)| 99,156|90.14%| \n05&amp;#8209;11|13D|[WUBA / 58.com Inc.](https://fintel.io/so/us/wuba)|[Yao Jinbo](https://fintel.io/i/yao-jinbo)| 30,598,634|10.2%|0.00 \n05&amp;#8209;11|13D|[M / Macy&amp;#x27;s, Inc.](https://fintel.io/so/us/m)|[Vesa Equity Investment S.a r.l.](https://fintel.io/i/vesa-equity-investment-s-a-r-l)| 15,536,538|5.0%| \n05&amp;#8209;08|13D|[CG / The Carlyle Group L.P.](https://fintel.io/so/us/cg)|[Carlyle Group Management L.L.C.](https://fintel.io/i/carlyle-group-management)| 218,248,125|62.6%|-2.49 \n05&amp;#8209;08|13D|[NGL / NGL Energy Partners LP](https://fintel.io/so/us/ngl)|[EIG NEPTUNE EQUITY AGGREGATOR, L.P.](https://fintel.io/i/eig-neptune-equity-aggregator-l-p)| 11,687,500|8.0%| \n05&amp;#8209;08|13D|[TORC / resTORbio, Inc.](https://fintel.io/so/us/torc)|[Adicet Bio, Inc.](https://fintel.io/i/adicet-bio-inc)| 9,136,678|25.07%| \n05&amp;#8209;08|13D|[PTLA / Portola Pharmaceuticals, Inc.](https://fintel.io/so/us/ptla)|[Magnetar Financial LLC](https://fintel.io/i/magnetar-financial-llc)| 4,106,528|5.23%| \n05&amp;#8209;07|13D|[GARS / Garrison Capital Inc.](https://fintel.io/so/us/gars)|[STILWELL JOSEPH](https://fintel.io/i/stilwell-joseph)| 205,874|6.9%|430.77 \n05&amp;#8209;07|13D|[MOXC / Moxian, Inc.](https://fintel.io/so/us/moxc)|[Joyful Corp Ltd](https://fintel.io/i/joyful-corp-ltd)| 2,000,000|12.352%| \n05&amp;#8209;06|13D|[PMCB / PharmaCyte Biotech, Inc.](https://fintel.io/so/us/pmcb)|[Montazeri Nima](https://fintel.io/i/montazeri-nima)| 95,262,015|5.8%|\n\n## Amended Filings\nThis table lists amended filings in the last week, and is useful for monitoring changes in existing investments\nor when a fund closes a position. I have eliminated all filings with less than a 5% change in ownership.\n\nDate|Form|Company|Investor|Shares|Ownership|Change\n----|----|-------|--------|-----:|--------:|----:  \n05&amp;#8209;13|13D/A|[CBAY / Cymabay Therapeutics Inc.](https://fintel.io/so/us/cbay)|[Engine Capital, L.P.](https://fintel.io/i/engine-capital)| 2,097,676|3.0%|-68.09 \n05&amp;#8209;12|13D/A|[EVC / Entravision Communications Corp.](https://fintel.io/so/us/evc)|[ANGELO GORDON &amp;amp; CO., L.P.](https://fintel.io/i/angelo-gordon)| 4,899,998|8.19%|16.17 \n05&amp;#8209;12|13D/A|[NWY / New York &amp;amp; Company, Inc.](https://fintel.io/so/us/nwy)|[Philotimo Fund, LP](https://fintel.io/i/philotimo-fund-lp)| 4,417,975|6.77%|-20.26 \n05&amp;#8209;12|13D/A|[DISH / DISH Network Corp.](https://fintel.io/so/us/dish)|[ERGEN CHARLES W](https://fintel.io/i/ergen-charles-w)| 0|0.0%| \n05&amp;#8209;12|13D/A|[PFMT / Performant Financial Corp](https://fintel.io/so/us/pfmt)|[Mill Road Capital II, L.P.](https://fintel.io/i/mill-road-capital-ii)| 3,479,615|6.4%|-5.88 \n05&amp;#8209;12|13D/A|[SLTB / Scorpio Bulkers Inc.](https://fintel.io/so/us/sltb)|[Scorpio Services Holding Ltd](https://fintel.io/i/scorpio-services-holding)| 1,447,751|20.0%| \n05&amp;#8209;12|13D/A|[ESTE / Earthstone Energy, Inc. ](https://fintel.io/so/us/este)|[Flatonia Holdings, LLC](https://fintel.io/i/flatonia-holdings-llc)| 1,488,993|4.99%|-15.42 \n05&amp;#8209;12|13D/A|[XNCR / Xencor, Inc.](https://fintel.io/so/us/xncr)|[STAFFORD JOHN S III](https://fintel.io/i/stafford-john-s-iii)| 4,117,149|7.2%|-18.18 \n05&amp;#8209;12|13D/A|[GFNSL / General Finance Corp.](https://fintel.io/so/us/gfnsl)|[HAVNER RONALD L JR](https://fintel.io/i/havner-ronald-l-jr)| 2,980,100|9.7%|870.00 \n05&amp;#8209;12|13D/A|[PLAY / Dave &amp;amp; Buster&amp;#x27;s Entertainment, Inc.](https://fintel.io/so/us/play)|[KKR Asset Management LLC](https://fintel.io/i/kkr-asset-management-llc)| 2,725,800|5.9%|-28.92 \n05&amp;#8209;12|13D/A|[TPX / Tempur Sealy International, Inc.](https://fintel.io/so/us/tpx)|[H PARTNERS MANAGEMENT, LLC](https://fintel.io/i/h-partners-management-llc)| 2,950,000|5.7%|-16.18 \n05&amp;#8209;11|13D/A|[SP / SP Plus Corporation](https://fintel.io/so/us/sp)|[P2 Capital Partners, LLC](https://fintel.io/i/p2-capital-partners-llc)| 1,109,905|4.8%|-25.00 \n05&amp;#8209;11|13D/A|[ASPS / Altisource Portfolio Solutions S.A.](https://fintel.io/so/us/asps)|[Deer Park Road Management Company, LP](https://fintel.io/i/deer-park-road-management-company-lp)| 3,571,023|22.9%| \n05&amp;#8209;11|13D/A|[TGP / Teekay LNG Partners L.P.](https://fintel.io/so/us/tgp)|[Teekay Corp](https://fintel.io/i/teekay)| 35,958,274|40.6%| \n05&amp;#8209;11|13D/A|[TVTY / Tivity Health, Inc.](https://fintel.io/so/us/tvty)|[Hudson Executive Capital LP](https://fintel.io/i/hudson-executive-capital-lp)| 4,795,310|9.9%|-45.30 \n05&amp;#8209;11|13D/A|[SBGI / Sinclair Broadcast Group, Inc.](https://fintel.io/so/us/sbgi)|[SMITH DAVID D](https://fintel.io/i/smith-david-d)| 28,796,238|35.4%|16.07 \n05&amp;#8209;11|13D/A|[BH / Biglari Holdings Inc.](https://fintel.io/so/us/bh)|[GAMCO INVESTORS, INC. ET AL](https://fintel.io/i/gamco-investors-inc-et-al)| 20,660|9.99%|20.51 \n05&amp;#8209;11|13D/A|[89374L104 / Translate Bio Inc](https://fintel.io/so/us/89374l104)|[Baupost Group LLC/MA](https://fintel.io/i/baupost-group-llc-ma)| 17,544,239|27.9%| \n05&amp;#8209;11|13D/A|[FCT / First Trust Senior Floating Rate Income Fund II](https://fintel.io/so/us/fct)|[Saba Capital Management, L.P.](https://fintel.io/i/saba-capital-management)| 2,390,655|9.0%|21.62 \n05&amp;#8209;11|13D/A|[NPO / EnPro Industries, Inc.](https://fintel.io/so/us/npo)|[GAMCO INVESTORS, INC. ET AL](https://fintel.io/i/gamco-investors-inc-et-al)| 1,485,092|7.24%|24.83 \n05&amp;#8209;11|13D/A|[68373L307 / OPGEN INC](https://fintel.io/so/us/68373l307)|[Curetis N.V. in Liquidation](https://fintel.io/i/curetis-n-v-in-liquidation)| 0|0.0%|-100.00 \n05&amp;#8209;11|13D/A|[SGBX / SG Blocks, Inc.](https://fintel.io/so/us/sgbx)|[SWETS LARRY G JR](https://fintel.io/i/swets-larry-g-jr)| 68,082|4.23%|-52.42 \n05&amp;#8209;11|13D/A|[PBPB / Potbelly Corp](https://fintel.io/so/us/pbpb)|[Vann A. AvedisianTrust U/A 8/29/85](https://fintel.io/i/vann-a-avedisiantrust-u-a-8-29-85)| 666,427|2.81%|7.25 \n05&amp;#8209;11|13D/A|[CBPO / China Biologic Products, Inc.](https://fintel.io/so/us/cbpo)|[Pw Medtech Group Ltd](https://fintel.io/i/pw-medtech-group)| 5,321,000|13.8%|-16.01 \n05&amp;#8209;11|13D/A|[03676C100 / Anterix Inc](https://fintel.io/so/us/03676c100)|[FEINBERG STEPHEN](https://fintel.io/i/feinberg-stephen)| 796,235|4.6%|-16.36 \n05&amp;#8209;08|13D/A|[FND / Floor &amp;amp; Decor Holdings, Inc.](https://fintel.io/so/us/fnd)|[Ares Corporate Opportunities Fund Iii Lp](https://fintel.io/i/ares-corporate-opportunities-fund-iii)| 13,224,262|12.9%|-28.33 \n05&amp;#8209;08|13D/A|[MFSF / MutualFirst Financial, Inc.](https://fintel.io/so/us/mfsf)|[PL Capital, LLC](https://fintel.io/i/pl-capital-llc)| 0|0.0%|-100.00 \n05&amp;#8209;08|13D/A|[SBNB / Scorpio Tankers Inc Senior Notes](https://fintel.io/so/us/sbnb)|[Scorpio Bulkers Inc.](https://fintel.io/i/scorpio-bulkers)| 2,155,140|3.7%|-66.06 \n05&amp;#8209;08|13D/A|[FND / Floor &amp;amp; Decor Holdings, Inc.](https://fintel.io/so/us/fnd)|[Fs Equity Partners Vi, L.p.](https://fintel.io/i/fs-equity-partners-vi)| 13,224,262|12.9%|-28.33 \n05&amp;#8209;08|13D/A|[MEDP / Medpace Holdings, Inc.](https://fintel.io/so/us/medp)|[Troendle August J.](https://fintel.io/i/troendle-august)| 9,093,645|25.2%|11.01 \n05&amp;#8209;08|13D/A|[RESI / Altisource Residential Corp](https://fintel.io/so/us/resi)|[Deer Park Road Management Company, LP](https://fintel.io/i/deer-park-road-management-company-lp)| 6,749,859|12.5%|8.70 \n05&amp;#8209;08|13D/A|[WTW / Weight Watchers International, Inc.](https://fintel.io/so/us/wtw)|[WINFREY OPRAH](https://fintel.io/i/winfrey-oprah)| 10,805,772|14.8%|34.55 \n05&amp;#8209;08|13D/A|[STCK / BMC Stock Holdings, Inc.](https://fintel.io/so/us/stck)|[Coliseum Capital Management, LLC](https://fintel.io/i/coliseum-capital-management-llc)| 5,723,483|8.5%|16.44 \n05&amp;#8209;08|13D/A|[VOXX / VOXX International Corp.](https://fintel.io/so/us/voxx)|[Kahli Beat](https://fintel.io/i/kahli-beat)| 3,625,000|16.7%|9.94 \n05&amp;#8209;08|13D/A|[POPE / Pope Resources, L.P.](https://fintel.io/so/us/pope)|[Pope Maria M](https://fintel.io/i/pope-maria-m)| 0|0.0%|-100.00 \n05&amp;#8209;08|13D/A|[BCLI / BrainStorm Cell Therapeutics Inc.](https://fintel.io/so/us/bcli)|[Daly Joseph Patrick](https://fintel.io/i/daly-joseph-patrick)| 1,077,500|3.66%|-20.09 \n05&amp;#8209;08|13D/A|[OTIV / On Track Innovations Ltd.](https://fintel.io/so/us/otiv)|[Ivy Jerry Lafe JR](https://fintel.io/i/ivy-jerry-lafe-jr)| 13,997,575|26.0%|35.42 \n05&amp;#8209;08|13D/A|[ASND / Ascendis Pharma AS](https://fintel.io/so/us/asnd)|[ORBIMED ADVISORS LLC](https://fintel.io/i/orbimed-advisors-llc)| 2,518,782|5.2%|-17.46 \n05&amp;#8209;07|13D/A|[TLRD / Tailored Brands, Inc.](https://fintel.io/so/us/tlrd)|[Scion Asset Management, LLC](https://fintel.io/i/scion-asset-management-llc)| 1,700,000|3.5%|-57.83 \n05&amp;#8209;07|13D/A|[AT / Acuityads Holdings Inc](https://fintel.io/so/ca/at)|[MANGROVE PARTNERS](https://fintel.io/i/mangrove-partners)| 1,453,654|1.6%|-78.08 \n05&amp;#8209;07|13D/A|[MLFB / Major League Football, Inc.](https://fintel.io/so/us/mlfb)|[Jennings Britt Terrell](https://fintel.io/i/jennings-britt-terrell)| 37,500,000|24.45%|-27.15 \n05&amp;#8209;07|13D/A|[PVA / Penn Virginia Corporation](https://fintel.io/so/us/pva)|[Strategic Value Partners, LLC](https://fintel.io/i/strategic-value-partners-llc)| 519,264|3.4%|-39.29 \n05&amp;#8209;07|13D/A|[AVID / Avid Technology, Inc.](https://fintel.io/so/us/avid)|[Impactive Capital Lp](https://fintel.io/i/impactive-capital)| 4,364,971|10.1%|12.22 \n05&amp;#8209;07|13D/A|[EMPR / Empire Petroleum Corp.](https://fintel.io/so/us/empr)|[Kamin Tony](https://fintel.io/i/kamin-tony)| 4,340,971|17.8%|-14.09 \n05&amp;#8209;07|13D/A|[CBPO / China Biologic Products, Inc.](https://fintel.io/so/us/cbpo)|[Centurium Capital Partners 2018, L.p.](https://fintel.io/i/centurium-capital-partners-2018)| 10,698,260|27.8%|10.32 \n05&amp;#8209;07|13D/A|[IDRA / Idera Pharmaceuticals, Inc.](https://fintel.io/so/us/idra)|[Pillar Pharmaceuticals I LP](https://fintel.io/i/pillar-pharmaceuticals-i-lp)| 6,254,107|18.6%|52.46 \n05&amp;#8209;07|13D/A|[AQMS / Aqua Metals, Inc.](https://fintel.io/so/us/aqms)|[Philotimo Fund, LP](https://fintel.io/i/philotimo-fund-lp)| 4,842,319|8.1%|14.08 \n05&amp;#8209;06|13D/A|[VBIV / VBI Vaccines, Inc.](https://fintel.io/so/us/vbiv)|[ARCH VENTURE FUND VI LP](https://fintel.io/i/arch-venture-fund-vi-lp)| 13,026,057|5.7%|-21.92 \n05&amp;#8209;06|13D/A|[ADNT / Adient Public Limited Company](https://fintel.io/so/ie/adnt)|[Blue Harbour Group, L.P.](https://fintel.io/i/blue-harbour-group)| 4,166,140|4.44%|-36.75 \n05&amp;#8209;06|13D/A|[GME / GameStop Corp.](https://fintel.io/so/us/gme)|[Scion Asset Management, LLC](https://fintel.io/i/scion-asset-management-llc)| 2,801,929|4.3%|-18.87 \n05&amp;#8209;06|13D/A|[SUP / Superior Industries International, Inc.](https://fintel.io/so/us/sup)|[GAMCO INVESTORS, INC. ET AL](https://fintel.io/i/gamco-investors-inc-et-al)| 608,401|2.38%| \n05&amp;#8209;06|13D/A|[AQMS / Aqua Metals, Inc.](https://fintel.io/so/us/aqms)|[Philotimo Fund, LP](https://fintel.io/i/philotimo-fund-lp)| 4,244,758|7.1%|-8.97 \n05&amp;#8209;06|13D/A|[AMGP / Antero Midstream GP LP](https://fintel.io/so/us/amgp)|[RADY PAUL M](https://fintel.io/i/rady-paul-m)| 107,000,001|22.46%|6.45 \n05&amp;#8209;06|13D/A|[MDWT / Midwest Holding Inc.](https://fintel.io/so/us/mdwt)|[Vespoint Llc](https://fintel.io/i/vespoint)| 1,088,050,163|79.96%|-18.16\n\nSource: [Fintel.io/activists](https://fintel.io/activists)",
        "subreddit": "StockMarket",
        "title": "Significant Activist Hedge Fund Activity (Last 7 Days)",
        "url": "https://www.reddit.com/r/StockMarket/comments/gj26dw/significant_activist_hedge_fund_activity_last_7/",
        "created": 1589415554.0
    },
    {
        "author": "gme_bull",
        "created_utc": 1590527676,
        "id": "gr5tec",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "These Hestia &amp; Permit guys are complete scum.  They could never deliver the ex-President of Nintendo, Mr Reggie Fils-Aimé, who even /r/GameStop went nuts over, and they are a very tough crowd.  I have never seen a leaner, meaner value creation crew.  It's sick.  That high level relationship has paid off for Switch inventory procurement mightily and more than justified that cheap plane they have.  The Switch is the entire industry right now until MSFT and SNE feel like finally releasing the new consoles.  They're definitely feeling the collapse in sales in those divisions.  Meanwhile, GME can't keep Switches stocked, they're selling so fast.\n\nI got back in right before Mr Sherman was hired, and he has been a godsend.  It's hell at the company right now, but they are smashing through every challenge.  Every possible thing that could have happened has happened to them.  They are all sharpened steel now.  It's the most exciting turnaround I've ever seen live or ever.  The console cycle debacle is the only thing in the way, but that's resolved by September.\n\nNow, the risk is if the shareholders are stupid enough to vote in these looter prospective board members.  George Sherman has a proven record of delivering high growth in per share intrinsic value which he's already done by repurchasing 40% of the stock for a 60% increase in per share intrinsic value.  And he's not finished.  He's taking a break though while he buys back notes trading for a 55% yield at the moment.  When he feels good about that, I have no doubt he turns his big guns back towards the equity because this year should be massive with the launches of consoles composing 66% to 75% of all industry revenue, and the company will have no more debt or onerous working capital.\n\nThis stock is where the true action is in the market.  It's consistently sold 100% short with an interest rate that hit 200%!!!  The risk these days for value longs are other stupid shareholders.\n\nAnd it's selling below the valuations that Buffett paid when he achieved 50% annual returns.  This stock will make or break careers.  Ironically, Hestia &amp; Permit are trying to nuke their own super long term investments by interfering.  It's pathetic when \"value investors\" go the way of Eddie Lampert.",
        "subreddit": "stocks",
        "title": "I love watching the team at GME go all out and defend the company from the barbarian looters. If you want high risk and reward, there's no better choice right now.",
        "url": "https://www.reddit.com/r/stocks/comments/gr5tec/i_love_watching_the_team_at_gme_go_all_out_and/",
        "created": 1590556476.0
    },
    {
        "author": "x05595113",
        "created_utc": 1588864773,
        "id": "gf8h2v",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "I sold this CSP for $1.07 on Monday as a possible wheel strategy start. My cost basis is $4.93 ... obviously the stock price is under it as I am writing this post. Also ITM but I’m fine with eventuality.\n\n15 DTE so there is still runway so I can just sit and wait.\nHowever I could buy back the option for $1.68 and sell a week out for $1.58. This would increase my cost basis to $5.01 with another week to see what happens. Is this move wiser than waiting to see what happens with my current position?\n\nAlso, if making a move is better, then I could consider decreasing the strike to say $5 for $0.82 and have a lower cost basis of $4.77. I’m looking to wheel so i do mind having the strike closer to ATM.\n\nAny thoughts or suggestions \nThanks",
        "subreddit": "options",
        "title": "22MAY 6p GME sold - currently GME is $4.75 - next move",
        "url": "https://www.reddit.com/r/options/comments/gf8h2v/22may_6p_gme_sold_currently_gme_is_475_next_move/",
        "created": 1588893573.0
    },
    {
        "author": "gme_bull",
        "created_utc": 1589996218,
        "id": "gnfv9f",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "ValueInvesting",
        "title": "An unpopular yet most value-oriented analysis of GME",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/gnfv9f/an_unpopular_yet_most_valueoriented_analysis_of/",
        "created": 1590025018.0
    },
    {
        "author": "uworich",
        "created_utc": 1589843792,
        "id": "gmcoue",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Thoughts on Gamestop?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gmcoue/thoughts_on_gamestop/",
        "created": 1589872592.0
    },
    {
        "author": "NoNameMusic111",
        "created_utc": 1590958294,
        "id": "gu6qn0",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "RobinHoodPennyStocks",
        "title": "Thoughts on GME?",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/gu6qn0/thoughts_on_gme/",
        "created": 1590987094.0
    },
    {
        "author": "cparsons444",
        "created_utc": 1588358293,
        "id": "gbnp31",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "RobinHood",
        "title": "Can anyone Explain why GameStop (GME) Hasnt died yet",
        "url": "https://www.reddit.com/r/RobinHood/comments/gbnp31/can_anyone_explain_why_gamestop_gme_hasnt_died_yet/",
        "created": 1588387093.0
    },
    {
        "author": "gme_bull",
        "created_utc": 1590010779,
        "id": "gnk15w",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "It's not pretty out there in value investing land.  Most have gone full Growth At Any Price while the rest are panicking.\n\nThese guys are demanding that management cut expenses, buyback stock, and start investing in the future, all of which management is doing very well.  They've bought back 40% of the stock and have taken a break from that to buyback their remaining debt for 70c on the Dollar.  They've slashed headcount and compensation to the bone while restoring productivity and cleaning up both the debt and current assets &amp; liabilities.  The balance sheet will be pristine once they pay off the last of this debt.\n\nRevenue fell by a fifth last year, and everyone's going to pieces over it.  Meanwhile, even NPD is admitting that console sales for Xbox and PlayStation have collapsed by the same rate as GME's because they delayed the launches by yet another year after a record length in the console cycle.  All of that lost revenue constituted the entirety of last year's would-be profits.  If GME's failing right now, so are the console divisions of SNE and MSFT even though they historically are 2/3 to 3/4 of total industry units and revenue.\n\nIn times like these when value stocks are the cheapest they've ever been, it's fun to see who really has what it takes to be a true value investor.  Even Toby Carlisle's sidekick Bill Brewster just threw in the towel because he thinks value no longer works while it sits at the biggest spread to glamour since the 2000 and 1929 bubbles.\n\nLet's see if the shareholders are just as jumpy and vote for the guys who claim they'll restore the company to glory by paying both management and non-executives nothing and borrowing recklessly to buyback stock as they take credit for the potential $10 billion in sales this year, based upon catch up demand.",
        "subreddit": "stocks",
        "title": "Someone should tell Hestia &amp; Permit the only reason why there weren't any profits at GME last year was because no one was buying Xboxes and PlayStations",
        "url": "https://www.reddit.com/r/stocks/comments/gnk15w/someone_should_tell_hestia_permit_the_only_reason/",
        "created": 1590039579.0
    }
]