[
    {
        "author": "CrucifictionGod",
        "created_utc": 1582077875,
        "id": "f63bmc",
        "num_comments": 94,
        "num_crossposts": 0,
        "selftext": "Currently i have stock in...\n\n* Google $3k\n* Microsoft $2.5k\n* spce (gonna sell) $2.3k\n* nvidia $1.5k\n* reml $1.4k\n* wwe $1k\n* snap $1k\n* apple $500\n* fb $134\n* apme $20\n* Tesla $15\n* amazon $12\n\nGonna get rid of space and prob nvidia soon  \nThinking i want to invest long term. Should i take more of something like amazon, Facebook, Tesla? Should i pickup Visa/Mastercard/American express or something? Have taxes coming soon and will have 7k to play with. My car is paid off, i have a house and no credit card debt.",
        "subreddit": "stocks",
        "title": "What to invest in",
        "url": "https://www.reddit.com/r/stocks/comments/f63bmc/what_to_invest_in/",
        "created": 1582106675.0
    },
    {
        "author": "wincysss1",
        "created_utc": 1581858558,
        "id": "f4qfux",
        "num_comments": 80,
        "num_crossposts": 0,
        "selftext": "I've done a 'rough' valuation of the top stocks such as MSFT, AMZN, TSLA, MA etc...All having stocks which are technically over valued according to statistics. \n\n&amp;#x200B;\n\nSo i'd be interested to see what people think if this actual has any value seeing as it doesn't stop people buying them and they continue to rise",
        "subreddit": "stocks",
        "title": "Does a stocks valuation really matter?",
        "url": "https://www.reddit.com/r/stocks/comments/f4qfux/does_a_stocks_valuation_really_matter/",
        "created": 1581887358.0
    },
    {
        "author": "TrustedDeveloper",
        "created_utc": 1582780025,
        "id": "fa716y",
        "num_comments": 71,
        "num_crossposts": 0,
        "selftext": "Hey all —\nAfter riding high on my calls from the 21st of February, my portfolio value went from $3k to $500. I now turn to you to do what you wish with my portfolio. \nAs it stands:\nV, $207.5 call (x2)\nCRM, $202.5 call\n—\nMA\nCRM\n—\nGodspeed.",
        "subreddit": "wallstreetbets",
        "title": "Bet My Last $500",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fa716y/bet_my_last_500/",
        "created": 1582808825.0
    },
    {
        "author": "HITLERMAHJONG",
        "created_utc": 1582225063,
        "id": "f6xroo",
        "num_comments": 49,
        "num_crossposts": 0,
        "selftext": " \n\nStock: **Dropbox**\n\nDirection: **Neutral**, Monster Bullish\n\n**Price Target:** **18$, 22$**\n\n**Type: Put Credit Spread, Call Debit spread**\n\n**Fundamental:** As one of the old unicorns of silicon valley, Dropbox is in a bad place due to its lack of product moat in an increasingly competitive industry. However, DBX does sport one of the lowest PE ratios within the sector, leading to some value buyers eyeing the stock. DBX is somewhere in the muddy waters between Growth and Fundamental, and this can lead to some outsized price action.\n\n**Technical**: Priced above in 20, 50 day moving averages, below 200 day MA.  MACD shows neutral convergence. RSI shows around 55, slightly above neutral. Options sentiments are bearish in volume and neutral open interest. Implied movement of about 12.3% or 2.27$.\n\n**Sentimental**: Dropbox recently released its new product end of last quarter. This new product aims to smooth over some of Dropbox’s lagging technology and services. While a revenue re-acceleration was started last quarter, the increased cost on marketing, sales, and transition may affect earnings perception. Dropbox has a history of beating earnings; it also has a history of sliding after earnings. **This one is quite risky, and a bullish call is considered contrarian**. \n\n**ROI: 28%, 300%**\n\n**Risk Level: 5 out of 5, 50/50**  \n**I suggest the put credit spread. This overall play is much more risky, but also a very interesting case of growth vs fundamentals.**  \n\n[https://imgur.com/0BHsZem](https://imgur.com/0BHsZem) \\- put credit spread  \n [https://imgur.com/a/jViR0pz](https://imgur.com/a/jViR0pz)  \\- call debit spread\n\nIt's probably better to watch. If you made money this week, go small.",
        "subreddit": "wallstreetbets",
        "title": "Dropbox - 2/20/2020 AMC - Pretty Dangerous",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f6xroo/dropbox_2202020_amc_pretty_dangerous/",
        "created": 1582253863.0
    },
    {
        "author": "ThePiercoost",
        "created_utc": 1581545960,
        "id": "f2z9m8",
        "num_comments": 44,
        "num_crossposts": 0,
        "selftext": "Now hear me out,\n\n&amp;#x200B;\n\nI'm not one to shove a bunch of nonsense down your throat, just ask my 7 Instagram followers. I have figured out a system and here's what I think should happen. The next meme stock: Big oil baby, that's right XOM.\n\n&amp;#x200B;\n\nHere's why I'm interested:\n\nRSI- below 30\n\nMACD- -.17\n\nBelow MA and EMA\n\n[https://imgur.com/a/9uwM4i2](https://imgur.com/a/9uwM4i2)\n\n&amp;#x200B;\n\nIMMA RIDE AND LET THE BOOMERS DIE WHEN IT COMES CRASHING DOWN\n\n^(As always this is not financial advice.)",
        "subreddit": "wallstreetbets",
        "title": "The next meme: boomers' delight",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f2z9m8/the_next_meme_boomers_delight/",
        "created": 1581574760.0
    },
    {
        "author": "Fall0utFighter",
        "created_utc": 1582082276,
        "id": "f64cqb",
        "num_comments": 39,
        "num_crossposts": 0,
        "selftext": "I would like to know the best way to make a living trading stocks with only $1000 to start with. Can I just look up a list of the best high growth stocks to invest in and do some short term trading of those companies? I've heard Apple, Microsoft and Mastercard are good options.\n\nIf that strategy won't generate enough to make a living what other techniques can I use? I want high risk high reward.\n\nAny book recommendations?",
        "subreddit": "CanadianInvestor",
        "title": "How to turn a thousand dollars into a million trading stocks?",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/f64cqb/how_to_turn_a_thousand_dollars_into_a_million/",
        "created": 1582111076.0
    },
    {
        "author": "GUNSLINGERLOL",
        "created_utc": 1582840556,
        "id": "fajqc5",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "Hey guys, my name is Victor and I study engineering. I know a lot about gambling because i've been playing poker as a side income for the past five year. After reading WSB for a year I essentially switched from hard liquor to krokodil and opened a brokerage account a month ago.\n\nI've come to realize that, just like poker, trading FDs is very hard to learn because you can get punished for your good decision and, worst of all, you can get rewarded for bad plays.\n\nI made some money playing $PTON and i'd like to get you guys opinion on my thought process. Thanks!\n\nMy goal was to swing trade using RSI. Since stock used to only go up, I wanted an oversold stock that had an history of hitting overbought RSI and sell once it went back to that.\n\n&amp;#x200B;\n\nI settled on $PTON because it was a retard meme strenght that was heavily shilled by /u/MikeThePutz*.* It's 1h graph took about 10 day on average to swing so I took an ITM 2/28 27c at around 27.75$ on feb 7.\n\nI knew I needed an exit strategy, so I decided i'd give up if RSI dipped back into oversold. I didn't stick to that plan because it felt wrong to sell after it hit a bottom but I think this is a big problem in my strategy I need to fix.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/3z1daq8xejj41.png?width=1024&amp;format=png&amp;auto=webp&amp;s=4fb4da552d5d6777561eb3e6a25602d0e0cc3ecb\n\nIt's really a miracle that I was able to get away with it since the big rally it had in the last few day happened while the market suffered an huge correction. I think the reason is that the lockup ending on feb 24th was overanticipated and it was a real surprise when it didn't go to shit. [There is also another retarded reason given](https://ca.finance.yahoo.com/news/peloton-could-see-bump-home-201420811.html)\n\nI really don't think it make sense but I read in a bunch of place PTON was a coronavirus play.\n\nSince it was now overbought, and because people dont buy bike during the apocalypse, I immediatly bought a 27put for 3/20 expecting a pullback from the \\~8% gain day. I didn't intend on holding this puts for long considering how great the last few days were and I'm really unsure about expiry date. Once again, no real exit plan :X. My plan was to sell when 5 minute RSI went to oversold but it didn't happen and I got stuck holding overnight.\n\n&amp;#x200B;\n\nCorona finally caught up today and i'm pretty proud to say I sold pretty much at the bottom. I decide to sell when it crossed 27 (a price it spent a lot of time on the last few day) and started to finally face some resistance. \n\nhttps://preview.redd.it/f24drw5dfjj41.png?width=1026&amp;format=png&amp;auto=webp&amp;s=c57316910880b52bf8c94dba10799fd6f372ba86\n\n&amp;#x200B;\n\nI once again bought a call once again because I felt such an hard drill had to be followed by a rebound, and I sold a few moment later because it was going sideways and it crossed down the 25 MA. Really not sure about this I felt like my plan wasn't really solid and I sold because I didn't have an opinion on the future direction of the stock.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nAlso, i'd like a number 9 with a large fry.",
        "subreddit": "wallstreetbets",
        "title": "Did I play $PTON right?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fajqc5/did_i_play_pton_right/",
        "created": 1582869356.0
    },
    {
        "author": "LowNumber8",
        "created_utc": 1582654545,
        "id": "f9ehda",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "Hi,\n\nI currently hold 6x AAPL, 10x MSFT and 75x SPCE. I plan to hold all my stocks longterm. Now that the market is low, should I increase my holdings in one of them or add other stocks like V, MA, AMD, DIS, NVDA ...? \n\nI also have World ETF‘s but would like to spice it up with shares.\n\nWhat do you think?\n\nThanks !",
        "subreddit": "stocks",
        "title": "Which long term stocks to buy right now ?",
        "url": "https://www.reddit.com/r/stocks/comments/f9ehda/which_long_term_stocks_to_buy_right_now/",
        "created": 1582683345.0
    },
    {
        "author": "foodstuff8",
        "created_utc": 1581437301,
        "id": "f2afre",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "MA approved to set up bank cards in China.",
        "url": "https://www.bloomberg.com/news/articles/2020-02-11/mastercard-wins-approval-to-enter-china-s-27-trillion-market",
        "created": 1581466101.0
    },
    {
        "author": "the-eldritch-creep",
        "created_utc": 1582042112,
        "id": "f5u15b",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "I’ve had shares of visa about 2 years but wondering if Mastercard may be a better choice long term? What are your thoughts?",
        "subreddit": "StockMarket",
        "title": "Mastercard or Visa ($MA or $V)",
        "url": "https://www.reddit.com/r/StockMarket/comments/f5u15b/mastercard_or_visa_ma_or_v/",
        "created": 1582070912.0
    },
    {
        "author": "Somadis",
        "created_utc": 1582954808,
        "id": "fb83bg",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "January 2020 set a record for the most CEO departures in the US in one month — 219 departures. Below are some of the most notable. Now is not a good time to find that dip.\n\n-DISNEY\n\n-MASTERCARD\n\n-LBRANDS\n\n-UBER EATS\n\n-HULU\n\n-MGM\n\n-IBM\n\n-LINKEDIN\n\n-LIQUIDNET\n\n-L BRANDS\n\n-Co-CEO of SALESFORCE\n\n-MADMEN\n\n-AURORA CANNABIS\n\n-CREDIT SUISSE\n\n-FASLY\n\n-TMOBILE\n\n-NESTLE\n\n-Mandy Ginsberg, the CEO of the company that oversees Tinder, Hinge, OKCupid, and Match, announced on January 28 that she's stepping down after 14 years, citing personal reasons.\n\n-Morgan Stanley's Deputy Chief Financial Officer Paul Wirth will retire after 15 years with the bank, according to a memo sent to employees seen by Reuters on Wednesday.\n\n-Barbara Novick, co-founder of investment giant BLACKROCK stepped down.",
        "subreddit": "wallstreetbets",
        "title": "January 2020 set a record for the most CEO departures in the US in one month",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fb83bg/january_2020_set_a_record_for_the_most_ceo/",
        "created": 1582983608.0
    },
    {
        "author": "Shaun8030",
        "created_utc": 1582676612,
        "id": "f9k9o6",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "Down 8 percent since last week about 40k. \nHolding QQQ, Vgt and Soxx ETFs \nAmzn , Visa , Mastercard , apple, MSFT, Disney , goog stocks . \nNot worried at all confident my holdings will bounce back sooner or later.",
        "subreddit": "stocks",
        "title": "How much are you down and what are you holding ?",
        "url": "https://www.reddit.com/r/stocks/comments/f9k9o6/how_much_are_you_down_and_what_are_you_holding/",
        "created": 1582705412.0
    },
    {
        "author": "Heygoogoo",
        "created_utc": 1581419750,
        "id": "f26yzi",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "You recently welcomed a child into your life and you had about 10k to drop on shares. What would you buy to hand over to them when they turn 21? Mix of ETFs or single stocks? Looking at time in the market,  rather than timing the market. Thinking about ENPH VOO MSFT MA and XLV",
        "subreddit": "stocks",
        "title": "Shares for a newborn",
        "url": "https://www.reddit.com/r/stocks/comments/f26yzi/shares_for_a_newborn/",
        "created": 1581448550.0
    },
    {
        "author": "photog47",
        "created_utc": 1582989324,
        "id": "fbdv6b",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Hi, first time posting on Reddit so if I screw this up please go easy. I made some investments yesterday in what I hope was an opportunity to get some quality stocks at a discount. I bought: UPS, MasterCard, Disney, Apple, Qualcomm and AMD. I also took a flyer on Inovio Pharmaceuticals with a small position. \n\nMy rationale is these are quality stocks (I know Inovio is speculative) with strong growth prospects, taken down in the past week by a market which I believe is overreacting to the potential economic impact of the coronavirus. \n\nMy investing horizon is the next 10 years, so if it takes time to go up I'm good. That said, I obviously don't want to lose money -- and I'm hoping to see significant appreciation over that time period. What do you think? Thanks for your input.",
        "subreddit": "investing",
        "title": "Jumped into the market yesterday - was I right?",
        "url": "https://www.reddit.com/r/investing/comments/fbdv6b/jumped_into_the_market_yesterday_was_i_right/",
        "created": 1583018124.0
    },
    {
        "author": "HITLERMAHJONG",
        "created_utc": 1582745151,
        "id": "f9ym7u",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "Stock: **Etsy (ETSY) - 50.77$**\n\nDirection: **Neutral** \n\n**Price Target:** **50$**\n\n**Type: Call Credit Spread, Iron Condor**\n\n**Fundamental:** Etsy is a transforming growth company that is slowly generating more and more profitability while growing revenue at a steady pace. Etsy is a niche market with a strong brand. This makes them a very attractive target for acquisition. Etsy has also been consistently profitable, though there were some margin and revenue contractions in the past. Q4 typically has always been good to Etsy. \n\n**Technical**: Priced above 50D MA, below 20 and 200D MA.  MACD shows bullish convergence. RSI shows around 50, coming up from neutral. Options sentiments are bearish in volume and bullish open interest, with 45P and 60C being the 2 most traded strikes. Implied movement of 14.7% or 7.50$.\n\n**Sentimental**: Given the online niche marketplace that Etsy resides in, seasonal gains are normal. EPS improvements are none, but revenue is slated to grow 30%+ YoY, which is a benchmark for growth companies in general. Guidance was sandbagged and this quarter may see a repeat performance in both top and bottom line beats.  **The new 12% fee will also give management a means to spike guidance, which is the primary bull case for this earnings. While there have been backlash and talks of leaving the platform, the niche market Etsy operates  in will be a great moat to force compliance.** \n\n**ROI : 23%**\n\n**Risk Level - 4 of 5, Very Risky**\n\n**Iron Condor should be 45$ and 60$ with a 2$ width. \\*\\* This is more advanced and will require management.** \n\n[Robinhood SS](https://imgur.com/a/SS8AkcM)",
        "subreddit": "wallstreetbets",
        "title": "Etsy (ETSY_ 2/26/2020 AMC - Capitalism &gt; Soul",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f9ym7u/etsy_etsy_2262020_amc_capitalism_soul/",
        "created": 1582773951.0
    },
    {
        "author": "traderlmd",
        "created_utc": 1582685433,
        "id": "f9mc9d",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "Say I wanted to know the returns of AAPL, MSFT, MCD, DIS, JPM, MA, KO, and 50 other stocks during the time frame 2/3/2015 - 2/3/2020. Is there anyway I could just list all of the stocks and then enter the time frame and instantly see the performance of all 57 of those stocks over the listed time frame, without having to look up the performance of each stock individually? Thanks.",
        "subreddit": "StockMarket",
        "title": "Is there a website/program that will display the returns of a group of specified stocks over a specified period of time?",
        "url": "https://www.reddit.com/r/StockMarket/comments/f9mc9d/is_there_a_websiteprogram_that_will_display_the/",
        "created": 1582714233.0
    },
    {
        "author": "verydarkhole",
        "created_utc": 1582138472,
        "id": "f6fdg7",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "I was thinking about doing it with $MA $V $MSFT Any suggestions. The lower the risk the better.",
        "subreddit": "options",
        "title": "I’m doing my first put credit spread",
        "url": "https://www.reddit.com/r/options/comments/f6fdg7/im_doing_my_first_put_credit_spread/",
        "created": 1582167272.0
    },
    {
        "author": "cdiamand",
        "created_utc": 1580828014,
        "id": "eyr5mu",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "7 Day chatter\n\n  \nPosts: 1,349  \nComments: 168,916  \nMentions:  \n  Autism: 1,290  \n  Coronavirus: 2,748  \n\n\nTSLA     4,860\n\nSPY       4,175\n\nAMD     2,116\n\nMSFT    2,112\n\nAAPL    1,815\n\nFXI\t     1,565\n\nAMZN  1,438\n\nSPCE    1,265\n\nYANG      987\n\nFB\t        861\n\nDIS\t        760\n\nBA\t        581\n\nDEAC\t521\n\nDOW\t432\n\nBABA\t422\n\nBYND\t422\n\nSBUX\t390\n\nGOOG\t383\n\nLK\t        383\n\nCDC\t379\n\nGOOGL\t352\n\nAIMT\t305\n\nGDP\t297\n\nGE\t        279\n\nQQQ\t279\n\nSNAP\t277\n\nAMP\t249\n\nCOLD\t241\n\nPTON\t239\n\nUNH\t239\n\nROKU\t216\n\nBUD\t205\n\nAGE\t        189\n\nJ\t        181\n\nUBER\t177\n\nASHR\t172\n\nSU\t        164 (Su bae fetish index)\n\nFORD\t163\n\nGLD\t152\n\nEV\t        148\n\nTQQQ\t148\n\nGM\t        147\n\nNS\t        142\n\nMA\t        141\n\nhttps://preview.redd.it/8e0nccwe7xe41.png?width=1630&amp;format=png&amp;auto=webp&amp;s=0e9c9d7540a1c75b85b7aead96fed12a2527d36c",
        "subreddit": "wallstreetbets",
        "title": "WARNING - Coronavirus surpasses mentions of Autism over last 7 days.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eyr5mu/warning_coronavirus_surpasses_mentions_of_autism/",
        "created": 1580856814.0
    },
    {
        "author": "zachyal",
        "created_utc": 1581352344,
        "id": "f1srwd",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "When you look at the trend of younger people trying to budget, less and less people are spending money from their traditional bank cards and spending from user friendly budgeting apps such as Monzo, Revolut, N26 and Venmo. ALL of these companies use MasterCard for their debit cards instead of Visa. Should this be considered when their forward pe is only 30 in comparison to 28 for Visa or is this not going to hugely affect earnings as I'm still not 100% on how much every day transactions contribute to their earnings. Thanks.",
        "subreddit": "stocks",
        "title": "Are MasterCard taking advantage of fintech better than Visa?",
        "url": "https://www.reddit.com/r/stocks/comments/f1srwd/are_mastercard_taking_advantage_of_fintech_better/",
        "created": 1581381144.0
    },
    {
        "author": "angrypatri0t",
        "created_utc": 1580657358,
        "id": "exq04h",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "I’ve held a dividend portfolio for about two years now that i’m ready to liquidate and throw into growth stocks. Instead of investing say 30% in Visa, 30% in apple is it more or less prudent to do 15/15 Visa/Mastercard, 15/15 Apple/microsoft, 15/15 Paypal/Square etc, or is the overlap nonsensical?",
        "subreddit": "stocks",
        "title": "Industry Overlap?",
        "url": "https://www.reddit.com/r/stocks/comments/exq04h/industry_overlap/",
        "created": 1580686158.0
    },
    {
        "author": "Madharder",
        "created_utc": 1582207532,
        "id": "f6tj5r",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "As someone with a bad credit score, so bad I can’t even get a credit card, I am left with few options to pay for stuff online. I don’t think I’m the only person in this mess and even with a “good economy” moving forward more and more people will get squeezed out of credit cards and have few choices of which PayPal is the best. Millennials also are the first generation to accept PayPal with open arms but despise larger financial companies like Visa and MasterCard. \n\nAfter a lot of reading PayPal has positioned themselves perfectly to take advantage well into the future. \n\nOnline sales are only going to grow and PayPal will definitely always get a piece of that and as sales grow that piece will grow. \n\nThe subset of people that can’t get a credit card will only grow and continue to be ignored by most all economic metrics that are released. Similar to how unemployment has nothing really to do with how many people are not working. That disconnect will be good for PayPal.",
        "subreddit": "StockMarket",
        "title": "Paypal is the best financial stock to own as credit card debt rises and credit scores deteriorate. All the people the unemployment data ignores (jobless but not technically unemployed) are hard to project but PayPal will be their go to over larger credit card companies for a long time to come.",
        "url": "https://www.reddit.com/r/StockMarket/comments/f6tj5r/paypal_is_the_best_financial_stock_to_own_as/",
        "created": 1582236332.0
    },
    {
        "author": "RayPowers",
        "created_utc": 1582409170,
        "id": "f7zp2d",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\n \n\n. Tier 2 options account at TDA, no short (naked) call positions &amp;  only short CSP's.\n\nI buy calls on stocks I don't own and leg into debit spreads. I can build spreads simultaneously inside TOS, but timing and legging in correctly yields lower debit cost. Also, just buy calls and try to sell for 25-50% profit. \n\nIf I create a debit call spread on stocks I own, exiting I  can first sell the long position in the spread as the stock covers the short position. Otherwise need to close both positions simultaneously, or short call first, which is why I don't trade wing spreads.\n\nDoes anyone build debit call spreads as the stock price drops, looking for a rebound up?  \n\nAre credit put spreads created simultaneously, better than bullish debit call spreads ?\n\n(own 300 MA, 400 NVDA, IBM, ABBV,  JNJ,  PFE,  no AMD presently but have call options in  the APR 17 monthly's.)",
        "subreddit": "options",
        "title": "Legging into call debit spreads &amp; short term gain strategies, no YOLO",
        "url": "https://www.reddit.com/r/options/comments/f7zp2d/legging_into_call_debit_spreads_short_term_gain/",
        "created": 1582437970.0
    },
    {
        "author": "jonyboy8755",
        "created_utc": 1580655781,
        "id": "expm5p",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "I’m looking at several companies Feb 7 strike with 10% in the money. I want that cushion because this week could see more downside with this damn virus. \n\nWhat I notice is that MA MasterCard  really stands out offering based on Friday’s close $1.84 premium. \nMuch more than Aapl , visa , MSFT , amzn are offering. \nWhat could account for such a disparity ?",
        "subreddit": "options",
        "title": "Such a rich ITM premium ?",
        "url": "https://www.reddit.com/r/options/comments/expm5p/such_a_rich_itm_premium/",
        "created": 1580684581.0
    },
    {
        "author": "Stealthinvesment",
        "created_utc": 1581011726,
        "id": "ezw1qk",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "I lost around 80% on Feb 21 300p. I guess no way i gonna back ma money back. It is best to sell for a loss? Is there any out? Should wait for 2 more trading days? Suggestion pls and thanks",
        "subreddit": "options",
        "title": "PUTs in SPY?",
        "url": "https://www.reddit.com/r/options/comments/ezw1qk/puts_in_spy/",
        "created": 1581040526.0
    },
    {
        "author": "RedStag86",
        "created_utc": 1581047387,
        "id": "f04rs1",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "I have a bit of Visa stock, and I’m also looking into MasterCard and Discover. They all offer dividends of varying amounts. My instinct is to go with Discover, because lower stock price = more shares = more dividend payouts. Is this the best way to go, or is my thinking too simplistic? I am admittedly a newb when it comes to dividend stocks.",
        "subreddit": "investing",
        "title": "What electronic payment stock has the best dividend structure?",
        "url": "https://www.reddit.com/r/investing/comments/f04rs1/what_electronic_payment_stock_has_the_best/",
        "created": 1581076187.0
    },
    {
        "author": "IContiSonoInutili",
        "created_utc": 1581354805,
        "id": "f1tdk8",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "TL;DR Live stream of [u/WBuffettJr](https://www.reddit.com/u/WBuffettJr/) [eating his underwear in 11 months](https://www.reddit.com/r/wallstreetbets/comments/dwv56v/barclays_makes_the_case_for_an_uber_stock_double/f7m8suu/)\n\n&amp;#x200B;\n\nLyft stock gains after Northcoast upgrades, says company could be M&amp;A target\n\nShares of Lyft Inc. LYFT, +6.81% are up nearly 7% in Monday trading after a Northcoast Research analyst upgraded the stock to buy from neutral. Northcoast's John Healy is encouraged by the latest results from Uber Technologies Inc. UBER, -0.41%, which suggest to him that \"competitive dynamics and unit economics of the 'ride business' are sound.\" His survey work also indicates that Lyft's \"competitive position\" is improving, meaning that the company could be picking up share. Finally, Healy floated the possibility that Lyft \"could be increasingly active from an M&amp;A standpoint\" as the race for autonomous-driving technologies heats up. Lyft is due to report quarterly results after Tuesday's closing bell. The stock has added 16% over the past month, as the S&amp;P 500 SPX, +0.31% has risen 2.4%.\n\n[https://www.marketwatch.com/story/lyft-stock-gains-after-northcoast-upgrades-says-company-could-be-ma-target-2020-02-10](https://www.marketwatch.com/story/lyft-stock-gains-after-northcoast-upgrades-says-company-could-be-ma-target-2020-02-10)",
        "subreddit": "wallstreetbets",
        "title": "Both Lyft and Uber up. \"competitive dynamics and unit economics of the 'ride business' are sound.\"",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f1tdk8/both_lyft_and_uber_up_competitive_dynamics_and/",
        "created": 1581383605.0
    },
    {
        "author": "jannafan13",
        "created_utc": 1582683397,
        "id": "f9lv1s",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "I’ve been reading a lot of talk about buying up on these during the dip. Thoughts?",
        "subreddit": "stocks",
        "title": "How do you feel about $V and $MA?",
        "url": "https://www.reddit.com/r/stocks/comments/f9lv1s/how_do_you_feel_about_v_and_ma/",
        "created": 1582712197.0
    },
    {
        "author": "verydarkhole",
        "created_utc": 1582092771,
        "id": "f66idu",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "So $MA is a fairly easy stock to play options with considering the graph and what it is. It’ll dip sure, but it goes back up. For a guy like me trying to build my small account up it seems smart to call spreads with this. An example I have is I buy a 2/28 $335 Call and sell 2/28 $340. In order to obtain max profit, MasterCard would just have to trade sideways or slightly up. So by 2/28 if $MA is still $340 I get $165. In order for me to lose my max loss $335, it would have to expire $336 or less. Which is unlikely. I’m just trying to get some insight on this. Because when I see people call spreads they usually buy ITM and sell OTM. To calculate this I used optionsprofitcalculator.com",
        "subreddit": "options",
        "title": "Small gains / high probability with $MA debit spreads",
        "url": "https://www.reddit.com/r/options/comments/f66idu/small_gains_high_probability_with_ma_debit_spreads/",
        "created": 1582121571.0
    },
    {
        "author": "darealrobertmcd",
        "created_utc": 1582865248,
        "id": "fapc4y",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "CNBC has been doing a Corona Virus 1 hour special for seemingly the past month. We've also known most of China is living in quarantine for the past month. The market had that information and yet we've rallied. Until this week of course.\n\nDoes anyone else get the sense that fundamentals such as valuations has a large part in driving this sell off? For example, I own $MA and it's my favorite stock. I will be the first to admit that the stock price has gone up too far and too quick recently. Even after all of this selling, it's only at it's December 2019 price. \n\nI am personally hoping $MA gets to the $260 levels before adding more. I guess the point of my post is I believe this correction is killing 2 birds with 1 stone. It's making the market respect the threat of the virus and it's also fundamentally keeping valuations in line. I personally think this correction is very healthy and it's something you want to see if you're like me and plan on being in the market for decades to come.",
        "subreddit": "investing",
        "title": "Anyone else feel like this is a fundamental market driven sell off more than anything?",
        "url": "https://www.reddit.com/r/investing/comments/fapc4y/anyone_else_feel_like_this_is_a_fundamental/",
        "created": 1582894048.0
    },
    {
        "author": "skooch98",
        "created_utc": 1580692742,
        "id": "exyx3h",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Big 100(MA) cross. If coronavirus fear keeps up BTC might breakout and bring small blockchains back into the picture with it. Thoughts?",
        "subreddit": "pennystocks",
        "title": "$HVTBF",
        "url": "https://www.reddit.com/r/pennystocks/comments/exyx3h/hvtbf/",
        "created": 1580721542.0
    },
    {
        "author": "badpauly",
        "created_utc": 1581549445,
        "id": "f3057v",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "\nThis is a list of the top 20 companies that experienced the largest change in insider shares in the last seven (7) days.\nThe SEC defines an insider as any officer, director or 10% shareholder. It is not illegal for these people to buy or sell their own shares.\nIn fact, since most of them get paid in stock options, it is expected. However, it is illegal for them to trade on inside information\nthat has not been made public. So for example if there are drug trial results that are bad and not public,\ninsiders cannot dump shares. That said, many people have observed that insiders - in general - seem to have a good\ntrack record at timing their purchases.  All trades that are marked as part of a 10b5 plan are excluded from this report.\n\n## Largest Insider Buying (Last 7 Days)\nCompany|Count|Shares Changed|Avg. Price|Value Change\n--------|-----:|-----:|-----:|--------:   \n[CRCM / Care.com, Inc.](https://fintel.io/n/us/crcm)|1|33,514,960|15|502,724,400 \n[ADMA / ADMA Biologics Inc](https://fintel.io/n/us/adma)|8|4,726,555|4|16,542,943 \n[CSPR / Casper Sleep Inc.](https://fintel.io/n/us/cspr)|2|1,266,666|12|15,199,992 \n[CAR / Avis Budget Group, Inc.](https://fintel.io/n/us/car)|1|430,169|35|14,999,993 \n[PKD / Parker Drilling Co.](https://fintel.io/n/us/pkd)|8|978,325|15|14,193,950 \n[OXLC / Oxford Lane Capital Corp.](https://fintel.io/n/us/oxlc)|2|403,000|17|10,027,960 \n[IFF / International Flavors &amp;amp; Fragrances, Inc](https://fintel.io/n/us/iff)|1|45,920|140|6,425,586 \n[EPD / Enterprise Products Partners L.P.](https://fintel.io/n/us/epd)|16|200,000|26|5,142,355 \n[NREF / NexPoint Real Estate Finance, Inc.](https://fintel.io/n/us/nref)|5|229,125|19|4,350,990 \n[SDGR / Schrodinger, Inc.](https://fintel.io/n/us/sdgr)|1|250,000|17|4,250,000 \n[BRPM / B. Riley Principal Merger Corp.](https://fintel.io/n/us/brpm)|5|411,352|10|4,198,197 \n[PPD / PPD, Inc.](https://fintel.io/n/us/ppd)|6|129,900|27|3,507,300 \n[PPR / Voya Prime Rate Trust](https://fintel.io/n/us/ppr)|3|610,510|5|3,148,802 \n[NGM / NGM BIOPHARMACEUTICALS INC](https://fintel.io/n/us/ngm)|4|179,600|16|2,866,416 \n[K / Kellogg Co.](https://fintel.io/n/us/k)|1|16,810|65|1,098,258 \n[ATYR / aTYR PHARMA INC](https://fintel.io/n/us/atyr)|1|254,000|4|1,079,500 \n[STC / Stewart Information Services Corp.](https://fintel.io/n/us/stc)|2|26,423|40|1,054,004 \n[ASH / Ashland Global Holdings, Inc.](https://fintel.io/n/us/ash)|1|12,900|78|1,010,715 \n[UFI / Unifi, Inc.](https://fintel.io/n/us/ufi)|3|36,000|23|823,440 \n[NGVT / Ingevity Corporation](https://fintel.io/n/us/ngvt)|4|9,790|65|633,327 \n[MCHX / Marchex, Inc.](https://fintel.io/n/us/mchx)|4|160,910|4|602,688 \n[PFGC / Performance Food Group Company](https://fintel.io/n/us/pfgc)|3|10,000|53|531,918 \n[CFR / Cullen/Frost Bankers, Inc.](https://fintel.io/n/us/cfr)|1|5,000|95|473,500 \n[FUND / Sprott Focus Trust, Inc.](https://fintel.io/n/us/fund)|2|47,180|7|347,558 \n[SONA / Southern National Bancorp of Virginia, Inc.](https://fintel.io/n/us/sona)|2|40,000|7|288,000 \n[MMLP / Martin Midstream Partners L.P.](https://fintel.io/n/us/mmlp)|1|100,000|2|250,410 \n[PFHD / Professional Holding Corp.](https://fintel.io/n/us/pfhd)|6|13,250|18|245,125 \n[TPL / Texas Pacific Land Trust](https://fintel.io/n/us/tpl)|4|298|791|234,589 \n[VLY / Valley National Bancorp](https://fintel.io/n/us/vly)|1|20,000|11|225,000 \n[ORLY / O&amp;#x27;Reilly Automotive, Inc.](https://fintel.io/n/us/orly)|1|500|391|195,383 \n[VBFC / Village Bank &amp;amp; Trust Financial Corp.](https://fintel.io/n/us/vbfc)|1|4,758|39|183,231 \n[IO / ION Geophysical Corp.](https://fintel.io/n/us/io)|1|50,000|4|182,920 \n[XOM / Exxon Mobil Corp.](https://fintel.io/n/us/xom)|6|2,858|60|171,083 \n[CET / Central Securities Corp.](https://fintel.io/n/us/cet)|2|5,000|33|165,988 \n[NWBI / Northwest Bancshares, Inc.](https://fintel.io/n/us/nwbi)|1|10,000|16|158,200 \n[GNTY / Guaranty Bancshares, Inc.](https://fintel.io/n/us/gnty)|8|5,000|31|156,494 \n[MTSC / MTS Systems Corp.](https://fintel.io/n/us/mtsc)|2|3,380|44|150,998 \n[PHD / Pioneer Floating Rate Trust](https://fintel.io/n/us/phd)|2|13,326|11|147,077 \n[EYEG / Eyegate Pharmaceuticals Inc.](https://fintel.io/n/us/eyeg)|4|23,000|3|140,460 \n[MNSB / MainStreet Bancshares, Inc.](https://fintel.io/n/us/mnsb)|12|6,000|23|136,256\n\n## Largest Insider Selling (Last 7 Days)\nCompany|Count|Shares Change|Avg. Price|Value Change\n--------|-----:|-----:|-----:|--------:  \n[CMG / Chipotle Mexican Grill, Inc.](https://fintel.io/n/us/cmg)|5|-220,056|862|-189,317,014 \n[MA / MasterCard Incorporated](https://fintel.io/n/us/ma)|4|-154,147|330|-50,857,409 \n[EL / Estee Lauder Companies, Inc. (THE)](https://fintel.io/n/us/el)|8|-133,629|208|-27,677,135 \n[MPWR / Monolithic Power Systems, Inc.](https://fintel.io/n/us/mpwr)|7|-150,186|184|-27,579,676 \n[CMCSK / Comcast Corporation](https://fintel.io/n/us/cmcsk)|1|-513,706|45|-22,931,322 \n[CERN / Cerner Corp.](https://fintel.io/n/us/cern)|3|-203,400|79|-16,097,956 \n[CACC / Credit Acceptance Corp.](https://fintel.io/n/us/cacc)|19|-35,652|445|-15,872,369 \n[MDC / M.D.C. Holdings, Inc.](https://fintel.io/n/us/mdc)|5|-308,744|44|-13,734,816 \n[CL / Colgate-Palmolive Co.](https://fintel.io/n/us/cl)|6|-172,754|76|-13,175,688 \n[TDG / Transdigm Group, Inc.](https://fintel.io/n/us/tdg)|9|-17,083|637|-10,893,733 \n[GL / Globe Life Inc.](https://fintel.io/n/us/gl)|11|-97,000|108|-10,510,321 \n[SWT / Stanley Black &amp;amp; Decker, Inc.](https://fintel.io/n/us/swt)|1|-62,261|166|-10,334,299 \n[MTH / Meritage Homes Corp.](https://fintel.io/n/us/mth)|2|-140,000|73|-10,143,244 \n[DLB / Dolby Laboratories, Inc.](https://fintel.io/n/us/dlb)|8|-132,435|72|-9,491,990 \n[APO / Apollo Global Management LLC](https://fintel.io/n/us/apo)|4|-191,620|47|-9,054,191 \n[POWI / Power Integrations, Inc.](https://fintel.io/n/us/powi)|21|-84,724|105|-8,938,605 \n[FMC / FMC Corp.](https://fintel.io/n/us/fmc)|4|-82,534|105|-8,651,876 \n[CCMP / Cabot Microelectronics Corp.](https://fintel.io/n/us/ccmp)|7|-53,000|161|-8,516,838 \n[TROW / Price (T.) Rowe Group, Inc.](https://fintel.io/n/us/trow)|4|-56,998|138|-7,837,772 \n[AMD / Advanced Micro Devices, Inc.](https://fintel.io/n/us/amd)|1|-153,984|51|-7,823,927 \n[DHR / Danaher Corp.](https://fintel.io/n/us/dhr)|4|-47,239|163|-7,685,607 \n[SAIA / Saia, Inc.](https://fintel.io/n/us/saia)|8|-78,617|97|-7,652,050 \n[HES / Hess Corp.](https://fintel.io/n/us/hes)|8|-129,037|58|-7,442,854 \n[NVR / NVR, Inc.](https://fintel.io/n/us/nvr)|2|-1,878|3,958|-7,421,421 \n[K / Kellogg Co.](https://fintel.io/n/us/k)|1|-100,000|64|-6,397,610 \n[UBER / Uber Technologies, Inc.](https://fintel.io/n/us/uber)|1|-170,000|37|-6,295,440 \n[MRKT / Markit Ltd.](https://fintel.io/n/us/mrkt)|2|-73,400|81|-5,905,558 \n[GGG / Graco Inc.](https://fintel.io/n/us/ggg)|3|-103,417|55|-5,715,333 \n[GILD / Gilead Sciences, Inc.](https://fintel.io/n/us/gild)|5|-70,148|69|-4,790,662  \n[LSTR / Landstar System, Inc.](https://fintel.io/n/us/lstr)|2|-39,335|114|-4,474,618 \n[VRSK / Verisk Analytics, Inc.](https://fintel.io/n/us/vrsk)|2|-26,250|169|-4,434,515 \n[TTEK / Tetra Tech, Inc.](https://fintel.io/n/us/ttek)|2|-47,814|92|-4,418,660 \n[GSHD / Goosehead Insurance, Inc.](https://fintel.io/n/us/gshd)|12|-72,828|54|-3,971,234 \n[FICO / Fair Isaac Corp.](https://fintel.io/n/us/fico)|3|-8,337|416|-3,463,855 \n[USNA / USANA Health Sciences, Inc.](https://fintel.io/n/us/usna)|17|-41,565|80|-3,348,314 \n[AJG / Gallagher (ARTHUR J.) &amp;amp; Co.](https://fintel.io/n/us/ajg)|2|-25,338|105|-2,675,689 \n[THG / Hanover Insurance Group, Inc. (The)](https://fintel.io/n/us/thg)|6|-17,620|139|-2,445,583 \n[BLK / BlackRock, Inc.](https://fintel.io/n/us/blk)|3|-4,350|546|-2,364,310 \n[ENTG / Entegris, Inc.](https://fintel.io/n/us/entg)|4|-42,013|57|-2,356,163 \n[CW / Curtiss-Wright Corp.](https://fintel.io/n/us/cw)|6|-14,879|148|-2,200,314\n\n*Count* column is number of transactions.\n\nSource: [Fintel.io/insiders](https://fintel.io/insiders)",
        "subreddit": "StockMarket",
        "title": "Significant Insider Trading Activity (Last 7 Days)",
        "url": "https://www.reddit.com/r/StockMarket/comments/f3057v/significant_insider_trading_activity_last_7_days/",
        "created": 1581578245.0
    },
    {
        "author": "pallerana",
        "created_utc": 1582906164,
        "id": "fawz1e",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": " I have 40k and am planning to invest on AAPL,TSLA,V,MA,NVDA,MSFT,GOOG,ROKU,ADBE and am planning to hold these for a short term (&lt; 12 months) and will sell these once the portfolio hit 15% (may be 20%) profit, I couldn't decide how much amount I need to put on each of these stocks, also please advice me to pick any other good stocks to buy for the short term also please provide your feedback on my stocks choice for the short term and help me avoid any of them if they are not good for the short term.",
        "subreddit": "StockMarket",
        "title": "Stocks to buy for Short term during the dip",
        "url": "https://www.reddit.com/r/StockMarket/comments/fawz1e/stocks_to_buy_for_short_term_during_the_dip/",
        "created": 1582934964.0
    },
    {
        "author": "wincysss1",
        "created_utc": 1581096473,
        "id": "f0dpnj",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "I'm looking to add one of these to my portfolio, never really followed either that much though. Any opinions on which one is better? Projections etc?",
        "subreddit": "stocks",
        "title": "Visa Vs Mastercard",
        "url": "https://www.reddit.com/r/stocks/comments/f0dpnj/visa_vs_mastercard/",
        "created": 1581125273.0
    },
    {
        "author": "BodyBuiltbyTacohell",
        "created_utc": 1582303988,
        "id": "f7dwul",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "I'm looking to find a broker that will allow me to day trade with a cash account without getting PDT flagged, but I also would like there to be same day ACH. Robinhood cost me a few hundred dollars today and I'm convinced theyre 🌈🐻. I don't want to have to wait T+2 to see the funds cleared so I can trade again. I don't care if it takes 3 weeks to withdraw my tendies from that account. Are there any brokers that currently do this?",
        "subreddit": "wallstreetbets",
        "title": "Robinhood can suck ma nuts. Need new cash account broker.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f7dwul/robinhood_can_suck_ma_nuts_need_new_cash_account/",
        "created": 1582332788.0
    },
    {
        "author": "Fall0utFighter",
        "created_utc": 1582083558,
        "id": "f64myl",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "I would like to know the best way to make a living trading stocks with only $1000 to start with. Can I just look up a list of the best high growth stocks to invest in and do some short term trading of those companies? I've heard Apple, Microsoft and Mastercard are good options.\n\nIf that strategy won't generate enough to make a living what other techniques can I use? I want high risk high reward.\n\nAny book recommendations?",
        "subreddit": "investing",
        "title": "How to turn a thousand dollars into a million trading stocks?",
        "url": "https://www.reddit.com/r/investing/comments/f64myl/how_to_turn_a_thousand_dollars_into_a_million/",
        "created": 1582112358.0
    },
    {
        "author": "robery526",
        "created_utc": 1580605684,
        "id": "exg52z",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Recently started to invest into tech/credit services companies and was looking at V and MA but never turned to much attention to AXP. Anyone heavily informed in AXP's stock? Statistics look pretty good but why is there no specifics in their balance sheet? What is your take on AXP? Thanks, from a new investor.",
        "subreddit": "stocks",
        "title": "AXP",
        "url": "https://www.reddit.com/r/stocks/comments/exg52z/axp/",
        "created": 1580634484.0
    },
    {
        "author": "greenteamochi8",
        "created_utc": 1580988745,
        "id": "ezr3gh",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Hi Everyone!  Would you be able to review my notes below regarding my current (and past trades) to see whether my reasoning makes sense ?  I started trading options two weeks ago.  Regarding education, I've read Charting &amp; Technical Analysis by Fred McAllen, watched YouTube videos from Project Options (and some others), and am currently reading through info at the Options Playbook website.  \n\n**CURRENT TRADE:**  \n\nPurchased ARKK - 10 contracts at 0.35 for the 6/19 call.  \n\nThe total spent was $350.  I wrote the excerpt below in my trading journal prior to market open yesterday (Wednesday, February 5th):\n\n\\-- START OF TRADING JOURNAL--\n\n*\"Looking at the chart, it looks like ARKK broke through resistance after ranging in the channel between $38 - $48 for about a year. It has been on an uptrend since and is currently at $56.45 which is above the 50 and 100 MA on the weekly chart. The price gapped up yesterday from $53.99 to $55.72. I think that it is likely this gap will be filled.*\n\n*How will it affect the option price? Perhaps the option will drop in value and my order will be executed. Does this call option have much value? The stock has four and a half months to make its way toward $65. If there is an overall downtrend in the market, then it is likely this stock will go down with it. If the market trend continues, then I do think that it has a possibility of making it toward the $65 which will (hopefully) increase the value of the contract.*\n\n*I decided to purchase 10 contracts this time so that I can have a few to recover my initial costs, a few to take profit, and a few to ride closer toward the expiration date.\"*\n\n\\--END OF TRADING JOURNAL--\n\nSoon after the market opened, my order executed.  I then decided to go ahead and place a sell order for five contracts at 0.70 (for a total of $350) in order to recover my initial investment.  My reasoning was that this would leave me with five contracts for \"free.\"  I would continue to monitor the options over the next few days/weeks/months.  Regarding when to take profit on these remaining five contracts, what are your thoughts?  Typically, I would think it would be prudent to take profit at 10-15% above my purchase price, but the following trades below have me wondering...\n\n**PAST TRADES**\n\nPlease see the notes from my trade journal below.  Strange timing...I purchased my first options right before the TSLA run-up; however, I did **NOT** make those massive gains like on WSB.  Lol.  If this were a regular stock, I think that I did well though and that the reasoning behind my moves made sense.  I'd love to hear your thoughts as well.  \n\n***TSLA 2/21 $1,000 Calls***\n\n* *Tuesday (1/21/20) - My first option!  I purchased five contracts at 0.51 each for a total of $255. I did not have a trading plan. I'd been doing some reading and wanted to jump in to get my feet wet.  I told myself that I was ready to lose this $255 if things didn’t pan out. I was happily surprised to see the option value increase by $60 at EOD.*\n* *Wednesday (1/22/20) - The option price began to sky rocket. I sold one option on the way up at $2.57 in order to recover my initial investment. This made sense to me. That way, I still have my original investment and everything else would be a bonus. I was planning on letting the other four contracts ride (for an unspecified amount of time) to see what would happen. Later in the day, I decided to sell one contract at $3.20 (over 600% increase) in order to take some profit. It made sense to take profit here because as a trader, if you’re aggressively trying to grow your portfolio, you would take profits around 20-25%. The fact that my investment 6x overnight made it seem more than reasonable to take a little profit as a reward. I still had three contracts remaining.*\n* *Thursday (1/23/20) - The price went from $1.91 to $2.88 down to $1.22 and closed at $1.42. I felt good about my decision to hang onto my three options. I wanted to test out three things: (1) What would happen prior to earnings release. (2) What would happen after earnings release? (3) What would happen in February (closer to expiration date)*\n* *Friday (1/24/20) - I decided to sell my remaining three contracts to lock in profits. There was a lot of uncertainty in the market, so I thought it would be best to stay out. I could still watch what’s going on with this call from the sidelines. I sold my remaining three contracts at $1.15 for a total of $345. In total, my portfolio grew from $1,000 to $1,668! I was happy with this decision.*\n\n*Update: As of today (2/05/20), if I had stuck to my original plan of keeping my remaining three options, I would be in a very good financial position. The last time I checked this morning, the call was worth $61.73 each. :/ Why did I not stick to my plan? I’d already recovered my initial investment as well as taken a little profit. It was because I thought it would be foolish to not take profit while I still had the opportunity.*\n\n***TSLA*** ***2/21 $1180 Calls***\n\n* *Monday (1/27/20) - I purchased five contracts at 0.41 each for a total of $205. I calculated at 15% increase and sold at 0.47. I made $30. :) I thought this was a good strategy for a day trade. I increased my invested capital by 15%.*\n* *Tuesday (1/28/20) - I put in an order for five contracts at 0.41 again so that I could repeat the trade. I was okay if the order didn’t fill. I decided to spend the bulk of the day studying. My trade executed, but by EOD, I was down $45. I was a little sad. I decided to hold and wait for the TSLA earnings report to see what would happen. That would happen after close the next day.*\n* *Wednesday (1/29/20) - I ended the day with a $105 unrealized loss. I learned something new. Option prices (at least those far OTM) do not necessarily correlate with the underlying asset.*\n* *Thursday (1/30/20) - TSLA opened around 632-ish. I thought that the GAP between $594.50 (the ATH on 1/22/20) would be closed soon.* \n* *Friday (1/31/20) - Price fell to 0.05/share. I decided to hold it over the weekend. At this point, I had a $180 unrealized loss. I was ready to lose the entire $205 if things went south. I wanted to keep it and see what would happen over the weekend. (Update: 2/04/20) Looking back, if I was ready to take the entire loss anyway, a good strategy would have been to double down on my position - buy an additional five contracts for a total of $25. I would only be risking an additional $25 but would double my position. The reason I didn’t think much about average down was because sometimes, it doesn’t make sense to add to a losing position…especially since the option could be expire worthless. This was a small risk though, so it would have been a good one to take!*\n* *Monday (2/03/20) - The option price started going up again! TSLA was continuing its uptrend. I thought it would be prudent to sell two contracts at 0.55 in order to recover some of my initial investment.  I decided to sell one contract at 0.75 and then my remaining contracts at 0.85 (after the price had already hit 0.93 and started turning back around. I netted $150 for these five contracts which means I made 73% on my invested capital. This seemed like a great move and I was happy with my trade!  Later in the day, the contract closed around $3. I could have made more, but it made sense to me to take profit.*\n* *Tuesday (2/04/20) - I regret selling all of my positions! My portfolio would be over $45K right now had I held both of the calls I purchased (the 2/21 $1000 that I got for 0.51 and the 2/21 $1180 that I got for 0.41). UGH!  I am having a difficult time remaining emotionally neutral about this situation. On one hand, I increased my trading portfolio by 84% in two weeks which is amazing! On the other hand, I missed out on A LOT of life changing gains. I sold the 2/21 $1180s for $355 yesterday. Today, they are worth $16K. I sold the 2/21 $1000s for $666. Today they are worth $31K.*\n\n***What have I learned and what is my next best move?***\n\n\\---END OF TRADING JOURNAL---\n\nThanks for reading this far.  So guys, what do you think?  Did I make reasonable moves based on the information I had on hand at the time?  What would you have done differently?  What did I do well (and should continue to do)?  I had a good cry on Tuesday already and am ready to put on my big girl pants and move forward.  =)",
        "subreddit": "options",
        "title": "Trading Plan - Feedback Appreciated",
        "url": "https://www.reddit.com/r/options/comments/ezr3gh/trading_plan_feedback_appreciated/",
        "created": 1581017545.0
    },
    {
        "author": "wincysss1",
        "created_utc": 1582980968,
        "id": "fbc54z",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Hi, I a fairly new to investing and stupidly (or more naively) decided to invest in some blue chip stocks such as MSFT, AMZN, MA and V, just before the dreaded coronavirus hit. I decided not to take the money out at the time as these were investments for the mid to long term. My worry now is the sentiment in news seems to have changed from just a 'coronavirus' problem to something far deeper. Being talks that interest rate are set to be cut further and we are heading into a recession territory.  Originally I had in mind that the markets would just come back up in possibly 4-7 months but my fears are now we could be on the turn of something far worse and longer. \n\nSo it would be good to get some professional advice and opinions on this if there is any truth in this and if it is now worth (before it gets even worse), taking my money out of these investments?",
        "subreddit": "stocks",
        "title": "Mid to long term investment worry / query",
        "url": "https://www.reddit.com/r/stocks/comments/fbc54z/mid_to_long_term_investment_worry_query/",
        "created": 1583009768.0
    },
    {
        "author": "Sten_Duncan2",
        "created_utc": 1582947643,
        "id": "fb6q1e",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "I am on a burner account, and will happily provide mods with proof of my position and trades.\n\nThe belief that the falling market indices of this past week are a correction, or a dip that will settle after COVID-19 runs it's course is wrong. You should safeguard your assets in preparation for significant deflationary pressures. Let me take you through how I came to this position.\n\nI work for the government, detecting fraud, waste, and malfeasance in the non-financial realm. However, I also enjoy putting my MA in Economics to work researching and picking investments. Over the past few months, I started seeing activity by corporations that looked more and more like the fraud schemes I encountered at my day job.\n\nCompanies were performing stock buybacks at unprecedented levels, and they were taking on massive debt loads to finance it.  Now, according to modern corporate financial thinking, stock buy backs can be a meaningful way to return value to shareholders, and if a company truly believes it is undervalued in the market, than taking out loans to buy it's own stock is possibly a sound financial move. However, the largest, highest-valued companies in the S&amp;P500 continued to buy their own stock, even as their PE ratios climbed higher and higher. \n\nLets take AAPL for instance. Since 2010, Apple has executed 318 B$ in share buy backs, while its total market cap sits at 1400 B$. That means that 29% of AAPL's market cap is effectively it's own money. Concurrently, AAPL's debt to equity has risen to a frightening 1.04. Most nations are never allowed to reach that level, and they literally print their own money. Meanwhile, the market gave AAPL a PE of 26--astronomically high for such an established company.\n\nJNJ played the same game, pumping their own shares with corporate debt to the tune of 18% of their market cap, and the market inexplicable rewards them with a 26 PE, despite JNJ taking on 19 B$ in corporate debt since 2010. Why on earth would a company take out such massive debt, just to pump its own stock? And more importantly, why would the market award such recklessness with a highly favorable PE? \n\nIn fact, of the top 20 S&amp;P500 companies, seven have pumped their market cap over 10% while taking on debt and still have PE over 20. The average PE for the entire S&amp;P500 is 22, a level it hasn't reached sustainably since the dot-com bubble burst in 2000. \n\nWhy, you ask, are companies engaging in this behavior, if it doesn't make economic sense? \n\nThe answer is passive investing. \n\nSee, most passive funds track weighted indices. That means that stocks with larger market caps get a greater share of the passive money pie. In September 2019, passive funds overtook active funds as the dominant allocation of money in the market, and companies no longer have an overriding incentive to be well-managed. Instead the dominant paradigm is market cap at all costs. \n\nOf course, this creates a race to the top, as companies take out debt and buy their own shares, simply to avoid getting left behind in the race for market cap. Since their companies need to continually service ever-growing debt piles, they are increasingly ill-equipped to weather market shocks. When the economy is strong, companies need to shore themselves up so that they can weather the next downturn. Instead, these companies made themselves ever more fragile. Now a few-week slowdown in a Chinese city no one in the US ever heard of is making investors realize just how precarious these companies' positions are. \n\nNow, I hope that the market just enters a recession, loses 20-25% of its value, sheds a few jobs and recovers over time. However, the massive consumer debt bubble may also pop as people start to lose jobs. I have a lot of professional, white collar friends with massive credit card debt. Nationally, personal debt is at an unprecedented high. What happens when people who already can barely service their debt lose their jobs? They default. Visa, Mastercard, and other creditors miss their earnings, and consumers don't buy iPhones--or anything really--since the consumers' lines of credit dried up.\n\nWhat keeps me up at night, is that countries with high inequality are inherently fragile. See, when income is more evenly distributed, most folks fall from middle income to lower income. They still eat, they still have a place to live, they can still take their kid to the doctor. A small number of wealthy take some losses, and maybe downgrade their lifestyle, and an equally small number go from barely hanging on to food or housing insecure. \n\nIn a highly unequal country, however, the wealthy don't meaningfully experience an economic downturns, but the vast majority of people who are barely holding on are going to go into economic freefall. When you are hungry, or don't know where your kid will sleep at night, you start to look around, and the other people in your country don't seem like friends. Those people, especially the ones not like you, start to look like enemies. You have so little, and they want to take what's yours. And you will do anything to protect it.\n\n When you multiply that feeling by the hundreds of millions....I'm not smart enough to know where it ends. But I don't think it will be good. \n\nTake my advice and do with it what you will. I'm keeping my short position until the market falls about 20-25% off its high. Then I'm hunkering down and waiting this out.\n\n-Sten",
        "subreddit": "investing",
        "title": "Three weeks ago I shorted the market and am up over 40%. Everything I can't afford to lose moved to BND. Listen to me when I say the bloodbath will continue.",
        "url": "https://www.reddit.com/r/investing/comments/fb6q1e/three_weeks_ago_i_shorted_the_market_and_am_up/",
        "created": 1582976443.0
    },
    {
        "author": "aliman21",
        "created_utc": 1581437837,
        "id": "f2akeh",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Why does $V and $MA have a 50% net margin but $AXP has only around 16%?",
        "subreddit": "investing",
        "title": "Net margins",
        "url": "https://www.reddit.com/r/investing/comments/f2akeh/net_margins/",
        "created": 1581466637.0
    },
    {
        "author": "Sandvicheater",
        "created_utc": 1581458932,
        "id": "f2g1it",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Earnings beat and I'm getting ducked in the azz AH.\n\nWtf market, you like UBERs shit but not Lyft?!? Who else is getting blown out right now??",
        "subreddit": "wallstreetbets",
        "title": "$LYFT ER dicky ma booty",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f2g1it/lyft_er_dicky_ma_booty/",
        "created": 1581487732.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1581427479,
        "id": "f289kq",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/StockMarket sub! Welcome to Tuesday. Here is your pre-market news this AM-\n\n*****\n\n#(**[CLICK HERE TO VIEW THE FULL SOURCE!](https://www.stockaholics.net/threads/todays-pre-market-news-tuesday-february-11th-2020.9458/)**)\n\n#[Today's Top Headlines for Tuesday, February 11th, 2020](https://www.cnbc.com/2020/02/11/dow-to-rise-powell-testifies-coronavirus-death-toll-passes-1000.html)\n\n* U.S. stock futures point to a higher open, following record closes for the S&amp;P 500 and Nasdaq on Monday, as investors are encouraged by a slowdown in the number of new coronavirus cases. The Dow, S&amp;P 500 and Nasdaq are higher in five of the past six sessions, and four S&amp;P sectors are at record highs: Consumer Discretionary, Consumer Staples, Tech and Real Estate. (CNBC)\n* Ray Dalio thinks the coronavirus’ hit to global markets is probably exaggerated (CNBC)\n* The director-general of the World Health Organization reportedly warned that while almost all of the confirmed coronavirus cases are in China, the outbreak constitutes a “very grave threat” for the rest of the world. China’s National Health Commission reported that a total of 42,638 cases had been confirmed in the country, with 1,016 deaths. (CNBC)\n* Nearly 200 evacuees to leave cornavirus quarantine in US (AP)\n* Fed Chairman Jerome Powell testifies today and tomorrow in the first of his twice-a-year economic updates to Congress, with investors listening for commentary on any coronavirus impact on the U.S. economy. On today’s economic calendar, the government is out with JOLTS, the Job Openings and Labor Turnover Survey, for December at 10 a.m. ET. (CNBC)\n* AutoNation (AN), Hasbro (HAS), Hilton Worldwide (HLT), Tegna (TGNA) and Under Armour (UAA) are out with quarterly earnings this morning, while Denny’s (DENN), Groupon (GRPN), Lyft (LYFT), and Western Union (WU) are among the companies issuing quarterly numbers after the bell.\n* A U.S. district judge is expected to rule in favor of allowing Sprint (S) and T-Mobile (TMUS) to merge over the objections of a group of state attorneys general, Reuters reported. It’s a decision that’s supposed to be made today. Shares of Sprint surged 69% in Monday’s after-hours trade and T-Mobile stock rose 8%. (CNBC)\n* The Democratic presidential race is deeply unsettled heading into today’s New Hampshire primary. It may be up to the state to put some structure around the chaotic contest, with Iowa being unable to declare a clear winner. New Hampshire’s secretary of state has predicted a healthy 292,000 Democratic voters, which would be about 40,000 more than voted in 2016. (AP)\n* Small New Hampshire town of Dixville Notch votes for Bloomberg in primary (USA Today)\n* Pete Buttigieg sees surge in support from business execs after his strong showing in Iowa (CNBC)\n* Bernie Sanders hopes New Hampshire primary will tighten his early grip on 2020 race (CNBC)\n* Mike Bloomberg could ‘handily beat’ Trump in 2020, says ex-Trump aide Anthony Scaramucci (CNBC)\n* Amazon (AMZN) is seeking to question President Donald Trump, Defense Secretary Mark Esper and former Defense Secretary James Mattis over a $10 billion Pentagon cloud contract awarded to Microsoft (MSFT). Amazon’s cloud computing arm said it’s looking to depose seven “individuals who were instrumental” in the JEDI source selection. (CNBC)\n* The Justice Department indicted four members of China’s military for the cyberattack against credit ratings agency Equifax in 2017. The incident led to the loss of personal information belonging to 145 million people, mostly in the U.S. but also in Canada and Europe. (CNBC)\n* The FAA is narrowing the issues needed before it can conduct a certification test flight on the grounded Boeing (BA) 737 Max, but will not commit to a timetable for lifting a flight ban. The certification flight to be carried out by FAA pilots “is not scheduled yet because we still have a few issues to resolve, but we continue to narrow the issues,” FAA Administrator Steve Dickson said. (Reuters)\n* DOT watchdog probes FAA’s pilot training after 2 deadly crashes of Boeing 737 Max (CNBC)\n* Google (GOOGL) human resources chief Eileen Naughton is stepping down from her role as tensions grown between employees and management. Naughton, who has held various roles at the company since 2006, has led the company’s human resources department as the vice president of people operations since 2016. (CNBC)\n* Shares of Slack (WORK) fell over 7% in the premarket after it filed an 8-K on Monday downplaying a news report that sent its stock surging more than 15%. The statement was issued in response to an earlier report that a new deal had been struck that made IBM Slack’s largest customer, which had sent the stock surging in the regular session Monday. (CNBC)\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](http://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://finviz.com/publish/021120/sec_all_075437166.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/wteeBZT.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/OeoDGfL.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/yKvMhID.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/SNqq5HC.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/8e4snrC.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/azlFbrt.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/YNP3Pq5.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/Vv5WIT7.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/vpdF9tz.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/SvyrDnj.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/CBl5AFZ.png)**)\n\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/G5AF0Cr.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #1!](https://i.imgur.com/22zaDPV.png)**)\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #2!](https://i.imgur.com/KMtzoBJ.png)**)\n\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS:\n\n* MYO\n* FB\n* UAA\n* UBS\n* MA\n* MSFT\n* NVDA\n* WORK\n* HAS\n* TMUS\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2020/02/11/stocks-making-the-biggest-moves-in-the-premarket-hasbro-under-armour-slack-sprint-more.html)**)\n\n*****\n\n&gt; **Under Armour (UAA)** – The athletic apparel maker reported an overall loss for the quarter, and warned of a negative sale impact from the coronavirus. The company also said it is assessing a possible 2020 restructuring.\n\n&gt; #**STOCK SYMBOL:** UAA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=UAA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/UAA)**)\n\n*****\n\n&gt; **AutoNation (AN)** – The nation’s largest car retailer beat estimates on both the top and bottom lines for the fourth quarter, with results boosted by higher demand for pre-owned vehicles.\n\n&gt; #**STOCK SYMBOL:** AN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AN)**)\n\n*****\n\n&gt; **Hasbro (HAS)** – The toymaker reported a quarterly profit of $1.24 per share, well above the consensus estimate of 91 cents a share. Sales fell short of Street forecasts, however, but Hasbro’s bottom line got a boost from toys related to Disney’s “Frozen 2” and “Star Wars” movies.\n\n&gt; #**STOCK SYMBOL:** HAS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=HAS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/HAS)**)\n\n*****\n\n&gt; **Hilton Worldwide (HLT)** – The hotel operator earned $1.00 per share for the fourth quarter, 4 cents a share above estimates. Revenue also beat forecasts. Hilton’s 2020 earnings outlook was below analysts’ forecasts, however, and the company said the outlook does not include possible coronavirus impact.\n\n&gt; #**STOCK SYMBOL:** HLT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=HLT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/HLT)**)\n\n*****\n\n&gt; **T-Mobile US (TMUS), Sprint (S)** – The mobile service providers are expected to win the approval of a federal judge for their $26 billion merger deal today, according to sources. That would end an effort by state attorneys general to block the combination of the third- and fourth-largest wireless carriers.\n\n&gt; #**STOCK SYMBOL:** TMUS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TMUS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TMUS)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** S\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=S&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/S)**)\n\n*****\n\n&gt; **Slack Technologies (WORK)** – Slack said in a Securities and Exchange Commission filing that IBM (IBM) had been the messaging platform’s largest customer for several years and had expanded its use of Slack over that time. The statement was issued in response to an earlier report that a new deal had been struck that made IBM Slack’s largest customer, which had sent the stock surging in the regular session Monday.\n\n&gt; #**STOCK SYMBOL:** WORK\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WORK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WORK)**)\n\n*****\n\n&gt; **Callaway Golf (ELY) **– Callaway lost 26 cents per share for its fourth quarter, wider than the 23 cents a share loss that analysts were expecting. The golf club maker reported better-than-expected revenue but said the coronavirus will have a negative impact in terms of both sales in Asia and on supplies.\n\n&gt; #**STOCK SYMBOL:** ELY\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ELY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ELY)**)\n\n*****\n\n&gt; **ViacomCBS (VIACA)** – ViacomCBS unit CBS Sports has struck a deal with sports betting company William Hill, allowing William Hill to seek new customers among the CBS Sports audience. William Hill would seek to get CBS Sports users to download its app and deposit money in betting accounts.\n\n&gt; #**STOCK SYMBOL:** VIAC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=VIAC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/VIAC)**)\n\n*****\n\n&gt; **XPO Logistics (XPO)** – XPO beat estimates by 10 cents a share, with adjusted quarterly earnings of $1.12 per share. The transportation and delivery company’s revenue came fall below analysts’ forecasts, however. XPO also announced the appointment of a new chief financial officer.\n\n&gt; #**STOCK SYMBOL:** XPO\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=XPO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/XPO)**)\n\n*****\n\n&gt; **Boston Beer (SAM)** – Boston Beer was upgraded to “outperform” from “neutral” at Credit Suisse, which points to the company’s increasing involvement in the hard seltzer market. Credit Suisse also increased its price target on the beer brewer’s stock to $525 per share from $400.\n\n*****\n\n&gt; #**STOCK SYMBOL:** SAM\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SAM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SAM)**)\n\n*****\n\n#**FULL DISCLOSURE:**\n\n&gt; /u/bigbear0083 has no positions in any stocks mentioned. Reddit, moderators, and the author do not advise making investment decisions based on discussion in these posts. Analysis is not subject to validation and users take action at their own risk. /u/bigbear0083 is an admin at the financial forums [Stockaholics.net](http://www.stockaholics.net/) where this content was originally posted.\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/StockMarket?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Tuesday, February 11th, 2020! :)**",
        "subreddit": "StockMarket",
        "title": "Today's Pre-Market News [Tuesday, February 11th, 2020]",
        "url": "https://www.reddit.com/r/StockMarket/comments/f289kq/todays_premarket_news_tuesday_february_11th_2020/",
        "created": 1581456279.0
    },
    {
        "author": "HiYoByeK",
        "created_utc": 1581749355,
        "id": "f45vcx",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "How would ETFs hold up vs Individual large company stocks?\n\nNot just in the downturn, but recovery as well. Is it safe to assume an ETF would be hit harder waiting for the “lower” companies in the portfolio to recover? Or is this a wrong assessment. \n\nI run USD stocks in my unregistered (MSFT, AAPL, NVDA, AMD, V, MA. ETF in my RRSP (VGRO) and canadian stocks in my TFSA (BAM.A, RY, SHOP) still working on this portion of my investments. \n\nI feel my spread may be odd. Just looking to gain some opinions and knowledge.",
        "subreddit": "CanadianInvestor",
        "title": "ETF? &amp; My portfolio",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/f45vcx/etf_my_portfolio/",
        "created": 1581778155.0
    },
    {
        "author": "pallerana",
        "created_utc": 1582906064,
        "id": "fawy3b",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "I have 40k and am planning to invest on AAPL,TSLA,V,MA,NVDA,MSFT,GOOG,ROKU,ADBE and am planning to hold these for a short term (&lt; 12 months) and will sell these once the portfolio hit 15% (may be 20%) profit, I couldn't decide how much amount I need to put on each of these stocks, also please advice me to pick any other good stocks to buy for the short term also please provide your feedback on my stocks choice for the short term and help me avoid any of them if they are not good for the short term.",
        "subreddit": "investing",
        "title": "Stocks to buy for Short term during the dip",
        "url": "https://www.reddit.com/r/investing/comments/fawy3b/stocks_to_buy_for_short_term_during_the_dip/",
        "created": 1582934864.0
    },
    {
        "author": "sapiensinvestor",
        "created_utc": 1582638244,
        "id": "f9agey",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "As the market is at the highs right now, I have only about 70% of my total portfolio in the following positions below. Will add on more as and when the market dips. Time horizon of the fund is long-term (5-10 years or longer).\n\nI breakdown the positions into classic Tech and Non-tech categories. My rationale is good Tech companies tend to outperform, so am kinda using the non-tech as a sort of counterweight to the Tech holdings. I also included a small allocation into my own YOLO long shots picks.\n\nI have been mostly a lurker but benefited **a lot** from the reddit community. This is my first post so please be kind :) Appreciate all comments and feedback!\n\n&amp;#x200B;\n\n**Tech: (36%)**\n\nVisa 6%\n\nMasterCard 6%\n\nFacebook 6%\n\nGoogle 6%\n\nAmazon 6%\n\nJD 6%\n\n&amp;#x200B;\n\n**Non-Tech: (24%)**\n\nUnited Health Group 6%\n\nNike 6%\n\nDisney 6%\n\nWaste Management 6%\n\n&amp;#x200B;\n\n**YOLO Long Shots: (10%)**\n\nTesla 4%\n\nIntelligent Systems Corp (INS) 3%\n\nPar Technology Corp (PAR) 3%\n\n&amp;#x200B;\n\n**Cash: (30%)**\n\nPlan is to deploy more into existing positions on dips",
        "subreddit": "investing",
        "title": "Help improve my stock picks! Many thanks in advance!",
        "url": "https://www.reddit.com/r/investing/comments/f9agey/help_improve_my_stock_picks_many_thanks_in_advance/",
        "created": 1582667044.0
    },
    {
        "author": "__justsayin__",
        "created_utc": 1582589576,
        "id": "f911t0",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Another Coronavirus victim...\n\n* * *\n\nMastercard Inc. lowered its three-week-old forecast for quarterly revenue growth as the spreading coronavirus curbs international travel and even takes a bite out of e-commerce, a business executives had hoped would be immune.\n\nThe credit-card network said it’s knocking 2 to 3 percentage points off the prediction it made on an earnings conference call Jan. 29. That translates to growth of 9% to 10% on a currency-neutral basis, excluding acquisitions, it said Monday. Shares of Mastercard and Visa Inc. dropped in after-hours trading.\n\n“Cross-border travel, and to a lesser extent cross-border e-commerce growth, is being impacted,” Mastercard said in a statement. “There are many unknowns as to the duration and severity of the situation and we are closely monitoring it.”\n\nThe short-lived forecast underscores how quickly the virus is altering consumer behavior as it moves beyond China. Mastercard executives had previously taken comfort in the fact that much of the firm’s business into and out of China is e-commerce, which could potentially continue amid measures to contain the disease.\n\n“It provides some level of a hedge,” Chief Financial Officer Sachin Mehra had told analysts on Jan. 29. But even back then, Chief Executive Officer Ajay Banga quickly cautioned that the firm would “take a look at those numbers once again” if the crisis worsened and affected more parts of the globe.\n\nOn Monday, United Airlines Holdings Inc. withdrew its 2020 profit forecast, also citing the virus.\n\nMastercard’s shares fell 4.4% during regular trading Monday after a spike in infections in countries including South Korea and Italy triggered a global selloff. The stock then dropped an additional 1.1% after hours at 6:30 p.m. in New York. Visa fell 1.7%.\n\nIf the impact of the virus is limited to the first quarter, annual net revenue growth will probably be at the low end of the low-teens range, the company said on Monday, noting that it plans to give further updates on its next earnings call.\n\nVisa CEO Al Kelly told investors at his company’s investor day Feb. 11 that it was “too early to tell” what impact the virus might have on results.\n\n“But if planes are not flying in and out of China, if hotels are not being filled -- which they’re not at the moment -- and if the supply chains are being impacted -- which I suspect they are -- there is going to be some impact,” Kelly said.\n\nhttps://www.bnnbloomberg.ca/mastercard-sees-lower-revenue-growth-as-coronavirus-curbs-travel-1.1395081",
        "subreddit": "investing",
        "title": "Mastercard sees lower revenue growth as coronavirus curbs travel",
        "url": "https://www.reddit.com/r/investing/comments/f911t0/mastercard_sees_lower_revenue_growth_as/",
        "created": 1582618376.0
    },
    {
        "author": "badpauly",
        "created_utc": 1581025400,
        "id": "ezzoog",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "\nThis is a list of the top 20 companies that experienced the largest change in insider shares in the last seven (7) days.\nThe SEC defines an insider as any officer, director or 10% shareholder. It is not illegal for these people to buy or sell their own shares.\nIn fact, since most of them get paid in stock options, it is expected. However, it is illegal for them to trade on inside information\nthat has not been made public. So for example if there are drug trial results that are bad and not public,\ninsiders cannot dump shares. That said, many people have observed that insiders - in general - seem to have a good\ntrack record at timing their purchases.  All trades that are marked as part of a 10b5 plan are excluded from this report.\n\n## Largest Insider Buying (Last 7 Days)\nCompany|Count|Shares Changed|Avg. Price|Value Change\n--------|-----:|-----:|-----:|--------:  \n[BDTX / Black Diamond Therapeutics, Inc.](https://fintel.io/n/us/bdtx)|14|3,992,472|19|75,856,968 \n[ARQT / Arcutis Biotherapeutics, Inc.](https://fintel.io/n/us/arqt)|6|2,117,776|17|36,002,192 \n[XON / Intrexon Corp.](https://fintel.io/n/us/xon)|10|5,972,696|6|34,999,999 \n[AMRS / Amyris, Inc.](https://fintel.io/n/us/amrs)|2|10,505,652|3|30,151,221 \n[IFF / International Flavors &amp;amp; Fragrances, Inc](https://fintel.io/n/us/iff)|8|222,616|133|29,481,376 \n[EPD / Enterprise Products Partners L.P.](https://fintel.io/n/us/epd)|13|319,700|26|8,251,810 \n[PBF / PBF Energy, Inc.](https://fintel.io/n/us/pbf)|2|263,471|26|7,052,252 \n[ALBO / Albireo Pharma, Inc.](https://fintel.io/n/us/albo)|1|255,809|21|5,371,989 \n[CERC / Cerecor Inc.](https://fintel.io/n/us/cerc)|3|1,256,282|3|5,000,002 \n[T / AT &amp;amp; T, Inc.](https://fintel.io/n/us/t)|1|100,000|38|3,760,380 \n[PKD / Parker Drilling Co.](https://fintel.io/n/us/pkd)|3|118,890|17|2,005,883 \n[BRPM / B. Riley Principal Merger Corp.](https://fintel.io/n/us/brpm)|6|194,128|10|1,983,071 \n[PPR / Voya Prime Rate Trust](https://fintel.io/n/us/ppr)|3|263,582|5|1,356,522 \n[WETF / WisdomTree Investments, Inc.](https://fintel.io/n/us/wetf)|4|245,628|4|1,042,271 \n[INTC / Intel Corp.](https://fintel.io/n/us/intc)|1|15,400|65|999,223 \n[UFI / Unifi, Inc.](https://fintel.io/n/us/ufi)|4|41,000|22|901,040 \n[INVE / Identiv, Inc.](https://fintel.io/n/us/inve)|5|178,335|5|874,466  \n[LJPC / La Jolla Pharmaceutical Co.](https://fintel.io/n/us/ljpc)|2|88,295|7|599,538 \n[KZR / Kezar Life Sciences, Inc.](https://fintel.io/n/us/kzr)|5|218,921|3|569,195 \n[ALEC / Alector, Inc.](https://fintel.io/n/us/alec)|1|20,000|25|500,000 \n[TPL / Texas Pacific Land Trust](https://fintel.io/n/us/tpl)|4|540|772|416,721 \n[CSFL / Centerstate Banks, Inc.](https://fintel.io/n/us/csfl)|3|15,000|23|347,843 \n[PWOD / Penns Woods Bancorp, Inc.](https://fintel.io/n/us/pwod)|1|9,400|33|307,850  \n[RGA / Reinsurance Group of America, Inc.](https://fintel.io/n/us/rga)|1|2,000|144|288,580 \n[RBNC / Reliant Bancorp, Inc.](https://fintel.io/n/us/rbnc)|6|13,000|22|280,637 \n[CTVA / Corteva, Inc.](https://fintel.io/n/us/ctva)|2|7,850|30|234,346 \n[SMPL / The Simply Good Foods Company](https://fintel.io/n/us/smpl)|1|10,000|23|229,793 \n[CRDE / Cardinal Ethanol LLC](https://fintel.io/n/us/crde)|5|30|7,045|210,692 \n[NGVT / Ingevity Corporation](https://fintel.io/n/us/ngvt)|1|2,290|66|149,995 \n[CNBKB / Century Bancorp, Inc.](https://fintel.io/n/us/cnbkb)|1|1,351|86|116,776 \n[CLB / Core Laboratories N.V.](https://fintel.io/n/us/clb)|3|3,000|35|104,579 \n[WBS / Webster Financial Corp.](https://fintel.io/n/us/wbs)|1|2,300|45|104,075 \n[BSTZ / BlackRock Science and Technology Trust II](https://fintel.io/n/us/bstz)|1|4,712|21|101,194 \n[LEVL / Level One Bancorp Inc](https://fintel.io/n/us/levl)|1|4,000|25|100,800 \n[ABCB / Ameris Bancorp](https://fintel.io/n/us/abcb)|1|2,440|41|100,089 \n[SNDX / Syndax Pharmaceuticals, Inc.](https://fintel.io/n/us/sndx)|1|12,500|8|100,000 \n[CLBK / Columbia Financial, Inc.](https://fintel.io/n/us/clbk)|1|5,825|17|99,017 \n[NOG / Northern Oil and Gas, Inc.](https://fintel.io/n/us/nog)|1|58,000|2|98,594 \n[PKG / Packaging Corp. of America](https://fintel.io/n/us/pkg)|1|1,000|97|96,875\n\n## Largest Insider Selling (Last 7 Days)\nCompany|Count|Shares Change|Avg. Price|Value Change\n--------|-----:|-----:|-----:|--------:  \n[GO / Grocery Outlet Holding Corp.](https://fintel.io/n/us/go)|7|-15,205,892|32|-484,231,631 \n[DHR / Danaher Corp.](https://fintel.io/n/us/dhr)|25|-330,949|163|-53,747,256 \n[NVR / NVR, Inc.](https://fintel.io/n/us/nvr)|6|-10,378|3,830|-39,743,717 \n[MA / MasterCard Incorporated](https://fintel.io/n/us/ma)|3|-115,608|324|-37,479,169 \n[TXN / Texas Instruments Inc.](https://fintel.io/n/us/txn)|19|-247,296|122|-30,220,844 \n[LLY / Eli Lilly &amp;amp; Co.](https://fintel.io/n/us/lly)|2|-200,000|147|-29,321,808 \n[KMX / CarMax, Inc.](https://fintel.io/n/us/kmx)|8|-273,720|96|-26,273,979 \n[APO / Apollo Global Management LLC](https://fintel.io/n/us/apo)|4|-315,217|47|-14,851,924 \n[OSK / Oshkosh Corporation](https://fintel.io/n/us/osk)|4|-157,925|91|-14,506,026 \n[SCHW / Schwab Charles Corp](https://fintel.io/n/us/schw)|4|-236,738|46|-10,832,924 \n[CACC / Credit Acceptance Corp.](https://fintel.io/n/us/cacc)|12|-21,708|431|-9,383,731 \n[WEC / WEC Energy Group, Inc.](https://fintel.io/n/us/wec)|2|-90,300|101|-9,085,001 \n[GS / Goldman Sachs Group, Inc. (The)](https://fintel.io/n/us/gs)|5|-34,533|242|-8,339,952 \n[NOW / ServiceNow, Inc.](https://fintel.io/n/us/now)|4|-20,300|340|-6,860,976 \n[DLB / Dolby Laboratories, Inc.](https://fintel.io/n/us/dlb)|4|-95,833|70|-6,742,301 \n[GGG / Graco Inc.](https://fintel.io/n/us/ggg)|3|-114,660|54|-6,297,928 \n[GSB / GlobalSCAPE, Inc.](https://fintel.io/n/us/gsb)|3|-571,259|11|-6,082,784 \n[TEL / TE Connectivity Ltd.](https://fintel.io/n/us/tel)|3|-59,000|94|-5,545,036 \n[MAN / ManpowerGroup](https://fintel.io/n/us/man)|3|-56,629|94|-5,344,748 \n[STRA / Strayer Education, Inc.](https://fintel.io/n/us/stra)|17|-32,974|161|-5,301,602 \n[GSHD / Goosehead Insurance, Inc.](https://fintel.io/n/us/gshd)|15|-95,775|51|-4,803,255 \n[LEVI / LEVI STRAUSS &amp;amp; CO](https://fintel.io/n/us/levi)|5|-235,508|19|-4,486,840 \n[SWT / Stanley Black &amp;amp; Decker, Inc.](https://fintel.io/n/us/swt)|3|-27,612|162|-4,477,259 \n[GPAQ / Gordon Pointe Acquisition Corp.](https://fintel.io/n/us/gpaq)|1|-400,000|11|-4,248,000 \n[BLK / BlackRock, Inc.](https://fintel.io/n/us/blk)|2|-7,389|539|-3,983,152 \n[BXP / Boston Properties, Inc.](https://fintel.io/n/us/bxp)|2|-27,455|145|-3,971,876 \n[MPWR / Monolithic Power Systems, Inc.](https://fintel.io/n/us/mpwr)|4|-18,838|174|-3,275,808 \n[MSFT / Microsoft Corp.](https://fintel.io/n/us/msft)|1|-18,000|180|-3,231,810 \n[BDX / Becton Dickinson &amp;amp; Co.](https://fintel.io/n/us/bdx)|6|-9,515|285|-2,712,503 \n[TMO / Thermo Fisher Scientific, Inc.](https://fintel.io/n/us/tmo)|2|-7,678|326|-2,508,448 \n[CHD / Church &amp;amp; Dwight Co., Inc.](https://fintel.io/n/us/chd)|1|-31,094|75|-2,334,538 \n[MRKT / Markit Ltd.](https://fintel.io/n/us/mrkt)|1|-26,600|81|-2,154,866 \n[AKRO / Akero Therapeutics, Inc.](https://fintel.io/n/us/akro)|2|-82,339|26|-2,121,726 \n[NEOG / Neogen Corp.](https://fintel.io/n/us/neog)|3|-30,000|68|-2,049,787 \n[SF / Stifel Financial Corp.](https://fintel.io/n/us/sf)|3|-27,583|65|-1,803,552 \n[MXIM / Maxim Integrated Products, Inc](https://fintel.io/n/us/mxim)|3|-29,300|61|-1,782,024 \n[UMBF / UMB Financial Corp.](https://fintel.io/n/us/umbf)|107|-26,522|67|-1,781,004 \n[ACIA / Acacia Communications, Inc.](https://fintel.io/n/us/acia)|7|-25,858|68|-1,757,361 \n[ABC / AmerisourceBergen Corp.](https://fintel.io/n/us/abc)|3|-18,037|89|-1,619,559 \n[SYK / Stryker Corp.](https://fintel.io/n/us/syk)|1|-7,513|214|-1,605,163 \n[VAR / Varian Medical Systems, Inc.](https://fintel.io/n/us/var)|2|-11,302|142|-1,602,850\n\n*Count* column is number of transactions.\n\nSource: [Fintel.io/insiders](https://fintel.io/insiders)",
        "subreddit": "StockMarket",
        "title": "Significant Insider Trading Activity (Last 7 Days)",
        "url": "https://www.reddit.com/r/StockMarket/comments/ezzoog/significant_insider_trading_activity_last_7_days/",
        "created": 1581054200.0
    },
    {
        "author": "Ltcjunkie",
        "created_utc": 1582595578,
        "id": "f92hq5",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Sold everything on Friday and bought TVIX @ $47. Obviously a good move. I know not to hold onto TVIX for more than a week unless I like going broke. When should I unload? Thursday? Wednesday? Thinking there’s gonna be another huge sell-off day this week. Probably not tomorrow though imo. I think Dow goes down another $1k to 200 MA which is when I’m planning to sell my tvix. Hopefully this week",
        "subreddit": "stocks",
        "title": "TVIX",
        "url": "https://www.reddit.com/r/stocks/comments/f92hq5/tvix/",
        "created": 1582624378.0
    },
    {
        "author": "K15h0",
        "created_utc": 1581093378,
        "id": "f0cy7k",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Which one of you psychopaths decided its would be funny to draw batman with the tesla? Stop messin with ma tendies!",
        "url": "https://i.redd.it/gt4vp2uu4jf41.jpg",
        "created": 1581122178.0
    },
    {
        "author": "sugma22",
        "created_utc": 1582165105,
        "id": "f6lvlc",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "to all WSB AUTISTS, WHAT DO YOU USE WHEN SPENDING YOUR NEWLY MINTED TENDIES? MASTERCARD? DISCOVER? AMEX? VISA? YEAH THATS RIGHT U SWIPE AND CHIP THAT VISA CARD OF YOURS EVERY FREAKING DAY. MISSED OUT ON $SPCE TO THE MOON? ILL GIVE YOU A $V ISA TO THE MOON BABY LETS GO! NEXT $MEME$STOCK BBY",
        "url": "https://i.redd.it/h0ypqvdnnzh41.jpg",
        "created": 1582193905.0
    },
    {
        "author": "avatarfire",
        "created_utc": 1581472390,
        "id": "f2jcz4",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Buy MasterCard calls you fools",
        "url": "https://techcrunch.com/2020/02/11/mastercard-given-approval-to-prepare-for-entry-into-chinas-payments-market/",
        "created": 1581501190.0
    },
    {
        "author": "Throwaway7282882818",
        "created_utc": 1580823233,
        "id": "eyq3s9",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Currently I have £25000 saved up. £2000 is sitting in Scottish Mortgage , and i intend on putting another £5000 into an aggressive growth fund. I was wondering what others would recommend i do with this money?\n\nA bit about me. I am in England doing a History degree with ambitions to either do a law conversion course or a MA in Finance after the 3 years. This means i could be left with between £35000-£60000 of debt but the time I am 23-24 years old and leaving University.",
        "subreddit": "investing",
        "title": "19 year old £25000 saved",
        "url": "https://www.reddit.com/r/investing/comments/eyq3s9/19_year_old_25000_saved/",
        "created": 1580852033.0
    },
    {
        "author": "aliman21",
        "created_utc": 1581437761,
        "id": "f2ajqg",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Why does $V and MasterCard have around 50% net margin and $AXP has around 16%?",
        "url": "https://www.reddit.com/r/stocks/comments/f2ajqg/why_does_v_and_mastercard_have_around_50_net/",
        "created": 1581466561.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1581427542,
        "id": "f28a1w",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/stocks sub! Welcome to Tuesday. Here is your pre-market news this AM-\n\n*****\n\n#[Today's Top Headlines for Tuesday, February 11th, 2020](https://www.cnbc.com/2020/02/11/dow-to-rise-powell-testifies-coronavirus-death-toll-passes-1000.html)\n\n* U.S. stock futures point to a higher open, following record closes for the S&amp;P 500 and Nasdaq on Monday, as investors are encouraged by a slowdown in the number of new coronavirus cases. The Dow, S&amp;P 500 and Nasdaq are higher in five of the past six sessions, and four S&amp;P sectors are at record highs: Consumer Discretionary, Consumer Staples, Tech and Real Estate. (CNBC)\n* Ray Dalio thinks the coronavirus’ hit to global markets is probably exaggerated (CNBC)\n* The director-general of the World Health Organization reportedly warned that while almost all of the confirmed coronavirus cases are in China, the outbreak constitutes a “very grave threat” for the rest of the world. China’s National Health Commission reported that a total of 42,638 cases had been confirmed in the country, with 1,016 deaths. (CNBC)\n* Nearly 200 evacuees to leave cornavirus quarantine in US (AP)\n* Fed Chairman Jerome Powell testifies today and tomorrow in the first of his twice-a-year economic updates to Congress, with investors listening for commentary on any coronavirus impact on the U.S. economy. On today’s economic calendar, the government is out with JOLTS, the Job Openings and Labor Turnover Survey, for December at 10 a.m. ET. (CNBC)\n* AutoNation (AN), Hasbro (HAS), Hilton Worldwide (HLT), Tegna (TGNA) and Under Armour (UAA) are out with quarterly earnings this morning, while Denny’s (DENN), Groupon (GRPN), Lyft (LYFT), and Western Union (WU) are among the companies issuing quarterly numbers after the bell.\n* A U.S. district judge is expected to rule in favor of allowing Sprint (S) and T-Mobile (TMUS) to merge over the objections of a group of state attorneys general, Reuters reported. It’s a decision that’s supposed to be made today. Shares of Sprint surged 69% in Monday’s after-hours trade and T-Mobile stock rose 8%. (CNBC)\n* The Democratic presidential race is deeply unsettled heading into today’s New Hampshire primary. It may be up to the state to put some structure around the chaotic contest, with Iowa being unable to declare a clear winner. New Hampshire’s secretary of state has predicted a healthy 292,000 Democratic voters, which would be about 40,000 more than voted in 2016. (AP)\n* Small New Hampshire town of Dixville Notch votes for Bloomberg in primary (USA Today)\n* Pete Buttigieg sees surge in support from business execs after his strong showing in Iowa (CNBC)\n* Bernie Sanders hopes New Hampshire primary will tighten his early grip on 2020 race (CNBC)\n* Mike Bloomberg could ‘handily beat’ Trump in 2020, says ex-Trump aide Anthony Scaramucci (CNBC)\n* Amazon (AMZN) is seeking to question President Donald Trump, Defense Secretary Mark Esper and former Defense Secretary James Mattis over a $10 billion Pentagon cloud contract awarded to Microsoft (MSFT). Amazon’s cloud computing arm said it’s looking to depose seven “individuals who were instrumental” in the JEDI source selection. (CNBC)\n* The Justice Department indicted four members of China’s military for the cyberattack against credit ratings agency Equifax in 2017. The incident led to the loss of personal information belonging to 145 million people, mostly in the U.S. but also in Canada and Europe. (CNBC)\n* The FAA is narrowing the issues needed before it can conduct a certification test flight on the grounded Boeing (BA) 737 Max, but will not commit to a timetable for lifting a flight ban. The certification flight to be carried out by FAA pilots “is not scheduled yet because we still have a few issues to resolve, but we continue to narrow the issues,” FAA Administrator Steve Dickson said. (Reuters)\n* DOT watchdog probes FAA’s pilot training after 2 deadly crashes of Boeing 737 Max (CNBC)\n* Google (GOOGL) human resources chief Eileen Naughton is stepping down from her role as tensions grown between employees and management. Naughton, who has held various roles at the company since 2006, has led the company’s human resources department as the vice president of people operations since 2016. (CNBC)\n* Shares of Slack (WORK) fell over 7% in the premarket after it filed an 8-K on Monday downplaying a news report that sent its stock surging more than 15%. The statement was issued in response to an earlier report that a new deal had been struck that made IBM Slack’s largest customer, which had sent the stock surging in the regular session Monday. (CNBC)\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](http://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://finviz.com/publish/021120/sec_all_075437166.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/wteeBZT.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/OeoDGfL.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/yKvMhID.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/SNqq5HC.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/8e4snrC.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/azlFbrt.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/YNP3Pq5.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/Vv5WIT7.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/vpdF9tz.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/SvyrDnj.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/CBl5AFZ.png)**)\n\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/G5AF0Cr.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #1!](https://i.imgur.com/22zaDPV.png)**)\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #2!](https://i.imgur.com/KMtzoBJ.png)**)\n\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS:\n\n* MYO\n* FB\n* UAA\n* UBS\n* MA\n* MSFT\n* NVDA\n* WORK\n* HAS\n* TMUS\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2020/02/11/stocks-making-the-biggest-moves-in-the-premarket-hasbro-under-armour-slack-sprint-more.html)**)\n\n*****\n\n&gt; **Under Armour (UAA)** – The athletic apparel maker reported an overall loss for the quarter, and warned of a negative sale impact from the coronavirus. The company also said it is assessing a possible 2020 restructuring.\n\n&gt; #**STOCK SYMBOL:** UAA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=UAA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/UAA)**)\n\n*****\n\n&gt; **AutoNation (AN)** – The nation’s largest car retailer beat estimates on both the top and bottom lines for the fourth quarter, with results boosted by higher demand for pre-owned vehicles.\n\n&gt; #**STOCK SYMBOL:** AN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AN)**)\n\n*****\n\n&gt; **Hasbro (HAS)** – The toymaker reported a quarterly profit of $1.24 per share, well above the consensus estimate of 91 cents a share. Sales fell short of Street forecasts, however, but Hasbro’s bottom line got a boost from toys related to Disney’s “Frozen 2” and “Star Wars” movies.\n\n&gt; #**STOCK SYMBOL:** HAS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=HAS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/HAS)**)\n\n*****\n\n&gt; **Hilton Worldwide (HLT)** – The hotel operator earned $1.00 per share for the fourth quarter, 4 cents a share above estimates. Revenue also beat forecasts. Hilton’s 2020 earnings outlook was below analysts’ forecasts, however, and the company said the outlook does not include possible coronavirus impact.\n\n&gt; #**STOCK SYMBOL:** HLT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=HLT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/HLT)**)\n\n*****\n\n&gt; **T-Mobile US (TMUS), Sprint (S)** – The mobile service providers are expected to win the approval of a federal judge for their $26 billion merger deal today, according to sources. That would end an effort by state attorneys general to block the combination of the third- and fourth-largest wireless carriers.\n\n&gt; #**STOCK SYMBOL:** TMUS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TMUS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TMUS)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** S\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=S&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/S)**)\n\n*****\n\n&gt; **Slack Technologies (WORK)** – Slack said in a Securities and Exchange Commission filing that IBM (IBM) had been the messaging platform’s largest customer for several years and had expanded its use of Slack over that time. The statement was issued in response to an earlier report that a new deal had been struck that made IBM Slack’s largest customer, which had sent the stock surging in the regular session Monday.\n\n&gt; #**STOCK SYMBOL:** WORK\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WORK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WORK)**)\n\n*****\n\n&gt; **Callaway Golf (ELY) **– Callaway lost 26 cents per share for its fourth quarter, wider than the 23 cents a share loss that analysts were expecting. The golf club maker reported better-than-expected revenue but said the coronavirus will have a negative impact in terms of both sales in Asia and on supplies.\n\n&gt; #**STOCK SYMBOL:** ELY\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ELY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ELY)**)\n\n*****\n\n&gt; **ViacomCBS (VIACA)** – ViacomCBS unit CBS Sports has struck a deal with sports betting company William Hill, allowing William Hill to seek new customers among the CBS Sports audience. William Hill would seek to get CBS Sports users to download its app and deposit money in betting accounts.\n\n&gt; #**STOCK SYMBOL:** VIAC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=VIAC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/VIAC)**)\n\n*****\n\n&gt; **XPO Logistics (XPO)** – XPO beat estimates by 10 cents a share, with adjusted quarterly earnings of $1.12 per share. The transportation and delivery company’s revenue came fall below analysts’ forecasts, however. XPO also announced the appointment of a new chief financial officer.\n\n&gt; #**STOCK SYMBOL:** XPO\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=XPO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/XPO)**)\n\n*****\n\n&gt; **Boston Beer (SAM)** – Boston Beer was upgraded to “outperform” from “neutral” at Credit Suisse, which points to the company’s increasing involvement in the hard seltzer market. Credit Suisse also increased its price target on the beer brewer’s stock to $525 per share from $400.\n\n*****\n\n&gt; #**STOCK SYMBOL:** SAM\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SAM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SAM)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/stocks?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Tuesday, February 11th, 2020! :)**",
        "subreddit": "stocks",
        "title": "Today's Pre-Market News [Tuesday, February 11th, 2020]",
        "url": "https://www.reddit.com/r/stocks/comments/f28a1w/todays_premarket_news_tuesday_february_11th_2020/",
        "created": 1581456342.0
    },
    {
        "author": "sapiensinvestor",
        "created_utc": 1582610365,
        "id": "f95p2q",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "As the market is at the highs right now, I have only about 70% of my total portfolio in the following positions below. Will add on more as and when the market dips. Time horizon of the fund is long-term (5-10 years or longer).\n\nI breakdown the positions into classic Tech and Non-tech categories. My rationale is good Tech companies tend to outperform, so am kinda using the non-tech as a sort of counterweight to the Tech holdings. I also included a small allocation into my own YOLO long shots picks.\n\nI have been mostly a lurker but benefited **a lot** from the reddit community. This is my first post so please be kind :) Appreciate all comments and feedback! \n\n&amp;#x200B;\n\n**Tech: (36%)**\n\nVisa 6%\n\nMasterCard 6%\n\nFacebook 6%\n\nGoogle 6%\n\nAmazon 6%\n\nJD 6%\n\n   \n \n\n**Non-Tech: (24%)**\n\nUnited Health Group 6%\n\nNike 6%\n\nDisney 6%\n\nWaste Management 6%\n\n   \n \n\n**YOLO Long Shots: (10%)**\n\nTesla 4%\n\nIntelligent Systems Corp (INS) 3%\n\nPar Technology Corp (PAR) 3%\n\n   \n \n\n**Cash: (30%)**\n\nPlan is to deploy more into existing positions on dips",
        "subreddit": "stocks",
        "title": "Help improve my 2020 Portfolio! Many thanks in advance!",
        "url": "https://www.reddit.com/r/stocks/comments/f95p2q/help_improve_my_2020_portfolio_many_thanks_in/",
        "created": 1582639165.0
    },
    {
        "author": "Footsteps_10",
        "created_utc": 1580868234,
        "id": "ez1nts",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Quick question, I own a few shares of this company and it’s a favorite of some funds.\n\nBlood plasma company out of MA. Solid operational success and financials.\n\nStock popped 8-9% today after an earnings beat and AH is down subsequently 8-9%. \n\nDoes anyone have any news? I’ve looked everywhere. I read the ER call and everything seems to be fine. \n\nPretty confused.",
        "subreddit": "stocks",
        "title": "$HAE - Haemonetics beats on earnings",
        "url": "https://www.reddit.com/r/stocks/comments/ez1nts/hae_haemonetics_beats_on_earnings/",
        "created": 1580897034.0
    },
    {
        "author": "abiech",
        "created_utc": 1581300711,
        "id": "f1jcdm",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "The flair is misspelled.\n\nOk so these are my picks I've done hours of DD. Sorry so late I'm sure you'll find something to put calls on. \n(CHFS), continues to pay off well.\n(IEP), tho more expensive at $65.72 It shows up on my radar.\n(SMSI), $6.18 I'll be filled with tendies.\n\nPouring Glenlevit on ice....\n\n(SPCE), who doesn't have battlestar galactica.\n(SAND), This one popped up the other day did not here about it here.\n(LK), looks good, pouring another glass...\n(UXIN), there were tendies laying on the floor so I picked em up. Wait that might have been me on the floor.\n(IBN), yes it's a bank I think. I forgot.\n(NVTA), @ $22.99 there might be tendies left in this one. \nAnd the last three are solid. Literally can't go tits up. V, MA, and WM, that's my list do with it what you want. \n\nFor safety reasons I will tell you don't take financial advice from a guy laying on the floor drinking no matter how old the label says it is.\n\nSee you tomorrow.",
        "subreddit": "wallstreetbets",
        "title": "Weekend stock picks 💪😎",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f1jcdm/weekend_stock_picks/",
        "created": 1581329511.0
    },
    {
        "author": "pencilvester30",
        "created_utc": 1581366599,
        "id": "f1wcpj",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "LOOK MA, I’M DOIN IT!",
        "url": "https://i.redd.it/k0nzx28ap5g41.jpg",
        "created": 1581395399.0
    },
    {
        "author": "pencilvester30",
        "created_utc": 1581366733,
        "id": "f1wdz4",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "LOOK MA, I’M DOIN IT!",
        "url": "https://i.redd.it/9lsk8nmop5g41.jpg",
        "created": 1581395533.0
    },
    {
        "author": "LeeHarveyLOLzwald",
        "created_utc": 1582650642,
        "id": "f9dgmm",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "For the love of money, DO NOT BUY THE FUCKING DIP YET! This is a correction to the 200 Day MA",
        "url": "https://i.redd.it/ppx68vt3r3j41.png",
        "created": 1582679442.0
    },
    {
        "author": "slapstellas",
        "created_utc": 1582685499,
        "id": "f9mcwl",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Multiple CEO's stepped down today and this week: Disney, Mastercard, L Brands, Salesforce, Uber Eats, HULU, MGM, IBM, Linkedin, Match.com, Aurora Cannabis, and more.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f9mcwl/multiple_ceos_stepped_down_today_and_this_week/",
        "created": 1582714299.0
    },
    {
        "author": "Pedramhaqiqi",
        "created_utc": 1582901343,
        "id": "favs1l",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Any one else see the price touch that MA line very soon or an i an autistic moron and should Die.",
        "url": "https://i.redd.it/kfw9od5vgoj41.jpg",
        "created": 1582930143.0
    },
    {
        "author": "E5150_Julian",
        "created_utc": 1581428593,
        "id": "f28hot",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Mastercard approved to enter China",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f28hot/mastercard_approved_to_enter_china/",
        "created": 1581457393.0
    },
    {
        "author": "goodtimealabamaguy13",
        "created_utc": 1582594881,
        "id": "f92bue",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Should we expect Square to fall after earnings because of Mastercard reports? Hoping my $87 calls make it alive..",
        "subreddit": "stocks",
        "title": "What does MA earnings mean for Square?",
        "url": "https://www.reddit.com/r/stocks/comments/f92bue/what_does_ma_earnings_mean_for_square/",
        "created": 1582623681.0
    },
    {
        "author": "Nillabean1988",
        "created_utc": 1580764832,
        "id": "eye6tr",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "InvestmentClub",
        "title": "Mastercard CEO Pushes Back Against National Payments Systems",
        "url": "https://www.reddit.com/r/InvestmentClub/comments/eye6tr/mastercard_ceo_pushes_back_against_national/",
        "created": 1580793632.0
    },
    {
        "author": "baecomeback",
        "created_utc": 1582378117,
        "id": "f7sitq",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "The deets on eHealth\n\n$EHTH\n\neHealth is the parent company of eHealthInsurance. Basically boomers and zoomers use this to compare insurance options and can enroll through its websites.\n\nLike (www.eHealth.com, www.eHealthInsurance.com, www.eHealthMedicare.com, www.Medicare.com and www.PlanPrescriber.com) or telephonically through its customer care centers.\n\nThey also have dope customer support.\n\nThe earnings\n\nEHealth (EHTH) came out with quarterly earnings of $4.13 per share, beating the Zacks Consensus Estimate of $2.49 per share. This compares to earnings of $1.61 per share a year ago.\n\n\nPosted revenues of $301.75 million for the quarter ended December 2019, surpassing the Zacks Consensus Estimate by 21.69%. This compares to year-ago revenues of $134.92 million. The company has topped consensus revenue estimates four times over the last four quarters.\n\nThis is what they said about 2020 guidance \n\n“At the midpoint, our 2020 annual guidance calls for nearly 30% revenue growth accompanied by EBITDA margin expansion, including the positive impact from the enhancements to our MA LTV model on our 2019 results.”\n\nhttps://finance.yahoo.com/quote/EHTH/financials?p=EHTH\n\n\nBasically as long as humans need health insurance EHTH will go up. \n\nTl;dr they beat earnings by 60% and have done so for the past 4 quarters and raised guidance price target is as high as $200 as low as $140 and average is $150\n\nSo how dafuck did an online business in America go down with the market because of the virus scare.",
        "subreddit": "wallstreetbets",
        "title": "Even stocks that shouldn’t be affected by corona are going down",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f7sitq/even_stocks_that_shouldnt_be_affected_by_corona/",
        "created": 1582406917.0
    },
    {
        "author": "sleeping_in_",
        "created_utc": 1581871291,
        "id": "f4t4qj",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "What do you think about the potential of Mastercard stock and where is the risk?",
        "url": "https://www.reddit.com/r/stocks/comments/f4t4qj/what_do_you_think_about_the_potential_of/",
        "created": 1581900091.0
    },
    {
        "author": "brucekeller",
        "created_utc": 1582562206,
        "id": "f8tuah",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Chart is SPX. MA on the bottom is 200. \n\n[https://imgur.com/a/OM5ZVAi](https://imgur.com/a/OM5ZVAi)  \n\n\nI don't think that looks good.",
        "subreddit": "stocks",
        "title": "Last 2 monthly dojis",
        "url": "https://www.reddit.com/r/stocks/comments/f8tuah/last_2_monthly_dojis/",
        "created": 1582591006.0
    },
    {
        "author": "ControlPlusZ",
        "created_utc": 1582996242,
        "id": "fbfkdr",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Help!\n\nThey’re everywhere. Distilling every post down to “what is the stroke price”? Asking about dividends. Pumping and pooping... one even is taking (gasp) charts! \n\nJust kidding on the charts. Support resurgence and MA are actually useful so he can stay....\n\nWhat do we do to repulse them?\n\n1. Go private\n2. They will leave after their PUTs fail next week\n3. Dragons? Will dragons or wizards help? 🧙‍♂️ 🐉 \n\nI blame bloomberg and that attractive young gal from CNBC.",
        "subreddit": "wallstreetbets",
        "title": "How do we repulse the Normie’s - were being overwhelmed",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fbfkdr/how_do_we_repulse_the_normies_were_being/",
        "created": 1583025042.0
    }
]