[
    {
        "author": "GotMoreOrLess",
        "created_utc": 1588911415,
        "id": "gfm6mi",
        "num_comments": 96,
        "num_crossposts": 0,
        "selftext": "For all of you that spent today FOMOing into $DBX, listen up. Although they have recovered well from their COVID low, $BOX has plenty of room to run and this may finally be the chance for some of you to make a play better than just bending over for an IV crush. **TLDR: $BOX calls**\n\n#Overview\n\nEven amid all of the recent hype for $DBX, $BOX hasn't gotten the love that it deserves. Where $DBX spends most of their time making small money on the consumer front or on limited basic enterprise plans, $BOX focuses on playing with the big money (like the MMs that steal your weekly allowance). To give a bit of background, let's get into the background and then their latest 10-K.\n\n&gt;With our Software-as-a-Service (SaaS) cloud content management platform, users can collaborate on content both internally and with external parties, automate content-driven business processes, develop custom applications, and implement data\nprotection, security and compliance features to comply with legal and regulatory requirements, internal policies and industry standards and regulations . . .  Our platform enables a broad set of business use cases across enterprises, hundreds of file formats and media types, and user experiences. Our platform integrates with leading enterprise business applications, and is compatible with multiple application environments, operating systems and devices, ensuring that workers have access to their critical business content whenever and wherever they need it.\n\nAs a common theme, you'll continue to see this enterprise focus throughout, but it gets better.\n\n&gt;Our go-to-market strategy is focused on selling our cloud content management platform as a solution for the entire enterprise with the full set of Box capabilities, leveraging our product suite offerings, and driving high-value significant business outcomes for our customers . . .  We focus our efforts on larger enterprises, capitalizing on international growth, and utilizing our partner ecosystem, where most advantageous . . . We offer nearly 1,500 integrations with partners including Microsoft, IBM,\nSalesforce.com, Apple, Google, Slack, Adobe, Palo Alto Networks, Okta, Zoom and others, giving our users easy access to their content in Box without leaving these applications. \n\nSee some familiar names here? Those are the stocks that you've already missed the boat on. Beyond that, if you take a look at their site, you can look at some of the big names already using Box in their business: Morgan Stanley, GE, Intuit, AstraZeneca, etc. \n\nEven their CEO himself has been out trying to [tell everyone to hop on for the ride](https://www.bloomberg.com/news/articles/2020-04-24/box-ceo-aaron-levie-sees-cloud-growth-during-coronavirus), but hopefully the news coming out of the $DBX call was enough to convince you that it's viable. \n\nIf we get into their financials, you'll see strong revenue growth YoY from about $600M for the year ending 1/31/2019 to $700M on 1/31/2020. Although they have recorded a net loss each year, it's primarily driven by sales and marketing expense (45% revenue and declining YoY). When your product sells itself in this pandemic, that becomes a bit less of an issue. The balance sheet is a bit weak with limited cash and substantial A/R that may be problematic, but given the nature of their customer base and limited leverage, it shouldn't be as big of a concern.\n\nIn terms of revenue generation, I'll direct you to their [Enterprise License Agreement](https://cloud.app.box.com/s/xec0gl0gqcgverpn2rw0r4kkzqycdsme). These are 3 year agreements which include implementation and full integration into the Box platform. Over the past couple of months, even a few large organizations signing up for these are going to make it rain tendies, but I'd bet you see massive growth here. Because enterprise customers on broad platform integrations tend to be locked in for a while, it's going to lead to incredibly strong guidance.\n\n#Why now?\n\n$BOX reports earnings on 5/27, so for once you'll have the chance to get in *before* the big run up. As of now, premiums are still low and have plenty of room to run. The best part here is that because $BOX hates their accountants, their fiscal year ends on 1/31, so their quarterly earnings on 5/27 will include actual numbers through 4/30/20. Because of this, they'll have a good 2 months worth of pure COVID gains to showcase. Analysts are estimating about $0.05 EPS, but I'd bet on that being revised up and still beaten. The window may start to close as the market reacts to the $DBX earnings and detail from their conference call, but there's still time to get in tomorrow.\n\n#My Positions\n\n$BOX 6/19 17c\n\n$BOX 6/19 20c\n\nI entered started building the position earlier today and am already up about 20%, but I plan to hold over the next couple of weeks and use any dips as an opportunity to add more. As always, do your own research and mind your personal risk tolerance.",
        "subreddit": "wallstreetbets",
        "title": "Think Inside the $BOX [DD]",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gfm6mi/think_inside_the_box_dd/",
        "created": 1588940215.0
    },
    {
        "author": "codingprofessor",
        "created_utc": 1589524360,
        "id": "gk3xle",
        "num_comments": 74,
        "num_crossposts": 0,
        "selftext": "\\## **My history investing in college and my first month investing in February:**\n\nLearned about miners and blockchain validation with a chemical engineering friend before the rally.\n\n\\- Bought **XRP** at $.15 and $.25, sold at $3.28 (I valued at $4 or $5 dollars MAX in 10 years if blockchain found adoption)\n\n\\- Bought **AMD** after the rally at $11 because it was ridiculous how much cost efficiency they had introduced to the market to poor people like me unlike **NVIDIA** products which always seemed far removed and discouraged me.\n\n\\- I started with **Panasonic** because I had missed out on the window to invest in **Tesla** at 200-300 range. I believed **Panasonic** to be similar to **AMD's** relationship to **bitcoin**; while all eyes looked at the shiny object, I looked at the boring parts that built it.\n\n\\- The market crashed, so I DCA'd aggressively and controlled my emotions through out. I was more concerned with my performance to commitment rather than my returns at the time. I did well.\n\n\\- My investments in March 19 was **SQ** and **Lyft**\n\n\\## **My Strategy now that I have income**\n\n\\- I bought up to 5,000 dollars in stocks ranging from **FANUC** (industrial robotics) to **DENNYS** (logistics/real estate)\n\n\\- I trimmed down to $2,300 but will rapidly rebuild with a different approach:\n\n\\- I'm buying 1 stock in the company before making any further developments with. Following this, I will purchase ETFs in sectors that I **want** to see develop in the next 5-15 years. I will buy 1 stake into these ETFs and combine it with my 1 stock purchase to create the necessary offset.\n\n\\- For example, I bought 1 stock of **Texas Instruments**  for $109 followed by a purchase in **SOXX ETF** for semiconductors, which has the largest ETF allocation to **Texas Instruments.** I will apply similar logic to companies like **Facebook, Paypal,** etc.\n\n&amp;#x200B;\n\n\\- I do this \"1 chip\" start in multiple industries because I want to pick some arbitrary point in time but I have a lot of industries &amp; ecosystems that I would like to reasonably participate in. This will still cost a lot of money to start off with and buys me time to study company numbers and outlooks.\n\n&amp;#x200B;\n\n\\## **My current market sentiment**\n\n**-** I consider where you start on a graph as somewhat arbitrary and see the current market stability as somewhat of an exercise in game theory and rowing a boat throat a thick fog. I believe it's optimal to row cautiously forward and to not stay still. With cautious rowing, you'll be able to react appropriately if you are suddenly met by a waterfall or a path with clearer vision.\n\n&amp;#x200B;\n\n\\- I am **\\`*****BEARISH\\`*** on Amazon in the long term. I believe that slowly, but surely, the market will consume Amazon's hold on its markets. I don't believe Amazon will maintain the status quo on cloud computing due to the quality of its competitors. I absolutely LOVE **Google Cloud Platform** and utilize **Firebase real-time database** very often. **Microsoft** has made some extremely important acquisitions recently in **Github and NPM - that's enormous.**\n\n\\-  I have suspicions about **Amazon** will struggle internationally. I don't know if Amazon will penetrate China the way China does, or if it will succeed in locations south of Mexico against things like **Mercado Libre**\n\n\\- I have suspicions that tech platforms will soon integrate in a meaningful way with financials. As in, the virtualization of stores and forwarded payments in places like the **Facebook(Visa) Market Place, Twitter(Square) payment sending, Paypal(honey) &amp; Amazon purchasing, Gaming credits, etc.**\n\n**-** I am \\`**bullish**\\` on Facebook. Facebook is utterly invaluable and scales globally. The reason it's adopted in **Mexico**, for example, is because it's cheaper and faster than other services. They also service millions of developers with **React** and its growing development ecosystem. They provide a standardized marketting platform for small businesses on Instagram, Facebook, WhatsApp, and soon to be JIO. I would not be surprised if they soon enter the fintech sector.\n\n\\- I am \\`**bullish\\`** on **Paypal**. They are seemingly repeating their previous success by servicing large online commerce that are upgrading their systems. **Honey/Paypal** will scrape coupons for Amazon and force organizations like Visa to compete with  **real-time financial services**.\n\n&amp;#x200B;\n\n\\- I am **\\`bullish\\`** on cloud software and networking. I think **CDNs** and dedicated **services for Cybersecurity** will maintain. Sure Google provides these services but things like **Cloudflare** and **Fastly** have dedicated solutions to fast image processing, DDoS protection, and more that other platforms may not be able to **allocate their resources to**. **Cloudflare** has an enormous network, and **Fastly** provides a great system for you to enjoy content like **Reddit.** I think it's hard to miss the mark here - the highway of the internet is going to get faster and more assets will be maintained in the server's space - the ecosystem must grow with it.\n\n&amp;#x200B;\n\n\\- I am ***\\`EXTREMELY BEARISH***\\*\\*\\`\\*\\* on Beyond Meat. I've been vegetarian for 10 years. IT'S BAD. WE HAVE NOTHING ELSE TO BE EXCITED ABOUT AND WE'RE NOT USED TO HAVING ATTENTION. VEGETARIANS ARE LYING IF THEY SAY IT'S AMAZING. ***IT'S LITERALLY DOG FOOD***\n\n&amp;#x200B;\n\n\\- I am \\`**BULLISH\\`** on the long term development of **Mexico**. I think companies like **Kansas City Southern** that services **Mexican-American** relationships will grow well in the long run.\n\n\\- I am **\\`BULLISH\\`**  on Apple and Adobe. Amazing products.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\## **CURRENT HOLDINGS (ordered by priority &amp; checkup time):**\n\n&amp;#x200B;\n\n**GOOG &amp; AMZN exposure through tech ETFs** ::: priority FB\n\n**NVIDIA, AMD, Intel EXPOSURE through semiconductor ETFS** ::: priority Texas Instruments\n\n**Environmental Services exposure through Sanitation ETFS** ::: priority Waste Management\n\n**Adobe and AutoDesk exposure through cloud software ETFs** :: priority Adobe\n\n**Nintendo exposure through gaming ETFS ::** priority Nintendo\n\n**Cisco exposure through cloud networking and edge computing ETFS** Cicsco, Fastly, Cloudflare, etc\n\n**TELECOM networking ETFS** :: priority TMobile\n\n**Manufacturing technology, industrial sectors, and robotics exposure to**  Fanuc, ABB, Siemens, Sherwin-Williams, VW, GM, Nissan, Toyota, Panasonic,\n\n**Healthcare services ETF** :: priority Cigna\n\n**FB -- LONG**\n\n**PAYPAL --  LONG**\n\n**TEXAS INSTRUMENTS - LONG**\n\n**MSFT     --  LONG**\n\n**APPLE   --  LONG**\n\n**ADOBE -- LONG**\n\n**DISNEY -  LONG**\n\n**BITCOIN - LONG**\n\n**TMOBILE - 2 YEARS**\n\n**VISA -- 2 YEARS**\n\n**JPM - 2 YEARS**\n\n**TWITTER - 2 YEARS**\n\n**SQUARE - 1 YEAR**\n\n**LYFT - 1 YEAR**\n\n**FASTLY - QUARTERLY**\n\n**CLOUDFLARE - QUARTERLY**\n\n**1LIFE MEDICAL - QUARTERLY**\n\n**FIVERR - QUARTERLY**\n\n**DRAFT KING - QUARTERLY YEAR + CHICAGO POLITICS**\n\n**GROUPON - SPARE CHANGE JAR**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**## EXCITED TO ACQUIRE**\n\n**- ADOBE**\n\n\\- **QQQ**\n\n\\- **SHERWIN WILLIAMS**\n\n\\- **TOYOTA**\n\n\\- **KANSAS CITY SOUTHERN**\n\n\\-",
        "subreddit": "investing",
        "title": "I started my career in November and investing February 5th, 2020 - my strategy as a once peasant Mexican",
        "url": "https://www.reddit.com/r/investing/comments/gk3xle/i_started_my_career_in_november_and_investing/",
        "created": 1589553160.0
    },
    {
        "author": "atruautist",
        "created_utc": 1590072923,
        "id": "gnybht",
        "num_comments": 61,
        "num_crossposts": 0,
        "selftext": "***Hello All-*** \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n***I am here today to explain why your wife's computer runs Youtube better than your Fortnite Gaming PC. For starters, your dumbass probably has never heard of NVIDIA. Who's NVIDIA? That gaming company? Jesus christ have you ever thought about what makes our newfound digital life possible?!, they provide a lot more than just gaming cheepz for the 144hz refresherrz. Not to discount the fact that they do...*** ***~~and they're also the best at that. (Also, won't be covering in this post, but they also have a huge hand in self-driving cars. Look it up.)~~***\n\n&amp;#x200B;\n\nAside from games, they are the company that drives almost every Professional Artists' workhorse. I'm talking PHOTOGRAPHERS and VIDEOGRAPHERS that take &amp; edit your wife's nudes &amp; pornos. I'm talking about what APPLE uses to power their machines, who are widely recognized by many to be the BEST CREATIVE tool in the markets. I'm talking about what DIGITAL ARTISTS use to draw up KILLER RENDERINGS of FAKE BEARS to trick your dumbass into buying PUTS. \n\n&amp;#x200B;\n\nOh, they power ADOBE TOO?! The company that also has a monopoly in pre and post-process editing and content creation down to full blown 3d renderings? Jesus fucking christ. \"But wait, those programs are so hard to use and learn, they have a big barrier to entry and will never become mainstream.\" You're right. Kinda. Fucking boomer. \n\n&amp;#x200B;\n\n**If only there was some way to tackle that.... The only way this could get any better was if they created a unified cloud platform that allowed these new students and existing practitioners a platform to connect and edit together instead of watching 5HRs worth of YouTube tutorials....**  Holy shit?! They just announced the Omniverse? WTF IS AN OMNIVERSE? I'll let NVIDIA explain:\n\n[\"Omniverse aims for universal interoperability across different applications and 3D ecosystem vendors. It provides efficient real-time scene updates and is based on open-standards and protocols. The Omniverse Platform is designed to act as a hub, enabling new capabilities to be exposed as micro-services to any connected clients and applications.\"](https://developer.nvidia.com/nvidia-omniverse-platform)\n\n&amp;#x200B;\n\nSince I know you probably can't comprehend that, think of a google doc where you and all your little friends can see what work the other person is doing, while editing, in real time. This platform will, with no doubt, change the ENTIRE WAY that 3D artists and products operate.. making workflows faster, more efficient, and overall more enjoyable. What does this mean? They will hold a MONOPOLY over what is the future of our marketing assets, visual art outputs, and any game that shows up on a screen. To put this metaphorically- **This company has built the engine, installed it in all the cars, and has now paved the roads on which you will drive it on,**\n\n&amp;#x200B;\n\nNow that you are aware, I want to let you know that this company is reporting EARNINGS after-hours TODAY. I forget exactly where, possibly in my fucking dreams, but they were recently upgraded to a target price of $450. The market just tanked a bit as I was typing this (hahaha), but they are currently at $355. Their revenue is UNTOUCHED by COVID. IF anything, they will BEAT EXPECTATIONS BIGLY because every little boy and little girl decided to buy GPUS to power their PornHub Machines and Instagram Editors. Now go make some money so your wife will look at you again. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**TLDR; BUY NVIDIA  CALLS NOW BEFORE IT EXPLODES TOMORROW $NVDA 400C 5/29**",
        "subreddit": "wallstreetbets",
        "title": "DD - Your Wife's Boyfriend Works at NVIDIA",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gnybht/dd_your_wifes_boyfriend_works_at_nvidia/",
        "created": 1590101723.0
    },
    {
        "author": "Roman71",
        "created_utc": 1588879604,
        "id": "gfdb8k",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "If I get one contract ADBE $355 P 5/15 for $310 how much could I lose",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gfdb8k/if_i_get_one_contract_adbe_355_p_515_for_310_how/",
        "created": 1588908404.0
    },
    {
        "author": "codingprofessor",
        "created_utc": 1589695550,
        "id": "gladl9",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "I've worked in manufacturing for 8 years and went to IMTS every year at McCormick Place Chicago, so I got familiar with CAD/CAM software and industrial machining pretty early. \n\nI'm now a software engineer working closely with front end and cloud environments and I'm closely watching these industries converge more and more - sophisticated manufacturing and designing operations need sophisticated security and business solutions. Machining and lean manufacturing data will only increase in importance as virtualization increases with it.\n\nI've also seen Adobe grow enormously as a product and it inspires so many people in their creative endeavors. I feel that is a powerful advantage to have. They also seen to have a very tight history with Apple and I see this quite viscerally with the iPad Pro drawing products",
        "subreddit": "investing",
        "title": "Is there any reason not to be bullish on Adobe and AutoDesk?",
        "url": "https://www.reddit.com/r/investing/comments/gladl9/is_there_any_reason_not_to_be_bullish_on_adobe/",
        "created": 1589724350.0
    },
    {
        "author": "tommasoseita",
        "created_utc": 1589805070,
        "id": "gm0kls",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Hello everyone,  \n\n\nI'm building with a friend a **big pack of stocks.**\n\nOur goal is to invest a **large amount of money** in a diversified package that allows us to reduce risk. We included many tech stocks that I think in the next **2/3 years** will bring a return on investment of at least **100%**.\n\nWhat do you think? Where do you see weaknesses? \n\nBelow the **stocks**:\n\n• Microsoft\n\n• Apple\n\n• Amazon\n\n• Facebook\n\n• PayPal\n\n• ServiceNow\n\n• Slack\n\n• The Trade Desk\n\n• Shopify\n\n• DataDog\n\n• Twilio\n\n• MongoDB\n\n• Salesforce\n\n• Spotify\n\n• Zoom\n\n• Sea Limited\n\n• Zendesk\n\n• Axsome Therapeutics\n\n• Adobe\n\n• Intuit\n\n• Zscaler\n\n• Okta\n\n• Tencent\n\n• Activision\n\n• PayCom\n\n• Autodesk\n\n• JD\n\n• Mastercard\n\n• Resmed\n\n• Accenture\n\n• Nvidia\n\n• Tmobile US\n\n• Iddex Labs\n\n• Moderna  \n**Do you have any stocks to add?**",
        "subreddit": "StockMarket",
        "title": "My stock starter pack",
        "url": "https://www.reddit.com/r/StockMarket/comments/gm0kls/my_stock_starter_pack/",
        "created": 1589833870.0
    },
    {
        "author": "yellowsockss",
        "created_utc": 1588786777,
        "id": "geoma2",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "My last FD - ADBE 5/15 395c/400c",
        "url": "https://i.redd.it/2xicw6q2l6x41.png",
        "created": 1588815577.0
    },
    {
        "author": "mariodolphins1010",
        "created_utc": 1588786893,
        "id": "geonlw",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": " \n\nJust started reading up on stocks last week and im looking to invest 5k. My goal is to let everything sit a few years and not focus on selling.\n\nI put together a list of stocks and I have dont know what percentage to buy of each. Any info or opinions would be greatly appreciated.\n\nhere is a list of what im interested in.\n\nService now\n\nRing central\n\nAdobe\n\nAlgonquin Power &amp; Utilities Corp\n\nBrookfield Property Partners\n\nKirkland gold\n\nPower corp of Canada\n\nNvidia\n\nAMD\n\nMicrosoft\n\nAmazon\n\nVisa\n\nMastercard\n\nCnq\n\nSuncor\n\ncibc\n\nTD Bank",
        "subreddit": "stocks",
        "title": "potentially wanting to invest",
        "url": "https://www.reddit.com/r/stocks/comments/geonlw/potentially_wanting_to_invest/",
        "created": 1588815693.0
    },
    {
        "author": "BamBamBrowning",
        "created_utc": 1590727060,
        "id": "gsm2zc",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "I’m trying to split my portfolio into a “50/50” manner using Indexes and single stocks \n\nI use Robinhood for investing and TS for options. \n\n\nI do my best to make sure I invest full amounts into the indexes. \n\nThen I put the rest amongst the other stocks through fractional investments \n\nMy indexes are: \nXBI\nSPY\nSPGI\n\nMy stocks are:\nApple\nAdobe \nAmd\nAmazon \nBroadcom \nAmerican Water \nEdwards life science \nFacebook \nGoogle\nIntuit \nMicrosoft \nNvidia \nPayPal \nTesla \nVisa \nVeeva Systems \nWaste Management \nExxon Mobile \n\nI’m not trying to have an immensely “diverse” load. Everything I have chosen I have a strong familiarity with, not a Warren Buffett understand by any means but enough to trust putting exorbitant amounts of money in at this point. So far $100k split amongst the set. \n\nPlease and thank you for the guidance.",
        "subreddit": "investing",
        "title": "Can I get a little bit of guidance on my portfolio?",
        "url": "https://www.reddit.com/r/investing/comments/gsm2zc/can_i_get_a_little_bit_of_guidance_on_my_portfolio/",
        "created": 1590755860.0
    },
    {
        "author": "tinyraccoon",
        "created_utc": 1590697615,
        "id": "gse38u",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "I've done my research on Morningstar (both are still not at FMV) and other sites but am curious to know your take on the two stocks. Feel free to cite hard data but even general statements like (I don't think ___ will do well in this environment b/c of budget cuts, etc.) are fine.\n\nTLDR: Asking for opinion, not for people to do research for me.\n\nAlso, I'm mostly interested in macro views like how much growth potential you think the stocks have, not \"what's a good price to buy?\"  Once I have the macro stuff figured out, I will work on the technical loading plan.",
        "subreddit": "stocks",
        "title": "Thoughts on whether MSFT, ADBE, or CRM is the better buy?",
        "url": "https://www.reddit.com/r/stocks/comments/gse38u/thoughts_on_whether_msft_adbe_or_crm_is_the/",
        "created": 1590726415.0
    },
    {
        "author": "Baindraug",
        "created_utc": 1588947089,
        "id": "gftxob",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Hi everyone,\n\nNew to trading here, I'm wondering what you use as news sources to stay up to date with news from the stocks you invest in? Say hypothetically I have shares in Tesla, Adobe and Caterpillar, are there any sites that would let me only get updates related to those particular stocks? \n\n&amp;#x200B;\n\nMany thanks in advance :)",
        "subreddit": "StockMarket",
        "title": "News sources?",
        "url": "https://www.reddit.com/r/StockMarket/comments/gftxob/news_sources/",
        "created": 1588975889.0
    },
    {
        "author": "sodndbbdjsjsjshdhh",
        "created_utc": 1589331435,
        "id": "giokuq",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Adbe expiration 5/15 CRM expiration 5/22 and 5/29",
        "subreddit": "wallstreetbets",
        "title": "Should I give up hope on my adobe and CRM calls?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/giokuq/should_i_give_up_hope_on_my_adobe_and_crm_calls/",
        "created": 1589360235.0
    },
    {
        "author": "easypiecy",
        "created_utc": 1589219437,
        "id": "ghsiqv",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Hi everyone, I would like to invest in some multi media content creation software companies. I don't know a lot of companies other than Adobe. Do you guys have any suggestions?\n\nThanks in advance.",
        "subreddit": "stocks",
        "title": "Any stocks in the content creation industry?",
        "url": "https://www.reddit.com/r/stocks/comments/ghsiqv/any_stocks_in_the_content_creation_industry/",
        "created": 1589248237.0
    },
    {
        "author": "pfaerbs13",
        "created_utc": 1590526709,
        "id": "gr5ion",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "StockMarket",
        "title": "Thoughts on Adobe?",
        "url": "https://www.reddit.com/r/StockMarket/comments/gr5ion/thoughts_on_adobe/",
        "created": 1590555509.0
    },
    {
        "author": "psndvdhsba",
        "created_utc": 1589331321,
        "id": "giojqc",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Should I give up hope on my adobe and CRM calls?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/giojqc/should_i_give_up_hope_on_my_adobe_and_crm_calls/",
        "created": 1589360121.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1588708406,
        "id": "ge4rgl",
        "num_comments": 0,
        "num_crossposts": 0,
        "subreddit": "InvestmentClub",
        "title": "good stock for long term investment . ADOBE?",
        "url": "https://www.reddit.com/r/InvestmentClub/comments/ge4rgl/good_stock_for_long_term_investment_adobe/",
        "created": 1588737206.0
    },
    {
        "author": "Davecvs",
        "created_utc": 1589081460,
        "id": "ggu1ni",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "AMZN\nAAPL\nAWK\nMSFT\nADBE\nBABA\nGOOG\nKO\nDIS\nEQIX\nHD\nINTC\nJNJ\nMCD\nMDT\nPEP\nPG\nV\nWMT\nWM",
        "subreddit": "StockMarket",
        "title": "Thoughts on my stocks selection?",
        "url": "https://www.reddit.com/r/StockMarket/comments/ggu1ni/thoughts_on_my_stocks_selection/",
        "created": 1589110260.0
    },
    {
        "author": "Roman71",
        "created_utc": 1588878369,
        "id": "gfcwtm",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "how much money i lose if i buy a put on adobe",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gfcwtm/how_much_money_i_lose_if_i_buy_a_put_on_adobe/",
        "created": 1588907169.0
    },
    {
        "author": "sodndbbdjsjsjshdhh",
        "created_utc": 1589331497,
        "id": "giolfz",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "options",
        "title": "Should I give up on adobe and CRM calls?",
        "url": "https://www.reddit.com/r/options/comments/giolfz/should_i_give_up_on_adobe_and_crm_calls/",
        "created": 1589360297.0
    }
]