[
    {
        "author": "[deleted]",
        "created_utc": 1595339460,
        "id": "hv7o76",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "StockMarket",
        "title": "IPGP Laser Manufacturer - keep an eye out",
        "url": "https://www.reddit.com/r/StockMarket/comments/hv7o76/ipgp_laser_manufacturer_keep_an_eye_out/",
        "created": 1595368260.0
    },
    {
        "author": "maamsboy",
        "created_utc": 1594249053,
        "id": "hnrkmd",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "So I'm currently only in VFIAX. Im not a day trader, and prefer cost averaging passive investing. \n\nI've been reading about the golden butterfly ratios and the ray dalio portfolio. I've run some back test using portfolio visualizer, and they both seem to under perform as a whole against the s&amp;p as a benchmark,  but they also never lose anything close to the s&amp;p. That being said when covid19 hit the ratios I am looking at actually outperformed and are outperforming the volatile s&amp;p. Knowing that low expenses and not losing money are 2 of the big keys in this. It makes me want to switch.\n\nI wanted to get input from you guys and see what your thoughts were on the whole, or if any of you have used or use either of these methods and should I or should I not follow through with switching over.",
        "subreddit": "investing",
        "title": "Golden butterfly, ray dalio, &amp; s&amp;p500",
        "url": "https://www.reddit.com/r/investing/comments/hnrkmd/golden_butterfly_ray_dalio_sp500/",
        "created": 1594277853.0
    },
    {
        "author": "Ghosty_0",
        "created_utc": 1595298284,
        "id": "huz3o4",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "Upon waking, i find i have YOLO'd into my spongebob under pants, during the night. \"Excellent\" i whisper to myself, a good omen for the 6th straight morning. Today, like every day, will be the goodest of days. \n\nI waddle over to my command station. Its quad stack 124 moniter bubble shell display opens like an egg, welcoming me back to the devine yolk.\n\nThe screens are dark, and as i mount my 360 Pro TurboSapian Data Chair, the moniter dome closes around me. In complete darkness i am returned to the womb, a trader, THE trader, ready to be born.\n\nIn the darkness i use my pudgy little fingers to caress the tattoo on my forearm, its Jimmy Neutron, but his penis is exposed, and below it, he has a smaller, but equally penis shaped, second penis. \n\nIts 9:28. Pre-market is premature, i never trade pre, it disgusts me. But its almost time.\n\nI turn both safety keys, and right on cue my tiny erection triggers the Initiate button under my keyboard. 4 cylinders of kick ass explodes into action as my rig comes to life, 124 moniters display all the incoming data from at least 4 thousand countries. I can smell ozone and i taste soap in my mouth. \n\nI can feel my brain smooth over and my eyes glaze when i swing my chair around a dope 780, taking in everything, and nothing. \"Radical\" i say. \n\n\nAnd im in. All in. Im in all of it. my fingees play ragtime melodies across the keyboard.\n\n\nBalls deep, i swing trade idex, i short tesla, I put calls on shorts i make up new kinds of trading. my puts and calls have started to fuck and are raising tiny puts and calls of their own, $TOPS, $SHIP, $BIOL, $POO, $WEEN, I am everywhere. I buy high and sell low, i make the market jump like its a 9 year old lobotomite hooked up to a EV battery. My market is crazier than a Purple Mattress Ad. Im building a whole new world, one negative percentage at a time.\n\n\"See you in the center of the earth, retardos\" I slip my salty philanges into every dry orifice with a Ticker.\n\nSeveral hours in i begin to urinate, and the auto catheter enters my peener. I realize i have to buy more reddit accounts, this time i need accounts over 3 years. Its a solid play. I enter and exit the market repeatedly, slowly and then faster and faster. Teasing the stocks until they explode idiotically in the wrong directions. My directions.\n\nThe auto hot pocket liquidizer/dispenser malfunctions, giving me meatball flavour instead of classic pepperon'. As a result my bowels begin to void, but the auto butt catheter engages. Got to remember to have mom refill the lube resivour. No time to think about that.\n\nTesticles of light explode in my vison vaginas, a world of randomly squiggling red and green lines blur into shades of gray. I am becoming a galaxy of collapsing stars, i am becoming so goddamn hard right now. Time becomes solid and i am pure Volitility.\n\n\nThe dome opens.\n\n\nIn a cool 19 hours and 64 seconds, I've bounced the market so hard its got CTE. im soaked in birth fluids, thats what i call them. Tomorrow i will be reborn in these juices, i the mastermind, the truest of all ideas, the retard of all those 'tarded. \nI am the market. \nI am Legion.",
        "subreddit": "RobinHoodPennyStocks",
        "title": "I Am The Market. I Am Legion",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/huz3o4/i_am_the_market_i_am_legion/",
        "created": 1595327084.0
    },
    {
        "author": "stackedstan1",
        "created_utc": 1593758700,
        "id": "hkeauy",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "I love his app. its has its bugs and flaws which those rare caces should be addressed accordingly to keep the integrity of the company. Robinhood throughout the years have transformed into one of the biggest if not the biggest online trading platforms out there. its easy to use functionality really attracts the younger demographic and educate themselves financial literacy which is arguably one of the keys to success.\n\nmy 2 cents on how the app could revolutionize is to implement a social media aspect, to the app. like wallstreet bets has their own community. you can adopt a part of that community. everyeone im telling you Everyone will start using robinhood alot more since its also a socaiol midea and meme platform. just l m and a team run it so ya dont fuck up",
        "subreddit": "RobinHood",
        "title": "youll would fell like hiring me or at sit down to me for what im about to drop",
        "url": "https://www.reddit.com/r/RobinHood/comments/hkeauy/youll_would_fell_like_hiring_me_or_at_sit_down_to/",
        "created": 1593787500.0
    },
    {
        "author": "JDmexican_92",
        "created_utc": 1595020827,
        "id": "ht465y",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Announced yesterday, but it appears $BKYI has some good potential, especially with the growing use of online classes, and California also announced that several counties will need to remain closed for the fall semester. They acquired PistolStar and the use of PortalGuard for college and university use and will probably grow in necessity as students require user authentication for their online courses and activity. \n\n\nThere was a nice dip today and still seems like it's at a good low to get in. Open to discussion and your thoughts on this ticker.\n\n\n\nhttps://finance.yahoo.com/news/arcadia-university-selects-bio-keys-115800033.html\nhttps://finance.yahoo.com/news/california-north-orange-county-community-115710013.html",
        "subreddit": "RobinHoodPennyStocks",
        "title": "$BKYI Higher Education Identity/Access Management",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/ht465y/bkyi_higher_education_identityaccess_management/",
        "created": 1595049627.0
    }
]