[
    {
        "author": "bottlecapman2",
        "created_utc": 1596325255,
        "id": "i22aez",
        "num_comments": 108,
        "num_crossposts": 0,
        "selftext": "I see young adults on here posting about buying dividend growth stocks so they can live on the income during retirement two or three or more decades down the road. Is this really a smart approach?\n\nAren’t today’s well established, high growth, low-to-no dividend payout companies likely to be tomorrow’s dividend growth companies? And in the meantime, you’ve gotten a better total return and no taxation?\n\nI feel like, just by loading up on Microsoft, Apple, Visa, and Mastercard today (all of which do pay a (low yield) dividend), you’ve got a good chance of having a very nice dividend income stream in twenty years.",
        "subreddit": "investing",
        "title": "Dividend growth investing for young people",
        "url": "https://www.reddit.com/r/investing/comments/i22aez/dividend_growth_investing_for_young_people/",
        "created": 1596354055.0
    },
    {
        "author": "ryzu99",
        "created_utc": 1596392774,
        "id": "i2gxgm",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "Hi guys! I’ve been tinkering around with a theoretical portfolio and planning to make it my majority holdings in the foreseeable future. Do chip in your thoughts about it!\n\nAAPL - 5.57%\nMSFT - 10.44%\nAMZN - 9.52%\nFB - 9.17%\nGOOG - 6.91%\nNVDA - 10.3%\nADBE - 13.54%\nASML - 9.07%\nTSM - 7.48%\nV - 9.35%\nMA - 8.64%\n\nI think majority of the stock selections are pretty mainstream, picked to mimic QQQ. I personally added TSM and ASML as I’m a strong believer in semiconductors going forward.\n\nWhat differentiates the portfolio above and QQQ is the weights itself. Instead of adjusting it based on market cap, I’ve decided to optimise the weights above with a sole focus - to maximise Sortino Ratio.\n\nBacktested portfolio since Sept 2012 vs QQQ:\nCAGR - 36.71% vs 20.06%\nStDev - 16.97% vs 14.97%\nBest Year - 57.78% vs 38.96%\nWorst Year - 5.52% vs -3.63%\nSortino Ratio - 4.17 vs 2.28\n\nBy analysing the numbers above, it’s basically a less diverse portfolio with 11 holdings, higher StdDev but significantly higher returns, and a much more efficient fund. Even the worst year for it is still a positive return. \n\nYes I’m aware that my findings are based on historical prices and it doesn’t guarantee future returns",
        "subreddit": "investing",
        "title": "Portfolio Proposal (TechHeavy)",
        "url": "https://www.reddit.com/r/investing/comments/i2gxgm/portfolio_proposal_techheavy/",
        "created": 1596421574.0
    },
    {
        "author": "Klutzy_Hamster",
        "created_utc": 1596269258,
        "id": "i1oopd",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "SQ vs PYPL, V vs MA, AMD vs Intel, NET vs FSLY etc.\n\nI'm still kind of going back and forth on the optimal strategy. On the one hand it seems superfluous to hold two competing companies in the same sector. Just do the DD, pick the winner and run with it. On the other hand even competitors in the same niche tend to approach the problem in different ways. What is your general feeling on holding competitors?",
        "subreddit": "stocks",
        "title": "What is your view on holding competitors long term?",
        "url": "https://www.reddit.com/r/stocks/comments/i1oopd/what_is_your_view_on_holding_competitors_long_term/",
        "created": 1596298058.0
    },
    {
        "author": "eqpofr",
        "created_utc": 1596759886,
        "id": "i53pn9",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Since everyone has been talking about investing in SQ, I thought maybe we could start an open discussion about the risks of Square the business, whether or not we can continue to expect a skyrocketing share price in the years to come.\n\nI'll point out some things I'm iffy about, would like to get feedback on what you all think. Maybe there's things I'm not aware of.\n\n* Competitors. Square has a good product in an explosive growth industry, but I see their products easily replicable by Apple, Google, and PayPal. Should their business prove to have high demand and margins, there's no doubt FAANG giants will follow. Square has a head start, but do they have a competitive advantage? They have lots of commercial business data atm, but I'm doubtful of the value of that in today's market (more on that in my next point). They're beginning to collect consumer data, but imagine how much more data Visa and Mastercard has over them on that. Their technology is easily replicable by other big companies with enough resources to execute.\n* The limitations of the loan business. One of Square's most promising competitive advantages is that they provide loans to small businesses that show promising growth and room for expansion based on their revenue and profit which is logged into the Square system. There is an undeniable market of unserved small business owners that greatly benefit from this feature, but it's doubtful that this would unleash profits that wouldn't hit a low ceiling most of the time. For example, a hair salon can only purchase so many new salon chairs before they run out of customers to serve within that vicinity. Square could strike gold with a really profitable revolutionary small business, but I don't see why those businesses wouldn't be funded by VC's first before coming to Square. Even if they came to Square first, those businesses are one in a million. I do see Square making profits here, but not profits that would take them out of a niche player role.\n* The limitations of commercial business data. With current data limitations, it's impossible for Square's current technology to be an efficient evaluator of which businesses can achieve explosive growth and which ones will never escape low margins. There are too many non-numerical variables in determining a profitable business. Data technology and AI is not there yet.\n* Personal finance inertia. For Square to disrupt the banking industry, they need some clear advantage over banks. Why should we do the extra work of switching over if we are at an established bank? I'm not saying Square wouldn't be a better option than a traditional bank, but it takes a lot to turn the tide in an industry as conservative as the banking industry.\n\nFeel free to refute any of these concerns, maybe there's something really compelling to Square that I'm not seeing. If I'm wrong, I'd love to know.",
        "subreddit": "stocks",
        "title": "Doubts about Square (SQ) if they can continue to skyrocket in the next few years, open discussion on risks and competition",
        "url": "https://www.reddit.com/r/stocks/comments/i53pn9/doubts_about_square_sq_if_they_can_continue_to/",
        "created": 1596788686.0
    },
    {
        "author": "Trade_Theory",
        "created_utc": 1596513481,
        "id": "i3cbpg",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "The title says it all. Rate my portfolio. I've posted percent allocations of my stock portfolio. I do not plan to post dollar values in order to keep an unbiased opinion. My immediate plan is to sell out of PFF in its entirety and reallocate that position. If you could change one position, what would that be? I have no plans to withdraw funds or retire anytime in the near future. My primary investment objective is growth and secondary is income.\n\n&amp;#x200B;\n\n|PFF|12.2%|\n|:-|:-|\n|MSFT|10.1%|\n|SRET|9.1%|\n|V|5.7%|\n|NEE|4.6%|\n|AAPL|4.3%|\n|XLU|4.0%|\n|SOXX|3.0%|\n|WM|2.2%|\n|XLF|2.1%|\n|BRK.B|2.0%|\n|JJN|1.9%|\n|JPM|1.6%|\n|WFC|1.6%|\n|IWM|1.5%|\n|UAL|1.5%|\n|QCOM|1.5%|\n|NVDA|1.5%|\n|SPYG|1.4%|\n|MLHR|1.4%|\n|SLV|1.4%|\n|INTC|1.3%|\n|LRCX|1.3%|\n|GLD|1.2%|\n|XHB|1.2%|\n|DIS|1.2%|\n|AVGO|1.1%|\n|MA|1.0%|\n|C|1.0%|\n|QQQ|.9%|\n|PG|.9%|\n|AMD|.8%|\n|RTX|.8%|\n|XLE|.7%|\n|XOM|.7%|\n|MDT|.7%|\n|XLP|.6%|\n|BAC|.6%|\n|AEP|.6%|\n|JETS|.6%|\n|MGM|.5%|\n|RDFN|.5%|\n|BA|.5%|\n|XOP|.5%|\n|LOW|.5%|\n|JNJ|.5%|\n|STWD|.5%|\n|XLI|.5%|\n|KO|.5%|\n|TXN|.4%|\n|DAL|.4%|\n|MJ|.4%|\n|AAL|.4%|\n|SPG|.4%|\n|XLB|.4%|\n|XLV|.4%|\n|FISV|.3%|\n|T|.3%|\n|VNQ|.3%|\n|AMTD|.1%|",
        "subreddit": "investing",
        "title": "Rate my stock portfolio",
        "url": "https://www.reddit.com/r/investing/comments/i3cbpg/rate_my_stock_portfolio/",
        "created": 1596542281.0
    },
    {
        "author": "git_world",
        "created_utc": 1596285679,
        "id": "i1rl79",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Hi,\n\nCan someone please tell me why Visa and Mastercard are not on the S&amp;P 500 index? I thought they qualify with the market cap value,\n\nETF (S&amp;P 500 financial sector): [https://www.ishares.com/de/privatanleger/de/produkte/280523/ishares-sp-500-financials-sector-ucits-etf](https://www.ishares.com/de/privatanleger/de/produkte/280523/ishares-sp-500-financials-sector-ucits-etf)",
        "subreddit": "stocks",
        "title": "Why are Visa and Mastercard not on the S&amp;P 500?",
        "url": "https://www.reddit.com/r/stocks/comments/i1rl79/why_are_visa_and_mastercard_not_on_the_sp_500/",
        "created": 1596314479.0
    },
    {
        "author": "Trade_Theory",
        "created_utc": 1596513522,
        "id": "i3cc1k",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "The title says it all. Rate my portfolio. I've posted percent allocations of my stock portfolio. I do not plan to post dollar values in order to keep an unbiased opinion. My immediate plan is to sell out of PFF in its entirety and reallocate that position. If you could change one position, what would that be? I have no plans to withdraw funds or retire anytime in the near future. My primary investment objective is growth and secondary is income.\n\n&amp;#x200B;\n\n|PFF|12.2%|\n|:-|:-|\n|MSFT|10.1%|\n|SRET|9.1%|\n|V|5.7%|\n|NEE|4.6%|\n|AAPL|4.3%|\n|XLU|4.0%|\n|SOXX|3.0%|\n|WM|2.2%|\n|XLF|2.1%|\n|BRK.B|2.0%|\n|JJN|1.9%|\n|JPM|1.6%|\n|WFC|1.6%|\n|IWM|1.5%|\n|UAL|1.5%|\n|QCOM|1.5%|\n|NVDA|1.5%|\n|SPYG|1.4%|\n|MLHR|1.4%|\n|SLV|1.4%|\n|INTC|1.3%|\n|LRCX|1.3%|\n|GLD|1.2%|\n|XHB|1.2%|\n|DIS|1.2%|\n|AVGO|1.1%|\n|MA|1.0%|\n|C|1.0%|\n|QQQ|.9%|\n|PG|.9%|\n|AMD|.8%|\n|RTX|.8%|\n|XLE|.7%|\n|XOM|.7%|\n|MDT|.7%|\n|XLP|.6%|\n|BAC|.6%|\n|AEP|.6%|\n|JETS|.6%|\n|MGM|.5%|\n|RDFN|.5%|\n|BA|.5%|\n|XOP|.5%|\n|LOW|.5%|\n|JNJ|.5%|\n|STWD|.5%|\n|XLI|.5%|\n|KO|.5%|\n|TXN|.4%|\n|DAL|.4%|\n|MJ|.4%|\n|AAL|.4%|\n|SPG|.4%|\n|XLB|.4%|\n|XLV|.4%|\n|FISV|.3%|\n|T|.3%|\n|VNQ|.3%|\n|AMTD|.1%|",
        "subreddit": "StockMarket",
        "title": "Rate my stock portfolio",
        "url": "https://www.reddit.com/r/StockMarket/comments/i3cc1k/rate_my_stock_portfolio/",
        "created": 1596542322.0
    },
    {
        "author": "hydershykh",
        "created_utc": 1596761448,
        "id": "i543y1",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "So we've done pretty good in the last week and in yesterday's alerts with multiple alerts panning out really well e.g **$AAPL, $MELI, $SRNE, $NVAX, $SQ, $NKLA, $KNDI, $NFLX. $PDD** etc. I also posted a [detailed spreadsheet](https://docs.google.com/spreadsheets/d/1fT2P9JKxmnyZFFXEOl9QWBsqAqzTwYi-UXSPJ2InECw/edit?usp=sharing) with results from the last week. We had an accuracy of **75%** last week. Some alerts like **$TDOC** also did not pan out yesterday which just shows that the tool is not 100% perfect.\n\nThe tool is still very new so please be careful with all the alerts. **I would recommend paper trading these for a few days and doing your own DD as well**.  The overall accuracy is around 60-70% which means it can make mistakes.\n\nBullish    means the stock is expected to move up more than 1% from the current     close at least 1 day in the next 1-5 days. Bearish means the stock is  expected to stay the same or go low in the next few days.\n\n# Bullish Alerts\n\n**$ILMN** \\- Bullish probability of 88.43%. I know this dropped hard today but the tool is bullish on it. If it starts to go back, it will be a good setup. If it continue going down, don't get in. **Risky setup, careful!**\n\n**$NVAX** \\- Bullish probability of 77.14%. I like that it dropped today. Either get in if it touches the support at $160 and bounces back or get in on a pull back at the moving averages ([https://i.imgur.com/EXdP8y1.png](https://i.imgur.com/EXdP8y1.png))\n\n**$LULU** \\- Bullish probability of 74.80%. Seems like a good setup, especially with a small pullback ([https://i.imgur.com/5misOTH.png](https://i.imgur.com/5misOTH.png))\n\n**$FSLY** \\- Bullish probability of 74.46%. This dropped right at its 50 MA. A good setup as long as the price stays above 50MA ([https://i.imgur.com/GS9bBot.png](https://i.imgur.com/GS9bBot.png)). Exit otherwise.\n\n# Bearish Alerts\n\n**$BAC** \\-  Bearish probability of 86.76%. I like it for a bearish setup if it can below the support of $25.2 ([https://i.imgur.com/wAiBWbo.png](https://i.imgur.com/wAiBWbo.png)).\n\n**$ZNGA** \\-  Bearish probability of 83.96%. This is at a very strong support level at $9.9. **Do not get in unless it breaks the support** ([https://i.imgur.com/kUJuBgr.png](https://i.imgur.com/kUJuBgr.png)).\n\n**$GILD** \\-  Bearish probability of 82.68%. Might go up a bit before going down further. Healthcare stocks are risky though so be careful.\n\n**$WDC** \\-  Bearish probability of 82.66%. Only a good setup if price stays below the support level of $37.8 ([https://i.imgur.com/8ky7k3v.png](https://i.imgur.com/8ky7k3v.png))\n\n \n\n**Note:**  A lot of time has gone into these tools and it takes time to write  these alerts, look at    charts, and post them here. Would love for you  guys to **try out our** [discord](https://discord.gg/X2hHeJ) **channel** where I post alerts from various tools, not just the options one. Please hit me up if you want to link, it's free to join.\n\n**If you don't like these alerts, please don't be a hater, just ignore them. They are not perfect and I know that.**",
        "subreddit": "smallstreetbets",
        "title": "August 7th Alerts from My AI Options Tool | NVAX, FSLY, GILD, ILMN, BAC",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/i543y1/august_7th_alerts_from_my_ai_options_tool_nvax/",
        "created": 1596790248.0
    },
    {
        "author": "ArisenFall",
        "created_utc": 1596562923,
        "id": "i3nw3s",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Earnings is 8/13. \n\nIm thinking 265c expiring 8/21. The ramp up next week and following pump will be very lucrative. Ppl r already buying up calls.\n\nGet in now my bruddas, if u didnt make money of bezos make it off of Ma",
        "subreddit": "wallstreetbets",
        "title": "Baba",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i3nw3s/baba/",
        "created": 1596591723.0
    },
    {
        "author": "Wolf_Of_1337_Street",
        "created_utc": 1596286165,
        "id": "i1roxk",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "I have some new capital that I am looking to deploy, and am wondering if this sub has any quality names in mind that are still trading at good prices. \n\n\nSome names I currently like right now:\n\n\n• Visa / Mastercard \n\n• Waste Management\n\n• Ecolab\n\n• Blackstone\n\n• Honeywell\n\n• Lockheed\n\n• Raytheon\n\n• Southern Co.\n\n\n\nWhat are you guys looking at right now?\n\n\nHappy Saturday",
        "subreddit": "investing",
        "title": "Any Good Buying Opportunities Still Out There?",
        "url": "https://www.reddit.com/r/investing/comments/i1roxk/any_good_buying_opportunities_still_out_there/",
        "created": 1596314965.0
    },
    {
        "author": "SaltLyfe",
        "created_utc": 1596588156,
        "id": "i3vhri",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "RobinHood",
        "title": "After recent hacks posted I checked to be safe and found this device on my &amp; my SO RH accounts. Check the devices logged into your RH account... Three people have had the same MA Firefox device logged into their accounts...",
        "url": "https://i.redd.it/w3ns35dsy2f51.jpg",
        "created": 1596616956.0
    },
    {
        "author": "Longjumping_Brush883",
        "created_utc": 1596795267,
        "id": "i5b9ff",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Hello! Would really appreciate if I could get your feedback on my current portfolio / any advice on how to improve :)\n\nA bit of background on myself: I am 29 years old from Singapore and had put in about half my savings into 'safe' Singapore stocks pre-COVID (mainly local banks and the STI ETF) because my friends / family recommended that I do this (instead of leaving my money in the bank) years back when I was just starting out and had absolutely 0 knowledge about investing. I am currently down about US$11k but plan to keep the $ in for long term anyway.\n\nOnly at the height of COVID, some time in March, did I turn my attention to overseas exchanges (big regret starting so late). Since then I have pumped in about US$85k and to date I am up around US$14k overall. I mainly started with small positions to test the waters but added to my positions / bought new stocks over the last 4 months.\n\nThis is my current portfolio w rough stock weightage:\n\nSE 21% FVRR 13% PINS 8% NIO 7% TCEHY 7% AMZN 4% NFLX 4% BABA 3% GOOGL 3% FB 2% PDD 2% JD 2% ATVI 2% DIS 2% WDAY 2% MA 2% XOM 2% BP 2% V 1% MCD 1% AIR 1% KO 1% HLT 1% MAR 1% CINE 1% CCL 1% NCLH 1% DAL 1% PLAY 1% UAA 1%\n\nDisclaimer:\n\n* I know I have far too many stocks and am spread WAY too thin... have been wanting to trim and consolidate for a while. Admittedly I didn't really know what I was doing at the beginning and just bought small positions in many stocks :'(\n* I got greedy and bought some really bad stocks during the early June offline rally (i.e. airlines, cruises and PLAY) and I am kicking myself now. But hoping not to sell off any at a loss if possible to hold longer and wait for spikes\n* I am extremely bullish on tech, esp e-comm (clearly), mainly because I have been working in this industry and closely following big tech since I graduated from uni. Witnessed and experienced first-hand the rapid growth of e-comm in Southeast Asia and am very aware of the untapped potential. Unfortunately I had neither the foresight nor the gall to buy these stocks earlier…\n* All the money I have invested has been accrued from years of working, saving, and being stingy lol + profits from a small e-comm side business I run -- none from my parents!",
        "subreddit": "investing",
        "title": "Looking for feedback / advice on my portfolio :)",
        "url": "https://www.reddit.com/r/investing/comments/i5b9ff/looking_for_feedback_advice_on_my_portfolio/",
        "created": 1596824067.0
    },
    {
        "author": "King-Koz3",
        "created_utc": 1596483903,
        "id": "i3411c",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "ValueInvesting",
        "title": "Who are PayPal’s competitors? Seems like there’s no direct competition for them? Visa / MasterCard are comps but I don’t think of them as competition",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/i3411c/who_are_paypals_competitors_seems_like_theres_no/",
        "created": 1596512703.0
    },
    {
        "author": "admin-mod",
        "created_utc": 1596500883,
        "id": "i3954k",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "What does it mean for Mastercard stock when the company leadership is selling their shares frequently?",
        "url": "https://www.reddit.com/r/investing/comments/i3954k/what_does_it_mean_for_mastercard_stock_when_the/",
        "created": 1596529683.0
    },
    {
        "author": "theBacillus",
        "created_utc": 1596685439,
        "id": "i4kiid",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "VIX closed below the 200 MA",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i4kiid/vix_closed_below_the_200_ma/",
        "created": 1596714239.0
    }
]