[
    {
        "author": "Dashover",
        "created_utc": 1583801448,
        "id": "fg5cb8",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "\nFor Trading March 10th\n \nHISTORIC ACTION\n \nIs Cruising Over?\n \nEntire Yield Curve Under 1%\n \nToday’s market was down from overnight with the futures hitting “limit down” before 4:00AM.  The DJIA opened at 9:30, like always, but was halted within 4 minutes after hitting the “circuit-breakers” at -7% and trading was stopped for 15-minutes after which we reopened and headed lower again, touching -1946, and by noon we had recovered to only -1183, but by 3:00 we had made a new low of 23,706 -2158 before a rally to -1650 before another sell-off to close DJIA – 2013.76 (7.79%), NASDAQ -624.94 (7.29%), S&amp;P 500 -225.81 (7.60%), the Russell -135.79 (9.37%, and DJ Transports, the biggest loser -874.21 (9.76%).  Market internals were just short of absurd with numbers that I had to go to several sources to make sure were correct.  NYSE raw numbers were 70:2973 or 43:1 and NASDAQ was 169:3190 or 19:1. The DJIA was 30:0 after WMT, which held on all day fell into the red.  The biggest losers were not double, but triple-digit movers with BA -237, AAPL -155, GS -136, HD -123, CAT -117, and JPM -100DPs.  The only single digit losers were VZ and WMT.  It was an interesting day, but not one I’d like to see too often.  The market was influenced by not only COVID-19, but also the fact that OPEC couldn’t come up with an agreement to limit oil production.  Over the weekend Saudi Arabia declared a price war with Russia, the main opponent to any agreement.  Interest rates continued to fall, and that, along with the oil news sent the banking names down dramatically.  I’ll list those below in their sector.\n \nOur “open forum” on Discord, which allows me to interact with subscribers and others to allow direct questions and chart opinions on just about any stock, continues to grow with more participants every day.  It is informative and allows me to share insights as the market is open and moving.  The link is: https://discord.gg/ATvC7YZ  and I will be there and active from before the open and all day.  It’s a great place to share ideas and gain some insights.\n \nSECTORS: Other names in the news: It was a very tough day for everyone.  While we did have a “Merger Monday” deal between AON and WLTW, neither of the participants made any headway.  AON Plc, is buying Willis, Towers, Watson in the biggest insurance transaction ever and creating the world’s largest insurance broker, surpassing Marsh &amp; McLennan (MMC) and worth about $80Billion.\n \nThere were a couple of names higher, just a few, and the main ones were in the auto parts segment with ORLY finishing $373.63 +5.55 (1.51%), AZO, $1113.69 +53.38 (5.03%) and AAP $130.36 +2.45 (1.92%).  This group has been weak for the past 4-6 months.  Also higher was discounter DLTR, $83.51 +3.27 (4.08%).\n \nThe Cruise lines continued to fall with all making new lows.  RCL fell to $48.27 - 16.74 (25.75%) and down from $135 in January.  CCL fell to $21.74 -5.41 (19.93%) and down from $52, while NCLH was $19.81 – 7.29 (26.9%) and down from $60.  This is absolutely uninvestable. There will clearly be a point at which the shorts cover, but this group is dead money for a while.\n \nIn more COVID-19 news, Inovio (INO) which moved from $2.40 to $16.00 on the news that it would start human trials of its vaccine in April.  This morning at $19.36 before collapsing all the way back to $8.53 before closing $9.83 -4.26 (30.23%).\n \nBut the HOMERUN OF THE DAY was another name I talked about in this space, AIM Immuno-Tech, Inc (AIM).  The company said that its drug, Ampligen will begin testing at National Inst. Of Infectious Diseases in Japan that could play an important role in developing a protective early-onset therapy for COVID-19.  The stock has been reverse split both 1:12 in 2016 and more recently 1:44 last June and traded under $ .40 had moved up to $3.50 this month and traded up on the news finishing $6.10 +4.00 (190%) and is continuing in extended hours to $8.75 and is currently $7.69 up an additional $1.59 for a total gain of $5.59 (266%).  Quite a highlight on a dismal day.\n \n \nBIOPHARMA: was LOWER with all names falling hard with BIIB -20.76, ABBV -3.55, REGN -20.58, ISRG -44.48, MYL -1.19, TEVA -1.42, VRTX -13.85, BHC -2.69, INCY -4.42, ICPT -6.88, LABU -11.47 (24.95%), and IBB $109.80 -8.23 (6.97%).\n \nCANNABIS: stocks were LOWER with TLRY -2.47 (24.65%) and KERN -2.58 (37.34%) and none down less than 7.48%.  The ETF, MJ $11.74 -1.36 (10.38%).\n \nDEFENSE: was LOWER with some major loses by LMT -31.47, RTN -14.83, GD -13.01, TXT -5.48 (15.26%), UTX -12.48, NOC -15.58, BWXT -5.14, TDY -33.73, and ITA was $174.00 -21.04 (10.79%).\n \nRETAIL was LOWER with major losses. The brands were the biggest losers on the day.   M-1.12, JWN -1.88, KSS -2.84, DDS -2.37, JCP - .015, WMT -1.17, TGT -1.92, TJX -1.35, RL -10.78 (10.19%), UAA -1.46 (11.56%), LULU -22.44 (10.27%), TPR -3.35 (15.44%), CPRI -3.13 (13.65%) and XRT $37.01 -2.12 (5.42%).\n \nFAANG and Big Cap: were LOWER with GOOGL -80.14, AMZN -96.19, AAPL -21.42, FB -11.40, NFLX -22.48, NVDA -21.04, IBM -10.38, TSLA -92.48 (13.01%), BABA -7.24, BIDU -8.52, BA -36.22 (13.81%) on continuing problems with the 737MAX and the general market, CAT -16.42 (13.52%), DIS -10.55, and XLK $82.84 -6.07 (6.83%).\n \nFINANCIALS were LOWER with most down over 10% with the market and softness in rates with GS -19.14, JPM -13.53, BAC -3.59, MS -4.35, C -9.34, PNC -15.48, AIG -5.13, TRV -8.54, AXP -9.94, and XLF $22.80 -2.75 (10.76%).\n \nOIL, $31.13 -10.15 (24.58%) The stocks were LOWER with the dramatic fall on the “price war” between the Saudi’s and Putin.  It’s difficult to even relate to the prices I’m seeing.  In August when OXY bought APC for $57billion OXY was just over $50. Tonight it closed $12.51 –14.35 (53.43%) and the COMBINED market-cap is only $11.4Billion.  The rest of the list was equally bad with CVX -13.42, XOM -4.94, MRO 4.06 -2.77 (40.56%), MPC -5.43, APA 10.22 -10.48 (50.6%), BP -5.66 and XLE $34.98 -7.52 (17.69%).\n \nMETALS, GOLD: $1,675.70 +3.30. After the rebound, and the overnight move to $1,704.30 we sold off as liquidation hit even the yellow metal.  We managed to close up on the day, but it was a disappointment just the same.  Our $1.40 position in the GLD calls finished $1.65 +.11.\n \nBITCOIN: closed $7,850 -1,315. We broke to the downside overnight and fell to a low of $7,640, which closed a gap left on the breakout back in January.  While I want to add the 350 sold just over a week ago, I want to wait and see some stabilization.  We did have 2 subscribers add to new positions under the close today.  But we still own 400 GBTC with an average of $8.06. GBTC closed $8.86 – 1.72 today.\n \nTomorrow is another day.\n \nCAM",
        "subreddit": "options",
        "title": "Ouch!",
        "url": "https://www.reddit.com/r/options/comments/fg5cb8/ouch/",
        "created": 1583830248.0
    },
    {
        "author": "Dashover",
        "created_utc": 1584668979,
        "id": "flmgan",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "For Trading March 20th\n \nAnother Range Day\n \nYields Fall\n \nOil Rebounds\n \n \nYesterday I said that “today’s market was actually not as bad as it seemed.”  And today while we had a sharp decline early, we rallied back up toward yesterday’s  highs, and when the dust settled we were DJIA +188.27 (.95%), NASDAQ +160.74 (2.3%), S&amp;P 500 +11.29 (.47%), the Russell +67.52 (6.81%) and DJ Transports +107.29 (1.54%).  Also, yesterday I said “the obvious culprit was the Oil.  After the close, the oil bounced and held most of the gains until it had rallied up about 24% and closed $25.91 +5.08 after trading as high as $28.28.  Market internals were better with the A/D on NYSE at 3:1, and about the same on NASDAQ.  The DJIA was 17 Up, 13 Down, and for the first time in over a week, there were no triple-digit losers or gainers.  The biggest movers were MCD +83 and GS +64 on the upside and JNJ -54 DPs. Strong sectors included Energy and consumer discretionary, while the weak included utilities, consumer stables, health care and real estate.  The technology and small caps outperformed.  The thought that Mr. Trump has the relationship or talent as an arbitrator to settle a dispute between the Kingdom and Putin the thug is unlikely.  I also issued a YouTube video (#151) on today’s closing comments:  https://youtu.be/spf45YUFaxc\n \n \n \nOur “open forum” on Discord, which allows me to interact with subscribers and others to allow direct questions and chart opinions on just about any stock, continues to grow with more participants every day.  It is informative and allows me to share insights as the market is open and moving.  The link is: https://discord.gg/ATvC7YZ  and I will be there and active from before the open and all day.  It’s a great place to share ideas and gain some insights.\n \n \nSECTORS: Other names in the news: While there is plenty to discuss, I’ll just hit a few high points.  All U.S. industries are lining up with their hands out looking for their piece of however many trillions of dollars and favorable legislation they can extract through their state politicians.  While I get that nobody in the cruise industry, or the hotel and allied hospitality sectors or any manufacturing business had any fault in COVID-19, at some point in time, they must take responsibility for the cash they squandered on stock buybacks instead retaining earnings for when the business cycle went through a slowdown.  I know I’ve railed about this for a while, but Capitalism works because it enforces some degree of fiscal responsibility on the operators of business.  And if they fail, they fail.  That what the bankruptcy laws are about.  If you need a primer on it, just ask the president. If you run a business into the ground, by any means, you lose.\n \nOn the rocket to “almost the moon” followed by a crash and burn, we had Blue Apron (APRN) started the week at $2.28 and yesterday it closed $16.25 +9.70, but today after trading $28.84 before collapsing to finish $14.34 -1.91 (11.75%).  In case you forgot, this little beauty was reverse split 1:15 last year, so todays close is still under $1.00.\n \nBIOPHARMA: was HIGHER with TEVA the big winner @ $8.10 +1.41 (21.08%) on the news that it is a manufacturer of Hydroxychloroquine Sulfate, a potential treatment for COVID-19 and are donating the tablets to hospitals nationwide.  ICPT was +8.80 (18.20%), LABU +2.11 (14.36%) and IBB $99.51 +1.18 (1.2%).\n \n \nCANNABIS: Even this group had some winners with TLRY +1.16 (46.96%), PYX, yesterday’s biggest loser bounced back to close +.40 (27.59%) and MJ $9.65 +.55 (6.04%).\n \nDEFENSE: was MIXED with LMT -20.14 (6.12%), RTN +6.39, and yesterday’s big loser, TDY +25.06 (12.46%), and ITA $126.19 +2.78 (2.25%).\n \nRETAIL was MIXED with JWN +1.49 (7.54%), DDS +4.78 (12%), and WMT -3.34, RL –3.11, UAA +.94 (10.99%), CPRI +2.40 (31.91%) and XRT $29.27 +1.52 (5.48%).\n \n \nFAANG and Big Cap: were MOSTLY HIGHER with GOOGL +19.30, AMZN +43.00, AAPL -3.42, FB +3.94, NFLX +18.54, NVDA +7.48, IBM -4.50, TSLA +32.78(9.07%), BABA +1.00, BIDU +5.50, BA -7.08, CAT +1.69, DIS +4.45 and XLK $74.85 +.27 (.36%).\n \n \nFINANCIALS were MIXED with GS +4.70, JPM -.19, BAC -.04, MS -.14, C +2.57, PNC +4.76, AIG +1.77 (9.42%), TRV +4.38, AXP +1.65, and XLF $19.61 +.42 (2.19%).\n \n \nOIL, $5.91 +5.08. The stocks were HIGHER with the price of Oil trading as high as 28.28).  The oil is slightly higher in extended hours and XLE is $25.61 +1.63 (6.8%).\n \n \nMETALS, GOLD: $1,479.30 +1.40. After the liquidation of the past few day’s gold tried to work higher but gave it up closing barely changed.  I still expect a move back toward $1,600 to unfold.  \n \n \nBITCOIN: closed $6240 +900. We broke to the downside overnight and fell to a low of $4390, and for the first time in days did not make a new recent low.  Today was a strong move to the upside While I want to add the 350 sold just over a week ago, I want to wait and see some stabilization.  We still own 400 GBTC with an average of $8.06. GBTC closed $7.25 +1.24 today.\n \nTomorrow is another day.\n \nCAM",
        "subreddit": "options",
        "title": "For Trading March 20",
        "url": "https://www.reddit.com/r/options/comments/flmgan/for_trading_march_20/",
        "created": 1584697779.0
    },
    {
        "author": "Dashover",
        "created_utc": 1585181315,
        "id": "fp1dcj",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "For Trading March 26th\n \nSanders Foils Rally\n \nBA Drives the DJIA\n \n \n \nToday was driven early by BA and the statement that it would not need to accept the kind of share dilution that would be part of a government bailout.  The market seemed to take that as a good thing, at least for BA, which has rebounded from $89.00 to a high of $174.77 in the last week.  This dragged the DJIA higher but left the S&amp;P and NASDAQ down at the open.  We had a great deal of enthusiasm in both directions but by late in the day everyone was in the green.  While there were selloffs in all the indexes on the news that Bernie Sanders would oppose the current relief legislation because it gave corporations to easy a time, and Ms. AOC saying that she MAY oppose the unanimous consent resolution, which would delay financial relief, we finished with the DJIA +495.55 (2.39%), NASDAQ – 33.56 (.45%) and S&amp;P 500 +28.23 !.15%), the Russell +13.83 (1.26%) and the DJ Transports +184.07 (2.44%) the biggest winner, but off 424 off its high.  Market internals were okay, with NYSE 4:1 and NASDAQ only 1.7:1 up.  The DJIA was 18:12 higher but the biggest 5 gainers, BA +210, UNH +100, UTX +63, V +50 and AXP +24DP’s added up to a gain of $465.\nThis the link to my closing comment:  https://youtu.be/BW3S_KKvjAo\n \nUnfortunately we bought some SPY puts (a small position) at $3.20 that closed @ $2.91, and were stopped out @ $1.58 today.\n \n \nOur “open forum” on Discord, which allows me to interact with subscribers and others to allow direct questions and chart opinions on just about any stock, continues to grow with more participants every day.  It is informative and allows me to share insights as the market is open and moving.  The link is: https://discord.gg/ATvC7YZ  and I will be there and active from before the open and all day.  It’s a great place to share ideas and gain some insights, and we’ve grown to almost 800 members.\n \n \nSECTORS: Other names in the news: As mentioned above, we had the BA announcement, and after falling in the last 2 months from $350 to a low of $89, (75%), it was as high as $174.77 today but closed $155.00 +27.32 (21.4%).  NKE had earnings after the close last night and after falling from $95 to $60, has rebounded to close today $79.01 +6.68 (9.24%).  \n \n \nBIOPHARMA: was MIXED with ISRG the big gainer +28.41 (6.58%) and ICPT +3.97 (6.84%).  VRTX was the biggest loser -13.04 (5.84%). The IBB was $102.00 -.57 (.55%).\n \n \nCANNABIS: This group finally caught a bid on the news that several reported big jumps in revenues in California with TLRY + 1.38 (34.33%), still not impressive after falling from $300, CGC +1.02 (7.86%), CRON +.20, GWPH +1.25, ACB +.04, PYX +.14, NBEV +.05, CURLF -.38 (9.79%), KERN +.78 (18.13%) and MJ $11.45 +1.04 (9.99%).\n \n \nDEFENSE: was HIGHER with none up less than 5% and several gainers like LMT +33.34 (11.54%), TXT +3.05 (13.27%), UTX +9.43 (10.87% and 63 DPs), TDY +21.17 (7.97%) with ITA $147.97 +16.80 (12.81%).\n \n \nRETAIL was MIXED with the retailers mixed but the brands all higher.  M +.91 (16.06%), JWN -.26, KSS +1.25, DDS -2.29 (4.87%) and WMT -5.53 (4.81%) while RL +1.13, UAA +.14, LULU +2.51, TPR +1.18 (8.6%), CPRI +1.78 (16.02%) and XRT $30.26 +.52 (1.75%).\n \n \nFAANG and Big Cap: were MIXED with GOOGL -26.01, AMZN -46.10, AAPL +.18, FB -3.88, NFLX -14.71, NVDA -.95, IBM +.52, TSLA +35.00, BABA +4.25, BIDU +.82, BA +37.07, CAT +2.66, DIS +3.00, and XLK $77.50 -.11 (.14%).\n \n \nFINANCIALS were HIGHER with only TRV lower -2.05 (2.19%).  AIG was the biggest gainer +2.79 (12.17%) followed by AXP +6.59 (7.84%) and JPM +3.07 (3.47%).  XLF was $20.33 +.48 (2.42%).\n \n \nOIL, $24.49 +.48. The stocks were HIGHER with the price of Oil trading up slightly but the stocks trading with the overall market.  MPC was the leader +3.85 (22%), BP +2.35 (10.62%), CVX +2.74 (4.12% and XLE $28.33 +.98 (3.58%).\n \n \nMETALS, GOLD: $1,633.40 -27.40 After the biggest I’ve ever seen in 50+years of trading.  We sold our calls yesterday and after trading down to $1615, I am interested again.  I put out this short video this afternoon…  https://youtu.be/2vCymNxtNA4\n \n \nBITCOIN: closed $6630 -95. We traded in a short range again today and finished mid-range on the day. While I want to add the 350 sold just over a week ago, I want to wait and see some stabilization.  We still own 400 GBTC with an average of $8.06. GBTC closed $7.35 -.20 today.\n \nTomorrow is another day.\n \nCAM",
        "subreddit": "options",
        "title": "For Trading March 26th",
        "url": "https://www.reddit.com/r/options/comments/fp1dcj/for_trading_march_26th/",
        "created": 1585210115.0
    },
    {
        "author": "Dashover",
        "created_utc": 1584581081,
        "id": "fl1c3x",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "\nFor Trading March 19th\n \nAnother Halt!\n \nYields Rise\n \nOil Collapse\n \n \nToday’s market was actually not as bad as it seemed.  We finally got some dramatic action on the downside, and a rally back up into the range that I thought we were building yesterday.  The obvious culprit was the Oil.  In case you missed it, here is my midday video, #148  https://youtu.be/7eKv4Z2Qox0 .  I’m going off script because I have several issues to discuss, and frankly, I’m not really sure we need to go over all the damage that seems to have been done.  First of all, the big numbers: DJIA -1338.46 (6.3%) after being -2320, NASDAQ -344.94 (4.7%) after being -648, S&amp;P 500 -131.09 (5.18%) after being -249, the Russell -115.50 (10.44%), and the DJ Transports -496.79 (6.65%) after being -987.  Internals were NYSE 15:1 and NASDAQ 8.9:1.  Volume increased, especially on NASDAQ.  The rally came late in the day and while there was an ECB stimulus package and China lowering rates, it felt to me as if the we were just so “wrung out” that we were due a bounce.\n \nAnother issue that came to the surface was provided by Bill Ackman of Pershing Square fame, who called into CNBC and gave, without question, the worst-case scenario for the state of the world.  His degree of panic was palpable and frankly a bit overboard.  In all his doom and gloom, he also said he was buying selected stocks.  He called for the total shutdown of the country for 30 days.  I find that as I’ve always said, “everyone is never right” and EVERYONE is panicked.  Buy the fear, sell the greed works for me too.  Frankly, it scares me too, and that goes into the buy column.  Here’s the Ackman call-in:  https://www.cnbc.com/2020/03/18/bill-ackman-pleads-to-trump-to-increase-closures-to-save-the-economy-shut-it-down-now.html\n \nMy other issue is one that I’ve railed about for months.  Buybacks.  If you had any doubt of the BS basis for buybacks, the last week should solve it.  Now that these companies have been buying stock and cutting their share count to inflate their earnings at the cost of (not the benefit of) shareholder.  The fact that most companies have cut off their buying is the giveaway.  The point of buybacks is to use your excess cash for the betterment of the firm.  At what point on the downside should you be buying stock back?  Any time that prices are depressed, and you can’t find a better use for the cash.  This is EXACTLY THE OPPOSITE OF WHAT THE CORPORATIONS HAVE DONE. It shows their true intent, and it is disgraceful.  That’s all I have to say about it, except that you can count on the massive class-action suits that will be brought.\n \n \n \nOur “open forum” on Discord, which allows me to interact with subscribers and others to allow direct questions and chart opinions on just about any stock, continues to grow with more participants every day.  It is informative and allows me to share insights as the market is open and moving.  The link is: https://discord.gg/ATvC7YZ  and I will be there and active from before the open and all day.  It’s a great place to share ideas and gain some insights.\n \n \nSECTORS: Other names in the news: While there is plenty to discuss, I’ll just hit a few high points.  All U.S. automakers closing production.  Marriott laying off workers and closing many hotels completely and in other floors.  Airlines cutting capacity. DAL which 10 days ago said 15%, upped it to 40%, now cutting 70%. Shelter in place expected in many major U.S. cities.  If you think it can’t get worse, wait a few minutes.  But, as I said above, that’s a time to buy, not sell.  \n \n \nBIOPHARMA: was LOWER with most falling sharply, and only gainers REGN +3.31 and VRTX +8.36 (3.97%).  IBB was $99.97 -1.33 (1.31%).\n \n \nCANNABIS: stocks aren’t even worth reporting with losses from the best, GWPH only down 2.85 (3.42%) and the worst PYX -.65 (30.95%).  MJ $9.10 -.85 (8.54%).\n \n \nDEFENSE: was MOSTLY LOWER with LMT +20.17 (6.33%) and NOC +5.67 (1.78%) and TDY -58.88 (22.57%) the biggest loser.  ITA was $124.90 -12.15 (8.87%).\n \n \nRETAIL was MIXED with JWN +1.47 (7.85%), DDS +2.74 (7.39%), and WMT +5.44 (4.56%) and JCP -.08 (16.34%), and UAA -.97 (9.83%) the biggest loser.  XRT was $27.75 -2.39 (7.93%).\n \n \nFAANG and Big Cap: were MIXED with GOOGL -26.87, AMZN +22.16, AAPL -6.19, FB -2.46, NFLX -4.28, NVDA -14.45, TSLA -68.98 (16.03%), BABA -4.81, BA -22.25 (17.92%), DIS -4.73 and XLK $76.35 -1.15 (1.48%).  This group was down much harder but rallied late and are higher in extended hours.\n \n \nFINANCIALS were LOWER with insurance stocks the worst.  TRV -14.41 (14.95%), AIG -2.80 (12.58%) the banks all down from 3 to 9%, and XLF $19.77 -1.20 (5.72%).\n \n \nOIL, $20.83 -6.50 The stocks were LOWER with the price of Oil trying to hold $24.00 and fell quickly on the break there touching $20.06.  XLE was $23.98 -4.02 (14.36%).  The oil rallied in extended hours and is currently $23.23 +2.40.\n \n \nMETALS, GOLD: $1,477.47.90 After the liquidation of the past few day’s gold tried to work higher but gave it up when the oil cracked $24.00.  I still expect a move back toward $1,600 to unfold.  \n \n \nBITCOIN: closed $5340 -40. We broke to the downside overnight and fell to a low of $4390, and for the first time in days did not make a new recent low.  Today was another “inside day” which is generally indecisive. While I want to add the 350 sold just over a week ago, I want to wait and see some stabilization.  We still own 400 GBTC with an average of $8.06. GBTC closed $6.01 -.09 today.\n \nTomorrow is another day.\n \nCAM",
        "subreddit": "options",
        "title": "For Trading March 19th",
        "url": "https://www.reddit.com/r/options/comments/fl1c3x/for_trading_march_19th/",
        "created": 1584609881.0
    },
    {
        "author": "Dashover",
        "created_utc": 1583975697,
        "id": "fh8525",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "\nFor Trading March 12th\n \nBA CRASHES MARKET\n \nTRAVEL BUSINESSES COLLAPSE\n \nYields Improve\n \nToday’s market was pounded from the start with the futures overnight falling on the lack of the president showing up after he said he would be appearing and the fact that there were no specifics of his “plan” to address the issues.  After trading down all morning to -1067 around 11:45 rates started to firm and we had a rally back to -787, but then rates slipped and we headed to 1665 before a close -1464.94 (5.86%), NASDAQ -382.20 (4.7%), S&amp;P 500 -140.86 (4.89%), the Russell -86.60 (6.41%) and the DJ Transports -394.75 (4.63%).  Clearly, the biggest drag on the market was BA -284 DP’s, one of the reasons that the DJIA was a bigger percentage leader on the downside.  Market internals were weak with the NYSE 18:1 and the NASDAQ 7.1:1 negative.  All of the DJIA stocks were lower with only 2 NOT down in double digits.  Between the declaration that the WHO put out calling the COVID-19 a “World-wide Pandemic,” and the banning of spectators at sports events in Washington State and bans on events in San Francisco of over 1000 people, things only got worse when BA declared that it was taking down a $13.8 billion line of credit and a hiring freeze.  Since the close, the NCAA has said that March Madness games will also be played without spectators.  Even the late- night TV shows are stopping live audiences by this weekend.  The one thing that I feel I have to stress here is that this IS NOT A FINANCIAL CRISIS, IT IS A HEALTH CRISIS.  While that does little to take the sting out of a 20% decline, it is not a bank (or banks) failure.  I know it doesn’t help, but it is the fact.  And frankly, the panic is overdone.\n \nOur “open forum” on Discord, which allows me to interact with subscribers and others to allow direct questions and chart opinions on just about any stock, continues to grow with more participants every day.  It is informative and allows me to share insights as the market is open and moving.  The link is: https://discord.gg/ATvC7YZ  and I will be there and active from before the open and all day.  It’s a great place to share ideas and gain some insights.\n \nSECTORS: Other names in the news: It was a debacle of a day for the same names as for the last 2 weeks with airlines, cruises, booking companies, and finally BA, the biggest aircraft manufacturer in the world falling.  In the airlines we had JBLU -1.01 (6.93%), UAL – 3.22 (6.13%), LUV -307 (6.74%) and DAL -2.80 (6.16%).  The cruise lines continued with all down dramatically, but none as bad as NCLH today -5.47 (26.7%), CCL -2.27 (9.45%), and RCL -7.30 (14.13%).  The bookers followed with BKNG -116.50 (7.47%) and EXPE –9.26 (10.7%).  \n \nAs mentioned, BA gets a double (or maybe triple) shot with their 737MAX troubles, yesterday’s issue with wiring bundles, the airlines canceling orders and the fact that they drew on a massive $13.8billion line of credit today.  The stock, the leader on the upside moving from $102 in 2016 to a peak of $446 last March has fallen back to 2017 levels, closing $189.08 -73.25 this week and -41.93 (18.15%) today.\n \n \nBIOPHARMA: was LOWER with none down less than 2.7% and BIIB -11.38, ABBV -2.53, REGN -10.32, ISRG -27.85, MYL -.58, TEVA -.35, VRTX -8.06, BHC -.61, INCY -2.41, ICPT -8.42 (9.29%), LABU -7.07 (18.72%) and IBB $107.70 -4.61 (4.10%).\n \nCANNABIS: stocks were LOWER again with TLRY -.69, CGC -.71, CRON -.03, GWPH -6.49, ACB -.09, PYX -.32, NBEV- .18, CURLF -.22 and the only winner KERN, maker of compliance software, 5.76 +.86 (17.55%) and MJ $11.34 -.80 (6.59%).\n \nDEFENSE: was SHARLY LOWER with -10.24, RTN -14.12, GD -6.85, TXT -3.85 (11.29%), UTX -11.71 (9.81%), NOC -17.04, BWXT -.34, TDY -15.98, and ITA $116.77 -16.54 (9.02%).\n \nRETAIL was LOWER with the brands only slightly better on the day.   M-.79, JWN -3.08 (11.36%), KSS -2.96, DDS -4.04, JCP -.068 (12.11%), WMT -4.81, TGT -2.75, TJX -2.36, RL -8.24, UAA -.37, LULU -10.38, TPR -1.59, CPRI -2.04 (9.97%), NKE -4.30 (4.87%) on Adidas earnings and guidance, and XRT $34.97 -2.70 (7.17%).\n \nFAANG and Big Cap: were LOWER with GOOGL -54.17, AMZN -57.62, AAPL -7.65, FB -6.64, NFLX -11.64, NVDA -12.39, IBM -5.51, TSLA –2.33, BABA -6.88, BIDU 2.51, BA (see above), CAT -5.80, DIS -5.27, and XLK $84.10 -3.54 (4.04%)\n \nFINANCIALS were LOWER with the market and a visit with the president didn’t seem to help.  GS -10.10, JMP -3.93, BAC -.81, MS -2.30, MS -2.30, C -4.26, PNC -6.10, AIG -2.64, TRV -5.77, AXP -6.85 and XLF $23.00 -1.15 (4.76%).\n \n \nOIL, $3432.98 -1.38 The stocks were LOWER with the price of Oil trying to rally and making it to $36.35 before turning back down and closing near the lows.  I’m still stand aside this market since it has a lot of work to do to rebuild a base to define the risk.  XLE finished $34.25 -1.30 (3.66%).\n \nMETALS, GOLD: $1,642 -13.80. After the rebound, and the overnight move to $1,704.30 we sold off as liquidation hit even the yellow metal.  We finished nearer the low, and we continued lower today.  \n \nBITCOIN: closed $7,855 -140. We broke to the downside overnight and fell to a low of $7,640, which closed a gap left on the breakout back in January.  While I want to add the 350 sold just over a week ago, I want to wait and see some stabilization.  We still own 400 GBTC with an average of $8.06. GBTC closed $8.64 -62 today.\n \nTomorrow is another day.\n \nCAM",
        "subreddit": "options",
        "title": "Bad Action!",
        "url": "https://www.reddit.com/r/options/comments/fh8525/bad_action/",
        "created": 1584004497.0
    },
    {
        "author": "Dashover",
        "created_utc": 1584498604,
        "id": "fki44i",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "\n \nFor Trading March 18th\n \nFinally, A Range!\n \nYields Rise\n \nOil Defensive\n \nHAPPY ST. PATRICK’S DAY!!\n \nI can’t believe that I had to search around to find a restaurant that was open for me to pick up dinner since I wasn’t spending any time in a grocery store to buy the ingredients.  \n \nToday’s market was the first day that we had any real “horizontal” action, and frankly, it was a much calmer day.  We had a day that was higher at the open, fell back to -200 or so, but then something different happened, it went back to the plus side.  Here’s the video I did this evening: https://youtu.be/coWMsic-3xU .  Unfortunately, I also did one on the Oil, which concerns me since it looks to me as if it may be setting up for another down leg.  But for the day, we were higher across the board with DJIA +1048.86 (5.2%), NASDAQ +430.19 (6.23%), S&amp;P 500 +143.05 (6%), the Russell +69.09 (6.66%), and the DJ Transports +444.79 (6.33%).  Market internals were also tame (disappointing) with NYSE a subdued 1.5:1 up and the Naz. only slightly better at 2:1. The DJIA was 27:3 with only 4 single digit movers and, surprisingly only 1 triple-digit gainer, UNH +130DPs.  The biggest loser, as usual, was BA -40DPs.  \n \n \nOur “open forum” on Discord, which allows me to interact with subscribers and others to allow direct questions and chart opinions on just about any stock, continues to grow with more participants every day.  It is informative and allows me to share insights as the market is open and moving.  The link is: https://discord.gg/ATvC7YZ  and I will be there and active from before the open and all day.  It’s a great place to share ideas and gain some insights.\n \n \nSECTORS: Other names in the news: The news of the FED commercial paper facility was helpful, but the fall in retail sales was a disappointment and the direct payment to taxpayers or tax cuts helped, but Mayor De Blasio’s comments about residents going to “shelter in place” status, like San Francisco, was not taken well.  Energy concerns and defensiveness that is unknowable at this point sent MAR – 11.18 (12.9%) as it started to furlough workers.  DKS -2.59 (12.22%) got several downgrades in price objectives and after touching just under $40 last week on earnings has fallen all the way toward being a teenager at $18.60.  Housing starts, building permits and mortgage applications come tomorrow.  \n \n \nBIOPHARMA: was HIGHER with most rising only slightly, and the major multipoint gainer being REGN +56.17 (12.74%), BIIB +23.60 (8.38%), ABBV -2.32, ISRG +21.19, MYL +.22, TEVA +.19, VRTX +1.83, BHC -.76, INCY -1.23, ICPT +1.45, LABU +.18, and IBB $100.01 +5.62 (5.95%).\n \n \nCANNABIS: stocks were MIXED with TLRY -.11, CGC -.23, CRON -.26, GWPH, the big gainer, +9.52 (13.13%), ACB +.01, PYX +.23, NBEV +.05, CURLF -.17, KERN +.54 (12.98%), and MJ $9.95 +.51 (5.4%).\n \n \nDEFENSE: was MIXED with LMT +22.06, RTN -4.58, GD +1.20, TXT +1.20, UTX +1.04, NOC +27.41 (9.7%), BWXT -1.11, TDY +6.02, and ITA $133 -1.18 (.88%).\n \n \nRETAIL was MIXED with M-.31, JWN +1.17, KSS -2.40, DDS +2.24, JCP -.07 (12.28%), WMT +10.42 (9.76%), TGT +7.21 (7.69%), TJX unch., RL +1.91, UAA -.12, LULU +5.02, TPR +1.62 (14.11%), CPRI -1.69 (17.49%) and XRT $30.14 +1.48 (5.16%).\n \n \nFAANG and Big Cap: were HIGHER with GOOGL +45.06, AMZN +76.85, AAPL +1.79, FB -2.01, NFLX +11.16, NVDA +14.60, IBM +1.92, TSLA -37.50, BABA +3.21, BIDU -2.51, BA -17.31, CAT +1.60, DIS -3.76, and XLK 76.35 +3.79 (5.22%).\n \n \nFINANCIALS were MIXED with GS -.66, JPM +2.54, BAC +.69, MS +1.35, C -1.96, PNC +3.03, AIG -1.25, TRV +7.90, AXP -2.87 and XLF $20.20 +.31 (1.56%).\n \n \nOIL, $26.95 –1.75 The stocks were LOWER with the price of Oil trying to hold $30.00 initially but turning back down and breaking $29.00. This puts it back near the 2016 lows just under $27.00. Today’s move to below $27.00 is ominous. XLE finished $28.00 +.19 (.68%). Today’s Video  https://youtu.be/D4QXK21NMAs\n \nMETALS, GOLD: $1,1525.80 +39.30. After the liquidation of the past few day’s gold worked its way higher today.  I expect a move back toward $1,600 to unfold.  \n \n \nBITCOIN: closed $5,380 +450. We broke to the downside overnight and fell to a low of $4390, and for the first time in days did not make a new recent low.  Today was another “inside day” which is generally indecisive. While I want to add the 350 sold just over a week ago, I want to wait and see some stabilization.  We still own 400 GBTC with an average of $8.06. GBTC closed $6.10 +.56 today.\n \nTomorrow is another day.\n \nCAM",
        "subreddit": "options",
        "title": "For Trading March 18th",
        "url": "https://www.reddit.com/r/options/comments/fki44i/for_trading_march_18th/",
        "created": 1584527404.0
    },
    {
        "author": "Dashover",
        "created_utc": 1584408841,
        "id": "fjwnmr",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "\nFor Trading March 17th\n \nMarkets Halted Again\nFED Move Fails to Help\n \nYields Steady\n \nToday’s market was pounded from the start with the futures overnight falling to down “the limit” prior to our open and were halted almost immediately.  We came close to the second halt, but the market stabilized, sort of, and traded without much enthusiasm until Mr. Trump started to speak, and that took us to a new low of the day at -1050 or so.  For a while it looked as if we’d also see a new all-time loss on the NASDAQ 2hich looked like it would go -1000, but rallied a touch to close -970.29 (12.32%), DJIA -2997.11 (12.93%), SP 500 -324.90 (11.98%), the Russell -171.66 (14.2%) and the DJ Transports -916.76 (11.55%).  Market internals were not quite as bad as the decline would project with NYSE A/D 24:1 and NASDAQ 11:1, but the DJIA was a debacle with all stocks lower and the biggest losers being UNH -317DPs, HD-275, BA -274, AAPL -242, MCD-190, V -162, and MSFT -158.  In fact, 10 of the 30 were down triple digits while only 1, WBA was down a single digit.  The Fed’s dramatic 1% rate cut down to .25% did little to calm fears as did their open market infusions during the day.  The White House did little to engender any confidence, and their lack of any cohesive fiscal plans left the futures “limit down” from early last evening right up to the open, which lasted only a minute, literally, before level 1 circuit breakers halted the market for 15 minutes.  We came very close to the second breakers at -13%, but the market seemed to calm down a bit and while trading included more forced liquidation, but the decline was stopped at -2798 by 10:00 (including the 15 minute halt) and we rallied until topping out at 11:30 at -1417.  The rest of the day was uneventful until Trump started speaking and we sold off into the close with a new point loss record.  Briefing.com listed NO STRONG groups for the 3rd time in 3 days with the weakest including Info tech, financials, consumer discretionary, materials, real estate and of course, energy.\n \nOur “open forum” on Discord, which allows me to interact with subscribers and others to allow direct questions and chart opinions on just about any stock, continues to grow with more participants every day.  It is informative and allows me to share insights as the market is open and moving.  The link is: https://discord.gg/ATvC7YZ  and I will be there and active from before the open and all day.  It’s a great place to share ideas and gain some insights.\n \nSECTORS: Other names in the news: I’m not sure that there is really any point to listing all the names and declines here so I’m just going to hit the groups and highlight any outstanding issues.  But the main characteristic of this market is forced liquidation.  Whether for margin calls, or recently new investors throwing in the towel and leaving the market, it’s pretty extreme.  As I’ve said here before, the rallies in a bear market can be very deceptive.  Sharp and quick and with high volume, sucking you back in because everyone wants to believe the turn is here.\n \n \nBIOPHARMA: was LOWER with most down nearly 10% and the only multipoint gainer being REGN +4.45.  On the downside we had BIIB -21.71, ABBV -9.06 (10.16%), ISRG -66.69 (14.16%), MYL +.13, TEVA -.99 (11.79%), VRTX -21.09 (9.55%), BHC -3.48 (18.51%), INCY -2.34, ICPT -16.81 (23.41%), LABU -8.10 (33.37%) and IBB $95.90 -7.78 (7.5%).\n \nCANNABIS: stocks were LOWER again and it’s almost a waste to discuss the group, which is severely broken with TLRY, a former $300 stock that has fallen for 14 of the last 16 days from $20 to close today $3.05 -.875 (21.74%).  Even the medical company CURLF was $3.20 -.48 (12.83%) and KERN the compliance software $4.16 -.91 (17.95%) and MJ $9.54 -.80 (7.74%).\n \nDEFENSE: was SHARPLY LOWER with most down double digits LMT -33.08, RTN -16.29, GD -12.94, TXT -2.22, UTX -13.37, NOC -31.00, BWXT -3.79, TDY -37.18, and ITA $134.25 -23.12 (14.69%).\n \nRETAIL was LOWER with all down double-digit percentages. M -1.16 (14.45%), JWN -4.40 (20.38%), and on the brand side, TPR (COACH) -4.23 (26.06%), and CPRI (KORS), -4.27 (30.65%) and XRT $28.66 -4.08 (12.46%).\n \nFAANG and Big Cap: were LOWER with this group the highlight of the crowded trade problems.  GOOGL – 129.27, AMZN -40, AAPL -27.97 (10%), FB -21.28 (12.5%), NFLX-30.30 (after making a 52-wk high @393, 10 days ago and 95 higher), NVDA -34.94, IBM -5.71, TSLA -93.62, BABA -12.41, BIDU -8.84, BA -37.34, CAT -2.66, DIS -5.41, and XLK $72.56 -11.63 (13.81%).\n \nFINANCIALS were SHARPLY LOWER with the market and the FEDs big rate cut didn’t seem to help.  GS –18.60, JPM -13.16, BAC -3.28, MS -4.66 (after Cramer “sanctioned the purchase” last Tuesday at $37 ($6 ago), C -8.79, PNC -17.01, AIG -3.44, TRV -20.94 (19.49%), AXP -8.67, and XLF $20.35 -2.70 (11.71%).\n \n \nOIL, $28.70 -3.04 The stocks were LOWER with the price of Oil trying to hold $30.00 initially but turning back down and breaking $29.00. This puts it back near the 2016 lows just under $27.00. XLE finished $27.81 -4.38 (13.61%).\n \nMETALS, GOLD: $1,486.50 -30.20. After the overnight rally on the Fed news the Gold fell along with the S&amp;P, and other indexes.  Gold is clearly suffering through liquidation like the rest of the market, but the FED repo program should stoke the inflation fires, and any bounce in stocks will help.  \n \nBITCOIN: closed $4930 -400. We broke to the downside overnight and fell to a low of $4390, and for the first time in days did not make a new recent low.  While I want to add the 350 sold just over a week ago, I want to wait and see some stabilization.  We still own 400 GBTC with an average of $8.06. GBTC closed $5.44 -.73 today.\n \nTomorrow is another day.\n \nCAM",
        "subreddit": "options",
        "title": "OOF!",
        "url": "https://www.reddit.com/r/options/comments/fjwnmr/oof/",
        "created": 1584437641.0
    },
    {
        "author": "Dashover",
        "created_utc": 1583893395,
        "id": "fgpvkz",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "\nFor Trading March 11th\n \nAnother Day, Another 5%\n \nYields Improve\n \nToday’s market was interesting in that after it opened higher and was +945 within the first 15 minutes, and fell back to down on the day by 11:45, it actually made a slight new low vs. yesterday’s debacle and survived, spent 3 hours consolidating, and then started up again making a new high on the day and closing on that high with DJIA +1167.14 (4.89%), NASDAQ +393.57 (4.95%), S&amp;P 500 +4.94%), the Russell +37.47 (2.85%) and the DJ Transports +437.35 (5.41%).  The transports were the only index that had an “inside” day, while all the others made the lower low and finished at or near the highs.  While I don’t believe that the market is turning on a dime and heading higher, today’s action is constructive in that it is displaying the kind of action that occurs in a “bottoming” area.  The gap, followed by the selloff, and recovery to new highs for the day was impressive.  Market internals improved (it would have been hard for them not to) with NYSE A/D at 3:1 and the NASDAQ was 2:1.  Volume was good in both places and the DJIA was the mirror image of yesterday with all 30 names higher.  The biggest gainers were AAPL +130, HD +103, MCD +88 and GS +77DPs.  There were only 3 stocks up less than double digits.  These gains may not look very impressive when compared to yesterday’s losses, but what you need to remember is that on the downside, there need not be big sellers to depress prices.  The absence of buyers and the gaps down take little volume, while buying, in the face of depressed prices takes substantially greater conviction.  This is one of the reasons that the market goes up roughly 2/3 of the time and falls twice as fast.\n \nOur “open forum” on Discord, which allows me to interact with subscribers and others to allow direct questions and chart opinions on just about any stock, continues to grow with more participants every day.  It is informative and allows me to share insights as the market is open and moving.  The link is: https://discord.gg/ATvC7YZ  and I will be there and active from before the open and all day.  It’s a great place to share ideas and gain some insights.\n \nSECTORS: Other names in the news: It was a decent day for an earnings report for DKS.  They beat on every metric and raised the dividend, and then in a display of public awareness disclosed that they are discontinuing hunting and gun sales.  While the stock is down from $50 to $32 in January, today’s actions took it back as high as $39.14 and finished $35.87 +1.39 (4.03%).\n \nI want to take the time tonight to remind everyone that there have been a lot of companies that have made claims, or had claims made about them that have caused some major moves.  Some were warranted and some were not, but the point is that as a rule, they are dangerous unless you use stops and go into them with the knowledge that they can and do turn on a dime.\n \nHere are a few:\nINO  Started $4.00 went to $19, closed @$5.70 -4.13 today.\nSPEX  $1.03 to $3.75, back to .75, back to $5.50, closed today $1.83 -1.39 today\nOPK   $1.40 to $2.91, closed today $1.71 -.51\nAnd CODX $3.16 to $21.75, back to $8, back to $18, closed $6.89 -2.94 today.\n \nBIOPHARMA: was HIGHER with BIIB +1.81, ABBV +2.17, REGN +.58, ISRG +26.74 (5.24%), MYL +.70, TEVA +.28, VRTX +5.35, BHC +1.10, INCY +1.71, ICPT +5.47, LABU +1.82 and IBB $112.15 +2.15 (1.95%).\n \nCANNABIS: stocks were HIGHER with TLRY +.09, CGC +.80, CRON +.15, GWPH +5.79, ACB +.04, PYX +.01, NBEV + .13, CURLF +.21, KERN +.43 and MJ $12.14 +.39 (3.32%).\n \nDEFENSE: was HIGHER with LMT +8.47, RTN +4.89, GD +5.28, TXT +3.06, UTX +2.14, NOC +21.61 (6.9%), BWTX +2.72, TDY +11.92, and ITA $186.29 +9.95 (5.64%).\n \nRETAIL was LOWER with the brands were the biggest winners on the day.   M-.24, JWN +.32, KSS -1.50, JCP -.01, WMT +.59, TGT +1.98, TJX -.20, RL +3.92, UAA +.75, LULU +2.23, TPR +.62, CPRI +.66, and XRT $37.67 +.66 (1.78%).\n \nFAANG and Big Cap: were HIGHER with GOOGL +24.21, AMZN +56.55, AAPL +13.33, FB +5.22, NFLX +10.51, NVDA +9.76, IBM +5.69, TSLA +17.30, BABA +7.20, BIDU +3.35, BA -2.37, CAT +.43, DIS +4.86, and XLK $87.64 +5.48 (6.67%).\n \nFINANCIALS were HIGHER with the market and firming in rates with GS +7.19, JPM +5.11, BAC +1.08, MS +1.14, C +2.68, PNC +9.29, AIG +2.26, TRV +2.30, AXP +3.96 and XLF $23.77 +.96 (4.21%).\n \nOIL, $34.36 +3.23%) The stocks were HIGHER with the steadying of the Oil price and the overall market.  I’m still stand aside this market since it has a lot of work to do to rebuild a base to define the risk.  XLE finished $34.79 +.85 (2.5%).\n \nMETALS, GOLD: $1,660.30 -15.40. After the rebound, and the overnight move to $1,704.30 we sold off as liquidation hit even the yellow metal.  We finished nearer the low, and I feel like after a consolidation that we will head higher.\n \nBITCOIN: closed $7,995 +145. We broke to the downside overnight and fell to a low of $7,640, which closed a gap left on the breakout back in January.  While I want to add the 350 sold just over a week ago, I want to wait and see some stabilization.  We still own 400 GBTC with an average of $8.06. GBTC closed $9.27 +40 today.\n \nTomorrow is another day.\n \nCAM",
        "subreddit": "options",
        "title": "Up a Thou!",
        "url": "https://www.reddit.com/r/options/comments/fgpvkz/up_a_thou/",
        "created": 1583922195.0
    },
    {
        "author": "Dashover",
        "created_utc": 1585271933,
        "id": "fpnwia",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "\nFor Trading March 27th\n \nHIGHER AGAIN\n \nBA Drives the DJIA, Again\nDJIA +4339 Off Low\n24% Off Monday’s Low\n \nToday was another blockbuster of a day, and while I didn’t expect it, clearly, I seemed to be in the minority.  Everything that I have learned over the many years of participation in the market’s tells me that this is not sustainable.  Even with the dramatic influx of money from all the central banks can not possibly keep this going for any period of time.  The health of any country is built on its currency and when you generate the kind of deficits that we are creating, there is a bill to pay.  While we have a leader whose answer to over leveraging a business is bankruptcy, it does little to engender stability.  Those are my thoughts.  Now on to what happened today.  Futures were mostly lower all night and early this morning they started to turn to the upside.  By the time we opened, the S&amp;P had moved from 2402 to 2550.  Of course, by then, Fed Chairman Powell had made a successful appearance on the Today Show, telling the public that the Fed “would not run out of ammunition.  After hitting 2575 we fell back $40 or so we moved up to the 2600 level by noon and then fell back another 60 to 2540.  But by 2:50 we had made another new high at 2625, and we spent the rest of the day and this evening between 2600 and 2625.  At the close the DJIA was +1351.62 (6.36%), NASDAQ +413.34 (5.6%), S&amp;P 500 +154.51 (6.24%), the Russell +69.98 (6.3%) and the DJ Transports +320.60 (4.15%).  Market internals were NYSE 6:1 and NASDAQ 4.8:1 while volume was lighter than the past several days.  All 30 DJIA stocks were higher with the leader’s BA +148 and UNH +142 DP’s.\nHere is the link to tonight’s link to my closing comment:\nhttps://www.youtube.com/watch?v=iH7NlMsLJvc&amp;t=127s\n \nOur “open forum” on Discord, which allows me to interact with subscribers and others to allow direct questions and chart opinions on just about any stock, continues to grow with more participants every day.  It is informative and allows me to share insights as the market is open and moving.  The link is: https://discord.gg/ATvC7YZ  and I will be there and active from before the open and all day.  It’s a great place to share ideas and gain some insights, and we’ve grown to almost 800 members.\n \n \nSECTORS: Other names in the news: Since it’s late, I’m going to deliver a quick and to the point summation of the sectors.\n \n \nBIOPHARMA: was HIGHER with ABBV +6.23 (9.17%), ISRG +40.69 (8.84%), REGN +30.22 (7.03%), ICPT +5.69 (9.18%) and the IBB was $106.79 +4.79 (4.7%).\n \n \nCANNABIS: This group finally caught a bid yesterday on the news that several reported big jumps in revenues in California and today had a bout of short covering that drove prices dramatically higher with TLRY + 3.21 (64%), CGC +1.05 (7.51%), CRON +.77 (13.68%), GWPH -1.91, ACB _.29 (39%), PYX +.59 (21.22%), NBEV +.21 (16.28%), CURLF +.49 (14.16%), KERN +.86 (17.06%) and MJ $12.11 +1.11 (10.09%).\n \n \nDEFENSE: was HIGHER with none up less than 5% and several gainers like LMT +30.33 (9.48%), RTN +11.91 (8.32%), GD +12.38 (10.15%), TXT +3.18 (12.22%), UTX +8.57 (8.91%), NOC +32.64 (11.32%), BWXT +4.23 (9.45%), TDY +14.84 (5.17%), and ITA $162.00 +17.43 (12.06%).\n \n \nRETAIL was MIXED with the retailers lower but the brands all higher.  Only the discounters were higher with WMT +.55, TGT +4.96 (5.45%), TJX +3.77 (8.55%) and RL +4.40 (6.3%), UAA +.36 (3.88%), LULU +2.33 (1.2%) and XRT $31.20 +.94 (3.11%).\n \n \nFAANG and Big Cap: were HIGHER with GOOGL +61.38, AMZN +68.16, AAPL +13.41, FB +7.29, NFLX +19.86, NVDA +12.28, TSLA -12.25, BABA +6.79, BIDU +4.98, BA +26.27 (16.55%), CAT +5.83, DIS +4.68 and XLK $82.31 +4.80 (6.19%).\n \nFINANCIALS were HIGHER with PNC +11.95 (12.98%) and C +4.36 (10.42%) and XLF $21.67 +1.28 (6.28%).\n \n \nOIL, $22.60 -1.89. The stocks were HIGHER even with the price of Oil trading down 7%, but the stocks trading with the overall market.  MRO was the big winner+.46 (12.85%), MPC +2.09 (9.9%) and XLE $30.39 +1.75 (6.11%).\n \n \nMETALS, GOLD: $1,651.20 +17.80 After the selloff yesterday and last night the Gold moved higher on the words of Fed Chairman Powell on the Today Show telling the interviewer that the Fed would not run “out of ammunition” to help with the relief money and the whatever is needed to help the economy.\n \n \nBITCOIN: closed $6675 + 45. We traded in another short range again today and finished mid-range on the day. While I want to add the 350 sold just over a week ago, I want to wait and see some stabilization.  We still own 400 GBTC with an average of $8.06. GBTC closed $7.41 +.06 today.\n \nTomorrow is another day.\n \nCAM",
        "subreddit": "options",
        "title": "For Trading March 27th",
        "url": "https://www.reddit.com/r/options/comments/fpnwia/for_trading_march_27th/",
        "created": 1585300733.0
    },
    {
        "author": "Dashover",
        "created_utc": 1585012749,
        "id": "fnw68j",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "\nFor Trading March 24th\n \nAnother Range Day\n \nYields Fall\n \nOil Rebounds\n \n \nLast week I said that “today’s market was actually not as bad as it seemed.”  And today while we had a sharp decline it feels to me that were have a slowing rate of decline and some good trading action, that we are setting up for a tradable rally.  Here’s my closing comments video from this evening:  https://www.youtube.com/watch?v=Cj7UI1dvLNk   Market internals were improved with A/D on NYSE 3.5:1 and NASDAQ 1.5:1, and volume slowed slightly.  We actually had a few Strong sectors, Consumer discretionary and Communication services while the weakest were (guess what) Energy and financials.  The DJIA was 26 down, 4 up with no triple-digit winners or losers and BA the big gainer +72 DPs and HD +69, and the biggest losers MCD -77, UNH -70, JNJ -60, UTX -51, and MMM -48 DP’s.  BA was up after a trading halt for news at which they announced they were suspending all production at the Seattle facility.  Semi’s (the chips not the trucks) were also higher by 3.4% and as I mentioned consumer discretionary was higher, but only by .4%.  The FED continues to prime the pump with as much cash as they can get into the market.  Neel Kashkari, ex-Goldman Sachs, brought on by Henry Paulson as an aide, and part of the TARP team, is now President of the Minneapolis Fed since January 1, 2016 and was on CNBC this morning, said that the Fed has the power to keep adding liquidity with as much as and whenever they feel it is needed.\n \n \nOur “open forum” on Discord, which allows me to interact with subscribers and others to allow direct questions and chart opinions on just about any stock, continues to grow with more participants every day.  It is informative and allows me to share insights as the market is open and moving.  The link is: https://discord.gg/ATvC7YZ  and I will be there and active from before the open and all day.  It’s a great place to share ideas and gain some insights, and we’ve grown to almost 800 members.\n \n \nSECTORS: Other names in the news: Last night, Inovio Pharmaceuticals was highlighted on a 60 Minutes story that would have made you think that they were the best buy in creation, but INO, which moved from $3.00 to a high of $19.36 in a week earlier this month had fallen back to close $7.22 opened up .22 today but finished $6.62 -.60 (8.31%).  Very disappointing.\n \n \nBIOPHARMA: was MIXED with MYL and TEVA the big winners.  MYL was +1.25 (8.2%) and TEVA +.53 (7.29%) after the news Thursday that it is a manufacturer of Hydroxychloroquine Sulfate, a potential treatment for COVID-19 and are donating the tablets to hospitals nationwide.  REGN, also in the COVID-19 space was +27.55 (6.28%) and IBB $97.50 -.54 (.55%).\n \n \nCANNABIS: Even this group had some winners with TLRY +.35, CGC +.85, CRON -.32, GWPH +3.51, ACB -.02, PYX -.18, NBEV -.03, CURLF +.30, KERN +.04 and MJ $9.71 -.01 (.10%).\n \n \nDEFENSE: was MIXED with LMT -8.61, RTN -7.18, GD -4.99, TXT unchanged, UTX -4.83, NOC -10.02, BWXT +.46, TDY +.74 and ITA $120.95 +.20 (.17%).\n \n \nRETAIL was MUCH LOWER with M -1.06 (17.61%), JWN -2.07 (11.59%), KSS -2.35 (14.83%), DDS -6.35 (15.15%), JCP -.034 (7.84%), WMT +2.52, TGT +.40, TJX +.13 LULU the only winner in the brands +12.84 (7.78%), TPR -1.24 (10.3%), CPRI -.65 (6.59%) and XRT $26.99 -.80 (2.86%).\n \n \nFAANG and Big Cap: were MOSTLY HIGHER with GOOGL +379, AMZN +76.91, AAPL -4.87, FB -1.63, NFLX + 27.44, NVDA +6.94, IBM -.63, TSLA +6.76, BABA -6.12, BIDU +3.79, BA +10.61, CAT -3.65, DIS -.22 and XLK $71.85 +.80 (1.13%).\n \n \nFINANCIALS were LOWER with GS -.91, JPM -2.43, BAC -1.14, MS -.84, C -1.64, PNC -6.99 (7.81%), AIG +.07, TRV -1.01, AXP -3.33, and XLF $17.66 -1.09 (5.82%).\n \n \nOIL, $23.36 +.73. The stocks were LOWER with the price of Oil trading up slightly but the stocks trading with the overall market.  BP was the only big gainer +1.23 (7.07%) and the XLE $24.05 +1.25 (4.92%).\n \n \nMETALS, GOLD: $1,567.60. After the liquidation of the past few week’s gold made a higher low and broke through resistance at $1,520 and rallied hard right through $1,540 and up towards $1,575.  I still expect a move back toward $1,600 to unfold.  \n \n \nBITCOIN: closed $6340 +90. We broke to the downside overnight and fell to a low of $4390, and for the first time in days did not make a new recent low.  Today was a strong move to the upside While I want to add the 350 sold just over a week ago, I want to wait and see some stabilization.  We still own 400 GBTC with an average of $8.06. GBTC closed $7.19 +.19 today.\n \nTomorrow is another day.\n \nCAM",
        "subreddit": "options",
        "title": "For Trading March 24th",
        "url": "https://www.reddit.com/r/options/comments/fnw68j/for_trading_march_24th/",
        "created": 1585041549.0
    }
]