[
    {
        "author": "BumbleFuckDuck",
        "created_utc": 1605547384,
        "id": "jvas4l",
        "num_comments": 47,
        "num_crossposts": 0,
        "selftext": "Sup ZOMbros, just a heads up ZOM has been seeing increased activity since last week, with today they jumped 17% at the time of this post. Their commercialization date for the TRUFORMA product is set for March 30th. For the price of the share being at $0.11 right now is a steal considering there is a shit ton of room for growth. Truforma is a one of a kind device that does:\n\n\"Better test performance for better case management.  TRUFORMA™ introduces highly sensitive, species specific assays for the diagnosis of thyroid disease in dogs and cats and adrenal disease in dogs.  TRUFORMA™ delivers the accuracy and performance you demand with the convenience and ease of use you need.  Complete thyroid and adrenal results within the patient visit mean less stress for pets, pet owners and the veterinary health care team.\n\nTRUFORMA™ uses disposable assay cartridges to test thyroid and adrenal analytes in 20 minutes or less on average in cats and dogs.\" (from their website)\n\nYeah, ZOM is a veterinary company. Yeah, there are a shit ton of people who have cats and dogs. An old article I'm too lazy to look up estimated the commercialization of Truforma will be an estimated $2.7 billion. ZOM right now is $64.7 million market cap. This baby is going to fucking E X P L O D E once MM picks up steam. Besides the forward statements, think logically: One of a kind device (competitors don't have the tech ZOM does), partnered with Qorvo(semi-conductor company thefuck lol) in development of Truforma (check their deal), [forward statement incomin] Possible buyout just based off the technology alone that may provide more worth than just for pets, and most importantly: stockholders just recently voted down a r/s and a move to Delaware from Canada (preventing a backdoor r/s). Basically ZOM board knew their shit is ready and primed and tried to last minute get more stocks in but holders saw through the bullshit. I hate to be the meme boy but literally this can't go tits up. It's just makes *dumb* sense.\n\n**tldr; ZOM gonna moon, do your own DD and take all I said as a fart in the wind**\n\nedit: Someone asked my position. As other ZOM investors know, the recent name change screwed with everyone's averages if you are using RH (I am, idk about other platforms). Before the screw up/glitch, *my average was sitting at .155*, since then I averaged down.* I suspect* I am in the *.13 range or low .14*, I am a long term holder with a measly *4,250 shares*. I still held when ZOM dipped .07. At the time of this edit 10:58am pst ZOM is now .1227",
        "subreddit": "RobinHoodPennyStocks",
        "title": "ZOM (yeah, me again)",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/jvas4l/zom_yeah_me_again/",
        "created": 1605576184.0
    },
    {
        "author": "p_giggles",
        "created_utc": 1605883301,
        "id": "jxq70u",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Sorry if questions like this aren't allowed but something I noticed a few times this year is that some companies are announcing note exchanges where if an investor chooses to exchange it, they receive a virtually identical note, but the new one is registered under Securities Act of 1933, whereas the previous notes were exempt. If you need an example, Qualcomm announced an exchange this morning and I believe Qorvo announced one 3-6 months ago. \n\nWhy would a company do this? Does having the note registered w/ the SEC allow more funds to invest in it (e.g. Corporate bond funds with stricter requirements)? \n\nHappy Friday!",
        "subreddit": "SecurityAnalysis",
        "title": "Companies exchanging notes for identical notes registered under 1933 act?",
        "url": "https://www.reddit.com/r/SecurityAnalysis/comments/jxq70u/companies_exchanging_notes_for_identical_notes/",
        "created": 1605912101.0
    },
    {
        "author": "UnderdogFinance",
        "created_utc": 1604427900,
        "id": "jnfqct",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "RobinHood",
        "title": "Telecom Stocks Earnings Roster for Nov 4: QCOM, QRVO &amp; ACIA",
        "url": "https://finance.yahoo.com/news/telecom-stocks-earnings-roster-nov-150803804.html",
        "created": 1604456700.0
    }
]