[
    {
        "author": "Felsommer",
        "created_utc": 1608196197,
        "id": "keu3ca",
        "num_comments": 396,
        "num_crossposts": 0,
        "selftext": "As you cuckies might have heard, the rumor started that Facebook and Allianz are now throwing $$ into Palantir by incorporating Foundry into their business.\n\nNow, since you all can't speak any language besides English, due to gambling your little lifesavings away while watching Dora the Cuck, I've webscraped many online job portals to find even more newly created jobs with Palantir knowledge as a requirement. I had to endure reading Spanish and German job posts, so you know this shit is legit. If you don't believe me, look into the URLs I pasted in the comments. Mods banned my post for having too many links pasted in a post, so deal with it.\n\nAm I saying PLTR's platforms will be as crucial (or maybe more) to a company as Microsoft's while having only 1/35 of its current market cap? Yes. Is it great news that many of these new companies are European since the brr dollar won't be worth shit in the next years? Yes. Am I saying PLTR will moon while we hear news about all these new clients? Yes. Can you ban me if PLTR doesn't hit 50$ by end of 2021? Yes.\n\n**TLDR**: **Fresh Foundry clients are ABBVIE, Accenture, AT&amp;T, BMW, Boeing, Ernst &amp; Young, KPMG, Merck, Unicredit. Buy the rumor.**",
        "subreddit": "wallstreetbets",
        "title": "PLTR will moon soon. I got proof.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/keu3ca/pltr_will_moon_soon_i_got_proof/",
        "created": 1608224997.0
    },
    {
        "author": "Namnikoo",
        "created_utc": 1606842779,
        "id": "k4p5tg",
        "num_comments": 388,
        "num_crossposts": 0,
        "selftext": " Just saw a great DD article on Seeking Alpha on PLTR. https://seeking$$alpha.com/article/4392215-palantir-technologies-in-depth-look-whether-sustainable-competitive-advantage\n\nIt's paywalled so here's the text to share. I know most of you autists can't read for shit, BUT GODDAMN READ THIS SHIT SO YOU KNOW WHAT YOU'RE SPENDING YOUR MONEY ON. or just read the summary, or scroll to the very bottom for TL;DR \n\n**Summary**\n\n* As speculators circle around Palantir from both the long and short sides, trading volatility has obscured the fundamental picture as to whether the company commands a sustainable competitive advantage.\n* In this article, I intend to have an under-the-hood look at Palantir as a 'digital resources' play to answer that all-important question.\n* I believe its Gotham, bundled with forward-deployed field service representatives, has surmounted the barriers to entry and now enjoys switching cost advantage and emerging network effect.\n* As it diversifies into adjacent commercial verticals through Foundry, Palantir will benefit from economies of scope and scale. Profits will ensue.\n* Shareholders are betting on Palantir's success in completing the digging of a wide moat. The less anticipatory investors may want to wait until such a moat becomes reality.\n\n**Palantir Technologies: Does It Have A Sustainable Competitive Advantage?**\n\nThere are probably as many investors who are averse to Palantir Technologies Inc. (PLTR), a recent public listing, as those who root for it. The stock has gone parabolic since the start of November 2020. Then, short-seller Andrew Left of Citron Research entered the scene with his tweet. All of the trading volatility has obscured one important fundamental question: does Palantir have a sustainable competitive advantage?\n\nBelow, I attempt to answer that question with an in-depth look at this interesting company.\n\n**What does Palantir do?**\n\nAs of 2020, Palantir's mission is to help its users, the people doing the hard work on complex, real-world problems by writing software that enables effective analysis against complicated, data-driven problems.\n\nPalantir offers two principal data fusion platforms for integrating, managing, and securing any kind of data at a massive scale, i.e., Gotham for government agencies and Foundry for the commercial market. With forwarded-deployed Field Service Representatives, Palantir transforms massive amounts of disparate information into an integrated data asset that reflects their operations, and layer applications on top of the Gotham or Foundry platform to make the integrated data asset accessible and actionable and for fully interactive, human-driven, machine-assisted analysis (Fig. 1).\n\nOn the backend, Palantir runs a system called Apollo as a continuous, automated means to deliver updates to the Foundry and Gotham platforms everywhere they are deployed - cloud, on-premises, and classified networks - without disrupting customer operations. Apollo reduces the demand for field engineering teams to manage software deployments and gives Palantir SaaS operating efficiency in a very heterogeneous environment.\n\nLooking ahead, Palantir is poised to become the default central operating system for data across the U.S. government and its allies. The company also aspires not only to be the central operating system for data at large businesses and even entire industries. To appreciate Palantir's ambition with regard to B2B big data, it may be helpful to recall how much economic benefit has been captured by Microsoft (MSFT) after Windows OS took the lead over MacOS of Apple (AAPL) in the PC era, and by Google and Apple in the consumer mobile phone age with their respective Android and iOS operating systems.\n\nThere is a range of potential competitors that offer similar services in some capacity, including (1) traditional IT consultancies, e.g., Booz Allen (BAH) and Accenture (ACN), which lack the technical prowess as well as niche focus; (2) blue-chip data companies, e.g., IBM/i2 (IBM), which cannot scale down efficiently enough to compete on price; and (3) defense contractors such as Booz Allen (BAH), Raytheon Technologies (RTX), Science Applications International Corporation (SAIC), and BAE Systems plc (OTCPK:BAESF), which cannot compete on costs and end-user responsiveness with Palantir. These juggernauts are not nimble enough to pivot away from their legacies and wide-ranging service offerings to effectively match the focus and end-user friendliness of Palantir, although they may occasionally chip away some revenue.\n\nSilicon Valley heavyweights, such as Alphabet Inc. (GOOG), are unwilling to work for the Pentagon citing unethically even though it thought it was okay to collaborate with the Chinese government in project Dragonfly (see here).\n\nThere are some smaller start-ups that work in the same general field as Palantir, but they lack the resources (capital and talent) to climb the steep learning curve and compete against Palantir head-to-head. These may include Digital Reasoning, which entered the intelligence field even before Palantir and also received funding from In-Q-Tel, the venture capital firm of the CIA, which seems not to be particularly well run which is why its founder recently returned to the CEO helms; (2) Ayasdi, acquired by the SymphonyAI Group in 2019, which has a core topological analysis platform on top of which custom applications for customers mostly in healthcare and finance are built; and Beijing-based MiningLamp, self-styling as \"the Palantir of China\" and with US$300 million just raised in a funding round co-led by Temasek and Tencent, which may pose some threat in the commercial arena given it reportedly got business from western firms (see here).\n\nWith regard to the OS platform for data especially on the government front, Palantir more or less owns the niche. On the commercial front, Palantir is industry agnostic but is focused on forging ties with approximately 6,000 companies in the world with more than $500 million in annual revenue. Palantir has been saying the real competition is the in-house development projects of its potential customers.\n\n**The digital resources space**\n\nI believe some of the key characteristics of Palantir can be better understood in the context of what I call the \"digital resources\" investment space at The Natural Resources Hub (Table 1). This is a group of businesses from various industries, which in a nutshell share the following features:\n\nA unique value proposition. By accumulating and processing big data, or enabling data-intensive operations, these B2B companies generate recurring, subscription-based revenue from business or government customers.\n\nWide moat. They command a monopolistic or oligarchic position in their niche, protected by enormous barriers to entry, some network effects, and switching costs, which gives them a sustainable competitive advantage over the fellow industry participants they serve. They tend to show resilience during industry crises.\n\nDominance in native industry. They are deeply entrenched in their respective native industries. Some of them were even bankrolled at their birth by home industry advocacy groups. They then expand into adjacent industries in pursuit of economies of scope.\n\nAggressive acquisitions. In an expansion of their service into adjacent verticals, they usually face a fragmented competitive landscape, fertile for M&amp;A, which further fuels rapid growth.\n\nCapital and operational efficiency. They develop scalable solutions that are built once and installable or sellable countless times. So, they are capital-light and can operate very efficiently. They typically generate superior profitability and deliver a high rate of returns on invested capital.\n\nAs I shall demonstrate below, Palantir shares most, if not all, of the characteristics of the verified members of the 'digital resources\" space. Prima facie, it is a wide moat prospect and worth a deeper examination.\n\n**Does Palantir have a sustainable competitive advantage?**\n\nIn the consumer-oriented internet arena, winners are known to take all thanks to a number of traits, including the economies of scale and scope, network effects, the advantage of big data and machine learning, brand power, switching costs, the attraction of talents, the charisma of hard-driving founders, and benefits of geographical clustering, as has been summarized here.\n\nThe same may not be said about the B2B platform race, where peers compete mainly on products, services, and customer experience (see here). The outcome of the competition may not be binary (the winner takes all, and the losers die) due to the lack of viral growth.\n\n**The technological edge**\n\nAs I stated above, B2B platform rivals compete primarily on products, services, and customer experience. Palantir follows the approach of bundling superior technology with top-notch forward-deployed field service representatives.\n\nIn its home industry - intelligence and defense, Gotham was created with native attention to security rules, access privilege, and user action logging. No other systems allow users to draw associations between disparate data sets and to visualize the connections as easily and quickly. Palantir has maintained a laser-sharp focus on developing the world's best platform for data, while its primary competitors such as Booz Allen or Raytheon are widely diversified. From competition outcome to reputation among end-users, Palantir not only has a clear technological edge but also is more cost-effective than competitors (see here and here). That's why Palantir is confident it only needs to be placed in front of the right people to prove its worth.\n\nBut then, what makes Gotham shine are the forward-deployed field service representatives. Palantir field service representatives proved to be not only some of the brightest engineers known to government agencies but also extremely responsive to the needs of end-users. These forwarded-deployed engineers examine customer needs, resolve all data source and complexity issues, and build out applications on top of Gotham. Once the applications are built, they train users on site until the customers are ready to use the product on their own. The forwarded-deployed engineers also bring their experience acquired in the reality of deployment back to Palantir development centers as they rotate assignments.\n\nAlthough its technology and approach are by no means cannot be replicated, Palantir makes the smart decision of focusing on a narrow scope in the sprawling B2B data landscape and, in that niche, it excels at helping customers solving complex data problems at relatively low costs, which actually takes a lot to accomplish, from well-written software, via responsive backend support, to knowledgeable forward-deployed field service representatives. It is no wonder Palantir has earned a sterling reputation for effectiveness and ease of use in the intelligence and defense circle, which I believe it can parlay into the commercial market (Fig. 2).\n\n**Palantir brand and talent attraction**\n\nGiven the forwarded-deployed engineers play such an important role in the technological advantage of Palantir (as do the backend developers), it follows that it is critical for it to attract the smartest engineers in the market if that edge is to be maintained and expanded. To that end, the founders have successfully created an aura of mystery around Palantir:\n\nIn-Q-Tel, the venture capital firm of the CIA, being its very first investor; catcher of Osama bin Laden and the would-be preventer of 9/11; buster of the hacker of Dalai Lama's personal computer and Ponzi schemer Bernie Madoff;\n\nsoftware vendor to a slew of U.S. intelligence and military agencies (including the CIA, FBI, DHS, NSA, Special Operations, the Marine Corps, the U.S. Army and West Point, the U.S. Navy, the USAF, and the U.S. Space Force), police departments like NYPD, the governments of U.S. allies, and commercial businesses Ferrari (RACE), Airbus (OTCPK:EADSF), BP (BP), Merck (MRK), and JP Morgan (JPM);\n\nhelper of the NIH, CDC, and NHS to track the COVID-19 virus, the World Food Program to stop famine, and the National Center for Missing &amp; Exploited Children to fight child exploitation;\n\nhigh-profile politicians such as former Secretary of State Condoleezza Rice and CIA Director George Tenet advising, while luminaries Mike Kelly, David MacNaughton, Louis Mosley (grandson of Oswald Mosley), and Fabrice Brégier (former No. 2 at Airbus) joining to lead its Australian, Canadian, British, and French subsidiaries, respectively;\n\na dissent in Silicon Valley that takes side with the U.S.A.; let alone the persona of the hard-driving founders, including Peter Thiel who is said to be the smartest guy in the Silicon Valley besides being a co-founder of PayPal (EBAY) and the first outside investor in Facebook (FB), the lawyer-philosopher-hedge fund manager CEO Alex Karp, and the genius engineers Stephen Cohen, Joe Lonsdale, and Nathan Gettings; even Shyam Shankar, the COO, has also been getting a lot of attention...\n\nThe mystique proves to be a powerful recruiting advantage; it helps line up a self-replenishing stream of the best applicants from some of the top-ranked colleges and graduate schools, who are confident they are the smartest computer geeks, who join to work long hours with a cultish band of fellow geniuses to solve the world's hardest problems in spite of lower salaries than Silicon Valley juggernauts like Google, Facebook, and Apple (AAPL).\n\nBecoming a publicly-traded company only strengthens the staffing edge, thus posing a serious challenge for the big IT consultancies, traditional defense contractors, and smaller start-ups. Hiring the best talents will undoubtedly help sustain Palantir's technological advantage.\n\n**High barriers to entry**\n\nThere exist extremely high barriers to entry in the intelligence and defense sector. Even the best end-user experience and reputation alone are not enough to get deals closed. Below, I highlight two hurdles.\n\nJust to open doors. To open doors and lubricate negotiations, some major defense contractors spend as much as $14 million per year on lobbying.\n\nPalantir had been quick in learning the rope of getting things done in Washington D.C. It consulted Washington insiders early on and went ahead hiring former senators John Braux and Trent Lott for formal lobbying (see here). Its lobbying spending has been on a steady rise and, in the last few years, reached well over $1 million per year by hiring &gt;25 lobbyists (Fig. 3).\n\nPalantir also retained former Secretary of State Condoleezza Rice and CIA Director George Tenet as advisers (see here).\n\nTo overcome buyer inertia gently and forcefully. Another major challenge faced by Palantir was the department of defense saw it as an outsider that tries to sell software not even in response to any specific requests in its conventional acquisition system, oblivious to the capabilities and cost-effectiveness of Palantir Gotham.\n\nIn response, Palantir allowed free trials of Gotham and provided free services before potential military clients made any purchases; it offered free or reduced-price training to military units that purchased its software. Forward-deployed field service representatives listened to the needs of its end-users and were capable of implementing requested changes quickly.\n\nPalantir's entrepreneurial approach led to a number of successes with, e.g., some Army military intelligence units and the Marine Corps. Some intelligence officials in the Marine Corps even went so far as to say they would not be surprised to see Palantir remain the de facto standard (see here).\n\nEven though Palantir has demonstrated the efficacy and cost-effectiveness of Gotham, the U.S. Army stuck to the plan of developing its internal intelligence software suite, i.e., the Distributed Common Ground System-Army (DCGS-A) Increment 2, and released a procurement solicitation in December 2015 for its development, thus effectively excluding the ready-to-deploy commercial alternative - Gotham - from being considered. The Army decision was a major blow to Palantir because Gotham does exactly what DCGS-A is trying to do yet at a much lower cost; in other words, the Army is reinventing the wheel, unnecessarily and wastefully.\n\nAfter a pre-award bid protest filed with the Government Accountability Office had been denied, Palantir sued the Army in the Court of Federal Claims in June 2016, arguing the Army violated the 1994 Federal Acquisition Streamlining Act by not conducting the market research necessary to determine if commercially available items could meet its needs, with or without modification. The lawsuit is an extremely bold move because defense contractors typically dared not to sue its largest customer, even when their interest as protected by the 1994 law had been infringed. The judge ruled in favor of Palantir in October 2016 and upheld Palantir’s argument the Army violated the 1994 law (see here), which was affirmed by the Court of Appeals for the Federal Circuit on September 7, 2018.\n\nEven while the appeal was ongoing, the Army rethought its acquisition plan and, in March 2018, picked Raytheon and Palantir to provide new intelligence analysis platform offerings that could be used effectively at the tactical level in place of DGCS-A. In March 2019, the Army announced Gotham beat out Raytheon's FoXTEN system and won the $20 million first delivery order, as part of an $876 million contract over 10 years. Significantly, the Army's loss in court forced it to transform its procurement process. The Army now follows a “try, buy, decide approach” when it comes to commercially available products (see here). The win in the court is expected to create a lot of opportunities for Palantir down the road.\n\nThe distance Palantir has gone to gain access to the intelligence and military market proves one thing: the presence of enormous barriers to entry. In the face of such formidable hurdles, few aspirants have the determination, investment time horizon, and resources to pull off the feat of entering and establishing itself as the de facto standard in that market. Over a time span of 15+ years, Palantir sunk quite a few billions of VC dollars on software development, offering products and services for free or on lean fees, and lobbying and suing to get a level playing field, yet without a single major botch-up over all those years. Those who sneer at Palantir for still losing money after 17 years of investment fail to appreciate how impossible a strategic goal the company has come to set for itself: to become a wide-moat software supplier to the governments of the U.S. and its allies.\n\n**Switching cost, economies of scale, and network effect**\n\nHaving earned contracts from the intelligence and defense sector, Palantir became an insider so to speak, and the barriers to entry work to its advantage. Gotham has been deployed as the platform for data integration at various intelligence and military units displacing the existing system including DGCS-A, a myriad of applications has been developed for the agents, and thousands of end-users have been trained to use those applications on a tactical level in critical missions and battlefields. A switching cost has arisen in favor of Palantir and it will only get higher.\n\nAs more contracts are signed with the U.S. government and its allies, Palantir will begin to enjoy economies of scale, thanks to the large fixed costs incurred for building the software once and the relatively low costs associated with deploying it countless times.\n\nJust playing out according to Palantir's plan, Gotham is increasingly being used for sharing disparate data sets across different government agencies. Once those siloed data sets are all integrated on Gotham, there will emerge a huge network effect, further heightening the existing barriers to entry. Under such a network effect, a new entrant may land an isolated deal sporadically, but it is beyond me how this hypothetical incursor can dislodge Palantir by convincing dozens of stodgy government agencies to simultaneously give up perfectly-functional, mission-critical Gotham and install an unproven piece of software instead. That's why I believe Palantir's competitive advantage in the government sector will prove to be sustainable.\n\n**The commercial market**\n\nAs I discussed above, 'digital resources' companies tend to expand into adjacent verticals for the benefit of economies of scope. Palantir's expansion into various industries in the commercial sector is precisely for that end. The same technological know-how sharpened in defense deployments can be parlayed into serving the commercial sector. The utilization of Apollo, the backend system for continuous, automated software update deployment, doubles as it supports Foundry in addition to Gotham. The corporate resources are shared by operations in both sectors, resulting in lower overhead per dollar of revenue. The direct sales force will be able to cross-sell Gotham to some commercial customers. Diversification into additional industries reduces the risk associated with the slowdown of individual industries. As opposed to the high barriers to entry in its home industry of intelligence and defense, the commercial world tends to have more competitors. However, economies of scope will likely offset the narrower moat.\n\n**Network effect in the commercial sector**\n\nOver the long term, Palantir (PLTR) estimates the total addressable commercial market contains \\~6,000 companies with more than $500 million in annual revenue (see here). Palantir began to develop Foundry for the commercial sector in 2012 and launched it in 2016. Foundry is poised to become a central operating system not only for individual institutions but also for entire industries. In 2017, e.g., the five-year, $300 million partnership with Airbus allowed Foundry to expand into a platform for the aviation industry, which today connects data from &gt;100 airlines and 9,000 aircraft around the world.\n\nIf successful, an industry-wide central operating system for data will effectuate an extensive network effect. However, to get there, Palantir needs to rapidly grow the commercial top-line. Foundry pulled in $340 million in 2018 and $397 million in 2019. Commercial revenue grew 35% from the 3Q2019 to the same period one year ago (see here). How will Palantir further accelerate commercial sales momentum?\n\n**Commercial sales strategies to accelerate the network effect**\n\nIn the near term, Palantir plans to focus on building partnerships with institutions that have the leadership necessary to effect structural change within their organizations - to reconstitute their operations around data. Buy-in from the top brass is imperative. Hopefully, Palantir can leverage its reputation and relationships gained in the government sector, as in an early case in which NYPD, then a customer, introduced Palantir to its first commercial client JP Morgan (JPM).\n\nPalantir used to have a policy of not hiring direct salespeople, given how intelligence and military contracts are acquired and serviced and perhaps due to a post-dotcom bubble belief \"technology is primarily about product development, not distribution\". However, there is absolutely no viral growth in B2B as there occasionally is in B2C. The common practice in the 'digital resources' space is to maintain a large force of salespeople each managing a few customer accounts, with responsibilities such as opening new sales territory, scouting for client needs, scaling within existing customer accounts, coordinating technical presentations by engineers, securing technical support for clients, and managing customer relationships. Palantir began to recruit direct salespeople in end-2018. The commercial sales growth in 2019 seems to prove the concept of direct sales works, so Palantir is poised to triple the headcount of the sales force.\n\nHistorically, data-inundated organizations either build in-house or buy dozens of off-the-shelf products and sew them together, both approaches having been proven inefficacious in a rapidly changing and increasingly uncertain world. Foundry offers the third, and better, option for those organizations. However, Palantir comes to realize that, in the near-term, institutions do have an imperative to stick to their internally-built software. So, Palantir makes its own solutions fully modular such that customers can \"take what they need, build on what they have\" (see here). Such a flexible approach should help overcome corporate inertia to reach out for external assistance and accelerate customer onboarding, and create a new way of going to market with channel partners.\n\nPalantir plans to partner with cloud-hosting channel partners, such as Amazon (AMZN), to drive commercial revenue growth. It was Amazon that helped facilitate the partnership between Palantir and the Colombian government. Palantir developed Visor COVID-19, a digital instrument built on top of Foundry hosted in the AWS infrastructure and offering a unified, near real-time view of the state of the pandemic using the largest integration of open data and depersonalized epidemiological data in Colombia.\n\nInternational sales already account for fo 46% of the total revenue as of the 3Q2020. As part of its international growth plan, Palantir has set up subsidiaries in Canada, Australia, the U.K., France, and other countries in the last few years. In Japan, it took a different approach and chose to form a joint venture in partnership with Sompo Holdings, Inc., which subsequently invested $500 million in Palantir. The JV launched in June 2020 “the real data platform for security, health, and wellbeing”, powered by Foundry, to accelerate the digital transformation of Japanese governmental institutions and industries ranging from healthcare to automotive to manufacturing. The JV is also working on onboarding the Japanese government.\n\n**Risk abounds**\n\nPublic relation disasters can damage its image in the eyes of the next generation of software engineers; this is an area that Palantir, now a public company, should allocate additional resources to. A Snowden-like incident can set Palantir back appreciably, impacting client relationships and employee morale alike.\n\nPalantir must penetrate its chosen market swiftly to enlarge the switching cost, expand the network effect, and heighten barriers to entry, lest a resourceful competitor launches a dogged challenge in the government sector or its smaller imitators strike it lucky in the commercial market and steal potential customers. A well-intended acquisition can turn sour, contaminating the entire operation.\n\nAs far as I can see, the management team at Palantir is paranoid enough to allow any blind spots unaddressed in its business execution. However, Black swans do happen.\n\n**Investor takeaways**\n\nI believe Palantir has an inchoate durable competitive advantage, which acts as an economic moat to protect its business from invaders, which seems to be widening judging from new developments since the IPO.\n\nIn the self-created niche of supplying the operating systems for data for government agencies, Palantir clearly delivers a peerless customer experience with superior technology bundled with top-notch forward-deployed field service representatives.\n\nGotham has become the default operating system for data at some U.S. government agencies, where Palantir enjoys switching costs.\n\nPalantir seems to have also built a brand that helps attract top-notch talents, which sustains its technological edge.\n\nNow that it has kicked open the door of the U.S. government agencies by winning a critical lawsuit against the Army, Palantir is expected to achieve rapid penetration of that market. Gotham is increasingly being used for integrating siloed data sets across different government agencies, which in time will result in an enormous network effect, further heightening the barriers to entry for aspirant entrants.\n\nThe company is aggressively diversifying into adjacent commercial verticals and international markets for economies of scope. Revenue growth, both from the government and commercial sectors, will lead to economies of scale. Down the road, Palantir will have the pricing power at its disposal to drive profitability.\n\nAt this time, the share price of Palantir may seem to have gotten ahead of itself - a point to be further explored elsewhere. The shareholders are taking risks to bet that the company will succeed in digging the wide moat and that years of profitable growth will follow.\n\nLess anticipatory investors may want to wait until Palantir has completed building such a wide moat. For these investors, the entry opportunity may come in the form of a major sell-off during a general market recession or in an idiosyncratic crisis down the road.\n\n**TL;DR - PLTR has great prospects, short-term casino, long term (8-12 months) to the moon**\n\nPositions: some shares of PLTR, some 12/4 $30 puts (hedge) at 50% gainz.",
        "subreddit": "wallstreetbets",
        "title": "Some Serious PLTR DD courtesy of SA",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k4p5tg/some_serious_pltr_dd_courtesy_of_sa/",
        "created": 1606871579.0
    },
    {
        "author": "EducationalOlive0",
        "created_utc": 1608655699,
        "id": "ki8z2q",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "Disclaimer: Long time lurker, first time posting there. I plan to long in this company as I became sold on the long term position of the company's growth in the health care sector. This is a minor position (5%) in what is a concentrated (10-15 company) portfolio.\n\n**PFMT- Performant Financial**   \n**Overview:**  \nPFMT is a technology-based provider of audit, recovery, payment accuracy, coordination of benefits (COB), and outsource services in the United States.  PFMT analyze claims, identify, prevent and correct inaccurate payments. Using their proprietary analytics platform and industry expertise, PFMT aim to reduce losses on billions of dollars worth of improper healthcare payments, state/federal/and treasury tax delinquencies, defaulted student loans and other receivables.  Primary customers include government commercial health plans, CMS, Blues plans, regional Insurers, private/commercial programs, etc that operate in complex and highly regulated environments that rely on PFMT's innovative and disruptive approach. Revenue is generated based on a percentage of validated recoveries for clients. Contracts are negotiated on case by case basis, fees may range from 10-30% of recoveries and the duration of contracts may last 3-5+ years.  These are high margin, recurring revenue contracts, expected to provide multiple years of prolonged double digit growth.  \nThis is not a sexy business, quite boring in fact. However, a good investment should be boring. Hopefully you will also appreciate the new path management has coursed, and see the potential upside in this turnaround story.   \nHistorically, PFMT was known for its legacy business as a collection agency for student loans, federal/state tax delinquencies and other receivables. Since the taking over of student loan originations by the Federal government a decade ago, PFMTs student loan collections have seen a diminishing contribution to revenues over time. Currently, the student loans collection business accounts for about 22% of revenues. While \"Other\" legacy collections still account for about 26% of revenues. Growth in Other legacy collections has remained relatively flat over the years. A smaller business segment derives marginal revenues from first party call centers and licensing of hosted technology solutions to clients.  ***The diamond in the rough refers to PFMT's up-and-coming*** ***healthcare*** ***business segment***, composed of claims auditing and eligibility reviews. After seeing losses in 2018/19 due to high ramp up costs and standard implementation time lags, this segment appears to be set for robust growth going forward.  Management has been clear that from 2017-2019, adjusted EBITDA has witnessed a slowdown to reflect a period of transformation in the company to establish itself in the Healthcare space. Management has confidently reiterated their belief in successfully reaching a 2021 goal of achieving $200M revenue with 20% EBITDA margins, with double digit growth continuing for years to come.  \n\n\n**Covid-19 Impact:**  \nThis year was shaping up to be a strong year for PFMT, as Q1 showed promising results that validated the new trajectory of the company. Unfortunately, Q2 and Q3 were impacted by the public health emergency related to Covid-19. The CARES act brought changes that affected the student loans collection segment. Student loan payments, interest accrual and involuntary collection of payments (wage garnishments) were originally suspended till September 30, 2020 but were extended till December 31, 2020. However, PFMT continued to generate student loan revenue for a number of months from existing in-process borrow rehabilitation agreements. Another impact of Covid came from existing healthcare audit customers that requested a short-term pause on PFMT activities. Mgmt has indicated these pauses have largely ended during the third quarter. To mitigate the impact of this temporary slowdown, mgmt had furloughed more than 500 employees which could result in savings of about $18 million. The company is now aggressively ramping up efforts (including hiring/recruiting). Mgmt anticipates the ramp up efforts to be properly reflected in revenue by Q1 of 2021.  \n   \n**Healthcare Business:**  \nThe healthcare platform has finally reached scale, accounting for the largest (and continually growing) contribution to PFMTs revenue. In Q3, the healthcare business generated $17.6M in revenue  (48.5% of total revenues (refer to Figure 1 below to view a cut out from the latest 10-k)). That is a 20.5% increase on sequential basis and a 63% increase from the same period last year. Please refer to figure 2 below, to see the change in healthcare revenues over time. This segment will continue to grow as Mgmt has made it clear this will be a main focus for the company. Soon healthcare will be the primary source of revenue (50%++), leading to a market multiple re-rate.  \nHealthcare revenues over last 11 quarters:\n\nQ3 2020= $17.6M  \nQ2 2020= $14.6M  \nQ1 2020= $17.5M  \nQ4 2019=$14.3M  \nQ3 2019= $10.8M  \nQ2 2019= $9.3M  \nQ1 2019= $9M  \nQ4 2018= $9.9M  \nQ3 2018= $6.6M  \nQ2 2018= $6.1M  \nQ1 2018= $3.5M\n\n  \n\\[Figure 1: Q3 Financial Highlight\\]([https://imgur.com/a/WlqPLjZ](https://imgur.com/a/WlqPLjZ))  \n\n\n\\[Figure 2: PFMT Healthcare Revenues\\]([https://imgur.com/a/W1OtGXu](https://imgur.com/a/W1OtGXu))\n\n**Macro:**  \nThe macro environment indicates there should be tailwinds for the audit, recovery, payment accuracy and coordination of benefits outsourcing business solutions PFMT provides. According to the CMS, national healthcare expenditures are forecast to grow at 5.4% CAGR for the next 8 years. Reaching  $6.8T by 2028. Despite efforts to reduce the amount of improper payments, error rates in the industry range from 6% in commercial to 14.9% in government plans. Healthcare spending growth is driven primarily by a combination of increasing enrollment and cost inflation. Given the current unemployment environment, we are witnessing a spike in Medicaid enrollment, which should continue to benefit the business via rising utilization and claims volumes. It is useful to note that there can be a lag of several months between Medicaid eligibility and resulting claims volumes. This indicates that a majority of the benefits from the current environment are still to come. Also, as private organizations and state governments are struggling with lower revenues and budget deficits, this could create an increased focus on cost containment strategies where PFMT could play a supporting function. PFMT mgmt sees a $200B+ healthcare TAM growing annually.  \n**Competitors:**  \nPFMT differentiates itself with its proprietary technology and customizable approach to each of their customers' needs. The space is mostly dominated by large, slow moving players, that lack flexibility and uniqueness in their approach.  Major competitors include HMS Holdings Corp (HMSY-US, \\~\\~$3B mkt cap) and Cotiviti (acquired in mid-2018 for $4.9B). Contracts in this industry are limited, take time to implement and can last years. PFMT continues to build a moat around it's business by consistently winning, maintaining and being awarded new contracts. An example includes being re-awarded CMS recovery Audit Region 1 and being awarded the newly created Region 5. Thus, successfully showcasing PFMTs superior product and path to success in this space. PFMTs will continue to encroach on incumbents' healthcare market share as the market begins to realize the superiority of their technology and approach.  Refer to Figure 3, below, for an image taken form the CMS website showing the audit region relative to competition. Figure 4 may help to visualize the healthcare insurance payment cycle, and where PFMT may offer value.  \n**Debt:**  \nOn Aug 2017, PFMT entered a credit agreement with an existing shareholder and customer, ECMC. As of September 30, 2020 PFMT has about $62M loan outstanding under this credit agreement.  ECMC has been able to accumulate about 5.8M warrants in PFMT as part of the agreement (about 10% of outstanding shares) all at an average exercise price of $1.95.  The effective interest rate was about 13.9% in the 1H 2020. The loan is classified as a current liability, with maturity in August 2021. However, PFMT has two one-year options to extend maturity.  \nPFMT currently (as of Sept 30,2020) has about $17.3M cash and equivalents on hand and is entering a period of FCF generation.  \nThe current low interest rate environment offers low hanging fruit for companies looking to refinance their loans at a lower rate. Reducing their loan rate to 5-8% could save up to $5.5M in annual interest expense.  \n**Timing/Technicals:**  \nAs the calendar approached their earnings announcement date (Nov 11), PFMT stock was trading around recent highs of $2. The stock started selling off aggressively into the earnings and significantly further following earnings (despite a very positive release). The selling pressure appears to have been caused by portfolio management layoffs at Invesco, a top holder. Public disclosure of these layoffs coincides with timing of initial selloff, and a recent 13G filing confirms the exited position. This should quell any fears holders and followers of this stock may have had, as the selling was not based on fundamental flaws in the company or a new short thesis. Invesco owned about 18% of PFMT. Following the recent pressure, it appears the stock is in extremely oversold territory. Since their exit, the average volume profile of the stock has improved significantly, making accumulating a position easier for both retail and institutional demand.  \n**Valuation:**  \nThe timing of Covid partially contributes to why the market overlooked this stock, as Q2 and Q3 earnings were impacted. To establish a fair EBITDA estimation for 2020, we will use Q1 results with a conservative bias. Q1 is most appropriate because it will give us the clearest picture of how the company was performing prior to the temporary impacts of Covid. Using Q1, EBITDA was $6.4M (after deducting stock compensation).   Annualizing that amount will give us an EBITDA run rate of $25.6M. This is a conservative measure because we do not account for the impact of any potential interest rate savings or growth in the healthcare segment. Next we need to establish the enterprise value (EV= debt + mkt cap - cash). Which we use to calculate EV/EBITDA.  Calculation below.   \nEBITDA= $25.6M  \nEnterprise Value (EV)= $62M (debt) + $41 (mkt cap) -$17.3M (Cash) =  $85.7 M  \nEV/EBITDA= 3.3X  \nFully diluted share count of 59.7M o/s\n\nNow lets take a look at some Healthcare IT comparables. The first 7 are general comps, the bottom 3 are the most similar comps to PFMT. To clarify, HMSY is currently publicly trading and is a direct competitor to PFMT. In December 2019, HMSY acquired Accent (a coordination of benefits/payments accuracy unit of Intrado focused on commercial and Medicare Advantage payers) for $155M. Accent had generated about $50M of revenue during the 12 months ending october 2019 (vs PFMTs $150M revenues in 2019). Based on the transaction price, HMSY paid an estimated 11-12X EV/Ebitda on a TTM basis.  COTV was acquired and taken private in 2018, it continues to be a direct competitor with PFMT. COTV operated in payment integrity and was acquired for $4.9B in mid 2018, an estimated EV/EBITDA multiple of 14-15X based on consensus 2019 estimates.  Also, keep in mind that the average EV/EBITDA for S&amp;P companies in 2020 is about 14.5X.   \nHealthcare IT Peer Trading Comp Table  \n                        Mkt Cap  SHARES O/S           EV         EV/EBITDA\n\nHMSY              2,793       88.6M                   3,021        16.8X  \nCHNG              5,581     304.5M                10,237         11.2X  \nACN            173,423      661.1M              171,554            19X  \nADS                 3,466       49.6M                24,047         30.3X  \nHQY                 5,013          77M                  5,803         27.2X  \nIQV                34,135     191.7M                45,733         19.5X  \nCERN            23,727     306.6M                24,167            14X  \n\n\n                                                                    Average:    19.7X  \n\n\nPFMT              40.5           59.7M                         86       3.3X  \n(fully diluted)  \n\n\nMost Similar Comps:  \nCOTV                  4,900 (2019 est)                                 14.5X  \nAccess                 155 (Acquired by HMSY in 2019)    11-12X  \nHMSY              2,793   88.6M                   3,021              16.8X  \n\n\n                                                                         Average: 14.3X  \n\\[Table 2\\]([https://imgur.com/a/MP4yZgi](https://imgur.com/a/MP4yZgi))\n\nThe market still largely views PFMT as a declining student loans collections firm. Yet growing beneath the surface is an attractive healthcare business. As this segment continues to grow the market will recognize the high quality recurring revenue, ability to scale, and increasingly healthcare-focused pure-play as a catalyst for a multiple rerate.  Now using the comps above, I will provide 3 scenarios (best, base, worst case scenario) applying a discount to conservatively account for the micro-cap nature and higher leverage of PFMT.     \nIn the best case scenario, we apply a 14X EV/EBTDA ratio (rounded down from the most similar comparable peer average of 14.3X) which, on a fully diluted share basis, lead to a current price per share of $6.   \nIn the base case scenario, we take a couple of notches off the closest peer average and apply a 12X EV/EBITDA ratio. Resulting in a current target price of $5.15/share  \nIn the worst case scenario, we further take off two more notches from the most similar peer average to apply a 10X EV/EBITDA ratio. Resulting in a price of $4.29/share.  \nAlso, considering the existing ownership of the company. Parthenon investors, Prescott Group, Mill Road Capital are all large shareholders. It is not unreasonable to think that they pursue a more aggressive activist role in the company and set it up for sale at a premium. It is also possible that competitors recognize the massive discount of this up-and-coming threat, and decide to acquire PFMT before other market participants drive up the price making such a strategic acquisition far more expensive. All of which offer upside to existing shareholders.  \nAs we approach future quarters and results continue to support this positive narrative we should start to see investor appetite pick up for this name. Average daily volumes have quadrupled since Invesco's recent exiting has added to the freely trading shares, improving the liquidity profile of PFMT.  These signals will start appearing on investor screens as they (professional small cap investors, value investors, quant investors, generalists, hedge funds, etc) look for new ideas. There is virtually zero sell-side coverage of this stock at the moment, this will likely change in the future. **Accumulating a position now, presents an opportunity for entry at basement level prices in a stock that has the potential to provide 500-700% upside.**\n\n*Thank you for taking the time to read my idea. Full disclosure, I am long PFMT. Feedback and criticism of this idea are encouraged. Always do your own due diligence. Ive included the sources used for this analysis in the links below.*   \n\\[***Figure 3.:*** *CMS RACs per region\\](*[*https://imgur.com/a/YWlHANZ*](https://imgur.com/a/YWlHANZ)*)*  \n\n\n\\[***Figure 4:***  *Healthcare insurance payments explained\\](*[*https://imgur.com/a/sbrh5pZ*](https://imgur.com/a/sbrh5pZ)*)*  \n*Claim Submissions (Steps 1 + 2): After treating a patient, the healthcare provider submits a claim for reimbursement to the health insurer. The claim will include information on the diagnosis and treatment/procedure*  \n*Claim Adjudication (Step 3): The health plan conducts administrative checks (eg. validates provider information and patient eligibility/ coverage) and prices the claim using the providers contract/ fee schedule.*  \n*Pre-payment Review (Step 4): The payor will leverage internal tools, followed by third party/outsourced solutions (ie. PFMT offerings) to conduct payment accuracy analysis prior to payment. Errors (discrepancies between the submitted claim and the payors payment policies) are identified and corrected.*  \n*Claim Payment (Step 5 + 6): The health plan will reimburse the provider for the patient care and services rendered*  \n*Post-payment review (Step 7): The payor will again use internal tools, followed by third party solutions (PFMT) to evaluate prior payments with additional information that has become available (eg. clinical reviews). Payors will correct*   \n**Sources:**  \n[https://www.performantcorp.com/investors/events-and-presentations/default.aspx](https://www.performantcorp.com/investors/events-and-presentations/default.aspx)  \n[https://www.sec.gov/cgi-bin/browse-edgar?CIK=1550695&amp;owner=exclude](https://www.sec.gov/cgi-bin/browse-edgar?CIK=1550695&amp;owner=exclude)  \n[https://www.cms.gov/Research-Statistics-Data-and-Systems/Monitoring-Programs/Medicare-FFS-Compliance-Programs/Recovery-Audit-Program](https://www.cms.gov/Research-Statistics-Data-and-Systems/Monitoring-Programs/Medicare-FFS-Compliance-Programs/Recovery-Audit-Program)  \n[https://www.cms.gov/Research-Statistics-Data-and-Systems/Statistics-Trends-and-Reports/NationalHealthExpendData/NationalHealthAccountsHistorical](https://www.cms.gov/Research-Statistics-Data-and-Systems/Statistics-Trends-and-Reports/NationalHealthExpendData/NationalHealthAccountsHistorical)",
        "subreddit": "SecurityAnalysis",
        "title": "(PFMT) Performant Financial: Boring Business but a Diamond in the Rough",
        "url": "https://www.reddit.com/r/SecurityAnalysis/comments/ki8z2q/pfmt_performant_financial_boring_business_but_a/",
        "created": 1608684499.0
    },
    {
        "author": "EducationalOlive0",
        "created_utc": 1608748294,
        "id": "kiyfwx",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "Disclaimer: I originally posted this in r/securityanalysis yesterday and received some responses. I am reposting it here to a bigger audience, with an added section to respond to some of the questions I received. I am hoping that by reposting on here, we can get more a discussion. I am not too familiar with reddit as I typically post on smaller value investing forums, and it is first time posting there. I plan to long in this company as I see the long term position of the company's growth in the health care sector. This is a minor position (5%) in what is a concentrated (10-15 company) portfolio.\n\n**PFMT- Performant Financial**  \n**Overview:**  \nPFMT is a technology-based provider of audit, recovery, payment accuracy, coordination of benefits (COB), and outsource services in the United States. PFMT analyze claims, identify, prevent and correct inaccurate payments. Using their proprietary analytics platform and industry expertise, PFMT aim to reduce losses on billions of dollars worth of improper healthcare payments, state/federal/and treasury tax delinquencies, defaulted student loans and other receivables. Primary customers include government commercial health plans, CMS, Blues plans, regional Insurers, private/commercial programs, etc that operate in complex and highly regulated environments that rely on PFMT's innovative and disruptive approach. Revenue is generated based on a percentage of validated recoveries for clients. Contracts are negotiated on case by case basis, fees may range from 10-30% of recoveries and the duration of contracts may last 3-5+ years. These are high margin, recurring revenue contracts, expected to provide multiple years of prolonged double digit growth.  \nThis is not a sexy business, quite boring in fact. However, a good investment should be boring. Hopefully you will also appreciate the new path management has coursed, and see the potential upside in this turnaround story.  \nHistorically, PFMT was known for its legacy business as a collection agency for student loans, federal/state tax delinquencies and other receivables. Since the taking over of student loan originations by the Federal government a decade ago, PFMTs student loan collections have seen a diminishing contribution to revenues over time. Currently, the student loans collection business accounts for about 22% of revenues. While \"Other\" legacy collections still account for about 26% of revenues. Growth in Other legacy collections has remained relatively flat over the years. A smaller business segment derives marginal revenues from first party call centers and licensing of hosted technology solutions to clients. ***The diamond in the rough refers to PFMT's up-and-coming*** ***healthcare*** ***business segment***, composed of claims auditing and eligibility reviews. After seeing losses in 2018/19 due to high ramp up costs and standard implementation time lags, this segment appears to be set for robust growth going forward. Management has been clear that from 2017-2019, adjusted EBITDA has witnessed a slowdown to reflect a period of transformation in the company to establish itself in the Healthcare space. Management has confidently reiterated their belief in successfully reaching a 2021 goal of achieving $200M revenue with 20% EBITDA margins, with double digit growth continuing for years to come.\n\n**Covid-19 Impact:**  \nThis year was shaping up to be a strong year for PFMT, as Q1 showed promising results that validated the new trajectory of the company. Unfortunately, Q2 and Q3 were impacted by the public health emergency related to Covid-19. The CARES act brought changes that affected the student loans collection segment. Student loan payments, interest accrual and involuntary collection of payments (wage garnishments) were originally suspended till September 30, 2020 but were extended till December 31, 2020. However, PFMT continued to generate student loan revenue for a number of months from existing in-process borrow rehabilitation agreements. Another impact of Covid came from existing healthcare audit customers that requested a short-term pause on PFMT activities. Mgmt has indicated these pauses have largely ended during the third quarter. To mitigate the impact of this temporary slowdown, mgmt had furloughed more than 500 employees which could result in savings of about $18 million. The company is now aggressively ramping up efforts (including hiring/recruiting). Mgmt anticipates the ramp up efforts to be properly reflected in revenue by Q1 of 2021.\n\n**Healthcare Business:**  \nThe healthcare platform has finally reached scale, accounting for the largest (and continually growing) contribution to PFMTs revenue. In Q3, the healthcare business generated $17.6M in revenue (48.5% of total revenues (refer to Figure 1 below to view a cut out from the latest 10-k)). That is a 20.5% increase on sequential basis and a 63% increase from the same period last year. Please refer to figure 2 below, to see the change in healthcare revenues over time. This segment will continue to grow as Mgmt has made it clear this will be a main focus for the company. Soon healthcare will be the primary source of revenue (50%++), leading to a market multiple re-rate.  \nHealthcare revenues over last 11 quarters:\n\nQ3 2020= $17.6M  \nQ2 2020= $14.6M  \nQ1 2020= $17.5M  \nQ4 2019=$14.3M  \nQ3 2019= $10.8M  \nQ2 2019= $9.3M  \nQ1 2019= $9M  \nQ4 2018= $9.9M  \nQ3 2018= $6.6M  \nQ2 2018= $6.1M  \nQ1 2018= $3.5M\n\n\\[Figure 1: Q3 Financial Highlight\\]([https://imgur.com/a/WlqPLjZ](https://imgur.com/a/WlqPLjZ))\n\n\\[Figure 2: PFMT Healthcare Revenues\\]([https://imgur.com/a/W1OtGXu](https://imgur.com/a/W1OtGXu))\n\n**Macro:**  \nThe macro environment indicates there should be tailwinds for the audit, recovery, payment accuracy and coordination of benefits outsourcing business solutions PFMT provides. According to the CMS, national healthcare expenditures are forecast to grow at 5.4% CAGR for the next 8 years. Reaching $6.8T by 2028. Despite efforts to reduce the amount of improper payments, error rates in the industry range from 6% in commercial to 14.9% in government plans. Healthcare spending growth is driven primarily by a combination of increasing enrollment and cost inflation. Given the current unemployment environment, we are witnessing a spike in Medicaid enrollment, which should continue to benefit the business via rising utilization and claims volumes. It is useful to note that there can be a lag of several months between Medicaid eligibility and resulting claims volumes. This indicates that a majority of the benefits from the current environment are still to come. Also, as private organizations and state governments are struggling with lower revenues and budget deficits, this could create an increased focus on cost containment strategies where PFMT could play a supporting function. PFMT mgmt sees a $200B+ healthcare TAM growing annually.  \n**Competitors:**  \nPFMT differentiates itself with its proprietary technology and customizable approach to each of their customers' needs. The space is mostly dominated by large, slow moving players, that lack flexibility and uniqueness in their approach. Major competitors include HMS Holdings Corp (HMSY-US, \\~\\~$3B mkt cap) and Cotiviti (acquired in mid-2018 for $4.9B). Contracts in this industry are limited, take time to implement and can last years. PFMT continues to build a moat around it's business by consistently winning, maintaining and being awarded new contracts. An example includes being re-awarded CMS recovery Audit Region 1 and being awarded the newly created Region 5. Thus, successfully showcasing PFMTs superior product and path to success in this space. PFMTs will continue to encroach on incumbents' healthcare market share as the market begins to realize the superiority of their technology and approach. Refer to Figure 3, below, for an image taken form the CMS website showing the audit region relative to competition. Figure 4 may help to visualize the healthcare insurance payment cycle, and where PFMT may offer value.  \n**Debt:**  \nOn Aug 2017, PFMT entered a credit agreement with an existing shareholder and customer, ECMC. As of September 30, 2020 PFMT has about $62M loan outstanding under this credit agreement. ECMC has been able to accumulate about 5.8M warrants in PFMT as part of the agreement (about 10% of outstanding shares) all at an average exercise price of $1.95. The effective interest rate was about 13.9% in the 1H 2020. The loan is classified as a current liability, with maturity in August 2021. However, PFMT has two one-year options to extend maturity.  \nPFMT currently (as of Sept 30,2020) has about $17.3M cash and equivalents on hand and is entering a period of FCF generation.  \nThe current low interest rate environment offers low hanging fruit for companies looking to refinance their loans at a lower rate. Reducing their loan rate to 5-8% could save up to $5.5M in annual interest expense.  \n**Timing/Technicals:**  \nAs the calendar approached their earnings announcement date (Nov 11), PFMT stock was trading around recent highs of $2. The stock started selling off aggressively into the earnings and significantly further following earnings (despite a very positive release). The selling pressure appears to have been caused by portfolio management layoffs at Invesco, a top holder. Public disclosure of these layoffs coincides with timing of initial selloff, and a recent 13G filing confirms the exited position. This should quell any fears holders and followers of this stock may have had, as the selling was not based on fundamental flaws in the company or a new short thesis. Invesco owned about 18% of PFMT. Following the recent pressure, it appears the stock is in extremely oversold territory. Since their exit, the average volume profile of the stock has improved significantly, making accumulating a position easier for both retail and institutional demand.  \n**Valuation:**  \nThe timing of Covid partially contributes to why the market overlooked this stock, as Q2 and Q3 earnings were impacted. To establish a fair EBITDA estimation for 2020, we will use Q1 results with a conservative bias. Q1 is most appropriate because it will give us the clearest picture of how the company was performing prior to the temporary impacts of Covid. Using Q1, EBITDA was $6.4M (after deducting stock compensation). Annualizing that amount will give us an EBITDA run rate of $25.6M. This is a conservative measure because we do not account for the impact of any potential interest rate savings or growth in the healthcare segment. Next we need to establish the enterprise value (EV= debt + mkt cap - cash). Which we use to calculate EV/EBITDA. Calculation below.  \nEBITDA= $25.6M  \nEnterprise Value (EV)= $62M (debt) + $41 (mkt cap) -$17.3M (Cash) = $85.7 M  \nEV/EBITDA= 3.3X  \nFully diluted share count of 59.7M o/s\n\nNow lets take a look at some Healthcare IT comparables. The first 7 are general comps, the bottom 3 are the most similar comps to PFMT. To clarify, HMSY is currently publicly trading and is a direct competitor to PFMT. In December 2019, HMSY acquired Accent (a coordination of benefits/payments accuracy unit of Intrado focused on commercial and Medicare Advantage payers) for $155M. Accent had generated about $50M of revenue during the 12 months ending october 2019 (vs PFMTs $150M revenues in 2019). Based on the transaction price, HMSY paid an estimated 11-12X EV/Ebitda on a TTM basis. COTV was acquired and taken private in 2018, it continues to be a direct competitor with PFMT. COTV operated in payment integrity and was acquired for $4.9B in mid 2018, an estimated EV/EBITDA multiple of 14-15X based on consensus 2019 estimates. Also, keep in mind that the average EV/EBITDA for S&amp;P companies in 2020 is about 14.5X.  \nHealthcare IT Peer Trading Comp Table  \n                        Mkt Cap  SHARES O/S           EV         EV/EBITDA\n\nHMSY              2,793   88.6M                   3,021 16.8X  \nCHNG              5,581 304.5M                10,237 11.2X  \nACN          173,423 661.1M              171,554 19X  \nADS                 3,466   49.6M                24,047 30.3X  \nHQY               5,013       77M                  5,803 27.2X  \nIQV                34,135  191.7M                45,733 19.5X  \nCERN            23,727 306.6M                24,167 14X\n\n                                                                    Average: 19.7X\n\nPFMT              40.5           59.7M                         86 3.3X  \n(fully diluted)\n\nMost Similar Comps:  \nCOTV                  4,900 (2019 est)                14.5X  \nAccess                 155 (Acquired by HMSY in 2019) 11-12X  \nHMSY              2,793 88.6M                   3,021 16.8X\n\n                                                                         Average: 14.3X  \n\\[Table 2\\]([https://imgur.com/a/MP4yZgi](https://imgur.com/a/MP4yZgi))\n\nThe market still largely views PFMT as a declining student loans collections firm. Yet growing beneath the surface is an attractive healthcare business. As this segment continues to grow the market will recognize the high quality recurring revenue, ability to scale, and increasingly healthcare-focused pure-play as a catalyst for a multiple rerate. Now using the comps above, I will provide 3 scenarios (best, base, worst case scenario) applying a discount to conservatively account for the micro-cap nature and higher leverage of PFMT.  \nIn the best case scenario, we apply a 14X EV/EBTDA ratio (rounded down from the most similar comparable peer average of 14.3X) which, on a fully diluted share basis, lead to a current price per share of $6.  \nIn the base case scenario, we take a couple of notches off the closest peer average and apply a 12X EV/EBITDA ratio. Resulting in a current target price of $5.15/share  \nIn the worst case scenario, we further take off two more notches from the most similar peer average to apply a 10X EV/EBITDA ratio. Resulting in a price of $4.29/share.  \nAlso, considering the existing ownership of the company. Parthenon investors, Prescott Group, Mill Road Capital are all large shareholders. It is not unreasonable to think that they pursue a more aggressive activist role in the company and set it up for sale at a premium. It is also possible that competitors recognize the massive discount of this up-and-coming threat, and decide to acquire PFMT before other market participants drive up the price making such a strategic acquisition far more expensive. All of which offer upside to existing shareholders.  \nAs we approach future quarters and results continue to support this positive narrative we should start to see investor appetite pick up for this name. Average daily volumes have quadrupled since Invesco's recent exiting has added to the freely trading shares, improving the liquidity profile of PFMT. These signals will start appearing on investor screens as they (professional small cap investors, value investors, quant investors, generalists, hedge funds, etc) look for new ideas. There is virtually zero sell-side coverage of this stock at the moment, this will likely change in the future. **Accumulating a position now, presents an opportunity for entry at basement level prices in a stock that has the potential to provide 500-700% upside.**\n\n*Thank you for taking the time to read my idea. Full disclosure, I am long PFMT. Feedback and criticism of this idea are encouraged. Always do your own due diligence. Ive included the sources used for this analysis in the links below.*  \n\\[***Figure 3.:*** *CMS RACs per region\\](*[*https://imgur.com/a/YWlHANZ*](https://imgur.com/a/YWlHANZ)*)*\n\n\\[***Figure 4:*** *Healthcare insurance payments explained\\](*[*https://imgur.com/a/sbrh5pZ*](https://imgur.com/a/sbrh5pZ)*)*  \n*Claim Submissions (Steps 1 + 2): After treating a patient, the healthcare provider submits a claim for reimbursement to the health insurer. The claim will include information on the diagnosis and treatment/procedure*  \n*Claim Adjudication (Step 3): The health plan conducts administrative checks (eg. validates provider information and patient eligibility/ coverage) and prices the claim using the providers contract/ fee schedule.*  \n*Pre-payment Review (Step 4): The payor will leverage internal tools, followed by third party/outsourced solutions (ie. PFMT offerings) to conduct payment accuracy analysis prior to payment. Errors (discrepancies between the submitted claim and the payors payment policies) are identified and corrected.*  \n*Claim Payment (Step 5 + 6): The health plan will reimburse the provider for the patient care and services rendered*  \n*Post-payment review (Step 7): The payor will again use internal tools, followed by third party solutions (PFMT) to evaluate prior payments with additional information that has become available (eg. clinical reviews). Payors will correct*\n\n**Part 2:** \n\n$PFMT hit $1 by EOD yesterday, as much as I would like to think that the prior write-up was a catalyst for PFMTs recent performance, it is more likely driven by some significant and recent industry developments.  This will be a short follow up summarizing the recent event and why I think it is important to the underlying thesis. Also, I will try to respond to the some of the questions received last night. Thank you to all who have engaged me. Hopefully we can continue this constructive dialogue around this investment idea. \n\nOn Monday morning (Dec 21), HMSY (a direct competitor of PFMT) announced it had agreed to be acquired by Gainwell Technologies for $3.4B. Gainwell is owned by the private equity firm Veritas Capital. In March 2020, DXC Technologies announced the sale of their Government Healthcare business segment for $5B in cash to Veritas which renamed this new segment: Gainwell Technologies. Prior to acquiring this segment from DXC, this healthcare business was generating $1.5B in annual revenues, growing double digits year over year with 20% margins (inline with industry standard and PFMTs 2021 margin goal). The transaction values HMSY at 16-17X forward 2021 EV/EBITDA.  From what I gather, this is above most consensus estimates but still seems to be a fair price. A reminder that Veritas also acquired Cotiviti (COTV) in 2018 at a slightly lower valuation of 14-16X EV/EBITDA. The willingness to pay a premium relative to their COTV recent transaction indicates growing opportunity in the space.\n\nVeritas intends on breaking up the various HMSY segments and redistributing them among its portfolio companies COTV and Gainwell. COTV will take on the payment integrity and population health management business while Gainwell will take on the Medicade, Coordination of benefits/third party liability services business. Strategically, Veritas is able to secure HMSY's valuable set of data assets in the Medicaid market, and gaining exposure to the potentially higher EBITDA in 2021 due to the positive recent Medicaid enrollment trend. However, HMSY has been under pressure for failing to deliver predictable results and underperformance in some segments (particularly their population health management business). This inherent volatility in the revenue model is a burden on these companies (including PFMT) as it masks longer term growth and margin expansion potential. \n\nThough FTC concerns don’t appear to be an issue. It is uncertain to me what this new Veritas combination will mean for their Medicare RAC regions. As HMSY has one region and COTV has two. I believe there is a program limit of two regions per vendor. This could prove to be an obstacle for the new entity.  Also the inherent culture clash in executing large mergers typically leads to significant employee turnover and loss of talent. In such a niche industry, I would imagine the labor market is tight and any brain drain could hurt the new entity. In fact, a basic linkedin search of these companies indicates a recent influx of talent from large competitors into PFMT. If industry incumbents, particularly experienced sales people, are realizing PFMT has a superior platform relative to the large slow moving competition then this should be another positive signal reinforcing PFMTs trajectory. Discount this as anecdotal investigative evidence but I think it has merit.\n\nThe continuing theme of consolidation in this particular area of Healthcare IT highlights the large market opportunity across cost-containment and solutions services.\n\nRecent transactions:\n\nAccess acquired by HMSY in 2018 at 11-12X EV/EBITDA\n\nDXC HC segment acquired by Veritas/Gainwell \n\nCOTV acquired by Veritas at 14-15X\n\nHMSY acquired by Veritas at 16-17X\n\n&amp;#x200B;\n\nThis all bodes well for PFMT, as it solidifies my view that this turnaround story is not being valued as an appropriate comp to its peers. If TODAY the market determines that HMSY is worth 16-17X EV/EBITDA, this supports my Base and Best Case Scenario of valuing PFMT using a 12X ($5.15/share) and 14X ($6/share) multiple, respectively (accounting for microcap nature and leverage by reducing the multiple by a few notches).  The recent price improvement in PFMT appears to be driven by a recognition of PFMT being undervalued on a comparable basis. Volumes have improved in the last few sessions but the stock is still extremely undervalued. Likely some retail investors accumulating entry positions. Imagine if a small fund of $100 AUM identifies this stock as an ideal investment, decides to initiate a small 200 basis point position. It would require 2-3M shares. The stock was up 20% today after trading only 1M shares, accumulating supply for a single fund position will require a significant movement in price. Given the current valuation, this opportunity could soon hit the radar screens of multiple funds. The recent string of transactions will continue to attract attention to this space. Sooner or later someone will start kicking the tires on PFMT...\n\nResponses to recent questions and comments:\n\n 1. Is it possible that customers build/improve their internal tools to the point where they become threats to PFMT?\n\nGood question. Customers may marginally improve their ability to audit claims internally but not to the point of being a threat. It's important to understand that the solutions/services offered by PFMT, HMSY, COTV, etc require technology- heavy platforms that require significant amount of resources (financial and intellectual) to develop, once developed there are minimal incremental costs for higher volumes. These types of commitments are not usually within the realm of possibilities among the customer base.  The ever-changing complexity around these types of industries makes in-house billing departments ill-equipped to maximize value relative to specialists like PFMT. An example to illustrate such complexity would be the ongoing changes in the International Classification of Disease codes (ICD). When the WHO decided to change the medical classification codes of ICD9 to ICD10, it increased the number of procedure codes from 13,000 to 68,000. This is just one example of the type of nuance that will always provide opportunity for specialist support from a PFMT. \n\n2. Terms of the credit agreement and Why hasn’t management refinanced the Debt?\n\nFor anyone eager to learn more about the terms of the Credit Agreement, i would advise you read the latest 10k (link posted in my original report). The 10-k is helpful in clearly outlining all details. \n\nI think management is working towards refinancing the debt. But these are not things that can be negotiated or arranged immediately. It is possible that management wants/needs to have a certain number of consistent quarter over quarter improvement before they can renegotiate terms. In the current interest rate environment and following their recent turnaround progress, this low hanging fruit should be picked soon enough. \n\n&amp;#x200B;\n\n3.   Divesting legacy business?\n\nI would not be surprised to see parts of the legacy business sold off as the focus turns toward the growing health care business. I will continue monitoring management discussion on next earnings call for any evidence to support this.\n\n&amp;#x200B;\n\n4. PFMT is transitioning to focus on its healthcare business.\n\n Some commentators have referred to PFMT as a pure-play student loans collection firm which would be a false description. Student loans do not account for a majority of their revenues and management has made it clear their focus has changed towards a constantly growing healthcare industry. \n\n&amp;#x200B;\n\n5. Comparables mentioned are 100X larger than PFMT, why is that a fair comparison?\n\nThis is a reasonable observation. The answer to which is a function of numerous factors. The current market cap is significantly depressed as the popularity contest that IS the stock market is not identifying the value of this name. The stock was depressed further as a large holder just sold their 18% position, pushing the price near all-time lows. The huge gap in public market valuation is one of the reasons why this is a table pounding buy in my opinion. As this gap closes the difference in market cap will seem more acceptable. \n\nAlso, despite being small, the fact that PFMT is able to compete on the same level with these giants is a testament to its superior product and team: evidenced by their ability to secure two Medicare RAC region contracts (competing directly with COTV and HMSY), among other contacts won from incumbents. \n\n6. What is the moat/\"secret sauce\"?\n\nI am not a software engineer, nor do I have inner workings into PFMT's technology. Based on publicly available information, I can speculate that PFMT's disruptive technology refers its ability to differentiate itself over the competition. Competitors have been using a \"one-size-fits-all approach\" to their customers. PFMT uses their proprietary software to scrape data and yield higher rates of potential recoverable claims. Their solutions are more client-centric than the competition. As a smaller player they can be nimble, providing customized solutions to fulfill each client’s needs. For this reason they continue to be rewarded with new contracts taken from large incumbents. See the recent presentations (on their website) for quantitative case study examples.\n\nThese contracts are difficult to win, have long term time horizons.  The technology to service customers is unique and initially capital intensive to establish. Barriers to entry are significant.\n\n  \n**Sources:**  \n[https://www.performantcorp.com/investors/events-and-presentations/default.aspx](https://www.performantcorp.com/investors/events-and-presentations/default.aspx)  \n[https://www.sec.gov/cgi-bin/browse-edgar?CIK=1550695&amp;owner=exclude](https://www.sec.gov/cgi-bin/browse-edgar?CIK=1550695&amp;owner=exclude)  \n[https://www.cms.gov/Research-Statistics-Data-and-Systems/Monitoring-Programs/Medicare-FFS-Compliance-Programs/Recovery-Audit-Program](https://www.cms.gov/Research-Statistics-Data-and-Systems/Monitoring-Programs/Medicare-FFS-Compliance-Programs/Recovery-Audit-Program)  \n[https://www.cms.gov/Research-Statistics-Data-and-Systems/Statistics-Trends-and-Reports/NationalHealthExpendData/NationalHealthAccountsHistorical](https://www.cms.gov/Research-Statistics-Data-and-Systems/Statistics-Trends-and-Reports/NationalHealthExpendData/NationalHealthAccountsHistorical)",
        "subreddit": "stocks",
        "title": "$PFMT Performant Financial: Boring Business but a Diamond in the Rough",
        "url": "https://www.reddit.com/r/stocks/comments/kiyfwx/pfmt_performant_financial_boring_business_but_a/",
        "created": 1608777094.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1607792362,
        "id": "kbsgu8",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "Good Friday evening to all of you here on r/StockMarket. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning December 14th, 2020.\n\n# **Year-end Santa rally could depend on the big week ahead for markets  - [(Source)](https://www.cnbc.com/2020/12/11/congres-fe.html)**\n*****\n&gt; The week ahead is so jam-packed for markets that it could determine whether there will be a smooth glide path for a Santa rally into the end of the year.\n*****\n&gt; First, Congress looks set to fight down to the wire about a pandemic stimulus package, and chances are good it could again disappoint. The Fed also holds its final meeting of the year, and market pros are split on whether it will tweak its bond buying program when it issues its statement Wednesday. Since there’s a divided view, there’s room for market reaction either way.\n*****\n&gt; Then there is lots of really meaty data, including November retail sales Wednesday, the Markit Purchase Manager Indexes and regional Fed surveys.\n*****\n&gt; Finally, Tesla will be rolled into the S&amp;P 500 at Friday’s closing bell, and that could bring its own fireworks as big investors lighten up on the other index stocks to make room for entrance of the electric car maker in their portfolios. That also happens on a day that could have its own built-in volatility — the quarterly quadruple witching expiration of options and futures.\n*****\n&gt; “To me, the most market moving piece of information is, do we or don’t we get a stimulus package? The market has priced one in, so the biggest disappointment is if we don’t get one,” said Art Hogan, chief market strategist at National Securities. “The tug of war between the virus and vaccine had a tiebreaker in stimulus.”\n*****\n&gt; Hogan said a positive could be if the Food and Drug Administration on Thursday votes to approve the Moderna vaccine, a week after it considered Pfizer’s vaccine. But it is really Congress the market is looking to now, and if it acts, it will be a market positive.\n*****\n&gt; “I think that propels us into the year-end and higher levels. It only takes one of these things to pull over the apple cart, and the one that could matter is Congress not getting something out the door on stimulus. That would pull us back the hardest,” Hogan said.\n*****\n&gt; Peter Boockvar, chief investment officer at Bleakley Advisory Group, said the expiration of unemployment benefits for millions of Americans at the end of December could push Congress to act.\n*****\n&gt; “But you can’t ignore the strong stance the Republicans have taken on liability for business and the strong stance the Democrats have taken on state aid,” he said.\n*****\n&gt; Tom Block, Washington policy analyst at Fundstrat, said he sees a 50/50 chance for a deal by the end of the week. If there is no agreement, federal unemployment benefits for millions and an eviction moratorium would expire at the end of the month.\n*****\n&gt; Block said that even if Congress fails to immediately approve a bill to prevent a government shutdown, he expects lawmakers to reach an accord and keep the government running. But the stimulus is unclear, and much of it is a relief package.\n*****\n&gt; “There’s a solution staring them in the face, and the record food lines are in red states and blue states,” he said. “Both sides seem to be unwilling to come to a deal on what they commonly agree on.”\n*****\n&gt; # Tesla revving up the S&amp;P\n&gt; Tesla’s entry into the S&amp;P 500 is a much-anticipated event that traders expect to add some volatility to the market, as investors in the S&amp;P index shift holdings. Tesla joins the S&amp;P 500 on Dec. 21, at Friday’s closing price, and Friday has the potential to be a wild day .\n*****\n&gt; “I don’t know if it creates volatility. It’s going to create a significant amount of frenetic trading which may have the aspects of volatility,” said Matthew Bartolini, head of SPDR Americas Research at State Street Global Advisors. “Given we are interacting with a very high-volatility regime already, I think it wouldn’t take much to see the VIX spike.”\n*****\n&gt; Bartolini said there was already a lot of trading activity expected with the expiration of options and futures Friday. “It’s just going to create more noise,” he said.\n*****\n&gt; Tesla is the biggest company to join the S&amp;P 500, and the rebalance Friday will be the largest ever. Tesla will be the seventh-largest stock in the S&amp;P.\n*****\n&gt; Index fund managers will have to buy upwards of an estimated $70 billion of Tesla, and that means selling the other S&amp;P 500 stocks to make room. There will also be trading based on weighting adjustments in the index.\n*****\n&gt; “What you will likely have is people naturally are going to buy Tesla and sell other shares. It could create some upward momentum in Tesla and downward pressure on the shares that are going out,” Bartolini said.\n*****\n&gt; “It will be exciting. You’re going to see Tesla trade at significant volume.”\n*****\n&gt; # Fed ahead\n&gt; The Fed meeting will also be important, and it has been a hot topic of speculation, particularly in the bond market. Some market pros expect the Fed could make changes to its bond program. The Fed is currently buying at least $80 billion a month of Treasurys, and Fed officials have discussed what they could do to change that program at their last meeting.\n*****\n&gt; There is now speculation that the Fed will hold the purchases at $80 billion a month, but change the type of securities it is buying, with more focus on longer-dated notes and bonds. That would theoretically hold rates down at the long end, but only about half of market participants expect the Fed to take action at this meeting.\n*****\n&gt; The Fed also is buying at least $40 billion a month in mortgage-backed securities.\n*****\n&gt; “It means at least half the market is going to be disappointed with whatever the Fed does or doesn’t do,” said Patrick Leary, chief market strategist and senior trader at Incapital. “That has the potential to cause some volatility, especially in the rates market, and potentially in risk markets.”\n*****\n&gt; Stocks were choppy in the past week, with the S&amp;P 500 down just about 1% at 3,663. Treasury yields moved higher in the past week but retrenched Friday, when the 10-year sank below 0.9%.\n*****\n&gt; # Window on the economy\n&gt; There’s a busy economic calendar in the week ahead. Weekly claims Thursday are expected to be closely watched after a surprise jump in people seeking new benefits for the week ending Dec. 5.\n*****\n&gt; November Markit PMIs for the manufacturing and services sectors are released Wednesday, as is the November retail sales report.\n*****\n&gt; Boockvar said he is watching to see how much the services sector is being impacted by the spreading pandemic and related shutdowns.\n*****\n&gt; “I think the economic data is being overlooked for better or worse because it’s pre-vaccine,” he said.\n*****\n&gt; Economists expect the economy is slowing and the labor market has been weakening, particularly since the virus spread has continued to accelerate. Some expect the first quarter to be weaker than the fourth quarter, but activity should pick up in the second quarter as the vaccine is distributed.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.postimg.cc/2S0NcDWd/finvizmaps1.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.postimg.cc/x8vWKDYz/alphatrends1.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.postimg.cc/L6BpPf6b/finvizfuts.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/5Q2G6MV.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.postimg.cc/ZR3gStWM/marketdata1.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.postimg.cc/Vv8hsGML/spxsectors1.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.postimg.cc/jdjX6YsY/marketpullbacklevels1.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.postimg.cc/2jGGBSNx/marketrallylevels1.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.postimg.cc/CM3tmKQp/er1.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/eOWZhrG.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/LxpLHIm.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/643dART.png))**\n\n*****\n\n&gt; # Not All Bad for Small Business\n\n&gt; This morning the NFIB released their monthly reading on the small business sector. With case counts rising throughout November, small business optimism took a hit. Compared to September and October's identical readings of 104, November's reading fell to 101.4. Although that is lower, it remains above the levels seen from March through the summer. Additionally, there were several silver linings in this month's report.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/120820-NFIB-Headline.png))**\n\n&gt; Glancing across the various components and sub-indices of the report, breadth was pretty mixed. Of the ten components of the headline number, six fell and the remaining four were higher. Of the other indices that are not inputs to the headline number, half of the indices were higher while another two were unchanged, and the other two were lower.\n\n&gt; As for the most pressing problems reported by small businesses, there was little change overall. Quality of labor remains the most widely reported problem, stealing share from those reporting the cost of labor as the biggest issue. The second biggest issue and the only other one to see an uptick in November was taxes. Perhaps due to the results of the election and the prospects of higher taxes down the road, the percentage of respondents reporting taxes as the most pressing issue rose 3 percentage points to 20%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/120820-NFIB-Table.png))**\n\n&gt; Taking a deeper dive into the individual components of the report, the various indices concerning employment metrics were pretty strong in November. While the index for actual employment changes remains negative meaning more businesses reported declines in employment rather than increases, that is not to say businesses are not looking to gain employees.\n\n&gt; For starters, a higher number of responding firms (34% vs 33% in October) reported that they had at least one unfilled job opening in November. That is in the top decile of all historical readings. Breaking that number down further, the NFIB highlighted that 29% of those were for skilled workers and 13% were for unskilled workers. Additionally, businesses do plan to fill open positions in the near future. The index for plans to increase employment rose from 18 in October to 21 last month. Overall, more than half of firms said that they either hired or are trying to hire as 30% reported that either cost or quality of labor have been the biggest roadblocks to their business. Given these apparently tight labor conditions, the indices for compensation and plans to increase compensation were both higher.\n\n&gt; We would also note that the divergence between businesses wanting/trying to fill positions and declines in the actual number of employees reported is consistent with what we saw in last week's data from the ISM report.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/120820-NFIB-Empl.png))**\n\n&gt; Rising employment and compensation can be justified when looking at the indices concerning sales and earnings. While these broadly took turns lower this month, they remain at readings that are consistent with more companies than not seeing sales growth. The index for earnings changes turned a bit lower falling from -4 to -7. Despite that, it is still a level that is at the top of its historic range. Additionally, a net 5% of reporting firms saw higher sales over the past three months, down slightly from 6% last month.\n\n&gt; In turn, the net percentage of owners expecting sales to be higher also fell to a reading of 10% from 11% last month. Even though sales were a bit weaker, prices have continued to rise. The index for companies reporting higher prices rose from 15 to 18. That is the highest level of that index since a reading of 19 in May of 2018. NFIB highlighted further that the most common businesses to report higher prices were retail (28%) and wholesale (23%).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/120820-NFIB-Sale.png))**\n\n&gt; Although the decline in expected sales was modest and businesses plan to increase hiring, the index that took the biggest hit in November was the reading for expectations for the economy to improve. That index for the general outlook of business conditions fell 19 points month over month to a low reading of 8. That is the lowest level since March when the index was 3 points lower at 5. Additionally, the only time the index has declined by more in just one month was in November of 2012 when it fell from 0 to -38 in just one month. Other indices like those for expenditures and whether or not it is a good time to expand similarly remain weak, but did not see the same sort of dramatic declines.\n\n&gt; Looking at other indices though, this decline appears to have been relatively extreme. A net 5% of owners report inventory levels are too low which is tied with September for a record high. While a greater share of firms plan to increase rather than reduce inventories, that index did fall from a 48-year high of 12 last month down to 5 in November. Despite that historically large single month decline, this monthly reading is still at a strong level.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/120820-NFIB-Expan.png))**\n\n*****\n\n&gt; # Meet the Nasdaq 100's Post-Election Leaders\n\n&gt; The Nasdaq 100 finally made a new high on Tuesday before pulling back yesterday, but in the run-up to new highs in the post-election rally, it hasn't been the same old crew of stocks pushing the index higher. While the Nasdaq 100 is up about 12.5% since the election, thirteen stocks are up by more than twice the amount of the index itself. Leading the way higher, Moderna (MRNA) is up over 100% after positive news regarding its vaccine. After MRNA, shares of Pinduoduo (PDD), a Chinese e-commerce play, have rallied more the 50%, rising from $97.72 up to $154.00. Tesla (TSLA) rounds out the top three with a gain of 47% in just the last five weeks. The next two stocks on the list - Applied Materials (AMAT) and Micron (MU) - can hardly be considered emerging stocks. In addition to those two stocks from the semiconductor sector, three others from the sector made the cut (LRCX. MCHP, and QCOM) as chips have been red-hot.\n\n&gt; At the bottom of the table, we have also included the performance of the five mega-cap stocks of the Nasdaq 100. While all five stocks outperformed for much of 2020, not a single one of them is outperforming the Nasdaq 100 since Election Day, and only Apple (AAPL) is anywhere close to matching the performance of the index itself.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/121020-Nasdaq-100.png))**\n\n&gt; The chart below shows the performance of an equally-weighted basket of the five mega-cap stocks over the last year. From 9/2 to 9/23, this basket of stocks pulled back more than 16%, and while it has been steadily grinding higher in the eleven weeks since that low, up until this point, the prior highs from September haven't even come into play.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/1210-Mega.png))**\n\n*****\n\n&gt; # Sentiment Still Overwhelmingly Bullish\n\n&gt; For the third week in a row, just under half of the respondents to the weekly AAII sentiment survey reported as bullish. This week's bullish sentiment reading came in at 48.06%, which was down just slightly from 49.07% last week. While lower in the past week, bullish sentiment remains elevated in the top decile of readings over the past decade. Granted, it is also still below the high of 55.84% from November 12th. Similarly, the Investor Intelligence survey of equity newsletter writers also saw bullish sentiment drop slightly, falling from 64.7% to 64.4%. But again just like the AAII survey, that is a historically elevated level in the top 3% of all readings since 1963.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/121020-AAII-Bullish.png))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/121020-II-Bullish.png))**\n\n&gt; With bullish sentiment lower, a higher percentage of investors reported as bearish. Whereas last week saw bearish sentiment fall to 22.66%, the lowest level since the first week of 2020, this week bearish sentiment rose 4.2 percentage points to 26.86%. That is still below the reading of 27.47% from the last week of November and at the low end of the past few years' range. In terms of bearish sentiment, the Investors Intelligence survey is again echoing these results. This survey saw bearish sentiment rise 0.1 percentage points to 16.8%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/121020-AAII-Bearish.png))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/121020-II-Bearish.png))**\n\n&gt; Overall, sentiment remains heavily in favor of bulls. As shown below, for both the AAII and Investors Intelligence surveys, the bull-bear spreads are at historically high levels.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/121020-AAII-Bull-bear.png))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/121020-II-Spread.png))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending December 4th, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=68-8FE3FRSw))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 12.6.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=pCODbMH2beY))**\n\n*****\n\n&gt; # Rally To Resume Mid-Month - Typical December Seasonal Pattern\n\n&gt; For the most part, this December has unfolded in rather typical seasonal fashion. The market started the month off with solid gains and continued to rally through the fourth trading day before turning somewhat mixed. Russell 2000 and NASDAQ advanced an additional two trading days while DJIA, S&amp;P 500 and Russell 1000 see-sawed essentially sideways until yesterday, the seventh trading day of December.\n\n&gt; Currently the major indexes are navigating the often-dull period that has historically begun around the fourth trading day of the month through the eighth. Afterwards, later this week into early next week, another patch of weakness is possible. Then right around mid-month, the rally that began in at the beginning of November, is likely to resume. The resumption could be bumpy but once quarterly options expiration passes our Santa Claus Rally will begin on the open of trading on December 24. Since 1969, S&amp;P 500 has enjoyed an average gain of 1.3% during the Santa Claus Rally that spans the last five trading days of this year and the first two trading days of next year.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/35feeda338d979bfb6b6f25b3156fb4d/11fa20ff3c6ff3a3-4b/s500x750/454472c6c7d32c04ce9ec7e2e0ca7c045dab183d.jpg))**\n\n*****\n\n&gt; # Is Inflation Looming?\n\n&gt; The November reading for the Consumer Price Index (CPI), the most well-known measure of inflation, was released Thursday, December 10, and while both the headline and “core” readings (excluding food and energy) came in slightly higher than the Bloomberg-surveyed economists’ consensus, core inflation remains tame at 1.6% over the trailing year. Inflation is likely to pick up as the economy improves and may run a little hotter than we’ve seen in recent years in 2021, but we believe the risks of a substantial inflation surprise over the next year is limited.\n\n&gt; “Congress and the Fed provided massive stimulus this year and it seems like that should be inflationary,” said LPL Chief Market Strategist Ryan Detrick, “but it’s important to remember that the stimulus was there to fill a giant hole from lost wages and an economy running well below its potential.”\n\n&gt; As shown in today’s LPL Chart of the Day, core inflation on a trailing-year basis still has some catching up to do, although the one-month reading is now largely consistent with pre-Covid levels. inflation over the last decade has remained subdued and largely steady.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/12/12.11.20-Blog-Chart-1.png?ssl=1))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$FDX** \n&gt; * **$HEXO** \n&gt; * **$RAD** \n&gt; * **$NKE** \n&gt; * **$BB** \n&gt; * **$CTK** \n&gt; * **$GIS** \n&gt; * **$ACN** \n&gt; * **$TTC** \n&gt; * **$LEN** \n&gt; * **$WGO** \n&gt; * **$JBL** \n&gt; * **$DRI** \n&gt; * **$UXIN** \n&gt; * **$CNTG** \n&gt; * **$SAFM** \n&gt; * **$MTSC** \n&gt; * **$ABM** \n&gt; * **$WOR** \n&gt; * **$AOUT** \n&gt; * **$NDSN** \n&gt; * **$APOG** \n&gt; * **$DL** \n&gt; * **$BLBD** \n&gt; * **$AIR** \n&gt; * **$ASPU** \n&gt; * **$APDN** \n&gt; * **$CAMP** \n&gt; * **$SCHL** \n&gt; * **$QTT** \n&gt; * **$SCSC** \n&gt; * **$VNCE** \n&gt; * **$RFIL** \n&gt; * **$CSBR** \n&gt; * **$NAV**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.postimg.cc/CM3tmKQp/er1.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.postimg.cc/Wb0yKPBF/ervol1.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 12.14.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n&gt; # ***Monday 12.14.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!]())\n(NONE.)\n\n*****\n\n&gt; # ***Tuesday  12.15.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n&gt; # ***Tuesday 12.15.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/oxA4VQw.png))\n\n*****\n\n&gt; # ***Wednesday 12.16.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/sO15Y4c.png))\n\n&gt; # ***Wednesday 12.16.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/jQE7QFL.png))\n\n*****\n\n&gt; # ***Thursday 12.17.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/8q2wpXy.png))\n\n&gt; # ***Thursday 12.17.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/f4M4FMw.png))\n\n*****\n\n&gt; # ***Friday 12.18.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/D6W4j8k.png))\n\n*****\n\n&gt; # ***Friday 12.18.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/dGlrSdg.png))\n\n*****\n\n&gt; # FedEx Corp. $289.47\n**FedEx Corp. (FDX)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, December 17, 2020. The consensus earnings estimate is $3.90 per share on revenue of $19.24 billion and the Earnings Whisper ® number is $4.74 per share. Investor sentiment going into the company's earnings release has 83% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 55.38% with revenue increasing by 11.06%. Short interest has decreased by 34.4% since the company's last earnings release while the stock has drifted higher by 14.4% from its open following the earnings release to be 55.0% above its 200 day moving average of $186.81. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, December 10, 2020 there was some notable buying of 10,300 contracts of the $115.00 call expiring on Friday, April 16, 2021. Option traders are pricing in a 8.4% move on earnings and the stock has averaged a 8.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FDX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # HEXO Corp. $1.00\n**HEXO Corp. (HEXO)** is confirmed to report earnings at approximately 7:20 AM ET on Monday, December 14, 2020. The consensus estimate is for a loss of $0.02 per share on revenue of $21.62 million and the Earnings Whisper ® number is ($0.01) per share. Investor sentiment going into the company's earnings release has 64% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 80.00% with revenue increasing by 97.39%. Short interest has decreased by 13.4% since the company's last earnings release while the stock has drifted higher by 69.5% from its open following the earnings release to be 23.7% above its 200 day moving average of $0.81. Overall earnings estimates have been revised lower since the company's last earnings release. The stock has averaged a 10.7% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HEXO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Rite Aid Corp. $18.46\n**Rite Aid Corp. (RAD)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, December 17, 2020. The consensus estimate is for a loss of $0.01 per share on revenue of $5.85 billion and the Earnings Whisper ® number is $0.06 per share. Investor sentiment going into the company's earnings release has 71% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 101.85% with revenue increasing by 7.10%. Short interest has increased by 13.0% since the company's last earnings release while the stock has drifted higher by 44.0% from its open following the earnings release to be 37.8% above its 200 day moving average of $13.40. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, December 9, 2020 there was some notable buying of 7,170 contracts of the $23.00 call expiring on Friday, January 15, 2021. Option traders are pricing in a 18.3% move on earnings and the stock has averaged a 21.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=RAD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Nike Inc $137.41\n**Nike Inc (NKE)** is confirmed to report earnings at approximately 4:15 PM ET on Friday, December 18, 2020. The consensus earnings estimate is $0.63 per share on revenue of $10.59 billion and the Earnings Whisper ® number is $0.72 per share. Investor sentiment going into the company's earnings release has 75% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 10.00% with revenue increasing by 2.56%. Short interest has increased by 34.3% since the company's last earnings release while the stock has drifted higher by 5.5% from its open following the earnings release to be 30.9% above its 200 day moving average of $104.97. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, December 2, 2020 there was some notable buying of 4,836 contracts of the $135.00 put and 4,558 contracts of the $135.00 call expiring on Friday, January 15, 2021. Option traders are pricing in a 5.8% move on earnings and the stock has averaged a 5.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NKE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # BlackBerry Limited $8.16\n**BlackBerry Limited (BB)** is confirmed to report earnings at approximately 5:00 PM ET on Thursday, December 17, 2020. The consensus estimate is for a loss of $0.01 per share and the Earnings Whisper ® number is $0.03 per share. Investor sentiment going into the company's earnings release has 78% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 120.00% with revenue increasing by 274.16%. Short interest has increased by 21.2% since the company's last earnings release while the stock has drifted higher by 57.8% from its open following the earnings release to be 67.2% above its 200 day moving average of $4.88. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, December 1, 2020 there was some notable buying of 34,988 contracts of the $10.00 call expiring on Friday, January 15, 2021. Option traders are pricing in a 13.0% move on earnings and the stock has averaged a 10.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BB&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # CooTek Inc. $4.93\n**CooTek Inc. (CTK)** is confirmed to report earnings before the market opens on Tuesday, December 15, 2020. The consensus estimate is for a loss of $0.27 per share on revenue of $112.20 million. Investor sentiment going into the company's earnings release has 47% expecting an earnings beat The company's guidance was for revenue of approximately $112.00 million. Consensus estimates are for earnings to decline year-over-year by 485.71% with revenue increasing by 258.81%. Short interest has decreased by 33.7% since the company's last earnings release while the stock has drifted lower by 32.3% from its open following the earnings release. Overall earnings estimates have been revised lower since the company's last earnings release.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CTK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # General Mills, Inc. $59.32\n**General Mills, Inc. (GIS)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, December 17, 2020. The consensus earnings estimate is $0.96 per share on revenue of $4.65 billion and the Earnings Whisper ® number is $1.02 per share. Investor sentiment going into the company's earnings release has 51% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 1.05% with revenue increasing by 5.18%. Short interest has increased by 28.8% since the company's last earnings release while the stock has drifted higher by 1.1% from its open following the earnings release to be 1.2% below its 200 day moving average of $60.04. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, December 2, 2020 there was some notable buying of 843 contracts of the $57.50 call expiring on Friday, January 21, 2022. Option traders are pricing in a 5.1% move on earnings and the stock has averaged a 2.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=GIS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Accenture Ltd. $245.83\n**Accenture Ltd. (ACN)** is confirmed to report earnings at approximately 6:45 AM ET on Thursday, December 17, 2020. The consensus earnings estimate is $2.04 per share on revenue of $11.38 billion and the Earnings Whisper ® number is $2.10 per share. Investor sentiment going into the company's earnings release has 47% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 2.39% with revenue increasing by 0.19%. Short interest has decreased by 2.1% since the company's last earnings release while the stock has drifted higher by 12.3% from its open following the earnings release to be 16.9% above its 200 day moving average of $210.33. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 5.1% move on earnings and the stock has averaged a 3.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ACN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Toro Company $91.52\n**Toro Company (TTC)** is confirmed to report earnings at approximately 8:30 AM ET on Wednesday, December 16, 2020. The consensus earnings estimate is $0.52 per share on revenue of $760.73 million and the Earnings Whisper ® number is $0.62 per share. Investor sentiment going into the company's earnings release has 52% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 8.33% with revenue increasing by 3.59%. Short interest has increased by 33.3% since the company's last earnings release while the stock has drifted higher by 16.8% from its open following the earnings release to be 49.7% below its 200 day moving average of $181.81. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 11.7% move on earnings and the stock has averaged a 3.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TTC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Lennar Corp. $72.76\n**Lennar Corp. (LEN)** is confirmed to report earnings at approximately 5:10 PM ET on Wednesday, December 16, 2020. The consensus earnings estimate is $2.38 per share on revenue of $6.53 billion and the Earnings Whisper ® number is $2.48 per share. Investor sentiment going into the company's earnings release has 72% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 11.74% with revenue decreasing by 6.33%. Short interest has decreased by 4.5% since the company's last earnings release while the stock has drifted lower by 3.7% from its open following the earnings release to be 12.7% above its 200 day moving average of $64.55. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, November 25, 2020 there was some notable buying of 4,725 contracts of the $76.50 call expiring on Thursday, December 24, 2020. Option traders are pricing in a 7.4% move on earnings and the stock has averaged a 2.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LEN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/StockMarket.",
        "subreddit": "StockMarket",
        "title": "Wall Street Week Ahead for the trading week beginning December 14th, 2020",
        "url": "https://www.reddit.com/r/StockMarket/comments/kbsgu8/wall_street_week_ahead_for_the_trading_week/",
        "created": 1607821162.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1608585280,
        "id": "khqelr",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Monday, December 21, 2020**\n\nStocks pared losses on Monday after opening lower in the morning. Market participants digested mounting concerns over a new infectious strain of the coronavirus identified in the United Kingdom and the news that Congress in the United States finally agreed an additional $900 billion virus-relief package.\n\nDuring the weekend, the United Kingdom announced the discovery of a new strain of the coronavirus that is reportedly 70% more transmissible than the original strain. Sir Patrick Vallance, the chief scientific advisor to the UK government, said that over 60% of the new infections recorded in London were caused by the new variant. In response, more than 48 -including European allies- have imposed travel bans on the UK, with the duration of the ban lasting anywhere from a couple of days to months. The pound fell 1.9% against the dollar.\n\nAfter months of negotiating, lawmakers in Washington finally reached a deal for an additional $900 billion stimulus package. The stimulus package will include another round of direct checks to Americans, this time for only $600, enhanced federal unemployment benefits of $300 per week, and additional funds for small businesses and vaccine distribution efforts. some of the more contentious points of earlier stimulus negotiations – including state and local government aid and liability protections for businesses – were omitted from this deal. The [text of the 5,593-page bill ](https://rules.house.gov/sites/democrats.rules.house.gov/files/BILLS-116HR133SA-RCP-116-68.pdf)was released this afternoon. \n\nFor quite some time, the passage of additional stimulus in the US was seen as the catalyst to increase the pace of recovery in the wake of the pandemic. However, there is much disappointment around the new stimulus, with many seeing the $600 check as inadequate relief for months of economic hardship. We expect this disappointment, combined with the new reports of the coronavirus mutating to drive volatility in the market as we close the year. In our view, the longterm fundamentals for the market remain strong and are looking forward towards 2021.\n\n**Highlights**\n\n* U.S. lawmakers are expected to vote Monday to approve landmark reforms on how the government certifies new airplanes are safe in the wake of two fatal Boeing 737 MAX crashes, according to a summary made public Monday.\n* Walt Disney Company (DIS) said on Monday it had named Alan Bergman as chairman of its Disney Studios Content division to oversee its famed movie studios including Pixar, Marvel, Lucasfilm, and Searchlight Pictures.\n* US bank stocks rallied today after the Federal Reserve announced the recent stress test results meant the sector could resume stock buyback programs for the first-time since the pandemic began.\n* Shares of Tesla (TSLA) slid around 7% in the first day trading in the S&amp;P 500 after the massive wave of demand that propelled the stock price ahead of inclusion subsided. In the last few weeks portfolio managers that aim to model the performance of the S&amp;P 500 had to buy Tesla, leading to a surge in volume.\n* Accenture (ACN) target raised by Barclays from $245 to $300 at OVERWWEIGHT. Stock currently around $266.\n* Darden Restaurants (DRI) with multiple target raises by notable analysts. Average price target $130 with OVERWEIGHT rating. Stock currently around $116.\n* General Motors (GM) target raised by Benchmark from $47 to $51 at BUY. Stock currently around $41.\n* Fate Therapeutics (FATE) target raised by Stifel Nicolaus from $79 to $118 at BUY. Stock currently around $93.\n* Global Payments (GPN) target raised by Barclays from $183 to $225 at OVERWEIGHT. Stock currently around $196.\n* Magnite (MGNI) target raised by Needham &amp; Co. from $18 to $30 at BUY. Stock currently around $23 after a few monster days in the market.\n* Plug Power (PLUG) target raised by Morgan Stanley (MS) from $14.50 to $38 at OVERWEIGHT. Stock currently around $31.\n* Virgin Galactic (SPCE) target raised by Cowen from $22 to $30 at OUTPERFORM. Stock currently around $23.\n* Square (SQ) target raised by Barclays from $220 to $260 at OVERWEIGHT. Stock currently around  $235.\n\n“No man steps in the same river twice, for it is not the same river and he;s not the same man.” - Heraclitus",
        "subreddit": "StockMarket",
        "title": "Daily Market Recap - Monday, December 21, 2020",
        "url": "https://www.reddit.com/r/StockMarket/comments/khqelr/daily_market_recap_monday_december_21_2020/",
        "created": 1608614080.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1607793164,
        "id": "kbspil",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "Good Saturday afternoon to all of you here on r/smallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning December 14th, 2020.\n\n# **Year-end Santa rally could depend on the big week ahead for markets  - [(Source)](https://www.cnbc.com/2020/12/11/congres-fe.html)**\n*****\n&gt; The week ahead is so jam-packed for markets that it could determine whether there will be a smooth glide path for a Santa rally into the end of the year.\n*****\n&gt; First, Congress looks set to fight down to the wire about a pandemic stimulus package, and chances are good it could again disappoint. The Fed also holds its final meeting of the year, and market pros are split on whether it will tweak its bond buying program when it issues its statement Wednesday. Since there’s a divided view, there’s room for market reaction either way.\n*****\n&gt; Then there is lots of really meaty data, including November retail sales Wednesday, the Markit Purchase Manager Indexes and regional Fed surveys.\n*****\n&gt; Finally, Tesla will be rolled into the S&amp;P 500 at Friday’s closing bell, and that could bring its own fireworks as big investors lighten up on the other index stocks to make room for entrance of the electric car maker in their portfolios. That also happens on a day that could have its own built-in volatility — the quarterly quadruple witching expiration of options and futures.\n*****\n&gt; “To me, the most market moving piece of information is, do we or don’t we get a stimulus package? The market has priced one in, so the biggest disappointment is if we don’t get one,” said Art Hogan, chief market strategist at National Securities. “The tug of war between the virus and vaccine had a tiebreaker in stimulus.”\n*****\n&gt; Hogan said a positive could be if the Food and Drug Administration on Thursday votes to approve the Moderna vaccine, a week after it considered Pfizer’s vaccine. But it is really Congress the market is looking to now, and if it acts, it will be a market positive.\n*****\n&gt; “I think that propels us into the year-end and higher levels. It only takes one of these things to pull over the apple cart, and the one that could matter is Congress not getting something out the door on stimulus. That would pull us back the hardest,” Hogan said.\n*****\n&gt; Peter Boockvar, chief investment officer at Bleakley Advisory Group, said the expiration of unemployment benefits for millions of Americans at the end of December could push Congress to act.\n*****\n&gt; “But you can’t ignore the strong stance the Republicans have taken on liability for business and the strong stance the Democrats have taken on state aid,” he said.\n*****\n&gt; Tom Block, Washington policy analyst at Fundstrat, said he sees a 50/50 chance for a deal by the end of the week. If there is no agreement, federal unemployment benefits for millions and an eviction moratorium would expire at the end of the month.\n*****\n&gt; Block said that even if Congress fails to immediately approve a bill to prevent a government shutdown, he expects lawmakers to reach an accord and keep the government running. But the stimulus is unclear, and much of it is a relief package.\n*****\n&gt; “There’s a solution staring them in the face, and the record food lines are in red states and blue states,” he said. “Both sides seem to be unwilling to come to a deal on what they commonly agree on.”\n*****\n&gt; # Tesla revving up the S&amp;P\n&gt; Tesla’s entry into the S&amp;P 500 is a much-anticipated event that traders expect to add some volatility to the market, as investors in the S&amp;P index shift holdings. Tesla joins the S&amp;P 500 on Dec. 21, at Friday’s closing price, and Friday has the potential to be a wild day .\n*****\n&gt; “I don’t know if it creates volatility. It’s going to create a significant amount of frenetic trading which may have the aspects of volatility,” said Matthew Bartolini, head of SPDR Americas Research at State Street Global Advisors. “Given we are interacting with a very high-volatility regime already, I think it wouldn’t take much to see the VIX spike.”\n*****\n&gt; Bartolini said there was already a lot of trading activity expected with the expiration of options and futures Friday. “It’s just going to create more noise,” he said.\n*****\n&gt; Tesla is the biggest company to join the S&amp;P 500, and the rebalance Friday will be the largest ever. Tesla will be the seventh-largest stock in the S&amp;P.\n*****\n&gt; Index fund managers will have to buy upwards of an estimated $70 billion of Tesla, and that means selling the other S&amp;P 500 stocks to make room. There will also be trading based on weighting adjustments in the index.\n*****\n&gt; “What you will likely have is people naturally are going to buy Tesla and sell other shares. It could create some upward momentum in Tesla and downward pressure on the shares that are going out,” Bartolini said.\n*****\n&gt; “It will be exciting. You’re going to see Tesla trade at significant volume.”\n*****\n&gt; # Fed ahead\n&gt; The Fed meeting will also be important, and it has been a hot topic of speculation, particularly in the bond market. Some market pros expect the Fed could make changes to its bond program. The Fed is currently buying at least $80 billion a month of Treasurys, and Fed officials have discussed what they could do to change that program at their last meeting.\n*****\n&gt; There is now speculation that the Fed will hold the purchases at $80 billion a month, but change the type of securities it is buying, with more focus on longer-dated notes and bonds. That would theoretically hold rates down at the long end, but only about half of market participants expect the Fed to take action at this meeting.\n*****\n&gt; The Fed also is buying at least $40 billion a month in mortgage-backed securities.\n*****\n&gt; “It means at least half the market is going to be disappointed with whatever the Fed does or doesn’t do,” said Patrick Leary, chief market strategist and senior trader at Incapital. “That has the potential to cause some volatility, especially in the rates market, and potentially in risk markets.”\n*****\n&gt; Stocks were choppy in the past week, with the S&amp;P 500 down just about 1% at 3,663. Treasury yields moved higher in the past week but retrenched Friday, when the 10-year sank below 0.9%.\n*****\n&gt; # Window on the economy\n&gt; There’s a busy economic calendar in the week ahead. Weekly claims Thursday are expected to be closely watched after a surprise jump in people seeking new benefits for the week ending Dec. 5.\n*****\n&gt; November Markit PMIs for the manufacturing and services sectors are released Wednesday, as is the November retail sales report.\n*****\n&gt; Boockvar said he is watching to see how much the services sector is being impacted by the spreading pandemic and related shutdowns.\n*****\n&gt; “I think the economic data is being overlooked for better or worse because it’s pre-vaccine,” he said.\n*****\n&gt; Economists expect the economy is slowing and the labor market has been weakening, particularly since the virus spread has continued to accelerate. Some expect the first quarter to be weaker than the fourth quarter, but activity should pick up in the second quarter as the vaccine is distributed.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.postimg.cc/2S0NcDWd/finvizmaps1.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.postimg.cc/x8vWKDYz/alphatrends1.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.postimg.cc/L6BpPf6b/finvizfuts.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/5Q2G6MV.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.postimg.cc/ZR3gStWM/marketdata1.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.postimg.cc/Vv8hsGML/spxsectors1.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.postimg.cc/jdjX6YsY/marketpullbacklevels1.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.postimg.cc/2jGGBSNx/marketrallylevels1.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.postimg.cc/CM3tmKQp/er1.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/eOWZhrG.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/LxpLHIm.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/643dART.png))**\n\n*****\n\n&gt; # Not All Bad for Small Business\n\n&gt; This morning the NFIB released their monthly reading on the small business sector. With case counts rising throughout November, small business optimism took a hit. Compared to September and October's identical readings of 104, November's reading fell to 101.4. Although that is lower, it remains above the levels seen from March through the summer. Additionally, there were several silver linings in this month's report.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/120820-NFIB-Headline.png))**\n\n&gt; Glancing across the various components and sub-indices of the report, breadth was pretty mixed. Of the ten components of the headline number, six fell and the remaining four were higher. Of the other indices that are not inputs to the headline number, half of the indices were higher while another two were unchanged, and the other two were lower.\n\n&gt; As for the most pressing problems reported by small businesses, there was little change overall. Quality of labor remains the most widely reported problem, stealing share from those reporting the cost of labor as the biggest issue. The second biggest issue and the only other one to see an uptick in November was taxes. Perhaps due to the results of the election and the prospects of higher taxes down the road, the percentage of respondents reporting taxes as the most pressing issue rose 3 percentage points to 20%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/120820-NFIB-Table.png))**\n\n&gt; Taking a deeper dive into the individual components of the report, the various indices concerning employment metrics were pretty strong in November. While the index for actual employment changes remains negative meaning more businesses reported declines in employment rather than increases, that is not to say businesses are not looking to gain employees.\n\n&gt; For starters, a higher number of responding firms (34% vs 33% in October) reported that they had at least one unfilled job opening in November. That is in the top decile of all historical readings. Breaking that number down further, the NFIB highlighted that 29% of those were for skilled workers and 13% were for unskilled workers. Additionally, businesses do plan to fill open positions in the near future. The index for plans to increase employment rose from 18 in October to 21 last month. Overall, more than half of firms said that they either hired or are trying to hire as 30% reported that either cost or quality of labor have been the biggest roadblocks to their business. Given these apparently tight labor conditions, the indices for compensation and plans to increase compensation were both higher.\n\n&gt; We would also note that the divergence between businesses wanting/trying to fill positions and declines in the actual number of employees reported is consistent with what we saw in last week's data from the ISM report.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/120820-NFIB-Empl.png))**\n\n&gt; Rising employment and compensation can be justified when looking at the indices concerning sales and earnings. While these broadly took turns lower this month, they remain at readings that are consistent with more companies than not seeing sales growth. The index for earnings changes turned a bit lower falling from -4 to -7. Despite that, it is still a level that is at the top of its historic range. Additionally, a net 5% of reporting firms saw higher sales over the past three months, down slightly from 6% last month.\n\n&gt; In turn, the net percentage of owners expecting sales to be higher also fell to a reading of 10% from 11% last month. Even though sales were a bit weaker, prices have continued to rise. The index for companies reporting higher prices rose from 15 to 18. That is the highest level of that index since a reading of 19 in May of 2018. NFIB highlighted further that the most common businesses to report higher prices were retail (28%) and wholesale (23%).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/120820-NFIB-Sale.png))**\n\n&gt; Although the decline in expected sales was modest and businesses plan to increase hiring, the index that took the biggest hit in November was the reading for expectations for the economy to improve. That index for the general outlook of business conditions fell 19 points month over month to a low reading of 8. That is the lowest level since March when the index was 3 points lower at 5. Additionally, the only time the index has declined by more in just one month was in November of 2012 when it fell from 0 to -38 in just one month. Other indices like those for expenditures and whether or not it is a good time to expand similarly remain weak, but did not see the same sort of dramatic declines.\n\n&gt; Looking at other indices though, this decline appears to have been relatively extreme. A net 5% of owners report inventory levels are too low which is tied with September for a record high. While a greater share of firms plan to increase rather than reduce inventories, that index did fall from a 48-year high of 12 last month down to 5 in November. Despite that historically large single month decline, this monthly reading is still at a strong level.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/120820-NFIB-Expan.png))**\n\n*****\n\n&gt; # Meet the Nasdaq 100's Post-Election Leaders\n\n&gt; The Nasdaq 100 finally made a new high on Tuesday before pulling back yesterday, but in the run-up to new highs in the post-election rally, it hasn't been the same old crew of stocks pushing the index higher. While the Nasdaq 100 is up about 12.5% since the election, thirteen stocks are up by more than twice the amount of the index itself. Leading the way higher, Moderna (MRNA) is up over 100% after positive news regarding its vaccine. After MRNA, shares of Pinduoduo (PDD), a Chinese e-commerce play, have rallied more the 50%, rising from $97.72 up to $154.00. Tesla (TSLA) rounds out the top three with a gain of 47% in just the last five weeks. The next two stocks on the list - Applied Materials (AMAT) and Micron (MU) - can hardly be considered emerging stocks. In addition to those two stocks from the semiconductor sector, three others from the sector made the cut (LRCX. MCHP, and QCOM) as chips have been red-hot.\n\n&gt; At the bottom of the table, we have also included the performance of the five mega-cap stocks of the Nasdaq 100. While all five stocks outperformed for much of 2020, not a single one of them is outperforming the Nasdaq 100 since Election Day, and only Apple (AAPL) is anywhere close to matching the performance of the index itself.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/121020-Nasdaq-100.png))**\n\n&gt; The chart below shows the performance of an equally-weighted basket of the five mega-cap stocks over the last year. From 9/2 to 9/23, this basket of stocks pulled back more than 16%, and while it has been steadily grinding higher in the eleven weeks since that low, up until this point, the prior highs from September haven't even come into play.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/1210-Mega.png))**\n\n*****\n\n&gt; # Sentiment Still Overwhelmingly Bullish\n\n&gt; For the third week in a row, just under half of the respondents to the weekly AAII sentiment survey reported as bullish. This week's bullish sentiment reading came in at 48.06%, which was down just slightly from 49.07% last week. While lower in the past week, bullish sentiment remains elevated in the top decile of readings over the past decade. Granted, it is also still below the high of 55.84% from November 12th. Similarly, the Investor Intelligence survey of equity newsletter writers also saw bullish sentiment drop slightly, falling from 64.7% to 64.4%. But again just like the AAII survey, that is a historically elevated level in the top 3% of all readings since 1963.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/121020-AAII-Bullish.png))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/121020-II-Bullish.png))**\n\n&gt; With bullish sentiment lower, a higher percentage of investors reported as bearish. Whereas last week saw bearish sentiment fall to 22.66%, the lowest level since the first week of 2020, this week bearish sentiment rose 4.2 percentage points to 26.86%. That is still below the reading of 27.47% from the last week of November and at the low end of the past few years' range. In terms of bearish sentiment, the Investors Intelligence survey is again echoing these results. This survey saw bearish sentiment rise 0.1 percentage points to 16.8%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/121020-AAII-Bearish.png))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/121020-II-Bearish.png))**\n\n&gt; Overall, sentiment remains heavily in favor of bulls. As shown below, for both the AAII and Investors Intelligence surveys, the bull-bear spreads are at historically high levels.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/121020-AAII-Bull-bear.png))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/121020-II-Spread.png))**\n\n*****\n\n&gt; # Rally To Resume Mid-Month - Typical December Seasonal Pattern\n\n&gt; For the most part, this December has unfolded in rather typical seasonal fashion. The market started the month off with solid gains and continued to rally through the fourth trading day before turning somewhat mixed. Russell 2000 and NASDAQ advanced an additional two trading days while DJIA, S&amp;P 500 and Russell 1000 see-sawed essentially sideways until yesterday, the seventh trading day of December.\n\n&gt; Currently the major indexes are navigating the often-dull period that has historically begun around the fourth trading day of the month through the eighth. Afterwards, later this week into early next week, another patch of weakness is possible. Then right around mid-month, the rally that began in at the beginning of November, is likely to resume. The resumption could be bumpy but once quarterly options expiration passes our Santa Claus Rally will begin on the open of trading on December 24. Since 1969, S&amp;P 500 has enjoyed an average gain of 1.3% during the Santa Claus Rally that spans the last five trading days of this year and the first two trading days of next year.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/35feeda338d979bfb6b6f25b3156fb4d/11fa20ff3c6ff3a3-4b/s500x750/454472c6c7d32c04ce9ec7e2e0ca7c045dab183d.jpg))**\n\n*****\n\n&gt; # Is Inflation Looming?\n\n&gt; The November reading for the Consumer Price Index (CPI), the most well-known measure of inflation, was released Thursday, December 10, and while both the headline and “core” readings (excluding food and energy) came in slightly higher than the Bloomberg-surveyed economists’ consensus, core inflation remains tame at 1.6% over the trailing year. Inflation is likely to pick up as the economy improves and may run a little hotter than we’ve seen in recent years in 2021, but we believe the risks of a substantial inflation surprise over the next year is limited.\n\n&gt; “Congress and the Fed provided massive stimulus this year and it seems like that should be inflationary,” said LPL Chief Market Strategist Ryan Detrick, “but it’s important to remember that the stimulus was there to fill a giant hole from lost wages and an economy running well below its potential.”\n\n&gt; As shown in today’s LPL Chart of the Day, core inflation on a trailing-year basis still has some catching up to do, although the one-month reading is now largely consistent with pre-Covid levels. inflation over the last decade has remained subdued and largely steady.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/12/12.11.20-Blog-Chart-1.png?ssl=1))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending December 11th, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=mOBjxtu9Ago))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 12.13.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=AKHqwuwWaaI))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$FDX** \n&gt; * **$HEXO** \n&gt; * **$RAD** \n&gt; * **$NKE** \n&gt; * **$BB** \n&gt; * **$CTK** \n&gt; * **$GIS** \n&gt; * **$ACN** \n&gt; * **$TTC** \n&gt; * **$LEN** \n&gt; * **$WGO** \n&gt; * **$JBL** \n&gt; * **$DRI** \n&gt; * **$UXIN** \n&gt; * **$CNTG** \n&gt; * **$SAFM** \n&gt; * **$MTSC** \n&gt; * **$ABM** \n&gt; * **$WOR** \n&gt; * **$AOUT** \n&gt; * **$NDSN** \n&gt; * **$APOG** \n&gt; * **$DL** \n&gt; * **$BLBD** \n&gt; * **$AIR** \n&gt; * **$ASPU** \n&gt; * **$APDN** \n&gt; * **$CAMP** \n&gt; * **$SCHL** \n&gt; * **$QTT** \n&gt; * **$SCSC** \n&gt; * **$VNCE** \n&gt; * **$RFIL** \n&gt; * **$CSBR** \n&gt; * **$NAV**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.postimg.cc/CM3tmKQp/er1.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.postimg.cc/Wb0yKPBF/ervol1.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 12.14.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n&gt; # ***Monday 12.14.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!]())\n(NONE.)\n\n*****\n\n&gt; # ***Tuesday  12.15.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n&gt; # ***Tuesday 12.15.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/oxA4VQw.png))\n\n*****\n\n&gt; # ***Wednesday 12.16.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/sO15Y4c.png))\n\n&gt; # ***Wednesday 12.16.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/jQE7QFL.png))\n\n*****\n\n&gt; # ***Thursday 12.17.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/8q2wpXy.png))\n\n&gt; # ***Thursday 12.17.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/f4M4FMw.png))\n\n*****\n\n&gt; # ***Friday 12.18.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/D6W4j8k.png))\n\n*****\n\n&gt; # ***Friday 12.18.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/dGlrSdg.png))\n\n*****\n\n&gt; # FedEx Corp. $289.47\n**FedEx Corp. (FDX)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, December 17, 2020. The consensus earnings estimate is $3.90 per share on revenue of $19.24 billion and the Earnings Whisper ® number is $4.74 per share. Investor sentiment going into the company's earnings release has 83% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 55.38% with revenue increasing by 11.06%. Short interest has decreased by 34.4% since the company's last earnings release while the stock has drifted higher by 14.4% from its open following the earnings release to be 55.0% above its 200 day moving average of $186.81. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, December 10, 2020 there was some notable buying of 10,300 contracts of the $115.00 call expiring on Friday, April 16, 2021. Option traders are pricing in a 8.4% move on earnings and the stock has averaged a 8.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FDX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # HEXO Corp. $1.00\n**HEXO Corp. (HEXO)** is confirmed to report earnings at approximately 7:20 AM ET on Monday, December 14, 2020. The consensus estimate is for a loss of $0.02 per share on revenue of $21.62 million and the Earnings Whisper ® number is ($0.01) per share. Investor sentiment going into the company's earnings release has 64% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 80.00% with revenue increasing by 97.39%. Short interest has decreased by 13.4% since the company's last earnings release while the stock has drifted higher by 69.5% from its open following the earnings release to be 23.7% above its 200 day moving average of $0.81. Overall earnings estimates have been revised lower since the company's last earnings release. The stock has averaged a 10.7% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HEXO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Rite Aid Corp. $18.46\n**Rite Aid Corp. (RAD)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, December 17, 2020. The consensus estimate is for a loss of $0.01 per share on revenue of $5.85 billion and the Earnings Whisper ® number is $0.06 per share. Investor sentiment going into the company's earnings release has 71% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 101.85% with revenue increasing by 7.10%. Short interest has increased by 13.0% since the company's last earnings release while the stock has drifted higher by 44.0% from its open following the earnings release to be 37.8% above its 200 day moving average of $13.40. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, December 9, 2020 there was some notable buying of 7,170 contracts of the $23.00 call expiring on Friday, January 15, 2021. Option traders are pricing in a 18.3% move on earnings and the stock has averaged a 21.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=RAD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Nike Inc $137.41\n**Nike Inc (NKE)** is confirmed to report earnings at approximately 4:15 PM ET on Friday, December 18, 2020. The consensus earnings estimate is $0.63 per share on revenue of $10.59 billion and the Earnings Whisper ® number is $0.72 per share. Investor sentiment going into the company's earnings release has 75% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 10.00% with revenue increasing by 2.56%. Short interest has increased by 34.3% since the company's last earnings release while the stock has drifted higher by 5.5% from its open following the earnings release to be 30.9% above its 200 day moving average of $104.97. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, December 2, 2020 there was some notable buying of 4,836 contracts of the $135.00 put and 4,558 contracts of the $135.00 call expiring on Friday, January 15, 2021. Option traders are pricing in a 5.8% move on earnings and the stock has averaged a 5.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NKE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # BlackBerry Limited $8.16\n**BlackBerry Limited (BB)** is confirmed to report earnings at approximately 5:00 PM ET on Thursday, December 17, 2020. The consensus estimate is for a loss of $0.01 per share and the Earnings Whisper ® number is $0.03 per share. Investor sentiment going into the company's earnings release has 78% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 120.00% with revenue increasing by 274.16%. Short interest has increased by 21.2% since the company's last earnings release while the stock has drifted higher by 57.8% from its open following the earnings release to be 67.2% above its 200 day moving average of $4.88. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, December 1, 2020 there was some notable buying of 34,988 contracts of the $10.00 call expiring on Friday, January 15, 2021. Option traders are pricing in a 13.0% move on earnings and the stock has averaged a 10.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BB&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # CooTek Inc. $4.93\n**CooTek Inc. (CTK)** is confirmed to report earnings before the market opens on Tuesday, December 15, 2020. The consensus estimate is for a loss of $0.27 per share on revenue of $112.20 million. Investor sentiment going into the company's earnings release has 47% expecting an earnings beat The company's guidance was for revenue of approximately $112.00 million. Consensus estimates are for earnings to decline year-over-year by 485.71% with revenue increasing by 258.81%. Short interest has decreased by 33.7% since the company's last earnings release while the stock has drifted lower by 32.3% from its open following the earnings release. Overall earnings estimates have been revised lower since the company's last earnings release.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CTK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # General Mills, Inc. $59.32\n**General Mills, Inc. (GIS)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, December 17, 2020. The consensus earnings estimate is $0.96 per share on revenue of $4.65 billion and the Earnings Whisper ® number is $1.02 per share. Investor sentiment going into the company's earnings release has 51% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 1.05% with revenue increasing by 5.18%. Short interest has increased by 28.8% since the company's last earnings release while the stock has drifted higher by 1.1% from its open following the earnings release to be 1.2% below its 200 day moving average of $60.04. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, December 2, 2020 there was some notable buying of 843 contracts of the $57.50 call expiring on Friday, January 21, 2022. Option traders are pricing in a 5.1% move on earnings and the stock has averaged a 2.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=GIS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Accenture Ltd. $245.83\n**Accenture Ltd. (ACN)** is confirmed to report earnings at approximately 6:45 AM ET on Thursday, December 17, 2020. The consensus earnings estimate is $2.04 per share on revenue of $11.38 billion and the Earnings Whisper ® number is $2.10 per share. Investor sentiment going into the company's earnings release has 47% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 2.39% with revenue increasing by 0.19%. Short interest has decreased by 2.1% since the company's last earnings release while the stock has drifted higher by 12.3% from its open following the earnings release to be 16.9% above its 200 day moving average of $210.33. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 5.1% move on earnings and the stock has averaged a 3.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ACN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Toro Company $91.52\n**Toro Company (TTC)** is confirmed to report earnings at approximately 8:30 AM ET on Wednesday, December 16, 2020. The consensus earnings estimate is $0.52 per share on revenue of $760.73 million and the Earnings Whisper ® number is $0.62 per share. Investor sentiment going into the company's earnings release has 52% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 8.33% with revenue increasing by 3.59%. Short interest has increased by 33.3% since the company's last earnings release while the stock has drifted higher by 16.8% from its open following the earnings release to be 49.7% below its 200 day moving average of $181.81. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 11.7% move on earnings and the stock has averaged a 3.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TTC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Lennar Corp. $72.76\n**Lennar Corp. (LEN)** is confirmed to report earnings at approximately 5:10 PM ET on Wednesday, December 16, 2020. The consensus earnings estimate is $2.38 per share on revenue of $6.53 billion and the Earnings Whisper ® number is $2.48 per share. Investor sentiment going into the company's earnings release has 72% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 11.74% with revenue decreasing by 6.33%. Short interest has decreased by 4.5% since the company's last earnings release while the stock has drifted lower by 3.7% from its open following the earnings release to be 12.7% above its 200 day moving average of $64.55. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, November 25, 2020 there was some notable buying of 4,725 contracts of the $76.50 call expiring on Thursday, December 24, 2020. Option traders are pricing in a 7.4% move on earnings and the stock has averaged a 2.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LEN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/smallstreetbets.",
        "subreddit": "smallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning December 14th, 2020",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/kbspil/wall_street_week_ahead_for_the_trading_week/",
        "created": 1607821964.0
    },
    {
        "author": "toomanyentitled",
        "created_utc": 1607970312,
        "id": "kd36sn",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Does anyone have any of these calls. I have had the apple 140 for like a month now, but am bleeding slowly. This stock just up and down all day everyday. Should I leave apple and go all in on Accenture? They seem stable over last year (price) and ripe for take off come earnings...a lot of business needed some realignment.",
        "subreddit": "wallstreetbets",
        "title": "Accenture Jan $250C Apple Feb $130C or Nike Jan $140C",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kd36sn/accenture_jan_250c_apple_feb_130c_or_nike_jan_140c/",
        "created": 1607999112.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1607792845,
        "id": "kbsm8f",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Good Saturday afternoon to all of you here on r/stocks. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning December 14th, 2020.\n\n# **Year-end Santa rally could depend on the big week ahead for markets  - [(Source)](https://www.cnbc.com/2020/12/11/congres-fe.html)**\n*****\n&gt; The week ahead is so jam-packed for markets that it could determine whether there will be a smooth glide path for a Santa rally into the end of the year.\n*****\n&gt; First, Congress looks set to fight down to the wire about a pandemic stimulus package, and chances are good it could again disappoint. The Fed also holds its final meeting of the year, and market pros are split on whether it will tweak its bond buying program when it issues its statement Wednesday. Since there’s a divided view, there’s room for market reaction either way.\n*****\n&gt; Then there is lots of really meaty data, including November retail sales Wednesday, the Markit Purchase Manager Indexes and regional Fed surveys.\n*****\n&gt; Finally, Tesla will be rolled into the S&amp;P 500 at Friday’s closing bell, and that could bring its own fireworks as big investors lighten up on the other index stocks to make room for entrance of the electric car maker in their portfolios. That also happens on a day that could have its own built-in volatility — the quarterly quadruple witching expiration of options and futures.\n*****\n&gt; “To me, the most market moving piece of information is, do we or don’t we get a stimulus package? The market has priced one in, so the biggest disappointment is if we don’t get one,” said Art Hogan, chief market strategist at National Securities. “The tug of war between the virus and vaccine had a tiebreaker in stimulus.”\n*****\n&gt; Hogan said a positive could be if the Food and Drug Administration on Thursday votes to approve the Moderna vaccine, a week after it considered Pfizer’s vaccine. But it is really Congress the market is looking to now, and if it acts, it will be a market positive.\n*****\n&gt; “I think that propels us into the year-end and higher levels. It only takes one of these things to pull over the apple cart, and the one that could matter is Congress not getting something out the door on stimulus. That would pull us back the hardest,” Hogan said.\n*****\n&gt; Peter Boockvar, chief investment officer at Bleakley Advisory Group, said the expiration of unemployment benefits for millions of Americans at the end of December could push Congress to act.\n*****\n&gt; “But you can’t ignore the strong stance the Republicans have taken on liability for business and the strong stance the Democrats have taken on state aid,” he said.\n*****\n&gt; Tom Block, Washington policy analyst at Fundstrat, said he sees a 50/50 chance for a deal by the end of the week. If there is no agreement, federal unemployment benefits for millions and an eviction moratorium would expire at the end of the month.\n*****\n&gt; Block said that even if Congress fails to immediately approve a bill to prevent a government shutdown, he expects lawmakers to reach an accord and keep the government running. But the stimulus is unclear, and much of it is a relief package.\n*****\n&gt; “There’s a solution staring them in the face, and the record food lines are in red states and blue states,” he said. “Both sides seem to be unwilling to come to a deal on what they commonly agree on.”\n*****\n&gt; # Tesla revving up the S&amp;P\n&gt; Tesla’s entry into the S&amp;P 500 is a much-anticipated event that traders expect to add some volatility to the market, as investors in the S&amp;P index shift holdings. Tesla joins the S&amp;P 500 on Dec. 21, at Friday’s closing price, and Friday has the potential to be a wild day .\n*****\n&gt; “I don’t know if it creates volatility. It’s going to create a significant amount of frenetic trading which may have the aspects of volatility,” said Matthew Bartolini, head of SPDR Americas Research at State Street Global Advisors. “Given we are interacting with a very high-volatility regime already, I think it wouldn’t take much to see the VIX spike.”\n*****\n&gt; Bartolini said there was already a lot of trading activity expected with the expiration of options and futures Friday. “It’s just going to create more noise,” he said.\n*****\n&gt; Tesla is the biggest company to join the S&amp;P 500, and the rebalance Friday will be the largest ever. Tesla will be the seventh-largest stock in the S&amp;P.\n*****\n&gt; Index fund managers will have to buy upwards of an estimated $70 billion of Tesla, and that means selling the other S&amp;P 500 stocks to make room. There will also be trading based on weighting adjustments in the index.\n*****\n&gt; “What you will likely have is people naturally are going to buy Tesla and sell other shares. It could create some upward momentum in Tesla and downward pressure on the shares that are going out,” Bartolini said.\n*****\n&gt; “It will be exciting. You’re going to see Tesla trade at significant volume.”\n*****\n&gt; # Fed ahead\n&gt; The Fed meeting will also be important, and it has been a hot topic of speculation, particularly in the bond market. Some market pros expect the Fed could make changes to its bond program. The Fed is currently buying at least $80 billion a month of Treasurys, and Fed officials have discussed what they could do to change that program at their last meeting.\n*****\n&gt; There is now speculation that the Fed will hold the purchases at $80 billion a month, but change the type of securities it is buying, with more focus on longer-dated notes and bonds. That would theoretically hold rates down at the long end, but only about half of market participants expect the Fed to take action at this meeting.\n*****\n&gt; The Fed also is buying at least $40 billion a month in mortgage-backed securities.\n*****\n&gt; “It means at least half the market is going to be disappointed with whatever the Fed does or doesn’t do,” said Patrick Leary, chief market strategist and senior trader at Incapital. “That has the potential to cause some volatility, especially in the rates market, and potentially in risk markets.”\n*****\n&gt; Stocks were choppy in the past week, with the S&amp;P 500 down just about 1% at 3,663. Treasury yields moved higher in the past week but retrenched Friday, when the 10-year sank below 0.9%.\n*****\n&gt; # Window on the economy\n&gt; There’s a busy economic calendar in the week ahead. Weekly claims Thursday are expected to be closely watched after a surprise jump in people seeking new benefits for the week ending Dec. 5.\n*****\n&gt; November Markit PMIs for the manufacturing and services sectors are released Wednesday, as is the November retail sales report.\n*****\n&gt; Boockvar said he is watching to see how much the services sector is being impacted by the spreading pandemic and related shutdowns.\n*****\n&gt; “I think the economic data is being overlooked for better or worse because it’s pre-vaccine,” he said.\n*****\n&gt; Economists expect the economy is slowing and the labor market has been weakening, particularly since the virus spread has continued to accelerate. Some expect the first quarter to be weaker than the fourth quarter, but activity should pick up in the second quarter as the vaccine is distributed.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.postimg.cc/2S0NcDWd/finvizmaps1.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.postimg.cc/x8vWKDYz/alphatrends1.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.postimg.cc/L6BpPf6b/finvizfuts.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/5Q2G6MV.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.postimg.cc/ZR3gStWM/marketdata1.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.postimg.cc/Vv8hsGML/spxsectors1.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.postimg.cc/jdjX6YsY/marketpullbacklevels1.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.postimg.cc/2jGGBSNx/marketrallylevels1.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.postimg.cc/CM3tmKQp/er1.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/eOWZhrG.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/LxpLHIm.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/643dART.png))**\n\n*****\n\n&gt; # Not All Bad for Small Business\n\n&gt; This morning the NFIB released their monthly reading on the small business sector. With case counts rising throughout November, small business optimism took a hit. Compared to September and October's identical readings of 104, November's reading fell to 101.4. Although that is lower, it remains above the levels seen from March through the summer. Additionally, there were several silver linings in this month's report.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/120820-NFIB-Headline.png))**\n\n&gt; Glancing across the various components and sub-indices of the report, breadth was pretty mixed. Of the ten components of the headline number, six fell and the remaining four were higher. Of the other indices that are not inputs to the headline number, half of the indices were higher while another two were unchanged, and the other two were lower.\n\n&gt; As for the most pressing problems reported by small businesses, there was little change overall. Quality of labor remains the most widely reported problem, stealing share from those reporting the cost of labor as the biggest issue. The second biggest issue and the only other one to see an uptick in November was taxes. Perhaps due to the results of the election and the prospects of higher taxes down the road, the percentage of respondents reporting taxes as the most pressing issue rose 3 percentage points to 20%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/120820-NFIB-Table.png))**\n\n&gt; Taking a deeper dive into the individual components of the report, the various indices concerning employment metrics were pretty strong in November. While the index for actual employment changes remains negative meaning more businesses reported declines in employment rather than increases, that is not to say businesses are not looking to gain employees.\n\n&gt; For starters, a higher number of responding firms (34% vs 33% in October) reported that they had at least one unfilled job opening in November. That is in the top decile of all historical readings. Breaking that number down further, the NFIB highlighted that 29% of those were for skilled workers and 13% were for unskilled workers. Additionally, businesses do plan to fill open positions in the near future. The index for plans to increase employment rose from 18 in October to 21 last month. Overall, more than half of firms said that they either hired or are trying to hire as 30% reported that either cost or quality of labor have been the biggest roadblocks to their business. Given these apparently tight labor conditions, the indices for compensation and plans to increase compensation were both higher.\n\n&gt; We would also note that the divergence between businesses wanting/trying to fill positions and declines in the actual number of employees reported is consistent with what we saw in last week's data from the ISM report.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/120820-NFIB-Empl.png))**\n\n&gt; Rising employment and compensation can be justified when looking at the indices concerning sales and earnings. While these broadly took turns lower this month, they remain at readings that are consistent with more companies than not seeing sales growth. The index for earnings changes turned a bit lower falling from -4 to -7. Despite that, it is still a level that is at the top of its historic range. Additionally, a net 5% of reporting firms saw higher sales over the past three months, down slightly from 6% last month.\n\n&gt; In turn, the net percentage of owners expecting sales to be higher also fell to a reading of 10% from 11% last month. Even though sales were a bit weaker, prices have continued to rise. The index for companies reporting higher prices rose from 15 to 18. That is the highest level of that index since a reading of 19 in May of 2018. NFIB highlighted further that the most common businesses to report higher prices were retail (28%) and wholesale (23%).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/120820-NFIB-Sale.png))**\n\n&gt; Although the decline in expected sales was modest and businesses plan to increase hiring, the index that took the biggest hit in November was the reading for expectations for the economy to improve. That index for the general outlook of business conditions fell 19 points month over month to a low reading of 8. That is the lowest level since March when the index was 3 points lower at 5. Additionally, the only time the index has declined by more in just one month was in November of 2012 when it fell from 0 to -38 in just one month. Other indices like those for expenditures and whether or not it is a good time to expand similarly remain weak, but did not see the same sort of dramatic declines.\n\n&gt; Looking at other indices though, this decline appears to have been relatively extreme. A net 5% of owners report inventory levels are too low which is tied with September for a record high. While a greater share of firms plan to increase rather than reduce inventories, that index did fall from a 48-year high of 12 last month down to 5 in November. Despite that historically large single month decline, this monthly reading is still at a strong level.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/120820-NFIB-Expan.png))**\n\n*****\n\n&gt; # Meet the Nasdaq 100's Post-Election Leaders\n\n&gt; The Nasdaq 100 finally made a new high on Tuesday before pulling back yesterday, but in the run-up to new highs in the post-election rally, it hasn't been the same old crew of stocks pushing the index higher. While the Nasdaq 100 is up about 12.5% since the election, thirteen stocks are up by more than twice the amount of the index itself. Leading the way higher, Moderna (MRNA) is up over 100% after positive news regarding its vaccine. After MRNA, shares of Pinduoduo (PDD), a Chinese e-commerce play, have rallied more the 50%, rising from $97.72 up to $154.00. Tesla (TSLA) rounds out the top three with a gain of 47% in just the last five weeks. The next two stocks on the list - Applied Materials (AMAT) and Micron (MU) - can hardly be considered emerging stocks. In addition to those two stocks from the semiconductor sector, three others from the sector made the cut (LRCX. MCHP, and QCOM) as chips have been red-hot.\n\n&gt; At the bottom of the table, we have also included the performance of the five mega-cap stocks of the Nasdaq 100. While all five stocks outperformed for much of 2020, not a single one of them is outperforming the Nasdaq 100 since Election Day, and only Apple (AAPL) is anywhere close to matching the performance of the index itself.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/121020-Nasdaq-100.png))**\n\n&gt; The chart below shows the performance of an equally-weighted basket of the five mega-cap stocks over the last year. From 9/2 to 9/23, this basket of stocks pulled back more than 16%, and while it has been steadily grinding higher in the eleven weeks since that low, up until this point, the prior highs from September haven't even come into play.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/1210-Mega.png))**\n\n*****\n\n&gt; # Sentiment Still Overwhelmingly Bullish\n\n&gt; For the third week in a row, just under half of the respondents to the weekly AAII sentiment survey reported as bullish. This week's bullish sentiment reading came in at 48.06%, which was down just slightly from 49.07% last week. While lower in the past week, bullish sentiment remains elevated in the top decile of readings over the past decade. Granted, it is also still below the high of 55.84% from November 12th. Similarly, the Investor Intelligence survey of equity newsletter writers also saw bullish sentiment drop slightly, falling from 64.7% to 64.4%. But again just like the AAII survey, that is a historically elevated level in the top 3% of all readings since 1963.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/121020-AAII-Bullish.png))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/121020-II-Bullish.png))**\n\n&gt; With bullish sentiment lower, a higher percentage of investors reported as bearish. Whereas last week saw bearish sentiment fall to 22.66%, the lowest level since the first week of 2020, this week bearish sentiment rose 4.2 percentage points to 26.86%. That is still below the reading of 27.47% from the last week of November and at the low end of the past few years' range. In terms of bearish sentiment, the Investors Intelligence survey is again echoing these results. This survey saw bearish sentiment rise 0.1 percentage points to 16.8%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/121020-AAII-Bearish.png))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/121020-II-Bearish.png))**\n\n&gt; Overall, sentiment remains heavily in favor of bulls. As shown below, for both the AAII and Investors Intelligence surveys, the bull-bear spreads are at historically high levels.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/121020-AAII-Bull-bear.png))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/121020-II-Spread.png))**\n\n*****\n\n&gt; # Rally To Resume Mid-Month - Typical December Seasonal Pattern\n\n&gt; For the most part, this December has unfolded in rather typical seasonal fashion. The market started the month off with solid gains and continued to rally through the fourth trading day before turning somewhat mixed. Russell 2000 and NASDAQ advanced an additional two trading days while DJIA, S&amp;P 500 and Russell 1000 see-sawed essentially sideways until yesterday, the seventh trading day of December.\n\n&gt; Currently the major indexes are navigating the often-dull period that has historically begun around the fourth trading day of the month through the eighth. Afterwards, later this week into early next week, another patch of weakness is possible. Then right around mid-month, the rally that began in at the beginning of November, is likely to resume. The resumption could be bumpy but once quarterly options expiration passes our Santa Claus Rally will begin on the open of trading on December 24. Since 1969, S&amp;P 500 has enjoyed an average gain of 1.3% during the Santa Claus Rally that spans the last five trading days of this year and the first two trading days of next year.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/35feeda338d979bfb6b6f25b3156fb4d/11fa20ff3c6ff3a3-4b/s500x750/454472c6c7d32c04ce9ec7e2e0ca7c045dab183d.jpg))**\n\n*****\n\n&gt; # Is Inflation Looming?\n\n&gt; The November reading for the Consumer Price Index (CPI), the most well-known measure of inflation, was released Thursday, December 10, and while both the headline and “core” readings (excluding food and energy) came in slightly higher than the Bloomberg-surveyed economists’ consensus, core inflation remains tame at 1.6% over the trailing year. Inflation is likely to pick up as the economy improves and may run a little hotter than we’ve seen in recent years in 2021, but we believe the risks of a substantial inflation surprise over the next year is limited.\n\n&gt; “Congress and the Fed provided massive stimulus this year and it seems like that should be inflationary,” said LPL Chief Market Strategist Ryan Detrick, “but it’s important to remember that the stimulus was there to fill a giant hole from lost wages and an economy running well below its potential.”\n\n&gt; As shown in today’s LPL Chart of the Day, core inflation on a trailing-year basis still has some catching up to do, although the one-month reading is now largely consistent with pre-Covid levels. inflation over the last decade has remained subdued and largely steady.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/12/12.11.20-Blog-Chart-1.png?ssl=1))**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.postimg.cc/CM3tmKQp/er1.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.postimg.cc/Wb0yKPBF/ervol1.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 12.14.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n&gt; # ***Monday 12.14.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!]())\n(NONE.)\n\n*****\n\n&gt; # ***Tuesday  12.15.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n&gt; # ***Tuesday 12.15.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/oxA4VQw.png))\n\n*****\n\n&gt; # ***Wednesday 12.16.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/sO15Y4c.png))\n\n&gt; # ***Wednesday 12.16.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/jQE7QFL.png))\n\n*****\n\n&gt; # ***Thursday 12.17.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/8q2wpXy.png))\n\n&gt; # ***Thursday 12.17.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/f4M4FMw.png))\n\n*****\n\n&gt; # ***Friday 12.18.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/D6W4j8k.png))\n\n*****\n\n&gt; # ***Friday 12.18.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/dGlrSdg.png))\n\n*****\n\n&gt; # FedEx Corp. $289.47\n**FedEx Corp. (FDX)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, December 17, 2020. The consensus earnings estimate is $3.90 per share on revenue of $19.24 billion and the Earnings Whisper ® number is $4.74 per share. Investor sentiment going into the company's earnings release has 83% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 55.38% with revenue increasing by 11.06%. Short interest has decreased by 34.4% since the company's last earnings release while the stock has drifted higher by 14.4% from its open following the earnings release to be 55.0% above its 200 day moving average of $186.81. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, December 10, 2020 there was some notable buying of 10,300 contracts of the $115.00 call expiring on Friday, April 16, 2021. Option traders are pricing in a 8.4% move on earnings and the stock has averaged a 8.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FDX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # HEXO Corp. $1.00\n**HEXO Corp. (HEXO)** is confirmed to report earnings at approximately 7:20 AM ET on Monday, December 14, 2020. The consensus estimate is for a loss of $0.02 per share on revenue of $21.62 million and the Earnings Whisper ® number is ($0.01) per share. Investor sentiment going into the company's earnings release has 64% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 80.00% with revenue increasing by 97.39%. Short interest has decreased by 13.4% since the company's last earnings release while the stock has drifted higher by 69.5% from its open following the earnings release to be 23.7% above its 200 day moving average of $0.81. Overall earnings estimates have been revised lower since the company's last earnings release. The stock has averaged a 10.7% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HEXO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Rite Aid Corp. $18.46\n**Rite Aid Corp. (RAD)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, December 17, 2020. The consensus estimate is for a loss of $0.01 per share on revenue of $5.85 billion and the Earnings Whisper ® number is $0.06 per share. Investor sentiment going into the company's earnings release has 71% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 101.85% with revenue increasing by 7.10%. Short interest has increased by 13.0% since the company's last earnings release while the stock has drifted higher by 44.0% from its open following the earnings release to be 37.8% above its 200 day moving average of $13.40. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, December 9, 2020 there was some notable buying of 7,170 contracts of the $23.00 call expiring on Friday, January 15, 2021. Option traders are pricing in a 18.3% move on earnings and the stock has averaged a 21.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=RAD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Nike Inc $137.41\n**Nike Inc (NKE)** is confirmed to report earnings at approximately 4:15 PM ET on Friday, December 18, 2020. The consensus earnings estimate is $0.63 per share on revenue of $10.59 billion and the Earnings Whisper ® number is $0.72 per share. Investor sentiment going into the company's earnings release has 75% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 10.00% with revenue increasing by 2.56%. Short interest has increased by 34.3% since the company's last earnings release while the stock has drifted higher by 5.5% from its open following the earnings release to be 30.9% above its 200 day moving average of $104.97. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, December 2, 2020 there was some notable buying of 4,836 contracts of the $135.00 put and 4,558 contracts of the $135.00 call expiring on Friday, January 15, 2021. Option traders are pricing in a 5.8% move on earnings and the stock has averaged a 5.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NKE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # BlackBerry Limited $8.16\n**BlackBerry Limited (BB)** is confirmed to report earnings at approximately 5:00 PM ET on Thursday, December 17, 2020. The consensus estimate is for a loss of $0.01 per share and the Earnings Whisper ® number is $0.03 per share. Investor sentiment going into the company's earnings release has 78% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 120.00% with revenue increasing by 274.16%. Short interest has increased by 21.2% since the company's last earnings release while the stock has drifted higher by 57.8% from its open following the earnings release to be 67.2% above its 200 day moving average of $4.88. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, December 1, 2020 there was some notable buying of 34,988 contracts of the $10.00 call expiring on Friday, January 15, 2021. Option traders are pricing in a 13.0% move on earnings and the stock has averaged a 10.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BB&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # CooTek Inc. $4.93\n**CooTek Inc. (CTK)** is confirmed to report earnings before the market opens on Tuesday, December 15, 2020. The consensus estimate is for a loss of $0.27 per share on revenue of $112.20 million. Investor sentiment going into the company's earnings release has 47% expecting an earnings beat The company's guidance was for revenue of approximately $112.00 million. Consensus estimates are for earnings to decline year-over-year by 485.71% with revenue increasing by 258.81%. Short interest has decreased by 33.7% since the company's last earnings release while the stock has drifted lower by 32.3% from its open following the earnings release. Overall earnings estimates have been revised lower since the company's last earnings release.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CTK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # General Mills, Inc. $59.32\n**General Mills, Inc. (GIS)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, December 17, 2020. The consensus earnings estimate is $0.96 per share on revenue of $4.65 billion and the Earnings Whisper ® number is $1.02 per share. Investor sentiment going into the company's earnings release has 51% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 1.05% with revenue increasing by 5.18%. Short interest has increased by 28.8% since the company's last earnings release while the stock has drifted higher by 1.1% from its open following the earnings release to be 1.2% below its 200 day moving average of $60.04. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, December 2, 2020 there was some notable buying of 843 contracts of the $57.50 call expiring on Friday, January 21, 2022. Option traders are pricing in a 5.1% move on earnings and the stock has averaged a 2.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=GIS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Accenture Ltd. $245.83\n**Accenture Ltd. (ACN)** is confirmed to report earnings at approximately 6:45 AM ET on Thursday, December 17, 2020. The consensus earnings estimate is $2.04 per share on revenue of $11.38 billion and the Earnings Whisper ® number is $2.10 per share. Investor sentiment going into the company's earnings release has 47% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 2.39% with revenue increasing by 0.19%. Short interest has decreased by 2.1% since the company's last earnings release while the stock has drifted higher by 12.3% from its open following the earnings release to be 16.9% above its 200 day moving average of $210.33. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 5.1% move on earnings and the stock has averaged a 3.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ACN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Toro Company $91.52\n**Toro Company (TTC)** is confirmed to report earnings at approximately 8:30 AM ET on Wednesday, December 16, 2020. The consensus earnings estimate is $0.52 per share on revenue of $760.73 million and the Earnings Whisper ® number is $0.62 per share. Investor sentiment going into the company's earnings release has 52% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 8.33% with revenue increasing by 3.59%. Short interest has increased by 33.3% since the company's last earnings release while the stock has drifted higher by 16.8% from its open following the earnings release to be 49.7% below its 200 day moving average of $181.81. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 11.7% move on earnings and the stock has averaged a 3.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TTC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Lennar Corp. $72.76\n**Lennar Corp. (LEN)** is confirmed to report earnings at approximately 5:10 PM ET on Wednesday, December 16, 2020. The consensus earnings estimate is $2.38 per share on revenue of $6.53 billion and the Earnings Whisper ® number is $2.48 per share. Investor sentiment going into the company's earnings release has 72% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 11.74% with revenue decreasing by 6.33%. Short interest has decreased by 4.5% since the company's last earnings release while the stock has drifted lower by 3.7% from its open following the earnings release to be 12.7% above its 200 day moving average of $64.55. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, November 25, 2020 there was some notable buying of 4,725 contracts of the $76.50 call expiring on Thursday, December 24, 2020. Option traders are pricing in a 7.4% move on earnings and the stock has averaged a 2.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LEN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/stocks.",
        "subreddit": "stocks",
        "title": "Wall Street Week Ahead for the trading week beginning December 14th, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/kbsm8f/wall_street_week_ahead_for_the_trading_week/",
        "created": 1607821645.0
    },
    {
        "author": "beepboopthrowaway699",
        "created_utc": 1606867299,
        "id": "k4xjj8",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "1: undervalued compared to the entirety of tech sector\n\n2: good customers\n\n3: earnings call dec 3\n\n4: too fucking lazy to do more but here is a post in german\n\n[https://www.reddit.com/r/mauerstrassenwetten/comments/k0du7z/zuora\\_subscription\\_economy\\_zuoa2jhjj/](https://www.reddit.com/r/mauerstrassenwetten/comments/k0du7z/zuora_subscription_economy_zuoa2jhjj/)\n\n  \n\"Many use Netflix, Spotify, Amazon Prime or Microsoft Office. The subscription model continues to expand, as the company's sales and margins increase significantly and are more predictable than with one-off payments. The business models of many companies will have to adapt, especially due to the corona crisis. The subscription model will therefore continue to spread beyond the tech companies.  This is exactly where Zuora comes in, a SaaS platform to maintain and manage subscription services. \n\nIn my opinion, such a tool is particularly helpful for small and medium-sized companies in order to manage invoices, check payments and analyze sales. And by specializing in the subscription model, you can set yourself apart from the well-known ones like SAP and Salesforce. The founder and CEO of Zuora was previously Chief Strategy Officer at Salesforce, so he definitely knows his stuff. You also have well-known customers (e.g. Zoom, Dazn, Daimler, Siemens, Microsoft, Nvidia, GoPro etc.), in whose success you also participate, and you also work with consulting firms such as Accenture, Deloitte and PwC.  \n\nThe growth was a bit disappointing lately, so the price crashed a bit, but recently it has recovered somewhat and is in a clear uptrend. The price (currently $ 11.70) is still far from the all-time high of $ 37.80 shortly after the IPO 2018 and the KUV is 5 compared to other SaaS companies such as B. ServiceNow or Zendesk cheap, so I see upside potential. In September they shot up to $ 17.80 within days of the numbers, which should be the target again in the medium term. With the hype that such disruptive companies are experiencing this year, at least I wouldn't be surprised. What do you all mean?\"\n\npositions: 10,000 shares, thinking about some short term calls \n\n&amp;#x200B;\n\nhttps://preview.redd.it/80of46hfyn261.png?width=1876&amp;format=png&amp;auto=webp&amp;s=47c8d1278bf0dde08c539c0a5924e606edd75db2",
        "subreddit": "wallstreetbets",
        "title": "ZUO yolo",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k4xjj8/zuo_yolo/",
        "created": 1606896099.0
    },
    {
        "author": "628rand",
        "created_utc": 1607540658,
        "id": "k9y74p",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "How many open interest calls were added in the last 24 hours:\n\n1. $SPY: 271,113\n2. $PG: 220,688\n3. $PFE: 187,605\n4. $TSLA: 131,388\n5. $IWM: 122,719\n6. $SPX: 122,667\n7. $F: 119,024\n8. $TJX: 95,294\n9. $MS: 94,904\n10. $AAPL: 89,677\n\nHow many open interest puts were added in the last 24 hours:\n\n1. $SPY: 459,402\n2. $SPX: 228,412\n3. $TSLA: 102,684\n4. $IWM: 97,299\n5. $QQQ: 82,142\n6. $PLTR: 54,506\n7. $ACN: 37,966\n8. $GME: 36,709\n9. $EEM: 35,867\n10. $LMND: 34,625\n\n(Data from [https://www.stonks.fyi](https://www.stonks.fyi/))",
        "subreddit": "options",
        "title": "Changes to Calls/Puts Open Interest Holdings Tuesday, Dec. 8 End of Day",
        "url": "https://www.reddit.com/r/options/comments/k9y74p/changes_to_callsputs_open_interest_holdings/",
        "created": 1607569458.0
    },
    {
        "author": "kzalifasraf",
        "created_utc": 1608428299,
        "id": "kgkxpn",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Rakuten Mobile in Japan recent years been declining from their competitors and now Miki have another plan to gain telco market share in japan where dominated by the big three telco. (I.e NTT Docomo) which is invested in AST &amp; Science and go public with $NPA via spac. Now partner up with Accenture as mention in the title above. This week is been a near completed strategies of Miki to make a comeback in Telco japan space. The next step is to get approval from Japan Government to implement it at the natural disaster area (I.e Traditional Telco Tower breakdown due to heavy earthquake) where I can assume Fukushima or Kumamoto. If this get a green light, this will be massive news. \n\nDon’t forget about Vodafone plan to kick off this project in Africa. Hope this tech can does bring more people to connectivity of internet.\n\nInteresting company.",
        "subreddit": "StockMarket",
        "title": "$NPA, Accenture power Rakuten Mobile’s virtualized cloud mobile network launch in Japan",
        "url": "https://www.reddit.com/r/StockMarket/comments/kgkxpn/npa_accenture_power_rakuten_mobiles_virtualized/",
        "created": 1608457099.0
    },
    {
        "author": "628rand",
        "created_utc": 1607540702,
        "id": "k9y7o9",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "How many open interest calls were added in the last 24 hours:\n\n1. $SPY: 271,113\n2. $PG: 220,688\n3. $PFE: 187,605\n4. $TSLA: 131,388\n5. $IWM: 122,719\n6. $SPX: 122,667\n7. $F: 119,024\n8. $TJX: 95,294\n9. $MS: 94,904\n10. $AAPL: 89,677\n\nHow many open interest puts were added in the last 24 hours:\n\n1. $SPY: 459,402\n2. $SPX: 228,412\n3. $TSLA: 102,684\n4. $IWM: 97,299\n5. $QQQ: 82,142\n6. $PLTR: 54,506\n7. $ACN: 37,966\n8. $GME: 36,709\n9. $EEM: 35,867\n10. $LMND: 34,625\n\n(Data from [https://www.stonks.fyi](https://www.stonks.fyi/))",
        "subreddit": "stocks",
        "title": "Changes to Calls/Puts Open Interest Holdings Tuesday, Dec. 8 End of Day",
        "url": "https://www.reddit.com/r/stocks/comments/k9y7o9/changes_to_callsputs_open_interest_holdings/",
        "created": 1607569502.0
    }
]