[
    {
        "author": "ahriman1911",
        "created_utc": 1593123490,
        "id": "hfvggd",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "Hello everybody. I saw lots of people talking about **The Wheel Strategy** lately and I'd like to share a small modification I use. I modify The Wheel by using the proceeds to buy the stocks for the long-term in a buy and hold portfolio when my puts are not assigned. \n\nAlso, instead of using cash secured puts, I use naked puts for 3X the cash I'm allocating to the strategy, but always on 3 different stocks that are uncorrelated. *This is the key to making it work.*\n\n#Example\nI'll could sell ~50 day August puts on:\n* Philip Morris (PM)\n* Pampa Energia (PAM)\n* Western Digital (WDC). \nThese are 3 stocks that are almost completely uncorrelated. We're talking tobacco outside the United States, electric generation in Argentina, and computer storage devices. I usually use PortfolioVisualizer to confirm the low level of correlation on any group of 3 stocks I'm going to use.\n\nLet's say my chosen position size is $6000. The absolute most aggressive I could be would be the following: (as of 25/Jun):\n* 1 x $60 PM PUT (stock is trading at $70) @ $1.05 per contract\n* 6 x $10 PAM PUT (stock is trading at $10) @ $0.55 per contract\n* 2 x $30 WDC PUT (stock is trading at $42) @ $0.60 per contract\nI'd get paid a total of *$555 in option premium* for these puts. Again, I don't need to be this aggressive. I could sell puts that are further out of the money. But I wouldn't be more aggressive than this. So the total cash I need to come up with for this trade if it goes south would be $18,000.\n\nWhen August is coming to a close, I'll start to buy back these puts (hopefully for pennies) or else just let them expire worthless. If one (or more) of the puts is in the money, I roll out and down as long as I can do so for a credit, same as the wheel. If there is no way to do it for a credit, I take assignment.\n\n* When all 3 options expire worthless or are bought back, I book the profits and use it to build a position in one or all of the stocks (my choice depending on the prices in August).\n* If I have to roll for a credit or I get assigned in one or more of the puts I hold on to the funds, not spending the cash yet. The goal is to get out of the position by rolling out the puts.\n* If I get assigned in one or more stocks, I sell calls until I get out of the position. I usually try to sell at the same strike price as I was assigned in the first place since I want to keep the profits to eventually buy a position in these stocks. But in our hypothetical example, if I got assigned on just 1 of the positions and booked the profit on the other two, I could drop down as much as $5.55 per share on my call strike price to get myself out of the position as quick as possible and break even. If I was assigned two positions I could drop my call strike price by $2.77 on each position if needed. Again, I don't usually do this, but I will do so if my vision on the stock has changed and I don't want to be a long-term owner under any circumstance (i.e. anything travel related today). That's when you go with plan B and give back the option profits by selling calls ever cheaper until you're out of the position and have your capital back.\n\n#Goal\nThe goal is to end up with no stocks, just profit from the options trades. If I sell my calls for the same strike price as my assignment and just wait for the stock to go up, after assignment I get to keep as a profit all the cash from the puts, all the dividends while I was assigned, and all the premium on the calls. And then I use all those funds to buy long-term positions of the stocks for \"free\", based on the profits earned from the option premium.\n\n#Risks\nGetting assigned one position is no big deal, we have the cash to cover it. Getting assigned two positions can usually be handled with margin and means we have to start spending a bit of interest (which will be offset by the calls). Getting assigned 3 positions might be difficult and is the downside of this strategy. This happened to me during the Coronavirus crash. I was assigned all my positions. However, the V-style recovery has already made my calls get me out of most of the positions.\n\nUnless there is a huge coronavirus-style event, the 3 positions shouldn't get assigned all at once since they are not correlated. But if it does happen, you should have a backup plan (like a home equity line you can tap) or some way to meet a margin call to avoid losses. Never buy back the options for a loss.\n\n#Key Points\nSince this is the wheel, they key is the stock selection and picking stocks we won't mind owning for many years. This is even more important in this modified strategy since we're using the profits to buy shares in these companies and hopefully never having to sell them. When I'm ready to start a new cycle, I don't just pick 3 companies at random. I pick 3 companies that I'd like to own for a very long time and that I think are at a good price point right now.\n\n#Why I Call It *The Snowball*?\nBecause while the strategy is working your portfolio should snowball ever larger with more stocks. You use the same cash pile to generate more stocks month after month and add them to a permanent portfolio of great companies.\n\n#Conclusions\nI've been using this strategy for awhile now with the same pool of cash to build up my portfolio with different stocks. The difference with the wheel is that the cash position of the portfolio doesn't change. In our hypothetical example, we start with $6000 and take turns selling puts and calls and at the end of the day we'll end up with $6000 to start the wheel all over again. The profits get invested in any of these stocks to *snowball* our portfolio.\n\nI'm happy to answer any questions and of course hear your feedback.",
        "subreddit": "options",
        "title": "The Snowball Strategy",
        "url": "https://www.reddit.com/r/options/comments/hfvggd/the_snowball_strategy/",
        "created": 1593152290.0
    }
]