[
    {
        "author": "WSBConsensus",
        "created_utc": 1584711705,
        "id": "flv7xb",
        "num_comments": 510,
        "num_crossposts": 0,
        "selftext": "*Good luck today guys, hope everyone makes some tendies* \n\n\n**Of note for Airlines (LUV, DAL, AAL, UAL),** the Airlines for Americas trade association says the industry needs “immediate financial assistance” to protect the 11mln jobs it represents.\n\n**Of note for Banks (JPM, C, MS, BAC, GS),** the Fed is encouraged by a notable increase in discount window borrowing as banks show a willingness to use the window as a funding source to support the flow of credit to households and businesses.\n\n**Of note for Car Rental Services (HTZ, CAR),** both Hertz and Avis Budget Corp have requested aid from the US government.\n\n#Dow Jones\n\n\n\n**Apple Inc. (AAPL)** supply chain is reportedly still facing supply disruptions even as China recovers due to factory closures of suppliers in Malaysia. Elsewhere, it has limited the number of purchases on its iPhones to two per customer in the US and China, according to Canalys.\n\n**Boeing Company (BA)** is reportedly leaning towards a temporary halt of operations at its twin-aisle jetliner factories due to the spread of the coronavirus, according to people familiar with the matter, in a similar move to Airbus (AIR FP).\n\n**Johnson &amp; Johnson (JNJ)** Global Supply Chain Officer Wengel announced its supply chain is currently holding steady and meeting patient needs.\n\n**Walmart (WMT)** announced it is planning to give special cash bonuses for hourly associates for their work during the current conditions with full-time associates receiving USD 300 and part-time associates receiving USD 150, which will equate to USD 365mln. WMT is to also accelerate its next bonus for store, club and supply chain associates which will equate to USD 180mln, overall it will equate to USD 550mln, the co. says. WMT is to also hire over 150k hourly employees as the number of shoppers increases.\n\n#Nasdaq 100\n\n\n**Amazon.com Inc. (AMZN)**– Some sellers state its decision to stop receiving non-essential inventory in response to the coronavirus pandemic could limit sales they need to make payments on its loans from Amazon.\n\n**Tesla (TSLA)** announced it decided to temporarily suspend production at its Fremont, California factory and NY Factory after March 23rd. Elsewhere, CEO Musk announced his factories are working on ventilators to address a potential shortage.\n\n**United Continental Holdings (UAL)** –  **Apollo Global Management (APO)** has reportedly purchased part of the airlines USD 2bln loan from a group of banks, according to people familiar with the matter.\n\n#S&amp;P 500\n\n\n**Accenture plc (ACN)** had its PT cut at a number of brokers, however, they were positive on its ability to continue through the coronavirus crisis.\n\n**AFLAC Inc (AFL)** American Family Life Assurance of Columbus and New York agreed to acquire Zurich North America's US corporate Life and Pensions. AFL expects the acquisition to be dilutive to 2020 adj. EPS by USD 0.02 to 0.03.\n\n**Altria Group Inc (MO)** announced it is temporarily suspending operations at its Richmond manufacturing center.\n\n**Anthem Inc. (ANTM)** announced it is offering up to 80 hours of paid emergency leave for qualifying needs, including if associates are experiencing coronavirus symptoms or for caring for young children whose school has been closed.\n\n**AT&amp;T Inc. (T)** announced it has cancelled is accelerates share repurchase programme of USD 4bln worth of stock, noting the impact of the coronavirus could be material although it cannot currently estimate the impact onto its financial or operational results.\n\n**Bank of America Corp (BAC)** announced it is offering additional support for its consumer and small business clients in response to the coronavirus, where clients can request funds including overdraft fees, non-sufficient funds fees, and monthly maintenance fees through deposit accounts. Many customers can also request to defer any payments.\n\n**Carnival Corp. (CCL)** preliminary Q1 20 (USD): EPS 0.22 (exp. 0.27), revenue 4.8bln (exp. 4.66bln); coronavirus resulted in a net loss of 0.23/shr.\n\n**Cintas Corporation (CTAS)** Q3 20 (USD): Adj. EPS 2.16 (exp. 2.02), revenue 1.81bln (exp. 1.8bln), gross margin 45.5% (exp. 45.7%, prev. 44.9% Y/Y); announced it is not providing guidance for Q4 20 and it is suspending FY20 guidance due to uncertainty surrounding the coronavirus.\n\n**Coty, Inc (COTY)** provided an update on the current situation: Expects Q3 20 revenue to fall approximately 20% like for like, with a meaningful impact on profit, it has also withdrawn FY20 guidance. It is recommending to the board that shareholders be given the option to receive up to 100% of their quarterly dividend in kind for the coming two quarters. Its largest shareholder JAB decided to fully repay the loan it used to finance the tender offer in 2019. It is taking initiatives to manufacture hand sanitizer. Notes activations on Amazon have seen US sales nearly double in recent weeks, as well as launching the Kylie skin-care Europe in upcoming weeks; it is also preparing for increased demand post coronavirus.\n\n**Danaher Corp. (DHR)** announced the US FTC is on board with the acquisition of **General Electric’s (GE)** Life Sciences Biopharma Business. The closing of the deal is still subject to customary closing conditions as announced in the agreement, but DHR expects the deal to close on March 31st, 2020.\n\n**Ford Motor (F)** announced it has plans to suspend production in Argentina and Brazil starting next week due to the coronavirus.\n\n**Kohl's Corp. (KSS)** announced it is to close its stores nationwide through to at least April 1st, although customers will still be able to shop on its App. It also withdrew guidance for Q1 and FY20.\n\n**Mylan N.V. (MYL)** announced it is increasing production of its malaria drug for potential use to combat the coronavirus.\n\n**Occidental Petroleum (OXY)** is reportedly planning on naming its former CEO Stephen Chazen as its new chairman as it tries to improve amid weak demand and activism from Carl Icahn, according to WSJ citing people familiar with the matter.\n\n**Sysco Corp. (SYY)** announced it will donate 2.5mln meals over the next four weeks as part of its response strategy to help against COVID-19. Elsewhere, it has withdrawn its three-year plan guidance due to the impact from the coronavirus.\n\n**Tiffany &amp; Co. (TIF)** Q4 19 (USD): Adj. EPS 1.80 (exp. 1.77), revenue 1.4bln (exp. 1.36bln); SSS +3%, SSS Ex-Hong Kong +5%, Gross Margin 63.3% (Prev. Y/Y 63.8%). Announced it will not be issuing FY20 guidance due to the pending merger with LVMH\n\n#Other\n\n\n**Crowdstrike (CRWD)** Q4 19 (USD): Adj. EPS -0.02 (exp. -0.08), Revenue 152mln (exp. 137mln); FY21 Adj. EPS view -0.14 to -0.10 (exp. -0.18), revenue view 723-733mln (exp. 685mln)\n\n**Samsung (SSNLF)** has reportedly been hit hard by Vietnam’s travel restrictions from South Korea, fueling concerns its Galaxy Note smartphones will fall behind schedule in its largest manufacturing hub outside South Korea\n\n**Teva (TEVA)** announced it will be donating over 6mln doses of hydroxychloroquine sulfate tablets across the US to meet the urgent demand for the medicine as an investigational target to treat the coronavirus.\n\n\n#Additional US Equity Stories\n\n\n**Of note for casino names (MGM, CZR, WYNN, MLCO);** Macau has halved its 2020 gaming revenue forecast due to the coronavirus and predicts a 56% fall from previous year to USD 16bln.\n\n**US Steel (X)** Q1 20 (USD): Adj. EPS view -0.80 (exp. -0.84), EBITDA 30mln.\n\n**Coca Cola (KO)** does not expect to meet its FY20 guidance, although does not foresee any near-term interruptions to its concentrate or beverage-based production. Meanwhile, it had its PT lowered at Deutsche Bank to USD 53/shr from USD 64/shr, although the desk reiterated its long-term buy rating.\n\n**Ross Stores (ROST)** announced it is to temporarilty close all of its stores throughout the US due to the coronavirus.\n\n**Dollar Tree (DLTR)** announced it is hiring 25,000 associates (both full and part time) to help across its stores in the US.\n\n**Synaptics Inc. (SYNA)** downgraded to Underweight from Neutral at JP Morgan\n\n**Colgate Palmolive (CL)** upgraded to Buy from Neutral at BofA\n\n**Accenture (CAN)** upgraded to Buy from Neutral at MoffettNathansonMonster Beverage",
        "subreddit": "wallstreetbets",
        "title": "Trade responsibly,",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/flv7xb/trade_responsibly/",
        "created": 1584740505.0
    },
    {
        "author": "WSBConsensus",
        "created_utc": 1584625669,
        "id": "flaaks",
        "num_comments": 99,
        "num_crossposts": 0,
        "selftext": "*As always fellow autist, enjoy your coffee* \n\n\n**Of note for Hotel Names (H, MAR, HLT),** NYC officials are reportedly working with hotel officials to potentially convert entire hotels into hospitals for patients without the coronavirus, according to WSJ. Elsewhere, the American Hotel and Lodging Association President and CEO stated “more than half of the hotels across America will close by the end of the month. Whether or not the closure is permanent or temporary. Some of it will be permanent”\n\n**Of note for Automakers (GM, F, TSLA),** GM and F have been in talks with government officials on how it could support the production of medical equipment to help tackle the coronavirus outbreak. Tesla CEO Musk also announced in a tweet “We will make ventilators if there is a shortage”.\n\n#Dow Jones\n\n\n**Pfizer (PFE)** announce it has postponed its investor day due to the coronavirus, although a specific date is not mentioned due to uncertainty surrounding the coronavirus. Although it did announce its late stage study of an experimental treatment, abrocitinib, was effective in treating atopic dermatitis in a combination with topical therapies. It also reported positive top line results from its pneumococcal conjugate vaccine in adult patients.\n\n**Walmart (WMT)** announced US stores will adjust its operating hours to 07:00 to 20:30 to increase cleaning and allow more time for its stock to be stacked.\n\n#Nasdaq 100\n\n\n\n**Align Technology (ALGN)** announced as the coronavirus spreads to Europe, Middle East, Africa and Americas, it is expecting a material impact from the virus on its Q120 results.\n\n**eBay Inc. (EBAY)**– One of its largest shareholders, Starboard Value, announced it has delivered a formal notice to nominate four directors to the company board.\n\n**Facebook, Inc. (FB)** CEO Zuckerberg dismissed the Washington Post report yesterday that the government is working with tech companies to use location data to tackle the coronavirus.\n\n**Marriott Int'l. (MAR)** announced it has been implementing cost cutting measures, including shortened work weeks and pay cuts to senior executives. So far, the measures will reduce 2020 corporate general and administrative costs by at least USD 140mln. MAR also expects to eliminate or defer at least one third of its USD 700-800mln spending plans for 2020. It also notes as of March 17th it has drawn down USD 2.5bln of it USD 4.5bln revolving credit facility to support commercial paper maturities. It expects its latest dividend to be the last the conditions get better. Given the mentioned commitments the Co is facing, it has decided to withdraw all aspects of its outlook and assumptions for FY20. Elsewhere, it says there are early signs of improvement in China and the number of closed hotels in the region has fallen to under 30 from 90 previously.\n\n**Starbucks Corp. (SBUX)** CEO announced on CNBC 95% of its China stores are expected to open by the end of the month, noting the “to go” model is working in both the US and China.\n\n**Tesla (TSLA)** Fremont Factory in California will reportedly stay open, but at a limited capacity. Reports earlier in the week noted it had been ordered to halt operations temporarily amid the coronavirus pandemic. Elsewhere, the automaker was also upgraded to Equal Weight from Underweight at Morgan Stanley, where analyst Adam Jonas gives a USD 460 PT (Prev. close 361.22), where the analyst notes TSLA has sufficient cash and liquidity available to help against near term disruptions to its production and sales.\n\n**T-Mobile (TMUS) announced it is currently financially prepared to close its merger with **Sprint (S)**\n\n**Trip.com (TCOM)** Q4 19 (USD): Adj. earnings per ADS 0.28, revenue 1.2bln (+10% Y/Y). Q1 revenue view -45 to 50%.\n\n#S&amp;P 500\n\n\n**Abbott Laboratories (ABT)** announced the US FDA issued an emergency use authorisation for its coronavirus test.\n\n**Accenture plc (ACN)** Q2 20 (USD): EPS 1.91 (exp. 1.72), revenue 11.1bln (exp. 11.1bln), new bookings 14.2bln. Q3 revenue view 10.75-11.15bln (exp. 11.74bln). Cut its FY20 EPS view to 7.48-7.70 (exp. 7.84, prev. 7.66-7.84).\n\n**Darden Restaurants (DRI)** Q3 EPS 1.90 (exp. 1.88), revenue 2.35bln (exp. 2.32bln); Same restaurant sales +2.3%. Withdraws FY20 guidance and announced it has suspended its quarterly dividend amid the coronavirus outbreak.\n\n**Diamondback Energy (FANG)** announced it has cut activity even further. Due to the reduction in activity It expects to reduce its capital budget for this year by USD 1.2bln to USD 1.5-1.9bln from USD 2.8-3.0bln. \n\n**Estee Lauder Cos. (EL)** announced it has withdrawing its FY20 guidance.\n\n**General Electric (GE)** Healthcare CEO issued a statement noting it has increased its manufacturing capacity and output of equipment to help with diagnosis and treatment of patients with coronavirus. Adding it is continuously exploring options to support the increased need of medical equipment.\n\n**Harley-Davidson (HOG)** announced it is temporarily suspending the majority of its US operations and the majority of its production employees will be on temporary layoff with medical benefits. Elsewhere, Impala Asset Management nominated two candidates to its board of directors.\n\n**Intercontinental Exchange (ICE)** announced the NYSE will move temporality to fully electronic trading as of Monday the 23rd.\n\n**Lennar Corp. (LEN)** Q1 20 (USD): EPS 1.27 (exp. 0.84), Revenue 4.5bln (exp. 4.16bln). Deliveries +17% to 10321 homes, Backlog +2% to 17,632. New orders +18% to 12,376 homes.\n\n**Marathon Petroleum (MPC)** reportedly begun cutting production on Wednesday as demand for motor fuels in the Los Angeles area collapses\n\n**Occidental Petroleum (OXY)**  had its debt rating downgraded to Junk, noting credit challenges ahead following the collapse in energy prices.\n\n**TripAdvisor (TRIP)** announced it has withdrawn its guidance for FY20 due to the coronavirus.\n\n**Twitter, Inc. (TWTR)** is reportedly being used by the FDA to stay updated with medical and drug supply issues\n\n#Other\n\n\n**Autoliv (ALV)** announced the coronavirus outbreak will likely lead to a negative effect on its operations, noting it has drawn down USD 500mln from its USD 1.1bln revolving credit facility to pay existing short-term debt.\n\n**Fiat Chrysler (FCAU)** announced it has agreed with the UAW to cease production at its plants across North America until the end of March.\n\n**Guess (GES)** Q4 19: EPS 1.22 (exp. 1.12), revenue 842mln (exp. 851mln; draws down USD 212mln from certain credit facilities and has postponed its decision in relation to a potential quarterly dividend.\n\n**Kirkland Lake Gold (KL)** announced it has increased its dividend by 100% to USD 0.125/shr.\n\n**Qiagen (QGEN)** announced it its coronavirus test kit has launched in Europe.\n\n**Snap (SNAP)** had its PT lowered at Citi to USD 10 from USD 20 to reflect the impact of coronavirus is likely having on its advertising business. The analyst now expects revenue at USD 1.9bln in 2020, down from USD 2.2bln and beneath the street estimate of USD 2.4bln.\n\n**Steve Madden (SHOO)** announced it has withdrawn its FY20 guidance.\n\n**Vail Resorts (MTN)** announced its operations across North American properties will be suspended throughout the skiing season due to the coronavirus pandemic.\n\n**Williams Sonoma (WSM)** Q4 19 (USD): Adj. EPS 2.13 (exp. 2.05), revenue 1.84bln (exp. 1.82bln); temporarily suspending the provision of FY20 guidance.\n\n\n#Additional US Equity Stories\n\n**Keurig Dr. Pepper (KDP)** announced it has affirms its 2020 forecast of Adj. EPS growth between 13-15% and net sales growth between +3-4%.\n\n**Uber (UBER)** reportedly expects to have USD 6bln cash on hand by the end of the year, with a USD 2bln revolver.\n\n**Airlines (DAL, LUV, AAL)** – US Treasury Secretary Mnuchin says they are looking at secured loans for airlines on market terms.\n\n**Hotel Operators (HLT, MAR)** – Nomura in a research note that HLT and MAR have the ability to survive most economic stresses, adding both have ample cash on hand and within revolvers to deal with the downturn for at least two years, and if needed, it has the sources for liquidity.\n\n**Ford (F)** has offered new car customers a six-month payment relief, has withdrawn its FY20 guidance, suspended its dividend and notes it will borrow the total unused amounts against two credit lines with USD 13.4bln from its corporate credit facility, and USD 2bln under its supplemental credit facility.\n\n**Slack (WORK)** announced it added 7000 new paid customers from the beginning of February. Note, previously it added 5000 paid customers per quarter.\n\n**Nucor (NUE)** Q120 (USD) EPS view 0.95 - 1.00 (Q1 19 EPS was 1.63, Q419 EPS was 0.35/shr)\n\n**AbbVie (ABBV)** treatment for the coronavirus, Kaletra, did not prove effective in treating the virus, according to a study.\n\n**Dish (DISH)** announced it is to provide 20 MHZ of AWS-4 and all of its 700 MHz",
        "subreddit": "wallstreetbets",
        "title": "Good luck today,",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/flaaks/good_luck_today/",
        "created": 1584654469.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1584202541,
        "id": "fiksw6",
        "num_comments": 44,
        "num_crossposts": 0,
        "selftext": "Good Saturday afternoon to all of you here on r/wallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning March 16th, 2020.\n\n# **Stocks are expected to see more wild swings, even if Fed makes big policy move  - [(Source)](https://www.cnbc.com/2020/03/13/stocks-are-expected-to-see-more-wild-swings-even-if-fed-makes-big-policy-move.html)**\n*****\n&gt; Now that stocks have entered a bear market, more wild volatility is expected in the week ahead as investors await a big policy move by the Federal Reserve.\n*****\n&gt; The Federal Reserve meets Tuesday and Wednesday and is expected by some economists to take its benchmark federal funds target range back to zero, as the economy looks more and more like it could fall into a recession, due to the impact of the coronavirus.\n*****\n&gt; In the past week, the market was sharply lower but swung wildly in both directions, including the stunning 10% decline in the Dow Thursday, the worst one-day drop since the 1987 market crash followed by Friday’s 9.3% gain, the best day in more than 11 years.\n*****\n&gt; The S&amp;P 500 ended up 9.3% Friday at 2,711, its best day since Oct. 28, 2008. The S&amp;P is now 20.2% below its February high.\n*****\n&gt; Strategists say the market purge is not over, though it could be closer to a bottom, with some expecting the S&amp;P 500 to fall through 2,400 before it finds a floor.\n*****\n&gt; “You could say we’re pricing a garden variety recession,” said Lori Calvasina, chief U.S. equities strategist at RBC. “We come up with a range of 2,300 to 2,600 as recession territory.” She said the average drop during a recession, since the 1930s, was 32%. The S&amp;P had been as much as 29% off its Feb. 19 high.\n*****\n&gt; “If [S&amp;P] went below 2,300, it would be telling you the market is pricing in something worse than a recession, In the financial crisis we lost 57% and in the tech bubble, we lost 49%,” said Calvasina.\n*****\n&gt; The S&amp;P 500 was down 8.9% for the week, its worst loss since the week of Feb. 28.\n*****\n&gt; “I think we needed to get through this week, in particular — the one where the country went into shut down and now get the second go around of policy response. If they really do bring out the bazookas we should be darn close” to the bottom, said Barry Knapp, Ironsides Macroeconomics director of research.\n*****\n&gt; But strategists also point out that the coronavirus is unpredictable and it is hard to say when it will peak, even though many economists expect a bounce back in economic growth by the fourth quarter.\n*****\n&gt; President Donald Trump declared a state of emergency Friday, which allows him to tap federal agencies to provide emergency funds and other responses to the crisis. The president also announced the government would buy oil to fill the Strategic Petroleum Reserves and that 1.4 million test kits would be available in the next week.\n*****\n&gt; Markets will also be looking for further action, which the Trump administration says could include targeted financial aid to industries that are hard hit, like airlines.\n*****\n&gt; As communities around the country attempt to stop the spread of the virus, the potential hit to the economy grows. Companies have told workers to work from home, universities are shutting campuses, a handful of states closed public schools, and major sporting and other events have been canceled.\n*****\n&gt; “If it indeed is declared a recession, it will really only be a three-month drop in activity,” said Knapp. “In 2008, the household sector had the highest debt levels it ever had, and the household sector was in no position to respond to stimulus. This is quite different.”\n*****\n&gt; “We see where are are today is pricing in a recession. It went from a growth scare down to recession territory,” said Calvasina. She said the market is not ready to move higher yet. “I think something else we’ve got to see in addition to extreme panic ratings from the sentiment indicators, we do need to see the news flow get better on the virus.”\n*****\n&gt; Investors will continue to look for more action from Washington, and in the coming week it will also be the Fed’s policy response that could drive the market.\n*****\n&gt; “In light of the continued growth in coronavirus cases in the US and globally, the sharp further tightening in financial conditions, and rising risks to the economic outlook, we now expect the FOMC to cut the funds rate 100bp on March 18, a faster return to the crisis-era 0-0.25% rate than under our previous call for two 50bp steps in March and April,” Goldman economists wrote.\n*****\n&gt; The Fed on Thursday announced a significant increase in funds available for its repo operations, to provide liquidity for the short term funding markets. It also said it would purchase a broad range of Treasury securities, across maturities, with the $60 billion it currently uses to buy Treasury bills on a monthly basis.\n*****\n&gt; Economists say the Fed could announce other policy moves, like purchases of mortgage securities. Some expect it to return to a “patient” stance, showing a willingness to keep rates extremely low for a long time.\n*****\n&gt; Analysts have been watching the corporate bond market, where spreads blew out dramatically in the past week, particularly in high yield. Calvasina said she is not yet concerned.\n*****\n&gt; “We’ve got problems in energy. We have problems in some hospitality related industries. There are pockets of stress, but for me, when I look across most S&amp;P companies’ balance sheets are in really good shape,” Calvasina said. “I don’t think this is a prolonged sort of downturn.”\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/iG7ENVB.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/4gwPTzC.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/h9DkOZJ.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/4m2QVZH.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/akOOH97.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/slVwGv2.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/ASyHg6a.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/rbgSrGQ.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/9nZfl7V.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/eS99ijc.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/tEs62Hh.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/kMQTBj6.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/toentZ2.png))**\n###### **([CLICK HERE FOR THE CHART LINK #4!](https://i.imgur.com/ozn837y.png))**\n\n*****\n\n# Signs Of A Washout?\n\n&gt; The S&amp;P 500 Index’s historic slide continued yesterday, culminating in nearly a 10% loss for the day, and leaving the benchmark index officially in bear market territory, just 16 trading days after setting a record high on February 19. In addition, the S&amp;P 500 has now moved more than 4% each day this week, leaving investors and professionals alike wondering when this volatility could end. While nobody knows for sure, one thing we always look for at market bottoms are signs of extremes, both from a sentiment and price perspective.\n\n&gt; From an anecdotal sentiment perspective, certainly fears of COVID-19 have reached the masses, with travel plans canceled and announcements of major events called off coming nearly every hour. However, investor survey data shows a similar story with the American Association of Individual Investors (AAII) Investor Sentiment Survey showing the highest percentage of bears since April 2013. In addition, the National Association of Active Investment Managers (NAAIM) Exposure Index, which represents the average exposure to US equity markets by the surveyed investment managers, reached its lowest level since September 2015. Following each of those instances, the S&amp;P 500 rallied more than 13% over the next year.\n\n&gt; Another way of gauging sentiment can be from the internals of the market. While the S&amp;P 500 is now well below its 200-day moving average, that doesn’t mean each stock in the index has moved below its respective 200-day moving average. In fact, regardless of the broad market’s trend, when less than 20% of the individual components of the index are trading below their 200-day moving averages, it is considered an extreme. As shown in the LPL Chart of the Day, Thursday’s sell-off left less 6% of the S&amp;P 500 there, a number last seen in March 2009. “These are truly frightening times,” explained LPL Financial Senior Market Strategist Ryan Detrick. “However, it is important to remember that the signs of panic we are seeing are typically found at or near major market lows.”\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/03/Signs_of_Washout.png?ssl=1))**\n\n*****\n\n# The Fastest Bear Market Ever\n\n&gt; The historic volatility continues, with the Dow Jones Industrial Average officially setting its fastest move from a new all-time high to a bear market (down 20% from the highs) in the 124-year history of the index. It took only 19 days for this to take place, which is far and away the new record.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/03/Bear-market-1-1.png?ssl=1))**\n\n&gt; Not to be outdone, the S&amp;P 500 Index is set to close down 20% from all-time highs today, doing this in only 16 days. Again, as of the time we are writing this blog, the S&amp;P 500 is in bear market territory, but there always could be a chance for a late-day rally.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/03/Bear-market-2.png?ssl=1))**\n\n&gt; “From major sports postponing their seasons, to travel bans to Europe, the economic impact of the coronavirus is growing exponentially with each passing day,” said LPL Financial Senior Market Strategist Ryan Detrick. “Markets are pricing in a potential recession and inevitable second quarter slowdown, but it is all about expectations. Should the virus be contained and the worst-case scenarios not materialize, now could be a nice opportunity for longer-term investors.”\n\n&gt; Last, one of Warren Buffett’s most famous quotes is, “Be fearful when others are greedy and be fearful when others are fearful.” We’ve seen many signs of extreme fear the past few days, but the CNN Fear &amp; Greed Index hitting 1 earlier today is quite a historic level of fear. This proprietary indicator looks at multiple inputs (like put/call ratios, momentum, and volatility), but on a scale of 1-100, this morning’s 1 is the lowest level ever seen, besting the 2 it hit at the lows in December 2018. From a contrarian point of view, this could be quite meaningful.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/03/Bear-market-3.png?ssl=1))**\n\n*****\n\n# Perspectives on Waterfall Declines\n\n&gt; Volatile market action over the several weeks warrants some much needed perspective into the history of these types of waterfall declines. Fortunately, we have this research on hand and have been examining the nature of deep, fast selloffs like we have experience here in early 2020 as well as the nature of the inevitable and often sharp recoveries.\n\n&gt; First of all yes, this time is different – and yet it’s not. The headline causes of each of these historic waterfall declines are all different and yet investor, trader and money manager behavior remains rather similar. Fear has once again exposed the market’s overvaluation and weaknesses. This time it’s the fear of the coronavirus pandemic and price war in the oil market that spills over into the rest of the financial.\n\n&gt; Like the previous occurrences of waterfall declines in the table and graphs below the market reacted to fear and sold off fast and hard. It’s too early to tell if this waterfall decline is over or how fast and far the recovery will be. As we continue to analyze the current situation a thorough review of the history of waterfall declines and their subsequent recoveries should provide some much needed perspective.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/31cca506c45d87ad962ce9c707baf21a/fc7021573b50880b-76/s500x750/0a6588971f599cbbca194b38b62a47c087875238.jpg))**\n\n*****\n\n# Friday 13th, DJIA Attempting to Recover &amp; End Losing Friday Streak\n\n&gt; Friday is a significant day of the week because it is the last day of trading and positions held over the weekend could be at higher risk of an exogenous event or an unanticipated headline. Pages 143 &amp; 144 of the Stock Trader’s Almanac 2020 show the difference in Friday performance during bull and bear markets. Friday’s have been weaker in bear markets.\n\n&gt; However today, on a Friday the 13th of all days, DJIA is fighting to recover some of its losses this week and to end its streak of down Fridays at seven. Down Friday DJIA losing streaks of seven or more, like the current streak, are actually somewhat rare in history. Prior to this year, DJIA has had just six similar or longer down Friday streaks going back to 1950. The last streak of down Fridays was in March and April of 2017. The longest streak lasted nine Fridays beginning on the last Friday of 2000 and lasting into February 2001.\n\n &gt; In the above chart the 30 trading days before and the 60 trading days after the last six DJIA down Friday losing streaks of seven or more have been plotted to display the average performance before and after the last down Friday of the streak. (There are on average 21 trading days in a typical calendar month) Weakness and lower was the trend during the down Friday streak, but once the streak came to an end, DJIA was higher 60 trading days later.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/c8d6237984423d89dc5b20f4a1bf7009/07327bf517318c16-1e/s500x750/13020ac23c0adf1831e35c982c37f1602a236fd1.jpg))**\n\n*****\n\n# Last Stocks Above Their Moving Averages\n\n&gt; The massive declines over the past few weeks have left conditions extremely oversold. As we highlighted in yesterday's Sector Snapshot, breadth has been awful while there is no longer a single stock in the S&amp;P 500 that is overbought (1 or more standard deviations above its 50-DMA). In fact, after yesterday's absolute washout, there is only a small handful of stocks that are above their 50 and 200-DMAs. In regards to the 50-DMA, less than 1% of stocks in the S&amp;P 500 are above this average which is the first time that has happened since 2011. The only time in between that saw a similarly weak reading, although not quite hitting that under 1% requirement was back in December of 2018 when 1.19% of stocks were above their 50-DMA. As for the 200-DMA, only 5.59% are above that level. That is the lowest reading since March of 2009.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/MAs.png))**\n\n&gt; The average stock is now 26.56% below its 50-day and 24.5% below its 200-day. The table below shows those 22 remaining stocks that are still above their 200-DMAs as of yesterday's close and the few that are also below their 50-DMA. Of these, only Regeneron (REGN), Kroger (KR), Digital Realty Trust (DLR), and Gilead Sciences (GILD) are also above their 50-DMAs. The only other stock in the index that is also above its 50-DMA is Cabot Oil and Gas (COG), though it is 11% below its 200-DMA. While these stocks have all held above their long term moving average recently, only GILD and REGN have risen since the index's high on 2/19.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/Above-200-table2.png))**\n\n*****\n\n# Selloff Erases All of US Market Cap Gains Since Election Day 2016\n\n&gt; With the US stock market down nearly 7% yet again today, the total market cap of US companies as measured by the Russell 3,000 has fallen $11.5 trillion in less than a month. On February 19th, total US market cap was just over $35 trillion. It's at $23.8 trillion as of this morning.\n\n&gt; What makes this drop even more noteworthy is that $23.8 trillion was the market cap of US companies on Election Day 2016. At this point in time, all of the market cap gains seen since President Trump's election victory have been wiped out.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/raymktcap.png))**\n\n*****\n\n# Low Rates Send Mortgage Applications Surging\n\n&gt; Coronavirus fears have broadly sent rates lower over the past month. Currently, the national average for a 30-year fixed-rate mortgage stands at 3.68%; just off the low of 3.55% from earlier in the month. With mortgage rates now basically at their lowest levels since late 2016, homeowners have been quickly enticed to jump on these lower rates.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/MRNA.png))**\n\n&gt; Last week, weekly mortgage applications from the Mortgage Bankers Association showed a roughly 15% surge as rates were reaching record lows. In the time since then, the Fed's 50 bps cut came into effect and yields fell even further which led mortgage applications this week to surge 55.4%. That is the highest week over week increase in mortgage applications since November of 2008 when they had risen 112.1%. Outside of that period, we've only seen larger weekly increases a few other times since 1990.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/MA-1.png))**\n\n&gt; The spike was driven largely by refinancing applications which rose 78.6% week-over-week. As with the composite, that was the biggest weekly jump in refi applications since the housing bubble. Prior to that, once again you would need to go back to 2001 or the 1990s to find larger weekly increases in mortgage refinance applications.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/MA-ref.png))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$NIO** \n&gt; * **$HQY** \n&gt; * **$FCEL** \n&gt; * **$MOMO** \n&gt; * **$FDX** \n&gt; * **$CRWD** \n&gt; * **$HUYA** \n&gt; * **$NBEV** \n&gt; * **$BE** \n&gt; * **$MDB** \n&gt; * **$BZUN** \n&gt; * **$BILI** \n&gt; * **$YY** \n&gt; * **$COUP** \n&gt; * **$MUX** \n&gt; * **$FIVE** \n&gt; * **$TME** \n&gt; * **$MIK** \n&gt; * **$CVSI** \n&gt; * **$ACRX** \n&gt; * **$ACN** \n&gt; * **$GES** \n&gt; * **$WPRT** \n&gt; * **$OLLI** \n&gt; * **$GIS**\n&gt; * **$CPRX** \n&gt; * **$PLCE** \n&gt; * **$DRI** \n&gt; * **$TLRD** \n&gt; * **$ZTO** \n&gt; * **$BAX** \n&gt; * **$LEN** \n&gt; * **$DLTH** \n&gt; * **$HDS** \n&gt; * **$CTAS** \n&gt; * **$SMAR** \n&gt; * **$WSM** \n&gt; * **$TCOM** \n&gt; * **$HIBB** \n&gt; * **$REI** \n&gt; * **$DBI** \n&gt; * **$CTRA** \n&gt; * **$GPL** \n&gt; * **$CMC**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/9nZfl7V.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/EKAkJgU.png))**\n###### **([CLICK HERE FOR  THE MOST NOTABLE EARNINGS RELEASES BEFORE MONDAY'S OPEN!](https://i.imgur.com/631cGTg.jpg))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 3.16.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/FLCjERW.png))\n\n\n&gt; # ***Monday 3.16.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/GCK6dns.png))\n\n\n*****\n\n&gt; # ***Tuesday 3.17.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/J7uVG2b.png))\n\n&gt; # ***Tuesday 3.17.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ADUyE5E.png))\n\n*****\n\n&gt; # ***Wednesday 3.18.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/q2AM8aO.png))\n\n&gt; # ***Wednesday 3.18.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/sXXUKYj.png))\n\n*****\n\n&gt; # ***Thursday 3.19.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ZISY7gz.png))\n\n&gt; # ***Thursday 3.19.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/pgdAKJu.png))\n\n*****\n\n&gt; # ***Friday 3.20.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n&gt; # ***Friday 3.20.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# NIO Inc. $3.11\n&gt; **NIO Inc. (NIO)** is confirmed to report earnings at approximately 6:40 AM ET on Wednesday, March 18, 2020. The consensus estimate is for a loss of $0.37 per share on revenue of $412.45 million and the Earnings Whisper ® number is ($0.34) per share. Investor sentiment going into the company's earnings release has 46% expecting an earnings beat The company's guidance was for revenue of approximately $393.00 million. Consensus estimates are for year-over-year earnings growth of 24.49% with revenue decreasing by 17.46%. Short interest has decreased by 21.0% since the company's last earnings release while the stock has drifted higher by 6.5% from its open following the earnings release to be 5.8% above its 200 day moving average of $2.94. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, March 13, 2020 there was some notable buying of 1,321 contracts of the $2.00 put expiring on Friday, April 3, 2020. Option traders are pricing in a 21.9% move on earnings and the stock has averaged a 20.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NIO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# HealthEquity, Inc. $53.99\n&gt; **HealthEquity, Inc. (HQY)** is confirmed to report earnings at approximately 4:00 PM ET on Monday, March 16, 2020. The consensus earnings estimate is $0.34 per share on revenue of $198.49 million and the Earnings Whisper ® number is $0.37 per share. Investor sentiment going into the company's earnings release has 73% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 25.93% with revenue increasing by 161.94%. Short interest has decreased by 21.5% since the company's last earnings release while the stock has drifted lower by 21.4% from its open following the earnings release to be 18.3% below its 200 day moving average of $66.07. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, March 4, 2020 there was some notable buying of 551 contracts of the $65.00 put expiring on Friday, September 18, 2020. Option traders are pricing in a 19.4% move on earnings and the stock has averaged a 4.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HQY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# FuelCell Energy, Inc. $1.15\n&gt; **FuelCell Energy, Inc. (FCEL)** is confirmed to report earnings at approximately 7:00 AM ET on Monday, March 16, 2020. The consensus estimate is for a loss of $0.09 per share on revenue of $9.80 million and the Earnings Whisper ® number is ($0.10) per share. Investor sentiment going into the company's earnings release has 49% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 50.00% with revenue decreasing by 44.89%. Short interest has increased by 20.7% since the company's last earnings release while the stock has drifted lower by 46.8% from its open following the earnings release to be 23.2% above its 200 day moving average of $0.93. Overall earnings estimates have been revised lower since the company's last earnings release. The stock has averaged a 30.5% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FCEL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Momo Inc. $23.57\n&gt; **Momo Inc. (MOMO)** is confirmed to report earnings at approximately 3:15 AM ET on Thursday, March 19, 2020. The consensus earnings estimate is $0.74 per share on revenue of $654.51 million and the Earnings Whisper ® number is $0.77 per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat The company's guidance was for revenue of $642.00 million to $656.00 million. Consensus estimates are for year-over-year earnings growth of 32.14% with revenue increasing by 17.07%. Short interest has increased by 54.1% since the company's last earnings release while the stock has drifted lower by 37.4% from its open following the earnings release to be 31.0% below its 200 day moving average of $34.17. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, March 10, 2020 there was some notable buying of 1,063 contracts of the $27.00 call expiring on Friday, April 17, 2020. Option traders are pricing in a 18.0% move on earnings and the stock has averaged a 8.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MOMO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# CrowdStrike, Inc. $39.55\n&gt; **CrowdStrike, Inc. (CRWD)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, March 19, 2020. The consensus estimate is for a loss of $0.08 per share on revenue of $137.67 million and the Earnings Whisper ® number is ($0.06) per share. Investor sentiment going into the company's earnings release has 82% expecting an earnings beat The company's guidance was for a loss of $0.09 to $0.08 per share on revenue of $136.00 million to $139.00 million. Short interest has decreased by 52.2% since the company's last earnings release while the stock has drifted lower by 26.8% from its open following the earnings release. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 10.4% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CRWD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# FedEx Corp. $106.63\n&gt; **FedEx Corp. (FDX)** is confirmed to report earnings at approximately 4:00 PM ET on Tuesday, March 17, 2020. The consensus earnings estimate is $1.69 per share on revenue of $17.19 billion and the Earnings Whisper ® number is $1.67 per share. Investor sentiment going into the company's earnings release has 23% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 44.22% with revenue increasing by 1.06%. Short interest has increased by 16.0% since the company's last earnings release while the stock has drifted lower by 29.6% from its open following the earnings release to be 31.2% below its 200 day moving average of $154.91. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, March 10, 2020 there was some notable buying of 1,131 contracts of the $85.00 put expiring on Friday, April 17, 2020. Option traders are pricing in a 17.4% move on earnings and the stock has averaged a 7.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FDX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# HUYA Inc. $15.40\n&gt; **HUYA Inc. (HUYA)** is confirmed to report earnings at approximately 6:00 PM ET on Monday, March 16, 2020. The consensus earnings estimate is $0.13 per share on revenue of $339.95 million and the Earnings Whisper ® number is $0.15 per share. Investor sentiment going into the company's earnings release has 80% expecting an earnings beat The company's guidance was for revenue of $334.00 million to $345.00 million. Consensus estimates are for year-over-year earnings growth of 85.71% with revenue increasing by 55.31%. Short interest has increased by 65.2% since the company's last earnings release while the stock has drifted lower by 38.4% from its open following the earnings release to be 28.9% below its 200 day moving average of $21.66. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, February 21, 2020 there was some notable buying of 774 contracts of the $18.00 put expiring on Friday, July 17, 2020. Option traders are pricing in a 19.3% move on earnings and the stock has averaged a 5.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HUYA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# New Age Beverages Corporation $1.46\n&gt; **New Age Beverages Corporation (NBEV)** is confirmed to report earnings at approximately 6:00 AM ET on Monday, March 16, 2020. The consensus estimate is for a loss of $0.08 per share on revenue of $65.80 million and the Earnings Whisper ® number is ($0.10) per share. Investor sentiment going into the company's earnings release has 53% expecting an earnings beat. Short interest has decreased by 15.8% since the company's last earnings release while the stock has drifted lower by 35.7% from its open following the earnings release to be 49.2% below its 200 day moving average of $2.87. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, March 4, 2020 there was some notable buying of 2,000 contracts of the $1.50 call expiring on Friday, June 19, 2020. The stock has averaged a 5.6% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NBEV&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Bloom Energy Corporation $6.12\n&gt; **Bloom Energy Corporation (BE)** is confirmed to report earnings after the market closes on Monday, March 16, 2020. Investor sentiment going into the company's earnings release has 64% expecting an earnings beat. Short interest has decreased by 5.4% since the company's last earnings release while the stock has drifted higher by 36.9% from its open following the earnings release to be 21.5% below its 200 day moving average of $7.80. On Tuesday, March 10, 2020 there was some notable buying of 1,772 contracts of the $9.00 call expiring on Friday, March 20, 2020. The stock has averaged a 19.3% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# MongoDB, Inc. $115.17\n&gt; **MongoDB, Inc. (MDB)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, March 17, 2020. The consensus estimate is for a loss of $0.28 per share on revenue of $110.38 million and the Earnings Whisper ® number is ($0.26) per share. Investor sentiment going into the company's earnings release has 73% expecting an earnings beat The company's guidance was for a loss of $0.29 to $0.27 per share on revenue of $109.00 million to $111.00 million. Consensus estimates are for earnings to decline year-over-year by 55.56% with revenue increasing by 29.12%. Short interest has decreased by 6.3% since the company's last earnings release while the stock has drifted lower by 20.4% from its open following the earnings release to be 19.6% below its 200 day moving average of $143.28. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 18.9% move on earnings and the stock has averaged a 8.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MDB&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/wallstreetbets.",
        "subreddit": "wallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning March 16th, 2020",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fiksw6/wall_street_week_ahead_for_the_trading_week/",
        "created": 1584231341.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1584202262,
        "id": "fikq7c",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Good Saturday afternoon to all of you here on r/StockMarket. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week and month ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning March 16th, 2020.\n\n# **Stocks are expected to see more wild swings, even if Fed makes big policy move  - [(Source)](https://www.cnbc.com/2020/03/13/stocks-are-expected-to-see-more-wild-swings-even-if-fed-makes-big-policy-move.html)**\n*****\n&gt; Now that stocks have entered a bear market, more wild volatility is expected in the week ahead as investors await a big policy move by the Federal Reserve.\n*****\n&gt; The Federal Reserve meets Tuesday and Wednesday and is expected by some economists to take its benchmark federal funds target range back to zero, as the economy looks more and more like it could fall into a recession, due to the impact of the coronavirus.\n*****\n&gt; In the past week, the market was sharply lower but swung wildly in both directions, including the stunning 10% decline in the Dow Thursday, the worst one-day drop since the 1987 market crash followed by Friday’s 9.3% gain, the best day in more than 11 years.\n*****\n&gt; The S&amp;P 500 ended up 9.3% Friday at 2,711, its best day since Oct. 28, 2008. The S&amp;P is now 20.2% below its February high.\n*****\n&gt; Strategists say the market purge is not over, though it could be closer to a bottom, with some expecting the S&amp;P 500 to fall through 2,400 before it finds a floor.\n*****\n&gt; “You could say we’re pricing a garden variety recession,” said Lori Calvasina, chief U.S. equities strategist at RBC. “We come up with a range of 2,300 to 2,600 as recession territory.” She said the average drop during a recession, since the 1930s, was 32%. The S&amp;P had been as much as 29% off its Feb. 19 high.\n*****\n&gt; “If [S&amp;P] went below 2,300, it would be telling you the market is pricing in something worse than a recession, In the financial crisis we lost 57% and in the tech bubble, we lost 49%,” said Calvasina.\n*****\n&gt; The S&amp;P 500 was down 8.9% for the week, its worst loss since the week of Feb. 28.\n*****\n&gt; “I think we needed to get through this week, in particular — the one where the country went into shut down and now get the second go around of policy response. If they really do bring out the bazookas we should be darn close” to the bottom, said Barry Knapp, Ironsides Macroeconomics director of research.\n*****\n&gt; But strategists also point out that the coronavirus is unpredictable and it is hard to say when it will peak, even though many economists expect a bounce back in economic growth by the fourth quarter.\n*****\n&gt; President Donald Trump declared a state of emergency Friday, which allows him to tap federal agencies to provide emergency funds and other responses to the crisis. The president also announced the government would buy oil to fill the Strategic Petroleum Reserves and that 1.4 million test kits would be available in the next week.\n*****\n&gt; Markets will also be looking for further action, which the Trump administration says could include targeted financial aid to industries that are hard hit, like airlines.\n*****\n&gt; As communities around the country attempt to stop the spread of the virus, the potential hit to the economy grows. Companies have told workers to work from home, universities are shutting campuses, a handful of states closed public schools, and major sporting and other events have been canceled.\n*****\n&gt; “If it indeed is declared a recession, it will really only be a three-month drop in activity,” said Knapp. “In 2008, the household sector had the highest debt levels it ever had, and the household sector was in no position to respond to stimulus. This is quite different.”\n*****\n&gt; “We see where are are today is pricing in a recession. It went from a growth scare down to recession territory,” said Calvasina. She said the market is not ready to move higher yet. “I think something else we’ve got to see in addition to extreme panic ratings from the sentiment indicators, we do need to see the news flow get better on the virus.”\n*****\n&gt; Investors will continue to look for more action from Washington, and in the coming week it will also be the Fed’s policy response that could drive the market.\n*****\n&gt; “In light of the continued growth in coronavirus cases in the US and globally, the sharp further tightening in financial conditions, and rising risks to the economic outlook, we now expect the FOMC to cut the funds rate 100bp on March 18, a faster return to the crisis-era 0-0.25% rate than under our previous call for two 50bp steps in March and April,” Goldman economists wrote.\n*****\n&gt; The Fed on Thursday announced a significant increase in funds available for its repo operations, to provide liquidity for the short term funding markets. It also said it would purchase a broad range of Treasury securities, across maturities, with the $60 billion it currently uses to buy Treasury bills on a monthly basis.\n*****\n&gt; Economists say the Fed could announce other policy moves, like purchases of mortgage securities. Some expect it to return to a “patient” stance, showing a willingness to keep rates extremely low for a long time.\n*****\n&gt; Analysts have been watching the corporate bond market, where spreads blew out dramatically in the past week, particularly in high yield. Calvasina said she is not yet concerned.\n*****\n&gt; “We’ve got problems in energy. We have problems in some hospitality related industries. There are pockets of stress, but for me, when I look across most S&amp;P companies’ balance sheets are in really good shape,” Calvasina said. “I don’t think this is a prolonged sort of downturn.”\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/iG7ENVB.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/4gwPTzC.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/h9DkOZJ.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/4m2QVZH.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/akOOH97.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/slVwGv2.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/ASyHg6a.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/rbgSrGQ.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/9nZfl7V.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/eS99ijc.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/tEs62Hh.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/kMQTBj6.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/toentZ2.png))**\n###### **([CLICK HERE FOR THE CHART LINK #4!](https://i.imgur.com/ozn837y.png))**\n\n*****\n\n# Signs Of A Washout?\n\n&gt; The S&amp;P 500 Index’s historic slide continued yesterday, culminating in nearly a 10% loss for the day, and leaving the benchmark index officially in bear market territory, just 16 trading days after setting a record high on February 19. In addition, the S&amp;P 500 has now moved more than 4% each day this week, leaving investors and professionals alike wondering when this volatility could end. While nobody knows for sure, one thing we always look for at market bottoms are signs of extremes, both from a sentiment and price perspective.\n\n&gt; From an anecdotal sentiment perspective, certainly fears of COVID-19 have reached the masses, with travel plans canceled and announcements of major events called off coming nearly every hour. However, investor survey data shows a similar story with the American Association of Individual Investors (AAII) Investor Sentiment Survey showing the highest percentage of bears since April 2013. In addition, the National Association of Active Investment Managers (NAAIM) Exposure Index, which represents the average exposure to US equity markets by the surveyed investment managers, reached its lowest level since September 2015. Following each of those instances, the S&amp;P 500 rallied more than 13% over the next year.\n\n&gt; Another way of gauging sentiment can be from the internals of the market. While the S&amp;P 500 is now well below its 200-day moving average, that doesn’t mean each stock in the index has moved below its respective 200-day moving average. In fact, regardless of the broad market’s trend, when less than 20% of the individual components of the index are trading below their 200-day moving averages, it is considered an extreme. As shown in the LPL Chart of the Day, Thursday’s sell-off left less 6% of the S&amp;P 500 there, a number last seen in March 2009. “These are truly frightening times,” explained LPL Financial Senior Market Strategist Ryan Detrick. “However, it is important to remember that the signs of panic we are seeing are typically found at or near major market lows.”\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/03/Signs_of_Washout.png?ssl=1))**\n\n*****\n\n# The Fastest Bear Market Ever\n\n&gt; The historic volatility continues, with the Dow Jones Industrial Average officially setting its fastest move from a new all-time high to a bear market (down 20% from the highs) in the 124-year history of the index. It took only 19 days for this to take place, which is far and away the new record.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/03/Bear-market-1-1.png?ssl=1))**\n\n&gt; Not to be outdone, the S&amp;P 500 Index is set to close down 20% from all-time highs today, doing this in only 16 days. Again, as of the time we are writing this blog, the S&amp;P 500 is in bear market territory, but there always could be a chance for a late-day rally.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/03/Bear-market-2.png?ssl=1))**\n\n&gt; “From major sports postponing their seasons, to travel bans to Europe, the economic impact of the coronavirus is growing exponentially with each passing day,” said LPL Financial Senior Market Strategist Ryan Detrick. “Markets are pricing in a potential recession and inevitable second quarter slowdown, but it is all about expectations. Should the virus be contained and the worst-case scenarios not materialize, now could be a nice opportunity for longer-term investors.”\n\n&gt; Last, one of Warren Buffett’s most famous quotes is, “Be fearful when others are greedy and be fearful when others are fearful.” We’ve seen many signs of extreme fear the past few days, but the CNN Fear &amp; Greed Index hitting 1 earlier today is quite a historic level of fear. This proprietary indicator looks at multiple inputs (like put/call ratios, momentum, and volatility), but on a scale of 1-100, this morning’s 1 is the lowest level ever seen, besting the 2 it hit at the lows in December 2018. From a contrarian point of view, this could be quite meaningful.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/03/Bear-market-3.png?ssl=1))**\n\n*****\n\n# Perspectives on Waterfall Declines\n\n&gt; Volatile market action over the several weeks warrants some much needed perspective into the history of these types of waterfall declines. Fortunately, we have this research on hand and have been examining the nature of deep, fast selloffs like we have experience here in early 2020 as well as the nature of the inevitable and often sharp recoveries.\n\n&gt; First of all yes, this time is different – and yet it’s not. The headline causes of each of these historic waterfall declines are all different and yet investor, trader and money manager behavior remains rather similar. Fear has once again exposed the market’s overvaluation and weaknesses. This time it’s the fear of the coronavirus pandemic and price war in the oil market that spills over into the rest of the financial.\n\n&gt; Like the previous occurrences of waterfall declines in the table and graphs below the market reacted to fear and sold off fast and hard. It’s too early to tell if this waterfall decline is over or how fast and far the recovery will be. As we continue to analyze the current situation a thorough review of the history of waterfall declines and their subsequent recoveries should provide some much needed perspective.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/31cca506c45d87ad962ce9c707baf21a/fc7021573b50880b-76/s500x750/0a6588971f599cbbca194b38b62a47c087875238.jpg))**\n\n*****\n\n# Friday 13th, DJIA Attempting to Recover &amp; End Losing Friday Streak\n\n&gt; Friday is a significant day of the week because it is the last day of trading and positions held over the weekend could be at higher risk of an exogenous event or an unanticipated headline. Pages 143 &amp; 144 of the Stock Trader’s Almanac 2020 show the difference in Friday performance during bull and bear markets. Friday’s have been weaker in bear markets.\n\n&gt; However today, on a Friday the 13th of all days, DJIA is fighting to recover some of its losses this week and to end its streak of down Fridays at seven. Down Friday DJIA losing streaks of seven or more, like the current streak, are actually somewhat rare in history. Prior to this year, DJIA has had just six similar or longer down Friday streaks going back to 1950. The last streak of down Fridays was in March and April of 2017. The longest streak lasted nine Fridays beginning on the last Friday of 2000 and lasting into February 2001.\n\n &gt; In the above chart the 30 trading days before and the 60 trading days after the last six DJIA down Friday losing streaks of seven or more have been plotted to display the average performance before and after the last down Friday of the streak. (There are on average 21 trading days in a typical calendar month) Weakness and lower was the trend during the down Friday streak, but once the streak came to an end, DJIA was higher 60 trading days later.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/c8d6237984423d89dc5b20f4a1bf7009/07327bf517318c16-1e/s500x750/13020ac23c0adf1831e35c982c37f1602a236fd1.jpg))**\n\n*****\n\n# Last Stocks Above Their Moving Averages\n\n&gt; The massive declines over the past few weeks have left conditions extremely oversold. As we highlighted in yesterday's Sector Snapshot, breadth has been awful while there is no longer a single stock in the S&amp;P 500 that is overbought (1 or more standard deviations above its 50-DMA). In fact, after yesterday's absolute washout, there is only a small handful of stocks that are above their 50 and 200-DMAs. In regards to the 50-DMA, less than 1% of stocks in the S&amp;P 500 are above this average which is the first time that has happened since 2011. The only time in between that saw a similarly weak reading, although not quite hitting that under 1% requirement was back in December of 2018 when 1.19% of stocks were above their 50-DMA. As for the 200-DMA, only 5.59% are above that level. That is the lowest reading since March of 2009.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/MAs.png))**\n\n&gt; The average stock is now 26.56% below its 50-day and 24.5% below its 200-day. The table below shows those 22 remaining stocks that are still above their 200-DMAs as of yesterday's close and the few that are also below their 50-DMA. Of these, only Regeneron (REGN), Kroger (KR), Digital Realty Trust (DLR), and Gilead Sciences (GILD) are also above their 50-DMAs. The only other stock in the index that is also above its 50-DMA is Cabot Oil and Gas (COG), though it is 11% below its 200-DMA. While these stocks have all held above their long term moving average recently, only GILD and REGN have risen since the index's high on 2/19.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/Above-200-table2.png))**\n\n*****\n\n# Selloff Erases All of US Market Cap Gains Since Election Day 2016\n\n&gt; With the US stock market down nearly 7% yet again today, the total market cap of US companies as measured by the Russell 3,000 has fallen $11.5 trillion in less than a month. On February 19th, total US market cap was just over $35 trillion. It's at $23.8 trillion as of this morning.\n\n&gt; What makes this drop even more noteworthy is that $23.8 trillion was the market cap of US companies on Election Day 2016. At this point in time, all of the market cap gains seen since President Trump's election victory have been wiped out.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/raymktcap.png))**\n\n*****\n\n# Low Rates Send Mortgage Applications Surging\n\n&gt; Coronavirus fears have broadly sent rates lower over the past month. Currently, the national average for a 30-year fixed-rate mortgage stands at 3.68%; just off the low of 3.55% from earlier in the month. With mortgage rates now basically at their lowest levels since late 2016, homeowners have been quickly enticed to jump on these lower rates.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/MRNA.png))**\n\n&gt; Last week, weekly mortgage applications from the Mortgage Bankers Association showed a roughly 15% surge as rates were reaching record lows. In the time since then, the Fed's 50 bps cut came into effect and yields fell even further which led mortgage applications this week to surge 55.4%. That is the highest week over week increase in mortgage applications since November of 2008 when they had risen 112.1%. Outside of that period, we've only seen larger weekly increases a few other times since 1990.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/MA-1.png))**\n\n&gt; The spike was driven largely by refinancing applications which rose 78.6% week-over-week. As with the composite, that was the biggest weekly jump in refi applications since the housing bubble. Prior to that, once again you would need to go back to 2001 or the 1990s to find larger weekly increases in mortgage refinance applications.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/MA-ref.png))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending March 13th, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=corMYre6O0E))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 3.15.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED!)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$NIO** \n&gt; * **$HQY** \n&gt; * **$FCEL** \n&gt; * **$MOMO** \n&gt; * **$FDX** \n&gt; * **$CRWD** \n&gt; * **$HUYA** \n&gt; * **$NBEV** \n&gt; * **$BE** \n&gt; * **$MDB** \n&gt; * **$BZUN** \n&gt; * **$BILI** \n&gt; * **$YY** \n&gt; * **$COUP** \n&gt; * **$MUX** \n&gt; * **$FIVE** \n&gt; * **$TME** \n&gt; * **$MIK** \n&gt; * **$CVSI** \n&gt; * **$ACRX** \n&gt; * **$ACN** \n&gt; * **$GES** \n&gt; * **$WPRT** \n&gt; * **$OLLI** \n&gt; * **$GIS **\n&gt; * **$CPRX** \n&gt; * **$PLCE** \n&gt; * **$DRI** \n&gt; * **$TLRD** \n&gt; * **$ZTO** \n&gt; * **$BAX** \n&gt; * **$LEN** \n&gt; * **$DLTH** \n&gt; * **$HDS** \n&gt; * **$CTAS** \n&gt; * **$SMAR** \n&gt; * **$WSM** \n&gt; * **$TCOM** \n&gt; * **$HIBB** \n&gt; * **$REI** \n&gt; * **$DBI** \n&gt; * **$CTRA** \n&gt; * **$GPL** \n&gt; * **$CMC**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/9nZfl7V.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/EKAkJgU.png))**\n###### **([CLICK HERE FOR  THE MOST NOTABLE EARNINGS RELEASES BEFORE MONDAY'S OPEN!](https://i.imgur.com/631cGTg.jpg))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 3.16.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/FLCjERW.png))\n\n\n&gt; # ***Monday 3.16.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/GCK6dns.png))\n\n\n*****\n\n&gt; # ***Tuesday 3.17.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/J7uVG2b.png))\n\n&gt; # ***Tuesday 3.17.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ADUyE5E.png))\n\n*****\n\n&gt; # ***Wednesday 3.18.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/q2AM8aO.png))\n\n&gt; # ***Wednesday 3.18.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/sXXUKYj.png))\n\n*****\n\n&gt; # ***Thursday 3.19.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ZISY7gz.png))\n\n&gt; # ***Thursday 3.19.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/pgdAKJu.png))\n\n*****\n\n&gt; # ***Friday 3.20.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n&gt; # ***Friday 3.20.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# NIO Inc. $3.11\n&gt; **NIO Inc. (NIO)** is confirmed to report earnings at approximately 6:40 AM ET on Wednesday, March 18, 2020. The consensus estimate is for a loss of $0.37 per share on revenue of $412.45 million and the Earnings Whisper ® number is ($0.34) per share. Investor sentiment going into the company's earnings release has 46% expecting an earnings beat The company's guidance was for revenue of approximately $393.00 million. Consensus estimates are for year-over-year earnings growth of 24.49% with revenue decreasing by 17.46%. Short interest has decreased by 21.0% since the company's last earnings release while the stock has drifted higher by 6.5% from its open following the earnings release to be 5.8% above its 200 day moving average of $2.94. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, March 13, 2020 there was some notable buying of 1,321 contracts of the $2.00 put expiring on Friday, April 3, 2020. Option traders are pricing in a 21.9% move on earnings and the stock has averaged a 20.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NIO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# HealthEquity, Inc. $53.99\n&gt; **HealthEquity, Inc. (HQY)** is confirmed to report earnings at approximately 4:00 PM ET on Monday, March 16, 2020. The consensus earnings estimate is $0.34 per share on revenue of $198.49 million and the Earnings Whisper ® number is $0.37 per share. Investor sentiment going into the company's earnings release has 73% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 25.93% with revenue increasing by 161.94%. Short interest has decreased by 21.5% since the company's last earnings release while the stock has drifted lower by 21.4% from its open following the earnings release to be 18.3% below its 200 day moving average of $66.07. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, March 4, 2020 there was some notable buying of 551 contracts of the $65.00 put expiring on Friday, September 18, 2020. Option traders are pricing in a 19.4% move on earnings and the stock has averaged a 4.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HQY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# FuelCell Energy, Inc. $1.15\n&gt; **FuelCell Energy, Inc. (FCEL)** is confirmed to report earnings at approximately 7:00 AM ET on Monday, March 16, 2020. The consensus estimate is for a loss of $0.09 per share on revenue of $9.80 million and the Earnings Whisper ® number is ($0.10) per share. Investor sentiment going into the company's earnings release has 49% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 50.00% with revenue decreasing by 44.89%. Short interest has increased by 20.7% since the company's last earnings release while the stock has drifted lower by 46.8% from its open following the earnings release to be 23.2% above its 200 day moving average of $0.93. Overall earnings estimates have been revised lower since the company's last earnings release. The stock has averaged a 30.5% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FCEL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Momo Inc. $23.57\n&gt; **Momo Inc. (MOMO)** is confirmed to report earnings at approximately 3:15 AM ET on Thursday, March 19, 2020. The consensus earnings estimate is $0.74 per share on revenue of $654.51 million and the Earnings Whisper ® number is $0.77 per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat The company's guidance was for revenue of $642.00 million to $656.00 million. Consensus estimates are for year-over-year earnings growth of 32.14% with revenue increasing by 17.07%. Short interest has increased by 54.1% since the company's last earnings release while the stock has drifted lower by 37.4% from its open following the earnings release to be 31.0% below its 200 day moving average of $34.17. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, March 10, 2020 there was some notable buying of 1,063 contracts of the $27.00 call expiring on Friday, April 17, 2020. Option traders are pricing in a 18.0% move on earnings and the stock has averaged a 8.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MOMO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# CrowdStrike, Inc. $39.55\n&gt; **CrowdStrike, Inc. (CRWD)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, March 19, 2020. The consensus estimate is for a loss of $0.08 per share on revenue of $137.67 million and the Earnings Whisper ® number is ($0.06) per share. Investor sentiment going into the company's earnings release has 82% expecting an earnings beat The company's guidance was for a loss of $0.09 to $0.08 per share on revenue of $136.00 million to $139.00 million. Short interest has decreased by 52.2% since the company's last earnings release while the stock has drifted lower by 26.8% from its open following the earnings release. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 10.4% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CRWD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# FedEx Corp. $106.63\n&gt; **FedEx Corp. (FDX)** is confirmed to report earnings at approximately 4:00 PM ET on Tuesday, March 17, 2020. The consensus earnings estimate is $1.69 per share on revenue of $17.19 billion and the Earnings Whisper ® number is $1.67 per share. Investor sentiment going into the company's earnings release has 23% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 44.22% with revenue increasing by 1.06%. Short interest has increased by 16.0% since the company's last earnings release while the stock has drifted lower by 29.6% from its open following the earnings release to be 31.2% below its 200 day moving average of $154.91. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, March 10, 2020 there was some notable buying of 1,131 contracts of the $85.00 put expiring on Friday, April 17, 2020. Option traders are pricing in a 17.4% move on earnings and the stock has averaged a 7.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FDX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# HUYA Inc. $15.40\n&gt; **HUYA Inc. (HUYA)** is confirmed to report earnings at approximately 6:00 PM ET on Monday, March 16, 2020. The consensus earnings estimate is $0.13 per share on revenue of $339.95 million and the Earnings Whisper ® number is $0.15 per share. Investor sentiment going into the company's earnings release has 80% expecting an earnings beat The company's guidance was for revenue of $334.00 million to $345.00 million. Consensus estimates are for year-over-year earnings growth of 85.71% with revenue increasing by 55.31%. Short interest has increased by 65.2% since the company's last earnings release while the stock has drifted lower by 38.4% from its open following the earnings release to be 28.9% below its 200 day moving average of $21.66. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, February 21, 2020 there was some notable buying of 774 contracts of the $18.00 put expiring on Friday, July 17, 2020. Option traders are pricing in a 19.3% move on earnings and the stock has averaged a 5.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HUYA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# New Age Beverages Corporation $1.46\n&gt; **New Age Beverages Corporation (NBEV)** is confirmed to report earnings at approximately 6:00 AM ET on Monday, March 16, 2020. The consensus estimate is for a loss of $0.08 per share on revenue of $65.80 million and the Earnings Whisper ® number is ($0.10) per share. Investor sentiment going into the company's earnings release has 53% expecting an earnings beat. Short interest has decreased by 15.8% since the company's last earnings release while the stock has drifted lower by 35.7% from its open following the earnings release to be 49.2% below its 200 day moving average of $2.87. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, March 4, 2020 there was some notable buying of 2,000 contracts of the $1.50 call expiring on Friday, June 19, 2020. The stock has averaged a 5.6% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NBEV&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Bloom Energy Corporation $6.12\n&gt; **Bloom Energy Corporation (BE)** is confirmed to report earnings after the market closes on Monday, March 16, 2020. Investor sentiment going into the company's earnings release has 64% expecting an earnings beat. Short interest has decreased by 5.4% since the company's last earnings release while the stock has drifted higher by 36.9% from its open following the earnings release to be 21.5% below its 200 day moving average of $7.80. On Tuesday, March 10, 2020 there was some notable buying of 1,772 contracts of the $9.00 call expiring on Friday, March 20, 2020. The stock has averaged a 19.3% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# MongoDB, Inc. $115.17\n&gt; **MongoDB, Inc. (MDB)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, March 17, 2020. The consensus estimate is for a loss of $0.28 per share on revenue of $110.38 million and the Earnings Whisper ® number is ($0.26) per share. Investor sentiment going into the company's earnings release has 73% expecting an earnings beat The company's guidance was for a loss of $0.29 to $0.27 per share on revenue of $109.00 million to $111.00 million. Consensus estimates are for earnings to decline year-over-year by 55.56% with revenue increasing by 29.12%. Short interest has decreased by 6.3% since the company's last earnings release while the stock has drifted lower by 20.4% from its open following the earnings release to be 19.6% below its 200 day moving average of $143.28. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 18.9% move on earnings and the stock has averaged a 8.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MDB&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/StockMarket.",
        "subreddit": "StockMarket",
        "title": "Wall Street Week Ahead for the trading week beginning March 16th, 2020",
        "url": "https://www.reddit.com/r/StockMarket/comments/fikq7c/wall_street_week_ahead_for_the_trading_week/",
        "created": 1584231062.0
    },
    {
        "author": "HITLERMAHJONG",
        "created_utc": 1583349746,
        "id": "fdi5yj",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": " Stock: [Splunk](https://www.google.com/url?sa=i&amp;url=https%3A%2F%2Faws.amazon.com%2Fmarketplace%2Fseller-profile%3Fid%3D6a766d61-5a6a-4c97-83f4-8bfe02b74914&amp;psig=AOvVaw1-7xk35I1P7BNaNAo8EGdB&amp;ust=1583436087951000&amp;source=images&amp;cd=vfe&amp;ved=0CAIQjRxqFwoTCLjmnKDFgegCFQAAAAAdAAAAABAD)**(SPLK) - 152.18$**\n\nDirection: **Mildly Bullish**\n\n**Price Target:** **160$**\n\n**Type: Put Credit Spread**\n\n**Fundamental:** Splunk is a growth company simply for its 16 quarters of consecutive double digit growth. Splunk sports a very high, but not astronomical PE, with decent profitability and a consistent record of beating earnings guidance. The recent acquisition (6 month) of SignalFx gives them further footprint in the booming cloud computing sector. An additional note is an announcement of a DoD contract with some huge numbers on it. While I cannot explain its actual effects, I do believe this is a positive for Splunk.\n\n**Technical**: Priced below 20, 50 day averages and below 200 day moving average. MACD shows bullish convergence. RSI shows around 48, coming up from oversold. Options sentiments are very bullish in volume and bullish open interest. Implied movement is 9.1% or about 13.85$ Short interest is at 4.6%, with 5.6 days to cover. One thing to note, the ATM straddle is actually getting cheaper, with a tiny IV contraction. While not a strong signal, I believe this is bullish for Splunk, as contracting IV is not a normality in current macro environments. The skew to call side reinforces this idea.\n\n**Sentimental**: Splunk has been beating and raising for more than 4 years. This track record of growth and performance weights positively. Analyst sentiments are bullish with a higher price target than SPLK’s current price. Numerous partnerships with kings like AWS, CISCO, Accenture give Splunk a competitive moat. While not directly affected by the coronavirus, Splunk will need a massive win to command a big upward move. The main wildcard is the DoD deal updates, which can be a massive boost. Primary bear case is missing estimates and guiding lower.\n\n**Robinhood (3/4/2020) Less Fucky. Not using. Moving to Schwab this weekend.**\n\n**Put Credit Spread 3/13**\n\n**Buy 135 Put**\n\n**Sell 140 Put**\n\n**Everyone is into big data, cloud and becoming big brother without looking like big brother. Splunk is currently the leader in this sector and has minimal effects from current market fears**",
        "subreddit": "options",
        "title": "Splunk (SPLK) 3/4/2020 AMC - Splunk for everyone",
        "url": "https://www.reddit.com/r/options/comments/fdi5yj/splunk_splk_342020_amc_splunk_for_everyone/",
        "created": 1583378546.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1584202687,
        "id": "fiku8v",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Good Saturday afternoon to all of you here on r/smallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning March 16th, 2020.\n\n# **Stocks are expected to see more wild swings, even if Fed makes big policy move  - [(Source)](https://www.cnbc.com/2020/03/13/stocks-are-expected-to-see-more-wild-swings-even-if-fed-makes-big-policy-move.html)**\n*****\n&gt; Now that stocks have entered a bear market, more wild volatility is expected in the week ahead as investors await a big policy move by the Federal Reserve.\n*****\n&gt; The Federal Reserve meets Tuesday and Wednesday and is expected by some economists to take its benchmark federal funds target range back to zero, as the economy looks more and more like it could fall into a recession, due to the impact of the coronavirus.\n*****\n&gt; In the past week, the market was sharply lower but swung wildly in both directions, including the stunning 10% decline in the Dow Thursday, the worst one-day drop since the 1987 market crash followed by Friday’s 9.3% gain, the best day in more than 11 years.\n*****\n&gt; The S&amp;P 500 ended up 9.3% Friday at 2,711, its best day since Oct. 28, 2008. The S&amp;P is now 20.2% below its February high.\n*****\n&gt; Strategists say the market purge is not over, though it could be closer to a bottom, with some expecting the S&amp;P 500 to fall through 2,400 before it finds a floor.\n*****\n&gt; “You could say we’re pricing a garden variety recession,” said Lori Calvasina, chief U.S. equities strategist at RBC. “We come up with a range of 2,300 to 2,600 as recession territory.” She said the average drop during a recession, since the 1930s, was 32%. The S&amp;P had been as much as 29% off its Feb. 19 high.\n*****\n&gt; “If [S&amp;P] went below 2,300, it would be telling you the market is pricing in something worse than a recession, In the financial crisis we lost 57% and in the tech bubble, we lost 49%,” said Calvasina.\n*****\n&gt; The S&amp;P 500 was down 8.9% for the week, its worst loss since the week of Feb. 28.\n*****\n&gt; “I think we needed to get through this week, in particular — the one where the country went into shut down and now get the second go around of policy response. If they really do bring out the bazookas we should be darn close” to the bottom, said Barry Knapp, Ironsides Macroeconomics director of research.\n*****\n&gt; But strategists also point out that the coronavirus is unpredictable and it is hard to say when it will peak, even though many economists expect a bounce back in economic growth by the fourth quarter.\n*****\n&gt; President Donald Trump declared a state of emergency Friday, which allows him to tap federal agencies to provide emergency funds and other responses to the crisis. The president also announced the government would buy oil to fill the Strategic Petroleum Reserves and that 1.4 million test kits would be available in the next week.\n*****\n&gt; Markets will also be looking for further action, which the Trump administration says could include targeted financial aid to industries that are hard hit, like airlines.\n*****\n&gt; As communities around the country attempt to stop the spread of the virus, the potential hit to the economy grows. Companies have told workers to work from home, universities are shutting campuses, a handful of states closed public schools, and major sporting and other events have been canceled.\n*****\n&gt; “If it indeed is declared a recession, it will really only be a three-month drop in activity,” said Knapp. “In 2008, the household sector had the highest debt levels it ever had, and the household sector was in no position to respond to stimulus. This is quite different.”\n*****\n&gt; “We see where are are today is pricing in a recession. It went from a growth scare down to recession territory,” said Calvasina. She said the market is not ready to move higher yet. “I think something else we’ve got to see in addition to extreme panic ratings from the sentiment indicators, we do need to see the news flow get better on the virus.”\n*****\n&gt; Investors will continue to look for more action from Washington, and in the coming week it will also be the Fed’s policy response that could drive the market.\n*****\n&gt; “In light of the continued growth in coronavirus cases in the US and globally, the sharp further tightening in financial conditions, and rising risks to the economic outlook, we now expect the FOMC to cut the funds rate 100bp on March 18, a faster return to the crisis-era 0-0.25% rate than under our previous call for two 50bp steps in March and April,” Goldman economists wrote.\n*****\n&gt; The Fed on Thursday announced a significant increase in funds available for its repo operations, to provide liquidity for the short term funding markets. It also said it would purchase a broad range of Treasury securities, across maturities, with the $60 billion it currently uses to buy Treasury bills on a monthly basis.\n*****\n&gt; Economists say the Fed could announce other policy moves, like purchases of mortgage securities. Some expect it to return to a “patient” stance, showing a willingness to keep rates extremely low for a long time.\n*****\n&gt; Analysts have been watching the corporate bond market, where spreads blew out dramatically in the past week, particularly in high yield. Calvasina said she is not yet concerned.\n*****\n&gt; “We’ve got problems in energy. We have problems in some hospitality related industries. There are pockets of stress, but for me, when I look across most S&amp;P companies’ balance sheets are in really good shape,” Calvasina said. “I don’t think this is a prolonged sort of downturn.”\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/iG7ENVB.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/4gwPTzC.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/h9DkOZJ.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/4m2QVZH.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/akOOH97.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/slVwGv2.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/ASyHg6a.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/rbgSrGQ.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/9nZfl7V.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/eS99ijc.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/tEs62Hh.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/kMQTBj6.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/toentZ2.png))**\n###### **([CLICK HERE FOR THE CHART LINK #4!](https://i.imgur.com/ozn837y.png))**\n\n*****\n\n# Signs Of A Washout?\n\n&gt; The S&amp;P 500 Index’s historic slide continued yesterday, culminating in nearly a 10% loss for the day, and leaving the benchmark index officially in bear market territory, just 16 trading days after setting a record high on February 19. In addition, the S&amp;P 500 has now moved more than 4% each day this week, leaving investors and professionals alike wondering when this volatility could end. While nobody knows for sure, one thing we always look for at market bottoms are signs of extremes, both from a sentiment and price perspective.\n\n&gt; From an anecdotal sentiment perspective, certainly fears of COVID-19 have reached the masses, with travel plans canceled and announcements of major events called off coming nearly every hour. However, investor survey data shows a similar story with the American Association of Individual Investors (AAII) Investor Sentiment Survey showing the highest percentage of bears since April 2013. In addition, the National Association of Active Investment Managers (NAAIM) Exposure Index, which represents the average exposure to US equity markets by the surveyed investment managers, reached its lowest level since September 2015. Following each of those instances, the S&amp;P 500 rallied more than 13% over the next year.\n\n&gt; Another way of gauging sentiment can be from the internals of the market. While the S&amp;P 500 is now well below its 200-day moving average, that doesn’t mean each stock in the index has moved below its respective 200-day moving average. In fact, regardless of the broad market’s trend, when less than 20% of the individual components of the index are trading below their 200-day moving averages, it is considered an extreme. As shown in the LPL Chart of the Day, Thursday’s sell-off left less 6% of the S&amp;P 500 there, a number last seen in March 2009. “These are truly frightening times,” explained LPL Financial Senior Market Strategist Ryan Detrick. “However, it is important to remember that the signs of panic we are seeing are typically found at or near major market lows.”\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/03/Signs_of_Washout.png?ssl=1))**\n\n*****\n\n# The Fastest Bear Market Ever\n\n&gt; The historic volatility continues, with the Dow Jones Industrial Average officially setting its fastest move from a new all-time high to a bear market (down 20% from the highs) in the 124-year history of the index. It took only 19 days for this to take place, which is far and away the new record.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/03/Bear-market-1-1.png?ssl=1))**\n\n&gt; Not to be outdone, the S&amp;P 500 Index is set to close down 20% from all-time highs today, doing this in only 16 days. Again, as of the time we are writing this blog, the S&amp;P 500 is in bear market territory, but there always could be a chance for a late-day rally.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/03/Bear-market-2.png?ssl=1))**\n\n&gt; “From major sports postponing their seasons, to travel bans to Europe, the economic impact of the coronavirus is growing exponentially with each passing day,” said LPL Financial Senior Market Strategist Ryan Detrick. “Markets are pricing in a potential recession and inevitable second quarter slowdown, but it is all about expectations. Should the virus be contained and the worst-case scenarios not materialize, now could be a nice opportunity for longer-term investors.”\n\n&gt; Last, one of Warren Buffett’s most famous quotes is, “Be fearful when others are greedy and be fearful when others are fearful.” We’ve seen many signs of extreme fear the past few days, but the CNN Fear &amp; Greed Index hitting 1 earlier today is quite a historic level of fear. This proprietary indicator looks at multiple inputs (like put/call ratios, momentum, and volatility), but on a scale of 1-100, this morning’s 1 is the lowest level ever seen, besting the 2 it hit at the lows in December 2018. From a contrarian point of view, this could be quite meaningful.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/03/Bear-market-3.png?ssl=1))**\n\n*****\n\n# Perspectives on Waterfall Declines\n\n&gt; Volatile market action over the several weeks warrants some much needed perspective into the history of these types of waterfall declines. Fortunately, we have this research on hand and have been examining the nature of deep, fast selloffs like we have experience here in early 2020 as well as the nature of the inevitable and often sharp recoveries.\n\n&gt; First of all yes, this time is different – and yet it’s not. The headline causes of each of these historic waterfall declines are all different and yet investor, trader and money manager behavior remains rather similar. Fear has once again exposed the market’s overvaluation and weaknesses. This time it’s the fear of the coronavirus pandemic and price war in the oil market that spills over into the rest of the financial.\n\n&gt; Like the previous occurrences of waterfall declines in the table and graphs below the market reacted to fear and sold off fast and hard. It’s too early to tell if this waterfall decline is over or how fast and far the recovery will be. As we continue to analyze the current situation a thorough review of the history of waterfall declines and their subsequent recoveries should provide some much needed perspective.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/31cca506c45d87ad962ce9c707baf21a/fc7021573b50880b-76/s500x750/0a6588971f599cbbca194b38b62a47c087875238.jpg))**\n\n*****\n\n# Friday 13th, DJIA Attempting to Recover &amp; End Losing Friday Streak\n\n&gt; Friday is a significant day of the week because it is the last day of trading and positions held over the weekend could be at higher risk of an exogenous event or an unanticipated headline. Pages 143 &amp; 144 of the Stock Trader’s Almanac 2020 show the difference in Friday performance during bull and bear markets. Friday’s have been weaker in bear markets.\n\n&gt; However today, on a Friday the 13th of all days, DJIA is fighting to recover some of its losses this week and to end its streak of down Fridays at seven. Down Friday DJIA losing streaks of seven or more, like the current streak, are actually somewhat rare in history. Prior to this year, DJIA has had just six similar or longer down Friday streaks going back to 1950. The last streak of down Fridays was in March and April of 2017. The longest streak lasted nine Fridays beginning on the last Friday of 2000 and lasting into February 2001.\n\n &gt; In the above chart the 30 trading days before and the 60 trading days after the last six DJIA down Friday losing streaks of seven or more have been plotted to display the average performance before and after the last down Friday of the streak. (There are on average 21 trading days in a typical calendar month) Weakness and lower was the trend during the down Friday streak, but once the streak came to an end, DJIA was higher 60 trading days later.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/c8d6237984423d89dc5b20f4a1bf7009/07327bf517318c16-1e/s500x750/13020ac23c0adf1831e35c982c37f1602a236fd1.jpg))**\n\n*****\n\n# Last Stocks Above Their Moving Averages\n\n&gt; The massive declines over the past few weeks have left conditions extremely oversold. As we highlighted in yesterday's Sector Snapshot, breadth has been awful while there is no longer a single stock in the S&amp;P 500 that is overbought (1 or more standard deviations above its 50-DMA). In fact, after yesterday's absolute washout, there is only a small handful of stocks that are above their 50 and 200-DMAs. In regards to the 50-DMA, less than 1% of stocks in the S&amp;P 500 are above this average which is the first time that has happened since 2011. The only time in between that saw a similarly weak reading, although not quite hitting that under 1% requirement was back in December of 2018 when 1.19% of stocks were above their 50-DMA. As for the 200-DMA, only 5.59% are above that level. That is the lowest reading since March of 2009.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/MAs.png))**\n\n&gt; The average stock is now 26.56% below its 50-day and 24.5% below its 200-day. The table below shows those 22 remaining stocks that are still above their 200-DMAs as of yesterday's close and the few that are also below their 50-DMA. Of these, only Regeneron (REGN), Kroger (KR), Digital Realty Trust (DLR), and Gilead Sciences (GILD) are also above their 50-DMAs. The only other stock in the index that is also above its 50-DMA is Cabot Oil and Gas (COG), though it is 11% below its 200-DMA. While these stocks have all held above their long term moving average recently, only GILD and REGN have risen since the index's high on 2/19.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/Above-200-table2.png))**\n\n*****\n\n# Selloff Erases All of US Market Cap Gains Since Election Day 2016\n\n&gt; With the US stock market down nearly 7% yet again today, the total market cap of US companies as measured by the Russell 3,000 has fallen $11.5 trillion in less than a month. On February 19th, total US market cap was just over $35 trillion. It's at $23.8 trillion as of this morning.\n\n&gt; What makes this drop even more noteworthy is that $23.8 trillion was the market cap of US companies on Election Day 2016. At this point in time, all of the market cap gains seen since President Trump's election victory have been wiped out.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/raymktcap.png))**\n\n*****\n\n# Low Rates Send Mortgage Applications Surging\n\n&gt; Coronavirus fears have broadly sent rates lower over the past month. Currently, the national average for a 30-year fixed-rate mortgage stands at 3.68%; just off the low of 3.55% from earlier in the month. With mortgage rates now basically at their lowest levels since late 2016, homeowners have been quickly enticed to jump on these lower rates.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/MRNA.png))**\n\n&gt; Last week, weekly mortgage applications from the Mortgage Bankers Association showed a roughly 15% surge as rates were reaching record lows. In the time since then, the Fed's 50 bps cut came into effect and yields fell even further which led mortgage applications this week to surge 55.4%. That is the highest week over week increase in mortgage applications since November of 2008 when they had risen 112.1%. Outside of that period, we've only seen larger weekly increases a few other times since 1990.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/MA-1.png))**\n\n&gt; The spike was driven largely by refinancing applications which rose 78.6% week-over-week. As with the composite, that was the biggest weekly jump in refi applications since the housing bubble. Prior to that, once again you would need to go back to 2001 or the 1990s to find larger weekly increases in mortgage refinance applications.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/MA-ref.png))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$NIO** \n&gt; * **$HQY** \n&gt; * **$FCEL** \n&gt; * **$MOMO** \n&gt; * **$FDX** \n&gt; * **$CRWD** \n&gt; * **$HUYA** \n&gt; * **$NBEV** \n&gt; * **$BE** \n&gt; * **$MDB** \n&gt; * **$BZUN** \n&gt; * **$BILI** \n&gt; * **$YY** \n&gt; * **$COUP** \n&gt; * **$MUX** \n&gt; * **$FIVE** \n&gt; * **$TME** \n&gt; * **$MIK** \n&gt; * **$CVSI** \n&gt; * **$ACRX** \n&gt; * **$ACN** \n&gt; * **$GES** \n&gt; * **$WPRT** \n&gt; * **$OLLI** \n&gt; * **$GIS**\n&gt; * **$CPRX** \n&gt; * **$PLCE** \n&gt; * **$DRI** \n&gt; * **$TLRD** \n&gt; * **$ZTO** \n&gt; * **$BAX** \n&gt; * **$LEN** \n&gt; * **$DLTH** \n&gt; * **$HDS** \n&gt; * **$CTAS** \n&gt; * **$SMAR** \n&gt; * **$WSM** \n&gt; * **$TCOM** \n&gt; * **$HIBB** \n&gt; * **$REI** \n&gt; * **$DBI** \n&gt; * **$CTRA** \n&gt; * **$GPL** \n&gt; * **$CMC**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/9nZfl7V.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/EKAkJgU.png))**\n###### **([CLICK HERE FOR  THE MOST NOTABLE EARNINGS RELEASES BEFORE MONDAY'S OPEN!](https://i.imgur.com/631cGTg.jpg))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 3.16.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/FLCjERW.png))\n\n\n&gt; # ***Monday 3.16.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/GCK6dns.png))\n\n\n*****\n\n&gt; # ***Tuesday 3.17.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/J7uVG2b.png))\n\n&gt; # ***Tuesday 3.17.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ADUyE5E.png))\n\n*****\n\n&gt; # ***Wednesday 3.18.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/q2AM8aO.png))\n\n&gt; # ***Wednesday 3.18.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/sXXUKYj.png))\n\n*****\n\n&gt; # ***Thursday 3.19.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ZISY7gz.png))\n\n&gt; # ***Thursday 3.19.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/pgdAKJu.png))\n\n*****\n\n&gt; # ***Friday 3.20.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n&gt; # ***Friday 3.20.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# NIO Inc. $3.11\n&gt; **NIO Inc. (NIO)** is confirmed to report earnings at approximately 6:40 AM ET on Wednesday, March 18, 2020. The consensus estimate is for a loss of $0.37 per share on revenue of $412.45 million and the Earnings Whisper ® number is ($0.34) per share. Investor sentiment going into the company's earnings release has 46% expecting an earnings beat The company's guidance was for revenue of approximately $393.00 million. Consensus estimates are for year-over-year earnings growth of 24.49% with revenue decreasing by 17.46%. Short interest has decreased by 21.0% since the company's last earnings release while the stock has drifted higher by 6.5% from its open following the earnings release to be 5.8% above its 200 day moving average of $2.94. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, March 13, 2020 there was some notable buying of 1,321 contracts of the $2.00 put expiring on Friday, April 3, 2020. Option traders are pricing in a 21.9% move on earnings and the stock has averaged a 20.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NIO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# HealthEquity, Inc. $53.99\n&gt; **HealthEquity, Inc. (HQY)** is confirmed to report earnings at approximately 4:00 PM ET on Monday, March 16, 2020. The consensus earnings estimate is $0.34 per share on revenue of $198.49 million and the Earnings Whisper ® number is $0.37 per share. Investor sentiment going into the company's earnings release has 73% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 25.93% with revenue increasing by 161.94%. Short interest has decreased by 21.5% since the company's last earnings release while the stock has drifted lower by 21.4% from its open following the earnings release to be 18.3% below its 200 day moving average of $66.07. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, March 4, 2020 there was some notable buying of 551 contracts of the $65.00 put expiring on Friday, September 18, 2020. Option traders are pricing in a 19.4% move on earnings and the stock has averaged a 4.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HQY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# FuelCell Energy, Inc. $1.15\n&gt; **FuelCell Energy, Inc. (FCEL)** is confirmed to report earnings at approximately 7:00 AM ET on Monday, March 16, 2020. The consensus estimate is for a loss of $0.09 per share on revenue of $9.80 million and the Earnings Whisper ® number is ($0.10) per share. Investor sentiment going into the company's earnings release has 49% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 50.00% with revenue decreasing by 44.89%. Short interest has increased by 20.7% since the company's last earnings release while the stock has drifted lower by 46.8% from its open following the earnings release to be 23.2% above its 200 day moving average of $0.93. Overall earnings estimates have been revised lower since the company's last earnings release. The stock has averaged a 30.5% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FCEL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Momo Inc. $23.57\n&gt; **Momo Inc. (MOMO)** is confirmed to report earnings at approximately 3:15 AM ET on Thursday, March 19, 2020. The consensus earnings estimate is $0.74 per share on revenue of $654.51 million and the Earnings Whisper ® number is $0.77 per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat The company's guidance was for revenue of $642.00 million to $656.00 million. Consensus estimates are for year-over-year earnings growth of 32.14% with revenue increasing by 17.07%. Short interest has increased by 54.1% since the company's last earnings release while the stock has drifted lower by 37.4% from its open following the earnings release to be 31.0% below its 200 day moving average of $34.17. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, March 10, 2020 there was some notable buying of 1,063 contracts of the $27.00 call expiring on Friday, April 17, 2020. Option traders are pricing in a 18.0% move on earnings and the stock has averaged a 8.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MOMO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# CrowdStrike, Inc. $39.55\n&gt; **CrowdStrike, Inc. (CRWD)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, March 19, 2020. The consensus estimate is for a loss of $0.08 per share on revenue of $137.67 million and the Earnings Whisper ® number is ($0.06) per share. Investor sentiment going into the company's earnings release has 82% expecting an earnings beat The company's guidance was for a loss of $0.09 to $0.08 per share on revenue of $136.00 million to $139.00 million. Short interest has decreased by 52.2% since the company's last earnings release while the stock has drifted lower by 26.8% from its open following the earnings release. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 10.4% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CRWD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# FedEx Corp. $106.63\n&gt; **FedEx Corp. (FDX)** is confirmed to report earnings at approximately 4:00 PM ET on Tuesday, March 17, 2020. The consensus earnings estimate is $1.69 per share on revenue of $17.19 billion and the Earnings Whisper ® number is $1.67 per share. Investor sentiment going into the company's earnings release has 23% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 44.22% with revenue increasing by 1.06%. Short interest has increased by 16.0% since the company's last earnings release while the stock has drifted lower by 29.6% from its open following the earnings release to be 31.2% below its 200 day moving average of $154.91. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, March 10, 2020 there was some notable buying of 1,131 contracts of the $85.00 put expiring on Friday, April 17, 2020. Option traders are pricing in a 17.4% move on earnings and the stock has averaged a 7.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FDX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# HUYA Inc. $15.40\n&gt; **HUYA Inc. (HUYA)** is confirmed to report earnings at approximately 6:00 PM ET on Monday, March 16, 2020. The consensus earnings estimate is $0.13 per share on revenue of $339.95 million and the Earnings Whisper ® number is $0.15 per share. Investor sentiment going into the company's earnings release has 80% expecting an earnings beat The company's guidance was for revenue of $334.00 million to $345.00 million. Consensus estimates are for year-over-year earnings growth of 85.71% with revenue increasing by 55.31%. Short interest has increased by 65.2% since the company's last earnings release while the stock has drifted lower by 38.4% from its open following the earnings release to be 28.9% below its 200 day moving average of $21.66. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, February 21, 2020 there was some notable buying of 774 contracts of the $18.00 put expiring on Friday, July 17, 2020. Option traders are pricing in a 19.3% move on earnings and the stock has averaged a 5.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HUYA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# New Age Beverages Corporation $1.46\n&gt; **New Age Beverages Corporation (NBEV)** is confirmed to report earnings at approximately 6:00 AM ET on Monday, March 16, 2020. The consensus estimate is for a loss of $0.08 per share on revenue of $65.80 million and the Earnings Whisper ® number is ($0.10) per share. Investor sentiment going into the company's earnings release has 53% expecting an earnings beat. Short interest has decreased by 15.8% since the company's last earnings release while the stock has drifted lower by 35.7% from its open following the earnings release to be 49.2% below its 200 day moving average of $2.87. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, March 4, 2020 there was some notable buying of 2,000 contracts of the $1.50 call expiring on Friday, June 19, 2020. The stock has averaged a 5.6% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NBEV&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Bloom Energy Corporation $6.12\n&gt; **Bloom Energy Corporation (BE)** is confirmed to report earnings after the market closes on Monday, March 16, 2020. Investor sentiment going into the company's earnings release has 64% expecting an earnings beat. Short interest has decreased by 5.4% since the company's last earnings release while the stock has drifted higher by 36.9% from its open following the earnings release to be 21.5% below its 200 day moving average of $7.80. On Tuesday, March 10, 2020 there was some notable buying of 1,772 contracts of the $9.00 call expiring on Friday, March 20, 2020. The stock has averaged a 19.3% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# MongoDB, Inc. $115.17\n&gt; **MongoDB, Inc. (MDB)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, March 17, 2020. The consensus estimate is for a loss of $0.28 per share on revenue of $110.38 million and the Earnings Whisper ® number is ($0.26) per share. Investor sentiment going into the company's earnings release has 73% expecting an earnings beat The company's guidance was for a loss of $0.29 to $0.27 per share on revenue of $109.00 million to $111.00 million. Consensus estimates are for earnings to decline year-over-year by 55.56% with revenue increasing by 29.12%. Short interest has decreased by 6.3% since the company's last earnings release while the stock has drifted lower by 20.4% from its open following the earnings release to be 19.6% below its 200 day moving average of $143.28. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 18.9% move on earnings and the stock has averaged a 8.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MDB&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/smallstreetbets.",
        "subreddit": "smallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning March 16th, 2020",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/fiku8v/wall_street_week_ahead_for_the_trading_week/",
        "created": 1584231487.0
    }
]