[
    {
        "author": "fastfrequency",
        "created_utc": 1605510551,
        "id": "jv2iu7",
        "num_comments": 137,
        "num_crossposts": 0,
        "selftext": "\"Masayoshi Son's Softbank Group reported Sept. end total portfolio value of $12.92B sharply down from $17.52B at the end of the June quarter.\n\nSoftbank has reduced its holding to just 4 companies from 26 companies at the end of Q2.\n\nNotable exits include Amazon (NASDAQ:AMZN), Alphabet (NASDAQ:GOOG), Adobe (NASDAQ:ADBE), Netflix (NASDAQ:NFLX), Microsoft (NASDAQ:MSFT) and Tesla (NASDAQ:TSLA).\n\nReduced stakes in NVIDIA (NASDAQ:NVDA) and T-Mobile US (NASDAQ:TMUS).\n\nTakes new position in Line (NYSE:LN) and Lemonade (NYSE:LMND).\"\n\n\nThey know something that the average reddit investor doesn't? I would say always follow the money...",
        "subreddit": "StockMarket",
        "title": "Softbank exits stake in 24 companies, exits AMZN, GOOG, TSLA",
        "url": "https://www.reddit.com/r/StockMarket/comments/jv2iu7/softbank_exits_stake_in_24_companies_exits_amzn/",
        "created": 1605539351.0
    },
    {
        "author": "SelaTheRock",
        "created_utc": 1606740772,
        "id": "k3v7q5",
        "num_comments": 128,
        "num_crossposts": 0,
        "selftext": "supp guys, hope you are ready for another busy week of loss porn and short selling reports that gonna destroy your accounts. \n\nFor all those of you who missed the pltr and gme train or are too scared to get in (if you are than gtfo of this subreddit), I'm going to show you a company that is so undervalued it hurts and its to take off soon🚀\n\n**So what is Alteryx?**\n\nglad you asked, Alteryx is a data analytics data science company that provides a platform for companies to perform analysis of the data, share it, and deploy lots of analytic models. The platform can be used by business analysts, programmers, and trained data scientists. The company wants to solve the problem of wasting time in the organization for doing simple Data analytics. As for 2020 60 BILLION DOLLARS per year wasted on analysts doing repetitive manual work in spreadsheets. The uniqueness of this company is that the interface of the platform is very intuitive and user friendly, using drag and drop interface and mainly reduces the need to write complex software code. Their platform is designed to interact with almost any data source, starting from IBM, Microsoft, Oracle, and SAP to AWS, Google Analytics, Workday, and more.\n\n**Who are the customers?**\n\nSo the company has, as of 2020, approx. 7000 customers in more than 90 countries and big names like Netflix, Salesforce, Toyota, Chevron, Uber, Twitter, Xerox, Nasdaq, and many more. The company already has a name in the big boys' playground and we can expect it to continue to expand. \n\n**Tell me more, please.**\n\nNo problem amigo. The company continues its growth strategy by a series of acquisitions mainly for developing tools and talented people. in 2019 they acquired ClearStory Data mainly because the developers are very good and can leverage them to help to develop and improve their tools. They acquired Feature Labs to augment their machine learning capabilities and to penetrate to the East coast of the US. Also the company announced strategic alliances with Adobe, UiPath and ABBYY to accelerate adoption of APA (analytic process automation) which altreyx is a leader at. \n\nAlteryx is a subscription-based software which makes it a SaaS company the same as TTD, Shopify and so on, but it focuses on analytics. Their main competitors are the big software companies (IBM, Microsoft, SAP) and some small ones which most of them are private.                  So in order to compare them to check if they are under/overvalued, I will use companies in the same field as Datadog, Splunk, and more.\n\n**Let's dig in for some numbers**\n\nAnnual revenue has increased from 86M to 418M in just 4 years (2016-2019) that is a 48% CAGR which is amazing. This year the company expects to grow revenues at around 15% mainly because of covid, which made companies cut expenses.\n\nQ3 revenues growth is 38% YOY, customer growth is 24% YOY.                                                        Gross Margin is 93% (Amazing) Operating Margin is 24%. This company is super efficient and with great margins.\n\nThe company is profitable as of the 3Q with a positive EPS of 0.07. It uses more than 50% of its gross profit for R&amp;D which is exactly what we want to see in a growing tech company.\n\n**Balance Sheet**\n\nCash is down to 95M from 409M mainly because of acquisitions, but short term investments are almost double YOY with 627M. **Current Ration** is 1:4 approx. and **asset to liabilities ratio** is 1:1.5 so the company is indeed solvent and can survive even black swans like covid.                 Liabilities wise the company has 650M in convertible bonds which as we see can be covered by the short-term investments, It is something we should consider when the company starts to underperform, not now though. \n\nCash from Operating Activities for the 3Q is 16.3 M an improvement of 20%                              FCF is negative for the quarter mainly because of the investments they made (240M) \n\nSo the company is performing really well so far this year and is able to grow despite covid and companies reducing expenses. Of course, they need to increase their FCF but as long as they are growing and acquiring companies it's all good.\n\n**Let's use some gay TA to see what's going on**\n\n&amp;#x200B;\n\n[AYX 1 day chart](https://preview.redd.it/eu91ywiifd261.jpg?width=1374&amp;format=pjpg&amp;auto=webp&amp;s=96335b788ca104400101c7f29fdc13435ce4aac7)\n\nWell as you see AYX is in a range for quite a while (since May) with 104 and 80 acting as support and 150 and 178 as resistance. It hits 104 twice and couldn't break it and in the last 2 weeks, it tried again, and again was denied. \n\nSo the stock can now go to 150 easily or contest again the 104 level. with the tech trend going up I can see it going to retest that 150 level hoping to break it.\n\n**Now we compare this company with other companies**\n\n \n\n* SNOW: ‘21 EV / Rev = \\~100x\n* DDOG: ‘21 EV / Rev = \\~ 40x\n* MongoDB: ‘21 EV / Rev = \\~ 25x\n* **Alteryx: ‘21 EV / Rev = \\~ 15x**\n* JFROG: ‘21 EV / Rev = \\~ 30x \n* PLTR ‘21 EV / Rev = \\~ 50x\n\n(thanks  [u/xwpv8j62](https://new.reddit.com/user/xwpv8j62/) for the info)\n\nAs you see AYX is the most UNDERVALUED company here which means a lot of room to grow.\n\nGross Margin:\n\n**AYX- 92%**\n\nDDOG- 78%\n\nSNOW - 55%\n\nMongoDB- 69%\n\nP/S Ratio:\n\n**AYX-  16.95**\n\nDDOG- 51.71\n\nSNOW - 150.15\n\nMONGODB-  30.88\n\nPLTR - 47.76\n\nAYX has the best margin, best ratios, and still is way undervalued than its peers. This is wrong and YOU have a chance to take advantage of it.\n\n**TL:DR,**  Shares and January Calls at 120/130 strike will do the work.\n\nHave fun guys happy trading and tendies for y'all.",
        "subreddit": "wallstreetbets",
        "title": "Atleryx (AYX) this weird name company is going to the 🌝🌕",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k3v7q5/atleryx_ayx_this_weird_name_company_is_going_to/",
        "created": 1606769572.0
    },
    {
        "author": "fastfrequency",
        "created_utc": 1605510502,
        "id": "jv2ihb",
        "num_comments": 64,
        "num_crossposts": 0,
        "selftext": "\"Masayoshi Son's Softbank Group reported Sept. end total portfolio value of $12.92B sharply down from $17.52B at the end of the June quarter.\n\nSoftbank has reduced its holding to just 4 companies from 26 companies at the end of Q2.\n\nNotable exits include Amazon (NASDAQ:AMZN), Alphabet (NASDAQ:GOOG), Adobe (NASDAQ:ADBE), Netflix (NASDAQ:NFLX), Microsoft (NASDAQ:MSFT) and Tesla (NASDAQ:TSLA).\n\nReduced stakes in NVIDIA (NASDAQ:NVDA) and T-Mobile US (NASDAQ:TMUS).\n\nTakes new position in Line (NYSE:LN) and Lemonade (NYSE:LMND).\"\n\n\nThey know something that the average reddit investor doesn't? I would say always follow the money...",
        "subreddit": "investing",
        "title": "Softbank exits stake in 24 companies, exits AMZN, GOOG, TSLA",
        "url": "https://www.reddit.com/r/investing/comments/jv2ihb/softbank_exits_stake_in_24_companies_exits_amzn/",
        "created": 1605539302.0
    },
    {
        "author": "Raii-v2",
        "created_utc": 1606486407,
        "id": "k21szp",
        "num_comments": 57,
        "num_crossposts": 0,
        "selftext": "Heres why ADBE is about to fucking moon\n\nADBE as we all know is the creator of the .pdf. Basically the most successful document extension in the game for the past 10 years. They're like your hot millennial sister who's old as fuck but does yoga and still keeps her pussy tight. \n\nADBE is synonymous with graphic manipulation and basically has a monopoly on the digital art platform. \n\nADBE has been doing cloud services way before COVID started buttfucking the world. They aren't going anywhere. \n\nNow if you're going to bitch to me about stupid P/E and margins and shit, I'm going to tell you to fuck off cus I dont understand that jive talk. \n\nBut look at this fucking graph:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/gmqyvzp3js161.jpg?width=1454&amp;format=pjpg&amp;auto=webp&amp;s=4ac6da02e7603a523cf116feddc71ca6fe8d860b\n\nADBE has less than 2 weeks till their next earnings and they're sleeping at the bottom of support waiting for their run-up into earnings. Which they will inevitably beat. All the while being 60 bucks lower than their ATH. This shit is about to skyrocket next week so strap up and lets head to tendietown. \n\nPositions: \n\nADBE 12/4 500C\n\nADBE 12/4 517.5C\n\nADBE 12/11 500C\n\nADBE 12/11 510C",
        "subreddit": "wallstreetbets",
        "title": "Paint my dick green with ADBE",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k21szp/paint_my_dick_green_with_adbe/",
        "created": 1606515207.0
    },
    {
        "author": "RetardedDungBeatle",
        "created_utc": 1605987969,
        "id": "jyh6zs",
        "num_comments": 40,
        "num_crossposts": 0,
        "selftext": "Some interesting developments on the institutional holdings front:\n\n\\- Ark Funds - up to 3MM shares. They continue to add at a 10K/share a day clip on average. Their biggest bet has been TSLA and known as one of the best performing technology funds out there\n\n\\- Suvretta Capital Management: 4.1MM shares. Run by a former SAC (Steve Cohen) investment professional who also worked at Soros Capital Management. Other big investments include ADBE, AMZN \n\n\\- Soros Capital Management: now in for 1MM shares. A new position. Everyone knows who this guy is. \n\n\\- FMR LLC - newly added about 800K shares. They are a little known money manager called Fidelity. As one of the biggest mutual fund/money managers in existence, this is huge. \n\nThese four groups provide tremendous validation to IPOB/Opendoor - nameplate anchors in the equity (who collectively now own close to 25% of the float) who will help attract a ton of followership as this gets to merger. \n\nYou can validate the data on your own looking at the institutional holdings tracked by Nasdaq or CapIQ. \n\nDon't think we've seen this before in any SPAC that has yet to merge, but I could be wrong! \n\nMy first post on IPOB for reference (positions the same - heavy in the warrants - IPOB-WT and May 2021 $20 calls):\n\n[https://www.reddit.com/r/wallstreetbets/comments/ju8rbp/ipob\\_merging\\_with\\_open\\_door\\_in\\_5b\\_tev\\_transaction/](https://www.reddit.com/r/wallstreetbets/comments/ju8rbp/ipob_merging_with_open_door_in_5b_tev_transaction/)",
        "subreddit": "wallstreetbets",
        "title": "IPOB (Opendoor) - Nameplate Institutions Piling In Ahead of Merger Expected in December",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jyh6zs/ipob_opendoor_nameplate_institutions_piling_in/",
        "created": 1606016769.0
    },
    {
        "author": "fastfrequency",
        "created_utc": 1605510601,
        "id": "jv2j78",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "\"Masayoshi Son's Softbank Group reported Sept. end total portfolio value of $12.92B sharply down from $17.52B at the end of the June quarter.\n\nSoftbank has reduced its holding to just 4 companies from 26 companies at the end of Q2.\n\nNotable exits include Amazon (NASDAQ:AMZN), Alphabet (NASDAQ:GOOG), Adobe (NASDAQ:ADBE), Netflix (NASDAQ:NFLX), Microsoft (NASDAQ:MSFT) and Tesla (NASDAQ:TSLA).\n\nReduced stakes in NVIDIA (NASDAQ:NVDA) and T-Mobile US (NASDAQ:TMUS).\n\nTakes new position in Line (NYSE:LN) and Lemonade (NYSE:LMND).\"\n\n\nThey know something that the average reddit investor doesn't? I would say always follow the money...",
        "subreddit": "stocks",
        "title": "Softbank exits stake in 24 companies, exits AMZN, GOOG, TSLA",
        "url": "https://www.reddit.com/r/stocks/comments/jv2j78/softbank_exits_stake_in_24_companies_exits_amzn/",
        "created": 1605539401.0
    },
    {
        "author": "Trading-Resources",
        "created_utc": 1606718393,
        "id": "k3qlbd",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "I recently posted [SOME Due Diligence on $STMP](https://www.reddit.com/r/wallstreetbets/comments/k2hmp8/stmp_stampscom_is_on_a_pull_back_will_no_doubt/) but now I wish to address the implications of recent online sales data.\n\nWith renewed COVID restrictions amid the busiest shopping season of the year the implications for Stamps.com are exceptionally positive. Observe the following.\n\n$STMP has benefitted greatly from COVID. With the increase in online shopping, small and large businesses alike have sought out the online marketplace to make up for the lack of on site traffic. As a result these companies need a method of convenient and economical shipping to move their goods to the consumer. This is where $STMP shines. Stamps.com enables businesses to purchase and print postage from USPS &amp; UPS to be picked up on site by the shipping service. In short it turns any business into an Amazon warehouse.  \n\nOn 05 November 2020 STMP beat their revenue estimates by $32.15 million (+42% Year Over Year), and beat GAAP EPS by $2.48 ($0.82 expected). $STMP raised guidance and now expects full-year revenue of $705M to $735M vs. $710M consensus and EPS of $10.35 to $11.35 vs. $7.91 consensus. The new revenue guidance is well ahead of the $650M to $725M outlook issued in August.\n\nThis quarter [e-commerce sales ](https://www.cnbc.com/amp/2020/11/28/black-friday-traffic-in-stores-craters-52percent-during-pandemic.html) surged 21.6% over the year before according to Adobe analytics. In short, shoppers are using online retail, not in-store retail, which means more goods are being shipped to the consumer than ever before. \n\nCyber Monday, the busiest online shopping day of the year, [is expected to beat more records](https://www.usatoday.com/story/money/shopping/2020/11/28/cyber-monday-2020-black-friday-sales-records-coronavirus/6449464002/). Meaning more shipping to online shoppers. They’ve even coined a name for the shipping disaster: “[shipageddon](https://www.usatoday.com/story/money/shopping/2020/11/28/cyber-monday-2020-black-friday-sales-records-coronavirus/6449464002/)”\n\nAdditionally [Shopify Announced Record Global Black Friday Sales of $2.4 Billion](https://investors.shopify.com/news-and-events/press-releases/news-details/2020/Shopify-Announces-Record-Global-Black-Friday-Sales-of-2.4-Billion/). This has [MASSIVE implications ](https://www.stamps.com/shipping/ecommerce-integrations/shopify/) for Stamps.com. Stamps.com’s website notes that “Using the Stamps.com integration, Shopify customers can automatically import orders and batch print shipping labels for all USPS mail classes, both domestic and international. Stamps.com’s BestRate shopping engine will also help identify the most cost-effective mail class option using box size, delivery time guarantee and shipping zone. Once the USPS label is printed, the order status details such as the USPS tracking number, shipping date and mail class are automatically posted to your Shopify account. Shopify customers also get access to additional Stamps.com features such as hidden postage, discounts on USPS postage rates and insurance and return shipping labels. Learn more about the [https://www.stamps.com/shipping/ecommerce-integrations/shopify/](https://stamps.custhelp.com/app/answers/detail/a_id/2936/)\n\nFinally Amazon is so fearful of the shipping backlog that they’re [requesting their customers pick up their orders](https://www.miamiherald.com/news/nation-world/national/article247392055.html) from “community hubs.”\n\nSo why not invest in over pumped companies like Amazon, Shopify, or any of the other massive online retailers that will no doubt benefit from record online sales? Well this is the good part! After Q3 earnings institutions and market makers decided to cool the stock off and take profit, as has happened the last three quarters. Meaning that Shopify is currently trading at a discount and will likely swing hard up until Q4 earnings. In short, retail investors, institutions, market makers, and their mothers, will likely be tripping over each other at some point to get a price of this action. It’s why I entered early with 50 shares @ $177.00 . I personally expect STMP to be well over $200 by Q4 earnings. \n\nThere are two possible drawbacks. 1) For you options gurus out there, STMP contracts are very expensive. Huge swings are priced in. The money here will likely be in selling options, not purchasing them. Perhaps covered calls or cash secured puts. Perhaps spreads. Perhaps a number of other options strategies may strike your fancy. 2) When COVID is behind us, STMP will likely make more $$ than pre-COVID, but not as much $$ as mid-COVID. This said STMP will still likely continue to grow in revenue and expand into foreign markets. For example, their wholly owned subsidiary, ShipStation, [is partnered with the Chinese Amazon, Alibaba (BABA)](https://www.shipstation.com/press/shipstation-alibaba-com-launch-integration-for-b2b-e-commerce-merchants/). The post-COVID outlook for STMP May have already been priced in by indication of their dramatic drop in share price after Q3 earnings. Whatever the case the COVID environment has likely forever changed how we shop and STMP will be there to profit from this phenomena. \n\nTL;DR\n\nStamps.com (STMP) is likely to have the largest quarter in their history as a result of COVID restrictions and record online sales amid the holiday shopping season. Now is the perfect time to buy the STMP dip while it’s sitting over $175 support. Relative to other beneficiaries of record online sales, STMP is trading at a relative discount. \n\nI am long $STMP\n\nPlease read the above before commenting about      hoe expensive the options are.",
        "subreddit": "StockMarket",
        "title": "Record Online Sales Implications for Stamps.com $STMP",
        "url": "https://www.reddit.com/r/StockMarket/comments/k3qlbd/record_online_sales_implications_for_stampscom/",
        "created": 1606747193.0
    },
    {
        "author": "JimboCrackers",
        "created_utc": 1604695881,
        "id": "jpd6je",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "Does anyone know anything about U?\n\nThey recently went public mid-September with an IPO at around $68/share, in only a little over a month the stock price has jumped to a price around $118.  Just in this past week, the stock has grown around 20%, is U something worth looking into?\n\nAll I really about the company is that they have run a subscription service similar to adobe in which people can develop video games at practically every stage. In addition, Unity is popular in the mobile gaming market as well as the indie game market, and not really meant for triple-A titles.",
        "subreddit": "stocks",
        "title": "U (Unity Software Inc)",
        "url": "https://www.reddit.com/r/stocks/comments/jpd6je/u_unity_software_inc/",
        "created": 1604724681.0
    },
    {
        "author": "picuron",
        "created_utc": 1604884790,
        "id": "jqnzvk",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "The auto-mod will automatically remove my submission if I say the \"RMP\" words, but here are the results:\n\n&amp;#x200B;\n\n    OTHER STOCKS has an allocation of 33.75%\n    AAPL has an allocation of 7.56%\n    TSLA has an allocation of 5.94%\n    MSFT has an allocation of 5.75%\n    NVDA has an allocation of 3.5%\n    NIO has an allocation of 3.33%\n    VOO has an allocation of 3.29%\n    AMZN has an allocation of 3.11%\n    VTI has an allocation of 2.57%\n    QQQ has an allocation of 2.47%\n    AMD has an allocation of 2.35%\n    ICLN has an allocation of 1.38%\n    SQ has an allocation of 1.36%\n    CASH has an allocation of 1.27%\n    BABA has an allocation of 1.26%\n    FB has an allocation of 1.06%\n    DIS has an allocation of 1.06%\n    SPY has an allocation of 0.93%\n    XLK has an allocation of 0.88%\n    KO has an allocation of 0.66%\n    WMT has an allocation of 0.58%\n    VGT has an allocation of 0.58%\n    GOOGL has an allocation of 0.55%\n    V has an allocation of 0.53%\n    VT has an allocation of 0.44%\n    CRM has an allocation of 0.41%\n    A has an allocation of 0.4%\n    ETSY has an allocation of 0.4%\n    BYND has an allocation of 0.39%\n    MA has an allocation of 0.38%\n    T has an allocation of 0.33%\n    INTC has an allocation of 0.32%\n    JPM has an allocation of 0.31%\n    PINS has an allocation of 0.29%\n    SBUX has an allocation of 0.28%\n    SHOP has an allocation of 0.28%\n    CRWD has an allocation of 0.28%\n    RTX has an allocation of 0.27%\n    GOOG has an allocation of 0.24%\n    DAL has an allocation of 0.24%\n    JNJ has an allocation of 0.24%\n    MCD has an allocation of 0.24%\n    PYPL has an allocation of 0.22%\n    BAC has an allocation of 0.2%\n    CVX has an allocation of 0.19%\n    BRK.B has an allocation of 0.18%\n    GOLD has an allocation of 0.18%\n    EA has an allocation of 0.17%\n    WM has an allocation of 0.17%\n    PEP has an allocation of 0.16%\n    SWKS has an allocation of 0.16%\n    WFC has an allocation of 0.16%\n    AXP has an allocation of 0.15%\n    BA has an allocation of 0.15%\n    HD has an allocation of 0.15%\n    PFE has an allocation of 0.15%\n    COST has an allocation of 0.14%\n    LOW has an allocation of 0.14%\n    QCOM has an allocation of 0.14%\n    O has an allocation of 0.14%\n    IWF has an allocation of 0.14%\n    GE has an allocation of 0.13%\n    NFLX has an allocation of 0.13%\n    CHWY has an allocation of 0.13%\n    VUG has an allocation of 0.13%\n    XOM has an allocation of 0.12%\n    NKE has an allocation of 0.12%\n    FVRR has an allocation of 0.12%\n    CCL has an allocation of 0.11%\n    DE has an allocation of 0.11%\n    TWTR has an allocation of 0.1%\n    PLTR has an allocation of 0.1%\n    SEDG has an allocation of 0.1%\n    AVGO has an allocation of 0.09%\n    CAG has an allocation of 0.09%\n    DFS has an allocation of 0.09%\n    KR has an allocation of 0.09%\n    SPG has an allocation of 0.09%\n    SNE has an allocation of 0.09%\n    ABBV has an allocation of 0.08%\n    ATVI has an allocation of 0.08%\n    AMGN has an allocation of 0.08%\n    CSCO has an allocation of 0.08%\n    DOW has an allocation of 0.08%\n    PG has an allocation of 0.08%\n    RCL has an allocation of 0.08%\n    NOW has an allocation of 0.08%\n    TGT has an allocation of 0.08%\n    VZ has an allocation of 0.08%\n    TTD has an allocation of 0.08%\n    UBER has an allocation of 0.08%\n    ZM has an allocation of 0.08%\n    AAL has an allocation of 0.07%\n    HAS has an allocation of 0.07%\n    PPL has an allocation of 0.07%\n    UAL has an allocation of 0.07%\n    BMY has an allocation of 0.06%\n    CMCSA has an allocation of 0.06%\n    GM has an allocation of 0.06%\n    HON has an allocation of 0.06%\n    MPC has an allocation of 0.06%\n    NCLH has an allocation of 0.06%\n    REGN has an allocation of 0.06%\n    TTWO has an allocation of 0.06%\n    LULU has an allocation of 0.06%\n    FDX has an allocation of 0.05%\n    MU has an allocation of 0.05%\n    SNAP has an allocation of 0.05%\n    SONY has an allocation of 0.05%\n    BBY has an allocation of 0.04%\n    CVS has an allocation of 0.04%\n    EL has an allocation of 0.04%\n    KHC has an allocation of 0.04%\n    REG has an allocation of 0.04%\n    LUV has an allocation of 0.04%\n    VRTX has an allocation of 0.04%\n    VTV has an allocation of 0.04%\n    MO has an allocation of 0.03%\n    ADSK has an allocation of 0.03%\n    CDNS has an allocation of 0.03%\n    CI has an allocation of 0.03%\n    IBM has an allocation of 0.03%\n    MLM has an allocation of 0.03%\n    NEE has an allocation of 0.03%\n    ODFL has an allocation of 0.03%\n    ROST has an allocation of 0.03%\n    TXN has an allocation of 0.03%\n    ULTA has an allocation of 0.03%\n    UAA has an allocation of 0.03%\n    UNH has an allocation of 0.03%\n    ACB has an allocation of 0.03%\n    CGC has an allocation of 0.03%\n    ACN has an allocation of 0.02%\n    ADBE has an allocation of 0.02%\n    AMT has an allocation of 0.02%\n    CAT has an allocation of 0.02%\n    DUK has an allocation of 0.02%\n    F has an allocation of 0.02%\n    GPS has an allocation of 0.02%\n    HRL has an allocation of 0.02%\n    HPQ has an allocation of 0.02%\n    LMT has an allocation of 0.02%\n    L has an allocation of 0.02%\n    MGM has an allocation of 0.02%\n    STX has an allocation of 0.02%\n    UNP has an allocation of 0.02%\n    WYNN has an allocation of 0.02%\n    XRX has an allocation of 0.02%\n    MRNA has an allocation of 0.02%\n    IVV has an allocation of 0.02%\n    FNILX has an allocation of 0.02%\n    MMM has an allocation of 0.01%\n    ABT has an allocation of 0.01%\n    AFL has an allocation of 0.01%\n    AMAT has an allocation of 0.01%\n    CBRE has an allocation of 0.01%\n    CMA has an allocation of 0.01%\n    CTVA has an allocation of 0.01%\n    FANG has an allocation of 0.01%\n    DG has an allocation of 0.01%\n    EOG has an allocation of 0.01%\n    EQIX has an allocation of 0.01%\n    IT has an allocation of 0.01%\n    IP has an allocation of 0.01%\n    J has an allocation of 0.01%\n    LHX has an allocation of 0.01%\n    LDOS has an allocation of 0.01%\n    LEN has an allocation of 0.01%\n    LLY has an allocation of 0.01%\n    LYV has an allocation of 0.01%\n    MAR has an allocation of 0.01%\n    NOC has an allocation of 0.01%\n    PM has an allocation of 0.01%\n    PLD has an allocation of 0.01%\n    SLB has an allocation of 0.01%\n    SO has an allocation of 0.01%\n    SWK has an allocation of 0.01%\n    SYF has an allocation of 0.01%\n    TSN has an allocation of 0.01%\n    WBA has an allocation of 0.01%\n    XLNX has an allocation of 0.01%",
        "subreddit": "stocks",
        "title": "I used a web-scraper and Python to compile the average portfolio of the quarterly thread:",
        "url": "https://www.reddit.com/r/stocks/comments/jqnzvk/i_used_a_webscraper_and_python_to_compile_the/",
        "created": 1604913590.0
    },
    {
        "author": "Brothanogood",
        "created_utc": 1606594610,
        "id": "k2us5t",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "Amazon.com (AMZN) could claim 42 cents of every $1 spent on e-commerce in the U.S. this holiday season, a Wall Street analyst estimates. Its sales are likely to get a boost from a resurgence in Covid-19 infections, which is causing many people to avoid brick-and-mortar stores. Amazon stock rose on Black Friday.\n\nTruist Securities analyst Youssef Squali estimates that Amazon will grab 42% in U.S. e-commerce spending this holiday season. That share, measured in gross merchandise value, is up from 36% last year.\n\n\"We're incrementally positive on AMZN going into what should be a blockbuster holiday season, given the company's outsized growth within U.S. e-commerce,\" Squali said in a note to clients Wednesday.\n\nHe reiterated his buy rating on Amazon stock with a price target of 3,650. On the stock market today, Amazon stock rose 0.3% to 3,195.34.\n\nAmazon Seen Outpacing Total E-Commerce Growth\n\nSquali believes Amazon will grow its e-commerce sales in North America by 42% year over year in the fourth quarter.\n\nMeanwhile, Adobe (ADBE) projects that total U.S. online holiday-season spending in November and December will reach $189 billion this year, up 33%. That would be a material acceleration from the same period last year, when sales grew 13.1%.\n\nThe Covid-19 pandemic is behind much of the growth, Squali said.\n\nThe health crisis \"has forced consumers online and away from brick-and-mortar stores, where high density of traffic fuels the transfer of the virus,\" he said. \"In fact, if the current spike in Covid-19 cases continues, and store capacity is further restricted, we believe it would force even more people to order online.\"\n\nAmazon Stock 'Best Way To Play' E-Commerce Trends\n\nAmazon also is benefiting from near-record retail store closings this year, Squali said. Year to date, there have been 8,325 announced store closures in the U.S. In 2019, the industry saw a record 9,300 store closures, he said.\n\nAmazon stock is the \"best way to play\" online holiday shopping trends, he said.\n\nMeanwhile, Amazon warehouse workers and activist groups staged protests and strikes against the e-commerce giant in countries worldwide on Black Friday. They were protesting the company's handling of everything from sick pay and Covid-19 precautions to user privacy and environmental concerns. The protests were coordinated under the Make Amazon Pay campaign.\n\n[Source](https://www.investors.com/news/technology/amazon-stock-black-friday-bullish-report/)",
        "subreddit": "stocks",
        "title": "Amazon Could Grab 42% Of U.S. Holiday E-Commerce Spending",
        "url": "https://www.reddit.com/r/stocks/comments/k2us5t/amazon_could_grab_42_of_us_holiday_ecommerce/",
        "created": 1606623410.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1606491007,
        "id": "k236hb",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2020/11/27/thanksgiving-day-online-sales-hit-record-5point1-billion-up-21point5percent-from-last-year-adobe-says.html\n\nThanksgiving Day spending rose by nearly 22% year over year to $5.1 billion, hitting a new record, according to Adobe Analytics data.\n\nNearly half of the online purchases were made on a smartphone, Adobe found.\n\nThe strong online shopping data reflects a trend that many retailers and industry-watchers expected: More consumers are avoiding malls and buying gifts from their couch during the coronavirus pandemic.",
        "subreddit": "stocks",
        "title": "Thanksgiving Day online sales hit record $5.1 billion, up 21.5% from last year, Adobe says",
        "url": "https://www.reddit.com/r/stocks/comments/k236hb/thanksgiving_day_online_sales_hit_record_51/",
        "created": 1606519807.0
    },
    {
        "author": "OfficerTruth",
        "created_utc": 1606419434,
        "id": "k1ltlp",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Salesforce Inc.  has thrived for years as a niche business-software vendor with a chief executive,  Marc Benioff , who has positioned himself as a prominent voice in American business.\n\nNow Mr. Benioff is taking steps that analysts say aim higher, intensifying the company's battle with the industry's biggest player:  Microsoft Corp. \n\nSalesforce is in advanced talks to acquire  Slack Technologies Inc. ,  The Wall Street Journal  reported Wednesday, in what would be Mr. Benioff's biggest acquisition to date and the company's most direct attack on a market  Microsoft  has identified as critical to its growth.\n\nThe deal, which could still fall through, would add fuel to Salesforce's ambition to become the go-to software platform for business customers to use for everything from data analysis to managing customer relationships to even daily communication.\n\nThe pandemic has amplified Salesforce's efforts. When Covid-19 broke out, Mr. Benioff quickly launched [w](https://Work.com)ork.com -- a suite of applications companies could use for contract tracing, mental-health checks and shift scheduling.\n\nA deal for Slack could heat up the simmering rivalry between Salesforce and  Microsoft . About five years ago  Microsoft  was in talks to buy Salesforce, but the deal fell apart over price. Salesforce lost out to  Microsoft  in 2016 in bidding for  LinkedIn Corp. , the business-focused social-media network. The loss stung. Salesforce responded by urging regulators to examine  Microsoft's  proposed purchase on antitrust grounds; the deal passed regulatory scrutiny.\n\nLanding Slack, which  Microsoft  once tried to acquire, could amount to a bit of revenge for Mr. Benioff.\n\nHaving failed to capture Slack,  Microsoft  launched its own workplace collaboration tool, called Teams, spurring a sometimes heated battle between the two companies.\n\n\"They want to kill us,\" Slack CEO  Stewart Butterfield  told the Journal earlier this year. This summer, Slack filed a complaint with the  European Union  over alleged antitrust behavior by  Microsoft  in using its dominance to push Teams.\n\nSlack \"extends the footprint of what Salesforce goes after,\" said Jefferies analyst  Brent Thill . \"Not everyone uses a sales system, but everyone can use collaboration. The beauty of Slack and Teams is that it touches everything inside enterprises.\"\n\nMr. Benioff has a history of deal making since he co-founded Salesforce 21 years ago and turned it into one of the most successful companies in the then still nascent market of providing software as a service. Salesforce completed its biggest-ever purchase last year, paying around  $15 billion  in stock for data-analytics platform  Tableau Software Inc. \n\nA year earlier it splashed out more than  $5 billion  for cloud-application provider MuleSoft. Inc. This year Salesforce said it was buying cloud-software provider  Vlocity Inc. \n\nMr. Benioff has long been one of  Silicon Valley's  highest-profile and most outspoken executives, using venues like the  World Economic Forum  in  Davos, Switzerland , to champion causes. He set up Salesforce with a pledge of corporate giving and bought himself an even larger platform with his acquisition of  Time Magazine  two years ago.\n\nThe  San Francisco -based company also has made a big push into the emerging field of artificial intelligence, developing tools to help customers make better use of their data. In 2016, it acquired PredictionIO, which makes software for building machine-learning apps. That followed the purchase of MinHash and Tempo AI, two further machine-learning companies. In 2014, it bought RelateIQ, which also specializes in the field.\n\nBreaking into the market of workplace collaboration has long been on Salesforce's agenda. In 2010, it launched Chatter, a private social network for companies to collaborate. And in 2016, it bought cloud-document collaboration app company  Quip Inc.  for more than  $500 million . Neither product attracted a wide following. Acquiring Slack, which Salesforce had previously explored buying, would immediately make the company a big player in the workplace- collaboration market. Slack has more than 130,000 paying customers.\n\nSalesforce, which declined to comment for this article, is pursuing Slack as competition in its core business of customer relationship management software is intensifying.  Adobe Inc.  this month said it would buy Workfront, a platform for marketers, for  $1.5 billion .  Microsoft  also has been pushing its rival product, called Dynamics. Salesforce still has the largest share with 20.1% of the world-wide market in 2019 compared with 2.6% for Microsoft Dynamics, according to research firm  Gartner Inc. \n\nEven with Slack, Salesforce would be a comparatively small rival to  Microsoft . The  Redmond, Wash. , company had sales of  $143 billion  in its latest financial year, generated by business enterprise software, its cloud-computing infrastructure, and consumer-facing businesses, such as videogaming, which has exploded during the pandemic. Its sales are roughly nine times Salesforce's annual revenue.  Microsoft's  market valuation tops  $1.6 trillion , about six times that of Slack and Salesforce combined.\n\nLast year Salesforce said it was seeking to reach  $28 billion  in annual sales in the 2023 financial year. It had  $16 billion  in sales in its most recent financial year.\n\n\"He really needs to keep growing,\" said  Mark Moerdler , senior research analyst at  Bernstein Research , of Mr. Benioff. \"He needs another big acquisition. Slack gives him a big acquisition. It gives him revenue.\"\n\nSlack also has been looking to broaden its appeal. Companies have used Slack principally for intra-office communications. In June, the software provider introduced Slack Connect, which allows messages to be sent between different companies. Slack's Mr. Butterfield said the feature has driven a rise in paying customers and should fuel future growth.\n\nBut big acquisition plans aren't without pitfalls. When Salesforce tried to buy social-media company  Twitter Inc.  in 2016, Mr. Benioff faced significant pushback from investors and he walked away from the deal. Although Slack is more in the mainstream of Salesforce's business than Twitter, it would still come at a hefty price given Slack's  $17 billion  market value before Wednesday's stock surge.\n\n\"Investors don't want Salesforce to do a big deal,\" Mr. Thill of Jefferies said, adding they want the company to show it can generate growth from within.",
        "subreddit": "investing",
        "title": "With Slack, Salesforce Would Put Heat on Microsoft",
        "url": "https://www.reddit.com/r/investing/comments/k1ltlp/with_slack_salesforce_would_put_heat_on_microsoft/",
        "created": 1606448234.0
    },
    {
        "author": "Trading-Resources",
        "created_utc": 1606717993,
        "id": "k3qi42",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "I recently posted [SOME Due Diligence on $STMP](https://www.reddit.com/r/wallstreetbets/comments/k2hmp8/stmp_stampscom_is_on_a_pull_back_will_no_doubt/) but now I wish to address the implications of recent online sales data.\n\nWith renewed COVID restrictions amid the busiest shopping season of the year the implications for Stamps.com are exceptionally positive. Observe the following.\n\n$STMP has benefitted greatly from COVID. With the increase in online shopping, small and large businesses alike have sought out the online marketplace to make up for the lack of on site traffic. As a result these companies need a method of convenient and economical shipping to move their goods to the consumer. This is where $STMP shines. Stamps.com enables businesses to purchase and print postage from USPS &amp; UPS to be picked up on site by the shipping service. In short it turns any business into an Amazon warehouse.  \n\nOn 05 November 2020 STMP beat their revenue estimates by $32.15 million (+42% Year Over Year), and beat GAAP EPS by $2.48 ($0.82 expected). $STMP raised guidance and now expects full-year revenue of $705M to $735M vs. $710M consensus and EPS of $10.35 to $11.35 vs. $7.91 consensus. The new revenue guidance is well ahead of the $650M to $725M outlook issued in August.\n\nThis quarter [e-commerce sales ](https://www.cnbc.com/amp/2020/11/28/black-friday-traffic-in-stores-craters-52percent-during-pandemic.html) surged 21.6% over the year before according to Adobe analytics. In short, shoppers are using online retail, not in-store retail, which means more goods are being shipped to the consumer than ever before. \n\nCyber Monday, the busiest online shopping day of the year, [is expected to beat more records](https://www.usatoday.com/story/money/shopping/2020/11/28/cyber-monday-2020-black-friday-sales-records-coronavirus/6449464002/). Meaning more shipping to online shoppers. They’ve even coined a name for the shipping disaster: “[shipageddon](https://www.usatoday.com/story/money/shopping/2020/11/28/cyber-monday-2020-black-friday-sales-records-coronavirus/6449464002/)”\n\nAdditionally [Shopify Announced Record Global Black Friday Sales of $2.4 Billion](https://investors.shopify.com/news-and-events/press-releases/news-details/2020/Shopify-Announces-Record-Global-Black-Friday-Sales-of-2.4-Billion/). This has [MASSIVE implications ](https://www.stamps.com/shipping/ecommerce-integrations/shopify/) for Stamps.com. Stamps.com’s website notes that “Using the Stamps.com integration, Shopify customers can automatically import orders and batch print shipping labels for all USPS mail classes, both domestic and international. Stamps.com’s BestRate shopping engine will also help identify the most cost-effective mail class option using box size, delivery time guarantee and shipping zone. Once the USPS label is printed, the order status details such as the USPS tracking number, shipping date and mail class are automatically posted to your Shopify account. Shopify customers also get access to additional Stamps.com features such as hidden postage, discounts on USPS postage rates and insurance and return shipping labels. Learn more about the [https://www.stamps.com/shipping/ecommerce-integrations/shopify/](https://stamps.custhelp.com/app/answers/detail/a_id/2936/)\n\nFinally Amazon is so fearful of the shipping backlog that they’re [requesting their customers pick up their orders](https://www.miamiherald.com/news/nation-world/national/article247392055.html) from “community hubs.”\n\nSo why not invest in over pumped companies like Amazon, Shopify, or any of the other massive online retailers that will no doubt benefit from record online sales? Well this is the good part! After Q3 earnings institutions and market makers decided to cool the stock off and take profit, as has happened the last three quarters. Meaning that Shopify is currently trading at a discount and will likely swing hard up until Q4 earnings. In short, retail investors, institutions, market makers, and their mothers, will likely be tripping over each other at some point to get a price of this action. It’s why I entered early with 50 shares @ $177.00 . I personally expect STMP to be well over $200 by Q4 earnings. \n\nThere are two possible drawbacks. 1) For you options gurus out there, STMP contracts are very expensive. Huge swings are priced in. The money here will likely be in selling options, not purchasing them. Perhaps covered calls or cash secured puts. Perhaps spreads. Perhaps a number of other options strategies may strike your fancy. 2) When COVID is behind us, STMP will likely make more $$ than pre-COVID, but not as much $$ as mid-COVID. This said STMP will still likely continue to grow in revenue and expand into foreign markets. For example, their wholly owned subsidiary, ShipStation, [is partnered with the Chinese Amazon, Alibaba (BABA)](https://www.shipstation.com/press/shipstation-alibaba-com-launch-integration-for-b2b-e-commerce-merchants/). The post-COVID outlook for STMP May have already been priced in by indication of their dramatic drop in share price after Q3 earnings. Whatever the case the COVID environment has likely forever changed how we shop and STMP will be there to profit from this phenomena. \n\nTL;DR\n\nStamps.com (STMP) is likely to have the largest quarter in their history as a result of COVID restrictions and record online sales amid the holiday shopping season. Now is the perfect time to buy the STMP dip while it’s sitting over $175 support. Relative to other beneficiaries of record online sales, STMP is trading at a relative discount. \n\nI am long $STMP\n\nPlease read the above before commenting about      hoe expensive the options are.",
        "subreddit": "stocks",
        "title": "Record Online Sales Have MASSIVE Implications for Stamps.com $STMP",
        "url": "https://www.reddit.com/r/stocks/comments/k3qi42/record_online_sales_have_massive_implications_for/",
        "created": 1606746793.0
    },
    {
        "author": "shury11",
        "created_utc": 1606502654,
        "id": "k26zk2",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "What do you think?\n\nUnity Software market cap: 37B\n\nAdobe: 225b\n\nNow U is flying 🚀🌕",
        "subreddit": "wallstreetbets",
        "title": "Unity will be the next Adobe",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k26zk2/unity_will_be_the_next_adobe/",
        "created": 1606531454.0
    },
    {
        "author": "t777m",
        "created_utc": 1604275839,
        "id": "jmd6o6",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "I have recently picked up an interest in investing and am thinking about starting in the coming days, on trading 212. Ive selected the FAANG companies, Microsoft, Tesla, Shopify, Salesforce, Nvidia, Adobe and Vanguard emerging markets etf. I’m not sure about the percentages.\n\nis this a good pie and what percentages should i use?",
        "subreddit": "investing",
        "title": "Starting to invest - is my pie good?",
        "url": "https://www.reddit.com/r/investing/comments/jmd6o6/starting_to_invest_is_my_pie_good/",
        "created": 1604304639.0
    },
    {
        "author": "xCheetaZx",
        "created_utc": 1606334294,
        "id": "k0zli8",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "I was thinking of getting into this stock, but I'm just not sure yet. I like its base of creative professionals and I've already made an immensely profitable play on this (FVRR). What do you guys think?",
        "subreddit": "stocks",
        "title": "Thoughts on Adobe (ADBE)?",
        "url": "https://www.reddit.com/r/stocks/comments/k0zli8/thoughts_on_adobe_adbe/",
        "created": 1606363094.0
    },
    {
        "author": "Brothanogood",
        "created_utc": 1605108711,
        "id": "jsa65m",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Adobe Inc. said it will acquire Workfront Inc. for $1.5 billion to add a collaboration tool to its marketing software, providing expanded offerings during a pandemic that has forced companies to maintain productivity while employees work from home.\n\nThe deal is expected to close sometime from December to February 2021, San Jose, California-based Adobe said Monday in a statement. Workfront, based in Lehi, Utah, will take its 3,000 corporate customers and 1 million users to the software maker best known for Photoshop. Bloomberg earlier reported that the acquisition could come as soon as Monday.\n\nAdobe has been a leader in the graphics and visual software industry for decades, but hasn’t offered collaboration tools. The company’s shares, which have climbed 43% this year, declined 4.8% to $471.14 at the close in New York.\n\nAfter recent stumbles, the acquisition is Adobe’s biggest effort to reorient its Experience Cloud division, which includes marketing, advertising and analytics software, toward areas that are growing. The company has sought to make its creative and business applications more collaborative, so that teams can more easily work together on projects. During the Covid-19 pandemic, businesses have found it essential to have better communication among colleagues working remotely. Adobe has curtailed some of its advertising services that had a low profit margin and said it had a new strategy of catering to customers that use multiple Experience Cloud tools.\n\nUnlike other makers of work productivity tools, including Asana Inc. and Atlassian Inc., which owns Trello, Workfront is focused on marketers, who use the software every day to “manage content, plan and track marketing campaigns and execute complex workflows across teams,” Adobe said in the statement. Marketers are also major clients for Adobe, which already integrates several of its products with Workfront’s offering.\n\nWorkfront will be Adobe’s fifth-biggest acquisition, according to data compiled by Bloomberg.\n\nThe purchase marks the first major action by Anil Chakravarthy, an executive vice president, who joined Adobe in January after serving as chief executive officer of Informatica LLC. Chakravarthy said in an interview that Adobe and Workfront have more than 1,000 mutual clients.\n\n“Every customer that we talk to is investing more and more in digital marketing,” he said. “They want to get more efficiency out of digital marketing efforts. They want to get more agility and speed into their digital marketing efforts. As the investments grow the amount of work involved in marketing, is growing exponentially and they really need a system to be able to manage work so they get the right efficiency, productivity and collaboration across their teams.”\n\nWorkfront has seen interest in its software increase during the pandemic as marketing companies seek to get more insight into which employees are working on what part of a project, Alex Shootman, Workfront’s chief executive officer, said in an interview. The Adobe acquisition, he said, is an “awesome outcome.”\n\n“When you have an opportunity to work with the company that CMOs rely on to run their business, which is Adobe, and you’re a company like Workfront, that takes us forward years in terms of what we would have been able to accomplish on our own,” Shootman said.\n\nShootman will continue to run the Workfront team and will report to Chakravarthy when the acquisition is completed.\n\nWorkfront has raised about $100 million to date, according to PitchBook. Last year, W Capital Partners, Susquehanna Growth Equity and AllianceBernstein’s AB Private Credit Investors acquired a minority stake in the company after buying out some of its investors for $280 million. It’s also backed by OpenView, Greenspring Associates and JMI Equity.\n\nThe company, formerly known as AtTask, was founded in 2001 by Scott Johnson, who is now its chairman. Workfront said last year that it had generated $200 million in revenue in 2018.\n\n[Source](https://www.bloomberg.com/news/articles/2020-11-09/adobe-said-to-be-in-talks-to-acquire-workfront-for-1-5-billion)",
        "subreddit": "stocks",
        "title": "Adobe to Buy Workfront for $1.5 Billion to Aid Collaboration",
        "url": "https://www.reddit.com/r/stocks/comments/jsa65m/adobe_to_buy_workfront_for_15_billion_to_aid/",
        "created": 1605137511.0
    },
    {
        "author": "evan843",
        "created_utc": 1605408507,
        "id": "juen6a",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Amazon and Adobe on Tiktok bullish",
        "url": "https://i.redd.it/3jhj9gw7ibz51.jpg",
        "created": 1605437307.0
    },
    {
        "author": "Berisha11",
        "created_utc": 1605830617,
        "id": "jxeg94",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "The company owns the game engine that is used to create games. How exactly do they make their money? Is it like Adobe where the users of the engines pay every month to use their game engine?\n\nI read somewhere that they take royalties for every game sold that used their engine, is this true? So for example, everytime someone buys Among Us on Steam, does Unity Software get a piece of the pie from that purchase?",
        "subreddit": "stocks",
        "title": "How does Unity Software (U) make money?",
        "url": "https://www.reddit.com/r/stocks/comments/jxeg94/how_does_unity_software_u_make_money/",
        "created": 1605859417.0
    },
    {
        "author": "hero_guy1",
        "created_utc": 1606185681,
        "id": "jzwh47",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Nutanix is fairly small, \\~5B market cap. They provide a hybrid cloud solution. They are cheap compared to other cloud companies, at only 5x revenue.\n\nA big reason for their drop in share price over the years is due to their transition from licensing based sales to subscription based revenue. As we all know, businesses that have successfully made this transition in the past have seen impressive gains (Adobe, AutoDesk, etc).\n\nHas anyone ever done much research on Nutanix and care to share their thoughts?",
        "subreddit": "stocks",
        "title": "Thoughts on Nutanix? (NTNX)",
        "url": "https://www.reddit.com/r/stocks/comments/jzwh47/thoughts_on_nutanix_ntnx/",
        "created": 1606214481.0
    },
    {
        "author": "spacej3di",
        "created_utc": 1605042251,
        "id": "jrtkg7",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "**Rotation from growth to value continues:**\n\n* Value outperformed growth by another \\~240 bps on Tuesday after Monday's 450 bp gap, which reversed four months of growth outperformance in one session. Came after favorable coronavirus vaccine news, which helped the rotation continue today. A vaccine breakthrough has long been flagged as the most powerful tailwind for a sustained rotation following the longstanding upside leadership of growth and momentum factors. There has also been some focus on positive economic and earnings surprise momentum as drivers, while analysts have highlighted extreme positioning and valuation divergences as well. In addition, while a split Congress has taken the likelihood of meaningful fiscal stimulus off the table, additional support is still coming. While value and cyclicals do face headwinds from worsening coronavirus trends, growth has also seemed to run up against some very elevated expectations, a dynamic evidenced by the lackluster reaction to strong Q3 earnings.\n\n**Growth sectors extend yesterday's historic underperformance:**\n\n* Growth sectors underperformed again. **Tech,** **consumer discretionary and** **communication services** were the only sectors lower with the FAANGs mostly down. Software, semis, restaurants, travel and leisure also among weaker groups. **Healthcare** an outperformer on gains across pharma and distributors, while hospitals mostly extended yesterday's gains. **Financials** ahead with insurers the best group, offsetting weakness across banks, particularly moneycenters. **Materials** led by chemicals. **Industrials** saw broad gains, particularly A&amp;D, rails, and electricals/multis. **Consumer staples** ahead with drug stores, tobacco, beverages among the best groups. **Energy** the best performer WTI higher as IOCs extended Monday's big gains.\n\n**Busy day of Fedspeak:**\n\n* **Dallas' Kaplan** (voter) told [Bloomberg](https://www.bloomberg.com/news/articles/2020-11-10/fed-s-kaplan-says-virus-resurgence-threatens-next-two-quarters?sref=J9GPLx1B) the next two quarters will be difficult, but he sees a strong 2021, expecting 3.5% growth. In [testimony](https://www.federalreserve.gov/newsevents/testimony/quarles20201110a.htm) to a Senate committee, **Vice Chair for Supervision Quarles** said bank strength remains intact with high liquidity and capital levels, **Boston's Rosengren** (non-voter) said in a [speech](https://www.bostonfed.org/-/media/Documents/Speeches/PDF/20201110-text.pdf) policymakers should watch for imbalances as they emerge, and that excessive risk-taking could prolong economic distress, based on previous cycles. **San Francisco's Daly** (non-voter) told [CNBC](https://www.cnbc.com/2020/11/10/fed-officials-in-robust-discussions-about-the-future-of-their-asset-purchase-program.html) that the Fed is in discussions over what more it can do around asset purchases and how the bank should plan communications around asset purchases moving forward. The Fed is currently purchasing \\~$120B a month in bonds, though many believe it could increase the amount and/or change the composition of purchases, though [WSJ](https://www.wsj.com/articles/fed-turns-attention-to-asset-purchases-after-spelling-out-low-rate-pledges-11604226601) noted broad skepticism that strategy would do much given already-low rates.\n\n**McConnell repeats call for limited stimulus package:**\n\n* Senate Majority Leader McConnell (R-KY) on Monday called for limited stimulus bill by year-end, in the wake of positive news on a coronavirus vaccine and falling unemployment ([Bloomberg](https://www.bloomberg.com/news/articles/2020-11-09/mcconnell-calls-for-smaller-stimulus-after-pfizer-vaccine-data?srnd=premium-asia&amp;sref=J9GPLx1B)). Also said this afternoon he will be speaking with House Leader Pelosi, though looking for highly targeted deal ([The Hill](https://thehill.com/homenews/senate/525364-mcconnell-pushing-for-highly-targeted-covid-relief-deal?__twitter_impression=true)). Other Republican senators warned getting a deal done in the lame duck session will be hard and signaled openness to wrapping a stimulus package into a spending bill needed to avoid a government shutdown on 11-Dec. Elsewhere, [WSJ](https://www.wsj.com/articles/stimulus-defense-bill-on-congresss-long-to-do-list-11605032240) noted President-elect Biden expected to play bigger role in stimulus discussion during lame duck to pave path for agreement before he takes office. While Senate Republicans have been focused on a bill worth \\~$500B, House Democrats have insisted it must be in excess of $2T. Odds of a stimulus bill before 2021 further complicated by Trump's refusal to concede and run-off elections in Georgia in early January that could determine control of Senate next year.\n\n**Vaccine breakthrough also brings key unanswered questions, logistical challenges:**\n\n* [Bloomberg](https://www.bloomberg.com/news/articles/2020-11-09/pfizer-vaccine-results-leave-questions-about-safety-longevity?srnd=premium&amp;sref=L75TRUmI) noted that amid all the excitement surrounding news the coronavirus vaccine candidate from Pfizer (PFE-US ) and BioNTech (BNTX-US ) was more than 90% effective in late-stage trials, there are still a number of issues to be sorted out. It highlighted uncertainty over how long the vaccine will confer protection and how many will benefit. Also pointed out the headline number says little about what kind of cases are being prevented. Added that vaccines like Pfizer's must be stored at ultra-cold temperatures. [WSJ](https://www.wsj.com/articles/the-next-big-challenge-after-a-covid-vaccine-is-giving-it-to-enough-people-11604945455?mod=hp_lead_pos1) also discussed the myriad logistical challenges surrounding production and distribution. Pointed out that even at a much better than expected efficacy rate of 90%, at least three-quarters of the population would have to be inoculated to achieve herd immunity and life may not return to normal until 2022.\n\n**Checking in on the bullish narrative:**\n\n* As has been the case for the better part of the last seven or eight months, the biggest tailwind for stocks seems to be the unprecedented fiscal and monetary policy response to the coronavirus pandemic, with BofA pegging the combined stimulus at over $21T. Vaccine optimism has also played a meaningful role, with recent news of a near-term breakthrough driving a rotation to value and cyclical plays. At the same time, there are thoughts that growth factors are likely to be protected by favorable secular themes. Resilient corporate earnings, largely a function of operating leverage, have been another widely discussed bright spot. The removal of the election overhang has also helped and the likelihood of a split Congress and no meaningful shift in tax and regulatory policy has overshadowed earlier hopes for more significant coronavirus and infrastructure stimulus.\n\n**Checking on the bearish narrative:**\n\n* While stimulus has been the big driver of the bullish narrative for stocks, there continue to be concerns about depleted monetary policy arsenals and worries central banks are increasingly is pushing on a string. In addition, there is no appetite for meaningful fiscal stimulus in a Republican controlled Senate. Worsening coronavirus trends have been largely overshadowed by vaccine optimism but represent a headwind on growth, even without a return to the draconian lockdown measures seen early on in the pandemic. A rotation out of growth has some broader market implications given the extent to which the S&amp;P 500 is concentrated in big tech. There are also potential risks from the bond market given the massive inflows driven by a reach for yield. While earnings beat rates have been strong, they have benefited from bombed-out expectations and the bar is moving higher.\n\n**Supreme Court signals it is unlikely to strike down Obamacare**\n\n* [Politico](https://www.politico.com/news/2020/11/10/supreme-court-obamacare-kavanaugh-435711), the [NY Times](https://www.nytimes.com/2020/11/10/us/supreme-court-obamacare-aca.html) and other outlets discussed how the Supreme Court on Tuesday signaled that Obamacare would likely survive its third major legal challenge. Noted that at least five justices, including two members of the court's conservative majority, suggested the individual mandate was severable from the rest of the law. Other conservative justices also expressed doubt about whether Congress' decision to scrap the penalty for failing to secure health insurance because it could be no longer be justified as a tax, caused any harm to the plaintiffs. While the case has been widely viewed as weak, there still have been concerns about the fate of Obamacare under the court's enhanced conservative majority. This development has driven the outperformance of managed care (particularly managed Medicare) and hospital stocks.\n\n**Amazon under regulatory scrutiny in Europe:**\n\n* European Commission filed charges against Amazon (AMZN-US ) on Tuesday after it concluded it breached antitrust rules by using third-party sellers' data for its own benefit. EU launched probe into Amazon in June 2019 and WSJ reported in June of this year it was planning formal antitrust challenges. Brussels said today it is also launching a second investigation into Amazon's e-commerce processes. While big tech has come under heightened regulatory scrutiny in both the US and Europe, it has not been much on overhang on equity sentiment as the group has been a big beneficiary of its leverage to secular growth and disruption themes, several aspects of which have been accelerated by the coronavirus. The bigger threat to the group from near-term perspective seems to be a vaccine-driven rotation from these very crowded longs to under-owned value and cyclical plays.\n\n**NextEra rebuffed by Evergy, Lowe's not in talks to acquire HD Supply, Justice Department clears Uber purchase of Postmates:**\n\n* [Reuters](https://uk.reuters.com/article/evergy-ma-nextera-energy/exclusive-nextera-energy-in-15-billion-bid-for-evergy-sources-idUKL1N2HV2J0) reported that **NextEra** (NEE-US ), the world's largest producer of solar and wind energy, made a \\~$15B all-stock offer to acquire US power utility **Evergy** (EVRG-US ). However, Evergy rejected the offer and it is unclear whether NextEra, which was also recently rebuffed buy Duke Energy (DUK-US ), will make a new approach. **Lowe's** (LOW-US ) said in a [statement](https://www.streetaccount.com/EmailSearchHandler.axd?guid=9a8c0f36-641d-4398-b382-a4e7dacf3827&amp;press_release=true&amp;ticker=HDS&amp;iid=2911999) that it is not in discussions with **HD Supply** (HDS-US ) about a transaction. Followed earlier [Bloomberg](https://www.bloomberg.com/news/articles/2020-11-09/lowe-s-is-said-to-be-in-talks-to-acquire-hd-supply?sref=L75TRUmI) report that said the companies were discussing a deal. [Axios](https://www.axios.com/doj-clears-uber-postmates-deal-566fed38-2d2a-4a1d-95af-45fd61df57bc.html) cited a source familiar with the deal who said the Justice Department has cleared **Uber**'s (UBER-US ) $2.65B all-stock deal to acquire food delivery company **Postmates**. **Adobe** (ADBE-US ) confirmed agreement to acquire privately held **Workfront**, a work management platform for marketers, for $1.5B.\n\n**Post-election transition slowed by legal challenges:**\n\n* [Axios](https://www.axios.com/bill-barr-voter-fraud-investigations-7bfc378a-35f8-467f-9e74-10aa57c8c7d5.html) noted that President Trump has refused to concede the election to President-elect Biden, reiterating allegations of widespread voter fraud and corruption despite a lack of specific evidence. Added that his claims have been shot down by Democratic and Republican secretaries of state. [Bloomberg](https://www.bloomberg.com/news/articles/2020-11-09/trump-campaign-s-legal-blitz-isn-t-targeting-enough-votes-to-win?sref=L75TRUmI) also discussed how Trump's legal challenges are unlikely to gain any meaningful traction. However, [NY Times](https://www.nytimes.com/2020/11/09/us/politics/republicans-trump-concede-2020-election.html?campaign_id=4&amp;emc=edit_dk_20201110&amp;instance_id=23967&amp;nl=dealbook&amp;regi_id=33659448&amp;segment_id=44093&amp;te=1&amp;user_id=2b41d3782bf056154514beb0de555f4d) pointed out that leading Republicans have coalesced around Trump's strategy. In addition, the [AP](https://apnews.com/article/election-2020-joe-biden-donald-trump-elections-voting-fraud-and-irregularities-4eeb9e0c97301a23ae8d05b54c3144fd) reported Attorney General Barr has authorized US attorneys to investigate alleged voter fraud. [Reuters](https://www.bloomberg.com/news/articles/2020-11-10/biden-transition-team-calls-on-federal-agency-to-declare-winner?sref=L75TRUmI) said the Biden transition team is considering legal action to force the General Services Administration to designate him the winner so that it can begin accessing federal resources needed to ensure an orderly transfer of power.\n\n**Political fight brewing over whether to extend Fed's emergency facilities:**\n\n* [NY Times](https://www.nytimes.com/2020/11/09/business/economy/federal-reserve-emergency-loans.html) discussed how a political fight is brewing over whether to extend the Fed's emergency loan programs, which expire on 31-Dec. Paper said that while the Fed might be inclined to keep the programs in effect, Treasury Secretary Mnuchin has signaled he would prefer to end the one that purchases municipal bonds, and has come under heightened pressure from Republicans to allow all five of the Treasury-funded programs to lapse. However, some Democrats had been looking to the municipal program as a backup option if Congress fails to pass additional funds for state and local governments. Paper highlighted some debate about the potential market impact of ending the programs. While they have seen little use, they have been a big part of the powerful Fed signaling effect that quickly helped repair credit markets earlier this year.",
        "subreddit": "stocks",
        "title": "Top Market News - Tuesday, Nov. 10, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/jrtkg7/top_market_news_tuesday_nov_10_2020/",
        "created": 1605071051.0
    },
    {
        "author": "king-ish",
        "created_utc": 1605413288,
        "id": "jufr2e",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "I’m new to investing, started this year and have about 6 ETF’s in my taxable account. My Roth IRA is pretty straight forward &amp; conservative. \n\nI definitely have some overlap in my funds but the holding percent &amp; growth it could see is why I have that. I’m not married to $FDIS $FHLC for 30+ years but like the potential of those two. \n\nSPlG - SPDR Portfolio S&amp;P 500 ETF\nExpense Ratio\n0.03%\n\nTOP 10 HOLDINGS\nCOMPANY\tSYMBOL\t                TOTAL NET ASSETS\nApple Inc.\tAAPL\t                                6.67%\nMicrosoft Corp.\tMSFT\t                         5.70%\nAmazon.com Inc.\tAMZN\t                 4.80%\nFacebook Inc. Cl A\tFB\t                         2.26%\nAlphabet Inc. Cl A\tGOOGL\t                  1.58%\nAlphabet Inc. Cl C\tGOOG\t                  1.55%\nBerkshire Hathaway Inc. BRK.B\t           1.51%\nJohnson &amp; Johnson\tJNJ\t           1.40%\nProcter &amp; Gamble Co.\tPG\t                   1.24%\nVisa Inc. Cl A\tV\t                                  1.21%\n\n\nITOT - iShares Core S&amp;P Total US Stock Market ETF\nExpense Ratio\n0.03%\n\nTOP 10 HOLDINGS\nCOMPANY\tSYMBOL\t             TOTAL NET ASSETS\nApple Inc.\tAAPL\t                              5.53%\nMicrosoft Corp.\tMSFT\t                       4.73%\nAmazon.com Inc.\tAMZN\t               3.98%\nFacebook Inc. Cl A\tFB\t                      1.87%\nAlphabet Inc. Cl A\tGOOGL\t               1.31%\nAlphabet Inc. Cl C\tGOOG\t               1.28%\nBerkshire Hathaway Inc. BRK.B\t        1.25%\nJohnson &amp; Johnson\tJNJ\t        1.16%\nProcter &amp; Gamble Co.\tPG\t                1.03%\nVisa Inc. Cl A\tV\t                               1.00%\n\n\n\nSMSP - SPDR portfolio S&amp;P 600 Small Cap ETF\nExpense Ratio\n0.05%\n\nTOP 10 HOLDINGS\nCOMPANY\tSYMBOL\t               TOTAL NET ASSETS\nMomenta Pharmaceuticals Inc          0.93%\nStamps.com Inc.\tSTMP\t               0.63%\nSimpson Manufacturing Co.\t       0.63%\nMeritage Homes Corp.\tMTH\t       0.62%\nNeogen Corp.\tNEOG\t                      0.62%\nNeoGenomics Inc.\tNEO\t               0.61%\nKinsale Capital Group Inc.\t               0.60%\nExponent Inc.\tEXPO\t                      0.55%\nProto Labs Inc.\tPRLB\t                      0.52%\nUFP Industries Inc.\tUFPI\t               0.52%\n\n\nFTEC - Fidelity MSCI Information Technology Index ETF\nExpense Ratio\n0.08%\n\nTOP 10 HOLDINGS\nCOMPANY\tSYMBOL\t              TOTAL NET ASSETS\nApple Inc.\tAAPL\t                            21.94%\nMicrosoft Corp.\tMSFT\t                     16.55%\nVisa Inc. Cl A\tV\t                             3.69%\nNVIDIA Corp.\tNVDA\t                     3.64%\nMastercard Inc.\tMA\t                             3.30%\nAdobe Inc.\tADBE\t                             2.58%\nSalesforce.com Inc.\tCRM\t      2.47%\nPayPal Holdings Inc.\tPYPL\t      2.40%\nIntel Corp.\tINTC\t                            2.40%\nCisco Systems Inc.\tCSCO\t             1.82%\n\n\nFHLC - Fidelity MSCI Health Care Index ETF\nExpense Ratio\n0.08%\n\nTOP 10 HOLDINGS\nCOMPANY\tSYMBOL\t          TOTAL NET ASSETS\nJohnson &amp; Johnson\tJNJ\t               8.18%\nUnitedHealth Group Inc.\tUNH\t       6.17%\nMerck &amp; Co. Inc.\tMRK\t                      4.37%\nPfizer Inc.\tPFE\t                                             4.25%\nAbbott Laboratories\tABT\t               4.02%\nThermo Fisher Scientific Inc.\tTMO\t3.64%\nAbbVie Inc.\tABBV\t                                     3.23%\nAmgen Inc.\tAMGN\t                                     3.12%\nMedtronic PLC\tMDT\t                              2.91%\nDanaher Corp.\tDHR\t                              2.86%\n\n\nFDIS - Fidelity MSCI Consumer Discretionary Index ETF\nExpense Ratio\n0.08%\n\nTOP 10 HOLDINGS\nCOMPANY\tSYMBOL\t       TOTAL NET ASSETS\nAmazon.com Inc.\tAMZN\t        32.20%\nTesla Inc.\tTSLA\t                       7.68%\nHome Depot Inc.\tHD\t                7.20%\nMcDonald's Corp.\tMCD\t        3.94%\nNike Inc. Cl B\tNKE\t               3.76%\nLowe's Cos.\tLOW\t               3.02%\nStarbucks Corp.\tSBUX\t        2.42%\nTarget Corp.\tTGT\t               1.90%\nBooking Holdings Inc.\tBKNG\t1.69%\nTJX Cos.\tTJX.                      \t1.61%",
        "subreddit": "investing",
        "title": "Can some review my Taxable account 😱",
        "url": "https://www.reddit.com/r/investing/comments/jufr2e/can_some_review_my_taxable_account/",
        "created": 1605442088.0
    },
    {
        "author": "andromedacomp",
        "created_utc": 1606067398,
        "id": "jyzwt2",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "https://preview.redd.it/d3o0oce8xt061.jpg?width=1200&amp;format=pjpg&amp;auto=webp&amp;s=46561111bf70e5357ed6fc0ce0bd5d2d68610e32\n\n&amp;#x200B;\n\nThis article presents tips, strategies and alternatives to avoid or mitigate the effects of a ransomware attack in our organization.\n\n**What is ransomware?**\n\nAccording to Wikipedia's definition, ransomware (\"data hijacking\" in Spanish) is a type of malware that restricts access to certain parts or files of the infected operating system and asks for a ransom in exchange for removing this restriction. Some types of Ransomware encrypts operating system files rendering the device unusable and coercing the user to pay the ransom.\n\nThis type of attack has become very popular in recent times and is one of the most dangerous in the sense that it causes the immediate and total loss of the victim's data (in the absence of backup copies). This article presents tips, strategies and alternatives to avoid or mitigate the effects of a ransomware attack in our organization.\n\n**General guidelines for users**\n\n* Never click on unverified links.\n* Do not open attachments from strangers.\n* Only download files from trusted sites.\n* Never give personal data, much less credentials (username / password).\n* Never connect third-party USB media.\n* Never connect to public WiFi networks (without WPA2 security).\n\n**Virtual Desktops**\n\nMaking use of virtual desktops (which users access via RDP or another protocol) can be a comprehensive security solution in the sense that it will allow us to have total control over the security of the client terminals. In this way we can apply the policies that are necessary and the principle of least privilege to minimize risks as much as possible.\n\nOn the other hand, customers would not worry about the setup of applications and services used by CA, at the cost of having to provide a more comprehensive technical support service.\n\nHowever, the costs of deploying WVD (Windows Virtual Desktop) in Azure can be high. The WVD Pricing Guide (Windows Virtual Desktop) article looks at a 10-user witness case where it estimates a total cost of more than $ 420 per month.\n\n**Benefits**:\n\n* Full control over workstations that allows you to apply the principle of least privilege and maximize security.\n* Distract yourself from the heterogeneous farm of client operating systems.\n\n**Costs**:\n\n* High cost of service (money).\n* Service setup cost (hours of research, testing, setup and maintenance of the DVs).\n* Cost of internal support to our users (weekly support hours).\n\n**Windows Clients**  \n\n\n* GPO restrictions can be set to prevent not only ransomware, but general malware from being installed. GPO has the ability to provide granular control over the execution of files on a system. So, adding rules that block activities such as executing files from common directories (ProgramData, AppData, Temp and Windows \\\\ SysWow) or preventing executables from running from email attachments.\n* Use antivirus software and keep it updated.\n* Keep applications updated (browsers, mail clients, Java, Adobe, etc.).\n* Remove administrative privileges from users.\n* Configure the folder options so that it always shows the extensions (essential so that the user can distinguish a \"disguised\" executable).\n* Disable Windows Script Host and Windows PowerShell.\n* Disable macros and ActiveX in Office.\n* Install a browser with blocking Ads and Popups.\n* Disable Autoplay.\n* Disable Remote Desktop on the client (this prevents the attacker from taking control of the client operating system).\n\n**Google Drive / Docs / G Suite**  \n\n\nEncrypting Drive files with ransomware is a real threat, although it doesn't have as much impact thanks to Drive's trash (many ransomware delete files before creating the encrypted copy) and version control.\n\nGoogle Drive has a change control mechanism that allows you to recover files to a previous version:\n\n* View activity &amp; file versions\n\nIt is unclear how many copies and for how long.\n\nBeyond this, you can implement a periodic backup script (for example daily or weekly) that synchronizes the Drive files and uploads them to a third-party service or repository:\n\n* Your backups to Google Drive automatically\n* drive - drive is a tiny program to pull or push Google Drive files (written in Go)\n\nOf course this type of solution must be of type \"pull\" and asynchronous. This prevents an attacker from accessing the backups.\n\n**Dropbox**  \n\n\nWith Dropbox it is the same as with Drive. It can be a tempting target for ransomware attacks.\n\nThere is a CLI for Linux (developed by a third party) also written in Go (excellent):\n\n* **dbxcli:** A command line tool for Dropbox users and team admins\n\n**Conclusions**  \nThe most important and basic way to mitigate the effect of these attacks is to have backups in the cloud. In the case of Drive / Dropbox, keep regular backups elsewhere (for example, in an AWS S3 bucket). If you do not have an alternative backup strategy, it is necessary to implement it as soon as possible to be covered in an attack case.\n\nAn alternative to WVD would be to define security policies and implement a security script for Windows user environments. This for the case in which we do not have a network of corporate workstations, but rather that each user uses their own hardware.\n\n# [SOURCE](https://www.andromedacomputer.net/en/blog-english/329-mitigate-and-prevent-ransomware-attacks-in-2021)",
        "subreddit": "SecurityAnalysis",
        "title": "Mitigate And Prevent Ransomware Attacks In 2021",
        "url": "https://www.reddit.com/r/SecurityAnalysis/comments/jyzwt2/mitigate_and_prevent_ransomware_attacks_in_2021/",
        "created": 1606096198.0
    },
    {
        "author": "coffeebeerwhiskey",
        "created_utc": 1606489205,
        "id": "k22mil",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Load up on this boomer stock while premiums are still dirt cheap.",
        "subreddit": "wallstreetbets",
        "title": "Buy ADBE 500 12/4 &amp; 12/11",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k22mil/buy_adbe_500_124_1211/",
        "created": 1606518005.0
    },
    {
        "author": "Brothanogood",
        "created_utc": 1605082400,
        "id": "js4ap6",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Adobe Inc. said it will acquire Workfront Inc. for $1.5 billion to add a collaboration tool to its marketing software, providing expanded offerings during a pandemic that has forced companies to maintain productivity while employees work from home.\n\nThe deal is expected to close sometime from December to February 2021, San Jose, California-based Adobe said Monday in a statement. Workfront, based in Lehi, Utah, will take its 3,000 corporate customers and 1 million users to the software maker best known for Photoshop. Bloomberg earlier reported that the acquisition could come as soon as Monday.\n\nAdobe has been a leader in the graphics and visual software industry for decades, but hasn’t offered collaboration tools. The company’s shares, which have climbed 43% this year, declined 4.8% to $471.14 at the close in New York.\n\nAfter recent stumbles, the acquisition is Adobe’s biggest effort to reorient its Experience Cloud division, which includes marketing, advertising and analytics software, toward areas that are growing. The company has sought to make its creative and business applications more collaborative, so that teams can more easily work together on projects. During the Covid-19 pandemic, businesses have found it essential to have better communication among colleagues working remotely. Adobe has curtailed some of its advertising services that had a low profit margin and said it had a new strategy of catering to customers that use multiple Experience Cloud tools.\n\nUnlike other makers of work productivity tools, including Asana Inc. and Atlassian Inc., which owns Trello, Workfront is focused on marketers, who use the software every day to “manage content, plan and track marketing campaigns and execute complex workflows across teams,” Adobe said in the statement. Marketers are also major clients for Adobe, which already integrates several of its products with Workfront’s offering.\n\nWorkfront will be Adobe’s fifth-biggest acquisition, according to data compiled by Bloomberg.\n\nThe purchase marks the first major action by Anil Chakravarthy, an executive vice president, who joined Adobe in January after serving as chief executive officer of Informatica LLC. Chakravarthy said in an interview that Adobe and Workfront have more than 1,000 mutual clients.\n\n“Every customer that we talk to is investing more and more in digital marketing,” he said. “They want to get more efficiency out of digital marketing efforts. They want to get more agility and speed into their digital marketing efforts. As the investments grow the amount of work involved in marketing, is growing exponentially and they really need a system to be able to manage work so they get the right efficiency, productivity and collaboration across their teams.”\n\nWorkfront has seen interest in its software increase during the pandemic as marketing companies seek to get more insight into which employees are working on what part of a project, Alex Shootman, Workfront’s chief executive officer, said in an interview. The Adobe acquisition, he said, is an “awesome outcome.”\n\n“When you have an opportunity to work with the company that CMOs rely on to run their business, which is Adobe, and you’re a company like Workfront, that takes us forward years in terms of what we would have been able to accomplish on our own,” Shootman said.\n\nShootman will continue to run the Workfront team and will report to Chakravarthy when the acquisition is completed.\n\nWorkfront has raised about $100 million to date, according to PitchBook. Last year, W Capital Partners, Susquehanna Growth Equity and AllianceBernstein’s AB Private Credit Investors acquired a minority stake in the company after buying out some of its investors for $280 million. It’s also backed by OpenView, Greenspring Associates and JMI Equity.\n\nThe company, formerly known as AtTask, was founded in 2001 by Scott Johnson, who is now its chairman. Workfront said last year that it had generated $200 million in revenue in 2018.\n\n[Source](https://www.bloomberg.com/news/articles/2020-11-09/adobe-said-to-be-in-talks-to-acquire-workfront-for-1-5-billion)",
        "subreddit": "stocks",
        "title": "Adobe to Buy Workfront for $1.5 Billion to Aid Collaboration",
        "url": "https://www.reddit.com/r/stocks/comments/js4ap6/adobe_to_buy_workfront_for_15_billion_to_aid/",
        "created": 1605111200.0
    },
    {
        "author": "NoeticOptions",
        "created_utc": 1606512658,
        "id": "k2a45i",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "## Daily Synopsis \n* The S&amp;P 500 eked out a gain of +0.28% today while the NASDaq had a small gain of (+0.93%). The Russell 2000 advanced (+0.43%). The Dow ended in positive territory at (+0.17%)\n* The best performing sector was Health Care(+0.92%) while Energy(-1.17%)was the worst performer.\n* The price action in the S&amp;P 500 generally lacked conviction given the reduced market participation, although trading volume at the Nasdaq was three times higher today than the same time last year. In addition, the market never got the risk-on signal from the Treasury market, which traded higher throughout the morning. \n* Retail stocks also had a decent outing after Adobe Analytics said Thanksgiving Day spending rose nearly 22% yr/yr to a record $5.1 billion. Adobe expects Black Friday and Cyber Monday sales to be great for retailers, too, as more consumers shop online this year. The SPDR S&amp;P Retail ETF (XRT 61.21, +0.52, +0.9%) increased 1% to extend its weekly gain to 6.3%. \n* Investors did not receive any economic data on Friday. Looking ahead, investors will receive the Chicago PMI for November and Pending Home Sales for October on Monday. \n*  \n## Index Summary\n **S&amp;P 500 :** (+0.28%); **NasDaq :** (+0.93%); \\\n**Russell 2000 :** (+0.43%); **Dow :** (+0.17%); \\\n**Vix :** 21.25 (-1.93%); [-9.82%]; {-9.78%} \n## Sectors Summary \n_Three highest sectors for today were -_ \n **Health Care:** (+0.92%); **Communication Services:** (+0.64%); **Information Technology:** (+0.53%)\n _Three lowest sectors for today were -_\n **Energy:** (-1.17%); **Utilities:** (-0.99%); **Financials:** (-0.32%)\n ## Commodities/Futures \\\n_**Top 5 Highest Commodity % Changes – -**_ \\\n\n1\\. Coffee,(KC) 124.48 +9.98 (8.02%)  \n2\\. Natural Gas,(NG) 2.896 +0.12 (4.18%)  \n3\\. Lumber,(LB) 617.1 +16.6 (2.69%)  \n4\\. Copper,(HG) 3.422 +0.07 (2.13%)  \n5\\. Zinc,(MZN) 2808.75 +45.5 (1.62%)  \n\n**Top 5 Lowest Commodity % Changes -**  \n1\\. Wheat,(W) 596.5 -21.0 (-3.52%)  \n2\\. Silver,(SI) 22.68 -0.54 (-2.36%)  \n3\\. Cocoa,(CC) 2724.0 -61.0 (-2.24%)  \n4\\. Sugar,(SB) 14.77 -0.27 (-1.83%)  \n5\\. Brent Crude,(LCO) 47.8 -0.81 (-1.69%)   \n## Anticipated Earnings for this Week - \n **Monday Earnings -** \nNo Earnings \n**Tuesday Earnings -** \n**PSTG** 18.43 +0.3,(+1.65%);\n **ADI** 137.7 +1.75,(+1.29%);\n **AMWD** 92.655 +1.005,(+1.1%);\n **HRL** 47.2 +0.33,(+0.7%);\n **GPS** 21.75 +0.15,(+0.69%);\n **DELL** 69.82 +0.47,(+0.68%);\n **ADSK** 272.9 +1.66,(+0.61%);\n **EV** 68.72 +0.14,(+0.2%);\n **HPQ** 22.27 +0.02,(+0.09%);\n **AEO** 18.5 +0.01,(+0.05%);\n  \n**Wednesday Earnings -** \n**DE** 261.95 +5.52,(+2.15%);\n  \n**Thursday Earnings -** \nNo Earnings \n**Friday Earnings -** \nNo Earnings \n## Dark Pool Summary - \nHighest Dark Pool buys by rank -\n 1. AZN 12 buys totaling 5,044,500 shares. Average Price : 52.01, Cost : $262,526,582\n 2. NFLX 1 buys totaling 465,000 shares. Average Price : 483.0, Cost : $224,592,722\n 3.BABA 3 buys totaling 765,000 shares. Average Price : 276.33, Cost : $211,417,851\n 4.MSFT 2 buys totaling 880,799 shares. Average Price : 215.23, Cost : $189,574,369\n 5. TSLA 1 buys totaling 308,859 shares. Average Price : 585.76, Cost : $180,917,248\n ## Options Fast Facts -\n_**CBOE Put/Call Ratio**_ - 0.40\\\n_**Highest Multiple Over Daily Average**_- \nSRAC with 11x the ADV of 1504. There were 13468 calls and 3011 puts. \\\n_**Ticker with Most Contracts**_ -PLTR with 1480655 contracts traded today with an AVD of 297394. There were 893284 calls and 587371 puts.\\\n_**Largest Put / Call Ratio -**_ JNK with a 112 P/C ratio. There were 11789puts and 105 calls. \\\n_**Largest Call / Put Ratio -**_ STM with a115 C/P ratio. There were 28581 calls and 248 puts. \n*Stocks must be &gt;$6, Highest Multiple must have &gt;1k ADV, Largest ratios must have an option volume &gt;10k",
        "subreddit": "stocks",
        "title": "Market and Options Summary for Nov-27-2020",
        "url": "https://www.reddit.com/r/stocks/comments/k2a45i/market_and_options_summary_for_nov272020/",
        "created": 1606541458.0
    },
    {
        "author": "WarrenBuffalo",
        "created_utc": 1605045496,
        "id": "jrulx2",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "My entire portfolio is made up out of travel, leisure and oil. Over the past months people have ridiculed me for this portfolio and over the past two days my portfolio has been up nearly 25%.\n\nMy holdings are: WYNN, JWN, RTX, RDSA, Groupe ADP and AMADY.\n\nAlso people say I should sell after this rally driven by vaccine euphoria but we are not nearly at the old highs of these stocks so I will just keep holding on for dear life until it atleast gives me a 100% return and we get to the other side of this coronavirus mess. In the meantime I will collect juicy dividends.",
        "subreddit": "wallstreetbets",
        "title": "Travel stocks not so bad after all?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jrulx2/travel_stocks_not_so_bad_after_all/",
        "created": 1605074296.0
    },
    {
        "author": "WarrenBuffalo",
        "created_utc": 1605045660,
        "id": "jrunu5",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "My entire portfolio is made up out of travel, leisure and oil. Over the past months people have ridiculed me for this portfolio and over the past two days my portfolio has been up nearly 25%.\n\nMy holdings are: WYNN, JWN, RTX, RDSA, Groupe ADP and AMADY.\n\nAlso people say I should sell after this rally driven by vaccine euphoria but we are not nearly at the old highs of these stocks so I will just keep holding on for dear life until it atleast gives me a 100% return and we get to the other side of this coronavirus mess. In the meantime I will collect juicy dividends.",
        "subreddit": "stocks",
        "title": "Travel stocks not so bad after all?",
        "url": "https://www.reddit.com/r/stocks/comments/jrunu5/travel_stocks_not_so_bad_after_all/",
        "created": 1605074460.0
    },
    {
        "author": "WSBConsensus",
        "created_utc": 1605105344,
        "id": "js96vk",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "#DOW JONES\n\n**Boeing Company (BA)** has been awarded a USD 9.8bln Air Force Contract for F-15 support for Saudi Arabia. It also filed to sell 16.7mln shares for the Boeing Company Employee Retirement Plan.\n\n**JPMorgan Chase &amp; Co. (JPM)** is no longer the world’s most systemically-important bank, according to the Financial Stability boards rankings for additional capital requirements, where it now has to hold extra capital equivalent to 2.0% from 2.5%.\n\n**Raytheon Technologies (RTX)** is to acquire privately-held Blue Canyon Technologies, a leading provider of small satellites and spacecraft systems components.\n\n#NASDAQ 100\n\n\n**Advanced Micro Devices Inc (AMD) and International Business Machines (IBM)** announce a joint development agreement to advance confidential computing for the Cloud and to accelerate artificial intelligence.\n\n**Amazon.com Inc. (AMZN)** has requested that India's market regulator investigates its business partner Future Retail for insider trading.\n\n**Automatic Data Processing (ADP)** raised its quarterly dividend to USD 0.93/shr (prev. USD 0.91).\n\n**JD.Com** announced transaction volume on its platform was CNY 200bln midnight Beijing time.\n\n**Moderna (MRNA)** cancer treatment mRNA-4157 in combination with Keytruda is well tolerated at all dose levels and produced responses as measured by tumour shrinkage. Co also affirmed that the first interim analysis of its COVID-19 vaccine trial is still expected in November (previously guided for Nov 24th/25th); Emergency Use Authorisation filing seen in early-December.\n\n**Tesla (TSLA)** will produce its Model Y at its Shanghai Gigafactory 3 in 2021. Note, *BMW (BMW GY)* has unveiled its electric SUV to challenge TSLA and is planning a US launch in 2022.S&amp;P 500\n\n**Air Products &amp; Chemicals Inc (APD)** Q3 20 (USD): EPS 2.19 (exp. 2.21), Revenue 2.3bln (exp. 2.27bln). FY EPS (ex-items) view 8.38 (exp. 8.39)\n\n**AT&amp;T Inc. (T)** WarnerMedia unit is expected to lay up to 1,750 workers, according to reports, which equates to roughly 7% of its workforce.\n\n**Dish Network (DISH) and Qualcomm Inc. (QCOM)** announced their collaboration to test open and virtualised RAN 5G solutions containing the new Qualcomm 5G RAN Platforms to help fast track the rollout of the nation’s first cloud-native, open RAN-compliant 5G network.\n\n**General Electric (GE)** has ended its Corporate Audit Staff program, as part of CEO Culp’s efforts to simplify its operations.\n\n**Invesco Ltd. (IVZ)** reported preliminary month-end AUM -1.0% m/m at USD 1.207trln (negatively impacted by unfavourable market returns); total net outflows were USD 2.3bln. IVZ said it achieved net long-term inflows of USD 2.5bln in the month.\n\n**Pfizer Inc. (PFE)** announces positive results from its fifth Phase 3 trial of abrocitinib, evaluating the safety and efficacy across different dosing regimes for patients with atopic dermatitis. *The co. and BioNTech (BNTX)* confirmed it is to supply the EU with up to 300mln doses of its COVID vaccine, although separate reports note it could become a problem to distribute to the population due to the ultra-cold temperatures it needs to be stored at. Note, the CEO sold 132,500 shares for USD 5.56mln, roughly 62%.\n\n#OTHER\n\n\n**Alcon AG (ALC)** Q3 20 (USD): EPS 0.39 (exp. 0.22), Revenue 1.82bln (exp. 1.67bln). Not providing guidance.\n\n**Alibaba (BABA)** announced orders on its e-commerce platforms during Singles’ Day exceeded USD 56bln by Wednesday morning.\n\n**Amdocs Ltd (DOX)** Q4 20 (USD): EPS 1.23 (exp. 1.19), Revenue 1.05bln (exp. 1.03bln). Q1 21 EPS view 1.09-1.15 (exp. 1.14), revenue 1.055-1.095bln (exp. 1.06bln). FY21 EPS growth view roughly 5-9% Y/Y, revenue growth view 3.5-7.5%.\n\n**CommScope (COMM) and Nokia (NOK)** collaborate on a new interleaved passive-active antenna supporting 5G rollouts.\n\n**Datadog Inc (DDOG)** Stronger than expected quarter and guidance but misses frothy buy-side expectations. Q3 20 (USD): Adj. EPS 0.05 (exp. 0.01), Revenue 155mln (exp. 144mln). *Extends Google Cloud (GOOG)* strategic partnership into new areas. Q4 EPS view 0.01-0.02 (exp. 0.01), revenue view USD 162-164mln (exp. 155mln) FY adjusted EPS view USD 0.17-0.18 (exp. 0.12), FY revenue view USD 588-590mln (exp. 572mln).\n\n**Lyft Inc (LYFT)** Beats quarter estimates and affirms path to profitability. Q3 20 (USD): Adj. -0.89 (exp. -0.91), Revenue 0.5bln (exp. .49bln). Remains focused on achieving adj. EBITDA profitability by Q4 next year. Q3 active rides -44% to 12,513, revenue per active rider -7% to USD 39.94. Q4 revenue view +11-15 Q/Q (exp. 0.655bln).\n\n**Palo Alto Networks (PANW)** announced its intent to acquire Expanse for roughly USD 670mln in cash and stock.\n\n**Qiagen (QGEN)** is commencing its share repurchase programme which was announced in May 2019.\n\n**Rocket Companies Inc (RKT)** Q3 20 (USD): EPS 0.54 (exp. 1.09), Revenue 4.63bln (exp. 4.56bln). Q4 closed loan volume USD 88-93bln, +73-80% Y/Y.T. \n\n**Rowe Price Group (TROW)** preliminary AUM USD 1.3trln on October 31st.\n\n**Tencent Music Entertainment Group (TME)** Q3 20 (USD): EPS 0.12 (exp. 0.11), Revenue 1.12bln (exp. 1.13bln). Online music paying users +46% Y/Y to 51.7mln.",
        "subreddit": "wallstreetbets",
        "title": "A lil morning coffee",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/js96vk/a_lil_morning_coffee/",
        "created": 1605134144.0
    },
    {
        "author": "NoeticOptions",
        "created_utc": 1604439487,
        "id": "jnjgiq",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "## Daily Synopsis \n* The S&amp;P 500 increased +1.77% today while the NASDaq added (+1.73%). The Russell 2000 rose by (+2.84%). The Dow ended in positive territory at (+2.02%)\n* The best performing sector was Industrials(+2.95%) while Energy(-0.57%)was the worst performer.\n* The positive price action also contributed to continued selling in longer-dated Treasuries, which steepened the curve in a trade that benefited the financials sector. The 2-yr yield was unchanged at 0.16%, while the 10-yr yield increased three basis points to 0.88% to close at its highest level since June 8. The U.S. Dollar Index fell 0.7% to 93.51. \n* In the tech space, PayPal (PYPL 179.81, -7.95, -4.2%) and Skyworks (SWKS 138.80, -3.32, -2.3%) were notable laggards despite exceeding earnings expectations. PayPal, however, did issue downside Q4 EPS guidance. Arista Networks (ANET 249.49, +33.37, +15.4%) surged 15% following its upbeat earnings results and guidance. \n* Interestingly, the S&amp;P 500 came within 12 points of its 50-day moving average (3400) shortly before the close. The catalyst that could propel the benchmark index above the key technical level is, of course, the election. As an aside, trading volume was comparable to previous sessions. \n* Looking ahead, investors will receive the ISM Non-Manufacturing Index for October, the ADP Employment Change Report for October, the Trade Balance Report for September, and the weekly MBA Mortgage Applications Index on Wednesday.  \n## Index Summary\n **S&amp;P 500 :** (+1.77%); **NasDaq :** (+1.73%); \\\n**Russell 2000 :** (+2.84%); **Dow :** (+2.02%); \\\n**Vix :** 37.13 (-4.26%); [+6.6%]; {+24.08%} \n## Sectors Summary \n_Three highest sectors for today were -_ \\\n**Industrials:** (+2.95%); **Financials:** (+2.22%); **Consumer Discretionary:** (+2.2%) \\\n_Three lowest sectors for today were -_\\\n **Energy:** (-0.57%); **Utilities:** (+1.44%); **Health Care:** (+1.46%) \n## Commodities/Futures \n(1-day %), [5-day %], {10-day %} \\\n_**Currency -**_ \\\n**USD Index :** 94.145 (-0.69%); [-0.51%]; {+0.8%}\\\n **BC :** 13790 (+0.69%); [+2.81%]; {+7.05%} \\\n_**Precious Metals -**_\\\n**Gold :** 1892.5 (+0.87%); [+2.33%]; {+0.37%}\\\n**Silver :** 24.033 (+0.9%); [+3.9%]; {-1.53%}\\\n _**Farming -**_ \\\n**Soybeans :** 1052.25 (+0.97%); [+1.02%]; {-1.96%}  \n**Corn :** 397.5 (+0.69%); [+0.44%]; {-4.53%} \\\n**Coffee :** 105.35 (+0.66%); [+1.39%]; {+0.43%} \\\n_**Industrials -**_ \\\n**Crude :** 36.81 (+2.8%); [+4.62%]; {-5.04%} \\\n**Nat Gas :** 3.244 (-5.73%); [-7.36%]; {+2.93%} \\\n**Copper :** 3.077 (+0.68%); [+1.51%]; {-0.88%} \n## Dark Pool Summary - \nHighest Dark Pool buys by rank -\n1. IGIB 3 buys totaling 3,285,185 shares. Average Price : 60.53, Cost : $198,852,248\n2. MNST 3 buys totaling 1,576,230 shares. Average Price : 78.58, Cost : $123,345,432\n3. BABA 1 buys totaling 300,000 shares. Average Price : 290.45, Cost : $87,135,000\n4. HUYA 2 buys totaling 3,274,000 shares. Average Price : 22.37, Cost : $73,215,510\n5. AZN 4 buys totaling 1,202,400 shares. Average Price : 51.88, Cost : $62,349,690\n## Options Fast Facts -\n_**CBOE Put/Call Ratio**_ - 0.62\\\n_**Highest Multiple Over Daily Average**_- \nSIL with 15x the ADV of 1517. There were 22204 calls and 804 puts. \\\n_**Ticker with Most Contracts**_ -HYG with 594432 contracts traded today with an AVD of 230917. There were 84290 calls and 510142 puts.\\\n_**Largest Put / Call Ratio -**_ KWEB with a 11 P/C ratio. There were 19915puts and 1736 calls. \\\n_**Largest Call / Put Ratio -**_ VTV with a248 C/P ratio. There were 15122 calls and 61 puts. \n*Stocks must be &gt;$6, Highest Multiple must have &gt;1k ADV, Largest ratios must have an option volume &gt;10k",
        "subreddit": "stocks",
        "title": "Market and Options Summary for November 3rd, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/jnjgiq/market_and_options_summary_for_november_3rd_2020/",
        "created": 1604468287.0
    }
]