[
    {
        "author": "pennyhardaway11",
        "created_utc": 1590155801,
        "id": "gojsu7",
        "num_comments": 72,
        "num_crossposts": 0,
        "selftext": "About 2 months ago I posted about $RVP. A needle supplier for the inneviatable vaccine. Stock rallied about 175% or so since then. For every needle, a vial will also be needed. However, there is a problem because there aren't enough vials.\n\n[https://www.businessinsider.com/coronavirus-vaccine-glass-vial-shortage-could-delay-global-rollout-2020-5](https://www.businessinsider.com/coronavirus-vaccine-glass-vial-shortage-could-delay-global-rollout-2020-5)\n\nThe obvious implication is that vials will need to be made, and the largest glass players will be the obvious choices for government contracts. More than likely every glass company in the US will get a contract. $GLW was recently approved by the FDA for their new vial. I wouldn't over think this-- all of the major glass players are going to get major contracts, and even then, there will not be enough capacity to meet demand.\n\nMorning star currently has their fair value at 27 and it trades at 21 and change. Their current business has upside, but similar to RVP, when a contract this big drops into their hands, the stock is going to RUN. Below is a market research report about the industry. This is where I found them.\n\n[https://www.grandviewresearch.com/industry-analysis/pharmaceutical-glass-packaging-market](https://www.grandviewresearch.com/industry-analysis/pharmaceutical-glass-packaging-market)",
        "subreddit": "wallstreetbets",
        "title": "Corning $GLW, Gov Contract Upside",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gojsu7/corning_glw_gov_contract_upside/",
        "created": 1590184601.0
    },
    {
        "author": "pennyhardaway11",
        "created_utc": 1590435277,
        "id": "gqhmsr",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "I’m having a tough time trading? We’re circuit breakers triggered?\n\nNow that I have your attention, I know the market is closed. I like $GLW and $ULTA",
        "subreddit": "wallstreetbets",
        "title": "Why can’t I trade? Circuit breakers?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gqhmsr/why_cant_i_trade_circuit_breakers/",
        "created": 1590464077.0
    },
    {
        "author": "pennyhardaway11",
        "created_utc": 1590155246,
        "id": "gojnf9",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Corning $GLW, Upside",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gojnf9/corning_glw_upside/",
        "created": 1590184046.0
    },
    {
        "author": "Paramountmorgan",
        "created_utc": 1589496283,
        "id": "gjwxax",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "On the losing side of a small position.   21.50p I sold on GLW for 5/22. Ex-div is 5/28 and thought I had a floor beneath me, wrong!. I can buy to close at a cost of $200,  or hope it runs a bit next week and doesn't get exercised, or take assignment and catch the dividend end of June. I already own 100 shares at about a $20 purchase price. Paying $21.50 for stock currently at $19.75 is always a bummer.  I can also turn it into a wheel moving forward.  Thoughts and thanks",
        "subreddit": "options",
        "title": "Exiting vs. assignment before Ex-div date",
        "url": "https://www.reddit.com/r/options/comments/gjwxax/exiting_vs_assignment_before_exdiv_date/",
        "created": 1589525083.0
    },
    {
        "author": "labloke11",
        "created_utc": 1590002354,
        "id": "gnhvkw",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Any thought on following:\n\n&amp;#x200B;\n\nIntel Corp (Symbol: INTC) saw options trading volume of 117,644 contracts, representing approximately 11.8 million underlying shares or approximately 49.8% of INTC's average daily trading volume over the past month, of 23.6 million shares. Especially high volume was seen for the [$62.50 strike call option expiring May 29, 2020](https://www.stockoptionschannel.com/symbol/?symbol=INTC&amp;month=20200529&amp;type=call&amp;contract=62.50), with 17,581 contracts trading so far today, representing approximately 1.8 million underlying shares of INTC. Below is a chart showing INTC's trailing twelve month trading history, with the $62.50 strike highlighted in orange:.\n\n&amp;#x200B;\n\n [https://www.nasdaq.com/articles/notable-wednesday-option-activity%3A-goog-intc-glw-2020-05-20](https://www.nasdaq.com/articles/notable-wednesday-option-activity%3A-goog-intc-glw-2020-05-20)",
        "subreddit": "options",
        "title": "Notable Wednesday Option Activity: INTC",
        "url": "https://www.reddit.com/r/options/comments/gnhvkw/notable_wednesday_option_activity_intc/",
        "created": 1590031154.0
    },
    {
        "author": "Kant_sleep13",
        "created_utc": 1588941913,
        "id": "gfsjnk",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "Good morning, here's my watch list\n\nGap Ups: CWH, DBX, GH, HLF, IHPI, PSTI, PVAC, QRVO, SPWR, UBER, VIVO, WORK\n\nGap Downs: MSI, ROKU, SHOP, TTD\n\nPossible 2nd day play: TWLO\n\nSPY slightly gapping up and continuing the slow grind, Resistance at the 200 day moving average overhead at 300, nearest support around the 50 day moving average at 272. Not many stocks moving pre market and the list is not the greatest. Some stocks gaping down but gapping into support, may have to run some scans intraday to find decent movers. Todays Friday so stay disciplined and only trade the best setups with defined risk to reward calculated before entering into any positions. Good luck, stay safe.\n\n&amp;#x200B;\n\nI am not holding any positions in the stocks listed above. The purpose of this list is to watch these stocks for opportunities to make trades during the trading session",
        "subreddit": "stocks",
        "title": "Stock watch List May 8, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/gfsjnk/stock_watch_list_may_8_2020/",
        "created": 1588970713.0
    },
    {
        "author": "whossayn",
        "created_utc": 1588753644,
        "id": "geg2ax",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "hey guys.. pretty high right now so bare with me\n\ni was doin some thinking. i’m a pretty optimistic guy and like to think a decent amount of businesses will still be around after covid. but then it hit me, it all hit me. car dealerships/car company’s that directly sell, are shit. but if possible, go for smaller ones that are shit. let me explain.\n\nnow this may be obvious, but i am here so i am obviously not mentally capable of realizing the obvious- but car dealerships are slimy as fuck.\n\ni’m a uni student, and i have people i went to high school with who started working as car salesman. i remember hearing them flex this really concerning deals on his “business” instagram, that got weirder and weirder \n\n“get a new nissan shitstopper without paying for the 15 weeks!” \n\n“ride this zero down payment 1997 motorola civic for only $10000!”\n\nthe worst, i remember, was \n\n“dont qualify for a loan? don’t worry about it! our  *u n i q u e* financing allows you to lease one of our cars without any credit score!” \n\ni remember feeling like i was in the big short when i read that- was he bragging about that?? was i missing something?? \n\nanyhow, 1+1 became fish the same way all of us melancholic gambling assholes came together, with ideas that could be pretty well made up by some lsd guy. anyway, what i’m trying to say is, while it’s obvious- jimmy over there with his brand new 2010 nissan shitstopper that he can’t afford, is gonna default on his payments. *Especially for any kind of businesses that don’t necessarily consider clients/customers as credit worthy* it’s important to note that we have been allowing some fucked up shit to go on, and i’ll ipo the local shady car salesman just so i can buy puts\n\nanyway, i am a little too faded to find these tickers, but yes, short the corrupt car salesman and car business guys. also, when you read 10ks, (i know you don’t but humour me), press CTRL+F and search credit worthy. you’d be surprised how businesses are required to disclose whether they’re lending to your slightly fucked up cousin or not\n\nalso making this a discussion tag so ppl don’t go “hey man. this isn’t dd” cause man, idk. \n\nok guys, it was fun.",
        "subreddit": "wallstreetbets",
        "title": "car salesman are shit guys fuck",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/geg2ax/car_salesman_are_shit_guys_fuck/",
        "created": 1588782444.0
    },
    {
        "author": "andyjanderson255",
        "created_utc": 1589158029,
        "id": "ghdfm8",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Hi, I'm a beginner and what's the best software to use with all available tools (bollinger/30 day MA/MSI/MACD etc.)\n\nThanks in advance.",
        "subreddit": "stocks",
        "title": "Best Software to Use?",
        "url": "https://www.reddit.com/r/stocks/comments/ghdfm8/best_software_to_use/",
        "created": 1589186829.0
    },
    {
        "author": "c47v3770",
        "created_utc": 1588953319,
        "id": "gfvpij",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Thoughts on Motorola for long term hold?",
        "url": "https://www.reddit.com/r/stocks/comments/gfvpij/thoughts_on_motorola_for_long_term_hold/",
        "created": 1588982119.0
    }
]