[
    {
        "author": "stormwillpass",
        "created_utc": 1579897800,
        "id": "etg465",
        "num_comments": 11849,
        "num_crossposts": 0,
        "selftext": "Welcome back to another edition of the Weekend Discussion Thread. Fourth trading week of the year has finished. \n\nAs a tradition that started forty-three Fridays ago, the first three commenters in each Weekend Discussion Thread will get a flair if they don't already have one, a flair change, or to designate a flair for someone else.\n\nNotable earnings for [the upcoming week](https://i.imgur.com/IygZDso.png).\n\nMany heavy hitters reporting next week, including Apple, Microsoft, Tesla, Facebook, Boeing, AMD, Visa, Amazon, etc.\n\nVerify dates on your brokerage platform in case of errors/changes.\n\n___\n\nLink to [helplines can be found here](https://old.reddit.com/r/wallstreetbets/comments/dwwugh/weekend_discussion_thread_november_1517_2019/f7m0i3g/)",
        "subreddit": "wallstreetbets",
        "title": "Weekend Discussion Thread - January 24-26, 2020",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/etg465/weekend_discussion_thread_january_2426_2020/",
        "created": 1579926600.0
    },
    {
        "author": "cdiamand",
        "created_utc": 1579267563,
        "id": "eq0c8i",
        "num_comments": 230,
        "num_crossposts": 0,
        "selftext": "See you in CallHalla Brothers\n\n1 SPY - 3634 mentions \n\n2 TSLA - 3188 mentions \n\n3 BYND - 2038 mentions \n\n4 AMD - 1713 mentions \n\n5 AAPL - 1326 mentions \n\n6 SPCE - 990 mentions \n\n7 BA - 573 mentions \n\n8 TSM - 492 mentions \n\n9 AMZN - 467 mentions \n\n10 BAC - 457 mentions \n\n11 ROKU - 447 mentions \n\n12 MSFT - 435 mentions \n\n13 TGT - 384 mentions \n\n14 ACB - 372 mentions \n\n15 PTON - 342 mentions \n\n16 NIO - 292 mentions \n\n17 BABA - 276 mentions \n\n18 DIS - 273 mentions \n\n19 JPM - 242 mentions \n\n20 FB - 208 mentions \n\n21 DOW - 198 mentions \n\n22 SU - 172 mentions (not a stock, you weirdos just love su bae)\n\n23 UBER - 167 mentions \n\n24 TLRY - 148 mentions \n\n25 CGC - 148 mentions \n\n26 QQQ - 136 mentions \n\n27 MU - 134 mentions \n\n28 NFLX - 131 mentions \n\n29 LK - 131 mentions \n\n30 SBUX - 122 mentions \n\n31 SNAP - 121 mentions",
        "subreddit": "wallstreetbets",
        "title": "WSB stock mentions over the last 7 days",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eq0c8i/wsb_stock_mentions_over_the_last_7_days/",
        "created": 1579296363.0
    },
    {
        "author": "netBlu",
        "created_utc": 1580309217,
        "id": "evnstu",
        "num_comments": 225,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "All in MSFT",
        "url": "https://imgur.com/WqoyRby",
        "created": 1580338017.0
    },
    {
        "author": "ceud",
        "created_utc": 1577999191,
        "id": "ej4aqf",
        "num_comments": 200,
        "num_crossposts": 0,
        "selftext": "The S&amp;P 500 surged 29% in 2019, its best return since 2013. I beat the market by posting a gain of 167% in 2019.\n\nI posted some of my picks last year. Feel free to check out my post history for more.\n\n* [Tech/Software](https://www.reddit.com/r/stocks/comments/apai9i/techenterprise_saas_cloud_stocks_er_dates_2019/)\n* [Fintech/Payments/E-commerce](https://www.reddit.com/r/stocks/comments/b057ft/fintech_payments_ecommerce_crossborder_trade_sq/)\n\nI want to point out that my biggest gains are attributed to my plays in biotech/healthcare ([CVRS](https://www.reddit.com/r/stocks/comments/b35afo/cvrs_sleeping_giant_in_robotics_surgery/), [GH](https://www.reddit.com/r/stocks/comments/aqrxof/guardant_health_gh_blood_test_that_detects_cancer/)). CVRS ran from $1.30 and eventually got bought out at $4.25/share. Guardant Health ran from $30 to $112 with blow-out earnings quarter after quarter.\n\nAs the bull market charges into 2020, here are 3 stocks under $20 billion market cap that I'm bullish about. Let me know if you enjoy these types of posts, and I'll come out with more picks in my portfolio!\n\n**Guardant Health (**[**$GH**](https://finviz.com/quote.ashx?t=GH&amp;ty=c&amp;ta=1&amp;p=d)**):**\n\n\"Guardant Health, Inc. is a precision oncology company. The Company is focused on helping conquer cancer through use of its blood tests, data sets and analytics. It provides Guardant Health Oncology Platform. It provides liquid biopsy tests, such as Guardant360 and GuardantOMNI, for advanced stage cancer. Its liquid biopsy tests fuels its programs developing tests for recurrence and early detection, LUNAR-1 and LUNAR-2. Guardant360 is a molecular diagnostic test that measures 73 cancer-related genes from circulating tumor deoxyribonucleic acid (ctDNA). Its Guardant360 process includes blood collection, laboratory processing, analysis and reporting. Guardant360 is used for a range of applications, including translational science research and identifying target patient populations, drug development and commercialization post-drug approval.\"\n\n**WHY?**\n\nGuardant Health received expanded Medicare coverage for Guardant360, making it the first and only liquid biopsy to be broadly covered for use across the vast majority of advanced solid tumors.(!!!) -- For the Q3 2019 earnings report, Guardant procured an aggressive revenue increased by 181% ($60.8M). The bottom line earnings also improved by the remarkable 92.7%. If Guardant can maintain this momentum, it will generate positive cash flow within the next two to three years. Other catalysts: Monday, January 13 the company will be participating in the upcoming 38th Annual J.P. Morgan Healthcare Conference in San Francisco, CA. Imminent FDA approval within 1-2 years.\n\n**Sea Limited (**[**$SE**](https://finviz.com/quote.ashx?t=SE)**):** \"The Company operates through three segments: digital entertainment, e-commerce and digital financial services. The Company has developed an integrated platform consisting of digital entertainment focused on online games, e-commerce, and digital financial services focused on e-wallet services. Its platforms include Garena, Shopee, and AirPay. Garena provides access to engaging mobile and personal computer (PC) online games, live streaming game play, as well as social features such as user chat and online forums. Shopee is an e-commerce marketplace where users come together to browse, shop and sell on-the-go, anytime, anywhere. AirPay App is the Company’s digital financial services business that provides e-wallet services to consumers through the AirPay App and to small businesses through the AirPay counter application.\"\n\n**WHY?**\n\n[Google Report:](https://techcrunch.com/2018/11/18/google-report-southeast-asias-digital-economy-to-triple-to-240-billion-by-2025/)  Southeast Asia’s digital economy to triple to $240 billion by 2025\n\nSea Limited’s top and bottom lines in 3Q FY 2019 beat previous year’s levels, operating cash flows show huge improvements, Digital Entertainment unit which forms the bulk of Sea Limited’s total revenues saw three-folds jump in top line growth during Q3 2019 to US$329 million, E-commerce unit saw top line growth nearly tripled to $230 million in Q3 2019.\n\n**Progyny (**[**$PGNY)**](https://finviz.com/quote.ashx?t=PGNY&amp;ty=c&amp;ta=1&amp;p=d)**:**\n\n\"Progyny, Inc. operates as a fertility benefits management company in the US with its headquarters in New York City. The Company offers patients a benefits solution with education and guidance from a Patient Care Advocate and access to a network of fertility specialists. Progyny also aims to reduce healthcare costs for employers through their operations.\"\n\n**WHY?**\n\nThe market for fertility coverage has seen significant growth globally with adoption rates picking up given demand seen from top talent. At the time of its IPO listing in 2019, 80 B2B customers (including Facebook, Microsoft, Google) at nearly 100% retention rate, and 1.4 million lives covered (!) The company has only been in operations for a short while, however, has exhibited impressive top-line growth and is already profitable.\n\nEdit 1: Futures are down -200 points. Market might be bloody tomorrow.",
        "subreddit": "stocks",
        "title": "Top Stock Picks for 2020",
        "url": "https://www.reddit.com/r/stocks/comments/ej4aqf/top_stock_picks_for_2020/",
        "created": 1578027991.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1579209359,
        "id": "eppqty",
        "num_comments": 196,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2020/01/16/alphabet-stock-hits-1-trillion-market-cap-for-first-time.html\n\nAlphabet hit the $1 trillion market capitalization, making it the fourth U.S. company to hit the milestone after Apple, Amazon and Microsoft.\n\nDespite the company’s seemingly perpetual cultural clashes, Wall Street sees more dollar signs.",
        "subreddit": "stocks",
        "title": "Alphabet, Google’s parent company, hits trillion-dollar market cap for first time",
        "url": "https://www.reddit.com/r/stocks/comments/eppqty/alphabet_googles_parent_company_hits/",
        "created": 1579238159.0
    },
    {
        "author": "cheesequake516",
        "created_utc": 1579535752,
        "id": "erezze",
        "num_comments": 194,
        "num_crossposts": 0,
        "selftext": "I don't want to panic sell especially at a loss but the outlook for Slack looks less promising and I'm thinking I might be able to put the capital somewhere more promising. I know Slack is a good product and I thought they had a good niche but its hard to fight against something that Microsoft bundles for free.  Thoughts?",
        "subreddit": "stocks",
        "title": "Bought Slack at $34.41, down 34.5% and have been holding while everything else in the market has gone up. And Microsoft has started advertising their Teams, now with Tv ads. What are your thoughts on Slack vs Microsoft?",
        "url": "https://www.reddit.com/r/stocks/comments/erezze/bought_slack_at_3441_down_345_and_have_been/",
        "created": 1579564552.0
    },
    {
        "author": "steel_sentinel",
        "created_utc": 1579515463,
        "id": "erbgbh",
        "num_comments": 165,
        "num_crossposts": 0,
        "selftext": "25 and just had a quarter life crisis and thought about retirement for the first time ever. Just opened a Roth IRA, looking to get the most bang for my buck for the next 25+ years with this account. \n\nI have two simple strategies I am considering employing. I'm thinking about either investing only in one mutual fund and/or total market ETF and 1-3 individual stocks that would only make up 10-20% of my portfolio(V, MSFT and AAPL most likely). My other strategy would be investing in 10-20 blue chip stocks with with high revenue, low debt and decent dividend payouts (WFC, MO, CCI for example). What strategy is best for very long term growth? \n\nIn regards to the first strategy, if I'm going very long in a Roth IRA wouldnt a mutual fund be better than an ETF? Should I do one or both?\n\nIn regards to the second strategy, since Roth IRA isnt taxed, does it make more sense to go after blue chip dividend stocks or growth stocks?\n\nThanks in advance!",
        "subreddit": "investing",
        "title": "Best 'bang for your buck' long term strategy for Roth IRA account",
        "url": "https://www.reddit.com/r/investing/comments/erbgbh/best_bang_for_your_buck_long_term_strategy_for/",
        "created": 1579544263.0
    },
    {
        "author": "TheFilterJustLeaves",
        "created_utc": 1579482278,
        "id": "er5ip4",
        "num_comments": 146,
        "num_crossposts": 0,
        "selftext": "$MSFT growth continues into 2020. See $24k YOLO below.\n\n&amp;#x200B;\n\n* **MARKETSHARE CREEP**: As the collective US/EU retail industry looks around and wonders if they should be establishing or growing their competitor's cash cow, they'll be looking to strategically invest elsewhere. There are only a handful of major IaaS providers: Microsoft, Google, IBM. Microsoft has greater IaaS market share than every other remaining hyperspace cloud player combined.\n\n&amp;#x200B;\n\n|Player|2018 IaaS Market Share / Year Prior +/-|\n|:-|:-|\n|Amazon Web Services $AMZN|47.8% (-1.6)|\n|Microsoft Azure $MSFT|15.5% (+2.8)|\n|Alibaba Cloud $BABA|7.7% (+2.4)|\n|Google Cloud Platform $GOOG|4% (+0.7)|\n|IBM Cloud $IBM|1.8% (-0.1)|\n\nSource:  [https://www.gartner.com/en/newsroom/press-releases/2019-07-29-gartner-says-worldwide-iaas-public-cloud-services-market-grew-31point3-percent-in-2018](https://www.gartner.com/en/newsroom/press-releases/2019-07-29-gartner-says-worldwide-iaas-public-cloud-services-market-grew-31point3-percent-in-2018) \n\nFor the time being, $BABA and $MSFT have culturally different clientele, providing a favorable moat to $MSFT in the US and with allies (UK, EU, AU, NZ) and the Western hemisphere neighborhood (LATAM). Of course, that's before we get to PaaS, which $MSFT serves as a leader in some of the most cutting edge (AI/ML, IoT), and as the uncontested king of on premise and hybrid cloud in enterprises.\n\n&amp;#x200B;\n\n* **THE MILITARY-INDUSTRIAL COMPLEX HATH SPOKEN:** Unless you're living under a rock, you've probably heard about JEDI and DEOS. The monopoly that $AMZN once enjoyed in the cleared space  is now in the crosshairs of big blue. This opens the door for Microsoft to gain all types of opportunities in the highly profitable federal space, and some of which it is uniquely positioned for with it's Azure Stack Hub and array of edge devices. Microsoft, with it's already deeply established sales and relationships with the DoD, will have no problems capitalizing on this opportunity. It's only just beginning. Microsoft can leverage a huge partner base, and don't forget that US defense companies can increase that leverage too.\n* **O365, DYNAMICS, LINKEDIN, AND GITHUB ARE EASY MONEY:** $MSFT is enjoying the fruits of its acquisition(al) labors on one hand, and the easiest inflows of cash via O365, which will see increased growth as more cleared / defense onboard into O365 and dog-whistle Teams.\n* **ENJOYS THE TAILWINDS OF A RECORD YEAR**: $MSFT and Azure are coming along from record highs, with yearly gains between the 50-60% respectively. If you're bullish on the S&amp;P 500/DOW, you can be bullish on Microsoft - and expect it to outperform. Microsoft has enjoyed steady climbs after most favorable earning events, provided its largely institutional (\\~73%) ownership isn't panicking. \n\n[MSFT 07\\/18 - present day](https://preview.redd.it/3p9ccnoj0ub41.png?width=1196&amp;format=png&amp;auto=webp&amp;s=191d019a0e7af40f2cca475e20db6d2bd60cedb4)\n\nMY $23,958.32‬ YOLO: \n\nhttps://preview.redd.it/uvizq7hj1ub41.png?width=645&amp;format=png&amp;auto=webp&amp;s=246b5fccb66ce5191d9e562bc723df21bb892f5e",
        "subreddit": "wallstreetbets",
        "title": "Long live Azure! Microsoft will moonwalk past $180.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/er5ip4/long_live_azure_microsoft_will_moonwalk_past_180/",
        "created": 1579511078.0
    },
    {
        "author": "throwaway_investguy",
        "created_utc": 1579547434,
        "id": "erhwso",
        "num_comments": 141,
        "num_crossposts": 0,
        "selftext": "My allocations:\n\n&amp;#x200B;\n\n|Investments|Balance|Percentage of Total|\n|:-|:-|:-|\n|Vanguard SP500 Index|$69,185|35%|\n|Vanguard extended market (small cap)|$ 32,353.42 |16%|\n|MFS International Growth|$ 32,353.42 |11%|\n|BAC|$ 14,370.87 |7%|\n|GOOGL|$ 11,836.16 |6%|\n|MSFT|$ 4,765.65 |2%|\n|AAPL|$ 4,547.19 |2%|\n|VHT|$ 4,512.36 |2%|\n|QQQ|$ 3,124.95 |2%|\n|BABA|$ 2,046.87 |1%|\n|AMZN|$ 1,864.72 |1%|\n|JPM|$ 1,608.24 |0.8%|\n|AMD|$ 1,527.9 |0.8%|\n|SPOT|$1,335.06 |0.7%|\n|UBER|$ 1,053.9 |0.5%|\n\n&amp;#x200B;\n\n|Crypto|Balance|Percentage of Total|\n|:-|:-|:-|\n|Bitcoin|$13,612|7%|\n|Ether|$883.35|0.4%|\n|Ripple|$511.50|0.3%|\n\n&amp;#x200B;\n\n|Cash|Balance|Percentage of Total|\n|:-|:-|:-|\n|High Yield Savings|$6,000|3%|\n|Checkings/Savings|\\~$2,000|1%|\n\nAll equity investments are in retirement accounts.  Total net worth in traditional IRA = 40%, ROTH 48%.",
        "subreddit": "investing",
        "title": "I've saved almost 200k at 30, here's how I've allocated my money",
        "url": "https://www.reddit.com/r/investing/comments/erhwso/ive_saved_almost_200k_at_30_heres_how_ive/",
        "created": 1579576234.0
    },
    {
        "author": "MaxAds1",
        "created_utc": 1580256976,
        "id": "evehxd",
        "num_comments": 121,
        "num_crossposts": 0,
        "selftext": "God damn it I told myself I wouldn't do this again but I went ahead and bought some fucking TSLA puts for tomorrow. 450 1/31 expiration, hoping for a sell off in the morning.\n\nDid anyone else do something as stupid as this? I made some big tendies from AAPL and MSFT credit put spreads so this is fun money.\n\nDon't you fuck me Elon.",
        "subreddit": "wallstreetbets",
        "title": "TSLA Puts Tomorrow",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/evehxd/tsla_puts_tomorrow/",
        "created": 1580285776.0
    },
    {
        "author": "likesundayslikerain",
        "created_utc": 1579305033,
        "id": "eq8og8",
        "num_comments": 119,
        "num_crossposts": 0,
        "selftext": "Even though I know it’s better to spend your time in the market instead of timing the market, I still fail to follow this advice. I always think “what if the price is lower in a month” or “what if there’s a recession soon?” I’ve been waiting for dips and good entry prices for many stocks, such as Microsoft, Tesla, AMD, Twitter, Disney, etc., but this just leads to missed opportunities.\n\nRecently, the market has been just getting higher and higher. Everything now seems to be reaching its 52 week high.\n\nAre there any stocks in particular you would recommend right now?\n\nI know it’s not a good idea to wait for dips, but I don’t have much to invest, so I just hope to make the most gains I could, but I have realized that I want to hold safe stocks for a very long time and hope to seem they grow haha\n\nAlso, I’m a person who likes science a lot (particularly bio and med related items) and anything that would benefit the earth/future, such as solar power or any other energy. Along with recommendations, if there were any you have in these areas, I would love to hear them!! I will definitely do my own research about the stock.\n\nAny help/insight/recommendations are greatly appreciated!! I definitely want to spend more time in the market, so I’m planning on doing research this weekend and investing right away. Thank you so incredibly much!! Good luck investing!",
        "subreddit": "stocks",
        "title": "What stock would you recommend buying now (next week) and holding onto for 10+ years?",
        "url": "https://www.reddit.com/r/stocks/comments/eq8og8/what_stock_would_you_recommend_buying_now_next/",
        "created": 1579333833.0
    },
    {
        "author": "jsally17",
        "created_utc": 1580270197,
        "id": "evhee6",
        "num_comments": 110,
        "num_crossposts": 0,
        "selftext": "I’m still learning about IV Crush and I’m stressing about whether I should grab these profits now or wait until MSFT reports. \n\nCan a more experienced trader offer some wisdom here?",
        "subreddit": "options",
        "title": "Still learning, I have $MSFT $150 2/21 Call that I bought back in November. I’m up about 160%. Should I sell the option before earnings tomorrow or wait it out until after earnings?",
        "url": "https://www.reddit.com/r/options/comments/evhee6/still_learning_i_have_msft_150_221_call_that_i/",
        "created": 1580298997.0
    },
    {
        "author": "helio987",
        "created_utc": 1579961431,
        "id": "etr794",
        "num_comments": 95,
        "num_crossposts": 0,
        "selftext": "I know a lot of you guys will say to handle my own portfolio, which I do for about 25% of it.  Years ago, I was failing big time, in over my head so I brought it to RBC to straighten out.  Some of the stocks I still have from my initial purchases like msft, intc, cn rail, which now I have done great on.  The other day I went to see him and his new team wants to reconfigure my entire profile, basically sell all my stocks and purchase a series of dynamic asset allocation funds.  They are companies similar to Berskshire.  I asked what about my current stocks, are they transferable in kind to these funds.  He said no, they would be sold.  I brought up the fact that between a group of stocks that I own, I counted capital gain of 300k and with a few loser stocks that I lost about 40k.  So I have to pay tax on that now, which would put me in the highest tax bracket.  I could not believe he had no answer for that and did not even think about that.  I am not that smart but even I knew that.  He was proud that last year my portfolio did 15%, which is a mix of stocks, bonds, GIC.  Well on my own side, I did 15 % as well with some basic TD bank mutual funds, VTI and a few good stocks.  A lot of you guys on here are well versed in trading, I know enough to be dangerous and the dangerous part got me in trouble.  Face it, the last 8 years, anyone could have made money.  When I first started in the late 90's, it was like now.  I would buy 5k of stocks, in a few months, it was worth 7k, I would sell and go on vacation. Then the tech crash came  and i lost a ton. I am getting older, so you don't want to lose it all and that is what rbs is supposed to do but to sell all my stuff and hand me a huge capital gain bill was insane.",
        "subreddit": "investing",
        "title": "Why I should terminate my financial adviser.",
        "url": "https://www.reddit.com/r/investing/comments/etr794/why_i_should_terminate_my_financial_adviser/",
        "created": 1579990231.0
    },
    {
        "author": "red_Mercedez",
        "created_utc": 1579701087,
        "id": "esc6pb",
        "num_comments": 95,
        "num_crossposts": 0,
        "selftext": "Hi,\n\n \n\nI am opening up a TFSA and will contribute 6k and invest it in RBC Direct Investing (this is the only one I can use due to work)\n\nI know this comes up a lot here and I did do my research but Reddit is awesome because there is sooo many smart people here and the answers are original. \n \n\nWhat do you think about these ?\n\nWALT DISNEY CO (DIS)\n\nNETFLIX (NFLX)\n\nFACEBOOK  (FB)\n\nSTARBUCKS (SBUX)\n\nMICROSOFT  (MSFT)\n\nUBER (UBER)\n\nVANGUARD TOTAL STOCK MARKET INDEX FUND (VTSMX)\n\n\nis there something else I should look into? Is there something else that is much cheaper that has good potential ? Maybe 5G technology?\n\nAlso, Im bad with allocation... what allocation should I have in each if I have 6k ?\nAt the same time, im thinking maybe there will be a correction so perhaps it’s not the best time to buy?\n\nIs everything expensive?\n\nSome background about me:\n23 years old, currently, my role is an Associate (Im in the process of getting licensed)\n\nI know I can ask my colleagues, but I work in a huge institution and I find most of their investment style is focused more towards capital preservation.\n\nIm looking for growth &amp; long holds. \n \n\nThanks for those who have taken the time to respond:)",
        "subreddit": "stocks",
        "title": "TFSA growth for a girl in her 20s",
        "url": "https://www.reddit.com/r/stocks/comments/esc6pb/tfsa_growth_for_a_girl_in_her_20s/",
        "created": 1579729887.0
    },
    {
        "author": "pacosteles",
        "created_utc": 1578325244,
        "id": "ekvqb6",
        "num_comments": 87,
        "num_crossposts": 0,
        "selftext": "This time last year, Slack Technologies, the popular workplace chat provider, was one of the most eagerly anticipated public tech debuts of 2019. That seems like a long time ago. Since Slack went public in June, its stock has dropped about 40%.\n\n\nThe reason for the slump: Revenue growth at Slack is slowing and competition is intensifying, especially from Microsoft. The tech giant is relying on a familiar tactic—bundling a Slack killer with a widely used existing product, its Office 365 suite of apps. Given that competitive pressure, I predict 2020 will be the year that—after years of acquisition speculation—a larger tech company will finally buy Slack.\n\n\nPotential suitors could include Amazon—which has reportedly eyed Slack in the past—and Google. Both companies are top providers of cloud computing services and could plug Slack into their cloud units to increase the revenue they generate from online applications. \n\n\nAlready a big Amazon cloud customer, Slack has committed to spending a minimum of $250 million with the Amazon Web Services division between 2018 and 2023, according to regulatory filings. Becoming part of Amazon could help Slack—which is currently unprofitable—trim some costs.    \n\n\nCisco Systems and Salesforce, both of which could use a spark to fire up their collaboration software businesses, might also make sense as acquirers. Both companies have relationships with corporate chief information officers that could open the door to customers in the Fortune 500. \n\n\nA Slack purchase would be a sizable deal. Slack has a market capitalization of just over $12 billion, although its management would likely push for a higher price. One benchmark they might point to: A few weeks before it went public, Slack was valued in private market trades at about $19 billion. At that price, Slack would be the largest acquisition ever for the likes of Amazon, Google, Cisco, and Salesforce.  \n\n\nOne company that likely won’t buy Slack is the company that would arguably be most responsible for its sale: Microsoft. Owning Slack, along with its in-house Slack competitor, Teams, would give Microsoft a dominant position in workplace collaboration software. Microsoft reportedly considered offering an $8 billion bid for Slack in 2016 before deciding to funnel more investment into building out Teams. \n\n\nBut I’m skeptical that Microsoft could pull off such a deal. Gaining regulatory approval would be an ordeal, if not impossible, because Microsoft already offers a directly competitive product. Microsoft went through the antitrust wringer two decades ago and is happy to avoid joining other big tech companies in the regulatory spotlight now. \n\n\nSpokespeople from AWS and Salesforce declined to comment. A Microsoft spokesperson didn’t have a comment. Spokespeople from Cisco and Google didn’t respond to requests for comment. \n\n\nIf Slack CEO and co-founder Stewart Butterfield doesn’t want to sell, he will have to find a way to win back investor confidence. Clearly what is worrying Wall Street is Slack’s slowing revenue growth and increasing losses. \n\n\nThe company’s annual sales grew 110% in fiscal 2018, which ended last Jan. 31, from the prior year. In fiscal 2019, that figure fell to 82%. In its most recent earnings report, Slack forecast that revenue growth for fiscal 2020 will fall even further to around 55%. Meanwhile, its net loss rose to about $88 million in the third quarter, from nearly $48 million a year earlier.\n\n\nSlack has spread like wildfire as a business tool largely through a free version of its product. To continue to grow, it must find ways to convince these users to become paying ones. During its recent earnings call, for the quarter ended Oct. 31, the company said it had 105,000 paying customers, up 30% from the same period a year earlier. \n\n\nIn an interview, Daniel Newman, founder and principal analyst at Futurum Research, said Slack’s early growth was partly due to developers’ frustration with the limitations of older products like Microsoft’s Skype and Cisco’s Webex. Now, with Microsoft pouring money into Teams and making improvements to the product to entice large companies, Slack has to work much harder to attract customers, he said. And a host of younger companies, such as Zoom and Asana, and open source startups, including Mattermost and Rocket.Chat, also offer workplace collaboration tools. \n\n\n“There is a lot of competition in the collaboration space right now,” Newman said. \n\n\nThe growing competition highlights another issue for Slack. Having captured a loyal following of developers and technical users through word of mouth, it is now spending heavily on sales and marketing to show how its software can help companies be more productive. During the third quarter, its sales and marketing expenses jumped 42% to over $96 million. \n\n\nMicrosoft appears to have gotten into Butterfield’s head. This first became apparent in 2016 when Slack took out a full-page ad in The New York Times to “welcome” Microsoft to the market around the time it introduced Teams. More recently, Butterfield has sounded a defensive note on earnings calls, pointing out that Slack has to earn every customer and can’t rely on bundling its product with other business applications, as Microsoft does. \n\n\nHe often pushes back on Microsoft’s framing of its daily active user numbers for Teams, claiming that the company muddies the waters by counting people who make voice calls using Skype. Slack’s usage figures more accurately reflect the deep level of engagement its users have with the service, according to Butterfield. “The confusion is deliberately created,” Butterfield said on Slack’s recent fiscal third quarter earnings call with investors. \n\n\nWhatever the reason, Butterfield faces a choice: Keep fighting or surrender by selling.",
        "subreddit": "wallstreetbets",
        "title": "Why Slack Will be Acquired",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ekvqb6/why_slack_will_be_acquired/",
        "created": 1578354044.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1579365142,
        "id": "eqiht9",
        "num_comments": 82,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2020/01/18/in-the-stock-market-its-become-apple-microsoft-and-alphabet-vs-everyone-else.html\n\nSo, in aggregate Apple-Microsoft-Alphabet trades at 26-times this year’s profits, with no debt and enormous capacity to invest, buy back stock or fund future dividends. The broad market is below 19-times earnings.",
        "subreddit": "stocks",
        "title": "In the stock market, it’s become Apple, Microsoft and Alphabet vs everyone else",
        "url": "https://www.reddit.com/r/stocks/comments/eqiht9/in_the_stock_market_its_become_apple_microsoft/",
        "created": 1579393942.0
    },
    {
        "author": "xbted9",
        "created_utc": 1578957280,
        "id": "eoc7ki",
        "num_comments": 74,
        "num_crossposts": 0,
        "selftext": "This growth is not sustainable. The markets injected with money by the FEDS. The valuation are crazy and it does not make sense that trillion dollar companies are moving like penny stocks. The markets literally being held up by like 10 stocks. This is just not right.\n\n\nPuts on everything.",
        "subreddit": "wallstreetbets",
        "title": "So Puts on $MSFT and $APPLE",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eoc7ki/so_puts_on_msft_and_apple/",
        "created": 1578986080.0
    },
    {
        "author": "gunsuka",
        "created_utc": 1578221003,
        "id": "ekbicj",
        "num_comments": 73,
        "num_crossposts": 0,
        "selftext": "I opened a new brokerage account, made a few options trades.\n\nI like to sell PUT options, generally on stocks I would like to own anyway.\n\nAn example would be if I wanted to buy Microsoft today, I would sell options instead.  If Microsoft is above the strike price, I keep the premium.  If below the strike, I end up buying Microsoft at a price below the market price when I sold the option.\n\nI don't do anything fancy or trade options just for the premium.\n\nWith this new brokerage, I sold three options.  The contacts had a value of $14,400.\n\nAfter about 1 month I get my statement and I see I've been charged margin interest...  I did not purchase anything on margin, so what was this interest?\n\nAfter some digging I found they are charging me margin interest in the $14,400 contract value.\n\nI've never had any other broker charge me margin interest before.   My trades are generally just a few %, I can't afford to be paying margin interest.\n\nI have the collateral in my account, don't understand why they are doing that.\n\nIs it normal to be charge interest when writing PUTS?  The previous brokerage accounts I have had in the past never did this.",
        "subreddit": "options",
        "title": "When I write a PUT option, I am charged margin interest?",
        "url": "https://www.reddit.com/r/options/comments/ekbicj/when_i_write_a_put_option_i_am_charged_margin/",
        "created": 1578249803.0
    },
    {
        "author": "HedgeWallSt",
        "created_utc": 1580228674,
        "id": "ev7mnv",
        "num_comments": 68,
        "num_crossposts": 0,
        "selftext": "What are your forever hold stocks? (Stocks that seem to always go up) I currently hold $MA and $MSFT as my forever holds. Just curious what everyone else is holding on to.",
        "subreddit": "stocks",
        "title": "Forever Hold Stocks?",
        "url": "https://www.reddit.com/r/stocks/comments/ev7mnv/forever_hold_stocks/",
        "created": 1580257474.0
    },
    {
        "author": "PuzzleheadedEscape5",
        "created_utc": 1579214830,
        "id": "epr2g6",
        "num_comments": 66,
        "num_crossposts": 0,
        "selftext": "I am on LinkedIn Premium and noticed an interesting trend in hiring and employee growth. \n\n**Facebook**\n\nFacebook hit peak employees in October 2019 and now shows a decline in total employee count. This makes sense because the rate at which they hire dramatically decreased. Their new head count beginning Nov 2019 decreased by at least 50% in most cases. Compared to Jan 2018, FB hired nearly 80% less in Nov 2019. \n\n&amp;#x200B;\n\n**Google** \n\nStill growing though headcount is lower in Jan 2020 than Dec 2019. Hiring started declining in October and then took a big 50%+ drop in November. \n\n&amp;#x200B;\n\n**Netflix** \n\nHit peak employees Oct 2019 and has declined 2% in 6 months. Hiring declined in Oct 2019 and then fell off a cliff beginning November. Compared to average hiring rate, we're talking about an 80%ish decline in hiring going back 2 years. \n\n&amp;#x200B;\n\n**Microsoft** \n\n  \nHit peak employees Nov 2019 and has now declined though up on a 6 month basis. However, hiring is trend declining, about a 50% drop to average in Dec 2019. \n\n&amp;#x200B;\n\n**Random or have they communicated over something in their hiring moving forward? Strange as they are big drivers of this bull market and cycle.**",
        "subreddit": "investing",
        "title": "What is going on with Facebook, Google, Netflix, and Microsoft?",
        "url": "https://www.reddit.com/r/investing/comments/epr2g6/what_is_going_on_with_facebook_google_netflix_and/",
        "created": 1579243630.0
    },
    {
        "author": "TheFilterJustLeaves",
        "created_utc": 1580340156,
        "id": "evvd0e",
        "num_comments": 64,
        "num_crossposts": 0,
        "selftext": "[UPDATE from previous post](https://www.reddit.com/r/wallstreetbets/comments/er5ip4/long_live_azure_microsoft_will_moonwalk_past_180/).\n\nWell, friends, we've done it. Our collective prayers have been answered and MSFT has delivered. Azure grew 62% this last quarter and is going to continue to eat $AMZN lunch.\n\n\\-------------------\n\n **Revenue in Productivity and Business Processes was $11.8 billion and increased 17% (up 19% in constant currency), with the following business highlights**:\n\n* Office Commercial products and cloud services revenue increased 16% (up 18% in constant currency) driven by Office 365 Commercial revenue growth of 27% (up 30% in constant currency)\n* Office Consumer products and cloud services revenue increased 19% (up 20% in constant currency) with continued growth in Office 365 Consumer subscribers to 37.2 million\n* LinkedIn revenue increased 24% (up 26% in constant currency)\n* Dynamics products and cloud services revenue increased 12% (up 15% in constant currency) driven by Dynamics 365 revenue growth of 42% (up 45% in constant currency)\n\n**Revenue in Intelligent Cloud was $11.9 billion and increased 27% (up 28% in constant currency), with the following business highlights**:\n\n* Server products and cloud services revenue increased 30% (up 32% in constant currency) driven by Azure revenue growth of 62% (up 64% in constant currency) \n* Enterprise Services revenue increased 6% (up 7% in constant currency)\n\n**Revenue in More Personal Computing was $13.2 billion and increased 2% (up 3% in constant currency), with the following business highlights**:\n\n* Windows OEM revenue increased 18% (up 18% in constant currency)\n* Windows Commercial products and cloud services revenue increased 25% (up 27% in constant currency)\n* Surface revenue increased 6% (up 8% in constant currency)\n* Search advertising revenue excluding traffic acquisition costs increased 6% (up 7% in constant currency)\n* Xbox content and services revenue decreased 11% (down 9% in constant currency)  \n\n\\-------------------\n\nIn true WSB autist fashion, I added another $10k in calls to my 4/17 $180c position during the coronavirus terrors; borrowed from my 401k. It isn't going to be needed for a long time. I did sell a small amount to eliminate margin exposure between posting when my $180 strikes hit $2.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/5ahzbyacrsd41.png?width=1092&amp;format=png&amp;auto=webp&amp;s=77f0420eebf7685a07a74a7ae17369e00a39d901\n\nFor those curious, I don't *strongly \\[really\\]* expect $MSFT to hit $200/210/220, but they were bargain basement calls.\n\n&amp;#x200B;\n\n|Call |Expiry|Dollar Cost Average|\n|:-|:-|:-|\n|MSFT $170c|3/20|$2.17|\n|MSFT $175c|4/17|$2.07|\n|MSFT $180c|4/17|$1.12|\n|MSFT $200c|5/15|$0.29|\n|MSFT $210c|6/19|$0.23|\n|MSFT $220c|5/15|$0.07|\n\n&amp;#x200B;\n\nI will be continuing to hold.",
        "subreddit": "wallstreetbets",
        "title": "[Update] Long live Azure! Microsoft will moonwalk past $180. $34k+ YOLO",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/evvd0e/update_long_live_azure_microsoft_will_moonwalk/",
        "created": 1580368956.0
    },
    {
        "author": "fullbloodedwhitemale",
        "created_utc": 1579792497,
        "id": "esuftq",
        "num_comments": 58,
        "num_crossposts": 0,
        "selftext": "Major tech firms such as Twitter and Microsoft don’t want the U.S. government to restrict immigrants who might end up relying on public benefits.\n\nThe federal government’s [“public charge” rule](https://www.vox.com/policy-and-politics/2019/10/11/20899253/trump-public-charge-immigrants-welfare-benefits-court) would determine whether immigrants are more likely to use public benefits such as food stamps and Medicaid; those who couldn’t satisfy 20 different factors for economic self-sufficiency would be denied entry. The rule has faced a number of courtroom challenges that so far have prevented it from going into effect. Now, a handful of tech companies have signed [an amicus brief filing in the U.S. Court of Appeals for the Fourth Circuit (PDF)](https://assets-wp.boundless.com/uploads/2020/01/Public-charge-amicus-for-Boundless-et-al-CA4-FINAL.pdf), putting their public weight behind rescinding the rule.    \n\nThose companies argue that the rule will prevent them from hiring the talent they need. From the filing:\n\n&gt;“American businesses depend upon an efficient immigration system to ensure that they have access to the talent that they need to grow and succeed. Although the American-citizen workforce is highly skilled, businesses sometimes benefit by hiring foreign nationals for certain positions, often sponsoring these workers for permanent residency. Immigration law has long recognized that, in such circumstances, businesses require pathways (such as H-1B and L-1 visas adjusted to 5 employment-based permanent residency) for foreign nationals to come to and remain in the United States to work… The Rule, however, would restrict American businesses’ ability to hire foreign-born workers, because, under the Rule, many skilled workers who would otherwise have been eligible for permanent residency would now be barred from receiving it.”\n\nIn other words, these companies feel that the rule is too broad: “Given the numerous and amorphous factors—and the unfettered discretion given to immigration officials—virtually any applicant could be found to have some basis for a denial.”\n\nfrom\n\n&amp;#x200B;\n\n[https://insights.dice.com/2020/01/21/low-income-immigrants-rule-microsoft-push-back/](https://insights.dice.com/2020/01/21/low-income-immigrants-rule-microsoft-push-back/)",
        "subreddit": "stocks",
        "title": "Microsoft, Tech Firms Fight Rule Restricting Low-Income Immigrants",
        "url": "https://www.reddit.com/r/stocks/comments/esuftq/microsoft_tech_firms_fight_rule_restricting/",
        "created": 1579821297.0
    },
    {
        "author": "ZombsCS",
        "created_utc": 1580395487,
        "id": "ew6g5k",
        "num_comments": 57,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "$MSFT earnings FDs $50k gain",
        "url": "https://i.redd.it/n2beyk4ohxd41.jpg",
        "created": 1580424287.0
    },
    {
        "author": "rawrtherapy",
        "created_utc": 1578961294,
        "id": "eod3kl",
        "num_comments": 57,
        "num_crossposts": 0,
        "selftext": "Everyone talking about Microsoft and Apple, Tesla and Fucking Beyond Meat\n\nYou retards need to realize that that boat has fucking sailed\n\nAll of you here can barely afford one share of Tesla, let alone multiple shares and calls\n\nSemiconductors are in fucking everything and big data is going to the fucking moon\n\nwith all this data companies like $AYX are printing me fucking tendies and semiconductor companies like $TSM are giving me those sweet sweet Call tendies\n\nFuck all of you, i know where the moneys at and aint nobody gonna change my mind\n\nif TESLA ever dips down to $180 sure ill throw my life savings in it but for right now Semiconductors and data companies are where its at fam",
        "subreddit": "wallstreetbets",
        "title": "You guys are all retarded, Semiconductors and Data are the girls you wife",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eod3kl/you_guys_are_all_retarded_semiconductors_and_data/",
        "created": 1578990094.0
    },
    {
        "author": "wizbiz79",
        "created_utc": 1579726433,
        "id": "esi0tu",
        "num_comments": 57,
        "num_crossposts": 0,
        "selftext": "I bought CALLS for BYND and MSFT this week and wanted to get a second opinion from you autists. \n\nReasoning:\nBYND (Earnings : Jan 27) - McDonald's and Starbucks added Beyond Meat to their menus recently. The stock is probably oversold again(around $120) however, I do believe it go up till $150-160 before touching ground again. \n\nMSFT (Earnings : Jan 29)- Their cloud business has been rapidly expanding. Plus the JEDI Contract. Their office suite was also upgraded recently and the office suite sales are also growing because of the variety of products they offer to businesses.",
        "subreddit": "wallstreetbets",
        "title": "BYND &amp; MSFT Earnings",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/esi0tu/bynd_msft_earnings/",
        "created": 1579755233.0
    },
    {
        "author": "gravityCaffeStocks",
        "created_utc": 1580094476,
        "id": "euhudd",
        "num_comments": 52,
        "num_crossposts": 0,
        "selftext": "The time has come for the ultimate showdown.\n\nBeer virus vs Earnings week lead by the tech giants!\n\n\nEverything seems to suggest that the beer virus has won Game 1 before it's even begun, and they might be right without a big bat on Monday.. not like we can expect Whirlpool to hit a homerun.\n\nAAPL is going to kill in game 2. Expect a late game grand slam, and if the market hasn't already been swayed in favor of the tech giants and earnings week, AAPL will convince them otherwise. Game 2 will also consist of AMD batting .320 like it always does, and even if it slumps early, it'll be back to hitting .320 by the end of the week. \n\nGame 3 could be a huge game for TSLA.. can TSLA really continue to bat a red hot .700 for a whole series and keep knocking in RBIs at a godly pace? My bet is yes. But it will be MSFT who brings home Game 3 and carries the team through the rest of the week. Expect a monster homerun that signifies the death of team beer virus.. one of those games where you feel the breath absolutely knocked out of the opponent. FB will choke, going 2-31 this series.\n\nGame 4 is just a continuation of team earnings game 2 and 3 victories and AMZN shines with a 3-5 day with a few RBIs, nothing incredible but enough to seal the victory for team earnings. Regardless of how game 5 plays out, the series was won here.\n\n\nMSFT 150c's and 160c's\nTSLA 6/2020 700c\nAMD 1/2021 30c and couple hundred shares\nAlways holding shares of GOOG\n253 shares of TQQQ\n\nMSFT will be MVP.",
        "subreddit": "wallstreetbets",
        "title": "Beer Virus vs Earnings Week",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/euhudd/beer_virus_vs_earnings_week/",
        "created": 1580123276.0
    },
    {
        "author": "LightningPlus",
        "created_utc": 1580104976,
        "id": "eujtzm",
        "num_comments": 52,
        "num_crossposts": 0,
        "selftext": "**Earnings Watch:  Nearly half of index, 14 out of 30 companies, expected to report  holiday-season results in busiest week of the season, which also  includes Facebook, Tesla and Amazon**\n\nThe Dow Jones Industrial Average increased more than 22% in 2019 and  is already up 2.2% through three weeks of 2020, but it is about to face  its biggest test of the young year, and potentially many years.\n\nNearly half of the 30 Dow  [DJIA, -0.58%](https://www.marketwatch.com/investing/index/djia?mod=MW_story_quote) components are scheduled to  report results from the holiday season in the coming week, which will be  by far the busiest week of the earnings season.\n\nThere are 14  Dow companies expected to report, the most companies from the blue-chip  index to report in a single week since at least 2014, a group that  includes two trillion-dollar market caps in Apple Inc. [AAPL, -0.29%](https://www.marketwatch.com/investing/stock/aapl?mod=MW_story_quote) and Microsoft Corp [MSFT, -1.01%](https://www.marketwatch.com/investing/stock/msft?mod=MW_story_quote) Plenty of non-Dow  companies will throw their numbers in as well — 141 of the S&amp;P 500  companies are expected to report, including Facebook Inc. [FB, -0.83%](https://www.marketwatch.com/investing/stock/fb?mod=MW_story_quote), Amazon.com Inc. [AMZN, -1.22%](https://www.marketwatch.com/investing/stock/amzn?mod=MW_story_quote) and Advanced Micro Devices Inc [AMD, -2.63%](https://www.marketwatch.com/investing/stock/amd?mod=MW_story_quote) \n\nThe 85 members of the S&amp;P 500 that have reported results thus far  have seen net income fall by 0.3% on average from a year ago, though  Credit Suisse Chief U.S. Equity Strategist Jonathan Golub said it’s  tough to make broader inferences from early reports given different  sectors tend to post results at different parts of the earnings cycle.  More than a third of S&amp;P 500 that have reported so far sit in the  financials sector, which could skew those results.\n\nThe  FactSet consensus currently calls for net income to fall by 1.9% for  the S&amp;P 500, based on a blend of reported results and analyst  projections, which would mean [the current earnings recession ](https://www.marketwatch.com/story/earnings-recession-is-expected-to-swallow-all-of-2019-after-holiday-forecasts-disappoint-2019-11-22)would swallow all of 2019’s results.\n\nHere’s what to watch for in the week ahead. \n\n[https://www.marketwatch.com/story/the-dow-is-about-to-face-its-stiffest-test-in-years-2020-01-25](https://www.marketwatch.com/story/the-dow-is-about-to-face-its-stiffest-test-in-years-2020-01-25)",
        "subreddit": "StockMarket",
        "title": "The Dow is about to face its stiffest test in years",
        "url": "https://www.reddit.com/r/StockMarket/comments/eujtzm/the_dow_is_about_to_face_its_stiffest_test_in/",
        "created": 1580133776.0
    },
    {
        "author": "Dza1021",
        "created_utc": 1580416805,
        "id": "ewbvhv",
        "num_comments": 52,
        "num_crossposts": 0,
        "selftext": "im on robinhood and $msft is stuck at $173.04 and it goes up to $173.20 and back down to $173.04 again but my option call equity keeps going down.\n\nI looked up msft current price and its saying its at $172.90. is anyone else having this problem?",
        "subreddit": "RobinHood",
        "title": "anyone have a problem with robinhood right now?",
        "url": "https://www.reddit.com/r/RobinHood/comments/ewbvhv/anyone_have_a_problem_with_robinhood_right_now/",
        "created": 1580445605.0
    },
    {
        "author": "Paddle_Heads",
        "created_utc": 1578882140,
        "id": "enxo6c",
        "num_comments": 50,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Technicals looking up, or down, or like they were made on Microsoft Paint",
        "url": "https://i.redd.it/0i9b2ulphga41.jpg",
        "created": 1578910940.0
    },
    {
        "author": "iFailedPreK",
        "created_utc": 1579348797,
        "id": "eqfl7g",
        "num_comments": 49,
        "num_crossposts": 0,
        "selftext": "What do you think about MSFT? I currently have MSFT $160 at 1/31 (premium at $3.7) and 2/7 (premium at $4.85), MSFT $157.5 at 2/28 (premium at $9.49), and SPY $330 at 2/12 (premium at $3.52). I have a 58% return on MSFT and a 40% return on SPY so far. Should I keep them or sell?\n\nCurrent option price:\nMSFT $160 1/31: $8.18\nMSFT $160 1/7: $8.65\nMSFT $157.5 1/28: $11.55\nSPY $330 1/12: $4.96\n\nSo far I've made $1,000 in a week. \nDo you think MSFT and SPY will continue to rise by those dates considering its past?\nI kind of want them to go down next week so it can bounce back up because it hasn't went down in a while, since I still have time left.",
        "subreddit": "wallstreetbets",
        "title": "Need some ACTUAL advice ples. MSFT and SPY",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eqfl7g/need_some_actual_advice_ples_msft_and_spy/",
        "created": 1579377597.0
    },
    {
        "author": "rgpace5",
        "created_utc": 1577930844,
        "id": "eirlng",
        "num_comments": 49,
        "num_crossposts": 0,
        "selftext": "When people discuss companies that will benefit from the introduction of 5G the same companies seem to come up...Apple, Qualcomm, Nokia, Ericcson, etc.\n\nPeople usually list companies providing the infrastructure for 5G,5G carriers like AT&amp;T or device companies like Apple. If you look at the companies that have benefited the most from increases WIFI and mobile internet speeds over the last decade it has been companies like Netflix, who have used advances in technology to disrupt traditional markets.\n\nThe effects have also been seen in cloud computing with Amazon and Microsoft, and advertising with Google/Amazon (faster networks/easier access = more searches)\n\nOver the next decade there will certainly be companies who leverage 5G to deepen their competitive advantages or new companies that emerge that will disrupt current markets. I would say remote health care might be an example of this,or companies that utilize increased speeds to monetize AI\n\nWhich companies do you all feel fit this description that you're holding for the long term (5 to 10 years and more)",
        "subreddit": "stocks",
        "title": "Companies that will benefit from 5G indirectly",
        "url": "https://www.reddit.com/r/stocks/comments/eirlng/companies_that_will_benefit_from_5g_indirectly/",
        "created": 1577959644.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1578148043,
        "id": "ejx893",
        "num_comments": 49,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/wallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning January 6th, 2020.\n\n# **Geopolitical tensions could hold back stocks in the week ahead, as investors await jobs report  - [(Source)](https://www.cnbc.com/2020/01/03/geopolitical-tensions-could-hold-back-stocks-in-the-week-ahead.html)**\n*****\n&gt; Geopolitical concerns could continue to weigh on stocks in the week ahead, leaving investors wondering whether Middle East tensions will be the catalyst for a much anticipated market pullback.\n*****\n&gt; Stocks sold off Friday, the second trading day of the year, after a rally to new highs on Thursday. The market was slammed after the U.S. killed Iranian military commander Qasem Soleimani, sparking a rally in oil prices and raising concerns Iran will take some retaliatory action.\n*****\n&gt; The big event in the coming week is the December employment report, expected to show 160,000 payrolls were added and average earnings rose 3.1% year-over-year, according to Refinitiv. The jobs report is especially important after December’s ISM manufacturing data Friday was surprisingly negative and the weakest in more than a decade.\n*****\n&gt; The S&amp;P 500 ended the four-day week at 3,235, with a loss of 0.2%, after Friday’s 0.7% decline. Treasury yields retreated on Friday, as buyers moved into the safety of bonds and the 10-year yield was at 1.78%.\n*****\n&gt; “This was a textbook rationale for a bout of profit taking, but that said, I don’t think it’s dramatic,” said Quincy Krosby, chief market strategist at Prudential Financial. “Nonetheless, the question will be when do buyers come in ... Much will depend on this weekend and next week in terms of headlines from both the White House and Iran.”\n*****\n&gt; Some analysts have been looking for a minor selloff in stocks after the fourth quarter’s 8.5% gain in the S&amp;P 500. But whether Friday’s decline is the start of something bigger is unclear.\n*****\n&gt; “It could be, but only in retrospect will you know for sure,” said Peter Boockvar, chief investment officer at Bleakley Advisory Group.\n*****\n&gt; Boockvar said if Iran takes some minor action, the market could shrug it off, oil could lose its gains, and stocks could move higher again.\n*****\n&gt; “We may see Treasurys continue to get a big bid, gold get a bid and the safe-haven currencies get a bid. If we go into things next week and all things are quiet, the market will pay attention to the data,” Krosby said.\n*****\n&gt; Gregory Faranello, head of U.S. rates at AmeriVet Securities, expects to see Treasury yields lower initially. “I think short-term, the geopolitical risk is probably going to override any fundamental views that people have of the marketplace,” he said.\n*****\n&gt; But there could be a catalyst for some Treasury selling with the issuance of high level of corporate bonds in the coming week. Faranello expects the year to start off strong, with corporate treasurers looking to raise about $30 billion to $35 billion in the debt market.\n*****\n&gt; Strategists said they will be looking closely at the jobs data after Friday’s surprisingly weak manufacturing survey from the Institute for Supply Management, which was expected to have been better because of the trade agreement.\n*****\n&gt; Stephen Stanley, chief economist at Amherst Pierpont, said the survey actually took place before the trade deal was announced, and he’s waiting for the results of the next couple of reports.\n*****\n&gt; He expects to see 165,000 jobs added in December, off of 266,000 in November, which was in part skewed by the end of GM’s strike. “I think there’s a little upside risk. It seems like we saw a pretty strong Christmas season,” he said, adding there could have been more hiring than was factored into seasonal adjustments.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/aoDnUW7.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/6x4NtiW.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/I3ZNEuH.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/QqYTbUD.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/U3Ltxt2.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/CyHtJoF.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/RO92K5i.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/SEszd5M.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/Trp0mo0.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/V19lVTd.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/tlPjW9c.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/aicevVU.png))**\n\n*****\n\n# Typical January Trading: Volatile Last 20 Years\n\n&gt; Yesterday major indexes continued their recent trend of strength on the first trading day of 2020. While today the market has turned weaker on escalating tensions between the U.S. and Iran. This type of volatility was once quite rare in January. However since 2000, the S&amp;P 500 has declined ten times in twenty years in January. This recent weakness can be seen in the above January seasonal pattern chart.\n\n&gt; Over the last 21 years, Only NASDAQ has posted a full-month average gain. DJIA, S&amp;P 500 and Russell 1000 have started January positive, only to surrender early-month gains by the eighth trading day. Greatest weakness has appeared just after mid-month, the eleventh trading day. Mild average losses on or around the eleventh trading day quickly swell to over 2% for DJIA and nearly as much for S&amp;P 500 and Russell 1000.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/82a79e9eb21df6d414fd0ec1c7725b4d/e48bbc4e7f5b7041-e9/s500x750/6a964dc4a15e1c9ab0fcc9ccc451f6e642aacff5.jpg))**\n\n*****\n\n# A Banner Year for US Equities\n\n&gt; 2019 was surely a banner year for US equities. With a total return of 31.5%, the S&amp;P 500's gain in 2019 was nearly three times the historical average 12-month return of 11.7%. That's strong! In the chart below we compare the S&amp;P 500's annualized returns over the last one, two, five, ten, and twenty years to its average annualized returns over those same time frames since 1928. While the one-year return sticks out like a sore thumb, we would note that the S&amp;P 500's annualized returns over the last two, three, and ten years are also above average. Almost as notable as the fact that the one year return has been so much stronger than average is that the S&amp;P 500's two-year return is less than two percentage points above its historical average. That just shows how bad 2018 was! Looking further out, the only time frame where returns are below average is over the last twenty years where the 6.1% annualized gain is almost five percentage points below the historical average. Over a full twenty years, that's a difference of tripling your investment versus making eight times your investment!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/01/010220-Annualized-returns.png))**\n\n&gt; The chart below compares how current returns during the above time frames rank on a percentile basis relative to all other periods. The S&amp;P 500's one-year return ranks in the 85th percentile which is pretty extreme. For the two, five, and ten year periods, though, current returns are much more middle of the road. Conversely, as stretched as extreme to the upside that the one-year return is relative to all other periods, the twenty-year return is even more depressed to the downside. At just 4.6, more than 95% of all other 20-year periods have been better than the last 20.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/01/010220-Annualized-returns-Percentile.png))**\n\n&gt; Finally, as mentioned above the last year has certainly been a strong one, and it follows a year where returns had been abnormally poor. The chart below shows the rolling 12-month total return for the S&amp;P 500 going back to 1990. The gain of 31.49% over the last year was the strongest for the S&amp;P 500 in six years coming up just shy of the 32.39% gain in 2013. Last year at this time, though, the S&amp;P 500 was down over 4% on a total return basis in the prior 12 months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/01/010220-Annualized-returns-Percentile-rolling.png))**\n\n*****\n\n# 2019 and 2020 Dogs of the Dow\n\n&gt; The Dogs of the Dow strategy is a simple, hands-off investment approach that says to buy the 10 highest yielding stocks in the Dow 30 at the start of each year. With the calendar turning over from 2019 to 2020, below is a look at how the Dogs strategy performed in 2019. As shown, the 10 Dogs posted a total return of 19.38% in 2019, which was below the 25% return for the Dow and well below the 28% that the 20 non-Dogs returned. The biggest winner in the Dogs in 2019 was JP Morgan (JPM) with a gain of 47.27%, but Pfizer's (PFE) decline of 6.92% really hurt overall performance.\n\n&gt; The 20 non-Dogs were led by Apple (AAPL), Microsoft (MSFT), Visa (V), and United Tech (UTX), while Walgreens Boots (WBA) and 3M (MMM) were the two non-Dogs that fell in 2019. Start a two-week free trial to Bespoke Institutional to access our Trend Analyzer tool and track key trends in individual stocks and major ETFs.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/01/dogs2019use.png))**\n\n&gt; Moving on to 2020, below is a list of this year's Dogs of the Dow. Eight of the ten Dogs from 2019 remain on the list, while 3M (MMM) and Walgreens Boots (WBA) -- the two non-Dogs that fell in 2019 -- have replaced JP Morgan (JPM) and Procter &amp; Gamble (PG) -- the two biggest gainers of the Dogs in 2019. Dow Inc. (DOW) is the highest yielding Dog at 5.12%, followed by Exxon (XOM), IBM, and Verizon (VZ), which all have dividend yields above 4%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/01/2020dogs.png))**\n\n*****\n\n# Full Year 2019, Q4, and December Asset Class Total Returns\n\n&gt; Below are the final total return performance numbers for key ETFs across asset classes in 2019. For each ETF, we also include its performance in Q4 and December.\n\n&gt; The S&amp;P 500 rallied 2.9% in December and 8.99% in Q4 to finish the full year up 31.22%. The Tech-heavy Nasdaq 100 (QQQ) was by far the best performing US index ETF in 2019 with a gain of 38.96%, and it was the third best ETF in the entire matrix. The title of best performing ETF in 2019 goes to the S&amp;P 500 Technology sector ETF (XLK), which rallied 49.86%. Remember, 40% of XLK is made up of just Apple (AAPL) and Microsoft (MSFT), which gained 89% and 58% in 2019, respectively. The Russia stock market ETF (RSX) was the second biggest winner in the matrix with a 2019 total return of 40.79%.\n\n&gt; Everywhere you look across the equity landscape, there were big winners in 2019, but the weakest area of the market was the Energy sector ETF (XLE). Even still, XLE managed to put up double-digit percentage gains on the year at +11.74%.\n\n&gt; In the commodities space, we saw oil gain 32.61% in 2019, which actually bested the gain for the S&amp;P 500. Gold (GLD) and silver (SLV) both put in solid gains in the mid-teens, while the perpetually losing natural gas ETF (UNG) was the only ticker in the matrix that fell across all three time frames (December, Q4, and full year).\n\n&gt; Looking at fixed income, the aggregate bond market ETFs (AGG and BND) posted total returns of 8%+, while the 20+ Year Treasury ETF (TLT) gained 14% on the year. Q4 and December were tough for fixed income, however, as rates moved higher.\n\n&gt; ###### **([CLICK HERE FOR THE CHART LINK #1!](https://media.bespokepremium.com/uploads/2020/01/assetclass1231.png))**\n\n*****\n\n# January Almanac: Average Performance Slips in Presidential Election Years\n\n&gt; January has quite a reputation on Wall Street as an influx of cash from yearend bonuses and annual allocations typically propels stocks higher. January ranks #1 for NASDAQ (since 1971), but fifth on the S&amp;P 500 and sixth for DJIA since 1950. It is the end of the best three-month span and holds a full docket of indicators and seasonalities.\n\n&gt; DJIA and S&amp;P rankings did slip from 2000 to 2016 as both indices suffered losses in ten of those seventeen Januarys with three in a row, 2008, 2009 and 2010 and then again in 2014 to 2016. January 2009 has the dubious honor of being the worst January on record for DJIA (-8.8%) and S&amp;P 500 (-8.6%) since 1901 and 1931 respectively. Last year, January was downright stellar after the worst December since 1931 for DJIA and S&amp;P 500.\n\n&gt; In election years, Januarys have been weaker. DJIA and S&amp;P 500 slip to number #8 while DJIA average performance dips negative. NASDAQ slips to #3, but average performance remains respectable at 1.7%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART LINK #1!](https://66.media.tumblr.com/891a38b2171ab08b547127db29f12536/f4d2c822df56176c-4f/s400x600/8f8fe64b2da5c123c7e073095dd8b656e1066429.jpg))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending January 3rd, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=KqDWuo8kiFU))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 1.5.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=-wTk5RDVRtE))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$CMC** \n&gt; * **$WBA** \n&gt; * **$BBBY** \n&gt; * **$STZ** \n&gt; * **$LEN** \n&gt; * **$CALM** \n&gt; * **$SMPL** \n&gt; * **$RPM** \n&gt; * **$ANGO** \n&gt; * **$AZZ** \n&gt; * **$KBH** \n&gt; * **$UNF** \n&gt; * **$MSM** \n&gt; * **$INFY** \n&gt; * **$SCHN** \n&gt; * **$SNX** \n&gt; * **$AYI** \n&gt; * **$GBX** \n&gt; * **$HELE** \n&gt; * **$SAR** \n&gt; * **$EXFO** \n&gt; * **$NTIC** \n&gt; * **$LNN** \n&gt; * **$WDFC** \n&gt; * **$KRUS** \n&gt; * **$FC** \n&gt; * **$SLP**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/Trp0mo0.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/lNG07hG.png))**\n###### **([CLICK HERE FOR MOST ANTICIPATED EARNINGS RELEASES FOR THE NEXT 5 WEEKS!](https://i.imgur.com/Y1KO0R4.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 1.6.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/DNOQOhD.png))\n\n&gt; # ***Monday 1.6.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n&gt; # ***Tuesday 1.7.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/QorVd8K.png))\n\n&gt; # ***Tuesday 1.7.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/xTrYEcQ.png))\n\n*****\n\n&gt; # ***Wednesday 1.8.2 0Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/TRPytQz.png))\n\n&gt; # ***Wednesday 1.8.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/owUNbSh.png))\n\n*****\n\n&gt; # ***Thursday 1.9.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/RXUjAgC.png))\n\n&gt; # ***Thursday 1.9.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/m5AQPKl.png))\n\n*****\n\n&gt; # ***Friday 1.10.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/v60Cw2n.png))\n\n\n*****\n\n&gt; # ***Friday 1.10.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# lululemon athletica inc. $229.38\n&gt; **lululemon athletica inc. (LULU)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, December 11, 2019. The consensus earnings estimate is $0.93 per share on revenue of $896.50 million and the Earnings Whisper ® number is $0.98 per share. Investor sentiment going into the company's earnings release has 73% expecting an earnings beat The company's guidance was for earnings of $0.90 to $0.92 per share on revenue of $880.00 million to $890.00 million. Consensus estimates are for year-over-year earnings growth of 24.00% with revenue increasing by 19.91%. Short interest has increased by 9.8% since the company's last earnings release while the stock has drifted higher by 16.0% from its open following the earnings release to be 26.0% above its 200 day moving average of $182.08. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, December 6, 2019 there was some notable buying of 927 contracts of the $260.00 call expiring on Friday, December 13, 2019. Option traders are pricing in a 8.3% move on earnings and the stock has averaged a 11.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LULU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Commercial Metals Company $22.18\n&gt; **Commercial Metals Company (CMC)** is confirmed to report earnings at approximately 6:45 AM ET on Monday, January 6, 2020. The consensus earnings estimate is $0.56 per share on revenue of $1.45 billion and the Earnings Whisper ® number is $0.59 per share. Investor sentiment going into the company's earnings release has 74% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 60.00% with revenue increasing by 13.52%. Short interest has decreased by 22.3% since the company's last earnings release while the stock has drifted higher by 17.6% from its open following the earnings release to be 22.0% above its 200 day moving average of $18.18. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 7.4% move on earnings and the stock has averaged a 6.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CMC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Walgreens Boots Alliance Inc $59.08\n&gt; **Walgreens Boots Alliance Inc (WBA)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, January 8, 2020. The consensus earnings estimate is $1.40 per share on revenue of $34.63 billion and the Earnings Whisper ® number is $1.41 per share. Investor sentiment going into the company's earnings release has 64% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 4.11% with revenue increasing by 2.48%. Short interest has decreased by 30.6% since the company's last earnings release while the stock has drifted higher by 5.4% from its open following the earnings release to be 7.3% above its 200 day moving average of $55.08. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 4.8% move on earnings and the stock has averaged a 5.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=WBA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Bed Bath &amp; Beyond, Inc. $16.08\n&gt; **Bed Bath &amp; Beyond, Inc. (BBBY)** is confirmed to report earnings at approximately 4:15 PM ET on Wednesday, January 8, 2020. The consensus earnings estimate is $0.03 per share on revenue of $2.86 billion and the Earnings Whisper ® number is $0.04 per share. Investor sentiment going into the company's earnings release has 62% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 83.33% with revenue decreasing by 5.68%. Short interest has decreased by 7.7% since the company's last earnings release while the stock has drifted higher by 65.3% from its open following the earnings release to be 24.8% above its 200 day moving average of $12.89. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, December 27, 2019 there was some notable buying of 4,141 contracts of the $17.00 put expiring on Friday, February 21, 2020. Option traders are pricing in a 13.3% move on earnings and the stock has averaged a 9.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BBBY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Constellation Brands, Inc. $189.53\n&gt; **Constellation Brands, Inc. (STZ)** is confirmed to report earnings at approximately 7:30 AM ET on Wednesday, January 8, 2020. The consensus earnings estimate is $1.90 per share on revenue of $1.95 billion and the Earnings Whisper ® number is $1.91 per share. Investor sentiment going into the company's earnings release has 51% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 19.83% with revenue decreasing by 9.75%. Short interest has decreased by 7.7% since the company's last earnings release while the stock has drifted lower by 5.7% from its open following the earnings release to be 1.9% below its 200 day moving average of $193.11. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 5.5% move on earnings and the stock has averaged a 6.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=STZ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Lennar Corp. $56.47\n&gt; **Lennar Corp. (LEN)** is confirmed to report earnings at approximately 6:00 AM ET on Wednesday, January 8, 2020. The consensus earnings estimate is $1.90 per share on revenue of $6.70 billion and the Earnings Whisper ® number is $1.95 per share. Investor sentiment going into the company's earnings release has 69% expecting an earnings beat The company's guidance was for earnings of $0.84 to $1.94 per share. Consensus estimates are for earnings to decline year-over-year by 3.06% with revenue increasing by 3.73%. Short interest has increased by 4.9% since the company's last earnings release while the stock has drifted higher by 0.1% from its open following the earnings release to be 5.7% above its 200 day moving average of $53.44. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 5.2% move on earnings and the stock has averaged a 4.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LEN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Cal-Maine Foods $42.45\n&gt; **Cal-Maine Foods (CALM)** is confirmed to report earnings at approximately 6:30 AM ET on Monday, January 6, 2020. Investor sentiment going into the company's earnings release has 50% expecting an earnings beat. Short interest has decreased by 19.1% since the company's last earnings release while the stock has drifted higher by 2.0% from its open following the earnings release to be 2.6% above its 200 day moving average of $41.38. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 6.4% move on earnings and the stock has averaged a 4.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CALM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Simply Good Foods Company $28.17\n&gt; **Simply Good Foods Company (SMPL)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, January 9, 2020. The consensus earnings estimate is $0.21 per share on revenue of $166.52 million and the Earnings Whisper ® number is $0.23 per share. Investor sentiment going into the company's earnings release has 70% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 16.67% with revenue increasing by 37.70%. Short interest has increased by 140.7% since the company's last earnings release while the stock has drifted higher by 16.2% from its open following the earnings release to be 10.0% above its 200 day moving average of $25.62. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 18.1% move on earnings and the stock has averaged a 4.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SMPL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# RPM International Inc. $75.15\n&gt; **RPM International Inc. (RPM)** is confirmed to report earnings at approximately 6:45 AM ET on Wednesday, January 8, 2020. The consensus earnings estimate is $0.73 per share on revenue of $1.40 billion and the Earnings Whisper ® number is $0.72 per share. Investor sentiment going into the company's earnings release has 59% expecting an earnings beat The company's guidance was for earnings of $0.71 to $0.76 per share. Consensus estimates are for year-over-year earnings growth of 40.38% with revenue increasing by 2.75%. Short interest has decreased by 16.2% since the company's last earnings release while the stock has drifted higher by 15.5% from its open following the earnings release to be 13.8% above its 200 day moving average of $66.05. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 4.5% move on earnings and the stock has averaged a 3.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=RPM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# AngioDynamics $16.49\n&gt; **AngioDynamics (ANGO)** is confirmed to report earnings at approximately 6:00 AM ET on Tuesday, January 7, 2020. The consensus earnings estimate is $0.01 per share on revenue of $71.88 million. Investor sentiment going into the company's earnings release has 28% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 95.45% with revenue decreasing by 21.45%. Short interest has decreased by 27.0% since the company's last earnings release while the stock has drifted higher by 3.7% from its open following the earnings release to be 11.1% below its 200 day moving average of $18.55. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 16.2% move on earnings and the stock has averaged a 9.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ANGO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# AZZ Inc. $45.21\n&gt; **AZZ Inc. (AZZ)** is confirmed to report earnings at approximately 6:30 AM ET on Thursday, January 9, 2020. The consensus earnings estimate is $0.84 per share on revenue of $276.30 million. Investor sentiment going into the company's earnings release has 55% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 42.37% with revenue increasing by 15.36%. Short interest has increased by 121.9% since the company's last earnings release while the stock has drifted higher by 7.6% from its open following the earnings release to be 5.1% above its 200 day moving average of $43.00. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 11.7% move on earnings and the stock has averaged a 7.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AZZ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/wallstreetbets.",
        "subreddit": "wallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning January 6th, 2020",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ejx893/wall_street_week_ahead_for_the_trading_week/",
        "created": 1578176843.0
    },
    {
        "author": "BrownAces",
        "created_utc": 1579816163,
        "id": "et02tt",
        "num_comments": 48,
        "num_crossposts": 0,
        "selftext": "had a nice 130k win on tsla calls this week, decided since the $ fell into my lap out of dumb luck, might as well see if the end of day momentum continues tomorrow on MSFT, wish me luck lol.\n\nhttps://preview.redd.it/ktg4uvapmlc41.jpg?width=657&amp;format=pjpg&amp;auto=webp&amp;s=1fc86ce0f4882c5fb322d73808e3ad1f9eb74027",
        "subreddit": "wallstreetbets",
        "title": "130K into tomorrows MSFT 165 calls, wish me luck",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/et02tt/130k_into_tomorrows_msft_165_calls_wish_me_luck/",
        "created": 1579844963.0
    },
    {
        "author": "Johnnybats330",
        "created_utc": 1579238027,
        "id": "epvvzf",
        "num_comments": 47,
        "num_crossposts": 0,
        "selftext": "Every week the S&amp;P reaches new highs. A lot of stocks are reaching 52 wk highs like MSFT, Apple, CRM, Accenture.\n\nI have shorted and held aome of them, but currently holding back on putting more than 60% of my cash in equity thinking prices well fall.\n\nIs anyone else holding to cash like a dummy while the bulls run?",
        "subreddit": "investing",
        "title": "Is anyone sittin on cash?",
        "url": "https://www.reddit.com/r/investing/comments/epvvzf/is_anyone_sittin_on_cash/",
        "created": 1579266827.0
    },
    {
        "author": "saadbruh",
        "created_utc": 1579215305,
        "id": "epr6gc",
        "num_comments": 47,
        "num_crossposts": 0,
        "selftext": "After the initial purchase of AMD a few days ago, I decided for another 5 with MSFT!! Pumped. Complete beginner starting from my own research and reading all the posts on here. Besides having to a pay CIBC a $6.95 fee per trade, I think I'm getting a decent grasp. Also, the fact that I'm in Canada and have to get the currency exchanged when making a trade is okkk? Am I kind of losing like that? Is that a stupid ass question? Because when I sell my shares, I plan to convert that back in to Canadian currency, so if the dollar value doesn't really change, I won't be losing any money right?",
        "subreddit": "stocks",
        "title": "2nd ever stock purchase. 5 shares of MSFT!!! (AMD #1)",
        "url": "https://www.reddit.com/r/stocks/comments/epr6gc/2nd_ever_stock_purchase_5_shares_of_msft_amd_1/",
        "created": 1579244105.0
    },
    {
        "author": "ceud",
        "created_utc": 1579046714,
        "id": "eou2l3",
        "num_comments": 47,
        "num_crossposts": 0,
        "selftext": "Hi [r/stocks](https://www.reddit.com/r/stocks/) !\n\nI got a lot of requests and messages to keep coming out with posts of stock picks. If you missed my last one, here's the [link](https://www.reddit.com/r/stocks/comments/ej4aqf/top_stock_picks_for_2020/). Hopefully, many of you are enjoying gains in $PGNY - up 30% from the date of the post! :)\n\nFeel free to add comments/questions below and I'll respond as fast as possible.\n\n**Livongo Health (**[$LVGO](https://finviz.com/quote.ashx?t=lvgo&amp;ty=c&amp;ta=1&amp;p=d)**)**\n\n* A consumer digital health company, launched today with a vision to empower people with chronic conditions to live better through the combined power of technology, real-time personalized information, and support from their chosen care team.\n* The platform analyzes data to build a picture of a person’s patterns, while dietitians and physiologists give them real-time advice about diet, medication and exercise by apps or text message. If a patient’s blood sugar is dangerously low or high, a coach will call to warn them within 60 seconds. Inspired by how big tech companies personalize services and nudge people into certain behaviors, Livongo — short for living-on-the-go — started by treating diabetes, before moving on to hypertension, weight loss and mental health.\n\n**Why?**\n\n* Livongo provides a truly disruptive technology and they're targeting a massive TAM (total addressable market). 90% of the $3.5 trillion spent annually on healthcare is dedicated to people with chronic and mental health conditions -- this is only expected to increase.\n* It also just signed its [largest contract ever](https://www.businessinsider.com/livongo-lands-biggest-contract-yet-2019-10) for the US government, allowing it to provide its diabetes solution to 5.3M employees as part of the Federal Employee Health Benefits Platform starting in 2020. Launching at the start of 2020, the tool will be available to 5 million federal employees and their families — and Livongo is optimistic that the partnership will afford it 45,000 new members and a revenue boost of up to $60 million through 2021. That's a significant lift given that Livongo brought in a total of [$68 million](https://e.businessinsider.com/click/18262001.4/aHR0cHM6Ly93d3cuc2VjLmdvdi9BcmNoaXZlcy9lZGdhci9kYXRhLzE2MzkyMjUvMDAwMTE5MzEyNTE5MTg1MTU5L2Q3MzEyNDlkczEuaHRt/5d233c18f730436f2414784fB050eba75) in revenue in 2018, it reported in its S-1 filing.\n* LVGO's clients include 20% of the Fortune 500 (Target, Pepsi, Microsoft, Merck, and Citigroup) and boast a high retention rate of \\~96%. They reported a 121% YoY growth in Q3 2019 and continue to grow exponentially.\n* Announced partnership this week that they were collaborating with Dexcom ($DXCM) on user data dissemination. In a joint press release, the two companies said that users of Livongo's health information platform would be able to sync their data from DexCom's G6 glucose (blood sugar) monitoring system.\n* Livongo and health kiosk startup Higi have teamed up for a new program that will bring a Livongo-branded on-stage program to nearly 500 retail pharmacies. Higi has smart health stations at more than 11,000 chain grocery stores and pharmacies sites around the country. They include major brands like Rite Aid, Walgreens, and Kroger.",
        "subreddit": "stocks",
        "title": "Top Stock Pick for 2020 (Pt. 2)",
        "url": "https://www.reddit.com/r/stocks/comments/eou2l3/top_stock_pick_for_2020_pt_2/",
        "created": 1579075514.0
    },
    {
        "author": "Schwermetall86",
        "created_utc": 1580336657,
        "id": "evuhdv",
        "num_comments": 45,
        "num_crossposts": 0,
        "selftext": "- $BA missed everything -&gt; stock goes up\n- $FB exceeds on all fronts except expenses -&gt; stock goes down\n- $BYND seems to be a shitshow not even able to decide on an earnings date -&gt; stock starts to slowly deteriorate\n\nAt least I have $MSFT calls (where IV crush is not gonna rail me completely hopefully) and was smart enough to sell AMD before earnings.\nThis won't make up for the loss though, therefore, this was the last time I speculated on earnings.\n\nNow that I could share this with my closest friends here I really feel better, like each time after I regularly got beaten up in elementary school, when talking to my friend that the psychologist claimed to be imaginary... what a dick.",
        "subreddit": "wallstreetbets",
        "title": "The last earnings play for me",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/evuhdv/the_last_earnings_play_for_me/",
        "created": 1580365457.0
    },
    {
        "author": "SporeFan19",
        "created_utc": 1578415480,
        "id": "ele00e",
        "num_comments": 44,
        "num_crossposts": 0,
        "selftext": "The second best time is in two weeks when that shit drops back down to low 30s. Now hear me out retards before you start throwing your prebuilt HP Pavilion Gaming Desktops at me.  \n  \nYes we all know that AMD blows shintel out of the water in literally every way and the new stuff makes literally every Intel laptop look like a Chinese knockoff of the 1986 IBM PC Convertible. But look at the news and see who it really affects. Do you think $BECKY is going to buy a 64 core AMD Thundercock? Fuck no, $BECKY knows your eyes can only see 32 cores at a time. And you can be sure her favorite movie studios won't be either because we know in Frozen 3: Iced Caramel Macchiato, that new scene with Elsa doing coke off of Olaf's ass is going to be rendered with 4 year old workstations. Emperor Mickey Mouse is not going to fork out a fucking penny for that shit for several more years because he wants to max out those gains.  \n  \nNow let's get to the more important thing, laptops. Who are the primary audience for new laptop purchases? It's fucking $BECKY. We all know that you're not trading in your 3 year old AMD Ryzen Lenovo for another 10 years when you run out of Indian sweatshops capable of recovering your 1TB hentai collection because they cant find flex tape strong enough to hold your broken down cum stained piece of shit laptop together. Do you think $BECKY cares that AMD's new processors are 5 quadrillion times better than anything that ever made Bob Swan edge in his sleep? Hell fucking no. $BECKY needs her apps and all her friends hate when Shaun sends a green SMS from his lenovo anyway. She can't live without Pages and Keynote, and knows exactly how to turn on Microsoft remote desktop to get help when she can't find a tab she closed on Safari. And you know the fucking second she gets a dent in the cover or spills 1ml of her Matcha Green Tea on the keyboard of her 2019 MacBook Pro and it makes a little sticky noise, she's taking that bitch in to the Apple Store where they convince her to buy a brand new one in full. She will be in tears as she pulls out your Surge Mastercard and buys that 2020 Macbook Air along with the $420.69 Airpods pro deluxe that comes in a box with that cute emoji sticker.  \n  \nDon't say I didn't fucking warn you. $BECKY is coming, but you won't be.",
        "subreddit": "wallstreetbets",
        "title": "The first best time to buy AMD was 2015...",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ele00e/the_first_best_time_to_buy_amd_was_2015/",
        "created": 1578444280.0
    },
    {
        "author": "jackabood",
        "created_utc": 1579264506,
        "id": "epzt2y",
        "num_comments": 44,
        "num_crossposts": 0,
        "selftext": "i was sitting on money for years just collecting dust and but lately i opened a brokerage account and decided to just wing it lol. i invested around $14,000 on AMD, MSFT, MAIN, BABA, XLK and SWKS. i put it another $14,000 in ARAMCO IPO  thru some random brokerage. i still have around $50,000 that i want to invest as well. i'm 25 and make around $37,000 a year doing a job i hate. i really wanna set myself to leave my job and do a job i love without worrying too much about the finance. what do u guys recommend i do with the 50k i can invest?",
        "subreddit": "stocks",
        "title": "i want to invest some of my saving $80,000 but i don't know what to invest it on.",
        "url": "https://www.reddit.com/r/stocks/comments/epzt2y/i_want_to_invest_some_of_my_saving_80000_but_i/",
        "created": 1579293306.0
    },
    {
        "author": "MaxAds1",
        "created_utc": 1578321643,
        "id": "ekuyvu",
        "num_comments": 43,
        "num_crossposts": 0,
        "selftext": "My first options trade on thinkorswim is currently down $3,600. It’s okay though right? Totally going to bounce back. I’m fine. It’s fine. Everything’s fine. Someone please give me a YOLO and I’ll flip a coin on it. Heads I go all in for 5K on it, tails I go all in for 5k on it. \n\nJesus take the wheel.",
        "subreddit": "wallstreetbets",
        "title": "A prayer for my SPY and MSFT calls",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ekuyvu/a_prayer_for_my_spy_and_msft_calls/",
        "created": 1578350443.0
    },
    {
        "author": "Kepa_SZN",
        "created_utc": 1578016279,
        "id": "ej87wf",
        "num_comments": 42,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "investing",
        "title": "I sold some stock for a total lose of $4500. If I sell MSFT for a gain of $3000, and immediately buy it back, does it mean that I never have to pay taxes on the $3000 gain?",
        "url": "https://www.reddit.com/r/investing/comments/ej87wf/i_sold_some_stock_for_a_total_lose_of_4500_if_i/",
        "created": 1578045079.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1578147965,
        "id": "ejx7sw",
        "num_comments": 41,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/stocks. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning January 6th, 2020.\n\n# **Geopolitical tensions could hold back stocks in the week ahead, as investors await jobs report  - [(Source)](https://www.cnbc.com/2020/01/03/geopolitical-tensions-could-hold-back-stocks-in-the-week-ahead.html)**\n*****\n&gt; Geopolitical concerns could continue to weigh on stocks in the week ahead, leaving investors wondering whether Middle East tensions will be the catalyst for a much anticipated market pullback.\n*****\n&gt; Stocks sold off Friday, the second trading day of the year, after a rally to new highs on Thursday. The market was slammed after the U.S. killed Iranian military commander Qasem Soleimani, sparking a rally in oil prices and raising concerns Iran will take some retaliatory action.\n*****\n&gt; The big event in the coming week is the December employment report, expected to show 160,000 payrolls were added and average earnings rose 3.1% year-over-year, according to Refinitiv. The jobs report is especially important after December’s ISM manufacturing data Friday was surprisingly negative and the weakest in more than a decade.\n*****\n&gt; The S&amp;P 500 ended the four-day week at 3,235, with a loss of 0.2%, after Friday’s 0.7% decline. Treasury yields retreated on Friday, as buyers moved into the safety of bonds and the 10-year yield was at 1.78%.\n*****\n&gt; “This was a textbook rationale for a bout of profit taking, but that said, I don’t think it’s dramatic,” said Quincy Krosby, chief market strategist at Prudential Financial. “Nonetheless, the question will be when do buyers come in ... Much will depend on this weekend and next week in terms of headlines from both the White House and Iran.”\n*****\n&gt; Some analysts have been looking for a minor selloff in stocks after the fourth quarter’s 8.5% gain in the S&amp;P 500. But whether Friday’s decline is the start of something bigger is unclear.\n*****\n&gt; “It could be, but only in retrospect will you know for sure,” said Peter Boockvar, chief investment officer at Bleakley Advisory Group.\n*****\n&gt; Boockvar said if Iran takes some minor action, the market could shrug it off, oil could lose its gains, and stocks could move higher again.\n*****\n&gt; “We may see Treasurys continue to get a big bid, gold get a bid and the safe-haven currencies get a bid. If we go into things next week and all things are quiet, the market will pay attention to the data,” Krosby said.\n*****\n&gt; Gregory Faranello, head of U.S. rates at AmeriVet Securities, expects to see Treasury yields lower initially. “I think short-term, the geopolitical risk is probably going to override any fundamental views that people have of the marketplace,” he said.\n*****\n&gt; But there could be a catalyst for some Treasury selling with the issuance of high level of corporate bonds in the coming week. Faranello expects the year to start off strong, with corporate treasurers looking to raise about $30 billion to $35 billion in the debt market.\n*****\n&gt; Strategists said they will be looking closely at the jobs data after Friday’s surprisingly weak manufacturing survey from the Institute for Supply Management, which was expected to have been better because of the trade agreement.\n*****\n&gt; Stephen Stanley, chief economist at Amherst Pierpont, said the survey actually took place before the trade deal was announced, and he’s waiting for the results of the next couple of reports.\n*****\n&gt; He expects to see 165,000 jobs added in December, off of 266,000 in November, which was in part skewed by the end of GM’s strike. “I think there’s a little upside risk. It seems like we saw a pretty strong Christmas season,” he said, adding there could have been more hiring than was factored into seasonal adjustments.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/aoDnUW7.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/6x4NtiW.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/I3ZNEuH.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/QqYTbUD.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/U3Ltxt2.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/CyHtJoF.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/RO92K5i.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/SEszd5M.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/Trp0mo0.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/V19lVTd.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/tlPjW9c.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/aicevVU.png))**\n\n*****\n\n# Typical January Trading: Volatile Last 20 Years\n\n&gt; Yesterday major indexes continued their recent trend of strength on the first trading day of 2020. While today the market has turned weaker on escalating tensions between the U.S. and Iran. This type of volatility was once quite rare in January. However since 2000, the S&amp;P 500 has declined ten times in twenty years in January. This recent weakness can be seen in the above January seasonal pattern chart.\n\n&gt; Over the last 21 years, Only NASDAQ has posted a full-month average gain. DJIA, S&amp;P 500 and Russell 1000 have started January positive, only to surrender early-month gains by the eighth trading day. Greatest weakness has appeared just after mid-month, the eleventh trading day. Mild average losses on or around the eleventh trading day quickly swell to over 2% for DJIA and nearly as much for S&amp;P 500 and Russell 1000.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/82a79e9eb21df6d414fd0ec1c7725b4d/e48bbc4e7f5b7041-e9/s500x750/6a964dc4a15e1c9ab0fcc9ccc451f6e642aacff5.jpg))**\n\n*****\n\n# A Banner Year for US Equities\n\n&gt; 2019 was surely a banner year for US equities. With a total return of 31.5%, the S&amp;P 500's gain in 2019 was nearly three times the historical average 12-month return of 11.7%. That's strong! In the chart below we compare the S&amp;P 500's annualized returns over the last one, two, five, ten, and twenty years to its average annualized returns over those same time frames since 1928. While the one-year return sticks out like a sore thumb, we would note that the S&amp;P 500's annualized returns over the last two, three, and ten years are also above average. Almost as notable as the fact that the one year return has been so much stronger than average is that the S&amp;P 500's two-year return is less than two percentage points above its historical average. That just shows how bad 2018 was! Looking further out, the only time frame where returns are below average is over the last twenty years where the 6.1% annualized gain is almost five percentage points below the historical average. Over a full twenty years, that's a difference of tripling your investment versus making eight times your investment!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/01/010220-Annualized-returns.png))**\n\n&gt; The chart below compares how current returns during the above time frames rank on a percentile basis relative to all other periods. The S&amp;P 500's one-year return ranks in the 85th percentile which is pretty extreme. For the two, five, and ten year periods, though, current returns are much more middle of the road. Conversely, as stretched as extreme to the upside that the one-year return is relative to all other periods, the twenty-year return is even more depressed to the downside. At just 4.6, more than 95% of all other 20-year periods have been better than the last 20.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/01/010220-Annualized-returns-Percentile.png))**\n\n&gt; Finally, as mentioned above the last year has certainly been a strong one, and it follows a year where returns had been abnormally poor. The chart below shows the rolling 12-month total return for the S&amp;P 500 going back to 1990. The gain of 31.49% over the last year was the strongest for the S&amp;P 500 in six years coming up just shy of the 32.39% gain in 2013. Last year at this time, though, the S&amp;P 500 was down over 4% on a total return basis in the prior 12 months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/01/010220-Annualized-returns-Percentile-rolling.png))**\n\n*****\n\n# 2019 and 2020 Dogs of the Dow\n\n&gt; The Dogs of the Dow strategy is a simple, hands-off investment approach that says to buy the 10 highest yielding stocks in the Dow 30 at the start of each year. With the calendar turning over from 2019 to 2020, below is a look at how the Dogs strategy performed in 2019. As shown, the 10 Dogs posted a total return of 19.38% in 2019, which was below the 25% return for the Dow and well below the 28% that the 20 non-Dogs returned. The biggest winner in the Dogs in 2019 was JP Morgan (JPM) with a gain of 47.27%, but Pfizer's (PFE) decline of 6.92% really hurt overall performance.\n\n&gt; The 20 non-Dogs were led by Apple (AAPL), Microsoft (MSFT), Visa (V), and United Tech (UTX), while Walgreens Boots (WBA) and 3M (MMM) were the two non-Dogs that fell in 2019. Start a two-week free trial to Bespoke Institutional to access our Trend Analyzer tool and track key trends in individual stocks and major ETFs.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/01/dogs2019use.png))**\n\n&gt; Moving on to 2020, below is a list of this year's Dogs of the Dow. Eight of the ten Dogs from 2019 remain on the list, while 3M (MMM) and Walgreens Boots (WBA) -- the two non-Dogs that fell in 2019 -- have replaced JP Morgan (JPM) and Procter &amp; Gamble (PG) -- the two biggest gainers of the Dogs in 2019. Dow Inc. (DOW) is the highest yielding Dog at 5.12%, followed by Exxon (XOM), IBM, and Verizon (VZ), which all have dividend yields above 4%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/01/2020dogs.png))**\n\n*****\n\n# Full Year 2019, Q4, and December Asset Class Total Returns\n\n&gt; Below are the final total return performance numbers for key ETFs across asset classes in 2019. For each ETF, we also include its performance in Q4 and December.\n\n&gt; The S&amp;P 500 rallied 2.9% in December and 8.99% in Q4 to finish the full year up 31.22%. The Tech-heavy Nasdaq 100 (QQQ) was by far the best performing US index ETF in 2019 with a gain of 38.96%, and it was the third best ETF in the entire matrix. The title of best performing ETF in 2019 goes to the S&amp;P 500 Technology sector ETF (XLK), which rallied 49.86%. Remember, 40% of XLK is made up of just Apple (AAPL) and Microsoft (MSFT), which gained 89% and 58% in 2019, respectively. The Russia stock market ETF (RSX) was the second biggest winner in the matrix with a 2019 total return of 40.79%.\n\n&gt; Everywhere you look across the equity landscape, there were big winners in 2019, but the weakest area of the market was the Energy sector ETF (XLE). Even still, XLE managed to put up double-digit percentage gains on the year at +11.74%.\n\n&gt; In the commodities space, we saw oil gain 32.61% in 2019, which actually bested the gain for the S&amp;P 500. Gold (GLD) and silver (SLV) both put in solid gains in the mid-teens, while the perpetually losing natural gas ETF (UNG) was the only ticker in the matrix that fell across all three time frames (December, Q4, and full year).\n\n&gt; Looking at fixed income, the aggregate bond market ETFs (AGG and BND) posted total returns of 8%+, while the 20+ Year Treasury ETF (TLT) gained 14% on the year. Q4 and December were tough for fixed income, however, as rates moved higher.\n\n&gt; ###### **([CLICK HERE FOR THE CHART LINK #1!](https://media.bespokepremium.com/uploads/2020/01/assetclass1231.png))**\n\n*****\n\n# January Almanac: Average Performance Slips in Presidential Election Years\n\n&gt; January has quite a reputation on Wall Street as an influx of cash from yearend bonuses and annual allocations typically propels stocks higher. January ranks #1 for NASDAQ (since 1971), but fifth on the S&amp;P 500 and sixth for DJIA since 1950. It is the end of the best three-month span and holds a full docket of indicators and seasonalities.\n\n&gt; DJIA and S&amp;P rankings did slip from 2000 to 2016 as both indices suffered losses in ten of those seventeen Januarys with three in a row, 2008, 2009 and 2010 and then again in 2014 to 2016. January 2009 has the dubious honor of being the worst January on record for DJIA (-8.8%) and S&amp;P 500 (-8.6%) since 1901 and 1931 respectively. Last year, January was downright stellar after the worst December since 1931 for DJIA and S&amp;P 500.\n\n&gt; In election years, Januarys have been weaker. DJIA and S&amp;P 500 slip to number #8 while DJIA average performance dips negative. NASDAQ slips to #3, but average performance remains respectable at 1.7%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART LINK #1!](https://66.media.tumblr.com/891a38b2171ab08b547127db29f12536/f4d2c822df56176c-4f/s400x600/8f8fe64b2da5c123c7e073095dd8b656e1066429.jpg))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending January 3rd, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED!)\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 1.5.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED!)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$CMC** \n&gt; * **$WBA** \n&gt; * **$BBBY** \n&gt; * **$STZ** \n&gt; * **$LEN** \n&gt; * **$CALM** \n&gt; * **$SMPL** \n&gt; * **$RPM** \n&gt; * **$ANGO** \n&gt; * **$AZZ** \n&gt; * **$KBH** \n&gt; * **$UNF** \n&gt; * **$MSM** \n&gt; * **$INFY** \n&gt; * **$SCHN** \n&gt; * **$SNX** \n&gt; * **$AYI** \n&gt; * **$GBX** \n&gt; * **$HELE** \n&gt; * **$SAR** \n&gt; * **$EXFO** \n&gt; * **$NTIC** \n&gt; * **$LNN** \n&gt; * **$WDFC** \n&gt; * **$KRUS** \n&gt; * **$FC** \n&gt; * **$SLP**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/Trp0mo0.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/lNG07hG.png))**\n###### **([CLICK HERE FOR MOST ANTICIPATED EARNINGS RELEASES FOR THE NEXT 5 WEEKS!](https://i.imgur.com/Y1KO0R4.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 1.6.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/DNOQOhD.png))\n\n&gt; # ***Monday 1.6.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n&gt; # ***Tuesday 1.7.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/QorVd8K.png))\n\n&gt; # ***Tuesday 1.7.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/xTrYEcQ.png))\n\n*****\n\n&gt; # ***Wednesday 1.8.2 0Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/TRPytQz.png))\n\n&gt; # ***Wednesday 1.8.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/owUNbSh.png))\n\n*****\n\n&gt; # ***Thursday 1.9.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/RXUjAgC.png))\n\n&gt; # ***Thursday 1.9.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/m5AQPKl.png))\n\n*****\n\n&gt; # ***Friday 1.10.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/v60Cw2n.png))\n\n\n*****\n\n&gt; # ***Friday 1.10.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# lululemon athletica inc. $229.38\n&gt; **lululemon athletica inc. (LULU)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, December 11, 2019. The consensus earnings estimate is $0.93 per share on revenue of $896.50 million and the Earnings Whisper ® number is $0.98 per share. Investor sentiment going into the company's earnings release has 73% expecting an earnings beat The company's guidance was for earnings of $0.90 to $0.92 per share on revenue of $880.00 million to $890.00 million. Consensus estimates are for year-over-year earnings growth of 24.00% with revenue increasing by 19.91%. Short interest has increased by 9.8% since the company's last earnings release while the stock has drifted higher by 16.0% from its open following the earnings release to be 26.0% above its 200 day moving average of $182.08. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, December 6, 2019 there was some notable buying of 927 contracts of the $260.00 call expiring on Friday, December 13, 2019. Option traders are pricing in a 8.3% move on earnings and the stock has averaged a 11.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LULU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Commercial Metals Company $22.18\n&gt; **Commercial Metals Company (CMC)** is confirmed to report earnings at approximately 6:45 AM ET on Monday, January 6, 2020. The consensus earnings estimate is $0.56 per share on revenue of $1.45 billion and the Earnings Whisper ® number is $0.59 per share. Investor sentiment going into the company's earnings release has 74% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 60.00% with revenue increasing by 13.52%. Short interest has decreased by 22.3% since the company's last earnings release while the stock has drifted higher by 17.6% from its open following the earnings release to be 22.0% above its 200 day moving average of $18.18. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 7.4% move on earnings and the stock has averaged a 6.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CMC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Walgreens Boots Alliance Inc $59.08\n&gt; **Walgreens Boots Alliance Inc (WBA)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, January 8, 2020. The consensus earnings estimate is $1.40 per share on revenue of $34.63 billion and the Earnings Whisper ® number is $1.41 per share. Investor sentiment going into the company's earnings release has 64% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 4.11% with revenue increasing by 2.48%. Short interest has decreased by 30.6% since the company's last earnings release while the stock has drifted higher by 5.4% from its open following the earnings release to be 7.3% above its 200 day moving average of $55.08. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 4.8% move on earnings and the stock has averaged a 5.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=WBA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Bed Bath &amp; Beyond, Inc. $16.08\n&gt; **Bed Bath &amp; Beyond, Inc. (BBBY)** is confirmed to report earnings at approximately 4:15 PM ET on Wednesday, January 8, 2020. The consensus earnings estimate is $0.03 per share on revenue of $2.86 billion and the Earnings Whisper ® number is $0.04 per share. Investor sentiment going into the company's earnings release has 62% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 83.33% with revenue decreasing by 5.68%. Short interest has decreased by 7.7% since the company's last earnings release while the stock has drifted higher by 65.3% from its open following the earnings release to be 24.8% above its 200 day moving average of $12.89. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, December 27, 2019 there was some notable buying of 4,141 contracts of the $17.00 put expiring on Friday, February 21, 2020. Option traders are pricing in a 13.3% move on earnings and the stock has averaged a 9.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BBBY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Constellation Brands, Inc. $189.53\n&gt; **Constellation Brands, Inc. (STZ)** is confirmed to report earnings at approximately 7:30 AM ET on Wednesday, January 8, 2020. The consensus earnings estimate is $1.90 per share on revenue of $1.95 billion and the Earnings Whisper ® number is $1.91 per share. Investor sentiment going into the company's earnings release has 51% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 19.83% with revenue decreasing by 9.75%. Short interest has decreased by 7.7% since the company's last earnings release while the stock has drifted lower by 5.7% from its open following the earnings release to be 1.9% below its 200 day moving average of $193.11. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 5.5% move on earnings and the stock has averaged a 6.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=STZ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Lennar Corp. $56.47\n&gt; **Lennar Corp. (LEN)** is confirmed to report earnings at approximately 6:00 AM ET on Wednesday, January 8, 2020. The consensus earnings estimate is $1.90 per share on revenue of $6.70 billion and the Earnings Whisper ® number is $1.95 per share. Investor sentiment going into the company's earnings release has 69% expecting an earnings beat The company's guidance was for earnings of $0.84 to $1.94 per share. Consensus estimates are for earnings to decline year-over-year by 3.06% with revenue increasing by 3.73%. Short interest has increased by 4.9% since the company's last earnings release while the stock has drifted higher by 0.1% from its open following the earnings release to be 5.7% above its 200 day moving average of $53.44. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 5.2% move on earnings and the stock has averaged a 4.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LEN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Cal-Maine Foods $42.45\n&gt; **Cal-Maine Foods (CALM)** is confirmed to report earnings at approximately 6:30 AM ET on Monday, January 6, 2020. Investor sentiment going into the company's earnings release has 50% expecting an earnings beat. Short interest has decreased by 19.1% since the company's last earnings release while the stock has drifted higher by 2.0% from its open following the earnings release to be 2.6% above its 200 day moving average of $41.38. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 6.4% move on earnings and the stock has averaged a 4.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CALM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Simply Good Foods Company $28.17\n&gt; **Simply Good Foods Company (SMPL)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, January 9, 2020. The consensus earnings estimate is $0.21 per share on revenue of $166.52 million and the Earnings Whisper ® number is $0.23 per share. Investor sentiment going into the company's earnings release has 70% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 16.67% with revenue increasing by 37.70%. Short interest has increased by 140.7% since the company's last earnings release while the stock has drifted higher by 16.2% from its open following the earnings release to be 10.0% above its 200 day moving average of $25.62. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 18.1% move on earnings and the stock has averaged a 4.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SMPL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# RPM International Inc. $75.15\n&gt; **RPM International Inc. (RPM)** is confirmed to report earnings at approximately 6:45 AM ET on Wednesday, January 8, 2020. The consensus earnings estimate is $0.73 per share on revenue of $1.40 billion and the Earnings Whisper ® number is $0.72 per share. Investor sentiment going into the company's earnings release has 59% expecting an earnings beat The company's guidance was for earnings of $0.71 to $0.76 per share. Consensus estimates are for year-over-year earnings growth of 40.38% with revenue increasing by 2.75%. Short interest has decreased by 16.2% since the company's last earnings release while the stock has drifted higher by 15.5% from its open following the earnings release to be 13.8% above its 200 day moving average of $66.05. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 4.5% move on earnings and the stock has averaged a 3.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=RPM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# AngioDynamics $16.49\n&gt; **AngioDynamics (ANGO)** is confirmed to report earnings at approximately 6:00 AM ET on Tuesday, January 7, 2020. The consensus earnings estimate is $0.01 per share on revenue of $71.88 million. Investor sentiment going into the company's earnings release has 28% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 95.45% with revenue decreasing by 21.45%. Short interest has decreased by 27.0% since the company's last earnings release while the stock has drifted higher by 3.7% from its open following the earnings release to be 11.1% below its 200 day moving average of $18.55. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 16.2% move on earnings and the stock has averaged a 9.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ANGO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# AZZ Inc. $45.21\n&gt; **AZZ Inc. (AZZ)** is confirmed to report earnings at approximately 6:30 AM ET on Thursday, January 9, 2020. The consensus earnings estimate is $0.84 per share on revenue of $276.30 million. Investor sentiment going into the company's earnings release has 55% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 42.37% with revenue increasing by 15.36%. Short interest has increased by 121.9% since the company's last earnings release while the stock has drifted higher by 7.6% from its open following the earnings release to be 5.1% above its 200 day moving average of $43.00. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 11.7% move on earnings and the stock has averaged a 7.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AZZ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/stocks.",
        "subreddit": "stocks",
        "title": "Wall Street Week Ahead for the trading week beginning January 6th, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/ejx7sw/wall_street_week_ahead_for_the_trading_week/",
        "created": 1578176765.0
    },
    {
        "author": "MoneyBoy1997",
        "created_utc": 1580325547,
        "id": "evrlc6",
        "num_comments": 41,
        "num_crossposts": 0,
        "selftext": "Hi, retards.\nI just went full autist Yolo on MSFT Calls for earnings today. Join in on this. Retards.",
        "subreddit": "wallstreetbets",
        "title": "Just Purchase MSFT Calls Pre Earnings",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/evrlc6/just_purchase_msft_calls_pre_earnings/",
        "created": 1580354347.0
    },
    {
        "author": "Sporofic",
        "created_utc": 1580187726,
        "id": "ev0wkj",
        "num_comments": 41,
        "num_crossposts": 0,
        "selftext": "A couple of weeks ago, a few days after I first came across this sub I made my first options trade. I bought a call for TSLA with little over a month for expiration. I yolo'd my entire portfolio ($3000) at that time and sold it for a \n[~ $1700 gain ](https://i.imgur.com/nctO5qx.jpg)\n\n At that time I didn't understand why I made money and people told me I was extremely lucky. So I did the sensible thing and then invested all the money into stocks like MSFT, AAPL, FB etc. I told myself that I'd allocate a small amount, $100-$200 to play options every month. A week later I saw everyone posting their gains after Netflix and Bynd etc and even I wanted cool looking screenshots. So I did the sensible thing and sold all the stocks I held and yolo'd them into earning plays and one biotech (saw a lot of rockets on stock wits) . Now I've [lost all](https://i.imgur.com/fCPGwqY.jpg) \n the money I've made on the TSLA call and will probably lose more if the companies don't 🚀🚀\n\n[Positions ](https://i.imgur.com/hlZl5eT.jpg)",
        "subreddit": "wallstreetbets",
        "title": "My story",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ev0wkj/my_story/",
        "created": 1580216526.0
    },
    {
        "author": "hysterias3",
        "created_utc": 1579367847,
        "id": "eqj6p6",
        "num_comments": 40,
        "num_crossposts": 0,
        "selftext": "What's everyone doing during earnings? Are you selling everything and buying back in after? I have February and March options for $AAPL and $MSFT and a bunch of others that are reporting in the next couple weeks. not sure what to do.",
        "subreddit": "wallstreetbets",
        "title": "Holding March options for January earnings?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eqj6p6/holding_march_options_for_january_earnings/",
        "created": 1579396647.0
    },
    {
        "author": "Conscious_Cobbler",
        "created_utc": 1580322334,
        "id": "evqswv",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "I got MSFT calls expiring on 2/14, 3/20 and 4/17.  The majority of my money is in the March and April calls that have an implied vol of around 19%. I see that historically the volatility has dropped to like 15% after earnings, so do I hold or sell?",
        "subreddit": "wallstreetbets",
        "title": "Microsoft Calls sell just before earnings or hold?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/evqswv/microsoft_calls_sell_just_before_earnings_or_hold/",
        "created": 1580351134.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1578104590,
        "id": "ejq37t",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "\nIt might be a crowded trade, but the stock is still cheap, relative to the online retailer’s free cash flow.\n\n“Buy Amazon” isn’t the world’s biggest stock-picking cliché, but it’s close. There are 49 analysts who cover the shares, and 47 of them are positive, with two neutral, according to FactSet. Only Alibaba Group Holding of China and ICICI Bank of India boast more endorsements.\n\nAnd after a record-setting run-up, Amazon’s stock isn’t obviously inviting. A $1,000 stake at the close of the stock’s first day of trading in 1997 has turned into more than $950,000. The shares today, at $1,875, go for 69 times projected 2020 earnings.\n\nStill, buy Amazon.com (ticker: AMZN). The stock price looks sensible when compared with free cash flow, which is swelling quickly. Some growth initiatives are only now paying off. Don’t expect a 35% gain this year, as Amazon has averaged, compounded, since going public. But don’t rule it out, either.\n\nAmazon’s reputation for operating near break-even has long been outdated. Founder Jeff Bezos has emphasized free cash flow over accounting earnings from the start, and Amazon has generated free cash since 2002. The company has tended to invest much of that cash for growth, and the result is that earnings have been positive only since 2014, and only meaningfully so since 2018. Now the numbers are reaching escape velocity.\n\nWhen 2019’s results are released, Wall Street expects Amazon to report that revenue increased by 20%, to $279.1 billion; that earnings rose slightly, to $10.4 billion; and that free cash flow ballooned by 28%, to $24.9 billion. In 2020, free cash flow is expected to expand even faster, by 36%, to $34 billion.\n\nWithin five years, the consensus view is that Amazon will become the biggest free cash generator in America, passing some companies that aren’t exactly standing still, like Apple (AAPL) and Microsoft (MSFT). The simplest reason is that Amazon’s investment spending can’t keep up with its growth rate forever.\n\nAmazon launched Prime in 2005, with its free two-day shipping for members, and vast opportunities for the company to put capital to work building speedier infrastructure. Not long after, Amazon Web Services went into cloud computing, another path for investment. Both ventures have proved to be lucrative, with Prime spurring increased spending by shoppers, and AWS yielding generous profit margins.\n\nLast year, Amazon said that it would spend to shorten free Prime shipping to a single day. There are early signs of that paying off, too. Cowen analyst John Blackledge estimates that Prime membership grew 13% during the fourth quarter, versus a year earlier. That compares with 3% growth a year ago and would be the third straight quarter of acceleration.\n\nNow, consider another of Amazon’s growth initiatives: advertising. A recent search for “men’s tennis rackets” on Amazon.com yielded editorial recommendations and a racket listing labeled “Amazon’s Choice.” But nothing was more prominently displayed than the three sponsored racket listings near the top—except for the paid ad for portable nets just above them.\n\nAdvertising doesn’t require vast investments in fleets and data farms, and it looks like another boon for Amazon’s growth. Ad revenue will rise 36%, to $17.6 billion, in 2020, and by 2025 will top $46 billion, predicts Cowen’s Blackledge. Assuming a 35% operating margin for the business, he estimates that advertising and AWS will together account for 90% of operating income this year.\n\nThat has important implications for shareholders. First, it bodes well for the competitiveness of a store when it doesn’t have to rely on its retail margins for the bulk of profits. Second, the advertising ramp provides another rich source of funds to invest in growth. Third, with Amazon passing the anniversary of its spending boost for Prime one-day, it is unclear that it will need that extra spending. As things stand, growth in capital expenditures is expected to decelerate from over 25% last year, to 16% this year, to under 10% in 2021.\n\nAmong 10 analysts who have estimated Amazon’s free cash flow out to 2021, the lowest says $32.7 billion, the highest says $57.5 billion, and the average is $43.7 billion. Out to 2024, there are only three estimates, averaging $82.8 billion. Apple, in comparison, is expected to produce close to $63 billion in free cash during its current fiscal year through September.\n\nIf distant estimates for Amazon are feasible, or even if they are only moderately overblown, the stock could continue outperforming. At less than 30 times estimated 2020 free cash flow, it is cheaper than the shares of Visa (V), Nike (NKE), or McDonald’s (MCD). From here, 20% annual gains for the next three years could leave the stock priced at a humbler 25 times free cash flow.\n\nA government crackdown against powerful tech titans is a risk, but Amazon may have a better “who me?” defense than some of the others. Its market share in the public cloud is less than half, and falling, as Microsoft and others catch up. In e-commerce, more than half of its sales are from third-party merchants who pay to use its services. And in online advertising, it’s a pipsqueak next to Alphabet (GOOGL) and Facebook (FB).\n\nAll told, Amazon is popular with stockpickers for good reason. It’s not too late to join the crowd.\n\nSource: Barron's",
        "subreddit": "stocks",
        "title": "Amazon Is a Free-Cash Rocket Ship. Time to Get on Board.",
        "url": "https://www.reddit.com/r/stocks/comments/ejq37t/amazon_is_a_freecash_rocket_ship_time_to_get_on/",
        "created": 1578133390.0
    },
    {
        "author": "ABrightPlace",
        "created_utc": 1580332591,
        "id": "evtfyt",
        "num_comments": 35,
        "num_crossposts": 0,
        "selftext": "[Facebook shares fall 6% after earnings report\n\n](https://www.cnbc.com/2020/01/29/facebook-fb-earnings-q4-2019.html)",
        "subreddit": "investing",
        "title": "FB, MSFT earnings",
        "url": "https://www.reddit.com/r/investing/comments/evtfyt/fb_msft_earnings/",
        "created": 1580361391.0
    },
    {
        "author": "jewiapek",
        "created_utc": 1580400363,
        "id": "ew7mmf",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": "I bought 185 2/7 MSFT C before market close and earnings announcement. MSFT took off after hours and now my options are down. Am I missing something? To close to expiration? \n\n-J",
        "subreddit": "wallstreetbets",
        "title": "Halp ($MSFT)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ew7mmf/halp_msft/",
        "created": 1580429163.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1580131398,
        "id": "euntzh",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/wallstreetbets sub! Welcome to the new trading week and a fresh start! Here are your pre-market news this AM-\n\n*****\n\n#[Today's Top Headlines for Monday, January 27th, 2020](https://www.cnbc.com/2020/01/27/dow-to-sink-kobe-bryant-remembered-and-wuhan-virus-spreads.html)\n\n* With the coronavirus spreading, world stocks are tumbling and perceived safer investments are rising. U.S. stock futures are sliding early Monday following Wall Street’s worst day of 2020 on Friday. The Dow already has a four-day losing streak in place, its longest since August, and is coming off its largest weekly loss in five months. The S&amp;P 500′s weekly decline last week was its largest in nearly four months. (CNBC)\n* Treasury yields move lower as coronavirus fears escalate (CNBC)\n* Gold climbs to 2-week high as virus fears spark safety buying (Reuters)\n* International oil prices drop below $60 as China virus drives demand concern (Reuters)\n* More than 2,800 people in China are now infected by the fast-spreading Wuhan coronavirus while more countries have reported their first confirmed cases. Chinese officials have said there are 2,862 confirmed cases, with the death toll rising to 81. On Sunday, the United States on Sunday reported its fifth confirmed case in Arizona. (CNBC)\n* Travel-related stocks are likely to be hit once again as coronavirus cases mount, including major airlines like United (UAL), Delta (DAL), American (AAL) and Southwest (LUV), and cruise line operators like Royal Caribbean (RCL), Norwegian (NCLH), and Carnival (CCL). Starbucks (SBUX) and McDonald’s have temporarily closed near the Chinese city of Wuhan.\n* On today’s U.S. economic calendar, the government will release its December report on new home sales at 10 a.m. ET. Arconic (ARNC), DR Horton (DH) and Sprint (S) are among the companies issuing quarterly earnings this morning, while Whirlpool (WHR), Juniper Networks (JNPR) and Rambus (RMBS) report after the bell.\n* Federal safety investigators launched a probe into a helicopter crash in the LA area that killed basketball legend Kobe Bryant and eight others, including his 13-year-old daughter, Gianna. The cause of the crash has not yet been determined. NBA athletes, officials and fans mourned Bryant’s death in messages and memorials across social media. (CNBC)\n* ‘Terrible,’ ‘heartbreaking,’ ‘devastated’ — World leaders and athletes mourn the death of Kobe Bryant (CNBC)\n* Athletes pay tribute to Kobe Bryant. ‘He was like a little brother to me’ Michael Jordan says (CNBC)\n* A passenger plane crashed in central Afghanistan, senior Afghan officials said today. According to local media, the plane went down in territory under Taliban control. It was initially reported to be a jet from state-owned Ariana Afghan Airlines. However, the airline’s acting CEO has denied that one of their planes has crashed. (CNBC)\n* President Donald Trump is expected to disclose details of his long-delayed Mideast peace proposal to Israeli leaders today. Trump will hold separate, back-to-back meetings with Israeli Prime Minister Benjamin Netanyahu and Benny Gantz, head of the centrist Blue and White Party. Gantz is Netanyahu’s rival in March 2 elections. (Reuters)\n* Trump’s impeachment trial enters a pivotal week as his defense team resumes its case and senators face a critical vote on whether to hear witnesses or proceed directly to a vote that is widely expected to end in his acquittal. The articles of impeachment charge Trump with abuse of power and obstruction of Congress. (AP)\n* Democrats stepped up their calls for former national security advisor John Bolton to testify at the trial after an explosive report alleged that in his unpublished book, he said Trump personally tied Ukraine aid to an investigation of the Bidens, an account that conflicts with the president’s. (NBC News)\n* Trump denies telling Bolton Ukraine aid was tied to investigations (The Hill)\n* Sen. Bernie Sanders holds an edge in the 2020 New Hampshire Democratic primary as the key presidential nominating contest nears, according to an NBC News/Marist poll. The Vermont senator garners the support of 22% of likely Democratic primary voters in the Granite State, the survey found. Ex-Mayor Pete Buttigieg trails at 17%. (CNBC)\n* Sen. Elizabeth Warren seeks spark in final Iowa push after getting Des Moines Register endorsement (AP)\n* U.S. state attorneys general will meet Justice Department attorneys next week to share information on their investigations into Google (GOOGL), Reuters reported. * The probes revolve around monopolistic behavior that may harm consumers through Google’s control of online advertising markets and search traffic.\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](https://finviz.com/futures.ashx)**)\n\n*****\n\n#LAST WEEK'S MARKET MAP:\n######(**[CLICK HERE FOR LAST WEEK'S MARKET MAP!](https://finviz.com/publish/012720/sec_all_w1_075397186.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#LAST WEEK'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR LAST WEEK'S S&amp;P SECTORS CHART!](https://i.imgur.com/6xYBiNo.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/g0O8Bke.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/mbOqHih.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/pT8VGHp.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n*($AAPL $TSLA $AMD $AMZN $MSFT $FB $BA $GE $MA $T $V $SBUX $PYPL $MCD $LMT $MMM $DHI $PFE $UTX $KO $UPS $S $NURO $HMST $VZ $HCA $XLNX $ARNC $XOM $CAT $BX $PGR $LRCX $GD $PHM $NVR $PII $SALT $BIIB $NOW $ANTM $NUE $ALK $PLUG $MPC)*\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/BhyYBqu.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n*($DHI $NURO $HMST $S $ARNC $NVR $SALT $BMRC $RDY $BOH $OPB $ARLP $PROV $NWBI)*\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/RExcdcI.jpg)**)\n\n*****\n\n#THIS AFTERNOON'S POST-MARKET EARNINGS CALENDAR:\n*()*\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS CALENDAR!]()**)\nT.B.A.\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/jPiSdVy.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/YRM412m.png)**)\nNONE.\n\n*****\n\n#FRIDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR FRIDAY'S UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/xc2z54D.png)**)\n######(**[CLICK HERE FOR FRIDAY'S UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/mFxq4a0.png)**)\n######(**[CLICK HERE FOR FRIDAY'S UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/XjxVPqW.png)**)\n######(**[CLICK HERE FOR FRIDAY'S UPGRADES/DOWNGRADES LINK #4!](https://i.imgur.com/uiduXrQ.png)**)\n\n*****\n\n#FRIDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR FRIDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/2nH33vr.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!](https://i.imgur.com/tXGwWol.png)**)\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS:\n\n* SPY\n* NNVC\n* BABA\n* QQQ\n* SPCE\n* TVIX\n* APT\n* ABBV\n* DJIA\n* DIA\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2020/01/27/stocks-making-the-biggest-moves-premarket-dr-horton-arconic-starbucks-boeing-more.html)**)\n\n*****\n\n&gt; **D.R. Horton (DHI)** – The homebuilder earned $1.16 per share for its fiscal first quarter, beating the consensus estimate of 92 cents a share. Revenue also topped forecasts. New orders were up 19% on a volume basis and up 22% in value. The company also raised the upper end of its full-year home sales forecast.\n\n&gt; #**STOCK SYMBOL:** DHI\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DHI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DHI)**)\n\n*****\n\n&gt; **Arconic (ARNC)** – Arconic missed estimates by a penny a share, with adjusted quarterly earnings of 53 cents per share. Revenue came in shy of Wall Street predictions. The maker of engineered metals products saw a 1% improvement in organic revenue on factors like favorable pricing and raw materials costs, partially offset by some weakness in its automotive and commercial transportation markets. Arconic also said it would complete its planned split of its aerospace components and aluminum rolling businesses into two companies on April 1.\n\n&gt; #**STOCK SYMBOL:** ARNC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ARNC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ARNC)**)\n\n*****\n\n&gt; **Travel-related stocks** – These are likely to be hit once again as coronavirus cases mount – including major airlines like United Airlines (UAL), Delta Air Lines (DAL), American Airlines (AAL), and Southwest (LUV), and cruise line operators like Royal Caribbean (RCL), Norwegian Cruise Line (NCLH), and Carnival Cruise Lines (CCL). Casino stocks like Wynn Resorts (WYNN) and Las Vegas Sands (LVS) are also being hit.\n\n&gt; #**STOCK SYMBOL:** UAL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=UAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/UAL)**)\n\n*****\n\n&gt; **Starbucks (SBUX)** – Starbucks has temporarily closed all its shots in China’s Hubei province and suspended delivery services, amid health concerns for customers and employees amid the spread of the coronavirus.\n\n&gt; #**STOCK SYMBOL:** SBUX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SBUX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SBUX)**)\n\n*****\n\n&gt; **Estee Lauder (EL)** – Oppenheimer downgraded the cosmetics maker to “perform” from “outperform.” The firm cited the stock’s premium valuation coupled with concerns about the coronavirus impact on a company that has seen China represent a key driver of recent growth.\n\n&gt; #**STOCK SYMBOL:** EL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=EL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/EL)**)\n\n*****\n\n&gt; **Boeing (BA)** – Boeing completed a successful maiden voyage of its 777-X jet over the weekend, a respite for the jet maker amid the ongoing grounding of its 737 Max jet.\n\n&gt; #**STOCK SYMBOL:** BA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BA)**)\n\n*****\n\n&gt; **AbbVie (ABBV)** – AbbVie sold a number of assets to Nestle and AstraZeneca (AZN), as it seeks to win regulatory approval for its $63 billion acquisition of drugmaker Allergan (AGN).\n\n&gt; #**STOCK SYMBOL:** ABBV\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ABBV&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ABBV)**)\n\n*****\n\n&gt; **Fiat Chrysler (FCAU)** – Fiat Chrysler filed court motions Friday to dismiss a lawsuit filed by rival automaker General Motors (GM). Fiat Chrysler said GM does not have sufficient grounds to bring a racketeering case that alleges bribery of union officials.\n\n&gt; #**STOCK SYMBOL:** FCAU\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=FCAU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/FCAU)**)\n\n*****\n\n&gt; **Kraft Heinz (KHC)** – Kraft Heinz CEO Miguel Patricio told The Wall Street Journal that he wants to food maker to make fewer but bigger bets on new products, as its older brands suffer a sales decline.\n\n&gt; #**STOCK SYMBOL:** KHC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=KHC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/KHC)**)\n\n*****\n\n&gt; **Alphabet (GOOGL)** – State attorneys general will meet with Justice Department officials to share investigative material involving Google, according to The Wall Street Journal.\n\n&gt; #**STOCK SYMBOL:** GOOGL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=GOOGL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/GOOGL)**)\n\n*****\n\n&gt; **Winnebago Industries (WGO)** – The RV maker was rated “overweight” in new coverage at KeyBanc, which sees recreational vehicle shipments stronger than consensus for 2020 and is also optimistic about the increasing benefits of Winnebago’s 2016 acquisition of towable vehicle maker Grand Design.\n\n&gt; #**STOCK SYMBOL:** WGO\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WGO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WGO)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat is on everyone's radar for today's trading day ahead here at r/wallstreetbets?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Monday, January 27th, 2020! :)**",
        "subreddit": "wallstreetbets",
        "title": "Today's Pre-Market Movers &amp; News [Monday, January 27th, 2020]",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/euntzh/todays_premarket_movers_news_monday_january_27th/",
        "created": 1580160198.0
    },
    {
        "author": "googlme",
        "created_utc": 1577930384,
        "id": "eiri78",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "Hi r/stocks, \n\nlast year I created a similar thread. ([https://www.reddit.com/r/stocks/comments/anbr7e/first\\_year\\_into\\_stocks\\_summary\\_all\\_tech/](https://www.reddit.com/r/stocks/comments/anbr7e/first_year_into_stocks_summary_all_tech/)). I still follow buy and hold strategy and only sell stocks when I don't like certain changes in a company. Sometimes those decisions paid off, sometimes (AAPL) I missed out a bit (nevertheless I don't regret those decisions). \n\nAt some point I was down 30-50% on both NVDA and TSLA, I do strongly believe in both those companies and will not sell either of them in the next 5y for sure. Hitting a bigger number on the portfolio I started diversifying a bit as well. (MA,V,MRK)\n\nStrategy for 2020 is pretty simple for me, I'll invest mostly in AI and cybersececurity companies: First priority is to add a ton of Tencent. Highly recommend the book: \"AI Superpowers Book by Kai-Fu Lee\". imo there is no way around AI and probably Asia will be in the driving seat for the first time in 5-10y.\n\n**Be patient, don't panic sell, it might be swingy here and there but if you invest in strong companies it will pay off.** \n\nCurrent portfolio:\n\n* TSLA +56%\n* CRM +46%\n* FTNT +37%\n* MSFT +35%\n* AMZN +31%\n* MRK +9%\n* MA + 9%\n* NNND +8%\n* NVDA +7%\n* V +1%\n\n[https://imgur.com/a/6RJNKXU](https://imgur.com/a/6RJNKXU)",
        "subreddit": "stocks",
        "title": "second year into stocks - mostly tech (summary)",
        "url": "https://www.reddit.com/r/stocks/comments/eiri78/second_year_into_stocks_mostly_tech_summary/",
        "created": 1577959184.0
    },
    {
        "author": "shane_stockflare",
        "created_utc": 1578929545,
        "id": "eo5m06",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "On the [Pivot](https://podcasts.apple.com/br/podcast/pivot-with-kara-swisher-and-scott-galloway/id1073226719?l=en) podcast last week, Kara Swisher said that a several people are running the numbers on Twitter. The thesis is pretty simple. Twitter has a massive audience but hasn't turned it into $$$, so someone else could buy it, and make a better go of it.\n\n[Comscore](https://www.comscore.com/Insights/Rankings?country=US) data shows Twitter getting approximately half the audience of Google or Facebook. [Alexa](https://www.alexa.com/topsites) shows the same. So: comparing the stats:\n\n||Market Cap|US users (Comscore)|Revenue: last 12 months|\n|:-|:-|:-|:-|\n|Twitter|$25bn|156m|$3.4bn|\n|Google|$986bn|257m|$155bn|\n|Facebook|$622bn|219m|$67bn|\n|Snap|$24bn|111m|$1.5bn|\n\nIf it does get acquired, no doubt the buyer will be obvious with hindsight. So to jump the gun, let's consider who's big enough to pay a 30% premium and not trash their own valuation or debt levels. \n\nHere's my short list, and I've included Snap, to show it is unlikely but still possible:\n\n&amp;#x200B;\n\n||Market Cap|Profit|PE ratio|Cash/Debt|EV/Net Debt|\n|:-|:-|:-|:-|:-|:-|\n|Apple|$1,360bn|$56bn|24x|$8bn cash|n/a|\n|Microsoft|$1,231bn|$41bn|31x|$59bn cash|n/a|\n|Amazon|$936bn|$10bn|92x|$4bn cash|n/a|\n|AT&amp;T|$279bn|$25bn|11x|$159bn debt|2.6x|\n|Disney|$260bn|$10bn|27x|$42bn debt|2.6x|\n|Verizon|$245bn|$20bn|13x|$107bn debt|2.2x|\n|Comcast|$205bn|$14bn|15x|$103bn debt|3.1x|\n|Netflix|$146bn|$2bn|100x|$8bn debt|0.7x|\n|Charter Comm.|$109bn|$2bn|75x|$74bn debt|4.6x|\n|Softbank|$93bn|$9bn|12x|$125bn debt|4.8x|\n|Sony|$91bn|$5bn|19x|$12bn cash|n/a|\n|Snap :)|$24bn|\\-ve|n/a|$1bn cash|n/a|\n\nA $30% premium would value Twitter at $32bn. Assuming an all cash deal, financed by debt at 5% this would cost $1.5bn a year. Compared to Twitter's net income of $1bn, it would almost be cash-break even.\n\nIn the case of cash positive companies like **Apple** and **Microsoft** it might even be accretive, as their cash piles are unlikely to be generating much income. For others with cash, **Amazon** and **Sony**, it's hard to see it having much of an impact to the PE ratio.\n\nFor the debt heavy firms, it would probably be too much for **Charter** and **Softbank** who are already nearing 5x leverage. **AT&amp;T, Verizon** and **Disney** could do a deal without much damage to their balance sheets or impact to their PE ratio. **Comcast** is somewhere in-between.\n\nWhich leaves the two most interesting options:\n\n* **Netflix** would see its net debt ramps to $40bn and it's leverage ratio get to 3.5x. Uncomfortable but manageable. Given the strategy, and the high price of their stock at 100x, it would probably make sense to part pay in shares.\n* **Snap** just doesn't have the access to $32bn of debt. Even if the purchase was self-financing, using Twitter's cashflow, it's hard to see what lenders would underwrite such a deal. So, again, part equity would be a key way to get this deal across the line. But that's unlikely to be enough. I'd guess a PE firm would need to pony up a $5-10bn part of the equity. And yes, bankers are imaginative folks, and PE folks are awash with cash.\n\nLove to hear everyone's views. \n\nThanks in advance.",
        "subreddit": "investing",
        "title": "Who could buy Twitter?",
        "url": "https://www.reddit.com/r/investing/comments/eo5m06/who_could_buy_twitter/",
        "created": 1578958345.0
    },
    {
        "author": "t3chb1zn3ss",
        "created_utc": 1580458094,
        "id": "ewl7aj",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "If you had 25K to enter the market tomorrow, what would you invest in?  Why?\n\nI'm interested in seeing what the responses will be.\n\nThese are the stocks I've been swinging lately:\n\nAAPL, ACN, ADSK, AMD, AMZN, BABA, BR, BZUN, C, COLL, CMG, CRM, CSCO, CTSH, DIS, DOX, EWZ, FB, GE, GOOGL, GPRO, GS, HTBX, MSFT, NET, NFLX, NKE, NVDA, OKTA, SBUX, SEIC, SHOP, SNA, SPOT, SQ, TEAM, TSLA, TTWO, TWTR, UBER, UPWK, V, WDAY, WORK, YEXT, ZEN, and ZS.\n\nMy largest position is in Apple, which I continue to add to and will hold until it reaches $1K per share.  At that point, I'll decide whether to sell.  $1K is a long ways away .... or is it?",
        "subreddit": "stocks",
        "title": "If you had 25K to enter the market tomorrow, what would you invest in?",
        "url": "https://www.reddit.com/r/stocks/comments/ewl7aj/if_you_had_25k_to_enter_the_market_tomorrow_what/",
        "created": 1580486894.0
    },
    {
        "author": "brosephjones77",
        "created_utc": 1578953858,
        "id": "eobepp",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "Here is estimate of money I want to invest in each stock:\n\nSTOCKS-\n——————————————\n\nVerizon (VZ)- $600\n\nVisa (V)- $800\n\nApple (AAPL)- $1,500\n\nAmazon (AMZN) - $1,900\n\nMicrosoft (MSFT)- $4,000\n\nTesla (TSLA)- $1,500\n\nAbbievie (ABBV)- $500\n\nChase (JPM)- $1,000\n\nSkyworks (SWKS) - $500\n\nCRISPR (CRSP) - $500\n\nNvidia (NVDA) - $750\n\nAlphabet (GOOGL)- $1,400\n\n——————————————\n\nTotal Cost ~ $15,000\n\nGood choices? What would be the best way to cut $3000 from this list? I only have $12,000 to invest",
        "subreddit": "stocks",
        "title": "How should I cut $3000 from this list!",
        "url": "https://www.reddit.com/r/stocks/comments/eobepp/how_should_i_cut_3000_from_this_list/",
        "created": 1578982658.0
    },
    {
        "author": "smuck25",
        "created_utc": 1580255335,
        "id": "eve448",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "I dont know what to do. I want to keep throwing money into the market. I have Microsoft stocks. I have american tower stocks. Spce stocks. Tsm stocks. I wanna keep putting money into them and keep buying shares but I have no idea how to plan this out and make goals about what stocks to keep putting into and what new stocks to keep buying. This sucks. I'm stuck. Help?",
        "subreddit": "StockMarket",
        "title": "Should I keep throwing money?",
        "url": "https://www.reddit.com/r/StockMarket/comments/eve448/should_i_keep_throwing_money/",
        "created": 1580284135.0
    },
    {
        "author": "Xx360StalinScopedxX",
        "created_utc": 1578620072,
        "id": "emjou8",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "I bought mostly into the VFIAX with some Microsoft and Boeing at the start a year ago (just stocks account no options or leverage).  VFIAX was the biggest but throughout the year I added a few thousand into Microsoft and Boeing.  I feel I lost out on a lot of gains because I did not exit Boeing at all during their peak nor once news broke of the second crash.  I set my Boeing, Microsoft, and VFIAX to reinvest the dividends and was able to get a few more % gains from diversifying out of Boeing into Amazon and Shopfiy a few months post 2nd airplane crash.\n\n&amp;#x200B;\n\nNot sure how to feel, from the tweet and what I saw personally from other people my gains are no where near what people were making just from stock this year.  Was considering perhaps I failed because I held Boeing and did not diversify into Amazon, Shopify, or AMD before when I had the chance too.  I also let my ignorance convince me to not consider Apple since I felt Microsoft was the better stock pick.  I think for most of the year the VFIAX was just dead weight compared to how individual big market stocks like Apple and Microsoft performed and maybe I should of not held so much of that index.\n\n&amp;#x200B;\n\nWould appreciate some feedback or some discussion on what you guys played this year and how you did.",
        "subreddit": "investing",
        "title": "Up only 27% since this time last year a far cry from Trump's tweet on 401k performance or my peers. Did I play the market wrong?",
        "url": "https://www.reddit.com/r/investing/comments/emjou8/up_only_27_since_this_time_last_year_a_far_cry/",
        "created": 1578648872.0
    },
    {
        "author": "bobbylink21",
        "created_utc": 1579138097,
        "id": "epc0go",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "Someone posted that FuelCell and Plug are the Microsoft and Apple of the FuelCell industry. 2020 will pose a lot of new players with 5G, the weeds smokey smoke and of course technology. A lot of those companies are really attractive looking but I’m still a supporter of these two. \n\nThough I did sell a large portion, I’m recently back in at roughly $10,000 in shares, but split between these two companies at $5,000 a piece. Why? Because I believe in their technology. And hey, I’m sure someone 20 years ago thought the same with Apple and Microsoft. To the moon, friends. To Mars. \n\nAny thoughts and opinions of yours are always welcomed because different opinions help with future decisions!",
        "subreddit": "RobinHoodPennyStocks",
        "title": "$FCEL $PLUG future",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/epc0go/fcel_plug_future/",
        "created": 1579166897.0
    },
    {
        "author": "yachtornah",
        "created_utc": 1580427167,
        "id": "ewemwe",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "Put 6K in my TFSA and 4K in my RRSP on Jan 6. New year new you kind of thing. \n\nI had originally lost everything a few years ago and took a massive break. \n\nDecided to yolo what's left in my RRSP into AMZN. Who cares right? I am up in my TFSA anyways. AAPL and MSFT will carry me to gainsville. \n\nWas down 50% on my RRSP and up 90% on my TFSA before close. I thought I made a retarded play on AMZN and wanted to sell before close but was stuck in traffic so I couldn't go on my phone. BECAUSE OF AN ACCIDENT ON THE ROAD, I DID NOT SELL MY AMAZON CALLS. \n\nAnyways, here are screenshots of my portfolio. \n\nhttps://imgur.com/a/14kvdR5",
        "subreddit": "wallstreetbets",
        "title": "Tried Options again this year",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ewemwe/tried_options_again_this_year/",
        "created": 1580455967.0
    },
    {
        "author": "JohnJanoski23",
        "created_utc": 1580275199,
        "id": "evidoc",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "Curious if people are optimistic on Microsoft’s earnings and future.",
        "subreddit": "investing",
        "title": "Expectations for Microsoft earnings?",
        "url": "https://www.reddit.com/r/investing/comments/evidoc/expectations_for_microsoft_earnings/",
        "created": 1580303999.0
    },
    {
        "author": "bobbythebich",
        "created_utc": 1580323532,
        "id": "evr3hd",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "So here is the option flow data,  these are not all the orders but new orders (most likely) based on the  volume exceeding the open interest. These orders were from 9:30 - 1:19 today.\n\nData is here:\n\nFB - [https://ibb.co/NrwbG8K](https://ibb.co/NrwbG8K)\n\nAAPL - [https://ibb.co/r7Q03GK](https://ibb.co/r7Q03GK)\n\nAMD - [https://ibb.co/K0S7LVF](https://ibb.co/K0S7LVF)\n\nTSLA - [https://ibb.co/GtmDnFB](https://ibb.co/GtmDnFB)\n\nFEYE (Earnings 2-5 calls expire 2-7) - [https://ibb.co/58y2rhC](https://ibb.co/58y2rhC)\n\nMSFT - [https://ibb.co/JC1rFsy](https://ibb.co/JC1rFsy)\n\nKO - [https://ibb.co/y5Zs5zr](https://ibb.co/y5Zs5zr)\n\nSHOP (Non Earnings) - [https://ibb.co/RjfSDRX](https://ibb.co/RjfSDRX)\n\nPlease don't delete this post as it contains detailed info with more help then most posts, it took a bit of time too. I would appreciate an upvote.\n\nI would say even though amd had negative earnings, i am still seeing tons more calls itm/atm.",
        "subreddit": "wallstreetbets",
        "title": "Earnings Options Data for Today - Many Included - #2",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/evr3hd/earnings_options_data_for_today_many_included_2/",
        "created": 1580352332.0
    },
    {
        "author": "MasterSolar",
        "created_utc": 1579301275,
        "id": "eq7ve5",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "I'm currently going on a year at my first steady job, and have built up nearly $8000 in emergency fund savings. I just paid off my car, which frees up $500 a month, and I want to start making money with my extra money. I rarely spend more than $1500 a month, so even if I had a sudden $5000 emergency, I could throw that all on a credit card and have a month and a half to pay it back while I get the money back from wherever I invested it.\n\nAfter trying out this last year just by buying a couple of stocks and seeing the return, I'm thinking about investing via Robinhood. The idea would be that I take most of my savings, transfer it into Robinhood, and invest it all in 2-3 stocks. I'd want to pick ones that are well-known, that have a history of \\~40% per year, and which I'm personally invested in and think will do well. I'm a gamer so I think Sony and Microsoft are going to do well with their console releases this holiday. Then, I'd start putting the $1000 a month that was going towards my car and savings and buy more stock every month with it.\n\nThe endgoal here is to make my money grow as fast as possible over a 10-year period, and keep it in a place that's flexible enough for me to grab some if I really need it, plus allows me to manage it but not micro-manage it. I already have regular Roth 401k contributions to get the maximum match (although let me know if you think I should be doing more than that). I recognize the inherent risk in the stock market but I want to take the risk of a 200% growth over 5 years instead of just playing it safe and getting much less.\n\nHow good / terrible is this plan? Are there better things I should do? What am I naive about?",
        "subreddit": "RobinHood",
        "title": "I'm looking for a good way to invest my savings. How does this sound?",
        "url": "https://www.reddit.com/r/RobinHood/comments/eq7ve5/im_looking_for_a_good_way_to_invest_my_savings/",
        "created": 1579330075.0
    },
    {
        "author": "Ant0n61",
        "created_utc": 1580178804,
        "id": "euz42a",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "BUYING.\n\nIt's a bull market after all. A flu isn't going to stop it. So the wise thing to do would be buy the dips.\n\nWith AAPL having gapped down, i rescind my earlier weekend call for puts into ER and bought calls instead, it held with the market, anyone who was going to sell the news on ER did this morning. Strong hands remain and i doubt guidance could be lackluster enough to impede on blockbuster quarterly sales. \n\nI have calls on:\n\nAAPL NVDA MSFT SQ\n\nand puts on:\n\nTSLA",
        "subreddit": "wallstreetbets",
        "title": "Last time I checked, dips are for...",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/euz42a/last_time_i_checked_dips_are_for/",
        "created": 1580207604.0
    },
    {
        "author": "JustYogurt",
        "created_utc": 1578588669,
        "id": "emcbky",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "It looks like the major players like Microsoft are all taking off.",
        "subreddit": "investing",
        "title": "What's a good technology fund to be in 2020?",
        "url": "https://www.reddit.com/r/investing/comments/emcbky/whats_a_good_technology_fund_to_be_in_2020/",
        "created": 1578617469.0
    },
    {
        "author": "mikehotel288",
        "created_utc": 1579887013,
        "id": "etdjrb",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "My call expires today and I need 166.50 to break even so please buy and spread the word\n\nI will be eternally grateful\n\nIf anyone knows Warren Buffett that would be great",
        "subreddit": "wallstreetbets",
        "title": "Please stop selling $MSFT",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/etdjrb/please_stop_selling_msft/",
        "created": 1579915813.0
    },
    {
        "author": "Shaun8030",
        "created_utc": 1578338383,
        "id": "ekyrnw",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "If there was a thirty percent drop in a stock which stock do you wish it would be so you could buy it or more of it?  I would buy some MSFT , Amzn and Tesla. Shopify maybe .",
        "subreddit": "CanadianInvestor",
        "title": "Stock you would buy given opportunity",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/ekyrnw/stock_you_would_buy_given_opportunity/",
        "created": 1578367183.0
    },
    {
        "author": "flyyoufools97",
        "created_utc": 1578581581,
        "id": "emao26",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "I really like the company but I'm unsure of all of its potential growth is already priced in.  What's your guy's take?",
        "subreddit": "stocks",
        "title": "Too late to buy MSFT?",
        "url": "https://www.reddit.com/r/stocks/comments/emao26/too_late_to_buy_msft/",
        "created": 1578610381.0
    },
    {
        "author": "needmorefruithrowawy",
        "created_utc": 1580508634,
        "id": "ewvwx6",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "HOLY FUCK. Why in the FUCK did you bears have to watch those Tony Robbins videos and manifest this?\n\nI literally started \"investing\" like two weeks ago. I \"bought the dip\" only for stocks to dip further. What the fuck bears. I had saved up 850 of my finest Canadian Dollars only for me to lose $20 within days. I thought stonks only go up when you walk into the business factory. \n\nI thought I was better than everyone because I was safe. I thought I'd buy the stocks rather than playing options. This sucks. At least with options it's a quick drop, and easy to get over, like my cheating ex. This was slow and gradual, like watching crush get married to her dream man. \n\nI humbly request all Bulls to start visualizing the market rise again, especially, MSFT and AAPL",
        "subreddit": "wallstreetbets",
        "title": "WHAT the FUCK bears",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ewvwx6/what_the_fuck_bears/",
        "created": 1580537434.0
    },
    {
        "author": "xbted9",
        "created_utc": 1578760348,
        "id": "en9je8",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "Hi guys,\n\nWhat do you guys predict will happen with MSFT &amp; Apple this year. Any price points? Currently in 90 shares of MSFT and 50 Apple. \n\nAre you bullish or bearish or Neutral ? And Why.\n\n\nI’m bullish as I think Apple deff has more room to grow. Microsoft will keep winning government contracts and expand its cloud. I think earnings will be pretty nice too. Let me know !!",
        "subreddit": "stocks",
        "title": "MSFT &amp; Apple Predictions",
        "url": "https://www.reddit.com/r/stocks/comments/en9je8/msft_apple_predictions/",
        "created": 1578789148.0
    },
    {
        "author": "travel123123",
        "created_utc": 1579801181,
        "id": "eswh06",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "Trying to learn the basics. Isn't this really odd? I appreciate any info",
        "subreddit": "investing",
        "title": "Why is Vanguard's total US stock market index fund (VTSAX) not market cap weighted right now? Biggest holding is MSFT (not APPL)",
        "url": "https://www.reddit.com/r/investing/comments/eswh06/why_is_vanguards_total_us_stock_market_index_fund/",
        "created": 1579829981.0
    },
    {
        "author": "RJB925",
        "created_utc": 1578275722,
        "id": "ekmwue",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "I have a brokerage account where 67% of the total value is tied up in two stocks. Now I know that is something you want to avoid, but one of them is AAPL in my opinion the safest individual stock you can invest in. The other is SHOP, which I am sentimental about as I bought in @ $43 and has far and away been the biggest winner of my investing career. \n\nI should undoubtedly make trades with these two positions and diversify my portfolio, right? I would like to open positions in GOOGL, AMZN, MSFT, V, and MA, all very safe plays IMO.\n\nMy other holdings are BABA, FB, and AMD. Advice on what I should do with my AAPL and SHOP would be greatly appreciated.",
        "subreddit": "stocks",
        "title": "Diversification Advice",
        "url": "https://www.reddit.com/r/stocks/comments/ekmwue/diversification_advice/",
        "created": 1578304522.0
    },
    {
        "author": "Nikandro",
        "created_utc": 1579880324,
        "id": "etc00z",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "We would all agree that Microsoft is a blue chip beast, and will likely perform well during earnings on Wednesday, 1/29. However, Intel's and IBM's earnings report gave us a glimpse into the future to confirm how well Microsoft will perform. \n\nWe know that Microsoft is developing several new data centers, as their cloud computing platform continues to grow faster than AWS. Intel confirms these growths are larger than expected. \n\n&gt; Revenue from the company’s Data Center Group, which makes chips for computer servers, was up about 19% at $7.21 billion, more than the $6.40 billion FactSet analyst consensus.\n\nIBM also confirmed a large growth in cloud computing.\n\n&gt; IBM CFO: Q4 results driven by acceleration of hybrid cloud portfolio.\n\nThere is a huge surge in new Windows purchases.\n\n&gt; In the first half of the year Intel will be able to sell chips as people upgrade to Microsoft’s Windows 10 operating system — Microsoft’s support for Windows 7 ended earlier this month — and that factor will taper off in the second half, Swan said.\n\nIn addition to this, Microsoft Teams is growing faster than Slack, and their Office 365 special edition ran out of stock (limited subscription).\n\nI expect most of their growth to be based on cloud computing, they their software sales should be excellent too.\n\nBecause this is a heavy blue chip, I sold a few stacks of put credit spreads, but I think ITM/ATM calls would be profitable as well.",
        "subreddit": "wallstreetbets",
        "title": "$MSFT DD - A Glimpse Into the Future - Buy Calls",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/etc00z/msft_dd_a_glimpse_into_the_future_buy_calls/",
        "created": 1579909124.0
    },
    {
        "author": "Themaninak",
        "created_utc": 1579296034,
        "id": "eq6p0q",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/vzy0s3b5oeb41.jpg?width=705&amp;format=pjpg&amp;auto=webp&amp;s=41005c62982ef6f82080a838d55361a15b9fe7be\n\nFelt like UBER &amp; MCD were way oversold, turns out the market agrees with me for once. Proud to have made some serious gains without any FDs.",
        "subreddit": "wallstreetbets",
        "title": "Buying Long Calls &amp; Writing Puts (MCD, UBER, MSFT)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eq6p0q/buying_long_calls_writing_puts_mcd_uber_msft/",
        "created": 1579324834.0
    },
    {
        "author": "silvaspade",
        "created_utc": 1578449571,
        "id": "ellxxk",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "My stocks were doing fine today until the after hours hit, now I'm sitting here down thousands. Should I sell all my stock and put it all into oil companies and air defense ETFs or will they recover? I have MSFT, GOOG, AMZN, FB, QQQ and the only companies keeping me from being down more are MPLX and ET. Any thoughts?",
        "subreddit": "stocks",
        "title": "What the hell going on with the after hours today?",
        "url": "https://www.reddit.com/r/stocks/comments/ellxxk/what_the_hell_going_on_with_the_after_hours_today/",
        "created": 1578478371.0
    },
    {
        "author": "Thoubarnacle",
        "created_utc": 1578599307,
        "id": "emeuf3",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "I've been keeping an eye on the sub for a while, looking for investment options in 2020. I've noticed AAPL, MSFT, AMZN and TSLA have been mentioned quite a lot as great investment opportunities. However, these are all rather expensive and seem to be considered great options for long term investments. BUT I would also like to start investing a bit more short term, which these stocks aren't optimal for IMO. \n\nThis brings me to 2 questions.\n\n1. What stocks do you consider to be great for long term investments?\n2. What stocks/ markets are better for short term?\n\nI'm trying to build a portfolio consisting of a larger investment in safe stocks (I know that you can't consider any stock safe, but you get what I mean) and also smaller investments to expand my experience with short term trading.",
        "subreddit": "stocks",
        "title": "Which stocks are worth buying short term/ long term?",
        "url": "https://www.reddit.com/r/stocks/comments/emeuf3/which_stocks_are_worth_buying_short_term_long_term/",
        "created": 1578628107.0
    },
    {
        "author": "netBlu",
        "created_utc": 1580331970,
        "id": "evta2p",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Microsoft earnings: $1.51 per share, vs $1.32 EPS expected",
        "url": "https://www.cnbc.com/2020/01/29/microsoft-msft-earnings-q2-2020.html",
        "created": 1580360770.0
    },
    {
        "author": "TheOnlyCompetent",
        "created_utc": 1580397069,
        "id": "ew6tkl",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "I've come across people and companies suggesting that it maybe unlikely that Index Funds will be able to keep up 7% &gt; 10% annual returns on average; and that we may get used to seeing returns of 4% or 5% on average.\n\nWith inflation 2% to 2.5% a year, that means your money is being extremely choked. Just think of the consequences of this. Index Funds are a fair representation of the overall markets, so the slow down in growth would not just be disastrous for the individual investor saving for retirement, but everyone. In this environment Mutual Funds may possibly become a more popular choice, as those used to 10%+ returns, bite the bullet and take on additional risk to keep their portfolio growing with the same momentum. \n\nHonestly, I think Mutual Funds with like 10% AAPL and 10% MSFT, etc. while criticised today for not being diverse enough, will become the Holy Grail for those who choose to stay as passive investors. They'll be the only funds making decent money.",
        "subreddit": "investing",
        "title": "What is the likelyhood of the average Index Fund's annual return dropping significantly, in the coming years?",
        "url": "https://www.reddit.com/r/investing/comments/ew6tkl/what_is_the_likelyhood_of_the_average_index_funds/",
        "created": 1580425869.0
    },
    {
        "author": "ScotchBrandyBourbon",
        "created_utc": 1580221359,
        "id": "ev6797",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Last year Apple had a company wide profit margin of 21%\n\nhttps://finance.yahoo.com/quote/AAPL/financials?p=AAPL\n\nLast year Google had a company wide profit margin of 30%\n\nhttps://finance.yahoo.com/quote/GOOG/financials?p=GOOG\n\nAnd Microsoft a mind blowing profit margin of over 40%\n\nhttps://finance.yahoo.com/quote/MSFT/financials?p=MSFT&amp;.tsrc=fin-srch\n\nAnd out of Apple, Microsoft, and Google who has the best customer service?\n\nAnd keep in mind Apple hardware has an even lower profit margin then the company wide profit margin. Apple hardware's Gross profit margin is HALF that of its Services (Apple Music, App Store, ect) gross profit margin. So hardware profit margin is probably only 15%\n\nWhat does this all mean? Means that Apple still has the ability to raise hardware prices if need be. That is good news for investors.\n\nEven better news is the juicy 65%+ gross margin on Apple services. As this keeps growing Apple's company wide margins will also grow. Or Apple could get to a point where they could also drop hardware prices and make even more money on services. \n\nBottom line is Apple has a ton of pricing flexibility in the future. Which is one solid reason to invest in the name.",
        "subreddit": "investing",
        "title": "Apple gets bashed for gouging customers. Yet Microsoft/Google have much higher profit margins.",
        "url": "https://www.reddit.com/r/investing/comments/ev6797/apple_gets_bashed_for_gouging_customers_yet/",
        "created": 1580250159.0
    },
    {
        "author": "tricky955",
        "created_utc": 1580327551,
        "id": "evs3gx",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "StockMarket",
        "title": "All stocks absolutely exploding into their earnings releases because there is 100% guaranteed astronomical beats for all of them. AAPL MSFT TSLA AMZN GOOG",
        "url": "https://www.reddit.com/r/StockMarket/comments/evs3gx/all_stocks_absolutely_exploding_into_their/",
        "created": 1580356351.0
    },
    {
        "author": "MaxAds1",
        "created_utc": 1578084652,
        "id": "ejljav",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "I bought 3k of 125 SPY calls and 3k of 160 Microsoft calls EXP Jan 10 today. Currently down about $1,500, what’s the over/under on this bouncing back?",
        "subreddit": "wallstreetbets",
        "title": "Am I an autist?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ejljav/am_i_an_autist/",
        "created": 1578113452.0
    },
    {
        "author": "themobynick",
        "created_utc": 1578456444,
        "id": "elnedv",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "Anyone else take a huge loss right now? My mcdonalds and microsoft stocks went down to the deeper parts of hell. How should I handle this loss :( anyone else?",
        "subreddit": "wallstreetbets",
        "title": "Anyone else?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/elnedv/anyone_else/",
        "created": 1578485244.0
    },
    {
        "author": "christmas54321",
        "created_utc": 1580431053,
        "id": "ewfn8e",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "Stock just shot up, I love investing in Microsoft but would it be better to wait for things to cool down? \n\nAmazon is too high to buy right now imo and I’m looking for something with fast short term growth and low risk since I’ll only be holding a position till April (I have to spend for medical reasons)",
        "subreddit": "stocks",
        "title": "Is Microsoft still a buy?",
        "url": "https://www.reddit.com/r/stocks/comments/ewfn8e/is_microsoft_still_a_buy/",
        "created": 1580459853.0
    },
    {
        "author": "80slaserbackground",
        "created_utc": 1578684973,
        "id": "emvyje",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "MU will be making the SSD drives that will be in the XBox X and the PS5. Both of those consoles are going to be blockbusters. I'm already loaded up on MSFT and SNE with the expectation that next gen console sales will push their value high. I figure since I believe the next gen consoles will be big sellers it would be smart to go big on a company that has a key component in both consoles. \n\nWhat do you think?",
        "subreddit": "stocks",
        "title": "Thinking about getting MU to grow my IRA.",
        "url": "https://www.reddit.com/r/stocks/comments/emvyje/thinking_about_getting_mu_to_grow_my_ira/",
        "created": 1578713773.0
    },
    {
        "author": "fact_seeker",
        "created_utc": 1579880457,
        "id": "etc116",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "This is a slightly dated but helpful article on value versus growth investing:  [https://www.fidelity.com/learning-center/trading-investing/trading/value-investing-vs-growth-investing](https://www.fidelity.com/learning-center/trading-investing/trading/value-investing-vs-growth-investing) \n\nThe article compares value versus growth portfolios in different asset classes from 1990-2015.  As a relatively inexperienced investor, it has always felt like growth funds were the way to go and that it was a waste to put money into value funds. That article shows that value funds performed noticeably better than growth funds over that period. As I said, the article is about 5 years old, so I suspect the results would slightly favor growth funds if rewritten today. Ironically, the article states that perhaps you should tilt toward value funds, which would be poor advice for the last five years!\n\nSome takeaways from someone who is still learning a lot:\n\n1. While growth funds may seem like the way to go now, value funds frequently outperform growth funds. So unsurprisingly, it's a good idea to have a blend that captures the overall performance of the market.\n2. The volatility (fluctuations in price) are dramatically greater for growth funds, so you probably need to be a bit more comfortable with big changes to focus on growth funds.\n3. The volatility of mid-cap and small-cap funds tends to be higher than their large-cap counterparts.\n4. Mid-cap and small-cap funds often outperform their large-cap counterparts. (This is surprising to me because we talk so much about companies like Apple, Microsoft, Google, Facebook, etc.) However, large-caps seem to have dominated overall the past 5 years or so.\n\nI'm sure this is all pretty basic stuff for the experienced investor, but it was refreshing for me as a novice to see some real data confirming the statements that are frequently made in r/investing.",
        "subreddit": "investing",
        "title": "Article comparing value vs growth, large vs mid vs small-cap funds",
        "url": "https://www.reddit.com/r/investing/comments/etc116/article_comparing_value_vs_growth_large_vs_mid_vs/",
        "created": 1579909257.0
    },
    {
        "author": "MaxAds1",
        "created_utc": 1578517605,
        "id": "elywge",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "I’ve been posting about my MSFT and SPY calls all week, thinking my tendies were gone forever just like my father after he left for milk 22 years ago. \n\nI ended up selling wayyyy too early on both (SPY @ 324 and MSFT @ 159.50) for a small profit, I then doubled down and bought more calls, then bought a lot of puts at the peak. Of course, SPY spiked around 3 and I started to piss myself. I doubled down and bought more puts and with 10 minutes to spare, SPY dipped and I ended up positive over 3k. I can post a screenshot but I don’t know how (on account of the autisticness). Can someone tell me how to do that and I’ll edit.",
        "subreddit": "wallstreetbets",
        "title": "What an emotional rollercoaster",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/elywge/what_an_emotional_rollercoaster/",
        "created": 1578546405.0
    },
    {
        "author": "EatTheTrippaSnippa",
        "created_utc": 1579028624,
        "id": "eopp3b",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Buying shares, tryna move all my long term holdings into one position, I’ve come down to these 2 but still considering Tesla or Apple. MSFT feels like the best bet, but I’m already in deep w/ calls on it so if their earnings aren’t great I could take a pretty fat L. However I don’t think any of us expect that to happen. Thoughts?",
        "subreddit": "wallstreetbets",
        "title": "MSFT vs BABA long term",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eopp3b/msft_vs_baba_long_term/",
        "created": 1579057424.0
    },
    {
        "author": "Zer033x",
        "created_utc": 1580353215,
        "id": "evyjkm",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Lol wth is this garbage. Almost all tech beats earnings handily yet nasdaq futures are plummeting. Weirdos, that's all I gotta say. Come open people are gonna be gobbling up that AAP and that MSFT and that TSLA, and everything else. Dunno what the rest of you futures traders are thinkin but you're smokin some goooooood stuff.\n\nPS: Yes I'm not liking way negative on futures while knowing tomorrow it's gonna be up big, it makes me uneasy and ruins my night mfers.",
        "subreddit": "wallstreetbets",
        "title": "Wth are futures traders (me) thinking?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/evyjkm/wth_are_futures_traders_me_thinking/",
        "created": 1580382015.0
    },
    {
        "author": "Ninety6ixx",
        "created_utc": 1578022383,
        "id": "ej9iqc",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "How hard will it be for me to sell it?",
        "subreddit": "options",
        "title": "I have 1/3 $MSFT &amp; $INTC calls",
        "url": "https://www.reddit.com/r/options/comments/ej9iqc/i_have_13_msft_intc_calls/",
        "created": 1578051183.0
    },
    {
        "author": "MD85654",
        "created_utc": 1580324978,
        "id": "evrg9k",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "I have 2 sets of MSFT options.. ones expiring 1/31 and others expiring 2/7. Do I sell the 1/31 before close today due to IV or hold? I didn’t plan on selling my 2/7 ones",
        "subreddit": "wallstreetbets",
        "title": "Alright gayboys.. MSFT options",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/evrg9k/alright_gayboys_msft_options/",
        "created": 1580353778.0
    },
    {
        "author": "Sh1ba_Tatsuya",
        "created_utc": 1580312610,
        "id": "evoj40",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "Should I hold my calls till after earnings or sell right before market closes... I held for AMD and lost a lot.. Need to make sure I dont make same mistake",
        "subreddit": "stocks",
        "title": "MSFT predictions?",
        "url": "https://www.reddit.com/r/stocks/comments/evoj40/msft_predictions/",
        "created": 1580341410.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1577895724,
        "id": "eik272",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "The e-commerce giant, whose stock has climbed 23% in 2019, has “significant growth opportunities” across its various business lines, the firm’s analysts said.\n\nAmazon.com is the top stock pick for 2020 among analysts at research firm Baird.\n\nThe e-commerce giant, whose stock has climbed 23% in 2019, has “significant growth opportunities” across its various business lines, Baird analysts said in a note Tuesday. Cloud expansion and improved margin trends, expected to take shape during the second quarter, will be catalysts for the stock, the analysts said.\n\nBesides singling out Amazon (ticker: AMZN) as a top pick, the Baird team is generally bullish on platform technology companies such as Alibaba Group Holding (BABA), Alphabet (GOOGL), and Facebook (FB), urging investors: “Don’t bet against the internet!”\n\nEven after all of the advancements in technology that defined the “bustling” 2010s, Baird analysts predict that the next decade will see a “bounty of meaningful technology transitions,” including quantum computing, artificial general intelligence, and the rollout of 6G. (Yes, you read that right—the 5G dream is barely realized and talk has already started on 6G.)\n\nTo be sure, there are headwinds for some of this tech exuberance.\n\nBig tech has come under the scrutiny of lawmakers due to antitrust concerns and fears over how users’ data is used. Politicians are expected to ramp up their attacks during the 2020 election cycle, but Baird analysts dismiss that as “posturing.” The real risk to tech players won’t be forced breakups but management distraction and inaction spurred by the noise. A slowdown in innovation and M&amp;A is possible, they say.\n\nAs for what will drive growth for Amazon and other tech companies, Baird sees several opportunities over the coming decade:\n\n• Networking speeds will increase, boosting efficiencies. Some of the largest platform companies may begin building their own chips and processors.\n\n• There will be new user interfaces as the capabilities of augmented and virtual reality increase, potentially leading to new ways to access e-commerce and online media.\n\n• Media subscription models will continue to dominate, but there may not be much room for many more players in the space.\n\n• “Connected everything,” which means our cars and homes may be an extension of today’s connected devices.\n\n• Cloud wars will continue, providing a huge opportunity for Amazon, Alphabet’s Google, Alibaba, and Microsoft (MSFT).\n\n• E-commerce will be everywhere, and digital-payment options will increase.\n\nSource: Barron's",
        "subreddit": "stocks",
        "title": "Amazon Is Baird’s Top Stock Pick for 2020",
        "url": "https://www.reddit.com/r/stocks/comments/eik272/amazon_is_bairds_top_stock_pick_for_2020/",
        "created": 1577924524.0
    },
    {
        "author": "thorify",
        "created_utc": 1578964971,
        "id": "eodwmi",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "I think making companies match, to an extent, the money that they return to shareholders in bonuses to their workers would be a good way to help raise the quality of their workers lives significantly without negatively affecting the company itself since it would be money they were going to spend anyway.\n\nThis would effectively halve the dividends and buyback return portion of stock appreciation. However, this wouldn't notably affect company stock prices other than those who rely on their dividend to prop up their stock price.\n\nAs an example, Microsoft returns $14.55 Billion to its shareholders in dividends. If it halves its dividend and matches that return to its employees, each of its 148,000 employees would receive an extra $49,000. From this example, you can see you wouldn't need to do something as drastic as half. Even just a 10% return to employees would result in an extra $9,800 each year.",
        "subreddit": "investing",
        "title": "What do you all think about regulating the cash that companies return to shareholders?",
        "url": "https://www.reddit.com/r/investing/comments/eodwmi/what_do_you_all_think_about_regulating_the_cash/",
        "created": 1578993771.0
    },
    {
        "author": "Conscious_Cobbler",
        "created_utc": 1580094854,
        "id": "euhx4o",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "I put my entire account into Microsoft calls (strike 170) expiring in Feb, March, and April. pls pls tendies this week.",
        "subreddit": "wallstreetbets",
        "title": "Microsoft tendies this week???",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/euhx4o/microsoft_tendies_this_week/",
        "created": 1580123654.0
    },
    {
        "author": "rockingstar1207",
        "created_utc": 1580333897,
        "id": "evts0b",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "Is that expected?",
        "subreddit": "RobinHood",
        "title": "MSFT gained 2% after hours, but my options don't reflect in RH.",
        "url": "https://www.reddit.com/r/RobinHood/comments/evts0b/msft_gained_2_after_hours_but_my_options_dont/",
        "created": 1580362697.0
    },
    {
        "author": "marveliteIG",
        "created_utc": 1578576125,
        "id": "em9k2w",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "Looking at their business model, MSFT definitely has an edge imo, because of cloud computing compared to CSCO's physical hardware which imo will not be as profitable in the future. However, I can definitely see CSCO adapting to this and switching to a similar business model as MSFT. Also, CSCO is undervalued compared to MSFT. So... my dilemma is which stock to invest in.",
        "subreddit": "StockMarket",
        "title": "CSCO or MSFT?",
        "url": "https://www.reddit.com/r/StockMarket/comments/em9k2w/csco_or_msft/",
        "created": 1578604925.0
    },
    {
        "author": "108Suikoden",
        "created_utc": 1578894462,
        "id": "enzzs3",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "Put a trailing stop order tomorrow for:\n\n5 MSFT\n5 BA\n5 MCD\n10 TMUS \n18 TWTR\n\nThoughts? Anything I should cancel?",
        "subreddit": "wallstreetbets",
        "title": "First time investor/gambler just put $5000 in my RH account last Friday",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/enzzs3/first_time_investorgambler_just_put_5000_in_my_rh/",
        "created": 1578923262.0
    },
    {
        "author": "leftandrightaregay",
        "created_utc": 1579065089,
        "id": "eoxvlv",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "I just put 10k into Disney and another into Microsoft. Put the outs in bois. I am the X factor the market has been dreading.",
        "subreddit": "wallstreetbets",
        "title": "Insider news the market is about to tank",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eoxvlv/insider_news_the_market_is_about_to_tank/",
        "created": 1579093889.0
    },
    {
        "author": "gosensgo2000",
        "created_utc": 1579305711,
        "id": "eq8tvd",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "Saw a report on CNBC that MSFT is only going up 3% in 2020. Is the success of it lately due to the markets or the company itself? It’s already up around 3% in the last week alone",
        "subreddit": "stocks",
        "title": "MSFT",
        "url": "https://www.reddit.com/r/stocks/comments/eq8tvd/msft/",
        "created": 1579334511.0
    },
    {
        "author": "cdiamand",
        "created_utc": 1579620494,
        "id": "erw48e",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "TSLA LOOKIN THICC'\n\n&amp;#x200B;\n\n1. SPY - 3702 mentions\n2. TSLA - 2636 \n3. AMD - 1527 \n4. BYND - 1279\n5.  AAPL - 1112 \n6. SPCE - 1099 \n7. MSFT - 696 \n8. BA - 574 \n9. TSM - 541 \n10. TGT\t- 457 \n11. AMZN - 450 \n12. NIO\t- 419 \n13. BAC\t- 382 \n14. BABA - 289 \n15. DIS - 278 \n16. ACB\t- 265 \n17. PTON - 257 \n18. NFLX - 253 \n19. ROKU - 220 \n20. DOW - 216 \n21. UBER - 211\n22. FB - 190 \n23. SBUX - 165 \n24. TQQQ - 160 \n25. QQQ - 154 \n26. TLRY - 147 \n27. SNAP - 143 \n28. JPM\t- 141 \n29. SU - 139 (Su Bae fetish meter) \n30. LK - 113 \n31. SDC\t- 113\n\n&amp;#x200B;\n\nhttps://preview.redd.it/22mrpbh3g5c41.png?width=985&amp;format=png&amp;auto=webp&amp;s=6b9d8144736149ab74755346a28f47bb7cae8bc9",
        "subreddit": "wallstreetbets",
        "title": "WSB stock mentions over the last 7 days",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/erw48e/wsb_stock_mentions_over_the_last_7_days/",
        "created": 1579649294.0
    },
    {
        "author": "redbarebluebare",
        "created_utc": 1577970681,
        "id": "eiy28z",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "23% Tesla\n12% Microsoft \n10% Netflix\n8% Apple\n4% Facebook\n5% Shopify\n2% Spotify\n2% Canopy Growth\n3% Disney\n9% NASDAQ100 tracker\n17% North American Tech Fund\n\n(Rounded so doesn’t equal 100%).",
        "subreddit": "wallstreetbets",
        "title": "How autistic is my portfolio?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eiy28z/how_autistic_is_my_portfolio/",
        "created": 1577999481.0
    },
    {
        "author": "DarthBeast",
        "created_utc": 1579138046,
        "id": "epc04q",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "My holdings include the following:\n\n- SPY\n- MCD\n- AAPL\n- TSLA\n- MSFT\n- FB\n- RH\n- DIA\n- BRK.B\n- UNH\n- V\n- BMY\n- NVDA\n- LHX\n- ARWR\n- HD\n- BABA\n- ESPO\n- SBUX\n- WM\n- TGT\n- M\n- WMT\n- NIKE\n- DIS\n- AIMT\n- RVLV\n- TJX\n- ETSY\n- MRVL\n- MAT\n- AMD\n- ACB\n- ZS\n- MNK\n- MNKD\n- T\n- DLRT\n- BTC\n- ETH",
        "subreddit": "investing",
        "title": "Constructively criticize my holdings",
        "url": "https://www.reddit.com/r/investing/comments/epc04q/constructively_criticize_my_holdings/",
        "created": 1579166846.0
    },
    {
        "author": "eyedontgetjokes",
        "created_utc": 1578643026,
        "id": "emnwcd",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": "Am I going insane? Why would they do this? Should we buy? Should we buy calls? Dafuq is going on?",
        "subreddit": "wallstreetbets",
        "title": "NLOK declares a $12.00 special dividend when the stock costs $26.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/emnwcd/nlok_declares_a_1200_special_dividend_when_the/",
        "created": 1578671826.0
    },
    {
        "author": "Amarin88",
        "created_utc": 1578685154,
        "id": "emvzyj",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "So, this stock is going to get a lot of talk in the coming weeks as they prepare to give out a 12 dollar per share dividend. People will get hyped about the free 40% without understanding whats going on.\n\n Let me break it down for you. \n\nBuy Nlok now 26.45 cents\n\nOwn Nlok Through January 23rd through Feb 3rd (you have to own past Jan 31st to get dividend you won't be able to sell till Feb. 3rd cause weekend).\n\nYou will receive 12 dollars per share congrats.\n\nSo what's the catch? \n\nThe stock is now worth 14.45, you were given your money back. Put's and calls will be adjusted accordingly it's a 0 sum game.\n\nSo how do you make money? Well I'm not smart enough to tell you that, but its probably going to get a lot of headlines and alot of people buying running the price up because they don't understand. There will also probably be a sell off after the dividend.\n\nI'd say the best time to get into this stock is after the selloff for the long term hold potential of the company. \n\nrecommended reading [https://finance.yahoo.com/quote/NLOK/community?p=NLOK](https://finance.yahoo.com/quote/NLOK/community?p=NLOK)",
        "subreddit": "wallstreetbets",
        "title": "Let's talk Nlok for dummies",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/emvzyj/lets_talk_nlok_for_dummies/",
        "created": 1578713954.0
    },
    {
        "author": "lightriver90",
        "created_utc": 1578664788,
        "id": "emr9u4",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "So NLOK will declare a special dividend of $12, which is around 43% of the stock price and goes ex-div feb 3rd.  I'm looking at the options expiring at feb 21.  It seems that they have not factored in such as massive movement.  For example, I can buy $24 puts at the ask for $23.  \n\nSomething must be wrong, options seem to not be pricing in this...? I also noted that as of writing this, there is only a \\~4% move pre-market.",
        "subreddit": "options",
        "title": "Nortonlifelock (NLOK) special dividend and put option pricing",
        "url": "https://www.reddit.com/r/options/comments/emr9u4/nortonlifelock_nlok_special_dividend_and_put/",
        "created": 1578693588.0
    },
    {
        "author": "thisnameisorignal",
        "created_utc": 1578676870,
        "id": "emu22x",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Long time lurker, first time post, first option trade.\nThis is a small time bet so all you big time autists don't waste you're time here.\nSo I recently was gifted 54 shares of NLOK(formerly SYM). They are paying out a special dividend of $12.00 per share at the end of the month. So I guess my question to the more seasoned investors here is do you think that dividend is priced in? The stock is at about 26.15 right now. Should I bet that the stock will drop about 10 to 12 bucks a share after the payout? I would assume some holders are only holding because of this payout and will ditch it afterwards. \nThis would be my first options trade as I haven't developed full blown autism yet... Not sure if I want to either... So be gentle.",
        "subreddit": "wallstreetbets",
        "title": "NLOK advice?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/emu22x/nlok_advice/",
        "created": 1578705670.0
    },
    {
        "author": "DJHilly",
        "created_utc": 1578654009,
        "id": "empg73",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "So Norton is giving a special $12 div per stock held before the 23rd of jan through until the 31st. \n\nTwo questions.\n\n1. I understand the div is to be paid by the 3rd of feb but could I sell the stock on the first &amp; still receive the div on the third. \n\n2. Obviously the stock price will drop after the div is issued any idea on how extreme will this be?, I see some people saying it will drop $12 making the gains flat with the div pay out but will this happen instantly or do you think it could it be possible to take the div and sell out on a 1-5$ drop \n\nCheers, new to trading and this is the first time I’ve come across a “special dividend” so I’m interested to see how this would play out, anyone have any experiences with this type of thing, thanks, Hilly.",
        "subreddit": "stocks",
        "title": "Norton Lifelock $12 special div / stock price drop?",
        "url": "https://www.reddit.com/r/stocks/comments/empg73/norton_lifelock_12_special_div_stock_price_drop/",
        "created": 1578682809.0
    },
    {
        "author": "JessGre90",
        "created_utc": 1578662485,
        "id": "emqtzp",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Am I understanding NLOK's announcement this morning that they're paying everyone a $12/share dividend, even if you only held from close on Jan 23rd to close Jan 31? Somebody inform me, I'm new to this and that seems unbelievable lol",
        "subreddit": "RobinHood",
        "title": "NLOK too good to be true?",
        "url": "https://www.reddit.com/r/RobinHood/comments/emqtzp/nlok_too_good_to_be_true/",
        "created": 1578691285.0
    },
    {
        "author": "BuschStache",
        "created_utc": 1578714226,
        "id": "en2ajy",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Why not load up on NLOK???\n\nNortonLifeLock (NLOK) announces a special dividend of $12/share, payable on January 31, 2020 to all shareholders of record as of the close of business on January 23, 2020. Shareholders of record on January 23, 2020 must hold their shares through the close of January 31 payment date to receive the special dividend. The ex-dividend date will be February 3, 2020, the first business day after such payment date.\n\nWhy not chase this?",
        "subreddit": "stocks",
        "title": "Chasing Dividends",
        "url": "https://www.reddit.com/r/stocks/comments/en2ajy/chasing_dividends/",
        "created": 1578743026.0
    }
]