[
    {
        "author": "psychotrader00",
        "created_utc": 1606856400,
        "id": "k4u080",
        "num_comments": 76,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Tuesday, December 1, 2020**\n\nStocks continued rising today, with each of the major indices hitting fresh intraday record, before selling off somewhat in the last hour of the market. Market participants are eager to extend gains after a historic November performance. The Dow posted its biggest monthly gain since January 1987 with an advance of nearly 11.9%. In the S&amp;P 500, the energy, financials, and industrials sectors led the index’s 10.8% rise, as market participants rotated back into many of the names that had been beaten down the hardest earlier on during the pandemic in the wake of positive vaccine news.\n\nThe positive vaccine news led analysts to raise their predictions for 2021 after Pfizer (PFE), Moderna (MRNA), and AstraZeneca (AZN) each reported promising vaccine data in their clinical trial, raising hopes that an effective solution to the pandemic could roll out relatively soon. Fundstrat Managing Partner Tom Lee said in a note Monday he believed the S&amp;P 500 would end 2020 at 3,800, implying another nearly 5% upside for the index. However, given the surge of coronavirus cases in the United States and Europe, Jerome Powell tempered optimism. He said, “Recent news on the vaccine front is very positive for the medium term. For now, significant challenges and uncertainties remain, including timing, production and distribution, and efficacy across different groups.\n\nAccording to Worldometer, as of Tuesday, there are 13,919,870 confirmed cases of COVID-19 in the U.S. According to the same chart, 274,332 people have died from the virus in the U.S., and 8,222,879 have recovered so far. In the month of November alone, the US added more than 4 million cases, double the amount from October, according to the Johns Hopkins University. There were around 168,000 new cases reported Tuesday, with health officials expecting worse to come given the travel that took place during Thanksgiving in the US.\n\n**Highlights**\n\n* Zoom (ZM) reported way better-than-expected earnings but the market was not impressed, stock down more than 15% at the time of writing.\n   * EPS of $0.99 vs $0.75 estimate \n   * Revenue of $777.2 million vs. $694.5 million estimate. Revenue is up 366.5% on a year-over-year basis.\n* Zoom (ZM) rated by many reputable analysts as NEUTRAL or EQUAL-WEIGHT with price target very close to current levels. Seems analysts not expecting much from Zoom after earnings.\n* U.S. airlines could receive $17 billion for four months of payroll support under a new $908 billion bipartisan Senate COVID-19 relief proposal, a spokeswoman for Senator Mark Warner said Tuesday. We’ll keep you posted if there are any developments.\n* Amazon (AMZN) is bringing its AWS cloud-services to the Macintosh operating system for the first time, allowing developers to create apps for iPhones, Macs, and other Apple (AAPL) devices\n* Bank of America has officially joined other U.S. banking majors in refusing to finance oil and gas exploration in the pristine section of Alaska that President Trump last month opened to drilling for the first time ever.\n* According to Adobe, Cyber Monday sales reached $10.84 billion, rising more than 15% year over year. That is at the low end of the 15% to 35% range the firm projected, but still makes it the largest online shopping day in U.S. history. Adobe now expects online sales to reach $184 billion for the holiday season as whole, down from a prior estimate of $189 billion.\n* The total monthly sum bet legally on sports in the US likely topped $3 billion for the first time in October, according to analysts at Benchmark, citing state-level data, a new record. We particularly like DraftKings (DKNG) in this space.\n* Kandi Technologies have been pulling back steeply after the publication of a negative report from Hindenburg Research, the same short seller that made allegations against Nikola in September. The company said it would investigate the allegations\n* GrowGeneration (GRWG) target raised by Lake Street Capital from $28 to $40 BUY. This is one we love and frequently post about!!\n* Starbucks (SBUX) target raised by Wells Fargo (WFC) from $100 to $113 OVERWEIGHT.\n* Square (SQ) target raise by Needham &amp; Co. from $230 to $250 at BUY. Stock currently around $210s.\n* Li Auto (\n* LI) with huge target raise by Goldman Sachs (GS) from $20 to $60 at CONVICTION-BUY. Stock currently near $40, very bullish.\n* Moderna (MRNA) with huge target raise by Argus from $88 to $200 at BUY. Company recently filed its COVID-vaccine with the FDA\n* Micron Technology (MU) target raised by Keycorp from $70 to $74 at OVERWEIght. Stock currently around $65.\n\n\"You learn more from failure than success. Don't let it stop you as failure builds character.\" - Unknown",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Tuesday, December 1, 2020",
        "url": "https://www.reddit.com/r/StockMarket/comments/k4u080/here_is_a_market_recap_for_today_tuesday_december/",
        "created": 1606885200.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1607117923,
        "id": "k6u6w7",
        "num_comments": 76,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Friday, December 4, 2020**\n\nStocks hit record levels again today despite disappointing data on job creation in November. The DOW and S&amp;P 500 each hit a record-high intraday, led by energy and financial stocks. The Dow Jones (DIA) finished the day 0.8% up, the S&amp;P 500 (SPY) finished 0.84%, and the Nasdaq (QQQ) finished 0.41% up.\n\nYesterday, the Wall Street Journal reported that Pfizer (PFE) is experiencing supply chain issues that could result in only half of the estimated vaccines entering distribution. Pfizer, along with partner BioNTech (BNTX) announced plans to ship 50 million vaccines by year-end, half of the 100 million doses previously expected. The company says it still anticipates delivering over 1 billion doses by the end of 2021.\n\nToday, the Labor Department released their November jobs report, which showed the slowest pace of job growth since April’s record spike in unemployment. Non-farm payrolls grew by just 245,000, much lower than the 460,000 expected. The deceleration in recovery is likely due to the record spike in infections this month and the reimposition of certain restrictions across the United States. However, it is important to note that recent job data has surprised to the upside. The weekly unemployment reported released yesterday showed the first drop in new unemployment claims in three weeks.\n\nAs market participants and economist upgrade their estimates for 2021, many believe that cyclical and rotation stocks, like energy, financial, and reopening stocks,  that were hardest hit by the pandemic will extend gains into next year. Brent Schutte, chief investment strategist at Northwestern Mutual said, “As you move into 2021, there will be broader economic growth, it will be more inclusive, you will see continued fiscal stimulus – I do believe we will get a package. You’ll see the Fed continue. You have pent-up demand. Think about the rotation that we’ve been talking about … it’s underway right now and it will continue into 2021. Think value, think small-cap, think emerging markets.”\n\nUnfortunately, the United States once again set single-day records for new infections and deaths yesterday. According to Johns Hopkins University, there were more 211,762 new cases and 2,858 deaths reported yesterday, overtaking the previous record of 205,000 new infections and 2,760 deaths set yesterday. California Governor Gavin Newsom announced he would impose extremely strict stay-at-home orders when intensive care units reach less than 15% availability, which he expects to happen soon. The stay-at-home restrictions will begin with 48 hours’ notice and remain in place for at least three weeks once they are ordered. Gov. Newsom said, “If we don’t act now, our hospital system will be overwhelmed. If we don’t act now, we will continue to see the death rate climb,”\n\n**Highlights**\n\n* The House of Representatives passed a bill today that would decriminalize marijuana at the federal level and set up a process to expunge past convictions. The chamber approved the measure in a 228-164 vote. Only five Republicans and one independent backed it. Six Democrats voted against the bill. It marks the first time the House has voted to remove cannabis from the Federal Controlled Substances Act but the act is expected to be shut down in the Senate. \n* The UN voted to remove cannabis from the Schedule 4 list, where it is listed alongside dangerous and highly addictive drugs like heroin.\n* According to the Wall Street Journal, Airbnb is schedules to IPO on December 10. This will be interesting, we will be sure to keep you guys updates!\n* Ulta Beauty (ULTA) with multiple target raises. Stock currently around $286.\n   * Robert W. Baird from $220 to $300 OUTPERFORM\n   * Piper Sandler from $300 to $345 OVERWEIGHT\n   * Deutsche Bank from $284 to $310 BUY\n* Micron Technology (MU) target raised by Argus from $65 to $85 at BUY. Stock currently around $73.\n* Lowe's (LOW) target raised by Morgan Stanley (MS)  from $190 to $210 at OVERWEIGHT. Stock currently around $151.\n* Home Depot (HD) target raised by Morgan Stanley (MS) from $300 to $320. Stock currently around $267.\n* Global Life (GL) target raised by Credit Suisse from $109 to $122 at OUTPERFORM. \n* DOMO with two target increases. Stock currently around $44.\n   * Needham &amp; Co. at $63 BUY\n   * JMP Securities at $60 OUTPERFORM.\n* DocuSign (DOCU) with multiple bullish target increases. Average price target is around $300 and BUY rating. Stock currently around $250 after running yesterday\n* Crowdstrike (CRWD) with target raise by BTIG Research from $164 to $190 at BUY. Stock currently in $160s.\n* Broadcom (AVGO) target raised by Deutsche Dank (DB) from $400 to $450 at BUY. Stock currently around $405.\n* AdaptHealth (AHCO) target raised by Deutsche Bannk[ ](https://twitter.com/search?q=%24DB&amp;src=cashtag_click)(DB) from $36 to $47. Stock currently around $35\n\n“Yesterday is history, tomorrow is a mystery, but today is a gift. That is why it’s called the present.” - Bill Keane",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Friday, December 4, 2020. Please enjoy!",
        "url": "https://www.reddit.com/r/StockMarket/comments/k6u6w7/here_is_a_market_recap_for_today_friday_december/",
        "created": 1607146723.0
    },
    {
        "author": "Jaie_E",
        "created_utc": 1607277494,
        "id": "k7ygzk",
        "num_comments": 39,
        "num_crossposts": 0,
        "selftext": "So real old heads remember everyone's favorite meme stock from 2017. This bad boy was pulling in money left and right and was trading at a sexy P/E of under 14$. Micron Technologies was trading under 10 bucks before our man main entered the picture, Swag Master Sanjay Mehrotra in 2017 and ever since Micron Technologies has boomed to a beautiful 72$. So what is Micron technologies, and why is it going to make you rich:\n\n&amp;#x200B;\n\n**What is Micron Technology?**\n\nThey're a company that specializes in producing NAND flash Semiconductors. Think the type of semi conductors used in your USBs, memory cards, cell phones and other small devices that lack the sizes for larger forms of dedicated storage. \n\n**What has been happening during the Rona**?:\n\nMicron crashed in February in anticipation of a decline of the global NAND market due to Corona's effects on the supply chain. However this disrupted China's ability to flood the market with semi-conductors and as a result allowed Micron to gobble up a huge amount of the market share. Another [WSBs DD post put it better than I could](https://www.reddit.com/r/wallstreetbets/comments/f7emhl/micron_technology_mu_dd/). Go read his post as well to get a better idea of what''s been happening over the last few months with Micron:\n\n&amp;#x200B;\n\n&gt;The memory trough has finally bottomed. Micron did not lose money. How do I know it has bottomed? Earnings from other tech companies. They have been investing in data centers because the new hot technology is AI. Artificial intelligence require massive CPU, memory, and storage. Magnetic disk is so 1980’s, it’s all about NAND today. Who makes the hottest NAND? Intel and Micron collaborated on 3D XPoint (think Intel Optane). It’s 1000x faster than NAND, last 1000X longer, and 10X as dense. It’s basically not volatile DRAM, something to power the AI revolution.  \n&gt;  \n&gt;  \n&gt;  \n&gt;Oh yeah, Micron just bought out Intel’s share of 3DXPoint for 1.5B. The only manufacturing for 3DXPoint is in… Utah. That’s right, not in China! So now I segue into the Mexican Beer virus. The majority of memory manufacturers are centered in the Wuhan area. The Wuhan area is basically shut down for the foreseeable future. Hmmm… which memory maker makes memory mostly outside China? If you said Micron, you win the prize. They have manufacturing locations in Idaho (you da hoe), Utah, Virginia, Malaysia, Singapore, Taiwan, and Xian China. They have only one location in China, and it’s not even in Wuhan.\n\nNot only did Micron use Corona as an opportunity to expand its market share, [but the dip in NAND memory demand was temporary and it returned to its upward trend](https://www.thestreet.com/investing/nand-flash-market-is-rebounding-faster-than-the-dram-market). Not only did demand increase; but the supply retracted as manufacturers in China and other Corona hit areas suspended operations as seen by this chart (you might have to click on it to see it closer)\n\n&amp;#x200B;\n\n[Notice that oversupply is steadily declining](https://preview.redd.it/v8814125il361.png?width=328&amp;format=png&amp;auto=webp&amp;s=820a650b6d82e238d8d9ffa53030961d59deeb68)\n\n**Diversification and Innovation**:\n\n[Here's an interview with the Swag Master himself:](https://www.youtube.com/watch?v=dLl3b7SMUBk) \n\nThey've been able to make big bucks diversifying into data centers which have boomed with work from home and they've been making money on the online schooling trend. The demand for enterprise PCs has gone up. More or less every product that Micron Technology sells has boomed as a result of corona virus and they were able to achieve an Earnings Per Share growth of +77.55% since last year. They also will likely be used for the AI for self-driving cars so that's going to be exciting. We might even see a huge boom from them in the mid term once they start making deals with large EV manufactures. \n\nNot only have they seen growth in these new product lines but they've also come up with a new chip that should put them ahead of the competition for at [least a few years](https://www.fool.com/investing/2020/11/11/micron-technology-just-announced-an-important-tech/):\n\n&gt;*176-layer NAND flash:*  \n&gt;  \n&gt;In the press release, Micron announced that it had begun volume shipments of the world's first 176-layer NAND flash chips. For those unfamiliar with NAND flash technology, it's becoming the nonvolatile storage medium of choice for many applications.  \n&gt;  \n&gt;  \n&gt;  \n&gt;Nonvolatile storage retains information even when power is turned off. Legacy hard disk technology still has a place in cheap bulk storage in cloud data centers. Yet cost reductions have made NAND closer to hard disk drives in terms of cost-per-bit, and with much better performance and resilience, less space, and better total cost of ownership in many cases. NAND flash is found in data center servers, smartphones, game consoles, and laptops these days.  \n&gt;  \n&gt;  \n&gt;  \n&gt;With the data revolution taking off, NAND flash demand is supposed to compound at a 30% annual growth rate. Yet many NAND manufacturers have had a hard time making profits in recent years despite that insatiable end demand. Companies have begun stacking NAND modules on top of each other in a 3D vertical structure, with each layer significantly boosting storage capacity. While demand for bits has gone up, the NAND flash producers have oversupplied the market, crashing NAND prices along with profits.  \n&gt;  \n&gt;  \n&gt;  \n&gt;However, Micron's innovation could give it a significant leg up on rivals next year.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Why Micron Technology will grow after Covid**:\n\nThe big thing to realize is that Micron technologies has [some of the best chips in the market for handling the type of processing power that cell phones need](https://www.micron.com/insight/5g-ai-and-the-coming-mobile-revolution) for [5G and AI](https://www.micron.com/insight/5g-ai-and-the-coming-mobile-revolution). These guys are going to be miles ahead when 5G becomes the norm and the other companies will be trying to catch up for years. Don't take my word for it, trust everyone's favorite holocaust profiteers and Jeffery epstein's favorite bank, Deusche bank, who recently upgraded their outlook on them:\n\n&gt; In a research report, Ho said that Micron is expected to be a solid recovery pick as the economy starts recovering from the global pandemic. Demand drivers such as data centers, 5G smartphones, and gaming will accelerate the growth of Micron. Ho also pointed out that Micron is well-positioned for CY21 (calendar year 2021).   \n&gt;  \n&gt;Micron Technology is known as being a leading supplier and manufacturer of memory and storage used in a wide range of electronic devices ranging from PCs to smartphones. And the company is currently number three in market share for memory/storage shipments after Samsung and SK Hynix. DRAM currently makes up about two-thirds of the company’s total revenue with NAND making up most of the rest of the revenue.  \n&gt;  \n&gt;DRAM is known for providing high-speed data storage and retrieval. And NAND flash products are electrically rewritable and nonvolatile memory that retains data when power is turned off. This makes NAND ideal for mass-storage uses — specifically for solid-state drives, which have started to displace traditional hard disk drives.  \n&gt;  \n&gt;DRAM and NAND are both promising for the future as SSDs are expected to be used in the majority of PCs and data centers as well as higher memory and storage content in smartphones. And AI and autonomous vehicles will also require substantial DRAM and NAND capacities.  \n&gt;  \n&gt;Deutsche Bank is not the only brokerage to increase its price target on Micron. Mizuho analyst Vijay Rakesh recently increased the price target from $56 to $70. And Morningstar equity analyst Abhinav Davuluri, CFA recently increased the target price to $50 per share from $48. And in an analyst rating consensus of Micron stock with 33 ratings, 76% say buy, 21% say hold, and 3% say sell.\n\nThey aren't the only institution that's upgrading their outlook. It'd take too long to go over all of the upgrades so I'm just going to link them:\n\n[Goldman Sachs upgrades Micron Technologies](https://www.thestreet.com/streetlightning/stock-picks/mircon-computer-memory-dram-nand-technology-mu-semiconductor-goldman-sachs-buy)\n\n[Argus Research upgrades Micron Technologies](https://snapshot.fidelity.com/fidresearch/snapshot/landing.jhtml#/news?symbol=MU&amp;pageno=&amp;storyid=202012041056MIDNIGHTUSEQUITY_A2316094&amp;provider=MIDNIGHT&amp;product=USEQUITY&amp;sb=1&amp;sc=1&amp;san=1)\n\n[Morgan Stanley upgrades Micron Technologies](https://thefly.com/landingPageNews.php?id=3205255&amp;headline=MU-Micron-price-target-raised-to--from--at-Morgan-Stanley)\n\n[UBS Upgrades Micron Technologies](https://www.thestreet.com/investing/micron-shares-jump-after-ubs-boosts-rating-price-target)\n\n[Wells Fargo upgrades Micron Technologies](https://thefly.com/landingPageNews.php?id=3204494&amp;headline=MU-Micron-price-target-raised-to--from--at-Wells-Fargo)\n\nTheres probably more that I'm missing but you dont need me to post every [wordpress.com](https://wordpress.com)/Seeking Alpha/Motley Small Bus Rider word vomit from 2 bit prop traders and amatuer hedge fund larpers to prove my point. This bad boi is going up bigly.\n\n**The most important bit: How to trade**:\n\nYou guys can try making money with out of the money two week calls but I suspect that there are other ways to make money on this that might be more lucrative.\n\nFirst of all shares. Yes they are boring but keep in mind there's a really, really good chance that Micron gets the Vale treatment in the near future and spikes on rumors of being able to supply one of the big EVs with chips. I'm not going to tell you when this might happen because no one knows. But I feel it in my heart of hearts and half of the analysts upgrading it mention how Micron's new chip is going to have massive applications with self-driving automobile technology and if you watched some of the interviews with the Swag Master he always brings it up. Sure it might not be TSLA since they are in bed with TSM but keep in mind if they choose to keep that deal proprietary and TSM doesn't sell that chip to anyone else that means that basically there are no other chips for EV companies to choose from other than Micron.\n\nSecond what I'd really recommend are Leaps. Buy yourself some 2022 out of the money calls and you will print money in due time. There are just so many upside potentials with Micron that if even one of them ends up working out then these leaps will print.\n\nTLDR: Buy the 85$ January 2022 MU calls. You'll thank me later.",
        "subreddit": "wallstreetbets",
        "title": "Micron Technologies to the Moon",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k7ygzk/micron_technologies_to_the_moon/",
        "created": 1607306294.0
    },
    {
        "author": "Birne77",
        "created_utc": 1607266686,
        "id": "k7v53z",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "Hi guys, just wanted to share this with you.\n\nMy parent's house burnt down this morning. They/We have a farm.. A tractor started burning (probably because of a short circuit) and the fire has spread to the roof. Firefighters are still here. There were more than 150 firefighters here in total.\n\nStocks are not everything in life, but I hope that my MU calls can fix the damage.",
        "subreddit": "wallstreetbets",
        "title": "house burnt down",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k7v53z/house_burnt_down/",
        "created": 1607295486.0
    },
    {
        "author": "401TCW",
        "created_utc": 1607334414,
        "id": "k8dp9t",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Amid the pandemic, the demand for cloud-based storage systems has increased greatly. Micron has benefited because the servers needed for cloud storage require lots of memory chips that the company manufactures.\n\n“I’m pleased with how the market opportunities continue to shape up,” CEO Sanjay Mehrotra said during the virtual technology conference sponsored by investment banking company Credit Suisse. “And I think during calendar year ‘21, as the global economies get past the pandemic, and as global economies grow, the need for more memory and storage will continue to broaden as well.”\n\nMicron’s stock reached its all-time high of $96.56 on July 14, 2000.\nIn 2018, the stock price hit $61.35 before leveling off.",
        "subreddit": "stocks",
        "title": "Micron predicted it will report Q1 2021 sales of at least $5.7 billion (versus Wall Street's expectation of $5.25 billion) and earn \"adjusted\" profits of $0.69 to $0.73 per share on those sales -- versus a Street expectation of just ~$0.48.",
        "url": "https://www.reddit.com/r/stocks/comments/k8dp9t/micron_predicted_it_will_report_q1_2021_sales_of/",
        "created": 1607363214.0
    },
    {
        "author": "Henk7839",
        "created_utc": 1606844405,
        "id": "k4pqql",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "In rememberance of /u/MartyMoho \n\nMicron makes memory chips. Memory is a commodity. \n1 word: MemoryCycle.\n\nDemand higher than supply? Micron starts printing money.\nDemand lower than supply? Micron starts losing money.\nRight now we are just entering THE GOOD PART OF THE CYCLE.\n\nLast time we were in the good part of the cycle, Micron had a EPS of 13 dollars on a share price of 50. Yes the PE ratio was 4. WSB bought the peak in droves and Micron never went past the low 60s.\n\nNow Micron is again in the 60s ready to take off, because now is the START of the memory cycle. Not the peak, no the start.\n\nEPS of 13? Micron will reach an EPS of 20 this cycle and it will last longer than last time.\n\nTL:DR\n\nBuy 80C Jan15. Thank me later.\n\nMy position (ALL IN YOLO):\nhttps://imgur.com/ZNQMYd6\n\nLets go 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀",
        "subreddit": "wallstreetbets",
        "title": "Rocketship Micron is taking off. DD Inside",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k4pqql/rocketship_micron_is_taking_off_dd_inside/",
        "created": 1606873205.0
    },
    {
        "author": "zqv7",
        "created_utc": 1606953982,
        "id": "k5lwi3",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "A foreword in remembrance of our dear friend u/MartyMoho who might have learned the hard way that Micron is in fact a cyclical stock after YOLO'ing down a cliff (both on the stock chart *and* in real life).\n\nDemand for flash memory and random access memory has been fucking insane, so it's that fucking time of the cycle again where this thing moons, except now at a height greater than before. This thing doesn't even have stimulus/tech FOMO priced into it yet. Unprecented levels of demand will also spill revenue into the next quarter as well due to current supply-side shortages. \n\nEarnings is 12/16, and I would bet you can fucking get in the day before and still make bank even though it's currently $69. I don't see demand dying down until late 2021 or early 22 so it has the potential for a nice growth even after it hits 100. And you can buy puts on the way down after that to double your profits.",
        "subreddit": "wallstreetbets",
        "title": "MU $100 EOY",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k5lwi3/mu_100_eoy/",
        "created": 1606982782.0
    },
    {
        "author": "pacosteles",
        "created_utc": 1606834457,
        "id": "k4mbmy",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "I reproduce https://www.reddit.com/r/wallstreetbets/comments/eaujdv/the_rise_and_fall_of_martymoho/\n\n/u/MartyMoho\n\nis one of the true original gamblers of WallStreetBets.\n\nThe Legend of MartyMoho begins on March 23rd, 2017 when he posted a $1,000,000 position in Micron (MU). This was roughly 55% shares at a $26 price average, and 45% calls split between ITM and OTM.\n\nMicron held an earnings report later that day and the results were much better than expected. Micron delivered, skyrocketing afterhours over 10%. Marty woke up the next morning up over $600,000.\n\nWhat made this even more impressive is that Marty was not some ultra-rich billionaire with a highly diversified portfolio of assets. No. Micron was the only company he owned, and this was his entire portfolio.\n\n“Ah, well, I've only owned $MU or its derivatives for almost two years. I swing traded $AMD a little fall of 2016 but essentially that's all $MU”\n\nMarty continued to hold positions in Micron over the next year, and his account reached a peak value of $2,500,000 from his original $200,000 in September 2015. A 1200% gain.\n\nMarty wasn’t finished though, the money, the shitposting, the endless call outs of Jim Cramer on twitter (@MartyMoho) wasn’t enough for him and in true wallstreetbets fashion, he needed more.\n\nOn March 22nd, 2018 Marty bet all $2,300,000 on $MU calls set to expire over the course of the next several months, a majority being OTM. $MU was trading at $54 that day, and his strikes were all between $50-$80.\n\nMarty remained optimistic as $MU hovered around the same price over the next several months. But on August 30th, 2018 Marty started losing hope. On this day he made his final ever comment on reddit:\n\n“I don't know, I expected at least a partial run-up but it's not materializing at all. If it doesn't pop after ER like it did this time last year, I'm pretty f'd”\n\n$MU was trading at $53 when he made that comment, theta was killing him. But it didn’t get any better for Marty. $MU fell 40% over the next few months, all the way to $30 as his calls were expiring. $2.3 million lost, as the strikes were so far out of the money that even if he had sold, it would have been too late. They were worthless.\n\nThat was the last comment Marty ever made online, his Reddit, Twitter, and Stocktwits all stopped being active between August 30th and 31st, 2018. No one knows for sure what happened to him, but the speculation remains. One thing is for certain though. As quickly as he rose, he fell, and the legend of Marty is now just that – a legend.",
        "subreddit": "wallstreetbets",
        "title": "$MU at ATH of 20 years. Reminder of The Rise and Fall of MartyMoho",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k4mbmy/mu_at_ath_of_20_years_reminder_of_the_rise_and/",
        "created": 1606863257.0
    },
    {
        "author": "Snappinneckscshchks",
        "created_utc": 1607126574,
        "id": "k6wtqm",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Is everyone overlooking the run up MU is having to earnings even after the recently increased outlook?",
        "url": "https://i.redd.it/ovv65gwde9361.png",
        "created": 1607155374.0
    },
    {
        "author": "username81251",
        "created_utc": 1606923213,
        "id": "k5bddx",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Remember MU, the money printer from four years ago? It's back, at Y2K level highs, up almost 40% for the month, with like two -1% red days that whole time. \n\nThe CEO came out yesterday with swaggy updated guidance, and earnings are two weeks from today. So while there might not be any 20% days for this one, look for it to keep chugging quietly up in advance of that.\n\nBear case is that Cramer likes it.\n\nShort term calls for a run up look good imo, low 70s by EOY easy.\n\n&amp;#x200B;\n\nPositions: 68c 12/18",
        "subreddit": "wallstreetbets",
        "title": "MU Earnings Run-up Incoming",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k5bddx/mu_earnings_runup_incoming/",
        "created": 1606952013.0
    },
    {
        "author": "marsel_lati",
        "created_utc": 1607345721,
        "id": "k8g4sz",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Mu first trade 😎",
        "url": "https://i.redd.it/d1o5prsjir361.jpg",
        "created": 1607374521.0
    },
    {
        "author": "WSBpeon69420",
        "created_utc": 1606834501,
        "id": "k4mc4u",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "A little something from the old days... MU is going to 90 for sure",
        "subreddit": "wallstreetbets",
        "title": "MU TO 90",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k4mc4u/mu_to_90/",
        "created": 1606863301.0
    },
    {
        "author": "snetloc",
        "created_utc": 1607097149,
        "id": "k6nfb2",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "LOAD MU 🚀🚀🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k6nfb2/load_mu/",
        "created": 1607125949.0
    },
    {
        "author": "Blabberoo222",
        "created_utc": 1606831825,
        "id": "k4lj3o",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Micron Updates First Quarter Fiscal 2021 Guidance",
        "url": "https://stockhouse.com/news/press-releases/2020/12/01/micron-updates-first-quarter-fiscal-2021-guidance",
        "created": 1606860625.0
    },
    {
        "author": "ChiggaOG",
        "created_utc": 1606840520,
        "id": "k4od0g",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I remember when this sub what hawking this company and then it took a nosedive. Now it's back up to where it was before the dive.",
        "subreddit": "wallstreetbets",
        "title": "Which one of you is still playing MU?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k4od0g/which_one_of_you_is_still_playing_mu/",
        "created": 1606869320.0
    },
    {
        "author": "MickeyMoss",
        "created_utc": 1606997999,
        "id": "k5w6ts",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "RobinHoodPennyStocks",
        "title": "AI Driven Stock Forecasts Are Consistent. Micron Technology stock is up about 40% since this bullish forecast For MU",
        "url": "https://www.reddit.com/user/Fatherthinger/comments/k5w3ic/ai_driven_stock_forecasts_are_consistent_micron/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf",
        "created": 1607026799.0
    },
    {
        "author": "doublemctwist1260",
        "created_utc": 1607096507,
        "id": "k6n7to",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Bring Back the MU 90C Meme",
        "url": "https://i.redd.it/m26o10cix6361.jpg",
        "created": 1607125307.0
    },
    {
        "author": "Kings_Gambit7",
        "created_utc": 1607095616,
        "id": "k6mxoe",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "MU does not stop 📈",
        "url": "https://i.redd.it/fs0ueq0vu6361.jpg",
        "created": 1607124416.0
    }
]