[
    {
        "author": "ld_southfl",
        "created_utc": 1596389099,
        "id": "i2fue2",
        "num_comments": 50,
        "num_crossposts": 0,
        "selftext": "Microchip is a semiconductor company out of Arizona with a Mkt. Cap of about $26 Billion. They make chips for a bunch of products like Cyber Security, Wireless Products, and Telecommunications. The thing is that they earnings on 08/04 Tuesday after hours. It is very obvious that are going to beat earnings. Why? Because look at the rest of the industry: Qualcomm, Intel, AMD, Qorvo, and IBM have all destroyed earnings. And since Intel just told everyone that they're too retarded to even make potato chips all the smaller time semiconductor competitors are making bank, example: AMD and QCOM. \n\n&amp;#x200B;\n\nMicrochip isn't just your run of the mill small back water company. They actually make acquisitions of other chip companies and use their intellectual property to increase the quality and market share of their own chips. Microchip was found in 1989 and has since made 16 acquistions!!! \n\nYou may, for some reason, say that only big boy chip companies are gonna beat earnings. Well if you don't believe me think about the industries that depend on Microchip for their needs: online educational servicing companies, cloud servicing companies, cyber security companies, telecommunications companies, and just software/tech companies in general. What the hell do we already know about these industries from earnings season? We know they absolutely massacred earnings estimates as everything during COVID has gone tech. Yes, the age of actual industry is dead. Now there are only tech companies that get pumped because of sky high demand (looking at you Apple) and Amazon that sells random shit and still has a tech company valuation.\n\n&amp;#x200B;\n\nOh and you know what's awesome because we have all this knowledge? MCHP is expected to post $1.43 EPS on tuesday, but last year on this quarter they posted $1.41 EPS. What a fucking joke, we should expect at least 40-50% growth in that number from COVID induced semiconductor demand. Not to mention, I think MCHP is gaining market share and could be a big player in a few years in the semiconductor industry. \n\nYou might be hesitant because of my last post on $TER, a chip supplier that many people played incorrectly. I say to you, fuck you. I made money on that play because I sold directly at market open after they destroyed earnings like my data said they would. So if you feel even the slightest FOMO look at these charts from last week: QCOM, QRVO, and AMD; and then tell me what you think MCHP (the same industry) will do!!!\n\n&amp;#x200B;\n\nTLDR; MCHP $107c 08/07",
        "subreddit": "wallstreetbets",
        "title": "$MCHP is the next $QCOM, 300% gain potential after earnings",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i2fue2/mchp_is_the_next_qcom_300_gain_potential_after/",
        "created": 1596417899.0
    },
    {
        "author": "PVofFCF",
        "created_utc": 1597070308,
        "id": "i75zzc",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "Let me preface this by explaining institutional investors (even smaller hedge funds), which have access to management and sell side research, are unable to take advantage of RIV's massive mispricing due to the lack of liquidity. Just last week, I watched individual 5K-10K blocks ($4K-$8K worth) push CNPOF down \\~8%. That said, let me try to explain this as simple as possible.\n\nRIV trades at C$0.86. With \\~220M shares (fully diluted), it trades at a market cap of C$189M. RIV has C$44M in cash and C$96M  ownership of TER-CA (as of last Friday). This alone leaves just C$49M in market capitalization.\n\nRIV owns 49% of PharmHouse (private company). PharmHouse has guaranteed supply contracts with TER &amp; WEED through mid-2022. As an example, without going into the *weeds*, WEED has a contract to purchase 20% of output (\\~30,000 kg) through April 2022. In total, these contractual agreements amount to roughly C$125M in 2021 EBITDA. I understand that there is an oversupply issue, but these agreements provide a bit of leeway in the short term. If PharmHouse were to trade at a 8x '21 EV/EBITDA multiple, RIV's ownership would equate to roughly C$500M, or 2.6x its current market capitalization. Similarly, RIV has a 26% equity stake in Vert Mirabel (private). Again, Mirabel has an offtake agreement with WEED to supply roughly what will amount to C$55M in attributed EBITDA to RIV in 2021.\n\nI can appreciate that the prior impairments have put pressure on the stock, but the scale of these write offs are insignificant relative to their other assets. They have limited cash burn (via administrative SG&amp;A), optionality to put a floor on their stock price via their NCIB (stock buy backs), equity stakes in \\~15 other companies not noted above, and access to the leadership at WEED.\n\nDisclaimer: I own CNPOF and am biased.",
        "subreddit": "weedstocks",
        "title": "The Magnitude by which Canopy Rivers is Mispriced",
        "url": "https://www.reddit.com/r/weedstocks/comments/i75zzc/the_magnitude_by_which_canopy_rivers_is_mispriced/",
        "created": 1597099108.0
    }
]