[
    {
        "author": "anonuser123987",
        "created_utc": 1587710300,
        "id": "g73gt5",
        "num_comments": 78,
        "num_crossposts": 0,
        "selftext": "**\\*\\*\\*If you hate reading then skim through and only look at the bolded//All Analysis conducted on 4/20 closing prices\\*\\*\\***\n\n**Section I: Executive Summary Investment Thesis (Valuation as of 4/20 caz blaze it)**\n\n* Zoom provides a ‘video-first’ cloud-native scalable communications platform that changes how people interact through frictionless video, voice, chat, and content sharing\n   * It primarily serves enterprises in the Americas, Asia Pacific, Europe, the Middle East, and Africa, but also caters to individuals as well\n* **Zoom’s (ZM) share price (****as of 4/20/2020****) is $148.99**\n   * I believe that they are overvalued and should be priced around $70-$85\n      * **While the market went down 30%, ZM shares have climbed 17% since the market peak on Feb. 19 (ZM was at $104) and peaked at $164.94 on March 23 (the day the market reached its current low)**\n* I think the rise in Zoom shares is unwarranted, regardless of stay at home circumstances surrounding the Coronavirus.\n   * **Management noted materially higher usage from free users but saw no significant revenue uplift from the pandemic**. Users have spiked from 10 million in December to 200 million in March, and just recently 300 million.\n   * **The company’s funnel is increasing, as so many users are having a trial by fire on Zoom’s video calling application. However, I am skeptical that Zoom will be able to convert enough of these free users within a reasonable time frame to justify the current valuation.**\n* **I want to clarify that I see Zoom growing tremendously over the next five years, but the price is way ahead of itself**\n   * I attribute the growth to its Y/Y revenue growth being 88.4% over the past year, 118% the year prior, and 149% two years prior.\n   * With a SaaS business model, Zoom will enjoy a low CapEx due to third-party hosting (mostly Amazon Web Services) which eliminates the costs of self-managed servers, and as such is positioned against significant depreciation costs\n   * I point to the **PEG** (**appropriate for high growth/speculative stocks**) and P/E ratios to expected favorable future earnings, but also an indication that the stock is highly overvalued\n      * **NTM** (next twelve months) **PEG is 10x** which means that the stock is **overvalued** when **taking into account both current earnings and the expected growth rate for these earnings in the future**\n      * LTM P/E ratio of 1489.9x and a NTM P/E ratio of 346.5x which both indicate the stock is trading high relative to earnings but offers little insight into the company’s EPS growth prospects\n\n**List of Key Drivers**\n\n* **Zoom was actually profitable on a GAAP basis in fiscal 2019**\n   * Unlike many young software companies, I expect profitability to continue as SaaS business models generally have consistent costs\n* **Strong balance sheet with $0 debt and approximately $850 million in total cash and short term investments**\n* **Long runway for growth with continued market penetration through leveraging their cloud-based solution's ease of use and innovative features**\n   * Gaining traction with its Zoom Phones VoIP solutions with more than 2,900 customers\n   * Pricing tiers are based on a per user per month basis and include Basic (free), Pro ($15), Business ($20), and Enterprise for $20 (more features with a volume discount).\n   * Zoom Rooms enables conference rooms with Zoom Meetings functionality and is $49 per room per month.\n   * Zoom Conference Room Connector allows organizations using legacy providers (such as Cisco) to join Zoom meetings and is priced at $49 per port per month.\n* In its S-1 filing, the company sized the unified communications and collaboration market at $43.1 billion by 2022, with a 3% annual market growth rate and a clear shift toward cloud-based solutions\n   * It is clear that cloud-based software is an emerging market within communications that has tremendous growth potential\n* **The unprecedented circumstances surrounding academics and work has given Zoom the ability to place its service in the hands of millions of people and the opportunity to retain some of these customers**\n\n**\\*\\*\\*List of Key Risks \\*\\*\\***\n\n* **Strong competition from a variety of technology providers**\n   * **Cisco (Webex) and Microsoft (Teams and Skype) dominate the video conferencing market and can bundle a broad array of solutions in response to a competitive threat from Zoom.**\n   * **The industry has considerable intellectual property development which exposes Zoom** to **adverse rulings** in patent infringement cases that could force the company to pay **confiscatory license fees** or **abandon technology altogether**\n* **Zoom offers a freemium model** and **caters to companies** of all sizes which means **revenue is concentrated among the largest customers.** \n   * **Smaller customers typically have higher churn,** which could be exacerbated in Zoom’s case, where the **number of free users far outpaces the number of paid users**. I believe the nature of the model would dictate a higher churn than fully paid enterprise software models.\n   * It remains unclear whether we are witnessing a paradigm shift in the way people work that enables Zoom to convert a substantial proportion of the new free users into paying subscribers or whether these users will simply abandon the service when the current restrictions are lifted\n* Although expected to produce revenue growth at the high end of peers, this higher valuation offers less room for missteps and therefore carries greater inherent risks \n   * **Zoom faces several lawsuits surrounding privacy concerns**\n   * **Risks of customer data breaches** and service outages especially with **80% of Zoom’s R&amp;D staff is based in China** which poses a significant risk due to trade relations, data sensitivity, and the significant rise of intellectual property and trade secret theft present in China\n   * Zoom completed its IPO in April 2019, so it has a **limited operating history as a public company to scrutinize**\n   * **At high valuation levels, companies can often become momentum stocks that are punished severely if they do not deliver against expectations, which are regularly higher than consensus**\n* Executing across so many different aspects of growth simultaneously in their product portfolio.\n   * Zoom Phone (VoIP product) is a more complex sale, the company is moving from smaller to larger customers, and there is a new head of sales.\n\n**Section II: Intrinsic Value** \n\n* Three Stage Growth\n   * Zoom is currently in its early-high growth stage and will continue to benefit from high revenue growth for several years to come\n      * I expect this growth to significantly fade in FYE 2026 to relatively lower and stable rates\n   * **There is a strong indication that revenue will grow as a result of customers increasing 20-fold from 10 million in December 2019 to 300 million in March 2020**\n      * **I expect that most of the revenue will result in businesses allowing more employees to work from home due** to the obvious viability of the platform for online meetings and work, which presents the opportunity to downsize offices to cut costs\n      * **I still expect the number of customers to go down tremendously from its current high once schools and businesses return to normal operations**\n   * Free Cash Flow to Equity approach \n\nFundamental Drivers\n\n&amp;#x200B;\n\nhttps://preview.redd.it/it9ya3qxjpu41.png?width=608&amp;format=png&amp;auto=webp&amp;s=b81c2c5a0711758de7c6d1bdaec3d511a8b4a867\n\n&amp;#x200B;\n\n[Terminal Value: $48,612.20; Intrinsic Value of Equity: $35,781; Intrinsic Share Price: $128.24](https://preview.redd.it/tqqre03bkpu41.png?width=1196&amp;format=png&amp;auto=webp&amp;s=56b26d7004088d6869cadc97cb8df6df379535a5)\n\n**Intrinsic Valuation Drivers**\n\n&amp;#x200B;\n\nhttps://preview.redd.it/63fvmn7kkpu41.png?width=538&amp;format=png&amp;auto=webp&amp;s=0103516a422d6ca1da5cbfede7e710a3eb109a7c\n\n&amp;#x200B;\n\nhttps://preview.redd.it/zq4su1alkpu41.png?width=543&amp;format=png&amp;auto=webp&amp;s=d5bb30091d05ecc19c062a9488c63e12fff98f62\n\n**Section III: Relative Valuation**\n\n**Comparable Companies**\n\n* **Cisco Systems, Inc. (CSCO)** engages in the design, manufacture, and sale of Internet Protocol based networking products and services related to the communications and IT  industry. Enterprise Value = $170,416\n   * Its SaaS product, Webex Meetings, is a cloud-based web and video conferencing service that enables global and virtual teams to collaborate on mobile devices and standards-based video systems in real time. Webex Meetings includes features such as screen sharing, meeting recording, customizable layouts and meeting broadcasting.\n   * Current market leader in line with Microsoft’s platforms Teams and Skype\n* **Verizon Communications Inc. (VZ)** provides communications, information and entertainment products and services to consumers, businesses and governmental agencies. Its Consumer segment provides wireless and wireline communications services. Enterprise Value = $373,424 million\n   * Verizon recently agreed to purchase Blue Jeans Network, Zoom competitor, for $400M\n* **Microsoft Corporation (MSFT)** develops, manufactures, licenses, supports, and sells computer software, consumer electronics, personal computers, and related services. Enterprise Value = $1,284,431 million\n   * Its SaaS product, Teams, is a unified communication and collaboration platform that combines persistent workplace chat, video meetings, file storage, and application integration (Office 365). Microsoft also owns and markets another SaaS product, Skype and Skype Business, which they purchased for $8.5 Billion in 2011\n   * Current market leader in line with Cisco’s Webex platform\n* **LogMeIn (LOGM)** is a provider of software as a service and cloud-based remote connectivity services for collaboration, IT management and customer engagement. Enterprise Value = $4,301 million\n   * GoToMeeting (including GoToWebinar) is a web-hosted service created and marketed by LogMeIn. It is an online meeting, desktop sharing, and video conferencing software package that enables the user to meet with other computer users, customers, clients or colleagues via the Internet in real time.\n   * Direct competitor with Zoom and is a veteran of the industry\n* **VMware (VMW)** provides cloud computing and virtualization software and services and engages in the provision of cloud infrastructure and business mobility. Enterprise Value = $59,183 million\n   * Its products include Software-Defined Data Center, Hybrid Cloud Computing, and End-User Computing. It supports modernizing data centers, integrating public clouds, empowering digital workspaces and transforming security\n   * Similar business plan to Zoom as it operates as a SaaS, but it also helps in scaling businesses into digitalizing its services, which is similar to Zoom’s ability to assist businesses with learning how to operate and adapt to its online platform\n* **8x8 Inc. (EGHT)** is a provider of Voice over IP products. Enterprise Value = $1,981 million\n   * 8x8 products include cloud-based voice, contact center, video, mobile and unified communications for businesses. Zoom directly competes in the VoIP market segment with 8x8\n   * Company has a struggling financial situation but provides insights into how this specific segment of the communications industry (that is VoIP) is oversaturated with competition and offers little to no opportunity for growth\n      * This may be the reason Zoom only offers its VoIP product in a package with other products\n* **Adobe Inc. (ADBE)** is a software company. Enterprise Value = $159,048 million\n   * The Company offers products and services used by professionals, marketers, knowledge workers, application developers, enterprises, and consumers for creating, managing, measuring, optimizing, and engaging with compelling content and experiences.\n   * Adobe is a mature state software company that offers insights into what a successful SaaS business with a diversified portfolio of quality products looks like, which is helpful to compare to a young company like Zoom.\n\n**Multiples**\n\n&amp;#x200B;\n\n[Zoom is astronomically higher than its peers in every multiple except for NTM EPS](https://preview.redd.it/dn603roolpu41.png?width=483&amp;format=png&amp;auto=webp&amp;s=6f7b0bf5f7992985f009f598d91a12e830d665a0)\n\n**Benchmark Analysis: Profitability Margins** \n\n&amp;#x200B;\n\n[ZM is in line with its peers in terms of gross profit, but severely lags behind in all of the other benchmarks](https://preview.redd.it/er9xsmttlpu41.png?width=270&amp;format=png&amp;auto=webp&amp;s=ba048badb5c11760d8a81531c43742e3d284fc8a)\n\n**Putting these multiples to work:**\n\n&amp;#x200B;\n\nhttps://preview.redd.it/h47qxen4mpu41.png?width=254&amp;format=png&amp;auto=webp&amp;s=50711d50b9df4f4d0f5b33035a18482a267358a6\n\nhttps://preview.redd.it/b6kjyhn4mpu41.png?width=241&amp;format=png&amp;auto=webp&amp;s=31ef6ed6ac25355cff8b29865284f73eb3814b2c\n\n[My favorite part\\^](https://preview.redd.it/uj8yloiohpu41.png?width=602&amp;format=png&amp;auto=webp&amp;s=af1c2d3eea986b01a57f377d0f9a8c24e4b2333a)\n\n**TLDR: Although Zoom should be trading at multiples  higher than its peers as it is a relatively new company and only IPO'd in 2019, the current share price (as of 4/20/2020) is way ahead of itself. With speculative high-growth stocks one should pay closer attention to the PEG Ratio rather than the P/E ratio (PEG of 1 indicates it is neither overvalued or undervalued; &lt;1 is undervalued; &gt;1 is overvalued)** In conclusion, I feel that ZM is highly overvalued when compared to its peers, the DCF yields a stock range that shows Zoom is overvalued as well, but that it justifies higher multiples and ratios. I want to emphasize that given the current market situation, a likely bear market cycle for the greater part of the year, Zoom is trading significantly higher than it should be. On top of this, its PEG ratio (over 1 is considered overvalued) shows that the stock is significantly higher than its projected EPS growth as well as that it has a high P/E ratio to begin with. \n\n**TLDR; TLDR:** Appropriate range according to peers: $70-$85 --&gt; More appropriate range would be $85-$100 taking into account my FCFE model (which is very difficult to conduct with only four years of financial information)\n\n**Strike and Date:** 8/21 $85 - $100 range ... to be even safer: 11/20 $100",
        "subreddit": "wallstreetbets",
        "title": "In-Depth Analysis and Valuation on Zoom Video Communications (ZM)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/g73gt5/indepth_analysis_and_valuation_on_zoom_video/",
        "created": 1587739100.0
    },
    {
        "author": "SteveMcHeave",
        "created_utc": 1587572633,
        "id": "g646uk",
        "num_comments": 50,
        "num_crossposts": 0,
        "selftext": "I’m keeping this simple, because like you, I too, am retarded.  There are no technicals here, just a cold, hard, wall of text. \n\nEveryone and their cousin have been rushing to stick their dick in $AMZN these past few weeks. And yeah, she’s a sloppy bitch, but there’s only so much pump one girl can take. So, where can you turn if you don’t want some boonhickles sloppy seconds? The answer is simple, $SHOP.\n\n‘But Steve, isn’t Shopify hovering close to all-time highs?’ Why yes, yes it is Nancy Drew. Do you know why it has been soaring? Of course you don’t, but I’m going to tell you. And then I’m going to tell you why it’s going to go higher.\n\n# The Past\n\nHop in my time machreeee and travel with me back in time. The year, 2019. For his podcast ‘How I Built This’, Guy Raz is interviewing Shopify CEO Tobias Lütke and they are talking about the 2008 crash. Shopify had been expecting to shutter operations amidst unprecedented economic fallout and dire unemployment numbers, but instead, they found that the surge in unemployment led to people using the extra time on their hands to scratch their entrepreneurial itch. Shopify, in turn, saw record growth.\n\n# The Present\n\nCut to today, we are looking down the barrel of 22 million unemployment claims over just the past 4 weeks… and it’s going to get worse. What’s coming is an unprecedented spike of unemployed folks looking to embrace their inner Rockefeller. But it’s not just them — it’s Farmer’s Market vendors, traditional B2B businesses, Brick and Mortar retailers, people who are actually creative, and yes, retards like you and me who have turned to a life of drop-shipping N95 masks and toilet paper from that one Chinese company who until last month exclusively manufactured fidget spinners — we’re all looking for avenue’s to keep the monopoly money flowing. \n\nHeinz — you know, the guys who make the ketchup you fucking nerds put on your scrambled eggs — have been a B2B company since they were founded in 1869. No longer. As of last week, they are selling Direct to Consumer… [using Shopify](https://heinztohome.co.uk/). And any company not run by out-of-touch boomers is following suit.\n\nTotal retail sales in the US — 5.46 Trillion in 2019.  That’s a lot of scharole.  And unlike 2008, Shopify now exists all over the fucking world. Their international growth potential is astounding, especially considering that as recently as 2018 the platform was only available in English and a mere 23% of their revenue was outside of Canaduh and The United States of Freedomtown.  Shopify is now in 175 different countries. 1-7-5 — those are nearly coronavirus numbers! This past Thursday, Shopify’s CTO stated that they are [seeing ‘Black Friday level traffic everyday’](https://twitter.com/jmwind/status/1250816681024331777). \n\nThey clear a monthly fee for each storefront, they are pulling down payment processing fees, fulfillment fees, and then they have their competitive moat… an entire app ecosystem so that you can pimp out your storefront like Xzibit. These guys could give jpow’s printer a run for its money.  JK — not, fucking, possible. \n\n# The Competition\n\n**[Etsy](https://www.etsy.com):** Whereas Shopify offers a dynamic eCommerce platform, Etsy caters to handmade and artisanal products, and takes a cut of product sales and charges to list products.  They’re like Shopify’s free-spirited, crystal-infused, nudist younger brother. Shopify stands to capture much more market share due to the disruption of traditional retail, but Etsy should still see some growth as the creatives go to the platform to subsidize their Trump bucks.  If $SHOP is too rich for your blood, I think $ETSY, currently 15% off their 52-week high, also has positive prospects. That said, they come with a MUCH lower ceiling. \n\n**[Magento](https://magento.com/):** Adobe bought Shopify’s largest competitor, Magento, in 2018. It’s more flexible than Shopify, BUT it caters towards larger stores, is self-hosted, and requires a lot more upfront effort to get up and running. Because of the higher barrier to entry, and the fact that people are lazy bastards, I believe Shopify will capture the vast majority of new eCommerce adopters.\n\n**[Square](https://squareup.com/us/en):** Square’s bread and butter are brick and mortar retailers. They thrive on storefront business.  In 2018 they acquired Weebly, signaling a break into the eCommerce space. And then, in 2019, they introduced their online store-front alternative, ‘Square Online Store’. While they get a 0 on the innovative name game, I do think they will capture a chunk of brick and mortar retailers who already use their service for in-person purchases, but their solution appears to be much less dynamic than Shopify’s offering. I think they are overexposed to the traditional retail pullback, though their eCommerce solution should ensure they won’t go down as hard as your mom did last weekend.\n\n**[Market Fundamentals](https://www.federalreserve.gov/):** General consensus around here is that this recovery defies reason and I tend to agree. You don’t lose a quarters-worth of production, growth, and sales and keep on chugging along as if nothing happened. Eventually, the recovery gravy train we’ve witnessed these last few weeks could come tumbling down. It’s important to keep this ever-present risk in mind. Plus, now that a Mad Max future is out the window with unlimited cheap oil, who knows what nightmarish future we are marching into.\n\n# The Future\nWith a barrier to entry of just $29 bucks a month and easy, code-free setup, Shopify is the no-brainer platform of choice for aspiring robber barons in the impending post-apocalyptic dystopia that awaits us all. Yes, Shopify’s P/E ratio is pretty fucking absurd. But you know what? When Amazon was preparing for world domination, it was expensive too, and now it’s a motherfuckin meme stock with a 1.2 trillion dollar market cap.  Shopify may be caressing all-time highs, but they’ve been at or near ‘all-time highs’ at pretty much any given date going back the past 4 years. Shopify has no debt and 2.4 billion in cash stuffed into their mattresses. It goes without saying that they are prepared for those depression era bread lines. Earnings are 5/06. People are stuck at home, bored as fuck or dying of the ‘rona, what else are they doing if not buying dumb shit online. At the very least we’re going to be seeing a massive spike in subscriptions as well as a host of big-name brands transitioning to the platform. \n\nWe are seeing a monumental shift not just in retail, but in how we fundamentally live. I believe Shopify is positioned for this long term. With a market cap of $70 billion, I’m bullish on Shopify’s prospects over the next few years thanks to the extraordinary circumstances and extraordinary times we are living in. I also suspect that we will see a further spike in the short term, as people come to terms with the pivotal role Shopify is going to be playing in the future of eCommerce. \n\nSo what do you do with this information?\n\nThe answer is simple… open your own Shopify store and start selling Depends.\n\n\n**All information in this post is personal opinion and not direct financial advice. You should make your own decisions based upon evidence and what you believe is best for you.*",
        "subreddit": "wallstreetbets",
        "title": "$SHOP til we drop",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/g646uk/shop_til_we_drop/",
        "created": 1587601433.0
    },
    {
        "author": "Av8rjohn",
        "created_utc": 1586573935,
        "id": "fyv53m",
        "num_comments": 39,
        "num_crossposts": 0,
        "selftext": "I've never invested in stocks before for various reasons but felt this once in a lifetime opportunity to make a final investment before my retirement in 10 years too good to pass up.  I have about $300k in savings and will probably use about a 1/3 to 2/3 of it to buy stocks.  I've done a ton of reading the past month and have a list made up but I can't make up my mind which to choose to narrow it down to maybe 3-10 stocks.  Would appreciate your views on these stocks:\n\nVOO, TSLA, ILMN, GOOG, AAPL, MSFT, NVDA, SQ, ADBE, FB, BRK.B, RTX, V, SYY, MCD, SBUX, T, DIS, JPM.\n\nThank you.",
        "subreddit": "stocks",
        "title": "Help Me Choose Stocks For My Last Hurrah Before Retirement!",
        "url": "https://www.reddit.com/r/stocks/comments/fyv53m/help_me_choose_stocks_for_my_last_hurrah_before/",
        "created": 1586602735.0
    },
    {
        "author": "LearningtoCompound",
        "created_utc": 1585934574,
        "id": "fucges",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "Fair Value Estimates For: TSLA, BYND, NFLX, ROKU, NVDA, AMD, AMZN, FB, XPEL, PAYC, SBUX, MSFT, BRK, WM, SHOP, ADBE, PTON, AAPL, COST\n\nHas anyone worked on fair value estimates for any of these companies and is open to discussing it with someone who wants to learn the art from a professional?\n\nI understand its the owners earnings that can be taken out of the business throughout its life discounted at the proper discount rate. But want to learn how different professionals are doing it so I can understand it better.\n\nThank you!",
        "subreddit": "wallstreetbets",
        "title": "Fair Value Estimates For: TSLA, BYND, NFLX, ROKU, NVDA, AMD, AMZN, FB, XPEL, PAYC, SBUX, MSFT, BRK, WM, SHOP, ADBE, PTON, AAPL, COST",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fucges/fair_value_estimates_for_tsla_bynd_nflx_roku_nvda/",
        "created": 1585963374.0
    },
    {
        "author": "lucafcawesome",
        "created_utc": 1586884755,
        "id": "g19oba",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "I have been doing a ton of research on tech stocks, and simplified ~40 stocks to 7.\n\nI am struggling to reduce the 7 further to 3/4, and I need your opinions.\n\nThe 7: $ASML $SEDG $FB $DIOD $ENPH $ADBE $MSFT\n\nI created a quick &amp; basic Tier 1 &amp; 2 from these stocks with Tier 1: $ASML $SEDG $FB - Tier 2: rest",
        "subreddit": "stocks",
        "title": "Choose your favourite tech stocks out of the following:",
        "url": "https://www.reddit.com/r/stocks/comments/g19oba/choose_your_favourite_tech_stocks_out_of_the/",
        "created": 1586913555.0
    },
    {
        "author": "rangersfan1717",
        "created_utc": 1587291627,
        "id": "g45ffh",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Relatively new stock investor and am 22 years old. I have 22 different holdings at the moment, and I feel like 12-18 is the ideal range to shoot for based on what I've seen around here and other sites. Thoughts on whether I should sell any of these to consolidate? Primarily long term investor (5-10 year+)\n\nAAPL, GOOG, MSFT, AMD, ENPH, SEDG, FTNT, AMZN, CHGG, TTWO, CHE, ALXN, VEEV, VRTX, MDT, ISRG, COST, LULU, ADBE, BIIB, EQIX, TMO\n\nAlso have about 15% in a S&amp;P ETF\n\nI tried picking stocks primarily on strong balance sheets and financials. Any I should consolidate? Atm, I'm thinking to drop ALXN and maybe TTWO. Thanks!",
        "subreddit": "stocks",
        "title": "Do I own too many different stocks?",
        "url": "https://www.reddit.com/r/stocks/comments/g45ffh/do_i_own_too_many_different_stocks/",
        "created": 1587320427.0
    },
    {
        "author": "EmployerOfTheMonth",
        "created_utc": 1586016658,
        "id": "fuwa2s",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "https://drive.google.com/open?id=1lqJBtr_yYKndd9RFWL_Tyz6uPPG7KIDQ\n\nThis is my dcf model for adobe. I must've made a mistake somewhere because my valuation is 74% higher than the current stock price - unless I have made an awesome discovery!\n\nAs usual, I am open to critique and criticism but I would reccomend that you view the spreadsheet in excel as the cell comments make more sense\n\np.s. would short thesis be the correct flair for this?",
        "subreddit": "SecurityAnalysis",
        "title": "My ADBE DCF model to critique?",
        "url": "https://www.reddit.com/r/SecurityAnalysis/comments/fuwa2s/my_adbe_dcf_model_to_critique/",
        "created": 1586045458.0
    },
    {
        "author": "firestormdude",
        "created_utc": 1587995995,
        "id": "g916zr",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "I had the right idea going into this bullshit. I bought a $160 2022 call on Microsoft close to the bottom and loaded up on cheap stocks including Shopify, Microsoft, AMD, Pinterest, Trade Desk, Adobe...\n\nI then got worried and greedy and sold my call to go in on puts right before the jpow dildo fucked all of us hard. Went from $6300 in Robinhood to $3000. I also got nervous around SPY 260 so I sold my Shopify, Trade Desk, and Adobe stock and some Pinterest thinking we’d get another leg down.\n\nWe didn’t.....\n\nI then sold all my shit puts and refactored them into SPY $278p 10/18 hoping for blood based on low volume and to get my damn money back.\n\nOnly silver lining has been a 10% net gain in my Schwab account on buy and hold stocks bullshit but for fucks sake.... this rally is annoying as hell.\n\nIf I would’ve stuck with my original plan, my 2022 Microsoft call would be up $1000+ and I’d be sitting on $12,000 between all my accounts but now I’m sitting around with $7k waiting on my fucking SPY $278p to print so I can flip it back into 2022 calls on this bullshit market.\n\nTired of the fake news driving this shit. Swear I’m so done with this bullshit if we don’t see another leg down..... The economy is fucked and fuck jpow 🖕",
        "subreddit": "wallstreetbets",
        "title": "I’m a fucking idiot",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/g916zr/im_a_fucking_idiot/",
        "created": 1588024795.0
    },
    {
        "author": "Foufou190",
        "created_utc": 1587504209,
        "id": "g5o11e",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Reminder :\n\n6 April: +3.60%\n7 April: -3.08%\n\n14 April: +3.44%\n15 April: -3.15%\n16 April: +3.08%\n\ntoday, 21 April: -3.02% \n\nDon’t know where we’re going, I just expended my positions ´cause I very much trust in the company but I might be biased though. What are your thoughts about short term especially ?",
        "subreddit": "investing",
        "title": "Your thoughts about Adobe [ADBE] stock.",
        "url": "https://www.reddit.com/r/investing/comments/g5o11e/your_thoughts_about_adobe_adbe_stock/",
        "created": 1587533009.0
    },
    {
        "author": "ftstacks",
        "created_utc": 1587515798,
        "id": "g5rbl1",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "I am currently watching SHOP, ROKU, TTD, and TSLA and debating on adding/replacing them into my portfolio. They all have big growth potential, but I am concerned about their risks regarding unprofitability, burning through cash, current weak financials, and overvaluation. What are your opinions on these companies?\n\nI'm 20 and looking for long term investments. I currently hold 14 stocks which are AAPL, ADBE, AMZN, DIS, ENPH, FB, GOOG, MA, MSFT, NFLX, NKE, NVDA, SBUX, SQ. Open to hearing what you guys think.",
        "subreddit": "stocks",
        "title": "Thoughts on my watchlist?",
        "url": "https://www.reddit.com/r/stocks/comments/g5rbl1/thoughts_on_my_watchlist/",
        "created": 1587544598.0
    },
    {
        "author": "SteveMcHeave",
        "created_utc": 1587478034,
        "id": "g5fuht",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "I’m keeping this simple, because like you, I too, am retarded. There are no technicals here, just a cold, hard, wall of text. \n\nEveryone and their cousin has been rushing to stick their dick in $AMZN these past few weeks. And yeah, she’s a sloppy bitch, but there’s only so much pump one girl can take. So, where can you turn if you don’t want some boonhickles sloppy seconds? The answer is simple, $SHOP.\n\n‘But Steve, isn’t Shopify at all time highs?’ Why yes, yes it is Nancy Drew.  Do you know why it’s soaring? Of course you don’t, but I’m going to tell you. And then I’m going to tell you why it’s going to go higher.\n\n\\# The Past\n\nHop in my time machreeee and travel with me back in time. The year, 2019. For his podcast ‘How I Built This’, Guy Raz is interviewing Shopify CEO Tobias Lütke and they are talking about the 2008 crash. Shopify had been expecting to shutter operations amidst unprecedented economic fallout and dire unemployment numbers, but instead they found that the surge in unemployment led to people using the extra time on their hands to scratch their entrepreneurial itch. Shopify, in turn, saw record growth.\n\n\\# The Present\n\nCut to today, we are looking down the barrel of 22 million unemployment claims over just the past 4 weeks… and it’s going to get worse. What’s coming is an unprecedented spike of unemployed folks looking to embrace their inner Rockefeller. But it’s not just them — it’s Farmer’s Market vendors, traditional B2B businesses, Brick and Mortar retailers, people who are actually creative, and yes, retards like you and me who have turned to a life of drop-shipping N95 masks and toilet paper from that one Chinese company who until last month exclusively manufactured fidget spinners — we’re all looking for avenue’s to keep the monopoly money flowing. \n\nHeinz — you know, the guys who make the ketchup you fucking nerds put on your scrambled eggs — have been a B2B company since they were founded in 1869. No longer. As of last week, they are selling Direct to Consumer… \\[using Shopify\\](https://heinztohome.co.uk/). And any company not run by out-of-touch boomers is following suit.\n\nTotal retail sales in the US — 5.46 Trillion in 2019. That’s a lot of scharole. And unlike 2008, Shopify now exists all over the fucking world. Their international growth potential is astounding, especially considering that as recently as 2018 the platform was only available in English and a mere 23% of their revenue was outside of Canaduh and The United States of Freedomtown. Shopify is now in 175 different countries. 1-7-5 — those are nearly coronavirus numbers! This past Thursday, Shopify’s CTO stated that they are \\[seeing ‘Black Friday level traffic everyday’\\](https://twitter.com/jmwind/status/1250816681024331777). \n\nThey clear a monthly fee for each storefront, they are pulling down payment processing fees, fulfillment fees, and then they have their competitive moat… an entire app ecosystem so that you can pimp out your storefront like Xzibit. These guys could give jpow’s printer a run for its money. JK — not, fucking, possible. \n\n\\# The Competition\n\n\\*\\*\\[Etsy\\](https://www.etsy.com):\\*\\* Whereas Shopify offers a dynamic eCommerce platform, Etsy caters to handmade and artisanal products, and takes a cut of product sales and charges to list products. They’re like Shopify’s free-spirited, crystal-infused, nudist younger brother. Shopify stands to capture much more market share due to the disruption of traditional retail, but Etsy should still see some growth as the creatives go to the platform to subsidize their Trump bucks. If $SHOP is too rich for your blood, I think $ETSY, currently 15% off their 52 week high, also has positive prospects. That said, they come with a MUCH lower ceiling. \n\n\\*\\*\\[Magento\\](https://magento.com/):\\*\\* Adobe bought Shopify’s largest competitor, Magento, in 2018. It’s more flexible than Shopify, BUT it caters towards larger stores, is self-hosted, and requires a lot more upfront effort to get up and running. Because of the higher barrier to entry, and the fact that people are lazy bastards, I believe Shopify will capture the vast majority of new eCommerce adopters.\n\n\\*\\*\\[Square\\](https://squareup.com/us/en):\\*\\* Square’s bread and butter is brick and mortar retailers. They thrive on storefront business. In 2018 they acquired Weebly, signalling a break into the ecommerce space. And then, in 2019, they introduced their online store-front alternative, ‘Square Online Store’. While they get a 0 on the innovative name game, I do think they will capture a chunk of brick and mortar retailers who already use their service for in-person purchases, but their solution appears to be much less dynamic than Shopify’s offering. I think they are overexposed to the traditional retail pullback, though their ecommerce solution should ensure they won’t go down as hard as your mom did last weekend.\n\n\\*\\*\\[Market Fundamentals\\](https://www.federalreserve.gov/):\\*\\* General consensus around here is that this recovery defies reason and I tend to agree. You don’t lose a quarters-worth of production, growth, and sales and keep on chugging along as if nothing happened. Eventually, the recovery gravy train we’ve witnessed these last few weeks could come tumbling down. It’s important to keep this ever present risk in mind. Plus, now that a Mad Max future is out the window with unlimited cheap oil, who knows what nightmarish future we are marching into.\n\n\\# The Future\n\nWith a barrier to entry of just $29 bucks a month and easy, code-free setup, Shopify is the no-brainer platform of choice for aspiring robber barons in the impending post-apocalyptic dystopia that awaits us all. Yes, Shopify’s P/E ratio is pretty fucking absurd. But you know what? When Amazon was preparing for world domination, it was expensive too, and now it’s a motherfuckin meme stock with a 1.2 trillion dollar market cap. Shopify may be at new all-time-highs, but they’ve been at or near ‘all-time highs’ at pretty much any given date going back the past 4 years. Shopify has no debt and 2.4 billion in cash stuffed into their mattresses. It goes without saying that they are prepared for those depression era bread lines. Earnings are 5/06. People are stuck at home, bored as fuck or dying of the ‘rona, what else are they doing if not buying dumb shit online. At the very least we’re going to be seeing a massive spike in subscriptions as well as a host of big-name brands transitioning to the platform. \n\nWe are seeing a monumental shift not just in retail, but in how we fundamentally live. I believe Shopify is positioned for this long term. With a market cap of $70 billion, I’m bullish on Shopify’s prospects over the next few years thanks to the extraordinary circumstances and extraordinary times we are living in. But fuck the long-term. We’re trying to get rich on calls. \n\n\\##### SIMPLE LINES FOR SIMPLE MINDS\n\n\\*$SHOP 07/20 730c\\*\n\n…or just open your own Shopify store and start selling Depend’s. The choice is yours.\n\n&amp;#x200B;\n\n  \n\n&amp;#x200B;\n\n\\*\\**All information in this post is personal opinion and not direct financial advice. You should make your own decisions based upon evidence and what you believe is best for you.\\**",
        "subreddit": "wallstreetbets",
        "title": "The $SHOP Primer",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/g5fuht/the_shop_primer/",
        "created": 1587506834.0
    },
    {
        "author": "BApepper",
        "created_utc": 1587483937,
        "id": "g5hm5z",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "I'm a big fan of artificial intelligence and data analytics.\n\nI am looking to hold this fund for at least 7 years.\n\nTop holdings:\n\n1. Netflix 3.97%\n2. NVIDIA 3.85%\n3. Amazon 3.82%\n4. Tencent holdings 3.63%\n5. Microsoft 3.49%\n\nFollowed by (meituan dianping, adobe, Alibaba, oracle, intel, alphabet, facebook)\n\nThoughts?",
        "subreddit": "investing",
        "title": "AIQ etf - \"Big data and AI etf\"",
        "url": "https://www.reddit.com/r/investing/comments/g5hm5z/aiq_etf_big_data_and_ai_etf/",
        "created": 1587512737.0
    },
    {
        "author": "jonahsrevenge",
        "created_utc": 1585923108,
        "id": "fu93in",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[https://www.fnlondon.com/articles/stock-buybacks-amount-to-daylight-robbery-after-this-crisis-we-can-fix-it-20200403?mod=home-page&amp;adobe\\_mc=MCMID%3D33874783196165898244617745443299687707%7CMCORGID%3DCB68E4BA55144CAA0A4C98A5%2540AdobeOrg%7CTS%3D1585922619](https://www.fnlondon.com/articles/stock-buybacks-amount-to-daylight-robbery-after-this-crisis-we-can-fix-it-20200403?mod=home-page&amp;adobe_mc=MCMID%3D33874783196165898244617745443299687707%7CMCORGID%3DCB68E4BA55144CAA0A4C98A5%2540AdobeOrg%7CTS%3D1585922619)",
        "subreddit": "investing",
        "title": "Financial News critique of stock buybacks",
        "url": "https://www.reddit.com/r/investing/comments/fu93in/financial_news_critique_of_stock_buybacks/",
        "created": 1585951908.0
    },
    {
        "author": "LearningtoCompound",
        "created_utc": 1585934452,
        "id": "fucf20",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "Fair Value Estimates For: TSLA, BYND, NFLX, ROKU, NVDA, AMD, AMZN, FB, XPEL, PAYC, SBUX, MSFT, BRK, WM, SHOP, ADBE, PTON, AAPL, COST",
        "url": "https://www.reddit.com/r/investing/comments/fucf20/fair_value_estimates_for_tsla_bynd_nflx_roku_nvda/",
        "created": 1585963252.0
    },
    {
        "author": "LearningtoCompound",
        "created_utc": 1585934413,
        "id": "fucekz",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Fair Value Estimates For: TSLA, BYND, NFLX, ROKU, NVDA, AMD, AMZN, FB, XPEL, PAYC, SBUX, MSFT, BRK, WM, SHOP, ADBE, PTON, AAPL, COST\n\nHas anyone worked on fair value estimates for any of these companies and is open to discussing it with someone who wants to learn the art from a professional?\n\nI understand its the owners earnings that can be taken out of the business throughout its life discounted at the proper discount rate. But want to learn how different professionals are doing it so I can understand it better.\n\nThank you!",
        "subreddit": "stocks",
        "title": "Fair Value Estimates For: TSLA, BYND, NFLX, ROKU, NVDA, AMD, AMZN, FB, XPEL, PAYC, SBUX, MSFT, BRK, WM, SHOP, ADBE, PTON, AAPL, COST",
        "url": "https://www.reddit.com/r/stocks/comments/fucekz/fair_value_estimates_for_tsla_bynd_nflx_roku_nvda/",
        "created": 1585963213.0
    },
    {
        "author": "ManMadeEffects",
        "created_utc": 1586978857,
        "id": "g1yvbl",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "How to Make Liquid Paint Marbling Effect in Adobe Photoshop | Man-Made Effects |YouTube",
        "url": "https://youtu.be/_O_kp7gT4gg",
        "created": 1587007657.0
    }
]