[
    {
        "author": "bubblesmcnutty",
        "created_utc": 1605649161,
        "id": "jw262g",
        "num_comments": 689,
        "num_crossposts": 0,
        "selftext": "[https://www.marketwatch.com/story/bitcoin-just-touched-a-record-market-value-exceeding-its-2017-top-11605643255](https://www.marketwatch.com/story/bitcoin-just-touched-a-record-market-value-exceeding-its-2017-top-11605643255)\n\nThe world’s most prominent digital currency on Tuesday is back to carving out records just like it was 2017. The No. 1 crypto’s nearly 8% weekly rise and 30% gain so far in November has helped the asset hit a market value of around $328 billion, according to digital-currency data site CoinMarketCap.\n\nThat level surpasses the roughly $322.7 billion value that bitcoin hit on Dec. 17 when its price was nearly $20,000 (see chart).\n\nAlthough bitcoin’s price [**BTCUSD,** **5.03%**](https://www.marketwatch.com/investing/cryptocurrency/BTCUSD?mod=MW_story_quote) [**BTCUSD,** **5.03%**](https://www.marketwatch.com/investing/cryptocurrency/BTCUSD?mod=MW_story_quote) hasn’t exceeded that 2017 record level, it currently sits about 12% shy of touching a round-number milestone at $20,000. It quietly has been drawing more attention and notching a fresh all-time peak for an asset considered one of the most polarizing of this generation of financial markets.\n\nBitcoin’s record market capitalization reflects the attention that the blockchain-based asset has garnered over its rivals.\n\nSo-called bitcoin dominance, or the share of bitcoin’s value as it contributes to the universe of recognized digital currencies, was at 65.7%, as tracked by CoinMarketCap. Bitcoin’s market-cap dominance is near to its highest level since May of 2020.\n\nBitcoin and other cryptos were boosted last month after PayPal Holdings Inc.  [**PYPL,** **+0.18%**](https://www.marketwatch.com/investing/stock/PYPL?mod=MW_story_quote)   said it would allow customers to buy cryptocurrency through their accounts and [use it for merchant payments](https://www.marketwatch.com/story/paypal-will-let-customers-buy-cryptocurrencies-and-use-them-for-online-payments-11603283352).\n\nBitcoin prices have gained nearly 150% so far this year, with Bitcoin futures [**BTC.1,** **4.26%**](https://www.marketwatch.com/investing/future/BTC.1?mod=MW_story_quote) trading on the CME Group seeing a similar rise. By comparison, gold [**GCZ20,** **-0.39%**](https://www.marketwatch.com/investing/future/GCZ20?mod=MW_story_quote) has gained 24% in the year to date, while the Dow Jones Industrial Average [**DJIA,** **-0.55%**](https://www.marketwatch.com/investing/index/DJIA?mod=MW_story_quote) has climbed 4.7% so far in 2020. The S&amp;P 500 index [**SPX,** **-0.47%**](https://www.marketwatch.com/investing/index/SPX?mod=MW_story_quote) has gained more than 12% and the technology-laden Nasdaq Composite Index [**COMP,** **-0.21%**](https://www.marketwatch.com/investing/index/COMP?mod=MW_story_quote) has surged more than 33% over the same period.\n\nStill, bitcoin bears and detractors aren’t hard to find. On Tuesday, Ray Dalio, the founder of Bridgewater Associates, the world’s largest hedge fund, and a longtime bitcoin skeptic, on Twitter challenged proponents of the currency to explain to him why bitcoin is worth his attention and not [doomed to collapse](https://www.marketwatch.com/story/dalio-says-he-might-be-missing-something-about-bitcoin-challenges-twitter-to-change-his-mind-11605637663).",
        "subreddit": "investing",
        "title": "Bitcoin just touched a record market value, exceeding its 2017 top",
        "url": "https://www.reddit.com/r/investing/comments/jw262g/bitcoin_just_touched_a_record_market_value/",
        "created": 1605677961.0
    },
    {
        "author": "Troflecopter",
        "created_utc": 1606168654,
        "id": "jzrj3y",
        "num_comments": 507,
        "num_crossposts": 0,
        "selftext": "Gather round my fellow gamblers and shit posters, I have a story and a proposition for you all.\n\nSeveral weeks ago **I had the bright idea to YOLO my entire account in Palantir**. \n\nWhen PLTR was down and out, myself and a few otherwise guys were balls to the wall in long positions. We all loved the company, but quite frankly, things were looking pretty bleak. While we knew the company should be worth more than the measly $9 it was at, the market price told us otherwise.\n\nI was rather worried about what I had done. YOLOing my entire account into Palantir on IPO day drove me to post **a sad story about I had fucked up thousands and thousands of dollars of gains**, which I later deleted out of embarrassment. You can find the remnants of that story here:  \n[https://www.reddit.com/r/wallstreetbets/comments/j3xaua/once\\_upon\\_a\\_time\\_in\\_2020/](https://www.reddit.com/r/wallstreetbets/comments/j3xaua/once_upon_a_time_in_2020/)\n\nThe only thing that remains is some top comments of people calling me a retarded degenerate.\n\nI held on to my sweet sweet palantir, and as any good redditor would, I continued preaching the gospel of Thiel and Karp in any case.\n\nin one WSB conversation, I was lamenting about how I needed money from Palantir in order to pay for the PS5 I had already pre-ordered. This was a very serious concern, because I had paid Walmart, and subsequently saw my Palantir position lose several thousand dollars. Wasn't quite sure how I would explain this one to the Mrs.\n\nA classic millennial problem indeed.\n\nThen along came a random internet stranger named u/ZanderPerk. He promised me that he **would buy me a PS5 if PLTR hit $20 by end of the year**, which at the time, seemed like an outlandish price. You can find that comment here: [https://www.reddit.com/r/wallstreetbets/comments/jj8apo/last\\_chance\\_for\\_early\\_bird\\_pricing\\_pltr/gagx94u/?context=3](https://www.reddit.com/r/wallstreetbets/comments/jj8apo/last_chance_for_early_bird_pricing_pltr/gagx94u/?context=3)\n\nA few weeks later, our sweet sweet hivemind started heating up, and I reminded the internet of what was promised:  \n[https://www.reddit.com/r/wallstreetbets/comments/jpbtx9/pltr\\_looking\\_forward\\_to\\_my\\_free\\_ps5/](https://www.reddit.com/r/wallstreetbets/comments/jpbtx9/pltr_looking_forward_to_my_free_ps5/)\n\nZanderperk, being the gentleman that he is, assured me that **he would live up to his end of the bargain**: [https://i.imgur.com/8lM0j4D.png](https://i.imgur.com/8lM0j4D.png)\n\nSo in anticipation of this glorious transaction, I did what anyone in my position would, and ordered a custom bumper sticker in Zander's honour: [https://i.imgur.com/4d2yhA2.png](https://i.imgur.com/4d2yhA2.png)\n\nThis baby will be slapped right on top the console, and forever live beside my 55 inch 4k TV.\n\nNow it seems that reddit has caught wind of this tale, and people are calling on Zander to send me the money. I have asked him for his email address so that I can send him a PayPal money request, to the tune of $499 USD. You can see further discussion here:\n\n[https://www.reddit.com/r/wallstreetbets/comments/jzjzlg/pltr\\_just\\_won\\_this\\_man\\_a\\_playstation\\_5/](https://www.reddit.com/r/wallstreetbets/comments/jzjzlg/pltr_just_won_this_man_a_playstation_5/)\n\n# Now here is my promise to pay it forward.\n\n# Since PLTR has indeed hit $20 before the end of the year, I will do the exact same thing for someone else *IF* Zander pays up AND it hits $30 before the end of the year.\n\nIf Zander sends me the money, I will post pictures of the PS5 and sticker in WSB for you all to see, and I will update this post with a link to that post. (The sticker doesn't arrive until \\~Dec 7th.)\n\n***Then*** if PLTR crosses $30.00 before the end of Dec 31 2021, I will set up a quick lottery system to give out another PS5 using some clever technology that will be determined at a later date. (I already have an idea in mind.)\n\nIn order to enter the draw, people must be able to prove that they are still in an active stock holding or long option position. The position must be started or purchased before the end of the day tomorrow (November 24th). Bears can fuck off.\n\nThe winner will be ordered a PS5 disc edition off of Amazon, Walmart or Bestbuy straight to an address of their choice. Winner must reside in a country that receives deliveries from one of these stores.\n\n*CHECK BACK HERE FOR UPDATES.*",
        "subreddit": "wallstreetbets",
        "title": "Legend of the WSB PS5 - I promise to pay PLTR forward.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jzrj3y/legend_of_the_wsb_ps5_i_promise_to_pay_pltr/",
        "created": 1606197454.0
    },
    {
        "author": "Brothanogood",
        "created_utc": 1606709769,
        "id": "k3okkw",
        "num_comments": 411,
        "num_crossposts": 0,
        "selftext": "December and January aren't typically busy months for initial public stock offerings, but this time around, they'll be an exception. Almost a half dozen well-known tech startups, each already valued privately at over $1 billion, have recently filed for IPOs, including Airbnb, DoorDash, and Roblox.\n\nThey're hoping to take advantage of strong investor appetite for tech stocks, despite the pandemic, and to catch the coat tails of other tech companies that have recently made [successful debuts](https://fortune.com/2020/08/29/2020-ipos-palantir-tech-ipo-asana-snowflake-predictions/). Shares in cloud database company Snowflake are up 129% since its September IPO and those of data mining company Palantir are up 215% since its September listing.\n\nHere are key details to consider in weighing whether to invest in the latest batch of would-be public tech companies. Financial data is from the first nine months of 2020 unless otherwise indicated.\n\n## Affirm\n\nSymbol: AFRM  \nFiscal 2020 revenue: $510 million (fiscal year ended June 30)  \nRevenue growth: 93%  \nGross margin: n/a  \nNet loss: $113 million\n\n[Affirm’s S-1 filing](https://www.sec.gov/Archives/edgar/data/1820953/000110465920126927/tm2026663-4_s1.htm)\n\nFounded in 2012 by PayPal co-founder Max Levchin, Affirm aims to [bring credit and lending to customers of all kinds of online retailers](https://fortune.com/2020/02/05/credit-cards-levchin-affirm-ceo-daily/). Those hard-to-miss layaway offers for a pair of shoes from Cole Haan or that cute coffee table on West Elm’s website? Affirm works behind the scenes to process the loans and often covers the cost of the item (in some cases, partner banks fund the loans). So far, Affirm has signed up over 6,500 retailer and helped consumers pay for almost $11 billion worth of products over the past three years.\n\n**Pros**: Affirm says its “buy now, pay later” system is superior to credit cards, with no hidden fees or high interest rates (most Affirm offers are zero interest rate). Like other hot consumer companies, Affirm also touts its net promoter score of 78, suggesting more than three-quarters of customers would recommend the company.  As e-commerce grows, there’s plenty of room for growth in the market—less than 1% of e-commerce transactions in North America relied on “buy now pay later” deals. And Affirm says its data analysis of consumers’ ability to pay lets it avoid major losses.\n\n**Cons**: The largest e-commerce sites, like [Amazon](https://fortune.com/company/amazon-com/) and [Walmart](https://fortune.com/company/walmart/), have no need for Affirm and could even launch their own lending services. So could big banks or other financial institutions that can borrow money more cheaply than Affirm can. And more than one-quarter of all of Affirm’s lending has so far come from customers of a single retail partner: Peloton.\n\n## Airbnb\n\nSymbol: ABNB  \nFirst nine months of 2020 revenue: $2.52 billion  \nRevenue growth: -32%  \nGross margin: 74%  \nNet loss: $697 million\n\n[Airbnb’s S-1 filing](https://www.sec.gov/Archives/edgar/data/1559720/000119312520294801/d81668ds1.htm)\n\nAs the now-famous story goes, Airbnb co-founders Brian Chesky and Joe Gebbia decided to rent some airbeds in their San Francisco apartment after a big design conference caused local hotels to be fully booked. Their little web site, AirBedandBreakfast.com, eventually grew into the titan that has rented space to 825 million customers cumulatively across 220 countries.\n\n**Pros**: The fast-growing startup took a huge hit when COVID-19 curbed travel, but has since [almost bounced back](https://fortune.com/2020/06/30/airbnbceo-brian-chesky-bookings-rentals-recovery-2020-ipo-coronavirus-pandemic/). Bookings were down 72% in April compared to the same month in 2019, but for June through September, the declined narrowed to 19% to 23%. The company also brags in its regulatory filing that pandemic-related spending cuts, including slashing headcount by 25%, make it more efficient going forward.\n\n**Cons**: The pandemic showed that the travel industry is subject to sharp downturns that cut into Airbnb’s sales, and infections are on the rise again worldwide. The company has also battled restrictive rules in many cities and countries seeking to ban short-term rentals. Airbnb's filing disclosed it’s also in a battle with the Internal Revenue Service that could cost it $1.4 billion if it loses. And even after being in business for more than a decade, Airbnb is still on pace to lose around $1 billion this year.\n\n## DoorDash\n\nSymbol: DASH  \nFirst nine months of 2020 revenue: $1.92 billion  \nRevenue growth: 226%  \nGross margin: 53%  \nNet loss: $149 million\n\n[DoorDash S-1 filing](https://www.sec.gov/Archives/edgar/data/1792789/000119312520292381/d752207ds1.htm)\n\nAfter moving to the U.S. as a child, DoorDash co-founder and CEO Tony Xu worked as a dishwasher in a Chinese restaurant to help make ends meet. The point of DoorDash, he says, is to help strivers and small businesses thrive. Now in business for seven years, DoorDash “dashers” deliver food and other items from almost 400,000 businesses to 18 million consumers per month as of September.\n\n**Pros**: DoorDash is the leading provider of delivery with over twice the market share of runner up Uber Eats as of October 2020. The pandemic has [ignited much faster growth](https://fortune.com/2020/05/25/coronavirus-jobs-food-delivery-doordash/) in food delivery as people avoid going out to eat. Some smaller players have already sold out (DoorDash bought Square’s Caviar service for $410 million last year), but further consolidation could let DoorDash charge more for its services.\n\n**Cons**: Once the pandemic passes, many DoorDash customers [may return to eating](https://fortune.com/2020/11/16/can-doordash-maintain-its-pandemic-boost/) in restaurants. Although California voters approved a measure to continue to classify gig workers like DoorDash’s dashers as independent contractors, other governments still are trying to classify gig workers as employees, which could wreck DoorDash’s business model.\n\n## Roblox\n\nSymbol: RBLX  \nFirst nine months of 2020 revenue: $589 million  \nRevenue growth: 68%  \nGross margin: 74%  \nNet loss: $206 million\n\n[Roblox S-1 filing](https://www.sec.gov/Archives/edgar/data/1315098/000119312520298230/d87104ds1.htm)\n\nMuch more than a video game, Roblox has become a virtual environment for millions of people and companies [to create their own games](https://fortune.com/2019/07/16/roblox-100-million-monthly-active-users/). Co-founders David Baszucki and Erik Cassel went from making software simulations for physics labs to creating Roblox in 2004. Now some 31 million people play daily, including three-quarters of all U.S. kids age 9 to 12, the company says (Research firm Dubit put the figure at [half of kids 9 to 12 this summer)](https://www.nytimes.com/2020/08/16/technology/roblox-tweens-videogame-coronavirus.html).\n\n**Pros**: Roblox has plenty of reasons for developers to stick around, including its large devoted customer base and the Lua scripting language that makes it easier to make new games. About two-thirds of current users are from the U.S. and Canada, so there is room for considerable overseas expansion.\n\n**Cons**: The pandemic super-charged Roblox growth rate, but kids may decide to put their screens down and play more outside after the crisis ends. Many users play on devices running [Apple](https://fortune.com/company/apple/) or [Google](https://fortune.com/company/alphabet/) software, putting Roblox somewhat at the mercy of the twin tech titans’ app policies. Other games have been banned and the app stores decide how much of each sale they are entitled to. A joint venture with Tencent to bring Roblox to China could be impacted by increasing trade tensions or new restrictions. And gaming and social media platforms come and go depending on the latest fads. Roblox could be the MySpace of gaming.\n\n## Wish (ContextLogic)\n\nSymbol: WISH  \nFirst nine months of 2020 revenue: $1.75 billion  \nRevenue growth: 32%  \nGross margin: 65%  \nNet loss: $176 million\n\n[Wish S-1 filing](https://www.sec.gov/Archives/edgar/data/1822250/000119312520298630/d82777ds1.htm)\n\nOvershadowed by better known rivals like Amazon, [Alibaba](https://fortune.com/company/alibaba-group-holding/), and [eBay](https://fortune.com/company/ebay/), Wish [focuses its e-commerce services](https://fortune.com/2020/11/20/online-marketplace-wish-files-for-ipo/) on the “affordable” segment of consumers. Founded in 2010, Wish now helps more then 500,000 online sellers hawk goods to 100 million monthly active shoppers. Parent company ContextLogic has its name on the IPO registration filing.\n\n**Pros**: Shopping online isn’t just for the wealthy. Wish says it's targeting the 44% of U.S. consumers and 85% of Europeans who have household incomes of $75,000 or less, plus shoppers in developing countries. Wish’s platform is mobile first, and 90% of purchases happen via its mobile app. Although Wish doesn't make a profit, it generated free cash flow (or cash from operating activities minus purchases of property and equipment) of $23 million in the first nine months of 2020.\n\n**Cons**: Wish faces off against many larger rivals, such as Amazon, Alibaba and eBay, plus Shopify and Walmart. To compete against the giants, Wish spends vast sums, over $1 billion so far in 2020, on marketing. With deep connections in China, U.S.-based Wish could be hurt by worsening trade tensions. And as with other startups dependent on mobile apps, Google and Apple could undermine Wish’s business with new rules or requirements.\n\n[Source](https://fortune.com/2020/11/25/2020-ipos-airbnb-roblox-affirm-wish-doordash-predictions-going-public/)",
        "subreddit": "stocks",
        "title": "Pros and cons of investing in 5 upcoming tech IPOs from Airbnb to Roblox",
        "url": "https://www.reddit.com/r/stocks/comments/k3okkw/pros_and_cons_of_investing_in_5_upcoming_tech/",
        "created": 1606738569.0
    },
    {
        "author": "cannainform2",
        "created_utc": 1606673512,
        "id": "k3e4rs",
        "num_comments": 298,
        "num_crossposts": 0,
        "selftext": " December and January aren't typically busy months for initial public stock offerings, but this time around, they'll be an exception. Almost a half dozen well-known tech startups, each already valued privately at over $1 billion, have recently filed for IPOs, including Airbnb, DoorDash, and Roblox.\n\n They're hoping to take advantage of strong investor appetite for tech stocks, despite the pandemic, and to catch the coat tails of other tech companies that have recently made [successful debuts](https://fortune.com/2020/08/29/2020-ipos-palantir-tech-ipo-asana-snowflake-predictions/). Shares in cloud database company Snowflake are up 129% since its September IPO and those of data mining company Palantir are up 215% since its September listing.\n\nHere are key details to consider in weighing whether to invest in the latest batch of would-be public tech companies. Financial data is from the first nine months of 2020 unless otherwise indicated.\n\n## Affirm\n\nSymbol: AFRM  \nFiscal 2020 revenue: $510 million (fiscal year ended June 30)  \nRevenue growth: 93%  \nGross margin: n/a  \nNet loss: $113 million\n\n[Affirm’s S-1 filing](https://www.sec.gov/Archives/edgar/data/1820953/000110465920126927/tm2026663-4_s1.htm)\n\nFounded in 2012 by PayPal co-founder Max Levchin, Affirm aims to [bring credit and lending to customers of all kinds of online retailers](https://fortune.com/2020/02/05/credit-cards-levchin-affirm-ceo-daily/). Those hard-to-miss layaway offers for a pair of shoes from Cole Haan or that cute coffee table on West Elm’s website? Affirm works behind the scenes to process the loans and often covers the cost of the item (in some cases, partner banks fund the loans). So far, Affirm has signed up over 6,500 retailer and helped consumers pay for almost $11 billion worth of products over the past three years.\n\n**Pros**: Affirm says its “buy now, pay later” system is superior to credit cards, with no hidden fees or high interest rates (most Affirm offers are zero interest rate). Like other hot consumer companies, Affirm also touts its net promoter score of 78, suggesting more than three-quarters of customers would recommend the company.  As e-commerce grows, there’s plenty of room for growth in the market—less than 1% of e-commerce transactions in North America relied on “buy now pay later” deals. And Affirm says its data analysis of consumers’ ability to pay lets it avoid major losses.\n\n**Cons**: The largest e-commerce sites, like [Amazon](https://fortune.com/company/amazon-com/) and [Walmart](https://fortune.com/company/walmart/), have no need for Affirm and could even launch their own lending services. So could big banks or other financial institutions that can borrow money more cheaply than Affirm can. And more than one-quarter of all of Affirm’s lending has so far come from customers of a single retail partner: Peloton.\n\n## Airbnb\n\nSymbol: ABNB  \nFirst nine months of 2020 revenue: $2.52 billion  \nRevenue growth: -32%  \nGross margin: 74%  \nNet loss: $697 million\n\n[Airbnb’s S-1 filing](https://www.sec.gov/Archives/edgar/data/1559720/000119312520294801/d81668ds1.htm)\n\nAs the now-famous story goes, Airbnb co-founders Brian Chesky and Joe Gebbia decided to rent some airbeds in their San Francisco apartment after a big design conference caused local hotels to be fully booked. Their little web site, AirBedandBreakfast.com, eventually grew into the titan that has rented space to 825 million customers cumulatively across 220 countries.\n\n**Pros**: The fast-growing startup took a huge hit when COVID-19 curbed travel, but has since [almost bounced back](https://fortune.com/2020/06/30/airbnbceo-brian-chesky-bookings-rentals-recovery-2020-ipo-coronavirus-pandemic/). Bookings were down 72% in April compared to the same month in 2019, but for June through September, the declined narrowed to 19% to 23%. The company also brags in its regulatory filing that pandemic-related spending cuts, including slashing headcount by 25%, make it more efficient going forward.\n\n**Cons**: The pandemic showed that the travel industry is subject to sharp downturns that cut into Airbnb’s sales, and infections are on the rise again worldwide. The company has also battled restrictive rules in many cities and countries seeking to ban short-term rentals. Airbnb's filing disclosed it’s also in a battle with the Internal Revenue Service that could cost it $1.4 billion if it loses. And even after being in business for more than a decade, Airbnb is still on pace to lose around $1 billion this year.\n\n## DoorDash\n\nSymbol: DASH  \nFirst nine months of 2020 revenue: $1.92 billion  \nRevenue growth: 226%  \nGross margin: 53%  \nNet loss: $149 million\n\n[DoorDash S-1 filing](https://www.sec.gov/Archives/edgar/data/1792789/000119312520292381/d752207ds1.htm)\n\nAfter moving to the U.S. as a child, DoorDash co-founder and CEO Tony Xu worked as a dishwasher in a Chinese restaurant to help make ends meet. The point of DoorDash, he says, is to help strivers and small businesses thrive. Now in business for seven years, DoorDash “dashers” deliver food and other items from almost 400,000 businesses to 18 million consumers per month as of September.\n\n**Pros**: DoorDash is the leading provider of delivery with over twice the market share of runner up Uber Eats as of October 2020. The pandemic has [ignited much faster growth](https://fortune.com/2020/05/25/coronavirus-jobs-food-delivery-doordash/) in food delivery as people avoid going out to eat. Some smaller players have already sold out (DoorDash bought Square’s Caviar service for $410 million last year), but further consolidation could let DoorDash charge more for its services.\n\n**Cons**: Once the pandemic passes, many DoorDash customers [may return to eating](https://fortune.com/2020/11/16/can-doordash-maintain-its-pandemic-boost/) in restaurants. Although California voters approved a measure to continue to classify gig workers like DoorDash’s dashers as independent contractors, other governments still are trying to classify gig workers as employees, which could wreck DoorDash’s business model.\n\n## Roblox\n\nSymbol: RBLX  \nFirst nine months of 2020 revenue: $589 million  \nRevenue growth: 68%  \nGross margin: 74%  \nNet loss: $206 million\n\n[Roblox S-1 filing](https://www.sec.gov/Archives/edgar/data/1315098/000119312520298230/d87104ds1.htm)\n\nMuch more than a video game, Roblox has become a virtual environment for millions of people and companies [to create their own games](https://fortune.com/2019/07/16/roblox-100-million-monthly-active-users/). Co-founders David Baszucki and Erik Cassel went from making software simulations for physics labs to creating Roblox in 2004. Now some 31 million people play daily, including three-quarters of all U.S. kids age 9 to 12, the company says (Research firm Dubit put the figure at [half of kids 9 to 12 this summer)](https://www.nytimes.com/2020/08/16/technology/roblox-tweens-videogame-coronavirus.html).\n\n**Pros**: Roblox has plenty of reasons for developers to stick around, including its large devoted customer base and the Lua scripting language that makes it easier to make new games. About two-thirds of current users are from the U.S. and Canada, so there is room for considerable overseas expansion.\n\n**Cons**: The pandemic super-charged Roblox growth rate, but kids may decide to put their screens down and play more outside after the crisis ends. Many users play on devices running [Apple](https://fortune.com/company/apple/) or [Google](https://fortune.com/company/alphabet/) software, putting Roblox somewhat at the mercy of the twin tech titans’ app policies. Other games have been banned and the app stores decide how much of each sale they are entitled to. A joint venture with Tencent to bring Roblox to China could be impacted by increasing trade tensions or new restrictions. And gaming and social media platforms come and go depending on the latest fads. Roblox could be the MySpace of gaming.\n\n## Wish (ContextLogic)\n\nSymbol: WISH  \nFirst nine months of 2020 revenue: $1.75 billion  \nRevenue growth: 32%  \nGross margin: 65%  \nNet loss: $176 million\n\n[Wish S-1 filing](https://www.sec.gov/Archives/edgar/data/1822250/000119312520298630/d82777ds1.htm)\n\nOvershadowed by better known rivals like Amazon, [Alibaba](https://fortune.com/company/alibaba-group-holding/), and [eBay](https://fortune.com/company/ebay/), Wish [focuses its e-commerce services](https://fortune.com/2020/11/20/online-marketplace-wish-files-for-ipo/) on the “affordable” segment of consumers. Founded in 2010, Wish now helps more then 500,000 online sellers hawk goods to 100 million monthly active shoppers. Parent company ContextLogic has its name on the IPO registration filing.\n\n**Pros**: Shopping online isn’t just for the wealthy. Wish says it's targeting the 44% of U.S. consumers and 85% of Europeans who have household incomes of $75,000 or less, plus shoppers in developing countries. Wish’s platform is mobile first, and 90% of purchases happen via its mobile app. Although Wish doesn't make a profit, it generated free cash flow (or cash from operating activities minus purchases of property and equipment) of $23 million in the first nine months of 2020.\n\n**Cons**: Wish faces off against many larger rivals, such as Amazon, Alibaba and eBay, plus Shopify and Walmart. To compete against the giants, Wish spends vast sums, over $1 billion so far in 2020, on marketing. With deep connections in China, U.S.-based Wish could be hurt by worsening trade tensions. And as with other startups dependent on mobile apps, Google and Apple could undermine Wish’s business with new rules or requirements.\n\n[https://fortune.com/2020/11/25/2020-ipos-airbnb-roblox-affirm-wish-doordash-predictions-going-public/](https://fortune.com/2020/11/25/2020-ipos-airbnb-roblox-affirm-wish-doordash-predictions-going-public/)",
        "subreddit": "investing",
        "title": "Pros and cons of investing in 5 upcoming tech IPOs from Airbnb to Roblox",
        "url": "https://www.reddit.com/r/investing/comments/k3e4rs/pros_and_cons_of_investing_in_5_upcoming_tech/",
        "created": 1606702312.0
    },
    {
        "author": "FinishRegular1623",
        "created_utc": 1605468705,
        "id": "jurrx5",
        "num_comments": 268,
        "num_crossposts": 0,
        "selftext": "I've got 400 to invest when markets open tomorrow. Which of these is better positions for higher growth over the coming few years?\n\nI love how PayPal is in the crypto game and already has a huge user base. \n\nSquare has been approved to start giving loans to small business so it looks like they will be a mix of PayPal but also becoming a  mini bank of sorts. \n\nPalantir is palantir. Lots of hype and that's what can make stocks rocket up. Plus they don't have much competition in what they do. They've also just started investing in a sales team when they never had one before.",
        "subreddit": "stocks",
        "title": "PayPal, Square, or Palantir",
        "url": "https://www.reddit.com/r/stocks/comments/jurrx5/paypal_square_or_palantir/",
        "created": 1605497505.0
    },
    {
        "author": "Troflecopter",
        "created_utc": 1605223401,
        "id": "jt5s5n",
        "num_comments": 168,
        "num_crossposts": 0,
        "selftext": "There's 1000 idiot bears in this sub running around screaming \"fire!\" because Palantir (barely) beat the earnings expectations.\n\nGet a fucking grip.\n\nThe presentation was actually quite impressive:\n\n* YOY Revenue is up 50%!\n* Their private sector business is growing very fast at 35%, which means they are proving they can diversify off of government reliance.\n* They have a great proven test case where their software is saving an oil company $1B on an annualized basis. Word is going to spread fast and all those energy companies talk to one another. And despite what all you environmentalist cucks think, oil is still one of the most important industries in the world, and will continue to be for quite some time.\n* Their business is showing 90% of their revenue comes from pre-existing clients, which means that once they dig their claws in, companies integrate the software into their organizations and it becomes reoccurring income. That means all the new growth they are talking about is a gold mine.\n* And finally, have presented several opportunities to profit while helping fight COVID, which means this stock is safe in the event that the pandemic worsens.\n\nUnlike most of the headless bears who are squealing like a bunch of chickens, I actually read the full earnings report and listened to the investor call.\n\nEvery single big shot analyst who had a chance to ask a question started off by first saying \"congratulations on your really solid first quarter\".\n\nWhile the highly uneducated and emotional reddit bears are scared**, the big money is impressed.**\n\nAnd consider this, because these guys did a direct listing instead of an IPO, big money hasn't had a chance to get a chunk of the pie yet and at this rate, I am sure they will very soon.\n\nOnce the big cheeses start adding positions, this stock is going to pop off.\n\nTomorrow might be red, I don't care. Because next year will be GREEN GREEN GREEN.\n\nBut guess what, at the time of this posting, the stock is actually green in the after hours trading, which is fucking hilarious.\n\nIf this stock trades green tomorrow after a lack luster EPS beat, that is actually going to be incredibly bullish. That will mean this stock is rallying on fundamental confidence, not a bajillion robin hood retards pumping and dumping.\n\nAnd here is my final argument: do you really think a pentagon-funded, AI and data analytics company that was cofounded by Thiel - a business leader with ties to Facebook, SpaceX, PayPal and the Bilderberg Group - is going to do anything but make absolute fucking bank for the next decade? \n\nI am holding and holding and holding. \n\nI encourage you to join me.\n\n\\---\n\n*My positions: lots of shares at $9.05, $9.80. $10.73 and $11.70.*",
        "subreddit": "wallstreetbets",
        "title": "$PLTR - The real bull run begins",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jt5s5n/pltr_the_real_bull_run_begins/",
        "created": 1605252201.0
    },
    {
        "author": "TopPackage",
        "created_utc": 1605560660,
        "id": "jvf58x",
        "num_comments": 142,
        "num_crossposts": 0,
        "selftext": "Calling all NIO autists. If you were burned by the shitron hit piece, PLTR is your chance at saving your marriage, before it's too late like Andrew Left.\n\n&amp;#x200B;\n\nConventional wisdom says to invest in the person, not the company, so here is some background:\n\nFounder of PLTR, Peter Theil, was portrayed in the hit series Silicon Valley with a blood boy. \n\nPeter Theil was responsible for hulk Hogan bankrupting Gawker. [https://www.forbes.com/sites/mattdrange/2019/12/23/best-stories-of-the-decade-behind-peter-thiels-plan-to-destroy-gawker/](https://www.forbes.com/sites/mattdrange/2019/12/23/best-stories-of-the-decade-behind-peter-thiels-plan-to-destroy-gawker/)\n\nHe cofounded Paypal with Elon. [https://www.businessinsider.com/paypal-mafia-members-careers-elon-musk-peter-thiel-reid-hoffman-2019-11](https://www.businessinsider.com/paypal-mafia-members-careers-elon-musk-peter-thiel-reid-hoffman-2019-11)\n\nAnd is an openly 🌈🌈🌈 and proud silicon valley Trump supporter. [https://www.nytimes.com/2016/10/16/technology/peter-thiel-donald-j-trump.html](https://www.nytimes.com/2016/10/16/technology/peter-thiel-donald-j-trump.html)\n\n&amp;#x200B;\n\nNothing here is a revelation to anyone. The bull thesis here is that unlike NIO (fuck you Andrew), PLTR is Citron proof.\n\nGawker has shown that no one can talk shit about PLTR because they will literally be sued into bankruptcy. Only positive news from here on out.\n\nTheil will litigate Citron out of existence.\n\nIn addition to his litigious tendencies, the actual product of PLTR is mass surveillance. At any moment, Theil knows the real identity of every anon, myself included. All hail overlord Theil!\n\nPersonally I don't really want my tentacle pron kinks out in the open, but if that's the price for tendies then sign me up!\n\nPLTR 15c 5/21",
        "subreddit": "wallstreetbets",
        "title": "PLTR is the new NIO, and Citron Proof",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jvf58x/pltr_is_the_new_nio_and_citron_proof/",
        "created": 1605589460.0
    },
    {
        "author": "Blackops_21",
        "created_utc": 1606085977,
        "id": "jz5ka3",
        "num_comments": 112,
        "num_crossposts": 0,
        "selftext": "For those of you looking for something a little different from the basic s&amp;p500 etf I have a handy list here.\n\nHAIL- This index is comprised of companies which are included in the Smart Transportation sector\n\n top holdings include NIO, PLUG, TSLA, and WKHS\n\nIPO-  index is a portfolio of companies that have recently completed an initial public offering and holds them for 2 years\n\ntop holdings include ZM, CRWD, DDOG, PTON, &amp; WORK\n\nQQQJ- this index is comprised of the largest 100 Nasdaq-listed companies outside of the NASDAQ-100 Index\n\ntop holdings include TEAM, OKTA, TTD, and ROKU\n\nBUYZ- this fund concentrates its investments in consumer discretionary related industries\n\ntop holdings include SE, AMZN, BABA, FVRR, &amp; PYPL\n\nQQH- The HCM 100 index seeks to outperform the Solactive US Technology 100 Index.\n\nholdings include TQQQ, AMZN, AAPL, MSFT and FB\n\nKOMP- The index is designed to capture companies whose products and services are driving innovation.\n\ntop holdings include NIO, ZM, TSLA, and TWLO\n\nSPYX- s&amp;p500 fossil fuel free\n\nSPXE- s&amp;p500 minus energy\n\nSPXN- s&amp;p500 minus financials\n\nMOON- invests in 50 early-stage companies with the highest allocation of resources to research and development\n\ntop holdings include NIO, WKHS, PLUG, SPCE, &amp; CRWD",
        "subreddit": "RobinHood",
        "title": "List of interesting ETF's",
        "url": "https://www.reddit.com/r/RobinHood/comments/jz5ka3/list_of_interesting_etfs/",
        "created": 1606114777.0
    },
    {
        "author": "Jawbrah95",
        "created_utc": 1606201924,
        "id": "k00bmk",
        "num_comments": 110,
        "num_crossposts": 0,
        "selftext": "After seeing these two lovely fellas uphold the integrity of r/Wallstreetbets through a gentlemen’s bet, I have been inspired. I will PayPal someone $100 USD in this thread as long as they have an active position in $PLTR before Nov 24th.\n\nPlease suggest methods of selection winner. See you when $PLTR hits $30.\n\nEDIT: Must post pic of open $PLTR position",
        "subreddit": "wallstreetbets",
        "title": "Will PayPal $100 USD to someone if PLTR reaches $30 EOY 🚀🚀 (inspired by Trolfecoptet &amp; Zanderperk)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k00bmk/will_paypal_100_usd_to_someone_if_pltr_reaches_30/",
        "created": 1606230724.0
    },
    {
        "author": "itypeinlowercase",
        "created_utc": 1605882648,
        "id": "jxq02p",
        "num_comments": 108,
        "num_crossposts": 0,
        "selftext": "PYPL options?\n\nI been looking at PayPal for a little bit, they’ve had a considerable drop a few weeks ago, but outperformed sales in Q3.\n\nThey also are into crypto now, which is a new revenue stream not included in Q3. With the holidays coming up, and Covid spiking I’m thinking it’ll be a good jump soon but I’m new to options so not sure. Any thoughts?\n\n[TradingView analysis ](https://www.tradingview.com/chart/PYPL/M3T6zoYC-PYPL-Update/)",
        "subreddit": "options",
        "title": "$PYPL looking to break out?",
        "url": "https://www.reddit.com/r/options/comments/jxq02p/pypl_looking_to_break_out/",
        "created": 1605911448.0
    },
    {
        "author": "Ordinary_investor",
        "created_utc": 1606002634,
        "id": "jylc71",
        "num_comments": 106,
        "num_crossposts": 0,
        "selftext": " **People have sent me few privates asking for references/proof:**\n\n**Here is CLASS ACTION COMPLAINT by United States district court Southern district of New York, which goes into much detail about the topic:**\n\n[https://www.courthousenews.com/wp-content/uploads/2020/01/Bitcoin.pdf](https://www.courthousenews.com/wp-content/uploads/2020/01/Bitcoin.pdf)\n\nHi community!\n\nThose who do not know, before the Madoff ponzi collapsed, B. Madoff was chairman of Nasdaq and very well respected among the circles. Few years later, Securities Investor Protection Corporation (SIPC) trustee estimated actual losses to investors of $18 billion. It is reason why i am posting this as hopefully i will save few people from losing their money in the coming years by investing into cryptocurrencies.\n\nI will keep it short and simple and not go much into technical details, but i assure you anyone willing to google, there is plenty of detailed proof and research into the topic.\n\nBitcoin price has increased through this year **mainly** only because the fact that there is a mechanism in which dollar \"equivalent\", called tether, which is almost entirely unpacked by fiat (unofficial claim by tether treasury is, that they are packed by dollar equivalent, which in this case means bitcoin itself, which is ridiculous in itself), is being used to prop up the price of bitcoin by buying it off all the major exchanges, such as Binance, Huobi, Coinbase, Kraken etc. There is hardly any real retail interest and all the major counter points, used by the crypto community (such as insitutional demand, billionaires buying before you, Paypal, Square, Micro etc) is all smoke and mirrors, in hopes that retail will come and buy into the ponzi pyramid.\n\nWhy i mentioned Madoff, is because just few days back, total tether in circulation also crossed the SIPC mentioned $18B, currently already at $18.4B. This year alone so called Tether Treasury has issued &gt;14B new tethers, claiming exponential increase in demand. As a comparison, at the peak of the 2017 crypto mania, there were only total of 1.4B printed through whole year. And tether is only one of the quite a few noteworthy other stablecoins, which i wont go into currently, but they also feed into the loop/system, of proping up the price. Simple example being DEFI, where Ethereum is being used as an collateral, for person to take out a loan in so called stable coins, which then on majority of cases, is used again to purchase even more ethereum. In Laymans terms, being used as a simple leverage multiplier tool with interest payment. But is defined by community, as somewhat of a groundbreaking new invention. Which i agree, it somewhat would be, if used for the real world purposes, not as a simple leverage tool.\n\nHere is a chart i put together, which should make it rather obvious for anyone taking a quick look.\n\nIt includes last 4 years of bitcoin price, tether printing and retail interest on one chart:\n\n[**https://imgur.com/i78BTXg**](https://imgur.com/i78BTXg)\n\nI will also leave you with a comic strip, that i had made, which describes the last 4 years of Bitcoin (and cryptocurrency asset class) tether addiction:\n\n[**https://imgur.com/fPDm2VX**](https://imgur.com/fPDm2VX)\n\nPS *I just want to add, that in my opinion, main issue with bitcoin and all of cryptocurrency space is more precisely what it has become, a big ponzi pyramid. On top of that, tether treasury (and those involved) has completely taken over the space and what they are doing, will eventually leave many people financially ruined (because they do not any better or know, but still are willing to risk) and unfortunately them probably much more rich.*\n\n*I must add, that i would be significantly more acceptable with this global huge economy project/test, if it would lead its way in natural course, without middleman mafia, which currently, in Laymans terms, pumps the price with nothing but air, to eventually sell to a greater fool. If it would naturally succeed, as in new age gold 2.0, more gradually, actually being implemented into payment/financial systems etc, actually represent the alternative to government money, money for people, i would be alot more comfortable to let it run its course and see if it perhaps succeeds.*\n\n*Bitcoin has lost all of what it was supposed to represent and where it was supposed to develop as a technology. There are many reasons why it has gone as such, it is not really topic to discuss here.*",
        "subreddit": "StockMarket",
        "title": "Bernie Madoff and bitcoin",
        "url": "https://www.reddit.com/r/StockMarket/comments/jylc71/bernie_madoff_and_bitcoin/",
        "created": 1606031434.0
    },
    {
        "author": "breakingnews-bot",
        "created_utc": 1604367485,
        "id": "jn17dq",
        "num_comments": 97,
        "num_crossposts": 0,
        "selftext": "PayPal CEO Dan Schulman provided new details about the company’s recent embrace of Bitcoin and other cryptocurrencies on Monday, describing plans for shopping tools as well as potential partnerships with central banks.\n\nhttps://fortune.com/2020/11/02/paypal-cryptocurrency-bitcoin-venmo/",
        "subreddit": "investing",
        "title": "PayPal plans to extend its cryptocurrency initiatives to include Venmo, more merchants, and central banks.",
        "url": "https://www.reddit.com/r/investing/comments/jn17dq/paypal_plans_to_extend_its_cryptocurrency/",
        "created": 1604396285.0
    },
    {
        "author": "bubblesmcnutty",
        "created_utc": 1606248169,
        "id": "k0ckwx",
        "num_comments": 90,
        "num_crossposts": 0,
        "selftext": "[https://www.cnbc.com/2020/11/24/square-and-paypal-emerge-as-whales-in-the-crypto-market-.html](https://www.cnbc.com/2020/11/24/square-and-paypal-emerge-as-whales-in-the-crypto-market-.html)\n\n* **PayPal and Square clients are buying most of the new bitcoin supply entering the market each day, according to analysis by Pantera Capital.**\n* **The fintech companies’ moves into crypto makes it easier for new investors to casually buy, versus opening up a dedicated cryptocurrency exchange account.**\n* **It adds to a number of factors helping bitcoin climb past $19,000 — including big-name investors like Paul Tudor Jones publicly backing the cryptocurrency.**",
        "subreddit": "investing",
        "title": "Square and PayPal may be the new whales in the crypto market as clients flock to buy bitcoin",
        "url": "https://www.reddit.com/r/investing/comments/k0ckwx/square_and_paypal_may_be_the_new_whales_in_the/",
        "created": 1606276969.0
    },
    {
        "author": "aaplfarm",
        "created_utc": 1605681864,
        "id": "jwayhe",
        "num_comments": 78,
        "num_crossposts": 0,
        "selftext": "[https://markets.businessinsider.com/news/stocks/warren-buffett-berkshire-hathaway-buying-secret-stock-revealed-coming-weeks-2020-11-1029813523](https://markets.businessinsider.com/news/stocks/warren-buffett-berkshire-hathaway-buying-secret-stock-revealed-coming-weeks-2020-11-1029813523)\n\n&amp;#x200B;\n\nDelayed 13F filing to omit confidential information from being made public while he builds his position. Last got approval to delay his filing when he was building his position in Phillips 66. \n\n&amp;#x200B;\n\nWhat's your best guess?\n\n&amp;#x200B;\n\nList your top 3 tickers \n\n&amp;#x200B;\n\n1. $PSTH\n2. $PYPL\n3. ????? $TSLA??????",
        "subreddit": "wallstreetbets",
        "title": "Guess what stock Buffet is secretly buying up",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jwayhe/guess_what_stock_buffet_is_secretly_buying_up/",
        "created": 1605710664.0
    },
    {
        "author": "BihChassNi69a",
        "created_utc": 1605024728,
        "id": "jrnqi4",
        "num_comments": 77,
        "num_crossposts": 0,
        "selftext": "Will my tech stocks be okay in the long term? Or should I just sell now and take the loss? I have amazon, tesla, apple, google, nio, paypal, ali baba, and shopify. shopify has gone completely down the drain. this sucks. Is this a sign to pour money into the stocks? or will it just keep going down",
        "subreddit": "stocks",
        "title": "All my tech stocks are going down the drain.",
        "url": "https://www.reddit.com/r/stocks/comments/jrnqi4/all_my_tech_stocks_are_going_down_the_drain/",
        "created": 1605053528.0
    },
    {
        "author": "sqesla",
        "created_utc": 1605492726,
        "id": "juyj3r",
        "num_comments": 75,
        "num_crossposts": 0,
        "selftext": "\"Never bet against Elon.\" You know who said that? Peter Thiel. Have you heard of Peter Thiel? He is an OG PayPal mafia dude who ran PayPal after Papa Musk and is now spearheading Palantir or PLTR. Cathie Wood of ARK just invested, so did Soros, don't underestimate this company.",
        "subreddit": "wallstreetbets",
        "title": "\"Never bet against Elon.\"",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/juyj3r/never_bet_against_elon/",
        "created": 1605521526.0
    },
    {
        "author": "Blackops_21",
        "created_utc": 1606085488,
        "id": "jz5fcj",
        "num_comments": 74,
        "num_crossposts": 0,
        "selftext": "For those of you looking for something a little different from the basic s&amp;p500 etf I have a handy list here.\n\nHAIL- This index is comprised of companies which are included in the Smart Transportation sector\n\n top holdings include NIO, PLUG, TSLA, and WKHS\n\nIPO-  index is a portfolio of companies that have recently completed an initial public offering and holds them for 2 years\n\ntop holdings include ZM, CRWD, DDOG, PTON, &amp; WORK\n\nQQQJ- this index is comprised of the largest 100 Nasdaq-listed companies outside of the NASDAQ-100 Index\n\ntop holdings include TEAM, OKTA, TTD, and ROKU\n\nBUYZ- this fund concentrates its investments in consumer discretionary related industries\n\ntop holdings include SE, AMZN, BABA, FVRR, &amp; PYPL\n\nQQH- The HCM 100 index seeks to outperform the Solactive US Technology 100 Index.\n\nholdings include TQQQ, AMZN, AAPL, MSFT and FB\n\nKOMP- The index is designed to capture companies whose products and services are driving innovation.\n\ntop holdings include NIO, ZM, TSLA, and TWLO\n\nSPYX- s&amp;p500 fossil fuel free\n\nSPXE- s&amp;p500 minus energy\n\nSPXN- s&amp;p500 minus financials\n\nMOON- invests in 50 early-stage companies with the highest allocation of resources to research and development\n\ntop holdings include NIO, WKHS, PLUG, SPCE, &amp; CRWD",
        "subreddit": "StockMarket",
        "title": "Interesting ETF's guide",
        "url": "https://www.reddit.com/r/StockMarket/comments/jz5fcj/interesting_etfs_guide/",
        "created": 1606114288.0
    },
    {
        "author": "Ordinary_investor",
        "created_utc": 1605989021,
        "id": "jyhifq",
        "num_comments": 72,
        "num_crossposts": 0,
        "selftext": "Hi community!\n\nThose who do not know, before the Madoff ponzi collapsed, B. Madoff was chairman of Nasdaq and very well respected among the circles. Few years later, Securities Investor Protection Corporation (SIPC) trustee estimated actual losses to investors of $18 billion. It is reason why i am posting this as hopefully i will save few people from losing their money in the coming years by investing into cryptocurrencies.\n\nI will keep it short and simple and not go much into technical details, but i assure you anyone willing to google, there is plenty of detailed proof and research into the topic.\n\nBitcoin price has increased through this year **mainly** only because the fact that there is a mechanism in which dollar \"equivalent\", called tether, which is almost entirely unpacked by fiat (unofficial claim by tether treasury is, that they are packed by dollar equivalent, which  in this case means bitcoin itself, which is ridiculous in itself), is being used to prop up the price of bitcoin by buying it off all the major exchanges, such as Binance, Huobi, Coinbase, Kraken etc. There is hardly any real retail interest and all the major counter points, used by the crypto community (such as insitutional demand, billionaires buying before you, Paypal, Square, Micro etc) is all smoke and mirrors, in hopes that retail will come and buy into the ponzi pyramid.\n\nWhy i mentioned Madoff, is because just few days back, total tether in circulation also crossed the SIPC mentioned $18B, currently already at $18.4B. This year alone so called Tether Treasury has issued &gt;14B new tethers, claiming exponential increase in demand. As a comparison, at the peak of the 2017 crypto mania, there were only total of 1.4B printed through whole year. And tether is only one of the quite a few noteworthy other stablecoins, which i wont go into currently, but they also feed into the loop/system, of proping up the price. Simple example being DEFI, where Ethereum is being used as an collateral, for person to take out a loan in so called stable coins, which then on majority of cases, is used again to purchase even more ethereum. In Laymans terms, being used as a simple leverage multiplier tool with interest payment. But is defined by community, as somewhat of a groundbreaking new invention. Which i agree, it somewhat would be, if used for the real world purposes, not as a simple leverage tool.  \n\nHere is a chart i put together, which should make it rather obvious for anyone taking a quick look. \n\nIt includes last 4 years of bitcoin price, tether printing and retail interest on one chart:\n\n [**https://imgur.com/i78BTXg**](https://imgur.com/i78BTXg) \n\nI will also leave you with a comic strip, that i had made, which describes the last 4 years of Bitcoin (and cryptocurrency asset class) tether addiction:\n\n[**https://imgur.com/fPDm2VX**](https://imgur.com/fPDm2VX)\n\nPS *I just want to add, that in my opinion, main issue with bitcoin and all of cryptocurrency space is more precisely what it has become, a big ponzi pyramid. On top of that, tether treasury (and those involved) has completely taken over the space and what they are doing, will eventually leave many people financially ruined (because they do not any better or know, but still are willing to risk) and unfortunately them probably much more rich.* \n\n*I must add, that i would be significantly more acceptable with this global huge economy project/test, if it would lead its way in natural course, without middleman mafia, which currently, in Laymans terms, pumps the price with nothing but air, to eventually sell to a greater fool. If it would naturally succeed, as in new age gold 2.0, more gradually, actually being implemented into payment/financial systems etc, actually represent the alternative to government money, money for people, i would be alot more comfortable to let it run its course and see if it perhaps succeeds.*\n\n*Bitcoin has lost all of what it was supposed to represent and where it was supposed to develop as a technology. There are many reasons why it has gone as such, it is not really topic to discuss here.*",
        "subreddit": "investing",
        "title": "Bernie Madoff and bitcoin",
        "url": "https://www.reddit.com/r/investing/comments/jyhifq/bernie_madoff_and_bitcoin/",
        "created": 1606017821.0
    },
    {
        "author": "Polysics91",
        "created_utc": 1606397133,
        "id": "k1f6lg",
        "num_comments": 68,
        "num_crossposts": 0,
        "selftext": "I'm just dropping the first little hints on how big AFRM will be, not to give a ton away because don't want some bullshit IPO like SNOW.\n\nCEO is ex paypal. same as PLTR and papa elon.\n\nRevenue is growing 100% YOY.\n\nA large competitor that is currently mostly in the australian market AFTERPAY is valued at 27BLN AUD &gt; 20BLN USD. its current revenue is LESS than Affirms. \n\nSo here is the good DD, if it opens at the rumored 5bln it is an easy 4 bagger+ on stocks alone. \n\nKeep it on the radar for now, don't hype it too much until the IPO details are finalized in terms of the pricing, if hype gets to high, they will just IPO at 20bln, hopefully options open up on it quickly and then the hype can begin.\n\nI will give a larger complete breakdown of it with rocket emojis and everything when they finalize the price. \n\nroblox and this are the real moon stocks for IPO come end of year if people don't hype it too crazy before the IPO. once IPO hits, mooning begins.\n\nDown vote this if it gets anywhere near front page, bigger DD in a few weeks time.",
        "subreddit": "wallstreetbets",
        "title": "AFRM - Affirm IPO, PAYPAL mafia 3.0",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k1f6lg/afrm_affirm_ipo_paypal_mafia_30/",
        "created": 1606425933.0
    },
    {
        "author": "AceOrigins",
        "created_utc": 1605741375,
        "id": "jwqvxq",
        "num_comments": 64,
        "num_crossposts": 0,
        "selftext": "You know the little button on basically every retailers online shop that reads \"Pay in payments with affirm\" yip thats them. THIS IS HUGE. I literally see those blue words on EVERY online shop. The amount of boomers who use it as credit is HUGE. You dont need a credit card or credit history to use their service. You dont even get a physical card with them. Its basically online invoices. Also you choose whether you want to pay your purchase in  3months, 6,  or 12. Their app is where you see your purchases and where the bills go to.  This is the next IPO that will boom. Thots?\n\n[Link](https://www.marketscreener.com/quote/stock/PAYPAL-HOLDINGS-INC-23377703/news/Fintech-startup-Affirm-s-IPO-filing-shows-revenue-surge-amid-lending-boom-31815790/)",
        "subreddit": "wallstreetbets",
        "title": "Affirm, Co-founded by Paypal Co-founder, files for IPO",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jwqvxq/affirm_cofounded_by_paypal_cofounder_files_for_ipo/",
        "created": 1605770175.0
    },
    {
        "author": "jeffrey475",
        "created_utc": 1606526267,
        "id": "k2e02p",
        "num_comments": 63,
        "num_crossposts": 0,
        "selftext": "Take advantage of today's savings on Monday. Palantir just got cheaper for all of us. Buy calls. Buy stocks.\nVery rarely does the market offer good deals on a great company\n. \nSome DD:\n\nLed by Peter Thiel, who wrote Zero to One. He's crazy smart. Cofounded Paypal. Early investor in Facebook. BFF of Daddy Elon Musk.\n\nPalantir doesn't have a direct competitor. The closest would probably be $SNOW or $CRM's Tableu. Both of which are worth over 75 billion.\n\nArk Invest Internet ETF bought the dip with 3,660 additional shares today. Currently has well over 1 million shares.\n\nAndrew Left of Citron Research has a history of bad calls. He was right about half the time (50%) He was wrong about NVDA, NIO, SHOP, AMD, and TSLA. We all know how those turned out.\n\nGeorge Soros \"regrets investing in PLTR\" for morality reasons, NOT financial ones. There is no doubt that AI and Big Data are the future.\n\n\nLong Story Short\nIf you don't believe in this company, then don't gamble. The boys and I will be riding this tendies train to the moon.\n\nMy Price Target is $48/ share or 83 Billion Mkt Cap.\n\nPositions: 125 shares | 1 × 28c 12/18 &amp; 1 × 30c 5/21",
        "subreddit": "wallstreetbets",
        "title": "PLTR: BUY THE DIP",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k2e02p/pltr_buy_the_dip/",
        "created": 1606555067.0
    },
    {
        "author": "Korgath_of_Barbaria",
        "created_utc": 1606539929,
        "id": "k2hqc8",
        "num_comments": 58,
        "num_crossposts": 0,
        "selftext": "One consistency between all the investing/options/WSB subs right now is that anything non-PLTR related seems to be getting drowned out. However there is some promising short term opportunity out there in case you're uneasy with managing your FOMO of jumping into a company that has run +70% over the last week.\n\nYou may be sick of hearing about SPACs in 2020, but do try to keep an open mind in that they are not all created equally. There are some fantastic companies coming down the SPAC pipeline now and in the future.\n\nI've recently traded SBE, DPHC (now RIDE), SPAQ (now FSR), KCAC (now QS) with a mixture of shares and options and have done extremely well. In fact, r/options has been the source of my finding out about many of these great companies ahead of time. The trick with them is getting it while they are cheap, riding the hype to merger and selling off before it begins to cool.\n\nRight now I believe there are some very promising opportunities out there today that have still not had a significant run up (SBE being the exception). I encourage you to do your own DD on each of these companies before adding them to your portfolio:\n\n**Short Term Plays:**\n\n* **HCAC** \\- Soon to be Canoo, an LA based Electric Vehicle company. This SPAC has been left behind in the EV run-ups as of late and has a lot of upside. It's also one of the few EV companies generating revenues.   \nAs of this writing it is trading around $13.00 AH, with a floor set around $10. The current business combination date for this is by December 31st (assuming no extension will be filed).   \n\\-I've taken a heavy shares and options position on this, with ITM calls expiring in Feb and May. This company has not had the same level of coverage that Lordstown and Fisker have so it may take time after the merger to begin building momentum.\n* **GMHI** \\- Soon to be Luminar, a Lidar technology company that will be used for autonomous driving in vehicles. While not strictly an EV play, there is still an association. Backed by Peter Thiel (co-founder of PayPal, and more recently, Palantir).   \nThe vote for the combination is scheduled for December 1st. Assuming the vote approves the merger, I would expect a pop on the 2nd which may continue to rise over the following days.   \n\\-I've taken a short term options position on this with ITM/ATM calls expiring December 18th.\n\n**Medium/Long Term Plays:**\n\n* **NOVS -** One word: AgTech. If you're unfamiliar it stands for Sustainable Agricultural Technology, and it is very likely to be a term we hear ad nauseam over the course of the next decade. One company in particular is positioning itself as a leader and is working to turn the Appalachian region into the hub of this industry; AppHarvest.   \nAgain, I highly recommend you look the company up and do your own DD but I am absolutely in love with them. The only problem is that I don't necessarily see this one popping in the same vain of EV's at merger. This will be a slow burn, but once institutional investors understand that this is in fact a tech company it will be a good long term play.   \n\\-I have taken a share only position and intend to hold, with a partial sell off/profit take strategy around $50 per share.\n* **PSTH -**  Bill Ackman's baby. A SPAC curated with the intention of taking a private \"Unicorn\" public. I won't even begin to speculate on which companies they are courting as it is truly a source of contention between shareholders but names like Bloomberg, Stripe, and Menards have been dropped. The floor on this SPAC is set at a $20 buy back should the company pick a company that is not agreeable to shareholders.  \n\\-I'm extremely heavy in shares, and it currently makes up 30% of my portfolio. I would hold off on options as it could still be another year before a deal is announced, but you could always take a position in long dated LEAPS. \n\n**Tread with Caution:**\n\n* **SBE -** I love ChargePoint. They are positioning themselves to be the Electric Charging Station infrastructure for a growing EV world. Their TAM is huge, and will grow tenfold in the next few years. I have no doubt this will be a great stock to own. The only problem is given their recent run up, I'm not sure how much more they will move once the merger takes place. If you sold HYLN after the merger you did great. If you didn't, well, you're now potentially a long term bag holder. Similar may be true about SBE, but given that their main competitor BLNK has only a small comparative penetration of the market they have a very impressive moat for growth.  \n\\-I've taken a large share position, however I will begin to sell off as begins to kiss $50 or shortly after the merger.  \n\n\nAnyways, the point of this post was to offer encouragement and alternatives to anyone who may be unsure of what moves to make in a world dominated by NIO and PLTR meme stock hype. SPACs are by no means a sure thing, but 2020 has proven to be good to them and I will continue taking advantage of the ones where I am buying in to companies I believe in long term (even if I am only a short term position holder).\n\nYou have not missed out. Every trading day is an opportunity. Good luck!",
        "subreddit": "options",
        "title": "Promising SPACs to Keep on Your Radar",
        "url": "https://www.reddit.com/r/options/comments/k2hqc8/promising_spacs_to_keep_on_your_radar/",
        "created": 1606568729.0
    },
    {
        "author": "zupooli",
        "created_utc": 1605534299,
        "id": "jv6ykv",
        "num_comments": 58,
        "num_crossposts": 0,
        "selftext": "I told you since last week! $STWD pushed himself to 17.50 this morning in the premarket. Can’t wait to see the price on those 11/20 17.5C under 0.45 hop on man🚀🌓🤑\n\nTHOSE WHO MADE BANKS: there is my PayPal for donation;)🤑 https://www.paypal.me/zupooliwsb",
        "subreddit": "wallstreetbets",
        "title": "$STWD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jv6ykv/stwd/",
        "created": 1605563099.0
    },
    {
        "author": "whiskeynbeer2",
        "created_utc": 1605239629,
        "id": "jta3a8",
        "num_comments": 52,
        "num_crossposts": 0,
        "selftext": "Labeled this as a fundamental post cuz y'all are forgetting some integral shit.\n\nI can't believe you fucking idiots FORCED me to write this shit. It's obligatory now, after seeing the 1000th post claiming nio li xpev are the new Tesla and their respective CEOs to be the new Elon.\n\nElon runs a successful space exploration company outsourced by the US Govt.\n\nElon is literally digging massive tunnels under some of America's largest cities, because it's cool.\n\nElon was behind the solar panel revolution from the god damn start.\n\nElon fucking built PayPal.\n\nElon relisted his Tesla base price to 69420 just to fuck with his competition.\n\nElon has intentionally nutted on the SEC, on multiple occasions.\n\nAll you disloyal autists will pay, handsomely, for your failure to recognize the difference between a real life Tony Stark and companies propped up by the Chinese Govt.\n\nI'm not even invested. Just forewarning, you longstanding Tesla bulls who switched chariots so easily are in for a \"bad time\" (queue south park).",
        "subreddit": "wallstreetbets",
        "title": "Elon Musk",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jta3a8/elon_musk/",
        "created": 1605268429.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1604326504,
        "id": "jmo4jq",
        "num_comments": 52,
        "num_crossposts": 0,
        "selftext": " So Friday we saw the stock market down again as the dow fell almost 0,6% percent while the s&amp;p fell over 1% and the nasdaq was crushed being down almost 2and a half percent as This last week we saw the dow fell 6,5% the s&amp;p 5,6% and the nasdaq 5,5% as all 3 ended the month of october down more than 2,3%\n\nOne good thing for the US economy is that the retail stores sales has recovered and consumers are still spending excess cash especially with the holidays and black Friday up next. I believe that as much as Tuesday is important for the economy, the events that will come later in the week as the FED holds two important meatings and the latest jobs report comes in at the end of the week far outweight that\n\nAs you can see the New York Federal bank economic index is still rising, that sugests a V-Shaped recovery is continuing in the US. This index takes into consideration lots of important data from the economy.\n\nThe unemployment in the US has been decling but that rate has sharply slowed down in the last months as it’s still more than double the 3,5% at the start of the year as the latest number from September was almost 8% rate of unemployment.\n\nAs you can see the most affected people are still the middle and low wage under 60k/year. As the high wage jobs unemployment rate is barely down 0,5% since January.\n\nSo the fear in the stock market saw a huge pop in the last week as the VIX (the volatility index) rose from 27,55 more than 10 points to close at over 38 this last week. This next week is probably the last with such high volatility as the upcoming big events will pass and more certainty will be in front of us . The volatility was so high as we retested the June highs and have seen a pullback 3 times after hiting those levels.\n\nDespite strong earnings last week from all big tech companies (Alphabet,Amazon,Apple, facebook and Microsoft) the companies stocks dropped amid the broader stock market sell-off with the exception of Google which posted terrific numbers to crush analysts expectation.\n\nApple is down almost 19% since the highs of September and has lost 450 billion dollars in market cap since then.\n\nThis dropped in the company has been caused by a broader stock market sell off as well as missed iphone revenues. I do believe that iphone revenues will see a huge spike in the next coming quarters as apple customers as myself will finally upgrade from older iphone to this next generation iphone which is the first to have 5G technology as well as other great improvements in capability as well as camera.\n\nA couple analysts have recently changed they’re target to between 132-140 which is over 20$ from where it sit’s today. That is quite good upside for the company.\n\nAs you can see they are barely down 2,7% year over year in product revenue despite not having the new iphone launch included in this financials, and overall the company still saw a 1% increase in revenue due to the huge spike in services revenue that I believe will continue especially with the Apple One bundle just being launched at the end of last week. The Total Gross margin also increase slightly but I expect this to be just a small drawback in the short-term.\n\nAlso I believe that Amazon was dragged down because of the next quarter predictions of huge costs while they only forecasted a operating income of 1 to 4 point 5 billion dollars which is below what was anticipated despite amazon web services continuing to be the largest player in cloud spending. With a 32% share of total market and a revenue of 11,6 billion dollars which Is up 29% year over year, while Azure from Microsoft comes in second and google cloud in third. There is still a lot of room to grow for all of this companies as there is still over 37% of the market provided by other companies. Also this is a great company to own for the long term as digitazation and online commerce will continue to grow, some are estimating that by 2030 amazon could have annual revenues of 1 trillion dollars $ while using conservative projections of compound annual growth for e-commerce of 10%, for the cloud services of 15% and for ad revenue of 20%, amazon could hit that mark by then. But I believe this is possible even faster than that.\n\nFacebook is the one company that I will have to analyze more in this group. They will be hit with privacy issues do to the regulatory risk and Apple’s announced privacy changes. But I still do believe this to be a great company as they also own Instagram, and I really like how that part of the company is innovating and growing.\n\nWhile google seems to be back on track as the company was the laggard in the group. They have become less reliant on the search ad revenue as growth in Youtube ads and Google cloud will push the company to renewed growth in the future.\n\nAlibaba will see two big events this week as they will kick off the singles day event next week, extending the event with 3 more days rather than the usual 24-hour event, in which they will also double the products on offer. Also another big event will be the IPO of ant Group in which Alibaba will still have a big stake. I believe they are a great company the forward revenue growth estimates of 31% are higher than other tech companies like amazon, google and Microsoft while the P/E for the company is the most attractive of the group also.\n\nFord just announced that late next year they will introduce a lower priced competitor for Tesla AutoPilot and GM’s super cruise, this is great news for the company as they seem to be improving the company continuasly.\n\nSome important earnings coming this week are :\n\nPaypal on Monday, which I believe is the greatest fin-tech company, on\n\nWednesday Qualcomm will announce that will be a great insight to see what Apple’s iphone 12 is doing as Qualcomm is the biggest supplier for apple and on Thursday Alibaba (with ant group ipo) coming also on the same day this stock could see a surge in value.",
        "subreddit": "stocks",
        "title": "Stock market news, updates &amp; predictions , Should you Buy or Sell Now? [2-11-2020]",
        "url": "https://www.reddit.com/r/stocks/comments/jmo4jq/stock_market_news_updates_predictions_should_you/",
        "created": 1604355304.0
    },
    {
        "author": "ghostdrip_",
        "created_utc": 1606401458,
        "id": "k1g9me",
        "num_comments": 46,
        "num_crossposts": 0,
        "selftext": "Look fellow autists. If you’ve been sifting through the sea of weak gain porn and this Randy Marsh nut size of $PLTR posts for the next train - WSB has two upcoming meme stocks in the pipeline. Here’s the problem you motherfuckers don’t understand. The more we talk about it, the more algos and non-retards will pick up our scent. The goal is to retard strength a stock up, then have the big pockets scope out the movement and boost to the moon 🚀 It’s our job to start the party. \n\nHere are some personal invitations to some IPO rocket parties that will print harder than Daddy JPow needing to return an Amazon package. \n\n1. *oblox - This bad boy company is going to shit money for all of us if we can keep it quiet. Their IPO is gonna hit some time mid-December and if you know anything about this sub, we’re gonna be doing mountain of cocaine the second it hits Robinhood because that hype train will be stronger than you could ever imagine. No DD because fuck you. \n\n2. *ffrirm - Okay this is a legit company with some legit stats. You waiting for some options to print but still want to buy that $900 swing set to fuck hookers on? This company is that sexy “Buy Now, Pay Later” shit you’re seeing everytime you hit the checkout menu. Only pay $90/mo for 10 months and by that time you better have broken the swing. This company has Peloton, Paypal, and Shopify backing it. If you’ve been here long enough your dick should start tickling already. This is looking to moon so don’t miss the hype. \n\nWas this post well thought out? No. Do I care? No. Am I right? Check this in January and find out. \n\nTL;DR - Shut the fuck up about future meme stocks - read between the posts.",
        "subreddit": "wallstreetbets",
        "title": "PSA: Shut the fuck up about future meme stocks",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k1g9me/psa_shut_the_fuck_up_about_future_meme_stocks/",
        "created": 1606430258.0
    },
    {
        "author": "seanf999",
        "created_utc": 1605715666,
        "id": "jwihvm",
        "num_comments": 43,
        "num_crossposts": 0,
        "selftext": "I found €500 in my PayPal, I was going to buy a Canada Goose jacket but I think I’ll just ‘invest’.\n\nIt’s hardly enough to diversify, should I just stick it on PLTR?",
        "subreddit": "smallstreetbets",
        "title": "€500 to YOLO, PLTR?",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/jwihvm/500_to_yolo_pltr/",
        "created": 1605744466.0
    },
    {
        "author": "vegaseller",
        "created_utc": 1606341330,
        "id": "k11uq6",
        "num_comments": 43,
        "num_crossposts": 0,
        "selftext": "For those of you who enjoyed my post on why the WSB is moving markets, see below. \n\n[https://www.reddit.com/r/wallstreetbets/comments/k0ctkd/why\\_wsb\\_is\\_now\\_running\\_the\\_entire\\_equity\\_market/](https://www.reddit.com/r/wallstreetbets/comments/k0ctkd/why_wsb_is_now_running_the_entire_equity_market/)\n\nNow Let me tell you a story about Palantir and why it is so important. \n\nSee, back in 1998, there were two internet payments company who were trying to make it big, one run by Peter Thiel and one run by Elon Musk. They eventually merged and created paypal. You can see the two of them here in the same picture. \n\nhttps://preview.redd.it/3ie03xvwgg161.png?width=1100&amp;format=png&amp;auto=webp&amp;s=a9368996a40228d96dae30a8d14c9a7b22d446a8\n\nSo why is paypal important. Well the Paypal mafia is known for building basically the entire post dot-com tech landscape that you know today. Yelp, youtube, square, linkedin, tesla/space X. And who is Peter Thiel, well, he is basically the smartest venture capitalist in the world and very well known in Silicon Valley. He was the first outside investor in facebook, he backed Tesla and SpaceX. \n\nSo why does this matter? Well, Peter Thiel is one of the smartest men in the world. He was Chess grandmaster in his youth and he has a brilliant, contrarian mind. He foresaw the rise of SJW in the late 90s, this man either can predict the future or he is a time traveler. Either way, he is a savant. \n\nNow on to Palantir \n\nSo why does this matter for Palantir. Peter founded Palantir in 2003. That was 17 years ago. What was his plan? Well, I think his plan is to create the next IBM. So hear me out. Well, historically the development of internet technology swung between enterprise and consumer. Prior to 2000, nobody in Silicon valley knew anything about consumer internet, everyone was busy chasing HP contracts or trying grab a DOD tender. But it swung to consumer for the next 20 years. He is making a calculating bet that consumer is played out and the next swing will be in the form of enteprise/government sales. \n\nAnd who was the big boss of enterprise/gov sales. Well it was IBM. See IBM didn't giant in computing that dominated from 1940-1980s, it started off selling office tools like punch cards and typewritters. They didn't have the best technology, but they had a big rolodex of government and corporate clients. When the computing revolution came around in the 1950s, it wasn't the best technology that won, but the one with the customer distribution. \n\nThe same thing is happening with Palantir, they are doing manpower intensive work for governments and large corporates now, its not really a high margin scalable business (which is why wallstreet poo-hoos the stocks). But the thing is, they are positioned perfectly for the rise of AI. Much as the same way IBM was well positioned for the rise of computing. \n\nAnd that is why, PLTR will hit $500/share by 2030",
        "subreddit": "wallstreetbets",
        "title": "PLTR to $500/share - The Origin Story, Paypal Mafia",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k11uq6/pltr_to_500share_the_origin_story_paypal_mafia/",
        "created": 1606370130.0
    },
    {
        "author": "EmeldaMccaulley",
        "created_utc": 1606220974,
        "id": "k043vp",
        "num_comments": 43,
        "num_crossposts": 0,
        "selftext": "Thanksgiving is the time to give! Only people who have lost money this year are eligible! I'll be posting the winner at market open today announced on my twitter [twitter.com/plumpeo](https://twitter.com/plumpeo).",
        "subreddit": "wallstreetbets",
        "title": "Will PayPal someone $100 who is negative YTD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k043vp/will_paypal_someone_100_who_is_negative_ytd/",
        "created": 1606249774.0
    },
    {
        "author": "hootmoney0",
        "created_utc": 1605382557,
        "id": "ju7s4r",
        "num_comments": 42,
        "num_crossposts": 0,
        "selftext": "Retards,\n\nPapa Elon is a genius, 2021 is full proof of that as Tesla has sky rocketed. Elon is behind the innovation of PayPal, Tesla and Space X. EV and Fintech are clearly amazing investments and are the future of technology, everyone knows that. What people haven’t been talking about though is SPACE. \n\nSpace is going to be the next Robinhood bubble industry. What makes a retard hornier than an electric vehicle? Papa Elon sending you off into a giant gay dildo to space. \n\nTicker SRAC is taking the company Momentus public in January. Momentus has already made a deal with Space X to launch their space vehicles in December. Momentus is the “FedEx of space” delivering/transporting satellites for power hungry corporations. I believe that right now this company has potential to 10x your money trading at a $228m market cap. If Elon is really a genius of the future, space stocks are going to be the next big thing. Stock up u retarded aliens. \n\nYours Truly,\nPapaElonIsMyDad42069",
        "subreddit": "wallstreetbets",
        "title": "I AM BULLISH ON SRAC IN 2021 ($12.5 CALL 2/21)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ju7s4r/i_am_bullish_on_srac_in_2021_125_call_221/",
        "created": 1605411357.0
    },
    {
        "author": "Brothanogood",
        "created_utc": 1605311098,
        "id": "jtrewh",
        "num_comments": 41,
        "num_crossposts": 0,
        "selftext": "Visa stock has made investors more than 1,000% over the past decade -- peppy for an organization that dates back to the Eisenhower administration. But here comes a gaggle of app-based hopefuls eyeing not just the toll roads that make credit cards work, but also the $2 trillion in worldwide revenues collected for payments of all kinds.\n\nYou know about PayPal (ticker: PYPL) and maybe Square (SQ) and Venmo. How about Remitly, Stripe, Circle, and Bolt? There are dozens more with Seussian names. To skip out on a dinner check with under-30s, just mock the encryption protocol of their favorite fintech platform, and tell them you'll froop them ticklecoins.\n\nI spoke this past week with Visa (V) chief Al Kelly about the competitive landscape in payments. That's a sensitive subject now, because Visa is trying to buy a company called Plaid, which serves as a data go-between for banks and apps. For example, Venmo uses Plaid. This month, the Department of Justice sued to block the deal, alleging that it would deprive consumers of a potential alternative to Visa. Kelly calls the deal pro-consumer and says Visa will fight the suit vigorously. \"We feel very, very good about that,\" he says.\n\nVisa was spawned from the first true credit card -- the paper, $300-limit BankAmericard, launched in 1958. Bank of America kept the credit business but licensed the financial plumbing for cards to other banks. This eventually became Visa, and a rival system launched in 1966 became Mastercard (MC). Today, Visa links 70 million sellers with 3.5 billion account credentials issued by 13,000 banks. It collects fees per transaction for authorization, clearing, and settlement, and it sells add-on services for things like detecting fraud and increasing customer loyalty.\n\nThis year, I've come to view paying in cash and receiving change as the financial equivalent of shaking hands during a bilateral sneeze. Giving over a credit card for swiping, or sliding my own and pawing a number pad, is more like an elbow bump -- better, but do we really have to? Tap-to-pay is the norm in most of the world, but not the U.S. -- yet. Kelly says it will be common here soon. If past patterns from other markets repeat, tap-to-pay will bring a big jump in the percentage of U.S. transactions done with cards.\n\nCard adoption is already climbing -- to 82.1% of in-store transactions from 78.7% in January, according to industry researcher The NPD Group. But opportunities for spending have shriveled. So, during Visa's fiscal year ended in September, revenues decreased 5%, to $21.8 billion, and earnings per share fell 7%, to $5.04. Visa is larger than Mastercard and is particularly dominant in debit cards, but Mastercard has been growing faster, especially in Europe. Both have been smaller for years than China's UnionPay.\n\nAnalysts call these networks card rails, and the bank-controlled Automated Clearing House, or ACH, system for money transfers, bank rails. Many upstart players operate as digital wallets that depend in part on card or bank rails, or else use cryptocurrency. Kelly says the payments industry is filled with \"frenemies.\" For example, PayPal, the best-known digital wallet for online purchases, used to steer customers to cheaper ACH rather than Visa cards. Now, under a partnership, Visa gets equal footing with ACH, and PayPal makes inroads at stores using Visa's contactless mobile-payment technology.\n\nStocks in general trade at elevated valuations now, and growth stocks especially. Even so, Visa's price of 38 times this fiscal year's estimated earnings suggests that investors feel confident about its future role in payments, and its return to speedy growth. This fiscal year, earnings-per-share growth is pegged at just 9%, as the pandemic continues and then hopefully lifts. Early estimates for next year's growth put it at 24%. Beyond the tap-to-pay rollout and spending rebound, Visa is hoping to win over push transactions that use bank rails -- like tuition, rent, and wages. Banks will have a say, but they make good money on card businesses, and ACH is a nonprofit.\n\nChina is a wild card. Visa doesn't have a license to operate there domestically, so it partners with local players like AliPay to create new uses for travelers' Visa cards. But phase one of the trade deal between China and the Trump administration is supposed to open China to foreign payment companies like Visa. We'll see. For now, Kelly calls cash his biggest competitor. I'm Purelling just thinking about all that market share up for grabs.\n\nThe stock market is said to be driven by the battle between greed and fear. Right now, it looks more like hope and stupidity. The vaccine results announced this past week by Pfizer (PFE) are the best hope yet that the pandemic's end is in sight. That vaccine and perhaps others could receive emergency-use authorization within the next two months, and much of America could receive needle pokes in the first half of next year. Life could look normal by Thanksgiving 2021.\n\nBut the virus is raging like never before. We've turned simple advice -- keep a bit of distance or wear masks -- into a culture war. And Washington is distracted. That President Donald Trump is denying clear election results is folly. That an overwhelming majority of his party's senators won't speak up is dangerous. If it doesn't damage our democracy, it could kill us by the tens of thousands this winter from inaction on the virus. And it could cripple our economy again.\n\n\"Sell the vaccine,\" wrote Bank of America in an investment strategy note on Friday. It means to reduce holdings of risky assets ahead of what could be a difficult stretch before the economy reopens in earnest. Like Goldman Sachs, BofA is recommending a barbell strategy, with cyclicals on one side, but not distressed ones, and the sort of virus-immune tech stocks that have been flourishing all along on the other.\n\nI know; I dipped too far into politics there for a moment. Media bias, a few will say, and they're right. I don't endorse politicians or parties, but secretly, I'm in the tank for science and representative democracy.\n\n**Source: Barron's Article**",
        "subreddit": "stocks",
        "title": "Pandemic or Not, Visa Remains a Growth Stock Stalking Its Biggest Rival, Cash",
        "url": "https://www.reddit.com/r/stocks/comments/jtrewh/pandemic_or_not_visa_remains_a_growth_stock/",
        "created": 1605339898.0
    },
    {
        "author": "West_Tea",
        "created_utc": 1606528205,
        "id": "k2ej1z",
        "num_comments": 40,
        "num_crossposts": 0,
        "selftext": "To all the PLTR bears out there, this one's for you:\n\nYou're literally betting against the news based on speculation and confirmation bias that this is a \"dead stock\" or \"meme stock.\"\n\nPeter Thiel is a business-savvy venture capitalist and early investor in Facebook, SpaceX and Airbnb. He cofounded PayPal and led is as CEO.\n\nThe CIA has backed up Palantir.\n\nPalantir is scoring global government contracts by leaps and bounds lately. They're one of the hottest software companies right now. And they're a strong covid play.",
        "subreddit": "wallstreetbets",
        "title": "PLTR Fundamentals - Fact Check",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k2ej1z/pltr_fundamentals_fact_check/",
        "created": 1606557005.0
    },
    {
        "author": "runrun8",
        "created_utc": 1606421793,
        "id": "k1mirg",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "2 months ago I showed a meme cnn price target that $NIO was going to moon to at least $40 and yolo’d everything I had into $NIO and you guys laughed at me. Here’s my next play.\n\nI’m so out of touch with reality that I didn’t realize that today was thanksgiving. So I can’t buy Palantir shares this morning. Without Stonks to trade today I need something to get hard over.\n\nThen I realized that 🅱️itc⭕️in is traded 24/7. I thought 🅱️itc⭕️in was a fad after it crashed 90% a couple years ago. But after digging online, that crash was expected. 🅱️itc⭕️in follows a 4 year boom-bust cycle. This is basically guaranteed.\n\nIn 2013 it made a ~32x return run from $30 to $1153 before plummeting 85%\nIn 2017 it made a ~16x return run from that previous $1153 high to a new $20k high before plummeting 85%\n\nSee a pattern here? So according to history in 2021 it will make a ~8x return from $20k to $160k\n\nI’m not making these numbers up. Everyone knows this. Every hedge fund is snatching up 🅱️itc⭕️in. Your favorite companies are too (papa Elon’s PayPal bought 100% of newly mined 🅱️itc⭕️in supply).\n\nI know you guys don’t like buying normal stocks and shares so you guys don’t want to just buy a 🅱️itc⭕️in. Y’all want some 🅱️itc⭕️in options; too bad they don’t exist. Idk Go liquidate your 401k which is holding boomer SP500 funds and mutual funds and dump it all into 🅱️itc⭕️in.\n\nTLDR: buy 🅱️itc⭕️in at $16k rn for a bargain after its being sold off. $160k+ by 2021 or when this bull run ends.\n\nEdit: why the fuck are mods banning C Ry P T 0. How can you pump something like 🅱️itc⭕️in.",
        "subreddit": "wallstreetbets",
        "title": "10x return by end of 2021",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k1mirg/10x_return_by_end_of_2021/",
        "created": 1606450593.0
    },
    {
        "author": "aMereMortalxxx",
        "created_utc": 1604270917,
        "id": "jmbuff",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "Sup stonkF@GS its ya boy aMereMortal and I heard you all like eating crayons so I decided to actually use them to draw pretty (r3tard3d) lines on stock charts before you shove them in your nose and mouth. Yes stocks are random, but from time to fucking time they bounce off zones of supply and demand also known as support and resistance you fucks. I've stopped going full autismo lately and have been mixing up my calls with some theta shit and guess what now my trading account is almost back to break-even after being down 20 G's in April.\n\nHere are the moves for the week. Purple lines indicate a channel the stock trades in, blue lines are the same color as your balls and represent hard lines of support, aka where the dip buyers come in to steal your shares after you've panic sold them like a little bitch. Typically when a stock goes outside the purple lines it reverts back to the mean at some point. The further it goes outside the channel, the faster it \\*might\\* get back inside the channel. This is well represented in the first chart below.\n\n**DOCU**  \n\n\nDOCU is one of the top covid plays and with shutdowns and bullshit coming full force, I like this stock right here. Not only that, but if any of you morons ever move out of your mom's basement and sign important documents, you will notice many agencies actually use this service. DOCU has dropped 20 fucking percent in one week and is trading at the bottom of the channel which leads me to believe this is a buy at these levels.  \n\n\nhttps://preview.redd.it/1qj10cx1gpw51.png?width=1944&amp;format=png&amp;auto=webp&amp;s=a06a51695220687d1094b1012f803f0b4c928878\n\n**JD**\n\nNext up we have JD.com which is like the SHOPIFY for China, except its better than shopify. If you've been following China and their GDP numbers you will see that they are on track to have the fastest recovery from covid. I don't give a fuck if the numbers are fake and the recovery is fake, they will need to pump fake earnings across the board to make it seem like everything is going well anyways. This stock right here is trading directly in the center of my imaginary purple lines which mean stonks might go up or down, but with earnings right around the corner you can bet your pet hamster this thing will be trading in the $90's soon.\n\nhttps://preview.redd.it/m47w3qzwgpw51.png?width=1940&amp;format=png&amp;auto=webp&amp;s=edf0a9d1d6cd1f721290ed87fd6b4004bba6caf4\n\n**CRM**\n\nCRM, also known as Salesforce, is a monster of a stock. The company is having explosive growth, and it's not because of covid but because they have a high quality lead-generation product that almost every profitable business wants to use. We are trading at the very bottom of this channel and are almost back to the price of last earnings report. I like this setup because I see maybe a 10% downside, but I also see infinity upside. That's what I call a win-win situation.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/97mo9i4nhpw51.png?width=1946&amp;format=png&amp;auto=webp&amp;s=25d07e70e8343b1faf04b6955514881a6ed624c4\n\n**PYPL earnings YOLO**\n\nLastly, lets look at Paypal. This company has been scamming users for fee's since before you were even born... but guess what. If we look at Shopify's earnings report we will see that e-commerce is absolutely fucking booming. Right now there are only 2-3 payment methods that have a monopoly on online purchases. It's either your wife's boyfriend's credit card, stripe, or fucking paypal. Shopify sales booming, amazon sales booming, all around e-commerce is booming, and paypal will reap benefits until the growth begins to slow... we can thank this virus for breathing life into this shit-stronk. This ticker is also trading right at the bottom of the range due to this massive decline we just saw last week. Lots of buying opportunities came about, but too bad you all only had 15 cents left in your account.\n\nhttps://preview.redd.it/esw4h790ipw51.png?width=1942&amp;format=png&amp;auto=webp&amp;s=a996d52c0eb89604573f84ec936783e24bdc47b4\n\nThanks for listening to my TED talk. Don't worry I'll send my invoice to the mods.\n\n&amp;#x200B;\n\nTLDR;\n\nDOCU calls\n\nJD calls\n\nCRM calls\n\nPYPL calls",
        "subreddit": "wallstreetbets",
        "title": "I draw with crayons so you don't have to. This week's positions: DOCU, CRM, JD, &amp; PYPL earnings YOLO",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jmbuff/i_draw_with_crayons_so_you_dont_have_to_this/",
        "created": 1604299717.0
    },
    {
        "author": "Bearkr0",
        "created_utc": 1605906612,
        "id": "jxxl7t",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "I’m currently invested in PayPal but I’m considering whether or not square is a better option to invest in. Square probably has more room to grow but PayPal is the bigger company and probably more used. What do you guys think?",
        "subreddit": "stocks",
        "title": "Paypal vs Square Stock",
        "url": "https://www.reddit.com/r/stocks/comments/jxxl7t/paypal_vs_square_stock/",
        "created": 1605935412.0
    },
    {
        "author": "ajahec",
        "created_utc": 1605356768,
        "id": "ju16wr",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "Bought them 2 weeks ago because they showed up on my stock screener. Really nice chart that will secure at least 10% on Monday I’d say buy the dip on the 18th and then let that bitch run because it will go to at least $25.76 \n\nYou either take profit at $25.76 or you take the gamble and hope for $45.34 which has a 28.58% likelihood of happening once they are above $25.77 \n\nAfter you have taken profit come here and give me an award or PayPal me 3% of your profit because it’s mine \n\nYou are welcome \n\n\n\nDisclaimer: \nI am a high IQ, very handsome, smart and nice guy. This advice is 100% correct. numbers might differ by 0.01",
        "subreddit": "wallstreetbets",
        "title": "Virgin Galactic get in boys",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ju16wr/virgin_galactic_get_in_boys/",
        "created": 1605385568.0
    },
    {
        "author": "pebbGod",
        "created_utc": 1606322663,
        "id": "k0vlvp",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "I know most of you got excited because of “war against cash” and venmo rang in your ears a couple years ago, which is an incredible disruptive in payments. I know all your middle-class white suburban folk were getting on the train and you being a savvy investor thought this was an opportunity. It’s not. \n\nPYPL has dropped the ball in 2020. They have no clue how to brand their product which would be presumably pretty easily, but they’ve done it.\n\nSQ is king. I figured this out, funnily enough, when Dreezy released the song CashApp with Offset. Dorsey managed to hit the jackpot when it came to the underbanking issue and the culture just took off after that.\n\nSo don’t blame yourself that you didn’t see zoomer culture blindsiding you. You’re likely a millennial or god forbid a boomer. You shut your brain off to cultural shifts outside your white picket fence.\n\nI’m here to implore you to sell. PYPL is a SELL.",
        "subreddit": "stocks",
        "title": "PYPL bagholders, I implore you to sell",
        "url": "https://www.reddit.com/r/stocks/comments/k0vlvp/pypl_bagholders_i_implore_you_to_sell/",
        "created": 1606351463.0
    },
    {
        "author": "DrToothHealer",
        "created_utc": 1606189037,
        "id": "jzxcqn",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "Okay here is some high level stock information. Easy Stuff to understand, Google if you think I am lying. *\\[Insert Moon Emoji, Fire Emoji, Robinhood Screenshot of $1million loss\\]*\n\nStock Info:\n\n* The Company In Question: Luminar\n* Merging with: Gores Metropoulos **Ticker: GMHI**\n* Will formalize and pick their merger date on December 1st\n\n**Who is Peter Thiel that you care about?**\n\nCo-founder of Paypal, **Palantir Technologies** ***(you'll now buy in)*****,** First Investor of Faceboook,\n\n**Who cares about Peter Theil?**\n\nWe do. He is backing the Startup Luminar to go public in $3.4BILLION Merger\n\nOkay Next Stock Info:\n\nStock Info:\n\n* The Company In Question: XL Fleet\n* Merging with: Pivotal Investment **Ticker: PIC**\n* Will formalize and pick their merger date on December 1st\n\n**Who is XL Fleet Customer Base?**\n\n1. FedEx\n2. Cocoa- Cola\n3. Pepsico\n4. Verizon\n5. Harvard\n\nAs well as Goldman Sachs Group Inc reports 902.72% increase in ownership of PIC/ Pivotal Investment Corporation with 170,713 shares\n\nBy Merger date.... This stock could easily double.\n\nTLDR;\n\nInvest in **GMHI** and **PIC.**\n\nWhy? Idk.... you heard it here first.",
        "subreddit": "wallstreetbets",
        "title": "These next SPAC's are going to the moon! ( READ NOW )",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jzxcqn/these_next_spacs_are_going_to_the_moon_read_now/",
        "created": 1606217837.0
    },
    {
        "author": "Son0fTheSun333",
        "created_utc": 1606345072,
        "id": "k132ns",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "I was in Costco today just getting a few things and I ended up talking to some random guy. He first asked me, \"hey, why are you in that wheelchair?\" - I look pretty healthy despite being in one. So I told him I recently had prostate surgery done. They replaced my prostate and sphincter with some device that helps me go poop because the cancer got to it earlier this year. Thankfully after beating covid in the hospital they cleared a spot for me to have a surgery done before this \"second wave\" hit. Anyway, he probably thought I was autistic (I am) when we started talking about stocks and options. \n\nI've been super interested in options trading for a while but never really understood what it was. He broke it down for me in like ten minutes and told me to check out reddit.com/r/wallstreetbets. So I walked away to get a few more things and left Costco then came straight here. The guy understood my situation and said people would be willing to help me out.\n\nSo what I need help with is the starting money to trade these options. I need $15,000. My medical bills from the prostate surgery and cancer have bankrupted me completely but I've still been having to take my HIV/AIDS medication which, if you know, can be quite expensive. Not to mention the fact that I had a stroke induced seizure late last year. Generally I'm not in good health because I broke my back as a teenager and it caused me to have this painful needle-like sensation for fifteen years until a few years ago when I got rehab for it. The rehab strengthened my back and took care of the pain but they must have not been  good at their jobs because I tore my ACL in a soccer match just a few weeks later. \n\nBeing autistic with HIV/AIDS, a brand new technological sphincter/prostate, a fucked up back, a debilitating stroke AND Parkinson's is just really tough but I don't want to give up. When they diagnosed me with Down's Syndrome a few years I go I was about ready to give up but as you can see I'm still here. My heart is StIlL BeAtInG and I'm not about to call it quits on options trading even though I've called it quits on heroin speedballs mixed with Adderall just a couple months after my depression kicked in when the lockdowns began.\n\nSo if you're interested in being a part of my success story, DM me and I'll give you my PayPal or Venmo so I can make an inspiring story that people can and will share to /r/progresspics. Thanks! Have a blessed day. Stay safe!",
        "subreddit": "wallstreetbets",
        "title": "Someone told me y'all could help",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k132ns/someone_told_me_yall_could_help/",
        "created": 1606373872.0
    },
    {
        "author": "BlitzingBoi",
        "created_utc": 1604962307,
        "id": "jr8g3r",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": "I’ve decided to get rid of some of my stocks that have recovered well from the crash in March like $KO. I’ve also sold some other positions in some smaller cap oil companies. \nMy portfolio does not have any tech stocks and I realize that this is a mistake. \nI’ve done some good research the past few days and I’ve found my 3 candidates:\n1. $PYPL\nPayPal looks to be a good investment as they keep growing year over year, have an established active user base, and are introducing crypto to the Venmo app (proven to be profitable for SQ, and hoping for that growth to kick in here)\n2. $AMD\nAMD just came out with some computer chips that should be a better premium product than industry leader Intel. Intel is in a rough patch right now and AMD is making a big push for gaining market share. \n3. $NVDA\nJust an absolutely solid company. Still king in the graphics card game, (AMD on their heels though) their balance sheet is very similar to AMD but looks to just be a bit more polished. However I’m worried about if this has opportunity to grow (famous last words). \n\nWhich would you invest in? I have a few thousand in cash right now and I could spread in all 3, or only 2.",
        "subreddit": "stocks",
        "title": "Tech stocks",
        "url": "https://www.reddit.com/r/stocks/comments/jr8g3r/tech_stocks/",
        "created": 1604991107.0
    },
    {
        "author": "nikolabagholder",
        "created_utc": 1605908807,
        "id": "jxy90c",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "So I am thinking of getting into a position for trendy tendie. I really need yall helping, I am thinking of going SQ shares or grab a PYPL $300 call for march 2021. I read somewhere that some man named stockdaddy0 Took it and he never misses.   \nI obviously did my own DD because well, everyone misses. PYPL looks like a win in comparison to SQ . I am strongly considering taking a $300 call on PYPL come monday for the march 2021 expiration. What do yall like more , PYPLl or SQ? what are your thoughts WSBER!, I kinda suck and am looking for guidance.",
        "subreddit": "wallstreetbets",
        "title": "Trying to ride PYPL to Tendy town, help.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jxy90c/trying_to_ride_pypl_to_tendy_town_help/",
        "created": 1605937607.0
    },
    {
        "author": "HookEmNation",
        "created_utc": 1605499267,
        "id": "jv04o9",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "[me disabled (pic of losses)](https://imgur.com/gallery/kgjO8MA)\n\nDeposited nearly $4k back around my birthday (late February) and decided to go balls deep (like the shlong slinging slasher putting it to my girlfriend every night while I watch) on short calls, reassuring myself each time the market dropped that it was just bad luck and to buy more at a discount. This is how I first learned the patience of buy high, sell low.\n\nAbout one month ago I decided to try to start back up with $1k, thinking that things might be different this time. Amidst a fucked up country, a virus growing rapidly, and a war between Sleepy Joe &amp; Toupée Donny, I thought for sure the market was due for another great plummet. So I loaded up on puts and boy was I wrong again because the money printer was  primed and ready like my girlfriend taking said shlong that I mentioned earlier. BRRRR. I can honestly say that I’ve officially mastered the art of being short, buying high, and selling low.\n\nAfter scraping the last $165 out of my account, I decided to follow my true gay bear heart and soul 🌈🐻 and invest the last teenth in as far OTM puts on SPY 01/21 that I could.\n\nTL;DR: \nFuck Cannabis stonks that I can’t name (penny stocks), YETI, OPK, SPY, PYPL, ULTA, &amp; SHAK\n\nI will be back to post my $0.00 balance for all you fappers out there. Stay gay. I’m out .. for now. 🌈🖖🏻",
        "subreddit": "wallstreetbets",
        "title": "My mom always said I was bright and that’s why she called me son ☀️",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jv04o9/my_mom_always_said_i_was_bright_and_thats_why_she/",
        "created": 1605528067.0
    },
    {
        "author": "jstolfi",
        "created_utc": 1605857467,
        "id": "jxktcm",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "Bitcoin has recently attracted substantial investments from a couple of companies like MicroStrategy (420 million USD) and Square (50 million), as well as a few large individual investors like Tim Draper (500 million), Paul Tudor Jones, and Ricardo Salinas (unnown amounts).  Some companies like Greyscale, PayPal, and Fidelity, while not investing in Bitcoin itself, have created services and derivative products that aim to obtain revenue from Bitcoin investors.  \n\nThese large players have justified their choice with the claim that Bitcoin is a good hedge investment because its market price is uncorrelated with the real economy or with the price of other traditional hedges, such as gold, real estate, or T-bonds; and its value is somehow likely to increase, even while those assets lose their because of the pandemic.  \n\nThis claim has some rational justification, since Bitcoin's does not have any significant interaction with the real economy or a \"fundamental\" value derived from expected dividends, and is therefore not affected by business closures, unemployment, or a possible hyper-devaluation of the dollar.\n\nYet Bitcoin was not designed to be an investment instrument, much less a hedge against general economic crisis.  Its future is threatened by several structural flaws, such as its huge energy consumption (6 gigawatts, like that of the entire Detroit metropolitan area) and its association with criminal activities.  \n\nThus I call the attention of the readers of this subreddit to [SuCoAsMa](https://www.ic.unicamp.br/~stolfi/bitcoin/sucoasma/prospectus.pdf), a new alternative hedge asset that was designed from the ground up to for that very purpose.  It adopts the key features of Bitcoin's business model, that fully insulates it from the vagaries of the real economy, while eliminating its fatal flaws.   \n\nIt is possible that some old school financial experts who actually bother to read its Prospectus may not be favorably impressed.  However, as explained in that document, this new asset  has even better revenue potential for brokers and marketplace operators, if properly exploited.  As shown by the success of Fidelity's Bitcoin-based Digital Investments  subsidiary, even a manure-class investment instrument can become a gold mine if wrapped into a derivative product or service with a highly respected and prestigious brand in its name.",
        "subreddit": "investing",
        "title": "SuCoAsMa - the perfect hedge investment?",
        "url": "https://www.reddit.com/r/investing/comments/jxktcm/sucoasma_the_perfect_hedge_investment/",
        "created": 1605886267.0
    },
    {
        "author": "NightcoreRo",
        "created_utc": 1605649932,
        "id": "jw2f75",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "So PLTR has the GOV support and contracts, Musk is old time Bros with Thiel, co founded PayPal, Thiel is Board Member of Facebook as well and is a stable company in the USA.\n\nTell me why so many gay bears?",
        "subreddit": "wallstreetbets",
        "title": "Musk and Thiel bros",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jw2f75/musk_and_thiel_bros/",
        "created": 1605678732.0
    },
    {
        "author": "Ordinary_investor",
        "created_utc": 1605991558,
        "id": "jyi8gd",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "**People have sent me few privates asking for references/proof:**\n\n**Here is CLASS ACTION COMPLAINT by United States district court Southern district of New York, which goes into much detail about the topic:**\n\n[https://www.courthousenews.com/wp-content/uploads/2020/01/Bitcoin.pdf](https://www.courthousenews.com/wp-content/uploads/2020/01/Bitcoin.pdf)\n\nHi community!\n\nThose who do not know, before the Madoff ponzi collapsed, B. Madoff was chairman of Nasdaq and very well respected among the circles. Few years later, Securities Investor Protection Corporation (SIPC) trustee estimated actual losses to investors of $18 billion. It is reason why i am posting this as hopefully i will save few people from losing their money in the coming years by investing into cryptocurrencies.\n\nI will keep it short and simple and not go much into technical details, but i assure you anyone willing to google, there is plenty of detailed proof and research into the topic.\n\nBitcoin price has increased through this year **mainly** only because the fact that there is a mechanism in which dollar \"equivalent\", called tether, which is almost entirely unpacked by fiat (unofficial claim by tether treasury is, that they are packed by dollar equivalent, which in this case means bitcoin itself, which is ridiculous in itself), is being used to prop up the price of bitcoin by buying it off all the major exchanges, such as Binance, Huobi, Coinbase, Kraken etc. There is hardly any real retail interest and all the major counter points, used by the crypto community (such as insitutional demand, billionaires buying before you, Paypal, Square, Micro etc) is all smoke and mirrors, in hopes that retail will come and buy into the ponzi pyramid.\n\nWhy i mentioned Madoff, is because just few days back, total tether in circulation also crossed the SIPC mentioned $18B, currently already at $18.4B. This year alone so called Tether Treasury has issued &gt;14B new tethers, claiming exponential increase in demand. As a comparison, at the peak of the 2017 crypto mania, there were only total of 1.4B printed through whole year. And tether is only one of the quite a few noteworthy other stablecoins, which i wont go into currently, but they also feed into the loop/system, of proping up the price. Simple example being DEFI, where Ethereum is being used as an collateral, for person to take out a loan in so called stable coins, which then on majority of cases, is used again to purchase even more ethereum. In Laymans terms, being used as a simple leverage multiplier tool with interest payment. But is defined by community, as somewhat of a groundbreaking new invention. Which i agree, it somewhat would be, if used for the real world purposes, not as a simple leverage tool.\n\nHere is a chart i put together, which should make it rather obvious for anyone taking a quick look.\n\nIt includes last 4 years of bitcoin price, tether printing and retail interest on one chart:\n\n[**https://imgur.com/i78BTXg**](https://imgur.com/i78BTXg)\n\nI will also leave you with a comic strip, that i had made, which describes the last 4 years of Bitcoin (and cryptocurrency asset class) tether addiction:\n\n[**https://imgur.com/fPDm2VX**](https://imgur.com/fPDm2VX)\n\nPS *I just want to add, that in my opinion, main issue with bitcoin and all of cryptocurrency space is more precisely what it has become, a big ponzi pyramid. On top of that, tether treasury (and those involved) has completely taken over the space and what they are doing, will eventually leave many people financially ruined (because they do not any better or know, but still are willing to risk) and unfortunately them probably much more rich.*\n\n*I must add, that i would be significantly more acceptable with this global huge economy project/test, if it would lead its way in natural course, without middleman mafia, which currently, in Laymans terms, pumps the price with nothing but air, to eventually sell to a greater fool. If it would naturally succeed, as in new age gold 2.0, more gradually, actually being implemented into payment/financial systems etc, actually represent the alternative to government money, money for people, i would be alot more comfortable to let it run its course and see if it perhaps succeeds.*\n\n*Bitcoin has lost all of what it was supposed to represent and where it was supposed to develop as a technology. There are many reasons why it has gone as such, it is not really topic to discuss here.*",
        "subreddit": "stocks",
        "title": "Bernie Madoff and bitcoin",
        "url": "https://www.reddit.com/r/stocks/comments/jyi8gd/bernie_madoff_and_bitcoin/",
        "created": 1606020358.0
    },
    {
        "author": "AtrumCanis",
        "created_utc": 1605812002,
        "id": "jx8pq4",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "Ebay has been working on a new payment system so they are no longer dependent on PayPal and take the payment cut for themselves. However like everything else Ebay touches they it seems their going to bungle this up as well.   \n\n\nThe new method is called Managed Payments\n\nSellers enrolled in managed payments are not allowed to list the following items:\n\n* Adult only items, including movies, video games, and photographs\n* Auction services\n* Bullion\n* Coins &amp; paper money (only Exonumia, and Publications &amp; Supplies are allowed)\n* Gift cards &amp; coupons\n* Lodging, timeshares, vacation packages, and car rentals\n* Memberships for campground and RV parks\n* Motor vehicles\n* Tickets for travel, events, or experiences\n* Wine  \n\n\nThis is set to roll out in 2021 and unless something changes Ebay is essentially banning the above categories on their site. I know their is a good volume of Bullion and Coins that move through the site not to mention Motor vehicles is an easy revenue stream for them.   \n\n\nI also question what \"Adult only\" video games will be. Any videogame rated M from now on will be banned on Ebay? Got an Xbox Series X bundled with Halo or Call of Duty, oh no we can't have that on our site.   \n\n\nI just came across this by chance but it seems a lot of seller are pretty upset by this and are being forced to find different platforms.",
        "subreddit": "wallstreetbets",
        "title": "Ebay Hates Making Money",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jx8pq4/ebay_hates_making_money/",
        "created": 1605840802.0
    },
    {
        "author": "CorruptStardust",
        "created_utc": 1604231492,
        "id": "jm10nf",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "Hello,\n\nCurrently my portfolio is almost -6%. I hold shares in MSFT, AAPL, TSLA, PYPL &amp; SBUX. \nMy main concerns are AAPL (-8%) &amp; MSFT (-5%). Would it be wise to cut my losses and sell on Monday, then re-buy back in when it dips further? All of my capital is tied up so I have nothing available to buy these dips, feel like I’m missing out big time.\n\nThanks!",
        "subreddit": "StockMarket",
        "title": "Advice please",
        "url": "https://www.reddit.com/r/StockMarket/comments/jm10nf/advice_please/",
        "created": 1604260292.0
    },
    {
        "author": "shrimpgangsta",
        "created_utc": 1605585001,
        "id": "jvm0ba",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "Palantir reported sales rose 25% in 2019 to $742.6 million, with a net loss that narrowed slightly from $580 million to $579.6 million.\n\nThe company revealed that in its 17-year history, it has NEVER been PROFITABLE and might never be, saying, “We expect our operating expenses to increase, and we may not become profitable in the future.”\n\nPalantir, which is named after a magical orb in The Lord of the Rings (LOTR) that lets people see across vast distances, was cofounded in 2003 by PayPal founder Peter Thiel, president and secretary Stephen Cohen and Alexander Karp.\n\nTLDR : PLTR = LOTR = profit",
        "subreddit": "wallstreetbets",
        "title": "A note on Palantir (PLTR)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jvm0ba/a_note_on_palantir_pltr/",
        "created": 1605613801.0
    },
    {
        "author": "JoylessDeer",
        "created_utc": 1605718567,
        "id": "jwjf0f",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "Thoughts on AAL, ERJ, TWTR, NIO, PLTR, NOK, GOLD, SLV, PYPL, PFE, JBLU, NIU, KNDI, AX, VTRS?\n\nThis is all the stocks I'm invested in right now what do you think about one or all of the stocks please tell I would love to know I'm a beginner so I would like to hear from people who are above my level.",
        "subreddit": "stocks",
        "title": "Thoughts on AAL, ERJ, TWTR, NIO, PLTR, NOK, GOLD, SLV, PYPL, PFE, JBLU, NIU, KNDI, AX, VTRS?",
        "url": "https://www.reddit.com/r/stocks/comments/jwjf0f/thoughts_on_aal_erj_twtr_nio_pltr_nok_gold_slv/",
        "created": 1605747367.0
    },
    {
        "author": "ChocolateTsar",
        "created_utc": 1605762245,
        "id": "jwwjvc",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "&gt;KEY POINTS\n\n&gt;- Affirm filed with the Securities and Exchange Commission to list on the Nasdaq under the ticker symbol “AFRM.”\n\n&gt;- The installment loan and payments company, led by PayPal alumni Max Levchin, saw 98% revenue growth year over year, according to documents filed with the SEC Wednesday.\n\n&gt;- Net losses dropped fell by roughly half to $15.3 million in the three months ending September 30th.\n\n&gt;The eight-year-old company brought in roughly $510 million in revenue for the fiscal year ended on June 30 -- a 93% jump from last year, according to the filing. In the three months ending Sept. 30, revenue grew 98% year over year, while net losses fell by roughly half to $15.3 million.\n\n&gt;Even if they don’t charge interest, Affirm earns a fee when they help a merchant make a sale. On the consumer side, they earn interest income on loans they buy from bank partners. Affirm also earns interest on some consumer loans. The rate they charge varies by consumers’ creditworthiness, but often starts at 0%.\n\n&gt;Affirm said gross merchandise volume -- a key metric in the payments industry -- grew by 77% year over year. It has more than 6.5 million customers. Roughly 64% of loans on Affirm this year were taken out by repeat consumers.\n\n&gt;The company plans to offer two classes of stock, an increasingly common practice among Silicon Valley start-ups. Class A will have one vote, while Class B common stock will have 15 votes. Max Levchin, the founder, chairman and chief executive officer, will have voting control of the company.\n\n[CNBC](https://www.cnbc.com/2020/11/18/affirm-s1-ipo-filing.html), [IPO prospectus](https://www.sec.gov/Archives/edgar/data/1820953/000110465920126927/tm2026663-4_s1.htm)",
        "subreddit": "investing",
        "title": "Payment company Affirm files to go public with revenues doubling year-over-year",
        "url": "https://www.reddit.com/r/investing/comments/jwwjvc/payment_company_affirm_files_to_go_public_with/",
        "created": 1605791045.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1604351118,
        "id": "jmw6mo",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Monday, November 2, 2020**\n\nStocks opened today’s session higher before paring some gains ahead of an extremely busy week, with market participants closely monitoring the results of the US presidential election, a meeting of the Federal Reserve, and the October jobs report, and rising coronavirus numbers in the US and Europe.\n\nAfter an extremely choppy day, the Nasdaq (QQQ) finished 0.22% up, the S&amp;P 500 (SPY) finished 1.11% up, and the Dow Jones (DIA) performed the best, finishing 1.56% up.\n\nOn Tuesday is the US presidential election between incumbent Donald Trump and Democrat Joe Biden. Needless to say, given the political divide, the coronavirus pandemic, and social unrest that exists in the United States right now, the outcome of this election will be extremely significant. According to a study done by Edward Jones, since 1932, the stock market has dipped 64% percent of the time the day after a presidential election. This likely reflects anxiety about the future if a large cohort of the population is unhappy with the election result. Regardless of the election result,  it's likely a large section of the population will be unhappy. Moreover, given the surge of early and mail-in ballots due to the pandemic, the possibility exists that the outcome may not be clear after Tuesday. This scenario would certainly cause a massive spike in volatility and uncertainty in the markets. According to the US Elections Project at the University of Florida, as of Friday of last week, around 85 million individuals have cast their ballots, over half of the total turnout in 2016. If this pace picks up, this election could have the highest voter participation rate in over 100 years.\n\nRegardless of the outcome, the election will have a number of consequences for Corporate America. For example, a change in the political control in either the Senate or the White House (which are Republican-controlled right now) could potentially alter corporate tax rates, increase or decrease regulation in some industries, affect trade relations with other countries, and changes in capital gains tax, which is important for market participants. Moreover, the outcome of the election will likely influence the timing and size of much-needed additional fiscal stimulus \n\nThe Federal Open Market Committee (FOMC) is set to hold the first of its two-day rate-setting meeting the day after Election Day, with the twelve FOMC meeting Wednesday and monetary policy statement and press conference from Federal Reserve Chair Jerome Powell on Thursday. Going off previous meetings, the Fed is virtually guaranteed to keep interest rates, near zero. After their last meeting in September, the Fed signaled that it would maintain interest rates are current levels until “at least 2023”. Throughout these meetings, FOMC members, including Powell, have increasingly escalated their calls for further fiscal stimulus to complement the Fed’s monetary support. In early October, Powell said, “too little support would lead to a weak recovery, creating unnecessary hardships for households and businesses.”\n\nOn Friday, the Department of Labor is set to release the October job report, a crucial piece of data to understand the state of the labor market and gauge the pace of recovery. According to Bloomberg consensus data, non-farm payrolls are expected to increase by around 600,000. While this estimate would the sixth month of net payroll gains, it would also be the four, straight month of deceleration, indicating the pace of recovery is slowing. The unemployment rate is also predicted to tick lower, from 7.9% to 7.6%. However, worryingly, there appears to be a trend towards long-term unemployment for many Americans. The number of individuals filing continuing claims, people filing for unemployment benefits who have already filed an initial claim, has continued to increase the past several weeks. This means that people who lost their job due to the pandemic are having an increasing harder time finding new employment quickly.\n\nThe US just set a new record for the highest seven-day average of daily new cases: 81,336 as of Sunday. That's the first time the number has ever topped 80,000, according to data from Johns Hopkins University. new cases are far exceeding new testing. Over the past week, new cases have increased 18%, according to Johns Hopkins. But the number of new tests performed has increased only 4.29%, according to the Covid Tracking Project. \n\nLast week, Europe recorded around 1.5 million new cases of coronavirus, a new record, according to data from Johns Hopkins. Trends are worrying across the continent now, including in countries such as Greece and the Czech Republic, where infection rates had been low until recently. Measures are tightening up everywhere. England, in response to the surge, announced a nationwide lockdown for at least the next four weeks.\n\n**Highlights**\n\n* Apple (AAPL) announced on Monday an event for Nov. 10 where it’s expected to announce new Macs that are powered by their own chips powered by ARM processors, instead of the Intel chips it had been using. Could impact Nvidia (NVDA) stock, which owns ARM chips, and Intel, who has not been doing very well lately, judging from last earnings report and stock price action (INTC).\n* Images for the updated Tesla Cybertruck could come next Musk, according to CEO Elon Musk.\n* Chinese electric vehicle maker NIO announced its October deliveries, and the number has shares on the move, again. NIO delivered 5,055 vehicles in October, doubling from a year ago. The result is doubly impressive because NIO very recently raised its manufacturing capacity to 5,000 vehicles a month. The company is selling all the cars it can make. This stock is an absolute monster and is one we love at PsychoTrader!\n* Alibaba (BABA), is doubling its Singles’ Day offerings this year, running the massive online sales event across two periods rather than one. Alibaba says it expanded the shopping window for Singles’ Day to provide more relief for merchants that have been hit hard by the pandemic. Single’s day is a counter to Valentine’s Day that celebrates being single. Normally it’s held on Nov 11. This is the world’s largest shopping festival. According to Fortune Magazine, BABA shipped $38.4 billion in gross merchandise value on Singles’ Day last year. Amazon’s Prime Day, by comparison, sold around $6 billion in goods last year.\n* Asian shares were mostly higher on Monday buoyed by further signs of recovery in China's manufacturing sector. The Caixin manufacturing PMI, a major indicator for China's manufacturing sector, rose in October, showing that domestic demand is holding up, reports said over the weekend.\n* Allegiant Travel (ALGT) upgraded by Morgan Stanley (MS) to $175 OVERWEIGHT. Stock currently around $131\n* Alibaba (BABA) target raised by Keycorp from $330 to $350 OVERWEIGHT. Stock currently around $310\n* ChampionX (CHX) target raised by Barclays from $16 to $19 OUTPERFORM. Notable because stock currently around $9\n* Carvana (CVNA) target raised by Morgan Stanley (MS) from $215 to $225. Stock currently around $190.\n* Floor &amp; Decor (FND) target raised by Raymond James from $75 to $100. Stock currently around $75.\n* Alphabet (GOOG, $GOOGL) target rasied by Argus from $1620 to $1850 at BUY. Stock currently around $1650.\n* Cloudfare (NET) target raised by two notable institutions. Stock currently around $53.\n   * Royal Bank of Canada frm $50 to $55 OUTPERFROM \n   * Oppenheimer from $55 to $65 OUTPERFORM \n* Peleton (PTON) target raised by Needham from $110 to $125 at BUY. Stock currently around $115. \n* Paypal (PYPL) target raised by Morgan Stanley (MS) from $210 to $229 at OUTPERFORM. Stock currently around $192.\n* Solaredge (SEDG) with massive target increase by Roth Capital from $191 to $300 at BUY. Stock currently around $266.\n* Vipshop (VIPS) target raised by Keycorp from $22 to $24 at OUTPERFORM. Stock currently around $21. This is one we have been looking at for a while\n\n\"Strive not to be a success, but rather to be of value.\" –Albert Einstein",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Monday, November 2, 2020. Please enjoy!",
        "url": "https://www.reddit.com/r/stocks/comments/jmw6mo/here_is_a_market_recap_for_today_monday_november/",
        "created": 1604379918.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1606431408,
        "id": "k1pbij",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "**In this post I am going to share my experience as I start a new portfolio from 0$ and keep adding funds to it every month as I try to grow it as fast as possible**\n\nHey everyone Happy Thanksgiving and Welcome! So, I have deposited and invested in the stock market all the money I managed to save up in the last month as I deposited 3500$ in my eToro portfolio on the 12th of November and I am already up more than 7% in just two weeks. \n\nAs my portfolio has constantly outperform the big 3 indexes the Nasdaq100, the SP500 and the Dow Jones 30 almost every day since starting my portfolio. Here is a comparison of my portfolio vs the indexes since starting as I am up over 7%. [Portfolio v Index](https://ibb.co/pRnQLQf)\n\nSo i wondered? Is it really bad to own more stocks? Is less &gt; more? What is your opinion on this subject? I believe that it is way better to be invested in more companies and to add and grow your position in time as you also see how the companies evolve and you can also do some price averaging.\n\nSo here is my current portfolio composition as I split all my money equally to start, I will go into very few little details about everyone so I don’t make this a 2 hour read time.\n\nI will start now by going alphabetically and not in the most important order as the first company that I own is BYD which is a rival company for both Tesla and NIO in the EV market as they focus on cars, new energy solutions and electronics. They are also developing a lot of commercial EV like buses, coaches and taxis which will be a great addressable market for them as they are not rivaled in those segments at the moment. The company has gone up a lot in value this year as you can see in this graph and have a Forward P/E of more than 100 but I believe this company will greatly expand its sales and be one of the leaders in the segment especially in China which is the biggest EV market. [https://ibb.co/gVVwpfR](https://ibb.co/gVVwpfR) / [https://ibb.co/z7YBGr9](https://ibb.co/z7YBGr9)\n\nThe second holding is Apple, is there anybody that doesn’t know this company? They are the biggest company in the world and they continue to expand with new products and services every day, I don’t see this company going down in the short term or the long term as they have pretty expensive at a 35 P/E but earnings are still rising especially with more subscription based income coming in with the release of the Apple One Bundle. [https://ibb.co/Tm3hWMZ](https://ibb.co/Tm3hWMZ) / [https://ibb.co/Q9YjJTx](https://ibb.co/Q9YjJTx) / [https://ibb.co/BrzkHCY](https://ibb.co/BrzkHCY)\n\nAbbVie is a health company that produces a lot of great drugs and has more than 26 million patients in over 200 countries that are treated every year. They are one of the best companies in the sector and are still down about 25% from the all time highs while only trading at a forward P/E of 8 which is very low. [https://ibb.co/9nn4z0q](https://ibb.co/9nn4z0q) / [https://ibb.co/mXh3JL5](https://ibb.co/mXh3JL5) / [https://ibb.co/cwhJgB5](https://ibb.co/cwhJgB5)\n\nAMD is a well established companies that creates high performance GPU’s for both personal computer and for data centers, the company has turned around and have started a great path to success since the newest CEO took the job in 2014 as the stock was trading at 2$ and while the company is trading at a very high forward P/E they have a lot of room to grow in this new economy as the EPS is expected to increase by more than 40% quarter over quarter [https://ibb.co/dpwYPcy](https://ibb.co/dpwYPcy) / [https://ibb.co/7vwWHtC](https://ibb.co/7vwWHtC) / [https://ibb.co/yF0RmQv](https://ibb.co/yF0RmQv)\n\nAmazon is the internet retail juggernaut and cloud servicing company that has also started to expand in more and more domains like pharmacy just last week, though the company is also trading at a very high PE they have a lot of room to grow internationally and also are expanding in a lot more domains at a very fast rate. [https://ibb.co/4TnGhkt](https://ibb.co/4TnGhkt) / [https://ibb.co/c6W2Ypx](https://ibb.co/c6W2Ypx)\n\nAphria is a Canadian company that mainly grows cannabis for medical use but has recently acquired a beverage company and is look to expand its product line, especially with the legalizing of marijuana more and more obvious in the US. They are one of the companies that stands to benefit the most from this as they are also expected to be the first to reach profitability by next year compared to Aurrora Canabis and Cannopy Growth. [https://ibb.co/KrfL267](https://ibb.co/KrfL267) / [https://ibb.co/kJ8yxDR](https://ibb.co/kJ8yxDR)\n\nBroadcom is one of the biggest American semiconductor solutions provider, they are a very good play for the sector as they only trade at a forwarde P/E of 17 which is very good compared to comptetitors. [https://ibb.co/8KFmX88](https://ibb.co/8KFmX88) / [https://ibb.co/q18SzPb](https://ibb.co/q18SzPb)\n\nEveryone also knows Boeing as they are one of the biggest commercial manufacturers of jetliners, defence, space and security systems. The have suffered a lot in the last 2 years after the 737 accidents and the recent stay-at-home economy, but the ban on the plain has been lifted in the US and will be followed by the European Union soon, they have a big backlog of planes to work through while this situation will improve and air travel returns slowly in the next years. [https://ibb.co/JxZYZ6D](https://ibb.co/JxZYZ6D) / [https://ibb.co/NVbhDLQ](https://ibb.co/NVbhDLQ)\n\nAlibaba is a online e-commerce giant that has expanded into cloud computing services also and stands to benefit a lot from the stay-at-home economy while also having just a forward PE of 32 which is very low compared to Amazon as they are the Chinese version of them. The company also owns Ant Group which is one of the largest fin tech companies in the world and will likely gain a lot after they finally manage to go public. [https://ibb.co/0JPN6DN](https://ibb.co/0JPN6DN) / [https://ibb.co/6NgjGNV](https://ibb.co/6NgjGNV) / \n\nBerkshire is the child company of Warren Buffet as they are a holding company that engages in diversified business like technology, banks, insurance and much more. The company is currently trading at a very low P/E an barely above the price/book value as even the founders of the company believe this as they have continued to buy back shares of the company in the last year at the fastest rate in company history. [https://ibb.co/bP6VjpM](https://ibb.co/bP6VjpM) / [https://ibb.co/hf5hX39](https://ibb.co/hf5hX39)\n\nCaterpillar is one of best companies in manufacturing, construction and mining equipment. They are trading at almost 3 time sales with a high P/E but this is likely to regain momentum with the China trade war relaxing with the new Biden administration as well as the reopening of the economy [https://ibb.co/pnC17PM](https://ibb.co/pnC17PM) / [https://ibb.co/2vsQSjt](https://ibb.co/2vsQSjt)\n\nChipotle Mexican is one of the best companies right now in the fast food business as they continue to innovate and have just opened they’re first digital only store. The company is trading at a very high P/E but has substantial growth potential so I believe it will be a great buy for the future. [https://ibb.co/GCqd3Y9](https://ibb.co/GCqd3Y9) / [https://ibb.co/JnBm3bx](https://ibb.co/JnBm3bx)\n\nCostco is one of the world biggest retailers that has a great business model as they are making most of they’re money through membership fees unlike other retailers that mostly rely on prices, the are trading at just 1 times sales which is very good and they have a lot of room to grow especially with improve China relationships. [https://ibb.co/X4M76Vd](https://ibb.co/X4M76Vd) / [https://ibb.co/ypg3Gyc](https://ibb.co/ypg3Gyc)\n\nCrowdstrike is a cyber security company that has seen a huge spike due to the transition to more and more digital presence for all the companies. They are a company that I believe is here to stay and just started to become profitable in the last quarter. [https://ibb.co/zNbfhL9](https://ibb.co/zNbfhL9) / [https://ibb.co/mBw2TKj](https://ibb.co/mBw2TKj)\n\nCarvana is one of the best players for the second hand car market as they operate a unique e-commerce platform for people to buy, sell or finance cars. They are one of my favorite companies as they are also just starting to make money as they continue to expand they’re presence. [https://ibb.co/QPZ1wnt](https://ibb.co/QPZ1wnt) /  [https://ibb.co/0rS6LrQ](https://ibb.co/0rS6LrQ)\n\nCVS is a health and pharmacy companies that owns the most pharma stores in the US, the company has been hit recently by the news that Amazon is getting into pharmacy delivery but I believe they will be a great play for the vaccine distribution play as the company is only trading at a forward P/E of 8 and is trading below value of sales while also offering a dividend of 2% [https://ibb.co/KNH6v5G](https://ibb.co/KNH6v5G) / [https://ibb.co/8Ps3QRB](https://ibb.co/8Ps3QRB)\n\nDelta is one of the major airlines in the US and as I wanted to be exposed to some recovery plays I choose this company as I believe air travel will come back in the next years. The financials are not great for the company but they did manage to cut the cash burn rate in the last quarter. [https://ibb.co/gyrSYYb](https://ibb.co/gyrSYYb) / [https://ibb.co/KsNbFHg](https://ibb.co/KsNbFHg)\n\nDeere is another great industrial and manufacturing play for the recovery stocks. The company is trading at a pretty high P/E ratio for them as the stock has runed very high in the last months but they do offer a dividend of 1% which is much better than any bank savings account and also have the potential for growth and also are a pretty reliable way to diversify portfolios. [https://ibb.co/NSsCGN1](https://ibb.co/NSsCGN1) / [https://ibb.co/thrY6W2](https://ibb.co/thrY6W2)\n\nDisney is a very diversified family friend entertainment and media company as they have a lot of great business that will benefit a lot from the re-opening while this contributed a lot to the huge expansion of the streaming business with Disney+ and Hulu so the financials are not great but I believe this will hugely improve in the next couple of years. [https://ibb.co/BG0jctn](https://ibb.co/BG0jctn) / [https://ibb.co/7GR9h3c](https://ibb.co/7GR9h3c)\n\nDraftkings is an American daily fantasy sport operator that has expanded into the huge market of online gambling as more and more us states are legalizing gambling so they have a lot of room to grow in front of them especially with a great online presence with financials not being very important at the moment as they continue to grow they’re presence [https://ibb.co/k8dtJmM](https://ibb.co/k8dtJmM) / [https://ibb.co/HgGQvG2](https://ibb.co/HgGQvG2) \n\nDominos Pizza is one of the biggest pizza companies in the world and are also one of the best in implementing they’re presence in the delivery services as they are way better at this than others companies like Papa John’s. [https://ibb.co/NZXkQjg](https://ibb.co/NZXkQjg) / [https://ibb.co/FVGXXBY](https://ibb.co/FVGXXBY)\n\nEtsy is a e-commerce platform for creative goods and services and has seen a huge rise in popularity and will probably remain a big gainer from this past year, though they are trading at over 70times earnings this will likely improve very much in the next years as they are expected to expand and improve earnings substantaly. [https://ibb.co/5MN9zb7](https://ibb.co/5MN9zb7) / [https://ibb.co/PYz0NWK](https://ibb.co/PYz0NWK)\n\nFord is one of the biggest car makers in the world, I really like this company as it having a big push to move to the EV world with the Mustang Mach E, the EV Transit and the hugely anticipated EV F-150, the company is expected to have huge improvements in the next year as they have decent financials and are one of the best companies to own for a dividend investing strategy. [https://ibb.co/MhwMB47](https://ibb.co/MhwMB47) / [https://ibb.co/745w8vq](https://ibb.co/745w8vq)\n\nFacebook is the largest social media network in the world that also owns Instagram, they have been struggling in the last months due to the political environment but I believe they will continue to be a giant in the tech sector as they are finding new ways to improve revenue streams especially in the highly active Instagram platform as they are trading at pretty much the same P/E like the other big tech companies but are expected to see a growth in advertising money as companies move to a more digital presence. [https://ibb.co/SVjFGvc](https://ibb.co/SVjFGvc) / [https://ibb.co/T1Ds8V8](https://ibb.co/T1Ds8V8)\n\nFiverr is one of the biggest marketplaces for freelance services as this kind of gigs have hugely exploded this year, the company is trading at an insane PE but we have to see what the next quarters brings to us as it may end up being a very profitable company in the future. [https://ibb.co/st03fyj](https://ibb.co/st03fyj) / [https://ibb.co/zQk3Mgp](https://ibb.co/zQk3Mgp)\n\nGeneral Elecitrc is a conglomerate that operates in many business like aviation, healthcare, renewables, digital industry finance and more, they have suffered a lot in the past decade but the CEO has managed to turn things around latetly and might put the company back on track as it is way below all time highs and even recent highs of 30$ just 4 years ago, they might get a boost from the return of the aviation business in the next years. [https://ibb.co/2nTc9mh](https://ibb.co/2nTc9mh) / [https://ibb.co/sybXXPQ](https://ibb.co/sybXXPQ)\n\nGeneral Motors is the other big Detroit giant that I own in my portfolio as I really like where the company is going with its big push in the EV market in the next couple of years, they are trading at a 19 PE and are in a very good position to keep growing. [https://ibb.co/37hqV2C](https://ibb.co/37hqV2C) / [https://ibb.co/BNp0hht](https://ibb.co/BNp0hht)\n\nBarrick Gold is one of the biggest gold and copper mining companies in the world and I use it for some hedging as I like owning this company more than I like owning gold, as this company also provides us with dividends of more than 1% while gold doesn’t [https://ibb.co/P9cVDxs](https://ibb.co/P9cVDxs) / [https://ibb.co/6tpfDtH](https://ibb.co/6tpfDtH)\n\nI don’t believe google needs any introductions as I believe they are still one of the best companies in the tech sector despite lagging the other faang companies this year but they have regained momentum in the last quarter and I believe they can be a catch up trade and a long-term investment [https://ibb.co/JRm07vw](https://ibb.co/JRm07vw) / [https://ibb.co/mT7nWC8](https://ibb.co/mT7nWC8)\n\nGoldman Sachs is a global investment bank that seems to be back on track after the company has struggled in the last couple of years and are also a great diversification play as they are trading below book value. [https://ibb.co/FqmNyFF](https://ibb.co/FqmNyFF) / [https://ibb.co/1zkLmfx](https://ibb.co/1zkLmfx)\n\nHome depot is a big retailer that has gained a lot of traction in the last year and stands to benefit in the future from the great move to online sales. The company is trading at a 25 PE but seems to be on a huge growth bath while also having a more than 2% dividend yield. [https://ibb.co/KXpDM77](https://ibb.co/KXpDM77) / [https://ibb.co/cDBxJgK](https://ibb.co/cDBxJgK)\n\nHoneywell is one of the most diversified technology and manufacturing companies in the world that stands to benefit a lot from the reopening as a lot of companies need to upgrade they’re technology systems. The company has a good dividend yield and a great profit margin. [https://ibb.co/kMxjNRz](https://ibb.co/kMxjNRz) / [https://ibb.co/TL67SRD](https://ibb.co/TL67SRD)\n\nIntuitive surgical is a global technology company for minimally invasive surgery. As this kinds of surgeries have been postponed they stand to benefit from the world getting back to normal. They have huge profit margins that can see they earnings soar in the next years. [https://ibb.co/Lz7j8td](https://ibb.co/Lz7j8td) / [https://ibb.co/kXdmzhQ](https://ibb.co/kXdmzhQ)\n\nJohnson &amp; Johnson is a great company that develops medical devices, meds and consumer goods and stat to benefit a lot if they manage to create e good vaccine. They are currently trading at a PE of 22 but have huge upside and also are a great dividend paying company. [https://ibb.co/FWXqpH2](https://ibb.co/FWXqpH2) / [https://ibb.co/c8qQXNF](https://ibb.co/c8qQXNF)\n\nJP Morgan is a global financial giant with over 3 trillion$ in assests, the company trades at about a 33% price to book overvaluation but stands to benefit a lot in the future from the huge money pumping in the economy by the FED and the return of higher interest rates. [https://ibb.co/hBvLxV5](https://ibb.co/hBvLxV5) / [https://ibb.co/Jtkn90L](https://ibb.co/Jtkn90L)\n\nCoca-Cola is another company that needs no introduction and is still a great company to own with a great dividend yield that stands to benefit from a reopening economy. [https://ibb.co/G9CmsgL](https://ibb.co/G9CmsgL) / [https://ibb.co/C2FLSGy](https://ibb.co/C2FLSGy)\n\nLemonade is a disruptive insurance company that is still expanding its markets. They have a great business strategy and can become a very big player in the industry. The company has more than double since the IPO earlier this year so I believe this can be a great long term investment. [https://ibb.co/zhjYRct](https://ibb.co/zhjYRct) / [https://ibb.co/PZ23M72](https://ibb.co/PZ23M72)\n\nLowe’s is another great retailers similar to Home Depot that has done a great job in transitioning to online sales. I really like the company as it trades at just 20 times earnings and has a great growth rate and dividend yield. [https://ibb.co/zfpyLZC](https://ibb.co/zfpyLZC) / [https://ibb.co/MfS6QNg](https://ibb.co/MfS6QNg)\n\nMcDonalds is the biggest fast food company in the world, the company has done a terrific job this year with drive thru orders and stand to benefit even more after the reopening while also having a great dividend of more than 2% and possibility of growing delivery sales even more in the future. [https://ibb.co/CBTWtJP](https://ibb.co/CBTWtJP) / [https://ibb.co/v1cBqQn](https://ibb.co/v1cBqQn)\n\nMercadolibre is a e-commerce company that is the Amazon or Alibaba of South America as they operate in a lot of sectors like cars, aircrafts, real estate and more. I believe this is a great company to own if you believe in the future of e-commerce. [https://ibb.co/McFrBhZ](https://ibb.co/McFrBhZ) / [https://ibb.co/Cw3wSSk](https://ibb.co/Cw3wSSk)\n\nIsn’t it already obvious that my portfolio must have included Microsoft also? As they are a big beneficiary of cloud services and tech evolutions. This is a staple for every portfolio with great growth and a better dividend yield than any bank can offer at the moment. [https://ibb.co/cvMm8Md](https://ibb.co/cvMm8Md) / [https://ibb.co/FnYD1Y3](https://ibb.co/FnYD1Y3)\n\nAs I want to be diversified and exposed to recovery play I also picked the cruise line that I think will do best in the long run. So though Norwegian have diluted they’re shares a lot during this year, I belive not all cruise lines will survive and they will eat up market share when everything goes back to normal. So I don’t really care about the financials that much at the moment as this is a very long term pick. [https://ibb.co/tHDcrMY](https://ibb.co/tHDcrMY) / [https://ibb.co/PTqK0dj](https://ibb.co/PTqK0dj)\n\nNext Era Energy is the largest electric utility by market cap and has the world largest generator of renewable energy from wind and sun and stand to benefit a lot from a Biden administration that is why they are trading at such high multiples at the moment. The company also has an impressive yield of almost 2% [https://ibb.co/xjYVMx4](https://ibb.co/xjYVMx4) / [https://ibb.co/q9hjp48](https://ibb.co/q9hjp48)\n\nI also bought NetFlix as I believe them, Disney and Roku will be some of the largest players in the streaming business as traditional TV and cinema are a dying business at the moment.The company is trading at a premium but this is due to them dumping money in high quality content to grow they’re subscriber base while they also have steadily increase subscriptions cost in the last years. I believe they will do better next quarter and will see a re-test of all time highs. [https://ibb.co/VN2TF6f](https://ibb.co/VN2TF6f) / [https://ibb.co/B6j9zTn](https://ibb.co/B6j9zTn)\n\nI also own NIO more as a spec play to be well diversified in the EV world, I believe this is a long term investment as the stock price has gone up like bananas recently, the company will have to have perfect growth in the next couple of years to justify an increase in value as they are still losing money. [https://ibb.co/MZ2NL4v](https://ibb.co/MZ2NL4v) / [https://ibb.co/mt8f3ZR](https://ibb.co/mt8f3ZR)\n\nNike is my favorite apparel play as I believe it is the most desired my a lot of people and keeps expanding. I really like how the company is managed and I believe in them for the long-run. [https://ibb.co/jw1zjgj](https://ibb.co/jw1zjgj) / [https://ibb.co/RYR4QSP](https://ibb.co/RYR4QSP)\n\nNvidia is my favorite play in the semiconductor sector as they will continue to benefit from more and more personal pc sales as well as huge data center demand especially for they’re super performing products. They trade at a huge premium right now but I believe they can become the next trillion dollar company in the tech sector. [https://ibb.co/kgJS0w1](https://ibb.co/kgJS0w1) / [https://ibb.co/k8D1MSL](https://ibb.co/k8D1MSL)\n\nI also like owning Pepsico alongside Coca Cola as they are the two biggest players in the sector and I believe that they will both benefit a lot in the next years from the economy recovery. With pepsico offering a 2,7% dividend and a great growth path I really like owning this stock [https://ibb.co/2SY4xPY](https://ibb.co/2SY4xPY) / [https://ibb.co/Sdt2hGC](https://ibb.co/Sdt2hGC)\n\nPinterest is an up and coming social media platform that has a great ad friendly setup and could see growth in the next years. They are trading at insane PE ratios but that should catch up to the company in the future and I believe you must own it to be well diversified. [https://ibb.co/gwGFbyb](https://ibb.co/gwGFbyb) / [https://ibb.co/5TYz4KS](https://ibb.co/5TYz4KS)\n\nPalantir is a highly controversial name right now but its products and services are really good as they are earning more and more stamps of approval with government contracts while also expanding to commercial use. Financial info is not that good as the company barely reported they’re first earnings after the IPO. [https://ibb.co/fdQ42gc](https://ibb.co/fdQ42gc) / [https://ibb.co/wyTJSG2](https://ibb.co/wyTJSG2)\n\nPayPal is another great company that will do very well in the future as payments transition to a more digital approach and the company is transitioning to allow cryptocurrencies as well which will attract even more users. They have had a greet increase in revenue and eps in the last quarters and I expect that to continue to grow. [https://ibb.co/9tXxhJZ](https://ibb.co/9tXxhJZ) / [https://ibb.co/M5vCynn](https://ibb.co/M5vCynn)\n\nQualcomm is my favorite 5G play alongside apple as this will be a long cycle of upgrades for the communications services that will benefit them a lot.They are trading at an PE of over 30 but have great revenue and EPS growth while also offering an almost 2% dividend yield. [https://ibb.co/NFsnKqW](https://ibb.co/NFsnKqW) / [https://ibb.co/x5sJLW6](https://ibb.co/x5sJLW6)\n\nRoku is a great play for the hardware and subscription based services for digital media players and has huge tailwinds that will benefit them while the old TV cycle is dying. They have had a huge year over year revenue growth and subscribers growth that has passed the 40 million mark for the first time recently. [https://ibb.co/Fqd7sYP](https://ibb.co/Fqd7sYP) / [https://ibb.co/ccKqzkC](https://ibb.co/ccKqzkC)\n\nWhile SunRun is another great play for the new Biden administration as well as the transitioning to more renewable energy as they may see a huge boost in revenue growth and earnings with more money being pumped into the renewable sector. [https://ibb.co/0jr3TRg](https://ibb.co/0jr3TRg) / [https://ibb.co/NmdSdwP](https://ibb.co/NmdSdwP)\n\nEveryone also knows Starbucks, as I expect them to be a huge gainer on a improved US-China relationship so despite suffering a lot from this economy the stock is still up more than 16% in the last year while revenues have declined, expect this to bounce back by 2021-2022. [https://ibb.co/s5nTzQX](https://ibb.co/s5nTzQX) / [https://ibb.co/fDyhvX3](https://ibb.co/fDyhvX3)\n\nShopify is a multinational e-commerce cloud based platform for merchants like small and medium sized business so that can easily have an online store that they can manage payments for, orders inventory and much more. The company is trading at P/E’s that are crazy but the revenue and EPS growth is also amazing and has the potential for a lot more growth as the world is going more and more digital. [https://ibb.co/6nt4GhC](https://ibb.co/6nt4GhC) / [https://ibb.co/QbFhybt](https://ibb.co/QbFhybt)\n\nStore capital is a real estate investment trust that focuses on single tenant commercial real estate so they can negotiate much better rents and collections than other REIT. They are still more than 8$ under the highs and are a great diversification and yield giving stock to own. [https://ibb.co/XzBY41g](https://ibb.co/XzBY41g) / [https://ibb.co/TrGRZpR](https://ibb.co/TrGRZpR)\n\nAT&amp;T is one of the largest providers in the us and seems to be getting back on track after they have struggled in the past decade, they trade at only 8 times forward P/E and have one of the best dividend yields at more than 7% so I believe this is a must have staple in your portfolio that brings stability and cash flow. [https://ibb.co/cYcfYMm](https://ibb.co/cYcfYMm) / [https://ibb.co/8D3NzZr](https://ibb.co/8D3NzZr)\n\nWhile Target has been doing some amazing things as they operate as a general merchandise retailers and are doing some amazing things with online sales, they currently have seen a spike in the last months and are trading at a p/e of over 22 but I see them as a long term winner that offers both growth and value with a dividend yield of 1,5%. [https://ibb.co/Fzd8TMw](https://ibb.co/Fzd8TMw) / [https://ibb.co/NLnw4Lv](https://ibb.co/NLnw4Lv)\n\nWhile the other communication provider that I like is T-Mobile US which has seen a huge spike in user growth and are poised to do a lot of great things with the 5G cycle, they trade at a very high multiple for this sector but the growth expectations are huge for this company. [https://ibb.co/PCDFD38](https://ibb.co/PCDFD38) / [https://ibb.co/BTSzTMp](https://ibb.co/BTSzTMp)\n\nMoving on, one of the biggest gainers this year, TESLA is also one of my favorite companies to own as they continue to expand the products they offer and improve margins on vehicle, they are also expanding into more and more services, while manufacturing is growing exponentialy. They trade at insane P/E’s but they have just managed to be included in the SP500 so this may bring some stability to the stock as the company continues to grow in the next decade.[https://ibb.co/6rNJf6q](https://ibb.co/6rNJf6q) / [https://ibb.co/CWN6wD4](https://ibb.co/CWN6wD4)\n\nVisa is the biggest global payments technology company and is expected to continue to grow as more people start using cashless payment options, they are a great growth and value company for the future as cash payments is a dying proposition worldwide. [https://ibb.co/CVXgZD9](https://ibb.co/CVXgZD9) / [https://ibb.co/BPKxFfZ](https://ibb.co/BPKxFfZ)\n\nWal-Mart, the biggest employer in the US continues to do amazing stuff as they continue to expand they’re online presence and compete with Amazon as they trade at a 23 P/E and also offer a dividend yield. they are a great play alongside with Amazon which trades at much higher valuations. [https://ibb.co/Sr9s83J](https://ibb.co/Sr9s83J) / [https://ibb.co/0CvZKkD](https://ibb.co/0CvZKkD)\n\nWynn is another great recovery stock that I like as recently we found out that foot traffic in Macau has ramped up, this bolds well for the company as they will be one of the biggest gainers on the reopening. So if you are a long term investor you should get into this stock I believe. [https://ibb.co/6rk2qNQ](https://ibb.co/6rk2qNQ) / [https://ibb.co/mC35VPr](https://ibb.co/mC35VPr)\n\nZoom is the one company that I will be selling in the next couple of days. I know they are one of the best video conferencing apps out there, but I believe they will have a lot of problem due to a number of free apps that also offer great quality while the company is trading at insane p/e numbers. I know this trend is here to stay, but I thing there are far better play in the stock market out there rather than Zoom at this price point.  [https://ibb.co/T1tStb8](https://ibb.co/T1tStb8) / [https://ibb.co/rmxh0x3](https://ibb.co/rmxh0x3)\n\nI know I didn’t get into in-depth stuff, technical analysis, fundamentals and more but I will continue go more in depth with this stocks as time goes on. \n\nSo here how I want to make my portfolio look like when I have enough money to open all the positions. [TARGETED PORTFOLIo](https://ibb.co/CHWsb27)\n\nAs you can see a quarter of my portfolio will be invested in high quality companies that are pretty safe in my opinion. While over 45% of the portfolio will go to companies that I really like, that have a pretty low risk in my opinion and can offer great returns in the future. While I will also use about 22% of my portfolio into more risky companies that can bring very good profits for the portfolio but in my opinion are not as safe as the others. \n\nAnd finally I will invest about 7% of my portfolio into more speculative stocks or hedge stocks like Barrick Gold and Goldman Sachs. I don’t want to keep money on the sidelines at the moment as I expect the stock market will keep rising for a couple of years at a rapid pace due to the recovery of the economy.\n\nThank you everyone for reading! Hope you enjoyed the content!\n\nBe sure to leave a comment down below with your opinion on the matter of more or less stocks and other thoughts on the stock market!\n\nHave a great Thanksgiving and see you next time!",
        "subreddit": "stocks",
        "title": "Is over diversification bad? Are less stocks more profitable? Starting a new portfolio",
        "url": "https://www.reddit.com/r/stocks/comments/k1pbij/is_over_diversification_bad_are_less_stocks_more/",
        "created": 1606460208.0
    },
    {
        "author": "picuron",
        "created_utc": 1604884790,
        "id": "jqnzvk",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "The auto-mod will automatically remove my submission if I say the \"RMP\" words, but here are the results:\n\n&amp;#x200B;\n\n    OTHER STOCKS has an allocation of 33.75%\n    AAPL has an allocation of 7.56%\n    TSLA has an allocation of 5.94%\n    MSFT has an allocation of 5.75%\n    NVDA has an allocation of 3.5%\n    NIO has an allocation of 3.33%\n    VOO has an allocation of 3.29%\n    AMZN has an allocation of 3.11%\n    VTI has an allocation of 2.57%\n    QQQ has an allocation of 2.47%\n    AMD has an allocation of 2.35%\n    ICLN has an allocation of 1.38%\n    SQ has an allocation of 1.36%\n    CASH has an allocation of 1.27%\n    BABA has an allocation of 1.26%\n    FB has an allocation of 1.06%\n    DIS has an allocation of 1.06%\n    SPY has an allocation of 0.93%\n    XLK has an allocation of 0.88%\n    KO has an allocation of 0.66%\n    WMT has an allocation of 0.58%\n    VGT has an allocation of 0.58%\n    GOOGL has an allocation of 0.55%\n    V has an allocation of 0.53%\n    VT has an allocation of 0.44%\n    CRM has an allocation of 0.41%\n    A has an allocation of 0.4%\n    ETSY has an allocation of 0.4%\n    BYND has an allocation of 0.39%\n    MA has an allocation of 0.38%\n    T has an allocation of 0.33%\n    INTC has an allocation of 0.32%\n    JPM has an allocation of 0.31%\n    PINS has an allocation of 0.29%\n    SBUX has an allocation of 0.28%\n    SHOP has an allocation of 0.28%\n    CRWD has an allocation of 0.28%\n    RTX has an allocation of 0.27%\n    GOOG has an allocation of 0.24%\n    DAL has an allocation of 0.24%\n    JNJ has an allocation of 0.24%\n    MCD has an allocation of 0.24%\n    PYPL has an allocation of 0.22%\n    BAC has an allocation of 0.2%\n    CVX has an allocation of 0.19%\n    BRK.B has an allocation of 0.18%\n    GOLD has an allocation of 0.18%\n    EA has an allocation of 0.17%\n    WM has an allocation of 0.17%\n    PEP has an allocation of 0.16%\n    SWKS has an allocation of 0.16%\n    WFC has an allocation of 0.16%\n    AXP has an allocation of 0.15%\n    BA has an allocation of 0.15%\n    HD has an allocation of 0.15%\n    PFE has an allocation of 0.15%\n    COST has an allocation of 0.14%\n    LOW has an allocation of 0.14%\n    QCOM has an allocation of 0.14%\n    O has an allocation of 0.14%\n    IWF has an allocation of 0.14%\n    GE has an allocation of 0.13%\n    NFLX has an allocation of 0.13%\n    CHWY has an allocation of 0.13%\n    VUG has an allocation of 0.13%\n    XOM has an allocation of 0.12%\n    NKE has an allocation of 0.12%\n    FVRR has an allocation of 0.12%\n    CCL has an allocation of 0.11%\n    DE has an allocation of 0.11%\n    TWTR has an allocation of 0.1%\n    PLTR has an allocation of 0.1%\n    SEDG has an allocation of 0.1%\n    AVGO has an allocation of 0.09%\n    CAG has an allocation of 0.09%\n    DFS has an allocation of 0.09%\n    KR has an allocation of 0.09%\n    SPG has an allocation of 0.09%\n    SNE has an allocation of 0.09%\n    ABBV has an allocation of 0.08%\n    ATVI has an allocation of 0.08%\n    AMGN has an allocation of 0.08%\n    CSCO has an allocation of 0.08%\n    DOW has an allocation of 0.08%\n    PG has an allocation of 0.08%\n    RCL has an allocation of 0.08%\n    NOW has an allocation of 0.08%\n    TGT has an allocation of 0.08%\n    VZ has an allocation of 0.08%\n    TTD has an allocation of 0.08%\n    UBER has an allocation of 0.08%\n    ZM has an allocation of 0.08%\n    AAL has an allocation of 0.07%\n    HAS has an allocation of 0.07%\n    PPL has an allocation of 0.07%\n    UAL has an allocation of 0.07%\n    BMY has an allocation of 0.06%\n    CMCSA has an allocation of 0.06%\n    GM has an allocation of 0.06%\n    HON has an allocation of 0.06%\n    MPC has an allocation of 0.06%\n    NCLH has an allocation of 0.06%\n    REGN has an allocation of 0.06%\n    TTWO has an allocation of 0.06%\n    LULU has an allocation of 0.06%\n    FDX has an allocation of 0.05%\n    MU has an allocation of 0.05%\n    SNAP has an allocation of 0.05%\n    SONY has an allocation of 0.05%\n    BBY has an allocation of 0.04%\n    CVS has an allocation of 0.04%\n    EL has an allocation of 0.04%\n    KHC has an allocation of 0.04%\n    REG has an allocation of 0.04%\n    LUV has an allocation of 0.04%\n    VRTX has an allocation of 0.04%\n    VTV has an allocation of 0.04%\n    MO has an allocation of 0.03%\n    ADSK has an allocation of 0.03%\n    CDNS has an allocation of 0.03%\n    CI has an allocation of 0.03%\n    IBM has an allocation of 0.03%\n    MLM has an allocation of 0.03%\n    NEE has an allocation of 0.03%\n    ODFL has an allocation of 0.03%\n    ROST has an allocation of 0.03%\n    TXN has an allocation of 0.03%\n    ULTA has an allocation of 0.03%\n    UAA has an allocation of 0.03%\n    UNH has an allocation of 0.03%\n    ACB has an allocation of 0.03%\n    CGC has an allocation of 0.03%\n    ACN has an allocation of 0.02%\n    ADBE has an allocation of 0.02%\n    AMT has an allocation of 0.02%\n    CAT has an allocation of 0.02%\n    DUK has an allocation of 0.02%\n    F has an allocation of 0.02%\n    GPS has an allocation of 0.02%\n    HRL has an allocation of 0.02%\n    HPQ has an allocation of 0.02%\n    LMT has an allocation of 0.02%\n    L has an allocation of 0.02%\n    MGM has an allocation of 0.02%\n    STX has an allocation of 0.02%\n    UNP has an allocation of 0.02%\n    WYNN has an allocation of 0.02%\n    XRX has an allocation of 0.02%\n    MRNA has an allocation of 0.02%\n    IVV has an allocation of 0.02%\n    FNILX has an allocation of 0.02%\n    MMM has an allocation of 0.01%\n    ABT has an allocation of 0.01%\n    AFL has an allocation of 0.01%\n    AMAT has an allocation of 0.01%\n    CBRE has an allocation of 0.01%\n    CMA has an allocation of 0.01%\n    CTVA has an allocation of 0.01%\n    FANG has an allocation of 0.01%\n    DG has an allocation of 0.01%\n    EOG has an allocation of 0.01%\n    EQIX has an allocation of 0.01%\n    IT has an allocation of 0.01%\n    IP has an allocation of 0.01%\n    J has an allocation of 0.01%\n    LHX has an allocation of 0.01%\n    LDOS has an allocation of 0.01%\n    LEN has an allocation of 0.01%\n    LLY has an allocation of 0.01%\n    LYV has an allocation of 0.01%\n    MAR has an allocation of 0.01%\n    NOC has an allocation of 0.01%\n    PM has an allocation of 0.01%\n    PLD has an allocation of 0.01%\n    SLB has an allocation of 0.01%\n    SO has an allocation of 0.01%\n    SWK has an allocation of 0.01%\n    SYF has an allocation of 0.01%\n    TSN has an allocation of 0.01%\n    WBA has an allocation of 0.01%\n    XLNX has an allocation of 0.01%",
        "subreddit": "stocks",
        "title": "I used a web-scraper and Python to compile the average portfolio of the quarterly thread:",
        "url": "https://www.reddit.com/r/stocks/comments/jqnzvk/i_used_a_webscraper_and_python_to_compile_the/",
        "created": 1604913590.0
    },
    {
        "author": "SuperInsane13",
        "created_utc": 1606100258,
        "id": "jz9gj7",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "I’m buying some PYPL and I wanted some thoughts on this play. \n\nI made this chart here but I’m new to graphing so don’t know too much. Any thought on my breakdowns?\n\n[Trading View](https://www.tradingview.com/chart/PYPL/d0G0Oz2S-PayPal-New-Targets-and-Updates/)",
        "subreddit": "stocks",
        "title": "PYPL Monday morning",
        "url": "https://www.reddit.com/r/stocks/comments/jz9gj7/pypl_monday_morning/",
        "created": 1606129058.0
    },
    {
        "author": "Valdrahir_Mendrenon",
        "created_utc": 1606173770,
        "id": "jzt4bn",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "No, I don't include your paypal accounts my beloved autists.",
        "subreddit": "wallstreetbets",
        "title": "What are some good charities to donate to?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jzt4bn/what_are_some_good_charities_to_donate_to/",
        "created": 1606202570.0
    },
    {
        "author": "marabou_stork",
        "created_utc": 1605374770,
        "id": "ju5kcd",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "The Economist this weekend has some great articles on this ([1](https://www.economist.com/briefing/2020/11/12/value-investing-is-struggling-to-remain-relevant), [2](https://www.economist.com/leaders/2020/11/14/does-value-investing-still-work)). I don't really want to push the view that value investing doesn't work anymore; I think that's a red herring. I would love to dig into the idea of \"intangible\" assets being more valuable, yet also that most investors don't understand them.\n\nI believe my entire investment strategy over the past 8 years has been focused on intangible assets that end up generating large amounts of revenue for companies, but only after years of investment. These include data assets, advertising models fuelled by eyeballs, or enablement of marketplaces (e.g., Shopify, Airbnb, SEA Group, etc.). \n\nThe way I tend to approach intangible investments is to answer \"yes\" to all of the following questions:\n\n1. Does the company have an effective product that *some* people (i.e., a small current market) consider \"best in the market\"?\n2. If the product moves from *some* people buying it to *most* people buying it, will the company 10x its market cap?\n3. Are there current players in the space that are 10x bigger than the company? This shows me that it's possible to displace/disrupt current leaders with a new product and strategy and actually capture a massive market. Think: Netflix in its early days (vs. Blockbuster), think Shopify on its IPO day vs. PayPal, Ebay, etc...\n4. Do I believe the management team and founders could execute on this?\n\nThere are other signals to look for; if I'm right 1/3 of the time and make 10x on those companies, while losing on everyone else, the portfolio can still 3x itself... Sort of like a VC strategy in public markets. I can write *pages* on this topic, but would rather hear how other people approach intangible investment strategies.\n\nDoes anyone here have an intangible investment strategy? If so, how do you think about this?",
        "subreddit": "investing",
        "title": "How do you approach \"intangible\" investing?",
        "url": "https://www.reddit.com/r/investing/comments/ju5kcd/how_do_you_approach_intangible_investing/",
        "created": 1605403570.0
    },
    {
        "author": "itypeinlowercase",
        "created_utc": 1606157335,
        "id": "jznq0p",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "Hey all,\n\nI posted here last week for $PYPL and it looks like we’ve broken that $195 that it was struggling to hold. \n\nChecked back on TradingView and see this updated TA. \n\nWhat are your thoughts? \nI bought some calls for $220 March 19 today. Wish I could buy more but it’s tied up. \n\nCould $230 be in play?\n\n\n[Trading View $PYPL TA](https://www.tradingview.com/chart/PYPL/d0G0Oz2S-PayPal-New-Targets-and-Updates/)",
        "subreddit": "options",
        "title": "$PYPL targets after $200 breakout",
        "url": "https://www.reddit.com/r/options/comments/jznq0p/pypl_targets_after_200_breakout/",
        "created": 1606186135.0
    },
    {
        "author": "howling_mad",
        "created_utc": 1605044775,
        "id": "jrudro",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Last week news broke that BFT may be in talks with Blackstone's Paysafe. Paysafe is a non-US based competitor to PayPal and Stripe.  \n\nPSTH seems pretty hyped on a potential Strip merger (higher valuation), yet there seems to be fairly limited excitement for BFT. Any idea why? BFT is trading much, much lower than PSTH, likely due to the valuation difference, but it still seems list a drastic difference. This is after BFT's 60%+ jump last week, as it was trading under $1 and is now at $1.50.\n\nThoughts?",
        "subreddit": "SPACs",
        "title": "BFT - Foley Trasimene Acquisition Corp. II - potential merger with Paysafe; limited interest?",
        "url": "https://www.reddit.com/r/SPACs/comments/jrudro/bft_foley_trasimene_acquisition_corp_ii_potential/",
        "created": 1605073575.0
    },
    {
        "author": "gotpvp",
        "created_utc": 1605741069,
        "id": "jwqsp5",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "**Note:** *This thread involves the discussion of PYPL future earnings based on sales of cryptocurrencies and is not meant to discuss cryptocurrency as an investment.* *No opinion is given on cryptocurrency itself, and it is purely being viewed as revenue growth for PYPL moving forward.*\n\nOk, so, I've been thinking about SQ revenue growth and comparing the numbers for PYPL and I need someone to convince me not to yolo a good chunk of my life savings on PYPL calls for June 2021. Here are some basic facts to look at.\n\n* SQ has generated $1.63B in revenue from cryptocurrency sales in Q3 2020\n* SQ has generated $32 million of gross profit from this cryptocurrency revenue\n* SQ Q3 revenue was reported **before the massive cryptocurrency price rally** and Q4 revenue can be expected to be much higher\n\nSeems simple enough to me that SQ can expect increased profits in Q4 with significant revenue growth directly correlating to increased volume in cryptocurrency markets. Now, for PYPL and my admittedly retarded ideas.\n\n* PYPL launched a beta program to allow cryptocurrency purchases on a very limited amount of accounts\n* Since the beta program launched, Paxos, the partnered exchange handling the actual sales of cryptocurrency through PayPal, has seen significant volume increase\n* Daily volume on ItBit, the Paxos exchange, ranged from $3-8m on average before PYPL partnered with Paxos\n* Daily volume on ItBit has now increased dramatically, spiking as high as $25-50m daily volume, all happening while PYPL *is* *still in the beta program with very limited access*\n* PYPL has announced they intend to open the program to the public in the next couple of weeks\n* PYPL has 361 million active users, and SQ has 32 million active users, over 10x the base\n\n&amp;#x200B;\n\nAm I crazy or is PYPL really a no-brainer? Revenue growth could be enormous with net profits easily added to their bottom line.",
        "subreddit": "wallstreetbets",
        "title": "PYPL long, possibly retarded but YOLO",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jwqsp5/pypl_long_possibly_retarded_but_yolo/",
        "created": 1605769869.0
    },
    {
        "author": "Bruhatgmaildotcom",
        "created_utc": 1606761875,
        "id": "k426wy",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "SQ has been experiencing meteoric growth recently, but it is only the beginning. The key to interpreting future movements is looking at the fintech industry as a whole. By far the largest company within this sector is PayPal (PYPL). PayPal’s market cap is ~2.7 times the size of Square’s, yet offers less services. The only reason PayPal is larger than Square is because of its earlier IPO and subsequent market relevancy. Square has been expanding its brand by buying up smaller financial service companies, like Cashapp and Credit Karma. Cash app’s current user base is about 1/12 the size of PayPal’s, but I think growth is in order with the shifting age demographics of fintech’s user base. PayPal is the Facebook of online payment apps, while Square is the Twitter (owned by the same guy too). I believe that Square’s market cap will surpass 250 billion within a year’s time, and take PayPal’s throne at the top of the industry. \n\nTL;DR: BUY SQ LEAPS AND SHARES ASAP \n\nPosition: SQ 200c Jan. 21 2022",
        "subreddit": "wallstreetbets",
        "title": "SQ is set for big growth over the next year",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k426wy/sq_is_set_for_big_growth_over_the_next_year/",
        "created": 1606790675.0
    },
    {
        "author": "st0nksBuyTheDip",
        "created_utc": 1605508192,
        "id": "jv22dv",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "Recently SQ had earnings and something around 70% of their earnings was just through their bitcoin offerings.   \nApparently PayPal saw a massive boost in that regard now as well. \n\n&amp;#x200B;\n\nMore and more adoptions are following.   \n\n\ni'm not invested in BTC yet, Pure stock as of right now. I am thinking of starting to add some bitcoin. \n\n&amp;#x200B;\n\nAny ideas?",
        "subreddit": "StockMarket",
        "title": "Institutional Investors are Jumping on Bitcoin [PayPal, SQ, etc] with massive investments. Are you?",
        "url": "https://www.reddit.com/r/StockMarket/comments/jv22dv/institutional_investors_are_jumping_on_bitcoin/",
        "created": 1605536992.0
    },
    {
        "author": "NodeZero_X",
        "created_utc": 1605341153,
        "id": "jtyju8",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "I have some PayPal stock, and I was getting this notification after I login to my HSBC Direct Invest platform so I guess this offer is at least legit and legal. But I’m not sure who is this “PONOS INDUSTRIES” and why they’re welling to pay above market price for my PayPal stock share (225 vs 188.62 per share today).\n\nWhen I google around, this is the only news found: https://www.investors.com/promoted-content/ponos-industries/notice-of-offer-to-purchase-for-cash-up-to-1000000-shares-of-common-stock-of-paypal-holdings-inc-at-225-00-net-per-share-by-ponos-industries-llc-2/\n\nHave anyone dealing with them before and how did it turn out at the end if you accept their offer?\n\nThe following is the original notification I got from HSBC Direct Invest platform:\n\nDear client, please be advised that there is a voluntary Mini- Tender announced for PAYPAL HOLDINGS INC by PONOS INDUSTRIES that may require your action prior to the deadline. \n\nHolders have the following options: \n\nOption 1: To receive $225.00 USD net per share of PAYPAL HOLDINGS INC tendered. Subject to Proration. \n\nOption 2: Do Not Participate. (Default Option) \n\nTo exercise, please contact an Investment Representative at 1- 800-760-1180 or 1-416-868-3898 prior to December 10, 2020 (5:00 PM, Eastern Time). \n\nThank you for giving this your prompt attention. Yours sincerely, HSBC InvestDirect. Note: Solicitation fees: $2.25 USD per share deposited. Certain restrictions, fees, and tax consequences may apply. \n\nThe important information above is not exhaustive, holders are strongly advised to review any published material regarding this security and or corporate action event prior to submitting their instructions.",
        "subreddit": "stocks",
        "title": "PONOS INDUSTRIES is offering purchase my PayPal stock (above market price) via HSBC Direct Invest",
        "url": "https://www.reddit.com/r/stocks/comments/jtyju8/ponos_industries_is_offering_purchase_my_paypal/",
        "created": 1605369953.0
    },
    {
        "author": "iamvazu",
        "created_utc": 1604877763,
        "id": "jqm1br",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "[PYPL](https://stonklabs.xyz/options?fdate=MDEvMTAvMjAyMA==&amp;tdate=OC8xMS8yMDIw&amp;symbol=PYPL&amp;filters=&amp;exp=11/20/2020) [AMD](https://stonklabs.xyz/options?fdate=MDEvMTAvMjAyMA==&amp;tdate=OC8xMS8yMDIw&amp;symbol=AMD&amp;filters=&amp;exp=11/20/2020) [BABA](https://stonklabs.xyz/options?fdate=MDEvMTAvMjAyMA==&amp;tdate=OC8xMS8yMDIw&amp;symbol=ROKU&amp;filters=&amp;exp=11/20/2020) [NIO](https://stonklabs.xyz/options?fdate=MDIvMTEvMjAyMA==&amp;tdate=OC8xMS8yMDIw&amp;symbol=NIO&amp;filters=&amp;exp=11/13/2020) [AAPL](https://stonklabs.xyz/options?fdate=MDEvMTAvMjAyMA==&amp;tdate=MDYvMTEvMjAyMA==&amp;symbol=AAPL&amp;filters=&amp;exp=11/20/2020) [TQQQ](https://stonklabs.xyz/options?fdate=MDEvMTAvMjAyMA==&amp;tdate=OC8xMS8yMDIw&amp;symbol=TQQQ&amp;filters=&amp;exp=11/20/2020) [SPY](https://stonklabs.xyz/options?fdate=MjYvMTAvMjAyMA==&amp;tdate=OC8xMS8yMDIw&amp;symbol=SPY&amp;filters=&amp;exp=11/13/2020) [QQQ](https://stonklabs.xyz/options?fdate=MDIvMTEvMjAyMA==&amp;tdate=OC8xMS8yMDIw&amp;symbol=QQQ&amp;filters=&amp;exp=11/13/2020) [TSLA](https://stonklabs.xyz/options?fdate=MDEvMTAvMjAyMA==&amp;tdate=OC8xMS8yMDIw&amp;symbol=TSLA&amp;filters=&amp;exp=11/13/2020) [JD](https://stonklabs.xyz/options?fdate=MDEvMTAvMjAyMA==&amp;tdate=MDYvMTEvMjAyMA==&amp;symbol=JD&amp;filters=&amp;exp=11/20/2020)",
        "subreddit": "smallstreetbets",
        "title": "Option Flow for Nov 13 &amp; 20",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/jqm1br/option_flow_for_nov_13_20/",
        "created": 1604906563.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1605881643,
        "id": "jxpq7f",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "**What are the latest news from the stock market? What happened yesterday? Mnuchin cuts the FED’s programs and more, let’s talk about it**\n\nHey everyone and Welcome, so let’s start with the recap of yesterday as we saw the Nasdaq composite  \n[CHART](https://ibb.co/FK78S5n) leading the way, up more than 0,8%, the S&amp;P500 [CHART](https://ibb.co/kXKdY1g) also finishing up 0,4% and the Dow Jones Industrial Average [CHART](https://ibb.co/9Y0K4SY) barely finishing in the green on the late broad stock market rally as early day losses were cut when the stimulus bill talks seemed to have resumed in congress as this eased investor’s worries, this reversed sharply after the treasury secretary announcement after hours though, as the futures of the SP and Dow futures slipped more than half a percent. [FUTURES](https://ibb.co/sFPq0sm) / [STIMULUS NEWS](https://ibb.co/xD0Qvzt)\n\nThe VIX continued to remain steady and remains in the clear downtrend started at the end of September as it dropped more than 3% again yesterday. [VIX CHART](https://ibb.co/q5tFDtr) [VIX CHART](https://ibb.co/LkF9ypR)\n\nWe saw more than 60% of the companies advancing on way below volume average as investors [CHART](https://ibb.co/kh4BLQX) are waiting to see what the next days and weeks brings us, as Pfizer is expected to apply for the FDA authorization today [NEWS](https://ibb.co/w6MQ4Tp) while huge uncertainty remains with the big spike in cases of COVID-19 in the US and a fiscal policy that remains uncertain until the change in Presidency. as yesterday the treasury declined to extend 5 of the FED’s cares act emergency programs that expire at the end of the year with the most important ones being: the main street lending facility, the corporate bond purchases and the municipal bond purchases. This is not such a big thing in context as this programs have only accounted for about 25 billion$ in lending. [NEWS](https://ibb.co/tCzg4t7)\n\nThere was a pretty even distribution of growth in all of the sectors yesterday as only utilities finished in the red with large-cap value companies being the laggards of the stock market. [CHART](https://ibb.co/vPXgVJM) / [SECTORS](https://ibb.co/smy0dhn)\n\nHere is the heat map [CHART](https://ibb.co/3s4c3tg) from yesterday as the big tech companies like Apple, Amazon, Google and Microsoft finally turned positive and led the stock market higher as this companies account for about 20% of the SP500, this is not the first time that the index has been dominated by just a few players, as 40 years ago IBM, AT&amp;T, Exxon and GM made up for about 19% of the index. Though Tesla is soon joining the biggest player in the SP as they will account for about 1,3% of the index when they will be added this December. [SP HISTORY](https://ibb.co/rM846BS) / [SP FUTURE](https://ibb.co/wZnGQq3)\n\nYesterday was the first time in more than a month that the initial jobless claims came in higher than the previous week as 742 thousand people filed for benefits, this was up more than 30k from the previous week and well above the 707 thousand forecasted. This is still more than 3 times higher than pre-pandemic numbers Though better data came in from the continuing claims as they fell to 6,37 million, a number lower than the previous week of 6,8 million and lower than what was forecasted at almost 6,5 million. [JOBLESS CLAIMS](https://ibb.co/521qtyd)\n\nWhile better numbers came in as the existing home sales saw a huge spike of more than 4% as they continued to rise for a fifth straight month as the Philly fed outlook also came in well above the expectations. [FED OUTLOOK](https://ibb.co/HpWKHj2) / [HOME SALES](https://ibb.co/0YyqjWm)\n\nThe stock market may see another great moment when the European Union might approve the vaccines from Pfizer and Moderna in the next month as well. [NEWS](https://ibb.co/8KjgNyR)\n\nAlso, today it is expected that Georgia will formally certify Biden’s victory, as this will pretty much put an end to Trump’s legal fights and will bring more stability to the economic policy expectations for the future. [NEWS](https://ibb.co/m5fYKcQ)\n\nSome stock market companies news came in as We saw Roku yesterday hitting new all-time highs as even bearish players start to notice the huge tailwind and boost the pandemic has given to a lot of companies. Roku rose more than 10% yesterday after this news and continues to keep growing as the decline in traditional TV continues to go on while they are also close to brining HBO Max directly to they’re platform. [ROKU - HBO](https://ibb.co/txyH21M) / [ROKU UPGRADE](https://ibb.co/kqcpH93)\n\nAlso Nvidia will provide Fortnite players an alternative of playing on IOS devices through it’s GeForce gaming, which will mark the return of Epic Games on Apple products as they continue they’re legal battle. [NVIDIA NEWS](https://ibb.co/994HKt1)\n\nWhile GM announced they will get back in the car insurance game with vehicle data providing crucial information and benefits for the company, this is exactly what Elon Musk said about Tesla getting into the insurance game as he expects that to be a huge part of Tesla in the future. [GM NEWS](https://ibb.co/Rc9BXwb)\n\nAnd as dividends go, PEPSICO and Home Depot just announced quarterly dividends with yields in line with previous. [HD DIVIDEND](https://ibb.co/yqyTr16) / [PEPSICO DIVIDEND](https://ibb.co/1LShBhm)\n\nI believe there are a lot of great opportunities to buy Stocks right now as I believe companies like PayPal, Roku, Amazon, Tesla, Target and many more still have room to run by the end of the year. In the coming days I will post my new portfolio composition and targets and I will get a little more on why I chose to buy those companies.\n\nThank you everyone for reading! Be sure to leave a comment down below with your expectations on the stock market!",
        "subreddit": "StockMarket",
        "title": "Stock market news today | Treasury cuts funding for FED programs | Stimulus talks back on the table? [11-20]",
        "url": "https://www.reddit.com/r/StockMarket/comments/jxpq7f/stock_market_news_today_treasury_cuts_funding_for/",
        "created": 1605910443.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1606431365,
        "id": "k1pb44",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "**In this post I am going to share my experience as I start a new portfolio from 0$ and keep adding funds to it every month as I try to grow it as fast as possible**\n\nHey everyone Happy Thanksgiving and Welcome! So, I have deposited and invested in the stock market all the money I managed to save up in the last month as I deposited 3500$ in my eToro portfolio on the 12th of November and I am already up more than 7% in just two weeks. \n\nAs my portfolio has constantly outperform the big 3 indexes the Nasdaq100, the SP500 and the Dow Jones 30 almost every day since starting my portfolio. Here is a comparison of my portfolio vs the indexes since starting as I am up over 7%. [Portfolio v Index](https://ibb.co/pRnQLQf)\n\nSo i wondered? Is it really bad to own more stocks? Is less &gt; more? What is your opinion on this subject? I believe that it is way better to be invested in more companies and to add and grow your position in time as you also see how the companies evolve and you can also do some price averaging.\n\nSo here is my current portfolio composition as I split all my money equally to start, I will go into very few little details about everyone so I don’t make this a 2 hour read time.\n\nI will start now by going alphabetically and not in the most important order as the first company that I own is BYD which is a rival company for both Tesla and NIO in the EV market as they focus on cars, new energy solutions and electronics. They are also developing a lot of commercial EV like buses, coaches and taxis which will be a great addressable market for them as they are not rivaled in those segments at the moment. The company has gone up a lot in value this year as you can see in this graph and have a Forward P/E of more than 100 but I believe this company will greatly expand its sales and be one of the leaders in the segment especially in China which is the biggest EV market. [https://ibb.co/gVVwpfR](https://ibb.co/gVVwpfR) / [https://ibb.co/z7YBGr9](https://ibb.co/z7YBGr9)\n\nThe second holding is Apple, is there anybody that doesn’t know this company? They are the biggest company in the world and they continue to expand with new products and services every day, I don’t see this company going down in the short term or the long term as they have pretty expensive at a 35 P/E but earnings are still rising especially with more subscription based income coming in with the release of the Apple One Bundle. [https://ibb.co/Tm3hWMZ](https://ibb.co/Tm3hWMZ) / [https://ibb.co/Q9YjJTx](https://ibb.co/Q9YjJTx) / [https://ibb.co/BrzkHCY](https://ibb.co/BrzkHCY)\n\nAbbVie is a health company that produces a lot of great drugs and has more than 26 million patients in over 200 countries that are treated every year. They are one of the best companies in the sector and are still down about 25% from the all time highs while only trading at a forward P/E of 8 which is very low. [https://ibb.co/9nn4z0q](https://ibb.co/9nn4z0q) / [https://ibb.co/mXh3JL5](https://ibb.co/mXh3JL5) / [https://ibb.co/cwhJgB5](https://ibb.co/cwhJgB5)\n\nAMD is a well established companies that creates high performance GPU’s for both personal computer and for data centers, the company has turned around and have started a great path to success since the newest CEO took the job in 2014 as the stock was trading at 2$ and while the company is trading at a very high forward P/E they have a lot of room to grow in this new economy as the EPS is expected to increase by more than 40% quarter over quarter [https://ibb.co/dpwYPcy](https://ibb.co/dpwYPcy) / [https://ibb.co/7vwWHtC](https://ibb.co/7vwWHtC) / [https://ibb.co/yF0RmQv](https://ibb.co/yF0RmQv)\n\nAmazon is the internet retail juggernaut and cloud servicing company that has also started to expand in more and more domains like pharmacy just last week, though the company is also trading at a very high PE they have a lot of room to grow internationally and also are expanding in a lot more domains at a very fast rate. [https://ibb.co/4TnGhkt](https://ibb.co/4TnGhkt) / [https://ibb.co/c6W2Ypx](https://ibb.co/c6W2Ypx)\n\nAphria is a Canadian company that mainly grows cannabis for medical use but has recently acquired a beverage company and is look to expand its product line, especially with the legalizing of marijuana more and more obvious in the US. They are one of the companies that stands to benefit the most from this as they are also expected to be the first to reach profitability by next year compared to Aurrora Canabis and Cannopy Growth. [https://ibb.co/KrfL267](https://ibb.co/KrfL267) / [https://ibb.co/kJ8yxDR](https://ibb.co/kJ8yxDR)\n\nBroadcom is one of the biggest American semiconductor solutions provider, they are a very good play for the sector as they only trade at a forwarde P/E of 17 which is very good compared to comptetitors. [https://ibb.co/8KFmX88](https://ibb.co/8KFmX88) / [https://ibb.co/q18SzPb](https://ibb.co/q18SzPb)\n\nEveryone also knows Boeing as they are one of the biggest commercial manufacturers of jetliners, defence, space and security systems. The have suffered a lot in the last 2 years after the 737 accidents and the recent stay-at-home economy, but the ban on the plain has been lifted in the US and will be followed by the European Union soon, they have a big backlog of planes to work through while this situation will improve and air travel returns slowly in the next years. [https://ibb.co/JxZYZ6D](https://ibb.co/JxZYZ6D) / [https://ibb.co/NVbhDLQ](https://ibb.co/NVbhDLQ)\n\nAlibaba is a online e-commerce giant that has expanded into cloud computing services also and stands to benefit a lot from the stay-at-home economy while also having just a forward PE of 32 which is very low compared to Amazon as they are the Chinese version of them. The company also owns Ant Group which is one of the largest fin tech companies in the world and will likely gain a lot after they finally manage to go public. [https://ibb.co/0JPN6DN](https://ibb.co/0JPN6DN) / [https://ibb.co/6NgjGNV](https://ibb.co/6NgjGNV) / \n\nBerkshire is the child company of Warren Buffet as they are a holding company that engages in diversified business like technology, banks, insurance and much more. The company is currently trading at a very low P/E an barely above the price/book value as even the founders of the company believe this as they have continued to buy back shares of the company in the last year at the fastest rate in company history. [https://ibb.co/bP6VjpM](https://ibb.co/bP6VjpM) / [https://ibb.co/hf5hX39](https://ibb.co/hf5hX39)\n\nCaterpillar is one of best companies in manufacturing, construction and mining equipment. They are trading at almost 3 time sales with a high P/E but this is likely to regain momentum with the China trade war relaxing with the new Biden administration as well as the reopening of the economy [https://ibb.co/pnC17PM](https://ibb.co/pnC17PM) / [https://ibb.co/2vsQSjt](https://ibb.co/2vsQSjt)\n\nChipotle Mexican is one of the best companies right now in the fast food business as they continue to innovate and have just opened they’re first digital only store. The company is trading at a very high P/E but has substantial growth potential so I believe it will be a great buy for the future. [https://ibb.co/GCqd3Y9](https://ibb.co/GCqd3Y9) / [https://ibb.co/JnBm3bx](https://ibb.co/JnBm3bx)\n\nCostco is one of the world biggest retailers that has a great business model as they are making most of they’re money through membership fees unlike other retailers that mostly rely on prices, the are trading at just 1 times sales which is very good and they have a lot of room to grow especially with improve China relationships. [https://ibb.co/X4M76Vd](https://ibb.co/X4M76Vd) / [https://ibb.co/ypg3Gyc](https://ibb.co/ypg3Gyc)\n\nCrowdstrike is a cyber security company that has seen a huge spike due to the transition to more and more digital presence for all the companies. They are a company that I believe is here to stay and just started to become profitable in the last quarter. [https://ibb.co/zNbfhL9](https://ibb.co/zNbfhL9) / [https://ibb.co/mBw2TKj](https://ibb.co/mBw2TKj)\n\nCarvana is one of the best players for the second hand car market as they operate a unique e-commerce platform for people to buy, sell or finance cars. They are one of my favorite companies as they are also just starting to make money as they continue to expand they’re presence. [https://ibb.co/QPZ1wnt](https://ibb.co/QPZ1wnt) /  [https://ibb.co/0rS6LrQ](https://ibb.co/0rS6LrQ)\n\nCVS is a health and pharmacy companies that owns the most pharma stores in the US, the company has been hit recently by the news that Amazon is getting into pharmacy delivery but I believe they will be a great play for the vaccine distribution play as the company is only trading at a forward P/E of 8 and is trading below value of sales while also offering a dividend of 2% [https://ibb.co/KNH6v5G](https://ibb.co/KNH6v5G) / [https://ibb.co/8Ps3QRB](https://ibb.co/8Ps3QRB)\n\nDelta is one of the major airlines in the US and as I wanted to be exposed to some recovery plays I choose this company as I believe air travel will come back in the next years. The financials are not great for the company but they did manage to cut the cash burn rate in the last quarter. [https://ibb.co/gyrSYYb](https://ibb.co/gyrSYYb) / [https://ibb.co/KsNbFHg](https://ibb.co/KsNbFHg)\n\nDeere is another great industrial and manufacturing play for the recovery stocks. The company is trading at a pretty high P/E ratio for them as the stock has runed very high in the last months but they do offer a dividend of 1% which is much better than any bank savings account and also have the potential for growth and also are a pretty reliable way to diversify portfolios. [https://ibb.co/NSsCGN1](https://ibb.co/NSsCGN1) / [https://ibb.co/thrY6W2](https://ibb.co/thrY6W2)\n\nDisney is a very diversified family friend entertainment and media company as they have a lot of great business that will benefit a lot from the re-opening while this contributed a lot to the huge expansion of the streaming business with Disney+ and Hulu so the financials are not great but I believe this will hugely improve in the next couple of years. [https://ibb.co/BG0jctn](https://ibb.co/BG0jctn) / [https://ibb.co/7GR9h3c](https://ibb.co/7GR9h3c)\n\nDraftkings is an American daily fantasy sport operator that has expanded into the huge market of online gambling as more and more us states are legalizing gambling so they have a lot of room to grow in front of them especially with a great online presence with financials not being very important at the moment as they continue to grow they’re presence [https://ibb.co/k8dtJmM](https://ibb.co/k8dtJmM) / [https://ibb.co/HgGQvG2](https://ibb.co/HgGQvG2) \n\nDominos Pizza is one of the biggest pizza companies in the world and are also one of the best in implementing they’re presence in the delivery services as they are way better at this than others companies like Papa John’s. [https://ibb.co/NZXkQjg](https://ibb.co/NZXkQjg) / [https://ibb.co/FVGXXBY](https://ibb.co/FVGXXBY)\n\nEtsy is a e-commerce platform for creative goods and services and has seen a huge rise in popularity and will probably remain a big gainer from this past year, though they are trading at over 70times earnings this will likely improve very much in the next years as they are expected to expand and improve earnings substantaly. [https://ibb.co/5MN9zb7](https://ibb.co/5MN9zb7) / [https://ibb.co/PYz0NWK](https://ibb.co/PYz0NWK)\n\nFord is one of the biggest car makers in the world, I really like this company as it having a big push to move to the EV world with the Mustang Mach E, the EV Transit and the hugely anticipated EV F-150, the company is expected to have huge improvements in the next year as they have decent financials and are one of the best companies to own for a dividend investing strategy. [https://ibb.co/MhwMB47](https://ibb.co/MhwMB47) / [https://ibb.co/745w8vq](https://ibb.co/745w8vq)\n\nFacebook is the largest social media network in the world that also owns Instagram, they have been struggling in the last months due to the political environment but I believe they will continue to be a giant in the tech sector as they are finding new ways to improve revenue streams especially in the highly active Instagram platform as they are trading at pretty much the same P/E like the other big tech companies but are expected to see a growth in advertising money as companies move to a more digital presence. [https://ibb.co/SVjFGvc](https://ibb.co/SVjFGvc) / [https://ibb.co/T1Ds8V8](https://ibb.co/T1Ds8V8)\n\nFiverr is one of the biggest marketplaces for freelance services as this kind of gigs have hugely exploded this year, the company is trading at an insane PE but we have to see what the next quarters brings to us as it may end up being a very profitable company in the future. [https://ibb.co/st03fyj](https://ibb.co/st03fyj) / [https://ibb.co/zQk3Mgp](https://ibb.co/zQk3Mgp)\n\nGeneral Elecitrc is a conglomerate that operates in many business like aviation, healthcare, renewables, digital industry finance and more, they have suffered a lot in the past decade but the CEO has managed to turn things around latetly and might put the company back on track as it is way below all time highs and even recent highs of 30$ just 4 years ago, they might get a boost from the return of the aviation business in the next years. [https://ibb.co/2nTc9mh](https://ibb.co/2nTc9mh) / [https://ibb.co/sybXXPQ](https://ibb.co/sybXXPQ)\n\nGeneral Motors is the other big Detroit giant that I own in my portfolio as I really like where the company is going with its big push in the EV market in the next couple of years, they are trading at a 19 PE and are in a very good position to keep growing. [https://ibb.co/37hqV2C](https://ibb.co/37hqV2C) / [https://ibb.co/BNp0hht](https://ibb.co/BNp0hht)\n\nBarrick Gold is one of the biggest gold and copper mining companies in the world and I use it for some hedging as I like owning this company more than I like owning gold, as this company also provides us with dividends of more than 1% while gold doesn’t [https://ibb.co/P9cVDxs](https://ibb.co/P9cVDxs) / [https://ibb.co/6tpfDtH](https://ibb.co/6tpfDtH)\n\nI don’t believe google needs any introductions as I believe they are still one of the best companies in the tech sector despite lagging the other faang companies this year but they have regained momentum in the last quarter and I believe they can be a catch up trade and a long-term investment [https://ibb.co/JRm07vw](https://ibb.co/JRm07vw) / [https://ibb.co/mT7nWC8](https://ibb.co/mT7nWC8)\n\nGoldman Sachs is a global investment bank that seems to be back on track after the company has struggled in the last couple of years and are also a great diversification play as they are trading below book value. [https://ibb.co/FqmNyFF](https://ibb.co/FqmNyFF) / [https://ibb.co/1zkLmfx](https://ibb.co/1zkLmfx)\n\nHome depot is a big retailer that has gained a lot of traction in the last year and stands to benefit in the future from the great move to online sales. The company is trading at a 25 PE but seems to be on a huge growth bath while also having a more than 2% dividend yield. [https://ibb.co/KXpDM77](https://ibb.co/KXpDM77) / [https://ibb.co/cDBxJgK](https://ibb.co/cDBxJgK)\n\nHoneywell is one of the most diversified technology and manufacturing companies in the world that stands to benefit a lot from the reopening as a lot of companies need to upgrade they’re technology systems. The company has a good dividend yield and a great profit margin. [https://ibb.co/kMxjNRz](https://ibb.co/kMxjNRz) / [https://ibb.co/TL67SRD](https://ibb.co/TL67SRD)\n\nIntuitive surgical is a global technology company for minimally invasive surgery. As this kinds of surgeries have been postponed they stand to benefit from the world getting back to normal. They have huge profit margins that can see they earnings soar in the next years. [https://ibb.co/Lz7j8td](https://ibb.co/Lz7j8td) / [https://ibb.co/kXdmzhQ](https://ibb.co/kXdmzhQ)\n\nJohnson &amp; Johnson is a great company that develops medical devices, meds and consumer goods and stat to benefit a lot if they manage to create e good vaccine. They are currently trading at a PE of 22 but have huge upside and also are a great dividend paying company. [https://ibb.co/FWXqpH2](https://ibb.co/FWXqpH2) / [https://ibb.co/c8qQXNF](https://ibb.co/c8qQXNF)\n\nJP Morgan is a global financial giant with over 3 trillion$ in assests, the company trades at about a 33% price to book overvaluation but stands to benefit a lot in the future from the huge money pumping in the economy by the FED and the return of higher interest rates. [https://ibb.co/hBvLxV5](https://ibb.co/hBvLxV5) / [https://ibb.co/Jtkn90L](https://ibb.co/Jtkn90L)\n\nCoca-Cola is another company that needs no introduction and is still a great company to own with a great dividend yield that stands to benefit from a reopening economy. [https://ibb.co/G9CmsgL](https://ibb.co/G9CmsgL) / [https://ibb.co/C2FLSGy](https://ibb.co/C2FLSGy)\n\nLemonade is a disruptive insurance company that is still expanding its markets. They have a great business strategy and can become a very big player in the industry. The company has more than double since the IPO earlier this year so I believe this can be a great long term investment. [https://ibb.co/zhjYRct](https://ibb.co/zhjYRct) / [https://ibb.co/PZ23M72](https://ibb.co/PZ23M72)\n\nLowe’s is another great retailers similar to Home Depot that has done a great job in transitioning to online sales. I really like the company as it trades at just 20 times earnings and has a great growth rate and dividend yield. [https://ibb.co/zfpyLZC](https://ibb.co/zfpyLZC) / [https://ibb.co/MfS6QNg](https://ibb.co/MfS6QNg)\n\nMcDonalds is the biggest fast food company in the world, the company has done a terrific job this year with drive thru orders and stand to benefit even more after the reopening while also having a great dividend of more than 2% and possibility of growing delivery sales even more in the future. [https://ibb.co/CBTWtJP](https://ibb.co/CBTWtJP) / [https://ibb.co/v1cBqQn](https://ibb.co/v1cBqQn)\n\nMercadolibre is a e-commerce company that is the Amazon or Alibaba of South America as they operate in a lot of sectors like cars, aircrafts, real estate and more. I believe this is a great company to own if you believe in the future of e-commerce. [https://ibb.co/McFrBhZ](https://ibb.co/McFrBhZ) / [https://ibb.co/Cw3wSSk](https://ibb.co/Cw3wSSk)\n\nIsn’t it already obvious that my portfolio must have included Microsoft also? As they are a big beneficiary of cloud services and tech evolutions. This is a staple for every portfolio with great growth and a better dividend yield than any bank can offer at the moment. [https://ibb.co/cvMm8Md](https://ibb.co/cvMm8Md) / [https://ibb.co/FnYD1Y3](https://ibb.co/FnYD1Y3)\n\nAs I want to be diversified and exposed to recovery play I also picked the cruise line that I think will do best in the long run. So though Norwegian have diluted they’re shares a lot during this year, I belive not all cruise lines will survive and they will eat up market share when everything goes back to normal. So I don’t really care about the financials that much at the moment as this is a very long term pick. [https://ibb.co/tHDcrMY](https://ibb.co/tHDcrMY) / [https://ibb.co/PTqK0dj](https://ibb.co/PTqK0dj)\n\nNext Era Energy is the largest electric utility by market cap and has the world largest generator of renewable energy from wind and sun and stand to benefit a lot from a Biden administration that is why they are trading at such high multiples at the moment. The company also has an impressive yield of almost 2% [https://ibb.co/xjYVMx4](https://ibb.co/xjYVMx4) / [https://ibb.co/q9hjp48](https://ibb.co/q9hjp48)\n\nI also bought NetFlix as I believe them, Disney and Roku will be some of the largest players in the streaming business as traditional TV and cinema are a dying business at the moment.The company is trading at a premium but this is due to them dumping money in high quality content to grow they’re subscriber base while they also have steadily increase subscriptions cost in the last years. I believe they will do better next quarter and will see a re-test of all time highs. [https://ibb.co/VN2TF6f](https://ibb.co/VN2TF6f) / [https://ibb.co/B6j9zTn](https://ibb.co/B6j9zTn)\n\nI also own NIO more as a spec play to be well diversified in the EV world, I believe this is a long term investment as the stock price has gone up like bananas recently, the company will have to have perfect growth in the next couple of years to justify an increase in value as they are still losing money. [https://ibb.co/MZ2NL4v](https://ibb.co/MZ2NL4v) / [https://ibb.co/mt8f3ZR](https://ibb.co/mt8f3ZR)\n\nNike is my favorite apparel play as I believe it is the most desired my a lot of people and keeps expanding. I really like how the company is managed and I believe in them for the long-run. [https://ibb.co/jw1zjgj](https://ibb.co/jw1zjgj) / [https://ibb.co/RYR4QSP](https://ibb.co/RYR4QSP)\n\nNvidia is my favorite play in the semiconductor sector as they will continue to benefit from more and more personal pc sales as well as huge data center demand especially for they’re super performing products. They trade at a huge premium right now but I believe they can become the next trillion dollar company in the tech sector. [https://ibb.co/kgJS0w1](https://ibb.co/kgJS0w1) / [https://ibb.co/k8D1MSL](https://ibb.co/k8D1MSL)\n\nI also like owning Pepsico alongside Coca Cola as they are the two biggest players in the sector and I believe that they will both benefit a lot in the next years from the economy recovery. With pepsico offering a 2,7% dividend and a great growth path I really like owning this stock [https://ibb.co/2SY4xPY](https://ibb.co/2SY4xPY) / [https://ibb.co/Sdt2hGC](https://ibb.co/Sdt2hGC)\n\nPinterest is an up and coming social media platform that has a great ad friendly setup and could see growth in the next years. They are trading at insane PE ratios but that should catch up to the company in the future and I believe you must own it to be well diversified. [https://ibb.co/gwGFbyb](https://ibb.co/gwGFbyb) / [https://ibb.co/5TYz4KS](https://ibb.co/5TYz4KS)\n\nPalantir is a highly controversial name right now but its products and services are really good as they are earning more and more stamps of approval with government contracts while also expanding to commercial use. Financial info is not that good as the company barely reported they’re first earnings after the IPO. [https://ibb.co/fdQ42gc](https://ibb.co/fdQ42gc) / [https://ibb.co/wyTJSG2](https://ibb.co/wyTJSG2)\n\nPayPal is another great company that will do very well in the future as payments transition to a more digital approach and the company is transitioning to allow cryptocurrencies as well which will attract even more users. They have had a greet increase in revenue and eps in the last quarters and I expect that to continue to grow. [https://ibb.co/9tXxhJZ](https://ibb.co/9tXxhJZ) / [https://ibb.co/M5vCynn](https://ibb.co/M5vCynn)\n\nQualcomm is my favorite 5G play alongside apple as this will be a long cycle of upgrades for the communications services that will benefit them a lot.They are trading at an PE of over 30 but have great revenue and EPS growth while also offering an almost 2% dividend yield. [https://ibb.co/NFsnKqW](https://ibb.co/NFsnKqW) / [https://ibb.co/x5sJLW6](https://ibb.co/x5sJLW6)\n\nRoku is a great play for the hardware and subscription based services for digital media players and has huge tailwinds that will benefit them while the old TV cycle is dying. They have had a huge year over year revenue growth and subscribers growth that has passed the 40 million mark for the first time recently. [https://ibb.co/Fqd7sYP](https://ibb.co/Fqd7sYP) / [https://ibb.co/ccKqzkC](https://ibb.co/ccKqzkC)\n\nWhile SunRun is another great play for the new Biden administration as well as the transitioning to more renewable energy as they may see a huge boost in revenue growth and earnings with more money being pumped into the renewable sector. [https://ibb.co/0jr3TRg](https://ibb.co/0jr3TRg) / [https://ibb.co/NmdSdwP](https://ibb.co/NmdSdwP)\n\nEveryone also knows Starbucks, as I expect them to be a huge gainer on a improved US-China relationship so despite suffering a lot from this economy the stock is still up more than 16% in the last year while revenues have declined, expect this to bounce back by 2021-2022. [https://ibb.co/s5nTzQX](https://ibb.co/s5nTzQX) / [https://ibb.co/fDyhvX3](https://ibb.co/fDyhvX3)\n\nShopify is a multinational e-commerce cloud based platform for merchants like small and medium sized business so that can easily have an online store that they can manage payments for, orders inventory and much more. The company is trading at P/E’s that are crazy but the revenue and EPS growth is also amazing and has the potential for a lot more growth as the world is going more and more digital. [https://ibb.co/6nt4GhC](https://ibb.co/6nt4GhC) / [https://ibb.co/QbFhybt](https://ibb.co/QbFhybt)\n\nStore capital is a real estate investment trust that focuses on single tenant commercial real estate so they can negotiate much better rents and collections than other REIT. They are still more than 8$ under the highs and are a great diversification and yield giving stock to own. [https://ibb.co/XzBY41g](https://ibb.co/XzBY41g) / [https://ibb.co/TrGRZpR](https://ibb.co/TrGRZpR)\n\nAT&amp;T is one of the largest providers in the us and seems to be getting back on track after they have struggled in the past decade, they trade at only 8 times forward P/E and have one of the best dividend yields at more than 7% so I believe this is a must have staple in your portfolio that brings stability and cash flow. [https://ibb.co/cYcfYMm](https://ibb.co/cYcfYMm) / [https://ibb.co/8D3NzZr](https://ibb.co/8D3NzZr)\n\nWhile Target has been doing some amazing things as they operate as a general merchandise retailers and are doing some amazing things with online sales, they currently have seen a spike in the last months and are trading at a p/e of over 22 but I see them as a long term winner that offers both growth and value with a dividend yield of 1,5%. [https://ibb.co/Fzd8TMw](https://ibb.co/Fzd8TMw) / [https://ibb.co/NLnw4Lv](https://ibb.co/NLnw4Lv)\n\nWhile the other communication provider that I like is T-Mobile US which has seen a huge spike in user growth and are poised to do a lot of great things with the 5G cycle, they trade at a very high multiple for this sector but the growth expectations are huge for this company. [https://ibb.co/PCDFD38](https://ibb.co/PCDFD38) / [https://ibb.co/BTSzTMp](https://ibb.co/BTSzTMp)\n\nMoving on, one of the biggest gainers this year, TESLA is also one of my favorite companies to own as they continue to expand the products they offer and improve margins on vehicle, they are also expanding into more and more services, while manufacturing is growing exponentialy. They trade at insane P/E’s but they have just managed to be included in the SP500 so this may bring some stability to the stock as the company continues to grow in the next decade.[https://ibb.co/6rNJf6q](https://ibb.co/6rNJf6q) / [https://ibb.co/CWN6wD4](https://ibb.co/CWN6wD4)\n\nVisa is the biggest global payments technology company and is expected to continue to grow as more people start using cashless payment options, they are a great growth and value company for the future as cash payments is a dying proposition worldwide. [https://ibb.co/CVXgZD9](https://ibb.co/CVXgZD9) / [https://ibb.co/BPKxFfZ](https://ibb.co/BPKxFfZ)\n\nWal-Mart, the biggest employer in the US continues to do amazing stuff as they continue to expand they’re online presence and compete with Amazon as they trade at a 23 P/E and also offer a dividend yield. they are a great play alongside with Amazon which trades at much higher valuations. [https://ibb.co/Sr9s83J](https://ibb.co/Sr9s83J) / [https://ibb.co/0CvZKkD](https://ibb.co/0CvZKkD)\n\nWynn is another great recovery stock that I like as recently we found out that foot traffic in Macau has ramped up, this bolds well for the company as they will be one of the biggest gainers on the reopening. So if you are a long term investor you should get into this stock I believe. [https://ibb.co/6rk2qNQ](https://ibb.co/6rk2qNQ) / [https://ibb.co/mC35VPr](https://ibb.co/mC35VPr)\n\nZoom is the one company that I will be selling in the next couple of days. I know they are one of the best video conferencing apps out there, but I believe they will have a lot of problem due to a number of free apps that also offer great quality while the company is trading at insane p/e numbers. I know this trend is here to stay, but I thing there are far better play in the stock market out there rather than Zoom at this price point.  [https://ibb.co/T1tStb8](https://ibb.co/T1tStb8) / [https://ibb.co/rmxh0x3](https://ibb.co/rmxh0x3)\n\nI know I didn’t get into in-depth stuff, technical analysis, fundamentals and more but I will continue go more in depth with this stocks as time goes on. \n\nSo here how I want to make my portfolio look like when I have enough money to open all the positions. [TARGETED PORTFOLIo](https://ibb.co/CHWsb27)\n\nAs you can see a quarter of my portfolio will be invested in high quality companies that are pretty safe in my opinion. While over 45% of the portfolio will go to companies that I really like, that have a pretty low risk in my opinion and can offer great returns in the future. While I will also use about 22% of my portfolio into more risky companies that can bring very good profits for the portfolio but in my opinion are not as safe as the others. \n\nAnd finally I will invest about 7% of my portfolio into more speculative stocks or hedge stocks like Barrick Gold and Goldman Sachs. I don’t want to keep money on the sidelines at the moment as I expect the stock market will keep rising for a couple of years at a rapid pace due to the recovery of the economy.\n\nThank you everyone for reading! Hope you enjoyed the content!\n\nBe sure to leave a comment down below with your opinion on the matter of more or less stocks and other thoughts on the stock market!\n\nHave a great Thanksgiving and see you next time!",
        "subreddit": "StockMarket",
        "title": "Is over diversification bad? Are less stocks more profitable? Starting a new portfolio",
        "url": "https://www.reddit.com/r/StockMarket/comments/k1pb44/is_over_diversification_bad_are_less_stocks_more/",
        "created": 1606460165.0
    },
    {
        "author": "tellg1291",
        "created_utc": 1605113526,
        "id": "jsbp4r",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "I've always found eBay to have an interesting business model. The company has a great brand and a unique business model, but the stock had been struggling in the last 5 years (+68% vs +431% for PayPal) and the P/E sits below 7. \n\nThis should be a stock people flock to in a recession and also in a more eco-friendly era with second hand items being cool again. With other similar business models such as Etsy doing so well, why the tough love for eBay? \n\nSome numbers:\nIt generates $11.8 bil in revenues and more than $3.7 EBITDA, with above $2 bil. in Free Cash Flow and is not hugely in debt at $8.2 bil.\n\nThey’re also sitting on $3.7 bil. in cash, so they could bankroll a few startups and try to find the next PayPal. Is there a lack of leadership/vision to do so? \n\nOr does it simply come down to the potential for growth being limited, with a mature business model not scalable further? Does their business model simply lack opportunities to develop in new areas, since that they’ve spun off PayPal? Or is it the instability in the earnings that the market is discounting?\n\nDid Amazon steal their mojo? What are your thoughts?",
        "subreddit": "investing",
        "title": "eBay: why the tough love?",
        "url": "https://www.reddit.com/r/investing/comments/jsbp4r/ebay_why_the_tough_love/",
        "created": 1605142326.0
    },
    {
        "author": "Balland-Cocgoblir",
        "created_utc": 1605355137,
        "id": "ju0w81",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "The Chinese communist party recently smacked down Jack Ma, co-founder of Ali Baba, which literally cost billions of lost revenue in the “cancelled” IPO of Ant Financial (a sort of Chinese version of PayPal), because he publicly disagreed with the party.\n\nExcluding morality for one moment, there is CLEARLY a massive risk in investing in China. They are prepared to smack down their own – why would they care about you? They also have a history of trying to lock in money from leaving the country. Google it.\n\nChina is very short US dollars, the world’s currency for international deals. I.e. they will say / do what they have to, to get investment in. [https://www.youtube.com/watch?v=dQ8qFhq7pXQ](https://www.youtube.com/watch?v=dQ8qFhq7pXQ)\n\nEven with countless and repeating examples of terrible behavior (financially and morally), I see a countless sea of reddit users with “Should I Invest in BABA?” etc. Am aware its on multiple exchanges.\n\nChina does not play to the same rules the rest of the financial world does; resists / does not release financial statements, and lies constantly, and even bullies 1st world countries (Australia) but cutting off billions in exports across multiple industries, literally overnight, at will! Bless Australia, whom does not take kindly to getting bullied.\n\nGiven the above reasons and more, my personal bias is I cannot reward this behavior by pretending its fine - I now  go out of my way to avoid buying from China (at the shops etc), and sure as hell actively choose to not invest money into any companies there, even though I previously did.\n\n**Do you think investing in China is morally dubious - or totally fine?**\n\nPlease give your reasons - especially for the latter option.",
        "subreddit": "investing",
        "title": "Investing in China: Intelligent Investor or Unpatriotic maggot?",
        "url": "https://www.reddit.com/r/investing/comments/ju0w81/investing_in_china_intelligent_investor_or/",
        "created": 1605383937.0
    },
    {
        "author": "daninassar0",
        "created_utc": 1604694332,
        "id": "jpcp7c",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": " Here's my current portfolio:\n\nNYSE: WM 3%\n\nNYSE: BRK.B 12.5%\n\nNYSE: T 2 Stocks 25%\n\nNASDAQ: AMZN 8%\n\nNASDAQ: TSLA 8%\n\nNASDAQ: LOGI 6%\n\nNASDAQ: PYPL 3%\n\nNASDAQ: AAPL 12.5%\n\nNYSEARCA: VYM 6.25%\n\nNYSEARCA: VNQ 6.25%\n\nNYSEARCA: VOO 12.5% (These are approximate values)\n\nI'm thinking of buying a few stocks of NIO and Ali Baba, especially if Biden wins.\n\nCan anyone suggest anything to add/remove? (I am looking for long term growth)\n\nThanks!",
        "subreddit": "StockMarket",
        "title": "Anyone has any suggestions? (I'm looking to buy a few more stocks)",
        "url": "https://www.reddit.com/r/StockMarket/comments/jpcp7c/anyone_has_any_suggestions_im_looking_to_buy_a/",
        "created": 1604723132.0
    },
    {
        "author": "sjtomcat",
        "created_utc": 1604352835,
        "id": "jmwrbv",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Earnings coming out in a half hour so what does the stock do AH, it tanks ya makes total sense. That’s cool I yolod a 11/6 $200c cause no way does PayPal fuck up earnings right..... fml",
        "subreddit": "wallstreetbets",
        "title": "PayPal can piss off",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jmwrbv/paypal_can_piss_off/",
        "created": 1604381635.0
    },
    {
        "author": "super9090",
        "created_utc": 1605367968,
        "id": "ju3ok6",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "PayPal recently opened up currency trading on their platform. Within their first month they are at 85% of the trading volume that Binance has. PayPal's next earning report is going to be in February sometime. PayPal closed at 188 Friday and could see 250 if any of the fucking experts are right about this.\n\n\nYolo end of February calls?\n\n\n\nhttps://cryptobriefing.com/paypal-reaches-85-binance-us-volume-first-month/",
        "subreddit": "wallstreetbets",
        "title": "Paypal",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ju3ok6/paypal/",
        "created": 1605396768.0
    },
    {
        "author": "aMereMortalxxx",
        "created_utc": 1604520308,
        "id": "jo3up7",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Sup my stockbros. Sunday eve I [posted my plays](https://www.reddit.com/r/wallstreetbets/comments/jmbuff/i_draw_with_crayons_so_you_dont_have_to_this/) for the week and opened those positions Monday morning. Sitting on about $4k profits which I've closed out some and may or may not let the others ride out for a few additional percentage points. Think I might take out your wife for some nice lobster and then to pound-town to finish off a good week. My next play is absolutely free money and literally wont go tits up.\n\n**Weekend Plays**\n\nCRM - Salesforce: 100 shares @ $237 cost basis. Currently $251 per share and 6% profit or $1,400.\n\nDOCU: Sold 2x cash secured puts for $1,700 and closed them out this morning at $272 for $1,400 gain.\n\nJD: Sold 2x CSP for $640. Up $400 and will let the rest ride.\n\nPYPL: Sold 3x CSP for earnings and closed yesterday at $600 profit when the stock was flat in the morning.\n\nThese plays had minimal risk since the stocks would need to drop another 5-10% for me to be assigned. I knew mango man had my back and wouldn't let me down. Positions -Yes I'm using all the margin and buying power my account has to offer, but if I could use more I would since this put-selling is pretty fucking hard to fail at. \n\nhttps://preview.redd.it/g4tss1y23ax51.jpg?width=1125&amp;format=pjpg&amp;auto=webp&amp;s=4f0c4b547ee537007b8bed7e738750ef5fe19f1d\n\n&amp;#x200B;\n\n**Next earnings YOLO - QCOM**\n\nIt doesn't matter if you know what QCOM does or doesn't do. The only thing you need to know is that it's a solid company that has absolutely m00ned over the last 6 months. I entered a earnings YOLO selling yet more puts expiring this fucking friday. You might think selling puts is some pussy shit, but if you hate money then definitely don't do this.\n\nPOSITIONS: 2x cash-secured puts sold at $124 strike price collecting $440 US-DOLLARS. Expiring this Friday just in time for lobster and doing some ANALysis with your wife on the weekend.\n\nhttps://preview.redd.it/7jlo5ys14ax51.jpg?width=992&amp;format=pjpg&amp;auto=webp&amp;s=264d869879fde2a8643ee49dd64b8c5ce5c715b9",
        "subreddit": "wallstreetbets",
        "title": "$4k in realized gains from Sunday positions. Next earnings YOLO - QCOM",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jo3up7/4k_in_realized_gains_from_sunday_positions_next/",
        "created": 1604549108.0
    },
    {
        "author": "Super_Science_Guy",
        "created_utc": 1606233872,
        "id": "k07qfe",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Is anyone invested in this or wondered if it's worth a long term holding?  All it does is go up.   It's a concentrated actively managed ETF and it crushes the index.     Like, by a lot. Why doesn't it get more attention? \n\n&amp;#x200B;\n\n Facebook\n\nE**Lonza Group Ltd-**\n\n**Sartorius Stedim Biotech SA**\n\n**Hoya Corp**\n\n**Amazon.com Inc**\n\nF**acebook Inc**\n\n**Rentokil Initial**\n\n**Synopsys**\n\n**Lowe's Companies**\n\n**PayPal Holdings** \n\n**Generac Holdings**",
        "subreddit": "CanadianInvestor",
        "title": "Dynamic active global dividend ETF",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/k07qfe/dynamic_active_global_dividend_etf/",
        "created": 1606262672.0
    },
    {
        "author": "phoneSEXwitAblindGRL",
        "created_utc": 1606525895,
        "id": "k2dwmh",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "kind of a coincidence pltr has a massive private contract running analytics for an “unnamed space company” yet thiel and musk were both on the PayPal Mafia\n\nwhat im trying to say is this isnt a hype stock u fucking idiots dont look at your PLTR stock for 2 years. anything anyone on the paypal mafia touches turns to GOLD",
        "subreddit": "wallstreetbets",
        "title": "If you like SpaceX, invest in PLTR",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k2dwmh/if_you_like_spacex_invest_in_pltr/",
        "created": 1606554695.0
    },
    {
        "author": "spacattacking",
        "created_utc": 1606478586,
        "id": "k1zxez",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Humbl merger is looking very bullish and having George Sharp as an advisor should rocket this thing. It's an OTC Spac. Meeting for merger is Dec.9th. Humbl is the next PayPal in foreign unserved markets.",
        "subreddit": "SPACs",
        "title": "$TSNP/Humbl",
        "url": "https://www.reddit.com/r/SPACs/comments/k1zxez/tsnphumbl/",
        "created": 1606507386.0
    },
    {
        "author": "notbrokemexican",
        "created_utc": 1604421627,
        "id": "jndmns",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "[https://imgur.com/a/vEUrdJW](https://imgur.com/a/vEUrdJW)\n\nTotal:\n\n\\- 664 monthly in stock, using daily/weekly/biweekly recurring investments\n\n\\- 664 monthly in cash, with the intention to patiently accumulate and deploy when excellent opportunities arrive\n\nThis is a write up that discusses my portfolio after studying intensively for some time.  I have always loved investing but never had the means to be able to do it actively.\n\nI fully understand that active management does not always produce the best results. That is not my concern. I just sincerely love the process of discovery, analysis, and debate. It's hard to describe, investment research engages me similarly to playing the piano.\n\nI have three loose groups and I'm using a tiered system between them. The priorities may change, for example, industrials and manufacturing research may become my primary investment group by 2024-2028.\n\n1. Financial technology and services\n2. Cloud\n3. 4th generation industry\n\n&amp;#x200B;\n\nTier VI - 2 dollars monthly\n\n\\- CIBR Cybersecurity ETF\n\n\\- SOXX Semiconductors ETF\n\n\\- EWW Mexico ETF\n\n\\- XLB Materials ETF\n\n\\- GRID Smartgrid ETF\n\n\\- ARKQ Automation Technology ETF\n\n\\- BOTZ Robotics ETF\n\n\\- QCLN Energy ETF\n\n\\- Synchrony Financial\n\n\\- Prologis\n\n\\- Fastenal\n\n\\- Corteva\n\n\\- Uber\n\n\\- Zoom\n\n\\- Dropbox\n\n\\- Twitter\n\n\\- Shopify\n\n\\- Pinterest\n\n\\-  Activision Blizzard\n\n\\- Unity Software\n\nTier V - 8 dollars monthly\n\n\\- MercadoLibre\n\n\\- Facebook\n\n\\- Nintendo\n\n\\- Google\n\n\\- Tesla\n\n\\- Teradyne\n\n\\- Honeywell\n\n\\- Texas Instruments\n\n\\- Sony\n\n\\- Sherwin-Williams\n\nTier IV - 16 dollars monthly\n\n\\- Berkshire Hathaway\n\n\\- Apple\n\n\\- Cloudflare\n\n\\- Costco\n\nTier III - 32 dollars monthly\n\n\\- Bank of America\n\n\\- Kansas City Southern\n\nTier II - 64 dollars monthly\n\n\\- Visa\n\n\\- Microsoft\n\n\\- AMD\n\nTier I - 96-128 dollars monthly \n\n\\- Paypal\n\n\\- Square",
        "subreddit": "stocks",
        "title": "My Portfolio for 2020-2024",
        "url": "https://www.reddit.com/r/stocks/comments/jndmns/my_portfolio_for_20202024/",
        "created": 1604450427.0
    },
    {
        "author": "zergUser1",
        "created_utc": 1606332571,
        "id": "k0z0rf",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "I have taken some numbers from reports available online, firstly  \nIn May 2019, Citron exposed the problems at Jumia Technologies (JMIA) that included: \n\n• Discrepancies in financials between investor presentations and SEC filings   \n• Fraudulent orders   \n• A company burdened with inefficiencies   \n\n\nHowever, as Citron themselves have stated, now everything has changed. Starting an e-commerce business in an emerging market will have its challenges, the rewards can be great for patient investors as we’ve seen with MELI, BABA and SE. Over the past year, the pandemic has accelerated the global shift to e-commerce and JMIA has benefited from:   \n\n\n• Acceleration of e-commerce adoption by Nigerian consumers   \n• The renewed focus on profitability   \n• The rapid acceptance of fintech products in Nigeria including JumiaPay   \n• The ability to use JMIA has a platform for ancillary products    \n\n\nThere is no denying that the COVID-19 pandemic has accelerated e-commerce globally. JMIA is the key beneficiary as it is the only scaled e-commerce player in Africa. You can’t deny the numbers:   \n\n\n• 1.3 billion population   \n• 523 million internet users   \n• Fastest growing continent in the world that will account for &gt;50% of global population growth between now and 2050   \n• McKinsey estimates that Africa e-commerce will grow to a $75 billion market opportunity by 2025   \n• In Nigeria, over 40% of the population is under the age of 14 and over 50% of registered voters are under the age of 35   \n\n\nAs analysts have said, \"EITHER THESE YOUNG NIGERIANS WILL BE THE FIRST PEOPLE ON EARTH TO NOT ACCEPT E-COMMERCE OR THE STOCK IS GOING TO $100\"  \n\n\nJMIA Pay  \nOne of the largest criticisms of conducting e-commerce in Africa was the continent’s reliance on a cash economy, which is obviously not e-commerce friendly. JMIA has created their own digital currency – think PayPal, which now accounts for 24% of GMV and 36% of orders. Last month, McKinsey’s comments on the future of fintech can also be applied to e-commerce: “A youthful population, increasing smartphone penetration, and a focused regulatory drive to increase financial inclusion and cashless payments, are combining to create the perfect recipe for a thriving fintech sector.” The takeaway is no matter who wins in fintech, JMIA and e-commerce are winners.   \n\n\nForget about valuation and look more at significance. The country of Nigeria is dedicated to making e-commerce work to increase the quality of life of their growing and sizeable population. Consider this – JMIA is now shipping over 20 million packages a year to cities and rural areas across 11 countries. Nigeria is benefiting from the logistics network, technology and product offerings that JMIA has brought to this long overlooked part of the world. JMIA is at the epicenter of this movement and the only scaled e-commerce player in Africa.",
        "subreddit": "wallstreetbets",
        "title": "Why retards should consider JMIA with PLTR",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k0z0rf/why_retards_should_consider_jmia_with_pltr/",
        "created": 1606361371.0
    },
    {
        "author": "HowPedestrian",
        "created_utc": 1605730143,
        "id": "jwnb8s",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "PayPal about to pop. Look at that upward cooling the last week and a half... looks like a fucking spring about to blast to the mooooooon!!!! Jan 15 220C long dates bc I’m a pussy",
        "url": "https://i.redd.it/c7s335pl22061.jpg",
        "created": 1605758943.0
    },
    {
        "author": "vegaseller",
        "created_utc": 1606244972,
        "id": "k0bhss",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "130k in PLTR shares, 20k in calls. I am the paypal mafia now",
        "url": "https://i.redd.it/0xxu3gpdl8161.jpg",
        "created": 1606273772.0
    },
    {
        "author": "opensourcenetwork",
        "created_utc": 1605847936,
        "id": "jxiu4b",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "I'm looking for feedback as to how I should allocate a new investment account amongst companies I'm interested in - and have a medium/high risk tolerance.  This is for an investment account (have a 401K and IRA which are both mostly VTI and have me on track for a comfortable retirement - currently 34 years old).  \n\nI'm looking (in no particular order) at Microsoft, Visa, Tencent, NVIDIA, AMD, Google, Amazon, Alibaba, Tesla, Atlassian, PayPal.  Also curious about NIO and Palantir as less safe bets.  I'd also prefer to focus on 5-8 companies vs. all of those mentioned).\n\nIn the short/midterm, I'm interested also interested in DraftKings (as coming out of covid strongly) and Peloton (as more short term as I expect lockdowns to be coming back shortly). \n\nI'd love feedback on how more experienced investors would look at the above (recommendations welcome).",
        "subreddit": "investing",
        "title": "Retirement maxed out on VTI, investing in stocks for the first time and looking for feedback",
        "url": "https://www.reddit.com/r/investing/comments/jxiu4b/retirement_maxed_out_on_vti_investing_in_stocks/",
        "created": 1605876736.0
    },
    {
        "author": "Krishna0902",
        "created_utc": 1606455766,
        "id": "k1vbwx",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "For those who don’t know Peter thiel and Elon musk we’re both founder at PayPal and still buddies.\nThiel is the first investor or SpaceX. He don’t invest in TSLa because he was not sure sbi it the whole Green technology revolution.\n\nThiel was also the first investor on Facebook.\nThat guy in the movie “The social network” , anyone?\n\nThiel is one of the co founders at PLTR..\n\n\nhttps://youtu.be/6xemF3Y3eKA",
        "subreddit": "wallstreetbets",
        "title": "The PLTR -TSLa connection",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k1vbwx/the_pltr_tsla_connection/",
        "created": 1606484566.0
    },
    {
        "author": "boothy_96",
        "created_utc": 1604950797,
        "id": "jr4m5j",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Want to hear what the consensus might be on this topic. What are we thinking the effects a vaccine might have on companies such as PYPL, AMZN, PIN and other stocks that have done well from quarantine. Thoughts on what the immediate future will look like?",
        "subreddit": "stocks",
        "title": "Covid Vaccine effects on E-commerce (PYPL, AMZN....)",
        "url": "https://www.reddit.com/r/stocks/comments/jr4m5j/covid_vaccine_effects_on_ecommerce_pypl_amzn/",
        "created": 1604979597.0
    },
    {
        "author": "Htroll",
        "created_utc": 1606150115,
        "id": "jzl7xq",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Not sure if this is a good sub Reddit to ask this... I have spare 10£ and even PayPal account but I don't know in what and how to invest. Your advice and ideas?",
        "subreddit": "InvestmentClub",
        "title": "How do I invest 10$ ?",
        "url": "https://www.reddit.com/r/InvestmentClub/comments/jzl7xq/how_do_i_invest_10/",
        "created": 1606178915.0
    },
    {
        "author": "PikeEater47",
        "created_utc": 1604904764,
        "id": "jqsv7w",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Hello, everyone. I'm well aware as--with investing in general--there's a risk associated with it. However, for a long term investing perspective (for me, this is **5-10 years**), this is my portfolio. However, I'm going to list my portfolio down here and tell me what you guys think about it: \n\n$TSLA - 30%. I invested in TSLA because they are a multi-industry company, encompassing areas other than their known specialty--**EV creation**\\--such as A.I., renewable energy efficiency, IoT, transportation, and much more. \n\n$NIO - 15%. I am a big bull for NIO. Although the risk it carries in the short term is extremely high (due to high potential of regulation with the Chinese government as well as still unprofitable), this stock has extremely high potential in the long term to grow. It's potential of growth is being able to expand to other countries as well as it's BaaS and constant battery efficiency increases (people want EV cars that can drive for long distances). It's not only backed by the Chinese government, but by its policy as well. By 2025, 20% of new vehicles made in China will be electric vehicles. This will not only benefit NIO but other industries such as XPEV and TSLA. And when NIO expands to other countries who have adopted this policy, then I expect increases in $NIO's share price. In the short term, NIO has been unprofitable, but its financials show drastic improvements compared to previous years. The company is doing what it needs to do to grow and that's important to me.\n\n$ARKK - 15%. This is an ETF. Let me tell you right now, though. I think Cathie Wood is a genius. This ETF is a compilation of holdings of different stocks, and its principle holding is TSLA. However, it also has just a big of a hand in other areas such as finances (SQUARE, PAYPAL), and genetics (CRISPR, NVITAE). I think these **emerging markets** have a high potential for the future because they **increase the quality of life of the regular person, just like EVs do**. In the short term, I think banks will still have a hold in terms of managing a person's wallet, but in 5-10 years I can see *digital wallets* through square and paypal becoming principle. Moreover, CRISPR and NVITAE have a great potential. CRISPR and NVITAE not only aim to **extend the length of human life**, but moreso aim to **increase the quality of human life**. For those with inborn genetic diseases, the ability for CRISPR and NVITAE's gene manipulation technologies are able to 1. detect onset of disease early, 2. be able to identify therapies in conjunction with health care systems. I'm a registered nurse, although I've only been so for 2 years, and I can tell you: even a random person on the street can tell you that anything that can relieve chronic and acute ailments is good for humanity as a whole. \n\n$BYD (in the form of BYDDF) - 12%. $BYD is similar to $TSLA in that it doesn't focus on a single industry. I think where this stock shines is its ability to undercut day-to-day transportation. For example, the electric trucks that BYD manufactures and sells are less costly than the usage of train transportation, which is so much less costly than using the gas-powered trucks for transportation. Plus, it's backed by the legend himself, Warren Buffett. And if you look at the fundamentals yourself, they're been doing what they need to do to do great. They're vertically integrated and can keep up with supply/demand. I love 'em. \n\n$FINX - 8%. this is also an ETF similar to ARKK. However, it's focus is more on the emerging market in terms of financial (SQUARE, PAYPAL, etc). \n\n$DAL - 5%. Delta airlines stock. Right now, delta airlines has been down because of COVID. You and I both know from watching the news that all airline and transportation services have just been down because of the need to social distance and virus containment protocols. Nevertheless, prior to COVID this stock has been on a uptrend and its fundamentals have been great. **Do I think COVID will last forever?** No. With that said, I do think this stock will inevitable go back up and that hasn't been priced in yet. \n\n$AMZN - 10%. Bezos has been doing what he needs to make his company successful. Amazon is just like TSLA in terms of targeting more than one industry. While TSLA focuses on the technology side of things, Amazon focuses on the commercial goods and day-to-day needs/wants kind of thing. Their packaging system integrated technology like robotics with the monitoring of human beings. Their subscription gives you the best bang for your buck: Amazon prime gives you twitch prime, free and more timely deliveries, and so much more benefits. They are constantly looking into what they can do to undercut their service pricing. This company is a money making machine.\n\n$SBE - 5%. Last stock is SBE. Switchback energy. This stock will have a merger with Charge point (which is not publicly traded) in December, the leading manufacturer of charging stations which serve to charge up electric vehicles.  I see this stock skyrocketing if Joe Biden actually goes through with his promise that he will build 500,000 charging stations in America. 500k is ridiculous man. \n\n**Anyways, enough of me. Thoughts?**",
        "subreddit": "stocks",
        "title": "What are your opinions on my portfolio? (Below, I list the % of my portfolio per stock as well as why I decided to invest in it)",
        "url": "https://www.reddit.com/r/stocks/comments/jqsv7w/what_are_your_opinions_on_my_portfolio_below_i/",
        "created": 1604933564.0
    },
    {
        "author": "Youkiame",
        "created_utc": 1606470291,
        "id": "k1ya40",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "k bois listen, we pumped papa Elon to the second richest man on Earth (fuck bozos and his stupid 3k/share rain forest), THE richest man on Mars. Now we know Elon and Thiel are buddies and being the \"Don\" of the paypal mafia, our new dad papa Thiel's net worth is only about 5.7b, which is rookie number, weak af and we need to pump him to at least the 100b club. \n\nNow according to my 3s google research, Thiel owns about 8% of the PLTR stocks, so in order to pump him to 100b, we need PLTR to reach market cap of 1.25t, which puts it just between AMZN and GOOG, which is exactly where PLTR should be valued at. Currently PLTR has about 1.6b shares, so we need to pump the share price to about 781.25$/share for our new dad to be in the 100b club, so fucking easy considering we have already pumped TSLA to 2500+/share pre-split. LETS FUCKING GO BOIS. \n\ntldr: PLTR 2022 700c",
        "subreddit": "wallstreetbets",
        "title": "the only PLTR DD you guys need",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k1ya40/the_only_pltr_dd_you_guys_need/",
        "created": 1606499091.0
    },
    {
        "author": "Shaun8030",
        "created_utc": 1604364142,
        "id": "jn090k",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Disappointing drop after earnings. Holding long term but 6 percent dump after hours sucks. Square and PayPal have been taking it on the chin lately I know they had a great run so any negative news will lead to massive sell offs, when do you think they will stabilize .",
        "subreddit": "stocks",
        "title": "PayPal",
        "url": "https://www.reddit.com/r/stocks/comments/jn090k/paypal/",
        "created": 1604392942.0
    },
    {
        "author": "vitaq",
        "created_utc": 1606457833,
        "id": "k1vs4a",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "I'm thinking... Autonomous driving data? PayPal Mafia finally would reunite...\n\nPLTR 30c 11/27",
        "subreddit": "wallstreetbets",
        "title": "What are the odds that PLTR and TSLA get involved somehow?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k1vs4a/what_are_the_odds_that_pltr_and_tsla_get_involved/",
        "created": 1606486633.0
    },
    {
        "author": "dsli",
        "created_utc": 1605119994,
        "id": "jsdup0",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Currently, I have 30 shares of LYFT, some from January, some I added as the stock price crashed due to the obvious pandemic factors.  All in all averages out to a factor price of $40/share approx.  With the vaccine news and the news about food delivery plans to compete with Uber Eats, LYFT has been going up lately.  Is this a fluke or can we see the stock price realistically going up?  If the latter, should I consider selling at a target price in favor of another big stock like AMD/PYPL or something else or continue to hold until we go back to normal here?",
        "subreddit": "stocks",
        "title": "What might be the better move, hold LYFT or sell for a better stock?",
        "url": "https://www.reddit.com/r/stocks/comments/jsdup0/what_might_be_the_better_move_hold_lyft_or_sell/",
        "created": 1605148794.0
    },
    {
        "author": "fluffy_convict",
        "created_utc": 1606482325,
        "id": "k20qul",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "I am 40yo and have been investing for about a decade but only with about 5% of my savings and very irregularly. I now want to increase that percentage by a lot, so I have been doing a lot of reading, and here are some take-aways:\n\n* I will keep 12 months of living-costs as cash, and invest the rest\n* I am by nature risk-averse (need to be able to sleep at night), but partially also greedy of course (FOMO), so I want to strike a balance between the 2 in my investment strategy\n* This translates into preferring ETFs / diversification over individual stocks / concentration\n* Preferably, I will be able to strike a balance also between growing the portfolio(s) value over time, and gradually take out, instead of reinvesting, dividends.\n\nTaking all this into account, I was thinking to split my investments over multiple portfolios, that I can individually adjust according to the times and my ideas. I understand that taken together, it is in fact only one portfolio, but I mostly want to structure my thoughts. One can easily get overwhelmed how and where to invest in.\n\n**Portfolio 1: All Weather Portfolio (50% of all investments) - Low Risk**\n\nIn this portfolio, I replaced gold (GLD) and commodities (SGS) with VPU, because gold is set to probably decrease in price over the next years, and historically, commodities haven't performed all that well. State-regulated, well-run Utilities seem to be a better choice, also when I was back-testing. This portfolio is basically buy and hold.\n\n&amp;#x200B;\n\n|30%|VTI|Vanguard Total Stock Market Index Fund ETF|\n|:-|:-|:-|\n|40%|TLT|iShares 20 Plus Year Treasury Bond ETF|\n|15%|IEI|iShares 3-7 Year Treasury Bond ETF|\n|15%|VPU|Vanguard Utilities Index Fund ETF|\n\n**Portfolio 2: Growth Portfolio (25% of all investments) - High Risk**\n\nIn this portfolio, which may be adjusted more often, I want to follow trends in the world more closely. \n\n&amp;#x200B;\n\n|25%|ARKK|ARK Innovation ETF  |\n|:-|:-|:-|\n|25%|ARKF|Ark Fintech Innovation ETF |\n|25%|ICLN|iShares Global Clean Energy ETF|\n|25%|KARS|KraneShares Electric Vehicles and Future Mobility Index ETF|\n\n**Portfolio 3: Individual Stocks Portfolio (25% of all investments) - Medium to High Risk**\n\nIn this portfolio, I would buy individual stocks for a multiple of reasons: because they have a high dividend yield that I want to slowly start taking out, or because I feel the stock is highly undervalued, or just because I like the company. Below some of the tickers that I currently own.\n\n&amp;#x200B;\n\n|AMZN|MSFT|PLTR|DUK|\n|:-|:-|:-|:-|\n|KO|PYPL|CVX|O|\n\n&amp;#x200B;\n\nI would like to receive some feedback on this approach, and please don't spare me :) Is it too conservative or too high risk? Am I missing an assets class, or am I going wrong about it in any other way?",
        "subreddit": "investing",
        "title": "Tips wanted: Do you split your investments over multiple portfolios / strategies?",
        "url": "https://www.reddit.com/r/investing/comments/k20qul/tips_wanted_do_you_split_your_investments_over/",
        "created": 1606511125.0
    },
    {
        "author": "Zealousideal_Cod5187",
        "created_utc": 1605247048,
        "id": "jtbsjn",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "The answer is YES! You should. \n\nFirst , you have to buy some bitcoin , you can do this by using coinbase , then i recommend you to use [https://hiribi.org/](https://hiribi.org/) , you can sell your bitcoin here and then exchange them to your paypal balance , and receive more !\n\n xD , for example , i was searching on google like two nights ago for a bitcoin exchanger and i found out that hiribi is paying more on paypal , i gave it a shot and i exchanged 50$ and received 52$ ! \n\nIt pays you more with 20% :))\n\nIt made my day , i hope it do yours too &lt;3\n\nI recommend you to use it &lt;3",
        "subreddit": "investing",
        "title": "Should you invest in Bitcoin and make more money ?",
        "url": "https://www.reddit.com/r/investing/comments/jtbsjn/should_you_invest_in_bitcoin_and_make_more_money/",
        "created": 1605275848.0
    },
    {
        "author": "DharmaInitiative01",
        "created_utc": 1604943687,
        "id": "jr281g",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "I LOVED this morning dip. Spent a total of 12k between CRWD, Sq, znga, QQQJ, DDOG, pypl, wix, fvrr, u, and ATVI. \n\nI’ve been eyeing Logitech for a long term position but I spent my limit for the day. This one just keeps slowly sinking and if it continues until Friday i’m going to take a position. Outstanding company that just had a blowout earnings with A+ forward guidance into 2021. \n\nYou guys seeing any deals that are too good to be true?",
        "subreddit": "stocks",
        "title": "Logitech seems to be the best bang for your buck in my watchlist right now. What’s yours?",
        "url": "https://www.reddit.com/r/stocks/comments/jr281g/logitech_seems_to_be_the_best_bang_for_your_buck/",
        "created": 1604972487.0
    },
    {
        "author": "Running6498",
        "created_utc": 1606257115,
        "id": "k0fdsw",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Hey everyone. I was wondering if it'd be a better strategy to sell going into Thanksgiving, or to hold through the weekend. I've heard strong cases on both sides, but not sure how they'd effect my specific stocks. Right now the majority of my money is in BYND, PYPL, ELY and AMZN. I have small positions in other stocks but not enough to worry about. Just wondering what you guys are planning to do. Thanks for any suggestions.",
        "subreddit": "stocks",
        "title": "Take profits before Thanksgiving?",
        "url": "https://www.reddit.com/r/stocks/comments/k0fdsw/take_profits_before_thanksgiving/",
        "created": 1606285915.0
    },
    {
        "author": "like_buttah",
        "created_utc": 1606248036,
        "id": "k0cj99",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "I have an additional $1500 of savings I would like to invest in stocks. Currently debating between SQ and PYPL. Or possibly taking a risk a buying something like APHA or PLTR. Anybody have suggestions?",
        "subreddit": "stocks",
        "title": "Where would you invest $1500 right now?",
        "url": "https://www.reddit.com/r/stocks/comments/k0cj99/where_would_you_invest_1500_right_now/",
        "created": 1606276836.0
    },
    {
        "author": "UnusualW_Mod",
        "created_utc": 1604327240,
        "id": "jmoc44",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Historically, things have been bonkers. Even in the smoothest transition, there has been hoopla. Let’s look at George W Bush and Gore, and how the SNP reacted. [You can see it oscillated quite dramatically](https://twitter.com/unusual_whales/status/1322686773160337408?s=21), especially as announcements were made on winners and contentions. \n\nAmong the things to consider are the [earnings this week](https://twitter.com/unusual_whales/status/1323035089928773633?s=21). Among them are $PYPL, $UBER, and many, many more. Many joke “puts on all of them”, but with the volatility in the election, how do you think you’re going to play this week?",
        "subreddit": "options",
        "title": "Earnings and the election week",
        "url": "https://www.reddit.com/r/options/comments/jmoc44/earnings_and_the_election_week/",
        "created": 1604356040.0
    },
    {
        "author": "ChiefHobbyOfficer",
        "created_utc": 1605061186,
        "id": "jrzahr",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Looks like a promising SPAC. Targeting tech. No target announced. Trading near NAV, $10.20 as of today. Don’t see much chatter about it for some reason but Kevin Hartz is a rockstar. Anyone else watching this? \n\nMore details on the team - [https://www.a-star.co/governance/board-of-directors](https://www.a-star.co/governance/board-of-directors)\n\nAnyways...noticed a high spike in trading volume today:\n\n10 Day Avg - 17,923\n90 Day Avg - 13,029\nVolume Today - 301,916\n\nI’m not great with technicals. Anyone have eyes on happened today? Teamwork makes the dream work.",
        "subreddit": "SPACs",
        "title": "$AONE - Kevin Hartz Eventbrite co-founder, Xoom (acquired by PayPal) co-founder, early investor PayPal, Pinterest, Uber, Airbnb, Trulia - Unusually High Volume Today 11/10",
        "url": "https://www.reddit.com/r/SPACs/comments/jrzahr/aone_kevin_hartz_eventbrite_cofounder_xoom/",
        "created": 1605089986.0
    },
    {
        "author": "hom6872",
        "created_utc": 1604939533,
        "id": "jr0twm",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "PayPal is down around 5% today and Square around 2%.  Analysts were fairly bullish on both last week.  Now that Pfizer has announced a 90% effective vaccine, it appears we can see a little glimmer of light at the end of the COVID tunnel.  Anyone think these two are still a buy?",
        "subreddit": "investing",
        "title": "PayPal &amp; Square",
        "url": "https://www.reddit.com/r/investing/comments/jr0twm/paypal_square/",
        "created": 1604968333.0
    },
    {
        "author": "hellohello12345789",
        "created_utc": 1606691482,
        "id": "k3jmhp",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Fuck you piece of shit ebay, every month I have issues and PayPal has locked up my account with my ebay money that's supposed to go to robinhood to make it to tendy town.\n\nAnyway, they are stopping their partnership in January 2021 and that means they get service fees on all their transactions, I estimate this the add 50% to their bottom line as that's what paypal takes as a cut.\n\nEbay will surely gain.",
        "subreddit": "wallstreetbets",
        "title": "Ebay motherfucker",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k3jmhp/ebay_motherfucker/",
        "created": 1606720282.0
    },
    {
        "author": "ajahec",
        "created_utc": 1606041937,
        "id": "jytqjs",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Might be another lucky coffin or nicola.\n\nI see they make a lot of weird things like alcohol bottles instead of cars. (Drunk people aren’t allowed to drive but they sell cars which should be driven IRONIC RIGHT?) \nDoes that mean they have too many workers and need to outsource them so they have something to do because the demand for cars is too low? \n\nI have only seen about 1 Tesla at the same time on the streets. On YouTube I have seen only 2 Tesla’s at the same time. Which makes me think there aren’t as many sales as elon musky claims.\n\nAnd on battery day there were a lot of Tesla’s but I think it was a green screen because they didn’t move at all just honked and sounds can be added to the livestream also the honks were poorly timed which supports my green screen theory.\n\nIn order to verify my theory I will visit The gigafactory in Germany once it’s finished and count how many cars are produced. They might try to roll out cars more than once that’s why I will also count them by colors.\n\nMy work and this project will require a lot of money to see if Tesla is legit. Please anyone who is willing to contribute so I can provide evidence PayPal me money @ Nigerian_pretty_princess@notascam.nigeria",
        "subreddit": "wallstreetbets",
        "title": "Is Tesla real?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jytqjs/is_tesla_real/",
        "created": 1606070737.0
    },
    {
        "author": "iamvazu",
        "created_utc": 1604883031,
        "id": "jqnifq",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "[PYPL](https://stonklabs.xyz/options?fdate=MDEvMTAvMjAyMA==&amp;tdate=OC8xMS8yMDIw&amp;symbol=PYPL&amp;filters=&amp;exp=11/20/2020) [AMD](https://stonklabs.xyz/options?fdate=MDEvMTAvMjAyMA==&amp;tdate=OC8xMS8yMDIw&amp;symbol=AMD&amp;filters=&amp;exp=11/20/2020) [BABA](https://stonklabs.xyz/options?fdate=MDEvMTAvMjAyMA==&amp;tdate=OC8xMS8yMDIw&amp;symbol=ROKU&amp;filters=&amp;exp=11/20/2020) [NIO](https://stonklabs.xyz/options?fdate=MDIvMTEvMjAyMA==&amp;tdate=OC8xMS8yMDIw&amp;symbol=NIO&amp;filters=&amp;exp=11/13/2020) [AAPL](https://stonklabs.xyz/options?fdate=MDEvMTAvMjAyMA==&amp;tdate=MDYvMTEvMjAyMA==&amp;symbol=AAPL&amp;filters=&amp;exp=11/20/2020) [TQQQ](https://stonklabs.xyz/options?fdate=MDEvMTAvMjAyMA==&amp;tdate=OC8xMS8yMDIw&amp;symbol=TQQQ&amp;filters=&amp;exp=11/20/2020) [SPY](https://stonklabs.xyz/options?fdate=MjYvMTAvMjAyMA==&amp;tdate=OC8xMS8yMDIw&amp;symbol=SPY&amp;filters=&amp;exp=11/13/2020) [QQQ](https://stonklabs.xyz/options?fdate=MDIvMTEvMjAyMA==&amp;tdate=OC8xMS8yMDIw&amp;symbol=QQQ&amp;filters=&amp;exp=11/13/2020) [TSLA](https://stonklabs.xyz/options?fdate=MDEvMTAvMjAyMA==&amp;tdate=OC8xMS8yMDIw&amp;symbol=TSLA&amp;filters=&amp;exp=11/13/2020) [JD](https://stonklabs.xyz/options?fdate=MDEvMTAvMjAyMA==&amp;tdate=MDYvMTEvMjAyMA==&amp;symbol=JD&amp;filters=&amp;exp=11/20/2020) [INTC](https://stonklabs.xyz/options?fdate=MDEvMTAvMjAyMA==&amp;tdate=OC8xMS8yMDIw&amp;symbol=INTC&amp;filters=&amp;exp=11/20/2020) [MSFT](https://stonklabs.xyz/options?fdate=MDEvMTAvMjAyMA==&amp;tdate=OC8xMS8yMDIw&amp;symbol=MSFT&amp;filters=&amp;exp=11/20/2020) [NFLX](https://stonklabs.xyz/options?fdate=MDEvMTAvMjAyMA==&amp;tdate=OC8xMS8yMDIw&amp;symbol=NFLX&amp;filters=&amp;exp=11/20/2020) [COST](https://stonklabs.xyz/options?fdate=MDEvMTAvMjAyMA==&amp;tdate=OC8xMS8yMDIw&amp;symbol=COST&amp;filters=&amp;exp=11/20/2020) [ROKU](https://stonklabs.xyz/options?fdate=MDEvMTAvMjAyMA==&amp;tdate=OC8xMS8yMDIw&amp;symbol=ROKU&amp;filters=&amp;exp=11/20/2020) [ACB](https://stonklabs.xyz/options?fdate=MDEvMTAvMjAyMA==&amp;tdate=OC8xMS8yMDIw&amp;symbol=ACB&amp;filters=&amp;exp=11/20/2020) [TLRY](https://stonklabs.xyz/options?fdate=MDEvMTAvMjAyMA==&amp;tdate=OC8xMS8yMDIw&amp;symbol=TLRY&amp;filters=&amp;exp=11/20/2020) [SPCE](https://stonklabs.xyz/options?fdate=MDEvMTAvMjAyMA==&amp;tdate=OC8xMS8yMDIw&amp;symbol=SPCE&amp;filters=&amp;exp=11/20/2020)",
        "subreddit": "wallstreetbets",
        "title": "11/13/20 &amp; 11/20/20 Option Trends",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jqnifq/111320_112020_option_trends/",
        "created": 1604911831.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1605881614,
        "id": "jxppxu",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "**What are the latest news from the stock market? What happened yesterday? Mnuchin cuts the FED’s programs and more, let’s talk about it**\n\nHey everyone and Welcome, so let’s start with the recap of yesterday as we saw the Nasdaq composite  \n[CHART](https://ibb.co/FK78S5n) leading the way, up more than 0,8%, the S&amp;P500 [CHART](https://ibb.co/kXKdY1g) also finishing up 0,4% and the Dow Jones Industrial Average [CHART](https://ibb.co/9Y0K4SY) barely finishing in the green on the late broad stock market rally as early day losses were cut when the stimulus bill talks seemed to have resumed in congress as this eased investor’s worries, this reversed sharply after the treasury secretary announcement after hours though, as the futures of the SP and Dow futures slipped more than half a percent. [FUTURES](https://ibb.co/sFPq0sm) / [STIMULUS NEWS](https://ibb.co/xD0Qvzt)\n\nThe VIX continued to remain steady and remains in the clear downtrend started at the end of September as it dropped more than 3% again yesterday. [VIX CHART](https://ibb.co/q5tFDtr) [VIX CHART](https://ibb.co/LkF9ypR)\n\nWe saw more than 60% of the companies advancing on way below volume average as investors [CHART](https://ibb.co/kh4BLQX) are waiting to see what the next days and weeks brings us, as Pfizer is expected to apply for the FDA authorization today [NEWS](https://ibb.co/w6MQ4Tp) while huge uncertainty remains with the big spike in cases of COVID-19 in the US and a fiscal policy that remains uncertain until the change in Presidency. as yesterday the treasury declined to extend 5 of the FED’s cares act emergency programs that expire at the end of the year with the most important ones being: the main street lending facility, the corporate bond purchases and the municipal bond purchases. This is not such a big thing in context as this programs have only accounted for about 25 billion$ in lending. [NEWS](https://ibb.co/tCzg4t7)\n\nThere was a pretty even distribution of growth in all of the sectors yesterday as only utilities finished in the red with large-cap value companies being the laggards of the stock market. [CHART](https://ibb.co/vPXgVJM) / [SECTORS](https://ibb.co/smy0dhn)\n\nHere is the heat map [CHART](https://ibb.co/3s4c3tg) from yesterday as the big tech companies like Apple, Amazon, Google and Microsoft finally turned positive and led the stock market higher as this companies account for about 20% of the SP500, this is not the first time that the index has been dominated by just a few players, as 40 years ago IBM, AT&amp;T, Exxon and GM made up for about 19% of the index. Though Tesla is soon joining the biggest player in the SP as they will account for about 1,3% of the index when they will be added this December. [SP HISTORY](https://ibb.co/rM846BS) / [SP FUTURE](https://ibb.co/wZnGQq3)\n\nYesterday was the first time in more than a month that the initial jobless claims came in higher than the previous week as 742 thousand people filed for benefits, this was up more than 30k from the previous week and well above the 707 thousand forecasted. This is still more than 3 times higher than pre-pandemic numbers Though better data came in from the continuing claims as they fell to 6,37 million, a number lower than the previous week of 6,8 million and lower than what was forecasted at almost 6,5 million. [JOBLESS CLAIMS](https://ibb.co/521qtyd)\n\nWhile better numbers came in as the existing home sales saw a huge spike of more than 4% as they continued to rise for a fifth straight month as the Philly fed outlook also came in well above the expectations. [FED OUTLOOK](https://ibb.co/HpWKHj2) / [HOME SALES](https://ibb.co/0YyqjWm)\n\nThe stock market may see another great moment when the European Union might approve the vaccines from Pfizer and Moderna in the next month as well. [NEWS](https://ibb.co/8KjgNyR)\n\nAlso, today it is expected that Georgia will formally certify Biden’s victory, as this will pretty much put an end to Trump’s legal fights and will bring more stability to the economic policy expectations for the future. [NEWS](https://ibb.co/m5fYKcQ)\n\nSome stock market companies news came in as We saw Roku yesterday hitting new all-time highs as even bearish players start to notice the huge tailwind and boost the pandemic has given to a lot of companies. Roku rose more than 10% yesterday after this news and continues to keep growing as the decline in traditional TV continues to go on while they are also close to brining HBO Max directly to they’re platform. [ROKU - HBO](https://ibb.co/txyH21M) / [ROKU UPGRADE](https://ibb.co/kqcpH93)\n\nAlso Nvidia will provide Fortnite players an alternative of playing on IOS devices through it’s GeForce gaming, which will mark the return of Epic Games on Apple products as they continue they’re legal battle. [NVIDIA NEWS](https://ibb.co/994HKt1)\n\nWhile GM announced they will get back in the car insurance game with vehicle data providing crucial information and benefits for the company, this is exactly what Elon Musk said about Tesla getting into the insurance game as he expects that to be a huge part of Tesla in the future. [GM NEWS](https://ibb.co/Rc9BXwb)\n\nAnd as dividends go, PEPSICO and Home Depot just announced quarterly dividends with yields in line with previous. [HD DIVIDEND](https://ibb.co/yqyTr16) / [PEPSICO DIVIDEND](https://ibb.co/1LShBhm)\n\nI believe there are a lot of great opportunities to buy Stocks right now as I believe companies like PayPal, Roku, Amazon, Tesla, Target and many more still have room to run by the end of the year. In the coming days I will post my new portfolio composition and targets and I will get a little more on why I chose to buy those companies.\n\nThank you everyone for reading! Be sure to leave a comment down below with your expectations on the stock market!",
        "subreddit": "stocks",
        "title": "Stock market news today | Treasury cuts funding for FED programs | Stimulus talks back on the table? [11-20]",
        "url": "https://www.reddit.com/r/stocks/comments/jxppxu/stock_market_news_today_treasury_cuts_funding_for/",
        "created": 1605910414.0
    },
    {
        "author": "TheFTWtryhard",
        "created_utc": 1604287970,
        "id": "jmg9l7",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "How you ask?\n\nWell since no money check from Powman, people are broke broke. Where do they go, PayPal to get some monei monei so PayPals digitell prenter is go vroom vroom.\n$PYPL 250c 11/20/20\n\n11/20 = 4 + 20 = 420\n\nBoom delta gang gonna bang theta gang in a gang bang so bang bang.",
        "subreddit": "wallstreetbets",
        "title": "What if $PYPL paid you?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jmg9l7/what_if_pypl_paid_you/",
        "created": 1604316770.0
    },
    {
        "author": "MainBandicoot7",
        "created_utc": 1605036836,
        "id": "jrrrde",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Someone tel me that all these look just awesome and I’ll be collecting 1000% shortly 🧐🥴",
        "url": "https://i.redd.it/5snoial1tgy51.jpg",
        "created": 1605065636.0
    }
]