[
    {
        "author": "WannabeStonks69",
        "created_utc": 1600231524,
        "id": "itp1es",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "**Alliance Data Systems: A Special Situation Value Proposition**\n\nTl;dr ADS’s revenue hasn’t suffered much, but cash flows and income have due to debt restructuring which has changed valuation metrics significantly, but this may not be something to worry about but rather something to take advantage of.\n\nAlliance Data systems is a provider of private label credit cards to retail businesses like Ulta, Victoria’s Secret, Pottery Barn, J.Crew, Eddie Bauer, IKEA etc. and Alliance owns LoyaltyOne which runs Air Miles (been damaged severely, duh), and has partnerships with several other global retailers. Alliance attempts to capture transaction data to help companies create marketing strategies and to help understand what their consumer base wants and needs, they’re entire mission is centered around making sure producers are able to reduce their costs, focus on making products that are wanted, and improve their bottom line. \n\nAnalysis of consumer data is obviously very lucrative and several companies thrive off of this alone, but ADS will almost be a FinTech+Marketing company combined which will possibly revive it into the growth stock it once was promised to be.\n\nAlliance is partly a credit services/marketing company, so the structure of the company is a bit complex, but I’ll try to demystify the financials here soon. \n\nFirst I’d like to point out that Alliance is a plateauing company in terms of the top line; revenue:\n\nhttps://preview.redd.it/c06npxsuufn51.png?width=250&amp;format=png&amp;auto=webp&amp;s=5ee6c3d4e73e23f7621f66b436adecdfa5ced530\n\nYou can see here that for the past 3 years revenue has seemed relatively flat, and why this isn’t that bad is because Alliance is shedding some weight. Just last year they sold Epsilon, a small marketing division that was losing sales for 3.5B in cash ([https://www.bizjournals.com/dallas/news/2019/04/16/alliance-data-epsilon-publicis-groupe.html](https://www.bizjournals.com/dallas/news/2019/04/16/alliance-data-epsilon-publicis-groupe.html)) and they intended on using the proceeds to deleverage and redistribute cash to shareholders via a dividend hike. This may make the company seem weak, but Epsilon was a terrible fit for Alliance’s private credit based services, and the extra cash will be really helpful for their future plans. It was a perfect time to spin off and get rid of a dead limb, which they finally did. A big reason why net income was down so much this past year but revenue was not is because of this sale and its fees along with debt restructuring, which increased expenses by a great deal as you will see below, and a lot of this expense was spread throughout other expenses as well: \n\nhttps://preview.redd.it/fnczngzwufn51.png?width=535&amp;format=png&amp;auto=webp&amp;s=ffcb28fdcf6a8731220c6ddb86830eb02d67cbc1\n\n&amp;#x200B;\n\nThose 3 lines before adjusted EBITDA added a lot to their expenditures, and the income from the continuing operations was partly lower because of earlier OpEx increases most likely attributed to both debt restructuring and the selling of Epsilon.\n\nHere’s what I mean by a change in debt, financing cash flows have declined a lot, which makes overall cash flows look a lot lower, therefore scaring investors.\n\nhttps://preview.redd.it/eo1uf17zufn51.png?width=618&amp;format=png&amp;auto=webp&amp;s=1fa5733fe5fd4c0b1037f40e1983b61a3a425a45\n\nOn top of that, they recently paid off a large amount of debt and increased invested cash flows\n\nhttps://preview.redd.it/ysqh6148vfn51.png?width=526&amp;format=png&amp;auto=webp&amp;s=771dfe50383b7b7a144e5d5219543640c0605397\n\nThey also had lower defaults for their private credit cards in 2019, resulting in more healthy debt for the company. \n\nhttps://preview.redd.it/h8a86ay9vfn51.png?width=600&amp;format=png&amp;auto=webp&amp;s=b2be4684f013988dbf052e0404b15edf7001b33a\n\nNow let’s look into some basic fundamentals of the finances outside of the situation going on right now\n\n&amp;#x200B;\n\n[Low SGA\\/Gross profit therefore decreasing expenses relative to growth](https://preview.redd.it/zikqh0qcvfn51.png?width=375&amp;format=png&amp;auto=webp&amp;s=595b8e0a8fa0526dd6ecdbd9bdcd1db1f660042a)\n\n&amp;#x200B;\n\n[Increasing gross profits for the past few years](https://preview.redd.it/592fcpzevfn51.png?width=396&amp;format=png&amp;auto=webp&amp;s=3d96e038ef6692cbf2f1a513d8a395c1cc411223)\n\n&amp;#x200B;\n\n[Increased cash has resulted in a dividend hike from 2.28 to 2.52 this year](https://preview.redd.it/u39q0czhvfn51.png?width=415&amp;format=png&amp;auto=webp&amp;s=a0ad3dbe9aaed1306bdf53fa9662e40d875c507a)\n\n[Big decrease in long term debt, and we should see this go lower in the future as well.](https://preview.redd.it/z1jnyz04wfn51.png?width=434&amp;format=png&amp;auto=webp&amp;s=4191bb238f3d4dd2fc52260f6e79a448f64de281)\n\n&amp;#x200B;\n\n[Low Enterprise Value-Sales ratio, always a good buy in indicator](https://preview.redd.it/pduggpd6wfn51.png?width=372&amp;format=png&amp;auto=webp&amp;s=cc3822c623dae41daff7162a644e78ec20e1272a)\n\n&amp;#x200B;\n\n[Super low price\\/sales despite mostly stable sales numbers](https://preview.redd.it/brtinjc8wfn51.png?width=431&amp;format=png&amp;auto=webp&amp;s=c8987a9da5dd9bca2a9c88f67c4bc5b2dfe1c1ac)\n\nAlso ADS has a P/E of only 7.4, a forward P/E of just 4.1, a Price/Cash ratio of 0.43, and a Price/FCF of only 2. This along with the fact that competitors FIS,GPN,FISV,PCOM have way higher valuation multiples and the fact that ADS has very low WACC due to its primary financing being debt financing makes it a no-brainer for the average Joe value investor, because analyst targets are currently setting the price for this one at 62$. Not only that, but most conservative estimates of its intrinsic value will show it to be around the 80$ range. But I also think that this stock has major growth potential because instead of being a super asset and debt heavy company, ADS will now focus more on the data and service side of their business, making them a FinTech firm of sorts. They are big enough to be able to finance any sort of project that leans more into data analysis and tech, plus they have broad global overreach in the Middle East, Asia, and Europe where it’ll be easier to transfer their new lightweight business platform. But deleveraging can be a very difficult process, and it’s definitely not without pitfalls. Since this is a pretty big company that’s in the S&amp;P 500 though, they have more than enough cash to fall back on if this restructuring doesn’t go as planned, and while 2019 was shaping out to be a decent year for ADS, if you see the most recent 10-Q, there is a lot of impact from COVID on their margins, with revenues falling by 50% from the same quarter last year:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/66fptqmbwfn51.png?width=476&amp;format=png&amp;auto=webp&amp;s=cf054135e2c19eabfd1f78b37c163accdfcff348\n\nBut in my opinion, this just makes it a better buying opportunity. This is one of those really heavily damaged companies in a very damaged industry that’s got a lot of growth potential up its sleeve. At this point, I don’t know how much of a short term prospect there would be for the share price itself, but there’s a lot cooking underlying the price that may not be so obvious to investors. I think the panic selling has created a great storm for the value investor to rake up this stock at a huge discount price. It may continue to see more downturn still, but so far it seems relatively stagnant and just waiting for this bump in the road to come to an end. \n\nLMK if you have any experience with them below\n\nTl;Dr, If you have no idea when this'll moon and you love gambling on whether or not this'll be like SQ buy calls for whenever, probably LEAPs. but overall mad undervalued so buy shares for your ROTH if you have some extra cash laying around",
        "subreddit": "wallstreetbets",
        "title": "ADS DD, for the boomers and degens both",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/itp1es/ads_dd_for_the_boomers_and_degens_both/",
        "created": 1600260324.0
    },
    {
        "author": "stoplossinvestor_98",
        "created_utc": 1599378959,
        "id": "ini6wh",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[https://stoplossinvestor.com/mastercard-massive-growth-potential-in-the-payments-space/](https://stoplossinvestor.com/mastercard-massive-growth-potential-in-the-payments-space/) Mastercard manages and licenses payment card brands including MasterCard, Maestro and Cirrus. The company generates revenues from the fees it charges its customers for transaction processing and other payment-related services. It also earns revenues by charging customers for assessments based on the gross dollar volume (GDV) of activity on the cards that carry MasterCard brands. The company operates a unique and proprietary global payments network that links issuers and acquirers around the globe to facilitate the switching of transactions, permitting account holders to use a Mastercard product at millions of acceptance locations worldwide. Its core network facilitates an efficient and secure means for receiving payments, a convenient payment method for consumers to access their funds and a channel for businesses to receive insight that is derived from its network. Mastercard authorizes, clears, and settles transactions through its core network for issuer customers in more than 150 currencies and more than 210 countries and territories.\n\n# Reasons To Buy Mastercard\n\n***Mastercard’s strategic acquisitions, alliances and technology upgrades, along with product-diversification and geographic-expansion initiatives predict long-term growth.***\n\n# Reasons To Sell Mastercard\n\n***Higher expenses, high rebates and incentives might drag the company’s margins.***\n\n## Comment below and share your thoughts. If you want to read more stock analyses, please visit my website @[stoplossinvestor](https://stoplossinvestor.com/).",
        "subreddit": "investing",
        "title": "Mastercard: Massive Growth Potential In The Payments Space.",
        "url": "https://www.reddit.com/r/investing/comments/ini6wh/mastercard_massive_growth_potential_in_the/",
        "created": 1599407759.0
    },
    {
        "author": "stoplossinvestor_98",
        "created_utc": 1599534420,
        "id": "iolzgb",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Mastercard manages and licenses payment card brands including MasterCard, Maestro and Cirrus. The company generates revenues from the fees it charges its customers for transaction processing and other payment-related services. It also earns revenues by charging customers for assessments based on the gross dollar volume (GDV) of activity on the cards that carry MasterCard brands. The company operates a unique and proprietary global payments network that links issuers and acquirers around the globe to facilitate the switching of transactions, permitting account holders to use a Mastercard product at millions of acceptance locations worldwide. Its core network facilitates an efficient and secure means for receiving payments, a convenient payment method for consumers to access their funds and a channel for businesses to receive insight that is derived from its network. Mastercard authorizes, clears, and settles transactions through its core network for issuer customers in more than 150 currencies and more than 210 countries and territories.\n\nReasons To Buy Mastercard\n\nMastercard’s strategic acquisitions, alliances and technology upgrades, along with product-diversification and geographic-expansion initiatives predict long-term growth.\n\nReasons To Sell Mastercard\n\nHigher expenses, high rebates and incentives might drag the company’s margins.\n\nComment below and share your thoughts. If you want to read more stock analyses, please visit my website @stoplossinvestor(https://stoplossinvestor.com/).",
        "subreddit": "investing_discussion",
        "title": "Mastercard: Massive Growth Potential In The Payments Space.",
        "url": "https://www.reddit.com/r/investing_discussion/comments/iolzgb/mastercard_massive_growth_potential_in_the/",
        "created": 1599563220.0
    }
]