[
    {
        "author": "itsgoggles",
        "created_utc": 1600084781,
        "id": "isjhhq",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": " ***$TSLA:***\n\nThe annual meet of Tesla shareholders, also known as Battery Day, was earlier postponed due to the ongoing pandemic. Ahead of Battery Day on September 22, Tesla CEO Elon Musk has given a hint as to what is to be expected. He took to Twitter to share a one-liner message: ‘Many exciting things will be unveiled on Battery Day 9/22’.\n\nEarlier, Elon Musk had suggested that Tesla may be able to mass produce longer-life batteries with 50% more energy density in three to four years. Musk may also revealed details about his company’s Roadrunner project, a proprietary battery cell manufacturing process, which debuted early this year. As investors look to Battery Day that is expected to showcase Tesla's latest improvements, the company still faces a long development path requiring huge investment if it is to durably challenge the world's biggest manufacturers.\n\nTesla religiously has pre-anticipatory runs for all major news events, look at the past few quarterly earnings as well as the weeks coming up before the stock split. Excited to ride the hype into battery day.\n\n&amp;#x200B;\n\n[Still waiting for direction to become more apparent.](https://preview.redd.it/p5tkw1gdr3n51.png?width=1630&amp;format=png&amp;auto=webp&amp;s=628ab18a6abcc635de650aa10aaadd93f26233fd)\n\n ***$CSIQ:***\n\n07:39 AM EDT, 09/11/2020 Canadian Solar (CSIQ) on Friday priced an offering of $200 million of convertible senior notes due 2025. The initial conversion rate of the notes is 27.2707 shares per $1,000 principal amount of notes, which is equivalent to an initial conversion price of $36.67 per share and represents a 32.5% premium above the Sept. 10 closing price. The company has granted initial purchasers a 30-day option to buy up to an additional $30 million of the notes. The solar power company said it will use the net proceeds for general corporate purposes.\n\nThe Company expects to close the offering on or around September 15, 2020, subject to the satisfaction of customary closing conditions. Canadian Solar has had quite a year, and with the recent market pullback this is finally my chance to get in on this run. Previously trading at $34+ on September 2nd, looking to swing this back into the $30’s. Currently around $28/share.\n\n&amp;#x200B;\n\n[Trend reversal confirmed w\\/ Volume](https://preview.redd.it/g7zph8ihr3n51.png?width=1633&amp;format=png&amp;auto=webp&amp;s=f9153edc4b8013b1f396d00c57c920f021733d62)\n\n ***$HHT:***\n\nAnother returner to my watchlist. NEW YORK ,  Sept. 14, 2020 Color Star Technology Co., Ltd.  (Nasdaq CM: HHT) officially broadcasted the Color World Online Concert to audiences around the globe via its official platform \" Color World \" at  9 pm Eastern Time  on  September 9th . The Color World Online Concert attracted over half a million viewers from mainland  China  and all over the world. Global Social media networks reached over 10 million hits.\n\nMore than ten international celebrities including  Grammy -winning jazz guitarist  Larry Carlton , \"Pop Music Queen\" Na Ying from mainland China , Hong Kong's legendary singer George Lam, globally-renown pianist Wu Muye, R&amp;B singer-songwriter Ashanti, among others, presented a music feast with remarkable international flavors. Combining showcase performances with proprietary tech tools, the event was equally memorable for moving vocals and masterful instrumentals as well as its sheer technological reach.\n\nWhile the performers took center stage, investors saw yet another emergence of the future's star economy of educational and entertaining content-sharing. Color Star  is not only in the business of online concert promotions, it is a technology-driven company set to break past the boundaries between celebrity entertainment and online knowledge-sharing.\n\nOn its signature platform, Color World, international artists and celebrities have been assembled to produce content that extends beyond a show and more so a variety of courses. More than 40 industry leaders have transitioned from celebrities to celebrity tutors—with the service granting fans access built around mentorship, not just viewership. The courses include music and instruments, film and television, traditional and modern art, and sports, etc.\n\nWe have seen a floor and support line forming around the .68 cent mark. Previously called this one around .70cents before running over 100%. Will be getting a position today.\n\n&amp;#x200B;\n\n[Patterns](https://preview.redd.it/yj4vwnlmr3n51.png?width=1622&amp;format=png&amp;auto=webp&amp;s=7804b07a7a75ae2e9fa7823b37123555532a4ba2)\n\n ***$PLG:***\n\nVancouver, British Columbia and Johannesburg, South Africa--(Newsfile Corp. - September 14, 2020) - Platinum Group Metals Ltd. and subsidiary Lion Battery Technologies Inc. (\"Lion\") reports that the U.S. Patent and Trademark Office has issued Patent No. 10,734,636 B2 entitled \"Battery Cathodes for Improved Stability\" to Florida International University (\"FIU\"). Under a sponsored agreement (the \"Sponsored Agreement\"), Lion has exclusive rights to all technology being developed by FIU included patents granted.\n\nThe patent includes the use of platinum group metals and carbon nanotubes and other innovations in a lithium battery.\n\nLion was jointly formed in 2019 by Platinum Group and Anglo American Platinum Limited (\"Anglo American Platinum\") to accelerate the development of next-generation battery technology using platinum and palladium. Under the Sponsored Agreement, research and patent applications are being funded to unlock the potential of Lithium Air and Lithium Sulfur battery chemistries by using the catalytic properties of platinum and palladium. Research is led by Dr. Bilal El-Zahab who completed post doctoral work at MIT along with a team that includes six specialist nano-materials and battery post doctoral fellows. The team at FIU has completed the first year of research and surpassed their first technical milestone. Further patent applications have been filed.  \nThis is a sympathy play for upcoming battery day. The price action has been relatively bearish up until after hours Friday where we are seeing signs of a potential breakout. \n\n&amp;#x200B;\n\n[Battery Sympathy Play](https://preview.redd.it/g7pnvrvrr3n51.png?width=1625&amp;format=png&amp;auto=webp&amp;s=958c35569d589449d6febc5e34316f1aee48855b)\n\n**Never forget to do your own DD; remember: For all you know, all the stocks that I mention here will dip 90% tomorrow; Do your own DD, I'm not some magic fairy. Trading will never come this easy to you. If all the stocks on here went up, I'd be chilling on my own Island.** Find the rest of our watchlist at discord.gg/TemplarTrading",
        "subreddit": "pennystocks",
        "title": "September 14th | Templar Trading Daily Watchlist",
        "url": "https://www.reddit.com/r/pennystocks/comments/isjhhq/september_14th_templar_trading_daily_watchlist/",
        "created": 1600113581.0
    },
    {
        "author": "itsgoggles",
        "created_utc": 1599566998,
        "id": "iose1s",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": " **Daily Watchlist September 8th**\n\n***$SPXS, $SQQQ, $LABD:***\n\nWhen the overall market is tanking, these are the plays you want to make. If you had played $SQQQ Thursday and Friday, you would have been able to take advantage of the panic and short the market. Be aware for future market dips.\n\n&amp;#x200B;\n\n[Inverse ETF](https://preview.redd.it/oakyx0700xl51.png?width=1623&amp;format=png&amp;auto=webp&amp;s=73258066e998e47338dec78dd6acf2bf264eeb45)\n\n **$HHT:**\n\nBefore I left for vacation, I had called out Color Star Technology on a previous watchlist. It ended up running from .65 cents all the way to $1.43 before gradually following alongside the overall market next week. According to the charts, I’m seeing a new floor around .84 cents, and on Friday the 4th we saw confirmation of trend reversal. This was caused by the positive reception of Color Star’s new product launching conference in Beijing.\n\nAnother highlight of the conference is the upcoming \"Fearless, Color World\"  Cloud Concert . According to the sponsor,  Color Star , the concert invited 11 international idol stars to join the lineup including  Larry Carlton ,  Wiz Khalifa , Machine  Gun Kelly , R&amp;B Black  Pearl Ashanti S. Douglas , Mainland China's \"Pop Queen\" Na Ying,  Hong Kong's  legendary singer Lin Zixiang, and international Piano artist  Wu Muye , Taiwanese group \"ID&amp;MASA\", Japanese idol Lin Longtai, Chinese young singer  Zhu Zhihao , and top 100 DJs  Dimitri Vegas  &amp; Like Mike. The concert will be broadcast on the domestic and international websites of  Color Star Technology  on September 10th, 8pm Beijing Time and September 9th, 9pm Eastern Time.\n\nLooking to create a position this morning and swinging in the short term. Could see a breakout if it can climb past the 200ma around $1.15/share.\n\n&amp;#x200B;\n\n[Reversal Incoming](https://preview.redd.it/s81tgep40xl51.png?width=1629&amp;format=png&amp;auto=webp&amp;s=b1b085f6827dca9255d0a3efd3f4a8085d310341)\n\n **$COCP:**\n\nCocrystal Pharma Inc., a clinical stage biotechnology company discovering and developing novel antiviral therapeutics, announced on August 31st the closing of its previously announced underwritten public offering of 16,422,813 shares of common stock of the Company, including the partial exercise by the underwriter of the option to purchase an additional 2,137,098 shares of common stock, at a price to the public of  $1.05  per share. Quick offering play turnaround, the stock is currently trading at .90 cents per share. Should be able to gap up to the offering price if news regarding the funding is released in the days to come. They have released no PR in the month of September thus far. Short swing.\n\n&amp;#x200B;\n\n[HIgh risk on a falling stock.](https://preview.redd.it/xurz2bi70xl51.png?width=1620&amp;format=png&amp;auto=webp&amp;s=b1a01775b04b27692e98c4470d0b1f3d20a40b7b)\n\n **$ETON:**\n\nTwo FDA approvals are upcoming for $ETON, on September 15th and then again on September 29th. Management seems to be confident in their progress, and the stock has recently ran to highs of $10.00 just in August. Chart-wise, ETON has been following the tug and pull of the overall market. Assuming the markets begin to bounceback from the fall on Thursday and Friday, I expect $ETON to have a decent week before FDA approval. Will look for an entry this morning.\n\n&amp;#x200B;\n\n[Two upcoming FDA approvals](https://preview.redd.it/te9vawua0xl51.png?width=1621&amp;format=png&amp;auto=webp&amp;s=408d0473e6c70a6a2c2c0aa0f00a195138a6e07f)\n\n **Never forget to do your own DD; remember: For all you know, all the stocks that I mention here will dip 90% tomorrow; Do your own DD, I'm not some magic fairy. Trading will never come this easy to you. If all the stocks on here went up, I'd be chilling on my own Island.**",
        "subreddit": "pennystocks",
        "title": "Daily Watchlist September 9th | Templar Trading",
        "url": "https://www.reddit.com/r/pennystocks/comments/iose1s/daily_watchlist_september_9th_templar_trading/",
        "created": 1599595798.0
    },
    {
        "author": "TheJohnnyThunder",
        "created_utc": 1599750007,
        "id": "iq4yai",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Found this coz double volume today. Thought eh, could be good could be shit, financials don’t look amazing, but then dug in to see if the actual  labels they’re partnering with have anyone good and looked up eOne who amongst their acts represent Snoop Dogg, Soulja Boy, Waka Flocka and WU TANG. So could be something here??\n\nThought y’all might be interested in checking it out for yourselves xo\n\nhttps://au.finance.yahoo.com/news/super-league-gaming-hit-parader-141500872.html",
        "subreddit": "pennystocks",
        "title": "SLGG Rock N Jock",
        "url": "https://www.reddit.com/r/pennystocks/comments/iq4yai/slgg_rock_n_jock/",
        "created": 1599778807.0
    },
    {
        "author": "mystockoftheday",
        "created_utc": 1599876834,
        "id": "ir48u6",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Video will be posted in 5 minutes as automod blocks any of my postings.\n\n&amp;#x200B;\n\n   \nO**n January 30, 1869** an announcement appeared in the “Personal” section of *The Telegrapher*: “Mr. T. A. Edison has resigned his situation in the Western Union office, Boston, Mass., and will devote his time to bringing out his inventions.” \n\nEighteen days later Edison executed his second patent application, for an elegantly ratcheted black-and-gold “Stockbroker Printing Instrument,” almost as complex as a clock. It was aimed at the booming new market for alphanumerical tickers that reported fluctuations in prices on the New York gold and stock exchanges to subscribing brokers.",
        "subreddit": "wallstreetbets",
        "title": "Edison stock ticker sale - real deal - how buyer/seller decide the price !",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ir48u6/edison_stock_ticker_sale_real_deal_how/",
        "created": 1599905634.0
    },
    {
        "author": "dailystockalert",
        "created_utc": 1600260984,
        "id": "ituwrp",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "StockMarket",
        "title": "$NAFS Huge News - Voycare Welcomes Former Head of Product Yali Wu to Board of Directors",
        "url": "https://www.reddit.com/r/StockMarket/comments/ituwrp/nafs_huge_news_voycare_welcomes_former_head_of/",
        "created": 1600289784.0
    }
]