[
    {
        "author": "WSBConsensus",
        "created_utc": 1594303138,
        "id": "ho3jb1",
        "num_comments": 138,
        "num_crossposts": 0,
        "selftext": "*Good morning, hope everyone trades responsibly, let’s make some money!* \n\n\n#DOW JONES\n\n\n**Boeing Company (BA)** - **Air Lease (AL)** updated on its order book deliveries, sales and new significant financing occurring in Q2; at the end of the quarter, its fleet was comprised of 301 owned aircraft and 81 managed aircraft, with 398 new aircraft on order from Boeing and **Airbus (EADSY)** set to deliver through 2026; it delivered one new Airbus A320neo aircraft from its order book, and sold four aircraft.\n\n**Johnson &amp; Johnson (JNJ)** is facing calls from over 170 nonprofit groups to stop selling its talc-based Baby Powder worldwide, over concerns that it contains cancer-causing Asbestos, while some are also calling for the clearing of existing inventories.\n\n**Walgreens Boots Alliance (WBA)** Q3 20 (USD): Adj. EPS 0.83 (exp. 1.17), Revenue 34.6bln (exp. 34.36bln), FY20 Adj. EPS view 4.65-4.75 (exp. 5.42); Suspending share repurchase programme, raises quarterly dividend to USD 0.4675/shr, a 2.2% increase. US Retail Pharmacy SSS +3.0% (exp. +1.2%). Most significant COVID-19 impact was in the UK market which required a review resulting in a non-cash impairment charge of USD 2bln. Boots (UK) will be cutting around 4,000 jobs. Annual cost savings to be in excess of USD 2bln by FY2022.\n\n#NASDAQ 100\n\n\n**Alphabet Inc (GOOG/GOOGL)** said it has shut down its cloud project named “Isolated Region” and added that it was not weighing options to offer its cloud platform in China; earlier reports had stated that GOOG had shelved the project in China and other politically sensitive countries in May, partly due to rising geopolitical tensions and the pandemic; GOOG, however, added that the project’s shutdown was not due to either of those two reasons and that it has not offered cloud platform services in China.\n\n**American Airlines Group (AAL) / United Airlines (UAL)** have temporarily halted flights to Hong Kong after its government-imposed coronavirus testing requirements for airline crews, according to Politico.\n\n**Costco Wholesale Corp. (COST)** June sales update saw comparable sales (ex-gasoline and FX) rose 13.6% in the June five-week period, accelerating from the +9.2% seen in May, beating forecasts for around 9% growth.\n\n**Facebook, Inc. (FB)** announced it is starting a chat with a business using QR codes, where people can scan QR codes businesses show at stores, product packaging or receipts to start a chat. It notes there are over 50mln WhatsApp Business app users globally every month.\n\n**Gilead Sciences (GILD)** plans to make more of its drug remdesivir available for Germany and Europe from the fall, and will decide how much each country gets based on the rate of infection; it added that it could increase its worldwide monthly production from currently 190,000 treatment cycles to two million treatment cycles in December. Remdesivir is currently the only drug granted a conditional marketing authorisation by the EU for its use in COVID-19 patients.Oracle Corp. (ORCL) (Information Technology/Application Software) has been awarded a cloud services agreement by the Canadian government.\n\n#S &amp; P 500\n\n\n**Carnival Corp. (CCL)** Aida cruises are to recommence sailing vacations in August.\n\n**Ford Motor (F)** said its China vehicle sales increased 3% in April-June from a year earlier, its first quarterly sales rise in China in almost three years; China sales grew by 158,589 units in Q2, attributed to the rise to a stronger vehicle line up and “strong demand following the lifting of COVID-19 pandemic restrictions”.\n\n**Mylan NV (MYL)** announced it received FDA approval for its Hulio, a biosimilar to **AbbVie Inc. (ABBV)** Humira, for the treatment of rheumatoid arthritis.\n\n**Twitter, Inc. (TWTR)** has been accused of being biased against conservatives and demanded information about its reactions to two tweets by President Donald Trump; two GOP lawmakers allege TWTR’s content moderation was not neutral. Meanwhile, analysts at Citi note its shares overreacted to the potential subscription service reports yesterday. Analyst Jason Bazinet says although it makes sense, there are many unknowns, such as the price and whether or not it will have advertisements. The analyst highlights that a consumer survey shows roughly 10% of its respondents were willing to pay for a USD 5/mth plan without ads and more analytic services. Citi estimates if such a service were to occur, it would be priced at USD 20/year internationally and USD 60/year in the US, assuming a 5% penetration for base case and 10% for its bull case with advertisements, the analyst believes the revenue contribution would be limited. Citi maintain a neutral rating.\n\n**United Continental Holdings (UAL)** expects to recognise USD 300mln in employee separation charges in Q2, with USD 50mln to be in cash.\n\n**ViacomCBS (VIAC)** reached a deal to stream all the UEFA Champions League and Europa League matches starting in August.\n\n#OTHER\n\n\n**Bed Bath &amp; Beyond (BBBY)** Q1 20 (USD): Adj. EPS -1.96 (exp. -1.22), revenue 1.31bln (exp. 1.39bln). Announced it is to close 200 stores over two years as sales fell around 50% during pandemic; BBBY said it was not reporting comp sales due to temporary store closures.\n\n**DocuSign (DOCU)** had its PT upgraded at Wedbush to USD 240 (prev. USD 165, prev. closing price 206.35). The analyst “continues to believe DOCU’s deal flow is holding up well/stronger than expected in this Covid-19 pandemic environment which bodes well for strong underlying metrics/headline numbers during FY2Q”.\n\n**DraftKings (DKNG) and Twin River Worldwide (TRWH)** Mardi Gras Casino announced the opening of DKNG’s temporary sportsbook at the casino in Black Hawk, Colorado. Guests can place bets at the sportsbook from 10th July.\n\n**Energy Transfer (ET)** provided further clarification around news reports regarding the operations of the Dakota Access Pipeline, stating that it has never suggested that it would defy a court order. Rather, Dakota Access Pipeline was seeking appropriate relief from that order through the established legal process.\n\n**Japan Display (6740 JT)** : FY group net loss JPY 101.42bln (prev. net loss JPY 106.59bln), operating loss JPY 38.54bln (prev. loss JPY 27.23bln), recurring loss JPY 57.76bln (prev. JPY 40.37bln).\n\n**Moderna (MRNA)** announced a collaboration for large-scale commercial fill-finish manufacturing of its vaccine candidate with Rovi.\n\n**PTC (PTC)** expects to deliver fiscal third quarter 2020 ARR growth of 9% year over year, 10% in constant currency; and also expects to deliver double-digit revenue and free cash flow year-over-year growth for the fiscal third quarter 2020; it will report results on 29th July.\n\n**Restaurant Brands (QSR)** Burger King in the UK is warning of 1,600 potential job losses as it could close up to 10% of its restaurants\n\n**SAP (SAP GY, SAP)** – Q2 prelim: total revenue EUR 6.74bln, +2% (+1% non-IFRS), operating profit EUR 1.28bln, +55% YY (+8% non-IFRS), non-IFRS cloud revenue EUR 2.04bln +21% YY (19% non-IFRS). At present, cloud backlog seen at EUR 6.65bln, +20%, cloud backlog remains strong but cloud revenue in Q2 was impacted by lower pay-as-you-go transactional revenue given COVID-19. Reiterates FY20 outlook. For FY20: confirm non-IFRS revenue EUR 27.8-28.5bln vs. Prev. EUR 27.6bln, cloud revenue EUR 8.3-8.7bln vs. prev. EUR 7.0bln, operating profit EUR 8.1-8.7bln vs. Prev. EUR 8.2bln. Have seen a strong sequential improvement compared to Q1 regarding software license revenue. Q2 &amp; H1 results will be released on 27th July.\n\n**Siemens (SIE GY, SIEGY)** – Are to spin off 55% of Siemens Energy to shareholders will equate to 1 Siemens Energy share for 2 Siemens shares. Initial listing of new shares is scheduled for 28th September 2020, will commence with a BBB rating at S&amp;P. Siemens will retain a 35.1% stake in the spin-off and the Siemens pension trust an additional 9.9% stake, as such Siemens no longer has a controlling share. Further stake reductions could take place at a significant scale in the next 12-18 months. Separately, Co. are not planning any job reductions from COVID-19. For reference, in FY19 Siemens Energy generated revenue of circa EUR 29bln according to Siemens AG combined statements.\n\n\n#Additional US Equity Stories\n\n**Of note for Social Media names (FB, TWTR, SNAP),** ByteDance is reportedly considering a change in the corporate structure to distance the app from China, and is also considering a TikTok HQ outside of China, according to WSJ.\n\n**Peloton (PTON)** new product will probably not be a rowing machine or exercise bike, its CFO announced, but it could potentially be a lower price treadmill. The CFO stated the co. believes “the running and boot camp category is two-to-three [times] the size of the bike category”, adding it is first and foremost on their minds, reports Barron’s.\n\n**Walgreens Boots Alliance (WBA)** CFO says towards the end of Q3 online volume sales reached Black Friday levels on a daily basis, and May sales increased almost 120%, with June sales growth even higher.\n\n**Tesla (TSLA)** CEO Musk announced the automaker was \"very close\" to developing fully autonomous vehicles and could work out the basics of that technology as soon as this year; he reiterated that the electric vehicle maker has solved most of the essential challenges toward achieving fully self-driven cars that needs no human behind the wheel. The Tesla and SpaceX chief was reaffirming a goal first expressed in 2019.\n\n**Delta AIrlines (DAL)** CEO reiterates urge for workers to consider voluntary departure., and announced it flew 20% of customers over the July 4th weekend. \n ",
        "subreddit": "wallstreetbets",
        "title": "Here’s your morning coffee!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ho3jb1/heres_your_morning_coffee/",
        "created": 1594331938.0
    }
]