[
    {
        "author": "vegadust",
        "created_utc": 1596975572,
        "id": "i6if11",
        "num_comments": 822,
        "num_crossposts": 0,
        "selftext": "You know what I read here once about a shady Chinese company that always stuck with me? Someone said \"this sub is about making money, nothing else.\"\n\nWell guess what, I disagree you wretch, whoever you are. Being a money grubbing little piece of shit with no allegiance or loyalty might make you money in the short term, but you'll have to live your life as a traitorous gay nerd.\n\nChina is fucking with America, hardcore. They're exploiting our weakness and drumming up infighting in-between us with their troll farms. They're even inciting BLM protests in JAPAN (look it up), it'd be god damn hilarious if I didn't see my city get torn apart a month ago.\n\nYou assholes are salivating over Microsoft potentially buying tik tok. FUCK TIK TOK. China has banned google, Facebook, and a plethora of other AMERICAN companies so they could create their own replicas in China. Why should America let a Chinese company come in and dominate when they don't allow us to compete in China? \n\nNo, I'm supporting **Facebook Reels**. I know Zuckerborg is a retarded nerd who spies on everyone, but he's **MY** retarded gay nerd who spies on everyone. I'm done kowtowing to China. I don't vote or do anything remotely political or actually useful for society, but the very least I can do is buy FACEBOOK CALLS.",
        "subreddit": "wallstreetbets",
        "title": "Fuck you I'm going in hard on Facebook calls on Monday.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i6if11/fuck_you_im_going_in_hard_on_facebook_calls_on/",
        "created": 1597004372.0
    },
    {
        "author": "1541drive",
        "created_utc": 1598627851,
        "id": "ii8wsu",
        "num_comments": 812,
        "num_crossposts": 0,
        "selftext": "For those who subscribe to having the majority or the entirety of their equity holdings to consist of ETF/funds from the S&amp;P 500, the impact to their portfolio as a function of any one company has increased substantially.\n\nEven with total market funds like Vanguard's VTI, these five stocks make up an outsized portion of the fund because of market cap weight.  \n\nMuch like investors using \"ex-US\" funds to increase exposure to international holdings, are there funds that are \"ex-FAANG\" so individuals can lessen the impact?  If not, would another practical strategy be to buy more non-tech sector funds as opposed to say buy more of the 400+ other S&amp;P 500 stocks as counterweight.\n\nThoughts?",
        "subreddit": "investing",
        "title": "With MSFT, AAPL AMZN, GOOGL and FB making up more than 1/5 of the S&amp;P500, what are practical ways to de-risk your portfolio from this imbalance?",
        "url": "https://www.reddit.com/r/investing/comments/ii8wsu/with_msft_aapl_amzn_googl_and_fb_making_up_more/",
        "created": 1598656651.0
    },
    {
        "author": "pikindaguy",
        "created_utc": 1596468077,
        "id": "i2yx70",
        "num_comments": 590,
        "num_crossposts": 0,
        "selftext": "Markets seem to really love this move and if the Tiktok deal goes through it's almost like a \"free\" purchase for MSFT with their stock gains.\n\nAccording to Forbes Tiktok is estimated to be worth about $50B right now: https://www.forbes.com/sites/elanagross/2020/07/29/a-reported-takeover-bid-values-tiktok-at-50-billion\n\nMSFT is also sitting on about $140B in cash at the moment too so an all-cash deal is also possible.\n\nImagine buying a $10 burger and getting $12 back on it.",
        "subreddit": "investing",
        "title": "With looming Tiktok deal estimated at $50B, MSFT gains 4% or $64B in value",
        "url": "https://www.reddit.com/r/investing/comments/i2yx70/with_looming_tiktok_deal_estimated_at_50b_msft/",
        "created": 1596496877.0
    },
    {
        "author": "fire_water76",
        "created_utc": 1598579888,
        "id": "ihyea8",
        "num_comments": 569,
        "num_crossposts": 0,
        "selftext": "I believe I did pretty well in the market this year. My networth increased ~65% since its lowest point in March, [~350k to 620k](https://imgur.com/a/3Vu6u2f). 20k from the car I bought in March. I rolled over a 401k and it messed up Mint's reporting, hence the spike from Jul -&gt; Aug. \n\nI beat the [SP500 by 40%](https://imgur.com/a/adeDokD) in my YOLO account, my FAANG account went from [180-&gt;300](https://imgur.com/a/kBmBp1O)\n\nI did this by following some basic investing principles, buying and holding for the most part, being patient, and only investing in areas which I have expertise in. \n\nI did not buy into the TSLA hype, nor do I play options, nor do I play crypto. \n\n#High level advice:\n=========================================\n\nhttps://www.simplysafedividends.com/intelligent-income/posts/37-top-10-pieces-of-investment-advice-from-warren-buffett\n\nI picked the 7 I agree with.\n\n1. Invest in what you know…and nothing more.\n2. Never compromise on business quality\n3. When you buy a stock, plan to hold it forever\n4. Diversification can be dangerous\n5. Most news is noise, not news (don't read articles about investing)\n8. The best moves are usually boring (buy and hold)\n10. Only listen to those you know and trust \n\nI firmly believe that anyone who follows those concepts, they will find success in investing.  \n\n#General mindset:\n================\n- Keep emotions out of the market\n- Don't bother timing the market. Don't get ruled by FOMO.\n- Understand that for some stocks, you can't really average cost down. You will have to stomach buying the stock at a higher entry point. My refusal to average up early on caused me to miss out on a lot of gains. \n- Understand the difference between trading, investing, and gambling. \n- Have an exit strategy (stop losses would have helped me a lot in March, I now learned from my expensive mistake)\n- Be greedy-- not TOO greedy. If a stock pops 10%, I will sell half to lock in profits. It's super common to see a lot of companies pop and the next day dip a bit due to sell off. Perfect time to grab more on the dip. This is obviously impossible to time, which is why I only sell half. \n\n#Application:\n==================================================================\nI was very specific in the types of companies I would choose to invest in within tech. I decided to follow my strengths. As a data engineer, I'm very intimate with cloud technologies, and I think I generally have pretty sharp business acumen and good strategic direction. \n\nAs a result, my day to day work had me using a ton of technologies in the cloud space. I've used Splunk, NewRelic, Twilio, AWS, GCP, Hortonworks/Cloudera, Oracle, Tableau, Datadog, Sendgrid (bought by Twilio), Dropbox/box, Slack, Salesforce, Marketo, Databricks, Snowflake, HP Vertica, just to name a few. I was familiar with CDN services like Fastly and Cloudflare because sometimes, I worked with the DevOps and IT guys. \n\nBased on industry hearsay, day to day work, eventually, I got a good \"feel\" of what technologies were widely adopted, easy to use, and had a good reputation in the industry. Similarly, I also got a feel for what tech were being considered 'dated' or not widely used (HP, Oracle, Cloudera, Dropbox, Box). \n\nI tend to shy away from companies that I don't understand. In the past, most times I've done that-- I got burned.  My biggest losers this year was betting on $NAT and $JMNA (10k total loss). After learning from those mistakes, I decided to only focus on investing in companies that either I or my peers have intimate first hand experience with using. Because of this rationale, the majority of stocks in my portfolio are products which I believe in, I thoroughly enjoy using, and I would recommend to my friends, family, and colleagues. \n\nPost COVID, due to the shift to remote work and increase in online shopping I decided to double down on tech. I already knew that eCommerce was the next big thing. I made very early investments into SHOP and Amazon in 2017 for that reason.\n\nMy hypothesis was that post-COVID, the shift on increased online activity, remote work, and eCommerce would mean that companies which build tools to support increased online activity should also increase. I decided to choose three sectors within tech to narrow down-- these were three sectors that I had a good understanding of, due to the nature of my work and personal habits. \n\n1. eCommerce + AdTech \n2. IT/DevOps (increased online activity means higher need for infra)\n3. FinTech (increased shopping activity means more transactions)\n\nThese are the points I consider before I consider jumping into a stock:\n\n1. Do I feel good about using the company? Do I believe in the company's vision?\n2. Where do I see this company in 5 years? 10 years? Do I see my potential children being around to use these companies?\n3. What does YoY, QoQ growth look like for this company? \n4. Is/Will this product be a core part of how businesses or people operate?\n5. Who are their customers and target demographic?\n6. (SaaS) Customer testimonials, white papers, case studies. If it's for a technology, I'm going to want to read a paper or use case.\n\nIn March, I took what I believe to be an \"educated gamble\". When the market crashed, I liquefied most of my non tech assets and reinvested them into tech. Some of the holdings I already had, some holdings were newly purchased.\n\nI have 50% of my networth in AMZN, MSFT, AAPL, GOOG, FB, NFLX, and the rest in individual securities/mutual funds. I have 3 shares of TSLA that I got in @1.5.\n\nHere are the non FAANGs I chose.\n\n1. $SQ. I had already been invested in SQ since 2016. I made several bad trades, holding when it first blew past 90 until I sold it at 70... bought in again last year at 60s, after noticing that more and more B&amp;M stores were getting rid of their clunky POS systems and replacing it with Square's physical readers. After COVID, I noticed a lot of pop up vendors, restaurants doing take out. A Square reader made transactions very easy to make post-COVID. \n\n2. $ATVI. Call of Duty and Candy Crush print money for them. I've been a Blizzard fanboy since I was a kid, so I have to keep this just out of principle.\n\n3. $SHOP. They turned a profit this year, and I think there is still a lot more room to grow. It's become somewhat of a household name. I've met quite a few people who mentioned that they have a Shopify site set up to do their side hustle. I've tried the product myself, and can definitely attest that it's pretty easy to get an online shop up and running within a day. I 5.5xed my return here. \n\n4. $BIGC. I bought into this shortly after IPO. I'm very excited to see an American Shopify. BigC focuses on enterprise customers right now, and Shopify independent merchants, so I don't see them directly competing. I'm self aware this is essentially a gamble. I got in at 90, sold at 140, and added more in 120s. I def got lucky here... it's not common for IPOs to pop so suddenly. I honestly wasn't expecting it to pop so soon.\n\n5. $OKTA. Best in class SSO tool. Amazing tool that keeps tracks of all of my sign-ons at work. \n\n6. $DDOG. Great monitoring tool. Widely adopted and good recommendations throughout the industry. Always had a nice looking booth at GoogleNext.\n\n7. $ZM. Zoom was the only video conf tool at work which I had a good time using. Adoption had blown up pre-COVID already in the tech world, and post-COVID, they somehow became a noun. \"Zoom parties\" and \"Zoom dates\" somehow became a thing interwoven into peoples' day to day lives.\n\n8. $TWLO. Twilio sells APIs which allow applications to send messages like text, voice, and video chat. For example, when DoorDash sends you a text at 1 AM reminding you that your bad decision has arrived, that text is powered by Twilio. In March, New York announced that they were going to use Twilio to send SMS notifs for COVID contact tracing. \n\n10. $NET/$FSTY. These two two seem like the ones best poised for growth in the CDN space. This is based off of industry exposure and chatting with people who work in DevOps.\n\n11. $DOCU. people aren't going to office to sign stuff, super easy to use, I like their product. \n\n12. $WMT. eComm, streaming, and a very substantial engineering investment makes me think they have room to grow. Also I really need to diversify. \n\n13. $COST. When is the last time you heard someone say \"Man I hate going to Costco and paying $1.50 for a hotdog and soda?\" Diversification. Also cheap hotdogs.\n\n14. $NVDA/AMD. GPUs are the present and the future. Not only are they used for video games, but Machine Learning now uses GPU instead of CPU to do compute (Tensorflow for example). Crypto is still a thing as well, and there will always been a constant need for GPUs.\n\nMutual funds/ETFs\n1. $FSCSX. MF which focuses on FinTech. \n\n2. $VTSAX Pretty much moves with the SP500. \n\n3. $WCLD. Holdings include Salesforce, Workday, Zuora, Atlassian, Okta, New Relic, Fastly... \n\nTitanvest:\nI was an early access user, and I was able to secure 0% fees for my accout. 36% gains so far. I like them, because their portfolio happens to include shares of tech giants that I either don't have individual stocks for or my stake is low (CRM, PPYL). It nicely complements my existing portfolio.\n\n#Some things I do that that are against the grain:\n\n- Not really diversified. 80% is in tech. They are in very different sectors of tech, but the truth is, when tech falls, all of these companies fall. I'm obviously long tech and I do not believe that tech will fall anytime soon. What about the dot com bubble? There wasn't a single dot com company that was integral in our lives. The internet was in its infancy then. Techonology is now such an interwoven part of our lives and I see companies like Apple, Amazon, Google to be sticking around for several generations.\n\n- I don't read investing articles. I think people who write articles about a stock all have ulterior motives-- to pump or to dump. Case in point-- Citron Research spent years writing articles telling people how SHOP was overvalued. Why did they do that? Because they were shorters at the time. I turned 5k into 27k, because I held on to most of my SHOP shares.\n\n- I don't take much value from balance sheets, other than net loss, income, YoY growth. Instead, I use my business acumen to try to pick up on info that isn't super apparent from Google. For example, one thing I always do is that I look at the career page to see how the business is growing. Increase on marketing/sales/implementation engineers is typically a solid sign that a company is preparing headcount to take new deals in the upcoming quarters. I look at the product road map, supported integrations, and customer base. \n\nOne example was how I applied the above principle was to WalMart. In 2018 I noticed that I was getting targeted by a lot of Data engineering job listing for WalMartLabs-- WarMart's tech division. The role was to build out a big data pipeline to support their eCommerce platform. WalMart's online store released in Q3 of 2019. Post COVID, I used their online store and it was a seamless experience. They even offer a 5% cash back card like Amazon. They reported strong Q4 sales last year, and they did very well post COVID. Why did I choose to invest in $WMT? Because I believe that Wal-Mart has room to grow for their online platform. \n\nLastly... remember that wealth isn't accrued over time. It takes years to build. The quickest way to increase your wealth is by investing in yourself-- your career and earning potential. The sooner my income increased, the quicker I had more capital to buy into stocks. \n\nAlso, if you've gotten this far, the point of my post isn't to say that you should invest into tech. The message I'm trying to get across is-- when picking companies, pick companies in fields or verticals you have good knowledge in. Heed Buffet's advice to only pick companies you believe in and understand. Play to your strengths, don't mindless toss money based on one person's posts on Reddit-- always do your own due diligence. Use DD as a guide and use personal research and experience to drive your decision.",
        "subreddit": "stocks",
        "title": "How I applied Buffet's strategies to my own portfolio, +70% networth, beat SP500 by 40%",
        "url": "https://www.reddit.com/r/stocks/comments/ihyea8/how_i_applied_buffets_strategies_to_my_own/",
        "created": 1598608688.0
    },
    {
        "author": "ron_leflore",
        "created_utc": 1596769827,
        "id": "i56798",
        "num_comments": 547,
        "num_crossposts": 0,
        "selftext": "https://www.nytimes.com/2020/08/06/technology/trump-wechat-tiktok-china.html\n\nThe tiktok ban will probably result in the sale of TikTok to Microsoft.  The wechat ban is going to be much more complicated.\n\nThe executive order appears to include a ban on any financial transaction with Tencent.  Tencent investments include reddit.",
        "subreddit": "investing",
        "title": "President Trump signs executive order banning TikTok and Wechat in 45 days.",
        "url": "https://www.reddit.com/r/investing/comments/i56798/president_trump_signs_executive_order_banning/",
        "created": 1596798627.0
    },
    {
        "author": "avelak",
        "created_utc": 1597355510,
        "id": "i994qt",
        "num_comments": 459,
        "num_crossposts": 0,
        "selftext": "Yeah, you could've made a bunch of money on some of these if you were smart... but WSB is fucking stupid and probably played weeklies and shit to piss away their money on these (myself included)\n\n* dIaMonD hAnDs SPY 200p\n\n* Tanker Gang\n\n* PRPL gang\n\n* Team RKT\n\n* Corn Gang\n\n* That ULTA DD motherfucker\n\n* ATVI\n\n* SNAP puts\n\n* SPCE Soldiers\n \n* Metals gang (SLV Surfers)\n \n* Quad Witching\n \n* MSFT 200\n \n* MGM\n \n* KODK bagholders anonymous\n \n* Kang Gang\n \n* DKNG DKNG DKNG DKNG\n \n* VBIV dude (he'd be happy now if he wasn't banned)\n \n* JNUGgalos\n \n* AZN Fever\n \n* AMD puts\n \n* REITs\n \n* Gun riots\n \n* NKLA\n \n* The many fallen in service of TSLA gang on the uppies and downies\n \n* PG&amp;E (AKA the easiest fReE mOnEy)\n \n* MU 90c\n \n* ZM puts\n \n* DGLY\n \n* LL\n \n* Luckin Coffee\n \n* HTZ bankruptcy moonshot",
        "subreddit": "wallstreetbets",
        "title": "In memoriam of the PRPL King, here is a list of other fallen gangs",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i994qt/in_memoriam_of_the_prpl_king_here_is_a_list_of/",
        "created": 1597384310.0
    },
    {
        "author": "Not_An_NSA_Employee",
        "created_utc": 1597373466,
        "id": "i9dzsy",
        "num_comments": 458,
        "num_crossposts": 0,
        "selftext": "been a long time lurker and have watched this sub triple in size\n\neveryday more and more retards sub and bring less fulfilling content and just post \"aM i FuK nOw\" \n\nless gainz/loss porn \n\neveryone dick rides the same shit and they all lose money like retards \n\nthe memes are all the same and suck \n\ni miss the good old days \n\npositions: $AMD 84c 8/21 $SLV 25.5c 8/14 $MSFT 210c 8/21",
        "subreddit": "wallstreetbets",
        "title": "this sub is shit now",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i9dzsy/this_sub_is_shit_now/",
        "created": 1597402266.0
    },
    {
        "author": "AMcMahon1",
        "created_utc": 1598897713,
        "id": "ik3aw5",
        "num_comments": 390,
        "num_crossposts": 0,
        "selftext": "Behind only Apple, Amazon, Microsoft, Google, Facebook, Alibaba, and Berkshire Hathaway.\n\nTheir q2 revenue was 6 billion and net income was 100 million. Most euphoric stock of all time? Possibly.\n\nWhen will it come crashing down? Who knows but it's not sustainable at it's current valuation that's for sure.\n\nNext up is Old Man Buffet and Berkshire",
        "subreddit": "wallstreetbets",
        "title": "Tesla surpasses Visa to become the 8th most valuable publicly traded company in the world",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ik3aw5/tesla_surpasses_visa_to_become_the_8th_most/",
        "created": 1598926513.0
    },
    {
        "author": "wileywyatt",
        "created_utc": 1598742102,
        "id": "ij24lk",
        "num_comments": 384,
        "num_crossposts": 0,
        "selftext": "Hi Friends,\n\nMy Stock Portfolio has been consistently outperforming the S&amp;P 500 index by 3x, for the past 5 years.\n\n**75% of my portfolio is made up of these 15 stocks**:\n\nAMZN, GOOGL, SQ, FB, WM, HD, BABA, \n\nFISV, MSFT, V, PYPL, CHGG, BIDU, TCEHY, IQ\n\n**[Here Is My Pie-Chart Stock Portfolio Diversity](https://i.imgur.com/HyjqZeA.png)**.\n\nPlease let me know what you think!\n\nI hope this helps you strengthen your own portfolio, and I wish you all the best!",
        "subreddit": "stocks",
        "title": "My Portfolio: Outperforming S&amp;P 500 By 3x, For 5 Years (See Picture).",
        "url": "https://www.reddit.com/r/stocks/comments/ij24lk/my_portfolio_outperforming_sp_500_by_3x_for_5/",
        "created": 1598770902.0
    },
    {
        "author": "ss_400401",
        "created_utc": 1596411811,
        "id": "i2mdmw",
        "num_comments": 375,
        "num_crossposts": 0,
        "selftext": "MSFT confirms talks to buy ticktock. Time to load your calls [https://www.cnbc.com/2020/08/03/microsoft-confirms-talks-to-buy-tiktok-in-us.html](https://www.cnbc.com/2020/08/03/microsoft-confirms-talks-to-buy-tiktok-in-us.html)",
        "subreddit": "wallstreetbets",
        "title": "MSFT confirms talks to buy ticktock. Time to load the calls",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i2mdmw/msft_confirms_talks_to_buy_ticktock_time_to_load/",
        "created": 1596440611.0
    },
    {
        "author": "follow-spy",
        "created_utc": 1596411404,
        "id": "i2m9po",
        "num_comments": 341,
        "num_crossposts": 0,
        "selftext": "This should get interesting as Microsoft venturing into the social media field.   Facebook is still powerful but they have lots of negative press and Instagram is getting kinda boring.   I like the move to appeal Microsoft to the younger Gen.",
        "subreddit": "stocks",
        "title": "MSFT Confirms talks to Buy TikTok",
        "url": "https://www.reddit.com/r/stocks/comments/i2m9po/msft_confirms_talks_to_buy_tiktok/",
        "created": 1596440204.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1598542160,
        "id": "ihn3q6",
        "num_comments": 336,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2020/08/27/walmart-is-teaming-up-with-microsoft-on-tiktok-bid.html\n\nWalmart said in a statement that TikTok's integration of e-commerce and advertising \"is a clear benefit to creators and users in those markets.\"\n\n\"We believe a potential relationship with Tik Tok US in partnership with Microsoft could add this key functionality and provide Walmart with an important way for us to reach and serve omnichannel customers as well as grow our third-party marketplace and advertising businesses,\" it said.  \"We are confident that a Walmart and Microsoft partnership would meet both the expectations of US Tik Tok users while satisfying the concerns of US government regulators.\"",
        "subreddit": "stocks",
        "title": "Walmart is teaming up with Microsoft on TikTok bid",
        "url": "https://www.reddit.com/r/stocks/comments/ihn3q6/walmart_is_teaming_up_with_microsoft_on_tiktok_bid/",
        "created": 1598570960.0
    },
    {
        "author": "Evil____",
        "created_utc": 1597799799,
        "id": "ice312",
        "num_comments": 321,
        "num_crossposts": 0,
        "selftext": "I've dedicated a large percentage of my portfolio to renewable energy companies and have obtained some knowledge on the sector and specific companies in doing so. I've noticed a trend of people inquiring about these companies so I hope that this post can provide some information. \n\n---------------------------\n\nI'll provide a brief bullish thesis and some information about my investments in renewables. These are in order of weight in my portfolio. \n\n------------------------------\n\nTesla (TSLA)\n\nMost of us know what Tesla is about. They are the global leader in electric vehicles and will eventually come out with autonomous driving but I'll focus on their energy business. They sell solar panels with the lowest cost/watt of U.S. manufacturers, but this isn't the exciting part of their energy business. They are a leader in battery storage, which is an integral part of a renewable future. Energy storage systems store energy produced from solar panels and when the sun isn't shining, energy is consumed from the batteries instead. Also their autobidder software, which is out in trial in Massachusetts and Australia I believe, eventually will turn energy into a market place for Tesla customers. Read more about autobidder here: https://www.tesla.com/support/autobidder \n\nMy bull case for Tesla (specifically the energy side of the business) is that they will continue to innovate with their low cost panels, and be a leader in battery storage, plus leverage their autobidder software to bring added value to residential customers.\n\n--------------------------------------\n\nVestas Wind Systems (VWDRY) \n\nhttps://www.vestas.com/~/media/vestas/investor/investor%20pdf/financial%20reports/2020/q2/2020%20q2_pres.pdf\n\nVestas is the leading manufacturer and installer of wind turbines. They have a global footprint and are expected to grow in line with the growth of the wind industry as a whole. A major growth engine in their business is going to be their expanding service and maintenance business, which has very high margins. My bull case for Vestas is that they are a unique pure play wind turbine company with years of experience in the growing industry. \n\n--------------------------------\n\nFirst Solar (FSLR)\n\nFirst Solar is an American based solar module manufacturing and solar project operating company. Most of their business comes from corporate and grid level solar projects. Notably, they have Next Era Energy, Microsoft and Apple as customers. The real bullish case behind First Solar is around their differentiated Cadmium Telluride solar modules. Compared to the standard Crystalline silicon technology, First Solar's modules last longer and produce energy at higher efficiencies in hotter climates. \n\nMy bull case for First Solar is around their differentiated technology, strong balance sheet, and position as an American company, which typically warrants a higher P/E ratio than foreign countries. \n\n----------------------------------\n\nJinko Solar (JKS) \n\nhttps://ir.jinkosolar.com/static-files/5a6d9266-d288-4ece-a0ea-f8e49ff60119\n\nJinko Solar is a leader is a Chinese based solar panel manufacturer. They produce low cost modules and also manage solar projects. Their business model is similar to First Solar's, however they trade at a cheaper valuation, due to being a Chinese company. You can read more about their technology on their investor relations page, but my main bull case for this company is around their position in South East Asia as a leading manufacturer, as this is undoubtably the biggest potential market for solar energy. \n\n--------------------------\n\nCanadian Solar (CSIQ) \n\nhttp://investors.canadiansolar.com/events\n\nCanadian Solar is also a leader in the module manufacturing &amp; project development business. They have a similar business model with Jinko and First Solar. Canadian Solar owns equity stakes in several of their solar projects, which gives them a source of recurring revenue. They also have a large footprint in American grid/commercial systems and are a market leader in North America. \nThey trade at an absurdly low 5 P/E ratio despite significant growth expectations in the coming years. \n\nMy bull case for CSIQ is around their ability to dominate the current market and potential to capitalize off of further market growth and consolidation towards the biggest solar companies. Also their current valuation is very intriguing. \n\n--------------------------\n\nSolarEdge (SEDG) \n\nhttps://investors.solaredge.com/\n\nSolarEdge is the global leader in the Inverter space, with a 60% U.S. market share. For those who don't know, Inverter's turn the D.C. electrical current from the sun into an A.C. current, which is used by households. The inverter business is also much higher margin than the module (panel) business, due to there being fewer players in the industry. They are also expanding into energy storage and electric vehicle manufacturing. \n\nMy bull case around SolarEdge is around their market dominance in the Solar Inverter business, which will grow exponentially in the coming years plus future expansion in storage &amp; EVs. They have a very strong management team as well. \n\n--------------------------\n\nTPI composites (TPIC)\n\nhttps://ir.tpicomposites.com/download/companies/tpicomposites/Supplements/TPI%20Earnings%20Deck%202Q20.pdf\n\nTPI composites manufacturers wind blades and sells them to wind turbine companies. They have long term contracts with the top 5 non Chinese wind turbine companies (Vestas, GE, Siemens, Nordex &amp; Enercon.) 63% of total wind blade manufacturing is outsourced to companies like TPI and they are the market leader in this space with about 20% market share globally. The business currently has low margins, but they target a 12% EBITDA margin for the future, and they trade at a measly 0.74 P/S ratio currently. They are also expanding into EV composite manufacturing and have a contract with a certain EV company that I can't mention on this subreddit apparently (DM if you want more info) to manufacture vehicle parts for them.\n\n-------------------\n\nEnphase Energy (ENPH) \n\nhttps://investor.enphase.com/static-files/81902e59-7d61-4693-aa86-8d54e63975b9\n\nEnphase is the sole producer of Microinverters, which are smaller inverters that go on individual panels and provide a safer, more efficient, but more expensive solution than the standard string inverters. Microinverters are used in smaller solar systems, mostly residential. They also have an energy storage business that is just starting to scale. Enphase and SolarEdge are competitors in both of these spaces, and are expected to be major players in the future. Like SolarEdge, Enphases' inverter business is high margin and expects rapid future growth, as the residential solar market grows. \n\nMy bullish case around Enphase is around their Microinverter technology, potential for expansion into storage and unique Ensamble home energy management system (read about Ensamble on the Investor relations page). \n\n-----------------------\n\nBrookfield Renewables (BEPC)\n\nBrookfield Renewables owns and operates renewable energy systems and projects. They sell energy produced from such systems to utility companies and have a recurring revenue stream. They also pay a 3.73% dividend yield. Their investments are split relatively evenly between Hydroelectric, solar and wind. \n\nMy bullish thesis around BEPC is the consistent cash flow positive revenue stream and relative safety in the business model. Also, they provide be with exposure to hydroelectric energy. \n\n--------------------------------\n\nLet me know if you have any comments, hold, or plan to buy any of these companies!",
        "subreddit": "stocks",
        "title": "A guide for those looking to invest in Renewable Energy. (My Renewable portfolio with DD)",
        "url": "https://www.reddit.com/r/stocks/comments/ice312/a_guide_for_those_looking_to_invest_in_renewable/",
        "created": 1597828599.0
    },
    {
        "author": "KindheartednessNo884",
        "created_utc": 1597946057,
        "id": "idf7cb",
        "num_comments": 314,
        "num_crossposts": 0,
        "selftext": "At time of writing, GOOG market cap is $1.06T and other tech giants are much higher (AAPL is $2.01T, AMZN is $1.65T, MSFT is $1.61T). That gap feels large to me. Also, FB is valued at $760B with much lower revenue and decelerating growth, so its gap vs GOOG seems small. \n\nIs GOOG a good buy? Are these other companies just overvalued? Curious what you all think.  \nHere's my thinking:\n\n* GOOG has rock-solid fundamentals - excellent gross margins, has maintained \\~15%+ YoY revenue growth even at their scale, and search is a steady business with many entrypoints across the Google ecosystem\n* GOOG has bets across so many forward-looking industries that I think they will be able to diversify over time and don't have real risk of not continuing to innovate. There's of course the risk of anti-trust and privacy regulations, but that's been true for years now (although things do appear to be ratcheting up).\n* It seems their stock hasn't mooned during covid because a meaningful share of search volume (and subsequently search revenue) comes from brick-and-mortar businesses (as opposed to someone like FB, whose ads biz is more of an ecommerce/direct-to-consumer play), which puts a drag on their revenue. This was the main reason for their relatively weak Q2 earnings a couple weeks back.  \n\nDisclaimer: I own shares of every company mentioned here. Thanks for your input - I really enjoy this subreddit and have learned a lot from reading other posts.",
        "subreddit": "investing",
        "title": "Why is GOOG worth so much less than AAPL, AMZN, MSFT?",
        "url": "https://www.reddit.com/r/investing/comments/idf7cb/why_is_goog_worth_so_much_less_than_aapl_amzn_msft/",
        "created": 1597974857.0
    },
    {
        "author": "Maple_Butter952",
        "created_utc": 1596542463,
        "id": "i3i1l8",
        "num_comments": 304,
        "num_crossposts": 0,
        "selftext": "[Gains](https://imgur.com/gallery/afMJcB4)\n\nI’m very surprised about the lack of attention NVAX gets on this sub considering it has rallied much more than something like TSLA and is a pharmaceutical stock in the middle of a pandemic. Read this and maybe some of you autists can make up the money you lost on MSFT calls and buying KODK at $50.\n\nBackstory:\n\nI have held this stock since 2016 with nothing but diamond hands. In September 2016, they failed their stage 3 clinical trial and fell 84%. In 2019, they issued a 1:20 reverse split. I continued to be optimistic hoping their NanoFlu vaccine could bring some revival to the stock and even doubled down on my initial investment to get my average price down to ~$26. I was rewarded for this once COVID hit.\n\nWhy NVAX?\n\nNVAX was one of the first of the operation warp speed companies to receive significant funding, and they will be a key player in the development of a vaccine. It has, by far had the biggest % gain of all the warp speed companies. \n\nThey will be releasing their phase 1 clinical trial results after hours today.\n\nThe reason NVAX will be more successful than any of the other pharmaceuticals/biotechs is because they already have technology and experience from previous attempts in the type of vaccine that will be used. They use their owned recombinant nanoparticle technology to generate antigen derived from the coronavirus spike (S) protein and contains Novavax’ patented saponin-based Matrix-M.\n\nNVAX, without any COVID vaccine is already incredibly undervalued as is. Their NanoFlu vaccine has shown to be very effective in phase 3 clinical studies and has already been shown to be much more effective than the version Sanofi has developed.\n\nAs a plus, unlike other CEOs of this sector dumping all their stocks, the CEO has increased his number of shares since the beginning of COVID.\n\nImportant events:\n\nMay 11 2020: Coalition for Epidemic Preparedness Innovations (CEPI) awards NVAX $384 million to advance clinical development of their COVID vaccine NVX-CoV2373.\n\nJuly 7 2020: Trump awards NVAX $1.6 Billion\n\n7/27: Trump visits FujiFilm factory that will be manufacturing batches used in NVAX Phase 3 trial and awards FujiFilm a $265 million contract.\n\nPhase 1 clinical trials are expected after hours today, so this may be your last opportunity before this stock truly goes to Pluto.\n\nThings ik you autists will say:\n\n“It’s already ballooned why would I buy in now”\n\nPeople were saying this when it hit 40. People were saying this when it hit 70. Then 90. Then 110. Then 140. Somehow people are still bearish on this after it hit $160 yesterday. Today will be the biggest news NVAX will have regarding COVID, buy in today while you can.\n\n“It hasn’t produced a single thing available on the market”\n\nVery true, but this time is different. Right now, not only does it have the support of Donnie, it also has international support from CEPI as well as the direct funding from the likes of Bill Gates. The technology they have been working on for the past decade will directly be used in their vaccine.\n\n\nMy personal success:\n\nMost of my gains as you’ll see are simply from holding the stock long term. I have also taken up theta gang strategies to sell very OTM options to degenerates as I have no need to take the risk of buy options at this level. At this point if I am forced to sell my shares, I will be happy to take my $4 million and run. \n\nI will admit, buying call options are incredibly profitable and decently easy to predict. For example, this was known to be a very big week for NVAX (even with earnings being pushed back) and it had been facing a resistance at $150 for the past three weeks. Even WSB autists can see that it would likely break $150 sometime this week, and in a pleasant surprise, it managed to do that today and hit a 52wk high in the process. \n\n\nTLDR; NVAX goes brrr. Stage 1 clinical trial data released after hours today will make NVAX go more brrrrr. Earnings coming out next week will make NVAX go even more brrrrrrrrr.",
        "subreddit": "wallstreetbets",
        "title": "$3 Million NVAX Gains",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i3i1l8/3_million_nvax_gains/",
        "created": 1596571263.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1596640012,
        "id": "i46zf1",
        "num_comments": 280,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2020/08/05/microsoft-has-one-year-to-transfer-tiktoks-code-to-the-us.html\n\nMicrosoft and TikTok plan to finish acquisition talks within the next three weeks, ahead of the Sept. 15 deadline, CNBC's David Faber reported Wednesday.\n\nThe valuation of the deal could be as high as $30 billion, or as low as $10 billion, Faber reported.\n\nMicrosoft has already agreed to transfer all of TikTok's code from China to the U.S. within one year if the deal goes through.",
        "subreddit": "stocks",
        "title": "Microsoft could buy TikTok for as much as $30 billion",
        "url": "https://www.reddit.com/r/stocks/comments/i46zf1/microsoft_could_buy_tiktok_for_as_much_as_30/",
        "created": 1596668812.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1598123550,
        "id": "ieogjy",
        "num_comments": 273,
        "num_crossposts": 0,
        "selftext": "https://markets.businessinsider.com/news/stocks/tesla-surpasses-walmart-market-value-most-valued-sp500-us-companies-2020-8-1029524035\n\njnj, v, brk.b, fb, googl, msft, amzn, aapl.",
        "subreddit": "stocks",
        "title": "Tesla just surpassed Walmart in market value. Here are the 8 remaining S&amp;P 500 companies worth more than Tesla.",
        "url": "https://www.reddit.com/r/stocks/comments/ieogjy/tesla_just_surpassed_walmart_in_market_value_here/",
        "created": 1598152350.0
    },
    {
        "author": "DamnItDavid88",
        "created_utc": 1596289011,
        "id": "i1sbit",
        "num_comments": 265,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "MSFT is taking tiktok US operations. Just announced",
        "url": "https://pbs.twimg.com/media/EeVputQXoAMdJM5?format=png&amp;name=medium",
        "created": 1596317811.0
    },
    {
        "author": "Swinghodler",
        "created_utc": 1598559305,
        "id": "ihsmef",
        "num_comments": 262,
        "num_crossposts": 0,
        "selftext": "Who else loaded on MSFT FDs for tomorrow?\n\nBasically lottery tickets hoping they announce deal before market open 🙏\n\n\nPositions :\n\nMSFT AUG28 240C ; 250C ; 260C",
        "subreddit": "wallstreetbets",
        "title": "MSFT prayer circle",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ihsmef/msft_prayer_circle/",
        "created": 1598588105.0
    },
    {
        "author": "MonsieurSloth",
        "created_utc": 1596995811,
        "id": "i6nqks",
        "num_comments": 261,
        "num_crossposts": 0,
        "selftext": "All of you old retards don’t understand the power of the tok.  MSFT will purchase the teenage whoring app and stonk price will jump atleast 250%.  I’ll see you when my life savings jumps the price of your sideways built ill-soiled lawn real estate you call a house.  Stonks only go up and y’all will be crying when you miss this MSFT train.  Fuck you.",
        "subreddit": "wallstreetbets",
        "title": "Fuck you, I’m going all out on MSFT",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i6nqks/fuck_you_im_going_all_out_on_msft/",
        "created": 1597024611.0
    },
    {
        "author": "HSG_Messi",
        "created_utc": 1596728560,
        "id": "i4u39h",
        "num_comments": 251,
        "num_crossposts": 0,
        "selftext": "Reports are circulating  that Microsoft is looking to purchase Tick Tock outright. Is this really a good business move on their part? Could we really see a buy the hype sell the news with MSFT? I mean I know MSFT is typically seen as one of the safest plays and a solid long term hold but is the expectation that this news could shoot it past say 220 with the possibility of a large crash if the deal turns out to be way overpaid or MSFT gets in over their heads trying to run it?\n\nCurious on everyone's stance with this.",
        "subreddit": "stocks",
        "title": "MSFT looking to purchase all of Tick Tock, not just US section.",
        "url": "https://www.reddit.com/r/stocks/comments/i4u39h/msft_looking_to_purchase_all_of_tick_tock_not/",
        "created": 1596757360.0
    },
    {
        "author": "-Pio-",
        "created_utc": 1598721077,
        "id": "iiw3p4",
        "num_comments": 240,
        "num_crossposts": 0,
        "selftext": "For the sake of this discussion let's exclude ETF's too.\n\nWhat would your top 5 picks be? Let's say holding for 30 years. I like V/MA, something energy/renewable related, WM and JPM.\n\nAnd tesla for the memes.\n\nWhat are your recommendations?",
        "subreddit": "stocks",
        "title": "What are you top 5 picks excluding FAANG +msft for long term?",
        "url": "https://www.reddit.com/r/stocks/comments/iiw3p4/what_are_you_top_5_picks_excluding_faang_msft_for/",
        "created": 1598749877.0
    },
    {
        "author": "hydershykh",
        "created_utc": 1597033780,
        "id": "i6y7kl",
        "num_comments": 236,
        "num_crossposts": 0,
        "selftext": "A data scientist here. Recently developed a tool that analyzes options flow from the entire day to make short term predictions of 1-5 days. Wanted to share some of the alerts for the next week with you folks. Please let me know if this is something that everyone likes here and if I should continue it.\n\nThe tool is still new so please be careful with all the alerts. **I would recommend paper trading these for a few days and doing your own DD as well**.  The overall accuracy is around 60-70% which means it can make mistakes. Happy to talk more about how the tool works.\n\nBullish means the stock is expected to move up more than 1% from the  current  close at least 1 day in the next 1-5 days. Bearish means  the stock is expected to stay the same or go low in the next few  days. The definitions are a bit loose but the stock usually makes a decent amount in reality.\n\n# Bullish Alerts\n\n**$BABA**   \\- Bullish probability of 84.3%. This fell right at the 50 moving   average which usually acts as a support for a stock in uptrend ([https://i.imgur.com/zHVQEAV.png](https://i.imgur.com/zHVQEAV.png)).\n\n**$CHWY**   \\- Bullish probability of 75.1%. Again, a beautiful setup especially if   it falls on the support at $52 and starts to bounce back ([https://i.imgur.com/87PRrBI.png](https://i.imgur.com/87PRrBI.png))\n\n**$MSFT** \\- Bullish probability of 71.0%. As long as this stays above the support of $210, this is a good setup ([https://i.imgur.com/ap3wpn1.png](https://i.imgur.com/ap3wpn1.png)). Otherwise, it might fall down hard because of the gap.\n\n**$TWLO**   \\- Bullish probability of 67.2%. This is only a decent setup if it  stays  above the support of $245. Bad setup otherwise. However, the tool  is  bullish, so I have got to go with that. ([https://i.imgur.com/mBjDqeT.png](https://i.imgur.com/mBjDqeT.png))\n\n# Bearish Alerts\n\n**$SPCE**   \\- Bearish probability of 88%. This was predicted to be bearish about a   week ago and it has gone down a lot. Continue downward trend if it can   break the support at $17 ([https://i.imgur.com/jwH4yyu.png](https://i.imgur.com/jwH4yyu.png)) ([https://i.imgur.com/78hHgpw.png](https://i.imgur.com/78hHgpw.png))\n\n**$AAL** \\- Bearish probability of 87.5%. I **would be careful**   with this setup since the price  is forming a bullish triangle. If it   breaks the 13$ level, get out immediately as that is a good resistance   level ([https://i.imgur.com/vCnsdc9.png](https://i.imgur.com/vCnsdc9.png))\n\n**$SRNE**   \\- Bearish probability of 86.9%. This is the third alert from the tool   and I've failed twice with this alert. So I would encourage you not to   follow this. But I trust the tool and I think this is going to get down   at some time.\n\n**$JPM** \\- Bearish probability of 85.3%. This is a good setup if it touches the resistance and comes back from $99.7 level ([https://i.imgur.com/RCEvRes.png](https://i.imgur.com/RCEvRes.png))\n\n**If you don't like these alerts, please don't be a hater, just ignore them. They are not perfect and I know that.** \n\nHappy to chat more about how everything works. Please do let me know if this is something folks here would want on daily basis. Here is a spreadsheet that contains results from the week before last ([https://docs.google.com/spreadsheets/d/1fT2P9JKxmnyZFFXEOl9QWBsqAqzTwYi-UXSPJ2InECw/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1fT2P9JKxmnyZFFXEOl9QWBsqAqzTwYi-UXSPJ2InECw/edit?usp=sharing))",
        "subreddit": "options",
        "title": "Developed a Tool that Analyzes Options Flow to make Predictions | BABA, MSFT, SPCE, AAL, JPM",
        "url": "https://www.reddit.com/r/options/comments/i6y7kl/developed_a_tool_that_analyzes_options_flow_to/",
        "created": 1597062580.0
    },
    {
        "author": "bumblebear3012",
        "created_utc": 1598112671,
        "id": "iel67c",
        "num_comments": 204,
        "num_crossposts": 0,
        "selftext": "Is Microsoft the best stock of all-time? Back in the 90s, it used to be  known as the millionaire stock with how many Microsoft investors and  employees saw their wealth rise on the back of the company’s fortunes. The shares have split 9 times. And the company is currently the second most valuable in the world. If you invested $1,000 in the Microsoft IPO  in 1986, today it’d be worth $2,130,200 – that’s a total return of  212,920%, or 25% annualized returns *every year for the past 34 years*. By comparison, $1,000 invested in the Apple IPO would be worth $1,262,380 today. \n\nMicrosoft’s  dominance in PC software was so absolute by the late 1990s that the US  Government opened antitrust proceedings in 2001 and tried to break up  the company. Yet only a decade later, Microsoft had largely been  surpassed by Apple and Google. No longer did tech executives and  business schools point to IBM as the poster child for corporate  stagnation and loss of commanding market share. It was now Microsoft. \n\n7  years ago, Microsoft was such an afterthought that the now-famous FAANG  moniker conspicuously excludes the Redmond giant despite Microsoft  outperforming both Google and Facebook in the time since (and until  Apple’s near-30% rise the past month, Apple as well). So how did we get  here? \n\nThe [journey](https://blackjacketco.com/f/featured-flashback-how-microsoft-rose-and-fell-then-rose-again) – summarized below – revisits the mania surrounding the launch of Windows 95, an  investment that saved Apple from bankruptcy, a series of failed  acquisitions and product launches, and the rebirth of Microsoft under  current CEO Satya Nadella. \n\n **BASIC beginnings to PC Powerhouse (1980s to 2001)** \n\n* In 1980, IBM – the world’s largest computer manufacturer at the time –  approached Microsoft with an offer to license an operating system for  their soon-to-be-released IBM PC. When Microsoft received the contract,  they hadn’t yet built the operating system. They actually had to  purchase a Seattle-based company called QDOS to help build the original  MS-DOS system that Microsoft eventually licensed to IBM.\n* As part of the deal, Microsoft insisted that MS-DOS be non-exclusive to  IBM. IBM thought the future of the PC was hardware. Not anticipating  companies like Compaq would be able to legally reverse-engineer their  PC, Big Blue agreed to the terms. And it was the ability of Microsoft to  bundle MS-DOS with the various competing PCs that transformed the  company into the go-to operating system provider for nearly every PC on  the market. By the close of the decade, Microsoft’s stock had already  risen over 500% since its IPO. \n* MS-DOS was only a text-based system though, and Microsoft soon began to  work on a fully graphical interface, including desktop navigation and  icons, as part of a new operating system that would come to be known as  Windows. Windows completely changed the game for the PC, making it much  more user friendly and accessible for everyday consumers. By 1995,  Windows was so synonymous with the PC that customers lined up around the  block at midnight to try and get their hands on the Windows 95 release.  The Empire State Building was even lit up in Microsoft colors to mark  the occasion. \n* In 1997,  Windows 95 and the Microsoft family of operating systems held a  commanding 86.3% PC market share. In contrast to Microsoft, Apple was on  the verge of bankruptcy that year. Following an emergency investment of  $150mn from Microsoft, Bill Gates appeared live-on screen at an Apple  event with Steven Jobs to announce the agreement. He was promptly  booed. \n\n**Complacency, Stagnation, and Decline (2001-2014)**\n\n* While it’s hard to point to a single factor that caused Microsoft to  lose its way, the company became obsessed with propping up Windows as it  was the company’s major cash cow. New products were only deemed viable  if they augmented Windows or were backward-compatible. Ultimately, this  narrow focus on Windows left Microsoft over-exposed to the PC market at a  time when new trends were starting to emerge in computing and digital  services. \n* On December 29,  1999, Microsoft hit a split-adjusted all-time high of nearly $120 per  share. A little over two weeks later, Bill Gates stepped down as CEO and  Steven Ballmer ascended to lead the company. Under Ballmer, Microsoft  employees repeatedly identified promising technologies, like e-readers  and mobile software, only to see those projects pushed aside because  they didn't revolve around Windows. Microsoft had an e-reader prototype  as early as 1998, developed a mobile operating system called Windows CE,  and worked on a smartphone-type device all the way back in 2000.  Despite a multi-year head start in these areas, Microsoft never found  success. \n* Apple released the  first iPod in 2001, but it took until 2006 for Microsoft to release the  rival Zune. And in a sign of how far ahead Apple now was at that point,  only two months later Steve Jobs revealed an integrated music player and  internet-capable phone called the iPhone. The Zune was a complete  disaster, and in 2009, Apple had a 71% share of the MP3 player market. \n* Microsoft also completely missed the mark on search. In 2004, an  upstart Google had been poaching talented developers – as well as some  senior executives – from Microsoft for a couple years. In response,  Ballmer ordered the company to start prioritizing search. Although  Microsoft had several previous iterations of a search platform, the  company didn’t launch Bing until May 2009. Over the next 3 years Bing  lost $6bn, and a failed acquisition of advertising company aQuantive in  an attempt to jump-start search led to a $6.2bn write-down and the  company’s first-ever quarterly loss in 2012. \n* After the introduction of the iPhone, Ballmer famously said: “No chance  that the iPhone is going to get any significant market share.” Yet as  PC sales plateaued then declined and the mobile market was quickly  becoming the future, Microsoft’s inability to develop a mobile strategy  or a competing product became the embodiment of the company’s failure to  perceive market trends and remain relevant beyond the PC. Although  Ballmer tried to get Microsoft into the game by purchasing Nokia’s  mobile phone division in 2013, the company never got above 3.6% market  share. And in 2015, Microsoft wrote off the whole acquisition for  $7.5bn.  \n\n**Nadella and the Rise of Azure (2014-Present)**\n\n* One of Nadella’s first and most important moves after taking the helm  was to finally recognize that Windows could no longer drive the future  of Microsoft. Instead, he made it a corporate priority to go all-in on  the cloud at the exact time when enterprise IT spend was starting to  show a real demand for cloud computing capabilities. \n* He also greatly changed the culture. Under Gates and Ballmer, Microsoft  was the epitome of anti-competitive. Rather than work with other  companies in the PC and software businesses, they used Microsoft’s  dominant position in both operating system and web browsing to squeeze  rivals or eliminate them altogether. Nadella forced Microsoft to open,  to seek out partnerships, and to even prioritize its iOS or Android  mobile software offerings to the detriment of the now defunct Windows  phone. \n* Today, Linux is about  as widely used on Azure as Windows is. And this corporate strategy has  led companies to seek out Microsoft’s cloud offerings as Amazon  increasingly expands into more and more industries to disrupt. Microsoft  also repackaged its enterprise and productivity tools into  subscription-based products rather than costly one-time downloads or  annual license fees. \n* The new  Microsoft strategy has empowered developers and engineers to pursue  innovation in the exact opposite way that occurred under Ballmer. And  the company has developed a more customer-centric approach to developing  software that has resulted in a suite of bundled enterprise resource  products, such as Dynamics 365, that have made the entire Office 365  SaaS offering that much more compelling for large corporations. \n* The most crucial driver in the Microsoft turnaround has been the  hyper-growth of the company’s Iaas and PaaS platform Azure. As much  credit as Azure receives now, back in 2015 and 2016, Amazon AWS was  largely considered the undisputed king of the cloud. Articles would  frequently cite how AWS was bigger than Microsoft, IBM, Oracle, and  Google combined. Following years of 75-100% growth rates, however, Azure  is now firmly in peer status alongside AWS. This is no better evidenced  than by Microsoft’s $10bn contract win over Amazon for the DoD JEDI  contract last year. \n* Although  Azure growth is slowing, as of July 2020 AWS has 31% market share versus  20% for Azure – an amazing turnaround. And despite the disproportionate  attention given to the AWS/Azure as the “cloud”, Microsoft’s place as  the leader of enterprise SaaS means that the company actually generates  more quarterly revenues ($14.3bn) from the cloud relative to Amazon  ($10.8bn). \n\nWhen Nadella first took over, Microsoft’s market cap sat around $300bn. Today, it’s $1.6tn. \n\n*You can find me on Twitter* [@BlackjacketCo](https://twitter.com/BlackjacketCo) *where I write about emerging technologies and long-term market trends. Thanks for reading!*",
        "subreddit": "stocks",
        "title": "Microsoft: The Story behind the Rise and Fall then Rise",
        "url": "https://www.reddit.com/r/stocks/comments/iel67c/microsoft_the_story_behind_the_rise_and_fall_then/",
        "created": 1598141471.0
    },
    {
        "author": "barelypos",
        "created_utc": 1598538372,
        "id": "ihlyrq",
        "num_comments": 200,
        "num_crossposts": 0,
        "selftext": "Title says it all. YOLO MSFT now\n\n[https://www.cnbc.com/2020/08/26/microsofts-tiktok-deal-ballooned-after-trump-intervened.html](https://www.cnbc.com/2020/08/26/microsofts-tiktok-deal-ballooned-after-trump-intervened.html)",
        "subreddit": "wallstreetbets",
        "title": "Buy MSFT autists, TikTok is coming",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ihlyrq/buy_msft_autists_tiktok_is_coming/",
        "created": 1598567172.0
    },
    {
        "author": "PapaStocks",
        "created_utc": 1597404495,
        "id": "i9k8at",
        "num_comments": 189,
        "num_crossposts": 0,
        "selftext": "I wonder how this will go? Unlike TRVN, Moderna, BioTech they have Bill Gates money.\n\nCoronavirus vaccine developer CureVac raises $213.3 mln in U.S. IPO\nAugust 14, 2020, 3:24 AM PDT·1 min read\nAug 14 (Reuters) - CureVac BV said on Friday it raised $213.3 million in its initial public offering in New York, setting the stage for the first stock market debut of a company developing a potential vaccine to combat the coronavirus.\n\nThe German biotechnology firm, backed by Microsoft Corp founder and billionaire Bill Gates, sold 13.33 million shares at $16 apiece, the top end of its indicated price range of between $14 and $16 per share.\n\nCureVac is researching how to use messenger RNA to treat a series of diseases, including the coronavirus. It is an experimental approach that has also been adopted by some of its peers, including Moderna Inc and BioNTech SE.\n\nBank of America, Jefferies, and Credit Suisse are lead underwriters on the IPO. CureVac shares are due to start trading on Nasdaq on Friday under the symbol 'CVAC'. (Reporting by Noor Zainab Hussain in Bengaluru; Editing by Shounak Dasgupta)\n\nhttps://finance.yahoo.com/news/coronavirus-vaccine-developer-curevac-raises-102410295.html?.tsrc=rss",
        "subreddit": "pennystocks",
        "title": "CVAC IPO Today (Backed By Bill Gates)",
        "url": "https://www.reddit.com/r/pennystocks/comments/i9k8at/cvac_ipo_today_backed_by_bill_gates/",
        "created": 1597433295.0
    },
    {
        "author": "unfuckthisfuckery",
        "created_utc": 1596747074,
        "id": "i4zybe",
        "num_comments": 184,
        "num_crossposts": 0,
        "selftext": "You’re new to this, we get it. You just made out with your wife’s boyfriend’s grandma to get a $2000 loan and now you’re looking for the fastest way to 420.69x it so you have enough cash to forget the wrinkled granny skin you just caressed.\n\nI’ll let you in on an open secret. We don’t make money around here. The occasional gain post is followed by thousands and thousands of losses, posted or not. The endless spam of the same 5 tickers that get recycled every week comes from us degenerate motherfuckers holding bags and trying to break even on our shitty positions by luring you in.\n\nIf you’re new to this, buy calls on APPL, AMZN, FB, MSFT and hold onto those for a couple weeks. This has worked consistently for months now and will likely continue while the rest of the market moves down or sideways.\n\nTldr; Stop fucking spamming this sub a thousand times a day, asking for the next YOLO! If you actually have a play, post some DD.",
        "subreddit": "wallstreetbets",
        "title": "PSA: Stop asking for YOLO’s for your $2000 plays!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i4zybe/psa_stop_asking_for_yolos_for_your_2000_plays/",
        "created": 1596775874.0
    },
    {
        "author": "LayeredFailure",
        "created_utc": 1596371397,
        "id": "i2ba5z",
        "num_comments": 181,
        "num_crossposts": 0,
        "selftext": "Apple has had 1,044% gain in 10 years; 267% in the past  5 years. \n\nGoogle has had 545% in the past 10 years; 135% in the past 5 years.\n\nMicrosoft has had 725% in the past 10 years; 336% in the past 5 years.\n\nI was thinking about it, and would it bad a bad idea to just split my money in a couple stocks (still looking at the other long term companies, but probably Google and Microsoft) but just keep it there for the next 10 years or whenever I need it?\n\nIf i invest my savings of just shy of 100k, and contribute bi-weekly (each part of my paycheck I can buy more stocks) I could add about 40-50k annually.\n\n&amp;#x200B;\n\nIs this a bad idea? I understand the concept of diversifying but I also don't believe these companies will be overshadowed in the next 10 years. Is there something I'm not considering? Why do people overly diversify and routinely buy and sell? How often do people go 'ultra long' on stocks?",
        "subreddit": "investing",
        "title": "Investing in Apple for the next 10 years?",
        "url": "https://www.reddit.com/r/investing/comments/i2ba5z/investing_in_apple_for_the_next_10_years/",
        "created": 1596400197.0
    },
    {
        "author": "rawrtherapy",
        "created_utc": 1597768713,
        "id": "ic4hlw",
        "num_comments": 180,
        "num_crossposts": 0,
        "selftext": "Let’s be real. We know the Market Makers data scrape WSBs for possible inversion and plays. But what you might not know is HOW they scrape the data from WSBs\n\nHear me out, being a Python dev myself I’d scrape this sub looking for specific keywords and numbers to map tickers\n\nSo a post would come in like this:\n\nTitle: Why Microsoft is going to moon to $200\n\nPost des: blah blah blah stupid stuff and the TL;DR at the end\n\n** Now here’s the most interesting part of all of this**\n\nIf I were to scrape this sub I’d be scraping TL;DRs and titles for tickers and numbers\n\nAn easy way to fuck with MMs algos is top stop using numbers and just use words\n\nSo instead of writing $20 Call just write twenty dollar call\n\nTL;DR fuck with the MMs algos and start replacing numbers with words",
        "subreddit": "wallstreetbets",
        "title": "How to fuck with the Market Makers Algo’s in one easy step, from a Python Dev",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ic4hlw/how_to_fuck_with_the_market_makers_algos_in_one/",
        "created": 1597797513.0
    },
    {
        "author": "Cygopat",
        "created_utc": 1596413576,
        "id": "i2muj7",
        "num_comments": 165,
        "num_crossposts": 0,
        "selftext": "Apple, Microsoft, Amazon, Google. These companies have one thing in common - their market cap is above $1 Trillion. They're all fairly diversified, some more some less but they certainly don't rely on one single product to exist. It's actually basically impossible to open a business nowadays without having to do with at least one of these companies. I realize that just 15 years ago the top 4 companies by market cap were very different ones and historically things have always changed, especially in tech. This time feels different though. Regulators are sleeping and politicians don't understand these companies. On top of that China is getting more and more powerful so it's questionable if there's even political interest in holding back the tech giants. Whenever competition emerges they can just kill it with money either by simply buying the competition or making the own product superior. On top of that their products have long lasting lock in effects. For the business side it's very expensive to move away from them and your average user hates having to get used to something new. As long as something \"just works\" people don't change for minor benefit and it feels like these companies have gotten strong enough to ensure that nobody else is ever offering something vastly superior.\n\nAs much as the past has shown otherwise, I don't see a world in which Apple, Microsoft, Amazon and Google are not at all at least top 10 in market cap 20 years from now.\n\nAt this point why even bother with anything else and not go all in on them?",
        "subreddit": "investing",
        "title": "Are we heading towards a Cyberpunk-style future in which a few companies own and run everything?",
        "url": "https://www.reddit.com/r/investing/comments/i2muj7/are_we_heading_towards_a_cyberpunkstyle_future_in/",
        "created": 1596442376.0
    },
    {
        "author": "spencercoffman",
        "created_utc": 1596548326,
        "id": "i3jgol",
        "num_comments": 164,
        "num_crossposts": 0,
        "selftext": "Facebook is a growing  company that owns many more companies. They are really working to expand What’sApp and Instagram. There is clearly a bright future ahead.\n\nMicrosoft is also a growing company. They also own other companies like Xbox and LinkedIn. In addition, they are looking to purchase the popular TikTok app from ByteDance to get into the social media game. \n\nBoth of these stocks have grown by about the same amount in 2020. In addition, they are both around the same price range. (Only $35 separates the two). \n\nTherefore, if you had $1000 which stock would you purchase and why?",
        "subreddit": "StockMarket",
        "title": "Facebook or Microsoft",
        "url": "https://www.reddit.com/r/StockMarket/comments/i3jgol/facebook_or_microsoft/",
        "created": 1596577126.0
    },
    {
        "author": "assetdash",
        "created_utc": 1598233028,
        "id": "iffsjm",
        "num_comments": 162,
        "num_crossposts": 0,
        "selftext": "Tesla has [overtaken](https://assetdash.com) Walmart, Procter and Gamble, Mastercard, and Home Depot by market cap. \n\nThe recent rally started after Tesla announced it would be doing a five to one stock split on August 31st. Since the announcement, Tesla has added an additional **$126 billion** to its market capitalization bringing the total to **$382 billion** as of Friday’s close.\n\nThe surge pushed Tesla’s market capitalization past many household names including retail giant Walmart and consumer goods corporation Procter and Gamble.\n\nWalmart recently announced an earnings beat on both revenue and earnings per share led by **97% annual eCommerce growth**. Walmart’s total revenue in the second quarter was $137 billion, while Tesla’s second-quarter revenue was only $6 billion. Walmart’s net income was $6.48 billion while Tesla’s second-quarter net income was just over $100 million.\n\nProcter and Gamble reported $17.7 billion in revenue with $2.8 billion in net income in its last quarter, more than **173%**, and **2,592%** respectively when compared to Tesla’s most recent earnings.\n\nTesla currently has a $10 billion market capitalization lead over Walmart and a $41 billion lead over Procter &amp; Gamble.\n\nOutside of the stock split announcement, investors are excited about Tesla’s delivery of 90,000 cars in the second quarter, 10,000 above estimates.\n\nTesla is gearing up to pass finance conglomerate Visa and the multinational corporation Johnson &amp; Johnson. Visa’s market capitalization is only $14 billion ahead of Tesla’s while Johnson &amp; Johnson has a $20 billion lead over the automobile company. Surpassing Johnson &amp; Johnson would put Tesla in the [Top 10 by market capitalization](http://assetdash.com/).\n\nTesla is not the only company seeing its shares rise in price following the announcement of a stock split. Apple announced a four to one stock split on July 30th. Since the announcement, Apple has added **$480 billion** to its market capitalization making it the first US company to pass the $2 trillion market cap milestone. The rally has increased Apple’s lead as the most valuable US company over Amazon and Microsoft by more than **$400 billion**.",
        "subreddit": "stocks",
        "title": "Tesla's market cap drives past Walmart, Procter and Gamble, and Home Depot",
        "url": "https://www.reddit.com/r/stocks/comments/iffsjm/teslas_market_cap_drives_past_walmart_procter_and/",
        "created": 1598261828.0
    },
    {
        "author": "bumblebear3012",
        "created_utc": 1596482526,
        "id": "i33kxb",
        "num_comments": 159,
        "num_crossposts": 0,
        "selftext": "In a recent post I did on AMD, some had expressed interest in a write-up on Cloudflare. I wasn’t going to write anything since I am long NET, but then I saw Fastly up around 13% today ahead of its earnings on Wednesday. With both Cloudflare and Fastly reporting this week, I thought the timing was apt to compare these two as they’ve pursued different approaches to building their networks. And I happen to believe that while Fastly’s heavy focus on speed/performance does offer some advantages in the CDN market, the real opportunity in these names (as well as Akamai for that matter) is the edge computing market – not CDN.\n\nI think one of the major reasons why Fastly is up over 430% YTD and Cloudflare over 145% is because most analysts were slow to pick up on the full extent of the end market(s) these companies are exposed to. I also think there has been some conflation in terms of the technology. Even now, I see CDN and edge computing used interchangeably when they are not necessarily the same. While similar ideas in that they both leverage edge servers (servers placed at a closer geographical proximity to the end-user or device), the use-case is not necessarily the same. Think of a CDN more so as a particular application or use of edge computing. To this point, multiple CDN players (Akamai, LimeLight, CDNetworks) have made recent moves into the broader edge computing market. \n\nBroader is the keyword here, because whereas CDNs cache web content (videos, photos, etc. from a website to speed its “delivery” to the site’s visitor), the hype surrounding edge computing is more so tied to 5G and the Internet-of-Things rather than primarily websites or SaaS applications necessarily. To be more specific, the value proposition of IoT is the vast distribution of sensors and real-time *collection* of data. Positioning edge networks closer to the IoT devices can enable faster industrial or logistics solutions.\n\nThose familiar with Fastly will be aware that they offer (or offered) the fastest cold start times (this just means the time it takes for an application to start up and be responsive to user input) of any serverless network application (CDN or edge) at 35 microseconds. Fastly claims that they are the gold standard for speed and performance and superior to AWS, Azure, Google, and Cloudflare. This approach has been successful, especially in targeting large enterprise customers. Fastly has a much larger average customer size relative to Cloudflare. \n\nWhile Fastly has recently expanded their security offerings as they further develop their edge platform, Cloudflare's strategy from the onset has been to balance performance, speed, and flexibility. Why does this matter? The major drawback to edge computing is that it greatly increases attack vectors for network intrusion. 5G will enable an extremely rapid proliferation of IoT devices. According to the Telecommunications Industry Association, by 2022, more than half of all internet-connected devices will by IoT machines. And IoT device operators will absolutely prioritize security of their industrial and logistics applications, especially as most computing applications (websites, programs, etc.), are not really as sensitive to latency at the speeds we are talking – i.e. the user/operator can’t actually discern the speed difference on their end. \n\nIoT operators (industrial, logistics, transportation companies) won’t be focused on consumers doing e-commerce or going on Reddit. They will be collecting zettabytes of structured and unstructured data to *push upstream* so that they can manage their assets more efficiently and securely. Fastly’s network utilizes fewer servers to increase efficiency and speed. Although that is great for Twitter, this lowers the network capacity to mitigate DDoS attacks (the most common IoT attack). Cloudflare has more points-of-presence and network capacity versus Fastly. This combined with their more expansive attack logs (Cloudflare services a far greater number of web properties than Fastly) and more mature security product portfolio, gives their network architecture numerous advantages for the edge computing market. This is all ignoring the fact that Cloudflare announced last week *zero nanosecond* cold start times for its edge computing platform which totally undercuts the Fastly speed advantage anyway. \n\nThe CDN market is larger today. Prior to COVID and the work-from-home demand boost, estimates tagged it at around $13.3bn. In comparison, the edge computing market was only $3.5bn in 2019 according to Grand View Research. Looking towards the future though? The CDN market is forecasted to hit $23bn plus by 2025, while the edge computing market is seen hitting $43bn or more in 2027. There have been recent reports that suggest the rise in the edge computing market over the next 10 years could even rival the growth in public cloud over the previous ten years (led by Amazon, Microsoft, Google). And Gartner believes that by 2025, three-quarters of enterprise-generated data will be created and processed at the edge. If you stop and think how much data has been created in 2020 versus just a few years ago, that is truly staggering growth. \n\nThe above comments gloss over the fact that there are also some very real reasons why a CTO or purchaser would select Cloudflare as a CDN over Fastly. The other big advantage Fastly has over Cloudflare (and Akamai) is it is *much* more customizable for developers. For web applications that are very high-level enterprise grade or extremely sensitive to latency, it absolutely makes sense to go with Fastly. However not all use-cases for a CDN require that level of customization, and there is quite the vertical learning curve for developers to learn the Fastly platform. Cloudflare also has more flexible pricing tiers (including a free tier) for customers who may not need the premium features. In short, there is a much wider range of use-cases that Cloudflare can cater to with its CDN platform relative to Fastly. I think this is evidenced by the fact that Cloudflare has far more customers (number not size) in addition to a much bigger developer community on Stackflow. \n\nThis all gives Cloudflare more potential to scale with its CDN customers and cross-sell its more diverse product portfolio. Again, Fastly certainly has a very strong presence in the large enterprise market. And for many, the performance and customization offered by Fastly will be a decisive factor when it comes to which CDN provider to choose. But I do think that Fastly has very much built itself to be the premium provider when a lot of customers are totally happy with a marginally slower cold start time if it means more flexibility on cost or ease-of-use.\n\nAt the end of the day, what this boils down to is which end market are you more bullish on: CDN or edge computing. For the record, I think over the next five years Fastly has a great opportunity to keep up the momentum. Its performance YTD would scare me a little bit in the immediate term because I think these levels assume continued growth acceleration or more guidance raises. But the CDN market is projected to keep growing at a healthy clip. And like I said, there are definitely some clear use cases for Fastly. \n\nI just happen to think that Cloudflare has a much, much, much higher long-term ceiling (thinking next 10-15 years) when you look at its natural advantages in the edge computing space and the enormous potential of that end market. Also of note, Cloudflare is slated to nearly double its global data center footprint over the next 3 years through its joint venture in China with JD.com. And whatever you think of China, its undeniable that there will be a data explosion there as internet penetration goes from the low 60% it is today to someday rival western countries. \n\nFastly is interesting, but when you look at the fact that Cloudflare has 77% gross margins compared to 57% for Fastly, you are ultimately paying a higher EV/revenue for slower growth, fewer revenues, one-fifth the cash, and significantly weaker margins. Good luck to all!",
        "subreddit": "stocks",
        "title": "Fastly vs. Cloudflare: The Pre-Earnings Rundown",
        "url": "https://www.reddit.com/r/stocks/comments/i33kxb/fastly_vs_cloudflare_the_preearnings_rundown/",
        "created": 1596511326.0
    },
    {
        "author": "kickace",
        "created_utc": 1598218220,
        "id": "ifbqta",
        "num_comments": 155,
        "num_crossposts": 0,
        "selftext": "Hear me out.\n\nSlack is one of the most used collaboration tools out there and perfectly positioned to be a winner in this environment. The issue people have with it is that they fear Microsoft Teams as a competitor. They beat expectations yet dropped after earnings due to the threat of Teams.\n\nForget about the better tool or who will win. What I don’t get is how Zoom ($ZM) has gotten a pass from this threat. Slack and Zoom are tied at the hip. Zoom is the top integration within Slack. They have nearly identical revenue and growth, yet Zoom goes to the moon and Slack gets hammered.\n\nIf Teams is keeping Slack down, Zoom should be suppressed as well. Teams is the just as much a threat to Zoom as Slack.\n\nWith that said, I think Slack should be much higher rather than Zoom being lower. Slack is a superior product that provides much more than messaging. There are entire companies based on integrating with Slack. Their ecosystem is rich and growing quickly.\n\nSlack announces Q2 earnings on Sept 8th, and I believe they’ll beat expectation and turn a profit for the first time in their history which will put the fear of Teams behind them.\n\n🚀🌕",
        "subreddit": "wallstreetbets",
        "title": "Slack ($WORK) unfairly punished by Teams",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ifbqta/slack_work_unfairly_punished_by_teams/",
        "created": 1598247020.0
    },
    {
        "author": "UnknownEssence",
        "created_utc": 1597412291,
        "id": "i9m42g",
        "num_comments": 155,
        "num_crossposts": 0,
        "selftext": "The S&amp;P500 is market cap weighted so it holds 6% in Microsoft, but only 1.27% in Visa, because Visa has a much smaller market cap than Microsoft.\n\nI want to build my own market cap weighted index, but only of the stocks I select. So I'm looking for an app/site that will calculate these % values for a portfolio of selected stocks. Does this exists? \n\nIf not, I might build it. Would anyone be interested in using something like this? With free trades and fractional shares, it would be easy to build your own index funds with a tool like this.",
        "subreddit": "stocks",
        "title": "Looking for a \"Build your own ETF\" website - does it exists?",
        "url": "https://www.reddit.com/r/stocks/comments/i9m42g/looking_for_a_build_your_own_etf_website_does_it/",
        "created": 1597441091.0
    },
    {
        "author": "UneergroundNews",
        "created_utc": 1596550055,
        "id": "i3jxry",
        "num_comments": 134,
        "num_crossposts": 0,
        "selftext": "Ever heard of Xcloud??? Probably not bc you’re autistic. Microsoft is releasing a “Netflix for games” subscription this month. \nDon’t give a fuck about video games??? Me neither, I remember when I was 5. \nWhat about the mother fucking environment pussie boi??? Microsoft is planning on being a “Zero Waste” company by 2030. \nThough I can bet that you’ve heard of the potential purchase of TikTok, where you can watch me do a fortnite dance over a huge pile of tendies while my wife’s boyfriend packs his shit in the background. \n\nToo much good news to be true? Don’t be a fucking retard. By the dip \n\nTLDR: MSFT mooning to tendie grown",
        "subreddit": "wallstreetbets",
        "title": "MSFT BUY THE DIP",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i3jxry/msft_buy_the_dip/",
        "created": 1596578855.0
    },
    {
        "author": "Domega86",
        "created_utc": 1596926564,
        "id": "i68ffh",
        "num_comments": 130,
        "num_crossposts": 0,
        "selftext": "My wife and I have well diversified retirement accounts and are in our 30’s. Each account has about 200k of stocks and well whatever 10% of our pay goes to. Ive even picked up 60 ounces of silver bullion at $18 an ounce cost average. \n\nToday, with a fear of stagflation/inflation I have started a Robinhood account.  I opened the account and purchased 3 shares of Apple stock. I’m not looking to by a daily trader but and investor for the long term. This is so some of my cash doesn’t depreciate with inflation. \n\nI see some low hanging fruit on some big name stocks. Airlines, cruise ships, Ford, GM, and Microsoft.   With Covid-19 happening some of these industries have had a pull back. I feel they will rebound and a timely fashion and get back to past peaks. \n\nCan anyone help me polish my thoughts? I never had experience really dabbling in stocks like this. With those companies i mentioned above I’m only willing to risk 10-50 shares of stock.  \n\nThanks for your thoughts and feedback.",
        "subreddit": "RobinHood",
        "title": "Newbie advice. Robinhood Rookie.",
        "url": "https://www.reddit.com/r/RobinHood/comments/i68ffh/newbie_advice_robinhood_rookie/",
        "created": 1596955364.0
    },
    {
        "author": "clicknbait",
        "created_utc": 1596838317,
        "id": "i5nb19",
        "num_comments": 130,
        "num_crossposts": 0,
        "selftext": "I am seeing a shit load of new treads discussing the following-\n\n1. Fastly vs NET\n2. Hold Fastly or let go?\n3. What does Fastly do? \n\nSo I will clear up a few myths just in case. \n\nFastly is a CDN provider, which allows their clients to host their website on Fastly's servers. Fastly's business model is catered towards large enterprises that are looking at fastest (thus the name!) cold start time, i.e. time it takes to load a webpage on mobile/PC. Here are a few of their clients-\n\n1. **Clients doing very well during Covid**\n\n* Reddit\n* Shopify\n* Wayfair\n* Pinterest\n* Twitter\n* Stripe\n* Overstock\n* Shazam\n* Wealthfront\n* Etsy\n* Tiktok\n\n2. **Clients doing not so well during Covid**\n\n* Airbnb\n* Jetblue\n* Trip Advisor\n* Alaska Air\n* Kayak\n* Yelp\n* Kayak,\n* and many more....\n\nNotice first that their clients that are booming right now are very likely to continue booming for the next year or so. Once we are done with Covid (that is if), revenues will switch to clients in hospitality business, which typically have a strong business during normal times.\n\n&amp;#x200B;\n\nFastly's USP is fastest cold start time, i.e., it is the best CDN in the market which allows the visitors on their client's website to load the webpage/apps faster than anyone else in the market right now. \n\n&amp;#x200B;\n\n**Why is this USP so important**\\--well there are a few reasons why Fastly will continue to have higher growth rate.  I have noted a few down below-\n\n&amp;#x200B;\n\n1. Apple rolls out 5g iPhone later this year. They will require webpages to load faster. Fastly is the best CDN there is to handle that request. This does not mean that Akamai or NET are sitting out catching honeybee, but really means that Fastly is positioned to serve that switch to 5g better than NET or Akamai IMO.\n2. Fastly's business model is unique. It charges their customers based on the bytes loaded, which translates to the amount of time people spend on their customers' website. Thus, while I am spending 5-10 mins to write this essay, Reddit is getting charged by Fastly (pun intended!). Notice that this is a different business model than NET. NET offers a free subscription to begin with and has lower CDN hosting rate for those willing to host on their servers. Therefore, organizations which do not feel that speed is of concern to them as much, prefer to use NET. On the flip side, Fastly has a niche set of customers who value speed, because user experience on their website is of utmost importance to them. Imagine if I had to spend several 100 microseconds for a webpage to open, I would be pissed and may not go on that website, purely because of that reason.\n3. YoY growth based on investor's copy was 62%, which is great if you ask me. As long as it is staying above 50, my money is parked there.\n4. Bergman and Josh raised guidance for this year, during a time when a lot of CFOs are holing on giving guidance. Also of importance is that these folks in the C suite like to give a conservative guidance and beat it. In other words, promise less and deliver more. This leaves no question that next earnings should be a beat but do not take my word on it because who knows what happens tomorrow.\n\n**Influence of Tiktok on Fastly's revenue**\n\nCertainly one of the most important question that needs to be addressed because Tiktok constitutes 12% of the revenues. With the stock dropping like a rock after ER and then earnier today after Donny decided to ban it after 45 days, looks like a lot of the uncertainty is already baked into the price at this moment. Those who were uncertain unboarded the train today. That point is the exhaustion point where bulls come in and drive the stock higher (e.g., Chegg today).\n\n&amp;#x200B;\n\nI personally feel that Tiktok MSFT should be a done deal and they are waiting to announce this sometime this month. I am neither an insider nor do I happen to know the actually outcome. However, I do follow hedge fund option sentiment and I have noticed bullish calls inflow for MSFT this past couple days. While I am a peasant who is not connected to anyone involved with the deal, I am sure some of these whales are aware of the decision, which is part of the reason for that bullish call inflow for MSFT.\n\n&amp;#x200B;\n\n**Should you dump FSLY or not?**\n\nEntirely up to you but I see a lot of growth in this company. Fundamentally, nothing has changed in how they operate. The company gave an upward guidance and that drives the stock in forward direction. Some sellers left the ship because a lot of RH investors have not seen losses in their life or some are not even aware of the potential of this company, except it became a meme stock lately and FOMO drove a lot of noobs in FSLY train.\n\nIt is always better to curtail losses. If you trust that they will continue to bring in revenues, I would dollar cost average on every dip. This ensures your average cost of the share is reduced significantly with any dip. Most fund managers actually add stocks to their funds when the stock is sitting at 30 day MA. Fastly had such a quick run up that the 30 day MA kept moving. All of that being said, I think it may rest for some time before beginning the next leg up. That could be a week, 2 weeks, or a month but you will have to be patient if you do not want to loose money. However, never panik sell on a red day because that is literally the day people like me buy from people who are selling. \n\nWould Monday bring a ray of light and we open green-\n\nNo one knows what happens but I would continue to DCA on every 5% drop. I remember when Square dropped a couple years ago, I kept DCAing and here I am sitting on gains. \n\n&amp;#x200B;\n\nI hope this helped convince some of you.",
        "subreddit": "stocks",
        "title": "Fastly - Some Myths Cleared Here",
        "url": "https://www.reddit.com/r/stocks/comments/i5nb19/fastly_some_myths_cleared_here/",
        "created": 1596867117.0
    },
    {
        "author": "jonamon5",
        "created_utc": 1598308377,
        "id": "ifzjul",
        "num_comments": 121,
        "num_crossposts": 0,
        "selftext": "All in the title boys! Started in late February and road the rona crash til mid April. Kinda fucked up in the middle cuz I was still listening to seperationvariation so.....anyways, saw all the tendies being made by bulls and deciding to fuck it and go all in calls. Switched to tech leaps and riding out mostly MSFT and AAPL currently. \n\n[https://imgur.com/gallery/wZr8a93](https://imgur.com/gallery/wZr8a93)",
        "subreddit": "wallstreetbets",
        "title": "1K to 38K in 6 months!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ifzjul/1k_to_38k_in_6_months/",
        "created": 1598337177.0
    },
    {
        "author": "Space_Lord_MF",
        "created_utc": 1598712739,
        "id": "iitnn0",
        "num_comments": 116,
        "num_crossposts": 0,
        "selftext": "Maybe thats the real goal  though? I mean you basically have the two uncoolest companies on the planet looking to acquire it. Remember Mixer? What a piece of garbage that was. Remember the xbox 360 E3? \"Tv tv tv tv sports tv tv tv sports call of duty tv tv xbox is the next water cooler\" and then Sony whipped the shit out of them. \n\nWhen I think Microsoft I think of some boomer at work who needs help opening Word because the icon on the desktop got moved. Businesses are stuck using Windows because the average person is too dumb to use any other OS.\n\nWhen you think of Walmart you picture some old overweight redneck in their pajamas buying cheap processed garbage food surrounded by workers who get paid like a third of a living wage. \n\nYoung people are already looking at alternatives to Tik Tok.\n\n\nIm sure Microsoft will pay Usher, Bob Dole, and Nickelback to try and hype up their purchase, lol. \n\n\nAnd there are only two ways they make a profit off TikTok. One involves spying on people like Facebook which I guess is only cool if America does it but not any other country? The other is they throw a billion ads at people. Im sure people will love sitting through a 15 second laxative commercial so they can watch a 10 second video clip. \n\nThere is also the issue these companies might think having some high school chick dance in her bikini is inapproptiate but Id wager TikTok is mostly those girls and their young male peers thirsting. \nHere is another issue. Every record company and musical artist might want some royalties paid everytime their music is used, little easier to do when it is two American companies \nMicrosoft/Walmart will probably turn tik tok into some Boomer thong where people make video clips of themselves doing taxes or planting stuff in their yard or making it twitter but talkingnin front of a camera.\n\n\n\nYes, there is potential for these companies to be involved with important demographics that they have little to do with otherwise...theres bigger potential they will spend tens of billions only to watch the users flee it like rats on a sinking ship and then closing it while everyone just moves onto the next fad.\n\nSo can we stop hyping up and stock pumping every shitty company who mentions TikTok.",
        "subreddit": "wallstreetbets",
        "title": "TikTok will cease to exist in a year in the US if Microsoft/Walmart buy it",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iitnn0/tiktok_will_cease_to_exist_in_a_year_in_the_us_if/",
        "created": 1598741539.0
    },
    {
        "author": "notredwan",
        "created_utc": 1596411338,
        "id": "i2m939",
        "num_comments": 110,
        "num_crossposts": 0,
        "selftext": "Breaking news just posted. Apparently they've spoken to the Whitehouse and are planning to move by September. Potentially huge for the long-term prospects of this company!\n\n&amp;#x200B;\n\n[https://www.cnbc.com/2020/08/03/microsoft-confirms-talks-to-buy-tiktok-in-us.html?\\_\\_source=twitter%7Cmain](https://www.cnbc.com/2020/08/03/microsoft-confirms-talks-to-buy-tiktok-in-us.html?__source=twitter%7Cmain)",
        "subreddit": "stocks",
        "title": "Microsoft confirms Tiktok deal",
        "url": "https://www.reddit.com/r/stocks/comments/i2m939/microsoft_confirms_tiktok_deal/",
        "created": 1596440138.0
    },
    {
        "author": "daynightcase",
        "created_utc": 1598037112,
        "id": "ie35qw",
        "num_comments": 110,
        "num_crossposts": 0,
        "selftext": "Beside the stock split, which fundamentally adds no value to the company yet it added half a trillion $ to its valuation. What is driving this insane rally?\n\nAMZN +73%\n\nAAPL +70%\n\nMSFT +30%\n\ntheoretically MSFT, AMZN and all the software service companies would be the most beneficiary in the last 6 month because of the COVID. However, AAPL actually doubled in valuation. Their revenue hasn't grown to justify this price levels, so what gives? AAPL isn't a meme stock like TSLA, so i am genuinely surprised. Is Apple overvalued or AMZN and MSFT undervalued?",
        "subreddit": "investing",
        "title": "Apple ($AAPL) surge (up 70% YTD)",
        "url": "https://www.reddit.com/r/investing/comments/ie35qw/apple_aapl_surge_up_70_ytd/",
        "created": 1598065912.0
    },
    {
        "author": "FinndBors",
        "created_utc": 1598213094,
        "id": "ifa5hs",
        "num_comments": 110,
        "num_crossposts": 0,
        "selftext": "\nI've posted bits and pieces of this in some comments since some form of the question has come up on this subreddit. I want to list out a list of reasons why today is like the dot com times and ALSO what is different about today. I am not a financial professional, but I have been working in the tech industry for over 20 years. It is mostly tech stock focused.\n\nI'm going to also add (fact) or (anecdotal) or (opinion) to my bullet points, so take those bullet points with the appropriate grain of salt.\n\nReasons we are NOT like the dot-com boom (roughly in order of importance):\n\n* (fact) Interest rates are much lower now and long term expectations on yield is also low. In 1999, the 10 year treasury was at around 5% and rose to over 6.5% in 2000. The P/E of the S&amp;P 500 in 2000 was around 30. Which means that the 10 year treasury yielded MORE than the S&amp;P 500 earnings. This is absolutely not true today with the 10 year treasury yield being around 0.6% and P/Es being around 25-30. This single point is extremely important to understand.\n* (fact) Late stage VCs are more of a thing now than they were in dot com. Thus you have fewer IPOs and the companies that do are more mature and less speculative (of course there are outliers, see below).\n* (fact) The NASDAQ P/E in 2000 was really quite ridiculous (I can't find a chart for some reason, i think it was around 80). S&amp;P 500 was more comparable between 2000 and now.\n* (anecdotes) You can no longer get a job at a startup / real tech firm just because you know HTML or can write \"hello world\" in Perl. A lot of firms back in the late 90's were trying to fatten up the employee count and race to IPO to cash out. This doesn't happen today.\n* (fact) There was no pandemic in 2000 and it makes comparisons hard.\n\nReasons we are like the dot-com boom (roughly in order of importance)\n\n* (anecdotes) Sentiment on the ground is very similar to what you hear during the dot com boom. We make fun of the people who invest in stupid shit like NKLA, HTZ, etc. But a lot of people are creaming their pants still on the big tech (FAMANG) saying they are forever-holds / they can't go down, etc. You also now are starting to see intelligent, rational people putting money in things **precisely** because other people will and assume they can get out before it all falls apart.\n* (fact) In the late 90s, internet brokers were a new thing and made trading easier for people who didn't know anything -- and we see that today with COVID stay-at-homers and an influx of users into robinhood (I wish I could get hard numbers on the comparison). (opinion) Because of this, I'm fairly certain pricing is out of whack for a large number of companies.\n* (fact) The P/E ratios of the big techs today are higher than a lot of the big techs during 2000. Nasdaq P/E in 2000 was off the chart, but if you just look at the big profitable companies like INTC, ORCL, AAPL, HPQ, IBM, which were the equivalent of FAMANG today, they had P/Es mostly under 30s. FAMANG are around 35 except for Netflix and Amazon which are much higher (see huge caveat on interest rates above). CSCO and MSFT in 2000 were the outliers having P/Es of well over 60.\n* (anecdotes) In tech companies, a common business plan for new firms in the last ~8 years is to get market share at any cost and figure out profitability later. This is really no different from dot com when firms were valued by number of \"eyeballs\".\n* (opinion) \"this time is different\". At least in terms of technology, it's not. The internet itself was a bigger \"paradigm shift\" than what we are seeing today. I used \"paradigm shift\", because was a common buzzword that turned into a joke back in the late 90s and used to justify crazy valuations. Machine Learning is amazing, but not on par with connecting everyone on the globe. And the cloud is just a fancy name for running something on someone else's computer (even though its quite nice how easy and seamless it is today vs. 20 years ago).\n* (anecdotes) While it is harder to IPO today without profitability or clear path to profitability, it clearly still happens (UBER, LYFT, SNAP). And others are using backdoor IPOs (NKLA, SPCE).\n* (fact) In 2000, the IT sector along with Media stocks and the Telecommunications Services sector approached 40% of the S&amp;P market cap. The categories have changed but if you combine IT and Communication Services sectors, you get a 38% of S&amp;P market cap today. If you add Amazon which is not included in IT/Communication, you get over 40%. Does this mean anything, especially since we are in a pandemic and more stuff runs on IT? Not sure.\n\nYou can definitely pick apart some of the individual points, I just wanted to lay them all out and see what people thought and if anyone has other valid comparisons. I personally think we ARE in some kind of tech bubble, but I'm not going to make a fool of myself in predictions on when and how it will burst. And fuck it, while I do have more in cash than typical, I'm still in VTI/VXUS and a bunch of individual tech names since I have the background to do some analysis on the business.\n\nI'll end with a few random thoughts:\n\n* In August 1999, a lot of people were looking at the craziness of the dot com boom and how people were throwing money at stupid shit. I don't care what people say, it was pretty obvious something was wrong. If you shorted the NASDAQ then, you will watch the NASDAQ more than double in 7 months time and have your face ripped off.\n* Taking what I've posted as a whole, the one thing to be terrified about is if long term interest rates rise and the fed is either powerless or does not step in for whatever reason. This will completely destroy the stock and bond market. I don't see the catalyst for it, but I'm no economic genius. You might be able to make an argument that gold is a hedge for this unlikely scenario. There is also the worry of a slump in earnings due to general economic malaise, but that is a garden variety concern that everyone is watching for and usually pretty temporary. Rise in interest rates would be real bad.",
        "subreddit": "investing",
        "title": "Differences and similarities between 2000 and now.",
        "url": "https://www.reddit.com/r/investing/comments/ifa5hs/differences_and_similarities_between_2000_and_now/",
        "created": 1598241894.0
    },
    {
        "author": "bottlecapman2",
        "created_utc": 1596325255,
        "id": "i22aez",
        "num_comments": 108,
        "num_crossposts": 0,
        "selftext": "I see young adults on here posting about buying dividend growth stocks so they can live on the income during retirement two or three or more decades down the road. Is this really a smart approach?\n\nAren’t today’s well established, high growth, low-to-no dividend payout companies likely to be tomorrow’s dividend growth companies? And in the meantime, you’ve gotten a better total return and no taxation?\n\nI feel like, just by loading up on Microsoft, Apple, Visa, and Mastercard today (all of which do pay a (low yield) dividend), you’ve got a good chance of having a very nice dividend income stream in twenty years.",
        "subreddit": "investing",
        "title": "Dividend growth investing for young people",
        "url": "https://www.reddit.com/r/investing/comments/i22aez/dividend_growth_investing_for_young_people/",
        "created": 1596354055.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1597748884,
        "id": "ibyzcn",
        "num_comments": 107,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2020/08/17/oracle-is-in-talks-to-acquire-tiktoks-us-operations-source-says.html\n\nOracle is working with U.S. venture capital firms to acquire TikTok’s U.S., Canadian, Australian and New Zealand operations.\n\nOracle’s talks are ongoing and have progressed in recent days.\n\nOracle’s interest challenges Microsoft, which has been in talks to acquire the same TikTok assets for more than a month.",
        "subreddit": "StockMarket",
        "title": "Oracle is in talks to acquire TikTok’s U.S. operations, challenging Microsoft, source says",
        "url": "https://www.reddit.com/r/StockMarket/comments/ibyzcn/oracle_is_in_talks_to_acquire_tiktoks_us/",
        "created": 1597777684.0
    },
    {
        "author": "MajinJuuu",
        "created_utc": 1596383004,
        "id": "i2e43l",
        "num_comments": 107,
        "num_crossposts": 0,
        "selftext": "Planning on dropping $6500 into AAPL tomorrow. To do that, I will be cutting my V and MSFT by a bit, the rest is cash already on hand.\n\nMy financial manager is in the midst of talking me out of it as he believes AAPL isnt a good investment at the moment, being at its ATH and now the most valuable company on earth.\n\nCould use some thoughts on this.",
        "subreddit": "stocks",
        "title": "AAPL Tomorrow",
        "url": "https://www.reddit.com/r/stocks/comments/i2e43l/aapl_tomorrow/",
        "created": 1596411804.0
    },
    {
        "author": "rs5-",
        "created_utc": 1596553149,
        "id": "i3ktgl",
        "num_comments": 104,
        "num_crossposts": 0,
        "selftext": "Hey yall was looking to put more money in the game. I was wondering if you guys have any suggestions. I hope you all don’t mind me asking/isn’t too low effort \n\nI currently own is there anything you recommend adding? Thank you so much \n\nApple \nMicrosoft \nFacebook \nVery very small portions of ual, luv, ccl \nUso \nNvda \nDocu \nVisa \nPaypal \nJpm \nDis \nLmt\nJnj \nTdoc",
        "subreddit": "stocks",
        "title": "Favourite growth stock?",
        "url": "https://www.reddit.com/r/stocks/comments/i3ktgl/favourite_growth_stock/",
        "created": 1596581949.0
    },
    {
        "author": "DANNYBOYLOVER",
        "created_utc": 1597439348,
        "id": "i9udla",
        "num_comments": 101,
        "num_crossposts": 0,
        "selftext": "I'll post a much longer DD Sunday Evening / Monday morning with links/sources/etc and my valuation model but I wanted to go ahead and put this out there for anyone who is actually interested in doing their own DD and wants to ask any questions that I can hopefully answer and will include in the Sunday post.  I've been in this since it was at $15, sold off post earnings, got back in at $19 and sold a portion off at $21 and have been holding since then.  \n\n**Positions**:\n\n9/18 $22c\n\n9/18 $15c\n\nI currently value the company, under previously released earnings at $21-$23 low, $24-27 medium, and $28-30 top-end.  They are not and will not be profitable until 2022 and possibly 2023 given their business model and the COVID-19 crisis.  I don't believe that the market cares about their profitability as much as it cares about revenue growth and % of contract renewals.  They have a significant moat that $DBX does not have and a value proposition for large enterprises that Microsoft, Google, and other cloud-based providers cannot provide: multi-platform integration. \n\nThis range is based off of my assumptions on how the overall market is weighting $BOXs value and what we need to be thinking about:\n\n**New Customer acquisition**  \nthey lose money on every new customer (legal/accounting/marketing/training/commission fees)\n\n**Current Customer expansion**  \nCustomer paying for different modules and services that they didn't have before.  They are losing money here but not nearly as much.  Same reasons as new customer acquisition legal/accounting/marketing/training/commission etc. \n\n**Expiring customer renewals**   \nPaying to renew contracts and/or upgrade the amount of users with access - this is where they make most of their money and where they believe profitability will come from long term.  Once they have *enough* of the market (they currently have 80% of Fortune 500 with 91% \n\nThe COVID-19 crisis means they will acquire new customers, current customers are having to integrate more of BOX's product line as they shift from home, and they will continue to increase their retention rate which was **107%** in their last earnings. &lt;----- this is an absolutely ridiculous customer retention rate. I anticipate their renewal rate (which includes increased # of users) will BLOW expectations out of the water.  Prior the COVID crisis companies *did not have a reason* to increase the amount of users with remote access to $BOX.  $BOX provided their customers with *free* user account limit upgrades for a month during the last quarter... What do you think is going to happen with those organizations who were given a free account to work from home?\n\n\\---\n\n**To be clear:**\n\n\\#1 I'm not telling you that $BOX is going to beat earnings (but it will) and then go sky high (it probably won't )  \n\\#2 The money to be made in $BOX is on the earnings run-up.  It will start on Monday / Tuesday morning and run until/after earnings.  If you buy calls on Monday morning it will literally be *free* money if you sell before the actual earnings date.    \n\\#3 all of this is assuming that shit doesnt hit the fan between now and August 26th. \n\n**What happened last earnings?**\n\nIt ran up massively going into earnings ($17 to $19.50 prior to earnings), beat earnings and spiked the next day for 5%.  Institutional holders who held on to the stock since $12-$15 sold off as they re-positioned their funds for June and more/different institutions bought in June leading to the run-up June 11th-June 22nd ($18 to $22). \n\n**Why is it down now?**\n\nOverall market trends, the continual beatdown of small-cap tech stocks specifically in early July as funds once again repositioned themselves into cyclicals and FAANG, and market sympathy with $DBX.  It is currently sitting at the price that it was at BEFORE the last earnings where it ran from $17 - $21 PRIOR to their earnings report being released.  That run started 11 days before earnings.  We are currently 12 days before earnings.   The run-up will once again commence beginning next week.",
        "subreddit": "wallstreetbets",
        "title": "Get fucked by a color? Let's start learning about shapes $BOX",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i9udla/get_fucked_by_a_color_lets_start_learning_about/",
        "created": 1597468148.0
    },
    {
        "author": "MarijuanaGrowGroup",
        "created_utc": 1598191406,
        "id": "if3pmk",
        "num_comments": 97,
        "num_crossposts": 0,
        "selftext": "Sit down, listen up. \n\nI'm tired of people coming in here for the last 3 goddamn months looking for investment advice. If you come here looking for investment advice, you strike me as the type of person rolling up to a ChuckECheese for surgery consultation. \n\nSnort some Covid. \n\nCut a line of bath salts and read this post below. \n\n&amp;#x200B;\n\n1. No one gives 2 Rosie O'Donnell shits that you are trying to invest in stocks. There's a place for you, it sure as fuck isn't here. \n2. You have gains? Sweet, that's cool, we jerk off to losses though. I'm down voting every gain i see from here on out. \n3. Yes, It's too late for your retail retarded ass to invest in AAPL, TSLA, MSFT, and all the other garbage we've been playing for the last 6 months. Wait until the news reports \"DOW DROPS 800 points in a day\". THAT'S WHEN YOU SMASH BUY. \n4. No one is going to tell  you to to invest. This is a casino and Wendy's is a 5 start goddamn meal. \n5. You are not special. You are not a unique snow flake. Get the fuck out so we can get dudes like my boy Chimpu back in here. \n6. If you're buying options, only buy FD's if you want to get rich. You know what FD stands for? Faggots Delight. Are you? Then buy these. \n7. An austist is someone who thinks they've got it figured out and shoved the square peg through the round hole.\n8. A retard is you, posting here trying to do what the autist does except you can't because you're stuck on the peg being square and the hole being round. \n9. No one here has a wife, but everyone's wife is getting fucked. \n10. This makes you a cuck. \n11. If you inverse 50% of WSB and play out 50% of WSB, you will lose 100% of your money.\n12. Don't worry about tendies, you wont ever understand what the fuck they are. \n13. There are legends here, I am not one of them, you will never be one of them. \n14. If you think buying stocks is cool, it is, but don't post that shit here unless you're memeing a stock. What is a stock meme? See my RKT position below. \n15. When you think people here like you, they don't. They abuse you, take advantage of you, call you names. You'll make a post here and delete it out of shame. \n16. Grow the fuck up and get over it. You're dealing with degenerates who are keyboard warriors 9 days out of the week. \n\n&amp;#x200B;\n\nAAPL $520C 8/28\n\nRKT - 700S @ $18.10 / $30C 10/16\n\nSLV - $30C 1/15",
        "subreddit": "wallstreetbets",
        "title": "Read if you're New",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/if3pmk/read_if_youre_new/",
        "created": 1598220206.0
    },
    {
        "author": "shaneo576",
        "created_utc": 1596587689,
        "id": "i3vdfc",
        "num_comments": 91,
        "num_crossposts": 0,
        "selftext": "So I pretty much wasted all my 20's smoking weed and being useless (not recommended). I've been reading up on the wiki for new investors on this subreddit and is very helpful and informative.\n\nPretty much want to be in it for the long game, making and securing small profits, I say I don't want to do day to day trading but it seems like it could get pretty addictive. I have about 4k to start off with.\n\nI have a government scheme for retirement/buying a house, but it's just not enough, especially being self employed I don't get employer contributions.\n\nI'm thinking of starting just getting a couple shares in MSFT, AAPL and maybe a couple others for long term holds and then going from there.\n\nDoes it make it much harder if you live outside the US? I guess you can just place orders and stop losses etc just won't be there for when the markets open. (Live in NZ)\n\nAny advice, helpful or not would be much appreciated, happy trading y'all!!",
        "subreddit": "stocks",
        "title": "Any advice for a 30 year old entering the world of trading?",
        "url": "https://www.reddit.com/r/stocks/comments/i3vdfc/any_advice_for_a_30_year_old_entering_the_world/",
        "created": 1596616489.0
    },
    {
        "author": "UpSideofDown",
        "created_utc": 1596926819,
        "id": "i68hsx",
        "num_comments": 87,
        "num_crossposts": 0,
        "selftext": "My fellow retard autists,\n\nWe have Walmart earnings in two weeks (8/18).  And before you all start circle-jerking eachother about calls calls calls!  Think about this....  \n\nI'm thinking that the market is going to be expecting their Walmart+ product to be announced.  However as of 8/4/2020 it's been delayed AGAIN.  Looks like they want to release before Amazon Prime day which has been pushed back to some time in Oct. so keep that as a loose timeline.\n\nWMT is currently in about a half-month down-channel, now in a squeeze which I think is going to break down.  And I'm kinda thinking that they will not provide much guidance on Walmart+ release date during their Earnings call.\n\nIDK for sure though (got burned on MSFT and TWLO) calls holding through ER so I'm tapping into the autism source-code here to see what you idiots are thinking...",
        "subreddit": "wallstreetbets",
        "title": "Walmart calls or puts?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i68hsx/walmart_calls_or_puts/",
        "created": 1596955619.0
    },
    {
        "author": "LiveNDiiirect",
        "created_utc": 1596550744,
        "id": "i3k4lf",
        "num_comments": 83,
        "num_crossposts": 0,
        "selftext": "PRPL isn't another pump and dump. PRPL is the real fucking deal. PRPL isn't just a mattress company, it's a god blessed TECHNOLOGY company with a brand that will live amongst the clouds alongside the likes of AAPL, TSLA, MSFT, and AMZN. It's a pandemic resistant stock that is making the most cutting-edge, literally space-age technology to the average consumer who spends 1/3 of their lives using. \n\n&amp;#x200B;\n\nIt's not PRPL Mattresses, it's Purple Innovation. They're not stopping at mattresses. There's already Purple Sheets, Purple Pillow, Purple Pet Beds, and Purple bed frames. Soon there will be Purple Couches, Purple Chairs, Purple Pecliners, Purple Sleeping Bags, Purple Dining Chair Cusions, Purple Yoga Mats, Purple Blankets, Purple Mother Fucking Everything.\n\n&amp;#x200B;\n\nPurple has the power of Elon Musk combined with the power of Becky. Purple will literally revolutionize the world. Everywhere you go there will be Purple: Purple Lounges at the Airport, Coffeshops with Purple Furniture, Purple Chairs in every high end doctors office and hospital, and in damn near every house on the planet.\n\n&amp;#x200B;\n\nPurple is going to facilitate a shift in human consciousness that will lead to a massive movement in the spheres of health and wellness, and all at a legitimately affordable cost to the average consumer. This is your chance to get in on something that is going to going to be worth several hundred dollars per share in the next 5-10 years, and it's going to start blowing up massively in the next two weeks. Remember how your uncle says he wished he invested in Apple or Amazon 20 years ago? This is our opportunity. PRPL to fucking PLUTO!!!!!!\n\n&amp;#x200B;\n\nPositions:\n\nPRPL 25c 8/21\n\nPRPL 30c 9/18\n\nPRPL 50c 1/15/21\n\nand even fucking boomer shares cuz this is going to be a lifelong wealth building tool for people who recognize this and get in.",
        "subreddit": "wallstreetbets",
        "title": "I've had a vision from God and he showed the future is PRPL",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i3k4lf/ive_had_a_vision_from_god_and_he_showed_the/",
        "created": 1596579544.0
    },
    {
        "author": "tradekaiser",
        "created_utc": 1596495603,
        "id": "i37ooy",
        "num_comments": 82,
        "num_crossposts": 0,
        "selftext": "Over the past few days I’ve seen some pretty smooth-brained takes on the potential acquisition of TikTok by MSFT, and while most of them have just been autists complaining that TikTok is “gay” and that they sold their FDs too early, some have also argued that MSFT is overbought. However, if you’re playing the long game with MSFT, whether that’s with calls or sh*res, here are a few math and TA free arguments for why this acquisition is MSFT’s ticket to the outer edge of the solar system.\n\nFirst, think about who uses TikTok. Now think about it again, I know you haven’t critically evaluated anything in awhile. You thought about thots who could probably land you in jail didn’t you? TikTok’s user-base is primarily teens and young adults, which for the most part, could give a fuck about MSFT and their wide range of office products. The argument could be made for Xbox, but with PlayStation taking the lead with their exceptional library of exclusives, it’s a push. However, through TikTok, MSFT would have untethered access to this demographic and be free to exploit every piece of data they would need to identify interests and trends amongst teens and young adults potentially faster than any other competitor. Every tap, every prolonged glance at a particular TikTok or ad, and every cringey trend, all generating information that MSFT can and will exploit to better understand and market to this demographic.\n\nNow, this next part should be pretty obvious, but I’ll still s-p-e-l-l it out for you. MSFT acquiring TikTok is going to be their big break into social media. Good. Great. But what are the implications of this? MSFT would now have a massive new source of ad revenue in addition to the ability to directly compete with FB, FB owned Instagram, and SNAP. Yeah, I know that each of the aforementioned services are used collectively by teens and young adults for different purposes, but don’t forget that MSFT was never even in this market to begin with, and would overnight own a service that currently has 800 million users.\n\nAlright, you’ve read more words in this post than you’re accustomed to, brain hurt, and now you’re wondering, “what, in my infinite autism, am I supposed to do with this information?” Well, you’re going to have to tone down the autism, just a tad. FDs and weeklies bought last Friday did the trick for most of you, and the consensus now seems to be that MSFT is going to hover around 215 until the deal is confirmed, but if TikTalks don’t go well and Donnie decides to further stir the pot, any soon to expire FDs are going to be deader than your sex life. So, you’re going to want to wait until the exact moment the news breaks that MSFT has actually acquired TikTok, and then absolutely jack yourself to the tits with both long calls and sh*res. And as for the calls, I’m talking months or years out. Why? Remember when I was talking about all of that juicy data MSFT would be able to harvest from those idiot teenagers? The new products MSFT develops based upon that data are what’s going to send the stock to the moon in the long-term, and product development takes time. Therefore, in addition to increased ad revenue, when MSFT does manage to successfully market new products to teens and young adults, I’m expecting to see consistent growth in quarterly revenue in the months and years following.\n\nTL;DR: MSFT will use TikTok to better understand and market to teens and young adults, as well as to directly compete with FB, FB owned Instagram, and SNAP. Buy long-dated calls and sh*res for tendies.",
        "subreddit": "wallstreetbets",
        "title": "Why the TikTok Deal is a Big Deal",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i37ooy/why_the_tiktok_deal_is_a_big_deal/",
        "created": 1596524403.0
    },
    {
        "author": "swaggymedia",
        "created_utc": 1596979290,
        "id": "i6j8e3",
        "num_comments": 81,
        "num_crossposts": 0,
        "selftext": "Good morning fellas. Swaggy is back with a Sunday morning read and summary of unusual options activity for the week. I've highlighted some plays that came across as unusual based on how far OTM the bet was, the premium paid, and the volume of contracts in the play. If you want to check out additional tickers for yourself, you can scan the [unusual option flow tracker](https://www.swaggystocks.com/dashboard/stocklabs/option-flow) that I use at your liking (it's free).\n\n**ADBE – Adobe**\n\nSaw a bullish position in ADBE being opened with a debit spread. My scanner missed the long leg being opened, but I managed to catch the play by digging deeper. I’ve added the OI from Yahoo Finance so you can see the contracts. Stock is currently sitting at $450 after Friday’s -3% move. The debit spread was in October’s $450 strike (long leg) and sold the $490 strike (short leg). Earnings aren’t until September 15.\n\nhttps://preview.redd.it/c5zwew1t8zf51.jpg?width=3264&amp;format=pjpg&amp;auto=webp&amp;s=aeb0137a19b57af372a8bc574686146ec796933b\n\n**CNK – Cinemark**\n\nA bit of an unusual ticker for unusual activity. Cinemark saw some pretty heavy call buying on Friday. The stock has been on a bit of a run recently. One player bought calls 80% OTM for the $20 strike (stock is currently $11). This play was only $55k, but highly suspect with how far out the money they went. The play has an expiration date for September 18. I’ve attached Yahoo Finance option chain for August 21 so you can see the heavy volume in the near OTM strikes. This stock typically does not have high volume with options.\n\nhttps://preview.redd.it/xfl6sgou8zf51.jpg?width=3264&amp;format=pjpg&amp;auto=webp&amp;s=3c240cd54686a66f589a3733cc3a44437c29467d\n\n**FB – Facebook**\n\nFacebook had a huge melt up Thursday and Friday. Volume on option activity was well above the average for the last 2 weeks. Saw a good amount of CALL buying with some CALL selling far OTM as well. Most of the call selling (potentially covered calls?) were done with expirations in the next 1-3 weeks. The call buying had expirations toward the end of the year and even into 2021. Long-term bullish.\n\nhttps://preview.redd.it/h59saplv8zf51.png?width=2856&amp;format=png&amp;auto=webp&amp;s=b36f92032e3c7444ec4f41e4a83bc22468518393\n\n**MSFT – MicroTok**\n\nMicrosoft saw a massive bullish debit spread opened in November 2020 calls. 75,000 CALL contracts bought with the $220 strike while selling 75,000 CALL contracts at the $240 strike. Looks like the player/fund is expecting upside, but wanted to limit their downside by opening a spread. They have a max risk of $49 million with a max reward of $150 million if MSFT closes above $240 by November.\n\nhttps://preview.redd.it/804hwqew8zf51.png?width=2858&amp;format=png&amp;auto=webp&amp;s=4f76633f4b0db8220a1d1053daa8f54f5b796121\n\n**SDC – Smile Direct Club**\n\nAnother unusual ticker, this stock saw some unusual call buying recently. Two trades in particular were for next week’s earnings report (August 12). Both trades are for $9 strike, which is currently in-the-money. When the trades were initiated the stock was trading at $8.82. Judging from the OI it looks like of the 16k contracts traded, only 10k are left on the Open Interest. He may have sold part of his position to collect profit, but left a lot on the table for next week.\n\nhttps://preview.redd.it/m4ish39x8zf51.png?width=2740&amp;format=png&amp;auto=webp&amp;s=08d9b879e6326f3a90959a6c2e9087da82ab9c1c\n\n**Snap – Snapchat**\n\nSnap saw extremely high volume of call options traded relative to it’s average. Bullish flow out-weighed bearish flow by 3.5 to 1. Could be potential TikTok play as they expect the ban to increase their own share. There’s was a lot of flow to go through on this ticker, so I’m only mentioning that flow in general was above the average here and also more on the bullish side.\n\nhttps://preview.redd.it/iy8yygxx8zf51.png?width=2858&amp;format=png&amp;auto=webp&amp;s=a02ccb95317ec638ac9566cbae050a86c6067d22\n\n**V – Visa**\n\nVisa saw some unusual option flow last week on Wednesday. That day alone the stock gapped up 2% and closed another 3% higher. Stock is currently trading at $196 and most of the call blocks had strikes of $202.5-$205. Visa generally does not have that much volume on option flow so it’s always interesting to keep an eye on. If you look at the price action of the stock is has been in range-bound trading in the $190-$200 channel for almost 3 months now. Hit’s $200 and drops back down to $190, then touches $190 and makes it’s way back up to $200. Maybe some flow rolling through will be enough to have it break out.\n\nhttps://preview.redd.it/l7wovjqy8zf51.png?width=2860&amp;format=png&amp;auto=webp&amp;s=92e352e915225089fb7e9f31524ed1fe04cbdefd",
        "subreddit": "options",
        "title": "Unusual Option Flow Summary Week of August 3rd – ADBE, CNK, FB, MSFT, SDC, SNAP, V",
        "url": "https://www.reddit.com/r/options/comments/i6j8e3/unusual_option_flow_summary_week_of_august_3rd/",
        "created": 1597008090.0
    },
    {
        "author": "pwned-",
        "created_utc": 1597615246,
        "id": "ib1evm",
        "num_comments": 81,
        "num_crossposts": 0,
        "selftext": "I know SPY is a candidate to own to sell covered calls, but it is too expensive for me at the moment. \n\nAlso TSLA, MSFT, AMZN.\n\nAMD is doable but I would like to know your affordable (\\~$40-$60) and profitable choices to sell covered calls.\n\nThanks.",
        "subreddit": "wallstreetbets",
        "title": "Affordable and profitable stocks to own to sell covered calls",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ib1evm/affordable_and_profitable_stocks_to_own_to_sell/",
        "created": 1597644046.0
    },
    {
        "author": "tradekaiser",
        "created_utc": 1597962929,
        "id": "idkj7b",
        "num_comments": 80,
        "num_crossposts": 0,
        "selftext": "Alright lads, unless your wife's boyfriend took away your Robinhood privileges for the day, you saw that TSLA breached the coveted price point of 2000 and ascended to the trading floors of Valhalla. To celebrate, I decided to do a little bit of basic math (the abstract science of number, quantity, and space) in order to put into perspective just how insane of a feat this really was.\n\nBy simply calculating the ratio of one share of TSLA at 2000 compared to its 373.07B market cap, we are left with the Retard Ratio, or RR.\n\n&gt; RR: 0.000000005360924\n\nNow, what can you do with this so called Retard Ratio? I'm glad you asked. By multiplying the Retard Ratio by the market cap of a company of your choosing, you're left with that company's share price if it was receiving the same balls-to-the-wall Robinhood retail investor pump as TSLA.\n\nBelow, I've listed the share price ($) of a few popular WSB stocks after applying the Retard Ratio and a little bit of rounding:\n\n&gt; SPY: 1601\n\n&gt; AAPL: 10829\n\n&gt; AMZN: 8846\n\n&gt; FB: 4108\n\n&gt; GOOGL: 5736\n\n&gt; MSFT: 8685\n\n&gt; NFLX: 1177\n\n&gt; SLV: 85\n\n&gt; SPCE: 21\n\n&gt; RKT: 13\n\nNow, what exactly can you do with this information? Fuck if I know, and I'm well aware that company valuation isn't actually supposed to work this way either, but it is still pretty insightful to see just how powerful raw, untamed autism can be.\n\nTL;DR: TSLA 3000c 1/15/21",
        "subreddit": "wallstreetbets",
        "title": "The “R” Ratio",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/idkj7b/the_r_ratio/",
        "created": 1597991729.0
    },
    {
        "author": "bullheadedyouth",
        "created_utc": 1596335380,
        "id": "i24nv8",
        "num_comments": 79,
        "num_crossposts": 0,
        "selftext": "PINS- Long Put; Aug 21 30 strike\n\n\\-Playing correction due to earnings gap up\n\nBA- Long Put; Aug 7 155 strike\n\n\\-Received military contract so may wait for more direction but they are likely gonna shit the bed\n\nINTC- Long call Oct 16 60 strike\n\n\\-Shits dirt cheap bro YOLO\n\nELY- Long Calls Sep 18 20 strike\n\n\\-Golf is the only sport safe, gang \n\nMSFT- Long Calls Aug 17 207.5 strike\n\n\\-Microtok gang",
        "subreddit": "wallstreetbets",
        "title": "Positions I'll Take Monday at Open",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i24nv8/positions_ill_take_monday_at_open/",
        "created": 1596364180.0
    },
    {
        "author": "farting_tomato",
        "created_utc": 1597612865,
        "id": "ib0pdh",
        "num_comments": 79,
        "num_crossposts": 0,
        "selftext": " [https://www.zerohedge.com/markets/what-hedge-funds-bought-and-sold-second-quarter](https://www.zerohedge.com/markets/what-hedge-funds-bought-and-sold-second-quarter)\n\nTL;DR\n\nADAGE CAPITAL PARTNERS\n\n* Top new buys: RPRX, ABBV, W, HZNP, FIVE, ST, CCK, TRV, USB, JCI\n* Top exits: BMY, GILD, ETN, PNC, MAS, EXC, AON, CCMP, NI, CX\n* Boosted stakes in: BURL, PYPL, FTV, ITT, LOW, GOOGL, TMUS, EYE, AZO, BMRN\n* Cut stakes in: LMT, JNJ, PFE, HON, VZ, VRTX, TGT, VMC, PXD, LLY\n\nAPPALOOSA\n\n* Top new buys: T, V, MA, PYPL, DIS, SYY, EMR, MO, SQ, TEN\n* Top exits: INTEQ, XLU, BKLN\n* Boosted stakes in: TMUS, BABA, MU, HCA, MSFT, BSX, TWTR, WFC, CRM, GT\n* Cut stakes in: PCG, UNH, TSLA, HUM, VST, AMLP, AVGO, NFLX, QCOM, ADBE\n\nBALYASNY ASSET MANAGEMENT\n\n* Top new buys: SCHW, ABT, TGT, HD, ADBE, SHOP, ITW, COST, C\n* Top exits: JCI, AMTD, INTC, CHTR, KR, TMUS, TTWO, NVDA, ICE, ROST\n* Boosted stakes in: PYPL, FISV, BABA, JPM, FLT, NSC, LITE, DKS, QCOM, LHX\n* Cut stakes in: BSX, LOW, DG, FIS, ABBV, BAX, INTU, JD, BK, ETFC\n\nBAUPOST GROUP\n\n* Top new buys: HCA, VRNT, VTR, SSNC\n* Top exits: LNG, ET, XPO, SPR, CARS\n* Boosted stakes in: LBTYK, TBIO, QRVO, ATRA, HDS\n* Cut stakes in: FB, GOOG, PCG, UNVR, ABC, HPQ, CLNY, VIST, AKBA\n\nBERKSHIRE HATHAWAY\n\n* Top new buys: GOLD\n* Top exits: DAL, LUV, UAL, AAL, QSR, GS, OXY\n* Boosted stakes in: STOR, KR, SU\n* Cut stakes in: WFC, JPM, SIRI, PNC, MTB, BK, MA, V, CHTR, USB\n\nBRIDGEWATER ASSOCIATES\n\n* Top new buys: UPS, ZLAB, CSX, ECL, TT, RNG, PAYC, ROP, GWW, FICO\n* Top exits: TLT, HYG, EMB, RY, TD, TIP, CNI, BNS, TRP, BCE\n* Boosted stakes in: SPY, GLD, IVV, FXI, BABA, MCHI, IAU, JD, PDD, VEA\n* Cut stakes in: EWZ, LQD, INDA, EWY, EEM, IEMG, VWO, EWW, BAM, EWT\n\nCOATUE MANAGEMENT\n\n* Top new buys: BA, DOCU, INO, DXCM, WYNN, HWM, LYV, ALGN, TDG, DHT\n* Top exits: RNG, SNAP, BYND, LKNCY, GLUU, ISRG, CGC, STNE, MCD, VGK\n* Boosted stakes in: DIS, PYPL, ZM, SQ, CRWD, PTON, LRCX, SHOP, MU, PODD\n* Cut stakes in: MSFT, LBRDK, BABA, TWTR, JD, NKE, GPN, CREE, GH, NFLX\n\nCORSAIR CAPITAL MANAGEMENT\n\n* Top new buys: IWO, IWM, WMB, NATR, MFIN\n* Top exits: LAUR, RHP, ECPG, ATKR, NMRK, TROX, KRA, FSK, HHC, SATS\n* Boosted stakes in: VRT, WSC, GDDY, CC, BH, BBCP, METC, BRK/B\n* Cut stakes in: HGV, HMHC, FMC, NWSA, REPH, GOOG, CHDN, C, CUBI, PLYA\n\nCORVEX MANAGEMENT\n\n* Top new buys: TMUS, EXC, EVRG, CMCSA, JPM, IAA, TIF, LYV, PCG\n* Top exits: ZEN, CRM, FANG, UNP, VMC, MPC, UNH, ANTM, SPY\n* Boosted stakes in: MGM, GLD, BABA, CNP, NFLX, HUM, CNC, MSGS\n* Cut stakes in: ADBE, ATUS, ATVI, AMZN\n\nD1 CAPITAL PARTNERS\n\n* Top new buys: JPM, AVB, EXPE, TGT, DEI, AAP, ESS, CVNA, SMAR, PNC\n* Top exits: LIN, GWRE, TME, NKE, UNH, BAC, PDD, DHI, INMD\n* Boosted stakes in: BABA, USB, JD, LVS, MSFT, HPP, KRC, CCC, LYV, HLT\n* Cut stakes in: NFLX, FB, AMZN, DIS, RACE, ORLY, PPD, AZO, SBUX, GOOGL\n\nDUQUESNE FAMILY OFFICE\n\n* Top new buys: TMUS, JPM, XBI, SBUX, BKNG, SMAR, CCL, WFC, LYV, CB\n* Top exits: ABT, QCOM, NOW, ADBE, INDA, COUP, TWOU, EDU, SNE, TWLO\n* Boosted stakes in: MSFT, JD, FCX, FSLY, BABA, CRWD, RETA, PLAN, FLEX\n* Cut stakes in: NFLX, FB, AMZN, WDAY, ATVI, GOOGL, GE, IQV, FIS, DISH\n\nELLIOTT MANAGEMENT\n\n* Top new buys: WELL, FSCT\n* Top exits: LQD, RRTS, ESI, HYG, XOP, NEWR, CSOD, NTNX, CNHI, EGHT\n* Boosted stakes in: DELL, TWTR, RYAAY\n\nENGAGED CAPITAL\n\n* Top new buys: JACK, MGLN, SMPL, IWM\n* Top exits: APOG\n* Boosted stakes in: STKL, NCR\n* Cut stakes in: HAIN\n\nFIR TREE\n\n* Top new buys: SQ, LYV, PS, SNAP, VG, EIX, SABR, EXPE, J, PCPL\n* Top exits: FLT, FPAC, BKNG, SHLL, CCH, GOOG, APXT, OAC, DMS, EXPC\n* Boosted stakes in: CNC, CTXS\n* Cut stakes in: DIS, MSFT, TMUS, LAUR, ANTM, DELL, EXC, CMCSA, SLM, TRNE\n\nGREENLIGHT CAPITAL\n\n* Top new buys: GDX, AAWW, TECK, REZI, JACK, GLD, APG, TPX, SATS, WHR\n* Top exits: ATUS, ADNT, CNC, MO, PAYX, AXP, GS, DHR, BRK/B, DIS\n* Boosted stakes in: AER, CHNG, NBSE, GPOR\n* Cut stakes in: CNX, XELA, CC\n\nICAHN\n\n* Top exits: HPQ, HTZ, FCX\n* Boosted stakes in: IEP, LNG, TEN\n* Cut stakes in: CLDR\n\nIMPALA ASSET MANAGEMENT\n\n* Top new buys: LAD, DRI, NSC, HES, CMI, VAC, TOL, ADNT, DOOO, MU\n* Top exits: MSFT, PCAR, CSX, KBH, VMC, MA, AMZN, FDX, EXP\n* Boosted stakes in: HOG, RIO, AAWW, FUN, WYNN, UFI\n* Cut stakes in: TGT, QCOM, KSU, SBLK, TTWO, SIX, KNX, TCKRF, NVR, TECK\n\nJANA PARTNERS\n\n* Top exits: NEWR, JACK\n* Boosted stakes in: PRSP, SPY\n* Cut stakes in: AXTA, HDS, HI, BLMN, ELY, CAG\n\nLAKEWOOD CAPITAL MANAGEMENT\n\n* Top new buys: HDS, CRL, LBTYK, LBTYA, UE, CDK, NKLA, ABG, CROX, SHAK\n* Top exits: WUBA, AMZN, ICE, FNF, TWO, YY, RNR, TPR, WW, REAL\n* Boosted stakes in: FAF, BABA, ANTM, AXS, BIDU, BHC, HCA, SKX, C, ACGL\n* Cut stakes in: GOOGL, CI, FB, MA, DELL, GS, AGNC, APO, CMCSA, BC\n\nLANSDOWNE\n\n* Top new buys: C, VMC, LUV, ED, FCX, RYAAY, AES, COG, TMUS, BKNG\n* Top exits: DHT, NKLA, AGI, TT, IQ, BABA\n* Boosted stakes in: MU\n* Cut stakes in: UAL, DAL, FSLR, GE, ETN, ADI, REGI, LRCX, TSM, SMMT\n\nLONG POND\n\n* Top new buys: PEAK, LVS, DEI, EQR, SHO, WELL, SEAS, UDR, INVH, MAR\n* Top exits: H, DHI, VNO, PEB, PGRE, MGM, VAC, RRR, JLL, CUZ\n* Boosted stakes in: CPT, AVB, MAA, AIV, HLT, ESS, FR, KRC, JBGS\n* Cut stakes in: WH, HGV, RHP, HPP, SBRA\n\nMAGNETAR FINANCIAL\n\n* Top new buys: ADCT, NVS, PKI\n* Top exits: HPQ, TSG, DLR, DKNG, ET, EPD, KMI, LHCG, CRL\n* Boosted stakes in: GRUB, WLTW, LH, BDX, LCA, CPAA, SYNH, ABBV, CRSA, DGX\n* Cut stakes in: PFE, ADSW, TIF, UBER, NVST, BAX, WMB, PPD, MEET, FREE\n\nMAVERICK CAPITAL\n\n* Top new buys: AXP, LIVN, VFC, MKC, GE, BGS, THS, GIS, CRI, FL\n* Top exits: QSR, COMM, ALKS, H, BX, GME, WING, ARMK, ORCL, LB\n* Boosted stakes in: FB, AMZN, DLTR, MSFT, LRCX, APD, ATRA, NFLX, NKTR, UBER\n* Cut stakes in: FLT, BABA, DD, CCK, STNE, PRSP, TMUS, CNC, ADBE, KKR\n\nMELVIN CAPITAL MANAGEMENT\n\n* Top new buys: DOCU, TWLO, SE, GOOGL, AEO, LOW, NUAN, HLT, TPX, PINS\n* Top exits: TTWO, CPRT, EDU, DG, ADYEN, EFX, ADI, LKNCY, IQV, QSR\n* Boosted stakes in: FISV, AZO, BKNG, JD, PYPL, LB, AAP, MA, FICO, DPZ\n* Cut stakes in: FIS, FB, CSGP, LH, NFLX, DRI, VRSN, AMZN, EL, PLAN\n\nOAKTREE CAPITAL MANAGEMENT\n\n* Top new buys: PCG, GTH, API, SRNE\n* Top exits: CEO, SRLP, WMB, BRFS, ASRT, ORCC, PVAC, MDRIQ\n* Boosted stakes in: TMHC, AU, TSM, CX, ITUB, MELI, BIDU, AFYA, IBN, AZUL\n* Cut stakes in: BABA, BCEI, CZR, CCS, SMCI\n\nOMEGA ADVISORS\n\n* Top new buys: DNRCQ\n* Top exits: GOOGL, SSSS, TWO, GPMT\n* Boosted stakes in: COOP, JPM, FOE, GTN, MGY, SNR, SRGA, AMCX\n* Cut stakes in: VICI, GCI, FCRD, NBR, ASPU, OCN, EFC, MVC, PE, ABR\n\nNEVER MISS THE NEWS THAT MATTERS MOST\n\nZEROHEDGE DIRECTLY TO YOUR INBOX\n\n*Receive a daily recap featuring a curated list of must-read stories.*\n\nPERSHING SQUARE\n\n* Top exits: BRK/B, BX, PK\n* Boosted stakes in: QSR, LOW\n* Cut stakes in: HHC\n\nSOROBAN CAPITAL\n\n* Top new buys: RTX, CMCSA, HLT, MAR, YUM\n* Top exits: LHX, QSR, NSC\n* Boosted stakes in: BABA, SNE\n* Cut stakes in: NOC, UNP, CSX, ATUS, AMZN, MSFT\n\nSOROS FUND MANAGEMENT\n\n* Top new buys: IGSB, SLQT, HAIN, PCG, DKNG, DRI, SPSB, BAC, MS, C\n* Top exits: XLU, WMGI, UNH, LNT, SHW, ALL, CBOE, LEN, DIS, CVE\n* Boosted stakes in: LQD, TMUS, NLOK, VICI, TDG, ARMK, BK, GS, ETFC, FOCS\n* Cut stakes in: PTON, TIF, TCO, ORCC, VST, KKR, CLVS, AVTR, ATVI, DHI\n\nSTARBOARD\n\n* Top new buys: IWM, IWR\n* Top exits: REZI\n* Boosted stakes in: MD, ACIW\n* Cut stakes in: EBAY, IWN, CERN, NLOK, CVLT, BOX, MMSI, GDOT\n\nTEMASEK HOLDINGS\n\n* Top new buys: BLK, PDD, SBUX\n* Top exits: BMRN, UNVR, RDS/B, PAGS, STNE, TOUR, FSLY, WORK\n* Boosted stakes in: BGNE, HDB, IBN, CBPO, VMW\n* Cut stakes in: BABA, FIS, VIRT, NIO, DDOG, VNET, INFO\n\nTIGER GLOBAL\n\n* Top new buys: ZI, API, DADA\n* Top exits: IQ, LVGO, BILL, STG, JCPNQ\n* Boosted stakes in: JD, AMZN, MSFT, CRWD, SPOT, PDD, DDOG, CRM, WDAY, ZM\n* Cut stakes in: ATH, SVMK, RDFN, MA, STNE, PYPL\n\nTUDOR INVESTMENT\n\n* Top new buys: ADSW, PCG, TMUS, TME, LHX, ATHM, BXMT, NFLX, ESS, EQR\n* Top exits: TIP, DEI, ABBV, FHN, KRC, GLPI, COP, PEG, LAD, MS\n* Boosted stakes in: AMTD, ETFC, GLIBA, SOXX, X, O, AAPL, UBER, CRWD, TCO\n* Cut stakes in: SPY, JAZZ, CERN, TEAM, HPQ, MCD, EA, LRCX, CUZ, PSB\n\nVIKING GLOBAL INVESTORS\n\n* Top new buys: TMO, HLT, APG, NUAN, MCO, PH, ADI, SHW, DRI, ZNTL\n* Top exits: ANTM, GOOGL, FB, NSC, ORLY, A, NOW, PGR, BMRN, AJG\n* Boosted stakes in: AXP, CMCSA, FIS, LVS, TMUS, PLAN, JPM, AON, CB, SE\n* Cut stakes in: NFLX, BSX, JD, LOW, UBER, CME, MELI, MU, CRM, CHNG\n\nWHALE ROCK CAPITAL MANAGEMENT\n\n* Top new buys: SQ, NXPI, MELI, CREE, VRM, ZI\n* Top exits: DIS, BABA, INTC, MU, MIME, ZS, ATVI, TSM, KLIC, PLAN\n* Boosted stakes in: FSLY, SHOP, DOCU, TSLA, COUP, AMZN, W, FB, OKTA, BILL\n* Cut stakes in: NOW, MSFT, NET, PTON, SMAR, FTNT, CRWD, AVLR, ZM, DDOG",
        "subreddit": "StockMarket",
        "title": "This Is What Hedge Funds Bought And Sold In The Second Quarter",
        "url": "https://www.reddit.com/r/StockMarket/comments/ib0pdh/this_is_what_hedge_funds_bought_and_sold_in_the/",
        "created": 1597641665.0
    },
    {
        "author": "Professional_Ad_6645",
        "created_utc": 1598804291,
        "id": "ijfbph",
        "num_comments": 78,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Tik Tok sale in jeopardy...$MSFT, $WMT dreams may shatter",
        "url": "https://www.cnbc.com/2020/08/29/china-tightens-tech-export-controls-jeopardizing-tiktok-deal-reports-say.html",
        "created": 1598833091.0
    },
    {
        "author": "_techboy",
        "created_utc": 1598387647,
        "id": "igkhed",
        "num_comments": 78,
        "num_crossposts": 0,
        "selftext": "Hey everyone,\n\nAs MSFT inches closer to 217 per share, investors prepare to jump in for the new record highs. MSFT has been predicted to take off on another bull run as it surpasses its previous high and reaches a new upward trend in its cycle.\n\nWill you be buying Microsoft before this run? Do you feel it is about to take off for a nice jump?",
        "subreddit": "stocks",
        "title": "MSFT Bull Run❤️",
        "url": "https://www.reddit.com/r/stocks/comments/igkhed/msft_bull_run/",
        "created": 1598416447.0
    },
    {
        "author": "wallstreetdoge",
        "created_utc": 1596437438,
        "id": "i2sb5e",
        "num_comments": 77,
        "num_crossposts": 0,
        "selftext": "Thought I'd create a pre-earnings discussion thread for DBX as we're heading closer to the day of earnings (Aug 6 after market close).\n\nPreviously, I had [created a thread](https://www.reddit.com/r/wallstreetbets/comments/hys49p/long_dbx_into_earnings/) discussing why I think Dropbox as a WFH play is going to outperform its peers during Q2 earnings. In short, it's probably the cheapest WFH stock play there is fundamentals wise compared to other WFH peers like ZM, SHOP, FSLY, DOCU, TEAM, etc. AND we're looking at an earnings guidance where management has priced in 0 revenue growth from COVID headwinds (hence why DBX has lagged behind other WFH peers in stock price performance).\n\nThere's also a couple of additional points I wanted to bring up to reinforce why I strongly think DBX will outperform in Q2:  \n\n\n* First point: I mentioned this in the previous thread but I wanted to reiterate this with numbers in perspective. Dropbox has TTM revenues of $1.7B, which at the current market cap of $9.4B, we're looking at a revenue multiple of **5.5x**. The **average tech software stock** (Not just WFH) boasts a **30x** revenue multiple. ZM has an **85x** revenue multiple, while SHOP has a **59x** revenue multiple.   \nCompared to the AVERAGE tech software stock, DBX is valued 6X cheaper on a revenue multiple basis, despite a consistent 15-20% revenue growth every quarter. Compared to WFH stocks, we're looking at valuations anywhere 8-15x cheaper. **Dropbox is a dirt-cheap WFH stock play**.\n* Dropbox IPO'd at $21 per share in early 2018. The day it opened for trading, opening price was roughly $28.50. Today, it sits at $22.75, just slightly higher than IPO price. We've passed over two years of revenue growth, with over two years of beating earnings every quarter, and is now both GAAP and non-GAAP profitable from 2020 onwards, and stock price has barely moved an inch. It's *almost like* giving you a chance to invest in a stock at IPO price, and then letting you skip two years into the future knowing that management has outperformed analyst expectations every quarter of the way.\n* CFO Ajay Vashee highlighted in the Q1 earnings transcript that a stronger dollar and lowering interest rates for Q2 were going to be tailwinds to revenue. The specific excerpt as follows: \"On the other hand the weakening of foreign currencies relative to the US dollar, as well as lower interest rates could negatively impact our revenue and free cash flow for the remainder of the year if they persist at current levels.\" Interestingly, because the dollar has now weakened by nearly 10 percentage points since Q1 earnings, we should expect the reverse - the weakening of the US dollar is going to result in a positive impact on revenue and free cash flow for the remainder of the year.\n* HelloSign (Dropbox subsidiary) and pretty much every other player (basically just DOCU) in the electronic signing industry is experiencing the highest level of interest and traffic since the start of COVID. See data below from Google Trends. And yes, while DOCU is still the current undisputed leader in the space, I think there's room in this market for more than one player. There's also a lot of synergistic values Dropbox can leverage to increase revenue per user across both the Hellosign and Dropbox platforms.\n\nhttps://preview.redd.it/8d76ht85hqe51.png?width=1866&amp;format=png&amp;auto=webp&amp;s=ddee09700417eafdcd1830e98e51103cac3d60e3\n\n* Dropbox was founded by Drew Houston, who is still running the company and is a 25% owner. He has huge skin in the game and frankly, I'm quite fond of founder-owned companies as these companies have often outperformed peers within their respective industries. Shopify, Tesla, Amazon, Facebook, Microsoft, Apple just to list a few were all/are still founder-owned when they became wildly successful at their points in time.",
        "subreddit": "wallstreetbets",
        "title": "Pre-Earnings Discussion: Dropbox (DBX)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i2sb5e/preearnings_discussion_dropbox_dbx/",
        "created": 1596466238.0
    },
    {
        "author": "lil_g55",
        "created_utc": 1596292670,
        "id": "i1t7by",
        "num_comments": 76,
        "num_crossposts": 0,
        "selftext": "Why u ask? Not only because tech is acting like it’s on that lance Armstrong good good, Microsoft is planning to buy Tiktok which will most likely get banned today. Tiktok is literally like the #1 entertainment app in the App Store. Microsoft will want to do this quick because if it’s banned for a while teens will lose interest and find something else. It’s already profitable and good ol’ Microsoft will just find a way to make more money out of it for sure. Autists buy puts rn",
        "subreddit": "wallstreetbets",
        "title": "Calls on $MSFT",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i1t7by/calls_on_msft/",
        "created": 1596321470.0
    },
    {
        "author": "BarmeIo-Xanthony",
        "created_utc": 1598550860,
        "id": "ihpuj5",
        "num_comments": 75,
        "num_crossposts": 0,
        "selftext": "Pretty sure everyone here saw WMT and MSFT moonshot today on TikTok buyout rumors. However, Oracle has already offered $20B in stock and cash and a 50/50 revenue split for 2 years. Oracle also has the backing of two major Bytedance investment groups.\n\nOracle’s chairman is tight with Donny T, and that could help them secure a bid. While Walmart and Microsoft mooned, Oracle will go ballistic if it wins. Obviously a gamble, but we’re mothafuckin wallstreet bets and this is an underdog. \n\n$ORCL $60c 9/4",
        "subreddit": "wallstreetbets",
        "title": "$ORCL Calls, The TikTok Dark Horse",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ihpuj5/orcl_calls_the_tiktok_dark_horse/",
        "created": 1598579660.0
    },
    {
        "author": "saibaba90",
        "created_utc": 1597518893,
        "id": "iadhkf",
        "num_comments": 73,
        "num_crossposts": 0,
        "selftext": "Is it possible this company is not around in 20 years or are they too interlinked in american culture to fail. There is a lack of dependence of corporate america with Apple, which is worrying.  Microsoft is obviously a safer bet with Office 365 and Azure, which businesses are highly dependent on. How risky is it to hold 425 shares of Apple (AAPL) as your only investment?",
        "subreddit": "stocks",
        "title": "How risky is it to hold 425 shares of Apple (AAPL) as your only investment?",
        "url": "https://www.reddit.com/r/stocks/comments/iadhkf/how_risky_is_it_to_hold_425_shares_of_apple_aapl/",
        "created": 1597547693.0
    },
    {
        "author": "Siddhartha1235",
        "created_utc": 1596398328,
        "id": "i2iko9",
        "num_comments": 73,
        "num_crossposts": 0,
        "selftext": "I bought this baby Friday sure as hell that MSFT would clinch the deal this weekend. Now it seems that the talks are on hold, but I wouldn’t be surprised if they still buy it. Problem is, my options expire at the end of this week!\n\nWhat are thoughts on MicroTok completing before the end of the week?",
        "subreddit": "wallstreetbets",
        "title": "Am I burnt for MSFT 210c 8/7?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i2iko9/am_i_burnt_for_msft_210c_87/",
        "created": 1596427128.0
    },
    {
        "author": "mansoortaken",
        "created_utc": 1597873697,
        "id": "icx8rr",
        "num_comments": 71,
        "num_crossposts": 0,
        "selftext": "Next to $2T? Amazon or Microsoft or Google\n\n* \\#2 AMZN (current: $1.6T)\n* \\#3 MSFT (current: $1.5T)\n* \\#4 GOOG (current: $1T)\n\nNext to $1T? Facebook or Alibaba\n\n* \\#5 FB (current: $748B)\n* \\#6 BABA (current: $700B)\n\n[*Source*](https://assetdash.com) \n\nMy picks:\n\n$MSFT is the next to $2T and $BABA beats FB on the road to $1T. \n\nWhat do you folks think?",
        "subreddit": "stocks",
        "title": "Next to $2T - Amazon or Microsoft or Google?",
        "url": "https://www.reddit.com/r/stocks/comments/icx8rr/next_to_2t_amazon_or_microsoft_or_google/",
        "created": 1597902497.0
    },
    {
        "author": "ambergogo1",
        "created_utc": 1596657805,
        "id": "i4copz",
        "num_comments": 70,
        "num_crossposts": 0,
        "selftext": "Been playing in the market for a year and have had some good returns in bio-tech. Looking for a long term investment for this week \nTorn between DIS, PRPL,MSFT, AAPL but open to the wisdom of you wizards! \n\nThis is for my kid's (4yr old) college fund since parents gave me nothing ...",
        "subreddit": "wallstreetbets",
        "title": "Have $5-8k to invest long term",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i4copz/have_58k_to_invest_long_term/",
        "created": 1596686605.0
    },
    {
        "author": "ElectricOne55",
        "created_utc": 1598075505,
        "id": "ied7rr",
        "num_comments": 70,
        "num_crossposts": 0,
        "selftext": "With the huge run up, it seems liek tech stocks are getting all the attention and all of the classic DOW stocks, along with financials, oil, industry, car manufacturers(except tesla), and materials have all lagged and not even came up to pre corona levels. But, all of the tech stocks have surpassed and exceeded the pre-corona level, which doesn't make sense considering the amount of debt and negative earnings some of these companies have. They also don't have near as much revenue as the stable companies that have slower moving stocks.\n\nBuffet and Gates both also hardly have any tech portions in their portfolios, many of the indexes don't have a lot of the speculative cloud stocks either, they'll have microsoft, apple, and amazon, but won't include companies like datadog, twilio, or alibaba for insance.\n\nEven though Buffet has trailed this past decade, I still feel like something could happen to this overvalued companies. What do you all think, do you think tech stocks should be avoided and what are the reasons to avoid them? The valuations are also so absurb it's hard do buy any more than a few shares.",
        "subreddit": "investing",
        "title": "Any reasons to avoid tech stocks?",
        "url": "https://www.reddit.com/r/investing/comments/ied7rr/any_reasons_to_avoid_tech_stocks/",
        "created": 1598104305.0
    },
    {
        "author": "Lucfoul",
        "created_utc": 1596944704,
        "id": "i6ct29",
        "num_comments": 69,
        "num_crossposts": 0,
        "selftext": "Listen up retards, as you may already know tittok plans to give creators over $2 billion for their content, but the content on WSB is much better than the tits and nips. Therefore, fuck Trump and MSFT, retards should just buy the app, collect our $2 billion tendies, and change its name to Beepboop.",
        "subreddit": "wallstreetbets",
        "title": "DD: WSBs should buy TikTok",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i6ct29/dd_wsbs_should_buy_tiktok/",
        "created": 1596973504.0
    },
    {
        "author": "BullsOfWallstreet123",
        "created_utc": 1597155081,
        "id": "i7sioa",
        "num_comments": 69,
        "num_crossposts": 0,
        "selftext": " [https://www.bio-key.com/wp-content/uploads/2020/08/BKYI-Q220-Conf-Call-8-7-20.pdf](https://www.bio-key.com/wp-content/uploads/2020/08/BKYI-Q220-Conf-Call-8-7-20.pdf) \n\nthis is HUGE. so many contracts/partnerships this year.\n\n[https://www.bio-key.com/solution/microsoft-partnership/](https://www.bio-key.com/solution/microsoft-partnership/)\n\n[https://www.bio-key.com/wp-content/uploads/2020/07/PR-Fore-Aero-7-27-20.pdf](https://www.bio-key.com/wp-content/uploads/2020/07/PR-Fore-Aero-7-27-20.pdf)\n\n[https://www.bio-key.com/wp-content/uploads/2020/08/PR-Clearent-8-5-20.pdf](https://www.bio-key.com/wp-content/uploads/2020/08/PR-Clearent-8-5-20.pdf)\n\n[https://www.bio-key.com/wp-content/uploads/2020/03/BKYI-NELEX-3-27-20.pdf](https://www.bio-key.com/wp-content/uploads/2020/03/BKYI-NELEX-3-27-20.pdf)\n\njust to list a few..\n\ncheck out the rest at  [https://www.bio-key.com/press-releases/](https://www.bio-key.com/press-releases/) .. pretty impressive IMO.\n\nEARNINGS PREMARKET FRIDAY - INVESTOR CALL FRIDAY 10AM EASTERN. $1.75-$2.5 IMO.",
        "subreddit": "pennystocks",
        "title": "$BKYI EARNINGS/INVESTOR CALL FRIDAY!",
        "url": "https://www.reddit.com/r/pennystocks/comments/i7sioa/bkyi_earningsinvestor_call_friday/",
        "created": 1597183881.0
    },
    {
        "author": "kickace",
        "created_utc": 1598454308,
        "id": "ih0h88",
        "num_comments": 69,
        "num_crossposts": 0,
        "selftext": "I've been trying to get the word out that Slack is about to break out ( [https://www.reddit.com/r/wallstreetbets/comments/ifbqta/slack\\_work\\_unfairly\\_punished\\_by\\_teams/](https://www.reddit.com/r/wallstreetbets/comments/ifbqta/slack_work_unfairly_punished_by_teams/) ), but I've been getting hammered by $MSFT shills.\n\n[Fat Gains](https://preview.redd.it/ovycoprlwcj51.jpg?width=335&amp;format=pjpg&amp;auto=webp&amp;s=d4eef288d21e808d6cd3329bf61bda687e1d7915)\n\nThe wedge has been broken, and we're headed to ATHs. If you want in on this, you need to move now. Earnings is Sept 8th, and I believe we'll see Slack post a profit for the first time in their history.\n\n[Falling Wedge](https://preview.redd.it/jjytr9lrxcj51.jpg?width=1146&amp;format=pjpg&amp;auto=webp&amp;s=8fcf27a3dc7b58bdf1b790f32687ee02e3c16a55)\n\n$WORK is the next $CRM 🚀🌑",
        "subreddit": "wallstreetbets",
        "title": "Slack ($WORK) Mooning through the Wedge 🚀🌑",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ih0h88/slack_work_mooning_through_the_wedge/",
        "created": 1598483108.0
    },
    {
        "author": "holding-light",
        "created_utc": 1596930888,
        "id": "i69jtz",
        "num_comments": 68,
        "num_crossposts": 0,
        "selftext": "So it looks like Twitter is also in talks with TikTok. I know next week will be a green week and this may go under the radar, but if twitter ends up picking up tiktok instead of Microsoft there should be a nice price movement in the stock [WSJ article on Twitter tiktok ](https://www.google.com/amp/s/www.wsj.com/amp/articles/twitter-tiktok-have-held-preliminary-talks-about-possible-combination-11596925449)",
        "subreddit": "wallstreetbets",
        "title": "TikTok; Microsoft or Twitter?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i69jtz/tiktok_microsoft_or_twitter/",
        "created": 1596959688.0
    },
    {
        "author": "saibaba90",
        "created_utc": 1597435334,
        "id": "i9t52e",
        "num_comments": 68,
        "num_crossposts": 0,
        "selftext": "Facebook, Amazon, Apple, Netflix, Google and Microsoft are dominating the tech industry and are getting to the point where they are too big to fail, with virtual monopolies in their respective specialities. Which will be the first of FAANG plus Microsoft to be broken up?",
        "subreddit": "stocks",
        "title": "Which will be the first of FAANG plus Microsoft to be broken up?",
        "url": "https://www.reddit.com/r/stocks/comments/i9t52e/which_will_be_the_first_of_faang_plus_microsoft/",
        "created": 1597464134.0
    },
    {
        "author": "SlothyFace",
        "created_utc": 1596946379,
        "id": "i6d68c",
        "num_comments": 68,
        "num_crossposts": 0,
        "selftext": "Twitter is in talks to buy tiktok and snipe the deal from Microsoft according to the WSJ. What's the play here? Buy Monday on the open and ride the Twitter rocket to the moon?\n\nwww.wsj.com/amp/articles/twitter-tiktok-have-held-preliminary-talks-about-possible-combination-11596925449",
        "subreddit": "wallstreetbets",
        "title": "TWTR in talks to buy tiktok 🚀 🚀 🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i6d68c/twtr_in_talks_to_buy_tiktok/",
        "created": 1596975179.0
    },
    {
        "author": "nitsujoh",
        "created_utc": 1598826535,
        "id": "ijm2x0",
        "num_comments": 67,
        "num_crossposts": 0,
        "selftext": "Currently I have these ETF’s: \n\nARKW \nFDIS \nSPHQ \nXNTK \n\nIn addition to some index funds I have index funds with TD. I found that a lot of my ETF’s overlap. Incase of the bubble bursting are there any other ETF’s that I should look at that aren’t heavy in tech. I’ve heard a lot about ICLN for clean energy but still skeptical about this being the main source of energy in the next 5-10 years.",
        "subreddit": "stocks",
        "title": "70% of ETFS and stocks invested in AAPL, MSFT, AMZN, TSLA. Any ETF’s to consider incase the bubble burst for the tech sector?",
        "url": "https://www.reddit.com/r/stocks/comments/ijm2x0/70_of_etfs_and_stocks_invested_in_aapl_msft_amzn/",
        "created": 1598855335.0
    },
    {
        "author": "Nawtreallyme",
        "created_utc": 1598634780,
        "id": "iib42n",
        "num_comments": 66,
        "num_crossposts": 0,
        "selftext": "Disclaimer, this is not financial advice\n\nJpow's announcement yesterday on thursday at 9:20am was called historic for a number of reasons. He announced the FED will continue most of its financial policies it created in july but as the minutes from the previous meeting showed, they were anticipating the stimulus to also be a driving factor for the economy. \n\nThe meat of what JPOW said was the interest rates need to increase their targets, as they anticipate the economy's lack of spending having additional deflationary practices. \n\nIn the short term this is very bullish on stocks, you may even see the top blown off of previously \"boring\" companies like PG, HD ect\n\nThe most impact you will see is the bond market\n \nhttps://i.imgur.com/rIm2rIf.png\n\nThis is dangerous because the bond market going down could trigger an asset liquidation if it drops too low too quickly. It in fact going down as we drag up to the next FOMC meeting in Sept will cause definitive action from the FED. \n\nThe plays i am eyeing are \n\nTLT puts or metal calls are good plays, tech calls (msft, amzn, fsly, anything but aapl) ALL WITH EXP 9/18 (nothing past this) \n\n\nImportant things to consider for the month to come,\n\n * FOMC FED Meeting September15-16*\n * VIX Expiration 16 September 2020\n * Congress Back in Session Sept 7th\n\nPositions right now\n\nTLT 159p 9/18\n\nSPXS 5c 9/18\n\nSQQQ 22c 9/18\n\nhttps://i.imgur.com/dPZ4ark.png",
        "subreddit": "wallstreetbets",
        "title": "JPOW's historic speech's impact on the market and what you ignored",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iib42n/jpows_historic_speechs_impact_on_the_market_and/",
        "created": 1598663580.0
    },
    {
        "author": "vegadust",
        "created_utc": 1597104101,
        "id": "i7gwm4",
        "num_comments": 66,
        "num_crossposts": 0,
        "selftext": "I’m currently in line at a Wendy’s drive through (not even kidding, getting two spicy chicken sandwiches) and my mom called. She said that she read about Microsoft in the news paper and how they said it’s a good time to buy.\n\nGate’s rug pull will be epic.",
        "subreddit": "wallstreetbets",
        "title": "My mom just called me and told me to buy Microsoft aka puts in MSFT",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i7gwm4/my_mom_just_called_me_and_told_me_to_buy/",
        "created": 1597132901.0
    },
    {
        "author": "seventhcircleoflimbo",
        "created_utc": 1598911109,
        "id": "ik7kzq",
        "num_comments": 65,
        "num_crossposts": 0,
        "selftext": "Have a sizeable amount of money left to invest. Already in on index funds for the long-term, but I'm looking to increase my SHORT-term growth potential by investing in one of these companies, for something like 6 months minimum. On one hand, AAPL's seeing some insane growth and doesn't seem to be propped up on nothing but thin air like TSLA. On the other, MSFT hasn't grown as much as AAPL since the pandemic began, but the TikTok acquisition could cause it to vault. Which one would yall recommend? And am I wrong for assuming that the TSLA potential for short term growth is going to come to a halt soon? Or is there still a couple months left in this insane bubble? Thanks all.",
        "subreddit": "stocks",
        "title": "MSFT or AAPL?",
        "url": "https://www.reddit.com/r/stocks/comments/ik7kzq/msft_or_aapl/",
        "created": 1598939909.0
    },
    {
        "author": "artisticdragon96",
        "created_utc": 1598655059,
        "id": "iihe6w",
        "num_comments": 65,
        "num_crossposts": 0,
        "selftext": "For some unforeseeable reason, i finally received 10k of unemployment, after 5 months of waiting. Looking to throw it into some options. \n\nWould like to throw 1k-2k of long term calls on MSFT.\n\nGive me your positions fellow degenerates. \n\nIf i lose it all, fuck it. Fuck it! We’ll do it live!",
        "subreddit": "wallstreetbets",
        "title": "Give me your MSFT Positions :)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iihe6w/give_me_your_msft_positions/",
        "created": 1598683859.0
    },
    {
        "author": "tmorse12",
        "created_utc": 1597351998,
        "id": "i982hz",
        "num_comments": 65,
        "num_crossposts": 0,
        "selftext": "I am going to invest 5k in one company and I would like suggestions out of these 4 companies. Tesla, Apple, Microsoft and Amazon. So far I’m leaning towards Apple and to be clear I already own shares of all of these companies so diversification is not what I’m looking to do here!",
        "subreddit": "stocks",
        "title": "If you had 5k to invest in ONE company, which company would you invest in ..?",
        "url": "https://www.reddit.com/r/stocks/comments/i982hz/if_you_had_5k_to_invest_in_one_company_which/",
        "created": 1597380798.0
    },
    {
        "author": "wileywyatt",
        "created_utc": 1598728318,
        "id": "iiy9su",
        "num_comments": 60,
        "num_crossposts": 0,
        "selftext": "Hi Friends,\n\nMy Stock Portfolio has been consistently outperforming the S&amp;P 500 index by 3x, for the past 5 years.\n\n75% of my portfolio is made up of these 15 stocks:\n\n**AMZN, GOOGL, SQ, FB, WM, HD, BABA, FISV, MSFT, V, PYPL, CHGG, BIDU, TCEHY, IQ**\n\n(Listed In Order Of Descending Equity)\n\nPlease see my comment for the Pie-Chart picture link (with %s in groups), and let me know what you think!\n\nI hope this helps you strengthen your own portfolio, and I wish you all the best!",
        "subreddit": "investing",
        "title": "My Portfolio: Outperforming S&amp;P 500 By 3x, For 5 Years (See Picture).",
        "url": "https://www.reddit.com/r/investing/comments/iiy9su/my_portfolio_outperforming_sp_500_by_3x_for_5/",
        "created": 1598757118.0
    },
    {
        "author": "BurnabyBoss",
        "created_utc": 1598318019,
        "id": "ig2a24",
        "num_comments": 58,
        "num_crossposts": 0,
        "selftext": "Alright I see lot of stoop kids on HN talking shit about Unreal and how Unity IPO'ing is a sign of its superiority, I feel that I should be of a service and tell you as an insider why you should not be bull Unity. Rather, you need to get ready for the Big Unity Short.\n\nHere is why Unity is a failure in the making:\n\n&gt; \"We have experienced rapid growth. Our revenue grew from $380.8 million to $541.8 million for the years ended December 31, 2018 and 2019, respectively, representing year-over-year growth of 42%, and from $252.8 million to $351.3 million for the six months ended June 30, 2019 and 2020, respectively, representing period-over-period growth of 39%. **We generated net losses for the years ended December 31, 2018 and 2019**, and six months ended June 30, 2019 and 2020, of $131.6 million, $163.2 million, $67.1 million and $54.1 million, respectively, which included $20.9 million, $44.5 million, $14.8 million and $21.7 million, respectively, of stock-based compensation expense.We reduced our net cash used in operating activities from $81.1 million to $67.9 million for the years ended December 31, 2018 and 2019, respectively, and from $19.8 million to $15.4 million for the six months ended June 30, 2019 and 2020, respectively.\"\n\nYou are looking at a marketcap of roughly $10 billion dollars with most optimistic measures but more likely to be closer to $5 billion. This is nothing compared to Epic's Unreal engine which is worth $20 billion dollars with the latest infusion of cash from Sony. Reminding you that Epic is still a private company, if it sold its shares on public market it would easily triple.\n\nWhy?\n\nUnreal Engine dominates not only the game engine marketshare but also eating into Hollywood. The star wars film you watch on Netflix? Shit is shot in Unreal. They have these massive Samsung LED panels and shoot shit real time with smooth CGI quality graphics. Meanwhile Unity has no chance in this massive space because well, the tool is shit and Unreal already won most of the studios over. \n\nBut lets leave that *massive film industry* marketshare out for a brief moment and focus on games. Unity fucking sucks ass:\n\n- Games suffer from huge storage space and performance suffers because its not C++.\n- Even basic stuff like FPS camera or inputs require you buy from their store.\n- You wanna make a game? Better buy shit on Unity store. Multiplayer? Buy shit. FPS Camera? Fuck you pay someone.\n- Most stuff sold are money grubbing developers who take desperate indie devs money and runs off to Thailand to live like kings.\n- Games made by Unity run like crap and it is impossible to debug and fix.\n- Works on features long enough to trick stupid indie devs into investing their time only to deprecate. ex) Multiplayer netcode is abandoned. Input system is abandoned. Render pipeline is abandoned. \n- Unity spends more time and effort on marketing and tricking their devs into fanboying and attacking critics on Twitter\n\nCompared to a chad like Unreal:\n\n- Fortnite. You realize how massive legalized gambling for zoomers is? This alone can be spunoff into an IPO.\n- Everything trickles down from this one successful game which benefits developers.\n- Netcode tested on Fortnite and maintained by Epic is FREE.\n- World class renderer (Good enough for Hollywood)\n- Everything is polished, optimized because it uses C++,  the alpha male of programming languages.\n- Constant updates and they finish all the features they start. \n- Unreal *OWNS* the game engine market. It is the most widely used game engine (dont listen to Unity losers)\n- Unreal *OWNS* the virtual film set market. It is the fastest growing replacement for film production.\n- Epic is fighting against Apple and Android to reduce their 30% racketeering practice straight out of cosa nostra.\n- Now Microsoft is backing Epic in its anti-trust lawsuit (which 99% of lawyers are saying Epic will win)\n- No programming needed and C++ is not fucking hard like Unity turds will tell you with their bullshit C# (not a real language)\n\n\nConclusion: Do not buy into Unity's bullshit marketing or listen to SJW type indie devs with nose rings and blue hair. They are not telling their full story because the games they make are for NEETs and WEEBs as you know make up a miniskirt market. Do the right thing and pass up on this whore of an IPO.\n\nNow is not the fucking time to be bull on Unity. The true alpha male is Unreal. Never forget.",
        "subreddit": "wallstreetbets",
        "title": "Unity Software S-1",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ig2a24/unity_software_s1/",
        "created": 1598346819.0
    },
    {
        "author": "AmbiguosDecisions",
        "created_utc": 1597332505,
        "id": "i91xvk",
        "num_comments": 58,
        "num_crossposts": 0,
        "selftext": "Well boys, we made it to the top, the rona of ATH. \n\nThe only thing that makes sense is nothing makes sense.\n\nCall OI on tech stocks are WAYYY OVERBOUGHT. \n\nAs a contrarian investor, and thinking like the ass hole MMs who fill all of your call orders, be very weary. The MMs with a flick of the wrist, make your calls go poof!\n\nWay to man gap ups on Tech stonks without connecting, tells me one thing! Time to ride the gravy train down.\n\nAAPL will go lower than $452\n\nMSFT touched its previous gap down at the 204 level but also has to touch another gap up at 190.\n\nFB needs to touch $234\n\nOutside of the FAGMAN\n\nAMD good lord this is screaming buy puts, put it in my put. $69.8 will gap down.\n\n🌈🐻 unite before the rug pull!\n\nPuts are purchased at 2-3 weeks out, Not this Friday or next Friday, Bare min the Friday after is when the put plays should be purchased.\n\nGOD SPEED MY BEAUTIES",
        "subreddit": "wallstreetbets",
        "title": "Rug pull inbound",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i91xvk/rug_pull_inbound/",
        "created": 1597361305.0
    },
    {
        "author": "Shxuny",
        "created_utc": 1596467449,
        "id": "i2yq97",
        "num_comments": 57,
        "num_crossposts": 0,
        "selftext": "Unless you’ve been living under a rock I’m sure everyone has been aware of Microsoft being interested in acquiring TikTok. After going up around 4% this morning, I was just curious as to what people’s predictions were for MSFT going forward.",
        "subreddit": "stocks",
        "title": "Thoughts on Microsoft after this mornings pop?",
        "url": "https://www.reddit.com/r/stocks/comments/i2yq97/thoughts_on_microsoft_after_this_mornings_pop/",
        "created": 1596496249.0
    },
    {
        "author": "CopperDome-Bodhi",
        "created_utc": 1597166300,
        "id": "i7vt5d",
        "num_comments": 57,
        "num_crossposts": 0,
        "selftext": "TL;DR - I'm an asshole who shouldn't have been trading options to begin with &amp; now I've lost my only $6k savings after insane &amp; impulsive trading I did about an hour after I was Dx'd w/nut cancer last month.\nTwo days before my 31st birthday, July 15th, I had an 8am Dr.'s appt where, to my shock, I was diagnosed w/testicular cancer- which has manifested itself as a large, painful tumor on the famile jewels. (I'd thought was a benign cyst.) I returned home shortly later, devastated beyond expression. Now, early had July yielded me *10 winning trades in a row* which was a big factor in this. I failed to appreciate that my success was more **luck** than **skill** and consequently, my head swole up and I got a little too big for my britches, with my confidence exceeding my actual abilities by a long shot. \nWhen I got home from the doctors office I was acting completely erratic &amp; unstable. I went on WSB and saw Tesla gain porn over and over and over. Days before I'd ordered TSLA calls, but I got cold feet and cancelled it **right before it would've gotten filled**. Well, I did the math saw I would've made almost 100k had I *not* cancelled it and instead let it filled and trusted myself. At this point I got in my head pretty badly, thinking I **knew** *what* to do but I had to overcome my fear and apprehension to do it. FOMO + my state of mind/panic over potentially dying prior to acquiring generational wealth I can leave to my children.\nRight then I decided to spend **ALL** of my available cash. About $6,000. I spent it all on ATM &amp; ITM calls from MSFT, NIO, UHS, and RIGL, all had &gt;=6 wks til expiry and looked good to my TA. 2 HRS LATER: the market ***crashed***. Now I am down over $5,000.\nI am also unemployed &amp; now have 0 income. My home business failed calamitously, and has straddled me with more debt which has now been growing for 1 year. I also just recently lost my car, after falling behind on my car note. I moved into a rural jobless no-mans-land before starting my home business which means now I am totally isolated, stranded, &amp; without any opportunity at all. My business failed, and some psychiatrist says I have \"major depressive disorder.\" I no longer leave my home office, nor do I ever even have a desire to anymore, or do anything at all. Some days I will sit in here all day long, in silence, just holding my head in my hands and hating myself.\nHonestly, I think that right now the best thing I can give my family will be my life insurance payout. Rn there are just too many black pills for me to swallow. Any hope for my future is disintegrating rapidly in front of me. Showing up for such a pitiful &amp; pathetic existence like this existential hell I've created for myself is really taking its toll on me. I am very likely to be divorced imo, once I explain where all my $ went to my wife (and I can only imagine the hell I'll catch from my wifes boyfriend Tyrone). \nI'm just having a hard time with this today.. I apologize for my lack of brevity and this entire miserable, verbose, &amp; self-centered post to begin with. I at least hope I've absorbed so much negative energy, chaos, &amp; bad luck that now there is only good luck and positivity left for you &amp; yours who are reading this, and from this day forward you are blessed with happiness, prosperity, and good health. \nSorry mods if this post broke any rules pls go ahead and delete it, I needed to blow off some steam by venting, thanks.",
        "subreddit": "wallstreetbets",
        "title": "Spreading cancer from my balls, to my portfolio, straight into this cringe-post",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i7vt5d/spreading_cancer_from_my_balls_to_my_portfolio/",
        "created": 1597195100.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1598884255,
        "id": "ijz10c",
        "num_comments": 57,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2020/08/31/tiktok-deal-to-sell-us-business-could-be-announced-as-soon-as-tomorrow.html\n\nTikTok has chosen a bidder for its U.S., New Zealand and Australian businesses and could announce the deal as soon as Tuesday.\n\nMicrosoft, in partnership with Walmart, and Oracle are the top contenders.\n\nThe sale price is expected to be in the range of $20 billion to $30 billion.",
        "subreddit": "stocks",
        "title": "TikTok deal to sell U.S. business could be announced as soon as Tuesday",
        "url": "https://www.reddit.com/r/stocks/comments/ijz10c/tiktok_deal_to_sell_us_business_could_be/",
        "created": 1598913055.0
    },
    {
        "author": "WannabeStonks69",
        "created_utc": 1598571163,
        "id": "ihw51a",
        "num_comments": 55,
        "num_crossposts": 0,
        "selftext": "**The Case for Nutanix**\n\n**Tl;dr NTNX will recover from financial instability soon so get 2022/2021 LEAPs** \n\nNutanix is a company that provides enterprise solutions via SaaS and PaaS to integrate data, computing, networking, and security using hyper converged infrastructure. Nutanix’s Acropolis HCI runs all enterprise applications such from Oracle, SAP, Microsoft, Citrix, Splunk, and SQL, just to give you an idea of what type of league it’s running with. Nutanix makes running IT solutions integrated, efficient and secure.\n\nNutanix’s solutions are unique for the industry and are great at locking in customers, a trait that Warren Buffett looks out for on all of his investments. Nutanix has dug up a niche in terms of being one of the only companies to integrate enterprise software seamlessly for so many businesses, and its new subscription-based business plan is bound to lock in more customers. Nutanix also runs ML-based automation of workload management, ticketing integration, and output date forecasting. A senior director at Home Depot (HD) had to say this about NTNX: “Prism Pro makes it extremely easy to watch all of the clusters in our environment and quickly reconfigure things as needed. It provides very clear metrics on oversubscription and utilization, giving us a powerful, proactive capacity management function that we never had before...Since Prism Pro is so easy to use, we told the database engineers they could quickly learn to manage their own environments and monitor capacity utilization”. Prism Pro has just been one software product of many to remove complication and coding out of everyday business use cases. Nutanix also offers services similar to VMWare in its VM management solutions, but the highlight of Nutanix is the integration of public and private cloud into one software. Their innovation on multiple fronts and in multiple industries is just one reason why the vision for them is limitless, but now it’s time to get into the numbers. \n\nNutanix also has Xi IoT solutions, another developing branch of their services which is involved in manufacturing, oil and gas, and smart city infrastructure (Xi IoT helps improve traffic flows, guides emergency vehicles, and more!). \n\n&amp;#x200B;\n\nFinancials are the biggest insight into a company’s stability and growth prospectuses, and although I love the business structure and the innovative drive, the financials look somewhat concerning, but the surprise ER today clears up plenty of doubts I had held previously.\n\nFinancially, 2018 appeared to be by far the best year for Nutanix, as these next metrics will show: \n\n&amp;#x200B;\n\nhttps://preview.redd.it/1lf664ifqmj51.png?width=562&amp;format=png&amp;auto=webp&amp;s=296cbfa5b6489205893ade30b32cd73bde18fbe8\n\nAs you can see, in 2018 the interest expense to gross profit ratio was the lowest\n\n&amp;#x200B;\n\nR&amp;D to Gross profit was the lowest\n\nhttps://preview.redd.it/7i43rckiqmj51.png?width=624&amp;format=png&amp;auto=webp&amp;s=755a74355b1b43dbbf69040505f8492f5289094a\n\nSG&amp;A Expenses were far lower as well\n\nhttps://preview.redd.it/crzzuekoqmj51.png?width=614&amp;format=png&amp;auto=webp&amp;s=fc3a3c34833ee7f3e0b1185cd0c28a619656fe3f\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/04uyzkntqmj51.png?width=554&amp;format=png&amp;auto=webp&amp;s=56bcf12f2d6240db0524000e3391ab873cbbfd24\n\nAs you can see, NTNX had heavily levered itself in 2018, so a lot of the decline in price after 2018 was due to the over leveraging (I’ll explain why this was bad later) and led to negative free cash flow : \n\n&amp;#x200B;\n\nhttps://preview.redd.it/w6t2k2kvqmj51.png?width=365&amp;format=png&amp;auto=webp&amp;s=95c145fca89dbfa2b0af3e0a5aaeaed148fd34a5\n\nAnd the simple reason why this happened to their financials is because of a change in business model to a subscription-based platform ([https://www](https://www/). fool.com/investing/2019/06/03/nutanix-stumbles-on-sales-execution-and-subscripti.aspx). Basically a transformation in financing structure led to massive increases in SGA and R&amp;D expenses, which will, in my opinion be great for the long run as software sales had increased in 2019 while hardware sales went down, which shows the company’s transition to digitizing. So Nutanix felt that there were lots of sharks in the water, and were quick to transition to a more sustainable model for the long term as profit margins continued to increase and so did liquidity. CEO Dheeraj Pandey had this to say about the transition during the financial reporting year of 2019, and all this obviously factored into the stock price as forecasted cash flows were heavily damaged \n\n*“During Q3, we executed well on the strong plan to ramp lead generation and thus improved sales execution. As we noted in both our Q2 earnings call and at our Investor Day in March, we continue to believe our actions to address this will drive improved business into FY '20 as these changes take a couple of quarters to show results. We will be watchful and conservative in the near term as we give New Americas sales leadership time to effect change as we understand the top line impact of even higher subscriptions.”*\n\nHere were some immediately positive effects of this change: \n\nhttps://preview.redd.it/y85xkq2yqmj51.png?width=536&amp;format=png&amp;auto=webp&amp;s=187a33377137a649282191e65756e68980b6c31a\n\nCash conversion was pushed back into negative (good liquidity)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/bs5lq1uzqmj51.png?width=482&amp;format=png&amp;auto=webp&amp;s=97ef577b4562a47079f20aaaa8ec8ad126404a2a\n\nLower Debt/Ebitda\n\n&amp;#x200B;\n\nhttps://preview.redd.it/5sxgaid1rmj51.png?width=621&amp;format=png&amp;auto=webp&amp;s=d20911a3355b8a5425526555c69e93558c91d487\n\nLower Capex/Ebitda\n\n&amp;#x200B;\n\nhttps://preview.redd.it/3itievv2rmj51.png?width=558&amp;format=png&amp;auto=webp&amp;s=22188c80a30c0e24c89dc2c9a82f6fee188b3cf1\n\nHigher net profit margins\n\nAnd if you compare the current ratio to its much larger competitor, VMWare, you’ll see that although NTNX has more solutions, it has maintained a higher asset/debt ratio (2.13 vs 0.98). And so although current growth and value may be concerning, know it’s because of a change in business structure that’s causing this and not incompetence. \n\nAs today’s surprise ER came out, NTNX shares jumped 17% after hours, meeting my expectations that this company was digging its way out. I had good expectations, but Nutanix handily surpassed them: “**Reached 88 Percent of Billings from Subscription:** Nutanix continued its transition to a subscription-based business model, with subscription billings up 29% year-over-year to $341 million, representing 88% of total billings, and subscription revenue up 46% year-over-year to $285 million, representing 87% of total revenue.” [Nutanix Reports Fourth Quarter and Fiscal 2020 Financial Results](https://finance.yahoo.com/news/nutanix-reports-fourth-quarter-fiscal-200600203.html)\n\nNow that the financial report has come out and we know this new structure will be taking it in the right direction, \n\n“In conjunction with its move to a subscription-based business model, the Company is shifting its guidance to Annual Contract Value (ACV) billings instead of Total Contract Value (TCV) billings and revenue. Management will resume providing quarterly guidance with Q1 Fiscal 2021 during its earnings conference call today in order to provide context to this shift.”\n\n*This just means that Nutanix’s financials will be far more consistent and bolstered now. Nutanix was also able to add far more customers to its HCI product this quarter and was recognized as a Forrester Analyst leader in this sector: “****Recognized as a Leader:*** *Nutanix was* [*named a Leader*](https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.nutanix.com%2Fpress-releases%2F2020%2Fnutanix-named-a-leader-in-hyperconverged-infrastructure-by-prominent-independent-research-firm&amp;esheet=52273899&amp;newsitemid=20200827005684&amp;lan=en-US&amp;anchor=named+a+Leader&amp;index=7&amp;md5=ba30cfc91de704bbf0227854577029f9) *in The Forrester Wave™: Hyper Converged Infrastructure, Q3 2020 report, published by Forrester Research, Inc. Nutanix believes this is consistent with additional independent market research, all of which conclude that Nutanix software is an undisputed leader in the fast-growing HCI market.” NTNX also reduced the use of cash flows by 66% this quarter “****Free Cash Flow:*** *Use of $13.8 million, compared to use of $33.3 million in the fourth quarter of fiscal 2019”*\n\n*and had a 30% increase in deferred revenue since the 4th quarter of 2019.* \n\nNutanix’s new leadership and financial restructuring will lead to a much better financial outlook for the company, and if it doesn’t as soon as we expect their innovation, outreach, and compatibility will be more than enough to lift the share’s prices. On top of that, NTNX has stayed aggressive in terms of offering the most they can, they have become a conglomerate of SaaS, devouring smaller startups and similar SaaS companies: \n\nAll in all, Nutanix has a bright and storied future ahead of it, and that is even more apparent after these earnings. Now my only concern is the possible change in leadership, but the market is seeing it as good news for the future of the company. \n\nTl:dr NTNX LEAPs for 2021 and 2022, I like the Jan 2022 35 call",
        "subreddit": "wallstreetbets",
        "title": "NTNX DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ihw51a/ntnx_dd/",
        "created": 1598599963.0
    },
    {
        "author": "UlineGum",
        "created_utc": 1596724444,
        "id": "i4svlf",
        "num_comments": 54,
        "num_crossposts": 0,
        "selftext": "TikTok is 12% of Fastly revenue and when the eventually get banned or bought out it will transfer to new servers and Fastly will get fucked. \n\nIf a company has 3 things. Good balance sheet, strong product, and good management I am in. Staying long on NET. Good technology and good leadership. Great balance sheet. Do your own DD. \n\nTikTok is really a bad deal for everyone. Just sink that turd monster IMO. Rebrand again. Muiscly -&gt; TikTok-&gt; onlyfans for your wife’s BF",
        "subreddit": "wallstreetbets",
        "title": "Don’t sell NET because of Fastly. It’s all MSFT fault and TikTok",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i4svlf/dont_sell_net_because_of_fastly_its_all_msft/",
        "created": 1596753244.0
    },
    {
        "author": "saibaba90",
        "created_utc": 1597672770,
        "id": "iben57",
        "num_comments": 54,
        "num_crossposts": 0,
        "selftext": "900 P/E on a stock, what madness is this? Making money off government credits, what madness is this? Thinking they are the only game in town with Google, Microsoft and NVidia all on their tails in the Autonomous driving race, what madness is this? Thinking the germans are just going to sit on their ass and let Tesla go without competition, what madness is this?\n\n**This is a mother of all bubbles, people are going to lose 80-90% of their net worth in this garbage stock.**",
        "subreddit": "stocks",
        "title": "Tesla is a bubble that will pop at $2000.",
        "url": "https://www.reddit.com/r/stocks/comments/iben57/tesla_is_a_bubble_that_will_pop_at_2000/",
        "created": 1597701570.0
    },
    {
        "author": "MMcDeer",
        "created_utc": 1598197692,
        "id": "if5g9t",
        "num_comments": 54,
        "num_crossposts": 0,
        "selftext": "Over the past few years, it has become clear that retail investors have done absurdly well. They've taken up on the large growth names, often times months or years ahead of Wall Street analysts because they could see the huge growth potentials.\n\nNames retail investors have taken up that have outperformed include Tesla, Apple,Amazon,Google,Facebook,Microsoft,AMD,Penn,Zoom, and many more (all of these from Robinhood's top 100).\n\nIt seems like any retail investor who just invested a decent portfolio in a strong growth name they knew would have greatly outperformed institutional investors/the S&amp;P 500 (including outperforming Warren Buffet). Most retail investors I know who just invested in at least one of the names I listed above blow Wall Street/S&amp;P 500/Warren Buffet's returns way out of the water and have greatly outperformed despite not being \"experts\"\n\nWhy are retail investors able to see growth opportunities that big institutions can't and do you think retail outperformance is sustainable? Does this retail outperformance mean we are truly in a golden age of retail investors, where's it's clear that retail investors are just as smart, if not smarter than so-called expert Wall Street investors?",
        "subreddit": "investing",
        "title": "Are we in a golden age of retail investing?",
        "url": "https://www.reddit.com/r/investing/comments/if5g9t/are_we_in_a_golden_age_of_retail_investing/",
        "created": 1598226492.0
    },
    {
        "author": "ArisenFall",
        "created_utc": 1596482497,
        "id": "i33kll",
        "num_comments": 53,
        "num_crossposts": 0,
        "selftext": "Is there something I don’t understand?????? Why is nikola up???????\n\nI own puts so tmr better be a fucking disaster for those shits who bought stock.\n\nAlso sold MSFT on Friday. Someone shoot me please!",
        "subreddit": "wallstreetbets",
        "title": "Wtf Is going on?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i33kll/wtf_is_going_on/",
        "created": 1596511297.0
    },
    {
        "author": "automax",
        "created_utc": 1598641110,
        "id": "iid555",
        "num_comments": 53,
        "num_crossposts": 0,
        "selftext": "Microsoft, TESLA, APPLE, NVIDIA, FB, AMAZON, ALL TIME HIGH with\n\n* A pandemic that is expected to last for another 6 months\n* 10% unemployment in US\n* 6 Trillion printed money in circulation\n* 10 year bond lowest ever\n* USD index super low,\n* 0% interest rates,\n* oil companies going bankrupt...\n* FED's wanting to increase inflation.\n\nHow long can this last!  I'm already getting tipped off, that its time to sell.",
        "subreddit": "investing",
        "title": "Is the Bubble about to POP!",
        "url": "https://www.reddit.com/r/investing/comments/iid555/is_the_bubble_about_to_pop/",
        "created": 1598669910.0
    },
    {
        "author": "ITZxxGODZILLAxx",
        "created_utc": 1596517453,
        "id": "i3d7rx",
        "num_comments": 53,
        "num_crossposts": 0,
        "selftext": "Dont be fooled by the MSFT TikTok pump fake going on right now. Remember that Trump is a GIANT baby and holds grudges against those who make him look stupid as the entire Tiktok community did when they reserved most of the seats at his Tulsa Oklahoma speech rally and did not go just to mock him. And boy did he look stupid in front of those empty stands. He is gonna ban TikTok and blame China for it just to punish those THOTS. He wont let MSFT buy them out. Ride the MSFT pump till Friday then dump and parlay it into PRPL calls. PRPL gang all the way into a new Lambo...",
        "subreddit": "wallstreetbets",
        "title": "MSFT TikTok Pump Fake",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i3d7rx/msft_tiktok_pump_fake/",
        "created": 1596546253.0
    },
    {
        "author": "Yarklink",
        "created_utc": 1597738335,
        "id": "ibwyhc",
        "num_comments": 52,
        "num_crossposts": 0,
        "selftext": "[Link To Original Post](https://www.reddit.com/r/wallstreetbets/comments/gtuz4y/i_accidentally_made_a_little_bit_of_money_on_my/)\n\nAll of you degenerates said I couldn't do it... that some retarded 19yr old wasn't capable of managing 200k in a casino.\n\nAND YOU GUYS WERE RIGHT BECAUSE I STILL DONT KNOW WHAT IM DOING LMFAO.\n\nI'm super fucking lucky and straight-up stupid. If at the time I started I just left all my money in SPY + QQQ SHARES and didn't touch it I would be up like 10% more than I am now. But with that being said, when SPY dropped 5% 6/12 (which was a fun day to celebrate my birthday to see a -13k loss in one day) my portfolio dropped like 20% and just kept going down... so I made a pretty big fucking recovery... (165k to 222k). At absolute rock bottom, you know what my dad told me. He told me he was \"very happy\" that this happened. He said, and I quote: \"I would rather have you lose some of my money in the stock market than you lose your own money later on in life... You needed to learn that nobody makes money in the stock market! It's ok.\" Also, he apparently had way more accounts, one with way more money, which is why I'm guessing he was ok with me fucking with this one.\n\nBut then stonks started to just go up and I realized this and bought random-ass fucking calls. I bought apple calls, MSFT calls, and blah blah and that's what made me most of the money back and now I'm in the positive around 13% at 222k (started 195k).\n\nNow my dad still stands by what he told me but he thinks I'm some sort of god still and asks me every day on WhatsApp: \"[Is market close to the ](https://imgur.com/a/PL99NYY)[top? Should we sell???](https://imgur.com/a/PL99NYY)\"\n\nI usually respond with some bullshit DD I read here like \"St0nKS oNly g0 Up\" or \"shut up you gay dumb retard bear.\"\n\ntl;dr: I turned 195k into 165k into 222k by complete luck. Also, I think autism runs in my family.\n\nSignificant Gains: [https://imgur.com/a/LgNu8oH](https://imgur.com/a/LgNu8oH)\n\nSignificant Losses: [https://imgur.com/a/neGwx66](https://imgur.com/a/neGwx66) (ADRE + EPI Losses are not mine, they're my dad's)\n\nPositions: [https://imgur.com/a/Q1ROCqA](https://imgur.com/a/Q1ROCqA) (Bullish on NVDA earnings)\n\nPerformance compared to SP500: [https://imgur.com/a/kOoWq2z](https://imgur.com/a/kOoWq2z) (Doesn't include my 4k gains from Monday 8/17)\n\n[All of my positions + Gains + Losses](https://imgur.com/a/LNXcPb2) (in one thing)\n\nShould I quit while I'm ahead and leave it in SPY+QQQ? Or... do I go big or go broke?",
        "subreddit": "wallstreetbets",
        "title": "[UPDATE] Going From Trading 2k On RobinHood To Trading 200k On My Dad's 200k Account",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ibwyhc/update_going_from_trading_2k_on_robinhood_to/",
        "created": 1597767135.0
    },
    {
        "author": "vitddnv-fu12y",
        "created_utc": 1596765688,
        "id": "i556ba",
        "num_comments": 52,
        "num_crossposts": 0,
        "selftext": "Operating Cash is arguably the most important item on the Statement of Cash Flows. It shows whether the business underneath the stock generates more cash than it spends on operations. \n\nBusinesses are run to make money. If they don't make money - there is a problem. \n\nPeople argue that some organizations don't need to produce cash. Instead, cash can be reinvested into Marketing, R&amp;D, etc. \n\nThat's okay and they are right. Those investments are reported in their corresponding sections later in the statement. Operating cash flow is reported before those investments are made. Bottom Line - *Investment Grade* companies must make money. \n\nHere are a few most known ones that do [MSFT](https://www.vhinny.com/display/cash-flows/MSFT), [AAPL](https://www.vhinny.com/display/cash-flows/AAPL), [AMZN](https://www.vhinny.com/display/cash-flows/AMZN), [GOOG](https://www.vhinny.com/display/cash-flows/GOOG). \n\nIf you struggle to find one cheaper and less known, here is a [list](https://www.vhinny.com/screen/operating-cash-profitable) of \\~1K companies that do.\n\nSo many options to choose from, and yet we buy crap because **stonks always go up** and then repost trillion times over some naive ideas about something that's not even hot anymore  - rather burned.\n\nNow, rip it off guys :D",
        "subreddit": "stocks",
        "title": "For all teenagers on the sub - you gotta get this down.",
        "url": "https://www.reddit.com/r/stocks/comments/i556ba/for_all_teenagers_on_the_sub_you_gotta_get_this/",
        "created": 1596794488.0
    },
    {
        "author": "Saca312",
        "created_utc": 1597398412,
        "id": "i9j2bo",
        "num_comments": 52,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "pennystocks",
        "title": "CEO Jack Lynch Reports that $HMHC is integrating with ZOOM, GOOGLE AND MICROSOFT TEAM for their \"HMH ANYWHERE\" learning curriculum used by K-12 classes.",
        "url": "https://twitter.com/smarttrades2020/status/1294056237815025665?s=21",
        "created": 1597427212.0
    },
    {
        "author": "Maat_66",
        "created_utc": 1596746918,
        "id": "i4zwgq",
        "num_comments": 51,
        "num_crossposts": 0,
        "selftext": "$MWK\n\nCurrently, the analyst consensus on Mohawk Group Holdings seems to be a strong buy with an average price target of $15.00.(Currently priced at $7.11). In their recent earnings, the company announced YOY revenue growth of 97%.\n\n$MSFT\n\nThe analyst consensus on Microsoft is also a strong buy with an average price target of $225.89. (Currently priced at 216.35). IMO I don't see the US TIKTOK deal going through, but if it does...🚀🚀\n\n$LHX\n\nFrom recent articles the word on the street also suggests a strong buy with a suggested price target of $258.00. (Currently at $173.67). Don't know much about these guys.\n\n&amp;#x200B;\n\nI've got a bit over $5k disposable cash to allocate.\n\nAny insights or recommendations?",
        "subreddit": "CanadianInvestor",
        "title": "{Fellow Canadians} This week analysts seem to be bullish on $MWK, $MSFT, and $LHX. Are any of them a buy right now? $MSFT has me doing videos on TikTok with my daughter just to see what it's all about 🤣",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/i4zwgq/fellow_canadians_this_week_analysts_seem_to_be/",
        "created": 1596775718.0
    },
    {
        "author": "mattmactrader",
        "created_utc": 1596412006,
        "id": "i2mfiu",
        "num_comments": 50,
        "num_crossposts": 0,
        "selftext": "**Castlight Health: The Present and Future of the Pandemic**\n\n&amp;#x200B;\n\nBuckle up, we’re riding $CSLT to mars. (DD thread below)\n\nFirst and foremost, a huge shoutout to BuySellShort for the initial find. Okay, listen up bulls and bears. I know nobody is talking about it, I know it’s not on your scanners, but I found this little diamond and I’m about to remortgage grandma’s house and drop it all in this one, pray for her. 3 words: COVID Contact Tracing. Or how about some names you actually care about like partnerships with Google, Amazon, and Microsoft. I’ll break it all down for you below.\n\n1. Who is Castlight?: Who is Castlight?: To put it simply, Castlight (CSLT) is a bridge that is being used by major states, corporations, and colleges to beat COVID-19, among other things. This is a company that has received government money, vital to school reopening, and partnering with billion-dollar companies to help the economy reopen. To beat COVID-19, Castlight solutions will play a large role. They take thousands of healthcare vendors and benefit resources and compile them all into one seamless experience. Among other uses for their data analytics, they work on mental health programs, sleep tracking, pregnancy programs, and a bunch more but most notably Virus testing. They make appointments easy and bring the experience to you so that you don’t have to go out and look for it. They’re big on contact tracing, COVID testing, and all the like from the time patients &amp; employees wake up to when they fall asleep. They are the present of this pandemic and very likely to be the future of it as well coming into the later stages.\n\n2. Risk factor: So here’s where the good stuff starts. How likely are you to declare bankruptcy, take up 2 more jobs and move back in with your parents? Not very likely. Castlight has no offerings filed and as it stands they’re already sitting pretty right above the $1 mark and they gain compliance on their 10th day of being above $1 on Monday (03AUG2020) so they have no need for a reverse split either. With the stock price sitting at $1.10 there is at most a 10c downside while on the upside you have a $3 gap to fill and another one at $5. The risk/reward on this one feels almost like parking some money on bonds except we have quite a few catalyst a that are gonna bullet train those returns below\n\n3. Partnerships: Ahhhhh man. It’s easier to say who they AREN’T partnered with than who they are. It’s wild how little attention they are getting considering they are partnered, as mentioned before, with GOOGLE, AMAZON, TESLA MICROSOFT, and so many others. A couple of notable customers include Activision Blizzard (yes, the Call of Duty guys) &amp; Kraft foods (Mac and Cheese baby!). I’ll be providing all sources missed below but for now, here’s a tweet from Karen DeSalvo the Chief Health Officer of freaking GOOGLE HEALTH acknowledging their partnership with Castlight Health.   \n\n[https://twitter.com/kbdesalvo/status/1251562792810770443?s=21](https://twitter.com/kbdesalvo/status/1251562792810770443?s=21) \n\nOther companies already partnered with Castlight, potentially using contact tracing from their platform as we speak:\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/95k8cj3vdoe51.png?width=678&amp;format=png&amp;auto=webp&amp;s=146b2c16d3c4372c602dfd7f63b2d377b6ebc6ed\n\n&amp;#x200B;\n\nhttps://preview.redd.it/68qa2gawdoe51.png?width=681&amp;format=png&amp;auto=webp&amp;s=f829bc484200fdef638e4bb057f8df21bcedfb2f\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/l3r8fym0eoe51.png?width=740&amp;format=png&amp;auto=webp&amp;s=657ea108853e85c654f301538b2b9cdab4e0f98a\n\n&amp;#x200B;\n\nBob is highlighted in red because he’s important. Remember him, he’ll come up again later.\n\nI know, it’s a lot. Just breathe and take it in\n\n4. Government Funding &amp; Contracts: Every major medical association says contact tracing is essential to containing the virus. Americans say they support it, and there is already 25 Billion in the Cares Act for contact tracing. But here’s the thing, IT ISN'T ENOUGH and at least 100,000 contact tracers are still needed nationwide. State and city level contracts are rolling out left and right to provide more funding for contact tracing while the big heads up top are in talks to cool up some federal bills to increase funding. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/2t1o4564eoe51.png?width=657&amp;format=png&amp;auto=webp&amp;s=cf98a8b86d32046ff86d7af3de46d3fa96f15d73\n\n&amp;#x200B;\n\n5. States ALREADY signed up or very likely to hop on board: \n\nA. New York rolled out a Covid-19 testing directory along with $30 Million in funds to support contact tracing initiatives. These moves include none other than Castlight as one of their main players. WorkingWell platform provides customizable health tracking and contact tracing for workplaces. It's integrated with Google, includes the most comprehensive test site directory in the country, and used by, among others, the NY STATE DEPARTMENT OF HEALTH.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/qcmfwoj7eoe51.png?width=696&amp;format=png&amp;auto=webp&amp;s=34e7d12db22d870bc874f3677dd6781da36d7118\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[https://twitter.com/castlighthealth/status/1287885139872104449?s=21](https://twitter.com/castlighthealth/status/1287885139872104449?s=21) \n\nGovernor Cuomo Announces More Than $30 Million to Enhance COVID-19 Contact Tracing and Flu Prevention in Advance of Fall Flu Season | Governor Andrew M. Cuomo\n\nB. Nevada is partnering with CSLT on a COVID testing site directory, approved $100 Million for testing and contact tracing, the majority of the funding to hire contact tracers.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/trq1jnibeoe51.png?width=634&amp;format=png&amp;auto=webp&amp;s=53403477ce9937b78be8df928da1845d97aa4822\n\n&amp;#x200B;\n\nhttps://preview.redd.it/560e937ceoe51.png?width=645&amp;format=png&amp;auto=webp&amp;s=a5d24a0ae3fa0162b9a0a6d938142625428af2c4\n\n  \n\n\nC. California spending $52 million on COVID response, including contact tracing, for agriculture workers. CA contact tracers to also prioritize schools. Contact tracing ESSENTIAL TO SCHOOL REOPENING.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/6372hgwfeoe51.png?width=471&amp;format=png&amp;auto=webp&amp;s=53572d4aff56260ae622ee6f7319e459c841bfe2\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ibpd7rzieoe51.png?width=471&amp;format=png&amp;auto=webp&amp;s=e96e0c5d898165611bcde563f2d3034a52b40d89\n\n&amp;#x200B;\n\nAnd many more to come as funding increases\n\n6. Colleges needing it: With the pandemic at hand, the college community has been hit arguably the hardest faced with the challenge of reopening campuses and getting bodies back in classes. Some colleges already using Castlight are:\n\nA. Indiana University\n\n[https://hr.iu.edu/benefits/castlight.html](https://hr.iu.edu/benefits/castlight.html) \n\nB. Princeton\n\n[https://hr.princeton.edu/thrive/well-being-resources/castlight](https://hr.princeton.edu/thrive/well-being-resources/castlight) \n\nC. Bowdoin College\n\n[https://www.bowdoin.edu/hr/benefits-perks/castlight/index.html](https://www.bowdoin.edu/hr/benefits-perks/castlight/index.html) \n\nD. George Washington University\n\n[https://benefits.gwu.edu/castlight](https://benefits.gwu.edu/castlight) \n\nE. Butler University\n\n[https://www.butler.edu/hr/benefits/health-wellness/castlight](https://www.butler.edu/hr/benefits/health-wellness/castlight) \n\nF. Harvard Business School [https://www.hbs.edu/openforum/openforum.hbs.org/goto/challenge/understand-digital-transformation-of-business/castlight-a-data-driven-solution-for-navigating-healthcare.1.html](https://www.hbs.edu/openforum/openforum.hbs.org/goto/challenge/understand-digital-transformation-of-business/castlight-a-data-driven-solution-for-navigating-healthcare.1.html) \n\nG. Arizona State\n\n[https://thunderbird.asu.edu/faculty-and-research/case-series/id/a01-18-0006](https://thunderbird.asu.edu/faculty-and-research/case-series/id/a01-18-0006) \n\nH. Purdue University [https://www.purdue.edu/newsroom/purduetoday/releases/2012/Q3/castlight-health-care-shopping-tool-launches-today.html](https://www.purdue.edu/newsroom/purduetoday/releases/2012/Q3/castlight-health-care-shopping-tool-launches-today.html) \n\nI. University of Cincinnati\n\n[https://www.uc.edu/hr/benefits/healthplans/anthem-engage.html](https://www.uc.edu/hr/benefits/healthplans/anthem-engage.html) \n\nJ. University of South California\n\n[https://healthpolicy.usc.edu/events/webinar-telehealth-in-the-era-of-covid-19/](https://healthpolicy.usc.edu/events/webinar-telehealth-in-the-era-of-covid-19/)",
        "subreddit": "pennystocks",
        "title": "$CSLT DD on Massive COVID Partnerships",
        "url": "https://www.reddit.com/r/pennystocks/comments/i2mfiu/cslt_dd_on_massive_covid_partnerships/",
        "created": 1596440806.0
    },
    {
        "author": "communistgod",
        "created_utc": 1598912005,
        "id": "ik7utu",
        "num_comments": 50,
        "num_crossposts": 0,
        "selftext": "Position:\n\nWMT 140C 9/11 \n\nMSFT 230C 9/18\n\nI bought those calls on Friday, it's now down 40%, I had a chance to walk away today with a 20% loss (2k) but I decided to hold, I still think the deal will go through, here is my analysis:\n\n* From the point of view of POTUS, banning Tiktok or forcing Tiktok to be sold to American are both viable options. It will most likely draw him more support in the election since Tiktok users are probably going to vote against him anyway \n\n* It is very unlikely that Tiktok can win its lawsuit, and everyone is well aware of that\n\n* Banning Tiktok will not hurt US's interests to any extend (unlike huaiwei and zte, where you can see multiple extensions were given to them, and there were much more resistances), after Tiktok is banned, their marketshare will be gobbled up by other companies like facebook\n\n* Tiktok has no bargaining power because of what is said above, and it is running out of time\n\n* Tiktok has a good algorithm to provide personalized feed, this is part that China require a license to export. Many people thinks that without this algorithm, Tiktok is just an empty shell. I disagree with that, this algorithm is most likely just one micro service from the entire cloud infrastructure. Their data, users (existing market share)  are more valuable assets.\n\n* If facebook can create a Tiktok rip off, microsoft should not have much difficulty with integration  \n\n* $30 billion is a lot of money for any company, if Tiktok is outright banned, there is nothing that could be recovered, I do not believe Bytedance and its investors will allow it to die like this when there are better options\n\n* Believe it or not, the Chinese government is here to serve the interest of Chinese companies. In my opinion, the announcement on Aug 28th is to help Tiktok to gain more bargaining power, since they are most likely facing pressure to sell off their AI algorithms as well. \n\n* If I was the CEO of ByteDance, I would want this to be over sooner rather than later, as time approaches the deadline, they have more to lose than Microsoft/Oracle. And if Tiktok is banned for a few days, they will lose a large portion if not all of their market share, since there is no royalty in this sort of business\n\n* Oracle is less likely to win due to a couple of reasons, 1. WMT decided to partner with MSFT not ORCL. 2. ByteDance is facing pressure from the Chinese market as well, selling the company with close relationship with the POTUS can have negative affects to the domestic market\n\nOf course, there are a lot of risks and uncertainties as well, notably:\n\n* Somehow Oracle won the bid, the I would probably lose all my money\n\n* I don't know what is a likelihood that an extension would be given to Tiktok, since their strategy can be to drag this on, this is probably the highest risk that would mess up with my calls. However, a few days ago, Tiktok reassured their employees more \"clarity\" for their future (https://www.bnnbloomberg.ca/tiktok-executives-reassure-employees-after-ceo-exit-1.1485955)\n\n* ByteDance is criticized for begin too soft (when in reality they really have no control over the situation), and Chinese consumers threaten to boycott Douyin (chinese TikTok) if Tiktok was sold to an American company",
        "subreddit": "wallstreetbets",
        "title": "Decided to hold my WMT and MSFT calls, wondering if it was a mistake",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ik7utu/decided_to_hold_my_wmt_and_msft_calls_wondering/",
        "created": 1598940805.0
    },
    {
        "author": "spenclark",
        "created_utc": 1597073490,
        "id": "i76zs7",
        "num_comments": 50,
        "num_crossposts": 0,
        "selftext": "Howdy,\n\nI bought a ton of work calls for the last couple of trading days. The market is overestimating the impact Microsoft teams will have on slack. The business and product are strong; even without COVID-19 tailwinds. I don't feel like writing a memo here because I would rather be working on more important things.\n\n&amp;#x200B;\n\nCya guys in September :)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/bxipsq7u17g51.png?width=614&amp;format=png&amp;auto=webp&amp;s=4b5643f733f94f8a59dbacfa2db79a5a5e2328ba",
        "subreddit": "wallstreetbets",
        "title": "Slack (NYSE: WORK)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i76zs7/slack_nyse_work/",
        "created": 1597102290.0
    }
]