[
    {
        "author": "Namnikoo",
        "created_utc": 1606842779,
        "id": "k4p5tg",
        "num_comments": 388,
        "num_crossposts": 0,
        "selftext": " Just saw a great DD article on Seeking Alpha on PLTR. https://seeking$$alpha.com/article/4392215-palantir-technologies-in-depth-look-whether-sustainable-competitive-advantage\n\nIt's paywalled so here's the text to share. I know most of you autists can't read for shit, BUT GODDAMN READ THIS SHIT SO YOU KNOW WHAT YOU'RE SPENDING YOUR MONEY ON. or just read the summary, or scroll to the very bottom for TL;DR \n\n**Summary**\n\n* As speculators circle around Palantir from both the long and short sides, trading volatility has obscured the fundamental picture as to whether the company commands a sustainable competitive advantage.\n* In this article, I intend to have an under-the-hood look at Palantir as a 'digital resources' play to answer that all-important question.\n* I believe its Gotham, bundled with forward-deployed field service representatives, has surmounted the barriers to entry and now enjoys switching cost advantage and emerging network effect.\n* As it diversifies into adjacent commercial verticals through Foundry, Palantir will benefit from economies of scope and scale. Profits will ensue.\n* Shareholders are betting on Palantir's success in completing the digging of a wide moat. The less anticipatory investors may want to wait until such a moat becomes reality.\n\n**Palantir Technologies: Does It Have A Sustainable Competitive Advantage?**\n\nThere are probably as many investors who are averse to Palantir Technologies Inc. (PLTR), a recent public listing, as those who root for it. The stock has gone parabolic since the start of November 2020. Then, short-seller Andrew Left of Citron Research entered the scene with his tweet. All of the trading volatility has obscured one important fundamental question: does Palantir have a sustainable competitive advantage?\n\nBelow, I attempt to answer that question with an in-depth look at this interesting company.\n\n**What does Palantir do?**\n\nAs of 2020, Palantir's mission is to help its users, the people doing the hard work on complex, real-world problems by writing software that enables effective analysis against complicated, data-driven problems.\n\nPalantir offers two principal data fusion platforms for integrating, managing, and securing any kind of data at a massive scale, i.e., Gotham for government agencies and Foundry for the commercial market. With forwarded-deployed Field Service Representatives, Palantir transforms massive amounts of disparate information into an integrated data asset that reflects their operations, and layer applications on top of the Gotham or Foundry platform to make the integrated data asset accessible and actionable and for fully interactive, human-driven, machine-assisted analysis (Fig. 1).\n\nOn the backend, Palantir runs a system called Apollo as a continuous, automated means to deliver updates to the Foundry and Gotham platforms everywhere they are deployed - cloud, on-premises, and classified networks - without disrupting customer operations. Apollo reduces the demand for field engineering teams to manage software deployments and gives Palantir SaaS operating efficiency in a very heterogeneous environment.\n\nLooking ahead, Palantir is poised to become the default central operating system for data across the U.S. government and its allies. The company also aspires not only to be the central operating system for data at large businesses and even entire industries. To appreciate Palantir's ambition with regard to B2B big data, it may be helpful to recall how much economic benefit has been captured by Microsoft (MSFT) after Windows OS took the lead over MacOS of Apple (AAPL) in the PC era, and by Google and Apple in the consumer mobile phone age with their respective Android and iOS operating systems.\n\nThere is a range of potential competitors that offer similar services in some capacity, including (1) traditional IT consultancies, e.g., Booz Allen (BAH) and Accenture (ACN), which lack the technical prowess as well as niche focus; (2) blue-chip data companies, e.g., IBM/i2 (IBM), which cannot scale down efficiently enough to compete on price; and (3) defense contractors such as Booz Allen (BAH), Raytheon Technologies (RTX), Science Applications International Corporation (SAIC), and BAE Systems plc (OTCPK:BAESF), which cannot compete on costs and end-user responsiveness with Palantir. These juggernauts are not nimble enough to pivot away from their legacies and wide-ranging service offerings to effectively match the focus and end-user friendliness of Palantir, although they may occasionally chip away some revenue.\n\nSilicon Valley heavyweights, such as Alphabet Inc. (GOOG), are unwilling to work for the Pentagon citing unethically even though it thought it was okay to collaborate with the Chinese government in project Dragonfly (see here).\n\nThere are some smaller start-ups that work in the same general field as Palantir, but they lack the resources (capital and talent) to climb the steep learning curve and compete against Palantir head-to-head. These may include Digital Reasoning, which entered the intelligence field even before Palantir and also received funding from In-Q-Tel, the venture capital firm of the CIA, which seems not to be particularly well run which is why its founder recently returned to the CEO helms; (2) Ayasdi, acquired by the SymphonyAI Group in 2019, which has a core topological analysis platform on top of which custom applications for customers mostly in healthcare and finance are built; and Beijing-based MiningLamp, self-styling as \"the Palantir of China\" and with US$300 million just raised in a funding round co-led by Temasek and Tencent, which may pose some threat in the commercial arena given it reportedly got business from western firms (see here).\n\nWith regard to the OS platform for data especially on the government front, Palantir more or less owns the niche. On the commercial front, Palantir is industry agnostic but is focused on forging ties with approximately 6,000 companies in the world with more than $500 million in annual revenue. Palantir has been saying the real competition is the in-house development projects of its potential customers.\n\n**The digital resources space**\n\nI believe some of the key characteristics of Palantir can be better understood in the context of what I call the \"digital resources\" investment space at The Natural Resources Hub (Table 1). This is a group of businesses from various industries, which in a nutshell share the following features:\n\nA unique value proposition. By accumulating and processing big data, or enabling data-intensive operations, these B2B companies generate recurring, subscription-based revenue from business or government customers.\n\nWide moat. They command a monopolistic or oligarchic position in their niche, protected by enormous barriers to entry, some network effects, and switching costs, which gives them a sustainable competitive advantage over the fellow industry participants they serve. They tend to show resilience during industry crises.\n\nDominance in native industry. They are deeply entrenched in their respective native industries. Some of them were even bankrolled at their birth by home industry advocacy groups. They then expand into adjacent industries in pursuit of economies of scope.\n\nAggressive acquisitions. In an expansion of their service into adjacent verticals, they usually face a fragmented competitive landscape, fertile for M&amp;A, which further fuels rapid growth.\n\nCapital and operational efficiency. They develop scalable solutions that are built once and installable or sellable countless times. So, they are capital-light and can operate very efficiently. They typically generate superior profitability and deliver a high rate of returns on invested capital.\n\nAs I shall demonstrate below, Palantir shares most, if not all, of the characteristics of the verified members of the 'digital resources\" space. Prima facie, it is a wide moat prospect and worth a deeper examination.\n\n**Does Palantir have a sustainable competitive advantage?**\n\nIn the consumer-oriented internet arena, winners are known to take all thanks to a number of traits, including the economies of scale and scope, network effects, the advantage of big data and machine learning, brand power, switching costs, the attraction of talents, the charisma of hard-driving founders, and benefits of geographical clustering, as has been summarized here.\n\nThe same may not be said about the B2B platform race, where peers compete mainly on products, services, and customer experience (see here). The outcome of the competition may not be binary (the winner takes all, and the losers die) due to the lack of viral growth.\n\n**The technological edge**\n\nAs I stated above, B2B platform rivals compete primarily on products, services, and customer experience. Palantir follows the approach of bundling superior technology with top-notch forward-deployed field service representatives.\n\nIn its home industry - intelligence and defense, Gotham was created with native attention to security rules, access privilege, and user action logging. No other systems allow users to draw associations between disparate data sets and to visualize the connections as easily and quickly. Palantir has maintained a laser-sharp focus on developing the world's best platform for data, while its primary competitors such as Booz Allen or Raytheon are widely diversified. From competition outcome to reputation among end-users, Palantir not only has a clear technological edge but also is more cost-effective than competitors (see here and here). That's why Palantir is confident it only needs to be placed in front of the right people to prove its worth.\n\nBut then, what makes Gotham shine are the forward-deployed field service representatives. Palantir field service representatives proved to be not only some of the brightest engineers known to government agencies but also extremely responsive to the needs of end-users. These forwarded-deployed engineers examine customer needs, resolve all data source and complexity issues, and build out applications on top of Gotham. Once the applications are built, they train users on site until the customers are ready to use the product on their own. The forwarded-deployed engineers also bring their experience acquired in the reality of deployment back to Palantir development centers as they rotate assignments.\n\nAlthough its technology and approach are by no means cannot be replicated, Palantir makes the smart decision of focusing on a narrow scope in the sprawling B2B data landscape and, in that niche, it excels at helping customers solving complex data problems at relatively low costs, which actually takes a lot to accomplish, from well-written software, via responsive backend support, to knowledgeable forward-deployed field service representatives. It is no wonder Palantir has earned a sterling reputation for effectiveness and ease of use in the intelligence and defense circle, which I believe it can parlay into the commercial market (Fig. 2).\n\n**Palantir brand and talent attraction**\n\nGiven the forwarded-deployed engineers play such an important role in the technological advantage of Palantir (as do the backend developers), it follows that it is critical for it to attract the smartest engineers in the market if that edge is to be maintained and expanded. To that end, the founders have successfully created an aura of mystery around Palantir:\n\nIn-Q-Tel, the venture capital firm of the CIA, being its very first investor; catcher of Osama bin Laden and the would-be preventer of 9/11; buster of the hacker of Dalai Lama's personal computer and Ponzi schemer Bernie Madoff;\n\nsoftware vendor to a slew of U.S. intelligence and military agencies (including the CIA, FBI, DHS, NSA, Special Operations, the Marine Corps, the U.S. Army and West Point, the U.S. Navy, the USAF, and the U.S. Space Force), police departments like NYPD, the governments of U.S. allies, and commercial businesses Ferrari (RACE), Airbus (OTCPK:EADSF), BP (BP), Merck (MRK), and JP Morgan (JPM);\n\nhelper of the NIH, CDC, and NHS to track the COVID-19 virus, the World Food Program to stop famine, and the National Center for Missing &amp; Exploited Children to fight child exploitation;\n\nhigh-profile politicians such as former Secretary of State Condoleezza Rice and CIA Director George Tenet advising, while luminaries Mike Kelly, David MacNaughton, Louis Mosley (grandson of Oswald Mosley), and Fabrice Brégier (former No. 2 at Airbus) joining to lead its Australian, Canadian, British, and French subsidiaries, respectively;\n\na dissent in Silicon Valley that takes side with the U.S.A.; let alone the persona of the hard-driving founders, including Peter Thiel who is said to be the smartest guy in the Silicon Valley besides being a co-founder of PayPal (EBAY) and the first outside investor in Facebook (FB), the lawyer-philosopher-hedge fund manager CEO Alex Karp, and the genius engineers Stephen Cohen, Joe Lonsdale, and Nathan Gettings; even Shyam Shankar, the COO, has also been getting a lot of attention...\n\nThe mystique proves to be a powerful recruiting advantage; it helps line up a self-replenishing stream of the best applicants from some of the top-ranked colleges and graduate schools, who are confident they are the smartest computer geeks, who join to work long hours with a cultish band of fellow geniuses to solve the world's hardest problems in spite of lower salaries than Silicon Valley juggernauts like Google, Facebook, and Apple (AAPL).\n\nBecoming a publicly-traded company only strengthens the staffing edge, thus posing a serious challenge for the big IT consultancies, traditional defense contractors, and smaller start-ups. Hiring the best talents will undoubtedly help sustain Palantir's technological advantage.\n\n**High barriers to entry**\n\nThere exist extremely high barriers to entry in the intelligence and defense sector. Even the best end-user experience and reputation alone are not enough to get deals closed. Below, I highlight two hurdles.\n\nJust to open doors. To open doors and lubricate negotiations, some major defense contractors spend as much as $14 million per year on lobbying.\n\nPalantir had been quick in learning the rope of getting things done in Washington D.C. It consulted Washington insiders early on and went ahead hiring former senators John Braux and Trent Lott for formal lobbying (see here). Its lobbying spending has been on a steady rise and, in the last few years, reached well over $1 million per year by hiring &gt;25 lobbyists (Fig. 3).\n\nPalantir also retained former Secretary of State Condoleezza Rice and CIA Director George Tenet as advisers (see here).\n\nTo overcome buyer inertia gently and forcefully. Another major challenge faced by Palantir was the department of defense saw it as an outsider that tries to sell software not even in response to any specific requests in its conventional acquisition system, oblivious to the capabilities and cost-effectiveness of Palantir Gotham.\n\nIn response, Palantir allowed free trials of Gotham and provided free services before potential military clients made any purchases; it offered free or reduced-price training to military units that purchased its software. Forward-deployed field service representatives listened to the needs of its end-users and were capable of implementing requested changes quickly.\n\nPalantir's entrepreneurial approach led to a number of successes with, e.g., some Army military intelligence units and the Marine Corps. Some intelligence officials in the Marine Corps even went so far as to say they would not be surprised to see Palantir remain the de facto standard (see here).\n\nEven though Palantir has demonstrated the efficacy and cost-effectiveness of Gotham, the U.S. Army stuck to the plan of developing its internal intelligence software suite, i.e., the Distributed Common Ground System-Army (DCGS-A) Increment 2, and released a procurement solicitation in December 2015 for its development, thus effectively excluding the ready-to-deploy commercial alternative - Gotham - from being considered. The Army decision was a major blow to Palantir because Gotham does exactly what DCGS-A is trying to do yet at a much lower cost; in other words, the Army is reinventing the wheel, unnecessarily and wastefully.\n\nAfter a pre-award bid protest filed with the Government Accountability Office had been denied, Palantir sued the Army in the Court of Federal Claims in June 2016, arguing the Army violated the 1994 Federal Acquisition Streamlining Act by not conducting the market research necessary to determine if commercially available items could meet its needs, with or without modification. The lawsuit is an extremely bold move because defense contractors typically dared not to sue its largest customer, even when their interest as protected by the 1994 law had been infringed. The judge ruled in favor of Palantir in October 2016 and upheld Palantir’s argument the Army violated the 1994 law (see here), which was affirmed by the Court of Appeals for the Federal Circuit on September 7, 2018.\n\nEven while the appeal was ongoing, the Army rethought its acquisition plan and, in March 2018, picked Raytheon and Palantir to provide new intelligence analysis platform offerings that could be used effectively at the tactical level in place of DGCS-A. In March 2019, the Army announced Gotham beat out Raytheon's FoXTEN system and won the $20 million first delivery order, as part of an $876 million contract over 10 years. Significantly, the Army's loss in court forced it to transform its procurement process. The Army now follows a “try, buy, decide approach” when it comes to commercially available products (see here). The win in the court is expected to create a lot of opportunities for Palantir down the road.\n\nThe distance Palantir has gone to gain access to the intelligence and military market proves one thing: the presence of enormous barriers to entry. In the face of such formidable hurdles, few aspirants have the determination, investment time horizon, and resources to pull off the feat of entering and establishing itself as the de facto standard in that market. Over a time span of 15+ years, Palantir sunk quite a few billions of VC dollars on software development, offering products and services for free or on lean fees, and lobbying and suing to get a level playing field, yet without a single major botch-up over all those years. Those who sneer at Palantir for still losing money after 17 years of investment fail to appreciate how impossible a strategic goal the company has come to set for itself: to become a wide-moat software supplier to the governments of the U.S. and its allies.\n\n**Switching cost, economies of scale, and network effect**\n\nHaving earned contracts from the intelligence and defense sector, Palantir became an insider so to speak, and the barriers to entry work to its advantage. Gotham has been deployed as the platform for data integration at various intelligence and military units displacing the existing system including DGCS-A, a myriad of applications has been developed for the agents, and thousands of end-users have been trained to use those applications on a tactical level in critical missions and battlefields. A switching cost has arisen in favor of Palantir and it will only get higher.\n\nAs more contracts are signed with the U.S. government and its allies, Palantir will begin to enjoy economies of scale, thanks to the large fixed costs incurred for building the software once and the relatively low costs associated with deploying it countless times.\n\nJust playing out according to Palantir's plan, Gotham is increasingly being used for sharing disparate data sets across different government agencies. Once those siloed data sets are all integrated on Gotham, there will emerge a huge network effect, further heightening the existing barriers to entry. Under such a network effect, a new entrant may land an isolated deal sporadically, but it is beyond me how this hypothetical incursor can dislodge Palantir by convincing dozens of stodgy government agencies to simultaneously give up perfectly-functional, mission-critical Gotham and install an unproven piece of software instead. That's why I believe Palantir's competitive advantage in the government sector will prove to be sustainable.\n\n**The commercial market**\n\nAs I discussed above, 'digital resources' companies tend to expand into adjacent verticals for the benefit of economies of scope. Palantir's expansion into various industries in the commercial sector is precisely for that end. The same technological know-how sharpened in defense deployments can be parlayed into serving the commercial sector. The utilization of Apollo, the backend system for continuous, automated software update deployment, doubles as it supports Foundry in addition to Gotham. The corporate resources are shared by operations in both sectors, resulting in lower overhead per dollar of revenue. The direct sales force will be able to cross-sell Gotham to some commercial customers. Diversification into additional industries reduces the risk associated with the slowdown of individual industries. As opposed to the high barriers to entry in its home industry of intelligence and defense, the commercial world tends to have more competitors. However, economies of scope will likely offset the narrower moat.\n\n**Network effect in the commercial sector**\n\nOver the long term, Palantir (PLTR) estimates the total addressable commercial market contains \\~6,000 companies with more than $500 million in annual revenue (see here). Palantir began to develop Foundry for the commercial sector in 2012 and launched it in 2016. Foundry is poised to become a central operating system not only for individual institutions but also for entire industries. In 2017, e.g., the five-year, $300 million partnership with Airbus allowed Foundry to expand into a platform for the aviation industry, which today connects data from &gt;100 airlines and 9,000 aircraft around the world.\n\nIf successful, an industry-wide central operating system for data will effectuate an extensive network effect. However, to get there, Palantir needs to rapidly grow the commercial top-line. Foundry pulled in $340 million in 2018 and $397 million in 2019. Commercial revenue grew 35% from the 3Q2019 to the same period one year ago (see here). How will Palantir further accelerate commercial sales momentum?\n\n**Commercial sales strategies to accelerate the network effect**\n\nIn the near term, Palantir plans to focus on building partnerships with institutions that have the leadership necessary to effect structural change within their organizations - to reconstitute their operations around data. Buy-in from the top brass is imperative. Hopefully, Palantir can leverage its reputation and relationships gained in the government sector, as in an early case in which NYPD, then a customer, introduced Palantir to its first commercial client JP Morgan (JPM).\n\nPalantir used to have a policy of not hiring direct salespeople, given how intelligence and military contracts are acquired and serviced and perhaps due to a post-dotcom bubble belief \"technology is primarily about product development, not distribution\". However, there is absolutely no viral growth in B2B as there occasionally is in B2C. The common practice in the 'digital resources' space is to maintain a large force of salespeople each managing a few customer accounts, with responsibilities such as opening new sales territory, scouting for client needs, scaling within existing customer accounts, coordinating technical presentations by engineers, securing technical support for clients, and managing customer relationships. Palantir began to recruit direct salespeople in end-2018. The commercial sales growth in 2019 seems to prove the concept of direct sales works, so Palantir is poised to triple the headcount of the sales force.\n\nHistorically, data-inundated organizations either build in-house or buy dozens of off-the-shelf products and sew them together, both approaches having been proven inefficacious in a rapidly changing and increasingly uncertain world. Foundry offers the third, and better, option for those organizations. However, Palantir comes to realize that, in the near-term, institutions do have an imperative to stick to their internally-built software. So, Palantir makes its own solutions fully modular such that customers can \"take what they need, build on what they have\" (see here). Such a flexible approach should help overcome corporate inertia to reach out for external assistance and accelerate customer onboarding, and create a new way of going to market with channel partners.\n\nPalantir plans to partner with cloud-hosting channel partners, such as Amazon (AMZN), to drive commercial revenue growth. It was Amazon that helped facilitate the partnership between Palantir and the Colombian government. Palantir developed Visor COVID-19, a digital instrument built on top of Foundry hosted in the AWS infrastructure and offering a unified, near real-time view of the state of the pandemic using the largest integration of open data and depersonalized epidemiological data in Colombia.\n\nInternational sales already account for fo 46% of the total revenue as of the 3Q2020. As part of its international growth plan, Palantir has set up subsidiaries in Canada, Australia, the U.K., France, and other countries in the last few years. In Japan, it took a different approach and chose to form a joint venture in partnership with Sompo Holdings, Inc., which subsequently invested $500 million in Palantir. The JV launched in June 2020 “the real data platform for security, health, and wellbeing”, powered by Foundry, to accelerate the digital transformation of Japanese governmental institutions and industries ranging from healthcare to automotive to manufacturing. The JV is also working on onboarding the Japanese government.\n\n**Risk abounds**\n\nPublic relation disasters can damage its image in the eyes of the next generation of software engineers; this is an area that Palantir, now a public company, should allocate additional resources to. A Snowden-like incident can set Palantir back appreciably, impacting client relationships and employee morale alike.\n\nPalantir must penetrate its chosen market swiftly to enlarge the switching cost, expand the network effect, and heighten barriers to entry, lest a resourceful competitor launches a dogged challenge in the government sector or its smaller imitators strike it lucky in the commercial market and steal potential customers. A well-intended acquisition can turn sour, contaminating the entire operation.\n\nAs far as I can see, the management team at Palantir is paranoid enough to allow any blind spots unaddressed in its business execution. However, Black swans do happen.\n\n**Investor takeaways**\n\nI believe Palantir has an inchoate durable competitive advantage, which acts as an economic moat to protect its business from invaders, which seems to be widening judging from new developments since the IPO.\n\nIn the self-created niche of supplying the operating systems for data for government agencies, Palantir clearly delivers a peerless customer experience with superior technology bundled with top-notch forward-deployed field service representatives.\n\nGotham has become the default operating system for data at some U.S. government agencies, where Palantir enjoys switching costs.\n\nPalantir seems to have also built a brand that helps attract top-notch talents, which sustains its technological edge.\n\nNow that it has kicked open the door of the U.S. government agencies by winning a critical lawsuit against the Army, Palantir is expected to achieve rapid penetration of that market. Gotham is increasingly being used for integrating siloed data sets across different government agencies, which in time will result in an enormous network effect, further heightening the barriers to entry for aspirant entrants.\n\nThe company is aggressively diversifying into adjacent commercial verticals and international markets for economies of scope. Revenue growth, both from the government and commercial sectors, will lead to economies of scale. Down the road, Palantir will have the pricing power at its disposal to drive profitability.\n\nAt this time, the share price of Palantir may seem to have gotten ahead of itself - a point to be further explored elsewhere. The shareholders are taking risks to bet that the company will succeed in digging the wide moat and that years of profitable growth will follow.\n\nLess anticipatory investors may want to wait until Palantir has completed building such a wide moat. For these investors, the entry opportunity may come in the form of a major sell-off during a general market recession or in an idiosyncratic crisis down the road.\n\n**TL;DR - PLTR has great prospects, short-term casino, long term (8-12 months) to the moon**\n\nPositions: some shares of PLTR, some 12/4 $30 puts (hedge) at 50% gainz.",
        "subreddit": "wallstreetbets",
        "title": "Some Serious PLTR DD courtesy of SA",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k4p5tg/some_serious_pltr_dd_courtesy_of_sa/",
        "created": 1606871579.0
    },
    {
        "author": "420redditpornacct69",
        "created_utc": 1607903941,
        "id": "kcm0r9",
        "num_comments": 128,
        "num_crossposts": 0,
        "selftext": "Mis compas, mis amigos y amigas, fellow autists and retards of WSB,\n\nI return to you now with the second installation of my Big Crazy Idea about why Bill Ackman's SPAC, Pershing Square Tontine Holdings, and what is shaping up to be the most important company for the economic development of the internet, Stripe, could be teaming up to take steps in order to wrest back control of the financial system from the veritable freak show of private equity and investment banking, which I will collectively refer to as Big Capital. The previous post can be found [here](https://www.reddit.com/r/wallstreetbets/comments/kbjpqy/an_alternative_hypothesis_for_psth_stripe_for_the/) and serves as an introductory foray into institutional financial crime. If you thought that one was long, strap the fuck in, because we're going deep into the muck with our third eyes wide open.\n\n#Big Capital, Big Crime, and Rivers of Blood\n\nThis section will attempt to provide some historical context on the history of Big Capital with a particular focus on the inextricable links between intelligence agencies (mainly the Central Intelligence Agency and its predecessor, the Office of Strategic Services) and Wall Street, starting around the time of World War II. It will lean heavily on the work of Michael S. Judge, whose podcast [Death is Just Around the Corner](https://www.patreon.com/deathcorner/) has become an integral part of my understanding of the nature of American imperialism, which has been largely scrubbed from the history books. It will also draw from excellent books including but not limited to Vincent Bevins' [The Jakarta Method](https://www.publicaffairsbooks.com/titles/vincent-bevins/the-jakarta-method/9781541724013/) and Stephen Kinzer's [The Brothers](https://us.macmillan.com/books/9781250053121) and [Poisoner in Chief](https://us.macmillan.com/books/9781250140432). In the interest of accessibility, I will be supplying Wikipedia articles for further reading, but with the caveat that [Wikipedia itself cowtows to the American imperial project](https://thegrayzone.com/2020/06/10/wikipedia-formally-censors-the-grayzone-as-regime-change-advocates-monopolize-editing/) and **should not be taken as an authoritative account of history.**\n\nI think the best place to start this story is with Allen Dulles, the longest serving director of the CIA, and his brother John Foster Dulles, who was Dwight Eisenhower's Secretary of State. Before joining the federal government, the Dulles brothers worked for [United Fruit Company](https://en.wikipedia.org/wiki/United_Fruit_Company), which is now known as Chiquita Brands International (yes, the 🍌 company), where John served as legal counsel and Allen was on the board of directors. The United Fruit Company was a key driver of the CIA-led [1954 Guatemalan coup that ousted the democratically elected Jacobo Arbenz](https://en.wikipedia.org/wiki/1954_Guatemalan_coup_d%27%C3%A9tat) and replaced him with the dictator Carlos Castillo Armas, which will be a recurring theme in this missive. Put a pin in this for now, because we have to backtrack a little further first.\n\nIt is critical to understand that the CIA and the agencies that came before it, are deeply rooted in the boy's club of Wall Street from the years between World War I and World War II, and that pipeline catapulted people like [Prescott Bush](https://en.wikipedia.org/wiki/Prescott_Bush) (father of George H.W. Bush and grandfather of George W. Bush) to the highest levels of the American government. Most of these roaches skittered out of investment banks like [Brown Brothers Harriman](https://en.wikipedia.org/wiki/Brown_Brothers_Harriman_%26_Co.) or law firms like [Sullivan &amp; Cromwell](https://en.wikipedia.org/wiki/Sullivan_%26_Cromwell), both institutions that still stand to this day.\n\nPrescott Bush and the Dulles brothers were up to some real sketchy shit before, during, and after WWII, [having business ties to German industrialists that helped finance Hitler's rise to power and helping Nazis launder money and transport looted art and valuables through European banks](https://www.theguardian.com/world/2004/sep/25/usa.secondworldwar). Supreme Court Justice Arthur Goldberg even went so far to say that [\"The Dulles brothers were traitors.\"](http://libcom.org/library/making-killing-christian-dewar) Prescott and the Dulles brothers were probably not literally card-carrying Nazis, but the model of fusing big business and central government, which the CIA was based on and adheres to up to this very day, [**is explicitly fascist when going off of the dictionary definition of the word**](https://www.merriam-webster.com/dictionary/fascism) (read: not using it as a proxy for \"person I disagree with politically\" as it's so often used today). Did you know that the CIA has an active venture capital operation called [In-Q-Tel](https://www.iqt.org/) and that Palantir's only early investor besides Peter Thiel was [one and the same](https://www.nytimes.com/interactive/2020/10/21/magazine/palantir-alex-karp.html)? Now you do.\n\nIn the last days and immediate aftermath of WWII, the intelligence agencies spearheaded an effort by the US government called [Operation Paperclip](https://en.wikipedia.org/wiki/Operation_Paperclip), which was designed to save Nazi and Japanese scientists from the gallows and put them to work developing weapons programs in the US. [Wernher von Braun](https://en.wikipedia.org/wiki/Wernher_von_Braun), chief architect of the Saturn V 🚀 that sent Apollo to the 🌑? Operation Paperclip. [Shiro Ishii](https://en.wikipedia.org/wiki/Shir%C5%8D_Ishii), a man who was loading grenades full of plague bacteria and sewing babies together and shit in Manchukuo (Japanese-occupied China)? Operation Paperclip.\n\nAt this point in the story, WWII is over and the USSR has become the Big Bad Mans of the time period from 1945 to 1991 that we collectively refer to as the Cold War. Unfortunately, the Cold War was not actually very cold, and instead took the shape of a seemingly endless series of proxy wars and regime change operations led by Western intelligence agencies attempting, with various degrees of success, to overthrow democratically elected leftists and appoint authoritarian leaders with the backing of weapons and money from the CIA. This is not an exhaustive list, but includes examples like the [1953 Iranian coup](https://en.wikipedia.org/wiki/1953_Iranian_coup_d%27%C3%A9tat) that overthrew Mohammad Mosaddegh and replaced him with Shah Pahlavi, the aforementioned 1954 Guatemalan coup, the [mass killings in Indonesia](https://en.wikipedia.org/wiki/Indonesian_mass_killings_of_1965%E2%80%9366) that ultimately resulted in the removal of Sukarno and a 31 year military junta under Suharto, the [1973 Chilean coup](https://en.wikipedia.org/wiki/1973_Chilean_coup_d%27%C3%A9tat) that brought Augusto Pinochet to power, and both the [Korean](https://en.wikipedia.org/wiki/Korean_War) and [Vietnam](https://en.wikipedia.org/wiki/Vietnam_War) Wars, in which the greatest military in the world was epically pwned by a bunch of starving jungle fighters using slingshots and AK-47s.\n\nThe underlying reason for a lot of this carnage, besides the stated goal of beating back the spectre of communism or whatever the fuck? Resources. Iran had oil, Chile had nationalized the copper mines that Big Capital needed to fuel the electronics boom, and both the [Golden Triangle](https://en.wikipedia.org/wiki/Golden_Triangle_\\(Southeast_Asia\\)) and [Golden Crescent](https://en.wikipedia.org/wiki/Golden_Crescent) were fertile ground for growing opium, which was used to make the heroin the CIA trafficked all over the world and sold to buy weapons that they then gave to the dictators they propped up, sometimes [using the bodies of dead soldiers as mules](https://www.nytimes.com/1972/12/17/archives/drug-feared-sent-in-bodies-of-gis-court-told-that-smugglers-used.html). \n\nDoes any of this sound familiar and related to the current day? How about the overthrow of [Evo Morales](https://en.wikipedia.org/wiki/2019_Bolivian_protests) in Bolivia, which was applauded by [Elon Musk](https://imgur.com/XCsXNTJ), who wants cheap access to their copper mines so he can make batteries for his shitty cars? How about the Forever War in the Middle East, which has effectively turned [Afghanistan into a narco-state?](https://www.theguardian.com/news/2018/jan/09/how-the-heroin-trade-explains-the-us-uk-failure-in-afghanistan) How about the endless revolving door between the Pentagon, defense contractors, and the rest of the federal government, as exemplified most recently by the nomination of [Raytheon board member General Lloyd Austin](https://en.wikipedia.org/wiki/Lloyd_Austin) to be Joe Biden's Secretary of Defense? That's right, you blue-pilled goldfish, the Democrats are not your friends either.\n\n#The Stripe and PSTH Angles\n\nAlright, enough psychic assault for the moment. Let's talk about Stripe for a bit. As stated previously, Stripe is building the infrastructure that the internet economy runs on. The Collison brothers, those cheeky little leprechauns, seem like they're wired pretty differently than most of the money grubbing bug people that inhabit Silicon Valley. [Take this clip of co-founder and CEO Patrick Collison](https://youtu.be/knXY3Rwtfww?t=1495) talking about the nature of motivation (listen through to ~27:20 at least). [Or this one of co-founder and president John Collison](https://youtu.be/N_W62v3RYwc?t=239) talking about the need to support small businesses who have been reamed by the pandemic and build Stripe bigger and better as a service to the small fish in the ocean (listen through to the end on this one).\n\nBill Ackman is a signatory on the [Giving Pledge](https://givingpledge.org/Pledger.aspx?id=157), and as discussed in the previous post, is also not your typical Wall Street swamp monster. He remarried last year and has a kid that's a little over a year old by this point. He deeply understands that the finance game is rigged against the little guys, that Big Capital has wrapped its disgusting slimy tentacles all over the world, and is choking more life out of it every single day. Could it be that he wants to do whatever he can to stop the world his kid will grow up in from devolving further into some kind of [Mad Max](https://imgur.com/HTpAmLG) scenario?\n\n[The order of operations for how PSTH is structured is flipped on its head](https://www.cnbc.com/2020/07/22/bill-ackman-and-tontine-holdings-rewrite-the-terms-for-spacs.html) from the way previous SPACs have been run by institutions like Goldman Sachs (remember, we hate them) with regard to sponsor compensation. Pershing Square isn't taking a thing until the investors in the SPAC see a 20% return, whereas most SPACs include clauses allowing the sponsors to snatch cheap warrants with their grubby little hands because they are run by unapologetic money pigs.\n\n#An Aside About CЯyptocurrency\n\nI, like most of you, am way too stupid to understand how the fuck cЯypto actually works on a fundamental level, but I think it's pretty clear that the reason it has value at all is as a hedge against total economic societal collapse like we've been seeing most recently in places like Venezuela, which underwent inflation to the tune of nearly [***54 million percent***](https://venezuelaaldia.com/2019/05/28/banco-central-venezuela-hiperinflacion-2016/) between 2016 and 2019. Hey, what the fuck is that Juan Guiado guy up to? Oh, [he's a CIA sock puppet](https://thegrayzone.com/2019/01/29/the-making-of-juan-guaido-how-the-us-regime-change-laboratory-created-venezuelas-coup-leader/).\n\nIt is interesting to note that Stripe used to support cЯypto but eliminated that functionality, at least directly, back in [2018](https://imgur.com/crnp9iJ). Patrick Collison used to talk about cЯypto frequently and would say things like [this](https://imgur.com/OSbi8uz) (take note of the date) but has been largely silent on the issue for years. I think it's possible that he and his brother have come around to thinking that while cЯypto is a heady big brain idea, it's too inaccessible for dummies like you and me, who just want to buy a cup of coffee without paying $20 in transaction fees. They could be trying to build a vanguard that would make such a thing unnecessary for a functioning society, a system that continues to run on dollars, euros, yen, and yuan. \n\nThat, and the original idea for cЯypto came from [another part of the bowels of the Deep State, the NSA](http://groups.csail.mit.edu/mac/classes/6.805/articles/money/nsamint/nsamint.htm). You know, that thing Edward Snowden revealed as spying on everyone all the time with the support of [the tech giants](https://imgur.com/buIPP1S), but we're mostly all cool with because hey, cat videos and free porn!\n\nI do have some suspicions about Snowden, being a former CIA contractor and all, and his insistence that privacy-minded folks use Tor, which is and always has been a [project of the Department of Defense and intelligence agencies](https://www.wired.com/story/cia-sets-up-shop-on-tor/). If you, like me, used cЯypto to buy drugs on the dark net back in the heady days of 2015 when they were basically crime bucks, you're also probably on a watchlist somewhere at Langley.\n\n#Conclusion\n\nIf you've reached this point without your eyes rolling back in your head and starting to drool, I sincerely applaud you 👏👏👏. I hope that you've learned something new and are now thinking about what bigger brains than you and I have, like those of Bill Ackman and the Collisons, could be trying to put out there in the world, if a PSTH + Stripe union is truly in the cards.\n\nI do find it quite interesting to look at the list of [Restricted Businesses](https://stripe.com/restricted-businesses) at Stripe. It includes a lot of things that Ackman has historically and more recently placed in his sights as the targets of his wrath, like multi-level marketing schemes and pseudopharmaceuticals (Herbalife) and pornography (Pornhub versus the credit card companies). There's also things you can extrapolate outward from if you want to get real wacky and use looser definitions, like \"gambling\" and \"get rich quick schemes\" (i.e. Robinhood).\n\nThank you for reading my brain ejaculation, and always remember: Big Brother is watching you.\n\n\n**TLDR: Reining in the types of financial crime that have created this fucked up world we're all stuck in is imperative to building a future that is better and more equitable for people all around the world, not just in the United States. A merger of Stripe with PSTH could represent a gigantic leap forward for driving a sword into the heart of the beast of Big Capital. You could get in now instead of the alternative that the traditional IPO process provides, where the big institutions get the first crack at everything and leave table scraps for the rest of us to fight over. PSTH 🚀📈🚀📈🚀📈🚀📈**",
        "subreddit": "wallstreetbets",
        "title": "Once More Unto the Breach: The Unified Field Hypothesis of PSTH + Stripe (or possibly, the paranoiac ramblings of an undermedicated madman), Part 2",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kcm0r9/once_more_unto_the_breach_the_unified_field/",
        "created": 1607932741.0
    },
    {
        "author": "Professional_Feed314",
        "created_utc": 1607271339,
        "id": "k7wiga",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Can someone please tel me if this makes sense. The limit price was 0.41 but it filled at $0. I contacted Robinhood but it’s been 2 days and no response",
        "url": "https://i.redd.it/wcns6uhddl361.jpg",
        "created": 1607300139.0
    },
    {
        "author": "Inori92",
        "created_utc": 1607101261,
        "id": "k6osmw",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "HYAC is having the final merger meeting in 4 days, likely proceeded by ticker change around Thursday next week.\n\nThe last 2 SPAC mergers, QS on Nov.27, and LAZR since... Yesterday,  have popped in over ~150% gains in the week of the merger (including substantial dips). \n\nArko Holdings LTD. is an Israeli-based company which owns over 3000 retail stores in USA over 20+ states, and looking for further business expansion next year.\n\nMy DD is based off their positive financials and revenue growth over COVID which leaves more hope for the future of brick&amp;mortar stores, and they operate in convenience / groceries, which reminds me of $USFD (US Foods, spiking ~80% in the last 2 months), and a little of foreign companies like OZON (Russian e-commerce retailer similar to shop or amazon), gaining 20% in the last two weeks since IPO, due to foreigner companies doing US business/stock exchange.\n\nMost importantly, last 2 SPAC mergers in QS and LAZR, are looking fire hot right now in their valuation increases, while both are in the EV bubble, Arko is already well established, and for a company about to merge at NAV, they are grossly undervalued. Arko Holdings trades on the Tel Aviv Stock Exchange at ~76 USD, while remaining at ~10 USD NAV on NYSE.\n\nHYAC + Arko SPAC will likely pop in the coming days, get it in while you can.\n\nTLDR: New SPAC merger between HYAC and ARKO HOLDINGS sitting at NAV($10), very high upsides due to people on the EV train/bubble and not looking at other companies with established financials and growth - recent mergers in QS and LAZR indicate potential pops with low downsides. Get in while you can 🚀🚀🚀\n\nPOSITIONS: 1000 Shares @ $10.08",
        "subreddit": "wallstreetbets",
        "title": "HYAC - SPAC merger with Arko Holdings LTD - your next play",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k6osmw/hyac_spac_merger_with_arko_holdings_ltd_your_next/",
        "created": 1607130061.0
    },
    {
        "author": "VTX1800Riders",
        "created_utc": 1609271825,
        "id": "kmlla0",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "  HPQ FILES PROVISIONAL PATENT APPLICATION FOR SILICON BY- PRODUCT CREATED BY PUREVAPTM QRR AS ANODE MATERIAL FOR LITHIUM-ION BATTERIES\nPRELIMINARY BUT PROMISING RESULTS DEMONSTRATE A CAPACITY 3-4 TIMES GREATER THAN GRAPHITE FOR LITHIUM-ION BATTERIES\nMontreal, QC, Dec 29, 2020 – Innovative silicon solutions provider HPQ Silicon Resources Inc. (“HPQ” or “the Company”) (TSX-V: HPQ; FWB: UGE; Other OTC : URAGF), is pleased to inform shareholders that promising results from electrochemical performance tests made with silicon- based by-products manufactured by the GEN2 PUREVAPTM Quartz Reduction Reactor (“QRR”) motivated the company to file a provisional patent application regarding their manufacturing, assembly and usage as anode materials for Lithium-ion batteries.\nThe patent application follows the completion of a series of tests made on the material produced by the GEN2 PUREVAPTM QRR at the Centre Énergie Matériaux Télécommunications (EMT) of the INRS by Professor Lionel ROUÉ under an NSERC Engage Grant and a NSERC Engage plus Grant.\nPUREVAPTM QRR SILICON BY-PRODUCTS: A SUPERIOR ANODE MATERIAL THAN GRAPHITE\nAlthough preliminary, the results obtained are more than promising since the silicon-based by- product made with the Gen2 PUREVAPTM QRR maintained a gravimetric capacity ≥ 1,200 mAh/g for more than 100 charge/discharge cycles, a capacity 3-4 times greater than that of graphite currently used in commercial Li-ion batteries. This material is also promising in terms of high- speed performance. (See Figure 1 below)\nFigure 1. (a) Comparing electrode performance of HPQ Gen2 PUREVAPTM by-product versus graphite electrodes during cycling tests and (b) power response versus electrodes made with comparable silicon (Si).\n“This is another demonstration of our multi-prong approach to becoming a key silicon based material provider for the battery industry and beyond. The unique capabilities of the PUREVAPTM Nano Silicium Reactor (Si) (\"NSiR\") will enable us to fully exploit the potential of the Silicon and its by-products manufactured by the PUREVAPTM Quartz Reduction Reactor (\"RRQ\")” said Bernard Tourillon, President and CEO HPQ Silicon. “Silicon’s potential to meet energy storage demand is\n      1 | Page\n\n  undeniable, generating massive investments, and serious industry interest. We are very confident that demand for the Silicon materials we will produce, with our low-cost scalable processes, will be high demand by batteries and EV manufacturers in this renewable energy revolution.”\nAbout HPQ Silicon\nHPQ Silicon Resources Inc. (TSX-V: HPQ) is a Canadian Innovative Silicon Solutions Provider. Silicon (Si), also known as silicon metal, is one of today’s key strategic materials needed for the\ndecarbonization of the economy and the Renewable Energy Revolution (“RER”).\nSilicon is the most abundant element in earth’s crust but does not exist in its pure state and must be extracted from quartz (SiO2) in what has historically been a capital and energy intensive process. HPQ is building a portfolio of silicon–based products using innovative scalable processes. The target objective is to produce high value speciality Silicon products using technologies that will reduce energy consumption, GHG’s, and carbon footprint.\nWorking with PyroGenesis Canada Inc. (TSX: PYR), a high-tech company that designs, develops, manufactures and commercializes plasma - based processes, HPQ is developing:\n● The PUREVAPTM “Quartz Reduction Reactors” (QRR), an innovative process (patent pending), which will permit the one step transformation of quartz (SiO2) into high purity silicon (Si) at reduced costs, energy input, and carbon footprint that will propagate its considerable renewable energy potential.\n&gt; HPQ believes it will become the lowest cost (Capex and Opex) producer of silicon (Si) and high purity silicon metal (3N – 4N Si).\n● Through its 100% owned subsidiary HPQ NANO Silicon Powders Inc, the PUREVAPTM Nano Silicon Reactor (NSiR), a new proprietary process that can use different purities of silicon (Si) as feedstock, to make a wide range of nano/micro spherical powders of difference sizes and nanowires.\n&gt; HPQ believes it can also become the lowest cost manufacturer of spherical Si nanopowders and silicon-based composites needed by manufacturers of next-generation lithium-ion batteries.\n&gt; During the coming months, spherical Si nanopowders and nanowires silicon-based composite samples requested by industry participants and research institutions’ will be produced using PUREVAPTM SiNR.\nHPQ is also working with industry leader Apollon Solar of France to:\n● Use their patented process and develop a capability to produce commercially porous silicon (Si) wafers and porous silicon (Si) powders.\n&gt; The collaboration will allow HPQ to become the lowest cost producer of porous silicon wafers for all-solid -state batteries and porous silicon powders for Li-ion batteries.\n&gt; Develop the hydrogen generation potential of Silicon nanopowders for use with the GennaoTM system.\n      2 | Page\n[HPQ NANO PATENT PENDING](https://hpqsilicon.com/wp-content/uploads/2020/12/HPQ_INRS_PATENT-DEC_29_2002_Ver_CL3.pdf)\n  &gt; Commercialize, exclusively in Canada, and non-exclusive in the U.S.A., the GennaoTM H2 system and the chemical powders required for the hydrolysis production of Hydrogen (\"H2\").\nThis News Release is available on the company's CEO Verified Discussion Forum, a moderated social media platform that enables civilized discussion and Q&amp;A between Management and Shareholders.\nDisclaimers:\nThe Corporation’s interest in developing the PUREVAPTM QRR and any projected capital or operating cost savings associated with its development should not be construed as being related to the establishing the economic viability or technical feasibility of any of the Company’s Quartz Projects.\nThis press release contains certain forward-looking statements, including, without limitation, statements containing the words \"may\", \"plan\", \"will\", \"estimate\", \"continue\", \"anticipate\", \"intend\", \"expect\", \"in the process\" and other similar expressions which constitute \"forward- looking information\" within the meaning of applicable securities laws. Forward-looking statements reflect the Company's current expectation and assumptions and are subject to a number of risks and uncertainties that could cause actual results to differ materially from those anticipated. These forward-looking statements involve risks and uncertainties including, but not limited to, our expectations regarding the acceptance of our products by the market, our strategy to develop new products and enhance the capabilities of existing products, our strategy with respect to research and development, the impact of competitive products and pricing, new product development, and uncertainties related to the regulatory approval process. Such statements reflect the current views of the Company with respect to future events and are subject to certain risks and uncertainties and other risks detailed from time-to-time in the Company's on- going filings with the security’s regulatory authorities, which filings can be found at www.sedar.com. Actual results, events, and performance may differ materially. Readers are cautioned not to place undue reliance on these forward-looking statements. The Company undertakes no obligation to publicly update or revise any forward-looking statements either as a result of new information, future events or otherwise, except as required by applicable securities laws.\nNeither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.\nFor further information contact\nBernard J. Tourillon, Chairman, President and CEO Tel (514) 907-1011 Patrick Levasseur, Vice-President and COO Tel: (514) 262-9239 http://www.hpqsilicon.com Email: Info@hpqsilicon.com",
        "subreddit": "pennystocks",
        "title": "In a Sea of Red, Green. EV Green",
        "url": "https://www.reddit.com/r/pennystocks/comments/kmlla0/in_a_sea_of_red_green_ev_green/",
        "created": 1609300625.0
    },
    {
        "author": "MammothConcept4",
        "created_utc": 1609185277,
        "id": "klxmdz",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Someone please tel me what an after-tax is and why Roth doesn’t get taxed at withdrawal. Shouldnt any deposits already be after-tax from my salary? \n\nAlso, if i make an LLC as the single owner and employee, with matching 401k contribution to the LLC, does that mean the LLC gets taxed 15% on withdrawal unlike ordinary tax brackets that a traditional IRA would get taxed at age 60? Does the LLC have to be open until the owner is 60? All of this is legal just intensively complicated. Someone please elaborate. Thank you thank you. \n\nNOTE: I’m 25 with 2 individual brokerage accounts and 1 traditional IRA already.",
        "subreddit": "investing",
        "title": "Roth IRA vs traditional IRA vs LLC Solo 401k",
        "url": "https://www.reddit.com/r/investing/comments/klxmdz/roth_ira_vs_traditional_ira_vs_llc_solo_401k/",
        "created": 1609214077.0
    },
    {
        "author": "0fficerDoofy",
        "created_utc": 1608748024,
        "id": "kiycyj",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "pennystocks",
        "title": "FRSX +112% today on TASE, Tel Aviv Stock Exchange, FRSX's home country.",
        "url": "https://i.redd.it/1h8sbtdbcz661.jpg",
        "created": 1608776824.0
    },
    {
        "author": "Newyorkntilikina",
        "created_utc": 1610471564,
        "id": "kvvuce",
        "num_comments": 54,
        "num_crossposts": 0,
        "selftext": "Apart from ETFs, I'm curious what everyone's favorite stocks are for each sector. There are 11 sectors total and I feel like I'm heavily swayed towards Technology and lack stocks in certain sectors. I'll list my top holdings for each sectors and please list picks for sectors I'm lacking.\n\n**Technology**\n\n* MSFT\n* AAPL\n* ADSK\n\n**Consumer Cyclicals**\n\n* NKE\n* CHWY\n\n**Communication Services**\n\n* SE\n* PINS\n* DIS\n\n**Industrials**\n\n* UPWK\n* RTX\n* BA\n\n**Financial**\n\n* LMND\n* PYPL\n* JPM\n\n**Consumer Defensive**\n\n* WMT\n\nI don't have any stock in the following sectors and would like advice: **Energy, Basic Material, Utilities, Healthcare, and Real Estate.**",
        "subreddit": "StockMarket",
        "title": "Diversify portfolio into every sector - need picks",
        "url": "https://www.reddit.com/r/StockMarket/comments/kvvuce/diversify_portfolio_into_every_sector_need_picks/",
        "created": 1610500364.0
    },
    {
        "author": "Sublime_7365",
        "created_utc": 1609652728,
        "id": "kpesxt",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "Started investing recently and believe I may be over diversified. Bullish on these tickers but given the number of positions in the portfolio I only have a cursory understanding of those businesses so I'm trying to trim the number of stocks I own - going for quality over quantity. This portfolio beats the SP when I backtested my purchases using SP instead of these tickers but maybe I can do better if I get rid of the gain diluting stocks? Looking for suggestions on what should go and feel free to suggest other positions not on this list that may be better than some of the positions I already have for long term growth. Looking for more genomics exposure as well (maybe ARGK but not a fan of higher expense ratios). Thanks!\n\nPositions:\n\nFB\n\nAMZN\n\nSQ\n\nSE\n\nFVRR\n\nTSLA\n\nSBE\n\nAAPL\n\nSEDG\n\nNET\n\nCRWD\n\nZM\n\nNVDA\n\nU\n\nADSK\t\n\nLMND\n\nCRSP\n\nPINS\n\nNIO\n\nPLTR\n\nSHOP\t\n\nDOCU\t\n\nMSFT\t\n\nDIS\n\nLUV\n\nAMD\n\nBE\n\nCOUP\n\nBA\n\nNEE\n\nFUBO\n\nFSLY\n\nOKTA\n\nPLUG\n\nDDOG\n\nABNB\n\nCRNC\n\nOSS\n\nZBRA\n\nCHGG\n\nAAL\n\nRGEN\n\nGILD",
        "subreddit": "stocks",
        "title": "Trim my portfolio?",
        "url": "https://www.reddit.com/r/stocks/comments/kpesxt/trim_my_portfolio/",
        "created": 1609681528.0
    },
    {
        "author": "simplevalue",
        "created_utc": 1609649285,
        "id": "kpdy03",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Hi,\n\nI am looking for old investment letters that highlight investments in companies (before they became multibaggers). The idea is to reverse engineer the thesis and see how it played out / what they saw that the market didn't.\n\nThe companies are:\n\n* Monster Beverage Corporation (MNST)\n* Booking Holdings (BKNG)\n* Amazon (AMZN)\n* Boston Beer Company (SAM)\n* Nvidia Corporation (NVDA)\n* Activision Blizzard (ATVI)\n* Ross Stores (ROST)\n* Edward Lifesciences (EW)\n* [Stamps.com](https://Stamps.com) (STMP)\n* Autodesk (ADSK)\n* Copart, Inc. (CPRT)\n* Fair Isaac Corporation (FICO)\n* Moody's Corporation (MCO)\n* UnitedHealth Group (UNH)\n* Mastercard (MA)\n* Visa (V)\n* Adobe (ADBE)\n* Lockheed Martin (LMT)",
        "subreddit": "SecurityAnalysis",
        "title": "Looking for Old Investment Letters on Companies (Case Studies)",
        "url": "https://www.reddit.com/r/SecurityAnalysis/comments/kpdy03/looking_for_old_investment_letters_on_companies/",
        "created": 1609678085.0
    },
    {
        "author": "SorenLantz",
        "created_utc": 1609528327,
        "id": "kogze1",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "# The Metric\n\nI recently had an idea for a metric to be used to find hot stocks. I call the metric \"Price Elasticity\" and it is comprised of two numbers: upturn elasticity and downturn elasticity.\n\n* Upturn elasticity: the average % change in a stock on market up days\n* Downturn elasticity: the average % change in a stock on market down days\n\nUsing these numbers and a few additional basic requirements (like positive EPS and at least 31 days of trading history), my screener found 99 stocks out of about 5700 searched that have good to exceptional price elasticities. (the list of these stocks is linked below and also [here](https://drive.google.com/file/d/1NsbQ42oo6i3kYUWf96Tw5yK3LD04L1CR/view?usp=sharing))\n\n# What makes for good price elasticity numbers?\n\nI made two classifications for stocks with good price elasticity data.\n\n1. **Irrational** \\- Upturn elasticity &gt; 1, Downturn elasticity &lt; 0\n2. **Responsible** \\- Upturn elasticity &gt; 1, 0 &lt; Downturn elasticity &lt; 1\n\nWith any stock I want an upturn elasticity &gt; 1, meaning that the stock tends to move higher than the market when the market goes up. The \"Irrational\" classification gets its name because if a stock's downturn elasticity is negative this means the stock, on average, moves up when the market goes down. So a stock that moves higher than the market when the market goes up and also moves up when the market goes down is classified as \"Irrational\". These stocks tend to have less trading history and are very volatile.\n\nThen there are \"Responsible\" stocks which like Irrational stocks move higher than the market when the market goes up. Unlike Irrational stocks though, Responsible stocks move lower when the market moves lower. The reason I still consider them good is because their downturn elasticity is &lt;1 and &gt;0, meaning that, while they do move down with the market, they move down to a lesser degree.\n\nSome popular stocks picked up by the screener include: AMD, ADSK, ETSY, NFLX, NVDA, SHOP and TSLA. Many of the other stocks have lower market caps and could be interesting value / growth plays given they too made the cut.\n\n# Link to the 99 stocks found:\n\n[https://drive.google.com/file/d/1NsbQ42oo6i3kYUWf96Tw5yK3LD04L1CR/view?usp=sharing](https://drive.google.com/file/d/1NsbQ42oo6i3kYUWf96Tw5yK3LD04L1CR/view?usp=sharing)\n\n&amp;#x200B;\n\nI have no idea if there is merit to my Price Elasticity metric (or if it has already been \"invented\") but it was a fun project and the screener found some interesting stocks I would have never discovered otherwise. The validity of the metric is entirely based on the assumption that past trends indicate future performance, and for those looking to beat the market the trends of these 99 stocks should be very appealing. I made the screener using Python3 and TD Ameritrade's API. Of the stocks in that list I am currently holding AMD, CAMT, EPAM, and NLOK.",
        "subreddit": "stocks",
        "title": "My Custom Stock Screener Findings",
        "url": "https://www.reddit.com/r/stocks/comments/kogze1/my_custom_stock_screener_findings/",
        "created": 1609557127.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1609889975,
        "id": "kraxx0",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Tuesday, January 5, 2021**\n\nStocks rose Tuesday as market participants await results from Georgia’s runoff election and continue to monitor rising coronavirus cases in the US and abroad. \n\nSince Novemeber, market participants have closely monitored developments around Georgia’s runoff Senate election, which is set to decide the balance of power in the Senate. In other words, whichever party wins the election in Georgia will have the majority position in the Senate. Currently, Republicans maintain a narrow majority in the chamber, with 50 seats to the Democrat’s 48 when excluding Georgia. If the Democrats win both seats in Georgia they will have a majority because, in the case of a tie, the Vice-President is able to cast the deciding vote. \n\nThe market favors a divided government because it ensures the regulatory environment will remain little changed. Under a Republican-controlled Senate, the incoming Biden administration will likely be unable to advance many of its campaign promises, including raising corporate taxes and minimum wages, and unveiling reforms around education, housing, and climate change, which could all impact various pockets of the market. However, under a unified Democratic government, Congress is likely to pass a larger additional stimulus package to further support the economy in the near-term.  \n\nSadly, new coronavirus cases in the US hit a staggering one-day record of nearly 300,000 over the weekend, according to Johns Hopkins University, most likely attributed to the increase in travel during the holiday period. Despite repeated warnings from health officials about the dangers of traveling, in the last two weeks of December, the TSA reported more than 7 million people were screened at airport security checkpoints. There are now nearly 21 million cases, 128,000 hospitalizations, and 352,000 deaths attributed to the virus in the US alone. Hospital systems across the country are quickly becoming overwhelmed. In California, officials say ICU units in at least two regions are filled to practical capacity. And because of resource limitations, Los Angeles County ambulance crews have been instructed not to transport any patient in blunt traumatic or nontraumatic cardiac arrest if they can't first be resuscitated in the field.\n\nAs of Monday morning, the first doses of a COVID-19 vaccine had been given to more than 4.5 million people in the U.S., far below the Trump Administration promise of vaccinating 20 million Americans by years-end. Dr. Anthony Fauci, said President-elect Joe Biden’s goal of ramping up distribution to vaccinate 100 million people in his first 100 days was a “realistic goal,” according to an interview with ABC on Sunday.\n\nIn the United Kingdom, Prime Minister Boris Johnson ordered a national lockdown through at least mid-February in an effort to stop the spread of the new, more-infectious COVID-19 strain detected a few weeks ago. He said: “Our hospitals are under more pressure from COVID than at any time since the start of the pandemic. It’s clear that we need to do more together to bring this new variant under control while our vaccines are rolled out.” Under the lockdown, people will only be allowed to leave their homes for a limited number of reasons, including shopping for essentials, going to work if they cannot work from home, exercising, seeking medical advice and providing care. Schools are also shutting down.\n\n**Highlights**\n\n* There were conflicting reports today, with some outlets saying Jack Ma, founder of Alibaba (BABA) and Ant Group, is missing after criticizing the Chinese government while others say he is fine, just “laying low”.\n* Crude oil prices topped $50 per barrel for the first time since February, a remarkable comeback given at one point oil was worth negative $37.\n* Amazon (AMZN) purchased 11 planes after confirming it has plans to build its own fleet. Previously the company used leased aircrafts.\n* After falling more than 40% yesterday, QuantumScape (QS) stock rose around 20% today. Absolutely crazy price action\n* Electric cars rise to a record 54% market share in Norway. Seems everywhere in the world people are buying more electric vehicles.\n* According to a report by Bloomberg, Apple (AAPL) supplier Foxconn Technology Group signed a strategic cooperation deal with embattled Chinese electric-vehicle startup Byton with aims to produce a car by Q1 of 2022.\n* Autodesk (ADSK) target raised by Keycorp from $310 to $345 at Overweight. Stock currently around $296.\n* Arvinas (ARVN) target raised by Cantor Fitzgerald from $66 to $121 at Overweight. Stock  currently around $83.\n* HCA Healthcare (HCA) target raised by Deutsche Bannk from $150 to $180 at Buy. Stock currently around $163.\n* Micron Technology (MU) with two target raises. Stock currently around $74.\n   * Deutsche Bank from $75 to $85 at Buy\n   * Royal Bank of Canada from $57 to $83  at Outperform\n* Sunnova Energy (NOVA) target raised by Goldman Sachs from $45 to $60 at Buy. Stock currently around $45.\n* Nevro (NVRO) target raised by Robert W. Baird from $180 to $200 at Outperform. Stock currently around $170.\n* SVB Financial Group (SIVB) wtih two, bullish target raises. Stock currently around $387.\n   * Royal Bank of Canada from $320 to $437 Outperform\n   * Raymond James from $225 to $400 Outperform\n* Synopsys (SNPS) target raised by Keycorp from $265 to $290 at Overweight. Stock currently around $254.\n* Welbilt (WBT) target raised by Keycorp from $11 to $18 at Overweight. Stock currently around $12.50.\n\n“You get in life what you have the courage to ask for.” - Oprah Winfrey",
        "subreddit": "StockMarket",
        "title": "Daily Market Recap - Tuesday, January 5, 2020",
        "url": "https://www.reddit.com/r/StockMarket/comments/kraxx0/daily_market_recap_tuesday_january_5_2020/",
        "created": 1609918775.0
    },
    {
        "author": "Newyorkntilikina",
        "created_utc": 1610470968,
        "id": "kvvmsc",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Apart from ETFs, I'm curious what everyone's favorite stocks are for each sector. There are 11 sectors total and I feel like I'm heavily swayed towards Technology and lack stocks in certain sectors. I'll list my top holdings for each sectors and please list picks for sectors I'm lacking.\n\n**Technology**\n\n* MSFT \n* AAPL\n* ADSK\n\n**Consumer Cyclicals**\n\n* NKE\n* CHWY\n\n**Communication Services**\n\n* SE\n* PINS\n* DIS\n\n**Industrials**\n\n* UPWK\n* RTX\n* BA\n\n**Financial**\n\n* LMND\n* PYPL\n* JPM\n\n**Consumer Defensive**\n\n* WMT\n\nI don't have any stock in the following sectors and would like advice: **Energy, Basic Material, Utilities, Healthcare, and Real Estate.**",
        "subreddit": "investing",
        "title": "Diversify portfolio into every sector - need picks",
        "url": "https://www.reddit.com/r/investing/comments/kvvmsc/diversify_portfolio_into_every_sector_need_picks/",
        "created": 1610499768.0
    },
    {
        "author": "simplevalue",
        "created_utc": 1609649315,
        "id": "kpdyaa",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": " Hi,\n\nI am looking for old investment letters that highlight investments in companies (before they became multibaggers). The idea is to reverse engineer the thesis and see how it played out / what they saw that the market didn't.\n\nThe companies are:\n\n* Monster Beverage Corporation (MNST)\n* Booking Holdings (BKNG)\n* Amazon (AMZN)\n* Boston Beer Company (SAM)\n* Nvidia Corporation (NVDA)\n* Activision Blizzard (ATVI)\n* Ross Stores (ROST)\n* Edward Lifesciences (EW)\n* [Stamps.com](https://stamps.com/) (STMP)\n* Autodesk (ADSK)\n* Copart, Inc. (CPRT)\n* Fair Isaac Corporation (FICO)\n* Moody's Corporation (MCO)\n* UnitedHealth Group (UNH)\n* Mastercard (MA)\n* Visa (V)\n* Adobe (ADBE)\n* Lockheed Martin (LMT)",
        "subreddit": "investing",
        "title": "Looking for Old Investment Letters for the Following Companies",
        "url": "https://www.reddit.com/r/investing/comments/kpdyaa/looking_for_old_investment_letters_for_the/",
        "created": 1609678115.0
    },
    {
        "author": "MuzGotTheBooze",
        "created_utc": 1610913833,
        "id": "kzdrbg",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "PBW, ICLN, QCLN, TAN, FAN, and some other clean energy stocks have been mentioned a lot on this sub, but I haven’t seen any discussion about $PZD. Its a cleantech portfolio with top 5 holdings: \n\n1. ENPH (4.61%)\n2. SEDG (3.74%)\n3. SGRE.BC (3.39%)\n4. VWS (3.35%)\n5. ADSK (3.11%) \n\nIt has an average of 17-19% overlap with the other ETFS so needless to say its not a re-skin of them. I know the other ETFs had a crazy year but looking at growth other than 2020, the ETF did outperform them (especially PBW, it was practically dead till 2020). It doesn’t rely on EV companies such as NIO and TSLA so thats something. \n\nAnyways, would like to hear from others, I’m personally thinking doing a split between $PBW and $PZD.",
        "subreddit": "stocks",
        "title": "$PZD (Powershares Cleantech Portfolio)",
        "url": "https://www.reddit.com/r/stocks/comments/kzdrbg/pzd_powershares_cleantech_portfolio/",
        "created": 1610942633.0
    },
    {
        "author": "MuzGotTheBooze",
        "created_utc": 1609608437,
        "id": "kp1h8a",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "PBW, ICLN, QCLN, TAN, FAN, and some other clean energy stocks have been mentioned a lot on this sub, but I haven’t seen any discussion about $PZD. Its a cleantech portfolio with top 5 holdings: \n\n1. ENPH (4.61%)\n2. SEDG (3.74%)\n3. SGRE.BC (3.39%)\n4. VWS (3.35%)\n5. ADSK (3.11%) \n\nIt has an average of 17-19% overlap with the other ETFS so needless to say its not a re-skin of them. I know the other ETFs had a crazy year but looking at growth other than 2020, the ETF did outperform them (especially PBW, it was practically dead till 2020). It doesn’t rely on EV companies such as NIO and TSLA so thats something. \n\nAnyways, would like to hear from others, I’m personally thinking doing a split between $PBW and $PZD.",
        "subreddit": "stocks",
        "title": "$PZD (PowerShare CleanTeach Portfolio)",
        "url": "https://www.reddit.com/r/stocks/comments/kp1h8a/pzd_powershare_cleanteach_portfolio/",
        "created": 1609637237.0
    }
]