[
    {
        "author": "ld_southfl",
        "created_utc": 1596389099,
        "id": "i2fue2",
        "num_comments": 50,
        "num_crossposts": 0,
        "selftext": "Microchip is a semiconductor company out of Arizona with a Mkt. Cap of about $26 Billion. They make chips for a bunch of products like Cyber Security, Wireless Products, and Telecommunications. The thing is that they earnings on 08/04 Tuesday after hours. It is very obvious that are going to beat earnings. Why? Because look at the rest of the industry: Qualcomm, Intel, AMD, Qorvo, and IBM have all destroyed earnings. And since Intel just told everyone that they're too retarded to even make potato chips all the smaller time semiconductor competitors are making bank, example: AMD and QCOM. \n\n&amp;#x200B;\n\nMicrochip isn't just your run of the mill small back water company. They actually make acquisitions of other chip companies and use their intellectual property to increase the quality and market share of their own chips. Microchip was found in 1989 and has since made 16 acquistions!!! \n\nYou may, for some reason, say that only big boy chip companies are gonna beat earnings. Well if you don't believe me think about the industries that depend on Microchip for their needs: online educational servicing companies, cloud servicing companies, cyber security companies, telecommunications companies, and just software/tech companies in general. What the hell do we already know about these industries from earnings season? We know they absolutely massacred earnings estimates as everything during COVID has gone tech. Yes, the age of actual industry is dead. Now there are only tech companies that get pumped because of sky high demand (looking at you Apple) and Amazon that sells random shit and still has a tech company valuation.\n\n&amp;#x200B;\n\nOh and you know what's awesome because we have all this knowledge? MCHP is expected to post $1.43 EPS on tuesday, but last year on this quarter they posted $1.41 EPS. What a fucking joke, we should expect at least 40-50% growth in that number from COVID induced semiconductor demand. Not to mention, I think MCHP is gaining market share and could be a big player in a few years in the semiconductor industry. \n\nYou might be hesitant because of my last post on $TER, a chip supplier that many people played incorrectly. I say to you, fuck you. I made money on that play because I sold directly at market open after they destroyed earnings like my data said they would. So if you feel even the slightest FOMO look at these charts from last week: QCOM, QRVO, and AMD; and then tell me what you think MCHP (the same industry) will do!!!\n\n&amp;#x200B;\n\nTLDR; MCHP $107c 08/07",
        "subreddit": "wallstreetbets",
        "title": "$MCHP is the next $QCOM, 300% gain potential after earnings",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i2fue2/mchp_is_the_next_qcom_300_gain_potential_after/",
        "created": 1596417899.0
    },
    {
        "author": "mrpyrotec89",
        "created_utc": 1596666352,
        "id": "i4fbsh",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "MAXR, QRVO, INSG, NPTN\n\nWhat I've been doing is buying these and then selling them right before the the earnings release. However i kept MAXR because news of that company killing it quarter leaked. Anyways i hope that MAXR will hit 25 tomorrow.\n\nMAXR call $22.5 09/18",
        "subreddit": "wallstreetbets",
        "title": "anybody get in on this 5G wave?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i4fbsh/anybody_get_in_on_this_5g_wave/",
        "created": 1596695152.0
    }
]