[
    {
        "author": "Grymmful",
        "created_utc": 1602687207,
        "id": "jb25lm",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "[https://ca.finance.yahoo.com/news/hpq-proprietary-nano-silicon-manufacturing-130000687.html](https://ca.finance.yahoo.com/news/hpq-proprietary-nano-silicon-manufacturing-130000687.html)\n\nI've decided I'm going to stop playing and build a huge stake in this stock starting today.  Greed has screwed me too many times trying to follow FOMO. When December hits I expect multiple clients lined up for the groundbreaking tech in the battery field.",
        "subreddit": "pennystocks",
        "title": "$Hpq.v Proprietary Nano Silicon Manufacturing Process",
        "url": "https://www.reddit.com/r/pennystocks/comments/jb25lm/hpqv_proprietary_nano_silicon_manufacturing/",
        "created": 1602716007.0
    },
    {
        "author": "ninkorn",
        "created_utc": 1603981625,
        "id": "jkb058",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "1) What is Synaptics?\n\nFor almost 35 years, Synaptics has been focused on how people interact with devices. The company has created technology for touchscreens, touchpads, and fingerprint readers, and in recent years has focused on displays and touchscreens used in mobile phones. Synaptics makes parts used in Apple (AAPL) iPhones, Google Home speakers, and automotive touchscreens, among other applications.\n\nSynaptics’ fortunes flagged in recent years, hurt by a drifting corporate mission and growing competition from Asia. Revenue in the June 2020 fiscal year was $1.33 billion, about 10% below the year-earlier level, marking the third straight year of declining revenue. Non-GAAP net income was $5.95 a share, up from $4 in fiscal 2019, reversing four consecutive years of declining profits.\n\n\n2) Who is Michael Hurlston?\n\nThis savior became SYNA’s CEO about a year ago. When Michael Hurlston became CEO of Synaptics a year ago, the chip seller was a “bag of parts,” he says. “Job No. 1 was to make the most out of each part of the portfolio.”\n\nHurlston, 53, has done that, and more, chopping costs, shedding weak operations, making smart acquisitions, and burnishing the financial outlook of the San Jose, Calif.–based company, which makes components used in human-machine interface applications. So far, investors like what they see: Synaptics’ stock (ticker: SYNA) has rallied almost 150% in the past 12 months, reversing the prior four years’ losses. More gains could lie ahead, as Hurlston and his team continue to restructure and grow the business.\n\nHurlston seems a good choice to move things forward. Most recently he was CEO of Finisar, an optical-networking component company that he sold to II-VI (pronounced “two six”) for $3.2 billion within a year of his arrival. Before that, he was senior vice president for mobile, wireless, and connectivity products at Broadcom. More on that in a moment.\n\n“When I arrived here, the company was undermanaged,” Hurlston said in a Zoom interview from his office. “There just wasn’t a lot of rigor around anything we did—no regular engineering reviews, or budget reviews, or general tracking of progress.”\n\nHurlston restructured the product portfolio, selling a business that makes integrated touch and display chips for LCD phones to a Chinese private-equity firm. Most high-end phones now use OLED displays, with LCDs used primarily in lower-end devices, he noted. Competition was fierce, and margins were ebbing.\n\nTwo acquisitions then followed, both closing in July. Synaptics bought DisplayLink, a Palo Alto–based company with a lock on the market for components used in universal docking stations, for $305 million in cash. “They’re the only company that has been able to figure this out,” Hurlston said.\n\nThe transaction was immediately accretive to earnings.\n\nSynaptics also spent $250 million for Broadcom’s wireless Internet of Things business, which includes Wi-Fi, Bluetooth, and GPS technologies. Hurlston knew that business intimately: He used to run it. “We felt like there were a lot of places where we needed wireless assets,” he said, citing video and audio products and wireless docking stations. “It’s a deal that only we could have done. My old team was involved, and some of them came over here.”\n\nHe sees applications in wearables, surveillance cameras, and video set-top boxes.\n\n\n3) Valuation?\n\nAt a recent $78~/share, Synaptics trades for just over two times estimated revenue and less than 13 times expected profit for the June-2021 fiscal year. Competitors, such as Texas Instruments (TXN), Analog Devices (ADI), and Microchip Technology (MC HP ), fetch five to 10 times current-year revenue, suggesting Synaptics is underappreciated in every sense of the word.\n\nFurthermore, when SYNA beat their numbers in the last earnings call (and raised Q1 guidance), the stock jumped significantly and briefly touched 52 week high ($90~/share) before the stock retreated along with the market over the last 3 months. Fundamentally, nothing has changed about this company’s future prospects. They purchased IoT portfolio from Broadcom (AVGO) and they are focusing on high margin segments and once again, this stock is ripe for another beat when they report on Nov 5th. It is not out of the question that the stock will continue to march over the next 12 months and if you missed out on AMD/NVDA and other semiconductor play, this is the stock that you have been looking for.\n\nLastly, per Michael Hurlston who has a track record of turning around companies like Finisar, Synaptics had become a “$1 billion revenue company in the body of a $2 billion revenue company,” with an inefficient structure. For example, its PC business had a core design center in Taiwan’s capital city of Taipei, and offices in Armenia; Hyderabad, India; and the U.S. He closed all but the Taipei office, located near PC design operations for customers HP Inc. and Dell. “I did that kind of thing across the business,” he said. The result: Quarterly operating expenses fell to about $80 million from $110 million, and head count dropped to 1,200 from 1,700.\n\nMeanwhile, Synaptics’ gross profit margins have risen in the past year to nearly 50% from under 40%. The company is configured, he says, to grow revenue in the 4% to 6% range, with profits rising faster as margins expand. Analysts expect Synaptics to earn $6.49 a share this year on revenue of $1.3 billion. KeyBanc Capital Markets analyst John Vinh thinks that earnings could top $8 a share in fiscal 2022. The stock “looks inexpensive with multiple ways to outperform,” he recently wrote.\n\n4) Street Coverage\n\nPaul Wick, a portfolio manager with Columbia Threadneedle Investments, owns more than 10% of Synaptics’ shares in the Columbia Seligman Communications &amp; Information fund (SLMCX), which he has run for more than 30 years. He’s a big Hurlston fan, and has been impressed with the new focus on growth and operating efficiency. Wick recalls how Hurlston was astonished by the huge number of fabs and test and assembly houses Synaptics was using. “They weren’t getting volume discounts from anyone,” Wick says. “They were able to reduce the number of vendors and get better pricing.”\n\n8/6 - Raised to Overweight by KeyBanc\n\n8/6 - Maintained at Buy by Needham\n\n8/6 - Maintained at Buy by Rosenblatt\n\n8/6 - Maintained at Market Buy by BMO Capital",
        "subreddit": "wallstreetbets",
        "title": "[SYNA] Earnings Play - Synaptics (They report Nov 5th)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jkb058/syna_earnings_play_synaptics_they_report_nov_5th/",
        "created": 1604010425.0
    },
    {
        "author": "drew1027",
        "created_utc": 1602973743,
        "id": "jd4kox",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Thoughts on HPQ? HPQ balance sheet isn’t bad. It’s a small cap tech stock, so it’s not overvalued. Also divided yield is 3.6%. \nIt’s a hardware stock, so people would be buying computers to use for working at home, along with printers and ink too.",
        "subreddit": "stocks",
        "title": "Thoughts on HPQ",
        "url": "https://www.reddit.com/r/stocks/comments/jd4kox/thoughts_on_hpq/",
        "created": 1603002543.0
    },
    {
        "author": "ninkorn",
        "created_utc": 1603984595,
        "id": "jkbwfn",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Synaptics is scheduled to report on November 5th (Thursday). It is an undervalued stock, currently around $78/share. \n\n&amp;#x200B;\n\n**1) What is Synaptics?**\n\n&amp;#x200B;\n\nFor almost 35 years, Synaptics has been focused on how people interact with devices. The company has created technology for touchscreens, touchpads, and fingerprint readers, and in recent years has focused on displays and touchscreens used in mobile phones. Synaptics makes parts used in Apple (AAPL) iPhones, Google Home speakers, and automotive touchscreens, among other applications.\n\n&amp;#x200B;\n\nSynaptics’ fortunes flagged in recent years, hurt by a drifting corporate mission and growing competition from Asia. Revenue in the June 2020 fiscal year was $1.33 billion, about 10% below the year-earlier level, marking the third straight year of declining revenue. Non-GAAP net income was $5.95 a share, up from $4 in fiscal 2019, reversing four consecutive years of declining profits.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**2) Who is Michael Hurlston?**\n\n&amp;#x200B;\n\nThis savior became SYNA’s CEO about a year ago. When Michael Hurlston became CEO of Synaptics a year ago, the chip seller was a “bag of parts,” he says. “Job No. 1 was to make the most out of each part of the portfolio.”\n\n&amp;#x200B;\n\nHurlston, 53, has done that, and more, chopping costs, shedding weak operations, making smart acquisitions, and burnishing the financial outlook of the San Jose, Calif.–based company, which makes components used in human-machine interface applications. So far, investors like what they see: Synaptics’ stock has rallied almost 150% in the past 12 months, reversing the prior four years’ losses. More gains could lie ahead, as Hurlston and his team continue to restructure and grow the business.\n\n&amp;#x200B;\n\nHurlston seems a good choice to move things forward. Most recently he was CEO of Finisar, an optical-networking component company that he sold to II-VI for $3.2 billion within a year of his arrival. Before that, he was senior vice president for mobile, wireless, and connectivity products at Broadcom. More on that in a moment.\n\n&amp;#x200B;\n\n“When I arrived here, the company was undermanaged,” Hurlston said in a Zoom interview from his office. “There just wasn’t a lot of rigor around anything we did—no regular engineering reviews, or budget reviews, or general tracking of progress.”\n\n&amp;#x200B;\n\nHurlston restructured the product portfolio, selling a business that makes integrated touch and display chips for LCD phones to a Chinese private-equity firm. Most high-end phones now use OLED displays, with LCDs used primarily in lower-end devices, he noted. Competition was fierce, and margins were ebbing.\n\n&amp;#x200B;\n\nTwo acquisitions then followed, both closing in July. Synaptics bought DisplayLink, a Palo Alto–based company with a lock on the market for components used in universal docking stations, for $305 million in cash. “They’re the only company that has been able to figure this out,” Hurlston said.\n\n&amp;#x200B;\n\nThe transaction was immediately accretive to earnings.\n\n&amp;#x200B;\n\nSynaptics also spent $250 million for Broadcom’s wireless Internet of Things business, which includes Wi-Fi, Bluetooth, and GPS technologies. Hurlston knew that business intimately: He used to run it. “We felt like there were a lot of places where we needed wireless assets,” he said, citing video and audio products and wireless docking stations. “It’s a deal that only we could have done. My old team was involved, and some of them came over here.”\n\n&amp;#x200B;\n\nHe sees applications in wearables, surveillance cameras, and video set-top boxes.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**3) Valuation?**\n\n&amp;#x200B;\n\nAt a recent $78\\~/share, Synaptics trades for just over two times estimated revenue and less than 13 times expected profit for the June-2021 fiscal year. Competitors, such as Texas Instruments (TXN), Analog Devices (ADI), and Microchip Technology (MC HP ), fetch five to 10 times current-year revenue, suggesting Synaptics is underappreciated in every sense of the word.\n\n&amp;#x200B;\n\nFurthermore, when SYNA beat their numbers in the last earnings call (and raised Q1 guidance), the stock jumped significantly and briefly touched 52 week high ($90\\~/share) before the stock retreated along with the market over the last 3 months. Fundamentally, nothing has changed about this company’s future prospects. They purchased IoT portfolio from Broadcom (AVGO) and they are focusing on high margin segments and once again, this stock is ripe for another beat when they report on Nov 5th. It is not out of the question that the stock will continue to march over the next 12 months and if you missed out on AMD/NVDA and other semiconductor play, this is the stock that you have been looking for.\n\n&amp;#x200B;\n\nLastly, per Michael Hurlston who has a track record of turning around companies like Finisar, Synaptics had become a “$1 billion revenue company in the body of a $2 billion revenue company,” with an inefficient structure. For example, its PC business had a core design center in Taiwan’s capital city of Taipei, and offices in Armenia; Hyderabad, India; and the U.S. He closed all but the Taipei office, located near PC design operations for customers HP Inc. and Dell. “I did that kind of thing across the business,” he said. The result: Quarterly operating expenses fell to about $80 million from $110 million, and head count dropped to 1,200 from 1,700.\n\n&amp;#x200B;\n\nMeanwhile, Synaptics’ gross profit margins have risen in the past year to nearly 50% from under 40%. The company is configured, he says, to grow revenue in the 4% to 6% range, with profits rising faster as margins expand. Analysts expect Synaptics to earn $6.49 a share this year on revenue of $1.3 billion. KeyBanc Capital Markets analyst John Vinh thinks that earnings could top $8 a share in fiscal 2022. The stock “looks inexpensive with multiple ways to outperform,” he recently wrote.\n\n&amp;#x200B;\n\n**4) Street Coverage**\n\n&amp;#x200B;\n\nPaul Wick, a portfolio manager with Columbia Threadneedle Investments, owns more than 10% of Synaptics’ shares in the Columbia Seligman Communications &amp; Information fund (SLMCX), which he has run for more than 30 years. He’s a big Hurlston fan, and has been impressed with the new focus on growth and operating efficiency. Wick recalls how Hurlston was astonished by the huge number of fabs and test and assembly houses Synaptics was using. “They weren’t getting volume discounts from anyone,” Wick says. “They were able to reduce the number of vendors and get better pricing.”\n\n&amp;#x200B;\n\n8/6 - Raised to Overweight by KeyBanc\n\n8/6 - Maintained at Buy by Needham\n\n8/6 - Maintained at Buy by Rosenblatt\n\n8/6 - Maintained at Market Buy by BMO Capital",
        "subreddit": "investing",
        "title": "[SYNA] Synaptics - Undervalued Stock ready to take off?",
        "url": "https://www.reddit.com/r/investing/comments/jkbwfn/syna_synaptics_undervalued_stock_ready_to_take_off/",
        "created": 1604013395.0
    },
    {
        "author": "drew1027",
        "created_utc": 1602973414,
        "id": "jd4hf7",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "Thoughts on HPQ",
        "url": "https://www.reddit.com/r/investing/comments/jd4hf7/thoughts_on_hpq/",
        "created": 1603002214.0
    },
    {
        "author": "11ftw",
        "created_utc": 1604012831,
        "id": "jkl1h7",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Moving in the right direction. Following the decision to have 10 000 electric delivery vehicles by 2022, and 100 00 by 2030. \n\nWould the news make more people interested in the company then? \n\n\nArticle at https://blog.aboutamazon.co.uk/sustainability/amazon-launches-climate-pledge-friendly-in-europe\n\n\nThe programme which makes it easier for customers to discover and shop for sustainable products, launches with over 40,000 Climate Pledge Friendly products across France, Germany, Italy, Spain, and the UK with one or more of 19 sustainability certifications.\n\nBy Day One Team\n\n\nToday, Amazon announced the launch of Climate Pledge Friendly in France, Germany, Italy, Spain, and the UK.\nThe new programme will help make it easy for customers to discover and shop for more sustainable products. Customers will now see the Climate Pledge Friendly badge on more than 40,000 products in Europe to signify that the products have one or more of 19 different sustainability certifications that help preserve the natural world, such as reducing the carbon footprint of shipments to customers.\nThe Climate Pledge Friendly selection includes beauty, fashion, grocery, household, office, and electronics products for consumers and businesses from brands including Cif ecorefill and Seventh Generation by Unilever, Faith in Nature, HP Inc., Haglöfs, Esprit, Calida, and Kite Clothing.\n\n\n\nClimate Pledge Friendly products are clearly shown in shopping results, have additional sustainability information on the product page, and are featured in a dedicated section of our store. The Climate Pledge Friendly selection includes products made and sold by small businesses across Europe.\nAmazon has partnered with trusted third-party certifications, and customers will be able to discover products that meet sustainability standards designed to help preserve the natural world. Climate Pledge Friendly includes a wide range of global certifications and Amazon is adding European certifications from EU Ecolabel, Blue Angel, and Nordic Swan. Amazon is working with more certification partners and brands to add to the selection of Climate Pledge Friendly products.\nAs part of the Climate Pledge Friendly initiative, Amazon is also introducing Compact by Design in Europe, a new externally-validated certification created by Amazon to identify products that, while they may not always look very different, have a more efficient design. With the removal of excess air and water, products require less packaging and become more efficient to ship. At scale, these small differences in product size and weight lead to significant carbon emission reductions.\nCif ecorefill offers a unique Compact by Design-certified cleaning spray refill that helps people reuse their spray bottles at home. Its 10-times concentrated formula delivers the powerful Cif cleaning performance with 75% less plastic and in a 100% recyclable ecorefill, enabling significant energy, material and transport savings.\nSimilarly, Faith in Nature’s plastic-free shampoo bars provide the ultimate zero-waste alternative to bottled shampoo. Their solid shampoo weighs just a quarter of the total weight in a liquid shampoo, significantly reducing the weight and packaging for each order.\n“Climate Pledge Friendly is a simple way for our customers to discover more sustainable products that help preserve the natural world,” said Doug Gurr, Amazon UK Country Manager. “With 18 external certification programmes and our own new Compact by Design certification, we’re incentivising selling partners to create sustainable products that help protect the planet for future generations.”\n“It’s fantastic to see Amazon helping to make sustainable shopping easier and more accessible for consumers. Fairtrade is committed to supply chain transparency and environmental protection, and we are therefore delighted to be involved in Amazon’s Climate Pledge Friendly program” said Darío Soto Abril, CEO of Fairtrade International.\n“I look forward to seeing it launch in Europe, and hope it encourages even more brands to source more sustainably and certify their products so we can continue to drive positive impact that benefits farmers, workers and our shared environment.”\n\n\n\n“It has never been more important to provide information that allows us all to contribute to a sustainable future, and our focus is on highlighting products that meet tough requirements on chemical usage, resource consumption, greenhouse gas emissions and biodiversity,” said Ragnar Unge, CEO Ecolabelling Sweden, in charge of The Nordic Swan Ecolabel. “Climate Pledge Friendly will help guide consumers in Europe to easily find products with trusted sustainability certifications.”\n“In line with our mission to make sustainable living commonplace, we are delighted to partner with Amazon on its Climate Pledge Friendly initiative,” said Seb Munden, General Manager Unilever UK &amp; Ireland, makers of CIF ecorefill, Comfort and Seventh Generation, among other brands available through the programme.\n“Amazon’s initiative will drive scale and impact for more sustainable consumption by helping customers easily discover products that are Climate Pledge Friendly and encourage the manufacturers to make their products more sustainable. Unilever is committed to delivering products that provide the best experience for consumers while reducing the impact that our products and our operations have on the environment.”\nThe Climate Pledge Friendly initiative supports Amazon’s commitment to reach the Paris Agreement ten years early and be net-zero carbon by 2040. The company has already committed to reaching 100% renewable energy by 2025 and ordered more than 1,800 branded electric vehicles from Mercedes-Benz to make deliveries to customers in Europe.\nAmazon also launched the Climate Pledge Fund, a $2 billion fund to back visionary companies whose products and services will facilitate the transition to a low carbon economy. Amazon is also working to minimise waste, increase recycling, and provide options for customers to reuse, repair, and recycle products. As part of this effort we are removing a wide range of single-use and oxo-biodegradable plastic products from our websites across Europe and the UK to help prevent plastic waste. Building on these actions, Amazon will now make it easier for customers to access product choices that align with our commitment to a more sustainable future.\nFor detailed information on the programme qualification criteria and to start shopping for these products visit our store or look for the Climate Pledge Friendly mark on qualifying products.",
        "subreddit": "StockMarket",
        "title": "Amazon (company) at it again...",
        "url": "https://www.reddit.com/r/StockMarket/comments/jkl1h7/amazon_company_at_it_again/",
        "created": 1604041631.0
    },
    {
        "author": "brintoul",
        "created_utc": 1602606915,
        "id": "jah0ol",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I took a few of the current market darlings and added up their market capitalization and FCF.  This is from Yahoo Finance data.  The 6 issues I chose were:  TWLO, TTD, ZM, OKTA, CHWY, and PTON.  The combined market capitalization of these is roughly $306B.  The FCF you get for owning these six is $1.5B.  To put that into perspective, you can compare this to HPQ which has a market cap of $26B and FCF of $3B.\n\nBut it's different this time.",
        "subreddit": "stocks",
        "title": "Quick Observation on some Market Darlings",
        "url": "https://www.reddit.com/r/stocks/comments/jah0ol/quick_observation_on_some_market_darlings/",
        "created": 1602635715.0
    },
    {
        "author": "futureIsYes",
        "created_utc": 1602797103,
        "id": "jbwnpo",
        "num_comments": 35,
        "num_crossposts": 0,
        "selftext": "I sold my NET stock few days ago with good profit (at around 57$, 87% up), and I have about 10K worth of WCLD. I was looking into all the holdings of WCLD, and I was surprised there is no akamai (check [https://www.wisdomtree.com/etfs/thematic/wcld](https://www.wisdomtree.com/etfs/thematic/wcld)).\n\nI started digging and I came across this very good comparison of the major cloud companies:\n\n[https://www.codeinwp.com/blog/maxcdn-vs-cloudflare-vs-cloudfront-vs-akamai-edge-vs-fastly/](https://www.codeinwp.com/blog/maxcdn-vs-cloudflare-vs-cloudfront-vs-akamai-edge-vs-fastly/)\n\nas you can see, it seems akamai has like 55% of market share, while NET and FASTLY are around 1%. The blog was from July, but I don't think things have changed dramatically since then. \n\nFrom reading the blog, it seems to me for big companies, akam seems to be the first choice for the biggest websites (facebook, adobe, ibm, to mention few).\n\nThen I started looking into the valuations, and I found this article from today comparing Akamai and Fastly\n\n[https://www.fool.com/investing/2020/10/15/forget-fastly-this-edge-computing-rival-is-the-bet/?source=iedfolrf0000001](https://www.fool.com/investing/2020/10/15/forget-fastly-this-edge-computing-rival-is-the-bet/?source=iedfolrf0000001)\n\nIt was very eye opening, specially, the following table below  (Revenue and operating income are Guidances for 2020)\n\n    Company | Revenue | Operating Income  | Mkt Cap | P/S  | P/E   |  P/E (forward)\n    ---------|----------|-----------------|---------| ---- | ------|-----------------\n    FSLY  | $295 M |$7 million| $14.5 B | 54.0 | N/A  | 1,110\n    AKAM  | $3,150 M |$961 million| $18.8 B | 6.1 | 35  | 20.3\n\nThere is another table shown the revenue growth, where FSLY obviously have better figure (62% Q2 revenue growth for FSLY vs 13% for Akam), but Akam is still doing better when you look into margins \n\nI know the cloud market is growing, and Akam will not be able to keep the 55% market share. But still, how come it is almost not discussed here?\n\nSo after this quick research, I am thinking of buying a good 4-6K worth of Akamai. Any reasons why I shouldn't do that?  \n\nPS: Fsly, even after the big drops today and yesterday, is still up around 350% YTD, on the other hand, AKAM is only 26% up (NET is around 250% up YTD)",
        "subreddit": "stocks",
        "title": "Akamai, Fastly, Net...who will be the cloud winner? long term and short term",
        "url": "https://www.reddit.com/r/stocks/comments/jbwnpo/akamai_fastly_netwho_will_be_the_cloud_winner/",
        "created": 1602825903.0
    },
    {
        "author": "Manada_2",
        "created_utc": 1602784793,
        "id": "jbspnp",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "Berkshire Hathaway 4-5%\n\nMcDonalds 3,28%\n\nCoca Cola 3,56%\n\nTyson Foods 3,66%\n\nUnilever 1,43%\n\nNvidia 0,11%\n\nColgate-Palmolive 1,81%\n\nJohnson&amp;Johnson 3,35%\n\nWalmart 2,53%\n\nProcter&amp;Gamble 2,06%\n\nAT&amp;T 1,18%\n\nCaterpillar 2,34%\n\nIntel 0,76%\n\n3M 2,39%\n\nNovartis ADR (Suiça) 1,24%\n\nComcast 0,66%\n\nVisa 2,87%\n\nAmbev ADR (Brasil) 0,11%\n\nPepsi 2,04%\n\nAmerican Tower REIT 3,43%\n\nNational Heath Investors REIT 0,85%\n\nIBM 1,79%\n\nVerizon Communications 0,83%\n\nKellogg's 0,96%\n\nAFLAC Incorporated 0,52%\n\nNovo Nordisk ADR (Dinamarca) 1,01%\n\nFresenius Medical Care ADR (Alemanha) 0,59%\n\nABB Ltd ADR (Suiça) 0,38%\n\nMicrosoft 3,15%\n\nKimberly-Klark 2,21%\n\nJames Hardie Industries plc 0,37%\n\nLexington Realty Trust REIT 0,37%\n\nCostco 5,41%\n\nDisney 1,79%\n\nHome Depot 4,11%\n\nNike 1,82%\n\nPrologis Inc 1,49%\n\nToyota ADR (Japão)\n\nWelltower Inc REIT 0,77%\n\nAlexandria Real Estate Equities Inc REIT 2,31%\n\nCrown Castle International Corp REIT 2,38%\n\nDigital Realty Trust, Inc REIT 2,24%\n\nPublic Storage 3,38%\n\nScotts Miracle-Gro Company 2,37%\n\nUnitedHealth Group 4,58%\n\nSAP SE ADR (Alemanha) 2,20%\n\nPackaging Corp Of America 1,67%\n\nMastercard 4,83%\n\nRoss Stores 1,37%\n\nLogitech ADR (Suiça) 1,14%\n\nEntegris Inc 1,17%\n\nGraco 0,93%\n\nBrookfield Asset Management 0,48%",
        "subreddit": "StockMarket",
        "title": "Could you guys give your opinion about this stocks portfolio, please? Percentage distribution is not exact.",
        "url": "https://www.reddit.com/r/StockMarket/comments/jbspnp/could_you_guys_give_your_opinion_about_this/",
        "created": 1602813593.0
    },
    {
        "author": "desquibnt",
        "created_utc": 1602168550,
        "id": "j7edx6",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "https://www.ibm.com/investor/events/ibm-strategic-update-2020\n\nHugely positive move to me. It's infrastructure business has been weighing it down and kept it from focusing on the future of cloud and AI. \n\nI've been long on IBM since the Red Hat acquisition and was hyped to see Arvind Krishna (who captained the Red Hat deal) promoted to CEO earlier this year. That was a Steve Balmer to Satya Nadella type transition. \n\nIBM is the real deal.",
        "subreddit": "investing",
        "title": "IBM to spin off IT Infrastructure Services business in 2021. New IBM will focus on hybrid cloud and AI",
        "url": "https://www.reddit.com/r/investing/comments/j7edx6/ibm_to_spin_off_it_infrastructure_services/",
        "created": 1602197350.0
    },
    {
        "author": "Otaehryn",
        "created_utc": 1602246466,
        "id": "j7y0ns",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": " A new company focusing on legacy IT infrastructure will be named and spun off next year.\n\nIBM shares closed nearly 6% higher after the announcement.\n\n[https://finance.yahoo.com/m/b185693f-fe2e-38b3-8521-f767ec09cbf5/ibm-plans-business-unit.html](https://finance.yahoo.com/m/b185693f-fe2e-38b3-8521-f767ec09cbf5/ibm-plans-business-unit.html)\n\nIBM is after Azure and AWS market with acquisition of Red Hat. Red Hat is awesome but only around 2.5bn before acquisition. With cloud strategy they wish to trade closer to 30 PE like Microsoft compared to \\~10 they are trading now.",
        "subreddit": "stocks",
        "title": "IBM to split into two as it reinvents itself, stock up 6%",
        "url": "https://www.reddit.com/r/stocks/comments/j7y0ns/ibm_to_split_into_two_as_it_reinvents_itself/",
        "created": 1602275266.0
    },
    {
        "author": "iSpyNuHi",
        "created_utc": 1602445373,
        "id": "j9bzya",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "IBM is reportedly splitting itself into two separate public entities; one for the older, boring computer business, and the other expected to be flashier cloud technology and other such products. This doesnt change the underlying value of IBM, so buying long-dated Puts would be an easy decision since the IBM ticker will no longer represent the entire original IBM. Or am I missing something???",
        "subreddit": "wallstreetbets",
        "title": "IBM Puts",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j9bzya/ibm_puts/",
        "created": 1602474173.0
    },
    {
        "author": "kill_wonka",
        "created_utc": 1602436485,
        "id": "j99a27",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "After sneaky WSJ reported \"talks\" of AMD buying Xilinx, we saw roughly a 17% jump in XLNX and a 2% drop in AMD from pre-market to market-open on 10/9.  That jump caught every fucking investing blog and finance news website's attention and by noon:o'clock there were about 20+ articles parading around like this was the biggest news since the Trump got Covid.  Here is why this AMD acquisition will never happen:\n\n/AMD DEBT/\n\nAMD cannot afford it.  They don't have enough cash on hand to make a $30billion deal\n\n[https://www.bloomberg.com/news/articles/2020-10-09/amd-ceo-tries-to-banish-debt-ridden-deal-ghosts-with-xilinx-bid](https://www.bloomberg.com/news/articles/2020-10-09/amd-ceo-tries-to-banish-debt-ridden-deal-ghosts-with-xilinx-bid)\n\n&amp;#x200B;\n\n/Xilinx's Business Model/\n\nXilinx may simply be trying to get acquired and are leaking rumors to get the fire started. See what companies they work with and see the data for yourself here:\n\n[https://csimarket.com/stocks/markets\\_glance.php?code=XLNX](https://csimarket.com/stocks/markets_glance.php?code=XLNX) \n\n&amp;#x200B;\n\n/Xilinx Price Tag/\n\n$30billion offering is already out of AMD's reach (as you can see from the valuations from the articles above). If Xilinx is truly interested in selling their company, then will likely open their doors to other tech giants who will pay more and have a better handle on the sector.  These rumored \"talks\" drive up share value as you have already seen and, if they're smart, they won't sell to anyone... just take the overvaluation and strike up exclusive contracts with all the competing companies who try and buy them.\n\n&amp;#x200B;\n\nFinally, neither company would even comment on it.  AMD has been aggressive with their business since the induction of their newest CEO.  IMO this was a leak from AMD to illicit conversations with XLNX, but XLNX is too smart to let a company like AMD to swoop them up, even if AMD is trying to play the \"Fuck IBM\" card to pander them into an ethical agreement - or - this was a strategic move by XLNX to start a bidding war over their already stable company because they hit a ceiling in their profit model.  \n\n&amp;#x200B;\n\nWho knows tho, it's all rumors anyways\n\n&amp;#x200B;\n\nTLDR: IDK wtf I'm talking about, but I can say that neither does anyone else on this matter except for our beloved sneaky-ass AMD/XLNX execs \n\n//\n\nAMD $80c 10/16\n\nXLNX $120p 10/16\n\nAVT $27c 2/19",
        "subreddit": "wallstreetbets",
        "title": "AMD will not buy Xilinx",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j99a27/amd_will_not_buy_xilinx/",
        "created": 1602465285.0
    },
    {
        "author": "sgt-ty",
        "created_utc": 1601729853,
        "id": "j4elvs",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Skillsoft\n\nSkillsoft is one of the top IT training companies, according to Training Industry; it’s ranked in the top 20 on multiple Training Industry lists since 2008. It offers over 165,000 courses, videos and books in 160 countries and 29 languages — all accessible in the cloud. You’ll find multiple options for training and learning, including Percipio, a “learning experience platform” that brings training right to your mobile device.\n\nThere are over 450 learning paths that are regularly updated, analytic reports for managers to track and the app gives managers the ability to doll out assignments. Besides Percipio, there are plenty of other products from Skillsoft that will help companies train, certify and grow the skillsets of IT workers.\n\nGlobal Knowledge\n\nGlobal Knowledge offers courses in data analytics, change management, application development, cloud computing, cybersecurity and networking. It’s been around since 1995 and now has over 1,500 employees worldwide with technology partners such as Amazon Web Services, Cisco, SAP, Red Hat, Microsoft and IBM.\n\nIt promises to offer the most “relevant and timely content” from the “best instructors” via customized private programs, public training, flexible formats and support for continuing education. Companies should contact Global Knowledge to get a quote, since each program can be customized to a business’ needs",
        "subreddit": "SPACs",
        "title": "CCX - SkillSoft/Global Knowledge Background",
        "url": "https://www.reddit.com/r/SPACs/comments/j4elvs/ccx_skillsoftglobal_knowledge_background/",
        "created": 1601758653.0
    },
    {
        "author": "howtoreadspaghetti",
        "created_utc": 1602259180,
        "id": "j81mff",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "\"A typical bullish post on $IBM. 'It's a no growth business, but cheap at 9x my $14 EPS estimate.' Yet $IBM has LTM recurring EBT of only $7.3B on 900M shares o/s. That's $6.40 per share, after-tax (@21%).\"\n\nWhy do it this way? On an immediate hunch reading it this method comes off as a buffer. If it isn't $14 a share at EBIT EPS then it won't be (notwithstanding tax benefits and other managerial decisions that tend to be temporary in nature) $11 at the bottom line. But that seems like it's winging it more than there's actually a solid reason for doing it that way. What's the benefit to taking EBIT EPS?",
        "subreddit": "investing",
        "title": "Why take EPS out of EBIT?",
        "url": "https://www.reddit.com/r/investing/comments/j81mff/why_take_eps_out_of_ebit/",
        "created": 1602287980.0
    },
    {
        "author": "checkinggg",
        "created_utc": 1601908398,
        "id": "j5kgdb",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "GOOG - Alphabet, Inc.\n\n* [Google delays its 30% fee for Android developers in India amid Play Store row.](https://cloud.iexapis.com/v1/news/article/677d40b5-5c98-4dda-a44f-39c84396e831)\n\nAAPL - Apple, Inc.\n\n* [Apple is suing a recycling firm for $23 million, claiming it allegedly re-sold iPhones, iPads, and Apple Watches instead of breaking them down.](https://cloud.iexapis.com/v1/news/article/3858883e-9caf-4848-85f6-9cf33e77233e)\n\nMSFT - Microsoft Corp.\n\n* [Codat becomes a Microsoft partner to give banks easy access to SME financial data.](https://cloud.iexapis.com/v1/news/article/5f1af1b8-8fe5-47dd-83ee-6a12c923eab8)\n\nUBER - Uber Technologies, Inc.\n\n* [Uber is selling a $500m stake in its logistics business.](https://cloud.iexapis.com/v1/news/article/1a206c23-5e3c-4d16-ba9f-e03739d1d2b7)\n\nInfosys Ltd.\n\n* [Infosys Completes Acquisition of GuideVision, a Leading ServiceNow Elite Partner in Europe | Business.](https://cloud.iexapis.com/v1/news/article/6937935c-8da2-4ba0-9098-3a708d2c8871)\n\nMYOK - MyoKardia, Inc.\n\n* [Bristol Myers to buy heart drug developer MyoKardia for about US$13 billion.](https://cloud.iexapis.com/v1/news/article/10c32a54-af15-4e94-9bda-9943348e8a83)\n\nTSLA - Tesla, Inc.\n\n* [Tesla in discussion for major investment in Indonesia, a key nickel producer: report.](https://cloud.iexapis.com/v1/news/article/bcc4aa8e-3f9f-4b68-b783-f21d22779cf8)\n\nBMY - Bristol Myers Squibb Co.\n\n* [Bristol Myers to buy heart drug developer MyoKardia for about US$13 billion.](https://cloud.iexapis.com/v1/news/article/10c32a54-af15-4e94-9bda-9943348e8a83)\n\nCAT - Caterpillar, Inc.\n\n* [Caterpillar To Acquire Weir Oil &amp; Gas For $405M In Cash.](https://cloud.iexapis.com/v1/news/article/5dba6c45-10e6-4421-822b-27518e540610)\n\nBABA - Alibaba Group Holding Ltd.\n\n* [Alibaba To Pick Up Nearly 10% Stake In Dufry With $763M Investment.](https://cloud.iexapis.com/v1/news/article/ebebc76f-34ec-416f-84e9-51de66824eaa)\n\nIBM - International Business Machines Corp.\n\n* [Thai central bank issues $1.6B in government bonds on IBM BC.](https://cloud.iexapis.com/v1/news/article/766ca7a0-dd17-444c-a4e3-df25faf5013b)\n\nRMG - RMG Acquisition Corp.\n\n* [EV battery maker Romeo Systems to go public through a $1.33 billion SPAC deal](https://cloud.iexapis.com/v1/news/article/bf169a63-304e-427a-a241-aab220117d86)\n* Romeo Power Technology, Leading Provider of Battery Technology to the Commercial EV Market, to List on NYSE Through Merger With RMG Acquisition Corp.",
        "subreddit": "wallstreetbets",
        "title": "Today's Top Company News",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j5kgdb/todays_top_company_news/",
        "created": 1601937198.0
    },
    {
        "author": "hanslanded",
        "created_utc": 1602220794,
        "id": "j7t7er",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "What do people think of the coming IBM split? I know IBM is an old school whale but it’s still tech with lots of growth potential and the 4% jump after announcement shows that Investors somewhat agree but are cautious",
        "subreddit": "wallstreetbets",
        "title": "Tech never fails",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j7t7er/tech_never_fails/",
        "created": 1602249594.0
    },
    {
        "author": "lifeofbake",
        "created_utc": 1602632460,
        "id": "japarv",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Hello I’m a new investor and I started my portfolio with the “3 lazy portfolio” strategy. Now I’m ready to branch out into more individual stocks. How do I go about adding on to my portfolio?\n\nMy holdings: \n\n60%\nSPHD \nBND\nVXUS\n\n5%\nTSLA\nAMZN\nHD\nMCD\nCOKE\n\n5%\nAAPL\nMSFT\nINTC\nIBM\nCSCO\n\n15%\nVNQ\nO\nSTAG\nMAIN\n\n5%\nFDX\nUPS\n\n5%\nVZ\nT\n\n5%\nMMM",
        "subreddit": "investing",
        "title": "Portfolio Advice",
        "url": "https://www.reddit.com/r/investing/comments/japarv/portfolio_advice/",
        "created": 1602661260.0
    },
    {
        "author": "TheDoomslayer121",
        "created_utc": 1601657341,
        "id": "j3y52z",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "So I'm running a sim where I start at $10,000 I invested 4 big tech companies (AAPL, IBM, TWTR, and FB) all for a week seemed to went on a downturn. Same with the banks (specifically JPM). Is this advisable to buy the dip further?",
        "subreddit": "wallstreetbets",
        "title": "Newfag here",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j3y52z/newfag_here/",
        "created": 1601686141.0
    },
    {
        "author": "checkinggg",
        "created_utc": 1601908726,
        "id": "j5kjup",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "**GOOG** \\- Alphabet, Inc.\n\n* Google delays its 30% fee for Android developers in India amid Play Store row.\n\n**AAPL** \\- Apple, Inc.\n\n* Apple is suing a recycling firm for $23 million, claiming it allegedly re-sold iPhones, iPads, and Apple Watches instead of breaking them down.\n\n**MSFT** \\- Microsoft Corp.\n\n* Codat becomes a Microsoft partner to give banks easy access to SME financial data.\n\n**UBER** \\- Uber Technologies, Inc.\n\n* Uber is selling a $500m stake in its logistics business.\n\n**INFY** \\- Infosys Ltd.\n\n* Infosys Completes Acquisition of GuideVision, a Leading ServiceNow Elite Partner in Europe | Business.\n\n**MYOK** \\- MyoKardia, Inc.\n\n* Bristol Myers to buy heart drug developer MyoKardia for about US$13 billion.\n\n**TSLA** \\- Tesla, Inc.\n\n* Tesla in discussion for major investment in Indonesia, a key nickel producer: report.\n\n**BMY** \\- Bristol Myers Squibb Co.\n\n* Bristol Myers to buy heart drug developer MyoKardia for about US$13 billion.\n\n**CAT** \\- Caterpillar, Inc.\n\n* Caterpillar To Acquire Weir Oil &amp; Gas For $405M In Cash.\n\n**BABA** \\- Alibaba Group Holding Ltd.\n\n* Alibaba To Pick Up Nearly 10% Stake In Dufry With $763M Investment.\n\n**IBM** \\- International Business Machines Corp.\n\n* Thai central bank issues $1.6B in government bonds on IBM BC.\n\n**RMG** \\- RMG Acquisition Corp.\n\n* EV battery maker Romeo Systems to go public through a $1.33 billion deal\n* Romeo Power Technology, Leading Provider of Battery Technology to the Commercial EV Market, to List on NYSE Through Merger With RMG Acquisition Corp.",
        "subreddit": "investing",
        "title": "Today's Top News",
        "url": "https://www.reddit.com/r/investing/comments/j5kjup/todays_top_news/",
        "created": 1601937526.0
    },
    {
        "author": "checkinggg",
        "created_utc": 1602180470,
        "id": "j7i5jx",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "**MS** \\- Morgan Stanley\n\n* Morgan Stanley to Buy Eaton Vance in Deal Valued at $7 Billion.\n\n**EV** \\- Eaton Vance Corp.\n\n* Morgan Stanley to Buy Eaton Vance in Deal Valued at $7 Billion.\n\n**IBM** \\- International Business Machines Corp.\n\n* IBM CEO on infrastructure unit spin-off, cloud computing focus\n\n**GOOG** \\- Alphabet, Inc.\n\n* Google must open talks with French publishers about paying for content, court rules\n* Alphabet and SoftBank’s solar-powered drone provides first LTE connection\n\n**AMZN** \\- Amazon.com, Inc.\n\n* Amazon debuts its first fully electric delivery vehicle, created in partnership with Rivian\n\n**AAL** \\- American Airlines Group, Inc.\n\n* American Airlines, without additional stimulus, will cut flights to more U.S. cities, CEO says\n\n**SQ** \\- Square, Inc.\n\n* Square buys $50 million in BC as part of larger investment in c.currency\n\n**BHC** \\- Bausch Health Cos., Inc.\n\n* Bausch Health Companies Inc. Provides Preliminary Update On Third-Quarter 2020 Financial Results And Business Recovery\n\n**FB** \\- Facebook, Inc.\n\n* Facebook to halt political ads after US election\n\n**MCD** \\- McDonald's Corp.\n\n* McDonald's global sales improve in third quarter vs second qtr after coronavirus disruption\n\n**LLY** \\- Eli Lilly &amp; Co.\n\n* Trump urges for emergency authorization of Regeneron, Eli Lilly COVID-19 therapies\n\n**MOH** \\- Molina Healthcare, Inc.\n\n* J. Mario Molina, Physician and Healthcare CEO Launches Digital Platform votercare.org to Mobilize Public on Healthcare\n\n**MGM** \\- MGM Resorts International\n\n* Maple Gold Announces Joint Venture Partnership and Strategic Investment with Agnico Eagle\n\n**CEVA** \\- CEVA, Inc.\n\n* CEVA, Inc. Schedules Third Quarter 2020 Earnings Release and Conference Call\n\n**NVTA** \\- Invitae Corp.\n\n* New Study Finds Germline Genetic Testing Detects Actionable Findings Missed by Tumor-only Sequencing\n\n**PEP** \\- PepsiCo, Inc.\n\n* SodaStream Announces The Launch Of bubly drops™, The First North America Partnership Since Joining PepsiCo\n\n**PRMW** \\- Primo Water Corp.\n\n* Primo Water Corporation Announces Intention to Offer €450 Million of Senior Notes\n\n**LYFT** \\- Lyft, Inc.\n\n* The $185 million campaign to keep Uber and Lyft drivers as contractors in California\n\n**RACE** \\- Ferrari NV\n\n* Florida rapper bought Ferrari with COVID-19 relief money, feds say",
        "subreddit": "wallstreetbets",
        "title": "Today's Goodies",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j7i5jx/todays_goodies/",
        "created": 1602209270.0
    },
    {
        "author": "brules666",
        "created_utc": 1602176715,
        "id": "j7gxy7",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "From: https://www.reuters.com/article/us-ibm-divestiture-idINKBN26T1TZ\n\n(Reuters) - International Business Machines Corp is splitting itself into two public companies, capping a years-long effort by the world’s first big computing firm to diversify away from its legacy businesses to focus on high-margin cloud computing.\n\nIBM will list its IT infrastructure services unit, which provides technical support for 4,600 clients in 115 countries and has a backlog of $60 billion, as a separate company with a new name by the end of 2021.\n\nThe new company will have 90,000 employees and its leadership structure will be decided in a few months, Chief Financial Officer James Kavanaugh told Reuters.\n\nIBM, which currently has more than 352,000 workers, said it expects to record nearly $5 billion in expenses related to the separation and operational changes.\n\nInvestors cheered the surprise move by Chief Executive Officer Arvind Krishna, the key architect behind IBM’s $34 billion acquisition of cloud company Red Hat last year, sending the company’s shares up 7%.\n\n“We divested networking back in the ‘90s, we divested PCs back in the 2000s, we divested semiconductors about five years ago because all of them didn’t necessarily play into the integrated value proposition,” Krishna said on a call with analysts.\n\nBIG BLUE’S NEW FOCUS\n\nIn a blog, Krishna called the move a “significant shift” in the 109-year-old company’s business model.\n\n“IBM is essentially getting rid of a shrinking, low-margin operation given the cannibalizing impact of automation and cloud, masking stronger growth for the rest of the operation,” Wedbush Securities analyst Moshe Katri said.\n\nIBM, which has sought to make up for slowing software sales and seasonal demand for its mainframe servers, said it would now focus on open hybrid cloud and AI solutions that will account for more than half of its recurring revenues.\n\nKrishna, who replaced Ginni Rometty as CEO in April, said IBM’s software and solutions portfolio would account for the majority of company revenue after the separation.\n\nThe company also said it expects third-quarter revenue of $17.6 billion and an adjusted profit per share of $2.58, roughly in line with Street estimates.",
        "subreddit": "StockMarket",
        "title": "IBM to break up 109-year old company to focus on cloud growth",
        "url": "https://www.reddit.com/r/StockMarket/comments/j7gxy7/ibm_to_break_up_109year_old_company_to_focus_on/",
        "created": 1602205515.0
    },
    {
        "author": "finnchurchill",
        "created_utc": 1602561348,
        "id": "ja62oi",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "    Puts on humans and current banking systems\n\nWhy my boy IBM is working with overseas country’s for blockchaxin bonds because they trust USA encryptiox over other countries blockchaxin if this continues ibm might have a monopoly on encryptixn bonds.🤷🏼\n \nIBM partners with Japanese business, academia in quantum computing. With there current ai and a quantum computer the intelligence of ai can also grow exponentially.\n\nThe world is becoming more industrial and less and less humans will be needed this is why I am also investing In soft bank whom also owns shares in Boston dynamics.",
        "subreddit": "wallstreetbets",
        "title": "IBM WHY NOT🤷🏼📈",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ja62oi/ibm_why_not/",
        "created": 1602590148.0
    },
    {
        "author": "finnchurchill",
        "created_utc": 1602559055,
        "id": "ja5jen",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": " \n                  Repost from august 2020\n         Also look at my other picks on my redit  they are doing well\n\nPuts on humans\n\nAMD stock also looks good thank you subreddit user MENOI\n\nWhy ibm my fellow WallStreet bets hedge fund manager ?\nWell artificial intelligence is used in\n-Vaccine research\n-Cyber security\n-medicine \n-computer programming \n-Mass Production of good\n- Statistics\n\nBecause of covid 19 I don’t think big corporate companies are going to want humans they are expensive and are snowflakes. There for most major companies will be more inclined to robots and artificial intelligence \n\nPlus they are makeing good amount of earnings during the pandemic \n\nPlus you don’t have to pay taxes for employing artificial intelligence🤷🏼\n\n\nEdit:If you know a stock that is better or equivalent then by all means do tell cuz they ain’t one.\n\nEdit : bill gates and Steve Jobs stole software ideas from ibm and became billionaires. \nGood software can make you a billionaire due to the fact that once made it copied and pasted very cheaply and sold at a high markup such as video games and computer virus protection and most importantly WINDOWS PC UI and APPLE PC UI🤷🏼\n\nEdit: I’m not saying buy the stock because I actually waiting for the dip I’m hoping the stock won’t go up but down\n\nEdit: When you walk down the street do you see IBM on the street or when you drive or when you go to the store no they are not a consumer goods product but corporate product. \nPandemic happens corporations cut costs and restructure most companies will want to have less human work force thus AI will take over go to Walmart and look at the self checkout or when you go to a amazon warehouse tell me what you see boy.\n\nEdit: the power of well know product goods in the software community such as\n-oracle\n-snowflake\n-google whom is creating a quantum computer \n-Amazon Relational Database Serves\n-IBM\nWhy is this important because big corporations like to associate with other big corporations \nSuch as apple buys oled screens from Samsung",
        "subreddit": "wallstreetbets",
        "title": "IBM WHY NOT 🤷🏻📈",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ja5jen/ibm_why_not/",
        "created": 1602587855.0
    },
    {
        "author": "checkinggg",
        "created_utc": 1602182681,
        "id": "j7ium0",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "**MS** \\- Morgan Stanley\n\n* Morgan Stanley to Buy Eaton Vance in Deal Valued at $7 Billion.\n\n**EV** \\- Eaton Vance Corp.\n\n* Morgan Stanley to Buy Eaton Vance in Deal Valued at $7 Billion.\n\n**IBM** \\- International Business Machines Corp.\n\n* IBM CEO on infrastructure unit spin-off, cloud computing focus\n\n**GOOG** \\- Alphabet, Inc.\n\n* Google must open talks with French publishers about paying for content, court rules\n* Alphabet and SoftBank’s solar-powered drone provides first LTE connection\n\n**AMZN** \\- Amazon.com, Inc.\n\n* Amazon debuts its first fully electric delivery vehicle, created in partnership with Rivian\n\n**AAL** \\- American Airlines Group, Inc.\n\n* American Airlines, without additional stimulus, will cut flights to more U.S. cities, CEO says\n\n**SQ** \\- Square, Inc.\n\n* Square buys $50 million in BC as part of larger investment in c.currency\n\n**BHC** \\- Bausch Health Cos., Inc.\n\n* Bausch Health Companies Inc. Provides Preliminary Update On Third-Quarter 2020 Financial Results And Business Recovery\n\n**FB** \\- Facebook, Inc.\n\n* Facebook to halt political ads after US election\n\n**MCD** \\- McDonald's Corp.\n\n* McDonald's global sales improve in third quarter vs second qtr after coronavirus disruption\n\n**LLY** \\- Eli Lilly &amp; Co.\n\n* Trump urges for emergency authorization of Regeneron, Eli Lilly COVID-19 therapies\n\n**MOH** \\- Molina Healthcare, Inc.\n\n* J. Mario Molina, Physician and Healthcare CEO Launches Digital Platform votercare.org to Mobilize Public on Healthcare\n\n**MGM** \\- MGM Resorts International\n\n* Maple Gold Announces Joint Venture Partnership and Strategic Investment with Agnico Eagle\n\n**CEVA** \\- CEVA, Inc.\n\n* CEVA, Inc. Schedules Third Quarter 2020 Earnings Release and Conference Call\n\n**NVTA** \\- Invitae Corp.\n\n* New Study Finds Germline Genetic Testing Detects Actionable Findings Missed by Tumor-only Sequencing\n\n**PEP** \\- PepsiCo, Inc.\n\n* SodaStream Announces The Launch Of bubly drops™, The First North America Partnership Since Joining PepsiCo\n\n**PRMW** \\- Primo Water Corp.\n\n* Primo Water Corporation Announces Intention to Offer €450 Million of Senior Notes\n\n**LYFT** \\- Lyft, Inc.\n\n* The $185 million campaign to keep Uber and Lyft drivers as contractors in California",
        "subreddit": "investing",
        "title": "Compiled Today's Top News",
        "url": "https://www.reddit.com/r/investing/comments/j7ium0/compiled_todays_top_news/",
        "created": 1602211481.0
    },
    {
        "author": "coronastocks",
        "created_utc": 1602193655,
        "id": "j7m9sh",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Shares in IBM are soaring 12% in Thursday’s pre-market trading after the company announced the spin-off of its infrastructure services unit into a separate public entity to focus on its hybrid cloud platform.",
        "url": "https://www.reddit.com/r/stocks/comments/j7m9sh/shares_in_ibm_are_soaring_12_in_thursdays/",
        "created": 1602222455.0
    },
    {
        "author": "luisdanielmesa",
        "created_utc": 1602257648,
        "id": "j8159v",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "\"International Business Machines Corp will make its bow in the esports industry after signing a multi-year deal with the Overwatch League, the world's first global esports league with city-based teams across Asia, Europe, and North America.\"\n\nhttps://www.nasdaq.com/articles/esports-ibm-inks-first-ever-esports-deal-with-owl-2020-10-09\n\nDoes anyone know, or can infer, regarding Blizzards use of Google cloud and Youtube, how this will affect the relationship between them? Why wouldn't they use Google since they already are customers?",
        "subreddit": "StockMarket",
        "title": "IBM signs deal with Overwatch League (E-Sports)",
        "url": "https://www.reddit.com/r/StockMarket/comments/j8159v/ibm_signs_deal_with_overwatch_league_esports/",
        "created": 1602286448.0
    },
    {
        "author": "pxrage",
        "created_utc": 1602164627,
        "id": "j7d9pz",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "https://finance.yahoo.com/news/ibm-plans-spin-off-infrastructure-121624774.html\n\nMassive pivot in strategy. CEO will be on Yahoo Finance at 10am EST to talk about the pivot in strategy.\n\nExpecting them to come up as a player in cloud very soon. Will be capturing heavy enterprise client niche.",
        "subreddit": "stocks",
        "title": "IBM to spin off cloud infrastructure service. ticker up 10% this morning",
        "url": "https://www.reddit.com/r/stocks/comments/j7d9pz/ibm_to_spin_off_cloud_infrastructure_service/",
        "created": 1602193427.0
    },
    {
        "author": "BoomArmstrong",
        "created_utc": 1602169069,
        "id": "j7ejdv",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "IBM Spinoff - How will this impact me?",
        "url": "https://www.reddit.com/r/investing/comments/j7ejdv/ibm_spinoff_how_will_this_impact_me/",
        "created": 1602197869.0
    },
    {
        "author": "Dashover",
        "created_utc": 1602210215,
        "id": "j7qua4",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "\n \nFor Trading October 9th\n   \nSolid Day\n \nIBM Soars, DPZ Crushed\n \n \nToday’s market was just a good, old-fashioned day without any major moves in the indexes, no earth-shattering tweets or end of days prognostications.  I didn’t have any power, cable or phone last night so besides not putting out my Daily Note or closing comment, I miss the big debate.  Judging by the reports I heard today, all I missed was the fly on Pence’s head!  The DJIA was = 122.06 (.43%), NASDAQ +56.38 (.50%), S&amp;P 500 +27.38 (.80%), the Russell was the big winner again +17.51 (1.09%) and the Transports +72.54 (.62%) and a new all-time high!  The internals were good with NYSE 3:1 and NASDAQ 2:1 positive and all I can say is that it was very a very “Goldilocks” kind of day.\n\nLooking at adding NEM and GLD calls, and a reentry into CVS and UNG calls probably...\n                                                                                                                           \nTonight’s closing comment video: https://youtu.be/lXD_OB9CrYU\n \nSECTORS:  There was good news for holders of Eaton Vance (EV) being taken over by Morgan Stanley (MS) for about $7 billion in cash and stock.  MS was -2.20 premarket but right after the open it started back up and finished $49.35 +.64, and since it included stock, the rise sent EV higher to close $60.78 +19.84 (48.4%).  \nIBM also had news that sent it higher.  They gave guidance and then announced that they are going to split the company up and make the pieces “pure plays” in an effort to get a better valuation for the parts.  It looked great pre-market but by the open it had given up about 1/3 of the gains and finished the day up $7.42 (6%) after the early market up 12%.  Same situation with REGN, trading up to $618 or so +$26, but the stock never made it there when the real market opened…and then traded back to $598 and closed $599.70 +8.00, near the lows, but still ahead 1.24%.\nOn the downside, the DISASTER DU JOUR, was a name that I wrote about last week, WWR, Westwater Resources, which went from $1.52 to $14.50 on news that Mr. Trump had signed an executive order relating to securing “rare earth” and critical minerals last week.  As I mentioned, the stock took off from under $2 to $14.50 in 4 days and then reversed and finished the day $7.46 -4.26 (36%).\n \nNew Group:\nAIR &amp; CRUISE LINES were HIGHER with CCL -.22, RCL +1.48, NCLH +.28, AAL +.33, DAL +.67, LUV +.57, UAL +1.06, HA +.55, ALK +1.98, and XTN $61.54 +.77 (1.27%).\n \nFOOD SUPPLY CHAIN was MIXED with TSN +.57, BOS +.03, FLO -.08, CPB +.48, CAG -.35,M MDLZ +.38, KHC +.36, CALM -.14, JJSF -.02, SAFM -1.59, HRL -.23, SJM -.33, PPC -.21, KR +.36, and PBJ $33.64 +.11 (.34%).\n \nBIOPHARMA was HIGHER with BIIB +1.89, ABBV +.56, REGN +3.87, ISRG +2.74, GILD +.83, MYL +.83, TEVA +.35, VRTX +2.71, BHC +2.12, INCY +3.09, ICPT -2.46, LABU +.74 and IBB $141.38 +.39 (.28%).\nCANNABIS: was HIGHER with the comment in last night’s debate that Kamala Harris that they would legalize pot.  TLRY +1.38, CGC +2.84, CRON +.76, GWPH -1.19, ACB +.63, NBEV +.09, CURLF +.77, KERN +.21, and MJ $12.10 +1.15 (10.5%).\n\nDEFENSE was HIGHER with LMT +6.24, GD +1.73, TXT +.58, NOC +5.79, BWXT +2.53, TDY +7.63, RTX +1.31, and ITA $165.44 +2.76 (1.7%).\n\nRETAIL: was HIGHER with M +.35, JWN +1.13, KSS +1.34, DDS +1.60, WMT +.79, TGT +1.72, TJX +.24, RL +2.55, UAA +.49, LULU -.80, TPR +1.08, CPRI +.86 and a new addition GPS +.10, and XRT $54.01 +.83 (1.56%).\n \nMEGA-CAPS &amp; FAANG were HIGHER with GOOGL +26.86, AMZN +1.31, AAPL +.19, FB +6.29, NFLX -1.91, NVDA -6.16, TSLA +4.45, BABA +6.00, BIDU +.95, CMG +4.33, CRM +1.26, BA +4.05, CAT +2.98, DIS +.78, and XLK $118.37 +.61 (.52%).\nPLEASE BE AWARE THAT THESE PRICES ARE LATE MARKET QUOTES AND DO NOT REPRESENT THE 4:00 CLOSES.\n \n \nFINANCIALS were HIGHER with GS +4.91, JPM +2.51, BAC +.47, MS +.52, C +.06, PNC +1.37, AIG +.79, TRV +1.82, V +1.21, and XLF $25.20 +.34 (1.37%).\n \n \nOIL, $41.19 +1.24, Oil was near recent highs and sold off hard Friday touching $37.61 (down about 6%) before mounting a rally back to close +2.17. The stocks were HIGHER with XLE $31.29 +1.13 (3.75%).\n \n \nGOLD $1,895.10 +4.30, opened HIGHER and made a slightly higher high and a higher low, closing near the highs of the day.  There were several “unusual options action” looking for another 10-12% on the upside before year end.  \n \n \nBITCOIN: closed $10,955 +235. After breaking out over $10,000 we have had a “running correction” pushing prices toward $12,000, reaching a recovery high of $12220 Thursday, and after a day of rest in between, we resumed the rally touching $12,635, but have sold off back to support. We had 750 shares of GBTC and sold off 250 last week at $13.93 and still have 500 with a cost of $8.45. GBTC closed $11.86 +.89 today.\n \n Tomorrow is another day.\n \nCAM",
        "subreddit": "options",
        "title": "IBM Rockets",
        "url": "https://www.reddit.com/r/options/comments/j7qua4/ibm_rockets/",
        "created": 1602239015.0
    },
    {
        "author": "sgt-ty",
        "created_utc": 1601729845,
        "id": "j4elve",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Skillsoft\n\nSkillsoft is one of the top IT training companies, according to Training Industry; it’s ranked in the top 20 on multiple Training Industry lists since 2008. It offers over 165,000 courses, videos and books in 160 countries and 29 languages — all accessible in the cloud. You’ll find multiple options for training and learning, including Percipio, a “learning experience platform” that brings training right to your mobile device.\n\nThere are over 450 learning paths that are regularly updated, analytic reports for managers to track and the app gives managers the ability to doll out assignments. Besides Percipio, there are plenty of other products from Skillsoft that will help companies train, certify and grow the skillsets of IT workers.\n\nGlobal Knowledge\n\nGlobal Knowledge offers courses in data analytics, change management, application development, cloud computing, cybersecurity and networking. It’s been around since 1995 and now has over 1,500 employees worldwide with technology partners such as Amazon Web Services, Cisco, SAP, Red Hat, Microsoft and IBM.\n\nIt promises to offer the most “relevant and timely content” from the “best instructors” via customized private programs, public training, flexible formats and support for continuing education. Companies should contact Global Knowledge to get a quote, since each program can be customized to a business’ needs",
        "subreddit": "SPACs",
        "title": "CCX - SkillSoft/Global Knowledge Background",
        "url": "https://www.reddit.com/r/SPACs/comments/j4elve/ccx_skillsoftglobal_knowledge_background/",
        "created": 1601758645.0
    },
    {
        "author": "finnchurchill",
        "created_utc": 1602114121,
        "id": "j725e9",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Ibm everyone not to but y’all will see📈",
        "url": "https://i.redd.it/1r4wm2dberr51.jpg",
        "created": 1602142921.0
    },
    {
        "author": "spacej3di",
        "created_utc": 1602171692,
        "id": "j7fcfk",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " **US equities mostly higher: Dow (0.04%), S&amp;P 500 +0.35%, Nasdaq +0.26%, Russell 2000 +0.50%**\n\n* US equities higher in Thursday midday trading, but off best levels. Energy, financials, materials some of the leaders. Tech, industrials, consumer discretionary trailing. Treasuries mostly firmer with curve flattening after another steepening move yesterday. Dollar a bit better vs euro but not doing much on the yen cross. Gold up 0.1%. WTI crude up 2.0%.\n* Trump said this morning **\"a bigger deal\" on stimulus (including $1,200 checks) might be possible**, but **Pelosi was dismissive** in a morning press conference. Has also been talk about a **standalone airline bill**, though some resistance from individual GOP senators and Pelosi said \"there is no standalone bill without a bigger bill.\" Not a lot of drama in **last night's vice presidential debate**, and nothing to shift the **growing market expectations for a Biden win and possible Democratic capture of the Senate**. Still a lot of concern about rising Covid new-case levels in Europe (and increasingly in the US). However, **vaccine/treatment optimism theme** helped by Trump talking up his **positive experience with REGN's antibody cocktail**.\n* Analyst takeaways from yesterday's FOMC minutes note the degree to which **policymakers have baked more stimulus into their economic forecasts** and notes that **the Fed might turn to more explicit guidance on QE at future meetings**. Latest week of **initial jobless claims a bit higher than consensus**, though **continuing claims lower**. Elsewhere, BoE Governor Bailey said second wave coronavirus impact will be less severe. BOJ Governor Kuroda noted Japan's economy beginning to improve and repeated won't hesitate to ease as needed. ECB September minutes due for release today.\n* **MCD-US** preliminary Q3 comps ahead of the Street. **COST-US** September comps saw big jump in average ticket. **AMGN-US** hit by disappointing trial data. **REGN-US** and **LLY-US** higher after Trump talked up his experience with experimental monoclonal antibody cocktail. **IBM-US** to spin off services segment to focus on cloud and AI. Regulators hit **C-US** for gaps in risk management and levied a $400M fine. **MS-US** to acquire **EV-US** in \\~$7B deal. **PPG-US** guided Q3 EPS well ahead of consensus. **DPZ-US** earnings missed, with higher revenue offset by greater costs. **CCL-US** Q3 revenue was worse than expected. **BHC-US** guidance was well received. **COTY-US** expanding Kylie Skin in Europe and Australia. **HELE-US** Q2 results solid, but flagged uncertainties.\n\n**Notable Gainers:**\n\n* \\+47.6% **EV-US** (Eaton Vance): To be acquired by MS-US for $56.50 a share in cash and stock, or a \\~38% premium to Wednesday's close; transaction valued at \\~$7B.\n* \\+10.1% **BHC-US** (Bausch Health Companies): Guided Q3 revenue ahead of estimates and affirmed full year revenue and adjusted EBITDA near midpoint of guidance ranges which is a bit ahead of analyst consensus.\n* \\+8.6% **COTY-US** (Coty): Announced expansion of Kylie Skin line in the UK, France, Germany, and Australia; said DTC websites will offer a variety of products at launch and expand offerings over time.\n* \\+5.8% **IBM-US** (IBM): Announced spinoff of its Managed Infrastructure Services unit; said tax-free spin expected to be completed by year-end 2021 and will result in tighter focus on cloud and AI solutions; preliminary Q3 results largely in line.\n* \\+3.0% **PPG-US** (PPG Industries): Guided Q3 EPS well ahead of consensus; said y/y declines in sales volumes more moderate than feared; highlighted strength in global architectural coatings business; noted help from aggressive cost management.\n* \\+2.4% **REGN-US** (Regeneron Pharmaceuticals): Trump video largely credited his recovery to REGN's monoclonal antibody cocktail (also a positive mention of LLY-US antibody treatment); announced it has submitted an FDA emergency use authorization request for the combination.\n\n**Notable Decliners:**\n\n* \\-44% **CYTK-US** (Cytokinetics): Along with AMGN-US and Servier, said topline results from phase 3 trial of omecamtiv mecarbil in patients with heart failure; said it achieved primary composite endpoint but saw no reduction in secondary endpoint of cardiovascular death.\n* \\-7.8% **HELE-US** (Helen of Troy): Q2 earnings and revenue well ahead of consensus though withheld guidance; noted uncertainty of Covid-19 impacts on consumer demand, supply chain, effectiveness of major planned brand spending; however nesting/home purchases supportive of results, solid growth in online sales.\n* \\-7.2% **DPZ-US** (Domino's Pizza): Q3 revenue beat, but EPS missed; domestic and international comps beat, though OM missed; analysts blamed EPS miss on higher SG&amp;A expenses, additional compensation and sick pay.\n* \\-2.4% **ACMR-US** (ACM Research, Inc.): Short report from J Capital alleges company is overreporting both revenue and profit, that undisclosed parties are diverting revenue and profit, and that the company appears strapped for cash despite $86M on the balance sheet.\n\n10:38:34 AM CDT on 08 Oct '20",
        "subreddit": "stocks",
        "title": "Midday Market Synopsis - October 8, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/j7fcfk/midday_market_synopsis_october_8_2020/",
        "created": 1602200492.0
    },
    {
        "author": "JohnnysDrama",
        "created_utc": 1601605533,
        "id": "j3me70",
        "num_comments": 91,
        "num_crossposts": 0,
        "selftext": "\\#**WHY #AMD #IS #GOING #TO #THE  #MOON**  \n\n\n\\#1\n\n**Heavily Rumoured New CPUs (including 16 core gaming CPU).**\n\nThis would be revolutionary and will put investors into a complete frenzy. The slide was leaked and confirmed by [videocardz.com](https://videocardz.com) which is a very authentic source for tech news. A 16 core CPU that pulls 105w at a reasonable price will be GAME-CHANGING, and everyone will want to get their hands on it.\n\nhttps://preview.redd.it/f4y8kvv3blq51.png?width=1569&amp;format=png&amp;auto=webp&amp;s=b0e772c7f4963cb569eb0024dcee84fb63b4697e\n\nAlong with this game-changing chip, 3 additional CPUs are rumored to be released.   \n\n\n\\#2\n\n**Big Navi having possibly better performance**  \nThere have been leaks off Newegg of Big Navi being better than the 3080. Even if the cards are neck in neck AMD will be able to paint the 6000 series cards as better due to minor discrepancies.\n\nRadeon RX 6900 XT\t5,120\t1,500\t16GB GDDR6\t512\t256-bit\t300  \n\\-----------------------------------------------------------------------------------------------------------------\n\nRadeon RX 6800 XT\t3,840\t1,500\t12GB GDDR6\t384\t192-bit\t200  \n\\---------------------------------------------------------------------------------------------------------------\n\nRadeon RX 6700 XT\t2,560\t1,500\t6GB GDDR6\t384\t192-bit\t150  \n\n\nhttps://preview.redd.it/x0zjsju2clq51.png?width=970&amp;format=png&amp;auto=webp&amp;s=14551f974837dfc21662c24da268d5284287d169\n\n  \n\\#3\n\n**NVIDIA 3rd Party Card Catastrophe**\n\n*(this section is from my previous post)*\n\nSo most GPUs are made by a 3rd party. AMD and NVIDIA make the actual \"brain\" of the GPU but 3rd party partners add onto it for better performance (very basic explanation). Don't ask me why this is, it is just mainly because of logistical reasons.\n\nBut that is not the point, the point is that the great majority of GPUs are third-party cards meaning that they get to change around the design of the PCB. The issue here is that some of these third-party partners cheaped out on little capacitors.\n\nBy cheapening out it is leading to bad power delivery. The only way to fix this rn is to downclock the card which the normal person doesn't know how to do and doesn't expect is necessary when they are buying a 500$+ piece of hardware.\n\nI feel like if there is a mass callback that will be bad PR. NVIDIA could always release drivers that make the cards run below their listed spec but i'm not sure if people will really want that even if the performance loss is marginal.\n\nEVGA already confirmed the suspicions that these cards were crashing because of capacitor issues. It may be different for other companies but at least for EVGA this is what they are saying currently.\n\n**But why does this matter??**\n\nPeople who were looking to pick up a next-gen GPU right away are now hesitant and will wait for AMDS offerings. The people who did return their GPUs will also possibly wait. Faulty cards will most likely get a down clock which will make Big Navi look better. It supposedly already is better and this 3-5% difference could really change people's minds.  \n\n\n\\#4 \n\nLisa Su is an absolute unit. She will for sure talk about their timeline and plans for 5nm/3nm. I am guessing that this will rally investors to invest because they will see shinny 5nm/3nm while Intel is just getting to 10nm.  \n\n\n**POSITIONS:**  \n\\+95 call  (exp 12/18)  \n\\- 100 call (exp 12/18)\n\n(*call me a pussy for using a debit spread but I think its the best for my case)*  \n\n\nif you have something else you want to share comments below and I will add it!\n\nSources:\n\n[https://videocardz.com/newz/amd-ryzen-9-3950x-to-become-worlds-first-16-core-gaming-cpu](https://videocardz.com/newz/amd-ryzen-9-3950x-to-become-worlds-first-16-core-gaming-cpu)\n\n[https://www.igorslab.de/en/what-real-what-can-be-investigative-within-the-crashes-and-instabilities-of-the-force-rtx-3080-andrtx-3090/](https://www.igorslab.de/en/what-real-what-can-be-investigative-within-the-crashes-and-instabilities-of-the-force-rtx-3080-andrtx-3090/)\n\n[https://www.youtube.com/watch?v=x6bUUEEe-X8](https://www.youtube.com/watch?v=x6bUUEEe-X8)\n\n[https://www.tomshardware.com/news/evga-nvidia-rtx-3080-capacitor-caused-crashes](https://www.tomshardware.com/news/evga-nvidia-rtx-3080-capacitor-caused-crashes)\n\n[https://www.tomshardware.com/news/newegg-insider-reportedly-reveals-radeon-rx-6900-xt-rx-6800xt-rx-6700-xt-specifications](https://www.tomshardware.com/news/newegg-insider-reportedly-reveals-radeon-rx-6900-xt-rx-6800xt-rx-6700-xt-specifications)\n\n*This is not financial advice just me presenting the facts and the possibility of a callback.*  \n\n\nhttps://preview.redd.it/b2ciqo9vdlq51.png?width=662&amp;format=png&amp;auto=webp&amp;s=64d0fa79a87e74390c112a07e8d93a82c5a8476e",
        "subreddit": "wallstreetbets",
        "title": "AMD and LISU SU TO THE MOON",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j3me70/amd_and_lisu_su_to_the_moon/",
        "created": 1601634333.0
    },
    {
        "author": "tourist614",
        "created_utc": 1601767910,
        "id": "j4p20o",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "I'm analyzing AMZN stock. I feel it has a lot of upside potentital given its AWS cloud offering which is top notch IaaS provider out there. They are innovating quite a bit in this space. \n\n* Building own processors (Annapurna labs) which can eat into intel, AMD lunch \n* Big IaaS leverage if they decide to venture into enterprise software space\n\nEcommerce is growing at a record space due to covid. \n\nAds is also promising line of business. I'm planning to a share per month for atleast 4 years for dollar cost averaging reasons. \n\nAnyone see downsides to this approach or AMZN for longterm",
        "subreddit": "stocks",
        "title": "AMZN investing strategy",
        "url": "https://www.reddit.com/r/stocks/comments/j4p20o/amzn_investing_strategy/",
        "created": 1601796710.0
    },
    {
        "author": "Gabriele25",
        "created_utc": 1601730662,
        "id": "j4erm9",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "Tesla: 21.46% (I’m gonna sell some of it in the future)\n\nDelta Airlines: 10.35% (bought in a wrong time, gonna sell a part of it)\n\nApple: 9.89%\n\nIntel: 8.63%\n\nNvidia: 8.63%\n\nNIO: 5.50%\n\nFacebook: 5.18%\n\nMicrosoft: 5.18%\n\nAmazon: 5.18%\n\nCanadian Solar: 5.18%\n\nZoom: 4.43% (short term position)\n\nBeyond Meat: 4.31%\n\nAlibaba: 3.45%\n\nBoeing: 2.67%",
        "subreddit": "StockMarket",
        "title": "Rate my portfolio",
        "url": "https://www.reddit.com/r/StockMarket/comments/j4erm9/rate_my_portfolio/",
        "created": 1601759462.0
    },
    {
        "author": "Reden95",
        "created_utc": 1601690918,
        "id": "j47nd5",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "15.85% VOO\n\n24.73% Amazon\n\n12.09% Facebook\n\n12.53% Microsoft\n\n3.98% Google\n\n7.09% Square\n\n2.18% SKYY\n\n3.26% KWEB\n\n3.26% CQQQ\n\n3.37% PBW\n\n3.83% ICLN\n\n0.88% MCHI\n\n2.08% TQQQ\n\n1.50% UPRO\n\n3.37% Intel\n\nWhat do you guys think?",
        "subreddit": "StockMarket",
        "title": "Rate My Portfolio",
        "url": "https://www.reddit.com/r/StockMarket/comments/j47nd5/rate_my_portfolio/",
        "created": 1601719718.0
    },
    {
        "author": "em19em19",
        "created_utc": 1601607858,
        "id": "j3my5y",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Intel is signaling the apocalypse. Calls on dooms day bunkers",
        "url": "https://i.redd.it/fe9o7xqxklq51.jpg",
        "created": 1601636658.0
    },
    {
        "author": "will-not-forget-pswd",
        "created_utc": 1601648711,
        "id": "j3vf97",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "AMD will explode next week.\n\nFollowing these [directional plays](https://twitter.com/unusual_whales/status/1312026909002231808?s=21) I really think we will see big moves in AMD next week. \n\nThe reason es very simple. \n\nTheir cpu leaked. It has better perfomance than intel and will likely be cheaper in price. \n\nhttps://www.techradar.com/news/amd-ryzen-9-5900x-leak-suggests-12-core-cpu-is-a-huge-leap-forward-from-3900x\n\nNVDA, the long competitor, is currently unable to stock more chips. AMD can keep up with demand. \n\nThe new consoles havebAMD chips in them and will boost sales come earnings.\n\nAMD will fronteun this news so get in now.",
        "subreddit": "smallstreetbets",
        "title": "AMD and the leaky drip",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/j3vf97/amd_and_the_leaky_drip/",
        "created": 1601677511.0
    }
]