[
    {
        "author": "j33tAy",
        "created_utc": 1601468349,
        "id": "j2l0zg",
        "num_comments": 504,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Private sector jobs up 749,000 in September, vs 600,000 estimate, ADP says",
        "url": "https://www.cnbc.com/2020/09/30/adp-private-sector-jobs-september-2020.html",
        "created": 1601497149.0
    },
    {
        "author": "betcho",
        "created_utc": 1599051783,
        "id": "il6dao",
        "num_comments": 375,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2020/09/02/private-payrolls-grow-by-428000-but-miss-expectations-adp-report-says.html\n\nI suppose this means that the market will be green today?\n\nI've been watching the premarket closely this morning and it didn't even dent it.\n\nAre such news no longer relevant?",
        "subreddit": "investing",
        "title": "Private payrolls rose by 428,000 in August, coming short of expected 1.17 million",
        "url": "https://www.reddit.com/r/investing/comments/il6dao/private_payrolls_rose_by_428000_in_august_coming/",
        "created": 1599080583.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1599319752,
        "id": "in3122",
        "num_comments": 46,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/stocks. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning September 7th, 2020.\n\n# **The stock market shakeout is likely not over yet, even with Friday’s comeback  - [(Source)](https://www.cnbc.com/2020/09/04/the-stock-market-shakeout-is-likely-not-over-yet-even-with-fridays-comeback.html)**\n*****\n&gt; The tech wreck is probably not over, despite Friday’s market comeback.\n*****\n&gt; Analysts expect the shakeout in stocks to continue after the long Labor Day weekend, especially in technology names and the Nasdaq, areas of the market that notched the sharpest gains.\n*****\n&gt; After August’s 7% gain in the S&amp;P 500, stocks started September strong, and then just as quickly rolled over. The Nasdaq lost 5% Thursday and was down sharply Friday but pared losses to decline 1.5%. The S&amp;P 500 was down about 2.3% for the week, even after a 3.5% loss Thursday.\n*****\n&gt; “I think this is a good wake-up call and a reminder that there are risks out there,” said Leo Grohowski, chief investment officer at BNY Mellon Wealth Management. “In August, we did take a little bit off the table.”\n*****\n&gt; Analysts expect the week ahead to be busy, with holidays ending and more market pros back at their desks. There is some economic data, most importantly Friday’s consumer price index. The reading on consumer inflation is expected to show little change in core inflation with forecasts for a gain of just 0.2% in August, or 1.6% year over year.\n*****\n&gt; # Froth blowing off\n&gt; The stock sell-off came as market pros were becoming increasingly wary of froth in the market, particularly in tech and momentum names. On Friday, it was revealed that SoftBank was behind billions in large options bets on individual tech stocks, like Amazon, Microsoft, Apple and Tesla. News reports said the trades were made over the past month, and SoftBank had been building unusually large positions in call options, or those that bet the prices of underlying stocks would rise.\n*****\n&gt; One analyst said the fact that SoftBank was “gunning the market” makes him worry that there is more selling to come in Nasdaq names. As SoftBank bought call options, the sellers had to buy stocks, conceivably driving up prices in a trading feedback loop.\n*****\n&gt; “It’s just a trip to the casino,” said Peter Boockvar, chief investment officer at Bleakley Advisory Group. “If they’re supposed to be an investment company taking a long-term horizon, then trying to juice your short-term return through options, you’ve turned into a hedge fund.”\n*****\n&gt; JPMorgan strategists said they expect the market to recover gradually, but there are still presidential election uncertainties looming in the next couple of months.\n*****\n&gt; “The significant reduction in previously extreme long positions in Nasdaq by momentum traders should allow the equity market to recover over the coming weeks, as happened after the June 11th correction,” noted JPMorgan analysts. “But a repeat of the strong gains seen during July and August is less likely over the next two months.”\n*****\n&gt; Grohowski said there could be more selling in the tech and internet companies, or those that were viewed did well as workers stayed home and the economy was shutdown. “It’s not the start of a big lasting correction, but a forewarning the next couple of weeks and months are going to be choppy. I think it’s going to be a sideways kind of market,” Grohowski said. He added the market could be choppy in the week ahead.\n*****\n&gt; “We’re a little more cautious, not to mention the market is trading at 23 times our earnings estimates for 2021,” said Grohowski. He said the fact there is about $4.5 trillion in money market funds is a bullish signm since that money could find its way into the stock market.\n*****\n&gt; Julian Emanuel, head of equities and derivatives strategy at BTIG, said the S&amp;P 500 could dip to its 200-day moving average, or 3,092, before rebounding, which would be about a 15% move in total.\n*****\n&gt; “I don’t think the sell-off is over. Nasdaq is up 83%s since March 23, the S&amp;P is up 63%,” said Emanuel.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/34qCxpv.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/1u5feMS.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/WfvTGox.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.postimg.cc/sDw87zF7/econcal1.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/bUFp72p.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/cgvDyfD.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/SJ4plDu.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/g1WP8F6.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.postimg.cc/GtFbRTWy/er1.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/NcrK823.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/NkAezup.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/D3X10mF.png))**\n\n*****\n\n&gt; # Small Caps Best Day After Labor Day\n\n&gt; In the last 21 years, only Russell 2000 has registered an average gain of 0.16% on the Tuesday after the long Labor Day weekend. DJIA, S&amp;P 500 and NASDAQ have struggled with negative average performance. NASDAQ and Russell 2000 have been up five of the last eight years, but DJIA, S&amp;P 500, NASDAQ and Russell 2000 all have fallen for the last three years on Tuesday. On Wednesday the market’s performance has been varied. DJIA has performed the best, up 76.2% of the time with an average gain of 0.25%. S&amp;P 500 is worst, up only 42.9% of the time with an average gain of 0.13%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/1422a049f2b0dbca39b1543c5cff0a42/172c7870552d9912-60/s500x750/ff92c03e01c3e886a523a64381a9c44745538da2.jpg))**\n\n*****\n\n&gt; # Big August: Bullish or Bearish?\n\n&gt; Big August 2020 logged the 4th biggest August percent gain for the S&amp;P 500 since 1949 and the 6th biggest since 1930. But, is this bullish or bearish for the market in the coming months? Hopefully the table below provides some perspective by comparing the previous Top 20 S&amp;P 500 Augusts since 1949 to July, September, Q4 and the succeeding “Best Six Months” November-April.\n\n&gt; Subsequent Septembers were down 15 of 20 years for an average loss of -1.0% (median loss of -0.7%). Q4 is positive with gains in 13 of the 20 years for an average gain of 1.0% (median gain of 3.0%). The following Best Six Months are more bullish, up 16 of the 20 years with an average gain of 7.6% (median gain of 8.5%).\n\n&gt; Looking at just the 7 years that were preceded by big Julys shows some improvement for September but Q4s are worse, containing the largest Q4 losses. Back-to-back big Julys and big Augusts were followed by improved Best Six Months results, up in all 7 instances with a higher average and median gain and the top gain.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/7bd7299f2e7714adc709577da928964e/bd54fb998db4a9e1-46/s1280x1920/3363ff03bfc2dead6e88b387771b6bbad2aafece.jpg))**\n\n*****\n\n&gt; # Analyzing the Jobs Report\n\n&gt; The jobs market remains strong, as the August nonfarm payrolls came in at a solid 1.37 million jobs created, right in line with expectations. This was the fourth consecutive month of gains, up 10.6 million over this time frame. In March and April more than 22 million jobs were lost, so we still aren’t quite to half of the jobs recovered though.\n\n&gt; This was the second consecutive month there was a very weak ADP private payrolls number ahead of the monthly jobs report, adding to the worries, but the actual nonfarm payroll number was once again quite solid. Don’t forget, just yesterday we saw initial jobless claims come in at 881,000, the lowest number since the week ending March 14, another improving employment number.\n\n&gt; The big surprise in today’s report though was the unemployment rate fell to 8.4%, from 10.2% last month and an expected 9.8%. This was the lowest unemployment rate since 4.4% in March.\n\n&gt; “This was an impressive report and once again showed the economy remained quite resilient,” explained LPL Financial Chief Market Strategist Ryan Detrick. “But 8% unemployment is 8% unemployment, so let’s not get too excited, but we’ll still take this improving trend in the employment picture.”\n\n&gt; As shown in the LPL Chart of the Day, even though more than 10 million jobs have been created in the past four months, the sad truth is we are still quite a long way from recovering all the jobs lost due to the pandemic. In fact, looking at previous cycles, it has taken years for all of the lost jobs to come back and this time doesn’t appear any different.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/09/Blog-9.4.20.png?ssl=1))**\n\n&gt; One thing to consider is could this solid number make it harder for Washington to agree on the next stimulus plan? We are watching this closely, but with the two sides still close to a trillion dollars apart, today’s report will likely do little to help the two sides come to a quick resolution.\n\n&gt; Last, don’t forget that stocks gained more than 60% in less than six months, so some weakness would be perfectly normal. In fact, looking at the two previous strongest starts to a bull market ever (’82 and ’09) both saw some weakness right around now.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/09/Blog-9.4.20-2.png?ssl=1))**\n\n*****\n\n&gt; # 3 Charts To Watch If You Are Bullish\n\n&gt; The S&amp;P 500 Index just closed the door on its best August since 1986, making new all-time highs along the way, while also closing up five months in a row.\n\n&gt; First things first, make no mistake about it; this is a new bull market. That of course doesn’t mean it will last years like previous bull markets, but a nearly 57% gain in 5 months is what we’d classify as a bull market.\n\n&gt; Here are all the bull markets going back to the Great Depression and where this one ranks.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.2.20-blog-chart-1.png?ssl=1))**\n\n&gt; Now let’s dig into the 5 month win streak. It is quite rare for stocks to gain from April through August, as the summer months tend to be somewhat tricky. Yet, we found there were six other years that saw these 5 months all close higher and the rest of the year was higher five times, with some solid returns in there. In fact, the only year that was lower the rest of the year was 2018, mainly due to the Fed policy mistake in December 2018.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.2.20-blog-chart-2.png?ssl=1))**\n\n&gt; “What might surprise many investors is 5 month win streaks are actually incredibly bullish going forward,” explained LPL Financial Chief Market Strategist Ryan Detrick. “In fact, a year after a 5 month win streak has seen the S&amp;P 500 higher 25 of the past 26 times.”\n\n&gt; As shown in the LPL Chart of the Day, the S&amp;P 500 Index gained more than 35% during this 5 month win streak, the most ever. Yet, the future gains after 5 month win streaks is very impressive, higher 25 out of 26 times a year later. An object in motion tends to stay in motion and this sure seems to be the case here.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.2.20-blog-chart-3.png?ssl=1))**\n\n*****\n\n&gt; # Historic August Opens Door To Worst Month Of The Year\n\n&gt; What a month August has been so far, with the S&amp;P 500 Index up more than 7%, for the best August since 1984. Not to be outdone, this is the first time in history August saw two separate 6-day (or more) win streaks. Last, with one day to go, the S&amp;P 500 has gained 16 days so far this month, for the most since 16 in April 2019. Meanwhile, it is the most up days for any August since 2003.\n\n&gt; “Well, 2020 has laughed at many of these things, but be aware September is indeed the worst month of the year on average,” explained LPL Financial Chief Market Strategist Ryan Detrick. “But what caught our attention was both September and October have a negative return during election years, with October the worst month of the year. Could investors get election jitters again in 2020?”\n\n&gt; As show in the LPL Chart of the Day, September tends to be a weak month. In fact, it is the weakest month on average since 1950. Additionally, the last two times August was up more than 5% were 1986 and 2000; the S&amp;P 500 fell 8.5% and 5.4% in September those years.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/08/8.31.20-Blog-Chart-1.png?ssl=1))**\n\n&gt; Breaking things down by just an election year shows that August actually tends to be strong. That obviously played out this year, but now will the weakness we usually see in September and October play out?\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/08/8.31.20-Blog-Chart-2.png?ssl=1))**\n\n&gt; Finally, after today, the S&amp;P 500 will be up 5 consecutive months. Looking at the other years that saw a similar summer rallies, there tended to be more strength the final 4 months of the year, with only the Federal Reserve policy mistake of December 2018 blemishing this impressive track record.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/08/8.31.20-Blog-Chaert-3.png?ssl=1))**\n\n&gt; Yes, this record equity run is extremely stretched, but we would continue to use any pullbacks as an opportunity to add to longer-term core equity holdings, as the economy continues to come back quicker than most expected.\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.postimg.cc/GtFbRTWy/er1.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.postimg.cc/2yRCg7KY/ervol1.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 9.7.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE. U.S. MARKETS CLOSED IN OBSERVANCE OF LABOR DAY.)\n\n&gt; # ***Monday 9.7.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE. U.S. MARKETS CLOSED IN OBSERVANCE OF LABOR DAY.)\n\n*****\n\n&gt; # ***Tuesday  9.8.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/U3gzGVc.png))\n\n&gt; # ***Tuesday 9.8.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/KToPkBD.png))\n\n*****\n\n&gt; # ***Wednesday 9.9.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/0aK2q13.png))\n\n&gt; # ***Wednesday 9.9.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Ku04emu.png))\n\n*****\n\n&gt; # ***Thursday 9.10.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n&gt; # ***Thursday 9.10.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/T5g4xA6.png))\n\n*****\n\n&gt; # ***Friday 9.11.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Friday 9.11.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # Peloton Interactive $80.63\n**Peloton Interactive (PTON)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, September 10, 2020. The consensus earnings estimate is $0.10 per share on revenue of $566.53 million and the Earnings Whisper ® number is $0.13 per share. Investor sentiment going into the company's earnings release has 84% expecting an earnings beat The company's guidance was for revenue of $500.00 million to $520.00 million. Short interest has decreased by 62.5% since the company's last earnings release while the stock has drifted higher by 78.8% from its open following the earnings release to be 92.6% above its 200 day moving average of $41.86. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 11.6% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=PTON&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Slack Technologies, Inc. $29.07\n**Slack Technologies, Inc. (WORK)** is confirmed to report earnings at approximately 4:10 PM ET on Tuesday, September 8, 2020. The consensus estimate is for a loss of $0.03 per share on revenue of $208.33 million and the Earnings Whisper ® number is ($0.01) per share. Investor sentiment going into the company's earnings release has 75% expecting an earnings beat The company's guidance was for a loss of $0.04 to $0.03 per share on revenue of $206.00 million to $209.00 million. Consensus estimates are for year-over-year earnings growth of 96.94% with revenue increasing by 43.70%. Short interest has increased by 93.1% since the company's last earnings release while the stock has drifted lower by 8.5% from its open following the earnings release to be 6.8% above its 200 day moving average of $27.22. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 7.8% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=WORK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # lululemon athletica inc. $361.41\n**lululemon athletica inc. (LULU)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, September 8, 2020. The consensus earnings estimate is $0.56 per share on revenue of $832.92 million and the Earnings Whisper ® number is $0.60 per share. Investor sentiment going into the company's earnings release has 67% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 41.67% with revenue decreasing by 5.71%. Short interest has decreased by 16.0% since the company's last earnings release while the stock has drifted higher by 19.3% from its open following the earnings release to be 38.7% above its 200 day moving average of $260.62. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 11.0% move on earnings and the stock has averaged a 6.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LULU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Chewy, Inc. $61.18\n**Chewy, Inc. (CHWY)** is confirmed to report earnings at approximately 4:10 PM ET on Thursday, September 10, 2020. The consensus estimate is for a loss of $0.15 per share on revenue of $1.64 billion and the Earnings Whisper ® number is ($0.14) per share. Investor sentiment going into the company's earnings release has 81% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 28.57% with revenue increasing by 42.17%. Short interest has decreased by 5.4% since the company's last earnings release while the stock has drifted higher by 20.1% from its open following the earnings release to be 57.3% above its 200 day moving average of $38.89. Overall earnings estimates have been revised lower since the company's last earnings release. The stock has averaged a 5.3% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CHWY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Kroger Co. $35.47\n**Kroger Co. (KR)** is confirmed to report earnings at approximately 7:30 AM ET on Friday, September 11, 2020. The consensus earnings estimate is $0.50 per share on revenue of $29.66 billion and the Earnings Whisper ® number is $0.56 per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 13.64% with revenue increasing by 5.30%. Short interest has increased by 8.3% since the company's last earnings release while the stock has drifted higher by 9.7% from its open following the earnings release to be 13.1% above its 200 day moving average of $31.36. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, August 24, 2020 there was some notable buying of 2,648 contracts of the $33.00 put expiring on Friday, September 18, 2020. Option traders are pricing in a 7.5% move on earnings and the stock has averaged a 4.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=KR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Zscaler, Inc. $134.34\n**Zscaler, Inc. (ZS)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, September 9, 2020. The consensus earnings estimate is $0.03 per share on revenue of $118.41 million and the Earnings Whisper ® number is $0.05 per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat The company's guidance was for earnings of $0.02 to $0.03 per share on revenue of $117.00 million to $119.00 million. Consensus estimates are for earnings to decline year-over-year by 57.14% with revenue increasing by 37.51%. Short interest has decreased by 23.9% since the company's last earnings release while the stock has drifted higher by 54.3% from its open following the earnings release to be 68.5% above its 200 day moving average of $79.71. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, August 20, 2020 there was some notable buying of 1,017 contracts of the $115.00 put expiring on Friday, November 20, 2020. Option traders are pricing in a 17.9% move on earnings and the stock has averaged a 16.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ZS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Coupa Software $285.81\n**Coupa Software (COUP)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, September 8, 2020. The consensus earnings estimate is $0.08 per share on revenue of $118.84 million and the Earnings Whisper ® number is $0.14 per share. Investor sentiment going into the company's earnings release has 67% expecting an earnings beat The company's guidance was for earnings of $0.06 to $0.08 per share on revenue of $118.00 million to $119.00 million. Consensus estimates are for earnings to decline year-over-year by 11.11% with revenue increasing by 24.91%. Short interest has decreased by 12.9% since the company's last earnings release while the stock has drifted higher by 34.2% from its open following the earnings release to be 41.3% above its 200 day moving average of $202.31. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, August 17, 2020 there was some notable buying of 538 contracts of the $270.00 put expiring on Friday, September 18, 2020. Option traders are pricing in a 18.8% move on earnings and the stock has averaged a 8.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=COUP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Lovesac Company $29.44\n**Lovesac Company (LOVE)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, September 9, 2020. The consensus estimate is for a loss of $0.55 per share on revenue of $52.58 million and the Earnings Whisper ® number is ($0.46) per share. Investor sentiment going into the company's earnings release has 60% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 77.42% with revenue increasing by 9.21%. Short interest has decreased by 29.1% since the company's last earnings release while the stock has drifted higher by 41.0% from its open following the earnings release to be 74.7% above its 200 day moving average of $16.85. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 20.9% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LOVE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # American Eagle Outfitters, Inc. $12.86\n**American Eagle Outfitters, Inc. (AEO)** is confirmed to report earnings at approximately 8:00 AM ET on Wednesday, September 9, 2020. The consensus estimate is for a loss of $0.14 per share on revenue of $833.66 million and the Earnings Whisper ® number is ($0.11) per share. Investor sentiment going into the company's earnings release has 39% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 135.90% with revenue decreasing by 19.91%. Short interest has increased by 45.8% since the company's last earnings release while the stock has drifted higher by 13.8% from its open following the earnings release to be 11.4% above its 200 day moving average of $11.54. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, August 21, 2020 there was some notable buying of 5,605 contracts of the $11.00 call expiring on Friday, October 16, 2020. Option traders are pricing in a 13.8% move on earnings and the stock has averaged a 6.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AEO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # HealthEquity, Inc. $58.47\n**HealthEquity, Inc. (HQY)** is confirmed to report earnings at approximately 4:00 PM ET on Tuesday, September 8, 2020. The consensus earnings estimate is $0.27 per share on revenue of $171.32 million and the Earnings Whisper ® number is $0.31 per share. Investor sentiment going into the company's earnings release has 62% expecting an earnings beat The company's guidance was for earnings of $0.23 to $0.30 per share on revenue of $168.00 million to $173.00 million. Consensus estimates are for earnings to decline year-over-year by 40.00% with revenue increasing by 97.78%. Short interest has decreased by 3.6% since the company's last earnings release while the stock has drifted higher by 2.7% from its open following the earnings release to be 3.5% below its 200 day moving average of $60.62. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 9.9% move on earnings and the stock has averaged a 4.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HQY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming holiday-shortened trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/stocks.",
        "subreddit": "stocks",
        "title": "Wall Street Week Ahead for the trading week beginning September 7th, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/in3122/wall_street_week_ahead_for_the_trading_week/",
        "created": 1599348552.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1599319628,
        "id": "in2zt4",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "Good Friday evening to all of you here on r/wallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning September 7th, 2020.\n\n# **The stock market shakeout is likely not over yet, even with Friday’s comeback  - [(Source)](https://www.cnbc.com/2020/09/04/the-stock-market-shakeout-is-likely-not-over-yet-even-with-fridays-comeback.html)**\n*****\n&gt; The tech wreck is probably not over, despite Friday’s market comeback.\n*****\n&gt; Analysts expect the shakeout in stocks to continue after the long Labor Day weekend, especially in technology names and the Nasdaq, areas of the market that notched the sharpest gains.\n*****\n&gt; After August’s 7% gain in the S&amp;P 500, stocks started September strong, and then just as quickly rolled over. The Nasdaq lost 5% Thursday and was down sharply Friday but pared losses to decline 1.5%. The S&amp;P 500 was down about 2.3% for the week, even after a 3.5% loss Thursday.\n*****\n&gt; “I think this is a good wake-up call and a reminder that there are risks out there,” said Leo Grohowski, chief investment officer at BNY Mellon Wealth Management. “In August, we did take a little bit off the table.”\n*****\n&gt; Analysts expect the week ahead to be busy, with holidays ending and more market pros back at their desks. There is some economic data, most importantly Friday’s consumer price index. The reading on consumer inflation is expected to show little change in core inflation with forecasts for a gain of just 0.2% in August, or 1.6% year over year.\n*****\n&gt; # Froth blowing off\n&gt; The stock sell-off came as market pros were becoming increasingly wary of froth in the market, particularly in tech and momentum names. On Friday, it was revealed that SoftBank was behind billions in large options bets on individual tech stocks, like Amazon, Microsoft, Apple and Tesla. News reports said the trades were made over the past month, and SoftBank had been building unusually large positions in call options, or those that bet the prices of underlying stocks would rise.\n*****\n&gt; One analyst said the fact that SoftBank was “gunning the market” makes him worry that there is more selling to come in Nasdaq names. As SoftBank bought call options, the sellers had to buy stocks, conceivably driving up prices in a trading feedback loop.\n*****\n&gt; “It’s just a trip to the casino,” said Peter Boockvar, chief investment officer at Bleakley Advisory Group. “If they’re supposed to be an investment company taking a long-term horizon, then trying to juice your short-term return through options, you’ve turned into a hedge fund.”\n*****\n&gt; JPMorgan strategists said they expect the market to recover gradually, but there are still presidential election uncertainties looming in the next couple of months.\n*****\n&gt; “The significant reduction in previously extreme long positions in Nasdaq by momentum traders should allow the equity market to recover over the coming weeks, as happened after the June 11th correction,” noted JPMorgan analysts. “But a repeat of the strong gains seen during July and August is less likely over the next two months.”\n*****\n&gt; Grohowski said there could be more selling in the tech and internet companies, or those that were viewed did well as workers stayed home and the economy was shutdown. “It’s not the start of a big lasting correction, but a forewarning the next couple of weeks and months are going to be choppy. I think it’s going to be a sideways kind of market,” Grohowski said. He added the market could be choppy in the week ahead.\n*****\n&gt; “We’re a little more cautious, not to mention the market is trading at 23 times our earnings estimates for 2021,” said Grohowski. He said the fact there is about $4.5 trillion in money market funds is a bullish signm since that money could find its way into the stock market.\n*****\n&gt; Julian Emanuel, head of equities and derivatives strategy at BTIG, said the S&amp;P 500 could dip to its 200-day moving average, or 3,092, before rebounding, which would be about a 15% move in total.\n*****\n&gt; “I don’t think the sell-off is over. Nasdaq is up 83%s since March 23, the S&amp;P is up 63%,” said Emanuel.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/34qCxpv.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/1u5feMS.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/WfvTGox.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.postimg.cc/sDw87zF7/econcal1.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/bUFp72p.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/cgvDyfD.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/SJ4plDu.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/g1WP8F6.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.postimg.cc/GtFbRTWy/er1.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/NcrK823.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/NkAezup.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/D3X10mF.png))**\n\n*****\n\n&gt; # Small Caps Best Day After Labor Day\n\n&gt; In the last 21 years, only Russell 2000 has registered an average gain of 0.16% on the Tuesday after the long Labor Day weekend. DJIA, S&amp;P 500 and NASDAQ have struggled with negative average performance. NASDAQ and Russell 2000 have been up five of the last eight years, but DJIA, S&amp;P 500, NASDAQ and Russell 2000 all have fallen for the last three years on Tuesday. On Wednesday the market’s performance has been varied. DJIA has performed the best, up 76.2% of the time with an average gain of 0.25%. S&amp;P 500 is worst, up only 42.9% of the time with an average gain of 0.13%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/1422a049f2b0dbca39b1543c5cff0a42/172c7870552d9912-60/s500x750/ff92c03e01c3e886a523a64381a9c44745538da2.jpg))**\n\n*****\n\n&gt; # Big August: Bullish or Bearish?\n\n&gt; Big August 2020 logged the 4th biggest August percent gain for the S&amp;P 500 since 1949 and the 6th biggest since 1930. But, is this bullish or bearish for the market in the coming months? Hopefully the table below provides some perspective by comparing the previous Top 20 S&amp;P 500 Augusts since 1949 to July, September, Q4 and the succeeding “Best Six Months” November-April.\n\n&gt; Subsequent Septembers were down 15 of 20 years for an average loss of -1.0% (median loss of -0.7%). Q4 is positive with gains in 13 of the 20 years for an average gain of 1.0% (median gain of 3.0%). The following Best Six Months are more bullish, up 16 of the 20 years with an average gain of 7.6% (median gain of 8.5%).\n\n&gt; Looking at just the 7 years that were preceded by big Julys shows some improvement for September but Q4s are worse, containing the largest Q4 losses. Back-to-back big Julys and big Augusts were followed by improved Best Six Months results, up in all 7 instances with a higher average and median gain and the top gain.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/7bd7299f2e7714adc709577da928964e/bd54fb998db4a9e1-46/s1280x1920/3363ff03bfc2dead6e88b387771b6bbad2aafece.jpg))**\n\n*****\n\n&gt; # Analyzing the Jobs Report\n\n&gt; The jobs market remains strong, as the August nonfarm payrolls came in at a solid 1.37 million jobs created, right in line with expectations. This was the fourth consecutive month of gains, up 10.6 million over this time frame. In March and April more than 22 million jobs were lost, so we still aren’t quite to half of the jobs recovered though.\n\n&gt; This was the second consecutive month there was a very weak ADP private payrolls number ahead of the monthly jobs report, adding to the worries, but the actual nonfarm payroll number was once again quite solid. Don’t forget, just yesterday we saw initial jobless claims come in at 881,000, the lowest number since the week ending March 14, another improving employment number.\n\n&gt; The big surprise in today’s report though was the unemployment rate fell to 8.4%, from 10.2% last month and an expected 9.8%. This was the lowest unemployment rate since 4.4% in March.\n\n&gt; “This was an impressive report and once again showed the economy remained quite resilient,” explained LPL Financial Chief Market Strategist Ryan Detrick. “But 8% unemployment is 8% unemployment, so let’s not get too excited, but we’ll still take this improving trend in the employment picture.”\n\n&gt; As shown in the LPL Chart of the Day, even though more than 10 million jobs have been created in the past four months, the sad truth is we are still quite a long way from recovering all the jobs lost due to the pandemic. In fact, looking at previous cycles, it has taken years for all of the lost jobs to come back and this time doesn’t appear any different.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/09/Blog-9.4.20.png?ssl=1))**\n\n&gt; One thing to consider is could this solid number make it harder for Washington to agree on the next stimulus plan? We are watching this closely, but with the two sides still close to a trillion dollars apart, today’s report will likely do little to help the two sides come to a quick resolution.\n\n&gt; Last, don’t forget that stocks gained more than 60% in less than six months, so some weakness would be perfectly normal. In fact, looking at the two previous strongest starts to a bull market ever (’82 and ’09) both saw some weakness right around now.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/09/Blog-9.4.20-2.png?ssl=1))**\n\n*****\n\n&gt; # 3 Charts To Watch If You Are Bullish\n\n&gt; The S&amp;P 500 Index just closed the door on its best August since 1986, making new all-time highs along the way, while also closing up five months in a row.\n\n&gt; First things first, make no mistake about it; this is a new bull market. That of course doesn’t mean it will last years like previous bull markets, but a nearly 57% gain in 5 months is what we’d classify as a bull market.\n\n&gt; Here are all the bull markets going back to the Great Depression and where this one ranks.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.2.20-blog-chart-1.png?ssl=1))**\n\n&gt; Now let’s dig into the 5 month win streak. It is quite rare for stocks to gain from April through August, as the summer months tend to be somewhat tricky. Yet, we found there were six other years that saw these 5 months all close higher and the rest of the year was higher five times, with some solid returns in there. In fact, the only year that was lower the rest of the year was 2018, mainly due to the Fed policy mistake in December 2018.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.2.20-blog-chart-2.png?ssl=1))**\n\n&gt; “What might surprise many investors is 5 month win streaks are actually incredibly bullish going forward,” explained LPL Financial Chief Market Strategist Ryan Detrick. “In fact, a year after a 5 month win streak has seen the S&amp;P 500 higher 25 of the past 26 times.”\n\n&gt; As shown in the LPL Chart of the Day, the S&amp;P 500 Index gained more than 35% during this 5 month win streak, the most ever. Yet, the future gains after 5 month win streaks is very impressive, higher 25 out of 26 times a year later. An object in motion tends to stay in motion and this sure seems to be the case here.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.2.20-blog-chart-3.png?ssl=1))**\n\n*****\n\n&gt; # Historic August Opens Door To Worst Month Of The Year\n\n&gt; What a month August has been so far, with the S&amp;P 500 Index up more than 7%, for the best August since 1984. Not to be outdone, this is the first time in history August saw two separate 6-day (or more) win streaks. Last, with one day to go, the S&amp;P 500 has gained 16 days so far this month, for the most since 16 in April 2019. Meanwhile, it is the most up days for any August since 2003.\n\n&gt; “Well, 2020 has laughed at many of these things, but be aware September is indeed the worst month of the year on average,” explained LPL Financial Chief Market Strategist Ryan Detrick. “But what caught our attention was both September and October have a negative return during election years, with October the worst month of the year. Could investors get election jitters again in 2020?”\n\n&gt; As show in the LPL Chart of the Day, September tends to be a weak month. In fact, it is the weakest month on average since 1950. Additionally, the last two times August was up more than 5% were 1986 and 2000; the S&amp;P 500 fell 8.5% and 5.4% in September those years.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/08/8.31.20-Blog-Chart-1.png?ssl=1))**\n\n&gt; Breaking things down by just an election year shows that August actually tends to be strong. That obviously played out this year, but now will the weakness we usually see in September and October play out?\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/08/8.31.20-Blog-Chart-2.png?ssl=1))**\n\n&gt; Finally, after today, the S&amp;P 500 will be up 5 consecutive months. Looking at the other years that saw a similar summer rallies, there tended to be more strength the final 4 months of the year, with only the Federal Reserve policy mistake of December 2018 blemishing this impressive track record.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/08/8.31.20-Blog-Chaert-3.png?ssl=1))**\n\n&gt; Yes, this record equity run is extremely stretched, but we would continue to use any pullbacks as an opportunity to add to longer-term core equity holdings, as the economy continues to come back quicker than most expected.\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.postimg.cc/GtFbRTWy/er1.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.postimg.cc/2yRCg7KY/ervol1.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 9.7.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE. U.S. MARKETS CLOSED IN OBSERVANCE OF LABOR DAY.)\n\n&gt; # ***Monday 9.7.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE. U.S. MARKETS CLOSED IN OBSERVANCE OF LABOR DAY.)\n\n*****\n\n&gt; # ***Tuesday  9.8.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/U3gzGVc.png))\n\n&gt; # ***Tuesday 9.8.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/KToPkBD.png))\n\n*****\n\n&gt; # ***Wednesday 9.9.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/0aK2q13.png))\n\n&gt; # ***Wednesday 9.9.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Ku04emu.png))\n\n*****\n\n&gt; # ***Thursday 9.10.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n&gt; # ***Thursday 9.10.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/T5g4xA6.png))\n\n*****\n\n&gt; # ***Friday 9.11.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Friday 9.11.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # Peloton Interactive $80.63\n**Peloton Interactive (PTON)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, September 10, 2020. The consensus earnings estimate is $0.10 per share on revenue of $566.53 million and the Earnings Whisper ® number is $0.13 per share. Investor sentiment going into the company's earnings release has 84% expecting an earnings beat The company's guidance was for revenue of $500.00 million to $520.00 million. Short interest has decreased by 62.5% since the company's last earnings release while the stock has drifted higher by 78.8% from its open following the earnings release to be 92.6% above its 200 day moving average of $41.86. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 11.6% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=PTON&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Slack Technologies, Inc. $29.07\n**Slack Technologies, Inc. (WORK)** is confirmed to report earnings at approximately 4:10 PM ET on Tuesday, September 8, 2020. The consensus estimate is for a loss of $0.03 per share on revenue of $208.33 million and the Earnings Whisper ® number is ($0.01) per share. Investor sentiment going into the company's earnings release has 75% expecting an earnings beat The company's guidance was for a loss of $0.04 to $0.03 per share on revenue of $206.00 million to $209.00 million. Consensus estimates are for year-over-year earnings growth of 96.94% with revenue increasing by 43.70%. Short interest has increased by 93.1% since the company's last earnings release while the stock has drifted lower by 8.5% from its open following the earnings release to be 6.8% above its 200 day moving average of $27.22. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 7.8% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=WORK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # lululemon athletica inc. $361.41\n**lululemon athletica inc. (LULU)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, September 8, 2020. The consensus earnings estimate is $0.56 per share on revenue of $832.92 million and the Earnings Whisper ® number is $0.60 per share. Investor sentiment going into the company's earnings release has 67% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 41.67% with revenue decreasing by 5.71%. Short interest has decreased by 16.0% since the company's last earnings release while the stock has drifted higher by 19.3% from its open following the earnings release to be 38.7% above its 200 day moving average of $260.62. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 11.0% move on earnings and the stock has averaged a 6.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LULU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Chewy, Inc. $61.18\n**Chewy, Inc. (CHWY)** is confirmed to report earnings at approximately 4:10 PM ET on Thursday, September 10, 2020. The consensus estimate is for a loss of $0.15 per share on revenue of $1.64 billion and the Earnings Whisper ® number is ($0.14) per share. Investor sentiment going into the company's earnings release has 81% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 28.57% with revenue increasing by 42.17%. Short interest has decreased by 5.4% since the company's last earnings release while the stock has drifted higher by 20.1% from its open following the earnings release to be 57.3% above its 200 day moving average of $38.89. Overall earnings estimates have been revised lower since the company's last earnings release. The stock has averaged a 5.3% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CHWY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Kroger Co. $35.47\n**Kroger Co. (KR)** is confirmed to report earnings at approximately 7:30 AM ET on Friday, September 11, 2020. The consensus earnings estimate is $0.50 per share on revenue of $29.66 billion and the Earnings Whisper ® number is $0.56 per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 13.64% with revenue increasing by 5.30%. Short interest has increased by 8.3% since the company's last earnings release while the stock has drifted higher by 9.7% from its open following the earnings release to be 13.1% above its 200 day moving average of $31.36. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, August 24, 2020 there was some notable buying of 2,648 contracts of the $33.00 put expiring on Friday, September 18, 2020. Option traders are pricing in a 7.5% move on earnings and the stock has averaged a 4.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=KR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Zscaler, Inc. $134.34\n**Zscaler, Inc. (ZS)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, September 9, 2020. The consensus earnings estimate is $0.03 per share on revenue of $118.41 million and the Earnings Whisper ® number is $0.05 per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat The company's guidance was for earnings of $0.02 to $0.03 per share on revenue of $117.00 million to $119.00 million. Consensus estimates are for earnings to decline year-over-year by 57.14% with revenue increasing by 37.51%. Short interest has decreased by 23.9% since the company's last earnings release while the stock has drifted higher by 54.3% from its open following the earnings release to be 68.5% above its 200 day moving average of $79.71. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, August 20, 2020 there was some notable buying of 1,017 contracts of the $115.00 put expiring on Friday, November 20, 2020. Option traders are pricing in a 17.9% move on earnings and the stock has averaged a 16.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ZS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Coupa Software $285.81\n**Coupa Software (COUP)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, September 8, 2020. The consensus earnings estimate is $0.08 per share on revenue of $118.84 million and the Earnings Whisper ® number is $0.14 per share. Investor sentiment going into the company's earnings release has 67% expecting an earnings beat The company's guidance was for earnings of $0.06 to $0.08 per share on revenue of $118.00 million to $119.00 million. Consensus estimates are for earnings to decline year-over-year by 11.11% with revenue increasing by 24.91%. Short interest has decreased by 12.9% since the company's last earnings release while the stock has drifted higher by 34.2% from its open following the earnings release to be 41.3% above its 200 day moving average of $202.31. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, August 17, 2020 there was some notable buying of 538 contracts of the $270.00 put expiring on Friday, September 18, 2020. Option traders are pricing in a 18.8% move on earnings and the stock has averaged a 8.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=COUP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Lovesac Company $29.44\n**Lovesac Company (LOVE)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, September 9, 2020. The consensus estimate is for a loss of $0.55 per share on revenue of $52.58 million and the Earnings Whisper ® number is ($0.46) per share. Investor sentiment going into the company's earnings release has 60% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 77.42% with revenue increasing by 9.21%. Short interest has decreased by 29.1% since the company's last earnings release while the stock has drifted higher by 41.0% from its open following the earnings release to be 74.7% above its 200 day moving average of $16.85. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 20.9% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LOVE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # American Eagle Outfitters, Inc. $12.86\n**American Eagle Outfitters, Inc. (AEO)** is confirmed to report earnings at approximately 8:00 AM ET on Wednesday, September 9, 2020. The consensus estimate is for a loss of $0.14 per share on revenue of $833.66 million and the Earnings Whisper ® number is ($0.11) per share. Investor sentiment going into the company's earnings release has 39% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 135.90% with revenue decreasing by 19.91%. Short interest has increased by 45.8% since the company's last earnings release while the stock has drifted higher by 13.8% from its open following the earnings release to be 11.4% above its 200 day moving average of $11.54. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, August 21, 2020 there was some notable buying of 5,605 contracts of the $11.00 call expiring on Friday, October 16, 2020. Option traders are pricing in a 13.8% move on earnings and the stock has averaged a 6.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AEO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # HealthEquity, Inc. $58.47\n**HealthEquity, Inc. (HQY)** is confirmed to report earnings at approximately 4:00 PM ET on Tuesday, September 8, 2020. The consensus earnings estimate is $0.27 per share on revenue of $171.32 million and the Earnings Whisper ® number is $0.31 per share. Investor sentiment going into the company's earnings release has 62% expecting an earnings beat The company's guidance was for earnings of $0.23 to $0.30 per share on revenue of $168.00 million to $173.00 million. Consensus estimates are for earnings to decline year-over-year by 40.00% with revenue increasing by 97.78%. Short interest has decreased by 3.6% since the company's last earnings release while the stock has drifted higher by 2.7% from its open following the earnings release to be 3.5% below its 200 day moving average of $60.62. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 9.9% move on earnings and the stock has averaged a 4.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HQY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming holiday-shortened trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/wallstreetbets.",
        "subreddit": "wallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning September 7th, 2020",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/in2zt4/wall_street_week_ahead_for_the_trading_week/",
        "created": 1599348428.0
    },
    {
        "author": "ThetaGangFeedsMyFam",
        "created_utc": 1601083950,
        "id": "izwkis",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "Monday 9/28 \n\nAlibaba Group Holding hosts a virtual Investor Day that continues through Wednesday. Speakers will include CEO Daniel Zhang. \n\nThe Federal Reserve Bank of Dallas releases its Texas Manufacturing Outlook survey for September. The consensus estimate is for an 8.3 reading, roughly even with the August figure. \n\nTuesday 9/29 \n\nIHS Markit, McCormick, and Micron Technology report earnings. \n\nThe first of three presidential debates between president Donald Trump and former vice president Joe Biden takes place at Case Western Reserve University in Cleveland. \n\nThe Conference Board releases its Consumer Confidence Index for September. Economists forecast a 90 reading, higher than August's 84.8. The postpandemic high for the index was 91.7 in July. \n\nWednesday 9/30 \n\nADP releases its National Employment Report for September. The economy is expected to add 625,000 private-sector jobs, up from 428,000 in August. Since shedding almost 20 million jobs in March and April, 43% of that total, or 8.5 million jobs, have been regained, according to ADP. \n\nThe Bureau of Economic Analysis reports its final estimate for second-quarter gross domestic product. The economy is forecast to have shrunk at an annual rate 31.7%, which would be unchanged from the BEA's second estimate released in late August. \n\nThe National Association of Realtors releases its Pending Home Sales Index for August. Consensus estimate is for a 2.3% rise, a deceleration from July's 5.9%. Home sales are in the midst of a V-shape recovery, with sellers seeing their homes going under contract in record time, according to Lawrence Yun, the NAR's chief economist. \n\nThe Institute for Supply Management releases its Chicago Purchasing Managers' Index for September. Economists forecast a 52.1 reading, slightly higher than August's 51.2. \n\nThursday 10/1 \n\nConagra Brands, Constellation Brands, and PepsiCo report quarterly results. \n\nThe BEA reports personal income and spending for August. Income is expected to decline 2.8% month over month, while consumption is seen rising 0.9%. This compares with gains of 0.4% and 1.9%, respectively, in July. \n\nFriday 10/2 \n\nNoble Energy holds a special shareholder meeting seeking approval for its proposed merger with Chevron, which would acquire all outstanding shares of Noble. The all-stock transaction, with an enterprise value of $13 billion, was first announced in late July. \n\n [http://www.barrons.com/subscribe](http://www.barrons.com/subscribe)",
        "subreddit": "wallstreetbets",
        "title": "Next Week (9/28), per Barron's",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/izwkis/next_week_928_per_barrons/",
        "created": 1601112750.0
    },
    {
        "author": "relias119",
        "created_utc": 1599159543,
        "id": "ilzqa5",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "The fed has been having some concerning news recently, and we are on track for another bad day tommorow. The beige book isnt looking promising, private payroll data from ADP published today showed that 428,000 jobs were added this month. That is up from the 212,000 of last month, but is way below the 1 million jobs wall st expected. With this news coming out, the only way that I see this reversing is papa trump making some tweets or uncle JPOW coming out tommorow with his money printer and pissing on everyone with cash. Unless the fed makes some Bullshit claims like unemployment is no more and there is no recession nor inflation, then the news will probably not be good and hence the drop.",
        "subreddit": "wallstreetbets",
        "title": "The SPY is on track to be down again tommorow. Hold on to your puts",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ilzqa5/the_spy_is_on_track_to_be_down_again_tommorow/",
        "created": 1599188343.0
    },
    {
        "author": "jon_snow3445",
        "created_utc": 1599079899,
        "id": "ilfchc",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2020/09/02/private-payrolls-grow-by-428000-but-miss-expectations-adp-report-says.html\n\nGreen today even with the news. It’s becoming more apparent that the economy has in fact stalled( like the FED) has been saying.",
        "subreddit": "stocks",
        "title": "Private payrolls rose by 428,000 in August,coming short of expected 1.17 million",
        "url": "https://www.reddit.com/r/stocks/comments/ilfchc/private_payrolls_rose_by_428000_in_augustcoming/",
        "created": 1599108699.0
    },
    {
        "author": "NoeticOptions",
        "created_utc": 1601420347,
        "id": "j2a9ed",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "## Daily Synopsis \n\n* The S&amp;P 500 -0.55% today while the NASDaq decreased by (-0.5%). The Russell 2000 closed lower by (-0.45%). The Dow ended in negative territory at (-0.54%)\n* The best performing sector was Communication Services(+0.1%) while Energy(-2.75%)was the worst performer.\n* The Philadelphia Semiconductor Index (+0.2%) also eked out a gain. Micron (MU 50.71, +0.99, +2.0%) rose 2% ahead of its earnings report after the close. \n* In other developments, the S&amp;P 500's 50-day moving average (3355) provided technical resistance for the second straight day, the Conference Board's Consumer Confidence Index jumped to 101.8 in September (consensus 88.5) from an upwardly revised 86.3 (from 84.8) in August, and House Democrats introduced a $2.2 trillion stimulus bill.\n* While the $2.2 trillion price tag is still considered too high by Republicans, reports indicated that House Speaker Pelosi will continue talks with Treasury Secretary Mnuchin on Wednesday. With that said, the lack of a fiscal relief bill did not suppress consumer confidence this month due to an improving economy and lower coronavirus infection rates. \n* Looking ahead, investors will receive the ADP Employment Change Report for September, the Chicago PMI for September, the third estimate for Q2 GDP, Pending Home Sales for August, and the weekly MBA Mortgage Applications Index on Wednesday.\n\n## Index Summary\n\n**S&amp;P 500 :** (-0.55%);  **NasDaq :** (-0.5%);  \n**Russell 2000 :**(-0.45%);  **Dow :**(-0.54%);  \n**Vix :**26.19 (+0.31%); \\[-2.2%\\]; {+0.88%}\n\n## Sectors Summary \n\n*Three highest sectors for today were -*  \n**Communication Services:** (+0.1%); **Utilities:** (-0.03%); **Health Care:** (-0.12%)  \n*Three lowest sectors for today were -*  \n**Energy:** (-2.75%); **Financials:** (-1.25%); **Industrials:** (-0.89%)  \n\n\n## Commodities/Futures\n\n(1-day %), \\[5-day %\\], {10-day %}\n\n***Currency -***  \n**USD Index :**94.302 (-0.41%); \\[-0.5%\\]; {+1.04%}  \n**BC :**10815 (+0.18%); \\[+1.55%\\]; {-0.41%}\n\n***Precious Metals -***  \n**Gold :**1903.2 (0.0%); \\[+1.87%\\]; {-2.5%}  \n**Silver :**24.445 (-0.04%); \\[+5.7%\\]; {-9.59%}\n\n***Farming -***  \n**Soybeans :**993 (-0.13%); \\[-0.82%\\]; {-4.96%}  \n**Corn :**364.75 (-0.07%); \\[+0.28%\\]; {-3.7%}  \n**Coffee :**109.55 (+0.05%); \\[-1.39%\\]; {-3.52%}\n\n***Industrials -***  \n**Crude :**39.29 (-0.43%); \\[-2.95%\\]; {-4.84%}  \n**Nat Gas :**2.561 (-2.07%); \\[+11.57%\\]; {+22.46%}  \n**Copper :**2.99 (+0.28%); \\[+0.99%\\]; {-3.69%}\n\n## Dark Pool Summary\n\nHighest Dark Pool buys by rank -  \n1. NVS 5 buys totalling 1,534,000 shares. Average Price : 87.28, Cost : $133,872,560  \n2. AAPL 6 buys totalling 1,136,645 shares. Average Price : 114.39, Cost : $130,031,419  \n3.MSFT 1 buys totalling 379,466 shares. Average Price : 208.19, Cost : $78,999,471  \n4.MTCH 2 buys totalling 721,296 shares. Average Price : 108.48, Cost : $78,220,368  \n5. SNOW 1 buys totalling 180,000 shares. Average Price : 252.0, Cost : $45,360,000  \n\n\n## Options Fast Facts\n\n***CBOE Put/Call Ratio -*** 0.45  \n***Highest Multiple Over Daily Average -*** FIT with 10x the ADV of 5236. There were 46800 calls and 6150 puts.  \n***Ticker with Most Contracts -***NIO with 801821 contracts traded today with an AVD of 357013. There were 675386 calls and 126435 puts.  \n***Largest Put / Call Ratio -*** OVV with a 75 P/C ratio. There were 35135puts and 468 calls.  \n***Largest Call / Put Ratio -*** KNDI with a26 C/P ratio. There were 30657 calls and 1188 puts.  \n\n\n\\*Stocks must be &gt;$6, Highest Multiple must have &gt;1k ADV, Largest ratios must have an option volume &gt;10k",
        "subreddit": "wallstreetbets",
        "title": "Market and Options Summary for September 29, 2020 -",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j2a9ed/market_and_options_summary_for_september_29_2020/",
        "created": 1601449147.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1599319849,
        "id": "in322p",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Good Friday evening to all of you here on r/smallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning September 7th, 2020.\n\n# **The stock market shakeout is likely not over yet, even with Friday’s comeback  - [(Source)](https://www.cnbc.com/2020/09/04/the-stock-market-shakeout-is-likely-not-over-yet-even-with-fridays-comeback.html)**\n*****\n&gt; The tech wreck is probably not over, despite Friday’s market comeback.\n*****\n&gt; Analysts expect the shakeout in stocks to continue after the long Labor Day weekend, especially in technology names and the Nasdaq, areas of the market that notched the sharpest gains.\n*****\n&gt; After August’s 7% gain in the S&amp;P 500, stocks started September strong, and then just as quickly rolled over. The Nasdaq lost 5% Thursday and was down sharply Friday but pared losses to decline 1.5%. The S&amp;P 500 was down about 2.3% for the week, even after a 3.5% loss Thursday.\n*****\n&gt; “I think this is a good wake-up call and a reminder that there are risks out there,” said Leo Grohowski, chief investment officer at BNY Mellon Wealth Management. “In August, we did take a little bit off the table.”\n*****\n&gt; Analysts expect the week ahead to be busy, with holidays ending and more market pros back at their desks. There is some economic data, most importantly Friday’s consumer price index. The reading on consumer inflation is expected to show little change in core inflation with forecasts for a gain of just 0.2% in August, or 1.6% year over year.\n*****\n&gt; # Froth blowing off\n&gt; The stock sell-off came as market pros were becoming increasingly wary of froth in the market, particularly in tech and momentum names. On Friday, it was revealed that SoftBank was behind billions in large options bets on individual tech stocks, like Amazon, Microsoft, Apple and Tesla. News reports said the trades were made over the past month, and SoftBank had been building unusually large positions in call options, or those that bet the prices of underlying stocks would rise.\n*****\n&gt; One analyst said the fact that SoftBank was “gunning the market” makes him worry that there is more selling to come in Nasdaq names. As SoftBank bought call options, the sellers had to buy stocks, conceivably driving up prices in a trading feedback loop.\n*****\n&gt; “It’s just a trip to the casino,” said Peter Boockvar, chief investment officer at Bleakley Advisory Group. “If they’re supposed to be an investment company taking a long-term horizon, then trying to juice your short-term return through options, you’ve turned into a hedge fund.”\n*****\n&gt; JPMorgan strategists said they expect the market to recover gradually, but there are still presidential election uncertainties looming in the next couple of months.\n*****\n&gt; “The significant reduction in previously extreme long positions in Nasdaq by momentum traders should allow the equity market to recover over the coming weeks, as happened after the June 11th correction,” noted JPMorgan analysts. “But a repeat of the strong gains seen during July and August is less likely over the next two months.”\n*****\n&gt; Grohowski said there could be more selling in the tech and internet companies, or those that were viewed did well as workers stayed home and the economy was shutdown. “It’s not the start of a big lasting correction, but a forewarning the next couple of weeks and months are going to be choppy. I think it’s going to be a sideways kind of market,” Grohowski said. He added the market could be choppy in the week ahead.\n*****\n&gt; “We’re a little more cautious, not to mention the market is trading at 23 times our earnings estimates for 2021,” said Grohowski. He said the fact there is about $4.5 trillion in money market funds is a bullish signm since that money could find its way into the stock market.\n*****\n&gt; Julian Emanuel, head of equities and derivatives strategy at BTIG, said the S&amp;P 500 could dip to its 200-day moving average, or 3,092, before rebounding, which would be about a 15% move in total.\n*****\n&gt; “I don’t think the sell-off is over. Nasdaq is up 83%s since March 23, the S&amp;P is up 63%,” said Emanuel.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/34qCxpv.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/1u5feMS.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/WfvTGox.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.postimg.cc/sDw87zF7/econcal1.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/bUFp72p.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/cgvDyfD.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/SJ4plDu.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/g1WP8F6.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.postimg.cc/GtFbRTWy/er1.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/NcrK823.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/NkAezup.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/D3X10mF.png))**\n\n*****\n\n&gt; # Small Caps Best Day After Labor Day\n\n&gt; In the last 21 years, only Russell 2000 has registered an average gain of 0.16% on the Tuesday after the long Labor Day weekend. DJIA, S&amp;P 500 and NASDAQ have struggled with negative average performance. NASDAQ and Russell 2000 have been up five of the last eight years, but DJIA, S&amp;P 500, NASDAQ and Russell 2000 all have fallen for the last three years on Tuesday. On Wednesday the market’s performance has been varied. DJIA has performed the best, up 76.2% of the time with an average gain of 0.25%. S&amp;P 500 is worst, up only 42.9% of the time with an average gain of 0.13%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/1422a049f2b0dbca39b1543c5cff0a42/172c7870552d9912-60/s500x750/ff92c03e01c3e886a523a64381a9c44745538da2.jpg))**\n\n*****\n\n&gt; # Big August: Bullish or Bearish?\n\n&gt; Big August 2020 logged the 4th biggest August percent gain for the S&amp;P 500 since 1949 and the 6th biggest since 1930. But, is this bullish or bearish for the market in the coming months? Hopefully the table below provides some perspective by comparing the previous Top 20 S&amp;P 500 Augusts since 1949 to July, September, Q4 and the succeeding “Best Six Months” November-April.\n\n&gt; Subsequent Septembers were down 15 of 20 years for an average loss of -1.0% (median loss of -0.7%). Q4 is positive with gains in 13 of the 20 years for an average gain of 1.0% (median gain of 3.0%). The following Best Six Months are more bullish, up 16 of the 20 years with an average gain of 7.6% (median gain of 8.5%).\n\n&gt; Looking at just the 7 years that were preceded by big Julys shows some improvement for September but Q4s are worse, containing the largest Q4 losses. Back-to-back big Julys and big Augusts were followed by improved Best Six Months results, up in all 7 instances with a higher average and median gain and the top gain.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/7bd7299f2e7714adc709577da928964e/bd54fb998db4a9e1-46/s1280x1920/3363ff03bfc2dead6e88b387771b6bbad2aafece.jpg))**\n\n*****\n\n&gt; # Analyzing the Jobs Report\n\n&gt; The jobs market remains strong, as the August nonfarm payrolls came in at a solid 1.37 million jobs created, right in line with expectations. This was the fourth consecutive month of gains, up 10.6 million over this time frame. In March and April more than 22 million jobs were lost, so we still aren’t quite to half of the jobs recovered though.\n\n&gt; This was the second consecutive month there was a very weak ADP private payrolls number ahead of the monthly jobs report, adding to the worries, but the actual nonfarm payroll number was once again quite solid. Don’t forget, just yesterday we saw initial jobless claims come in at 881,000, the lowest number since the week ending March 14, another improving employment number.\n\n&gt; The big surprise in today’s report though was the unemployment rate fell to 8.4%, from 10.2% last month and an expected 9.8%. This was the lowest unemployment rate since 4.4% in March.\n\n&gt; “This was an impressive report and once again showed the economy remained quite resilient,” explained LPL Financial Chief Market Strategist Ryan Detrick. “But 8% unemployment is 8% unemployment, so let’s not get too excited, but we’ll still take this improving trend in the employment picture.”\n\n&gt; As shown in the LPL Chart of the Day, even though more than 10 million jobs have been created in the past four months, the sad truth is we are still quite a long way from recovering all the jobs lost due to the pandemic. In fact, looking at previous cycles, it has taken years for all of the lost jobs to come back and this time doesn’t appear any different.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/09/Blog-9.4.20.png?ssl=1))**\n\n&gt; One thing to consider is could this solid number make it harder for Washington to agree on the next stimulus plan? We are watching this closely, but with the two sides still close to a trillion dollars apart, today’s report will likely do little to help the two sides come to a quick resolution.\n\n&gt; Last, don’t forget that stocks gained more than 60% in less than six months, so some weakness would be perfectly normal. In fact, looking at the two previous strongest starts to a bull market ever (’82 and ’09) both saw some weakness right around now.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/09/Blog-9.4.20-2.png?ssl=1))**\n\n*****\n\n&gt; # 3 Charts To Watch If You Are Bullish\n\n&gt; The S&amp;P 500 Index just closed the door on its best August since 1986, making new all-time highs along the way, while also closing up five months in a row.\n\n&gt; First things first, make no mistake about it; this is a new bull market. That of course doesn’t mean it will last years like previous bull markets, but a nearly 57% gain in 5 months is what we’d classify as a bull market.\n\n&gt; Here are all the bull markets going back to the Great Depression and where this one ranks.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.2.20-blog-chart-1.png?ssl=1))**\n\n&gt; Now let’s dig into the 5 month win streak. It is quite rare for stocks to gain from April through August, as the summer months tend to be somewhat tricky. Yet, we found there were six other years that saw these 5 months all close higher and the rest of the year was higher five times, with some solid returns in there. In fact, the only year that was lower the rest of the year was 2018, mainly due to the Fed policy mistake in December 2018.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.2.20-blog-chart-2.png?ssl=1))**\n\n&gt; “What might surprise many investors is 5 month win streaks are actually incredibly bullish going forward,” explained LPL Financial Chief Market Strategist Ryan Detrick. “In fact, a year after a 5 month win streak has seen the S&amp;P 500 higher 25 of the past 26 times.”\n\n&gt; As shown in the LPL Chart of the Day, the S&amp;P 500 Index gained more than 35% during this 5 month win streak, the most ever. Yet, the future gains after 5 month win streaks is very impressive, higher 25 out of 26 times a year later. An object in motion tends to stay in motion and this sure seems to be the case here.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.2.20-blog-chart-3.png?ssl=1))**\n\n*****\n\n&gt; # Historic August Opens Door To Worst Month Of The Year\n\n&gt; What a month August has been so far, with the S&amp;P 500 Index up more than 7%, for the best August since 1984. Not to be outdone, this is the first time in history August saw two separate 6-day (or more) win streaks. Last, with one day to go, the S&amp;P 500 has gained 16 days so far this month, for the most since 16 in April 2019. Meanwhile, it is the most up days for any August since 2003.\n\n&gt; “Well, 2020 has laughed at many of these things, but be aware September is indeed the worst month of the year on average,” explained LPL Financial Chief Market Strategist Ryan Detrick. “But what caught our attention was both September and October have a negative return during election years, with October the worst month of the year. Could investors get election jitters again in 2020?”\n\n&gt; As show in the LPL Chart of the Day, September tends to be a weak month. In fact, it is the weakest month on average since 1950. Additionally, the last two times August was up more than 5% were 1986 and 2000; the S&amp;P 500 fell 8.5% and 5.4% in September those years.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/08/8.31.20-Blog-Chart-1.png?ssl=1))**\n\n&gt; Breaking things down by just an election year shows that August actually tends to be strong. That obviously played out this year, but now will the weakness we usually see in September and October play out?\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/08/8.31.20-Blog-Chart-2.png?ssl=1))**\n\n&gt; Finally, after today, the S&amp;P 500 will be up 5 consecutive months. Looking at the other years that saw a similar summer rallies, there tended to be more strength the final 4 months of the year, with only the Federal Reserve policy mistake of December 2018 blemishing this impressive track record.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/08/8.31.20-Blog-Chaert-3.png?ssl=1))**\n\n&gt; Yes, this record equity run is extremely stretched, but we would continue to use any pullbacks as an opportunity to add to longer-term core equity holdings, as the economy continues to come back quicker than most expected.\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending September 4th, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED!)\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 9.6.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED!)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$PTON** \n&gt; * **$WORK** \n&gt; * **$LULU** \n&gt; * **$CHWY** \n&gt; * **$KR** \n&gt; * **$ZS** \n&gt; * **$COUP** \n&gt; * **$LOVE** \n&gt; * **$AEO** \n&gt; * **$HQY** \n&gt; * **$GFN** \n&gt; * **$GME** \n&gt; * **$ORCL** \n&gt; * **$PLAY** \n&gt; * **$RH** \n&gt; * **$HDS** \n&gt; * **$UXIN** \n&gt; * **$MCFT** \n&gt; * **$FCEL** \n&gt; * **$CASY** \n&gt; * **$MEIP** \n&gt; * **$NAV** \n&gt; * **$REVG** \n&gt; * **$NSSC** \n&gt; * **$ABM** \n&gt; * **$SCWX** \n&gt; * **$PHR** \n&gt; * **$ALOT** \n&gt; * **$CVGW** \n&gt; * **$DSGX** \n&gt; * **$ZUMZ** \n&gt; * **$GIII** \n&gt; * **$AVAV** \n&gt; * **$BIOX** \n&gt; * **$BIGC** \n&gt; * **$LAKE** \n&gt; * **$LTRX** \n&gt; * **$BBCP** \n&gt; * **$VRNT** \n&gt; * **$FARM**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.postimg.cc/GtFbRTWy/er1.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.postimg.cc/2yRCg7KY/ervol1.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 9.7.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE. U.S. MARKETS CLOSED IN OBSERVANCE OF LABOR DAY.)\n\n&gt; # ***Monday 9.7.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE. U.S. MARKETS CLOSED IN OBSERVANCE OF LABOR DAY.)\n\n*****\n\n&gt; # ***Tuesday  9.8.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/U3gzGVc.png))\n\n&gt; # ***Tuesday 9.8.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/KToPkBD.png))\n\n*****\n\n&gt; # ***Wednesday 9.9.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/0aK2q13.png))\n\n&gt; # ***Wednesday 9.9.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Ku04emu.png))\n\n*****\n\n&gt; # ***Thursday 9.10.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n&gt; # ***Thursday 9.10.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/T5g4xA6.png))\n\n*****\n\n&gt; # ***Friday 9.11.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Friday 9.11.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # Peloton Interactive $80.63\n**Peloton Interactive (PTON)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, September 10, 2020. The consensus earnings estimate is $0.10 per share on revenue of $566.53 million and the Earnings Whisper ® number is $0.13 per share. Investor sentiment going into the company's earnings release has 84% expecting an earnings beat The company's guidance was for revenue of $500.00 million to $520.00 million. Short interest has decreased by 62.5% since the company's last earnings release while the stock has drifted higher by 78.8% from its open following the earnings release to be 92.6% above its 200 day moving average of $41.86. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 11.6% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=PTON&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Slack Technologies, Inc. $29.07\n**Slack Technologies, Inc. (WORK)** is confirmed to report earnings at approximately 4:10 PM ET on Tuesday, September 8, 2020. The consensus estimate is for a loss of $0.03 per share on revenue of $208.33 million and the Earnings Whisper ® number is ($0.01) per share. Investor sentiment going into the company's earnings release has 75% expecting an earnings beat The company's guidance was for a loss of $0.04 to $0.03 per share on revenue of $206.00 million to $209.00 million. Consensus estimates are for year-over-year earnings growth of 96.94% with revenue increasing by 43.70%. Short interest has increased by 93.1% since the company's last earnings release while the stock has drifted lower by 8.5% from its open following the earnings release to be 6.8% above its 200 day moving average of $27.22. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 7.8% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=WORK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # lululemon athletica inc. $361.41\n**lululemon athletica inc. (LULU)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, September 8, 2020. The consensus earnings estimate is $0.56 per share on revenue of $832.92 million and the Earnings Whisper ® number is $0.60 per share. Investor sentiment going into the company's earnings release has 67% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 41.67% with revenue decreasing by 5.71%. Short interest has decreased by 16.0% since the company's last earnings release while the stock has drifted higher by 19.3% from its open following the earnings release to be 38.7% above its 200 day moving average of $260.62. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 11.0% move on earnings and the stock has averaged a 6.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LULU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Chewy, Inc. $61.18\n**Chewy, Inc. (CHWY)** is confirmed to report earnings at approximately 4:10 PM ET on Thursday, September 10, 2020. The consensus estimate is for a loss of $0.15 per share on revenue of $1.64 billion and the Earnings Whisper ® number is ($0.14) per share. Investor sentiment going into the company's earnings release has 81% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 28.57% with revenue increasing by 42.17%. Short interest has decreased by 5.4% since the company's last earnings release while the stock has drifted higher by 20.1% from its open following the earnings release to be 57.3% above its 200 day moving average of $38.89. Overall earnings estimates have been revised lower since the company's last earnings release. The stock has averaged a 5.3% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CHWY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Kroger Co. $35.47\n**Kroger Co. (KR)** is confirmed to report earnings at approximately 7:30 AM ET on Friday, September 11, 2020. The consensus earnings estimate is $0.50 per share on revenue of $29.66 billion and the Earnings Whisper ® number is $0.56 per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 13.64% with revenue increasing by 5.30%. Short interest has increased by 8.3% since the company's last earnings release while the stock has drifted higher by 9.7% from its open following the earnings release to be 13.1% above its 200 day moving average of $31.36. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, August 24, 2020 there was some notable buying of 2,648 contracts of the $33.00 put expiring on Friday, September 18, 2020. Option traders are pricing in a 7.5% move on earnings and the stock has averaged a 4.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=KR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Zscaler, Inc. $134.34\n**Zscaler, Inc. (ZS)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, September 9, 2020. The consensus earnings estimate is $0.03 per share on revenue of $118.41 million and the Earnings Whisper ® number is $0.05 per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat The company's guidance was for earnings of $0.02 to $0.03 per share on revenue of $117.00 million to $119.00 million. Consensus estimates are for earnings to decline year-over-year by 57.14% with revenue increasing by 37.51%. Short interest has decreased by 23.9% since the company's last earnings release while the stock has drifted higher by 54.3% from its open following the earnings release to be 68.5% above its 200 day moving average of $79.71. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, August 20, 2020 there was some notable buying of 1,017 contracts of the $115.00 put expiring on Friday, November 20, 2020. Option traders are pricing in a 17.9% move on earnings and the stock has averaged a 16.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ZS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Coupa Software $285.81\n**Coupa Software (COUP)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, September 8, 2020. The consensus earnings estimate is $0.08 per share on revenue of $118.84 million and the Earnings Whisper ® number is $0.14 per share. Investor sentiment going into the company's earnings release has 67% expecting an earnings beat The company's guidance was for earnings of $0.06 to $0.08 per share on revenue of $118.00 million to $119.00 million. Consensus estimates are for earnings to decline year-over-year by 11.11% with revenue increasing by 24.91%. Short interest has decreased by 12.9% since the company's last earnings release while the stock has drifted higher by 34.2% from its open following the earnings release to be 41.3% above its 200 day moving average of $202.31. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, August 17, 2020 there was some notable buying of 538 contracts of the $270.00 put expiring on Friday, September 18, 2020. Option traders are pricing in a 18.8% move on earnings and the stock has averaged a 8.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=COUP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Lovesac Company $29.44\n**Lovesac Company (LOVE)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, September 9, 2020. The consensus estimate is for a loss of $0.55 per share on revenue of $52.58 million and the Earnings Whisper ® number is ($0.46) per share. Investor sentiment going into the company's earnings release has 60% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 77.42% with revenue increasing by 9.21%. Short interest has decreased by 29.1% since the company's last earnings release while the stock has drifted higher by 41.0% from its open following the earnings release to be 74.7% above its 200 day moving average of $16.85. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 20.9% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LOVE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # American Eagle Outfitters, Inc. $12.86\n**American Eagle Outfitters, Inc. (AEO)** is confirmed to report earnings at approximately 8:00 AM ET on Wednesday, September 9, 2020. The consensus estimate is for a loss of $0.14 per share on revenue of $833.66 million and the Earnings Whisper ® number is ($0.11) per share. Investor sentiment going into the company's earnings release has 39% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 135.90% with revenue decreasing by 19.91%. Short interest has increased by 45.8% since the company's last earnings release while the stock has drifted higher by 13.8% from its open following the earnings release to be 11.4% above its 200 day moving average of $11.54. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, August 21, 2020 there was some notable buying of 5,605 contracts of the $11.00 call expiring on Friday, October 16, 2020. Option traders are pricing in a 13.8% move on earnings and the stock has averaged a 6.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AEO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # HealthEquity, Inc. $58.47\n**HealthEquity, Inc. (HQY)** is confirmed to report earnings at approximately 4:00 PM ET on Tuesday, September 8, 2020. The consensus earnings estimate is $0.27 per share on revenue of $171.32 million and the Earnings Whisper ® number is $0.31 per share. Investor sentiment going into the company's earnings release has 62% expecting an earnings beat The company's guidance was for earnings of $0.23 to $0.30 per share on revenue of $168.00 million to $173.00 million. Consensus estimates are for earnings to decline year-over-year by 40.00% with revenue increasing by 97.78%. Short interest has decreased by 3.6% since the company's last earnings release while the stock has drifted higher by 2.7% from its open following the earnings release to be 3.5% below its 200 day moving average of $60.62. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 9.9% move on earnings and the stock has averaged a 4.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HQY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming holiday-shortened trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/smallstreetbets.",
        "subreddit": "smallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning September 7th, 2020",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/in322p/wall_street_week_ahead_for_the_trading_week/",
        "created": 1599348649.0
    },
    {
        "author": "spacej3di",
        "created_utc": 1601070771,
        "id": "izswdz",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": " **Most sectors higher with tech, healthcare among the leaders:**\n\n* **Tech** led the market on another good day for AAPL-US and MSFT-US . Software was an area of strength. **Healthcare** beat the tape, with providers, managed care, and MedTech broadly higher. Leisure names were stronger in **consumer discretionary** (particularly cruiselines on Barclays comments) but select homebuilders, retailers were lower. A&amp;D and airlines were among the standouts in **industrials**, but the trucking space was mixed.Internets were better in **communication services**, but telecom and media posted more moderate gains. Banks and life insurers were better in **financials,** though there were scattered decliners among the investment banks. Precious-metals miners were a drag on **materials** after yesterday's rally. Tobacco was among the weights on **consumer staples**. **Energy** was the only sector to finish lower amid some weakness in E&amp;Ps and oil-services names.\n\n**August durable goods orders missed though revisions and capital goods orders more positive:**\n\n* August **durable goods orders** rose 0.4% m/m versus expected 1.5% gain after July's 11.7% rise (revised up 0.3%). Fourth consecutive monthly gain. Machinery, computers, communications equipment the strongest segments; appliances, defense aircraft, motor vehicles among decliners. **Durable goods ex transportation** of +0.4% m/m missed 1.2% consensus and below prior 3.2% (revised up 0.6%). **Core capital goods orders** rose 1.8% versus 0.5% consensus and last month's 2.5% (revised up 0.6%). **Core capital goods shipments** (which feed into GDP) rose 1.5% m/m following a 2.8% gain prior. Next week's busy calendar highlighted by consumer confidence Tuesday (cons 90 vs 84.8 prior); ADP Employment (cons 600k vs 428K prior) Wednesday; initial claims (cons 855K vs 870K prior) and Sep ISM manufacturing (cons 56 vs same prior) Thursday; Sep payrolls (cons 870K vs 1371K prior) and Michigan consumer sentiment Friday.\n\n**Democrats working on another stimulus bill but no signs a deal with Republicans is imminent:**\n\n* Multiple reports ([Reuters](https://www.reuters.com/article/us-health-coronavirus-usa-congress/u-s-house-democrats-crafting-new-2-2-trillion-covid-19-relief-package-idUSKCN26F3CE), [WSJ](https://www.wsj.com/articles/centrist-democrats-push-for-paycheck-protection-bill-if-no-broader-coronavirus-deal-reached-11600965422?mod=hp_lead_pos4)) discussed how House Democrats are preparing another coronavirus relief package. The price tag is seen in the $2.2T to $2.4T range, with the lower figure representing House Speaker Pelosi's line in the sand during prior negotiations with the White House. There has been a lot of talk about how Pelosi has come under heightened pressure from moderates to get something passed to deliver a message to voters ahead of the election. At the same time, comments from Treasury Secretary Mnuchin on Thursday suggest the White House has not abandoned hopes for a deal. However, there still does not seem to be a near-term path to compromise given the big differences between Democrats and Republicans over the size and scope of the package. Earlier this month, Senate Republicans embraced a plan that included just \\~$300B of new spending.\n\n**High-frequency indicators suggest recovery stalling:**\n\n* Multiple reports ([Bloomberg](https://www.bloomberg.com/news/articles/2020-09-24/worsening-virus-trends-are-raising-alarms-for-stock-investors?cmpid=BBD092520_MKTEU&amp;utm_medium=email&amp;utm_source=newsletter&amp;utm_term=200925&amp;utm_campaign=marketseurope&amp;sref=L75TRUmI), [Reuters](https://www.reuters.com/article/us-usa-economy-reopen/visits-to-u-s-stores-restaurants-stall-as-concern-over-economic-recovery-grows-idUSKCN26F2YD), [WSJ](https://www.wsj.com/articles/weekly-jobless-claims-coronavirus-09-24-2020-11600889767?mod=hp_lead_pos5)) discussed how a number of high-frequency indicators suggest the US economic recovery is losing momentum. Highlighted a still elevated level of initial claims, a decline in employment at small businesses and surveys pointing to expectations of a looming jump in small business failures. Also flagged mobile data showing that the gradual return to restaurants, gyms and other \"close contact\" businesses has largely stalled following the improvement seen over the summer. In addition, Americans again cutting back on flights while public-transit use remains low. The articles not surprisingly put some of the blame on waning fiscal stimulus and continued concerns about a renewed uptick in coronavirus cases. Also discussed worries about persistently weak demand, which seem to fit with recent talk about a more protracted crisis ([WSJ](https://www.wsj.com/articles/new-covid-19-layoffs-make-job-reductions-permanent-11598654257?mod=hp_lead_pos1)).\n\n**Novavax's late-stage trial in UK caps busy week of coronavirus vaccine headlines:**\n\n* Novavax (NVAX-US ) announced it has started a 10K-person Phase 3 study of its coronavirus vaccine candidate in the UK to take advantage of a recent surge in cases there. Still plans to proceed in October with a late-stage trial in the US. Comes at the end of what has been a fairly busy week on the vaccine front. Johnson &amp; Johnson's (JNJ-US ) vaccine candidate, which requires just a single shot and induced immune responses in a small early stage trial ([WSJ](https://www.wsj.com/articles/johnson-johnsons-covid-19-vaccine-produced-immune-response-in-earlier-stage-study-11601061618)), became the fourth to enter late-stage trials in the US. Multiple reports also discussed how FDA plans to outline stricter standards on emergency use authorization (EUA) for any coronavirus vaccine in an effort to boost transparency and public trust. However, President Trump suggested he could overrule such a move.\n\n**Big outflows from risk assets:**\n\n* US equities saw outflows of $25.8B in week-ended 23-Sep, the third largest on record, according to BofA's latest Flow Show report ([Reuters](https://www.reuters.com/article/us-markets-flows-bofa/investors-pull-25-8-billion-from-u-s-equity-funds-bofa-idUSKCN26G18V)). Tech stocks suffered $1B of outflows, the largest since June 2019, as concerns about overbought conditions have lingered despite the recent drawdown. In addition, HY bond funds saw $5.4B of outflows, the largest since March. There were some thoughts earlier this week that softness in the HY market may be signaling more meaningful capitulation in stocks ([MarketWatch](https://www.marketwatch.com/discover?url=https%3A%2F%2Fwww.marketwatch.com%2Famp%2Fstory%2Fjunk-bond-jitters-may-signal-the-start-of-a-stock-market-capitulation-11600901634&amp;link=sfmw_tw#https://www.marketwatch.com/amp/story/junk-bond-jitters-may-signal-the-start-of-a-stock-market-capitulation-11600901634?mod=dist_amp_social)). However, EM bond funds saw a 12th straight week of inflows. In addition, IG corporate bonds continued to see inflows (albeit smallest in 24 weeks), while IG corporate bond spreads have remained tight. The latter dynamic has played into doubts that the recent pullback in stocks has been driven by shift in the macro narrative.\n\n**Popular trades hit as inflation expectations get dialed back:**\n\n* [Bloomberg](https://www.bloomberg.com/news/articles/2020-09-24/can-t-lose-trades-falter-with-inflation-expectations-flagging?sref=L75TRUmI) discussed how a number of popular trades have struggled as expectations for a pickup inflation from the massive monetary and fiscal stimulus unleashed in the initial aftermath of the coronavirus outbreak have been dialed back. In addition, while Washington appears unlikely to reach an agreement on a fifth coronavirus relief bill before the election, there has been a pickup in concerns about a depleted monetary policy arsenal. Article pointed out that 10-year breakeven rates have fallen to 1.5% from 1.82% at the start of September. Also noted that after 5/30 spread widened to 129 bp in early June, it has narrowed back to 113 bp. In addition, after falling to lowest level in two years, dollar index has risen for four straight sessions and is at a two-month high. Gold down 10% since peaking in early August and copper down 6% this week after surging 47% since March.\n\n**Swing-state polls tightening into first debate:**\n\n* [The Hill](https://thehill.com/homenews/campaign/518080-tightening-polls-in-key-swing-states-raise-pressure-on-biden) discussed how polls are tightening in key states like Florida and Arizona. With some now favoring Trump, there are glimmers of hope he could take the Electoral College. However, also pointed out that Biden is close to Trump in traditionally red states such as Texas and Georgia, along with states Trump easily won in 2016, like Iowa and Ohio. Biden also remains ahead in former \"blue wall\" states such as Michigan, Wisconsin and Pennsylvania. Election uncertainty has remained a big theme in the market this week, particularly with Trump refusing to say whether he would commit to a peaceful transition of power if he loses and [The Atlantic](https://www.theatlantic.com/magazine/archive/2020/11/what-if-trump-refuses-concede/616424/) report the Trump campaign is discussing \"contingency plans\" that would involve bypassing the result of November's election. However, also thoughts election uncertainty worries overdone ([Bloomberg](https://www.bloomberg.com/news/articles/2020-09-25/goldman-says-markets-overestimating-election-result-delay-risk?srnd=premium&amp;sref=L75TRUmI)).\n\n**Fed's Brainard seen at top of Biden's Treasury Secretary list:**\n\n* [Bloomberg ](https://www.bloomberg.com/news/articles/2020-09-24/fed-s-brainard-seen-as-top-of-biden-s-treasury-secretary-list?sref=J9GPLx1B)reported Biden's search for a Treasury secretary is widely seen as focusing on Lael Brainard, a choice that would keep both Wall Street and progressives in line. The more provocative choice of Senator Elizabeth Warren hasn't been ruled out but is far less likely, and other possible names are being discussed for the top finance job if Biden wins November's election. One person who has discussed Brainard's career moves with her said that she has expressed more interest in being Fed chair than in leading the Treasury, but wouldn't turn Treasury down if offered. While Warren advocates highlighted her communication skills, her antipathy to Wall Street and progressive views would worry the finance industry.",
        "subreddit": "stocks",
        "title": "Top Stories - Friday, Sept. 25, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/izswdz/top_stories_friday_sept_25_2020/",
        "created": 1601099571.0
    },
    {
        "author": "mageezy",
        "created_utc": 1599053519,
        "id": "il6txx",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "I heard ADP will be tanking soon. I want to make an options bet. I have a few thousand dollars. I am willing to risk it all. Can someone recommend an option strategy for me to bet against ADP on RH to only live once the hardest so I can 🚀 my small soft 🍆",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/il6txx/i_heard_adp_will_be_tanking_soon_i_want_to_make/",
        "created": 1599082319.0
    },
    {
        "author": "spacej3di",
        "created_utc": 1601416489,
        "id": "j294ti",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Summarized to save you time. \n\n**Energy and financials led the decliners:**\n\n* **Energy** was the weakest sector with WTI crude oil prices lower. IOCs and drillers worst. **Financials** were lower with banks and mortgage insurers the largest decliners. **Industrials** weighed on by airlines and A&amp;D. **Consumer discretionary** finished softer on weakness in department stores, apparel, restaurants, AMZN-US . **Materials** were behind with industrial metals and chemicals largely lower though precious metals higher. **Consumer staples** underperformed with weaker HPCs, tobacco and cosmetics somewhat offset by better discounters and some beverage companies. **Tech** was ahead of the tape with semiconductors best though software lower. **Healthcare** outperformed with managed care and med tech the leaders. **Comm services** the only sector higher on interactive media gains though other segments mostly lower.\n\n**September consumer confidence higher on better short term outlook:**\n\n* Conference Board's September c**onsumer confidence** of 101.8 jumped from August's 86.3 (revised up from 84.8) and beat the 88.5 consensus. Present situation index rose 12.7 pts to 98.5. Expectations index rose 17.4 pts to 104. The gap between those who say jobs are plentiful vs hard to get fell to -3.7 from +2. The report noted a more favorable view of business and labor market conditions with the short-term outlook improving. Spending in months ahead may be supported by stronger optimism about near-term financial prospects. The gap between those who say jobs are plentiful vs hard to get rose to +2.9% from -2.2% last month. Data for the rest of the week include **ADP Employment** (cons 608k vs 428K prior) Wednesday; **initial claims** (cons 850K vs 870K prior) and Sep **ISM manufacturing** (cons 56.3 vs same prior) Thursday; Sep **payrolls** (cons 850K vs 1371K prior) and **Michigan consumer sentiment** (cons 78.9, unch) Friday.\n\n**Pelosi and Mnuchin continue to negotiate toward possible stimulus deal:**\n\n* Treasury Secretary Mnuchin and Speaker Pelosi met again today (and will meet tomorrow) in an attempt to find a compromise for a new round of coronavirus stimulus. Pelosi also said today she's hopeful of getting a deal with Trump administration this week. Latest House Democrat proposal offers \\~$2.2T including new round of $1,200 stimulus checks, restoration of $600/wk additional unemployment benefits, $436B emergency state/local government aid, $225B for schools and childcare, $75B for coronavirus testing and contract tracing, $25B for airlines and $120B for restaurants ([The Hill](https://thehill.com/homenews/house/518660-democrats-unveil-scaled-down-22t-coronavirus-relief-package)). Some chatter about a White House counterproposal in the $1.5-1.6T range (recall administration has previously said it could see a targeted $1.5T package). However, still a good deal of skepticism a bipartisan deal can get done before 3-Nov despite likely positive political benefits and pressure from inside both caucuses. Note the House is scheduled to be in recess from Friday through Election Day.\n\n**First presidential debate is tonight:**\n\n* The first presidential debate kicks off at 21:00 ET on Tuesday in Cleveland. Multiple reports have discussed how Trump has lowered the bar for Biden by focusing so much on his mental acumen ([Politico](https://www.politico.com/news/2020/09/23/trump-biden-first-debate-420189), [NY Times](https://www.nytimes.com/2020/09/27/us/politics/trump-biden-debate-expectations.html?action=click&amp;module=Top%20Stories&amp;pgtype=Homepage)). However, a [WSJ](https://www.wsj.com/articles/trump-vs-biden-different-debate-needs-will-produce-different-strategies-11601301796?mod=hp_listb_pos1) preview noted that it is still important for Biden to demonstrate he is up to the presidency. Also pointed out that Biden needs to highlight his ability to withstand pressure from some in the Democratic party to push aggressively to the left. Biden expected to focus on Trump's handling of the coronavirus and the broader healthcare issue. Trump expected to focus on his handling of the economy before the pandemic and the success he has had in shaping the courts. While a lower-than-average percentage of voters flagged the debates as a factor in their choice for president, the Journal noted they are considered especially important by the nation's youngest and oldest voters.\n\n**New York City infection rate highest level in months amid rising fears over US winter deaths, illness:**\n\n* New York City's positive COVID-19 rate topped 3% for the first time in months, pushing the seven-day average up to 1.38%. [Politico](https://www.politico.com/states/new-york/albany/story/2020/09/29/nyc-infection-rate-spikes-as-students-head-back-to-school-1318977) noted the city will close schools, which reopened Tuesday, if rate hits 3% on seven-day average. City has also threatened to shut down non-essential businesses, ban gatherings in hot-spot neighborhoods if spread does not slow. Comes after [Bloomberg](https://www.bloomberg.com/news/articles/2020-09-28/warning-signs-are-flashing-ahead-of-covid-s-second-u-s-winter?srnd=premium-asia&amp;sref=J9GPLx1B) discussed health experts worried the coming US winter will usher in more coronavirus deaths and serious illness. While hospitalizations, deaths have plateaued since June and July, it comes as schools resume and more states ease restrictions on indoor establishments. The article noted most respiratory viruses circulate primarily in winter months and concerns are coronavirus could spread more readily this winter when more people are indoors for prolonged periods.\n\n**US government to ship 150M rapid coronavirus tests in the coming weeks:**\n\n* President Trump announced Monday that the US government will ship 150M rapid Covid-19 tests in the coming weeks. Trump said he wants governors to focus on vulnerable communities like nursing homes and assisted living facilities, along with the resumption of in-person instruction in schools. Admiral Brett Giroir, the administration's coronavirus testing chief, noted US at an inflection point for testing with an average of 3M tests available per day. Aggressive testing seen as key to reopening the economy as we wait for a vaccine. There have been a number of headlines about how cruise ships ([The Hill](https://thehill.com/homenews/news/517503-cruise-lines-to-give-coronavirus-tests-to-all-passengers-and-crew-to-start)) and airlines ([Reuters](https://www.reuters.com/article/health-coronavirus-airlines-testing/positive-about-flying-airlines-look-to-covid-tests-that-give-results-in-minutes-idUSKCN26E0RT)) expect to use rapid testing to get people more comfortable with the idea of traveling. MGM Resorts (MGM-US ) also outlined a plan on Tuesday to restart conventions that involves rapid testing.\n\n**Fed survey highlights limited bank interest in Main Street Lending Program:**\n\n* Fed today released a supplementary [*Senior Loan Officer Opinion Survey*](https://www.federalreserve.gov/data/sloos/sloos-202009.htm) focused on its Main Street Lending Program (MSLP). Noted commercial and industrial (C&amp;I) loan inquiries by MSLP-sized firms were basically unchanged from mid-June, but that MSLP loans contributed less than 2.5% of C&amp;I loans approved. Respondents felt C&amp;I inquiries from MSLP-sized borrowers may increase in next three months, though they do not see themselves extending more MSLP loans. Many banks said they were able to address borrowers' needs without the MSLP while also complaining about unattractive loan terms and MSLP registration requirements. Some also suggested the PPP was sufficient to address the credit needs of its borrowers. Recall this much-touted Fed program has seen much lower demand than initially expected, with Fed Chair Powell telling Congress last week the program is seeing very little demand for loans below $1M in size.\n\n**There has not been a specific factor behind the stock bounce in recent days:**\n\n* The S&amp;P 500 was down for a fourth straight week last week but the index has still risen in four of the last five sessions, including back-to-back 1.5%+ gains on Friday and Monday. There has not been a specific factor behind the bounce. However, the September drawdown has been viewed by some as largely an unwinding of market excesses, rather than any shift in the macro narrative. The bullish camp still sees the market underpinned by the monetary policy tailwind, earnings rebound, vaccine potential and broader economic reopening theme. In addition, there is still some semblance of hope for a fiscal stimulus deal, election uncertainty now seems to be the consensus, some strategists have cited month/quarter end rebalancing as supportive of stocks, M&amp;A activity continues to pick up and coronavirus testing capacity is ramping.\n\n**Trump second-term plans likely to revolve around taxes:**\n\n* President Trump's second-term policy priorities getting some discussion, with policy records and the economy on tonight's debate agenda. White House economic advisor Kudlow told CNBC today Trump has asked his staff to look at a middle-class tax cut, complete forgiveness for payroll tax deferral, a capital-gains tax cut, and making permanent 100% expensing for business assets (phasing out in 2022). [WSJ](https://www.wsj.com/articles/trump-would-double-down-on-tax-cuts-in-second-term-11601384401) said these may be challenging to implement in likely scenario the 3-Nov election results in divided government. (which will present GOP challenges in engineering new cuts or extending sunsetting cuts from 2017 tax reform). Notes while Democrats may go along with extending some individual income-tax cuts, they may push for higher taxes on those earning $400K+ and look to remove the cap on state and local income tax deductions.",
        "subreddit": "stocks",
        "title": "Top Stories - Tuesday, Sept. 29, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/j294ti/top_stories_tuesday_sept_29_2020/",
        "created": 1601445289.0
    },
    {
        "author": "Brothanogood",
        "created_utc": 1601492471,
        "id": "j2se2g",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "U.S. stocks pared strong gains on Wednesday, the last day of September, amid persisting uncertainty for further fiscal stimulus. The market is on track to post its first negative month since March.\n\nThe Dow Jones Industrial Average last traded up 260 points, or 0.9%, after jumping 550 points at its session high. The S&amp;P 500 gained 0.6%, while the tech-heavy Nasdaq Composite climbed 0.7%.\n\nTreasury Secretary Steven Mnuchin struck an optimistic tone about reaching a coronavirus aid deal on Wednesday after the stalemate in Washington dragged on for weeks. \n\n“I say we’re going to give it one more serious try to get this done and I think we’re hopeful that we can get something done,” Mnuchin said at the Delivering Alpha conference presented by CNBC and Institutional Investor. “I think there is a reasonable compromise here.”\n\nHowever, Majority Leader Mitch McConnell said Wednesday afternoon that Republicans and Democrats are still “far apart” on a relief deal. Stocks pared gains after his comments.\n\nThe advance also came on the back of better-than-expected economic data. [ADP’s monthly private-sector jobs](https://www.cnbc.com/2020/09/30/adp-private-sector-jobs-september-2020.html) count showed growth of 749,000 in September, ahead of the 600,000 expected from a Dow Jones economist survey. Meanwhile, [pending home sales](https://www.cnbc.com/2020/09/30/august-pending-home-sales-soar-to-a-record-high.html) soared 8.8% in August, marking its highest pace on record, according to the National Association of Realtors survey.\n\nStocks sensitive to the economic recovery, including airlines, banks and cruise operators, led the market rally on Wednesday. Shares of American Airlines and United climbed more than 2.5% each, while Boeing also rose 2.1%. JPMorgan, Goldman Sachs and Citigroup all gained at least 1%. Norwegian Cruise popped more than 5%.\n\nStill, major averages are headed for their first monthly declines since March. The S&amp;P 500 is down more than 3% this month, on pace for its first down month in six. The Dow and the Nasdaq Composite have fallen 2.3% and 4.7%, respectively, in September.\n\n## Vicious first debate\n\nInvestors digested the first debate between President Donald Trump and Democratic nominee Joe Biden Tuesday evening, which turned out to be particularly vicious with constant interruptions and insults. Wall Street remained concerned that it will be a drawn-out electoral process that could hit the market. \n\n“It was a long night and there’s a lot that needs to be sorted out,” said Daniel Deming, managing director at KKM Financial. “It became pretty apparent that this thing is not going to be over on Nov. 3 and I think the market is probably not too crazy about that.”\n\n“The short-term volatility pressures probably won’t abate anytime soon after this debate. In a sense, it’s creating even more uncertainty,” Deming said. \n\nTrump and Biden [sparred on a number of issues](https://www.cnbc.com/2020/09/29/presidential-debate-2020-live-updates-trump-biden.html), including their qualifications to manage the U.S. economy, the nomination of Amy Coney Barrett to the Supreme Court, as well as the U.S.′ handling of the coronavirus pandemic.\n\nMany market strategists have cited uncertainty around the election as a key headwind for the market before year-end with each outcome bringing its own risks and benefits. Some investors have raised concerns about a potential Biden win as they fear it could lead to higher corporate taxes and tighter regulations. But at the same time, it could ease concerns about the trade war and lack of stimulus to bolster the economy in the wake of the coronavirus.\n\nInvestors are also worried about the potential that the Nov. 3 result is too close to call and neither candidate concedes. That uncertainty could particularly weigh on the market.\n\nTrump frequently claims that mail-in balloting leads to voter fraud even though experts have repeatedly said there’s no proof of that ever having been a problem in the United States. Last week the director of the FBI told a Senate committee that [there’s no evidence of widespread voter fraud in the United States](https://www.cnbc.com/2020/09/24/fbi-has-not-seen-evidence-of-widespread-voter-fraud-director-wray-tells-senators.html) “whether it’s by mail or otherwise.”\n\nRegardless, on Tuesday night Trump said, “As far as the ballots are concerned, it’s a disaster. This is going to be a fraud like you’ve never seen.”\n\n“Questions on election fraud were raised, which will add to concerns about a volatile post-election period if there is a close or uncertain electoral outcome,” wrote Ed Mills of Raymond James in a note entitled “Dumpster Fire Debate.”\n\n## Virus treatment hopes\n\nPositive data regarding a potential coronavirus treatment from Regeneron Pharmaceuticals helped boost sentiment on Wall Street.\n\n[Regeneron said after the close Tuesday its REGN-COV2 drug reduced viral levels and improved symptoms in non-hospitalized coronavirus patients](https://www.cnbc.com/2020/09/29/regeneron-says-its-covid-19-treatment-reduces-viral-levels-improves-symptoms.html).\n\nMeanwhile, Moderna’s experimental Covid-19 vaccine appears safe and shows signs of working in older adults, according to study results published in the New England Journal of Medicine. However, Financial Times reported Wednesday Moderna’s vaccine won’t be ready before the November election.\n\nThe major averages snapped a three-day winning streak on Tuesday, with the Dow falling more than 100 points, or 0.5%. Those losses came amid concerns over a virus resurgence. New York City Mayor Bill De Blasio said the city’s daily positive rate of coronavirus tests is back above 3% for the first time in months.\n\n“Coronavirus infection rates are rising in Europe and the United States as children return to school,” Terry Sandven, chief equity strategist at U.S. Bank Wealth Management, wrote in a note. “We expect the United States to continue its modest pace of economic improvement, though virus growth and a softer labor market are threats.”\n\nDisney shares lost more than 1% after the company said it would [lay off 28,000 people in its theme parks division](https://www.cnbc.com/2020/09/29/disney-to-layoff-28000-employees-as-coronavirus-slams-theme-park-business.html).\n\n[https://www.cnbc.com/2020/09/29/stock-market-futures-open-to-close-news.html](https://www.cnbc.com/2020/09/29/stock-market-futures-open-to-close-news.html)",
        "subreddit": "stocks",
        "title": "Stocks cut gains in half amid lingering uncertainty on stimulus, Dow now up 250 points",
        "url": "https://www.reddit.com/r/stocks/comments/j2se2g/stocks_cut_gains_in_half_amid_lingering/",
        "created": 1601521271.0
    },
    {
        "author": "spacej3di",
        "created_utc": 1600697833,
        "id": "ix19id",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " **US equities lower: Dow (2.40%), S&amp;P 500 (2.06%), Nasdaq (1.63%), Russell 2000 (2.94%)**\n\n* US equities lower in Monday morning trading, extending last week's decline when S&amp;P 500 finished at six-week low and suffered third straight weekly decline. Political risks surrounding SCOTUS vacancy, a renewed uptick in coronavirus case counts (and lockdown speculation) in Europe and money laundering accusations facing some big banks among the latest headwinds coming out of the weekend. Value groups worst performers, with energy, materials, industrials the biggest laggards. Consumer staples and utilities faring best. Tech and communication services also ahead with FAANGs relatively better. Treasuries stronger with the curve flattening. Dollar seeing good gains vs euro and sterling but little changed on yen cross. Gold down 2.3%. WTI crude off 3.2%.\n* September pullback has been attributed to several different factors though concerns about overbought conditions, particularly in the growth and momentum factors that have led the market higher since the 23-Mar coronavirus bottom, have received the bulk of the blame. The dampened prospects for a near-term fiscal stimulus deal have been another overhang. Some of the other excuses have included worries the Fed may be increasingly pushing on a string, heightened political uncertainty into the November election, skepticism about some of the more aggressive vaccine timelines and a resurgence in coronavirus cases in Europe.\n* **Supreme Court vacancy following the passing of Ruth Bader Ginsburg** has grabbed most of the attention over the last few days. **Trump said he will announce his nomination later this week** and **McConnell has vowed to approve year-end**, despite pushback from Democrats. Some **mixed thoughts on how the court shakeup may impact the election** in November. **Biggest near-term issue for the market is that it** **likely makes a deal on a fifth coronavirus relief package even more of a longshot**. However, **Pelosi said she won't use a government shutdown as a bargaining chip**.\n* President Trump signed off on deal under which TikTok will partner with **ORCL-US** and **WMT-US** to become a US-based company. **JPM-US** and **BK-US** among big banks caught up in money laundering allegations. **ILMN-US** to acquire GRAIL for $8B in stock and cash**.** **ALL-US** announced $750M accelerated share repurchase agreement. **NKLA-US** down big after founder Trevor Milton voluntarily agreed to step down as executive chairman following recent battle with short-selling firm. **TOL-US** said QTD net signed contracts up 110% y/y. **CUB-US** announced shareholder rights plan after Elliott acquired 15% stake and expressed interest in an acquisition.\n\n**Notable Gainers:**\n\n* \\+10.8% **ROKU-US** (Roku): Roku and CMCSA-US 's NBCUniversal reached a deal to put Peacock and other NBCU broadcast and cable apps on Roku platform, and NBC content on ad-supported Roku Channel; terms not disclosed, but includes meaningful partnership around advertising.\n* \\+3.7% **BJ-US** (BJ's Wholesale Club Holdings, Inc.): Added to Conviction List at Goldman Sachs; notes new member acquisition likely to drive higher comps; cites accelerating unit growth, record FCF, and margin tailwinds from merchandise expansion and cost initiatives.\n* \\+2.3% **ORCL-US** (Oracle): President Trump said he agreed to concept of a deal of partnership between TikTok and Oracle and WMT-US ; Oracle to hold 12.5% stake in new entity called TikTok Global; upgraded to outperform from sector perform at RBC Capital Markets, saying acquisition a potential catalyst to price appreciation.\n* \\+2.3% **RCII-US** (Rent-A-Center): Guided Q3 earnings and revenue above consensus and raised FY guide; said lease portfolio performance and customer payment activity have remained strong even without additional government stimulus.\n* \\+2.2% **TSLA-US** (Tesla): Electrek reported that CEO Musk told employees company has a chance at record vehicle deliveries for Q3.\n* \\+1.9% **UPS-US** (UPS): Upgraded to outperform from neutral at Credit Suisse; cited increased carrier pricing power, expectations for declining capital intensity going forward, and the new CEO.\n\n**Notable Decliners:**\n\n* \\-15.5% **NKLA-US** (Nikola Corp.): Trevor Milton is leaving the company, having stepped down as chair of the board amidst short seller claims of exaggerated technology and an investigation by the SEC/Justice Department; Stephen Girsky will become chair and Mark Russell will remain CEO after being named in June.\n* \\-14.8% **THC-US** (Tenet Healthcare): JPMorgan reevaluated hospital ratings; Tenet and UHS-US downgraded to underweight from neutral, HCA-US to neutral from overweight; cited the passing of Justice Ginsburg as a political catalyst for Biden with his proposed public option and lower eligibility age seen as negative; also noted stalling national hospital revenue trends, greater competitive forces via value-based care innovations.\n* \\-4.5% **ILMN-US** (Illumina): Reached agreement to buy remainder of Grail it does not already own for $7.1B in cash and stock; expects deal to be revenue accretive beginning in 2021 though some analysts have suggested Grail could require significant investments before paying off.\n* \\-4.1% **ADP-US** (ADP): Downgraded to market perform from outperform at Cowen; noted Next-Gen HCM has not become a meaningful contributor as fast as anticipated; cited slower-than-expected pace of platform availability and mini-app market development.\n* \\-3.3% **JPM-US** (JPMorgan Chase): Reporting on leaked suspicious activity reports from US Treasury alleged several of world's largest banks (including DB-US , STAN-GB , and BK-US ) facilitated more than $2T in suspicious transactions for suspected criminals over two decades.\n\n09:08:09 AM CDT on 21 Sep '20",
        "subreddit": "stocks",
        "title": "Morning Market Synopsis - Monday, Sept. 21, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/ix19id/morning_market_synopsis_monday_sept_21_2020/",
        "created": 1600726633.0
    },
    {
        "author": "spacej3di",
        "created_utc": 1601478009,
        "id": "j2nqg1",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " **US equities higher: Dow +1.32%, S&amp;P 500 +1.07%, Nasdaq +1.26%, Russell 2000 +1.13%**\n\n* US equities higher in Wednesday morning trading. All sectors higher, with consumer discretionary, industrials, and tech in the lead. Energy, communication services, and utilities among the laggards. Treasuries weaker with the curve steepening. Dollar somewhat higher vs euro while little changed vs the yen. Gold down 0.6%. WTI crude reversing some early weakness and now up 0.4%.\n* Very busy from a headline perspective though much of the attention has not surprisingly been focused on last night's debate between Trump and Biden. **Debate widely described as \"chaotic\" and ultimately not expected to have much impact on the fundamentals of the race**. Heading into the debate, Biden was 6.1 points ahead of Trump in the RealClearPolitics average of national polls and 3.5 points ahead in the swing states. Trump attacked Biden over his family and the pressure he faces from the left. Biden avoided any major gaffes and criticized the president over his handling of the coronavirus pandemic.\n* **Pelosi said she is \"hopeful\" a stimulus deal will be reached** while **Mnuchin said there will be \"one more serious try\"** to get something done ahead of talks later today. **ADP private payrolls and Chicago PMI** **both surprised to the upside** following a mostly better than expected batch of data overnight, including the China PMIs. **Coronavirus second wave concerns** continue to get a lot of attention though recent **vaccine, testing and treatment developments** have been more upbeat. Multiple reports today have highlighted the **continued ramp in regulatory scrutiny surrounding big tech**.\n* **DIS-US** to lay off 28K employees. **REGN-US** announced positive results for its experimental coronavirus treatment. Additional data from **MRNA-US** study highlighted safety and efficacy in older adults. **CVAC-US** to begin late-stage coronavirus vaccine trial in Q4. **NEE-US** reportedly approached **DUK-US** about an acquisition. **MU-US** beat on strong DRAM sales in cloud and PC and gaming though guidance was below. **SHW-US** raised guidance on better DIY and residential while also noting improvement in industrial side. **SNX-US** beat and guided higher. **LOW-US** to restart buyback program. **AMP-US** boosted buyback by $2.5B. **HDS-US** authorized a $500M buyback.\n\n**Notable Gainers:**\n\n* \\+7.6% **SNX-US** (Synnex): Q3 earnings and revenue beat; Technology Solutions saw sequential improvement in office environment and SMB sales; analysts positive on y/y improvement in Concentrix; Q4 guidance well ahead of the Street.\n* \\+6.4% **LB-US** (L Brands): Added to Analyst Focus List at JP Morgan; cited benefits from UK/Ireland JV with Next Plc; positive on valuation, balance-sheet deleveraging process, and potential upside to BBW comps.\n* \\+5.7% **DUK-US** (Duke Energy): WSJ reported NextEra Energy (NEE-US ) recently made a takeover approach to Duke Energy; paper said that while NextEra was rebuffed, it remains interested in pursuing what would be a $60B+ combination of two Southern utilities.\n* \\+5% **CVAC-US** (CureVac BV): Initiated phase 2a clinical trial of COVID vaccine candidate; dose-confirmation study is being conducted in Peru and Panama to total 690 participants receiving two vaccinations over 28 days; first data expected late in 20Q4 and Phase 2b/3 planned to begin in the same quarter.\n* \\+4.2% **HUN-US** (Huntsman): Upgraded to overweight from equal-weight at Morgan Stanley; cited less supply but better demand globally for MDI due to peers' project delays and cancellations; also see strengthening demand through 2022, with additional upside on government stimulus.\n* \\+3.4% **MRNA-US** (Moderna, Inc.): Study published yesterday said company's Phase 1 trial of COVID-19 vaccine produced neutralizing antibody response almost as strong for those over 65 as those between 18-55; also said side effects roughly on par with high-dose flu shots.\n* \\+1.2% **NKLA-US** (Nikola Corp.): [Update](https://www.prnewswire.com/news-releases/nikola-executing-strategy-and-vision-to-deliver-innovative-technology-energy-and-transportation-solutions-301141793.html) showed strategy mostly on track with 4-Aug [timelines](https://nikolamotor.com/press_releases/nikola-corporation-reports-second-quarter-results-88); Tre battery-electric tractor trailer prototypes in next few weeks, 21Q4 production; hydrogen powered truck testing by 2021; AZ factory phase 1 completion 21Q4; comes after CNBC reported company and GM-US not expected to finalize $2B before Wednesday as previously planned.\n\n**Notable Decliners:**\n\n* \\-9.7% **EPAC-US** (Enerpac Tool Group): FQ4 earnings, revenue, and OM missed; noted sequential improvement but core sales still down 27% y/y; offered no F21 guidance and cautioned it remains uncertain when business will return to normal levels.\n* \\-7.6% **PRGS-US** (Progress Software): Q3 earnings and revenue within preliminary ranges though OM a bit light; highlighted strong OpenEdge results; management positive on contributions from Chef but Q4 guidance a bit below the Street.\n* \\-4.6% **MU-US** (Micron): Fiscal Q4 revenue and EPS better with the company highlighting strong DRAM sales in cloud and PC and gaming; Nov Q guide below but some analysts noted better than feared, particularly given Huawei headwinds; soft enterprise demand another headwind; GM to be adversely impacted by mix toward NAND, weaker pricing and conversion to replacement gate technology.\n* \\-1.8% **LPX-US** (Louisiana-Pacific): Downgraded to underweight from equal-weight at Stephens; highlighted concerns around buybacks and renewed commitment to EWP business and noted OSB fundamentals look worse.\n\n09:39:44 AM CDT on 30 Sep '20",
        "subreddit": "stocks",
        "title": "Morning Market Synopsis - Wednesday, Sept. 30, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/j2nqg1/morning_market_synopsis_wednesday_sept_30_2020/",
        "created": 1601506809.0
    }
]