[
    {
        "author": "psychotrader00",
        "created_utc": 1602108424,
        "id": "j70j78",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "**Summary**\n\nStocks were on a run today, climbing steadily higher all the way into close, fueled by hope stemming from President Trump’s tweets on the push to approve $1,200 checks and support for Airlines.\n\nThe SPY finished up 1.73%, the QQQ up 1.8%, and the DIA up 1.85%. Additionally the small cap IWM is up 2.18% for the day, and the Biotech etf IBB closed up 2.22%.\n\nYesterday in the early afternoon, Trump announced that he would stop all Stimulus talks until after the election. The markets saw a very significant slide off, only recouping a bit of the losses by the close. However, later in the day, going back on his word he made two significant tweets which helped to push the markets higher today. “If I am sent a Stand Alone Bill for Stimulus Checks ($1,200), they will go out to our great people IMMEDIATELY. I am ready to sign right now. Are you listening Nancy?” and the second was about the airlines “The House &amp; Senate should IMMEDIATELY Approve 25 Billion Dollars for Airline Payroll Support, &amp; 135 Billion Dollars for Paycheck Protection Program for Small Business. Both of these will be fully paid for with unused funds from the Cares Act. Have this money. I will sign now!”\n\nDuring today, Speaker Pelosi conducted an interview on ABC’s “The View” where she signaled willingness to keep discussions open, but disparaged the idea of stand-alone bills. She continues to support the idea that a one comprehensive package in the order of $2 Trillion must be passed in whole. House Budget Committee Chairman John Yarmuth said “We don’t have time to save the economy piece by piece. As Fed Chairman Jerome Powell told us, we need to act now and act big”.\n\nIt is worth noting Fed Chairman Jerome Powell, and Secretary of the Treasury Steven Mnuchin have constantly been advocating that with all the Fed has done, still more direct stimulus from Congress is needed to aid with the recovery. Many feel it is unfortunate to see that the stimulus has become a ground to push political agendas, while the ones who pay the price are the regular American citizens.\n\nTonight there will be a vice presidential debate between Kamala Harris, and current VP Mike Pence. According to a report published by Marketwatch the stakes will be high as \"Vice President Pence must put in a strong performance against the democratic nominee, Sen Kamala Harris of California, to turn the electorate's attention away from the first presidential debate and a barrage of negative news coverage related to Trump's recent COVID-19 diagnosis and subsequent hospitalization\".\n\nOn other fronts, hotspots for Coronavirus are picking up, with the latest restrictions coming from New York. The rule will come into effect on Friday and will affect businesses, houses of worships and schools. Boston has also delayed the reopening of schools for a week. India is closing in on the US to become the country with most infections, adding 78k new cases, more than double of the US, to total 6.8M vs the 7.7M total cases in the US.\n\nVaccine developments continue to move forward with the White House and FDA finally on agreement on the guidelines to approve for Emergency use. Also, During the John Hopkins University Vaccine Symposium, Operation Warp Speed Chief says within next month or two \"We feel comfortable\" that we will have one or two efficacious candidates to deliver doses to 30M people by Nov or Dec 2020 as per reports on the event by Benzinga. The story on Trump’s recovery is that he has been treated with a cocktail with treatments from GILD and REGN and is currently recuperating presenting mild to no symptoms according to a report by CNBC.\n\n**Highlights**\n\n* USA explores restrictions on Ant Group, and Tencent Payment Systems.\n* Wells Fargo to cut more than 700 jobs in commercial banking.\n* FB Facebook will delete all accounts, not just the posts, linked with QAnon group.\n* Spain unveiled a plan to spend 140B Euros, and create 800k jobs within 3 years.\n* AEL American Equity Investment Life had price target raised by Piper Sandler from $25 to $33\n* ALK Alaska Air Group had target raised by JPM from $55 to $64\n* AMSC American Semiconductor had target raised by Craig Hallum from $15 to $21\n* AMZN Amazon had target raised by Benchmark $3,675 to $3,800\n* CVNA Carvana had target raised by Goldman Sachs GS from $205 to $270 POSITIVE\n* DAL target raised by JPM $45 to $51 OVERWEIGHT\n* HON Honeywell target raised by JPM from $185 to $198 OVERWEIGHT\n* LEVI Levi Strauss &amp; CO had nice earnings  \n\n   * Telsey advisory raised target $17 to $20 BUY\n   * Citigroup raised target $17 to $19 OUTPERFORM\n* PAYX Paycheck  \n\n   * BMO Capital MArket raised target $74 to $82\n   * Deutsche Bank raised target $75 to $81\n   * Morgan Stanley raised target $74 to $76\n* PLCE Childrens Place had Barclays raise target $18 to $26\n* W Wayfair target raised by Argus $225 to $360 at BUY. this was a big one!\n* WDAY Workday was upgraded by Jeffries Financial Group $250 to $260 from HOLD to BUY\n* URBN Urban Outfitters was upgraded by Barclays from EQUAL WEIGHT to OVERWEIGHT\n* Semiconductor stocks have been on a tear!\n\n\"Impossible is for the unwilling\" John Keats",
        "subreddit": "StockMarket",
        "title": "Market Recap - Wed Oct 7 Please Enjoy",
        "url": "https://www.reddit.com/r/StockMarket/comments/j70j78/market_recap_wed_oct_7_please_enjoy/",
        "created": 1602137224.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1601724062,
        "id": "j4e4tu",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/smallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning October 5th, 2020.\n\n# **Trump’s health and fiscal stimulus fight will steer the markets in the week ahead  - [(Source)](https://www.cnbc.com/2020/10/02/trumps-health-and-the-fiscal-s.html)**\n*****\n&gt; President Donald Trump’s health and the state of a fiscal stimulus package will be the main focus for markets in the coming week.\n*****\n&gt; In the early morning hours Friday, President Donald Trump tweeted that he and the first lady tested positive for Covid. Stocks sold off hard, but the S&amp;P 500 came off its lows in Friday trading and closed down just under 1%. It was up 1.5% for the week.\n*****\n&gt; The market was helped by signs that a stimulus package is still a possibility, after House Speaker Nancy Pelosi asked airlines not to furlough workers. She promised either a stand alone aid bill, or a bigger negotiated relief legislation that would help the industry.\n*****\n&gt; “The market is going to watch health updates from the White House medical staff, and it’s going to watch how the president communicates with the public,” said Julian Emanuel, head of equities and derivatives at BTIG. “Will we see him in person in the next week in any form? What’s his volume of tweets? All as a way to first gauge the severity of the case.”\n*****\n&gt; Trump and Melania Trump are reported to have mild cases, but as time goes on the market will turn to how the illness could impact the presidential election.\n*****\n&gt; Former Vice President Joe Biden gained slightly in the polls after the first debate Tuesday night, and now the calendar for further debates is in question. The market has seemingly warmed to Biden, and even though he would raise taxes, it is assumed Democrats would quickly pass a major infrastructure package if there is a Democratic sweep of Congress.\n*****\n&gt; Trump, however, is widely seen on Wall Street as stronger on the economy and better for markets.\n*****\n&gt; “What you’ve done from a campaign perspective, is you’ve taken away the thing that gives him the most energy - his ability to interact with crowds,” said Emanuel. “The president had wanted to paint the economic recovery of the last three or four months as the cornerstone, and this basically puts the virus back as topic number 1, number 2 and number 3. And it’s all the more so because the data is coming in weaker than expected.”\n*****\n&gt; The market is fixated on the prospect of stimulus to help business, the unemployed and state and local governments. The House passed a $2.2 trillion package this week, but there is still no agreement with Republicans. Treasury Secretary Steven Mnuchin has pushed for a $1.6 trillion package.\n*****\n&gt; “I think there’s an underlying bid under the market because nobody wants to be super short if we get a stimulus approved, but you can’t be too long in case his mild symptoms turn into severe symptoms,” said Scott Redler, partner with T3live.com. “We’re in a tough spot but overall we’re still pretty constructive.”\n*****\n&gt; Emanuel said the fact the president is now ill could hurt confidence and slow down some of the improvement in the economy.\n*****\n&gt; “The underlying tone is, again, whether its directly or later, there’s going to be stimulus,” Emanuel said. ”’Whether it’s this month or November, this reinforces the need for stimulus because the president falling ill signals to, at the margin, the person whose thinking about going out to dinner to think again. It’s a significant economic and psychological hindrance.”\n*****\n&gt; Also coming up in the week ahead is a speech Tuesday by Fed Chairman Jerome Powell to the National Association of Business Economists.\n*****\n&gt; Powell is also expected to push for the stimulus package to boost the economy so the recovery does not stall.\n*****\n&gt; “I think his whole objective is to try to get Congress and the Administration to sign onto a fiscal rescue package,” said Mark Zandi, chief economist at Moody’s Analytics. “He’ll all but come out and say [the recovery] is not a ‘V.’ Without additional support from lawmakers, risks are pretty high that we backtrack. I think that’s the kind of outlook he’s going to give. It’s going to be full-throated.”\n*****\n&gt; September’s employment report, released Friday, was seen by some as a warning that the economy is not rebounding as expected. There were 661,000 jobs added in September, well below the 800,000 expected.\n*****\n&gt; Besides Powell, there are a half dozen other Fed speakers. There are also minutes from the Fed’s last minute released Wednesday afternoon.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/3J0V6o1.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/TI8ImmZ.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/90v084y.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/Ne7m07y.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/0UZt0DJ.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/HA7KsPc.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/NzmRLPp.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/eqS3Lk4.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/UBfJMYm.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/k9v1hZX.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/UtkozzH.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/KNI9qkQ.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/OM44UFj.png))**\n\n*****\n\n&gt; # Make Up Your !@#$%^&amp;* Mind!\n\n&gt; We've all had versions of this conversation where you or the person you were talking to just couldn't make up their mind. At the end of the day, it only causes trouble and plans are ruined.\n\n&gt; The market is having its own back and forth this year trying to decide between growth and value. Just today, growth stocks are getting slaughtered while value stocks are up marginally. As an example, the Russell 1000 Growth index is down 1.8% on the day while the Russell 1000 Value index has managed to rally 0.25%. The chart below shows the daily performance spread between the Russell 1000 Growth index and the Russell 1000 Value index for each day in 2020. Today's performance spread between the two indices marks the ninth time this year that value has outperformed growth by more than two percentage points. At the other extreme, there have also been eight trading days where growth outperformed value by more than two percentage points.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/010220-Value-Growth-2020.png))**\n\n&gt; So how does this year's frequency of days where the performance spread between the two indices was more than two percentage points stack up to other years? The chart below shows the daily performance spread between the two indices going all the way back to 1990. Over the last thirty years, the only two periods where we saw a frequency of these large daily dislocations was back in 2008 and the period spanning 2000 and 2001. In fact, with 17 days this year where the performance spread between the two indices was greater than two percentage points, the only other years that saw a higher frequency of large dislocations were 2000 (54) and 2001 (28). If you think the market has been indecisive this year, in 2000 we saw these types of daily dislocations an average of once per week.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/010220-Value-Growth-All-Years.png))**\n\n*****\n\n&gt; # Election Anxiety Weighs on October Market Performance\n\n&gt; October often evokes fear on Wall Street as memories are stirred of crashes in 1929, 1987, the 554-point drop on October 27, 1997, back-to-back massacres in 1978 and 1979, Friday the 13th in 1989 and the 733-point drop on October 15, 2008. During the week ending October 10, 2008, Dow lost 1,874.19 points (18.2%), the worst weekly decline in our database going back to 1901, in percentage terms. March 2020 now holds the dubious honor of producing the worst, second and third worst DJIA weekly point declines. The term “Octoberphobia” has been used to describe the phenomenon of major market drops occurring during the month. Market calamities can become a self-fulfilling prophecy, so stay on the lookout and don’t get whipsawed if it happens.\n\n&gt; But October has become a turnaround month—a “bear killer” if you will. Twelve post-WWII bear markets have ended in October: 1946, 1957, 1960, 1962, 1966, 1974, 1987, 1990, 1998, 2001, 2002 and 2011 (S&amp;P 500 declined 19.4%). However, eight were midterm bottoms. Over the last 21 years, October’s performance has been solid. Average gains over the last 21-years range from 1.3% by Russell 1000 to 2.4% by NASDAQ. Small caps have still struggled though with Russell 2000 gaining a modest 0.5%\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/aba6ebb2f208cb4b7a30b5ef83275d92/74b7a456a8bd8bcd-fc/s400x600/fb3400cc8b8054a896bd8e031be58ee2872d9e24.jpg))**\n\n&gt; Election-year Octobers rank dead last for Dow, S&amp;P 500 (since 1952), NASDAQ (since 1972), Russell 1000, and Russell 2000 (since 1980). Eliminating gruesome 2008 from the calculation provides a moderate amount of relief, as rankings climb to mid pack. Should a meaningful decline materialize in October it is likely to be an excellent buying opportunity, especially for any depressed technology and small-cap shares.\n\n*****\n\n&gt; # What Have Democratic Sweeps Meant for the S&amp;P 500?\n\n&gt; Headed into the first presidential debate Tuesday night, betting markets (ElectionBettingOdds.com) placed Democratic candidate Joe Biden as the slight favorite to take the White House in November. The debate resulted in Biden gaining another 5 percentage point chance of winning the Presidency. As of this morning, Biden's odds to win are at 59.8% versus Trump's odds of 38.9%. Additionally, Democrats are slight favorites to win control of the Senate (58.4% to 41.5%) and big favorites to maintain the House (82.8% to 17.1%). Given these odds, in the chart below we show the average performance of the S&amp;P 500 from the three months before Election Day through three months after Election Day for all election years post-WWII that resulted in a sweep of the executive and legislative branch by the Democrats.\n\n&gt; As shown, on average the S&amp;P 500 has been on the decline in the weeks leading up to Election Day, though in the days just before the Election there has been a small rally that sharply reverses once the results come in. After the initial post-Election drop, the market has trended a bit higher, but by three months after the Election, it has only found itself around the same levels as Election Day; on average a 2.6% loss versus where the index stood three months prior.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/09/093020-Dem-Sweeps3.png))**\n\n&gt; The composite shown above is comprised of six different years: 1948, 1960, 1964, 1976, 1992, and 2008. While on average the S&amp;P 500 has traded lower, it is not necessarily a sure-fire thing. For example, 1948 and 2008 were the only years that saw the S&amp;P 500 trade and stay significantly lower in the wake of the election. In 1976, there was similarly a sell-off in the immediate aftermath of the election, but the index did make its way back up to the highs of that six-month time frame later on albeit no new high was put in place. Meanwhile, 1960, 1964, and 1992 all saw the S&amp;P 500 run higher after the election even despite some periods of consolidation after initial moves higher. In our B.I.G. Tips report from Tuesday, we show these same charts for all Presidential election years post WWII including a look at the average performance given every potential election outcome.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/09/093020-Dem-Sweeps.png))**\n\n*****\n\n&gt; # How Current Returns Stack Up to History\n\n&gt; Even after September's weakness, the S&amp;P 500's trailing 12-month total return stood at an impressive 14.9%. Given the events of the last 12 months, one could even say that performance is remarkable. What's even crazier is that the S&amp;P 500's performance over the last 12 months is more than three times stronger than the 12 month period before that (+4.25%). The chart below compares the S&amp;P 500's annualized total returns over the last one, two, five, ten, and twenty years and compares that performance to the historical average return of the index over those same time periods.\n\n&gt; The S&amp;P 500's historical average 12-month return is 11.7%, so the current 14.9% gain exceeds that average by more than three full percentage points. Over a two-year window, though, the S&amp;P 500's annualized return of 9.4% is more than a full percentage point below the historical average. Looking further out, the S&amp;P 500's trailing five and ten-year annualized return has been much stronger than average, which makes sense given the long bull market we were in. Over a 20 year window, though, the S&amp;P 500 is only just starting to work off some of the declines from the dot-com bust and as a result, the 6.4% annualized gain is a four and a half percentage points below the long-term average of 10.9%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/100120-Monthly-Returns.png))**\n\n&gt; Below we show how the current performance of the S&amp;P 500 in each of the time frames shown compares to all other periods on a percentile basis. The S&amp;P 500's performance over the last year, ranks just below 56th percentile of all other periods, while the two-year performance ranks just below the 42nd percentile. Even as the five and ten-year periods have seen well above average returns, they still rank in just the mid-60s on a percentile basis. The S&amp;P 500's ranking over a 20-year time period is a completely different story ranking in single-digits on a percentile basis. Even with the equity market right near record highs, the last two decades have been forgettable for US equities.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/100120-Monthly-Returns-Ranks.png))**\n\n*****\n\n&gt; # Seasonals Are Back In Style Again\n\n&gt; There is no denying that market seasonality has not worked so well this year. But we have been here before and history is on our side. Over the long term, intermediate term and short term market seasonality has suffered brief periods when seasonality was overridden by more powerful forces. The COVID pandemic and economic shutdown certainly qualifies. But it is only a matter of time until repetitive human behavior patterns and people and institutions return to moving money around in the usual daily, weekly, monthly, quarterly and seasonal patterns.\n\n&gt; The return of perennial September weakness is emblematic of a return to normal market behavior and a reflection of the fact that despite the continuing concerns about surges in coronavirus cases life is beginning to return to normal. In our area, about 25-30 miles north of New York City, our kids are beginning hybrid learning, playing rugby, lacrosse and other sports (yes with some COVID protocols, but tackling and facing-off), golf outings are happening and people are going to restaurants and out and about.\n\n&gt; The chart here shows the historical One-Year Pattern of the S&amp;P 500 Since 1950 versus 2020. The black line shows the seasonal pattern since 1950. The blue represents the pattern since 1988. We use 1988 as it is the first year after the 1987 Crash when the market underwent a major systemic change with the implementation of downside protection circuit breakers and collars. It is noteworthy how the seasonal pattern persists during both the 70-year and 31-year timeframes.\n\n&gt; 2020 is plotted on the right axis due to the magnitude of the move this year. The yellow box highlights the rebirth of seasonality this September, especially during this notoriously negative Week After Triple Witching Week as detailed page 108 of the 2020 Almanac, indicated by the two black arrows\n\n&gt; Years like 1980, 1982, 2009 and 2016 with unseasonably early weakness and bear markets like 2020 returned to normal seasonal patterns in short order. And years like 1954, 1958, 1980, 1982, 1995 and 2009 that exhibited double-digit gains in the Worst Six Months still proceeded to deliver further sizable gains in the subsequent Best Six Months (page 52, STA 2020). We believe the return of market seasonality is upon us. So remain cautious through the end of September and be alert to Octoberophobia, but remain ready to pounce on our Best Months Seasonal MACD Buy Signal, when it triggers.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/0a4a6ba18e7d903b198c8fa7d6cf8bc4/9c2d30c4da9ff340-d7/s500x750/eb0c36b5ff7eec394f463ca8420054c22a88010f.jpg))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending October 2nd, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=XiTS26b5YO8))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 10.4.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$DPZ** \n&gt; * **$PAYX** \n&gt; * **$RPM** \n&gt; * **$HELE** \n&gt; * **$AYI** \n&gt; * **$LEVI** \n&gt; * **$LW** \n&gt; * **$LNDC** \n&gt; * **$SAR** \n&gt; * **$EXFO** \n&gt; * **$RGP**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/UBfJMYm.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/E7qqUjk.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 10.5.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n&gt; # ***Monday 10.5.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Tuesday  10.6.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/zy3ktow.png))\n\n&gt; # ***Tuesday 10.6.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/pt0NiLh.png))\n\n*****\n\n&gt; # ***Wednesday 10.7.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/yaviiRp.png))\n\n&gt; # ***Wednesday 10.7.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Vdaqsaj.png))\n\n*****\n\n&gt; # ***Thursday 10.8.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ipdesH4.png))\n\n&gt; # ***Thursday 10.8.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Friday 10.9.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Friday 10.9.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # Domino's Pizza, Inc. $433.78\n**Domino's Pizza, Inc. (DPZ)** is confirmed to report earnings at approximately 7:30 AM ET on Thursday, October 8, 2020. The consensus earnings estimate is $2.73 per share on revenue of $944.53 million and the Earnings Whisper ® number is $2.83 per share. Investor sentiment going into the company's earnings release has 76% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 33.17% with revenue increasing by 15.07%. Short interest has decreased by 31.5% since the company's last earnings release while the stock has drifted higher by 7.4% from its open following the earnings release to be 22.3% above its 200 day moving average of $354.71. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 7.3% move on earnings and the stock has averaged a 8.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DPZ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Paychex, Inc. $79.43\n**Paychex, Inc. (PAYX)** is confirmed to report earnings at approximately 8:30 AM ET on Tuesday, October 6, 2020. The consensus earnings estimate is $0.56 per share on revenue of $895.39 million and the Earnings Whisper ® number is $0.57 per share. Investor sentiment going into the company's earnings release has 49% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 21.13% with revenue decreasing by 9.74%. Short interest has decreased by 9.7% since the company's last earnings release while the stock has drifted higher by 2.8% from its open following the earnings release to be 6.0% above its 200 day moving average of $74.91. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, September 18, 2020 there was some notable buying of 1,269 contracts of the $90.00 call expiring on Friday, March 19, 2021. Option traders are pricing in a 4.8% move on earnings and the stock has averaged a 2.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=PAYX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # RPM International Inc. $82.64\n**RPM International Inc. (RPM)** is confirmed to report earnings at approximately 6:45 AM ET on Wednesday, October 7, 2020. The consensus earnings estimate is $1.21 per share on revenue of $1.49 billion and the Earnings Whisper ® number is $1.26 per share. Investor sentiment going into the company's earnings release has 65% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 27.37% with revenue increasing by 1.17%. Short interest has decreased by 39.7% since the company's last earnings release while the stock has drifted higher by 3.3% from its open following the earnings release to be 12.4% above its 200 day moving average of $73.51. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 4.4% move on earnings and the stock has averaged a 2.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=RPM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Helen of Troy Ltd. $199.83\n**Helen of Troy Ltd. (HELE)** is confirmed to report earnings at approximately 6:30 AM ET on Thursday, October 8, 2020. The consensus earnings estimate is $2.39 per share on revenue of $451.26 million and the Earnings Whisper ® number is $2.57 per share. Investor sentiment going into the company's earnings release has 62% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 18.91% with revenue increasing by 9.00%. Short interest has decreased by 6.4% since the company's last earnings release while the stock has drifted lower by 4.4% from its open following the earnings release to be 12.8% above its 200 day moving average of $177.13. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 5.7% move on earnings and the stock has averaged a 8.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HELE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Acuity Brands, Inc. $105.61\n**Acuity Brands, Inc. (AYI)** is confirmed to report earnings at approximately 8:40 AM ET on Thursday, October 8, 2020. The consensus earnings estimate is $2.01 per share on revenue of $814.63 million and the Earnings Whisper ® number is $2.12 per share. Investor sentiment going into the company's earnings release has 46% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 28.21% with revenue decreasing by 13.16%. Short interest has increased by 62.6% since the company's last earnings release while the stock has drifted higher by 5.6% from its open following the earnings release to be 4.1% above its 200 day moving average of $101.43. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 5.8% move on earnings and the stock has averaged a 9.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AYI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Levi Strauss &amp; Co. $14.15\n**Levi Strauss &amp; Co. (LEVI)** is confirmed to report earnings at approximately 4:00 PM ET on Tuesday, October 6, 2020. The consensus estimate is for a loss of $0.27 per share on revenue of $766.84 million and the Earnings Whisper ® number is ($0.20) per share. Investor sentiment going into the company's earnings release has 40% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 187.10% with revenue decreasing by 47.01%. Short interest has increased by 3.9% since the company's last earnings release while the stock has drifted higher by 7.3% from its open following the earnings release to be 3.5% below its 200 day moving average of $14.66. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, October 2, 2020 there was some notable buying of 8,166 contracts of the $14.00 call expiring on Friday, October 16, 2020. Option traders are pricing in a 10.6% move on earnings and the stock has averaged a 6.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LEVI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Lamb Weston Holdings, Inc. $67.93\n**Lamb Weston Holdings, Inc. (LW)** is confirmed to report earnings at approximately 8:30 AM ET on Wednesday, October 7, 2020. The consensus earnings estimate is $0.30 per share on revenue of $877.60 million and the Earnings Whisper ® number is $0.28 per share. Investor sentiment going into the company's earnings release has 36% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 62.03% with revenue decreasing by 11.26%. Short interest has decreased by 21.7% since the company's last earnings release while the stock has drifted higher by 4.1% from its open following the earnings release to be 1.8% below its 200 day moving average of $69.17. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, October 2, 2020 there was some notable buying of 1,580 contracts of the $70.00 call expiring on Friday, October 16, 2020. Option traders are pricing in a 8.3% move on earnings and the stock has averaged a 6.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LW&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Landec Corp. $9.43\n**Landec Corp. (LNDC)** is confirmed to report earnings at approximately 4:20 PM ET on Tuesday, October 6, 2020. The consensus estimate is for a loss of $0.11 per share on revenue of $127.86 million and the Earnings Whisper ® number is ($0.09) per share. Investor sentiment going into the company's earnings release has 41% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 31.25% with revenue decreasing by 7.82%. Short interest has decreased by 5.1% since the company's last earnings release while the stock has drifted lower by 12.3% from its open following the earnings release to be 8.4% below its 200 day moving average of $10.30. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 16.7% move on earnings and the stock has averaged a 10.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LNDC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Saratoga Investment Corp $17.27\n**Saratoga Investment Corp (SAR)** is confirmed to report earnings at approximately 4:00 PM ET on Wednesday, October 7, 2020. The consensus earnings estimate is $0.47 per share on revenue of $12.95 million. Investor sentiment going into the company's earnings release has 48% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 30.88% with revenue decreasing by 6.75%. Short interest has decreased by 60.5% since the company's last earnings release while the stock has drifted higher by 6.3% from its open following the earnings release. Overall earnings estimates have been revised lower since the company's last earnings release.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SAR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # EXFO Inc. $3.24\n**EXFO Inc. (EXFO)** is confirmed to report earnings at approximately 4:00 PM ET on Wednesday, October 7, 2020. The consensus earnings estimate is $0.07 per share on revenue of $64.85 million and the Earnings Whisper ® number is $0.07 per share. Investor sentiment going into the company's earnings release has 30% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 40.00% with revenue decreasing by 7.59%. Short interest has decreased by 17.5% since the company's last earnings release while the stock has drifted lower by 14.7% from its open following the earnings release. Overall earnings estimates have been revised higher since the company's last earnings release.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=EXFO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/smallstreetbets.",
        "subreddit": "smallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning October 5th, 2020",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/j4e4tu/wall_street_week_ahead_for_the_trading_week/",
        "created": 1601752862.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1601723706,
        "id": "j4e2k1",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Good Friday evening to all of you here on r/stocks. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning October 5th, 2020.\n\n# **Trump’s health and fiscal stimulus fight will steer the markets in the week ahead  - [(Source)](https://www.cnbc.com/2020/10/02/trumps-health-and-the-fiscal-s.html)**\n*****\n&gt; President Donald Trump’s health and the state of a fiscal stimulus package will be the main focus for markets in the coming week.\n*****\n&gt; In the early morning hours Friday, President Donald Trump tweeted that he and the first lady tested positive for Covid. Stocks sold off hard, but the S&amp;P 500 came off its lows in Friday trading and closed down just under 1%. It was up 1.5% for the week.\n*****\n&gt; The market was helped by signs that a stimulus package is still a possibility, after House Speaker Nancy Pelosi asked airlines not to furlough workers. She promised either a stand alone aid bill, or a bigger negotiated relief legislation that would help the industry.\n*****\n&gt; “The market is going to watch health updates from the White House medical staff, and it’s going to watch how the president communicates with the public,” said Julian Emanuel, head of equities and derivatives at BTIG. “Will we see him in person in the next week in any form? What’s his volume of tweets? All as a way to first gauge the severity of the case.”\n*****\n&gt; Trump and Melania Trump are reported to have mild cases, but as time goes on the market will turn to how the illness could impact the presidential election.\n*****\n&gt; Former Vice President Joe Biden gained slightly in the polls after the first debate Tuesday night, and now the calendar for further debates is in question. The market has seemingly warmed to Biden, and even though he would raise taxes, it is assumed Democrats would quickly pass a major infrastructure package if there is a Democratic sweep of Congress.\n*****\n&gt; Trump, however, is widely seen on Wall Street as stronger on the economy and better for markets.\n*****\n&gt; “What you’ve done from a campaign perspective, is you’ve taken away the thing that gives him the most energy - his ability to interact with crowds,” said Emanuel. “The president had wanted to paint the economic recovery of the last three or four months as the cornerstone, and this basically puts the virus back as topic number 1, number 2 and number 3. And it’s all the more so because the data is coming in weaker than expected.”\n*****\n&gt; The market is fixated on the prospect of stimulus to help business, the unemployed and state and local governments. The House passed a $2.2 trillion package this week, but there is still no agreement with Republicans. Treasury Secretary Steven Mnuchin has pushed for a $1.6 trillion package.\n*****\n&gt; “I think there’s an underlying bid under the market because nobody wants to be super short if we get a stimulus approved, but you can’t be too long in case his mild symptoms turn into severe symptoms,” said Scott Redler, partner with T3live.com. “We’re in a tough spot but overall we’re still pretty constructive.”\n*****\n&gt; Emanuel said the fact the president is now ill could hurt confidence and slow down some of the improvement in the economy.\n*****\n&gt; “The underlying tone is, again, whether its directly or later, there’s going to be stimulus,” Emanuel said. ”’Whether it’s this month or November, this reinforces the need for stimulus because the president falling ill signals to, at the margin, the person whose thinking about going out to dinner to think again. It’s a significant economic and psychological hindrance.”\n*****\n&gt; Also coming up in the week ahead is a speech Tuesday by Fed Chairman Jerome Powell to the National Association of Business Economists.\n*****\n&gt; Powell is also expected to push for the stimulus package to boost the economy so the recovery does not stall.\n*****\n&gt; “I think his whole objective is to try to get Congress and the Administration to sign onto a fiscal rescue package,” said Mark Zandi, chief economist at Moody’s Analytics. “He’ll all but come out and say [the recovery] is not a ‘V.’ Without additional support from lawmakers, risks are pretty high that we backtrack. I think that’s the kind of outlook he’s going to give. It’s going to be full-throated.”\n*****\n&gt; September’s employment report, released Friday, was seen by some as a warning that the economy is not rebounding as expected. There were 661,000 jobs added in September, well below the 800,000 expected.\n*****\n&gt; Besides Powell, there are a half dozen other Fed speakers. There are also minutes from the Fed’s last minute released Wednesday afternoon.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/3J0V6o1.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/TI8ImmZ.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/90v084y.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/Ne7m07y.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/0UZt0DJ.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/HA7KsPc.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/NzmRLPp.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/eqS3Lk4.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/UBfJMYm.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/k9v1hZX.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/UtkozzH.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/KNI9qkQ.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/OM44UFj.png))**\n\n*****\n\n&gt; # Make Up Your !@#$%^&amp;* Mind!\n\n&gt; We've all had versions of this conversation where you or the person you were talking to just couldn't make up their mind. At the end of the day, it only causes trouble and plans are ruined.\n\n&gt; The market is having its own back and forth this year trying to decide between growth and value. Just today, growth stocks are getting slaughtered while value stocks are up marginally. As an example, the Russell 1000 Growth index is down 1.8% on the day while the Russell 1000 Value index has managed to rally 0.25%. The chart below shows the daily performance spread between the Russell 1000 Growth index and the Russell 1000 Value index for each day in 2020. Today's performance spread between the two indices marks the ninth time this year that value has outperformed growth by more than two percentage points. At the other extreme, there have also been eight trading days where growth outperformed value by more than two percentage points.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/010220-Value-Growth-2020.png))**\n\n&gt; So how does this year's frequency of days where the performance spread between the two indices was more than two percentage points stack up to other years? The chart below shows the daily performance spread between the two indices going all the way back to 1990. Over the last thirty years, the only two periods where we saw a frequency of these large daily dislocations was back in 2008 and the period spanning 2000 and 2001. In fact, with 17 days this year where the performance spread between the two indices was greater than two percentage points, the only other years that saw a higher frequency of large dislocations were 2000 (54) and 2001 (28). If you think the market has been indecisive this year, in 2000 we saw these types of daily dislocations an average of once per week.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/010220-Value-Growth-All-Years.png))**\n\n*****\n\n&gt; # Election Anxiety Weighs on October Market Performance\n\n&gt; October often evokes fear on Wall Street as memories are stirred of crashes in 1929, 1987, the 554-point drop on October 27, 1997, back-to-back massacres in 1978 and 1979, Friday the 13th in 1989 and the 733-point drop on October 15, 2008. During the week ending October 10, 2008, Dow lost 1,874.19 points (18.2%), the worst weekly decline in our database going back to 1901, in percentage terms. March 2020 now holds the dubious honor of producing the worst, second and third worst DJIA weekly point declines. The term “Octoberphobia” has been used to describe the phenomenon of major market drops occurring during the month. Market calamities can become a self-fulfilling prophecy, so stay on the lookout and don’t get whipsawed if it happens.\n\n&gt; But October has become a turnaround month—a “bear killer” if you will. Twelve post-WWII bear markets have ended in October: 1946, 1957, 1960, 1962, 1966, 1974, 1987, 1990, 1998, 2001, 2002 and 2011 (S&amp;P 500 declined 19.4%). However, eight were midterm bottoms. Over the last 21 years, October’s performance has been solid. Average gains over the last 21-years range from 1.3% by Russell 1000 to 2.4% by NASDAQ. Small caps have still struggled though with Russell 2000 gaining a modest 0.5%\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/aba6ebb2f208cb4b7a30b5ef83275d92/74b7a456a8bd8bcd-fc/s400x600/fb3400cc8b8054a896bd8e031be58ee2872d9e24.jpg))**\n\n&gt; Election-year Octobers rank dead last for Dow, S&amp;P 500 (since 1952), NASDAQ (since 1972), Russell 1000, and Russell 2000 (since 1980). Eliminating gruesome 2008 from the calculation provides a moderate amount of relief, as rankings climb to mid pack. Should a meaningful decline materialize in October it is likely to be an excellent buying opportunity, especially for any depressed technology and small-cap shares.\n\n*****\n\n&gt; # What Have Democratic Sweeps Meant for the S&amp;P 500?\n\n&gt; Headed into the first presidential debate Tuesday night, betting markets (ElectionBettingOdds.com) placed Democratic candidate Joe Biden as the slight favorite to take the White House in November. The debate resulted in Biden gaining another 5 percentage point chance of winning the Presidency. As of this morning, Biden's odds to win are at 59.8% versus Trump's odds of 38.9%. Additionally, Democrats are slight favorites to win control of the Senate (58.4% to 41.5%) and big favorites to maintain the House (82.8% to 17.1%). Given these odds, in the chart below we show the average performance of the S&amp;P 500 from the three months before Election Day through three months after Election Day for all election years post-WWII that resulted in a sweep of the executive and legislative branch by the Democrats.\n\n&gt; As shown, on average the S&amp;P 500 has been on the decline in the weeks leading up to Election Day, though in the days just before the Election there has been a small rally that sharply reverses once the results come in. After the initial post-Election drop, the market has trended a bit higher, but by three months after the Election, it has only found itself around the same levels as Election Day; on average a 2.6% loss versus where the index stood three months prior.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/09/093020-Dem-Sweeps3.png))**\n\n&gt; The composite shown above is comprised of six different years: 1948, 1960, 1964, 1976, 1992, and 2008. While on average the S&amp;P 500 has traded lower, it is not necessarily a sure-fire thing. For example, 1948 and 2008 were the only years that saw the S&amp;P 500 trade and stay significantly lower in the wake of the election. In 1976, there was similarly a sell-off in the immediate aftermath of the election, but the index did make its way back up to the highs of that six-month time frame later on albeit no new high was put in place. Meanwhile, 1960, 1964, and 1992 all saw the S&amp;P 500 run higher after the election even despite some periods of consolidation after initial moves higher. In our B.I.G. Tips report from Tuesday, we show these same charts for all Presidential election years post WWII including a look at the average performance given every potential election outcome.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/09/093020-Dem-Sweeps.png))**\n\n*****\n\n&gt; # How Current Returns Stack Up to History\n\n&gt; Even after September's weakness, the S&amp;P 500's trailing 12-month total return stood at an impressive 14.9%. Given the events of the last 12 months, one could even say that performance is remarkable. What's even crazier is that the S&amp;P 500's performance over the last 12 months is more than three times stronger than the 12 month period before that (+4.25%). The chart below compares the S&amp;P 500's annualized total returns over the last one, two, five, ten, and twenty years and compares that performance to the historical average return of the index over those same time periods.\n\n&gt; The S&amp;P 500's historical average 12-month return is 11.7%, so the current 14.9% gain exceeds that average by more than three full percentage points. Over a two-year window, though, the S&amp;P 500's annualized return of 9.4% is more than a full percentage point below the historical average. Looking further out, the S&amp;P 500's trailing five and ten-year annualized return has been much stronger than average, which makes sense given the long bull market we were in. Over a 20 year window, though, the S&amp;P 500 is only just starting to work off some of the declines from the dot-com bust and as a result, the 6.4% annualized gain is a four and a half percentage points below the long-term average of 10.9%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/100120-Monthly-Returns.png))**\n\n&gt; Below we show how the current performance of the S&amp;P 500 in each of the time frames shown compares to all other periods on a percentile basis. The S&amp;P 500's performance over the last year, ranks just below 56th percentile of all other periods, while the two-year performance ranks just below the 42nd percentile. Even as the five and ten-year periods have seen well above average returns, they still rank in just the mid-60s on a percentile basis. The S&amp;P 500's ranking over a 20-year time period is a completely different story ranking in single-digits on a percentile basis. Even with the equity market right near record highs, the last two decades have been forgettable for US equities.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/100120-Monthly-Returns-Ranks.png))**\n\n*****\n\n&gt; # Seasonals Are Back In Style Again\n\n&gt; There is no denying that market seasonality has not worked so well this year. But we have been here before and history is on our side. Over the long term, intermediate term and short term market seasonality has suffered brief periods when seasonality was overridden by more powerful forces. The COVID pandemic and economic shutdown certainly qualifies. But it is only a matter of time until repetitive human behavior patterns and people and institutions return to moving money around in the usual daily, weekly, monthly, quarterly and seasonal patterns.\n\n&gt; The return of perennial September weakness is emblematic of a return to normal market behavior and a reflection of the fact that despite the continuing concerns about surges in coronavirus cases life is beginning to return to normal. In our area, about 25-30 miles north of New York City, our kids are beginning hybrid learning, playing rugby, lacrosse and other sports (yes with some COVID protocols, but tackling and facing-off), golf outings are happening and people are going to restaurants and out and about.\n\n&gt; The chart here shows the historical One-Year Pattern of the S&amp;P 500 Since 1950 versus 2020. The black line shows the seasonal pattern since 1950. The blue represents the pattern since 1988. We use 1988 as it is the first year after the 1987 Crash when the market underwent a major systemic change with the implementation of downside protection circuit breakers and collars. It is noteworthy how the seasonal pattern persists during both the 70-year and 31-year timeframes.\n\n&gt; 2020 is plotted on the right axis due to the magnitude of the move this year. The yellow box highlights the rebirth of seasonality this September, especially during this notoriously negative Week After Triple Witching Week as detailed page 108 of the 2020 Almanac, indicated by the two black arrows\n\n&gt; Years like 1980, 1982, 2009 and 2016 with unseasonably early weakness and bear markets like 2020 returned to normal seasonal patterns in short order. And years like 1954, 1958, 1980, 1982, 1995 and 2009 that exhibited double-digit gains in the Worst Six Months still proceeded to deliver further sizable gains in the subsequent Best Six Months (page 52, STA 2020). We believe the return of market seasonality is upon us. So remain cautious through the end of September and be alert to Octoberophobia, but remain ready to pounce on our Best Months Seasonal MACD Buy Signal, when it triggers.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/0a4a6ba18e7d903b198c8fa7d6cf8bc4/9c2d30c4da9ff340-d7/s500x750/eb0c36b5ff7eec394f463ca8420054c22a88010f.jpg))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending October 2nd, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 10.4.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$DPZ** \n&gt; * **$PAYX** \n&gt; * **$RPM** \n&gt; * **$HELE** \n&gt; * **$AYI** \n&gt; * **$LEVI** \n&gt; * **$LW** \n&gt; * **$LNDC** \n&gt; * **$SAR** \n&gt; * **$EXFO** \n&gt; * **$RGP**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/UBfJMYm.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/E7qqUjk.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 10.5.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n&gt; # ***Monday 10.5.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Tuesday  10.6.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/zy3ktow.png))\n\n&gt; # ***Tuesday 10.6.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/pt0NiLh.png))\n\n*****\n\n&gt; # ***Wednesday 10.7.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/yaviiRp.png))\n\n&gt; # ***Wednesday 10.7.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Vdaqsaj.png))\n\n*****\n\n&gt; # ***Thursday 10.8.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ipdesH4.png))\n\n&gt; # ***Thursday 10.8.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Friday 10.9.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Friday 10.9.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # Domino's Pizza, Inc. $433.78\n**Domino's Pizza, Inc. (DPZ)** is confirmed to report earnings at approximately 7:30 AM ET on Thursday, October 8, 2020. The consensus earnings estimate is $2.73 per share on revenue of $944.53 million and the Earnings Whisper ® number is $2.83 per share. Investor sentiment going into the company's earnings release has 76% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 33.17% with revenue increasing by 15.07%. Short interest has decreased by 31.5% since the company's last earnings release while the stock has drifted higher by 7.4% from its open following the earnings release to be 22.3% above its 200 day moving average of $354.71. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 7.3% move on earnings and the stock has averaged a 8.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DPZ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Paychex, Inc. $79.43\n**Paychex, Inc. (PAYX)** is confirmed to report earnings at approximately 8:30 AM ET on Tuesday, October 6, 2020. The consensus earnings estimate is $0.56 per share on revenue of $895.39 million and the Earnings Whisper ® number is $0.57 per share. Investor sentiment going into the company's earnings release has 49% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 21.13% with revenue decreasing by 9.74%. Short interest has decreased by 9.7% since the company's last earnings release while the stock has drifted higher by 2.8% from its open following the earnings release to be 6.0% above its 200 day moving average of $74.91. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, September 18, 2020 there was some notable buying of 1,269 contracts of the $90.00 call expiring on Friday, March 19, 2021. Option traders are pricing in a 4.8% move on earnings and the stock has averaged a 2.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=PAYX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # RPM International Inc. $82.64\n**RPM International Inc. (RPM)** is confirmed to report earnings at approximately 6:45 AM ET on Wednesday, October 7, 2020. The consensus earnings estimate is $1.21 per share on revenue of $1.49 billion and the Earnings Whisper ® number is $1.26 per share. Investor sentiment going into the company's earnings release has 65% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 27.37% with revenue increasing by 1.17%. Short interest has decreased by 39.7% since the company's last earnings release while the stock has drifted higher by 3.3% from its open following the earnings release to be 12.4% above its 200 day moving average of $73.51. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 4.4% move on earnings and the stock has averaged a 2.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=RPM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Helen of Troy Ltd. $199.83\n**Helen of Troy Ltd. (HELE)** is confirmed to report earnings at approximately 6:30 AM ET on Thursday, October 8, 2020. The consensus earnings estimate is $2.39 per share on revenue of $451.26 million and the Earnings Whisper ® number is $2.57 per share. Investor sentiment going into the company's earnings release has 62% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 18.91% with revenue increasing by 9.00%. Short interest has decreased by 6.4% since the company's last earnings release while the stock has drifted lower by 4.4% from its open following the earnings release to be 12.8% above its 200 day moving average of $177.13. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 5.7% move on earnings and the stock has averaged a 8.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HELE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Acuity Brands, Inc. $105.61\n**Acuity Brands, Inc. (AYI)** is confirmed to report earnings at approximately 8:40 AM ET on Thursday, October 8, 2020. The consensus earnings estimate is $2.01 per share on revenue of $814.63 million and the Earnings Whisper ® number is $2.12 per share. Investor sentiment going into the company's earnings release has 46% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 28.21% with revenue decreasing by 13.16%. Short interest has increased by 62.6% since the company's last earnings release while the stock has drifted higher by 5.6% from its open following the earnings release to be 4.1% above its 200 day moving average of $101.43. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 5.8% move on earnings and the stock has averaged a 9.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AYI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Levi Strauss &amp; Co. $14.15\n**Levi Strauss &amp; Co. (LEVI)** is confirmed to report earnings at approximately 4:00 PM ET on Tuesday, October 6, 2020. The consensus estimate is for a loss of $0.27 per share on revenue of $766.84 million and the Earnings Whisper ® number is ($0.20) per share. Investor sentiment going into the company's earnings release has 40% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 187.10% with revenue decreasing by 47.01%. Short interest has increased by 3.9% since the company's last earnings release while the stock has drifted higher by 7.3% from its open following the earnings release to be 3.5% below its 200 day moving average of $14.66. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, October 2, 2020 there was some notable buying of 8,166 contracts of the $14.00 call expiring on Friday, October 16, 2020. Option traders are pricing in a 10.6% move on earnings and the stock has averaged a 6.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LEVI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Lamb Weston Holdings, Inc. $67.93\n**Lamb Weston Holdings, Inc. (LW)** is confirmed to report earnings at approximately 8:30 AM ET on Wednesday, October 7, 2020. The consensus earnings estimate is $0.30 per share on revenue of $877.60 million and the Earnings Whisper ® number is $0.28 per share. Investor sentiment going into the company's earnings release has 36% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 62.03% with revenue decreasing by 11.26%. Short interest has decreased by 21.7% since the company's last earnings release while the stock has drifted higher by 4.1% from its open following the earnings release to be 1.8% below its 200 day moving average of $69.17. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, October 2, 2020 there was some notable buying of 1,580 contracts of the $70.00 call expiring on Friday, October 16, 2020. Option traders are pricing in a 8.3% move on earnings and the stock has averaged a 6.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LW&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Landec Corp. $9.43\n**Landec Corp. (LNDC)** is confirmed to report earnings at approximately 4:20 PM ET on Tuesday, October 6, 2020. The consensus estimate is for a loss of $0.11 per share on revenue of $127.86 million and the Earnings Whisper ® number is ($0.09) per share. Investor sentiment going into the company's earnings release has 41% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 31.25% with revenue decreasing by 7.82%. Short interest has decreased by 5.1% since the company's last earnings release while the stock has drifted lower by 12.3% from its open following the earnings release to be 8.4% below its 200 day moving average of $10.30. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 16.7% move on earnings and the stock has averaged a 10.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LNDC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Saratoga Investment Corp $17.27\n**Saratoga Investment Corp (SAR)** is confirmed to report earnings at approximately 4:00 PM ET on Wednesday, October 7, 2020. The consensus earnings estimate is $0.47 per share on revenue of $12.95 million. Investor sentiment going into the company's earnings release has 48% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 30.88% with revenue decreasing by 6.75%. Short interest has decreased by 60.5% since the company's last earnings release while the stock has drifted higher by 6.3% from its open following the earnings release. Overall earnings estimates have been revised lower since the company's last earnings release.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SAR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # EXFO Inc. $3.24\n**EXFO Inc. (EXFO)** is confirmed to report earnings at approximately 4:00 PM ET on Wednesday, October 7, 2020. The consensus earnings estimate is $0.07 per share on revenue of $64.85 million and the Earnings Whisper ® number is $0.07 per share. Investor sentiment going into the company's earnings release has 30% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 40.00% with revenue decreasing by 7.59%. Short interest has decreased by 17.5% since the company's last earnings release while the stock has drifted lower by 14.7% from its open following the earnings release. Overall earnings estimates have been revised higher since the company's last earnings release.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=EXFO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/stocks.",
        "subreddit": "stocks",
        "title": "Wall Street Week Ahead for the trading week beginning October 5th, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/j4e2k1/wall_street_week_ahead_for_the_trading_week/",
        "created": 1601752506.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1602187695,
        "id": "j7kgdr",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Thursday, October 8, 2020**\n\nStocks rose again today, extending yesterday’s frankly unexpected gains, with the major benchmarks opening at their highest levels in about a month. Market participants digested a new round of jobless claims, dimming hopes of stimulus, even for stand-alone bills, and progress in Covid-19 therapeutics following Pres. Trump’s discharge from the hospital.\n\nThe Nasdaq (QQQ) finished the day 0.54% up. The S&amp;P (SPY) led the day, up 0.85% and the Dow (DIA) finished 0.48% up. \n\nToday, the Labor Department released their weekly jobless claims report. There were 840,000 additional first-time jobless claims this week, slightly above the 820,000 prediction of analysts. While 840,000 is the lowest level since March, jobless claims have stagnated the past month, a sign of slowing economic recovery. Continuing claims, which are the number of people who have already filed an initial claim and who have experienced a week of unemployment and then filed a continued claim to claim benefits for that week of unemployment, fell below 11 million, dropping almost 1 million compared to the week before. Ian Shepherdson, chief economist at Pantheon Macroeconomics said, “The decline in continuing claims is welcome, but initial claims offer a better read on the real-time state of the labor market, and the downward trend has stalled, more or less.”\n\nAccording to CNBC, there are still 25.5 million workers claiming some form of unemployment benefits, according to totals through Sept. 19. More than half that total, or about 13.4 million, comes from those collecting under pandemic-related programs set up for those who normally wouldn’t be eligible, showing the toll the pandemic has put on the labor market. \n\nHouse Speaker Nancy Pelosi further curbed expectations that any form of stimulus will be unleashed before the November election. Today, in response to a bill designed to provide relief to the airline industry, Pelosi said, “There is no stand-alone bill without a bigger bill.” In other words, she opposes passing smaller, stand-alone stimulus bills in the absence of more comprehensive measures. Yesterday, after calling for his representatives to stop negotiations for overarching stimulus, Pres. Trump signaled he would support a smaller, targeted bill. In response to Trump’s recent tweets about stimulus, Ed Mills, policy analyst at Raymond James said, “It’s been the question of the day, as to why we got the tweets we got over the last 24 hours, the market reaction we got into \\[Tuesday’s\\] close, and then the rally.” Needless to say, the current market is hyper-responsive to the comments of Trump and other top officials.\n\nShares of Regeneron (REGN) jumped after the drugmaker said it had submitted a request to the U.S. Food and Drug Administration (FDA) for emergency use authorization of its Covid-19 antibody treatment, which had been taken by President Donald Trump after his Covid-19 diagnosis. In a video on Twitter today, Pres. Trump openly endorsed the move saying “I took this medicine \\[during his stay at Walter Reed Hospital\\] and it was incredible.”\n\nIn other nice news, the World Trade Organization (WTO) announced that South Korea’s trade minister and the former Nigerian finance minister are the two finalists in the race to become the next director-general. This is the first time a woman will occupy the position of top leader in this organization. \n\n**Highlights**\n\n* Covid Relief pushes US deficit to a record $3.1T\n* AMD announced new desktop processors today that the company said will deliver significant improvements in gaming performance. The Ryzen 9 5950X chip delivers what the company described as the “highest single-thread performance of any desktop gaming processor.”\n* Gamestop (GME) announced that it has entered into a multi-year strategic partnership agreement with Microsoft (MSFT) to further advance its strategy to expand its physical and digital video game offerings, as well as enhance the Company’s retail technology infrastructure. GME rocketed up 20% on the announcement.\n* Morgan Stanley (MS) said it is buying fund manager Eaton Vance (EV) Corp. for $7 billion, continuing the Wall Street firm's shift toward safer businesses like money management. The deal comes just days after Morgan Stanley completed its $11 billion takeover of E\\*Trade\n* Weed stocks got a big boost today afet Vice Presidential Candidate Kamala Harris said in yesterday’s debate that the Biden administration would federally decriminalize marijuana. TLRY up 17.5%, CGC up 13%, ACB up 11%, APHA up 10%, CRON 9.6%, and CURLF up 10.5% to name a few of the most popular ones.\n* Square (SQ) bought 4,709 bitcoins (around $50M). The company said \"Square believes that cryptocurrency is an instrument of economic empowerment and provides a way for the world to participate in a global monetary system\"\n* ROKU had a target raised by Needham from $190 to $255. Stock is currently at an All Time High. Amazon AMZN announced Roku would be available on Amazon FireStick.\n* Paypal (PYPL) had target raised by KeyCorp from $215 to $230 at OVERWEIGHT\n* Norfolk Southern (NSC) had all sorts of target raises today. By Barclays, Citigroup, Cowen, and Credit Suisse.\n* Sunnova Energy (NOVA) International had a target raised by Raymond James from $26 to $32 at OUTPERFORM.\n* Nextera Energy Partners (NEP) had a target raised by Raymond James $64 to $73 at OUTPERFORM.\n* Kura Oncology (KURA), had a target raised by Credit Suisse Group from $27 to $43 at OUTPERFORM. Very Bullish Call. Stock is currently $33, has been running! Keep an eye on this one!\n* Green Dot (GDOT) had a target raised by Needham from $62 to $70 at BUY. price currently at $62, very bullish call.\n* First Solar (FSLR) had a price target raised by Raymond James from $72 to $80. Solar Energy stocks have been on a tear! Definitely keep an eye out\n* ETSY had price target raised by Oppenheimer from $150 to $160 at OUTPERFORM\n* CareDx (CDNA) had target raise by Piper Sandler from $54 to $62 at OVERWEIGHT stock currently at $44\n* ANET upgraded by JPMorgan Chase from NEUTRAL to OVERWEIGHT with a $275 price target. Very bullish call keep an eye out, chart looks good for swing trade.\n* MDT Medtronic upgraded by Sanford Bernstein and Stifel Nicolaus to OUTPERFORM and BUY respectively.\n* PAYX Paychex upgraded by Citigroup from $75 to $93 NEUTRAL to BUY. Nice call this one.\n* TSLA Tesla upgraded by New Street Research from NEUTRAL to BUY at price target $578.\n\n\"Don't judge each day by the harvest you reap but by the seeds that you plant.\" -Robert Louis Stevenson",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Thurs, Oct 8. Please enjoy!",
        "url": "https://www.reddit.com/r/stocks/comments/j7kgdr/here_is_a_market_recap_for_today_thurs_oct_8/",
        "created": 1602216495.0
    },
    {
        "author": "badpauly",
        "created_utc": 1603477707,
        "id": "jgst60",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "This is a list of the top 20 companies that experienced the largest change in insider shares in the last seven (7) days.\nThe SEC defines an insider as any officer, director or 10% shareholder. It is not illegal for these people to buy or sell their own shares.\nIn fact, since most of them get paid in stock options, it is expected. However, it is illegal for them to trade on inside information\nthat has not been made public. So for example if there are drug trial results that are bad and not public,\ninsiders cannot dump shares. That said, many people have observed that insiders - in general - seem to have a good\ntrack record at timing their purchases.  All trades that are marked as part of a 10b5 plan are excluded from this report.\n\n## Largest Insider Buying (Last 7 Days)\nCompany|Count|Shares Changed|Avg. Price|Value Change\n--------|-----:|-----:|-----:|--------:  \n[BTWNU / Bridgetown Holdings Limited Units](https://fintel.io/n/us/btwnu)|1|5,000,000|10|50,000,000 \n[EAR / Eargo, Inc.](https://fintel.io/n/us/ear)|5|1,027,777|18|18,499,986 \n[ALGS / Aligos Therapeutics, Inc.](https://fintel.io/n/us/algs)|4|950,000|15|14,250,000 \n[TARS / Tarsus Pharmaceuticals, Inc.](https://fintel.io/n/us/tars)|5|750,000|16|12,000,000  \n[EFT / Eaton Vance Floating-Rate Income Trust](https://fintel.io/n/us/eft)|4|549,472|13|7,018,789 \n[VTA / Invesco Dynamic Credit Opportunities Fund](https://fintel.io/n/us/vta)|2|602,072|9|5,631,032 \n[TMTS / TERWIN MORTGAGE TRUST TMTS 2003 6HE A3](https://fintel.io/n/us/tmts)|3|560,000|10|5,599,700 \n[HLXA / Helix Acquisition Corp. Class A](https://fintel.io/n/us/hlxa)|1|430,000|10|4,300,000 \n[SELB / Selecta Biosciences, Inc.](https://fintel.io/n/us/selb)|2|1,669,500|2|3,808,195 \n[RADI / Radius Global Infrastructure, Inc. Class A](https://fintel.io/n/us/radi)|1|250,000|8|2,000,000 \n[ARYB / ARYA Sciences Acquisition Corp II Class A](https://fintel.io/n/us/aryb)|2|157,295|10|1,576,838 \n[GBDC / Golub Capital BDC, Inc.](https://fintel.io/n/us/gbdc)|8|40,000|13|530,513 \n[TACO / Del Taco Restaurants, Inc.](https://fintel.io/n/us/taco)|3|67,400|7|504,518  \n[HIE / Miller/Howard High Income Equity Fund](https://fintel.io/n/us/hie)|2|59,023|6|369,484 \n[KTEL / KonaTel, Inc.](https://fintel.io/n/us/ktel)|2|2,050,000|0|205,000 \n[FAF / First American Financial Corp. (The)](https://fintel.io/n/us/faf)|1|4,000|48|191,125 \n[TBK / Triumph Bancorp, Inc.](https://fintel.io/n/us/tbk)|1|7,000|26|182,000 \n[HQL / Tekla Life Sciences Investors](https://fintel.io/n/us/hql)|1|5,950|18|105,606 \n[HQH / Tekla Healthcare Investors](https://fintel.io/n/us/hqh)|1|5,050|21|104,427 \n[FAST / Fastenal Co.](https://fintel.io/n/us/fast)|2|1,550|44|68,865 \n[NDP / Tortoise Energy Independence Fund, Inc.](https://fintel.io/n/us/ndp)|4|5,466|11|57,135  \n[NJMC / New Jersey Mining Company](https://fintel.io/n/us/njmc)|1|250,000|0|50,000 \n[CADE / Cadence Bancorporation](https://fintel.io/n/us/cade)|1|4,000|12|48,440 \n[OPP / RiverNorth/DoubleLine Strategic Opportunity Fund, Inc.](https://fintel.io/n/us/opp)|3|3,100|15|46,172 \n[BIVI / BioVie, Inc.](https://fintel.io/n/us/bivi)|1|5,000|9|45,950 \n[DTRC / Dakota Territory Resource Corp](https://fintel.io/n/us/dtrc)|2|92,000|0|37,526 \n[CAS / A.M. Castle &amp;amp; Co.](https://fintel.io/n/us/cas)|1|138,962|0|36,130 \n[ADMQ / ADM Endeavors Inc](https://fintel.io/n/us/admq)|15|533,684|0|29,846 \n[NTRP / Neurotrope, Inc.](https://fintel.io/n/us/ntrp)|2|25,000|1|27,500 \n[TPL / Texas Pacific Land Trust](https://fintel.io/n/us/tpl)|4|56|471|26,379 \n[DCF / Dreyfus Alcentra Glb Cr Inc 2024](https://fintel.io/n/us/dcf)|1|2,700|8|21,141 \n[VRUS / Verus International](https://fintel.io/n/us/vrus)|1|25,109,375|0|20,088 \n[CCEL / CRYO-CELL International, Inc.](https://fintel.io/n/us/ccel)|1|2,000|7|13,880 \n[TCON / TRACON Pharmaceuticals, Inc.](https://fintel.io/n/us/tcon)|1|2,000|4|8,769 \n[SAFT / Safety Insurance Group, Inc.](https://fintel.io/n/us/saft)|1|100|68|6,800 \n[RCG / RENN Fund, Inc.](https://fintel.io/n/us/rcg)|12|2,700|1|3,769 \n[KSF / KINGSWAY FINANCIAL SERVICES INC](https://fintel.io/n/us/ksf)|3|1,120|3|3,529 \n[OVLY / Oak Valley Bancorp](https://fintel.io/n/us/ovly)|1|125|16|2,000\n\n## Largest Insider Selling (Last 7 Days)\nCompany|Count|Shares Change|Avg. Price|Value Change\n--------|-----:|-----:|-----:|--------:   \n[BKR / Michael Baker Corp](https://fintel.io/n/us/bkr)|1|-27,988,183|15|-417,303,809 \n[MA / MasterCard Incorporated](https://fintel.io/n/us/ma)|4|-120,400|334|-40,244,118  \n[PG / Procter &amp;amp; Gamble Co. (The)](https://fintel.io/n/us/pg)|6|-99,243|144|-14,271,377 \n[PSNL / Personalis, Inc.](https://fintel.io/n/us/psnl)|2|-326,909|28|-9,081,588 \n[GSHD / Goosehead Insurance, Inc.](https://fintel.io/n/us/gshd)|15|-75,267|111|-8,333,756 \n[MX / MagnaChip Semiconductor Corp](https://fintel.io/n/us/mx)|1|-425,000|14|-5,992,500 \n[K / Kellogg Co.](https://fintel.io/n/us/k)|1|-83,334|67|-5,543,928 \n[VRSK / Verisk Analytics, Inc.](https://fintel.io/n/us/vrsk)|4|-27,433|190|-5,227,370 \n[SIBN / SI-BONE, Inc.](https://fintel.io/n/us/sibn)|2|-198,327|24|-4,392,891 \n[PAYX / Paychex, Inc.](https://fintel.io/n/us/payx)|2|-51,606|84|-4,334,904 \n[STT / State Street Corp.](https://fintel.io/n/us/stt)|2|-62,183|66|-4,112,434 \n[PLAN / Anaplan, Inc.](https://fintel.io/n/us/plan)|1|-50,743|60|-3,044,555 \n[GRSH / Gores Holdings, Inc.](https://fintel.io/n/us/grsh)|2|-214,090|13|-2,856,874 \n[FDX / FedEx Corp.](https://fintel.io/n/us/fdx)|2|-8,795|290|-2,547,125 \n[APPF / AppFolio, Inc.](https://fintel.io/n/us/appf)|1|-12,413|159|-1,978,918 \n[LEVI / LEVI STRAUSS &amp;amp; CO](https://fintel.io/n/us/levi)|2|-119,401|16|-1,936,610 \n[AGM / Federal Agricultural Mortgage Corp.](https://fintel.io/n/us/agm)|3|-25,808|69|-1,785,533 \n[ARWR / Arrowhead Pharmaceuticals, Inc.](https://fintel.io/n/us/arwr)|1|-29,166|54|-1,576,131 \n[FUL / Fuller (H.B.) Co.](https://fintel.io/n/us/ful)|2|-27,839|49|-1,366,697 \n[ISIG / Insignia Systems, Inc.](https://fintel.io/n/us/isig)|2|-997,799|1|-1,223,746 \n[MDLA / Medallia, Inc.](https://fintel.io/n/us/mdla)|1|-32,391|31|-1,003,169 \n[MS / Morgan Stanley](https://fintel.io/n/us/ms)|5|-1,020,122|42|-986,884 \n[UMBF / UMB Financial Corp.](https://fintel.io/n/us/umbf)|74|-17,600|56|-986,804 \n[PGR / Progressive Corp. (The)](https://fintel.io/n/us/pgr)|1|-10,245|95|-971,933 \n[SNBR / Sleep Number Corporation](https://fintel.io/n/us/snbr)|3|-14,374|64|-922,066 \n[PRTS / U.S. Auto Parts Network, Inc.](https://fintel.io/n/us/prts)|3|-70,000|13|-913,100 \n[LOVE / Lovesac Co](https://fintel.io/n/us/love)|3|-24,151|35|-841,240 \n[SWAV / ShockWave Medical, Inc.](https://fintel.io/n/us/swav)|1|-9,500|79|-752,590  \n[GIS / General Mills, Inc.](https://fintel.io/n/us/gis)|1|-9,062|62|-558,129 \n[FLW / 1 800 FLOWERS COM INC](https://fintel.io/n/us/flw)|1|-17,850|29|-514,973 \n[ALLY / Ally Financial Inc.](https://fintel.io/n/us/ally)|2|-17,300|29|-502,090 \n[NEOG / Neogen Corp.](https://fintel.io/n/us/neog)|1|-6,666|71|-470,770 \n[TTEK / Tetra Tech, Inc.](https://fintel.io/n/us/ttek)|1|-15,000|29|-431,378 \n[SIVB / SVB Financial Group](https://fintel.io/n/us/sivb)|1|-1,495|280|-418,600 \n[KBH / KB Home](https://fintel.io/n/us/kbh)|1|-9,248|41|-376,671 \n[ATSG / Air Transport Services Group, Inc.](https://fintel.io/n/us/atsg)|1|-10,000|29|-293,900 \n[AMCI / AMCI Acquisition Corp.](https://fintel.io/n/us/amci)|1|-25,000|10|-258,750 \n[PURE / PURE Bioscience](https://fintel.io/n/us/pure)|1|-748,880|0|-217,175\n\n*Count* column is number of transactions.\n\nSource: [Fintel.io/insiders](https://fintel.io/insiders)",
        "subreddit": "StockMarket",
        "title": "Significant Insider Trading Activity (Last 7 Days)",
        "url": "https://www.reddit.com/r/StockMarket/comments/jgst60/significant_insider_trading_activity_last_7_days/",
        "created": 1603506507.0
    },
    {
        "author": "10milSocket",
        "created_utc": 1601908928,
        "id": "j5klx9",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Im in on about 1k in 10/16 calls.\n\nIm too ADHD for a DD, but I believe they'll beat earnings expectations and see a surge. Expecting share price to trade up to \\~85 by EOW.",
        "subreddit": "smallstreetbets",
        "title": "$PAYX - Paychex Earnings Tmmrw Pre Market",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/j5klx9/payx_paychex_earnings_tmmrw_pre_market/",
        "created": 1601937728.0
    }
]