[
    {
        "author": "Kant_sleep13",
        "created_utc": 1584017211,
        "id": "fhfsch",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Good morning. Here's my watch list for today\n\nGap ups: AHPI, APT, CEMI (over 200 pre market highs), CODX, INO, LAKE, TVIX/UVXY\n\nGap downs: ALC, AXSM, CRWD, ETSY, LK, NVDA, QRVO, TQQQ, TSLA, TTD, UBER\n\nMost likely we hit a limit down and circuit breakers kick in. Here's the levels: \n\n* **Level 1:** A drop of 7% from the prior day's closing price of the S&amp;P 500 triggers a 15-minute trading halt. Trading is not halted if the drop occurs at or after 3:25 p.m. ET.\n* **Level 2:** A drop of 13% triggers a 15-minute halt. Trading is not halted if the drop occurs at or after 3:25 p.m. ET.\n* **Level 3:** A drop of 20% triggers a halt for the rest of the trading day, and trading resumes the following day.\n\nWith that being said, pay attention to the market action if you do not want to get stuck in any halts. Spy is sitting on 200 DMA on weekly chart, we will have to see if this holds. Patience is your friend in these markets. Volatility is here and it will be here for a while to come. Not an ideal market for newer traders. Try not to look at the negative aspects, this is a good learning experience if you are studying and paying attention. Take the opportunity to do so. If you aren't an active trader, trade with small risk, trade paper, or watch. There will be better days when trading is more favorable. I will be focusing on TQQQ mostly due to the range. Good luck and be careful out there.",
        "subreddit": "stocks",
        "title": "Stock Watch List March 12, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/fhfsch/stock_watch_list_march_12_2020/",
        "created": 1584046011.0
    },
    {
        "author": "CapitalC5",
        "created_utc": 1584030296,
        "id": "fhiz3t",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "What (kind of) stock would you think will recover first, will come out of this easily or will have a big struggle surviving?\n\nFirst thing that comes to my mind is 5G stock. Should normally launch at the end of this year, so companies like Skyworks, Qorvo, Qualcomm, Apple, Verizon, AT&amp;T, etc. should be up pretty fast right?\n\nI see a struggle for cruise companies. Flights will always be necessary and will be back pretty fast, but cruises are more of a luxury thing. They also have more difficult financials and are more dependent I think.",
        "subreddit": "stocks",
        "title": "Let's talk about what comes after",
        "url": "https://www.reddit.com/r/stocks/comments/fhiz3t/lets_talk_about_what_comes_after/",
        "created": 1584059096.0
    }
]