[
    {
        "author": "[deleted]",
        "created_utc": 1584644036,
        "id": "flffkv",
        "num_comments": 0,
        "num_crossposts": 0,
        "subreddit": "wallstreetbets",
        "title": "AKAM",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/flffkv/akam/",
        "created": 1584672836.0
    },
    {
        "author": "Triumvus",
        "created_utc": 1584655190,
        "id": "flirgv",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "AKAM",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/flirgv/akam/",
        "created": 1584683990.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1583588782,
        "id": "fevbei",
        "num_comments": 120,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/wallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week and month ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning March 9th, 2020.\n\n# **Wall Street braces for more market volatility as wild swings become the ‘new normal’ amid coronavirus  - [(Source)](https://www.cnbc.com/2020/03/06/investors-brace-for-more-volatility-as-wild-swings-become-new-normal.html)**\n*****\n&gt; The S&amp;P 500 has never behaved like this, but Wall Street strategists say get used to it.\n*****\n&gt; Investors just witnessed the equity benchmark swinging up or down 2% for four days straight in the face of the coronavirus panic.\n*****\n&gt; In the index’s history dating back to 1927, this is the first time the S&amp;P 500 had a week of alternating gains and losses of more than 2% from Monday through Thursday, according to Bespoke Investment Group. Daily swings like this over a two-week period were only seen at the peak of the financial crisis and in 2011 when U.S. sovereign debt got its first-ever downgrade, the firm said.\n*****\n&gt; “The message to all investors is that they should expect this volatility to continue. This should be considered the new normal going forward,” said Mike Loewengart, managing director of investment strategy at E-Trade.\n*****\n&gt; The Dow Jones Industrial Average jumped north of 1,000 points twice in the past week, only to erase the quadruple-digit gains in the subsequent sessions. The coronavirus outbreak kept investors on edge as global cases of the infections surpassed 100,000. It’s also spreading rapidly in the U.S. California has declared a state of emergency, while the number of cases in New York reached 33.\n*****\n&gt; “Uncertainty breeds greater market volatility,” Keith Lerner, SunTrust’s chief market strategist, said in a note. “Much is still unknown about how severe and widespread the coronavirus will become. From a market perspective, what we are seeing is uncomfortable but somewhat typical after shock periods.”\n*****\n&gt; # More stimulus?\n&gt; So far, the actions from global central banks and governments in response to the outbreak haven’t triggered a sustainable rebound.\n*****\n&gt; The Federal Reserve’s first emergency rate cut since the financial crisis did little to calm investor anxiety. President Donald Trump on Friday signed a sweeping spending bill with an$8.3 billion packageto aid prevention efforts to produce a vaccine for the deadly disease, but stocks extended their heavy rout that day.\n*****\n&gt; “The market is recognizing the global authorities are responding to this,” said Tom Essaye, founder of the Sevens Report. “If the market begins to worry they are not doing that sufficiently, then I think we are going to go down ugly. It is helping stocks hold up.”\n*****\n&gt; Essaye said any further stimulus from China and a decent-sized fiscal package from Germany would be positive to the market, but he doesn’t expect the moves to create a huge rebound.\n*****\n&gt; The fed funds future market is now pricing in the possibility of the U.S. central bank cutting by 75 basis points at its March 17-18 meeting.\n*****\n&gt; # Where is the bottom?\n&gt; Many on Wall Street expect the market to fall further before recovering as the health crisis unfolds.\n*****\n&gt; Binky Chadha, Deutsche Bank’s chief equity strategist, sees a bottom for the S&amp;P 500 in the second quarter after stocks falling as much as 20% from their recent peak.\n*****\n&gt; “The magnitude of the selloff in the S&amp;P 500 so far has further to go; and in terms of duration, just two weeks in, it is much too early to declare this episode as being done,” Chadha said in a note. “We do view the impacts on macro and earnings growth as being relatively short-lived and the market eventually looking through them.”\n*****\n&gt; Deutsche Bank maintained its year-end target of 3,250 for the S&amp;P 500, which would represent a 10% gain from here and a flat return for 2020.\n*****\n&gt; Strategists are also urging patience during this heightened volatility, cautioning against panic selling.\n*****\n&gt; “It is during times like these that investors need to maintain a longer-term perspective and stick to their investment process rather than making knee-jerk, binary decisions,” Brian Belski, chief investment strategist at BMO Capital Markets, said in a note.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/qgFoWQB.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/7eQW0Js.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/mFotkBJ.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/XSXVPJQ.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/deKt8eq.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/HYaxtrz.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/yygsO0C.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/oCNZNbl.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/4OOLYTY.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/y35bngj.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/E6twMcN.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/ttAWeD2.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/Dl7NlBA.png))**\n\n*****\n\n# A \"Run of the Mill\" Drawdown\n\n&gt; If you're like us, you've heard a lot of people reference the recent equity declines as a sign that the market is pricing in some sort of Armageddon in the US economy. While comments like that make for great soundbites, a little perspective is in order. Since the S&amp;P 500's high on February 19th, the S&amp;P 500 is down 12.8%. In the chart below, we show the S&amp;P 500's annual maximum drawdown by year going back to 1928. In the entire history of the index, the median maximum drawdown from a YTD high is 13.05%. In other words, this year's decline is actually less than normal. Perhaps due to the fact that we have only seen one larger-than-average drawdown in the last eight years is why this one feels so bad.\n\n&gt; The fact that the current decline has only been inline with the historical norm raises a number of questions. For example, if the market has already priced in the worst-case scenario, going out and adding some equity exposure would be a no brainer. However, if we're only in the midst of a 'normal' drawdown in the equity market as the coronavirus outbreak threatens to put the economy into a recession, one could argue that things for the stock market could get worse before they get better, especially when we know that the market can be prone to over-reaction in both directions. The fact is that nobody knows right now how this entire outbreak will play out. If it really is a black swan, the market definitely has further to fall and now would present a great opportunity to sell more equities. However, if it proves to be temporary and after a quarter or two resolves itself and the economy gets back on the path it was on at the start of the year, then the magnitude of the current decline is probably appropriate. As they say, that's what makes a market!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/030620-Drawdowns.png))**\n\n*****\n\n# Long-Term Treasuries Go Haywire\n\n&gt; Take a good luck at today's moves in long-term US Treasury yields, because chances are you won't see moves of this magnitude again soon. Let's start with the yield on the 30-year US Treasury. Today's decline of 29 basis points in the yield will go down as the largest one-day decline in the yield on the 30-year since 2009. For some perspective, there have only been 25 other days since 1977 where the yield saw a larger one day decline.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/030620-Change.png))**\n\n&gt; That doesn't even tell the whole story, though. As shown in the chart below, every other time the yield saw a sharper one-day decline, the actual yield of the 30-year was much higher, and in most other cases it was much, much higher.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/030620-Yield.png))**\n\n&gt; To show this another way, the percentage change in the yield on the 30-year has never been seen before, and it's not even close. Now, before the chart crime police come calling, we realize showing a percentage change of a percentage is not the most accurate representation, but we wanted to show this for illustrative purposes only.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/030620-Percent-change-in-yield.png))**\n\n&gt; Finally, with long-term interest rates plummetting we wanted to provide an update on the performance of the Austrian 100-year bond. That's now back at record highs, begging the question, why is the US not flooding the market with long-term debt?\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/030620-Austria.png))**\n\n*****\n\n# It Doesn't Get Much Worse Than This For Crude Oil\n\n&gt; Crude oil prices are down close to 10% today in what is shaping up to be the worst day for crude oil since late 2014. That's more than five years.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/030620-Crude-Oil-Daily-Changes.png))**\n\n&gt; Today's decline is pretty much a continuation of what has been a one-way trade for the commodity ever since the US drone strike on Iranian general Soleimani. The last time prices were this low was around Christmas 2018.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/030620-Crude-Oil.png))**\n\n&gt; With today's decline, crude oil is now off to its worst start to a year in a generation falling 32%. Since 1984, the only other year that was worse was 1986 when the year started out with a decline of 50% through March 6th. If you're looking for a bright spot, in 1986, prices rose 36% over the remainder of the year. The only other year where crude oil kicked off the year with a 30% decline was in 1991 after the first Iraq war. Over the remainder of that year, prices rose a more modest 5%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/030620-Crude-Oil-YTD-Starts.png))**\n\n*****\n\n# 10-Year Treasury Yield Breaks Below 1%\n\n&gt; Despite strong market gains on Wednesday, March 4, 2020, the on-the-run 10-year Treasury yield ended the day below 1% for the first time ever and has posted additional declines in real time, sitting at 0.92% intraday as this blog is being written. “The decline in yields has been remarkable,” said LPL Research Senior Market Strategist Ryan Detrick. “The 10-year Treasury yield has dipped below 1%, and today’s declines are likely to make the recent run lower the largest decline of the cycle.”\n\n&gt; As shown in LPL Research’s chart of the day, the current decline in the 10-year Treasury yield without a meaningful reversal (defined as at least 0.75%) is approaching the decline seen in 2011 and 2012 and would need about another two months to be the longest decline in length of time. At the same time, no prior decline has lasted forever and a pattern of declines and increases has been normal.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/03/Blog-chart-3.5.20.png?ssl=1))**\n\n&gt; What are some things that can push the 10-year Treasury yield lower?\n\n&gt; * A shrinking but still sizable yield advantage over other developed market sovereign debt\n&gt; * Added stock volatility if downside risks to economic growth from the coronavirus increase\n&gt; * A larger potential premium over shorter-term yields if the Federal Reserve aggressively cuts interest rates\n\n&gt; What are some things that can push the 10-year Treasury yield higher?\n\n&gt; * A second half economic rebound acting a catalyst for a Treasury sell-off\n&gt; * As yields move lower, investors may increasingly seek more attractive sources of income\n&gt; * Any dollar weakness could lead to some selling by international investors\n&gt; * Longer maturity Treasuries are looking like an increasingly crowded trade, potentially adding energy to any sell-off\n\n&gt; On balance, our view remains that the prospect of an economic rebound over the second half points to the potential for interest rates moving higher. At the same time, we still see some advantage in the potential diversification benefits of intermediate maturity high-quality bonds, especially during periods of market stress. We continue to recommend that suitable investors consider keeping a bond portfolio’s sensitivity to changes in interest rates below that of the benchmark Bloomberg Barclays U.S. Aggregate Bond Index by emphasizing short to intermediate maturity bonds, but do not believe it’s time to pile into very short maturities despite the 10-year Treasury yield sitting at historically low levels.\n\n*****\n\n# U.S. Jobs Growth Marches On\n\n&gt; While stock markets continue to be extremely volatile as they come to terms with how the coronavirus may affect global growth, the U.S. job market has remained remarkably robust. Continued U.S. jobs data resilience in the face of headwinds from the coronavirus outbreak may be a key factor in prolonging the expansion, given how important the strength of the U.S. consumer has been late into this expansion.\n\n&gt; The U.S. Department of Labor today reported that U.S. nonfarm payroll data had a strong showing of 273,000 jobs added in February, topping the expectation of every Bloomberg-surveyed economist, with an additional upward revision of 85,000 additional jobs for December 2019 and January 2020. This has brought the current unemployment rate back to its 50-year low of 3.5%. So far, it appears it’s too soon for any effects of the coronavirus to have been felt in the jobs numbers. (Note: The survey takes place in the middle of each month.)\n\n&gt; On Wednesday, ADP released its private payroll data (excluding government jobs), which increased by 183,000 in February, also handily beating market expectations. Most of these jobs were added in the service sector, with 44,000 added in the leisure and hospitality sector, and another 31,000 in trade/transportation/utilities. Both of these areas could be at risk of potential cutbacks if consumers start to avoid eating out or other leisure pursuits due to coronavirus fears.\n\n&gt; As shown in the LPL Chart of the Day, payrolls remain strong, and any effects of the virus outbreaks most likely would be felt in coming months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/03/US-Jobs-Data.png?ssl=1))**\n\n&gt; “February’s jobs report shows the 113th straight month that the U.S. jobs market has grown,” said LPL Financial Senior Market Strategist Ryan Detrick. “That’s an incredible run and highlights how the U.S. consumer has become key to extending the expansion, especially given setbacks to global growth from the coronavirus outbreak.”\n\n&gt; While there is bound to be some drag on future jobs data from the coronavirus-related slowdown, we would anticipate that the effects of this may be transitory. We believe economic fundamentals continue to suggest the possibility of a second-half-of-the–year economic rebound.\n\n*****\n\n# Down January &amp; Down February: S&amp;P 500 Posts Full-Year Gain Just 43.75% of Time\n\n&gt; The combination of a down January and a down February has come about 17 times, including this year, going back to 1950. Rest of the year and full-year performance has taken a rather sizable hit following the previous 16 occurrences. March through December S&amp;P 500 average performance drops to 2.32% compared to 7.69% in all years. Full-year performance is even worse with S&amp;P 500 average turning to a loss of 4.91% compared to an average gain of 9.14% in all years. All hope for 2020 is not lost as seven of the 16 past down January and down February years did go on to log gains over the last 10 months and full year while six enjoyed double-digit gains from March to December.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/781e034df22d242349ff3f8882653cec/b4f07d98317a2635-4d/s500x750/0ea61b1c01085e74593633995acba59fe8a96ce8.jpg))**\n\n*****\n\n# Take Caution After Emergency Rate Cut\n\n&gt; Today’s big rally was an encouraging sign that the markets are becoming more comfortable with the public health, monetary and political handling of the situation. But the history of these “emergency” or “surprise” rate cuts by the Fed between meetings suggest some caution remains in order.\n\n&gt; The table here shows that these surprise cuts between meetings have really only “worked” once in the past 20+ years. In 1998 when the Fed and the plunge protection team acted swiftly and in a coordinated manner to stave off the fallout from the financial crisis caused by the collapse of the Russian ruble and the highly leveraged Long Term Capital Management hedge fund markets responded well. This was not the case during the extended bear markets of 2001-2002 and 2007-2009.\n\n&gt; Bottom line: if this is a short-term impact like the 1998 financial crisis the market should recover sooner rather than later. But if the economic impact of coronavirus virus is prolonged, the market is more likely to languish.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/fd9ae8723eaf077f8baa56e384c8d8f7/e543b6eee32cdf93-81/s500x750/0f2b63108953c1e4cfb97da0a979d4ab3651cdeb.jpg))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$ADBE** \n&gt; * **$DKS**\n&gt; * **$AVGO** \n&gt; * **$THO** \n&gt; * **$ULTA** \n&gt; * **$WORK** \n&gt; * **$DG** \n&gt; * **$SFIX** \n&gt; * **$SOGO** \n&gt; * **$DOCU** \n&gt; * **$INO** \n&gt; * **$CLDR** \n&gt; * **$INSG** \n&gt; * **$SOHU** \n&gt; * **$BTAI** \n&gt; * **$ORCL** \n&gt; * **$HEAR** \n&gt; * **$NVAX** \n&gt; * **$ADDYY** \n&gt; * **$GPS** \n&gt; * **$AKBA** \n&gt; * **$PDD** \n&gt; * **$CYOU** \n&gt; * **$FNV** \n&gt; * **$MTNB** \n&gt; * **$NERV** \n&gt; * **$MTN** \n&gt; * **$BEST** \n&gt; * **$PRTY** \n&gt; * **$NINE** \n&gt; * **$AZUL** \n&gt; * **$UNFI** \n&gt; * **$PRPL** \n&gt; * **$VSLR** \n&gt; * **$KLZE** \n&gt; * **$ZUO** \n&gt; * **$DVAX** \n&gt; * **$EXPR** \n&gt; * **$VRA** \n&gt; * **$AXSM** \n&gt; * **$CDMO** \n&gt; * **$CASY**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/4OOLYTY.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/MY5URDI.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 3.9.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Fq1ixYG.png))\n\n\n&gt; # ***Monday 3.9.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/3QxCDMd.png))\n\n\n*****\n\n&gt; # ***Tuesday 3.10.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/kG5Cja7.png))\n\n&gt; # ***Tuesday 3.10.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/SWb2ADY.png))\n\n*****\n\n&gt; # ***Wednesday 3.11.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/SH8bsTn.png))\n\n&gt; # ***Wednesday 3.11.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/PH2Inly.png))\n\n*****\n\n&gt; # ***Thursday 3.12.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/RToRF8p.png))\n\n&gt; # ***Thursday 3.12.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/HECD2g3.png))\n\n*****\n\n&gt; # ***Friday 3.13.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/BvEJ9Vw.png))\n\n*****\n\n&gt; # ***Friday 3.13.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# Adobe Inc. $336.77\n&gt; **Adobe Inc. (ADBE)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, March 12, 2020. The consensus earnings estimate is $2.23 per share on revenue of $3.04 billion and the Earnings Whisper ® number is $2.29 per share. Investor sentiment going into the company's earnings release has 81% expecting an earnings beat The company's guidance was for earnings of approximately $2.23 per share. Consensus estimates are for year-over-year earnings growth of 29.65% with revenue increasing by 16.88%. Short interest has decreased by 38.4% since the company's last earnings release while the stock has drifted higher by 7.2% from its open following the earnings release to be 10.9% above its 200 day moving average of $303.70. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, February 24, 2020 there was some notable buying of 1,109 contracts of the $400.00 call expiring on Friday, March 20, 2020. Option traders are pricing in a 9.3% move on earnings and the stock has averaged a 4.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ADBE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DICK'S Sporting Goods, Inc. $34.98\n&gt; **DICK'S Sporting Goods, Inc. (DKS)** is confirmed to report earnings at approximately 7:30 AM ET on Tuesday, March 10, 2020. The consensus earnings estimate is $1.23 per share on revenue of $2.56 billion and the Earnings Whisper ® number is $1.28 per share. Investor sentiment going into the company's earnings release has 57% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 14.95% with revenue increasing by 2.73%. Short interest has decreased by 29.1% since the company's last earnings release while the stock has drifted lower by 20.3% from its open following the earnings release to be 12.0% below its 200 day moving average of $39.75. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, February 26, 2020 there was some notable buying of 848 contracts of the $39.00 put expiring on Friday, March 20, 2020. Option traders are pricing in a 14.4% move on earnings and the stock has averaged a 7.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DKS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Broadcom Limited $269.45\n&gt; **Broadcom Limited (AVGO)** is confirmed to report earnings at approximately 4:15 PM ET on Thursday, March 12, 2020. The consensus earnings estimate is $5.34 per share on revenue of $5.93 billion and the Earnings Whisper ® number is $5.45 per share. Investor sentiment going into the company's earnings release has 83% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 5.65% with revenue increasing by 2.44%. Short interest has decreased by 15.6% since the company's last earnings release while the stock has drifted lower by 15.3% from its open following the earnings release to be 7.7% below its 200 day moving average of $291.95. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, February 25, 2020 there was some notable buying of 1,197 contracts of the $260.00 put expiring on Friday, April 17, 2020. Option traders are pricing in a 11.1% move on earnings and the stock has averaged a 4.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AVGO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Thor Industries, Inc. $70.04\n&gt; **Thor Industries, Inc. (THO)** is confirmed to report earnings at approximately 6:45 AM ET on Monday, March 9, 2020. The consensus earnings estimate is $0.76 per share on revenue of $1.79 billion and the Earnings Whisper ® number is $0.84 per share. Investor sentiment going into the company's earnings release has 62% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 16.92% with revenue increasing by 38.70%. Short interest has decreased by 12.9% since the company's last earnings release while the stock has drifted higher by 5.4% from its open following the earnings release to be 12.0% above its 200 day moving average of $62.53. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 6.3% move on earnings and the stock has averaged a 8.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=THO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# ULTA Beauty $256.58\n&gt; **ULTA Beauty (ULTA)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, March 12, 2020. The consensus earnings estimate is $3.71 per share on revenue of $2.29 billion and the Earnings Whisper ® number is $3.75 per share. Investor sentiment going into the company's earnings release has 73% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 2.77% with revenue increasing by 7.78%. Short interest has increased by 8.7% since the company's last earnings release while the stock has drifted lower by 0.1% from its open following the earnings release to be 9.5% below its 200 day moving average of $283.43. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 15.3% move on earnings and the stock has averaged a 11.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ULTA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Slack Technologies, Inc. $26.42\n&gt; **Slack Technologies, Inc. (WORK)** is confirmed to report earnings at approximately 4:15 PM ET on Thursday, March 12, 2020. The consensus estimate is for a loss of $0.06 per share on revenue of $173.06 million and the Earnings Whisper ® number is ($0.04) per share. Investor sentiment going into the company's earnings release has 67% expecting an earnings beat The company's guidance was for a loss of $0.07 to $0.06 per share on revenue of $172.00 million to $174.00 million. Short interest has increased by 1.2% since the company's last earnings release while the stock has drifted higher by 19.0% from its open following the earnings release. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 4.3% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=WORK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Dollar General Corporation $158.38\n&gt; **Dollar General Corporation (DG)** is confirmed to report earnings at approximately 6:55 AM ET on Thursday, March 12, 2020. The consensus earnings estimate is $2.02 per share on revenue of $7.15 billion and the Earnings Whisper ® number is $2.05 per share. Investor sentiment going into the company's earnings release has 76% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 9.78% with revenue increasing by 7.52%. Short interest has increased by 16.2% since the company's last earnings release while the stock has drifted higher by 1.8% from its open following the earnings release to be 5.7% above its 200 day moving average of $149.88. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, February 28, 2020 there was some notable buying of 1,013 contracts of the $182.50 call expiring on Friday, March 20, 2020. Option traders are pricing in a 9.2% move on earnings and the stock has averaged a 5.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Stitch Fix, Inc. $22.78\n&gt; **Stitch Fix, Inc. (SFIX)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, March 9, 2020. The consensus earnings estimate is $0.06 per share on revenue of $452.96 million and the Earnings Whisper ® number is $0.09 per share. Investor sentiment going into the company's earnings release has 83% expecting an earnings beat The company's guidance was for revenue of $447.00 million to $455.00 million. Consensus estimates are for earnings to decline year-over-year by 50.00% with revenue increasing by 22.33%. Short interest has decreased by 4.6% since the company's last earnings release while the stock has drifted lower by 16.1% from its open following the earnings release to be 5.1% below its 200 day moving average of $24.01. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, February 19, 2020 there was some notable buying of 4,026 contracts of the $35.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 28.0% move on earnings and the stock has averaged a 15.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SFIX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Sogou Inc. $3.85\n&gt; **Sogou Inc. (SOGO)** is confirmed to report earnings at approximately 4:00 AM ET on Monday, March 9, 2020. The consensus earnings estimate is $0.09 per share on revenue of $303.08 million and the Earnings Whisper ® number is $0.10 per share. Investor sentiment going into the company's earnings release has 58% expecting an earnings beat The company's guidance was for revenue of $290.00 million to $310.00 million. Consensus estimates are for year-over-year earnings growth of 28.57% with revenue increasing by 1.78%. Short interest has increased by 6.6% since the company's last earnings release while the stock has drifted lower by 27.8% from its open following the earnings release to be 15.7% below its 200 day moving average of $4.57. Overall earnings estimates have been revised lower since the company's last earnings release. The stock has averaged a 3.8% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SOGO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DocuSign $84.02\n&gt; **DocuSign (DOCU)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, March 12, 2020. The consensus earnings estimate is $0.05 per share on revenue of $267.44 million and the Earnings Whisper ® number is $0.08 per share. Investor sentiment going into the company's earnings release has 81% expecting an earnings beat The company's guidance was for revenue of $263.00 million to $267.00 million. Consensus estimates are for year-over-year earnings growth of 600.00% with revenue increasing by 33.90%. Short interest has decreased by 37.7% since the company's last earnings release while the stock has drifted higher by 12.1% from its open following the earnings release to be 31.9% above its 200 day moving average of $63.71. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, March 4, 2020 there was some notable buying of 1,698 contracts of the $87.50 call expiring on Friday, March 20, 2020. Option traders are pricing in a 8.5% move on earnings and the stock has averaged a 10.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DOCU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/wallstreetbets.",
        "subreddit": "wallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning March 9th, 2020",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fevbei/wall_street_week_ahead_for_the_trading_week/",
        "created": 1583617582.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1583588542,
        "id": "fev9sm",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/StockMarket. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week and month ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning March 9th, 2020.\n\n# **Wall Street braces for more market volatility as wild swings become the ‘new normal’ amid coronavirus  - [(Source)](https://www.cnbc.com/2020/03/06/investors-brace-for-more-volatility-as-wild-swings-become-new-normal.html)**\n*****\n&gt; The S&amp;P 500 has never behaved like this, but Wall Street strategists say get used to it.\n*****\n&gt; Investors just witnessed the equity benchmark swinging up or down 2% for four days straight in the face of the coronavirus panic.\n*****\n&gt; In the index’s history dating back to 1927, this is the first time the S&amp;P 500 had a week of alternating gains and losses of more than 2% from Monday through Thursday, according to Bespoke Investment Group. Daily swings like this over a two-week period were only seen at the peak of the financial crisis and in 2011 when U.S. sovereign debt got its first-ever downgrade, the firm said.\n*****\n&gt; “The message to all investors is that they should expect this volatility to continue. This should be considered the new normal going forward,” said Mike Loewengart, managing director of investment strategy at E-Trade.\n*****\n&gt; The Dow Jones Industrial Average jumped north of 1,000 points twice in the past week, only to erase the quadruple-digit gains in the subsequent sessions. The coronavirus outbreak kept investors on edge as global cases of the infections surpassed 100,000. It’s also spreading rapidly in the U.S. California has declared a state of emergency, while the number of cases in New York reached 33.\n*****\n&gt; “Uncertainty breeds greater market volatility,” Keith Lerner, SunTrust’s chief market strategist, said in a note. “Much is still unknown about how severe and widespread the coronavirus will become. From a market perspective, what we are seeing is uncomfortable but somewhat typical after shock periods.”\n*****\n&gt; More stimulus?\n&gt; So far, the actions from global central banks and governments in response to the outbreak haven’t triggered a sustainable rebound.\n*****\n&gt; The Federal Reserve’s first emergency rate cut since the financial crisis did little to calm investor anxiety. President Donald Trump on Friday signed a sweeping spending bill with an$8.3 billion packageto aid prevention efforts to produce a vaccine for the deadly disease, but stocks extended their heavy rout that day.\n*****\n&gt; “The market is recognizing the global authorities are responding to this,” said Tom Essaye, founder of the Sevens Report. “If the market begins to worry they are not doing that sufficiently, then I think we are going to go down ugly. It is helping stocks hold up.”\n*****\n&gt; Essaye said any further stimulus from China and a decent-sized fiscal package from Germany would be positive to the market, but he doesn’t expect the moves to create a huge rebound.\n*****\n&gt; The fed funds future market is now pricing in the possibility of the U.S. central bank cutting by 75 basis points at its March 17-18 meeting.\n*****\n&gt; Where is the bottom?\n&gt; Many on Wall Street expect the market to fall further before recovering as the health crisis unfolds.\n*****\n&gt; Binky Chadha, Deutsche Bank’s chief equity strategist, sees a bottom for the S&amp;P 500 in the second quarter after stocks falling as much as 20% from their recent peak.\n*****\n&gt; “The magnitude of the selloff in the S&amp;P 500 so far has further to go; and in terms of duration, just two weeks in, it is much too early to declare this episode as being done,” Chadha said in a note. “We do view the impacts on macro and earnings growth as being relatively short-lived and the market eventually looking through them.”\n*****\n&gt; Deutsche Bank maintained its year-end target of 3,250 for the S&amp;P 500, which would represent a 10% gain from here and a flat return for 2020.\n*****\n&gt; Strategists are also urging patience during this heightened volatility, cautioning against panic selling.\n*****\n&gt; “It is during times like these that investors need to maintain a longer-term perspective and stick to their investment process rather than making knee-jerk, binary decisions,” Brian Belski, chief investment strategist at BMO Capital Markets, said in a note.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/qgFoWQB.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/7eQW0Js.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/mFotkBJ.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/XSXVPJQ.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/deKt8eq.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/HYaxtrz.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/yygsO0C.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/oCNZNbl.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/4OOLYTY.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/y35bngj.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/E6twMcN.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/ttAWeD2.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/Dl7NlBA.png))**\n\n*****\n\n# A \"Run of the Mill\" Drawdown\n\n&gt; If you're like us, you've heard a lot of people reference the recent equity declines as a sign that the market is pricing in some sort of Armageddon in the US economy. While comments like that make for great soundbites, a little perspective is in order. Since the S&amp;P 500's high on February 19th, the S&amp;P 500 is down 12.8%. In the chart below, we show the S&amp;P 500's annual maximum drawdown by year going back to 1928. In the entire history of the index, the median maximum drawdown from a YTD high is 13.05%. In other words, this year's decline is actually less than normal. Perhaps due to the fact that we have only seen one larger-than-average drawdown in the last eight years is why this one feels so bad.\n\n&gt; The fact that the current decline has only been inline with the historical norm raises a number of questions. For example, if the market has already priced in the worst-case scenario, going out and adding some equity exposure would be a no brainer. However, if we're only in the midst of a 'normal' drawdown in the equity market as the coronavirus outbreak threatens to put the economy into a recession, one could argue that things for the stock market could get worse before they get better, especially when we know that the market can be prone to over-reaction in both directions. The fact is that nobody knows right now how this entire outbreak will play out. If it really is a black swan, the market definitely has further to fall and now would present a great opportunity to sell more equities. However, if it proves to be temporary and after a quarter or two resolves itself and the economy gets back on the path it was on at the start of the year, then the magnitude of the current decline is probably appropriate. As they say, that's what makes a market!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/030620-Drawdowns.png))**\n\n*****\n\n# Long-Term Treasuries Go Haywire\n\n&gt; Take a good luck at today's moves in long-term US Treasury yields, because chances are you won't see moves of this magnitude again soon. Let's start with the yield on the 30-year US Treasury. Today's decline of 29 basis points in the yield will go down as the largest one-day decline in the yield on the 30-year since 2009. For some perspective, there have only been 25 other days since 1977 where the yield saw a larger one day decline.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/030620-Change.png))**\n\n&gt; That doesn't even tell the whole story, though. As shown in the chart below, every other time the yield saw a sharper one-day decline, the actual yield of the 30-year was much higher, and in most other cases it was much, much higher.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/030620-Yield.png))**\n\n&gt; To show this another way, the percentage change in the yield on the 30-year has never been seen before, and it's not even close. Now, before the chart crime police come calling, we realize showing a percentage change of a percentage is not the most accurate representation, but we wanted to show this for illustrative purposes only.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/030620-Percent-change-in-yield.png))**\n\n&gt; Finally, with long-term interest rates plummetting we wanted to provide an update on the performance of the Austrian 100-year bond. That's now back at record highs, begging the question, why is the US not flooding the market with long-term debt?\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/030620-Austria.png))**\n\n*****\n\n# It Doesn't Get Much Worse Than This For Crude Oil\n\n&gt; Crude oil prices are down close to 10% today in what is shaping up to be the worst day for crude oil since late 2014. That's more than five years.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/030620-Crude-Oil-Daily-Changes.png))**\n\n&gt; Today's decline is pretty much a continuation of what has been a one-way trade for the commodity ever since the US drone strike on Iranian general Soleimani. The last time prices were this low was around Christmas 2018.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/030620-Crude-Oil.png))**\n\n&gt; With today's decline, crude oil is now off to its worst start to a year in a generation falling 32%. Since 1984, the only other year that was worse was 1986 when the year started out with a decline of 50% through March 6th. If you're looking for a bright spot, in 1986, prices rose 36% over the remainder of the year. The only other year where crude oil kicked off the year with a 30% decline was in 1991 after the first Iraq war. Over the remainder of that year, prices rose a more modest 5%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/030620-Crude-Oil-YTD-Starts.png))**\n\n*****\n\n# 10-Year Treasury Yield Breaks Below 1%\n\n&gt; Despite strong market gains on Wednesday, March 4, 2020, the on-the-run 10-year Treasury yield ended the day below 1% for the first time ever and has posted additional declines in real time, sitting at 0.92% intraday as this blog is being written. “The decline in yields has been remarkable,” said LPL Research Senior Market Strategist Ryan Detrick. “The 10-year Treasury yield has dipped below 1%, and today’s declines are likely to make the recent run lower the largest decline of the cycle.”\n\n&gt; As shown in LPL Research’s chart of the day, the current decline in the 10-year Treasury yield without a meaningful reversal (defined as at least 0.75%) is approaching the decline seen in 2011 and 2012 and would need about another two months to be the longest decline in length of time. At the same time, no prior decline has lasted forever and a pattern of declines and increases has been normal.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/03/Blog-chart-3.5.20.png?ssl=1))**\n\n&gt; What are some things that can push the 10-year Treasury yield lower?\n\n&gt; * A shrinking but still sizable yield advantage over other developed market sovereign debt\n&gt; * Added stock volatility if downside risks to economic growth from the coronavirus increase\n&gt; * A larger potential premium over shorter-term yields if the Federal Reserve aggressively cuts interest rates\n\n&gt; What are some things that can push the 10-year Treasury yield higher?\n\n&gt; * A second half economic rebound acting a catalyst for a Treasury sell-off\n&gt; * As yields move lower, investors may increasingly seek more attractive sources of income\n&gt; * Any dollar weakness could lead to some selling by international investors\n&gt; * Longer maturity Treasuries are looking like an increasingly crowded trade, potentially adding energy to any sell-off\n\n&gt; On balance, our view remains that the prospect of an economic rebound over the second half points to the potential for interest rates moving higher. At the same time, we still see some advantage in the potential diversification benefits of intermediate maturity high-quality bonds, especially during periods of market stress. We continue to recommend that suitable investors consider keeping a bond portfolio’s sensitivity to changes in interest rates below that of the benchmark Bloomberg Barclays U.S. Aggregate Bond Index by emphasizing short to intermediate maturity bonds, but do not believe it’s time to pile into very short maturities despite the 10-year Treasury yield sitting at historically low levels.\n\n*****\n\n# U.S. Jobs Growth Marches On\n\n&gt; While stock markets continue to be extremely volatile as they come to terms with how the coronavirus may affect global growth, the U.S. job market has remained remarkably robust. Continued U.S. jobs data resilience in the face of headwinds from the coronavirus outbreak may be a key factor in prolonging the expansion, given how important the strength of the U.S. consumer has been late into this expansion.\n\n&gt; The U.S. Department of Labor today reported that U.S. nonfarm payroll data had a strong showing of 273,000 jobs added in February, topping the expectation of every Bloomberg-surveyed economist, with an additional upward revision of 85,000 additional jobs for December 2019 and January 2020. This has brought the current unemployment rate back to its 50-year low of 3.5%. So far, it appears it’s too soon for any effects of the coronavirus to have been felt in the jobs numbers. (Note: The survey takes place in the middle of each month.)\n\n&gt; On Wednesday, ADP released its private payroll data (excluding government jobs), which increased by 183,000 in February, also handily beating market expectations. Most of these jobs were added in the service sector, with 44,000 added in the leisure and hospitality sector, and another 31,000 in trade/transportation/utilities. Both of these areas could be at risk of potential cutbacks if consumers start to avoid eating out or other leisure pursuits due to coronavirus fears.\n\n&gt; As shown in the LPL Chart of the Day, payrolls remain strong, and any effects of the virus outbreaks most likely would be felt in coming months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/03/US-Jobs-Data.png?ssl=1))**\n\n&gt; “February’s jobs report shows the 113th straight month that the U.S. jobs market has grown,” said LPL Financial Senior Market Strategist Ryan Detrick. “That’s an incredible run and highlights how the U.S. consumer has become key to extending the expansion, especially given setbacks to global growth from the coronavirus outbreak.”\n\n&gt; While there is bound to be some drag on future jobs data from the coronavirus-related slowdown, we would anticipate that the effects of this may be transitory. We believe economic fundamentals continue to suggest the possibility of a second-half-of-the–year economic rebound.\n\n*****\n\n# Down January &amp; Down February: S&amp;P 500 Posts Full-Year Gain Just 43.75% of Time\n\n&gt; The combination of a down January and a down February has come about 17 times, including this year, going back to 1950. Rest of the year and full-year performance has taken a rather sizable hit following the previous 16 occurrences. March through December S&amp;P 500 average performance drops to 2.32% compared to 7.69% in all years. Full-year performance is even worse with S&amp;P 500 average turning to a loss of 4.91% compared to an average gain of 9.14% in all years. All hope for 2020 is not lost as seven of the 16 past down January and down February years did go on to log gains over the last 10 months and full year while six enjoyed double-digit gains from March to December.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/781e034df22d242349ff3f8882653cec/b4f07d98317a2635-4d/s500x750/0ea61b1c01085e74593633995acba59fe8a96ce8.jpg))**\n\n*****\n\n# Take Caution After Emergency Rate Cut\n\n&gt; Today’s big rally was an encouraging sign that the markets are becoming more comfortable with the public health, monetary and political handling of the situation. But the history of these “emergency” or “surprise” rate cuts by the Fed between meetings suggest some caution remains in order.\n\n&gt; The table here shows that these surprise cuts between meetings have really only “worked” once in the past 20+ years. In 1998 when the Fed and the plunge protection team acted swiftly and in a coordinated manner to stave off the fallout from the financial crisis caused by the collapse of the Russian ruble and the highly leveraged Long Term Capital Management hedge fund markets responded well. This was not the case during the extended bear markets of 2001-2002 and 2007-2009.\n\n&gt; Bottom line: if this is a short-term impact like the 1998 financial crisis the market should recover sooner rather than later. But if the economic impact of coronavirus virus is prolonged, the market is more likely to languish.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/fd9ae8723eaf077f8baa56e384c8d8f7/e543b6eee32cdf93-81/s500x750/0f2b63108953c1e4cfb97da0a979d4ab3651cdeb.jpg))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending March 6th, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=WonBP-yE0EI&amp;t=2s))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 3.8.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=Xpc7iemBajE))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$ADBE** \n&gt; * **$DKS**\n&gt; * **$AVGO** \n&gt; * **$THO** \n&gt; * **$ULTA** \n&gt; * **$WORK** \n&gt; * **$DG** \n&gt; * **$SFIX** \n&gt; * **$SOGO** \n&gt; * **$DOCU** \n&gt; * **$INO** \n&gt; * **$CLDR** \n&gt; * **$INSG** \n&gt; * **$SOHU** \n&gt; * **$BTAI** \n&gt; * **$ORCL** \n&gt; * **$HEAR** \n&gt; * **$NVAX** \n&gt; * **$ADDYY** \n&gt; * **$GPS** \n&gt; * **$AKBA** \n&gt; * **$PDD** \n&gt; * **$CYOU** \n&gt; * **$FNV** \n&gt; * **$MTNB** \n&gt; * **$NERV** \n&gt; * **$MTN** \n&gt; * **$BEST** \n&gt; * **$PRTY** \n&gt; * **$NINE** \n&gt; * **$AZUL** \n&gt; * **$UNFI** \n&gt; * **$PRPL** \n&gt; * **$VSLR** \n&gt; * **$KLZE** \n&gt; * **$ZUO** \n&gt; * **$DVAX** \n&gt; * **$EXPR** \n&gt; * **$VRA** \n&gt; * **$AXSM** \n&gt; * **$CDMO** \n&gt; * **$CASY**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/4OOLYTY.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/MY5URDI.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 3.9.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Fq1ixYG.png))\n\n\n&gt; # ***Monday 3.9.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/3QxCDMd.png))\n\n\n*****\n\n&gt; # ***Tuesday 3.10.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/kG5Cja7.png))\n\n&gt; # ***Tuesday 3.10.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/SWb2ADY.png))\n\n*****\n\n&gt; # ***Wednesday 3.11.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/SH8bsTn.png))\n\n&gt; # ***Wednesday 3.11.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/PH2Inly.png))\n\n*****\n\n&gt; # ***Thursday 3.12.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/RToRF8p.png))\n\n&gt; # ***Thursday 3.12.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/HECD2g3.png))\n\n*****\n\n&gt; # ***Friday 3.13.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/BvEJ9Vw.png))\n\n*****\n\n&gt; # ***Friday 3.13.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# Adobe Inc. $336.77\n&gt; **Adobe Inc. (ADBE)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, March 12, 2020. The consensus earnings estimate is $2.23 per share on revenue of $3.04 billion and the Earnings Whisper ® number is $2.29 per share. Investor sentiment going into the company's earnings release has 81% expecting an earnings beat The company's guidance was for earnings of approximately $2.23 per share. Consensus estimates are for year-over-year earnings growth of 29.65% with revenue increasing by 16.88%. Short interest has decreased by 38.4% since the company's last earnings release while the stock has drifted higher by 7.2% from its open following the earnings release to be 10.9% above its 200 day moving average of $303.70. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, February 24, 2020 there was some notable buying of 1,109 contracts of the $400.00 call expiring on Friday, March 20, 2020. Option traders are pricing in a 9.3% move on earnings and the stock has averaged a 4.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ADBE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DICK'S Sporting Goods, Inc. $34.98\n&gt; **DICK'S Sporting Goods, Inc. (DKS)** is confirmed to report earnings at approximately 7:30 AM ET on Tuesday, March 10, 2020. The consensus earnings estimate is $1.23 per share on revenue of $2.56 billion and the Earnings Whisper ® number is $1.28 per share. Investor sentiment going into the company's earnings release has 57% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 14.95% with revenue increasing by 2.73%. Short interest has decreased by 29.1% since the company's last earnings release while the stock has drifted lower by 20.3% from its open following the earnings release to be 12.0% below its 200 day moving average of $39.75. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, February 26, 2020 there was some notable buying of 848 contracts of the $39.00 put expiring on Friday, March 20, 2020. Option traders are pricing in a 14.4% move on earnings and the stock has averaged a 7.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DKS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Broadcom Limited $269.45\n&gt; **Broadcom Limited (AVGO)** is confirmed to report earnings at approximately 4:15 PM ET on Thursday, March 12, 2020. The consensus earnings estimate is $5.34 per share on revenue of $5.93 billion and the Earnings Whisper ® number is $5.45 per share. Investor sentiment going into the company's earnings release has 83% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 5.65% with revenue increasing by 2.44%. Short interest has decreased by 15.6% since the company's last earnings release while the stock has drifted lower by 15.3% from its open following the earnings release to be 7.7% below its 200 day moving average of $291.95. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, February 25, 2020 there was some notable buying of 1,197 contracts of the $260.00 put expiring on Friday, April 17, 2020. Option traders are pricing in a 11.1% move on earnings and the stock has averaged a 4.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AVGO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Thor Industries, Inc. $70.04\n&gt; **Thor Industries, Inc. (THO)** is confirmed to report earnings at approximately 6:45 AM ET on Monday, March 9, 2020. The consensus earnings estimate is $0.76 per share on revenue of $1.79 billion and the Earnings Whisper ® number is $0.84 per share. Investor sentiment going into the company's earnings release has 62% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 16.92% with revenue increasing by 38.70%. Short interest has decreased by 12.9% since the company's last earnings release while the stock has drifted higher by 5.4% from its open following the earnings release to be 12.0% above its 200 day moving average of $62.53. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 6.3% move on earnings and the stock has averaged a 8.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=THO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# ULTA Beauty $256.58\n&gt; **ULTA Beauty (ULTA)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, March 12, 2020. The consensus earnings estimate is $3.71 per share on revenue of $2.29 billion and the Earnings Whisper ® number is $3.75 per share. Investor sentiment going into the company's earnings release has 73% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 2.77% with revenue increasing by 7.78%. Short interest has increased by 8.7% since the company's last earnings release while the stock has drifted lower by 0.1% from its open following the earnings release to be 9.5% below its 200 day moving average of $283.43. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 15.3% move on earnings and the stock has averaged a 11.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ULTA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Slack Technologies, Inc. $26.42\n&gt; **Slack Technologies, Inc. (WORK)** is confirmed to report earnings at approximately 4:15 PM ET on Thursday, March 12, 2020. The consensus estimate is for a loss of $0.06 per share on revenue of $173.06 million and the Earnings Whisper ® number is ($0.04) per share. Investor sentiment going into the company's earnings release has 67% expecting an earnings beat The company's guidance was for a loss of $0.07 to $0.06 per share on revenue of $172.00 million to $174.00 million. Short interest has increased by 1.2% since the company's last earnings release while the stock has drifted higher by 19.0% from its open following the earnings release. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 4.3% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=WORK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Dollar General Corporation $158.38\n&gt; **Dollar General Corporation (DG)** is confirmed to report earnings at approximately 6:55 AM ET on Thursday, March 12, 2020. The consensus earnings estimate is $2.02 per share on revenue of $7.15 billion and the Earnings Whisper ® number is $2.05 per share. Investor sentiment going into the company's earnings release has 76% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 9.78% with revenue increasing by 7.52%. Short interest has increased by 16.2% since the company's last earnings release while the stock has drifted higher by 1.8% from its open following the earnings release to be 5.7% above its 200 day moving average of $149.88. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, February 28, 2020 there was some notable buying of 1,013 contracts of the $182.50 call expiring on Friday, March 20, 2020. Option traders are pricing in a 9.2% move on earnings and the stock has averaged a 5.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Stitch Fix, Inc. $22.78\n&gt; **Stitch Fix, Inc. (SFIX)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, March 9, 2020. The consensus earnings estimate is $0.06 per share on revenue of $452.96 million and the Earnings Whisper ® number is $0.09 per share. Investor sentiment going into the company's earnings release has 83% expecting an earnings beat The company's guidance was for revenue of $447.00 million to $455.00 million. Consensus estimates are for earnings to decline year-over-year by 50.00% with revenue increasing by 22.33%. Short interest has decreased by 4.6% since the company's last earnings release while the stock has drifted lower by 16.1% from its open following the earnings release to be 5.1% below its 200 day moving average of $24.01. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, February 19, 2020 there was some notable buying of 4,026 contracts of the $35.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 28.0% move on earnings and the stock has averaged a 15.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SFIX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Sogou Inc. $3.85\n&gt; **Sogou Inc. (SOGO)** is confirmed to report earnings at approximately 4:00 AM ET on Monday, March 9, 2020. The consensus earnings estimate is $0.09 per share on revenue of $303.08 million and the Earnings Whisper ® number is $0.10 per share. Investor sentiment going into the company's earnings release has 58% expecting an earnings beat The company's guidance was for revenue of $290.00 million to $310.00 million. Consensus estimates are for year-over-year earnings growth of 28.57% with revenue increasing by 1.78%. Short interest has increased by 6.6% since the company's last earnings release while the stock has drifted lower by 27.8% from its open following the earnings release to be 15.7% below its 200 day moving average of $4.57. Overall earnings estimates have been revised lower since the company's last earnings release. The stock has averaged a 3.8% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SOGO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DocuSign $84.02\n&gt; **DocuSign (DOCU)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, March 12, 2020. The consensus earnings estimate is $0.05 per share on revenue of $267.44 million and the Earnings Whisper ® number is $0.08 per share. Investor sentiment going into the company's earnings release has 81% expecting an earnings beat The company's guidance was for revenue of $263.00 million to $267.00 million. Consensus estimates are for year-over-year earnings growth of 600.00% with revenue increasing by 33.90%. Short interest has decreased by 37.7% since the company's last earnings release while the stock has drifted higher by 12.1% from its open following the earnings release to be 31.9% above its 200 day moving average of $63.71. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, March 4, 2020 there was some notable buying of 1,698 contracts of the $87.50 call expiring on Friday, March 20, 2020. Option traders are pricing in a 8.5% move on earnings and the stock has averaged a 10.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DOCU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/StockMarket.",
        "subreddit": "StockMarket",
        "title": "Wall Street Week Ahead for the trading week beginning March 9th, 2020",
        "url": "https://www.reddit.com/r/StockMarket/comments/fev9sm/wall_street_week_ahead_for_the_trading_week/",
        "created": 1583617342.0
    },
    {
        "author": "Trident1000",
        "created_utc": 1583351867,
        "id": "fdip1v",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Option Strategy: Long Dated Calls on Broadcom, Short Dated Puts on SPY",
        "url": "https://i.redd.it/j9ss17o9mpk41.png",
        "created": 1583380667.0
    },
    {
        "author": "sultanmirza007",
        "created_utc": 1583383009,
        "id": "fdpy17",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Puts on Broadcom? Is it getting worse?\n\nSource : https://www.reddit.com/r/Coronavirus/comments/fdphkm/broadcom_hq_office_in_the_bay_area_closed_for/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf",
        "subreddit": "wallstreetbets",
        "title": "Broadcom HQ shutdown for 2 weeks in Bay Area",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fdpy17/broadcom_hq_shutdown_for_2_weeks_in_bay_area/",
        "created": 1583411809.0
    },
    {
        "author": "TriforceCaliban",
        "created_utc": 1583674481,
        "id": "ffclsf",
        "num_comments": 131,
        "num_crossposts": 0,
        "selftext": "\tAAPL\n\tACB\n\tADBE\n\tALLY\n\tAMD\n\tAMZN\n\tATVI\n\tBABA\n\tBABA\n\tMMM\n\tBAC\n\tBYND\n\tCCL\n\tCGC\n\tCMG\n\tCOST\n\tCRM\n\tCRON\n\tCZR\n\tDIS\n\tEA\n\tEBAY\n\tETSY\n\tFB\n\tGLD\n\tGOOGL\n\tGOOS\n\tHD\n\tINO\n\tINTC\n\tIQ\n\tJNJ\n\tJPM\n\tLULU\n\tLUV\n\tLVS\n\tM\n\tMCD\n\tMSFT\n\tMU\n\tNFLX\n\tNKE\n\tNVDA\n\tOPK\n\tPENN\n\tPINS\n\tPTON\n\tPYPL\n\tRCL\n\tROKU\n\tSBUX\n\tSHOP\n\tSNAP\n\tSPCE\n\tSQ\n\tSTMP\n\tTGT\n\tTLRY\n\tTLT\n\tTSLA\n\tTTD\n\tTWTR\n\tUBER\n\tULTA\n\tV\n\tWMT\n\tWYNN\n\nAny more to add?",
        "subreddit": "wallstreetbets",
        "title": "Current WSB Meme Stock List",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ffclsf/current_wsb_meme_stock_list/",
        "created": 1583703281.0
    },
    {
        "author": "SeriousPuppet",
        "created_utc": 1583555222,
        "id": "feq2j6",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "I have some long term holdings. I've trimmed down a little and have some cash. But I'm wondering if, instead of selling more of my AMZN, AAPL, etc... if I short sold say a few tech stocks like ADBE, CRM, CRUS,  etc... if that would essentially act as a hedge for my longs with the reasoning that if my tech longs go down then most likely other tech stocks will as well and I'd make money by shorting them as I'm losing money on the longs. \n\n(I realize that I could buy puts as well, but I have never done that yet and am not familiar with that even though I did just get an options account. But I'm wondering if shorting can essentially accomplish a similar task as I don't know if I have the time to learn options.)",
        "subreddit": "stocks",
        "title": "Is shorting stocks a good way to hedge in this environment?",
        "url": "https://www.reddit.com/r/stocks/comments/feq2j6/is_shorting_stocks_a_good_way_to_hedge_in_this/",
        "created": 1583584022.0
    }
]