[
    {
        "author": "Mikeinthemornin",
        "created_utc": 1581007075,
        "id": "ezuw91",
        "num_comments": 126,
        "num_crossposts": 0,
        "selftext": "Worth the lotto ticket play for tomorrow as ex date is 2/7 so could go up and its only .09. I piss 9$. Also trump pump @ 12. Dow to rocket. Thank me later or hate me later!",
        "subreddit": "wallstreetbets",
        "title": "IBM 2/7 160$ calls",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ezuw91/ibm_27_160_calls/",
        "created": 1581035875.0
    },
    {
        "author": "TripleBrain",
        "created_utc": 1581975912,
        "id": "f5gb0m",
        "num_comments": 106,
        "num_crossposts": 0,
        "selftext": " \n\nSPCE had a failed mission 5 years ago and blamed the pilot for the crash. \n\nCEO has said for the last 5 years that their SS2 aircrafts were set to launch each year, and of course, they always blamed contractors for not reaching “milestones” to get it all going. \n\nHere’s a summary of why it won’t succeed and further analysis on the speculative market size that bulls argue:\n\nThey have 600 pre-orders. Why go for such a small number if they have the potential to capture a much large speculated market that the bulls are contending? If they are front runners in this race, they have early bird advantage to take in much more and backlog them if they need to. But why 600 with revenues of only 150M?\n\nMarket cap is currently 5B, which is 42x revenue. And what do the bulls say about this? “Stop looking at current revenue, they have a much larger market”. Of who? Multi millionaires and billionaires? “Then they have hypersonic travel for 2 hour travel to London.” Who actually needs to get to London or any other country in 2 hours just to pay a gigantic premium when they can get a private jet and have a personalized/comfortable ride. Last I check, most execs, consultants, etc get to their destination days in advanced anyway.\n\nThen it comes to market cap. I can’t tell if this is a joke, but I hear bull gang compare SPCE market size to Tesla, Spotify, IBM, Microsoft, Uber, Lyft, etc. I’m not going to even have to explain this. The statement in itself has a high enough autistic frequency for even the lowest spectrum of autism to understand how retarded it is. Yes, buying an electric vehicle that will last for years, purchasing a music subscription, buying laptops and software, and getting a daily ride to work is equivalent to going to space for 250k.\n\nNow, when I say 250k, bulls says \"but they will reduce cost when they increase efficiency and have a fleet of 500 planes flying daily.” Firstly, if they reduce cost, it won’t be by significant margins. Why? Because space travel will not be cheap no matter how you put it. Cost of production won’t change unless they can do it with cheap labor in China. Efficiency will be the same unless they hire a herd of engineers working 24/7. R&amp;D will continue to cost more as they try to scale this with large carriers. Ffs, they took years just to get 2 damn planes right. You guys are out here talking about 500 planes. As for scalability. By the time they scale, if they even can, BlueOrigins and SpaceX would have listed and would be flying herds of middle class enthusiasts to space.\n\nNow on to the preorders and future orders. 600 pre-orders are not going to fly this year. They will be backlogged. Why? Because they don’t own airspace. They can barely get their contractors in line with the schedule and you’re expecting them to make 100 flights to the edge of space all in half a year? They expect Branson to be their first passenger on his birthday in July. Do the math. That would be nearly flying every two days from August-December. They have 2 aircrafts right now. Do you really think they are going to expose those two newly made (and still technically under progress) aircrafts under that much fly time? And do you have any idea how risky something like this would be? They aren’t flying planes. Planes can fly all day every day with turbine engines and at low altitudes. We are talking about rocket fuel to the edge of space. And who's the grantee that none of these 100 flights will end in disaster. They blamed the one test flights on pilot error - what makes you think swarms of people would be confident with a company that blamed the crash on the pilot and not a lack of security protocols? Stop with this talk about how they are going to get all these pre-orders done and then add a huge list to the log. My guess, they might fulfill those 600 clients in the next two years. And have a backlog of irked clients that paid such a large deposit to sit around and wait like a saving account that returns -2% per year.\n\nAnd then the talk about hypersonic travel. You guys are talking about it like they have done it. That’s a vision, not a reality. They can’t even commercialize sub-hypersonic travel and they are talking about hypersonic travel at the forefront of this project as if it’s reality. You’re hearing an upbeat CEO trying to raise more capital. The reality is that they haven’t even flown a crew to space yet. They haven't even had a full 6 passengers fly yet.\n\nAs for the newly released sec filing for the warrants. 31M shares. Bull gang is thinking, ah this is regulatory stuff, it won’t get exercised. Literally two funds just filed for 11M on the same day. This is not a coincidence? They are listed for $11.50 per share. Institutions aren’t going to be buying in at market price at this time. Those funds are buying at the warrant price and that’s probably why it happened on the same day. It the share price holds above $18 for 7 more days, these warrants can be exercised. Dilution will almost certainly lead to a dump in this pumped stock. CEO needs money and it's pretty clear at this point why they proposed these 31M shares. It's a 15% dilution!",
        "subreddit": "stocks",
        "title": "SPCE - A Thorough Bearish Analysis",
        "url": "https://www.reddit.com/r/stocks/comments/f5gb0m/spce_a_thorough_bearish_analysis/",
        "created": 1582004712.0
    },
    {
        "author": "splityoassintwo",
        "created_utc": 1582157515,
        "id": "f6k556",
        "num_comments": 101,
        "num_crossposts": 0,
        "selftext": "Alright fellow autismos listen up. If the beer virus doesn't tank the market this is freest money you will ever see. Semiconductor stocks are way up, AMD and NVDA are printing like crazy. AAPL is still putting up impressive numbers in spite of the guidance adjustment they just gave. As some of you may know most of the big semiconductors are reliant on two companies. Here's a chart to show where the money goes:\n\nhttps://preview.redd.it/v0obj5ffxyh41.png?width=2338&amp;format=png&amp;auto=webp&amp;s=efb986fbced13dc0118b0af6ae24c209004810c6\n\nGlobal Foundries is a private fabricator (sorry no tendies on these guys), they focus on the older 14nm process (they tried 7nm and gave up because they found it was unaffordable to outfit a plant to fab the chips. Because of this IBM switched to Samsung for it's next-gen chips). Intel is also famously struggling to get 7nm up and running. Only two companies really have play in the 7nm space, Samsung and TSMC (traded as TSM) Taiwan Semiconductor Manufacturing Company. TSMC is largest dedicated semiconductor foundry in the world. Qualcomm, Nvidia, AMD, and Apple all buy chips from TSMC. The more each of these companies is in demand, the more money TSMC makes. Their competition is weak right now, Samsung Semiconductor is huge, but you can't invest in them, and they only really make chips for their phones sold outside the US and for IBM (and those chips are for supercomputers, servers, and mainframes not for consumers). They mostly focus on DRAM and SSDs. TSMC is a position right now where it is indispensable to a lot of the worlds largest corporations (Alphabet, Microsoft, Apple, and Amazon all use TSMC products). Right now all these companies are on an absolute tear. TSMC announces earning on April 16th and option prices are ripe. Go get them tendies boiz.",
        "subreddit": "wallstreetbets",
        "title": "Semiconductors for Dummies (TL;DR buy TSM $65C 4/17)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f6k556/semiconductors_for_dummies_tldr_buy_tsm_65c_417/",
        "created": 1582186315.0
    },
    {
        "author": "SuXs",
        "created_utc": 1581004294,
        "id": "ezu7ym",
        "num_comments": 54,
        "num_crossposts": 0,
        "selftext": "So, for those not aware, the day before yesterday, I did a little bit of artistical shitposting for the sole purpose of entertainment. In these artistic work of fictions, I pretended that my goal was to see if it is possible for a collective of autists such as r/WSB to use the integrated leverage of:\n\n- Call contracts 100:1 ratios\n- Institutions algorithms risk hedging strategies.\n- Social Media\n- W E A P O N I S E D.  A U T I S M.\n\nAnd combine it into a Low Orbit Ion Cannon (LOIC) conflagration with enough power to actually inflate a $1.5Trillion Market Cap stock ($MSFT), at open, on 05.02.2020. \n\n*Only a fool would believe that such things are possible.*\n\nFor those of you who missed my artistic work of autistic fiction: \nhttps://old.reddit.com/r/wallstreetbets/comments/eyvcqy/lol_bloomberg_admitting_that_as_long_as_we_buy/\nhttps://old.reddit.com/r/wallstreetbets/comments/eyztcx/bloomberg_confirmed_how_to_rig_market_buy_msft/\nhttps://old.reddit.com/r/wallstreetbets/comments/ez7a6k/here_we_go_were_memeing_msft_into_orbit_ladies/\n\n**RESULTS**\n\n**Anyway, long story short, [this is what happened yesterday to $MSFT at Open.](https://imgur.com/HbCL15y) with NASDAQ publishing a featured article about how \"[Microsoft Corporation (Symbol: MSFT) saw options trading volume of 490,594 contracts, representing approximately 49.1 million underlying shares or approximately 175.1% of MSFT's average daily trading volume over the past month](https://www.nasdaq.com/articles/notable-wednesday-option-activity%3A-ibm-msft-gild-2020-02-05)\"** \n\n**CONCLUSION**\n\nMake your own conclusions.\n\n*Mendatory Disclaimer for SEC : The stories and information posted here are artistic works of fiction and falsehood. Only a fool would take anything posted here as fact. This post is an obvious work of satire for the purpose of entertainment*\n\n*Please be aware that I did not, do not, and will never condone such illegal behavour from all of you autists, nor did I personally partake/plan to/made any profit from it.*  [ALSO](http://i.imgur.com/5Qz9A.gif).",
        "subreddit": "wallstreetbets",
        "title": "[UPDATE] Pumping $MSFT to the moon with LOIC, and how to profit from it (Satire) (Fiction)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ezu7ym/update_pumping_msft_to_the_moon_with_loic_and_how/",
        "created": 1581033094.0
    },
    {
        "author": "ElectricOne55",
        "created_utc": 1580778433,
        "id": "eyhn25",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "If you could pick the top 2-3 cloud companies to invest in long term, which ones would you pick and why? Also, do you think these companies will be around in the future or will they fade away like nokia, ibm, blackberry, etc?",
        "subreddit": "investing",
        "title": "Best cloud companies to invest in long term?",
        "url": "https://www.reddit.com/r/investing/comments/eyhn25/best_cloud_companies_to_invest_in_long_term/",
        "created": 1580807233.0
    },
    {
        "author": "doublemctwist1260",
        "created_utc": 1581882996,
        "id": "f4w4pc",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "Surprised nobody on here has talked about the run up in slack over the last couple weeks even after the weird shit with IBM, it’s had a great year and just passed through some basic technical levels on momentum, the platform is better than msft teams but macrohard has the advantage of easy integration, I don’t think this will be a major issue because there is a huge market for this kind of software, they were definitely beaten up more than they should have been since they went public when wework was imploding and uber/lyft were getting railed, feeling myself, feeling my balls, getting ready for liftoff with my April 28 calls, someone tell me why they suck",
        "subreddit": "wallstreetbets",
        "title": "Slack is on the road to recovery",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f4w4pc/slack_is_on_the_road_to_recovery/",
        "created": 1581911796.0
    },
    {
        "author": "TheRollingOcean",
        "created_utc": 1582028405,
        "id": "f5qyao",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "Listen up... bag holding SPCE and MSFT calls got you down?? Looking for some air fried, delicious tendies?? Well guess what, it's time to get off your collectives, and divert your 401Ks and FAFSA student loans into $WORK. Make $WORK, $WORK for you. It's a sure thing. Here's why: \n\nWhy $WORK? Because $WORK is Slack. Slack is messenger poised to take over communication as we know it. No longer will organizations rely on emails as the chosen method of communication, Slack is an organizational messaging and knowledge base tool which today, has been adopted as the communications model of choice for several fortune 500 companies. Including IBM. And the list is grooooowwwwing. \n\nSo today, before the market opens know that the opportunity exists to be part of the inception of how we communicate personally, and in our corporate lives, and either hold the stock or be a part of elevating $WORK to the MOON. \n\nYou want those sweet sweet honey mustard covered tendies? You got to put in your $WORK. Looking for a sure fire return? Long $WORK calls. Need to recover from SPCE and MSFT? $WORK\n\nI'm telling you autists, you're going to regret it when you're salty, crying over your burnt tendies when all you had to do was put in (call) a little $WORK. \n\nThat is all.",
        "subreddit": "wallstreetbets",
        "title": "Make $WORK work for you!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f5qyao/make_work_work_for_you/",
        "created": 1582057205.0
    },
    {
        "author": "Jayballer99",
        "created_utc": 1581031492,
        "id": "f017rt",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "So basically me, an autist, listened to another autist that said IBM Call options expiring 02/07 for $160  is the way to go, so that’s exactly what I did at around noon today. My question is do I have until tomorrow closing or only until noon?",
        "subreddit": "wallstreetbets",
        "title": "When do my options expire",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f017rt/when_do_my_options_expire/",
        "created": 1581060292.0
    },
    {
        "author": "Somadis",
        "created_utc": 1582954808,
        "id": "fb83bg",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "January 2020 set a record for the most CEO departures in the US in one month — 219 departures. Below are some of the most notable. Now is not a good time to find that dip.\n\n-DISNEY\n\n-MASTERCARD\n\n-LBRANDS\n\n-UBER EATS\n\n-HULU\n\n-MGM\n\n-IBM\n\n-LINKEDIN\n\n-LIQUIDNET\n\n-L BRANDS\n\n-Co-CEO of SALESFORCE\n\n-MADMEN\n\n-AURORA CANNABIS\n\n-CREDIT SUISSE\n\n-FASLY\n\n-TMOBILE\n\n-NESTLE\n\n-Mandy Ginsberg, the CEO of the company that oversees Tinder, Hinge, OKCupid, and Match, announced on January 28 that she's stepping down after 14 years, citing personal reasons.\n\n-Morgan Stanley's Deputy Chief Financial Officer Paul Wirth will retire after 15 years with the bank, according to a memo sent to employees seen by Reuters on Wednesday.\n\n-Barbara Novick, co-founder of investment giant BLACKROCK stepped down.",
        "subreddit": "wallstreetbets",
        "title": "January 2020 set a record for the most CEO departures in the US in one month",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fb83bg/january_2020_set_a_record_for_the_most_ceo/",
        "created": 1582983608.0
    },
    {
        "author": "wincysss1",
        "created_utc": 1581358019,
        "id": "f1u64k",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "Slack just signed a new contract with IBM to service it's 350,000 employees. Thoughts on buying some of this?",
        "subreddit": "stocks",
        "title": "Thoughts on slack?",
        "url": "https://www.reddit.com/r/stocks/comments/f1u64k/thoughts_on_slack/",
        "created": 1581386819.0
    },
    {
        "author": "-_somebody_-",
        "created_utc": 1581015795,
        "id": "ezx3ja",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "I just bought 70 contracts of IBM 160 calls, 2/7..  at .07, and I’m up 140% from like no movement.  But I’m PDT restricted and can’t sell this till tomorrow, after just realizing the issue..\n\nWhat’s gonna happen with the ex dividend tomorrow to these calls?  I put half my portfolio into this dumb play and don’t know the ramifications of this play.",
        "subreddit": "options",
        "title": "IBM Ex dividends and Call option help",
        "url": "https://www.reddit.com/r/options/comments/ezx3ja/ibm_ex_dividends_and_call_option_help/",
        "created": 1581044595.0
    },
    {
        "author": "i_have_a_nose",
        "created_utc": 1582928967,
        "id": "fb2tlr",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "https://www.reuters.com/article/us-vatican-artificial-intelligence/pope-to-endorse-principles-on-ai-ethics-with-microsoft-ibm-idUSKCN20M0Z1?feedType=RSS&amp;feedName=technologyNews&amp;utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+reuters%2FtechnologyNews+%28Reuters+Technology+News%29",
        "subreddit": "wallstreetbets",
        "title": "Pope helping Mr. Nutella and 3/20 200c gang!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fb2tlr/pope_helping_mr_nutella_and_320_200c_gang/",
        "created": 1582957767.0
    },
    {
        "author": "RayPowers",
        "created_utc": 1582409170,
        "id": "f7zp2d",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\n \n\n. Tier 2 options account at TDA, no short (naked) call positions &amp;  only short CSP's.\n\nI buy calls on stocks I don't own and leg into debit spreads. I can build spreads simultaneously inside TOS, but timing and legging in correctly yields lower debit cost. Also, just buy calls and try to sell for 25-50% profit. \n\nIf I create a debit call spread on stocks I own, exiting I  can first sell the long position in the spread as the stock covers the short position. Otherwise need to close both positions simultaneously, or short call first, which is why I don't trade wing spreads.\n\nDoes anyone build debit call spreads as the stock price drops, looking for a rebound up?  \n\nAre credit put spreads created simultaneously, better than bullish debit call spreads ?\n\n(own 300 MA, 400 NVDA, IBM, ABBV,  JNJ,  PFE,  no AMD presently but have call options in  the APR 17 monthly's.)",
        "subreddit": "options",
        "title": "Legging into call debit spreads &amp; short term gain strategies, no YOLO",
        "url": "https://www.reddit.com/r/options/comments/f7zp2d/legging_into_call_debit_spreads_short_term_gain/",
        "created": 1582437970.0
    },
    {
        "author": "zmuzum",
        "created_utc": 1581480561,
        "id": "f2l9ce",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "I’ve been hearing some bizarre stuff repeated about SPCE and IBM wanting in. No idea if there’s any truth to it, could be more autism. If anyone knows anything please share.",
        "subreddit": "wallstreetbets",
        "title": "SPCE and IBM rumors?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f2l9ce/spce_and_ibm_rumors/",
        "created": 1581509361.0
    },
    {
        "author": "BlackGhostTV1",
        "created_utc": 1582257535,
        "id": "f75gv1",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Hey, I’m 18 y/o and just started investing about 1 1/2 months ago. Slowly building my portfolio. I make about $900 a month as a line cook. I’m wanting to beef up a dividend portfolio and I did my research and $IBM has some amazing dividends. Should I put most of my money into $IBM as my main source of dividends, or should I put half into $IBM and the other half into another company EX: $MMM",
        "subreddit": "investing",
        "title": "$IBM dividend portfolio",
        "url": "https://www.reddit.com/r/investing/comments/f75gv1/ibm_dividend_portfolio/",
        "created": 1582286335.0
    },
    {
        "author": "caime9",
        "created_utc": 1582440463,
        "id": "f85zda",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Now that the CEO has changed, how are y'all feeling about IBM?",
        "subreddit": "stocks",
        "title": "How we feeling about IBM?",
        "url": "https://www.reddit.com/r/stocks/comments/f85zda/how_we_feeling_about_ibm/",
        "created": 1582469263.0
    },
    {
        "author": "Bull_Market_Bully",
        "created_utc": 1582736569,
        "id": "f9wc9t",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "This company is basically the next NOW, TWLO, WDAY, FIVN, CRM.\n\nIt shares the same space and is growing rapidly with no end in sight.  Take look at a chart of any of the above.  WORK is in the same position those were when they too were $30 a share.  Its got numerous  large clients like:\n\n* Airbnb.\n* Dropbox.\n* Pinterest.\n* medium.com.\n* Slack.\n* Shopify.\n* Lyft.\n* IBM\n\n&amp;#x200B;\n\nReally dont feel like spending more time explain the obvious but if your not sold yet, this should do it;  If you google \"work\" the top result is Rihanna's hit song which basically is 7 minutes and 34 seconds of her telling you to buy this stock.",
        "subreddit": "wallstreetbets",
        "title": "Cut yourself some slack with WORK",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f9wc9t/cut_yourself_some_slack_with_work/",
        "created": 1582765369.0
    },
    {
        "author": "satowj",
        "created_utc": 1580832873,
        "id": "eysd5v",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "smallstreetbets",
        "title": "*NOT TESLA* but $100 to $1k in a few weeks with TWO plays and patience. TLT and IBM calls",
        "url": "https://i.redd.it/zsk71mp8mxe41.jpg",
        "created": 1580861673.0
    },
    {
        "author": "Octagon_Time_Machine",
        "created_utc": 1582256185,
        "id": "f756ra",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "https://quant.stackexchange.com/a/43343\n\n&gt;Can someone please explain to me how stock prices go up and down? What are the underlying physical and information technology phenomena and algorithms that drive a stock up or down?\n\nThis question may be better on the personal finance or the economics site, but I will answer it here. The question is very difficult because no one thing causes it. There is also a very different solution to the question if you are asking about the immediate future versus a long period of time as the factors are different.\n\nIn the short-run, if you look at the mechanics of a trade, there are two main broad categories of orders and in the United States, two types of markets. The two order types are market orders and limit orders. The two market types are auction markets and dealer markets. Both of these sentences are overgeneralizations. The NYSE does not work the way the now defunct Arizona exchange worked. Fill-or-kill orders do not work the way a market order for a single round lot works.\n\nThe key element of equity market orders is that until an offer is made, the short-run supply curve and the demand curve do not intersect. The existence of a bid-ask spread implies the curves are non-intersecting in the immediate period. For an order to be filled, the immediate curve has to be shifted. Of course, the true short-run curves includes as yet unseen supply and demand. I may be willing to pay $50 per share for IBM but may not have placed my order yet. I might be eating lunch. The immediate demand curve cannot include my order, but the short-run curve, at least in theory, does.\n\nMarket makers and specialists keep a supply of cash and shares on hand to cover market orders in the event no other party has an outstanding market order that would cover the transaction. The bid-ask spread is their compensation for carrying the inventory risk. As an example, imagine a bid price of 49.50 and an ask of 49.75. You buy shares at market for 49.75. The bid and ask change to 49.600 and 50.00. Someone else wants to sell, so they ask 49.60 for the shares. The market maker pays 49.60 and recovers their inventory that they had sold to you, pocketing the fifteen cents.\n\nWhen someone places a market order, it drains the liquidity of the market maker or specialist by taking away their inventory of cash or shares. A market order allows a filling of shares, pretty much on demand, but the price is set by the dealer if there is no outstanding limit order to cover it. For larger orders, a market order is an order to continue bidding any amount of money to guarantee you are the high bidder as a buyer or the low bidder as a seller in order to be certain that your order will be filled, no matter what.\n\nLimit orders state the prices that can be paid by a broker in order for you to buy or sell shares. If I am willing to sell at $50, then I cannot receive less than $50 (gross of commissions). I can receive more. If I am willing to pay $12.50 per share, then I will not have to pay more than $12.50 per share before commissions. If there is no offer inside my limits, then my order will never be filled.\n\nFor market orders, the price is driven by the bidding process. Market orders will keep bidding higher and higher or lower and lower until the order is filled. For limit orders, which provide liquidity to the market makers, those limits set the pricing for the market makers as they can use those orders to fill their obligations. People who state the prices publicly are the ones who decide what the price will be. In exchange for setting a limit order, the brokers are obligated to get the best price available for the maker of those limit orders. So if I say I will pay $12.50, but a broker can get it for me at $11.40, then I will get it at $11.40.\n\nNow there is one more wrinkle in the short-run. When you look at a chart or trades on a ticker, that is not the actual order in which they happened. That is the order in which they were reported. Large orders would disrupt the market, so they are only reported as a weighted average of the trade prices and only after that order would no longer have a disruptive effect on the price. So if there is an order to buy 10,000 shares and everyone knew that people might make really high limit orders to make it hard to fill the big order and others might glom on to buy knowing the price will be driven up by the large order. So if you see a price change, it might not reflect the true current price structure. The bid-ask spread does, but the immediate spread does not appear on the charts and isn't recorded for most of US history.\n\nIn the long run, prices are driven by large macroeconomic forces. If you have a choice of eating or buying shares, you will choose to eat. This means that stock market money is always leftover money. It is money above your consumption needs. In addition, other assets compete for your money, such as bonds and bank accounts. As such, if someone will pay enough to borrow money, stocks cannot give a lower return as they make no promises about future cash flows.\n\nFurthermore, stocks are countercyclical. There is more free money during an economic expansion than a recession. So stock prices are the worst when people need money the most, and the best when they least need it. Bonds are procyclical. When the economy is doing poorly, people seek the safety of bonds. Also, of importance, inflation falls as there is no demand for money, comparatively and so bonds become of greater value. Likewise, to stimulate the economy interest rates fall, so the present value of bonds rises.\n\nIn the very long term, dividends follow inflation on a lagged basis, and prices move with corporate productivity. Improvements in productivity that persist have a long impact on prices. In the very long term, inflation and persisting interest rates impact prices. In the very long term, demographic factors matter. In the US, baby boomers are retiring and selling their shares to live off the money. There are fewer young people, fewer even now that immigrants are being deported. If foreigners are willing to pick up the slack, the price will rise. If native borns need even more shares to be sold, then prices will fall. Finally, taxes have a complicated relationship with stocks. Low tax levels are bad in the long run. High tax levels are bad in the long run. That is because levels of taxation reflect the public expenditure on infrastructures like roads or law enforcement. The disaster that was Kansas' tax structure is a great example. Kansas destroyed its economy with tax rates that were unsustainably low. So did Greece. On the other hand, during the Cold War tax rates were very high, at the margin, but didn't always buy useful public goods.\n\nThere is also a difference between auction markets and dealer markets. In auction markets, buyers bid against other buyers for the right to buy while sellers bid against other sellers for the right to sell. These are high volume markets and so price swings tend to be smaller because there is a greater level of competition and more observable orders that permits easier price discovery. Dealer markets are more like retail stores. All trades are with dealers and no trades are with other individuals. Dealers set the prices, though competitively against other dealers.\n\nAs the dealers are covering the markets out of their own pockets, the liquidity costs are higher, so the spreads are wider. This makes markets look more volatile even when they are basically flat and moving sideways. In dealer markets, ever trade is wider.\n\nThere are tons of algorithms in place, but there isn't just one. If you would look at my trades as an \"algorithm\", it wouldn't look like another investor's algorithm. I use long run valuation rules. A day trader uses a minute-by-minute or second-by-second time horizon. We are not using the same thinking and we do not have the same goals. There are thousands of separate algorithms in place.",
        "subreddit": "stocks",
        "title": "Best summary of what actually sets and changes stock prices in the market",
        "url": "https://www.reddit.com/r/stocks/comments/f756ra/best_summary_of_what_actually_sets_and_changes/",
        "created": 1582284985.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1581427479,
        "id": "f289kq",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/StockMarket sub! Welcome to Tuesday. Here is your pre-market news this AM-\n\n*****\n\n#(**[CLICK HERE TO VIEW THE FULL SOURCE!](https://www.stockaholics.net/threads/todays-pre-market-news-tuesday-february-11th-2020.9458/)**)\n\n#[Today's Top Headlines for Tuesday, February 11th, 2020](https://www.cnbc.com/2020/02/11/dow-to-rise-powell-testifies-coronavirus-death-toll-passes-1000.html)\n\n* U.S. stock futures point to a higher open, following record closes for the S&amp;P 500 and Nasdaq on Monday, as investors are encouraged by a slowdown in the number of new coronavirus cases. The Dow, S&amp;P 500 and Nasdaq are higher in five of the past six sessions, and four S&amp;P sectors are at record highs: Consumer Discretionary, Consumer Staples, Tech and Real Estate. (CNBC)\n* Ray Dalio thinks the coronavirus’ hit to global markets is probably exaggerated (CNBC)\n* The director-general of the World Health Organization reportedly warned that while almost all of the confirmed coronavirus cases are in China, the outbreak constitutes a “very grave threat” for the rest of the world. China’s National Health Commission reported that a total of 42,638 cases had been confirmed in the country, with 1,016 deaths. (CNBC)\n* Nearly 200 evacuees to leave cornavirus quarantine in US (AP)\n* Fed Chairman Jerome Powell testifies today and tomorrow in the first of his twice-a-year economic updates to Congress, with investors listening for commentary on any coronavirus impact on the U.S. economy. On today’s economic calendar, the government is out with JOLTS, the Job Openings and Labor Turnover Survey, for December at 10 a.m. ET. (CNBC)\n* AutoNation (AN), Hasbro (HAS), Hilton Worldwide (HLT), Tegna (TGNA) and Under Armour (UAA) are out with quarterly earnings this morning, while Denny’s (DENN), Groupon (GRPN), Lyft (LYFT), and Western Union (WU) are among the companies issuing quarterly numbers after the bell.\n* A U.S. district judge is expected to rule in favor of allowing Sprint (S) and T-Mobile (TMUS) to merge over the objections of a group of state attorneys general, Reuters reported. It’s a decision that’s supposed to be made today. Shares of Sprint surged 69% in Monday’s after-hours trade and T-Mobile stock rose 8%. (CNBC)\n* The Democratic presidential race is deeply unsettled heading into today’s New Hampshire primary. It may be up to the state to put some structure around the chaotic contest, with Iowa being unable to declare a clear winner. New Hampshire’s secretary of state has predicted a healthy 292,000 Democratic voters, which would be about 40,000 more than voted in 2016. (AP)\n* Small New Hampshire town of Dixville Notch votes for Bloomberg in primary (USA Today)\n* Pete Buttigieg sees surge in support from business execs after his strong showing in Iowa (CNBC)\n* Bernie Sanders hopes New Hampshire primary will tighten his early grip on 2020 race (CNBC)\n* Mike Bloomberg could ‘handily beat’ Trump in 2020, says ex-Trump aide Anthony Scaramucci (CNBC)\n* Amazon (AMZN) is seeking to question President Donald Trump, Defense Secretary Mark Esper and former Defense Secretary James Mattis over a $10 billion Pentagon cloud contract awarded to Microsoft (MSFT). Amazon’s cloud computing arm said it’s looking to depose seven “individuals who were instrumental” in the JEDI source selection. (CNBC)\n* The Justice Department indicted four members of China’s military for the cyberattack against credit ratings agency Equifax in 2017. The incident led to the loss of personal information belonging to 145 million people, mostly in the U.S. but also in Canada and Europe. (CNBC)\n* The FAA is narrowing the issues needed before it can conduct a certification test flight on the grounded Boeing (BA) 737 Max, but will not commit to a timetable for lifting a flight ban. The certification flight to be carried out by FAA pilots “is not scheduled yet because we still have a few issues to resolve, but we continue to narrow the issues,” FAA Administrator Steve Dickson said. (Reuters)\n* DOT watchdog probes FAA’s pilot training after 2 deadly crashes of Boeing 737 Max (CNBC)\n* Google (GOOGL) human resources chief Eileen Naughton is stepping down from her role as tensions grown between employees and management. Naughton, who has held various roles at the company since 2006, has led the company’s human resources department as the vice president of people operations since 2016. (CNBC)\n* Shares of Slack (WORK) fell over 7% in the premarket after it filed an 8-K on Monday downplaying a news report that sent its stock surging more than 15%. The statement was issued in response to an earlier report that a new deal had been struck that made IBM Slack’s largest customer, which had sent the stock surging in the regular session Monday. (CNBC)\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](http://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://finviz.com/publish/021120/sec_all_075437166.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/wteeBZT.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/OeoDGfL.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/yKvMhID.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/SNqq5HC.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/8e4snrC.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/azlFbrt.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/YNP3Pq5.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/Vv5WIT7.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/vpdF9tz.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/SvyrDnj.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/CBl5AFZ.png)**)\n\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/G5AF0Cr.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #1!](https://i.imgur.com/22zaDPV.png)**)\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #2!](https://i.imgur.com/KMtzoBJ.png)**)\n\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS:\n\n* MYO\n* FB\n* UAA\n* UBS\n* MA\n* MSFT\n* NVDA\n* WORK\n* HAS\n* TMUS\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2020/02/11/stocks-making-the-biggest-moves-in-the-premarket-hasbro-under-armour-slack-sprint-more.html)**)\n\n*****\n\n&gt; **Under Armour (UAA)** – The athletic apparel maker reported an overall loss for the quarter, and warned of a negative sale impact from the coronavirus. The company also said it is assessing a possible 2020 restructuring.\n\n&gt; #**STOCK SYMBOL:** UAA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=UAA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/UAA)**)\n\n*****\n\n&gt; **AutoNation (AN)** – The nation’s largest car retailer beat estimates on both the top and bottom lines for the fourth quarter, with results boosted by higher demand for pre-owned vehicles.\n\n&gt; #**STOCK SYMBOL:** AN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AN)**)\n\n*****\n\n&gt; **Hasbro (HAS)** – The toymaker reported a quarterly profit of $1.24 per share, well above the consensus estimate of 91 cents a share. Sales fell short of Street forecasts, however, but Hasbro’s bottom line got a boost from toys related to Disney’s “Frozen 2” and “Star Wars” movies.\n\n&gt; #**STOCK SYMBOL:** HAS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=HAS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/HAS)**)\n\n*****\n\n&gt; **Hilton Worldwide (HLT)** – The hotel operator earned $1.00 per share for the fourth quarter, 4 cents a share above estimates. Revenue also beat forecasts. Hilton’s 2020 earnings outlook was below analysts’ forecasts, however, and the company said the outlook does not include possible coronavirus impact.\n\n&gt; #**STOCK SYMBOL:** HLT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=HLT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/HLT)**)\n\n*****\n\n&gt; **T-Mobile US (TMUS), Sprint (S)** – The mobile service providers are expected to win the approval of a federal judge for their $26 billion merger deal today, according to sources. That would end an effort by state attorneys general to block the combination of the third- and fourth-largest wireless carriers.\n\n&gt; #**STOCK SYMBOL:** TMUS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TMUS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TMUS)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** S\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=S&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/S)**)\n\n*****\n\n&gt; **Slack Technologies (WORK)** – Slack said in a Securities and Exchange Commission filing that IBM (IBM) had been the messaging platform’s largest customer for several years and had expanded its use of Slack over that time. The statement was issued in response to an earlier report that a new deal had been struck that made IBM Slack’s largest customer, which had sent the stock surging in the regular session Monday.\n\n&gt; #**STOCK SYMBOL:** WORK\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WORK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WORK)**)\n\n*****\n\n&gt; **Callaway Golf (ELY) **– Callaway lost 26 cents per share for its fourth quarter, wider than the 23 cents a share loss that analysts were expecting. The golf club maker reported better-than-expected revenue but said the coronavirus will have a negative impact in terms of both sales in Asia and on supplies.\n\n&gt; #**STOCK SYMBOL:** ELY\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ELY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ELY)**)\n\n*****\n\n&gt; **ViacomCBS (VIACA)** – ViacomCBS unit CBS Sports has struck a deal with sports betting company William Hill, allowing William Hill to seek new customers among the CBS Sports audience. William Hill would seek to get CBS Sports users to download its app and deposit money in betting accounts.\n\n&gt; #**STOCK SYMBOL:** VIAC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=VIAC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/VIAC)**)\n\n*****\n\n&gt; **XPO Logistics (XPO)** – XPO beat estimates by 10 cents a share, with adjusted quarterly earnings of $1.12 per share. The transportation and delivery company’s revenue came fall below analysts’ forecasts, however. XPO also announced the appointment of a new chief financial officer.\n\n&gt; #**STOCK SYMBOL:** XPO\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=XPO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/XPO)**)\n\n*****\n\n&gt; **Boston Beer (SAM)** – Boston Beer was upgraded to “outperform” from “neutral” at Credit Suisse, which points to the company’s increasing involvement in the hard seltzer market. Credit Suisse also increased its price target on the beer brewer’s stock to $525 per share from $400.\n\n*****\n\n&gt; #**STOCK SYMBOL:** SAM\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SAM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SAM)**)\n\n*****\n\n#**FULL DISCLOSURE:**\n\n&gt; /u/bigbear0083 has no positions in any stocks mentioned. Reddit, moderators, and the author do not advise making investment decisions based on discussion in these posts. Analysis is not subject to validation and users take action at their own risk. /u/bigbear0083 is an admin at the financial forums [Stockaholics.net](http://www.stockaholics.net/) where this content was originally posted.\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/StockMarket?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Tuesday, February 11th, 2020! :)**",
        "subreddit": "StockMarket",
        "title": "Today's Pre-Market News [Tuesday, February 11th, 2020]",
        "url": "https://www.reddit.com/r/StockMarket/comments/f289kq/todays_premarket_news_tuesday_february_11th_2020/",
        "created": 1581456279.0
    },
    {
        "author": "Otaehryn",
        "created_utc": 1580936894,
        "id": "ezghmr",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "I started investing 5 months ago, my strategy is to buy some stocks to hold long term every couple of months or quarterly (there is minimum comission). To me current market looks like it's going into a bubble, so I also plan to save cash, so I can buy in case market drops.\n\nSo my stock strategy is to seek good dividend stocks that are undervalued and besides one insurance company and medicine supplies I picked IBM reasoning: PE was low, I expected it do do better with RedHat, dividend was good. By beginners luck (I was planning to buy med. sup. company but it was high so I bought IBM which was low instead) I timed it well and bought 8 shares on 15th January at 136$ Now it's at 156$ My technical analysis shows it can touch 160-165 but then can go lower. I still expect it to go up in 2020. \n\nConsidering the hit (1-2%) I would take by selling, I should stick with it for 2020. I plan to purchases more stocks in March",
        "subreddit": "stocks",
        "title": "Bought IBM at 136 in Jan, now it's 156, hold or sell if it goes to 160",
        "url": "https://www.reddit.com/r/stocks/comments/ezghmr/bought_ibm_at_136_in_jan_now_its_156_hold_or_sell/",
        "created": 1580965694.0
    },
    {
        "author": "BiznessBob",
        "created_utc": 1580959239,
        "id": "ezlxya",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "options",
        "title": "IBM to the moon",
        "url": "https://i.redd.it/plv8x8pz18f41.jpg",
        "created": 1580988039.0
    },
    {
        "author": "ttech24",
        "created_utc": 1581368594,
        "id": "f1wv6i",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "IBM is now Slack one of the biggest account.",
        "subreddit": "RobinHood",
        "title": "Slack is now skyrockets 21% after IBM is their client.",
        "url": "https://www.reddit.com/r/RobinHood/comments/f1wv6i/slack_is_now_skyrockets_21_after_ibm_is_their/",
        "created": 1581397394.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1581427542,
        "id": "f28a1w",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/stocks sub! Welcome to Tuesday. Here is your pre-market news this AM-\n\n*****\n\n#[Today's Top Headlines for Tuesday, February 11th, 2020](https://www.cnbc.com/2020/02/11/dow-to-rise-powell-testifies-coronavirus-death-toll-passes-1000.html)\n\n* U.S. stock futures point to a higher open, following record closes for the S&amp;P 500 and Nasdaq on Monday, as investors are encouraged by a slowdown in the number of new coronavirus cases. The Dow, S&amp;P 500 and Nasdaq are higher in five of the past six sessions, and four S&amp;P sectors are at record highs: Consumer Discretionary, Consumer Staples, Tech and Real Estate. (CNBC)\n* Ray Dalio thinks the coronavirus’ hit to global markets is probably exaggerated (CNBC)\n* The director-general of the World Health Organization reportedly warned that while almost all of the confirmed coronavirus cases are in China, the outbreak constitutes a “very grave threat” for the rest of the world. China’s National Health Commission reported that a total of 42,638 cases had been confirmed in the country, with 1,016 deaths. (CNBC)\n* Nearly 200 evacuees to leave cornavirus quarantine in US (AP)\n* Fed Chairman Jerome Powell testifies today and tomorrow in the first of his twice-a-year economic updates to Congress, with investors listening for commentary on any coronavirus impact on the U.S. economy. On today’s economic calendar, the government is out with JOLTS, the Job Openings and Labor Turnover Survey, for December at 10 a.m. ET. (CNBC)\n* AutoNation (AN), Hasbro (HAS), Hilton Worldwide (HLT), Tegna (TGNA) and Under Armour (UAA) are out with quarterly earnings this morning, while Denny’s (DENN), Groupon (GRPN), Lyft (LYFT), and Western Union (WU) are among the companies issuing quarterly numbers after the bell.\n* A U.S. district judge is expected to rule in favor of allowing Sprint (S) and T-Mobile (TMUS) to merge over the objections of a group of state attorneys general, Reuters reported. It’s a decision that’s supposed to be made today. Shares of Sprint surged 69% in Monday’s after-hours trade and T-Mobile stock rose 8%. (CNBC)\n* The Democratic presidential race is deeply unsettled heading into today’s New Hampshire primary. It may be up to the state to put some structure around the chaotic contest, with Iowa being unable to declare a clear winner. New Hampshire’s secretary of state has predicted a healthy 292,000 Democratic voters, which would be about 40,000 more than voted in 2016. (AP)\n* Small New Hampshire town of Dixville Notch votes for Bloomberg in primary (USA Today)\n* Pete Buttigieg sees surge in support from business execs after his strong showing in Iowa (CNBC)\n* Bernie Sanders hopes New Hampshire primary will tighten his early grip on 2020 race (CNBC)\n* Mike Bloomberg could ‘handily beat’ Trump in 2020, says ex-Trump aide Anthony Scaramucci (CNBC)\n* Amazon (AMZN) is seeking to question President Donald Trump, Defense Secretary Mark Esper and former Defense Secretary James Mattis over a $10 billion Pentagon cloud contract awarded to Microsoft (MSFT). Amazon’s cloud computing arm said it’s looking to depose seven “individuals who were instrumental” in the JEDI source selection. (CNBC)\n* The Justice Department indicted four members of China’s military for the cyberattack against credit ratings agency Equifax in 2017. The incident led to the loss of personal information belonging to 145 million people, mostly in the U.S. but also in Canada and Europe. (CNBC)\n* The FAA is narrowing the issues needed before it can conduct a certification test flight on the grounded Boeing (BA) 737 Max, but will not commit to a timetable for lifting a flight ban. The certification flight to be carried out by FAA pilots “is not scheduled yet because we still have a few issues to resolve, but we continue to narrow the issues,” FAA Administrator Steve Dickson said. (Reuters)\n* DOT watchdog probes FAA’s pilot training after 2 deadly crashes of Boeing 737 Max (CNBC)\n* Google (GOOGL) human resources chief Eileen Naughton is stepping down from her role as tensions grown between employees and management. Naughton, who has held various roles at the company since 2006, has led the company’s human resources department as the vice president of people operations since 2016. (CNBC)\n* Shares of Slack (WORK) fell over 7% in the premarket after it filed an 8-K on Monday downplaying a news report that sent its stock surging more than 15%. The statement was issued in response to an earlier report that a new deal had been struck that made IBM Slack’s largest customer, which had sent the stock surging in the regular session Monday. (CNBC)\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](http://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://finviz.com/publish/021120/sec_all_075437166.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/wteeBZT.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/OeoDGfL.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/yKvMhID.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/SNqq5HC.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/8e4snrC.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/azlFbrt.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/YNP3Pq5.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/Vv5WIT7.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/vpdF9tz.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/SvyrDnj.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/CBl5AFZ.png)**)\n\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/G5AF0Cr.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #1!](https://i.imgur.com/22zaDPV.png)**)\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #2!](https://i.imgur.com/KMtzoBJ.png)**)\n\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS:\n\n* MYO\n* FB\n* UAA\n* UBS\n* MA\n* MSFT\n* NVDA\n* WORK\n* HAS\n* TMUS\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2020/02/11/stocks-making-the-biggest-moves-in-the-premarket-hasbro-under-armour-slack-sprint-more.html)**)\n\n*****\n\n&gt; **Under Armour (UAA)** – The athletic apparel maker reported an overall loss for the quarter, and warned of a negative sale impact from the coronavirus. The company also said it is assessing a possible 2020 restructuring.\n\n&gt; #**STOCK SYMBOL:** UAA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=UAA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/UAA)**)\n\n*****\n\n&gt; **AutoNation (AN)** – The nation’s largest car retailer beat estimates on both the top and bottom lines for the fourth quarter, with results boosted by higher demand for pre-owned vehicles.\n\n&gt; #**STOCK SYMBOL:** AN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AN)**)\n\n*****\n\n&gt; **Hasbro (HAS)** – The toymaker reported a quarterly profit of $1.24 per share, well above the consensus estimate of 91 cents a share. Sales fell short of Street forecasts, however, but Hasbro’s bottom line got a boost from toys related to Disney’s “Frozen 2” and “Star Wars” movies.\n\n&gt; #**STOCK SYMBOL:** HAS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=HAS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/HAS)**)\n\n*****\n\n&gt; **Hilton Worldwide (HLT)** – The hotel operator earned $1.00 per share for the fourth quarter, 4 cents a share above estimates. Revenue also beat forecasts. Hilton’s 2020 earnings outlook was below analysts’ forecasts, however, and the company said the outlook does not include possible coronavirus impact.\n\n&gt; #**STOCK SYMBOL:** HLT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=HLT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/HLT)**)\n\n*****\n\n&gt; **T-Mobile US (TMUS), Sprint (S)** – The mobile service providers are expected to win the approval of a federal judge for their $26 billion merger deal today, according to sources. That would end an effort by state attorneys general to block the combination of the third- and fourth-largest wireless carriers.\n\n&gt; #**STOCK SYMBOL:** TMUS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TMUS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TMUS)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** S\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=S&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/S)**)\n\n*****\n\n&gt; **Slack Technologies (WORK)** – Slack said in a Securities and Exchange Commission filing that IBM (IBM) had been the messaging platform’s largest customer for several years and had expanded its use of Slack over that time. The statement was issued in response to an earlier report that a new deal had been struck that made IBM Slack’s largest customer, which had sent the stock surging in the regular session Monday.\n\n&gt; #**STOCK SYMBOL:** WORK\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WORK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WORK)**)\n\n*****\n\n&gt; **Callaway Golf (ELY) **– Callaway lost 26 cents per share for its fourth quarter, wider than the 23 cents a share loss that analysts were expecting. The golf club maker reported better-than-expected revenue but said the coronavirus will have a negative impact in terms of both sales in Asia and on supplies.\n\n&gt; #**STOCK SYMBOL:** ELY\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ELY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ELY)**)\n\n*****\n\n&gt; **ViacomCBS (VIACA)** – ViacomCBS unit CBS Sports has struck a deal with sports betting company William Hill, allowing William Hill to seek new customers among the CBS Sports audience. William Hill would seek to get CBS Sports users to download its app and deposit money in betting accounts.\n\n&gt; #**STOCK SYMBOL:** VIAC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=VIAC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/VIAC)**)\n\n*****\n\n&gt; **XPO Logistics (XPO)** – XPO beat estimates by 10 cents a share, with adjusted quarterly earnings of $1.12 per share. The transportation and delivery company’s revenue came fall below analysts’ forecasts, however. XPO also announced the appointment of a new chief financial officer.\n\n&gt; #**STOCK SYMBOL:** XPO\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=XPO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/XPO)**)\n\n*****\n\n&gt; **Boston Beer (SAM)** – Boston Beer was upgraded to “outperform” from “neutral” at Credit Suisse, which points to the company’s increasing involvement in the hard seltzer market. Credit Suisse also increased its price target on the beer brewer’s stock to $525 per share from $400.\n\n*****\n\n&gt; #**STOCK SYMBOL:** SAM\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SAM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SAM)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/stocks?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Tuesday, February 11th, 2020! :)**",
        "subreddit": "stocks",
        "title": "Today's Pre-Market News [Tuesday, February 11th, 2020]",
        "url": "https://www.reddit.com/r/stocks/comments/f28a1w/todays_premarket_news_tuesday_february_11th_2020/",
        "created": 1581456342.0
    },
    {
        "author": "chicothebarge",
        "created_utc": 1580935819,
        "id": "ezg6pl",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "watch $IBM",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ezg6pl/watch_ibm/",
        "created": 1580964619.0
    },
    {
        "author": "TheFilterJustLeaves",
        "created_utc": 1581305206,
        "id": "f1kaxf",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**Azure is increasingly being recognized for the driver it is and Microsoft is quickly shedding its reputation for being a Windows company.**\n\nYou can't go far now without hearing that Azure Clouds (IaaS/PaaS), Office 365 Clouds (SaaS), and Dynamics (SaaS) are the absolute focus for the company. Windows, Xbox, and hardware are just funnels into Azure, Azure services, and data-collection endpoints that provide telemetry to improving the underlying technology fabric of the shared Windows and Windows Server codebase that help to power much of Azure outside of Linux. Speaking of Linux, with half of Azure compute workloads being Linux, Microsoft has equal motivation to &lt;3 it. As far as the market is concerned, Windows is just a reliable cash flow. As far as data is considered, it's going to be a goldmine for a long time.\n\nMy hypothesis is that as $MSFT is increasingly valued as a cloud services company, and less as a traditional software company and hardware provider, the P/E ratio premium will increase. What investor doesn't love reliable, enterprise, high gross margin cash that just keeps coming? The most recent earnings was the best in history, and there is no indication anywhere that trend is going to change. IT spend on cloud is only going to increase.\n\n**Azure has only increasing momentum, recognition by various industries as a preferred option over AWS, and differentiation that is both gaining on AWS and overcoming it as a market leader.**\n\nThe momentum of Azure at this point is simply undeniable. As the current cohort of hyperscale cloud incumbents continue to drop like flies in IaaS (the largest source of revenue for cloud platforms today), that momentum will accelerate. $GOOG (the only other actual competition left) is not going to make it in the enterprise with their recent loss of trust from the leak on backing off cloud and data harvesting, Red Hat and OpenShift won't be enough to save $IBM and it's paltry existence, and $BABA won't make further inroads to Western markets, limiting itself to China and SEA. Multi-cloud / poly-cloud implementations won't save them, either, as $MSFT and $AMZN establish their moats. No business idolizes needing to train two different ways of doing the same things, so they will tend to lean on a primary provider. We are talking a $92bn global market by 2023 with a 25% CAGR, and that is before we even get to PaaS, where $MSFT is a clear leader. Source: [https://www.theinformation.com/articles/google-brass-set-2023-as-deadline-to-beat-amazon-microsoft-in-cloud?utm\\_source=hackernews&amp;utm\\_medium=unlock](https://www.theinformation.com/articles/google-brass-set-2023-as-deadline-to-beat-amazon-microsoft-in-cloud?utm_source=hackernews&amp;utm_medium=unlock)\n\nCan't forget about SaaS either, where Office 365 is the largest SaaS by revenue today. That isn't going anywhere.\n\nIndustries from healthcare (Microsoft is ranked as a leader above Amazon in health cloud tech) and retail will bleed off from $AMZN and shift to Azure. $AMZN may have had first-mover advantage, but $MSFT has far greater trust from CIOs/CTOs. One of their primary concerns for Azure, reliability, is quickly diminishing as $MSFT makes increased investments to increasing reliability. Azure CTO Mark Russinovich has established it as one of the highest priorities to achieving parity and then superiority to $AMZN. Sources: [https://azure.microsoft.com/en-us/blog/improving-azure-virtual-machines-resiliency-with-project-tardigrade/](https://azure.microsoft.com/en-us/blog/improving-azure-virtual-machines-resiliency-with-project-tardigrade/) / [https://azure.microsoft.com/en-us/blog/advancing-noimpact-and-lowimpact-maintenance-technologies/](https://azure.microsoft.com/en-us/blog/advancing-noimpact-and-lowimpact-maintenance-technologies/)\n\nAzure will achieve AWS half of AWS present revenue within 3-4 years, even being conservative.\n\n**Azure is the uncontested king of hybrid cloud, the intended strategic cloud implementation for technology and IT spenders.**\n\nHybrid cloud is the choice of 75%+ for IT. $MSFT has been laser-focused on maintaining their present dominance in the datacenter and bridging these customers into Azure for hybrid workloads. The reputation difference when it comes to AWS vs. Azure on hybrid is clear, and $MSFT has a massive advantage with Azure Stack, Azure Edge, Azure Sphere, and more.\n\nAWS Outpost and Snowball alone can't match the functional capabilities of the Azure Stack family which has a multi-year head start and can operate completely disconnected.\n\n**Azure** ***already*** **has leadership in IoT and Microsoft will help take the lead in 5G this year with AT&amp;T and the US intention to curve Huawei.**\n\nThe one-two punch of IoT and 5G leadership will open up incredible new opportunities. Are you betting big on a connected world? Bet on Microsoft. Sources: [https://www.wsj.com/articles/senators-propose-bill-to-subsidize-u-s-firms-5g-efforts-11579031806?mod=article\\_inline](https://www.wsj.com/articles/senators-propose-bill-to-subsidize-u-s-firms-5g-efforts-11579031806?mod=article_inline)\n\n\\---\n\nOnto my own YOLO.\n\n&amp;#x200B;\n\n[Current positions](https://preview.redd.it/nlvh11hhm0g41.png?width=1470&amp;format=png&amp;auto=webp&amp;s=ecce5c91d6d9bd7294b1feab7c10eac1500ac4ee)",
        "subreddit": "RobinHood",
        "title": "$MSFT blew past $180. $190 by March? 34k to 230k. DD inside.",
        "url": "https://www.reddit.com/r/RobinHood/comments/f1kaxf/msft_blew_past_180_190_by_march_34k_to_230k_dd/",
        "created": 1581334006.0
    },
    {
        "author": "doublemctwist1260",
        "created_utc": 1581878532,
        "id": "f4uykz",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Surprised nobody on here has talked about the run up in slack over the last couple weeks even after the weird shit with IBM, it’s had a great year and just passed through some basic technical levels on momentum, picked up some april calls, the platform is better than msft teams but macrohard has the advantage of easy integration, I don’t think this will be a major issue because there is a huge market for this kind of software, they were definitely beaten up more than they should have been going public when we work and uber/lyft were getting railed, feeling myself, feeling my balls, getting ready for liftoff, someone tell me why they suck",
        "subreddit": "wallstreetbets",
        "title": "$WORK",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f4uykz/work/",
        "created": 1581907332.0
    },
    {
        "author": "slapstellas",
        "created_utc": 1582685499,
        "id": "f9mcwl",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Multiple CEO's stepped down today and this week: Disney, Mastercard, L Brands, Salesforce, Uber Eats, HULU, MGM, IBM, Linkedin, Match.com, Aurora Cannabis, and more.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f9mcwl/multiple_ceos_stepped_down_today_and_this_week/",
        "created": 1582714299.0
    },
    {
        "author": "TheFilterJustLeaves",
        "created_utc": 1581289448,
        "id": "f1gufe",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " \n\nYour favorite $MSFT shill is back for round three.\n\n**Azure is increasingly being recognized for the driver it is and Microsoft is quickly shedding its reputation for being a Windows company.**\n\nYou can't go far now without hearing that Azure Clouds (IaaS/PaaS), Office 365 Clouds (SaaS), and Dynamics (SaaS) are the absolute focus for the company. Windows, Xbox, and hardware are just funnels into Azure, Azure services, and data-collection endpoints that provide telemetry to improving the underlying technology fabric of the shared Windows and Windows Server codebase that help to power much of Azure outside of Linux. Speaking of Linux, with half of Azure compute workloads being Linux, Microsoft has equal motivation to &lt;3 it. As far as the market is concerned, Windows is just a reliable cash flow. As far as data is considered, it's going to be a goldmine for a long time.\n\nMy hypothesis is that as $MSFT is increasingly valued as a cloud services company, and less as a traditional software company and hardware provider, the P/E ratio premium will increase. What investor doesn't love reliable, enterprise, high gross margin cash that just keeps coming? The most recent earnings was the best in history, and there is no indication anywhere that trend is going to change. IT spend on cloud is only going to increase.\n\n**Azure has only increasing momentum, recognition by various industries as a preferred option over AWS, and differentiation that is both gaining on AWS and overcoming it as a market leader.**\n\nThe momentum of Azure at this point is simply undeniable. As the current cohort of hyperscale cloud incumbents continue to drop like flies in IaaS (the largest source of revenue for cloud platforms today), that momentum will accelerate. $GOOG (the only other actual competition left) is not going to make it in the enterprise with their recent loss of trust from the leak on backing off cloud and data harvesting, Red Hat and OpenShift won't be enough to save $IBM and it's paltry existence, and $BABA won't make further inroads to Western markets, limiting itself to China and SEA. Multi-cloud / poly-cloud implementations won't save them, either, as $MSFT and $AMZN establish their moats. No business idolizes needing to train two different ways of doing the same things, so they will tend to lean on a primary provider. We are talking a $92bn global market by 2023 with a 25% CAGR, and that is before we even get to PaaS, where $MSFT is a clear leader. Source: [https://www.theinformation.com/articles/google-brass-set-2023-as-deadline-to-beat-amazon-microsoft-in-cloud?utm\\_source=hackernews&amp;utm\\_medium=unlock](https://www.theinformation.com/articles/google-brass-set-2023-as-deadline-to-beat-amazon-microsoft-in-cloud?utm_source=hackernews&amp;utm_medium=unlock)\n\nCan't forget about SaaS either, where Office 365 is the largest SaaS by revenue today. That isn't going anywhere.\n\nIndustries from healthcare (Microsoft is ranked as a leader above Amazon in health cloud tech) and retail will bleed off from $AMZN and shift to Azure. $AMZN may have had first-mover advantage, but $MSFT has far greater trust from CIOs/CTOs. One of their primary concerns for Azure, reliability, is quickly diminishing as $MSFT makes increased investments to increasing reliability. Azure CTO Mark Russinovich has established it as one of the highest priorities to achieving parity and then superiority to $AMZN. Sources: [https://azure.microsoft.com/en-us/blog/improving-azure-virtual-machines-resiliency-with-project-tardigrade/](https://azure.microsoft.com/en-us/blog/improving-azure-virtual-machines-resiliency-with-project-tardigrade/) / [https://azure.microsoft.com/en-us/blog/advancing-noimpact-and-lowimpact-maintenance-technologies/](https://azure.microsoft.com/en-us/blog/advancing-noimpact-and-lowimpact-maintenance-technologies/)\n\nAzure will achieve AWS half of AWS present revenue within 3-4 years, even being conservative.\n\n**Azure is the uncontested king of hybrid cloud, the intended strategic cloud implementation for technology and IT spenders.**\n\nHybrid cloud is the choice of 75%+ for IT. $MSFT has been laser-focused on maintaining their present dominance in the datacenter and bridging these customers into Azure for hybrid workloads. The reputation difference when it comes to AWS vs. Azure on hybrid is clear, and $MSFT has a massive advantage with Azure Stack, Azure Edge, Azure Sphere, and more.\n\nAWS Outpost and Snowball alone can't match the functional capabilities of the Azure Stack family which has a multi-year head start and can operate completely disconnected.\n\n**Azure** ***already*** **has leadership in IoT and Microsoft will help take the lead in 5G this year with AT&amp;T and the US intention to curve Huawei.**\n\nThe one-two punch of IoT and 5G leadership will open up incredible new opportunities. Are you betting big on a connected world? Bet on Microsoft. Sources: [https://www.wsj.com/articles/senators-propose-bill-to-subsidize-u-s-firms-5g-efforts-11579031806?mod=article\\_inline](https://www.wsj.com/articles/senators-propose-bill-to-subsidize-u-s-firms-5g-efforts-11579031806?mod=article_inline)\n\n\\---\n\nOnto my own YOLO.\n\n&amp;#x200B;\n\n![img](87lfinapbzf41 \"Positions\")",
        "subreddit": "wallstreetbets",
        "title": "$MSFT to $200? ~$30k to $230k. DD inside.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f1gufe/msft_to_200_30k_to_230k_dd_inside/",
        "created": 1581318248.0
    },
    {
        "author": "TheFilterJustLeaves",
        "created_utc": 1581287649,
        "id": "f1gewt",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Your favorite $MSFT shill is back for round three.\n\n**Azure is increasingly being recognized for the driver it is and Microsoft is quickly shedding its reputation for being a Windows company.**\n\nYou can't go far now without hearing that Azure Clouds (IaaS/PaaS), Office 365 Clouds (SaaS), and Dynamics (SaaS) are the absolute focus for the company. Windows, Xbox, and hardware are just funnels into Azure, Azure services, and data-collection endpoints that provide telemetry to improving the underlying technology fabric of the shared Windows and Windows Server codebase that help to power much of Azure outside of Linux. Speaking of Linux, with half of Azure compute workloads being Linux, Microsoft has equal motivation to &lt;3 it. As far as the market is concerned, Windows is just a reliable cash flow. As far as data is considered, it's going to be a goldmine for a long time.\n\nMy hypothesis is that as $MSFT is increasingly valued as a cloud services company, and less as a traditional software company and hardware provider, the P/E ratio premium will increase. What investor doesn't love reliable, enterprise, high gross margin cash that just keeps coming? The most recent earnings was the best in history, and there is no indication anywhere that trend is going to change. IT spend on cloud is only going to increase.\n\n**Azure has only increasing momentum, recognition by various industries as a preferred option over AWS, and differentiation that is both gaining on AWS and overcoming it as a market leader.**\n\nThe momentum of Azure at this point is simply undeniable. As the current cohort of hyperscale cloud incumbents continue to drop like flies in IaaS (the largest source of revenue for cloud platforms today),  that momentum will accelerate. $GOOG (the only other actual competition left) is not going to make it in the enterprise with their recent loss of trust from the leak on backing off cloud and data harvesting, Red Hat and OpenShift won't be enough to save $IBM and it's paltry existence, and $BABA won't make further inroads to Western markets, limiting itself to China and SEA. Multi-cloud / poly-cloud implementations won't save them, either, as $MSFT and $AMZN establish their moats. No business idolizes needing to train two different ways of doing the same things, so they will tend to lean on a primary provider. We are talking a $92bn global market by 2023 with a 25% CAGR, and that is before we even get to PaaS, where $MSFT is a clear leader. Source:  [https://www.theinformation.com/articles/google-brass-set-2023-as-deadline-to-beat-amazon-microsoft-in-cloud?utm\\_source=hackernews&amp;utm\\_medium=unlock](https://www.theinformation.com/articles/google-brass-set-2023-as-deadline-to-beat-amazon-microsoft-in-cloud?utm_source=hackernews&amp;utm_medium=unlock) \n\nCan't forget about SaaS either, where Office 365 is the largest SaaS by revenue today. That isn't going anywhere.\n\nIndustries from healthcare (Microsoft is ranked as a leader above Amazon in health cloud tech) and retail will bleed off from $AMZN and shift to Azure. $AMZN may have had first-mover advantage, but $MSFT has far greater trust from CIOs/CTOs. One of their primary concerns for Azure, reliability, is quickly diminishing as $MSFT makes increased investments to increasing reliability. Azure CTO Mark Russinovich has established it as one of the highest priorities to achieving parity and then superiority to $AMZN. Sources:  [https://azure.microsoft.com/en-us/blog/improving-azure-virtual-machines-resiliency-with-project-tardigrade/](https://azure.microsoft.com/en-us/blog/improving-azure-virtual-machines-resiliency-with-project-tardigrade/)  /  [https://azure.microsoft.com/en-us/blog/advancing-noimpact-and-lowimpact-maintenance-technologies/](https://azure.microsoft.com/en-us/blog/advancing-noimpact-and-lowimpact-maintenance-technologies/) \n\nAzure will achieve AWS half of AWS present revenue within 3-4 years, even being conservative.\n\n**Azure is the uncontested king of hybrid cloud, the intended strategic cloud implementation for technology and IT spenders.**\n\nHybrid cloud is the choice of 75%+ for IT. $MSFT has been laser-focused on maintaining their present dominance in the datacenter and bridging these customers into Azure for hybrid workloads. The reputation difference when it comes to AWS vs. Azure on hybrid is clear, and $MSFT has a massive advantage with Azure Stack, Azure Edge, Azure Sphere, and more.\n\nAWS Outpost and Snowball alone can't match the functional capabilities of the Azure Stack family which has a multi-year head start and can operate completely disconnected.\n\n**Azure** ***already*** **has leadership in IoT and Microsoft will help take the lead in 5G this year with AT&amp;T and the US intention to curve Huawei.**\n\nThe one-two punch of IoT and 5G leadership will open up incredible new opportunities. Are you betting big on a connected world? Bet on Microsoft. Sources:  [https://www.wsj.com/articles/senators-propose-bill-to-subsidize-u-s-firms-5g-efforts-11579031806?mod=article\\_inline](https://www.wsj.com/articles/senators-propose-bill-to-subsidize-u-s-firms-5g-efforts-11579031806?mod=article_inline) \n\n\\---\n\nOnto my own YOLO. \n\nhttps://preview.redd.it/afw0rdtj5zf41.png?width=1516&amp;format=png&amp;auto=webp&amp;s=5223b441f054fa9c08127af5d299b8a89bb152ee",
        "subreddit": "wallstreetbets",
        "title": "$MSFT to $190-$200 by March? DD + YOLO + Stats inside: ~$30k to $230k",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f1gewt/msft_to_190200_by_march_dd_yolo_stats_inside_30k/",
        "created": 1581316449.0
    },
    {
        "author": "TripleBrain",
        "created_utc": 1581891005,
        "id": "f4y75s",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "\nHere’s the background about SPCE that all you bulls rarely discuss: \n\nSPCE had a failed mission 5 years ago and blamed the pilot for the crash. Pretty miserable excuse. \n\nCEO has said for the last 5 years that their SS2 aircrafts were set to launch each year, and of course, they always blamed contractors for not reaching “milestones” to get it all going. Again, miserable excuse. \n\n\nHere’s a summary of why it won’t succeed and further analysis on the speculative market size that these uninformed bulls have:\n\nThey have 600 pre-orders. Why go for such a small number if they have the potential to capture a much large speculated market that the bulls are contending? If they are front runners in this race, they have early bird advantage to take in much more and backlog them if they need to. But why 600 with revenues of only 150M?\n\nMarket cap is currently 5B, which is 42x revenue. And what do the bulls say about this? “Stop looking at current revenue, they have a much larger market”. Of who? Multi millionaires and billionaires? “Then they have hypersonic travel for 2 hour travel to London.” Who actually fucking needs to get to London or any other country in 2 hours just to pay a gigantic premium when they can get a private jet and have a personalize ride. You think C-suites are going to have diarrhea all day and will need to get to London in 2 hours? Last I check, most execs, consultants, etc get to their destination days in advanced anyway. \n\nThen it comes to market cap. I can’t tell if this is a joke, but I hear bull gang compare SPCE  market size to Tesla, Spotify, IBM, Microsoft,  Uber, Lyft, etc. I’m not going to even have to explain this. The statement in itself has a high enough autistic frequency for even the lowest spectrum of autism to understand how retarded it is. Yes, buying an electric vehicle that will last for years, purchasing a music subscription,  buying laptops and software, and getting a daily ride to work is equivalent to going to space for 250k.\n\nNow, when I say 250k, I hear bull gang say “you’re retarded. They will reduce cost when they increase efficiency and have a fleet of 500 planes flying daily.” Goddamn this is almost as autist has stormwillpass plays. Firstly, if they reduce cost, it won’t be by significant margins. Why? Because space travel will not be cheap no matter how you put it. Cost of production won’t change unless they can do it with cheap labor in China. Efficiency will be the same unless they hire a herd of engineers working 24/7. R&amp;D will continue to cost more as they try to scale this with large carriers. Ffs, they took years just to get 2 damn planes right. You guys are out here talking about 500 planes. As for scalability. By the time they scale, if they even can, BlueOrigins and SpaceX would have listed and would be flying herds of middle class enthusiasts to space. \n\nNow on to the preorders and future orders. 600 pre-orders are not going to fly this year. They will be backlogged to shit. Why? Because they don’t own airspace. They can barely get their contractors in line with the schedule and you’re expecting them to make 100 flights to the edge of space all in half a year? They expect Branson to be their first passenger on his birthday in July. Do the math. That would be nearly flying every single day from August-December. They have 2 aircrafts right now. Do you really think they are going to expose those two newly made (and still technically under progress) aircrafts under that much fly time? And do you have any idea how risky something like this would be? They aren’t flying planes. Planes can fly all day every day with turbine engines and at low altitudes. We are talking about rocket fuel to the edge of space. Stop with this talk about how they are going to get all these pre orders done and then add a huge list to the log. My guess, they might fulfill those 600 clients in the next two years. And have a backlog of irked clients that paid such a large deposit to sit around and watch Branson slamming young girls on his private island. \n\nAnd then the talk about hypersonic travel. You guys are talking about it like they have done it. That’s a vision, not a reality. They can’t even commercialize sub-hypersonic travel and they are talking about hypersonic travel at the forefront of this project as if it’s reality. You’re hearing an upbeat CEO trying to raise more capital. You’re drowning out the facts and the reality that they haven’t even flown a damn crew to space yet. They have even had a full 6 passengers fly yet. \n\nAs for the newly released sec filing for the warrants. 31M shares. Bull gang is thinking, ah this is regulatory stuff, it won’t get exercised. Literally two funds just filed for 11M on the same day. You think this is a coincidence? A couple people DMed me about this exact thing. They are listed for $11.50 per share. Institutions aren’t going to be buying in at market price at this time. Those funds are buying at the warrant price and that’s probably why it happened on the same day.",
        "subreddit": "wallstreetbets",
        "title": "SPCE - Reasonable Assessment",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f4y75s/spce_reasonable_assessment/",
        "created": 1581919805.0
    },
    {
        "author": "TheFilterJustLeaves",
        "created_utc": 1581304933,
        "id": "f1k8x2",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " Your favorite $MSFT shill is back for round three.\n\n**Azure is increasingly being recognized for the driver it is and Microsoft is quickly shedding its reputation for being a Windows company.**\n\nYou can't go far now without hearing that Azure Clouds (IaaS/PaaS), Office 365 Clouds (SaaS), and Dynamics (SaaS) are the absolute focus for the company. Windows, Xbox, and hardware are just funnels into Azure, Azure services, and data-collection endpoints that provide telemetry to improving the underlying technology fabric of the shared Windows and Windows Server codebase that help to power much of Azure outside of Linux. Speaking of Linux, with half of Azure compute workloads being Linux, Microsoft has equal motivation to &lt;3 it. As far as the market is concerned, Windows is just a reliable cash flow. As far as data is considered, it's going to be a goldmine for a long time.\n\nMy hypothesis is that as $MSFT is increasingly valued as a cloud services company, and less as a traditional software company and hardware provider, the P/E ratio premium will increase. What investor doesn't love reliable, enterprise, high gross margin cash that just keeps coming? The most recent earnings was the best in history, and there is no indication anywhere that trend is going to change. IT spend on cloud is only going to increase.\n\n**Azure has only increasing momentum, recognition by various industries as a preferred option over AWS, and differentiation that is both gaining on AWS and overcoming it as a market leader.**\n\nThe momentum of Azure at this point is simply undeniable. As the current cohort of hyperscale cloud incumbents continue to drop like flies in IaaS (the largest source of revenue for cloud platforms today), that momentum will accelerate. $GOOG (the only other actual competition left) is not going to make it in the enterprise with their recent loss of trust from the leak on backing off cloud and data harvesting, Red Hat and OpenShift won't be enough to save $IBM and it's paltry existence, and $BABA won't make further inroads to Western markets, limiting itself to China and SEA. Multi-cloud / poly-cloud implementations won't save them, either, as $MSFT and $AMZN establish their moats. No business idolizes needing to train two different ways of doing the same things, so they will tend to lean on a primary provider. We are talking a $92bn global market by 2023 with a 25% CAGR, and that is before we even get to PaaS, where $MSFT is a clear leader. Source: [https://www.theinformation.com/articles/google-brass-set-2023-as-deadline-to-beat-amazon-microsoft-in-cloud?utm\\_source=hackernews&amp;utm\\_medium=unlock](https://www.theinformation.com/articles/google-brass-set-2023-as-deadline-to-beat-amazon-microsoft-in-cloud?utm_source=hackernews&amp;utm_medium=unlock)\n\nCan't forget about SaaS either, where Office 365 is the largest SaaS by revenue today. That isn't going anywhere.\n\nIndustries from healthcare (Microsoft is ranked as a leader above Amazon in health cloud tech) and retail will bleed off from $AMZN and shift to Azure. $AMZN may have had first-mover advantage, but $MSFT has far greater trust from CIOs/CTOs. One of their primary concerns for Azure, reliability, is quickly diminishing as $MSFT makes increased investments to increasing reliability. Azure CTO Mark Russinovich has established it as one of the highest priorities to achieving parity and then superiority to $AMZN. Sources: [https://azure.microsoft.com/en-us/blog/improving-azure-virtual-machines-resiliency-with-project-tardigrade/](https://azure.microsoft.com/en-us/blog/improving-azure-virtual-machines-resiliency-with-project-tardigrade/) / [https://azure.microsoft.com/en-us/blog/advancing-noimpact-and-lowimpact-maintenance-technologies/](https://azure.microsoft.com/en-us/blog/advancing-noimpact-and-lowimpact-maintenance-technologies/)\n\nAzure will achieve AWS half of AWS present revenue within 3-4 years, even being conservative.\n\n**Azure is the uncontested king of hybrid cloud, the intended strategic cloud implementation for technology and IT spenders.**\n\nHybrid cloud is the choice of 75%+ for IT. $MSFT has been laser-focused on maintaining their present dominance in the datacenter and bridging these customers into Azure for hybrid workloads. The reputation difference when it comes to AWS vs. Azure on hybrid is clear, and $MSFT has a massive advantage with Azure Stack, Azure Edge, Azure Sphere, and more.\n\nAWS Outpost and Snowball alone can't match the functional capabilities of the Azure Stack family which has a multi-year head start and can operate completely disconnected.\n\n**Azure** ***already*** **has leadership in IoT and Microsoft will help take the lead in 5G this year with AT&amp;T and the US intention to curve Huawei.**\n\nThe one-two punch of IoT and 5G leadership will open up incredible new opportunities. Are you betting big on a connected world? Bet on Microsoft. Sources: [https://www.wsj.com/articles/senators-propose-bill-to-subsidize-u-s-firms-5g-efforts-11579031806?mod=article\\_inline](https://www.wsj.com/articles/senators-propose-bill-to-subsidize-u-s-firms-5g-efforts-11579031806?mod=article_inline)\n\n\\---\n\nOnto my own YOLO.\n\n&amp;#x200B;\n\n![img](v2tr5txrl0g41 \"Positions\")\n\nI will be continuing to hold most of the position.",
        "subreddit": "wallstreetbets",
        "title": "Azure to $200. DD inside. 34k -&gt; 230k",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f1k8x2/azure_to_200_dd_inside_34k_230k/",
        "created": 1581333733.0
    },
    {
        "author": "SomehowTOPGUN",
        "created_utc": 1580947710,
        "id": "ezjb1g",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "CIA wants IBM... I warned you",
        "url": "https://i.redd.it/z1q5vdnp37f41.png",
        "created": 1580976510.0
    },
    {
        "author": "dimitrynakhla",
        "created_utc": 1580927108,
        "id": "ezdvxt",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Risk it all on IBM",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ezdvxt/risk_it_all_on_ibm/",
        "created": 1580955908.0
    },
    {
        "author": "Imobviouslydrunk",
        "created_utc": 1582048834,
        "id": "f5vtxs",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Calls IBM",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f5vtxs/calls_ibm/",
        "created": 1582077634.0
    },
    {
        "author": "wefarrell",
        "created_utc": 1582823771,
        "id": "fafciu",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "The CDC has stated that outbreaks in the US are inevitable. The US lacks a centralized healthcare system and the responsibility to manage this pandemic will fall largely on community healthcare systems. Where will they spend the funds that will be allocated to them by federal/state/local governments and private individuals? One less obvious play is population health management software. \n\nThese systems allow providers to triage demographics. It's not feasible to test/treat/vaccinate entire populations in a location, so providers will need to identify which demographics are more likely to contract the virus and administer care accordingly. \n\nCurrently there are no pure plays in this space and many of the players are private, including the largest - Epic. Publicly traded companies in this space offer it alongside a myriad of other health IT products:\n\n* Cerner\n* Allscripts\n* Optum (owned by UnitedHealth Group)\n* IBM\n* 3M\n* Oracle\n\nPersonally I've been holding UNH since 2012 when I heard about their substantial investments in healthcare IT and believed they're position as the largest insurer gave them access to a large high-quality dataset. If I had more cash sitting around I would probably put it in Cerner.",
        "subreddit": "investing",
        "title": "Coronavirus should benefit population health management vendors",
        "url": "https://www.reddit.com/r/investing/comments/fafciu/coronavirus_should_benefit_population_health/",
        "created": 1582852571.0
    }
]