[
    {
        "author": "Rathadin",
        "created_utc": 1592528662,
        "id": "hbr1ol",
        "num_comments": 650,
        "num_crossposts": 0,
        "selftext": "https://www.anandtech.com/show/15846/jim-keller-resigns-from-intel-effective-immediately\n\nGoddammit, this reminded me why I never take vacations. I've had limited access to the Internet and I was catching up on my news feeds. Apparently Jim Keller resigned from Intel one week ago, effectively immediately.\n\nI know a lot of you here suck Lisa Su's dick nonstop because you think she was the captain that turned around AMD, and while she does deserve a lot of credit, I have argued on this very subreddit that if it had not been for her bringing back Jim Keller, AMD's unparalleled comeback would not have been possible (I also think the reason Intel is putting out press releases about shifting away from benchmarks is because they know that Zen 3 this fall will utter destroy their lineup - they will be faster in literally every single category of benchmark, not just multicore performance).\n\nJim Keller is well-known in the CPU industry as a legendary chip designer. He designed chips for DEC (Digital Equipment Corp), Apple (A4 / A5), AMD (K6, K8, Ryzen, etc.), Tesla's Autopilot hardware, and others.\n\nThe official press release was \"for personal reasons\". That often translates to health-related issues. I don't buy it. His brother-in-law is Jordan Peterson (yes, that Dr. Peterson), but Jordan's on the mend and recovering from his benzo addiction. Keller himself is healthy as a fucking horse. I think this is related far more to Intel and the managerial clusterfuck that the company has become over the past decade and a half. I think Keller realized he can't do what he did at AMD, which was really shake things the fuck up in order to put together the best possible team for engineering a new line of CPUs.\n\nWhy do I think this? Various reasons, listed below.\n\nCharlie Demerjian of SemiAccurate has long detailed Intel's problems with their 10nm process, along with their management issues. Glassdoor.com has dozens of company reviews from employees of Intel where they talk about blue badge vs. green badge employees (blue badges are full-time employees that are directly employed by Intel; green badges are contractors which far less benefits). You can Google search these terms - \"Intel blue badge green badge\" and read literally page after page of material about how utterly dysfunctional Intel currently is, due to idiotic management practices. Some of the stories are laughably sad.\n\nIntel as a company has a culture of arrogance. How could they not? They've never had a serious competitor in the x86 space, and while they missed the boat on mobile processors for smartphones and tablets - even after Steve Jobs personally approached them and told them to fix their power management issues and improve their power consumption because he wanted to use Intel x86 chips in iPads and MacBook Air lines - they didn't really care because their desktop and server market was so entrenched and they were so dominant that they figured they could live without those markets.\n\nWell now AMD is fucking destroying them on all fronts. Desktop? Yes. Zen 2 is more power efficient than Intel's most recent desktop parts, by far. Server? LOL, don't even making me fucking laugh... Intel's highest-end server chips are drawing almost half a fucking kilowatt for a 56 core chip. Epyc is pulling 261 watts under load for 64 cores. Laptops? AMD is ahead there now as well, with the Ryzen 4700U chip pulling **half** fucking ***HALF*** of the wattage of its competing Intel chip.\n\nIf you're a bagholding 🌈🐻 you better watch the fuck out because Intel is going to go nowhere but downhill from here. Its clear that their 10nm process is a steaming pile of hot garbage, with absolutely atrocious yields. You don't believe that? Ask yourself why they haven't shifted production of all chips away from 14nm++++ (however many fucking pluses they've added since 2014) and to 10nm? Ask yourself why only a handful of parts are currently 10nm, and why all those parts are either low-power laptop chips or high-power server CPUs? Simple. Low-power laptop chips are small and there's less chance of shit being fucked up during lithography. Server chips are huge and expensive, because Intel puts all 28 cores on a single chip, instead of \"gluing together\" the chips like AMD does. So out of a single wafer, they may get 300 chips. But with yields so low (in 2018, Intel's 10nm yield was than than 10%, most industry insiders don't think they've even cracked 50% yield yet), they're lucky to get 150 functional chips out of that wafer, and if you believe sites like SemiAccurate, it could be far... **far** lower. Out of those, you have to put 2 of these 28 core chips together to get Intel's high-end Platinum 9200 series CPU, which sells for $10,000 (and which practically no one is buying). AMD has 93.5% yield on Zen 2 process. That means out of a potential 840 chips, 785 of those chips are fully functional. If AMD wants a 32 core chip, they just glue together 4 of them. Problem solved. Congratulations on your 32 core server CPU.\n\nWait for AMD's Zen 3 launch this fall. If you're bold, short the shit out of Intel. If you're risk adverse, buy AMD and hold. Abandon ship on INTL. This fucker is going to crash and burn until at least 2023 (on average it takes 5 years to create a completely new CPU architecture, Intel hasn't done that since the Core series, which was 10 years ago, and when Keller was brought on in 2018, that's what everyone thought he would do).",
        "subreddit": "wallstreetbets",
        "title": "Get the fuck out of Intel and get out immediately.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hbr1ol/get_the_fuck_out_of_intel_and_get_out_immediately/",
        "created": 1592557462.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1591344424,
        "id": "gx0fbe",
        "num_comments": 512,
        "num_crossposts": 0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme and/or [post your arguments against fundamentals here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nMost fundamentals are updated every 3 months due to the fact that corporations release earnings reports every quarter, so traders are always speculating at what those earnings will say, and investors may change the size of their holdings based on those reports.  Expect a lot of volatility around earnings, but it usually doesn't matter if you're holding long term, but keep in mind the importance of earnings reports because a trend of declining earnings or a decline in some other fundamental will drive the stock down over the long term as well.\n\nSee the following word cloud and click through for the wiki:\n\n[Market Cap - Shares Outstanding - Volume - Dividend - EPS - P/E Ratio - EPS Q/Q - PEG - Sales Q/Q - Return on Assets (ROA) - Return on Equity (ROE) - BETA - SMA - quarterly earnings](https://www.reddit.com/r/stocks/wiki/fundamentals-themed-post)\n\nIf you have a basic question, for example \"what is EBITDA,\" then google \"investopedia EBITDA\" and click the Investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nUseful links:\n\n* [Investopedia Tuturiol](https://www.investopedia.com/university/all/fundamental-analysis/) on fundamental analysis including [Discounted Cash Flow](https://www.investopedia.com/university/dcf/) analysis; see [definition here](https://www.investopedia.com/terms/d/dcf.asp)\n* [FINVIZ](https://finviz.com/quote.ashx?t=aapl) for fundamental data, charts, and aggregated news\n* [Earnings Whisper](https://www.earningswhispers.com/stocks/aapl) for earnings details\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion &amp; Fundamentals Friday Jun 05, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/gx0fbe/rstocks_daily_discussion_fundamentals_friday_jun/",
        "created": 1591373224.0
    },
    {
        "author": "patrikb2014",
        "created_utc": 1591735352,
        "id": "gzvpi1",
        "num_comments": 509,
        "num_crossposts": 1,
        "selftext": "I sold. I put my life saving of 56k into spirit RCL, CCL, and Sixflags. I cashed out at $120k. I couldn’t take it any more. I bought bitcoin in 2017 and it went 4x and I held. I went from 65k to what is worth 15k now. This feels like 2017 bitcoin. These numbers don’t add up to the value of the stocks I held and am happy with my profit. Even finally showed my wife the portfolio balance. I did put everything into JNJ, AMD, AAPL and MSFT. \n\nIf my travel stocks double next month I will be happy selling at a profit. I wish you all great success in your picks!",
        "subreddit": "stocks",
        "title": "I did it today",
        "url": "https://www.reddit.com/r/stocks/comments/gzvpi1/i_did_it_today/",
        "created": 1591764152.0
    },
    {
        "author": "Smolsen99",
        "created_utc": 1593122259,
        "id": "hfv3mp",
        "num_comments": 484,
        "num_crossposts": 0,
        "selftext": "\nHello everyone, I am what you might call a retard’s retard. I have made quite a few lucky calls and have half a million tied into the market. I would post this in r/investing but those weirdos take everything too seriously and their threads are so dry few people would even respond to my post.  \n\nI am a bull who has turned to the bears temporarily. The market seems artificially inflated and I’m not sure where to stash my cash. My biggest holdings are in LMT and AAPL. Most of the rest is in tech. I don’t want to take the money out and face capital gainz taxes but I also don’t want to be caught with my pants down if (more like when) the market crashes.\n\nThanks boys, I love you all.",
        "subreddit": "wallstreetbets",
        "title": "I have $500,000 tied up in the market and want advice...fuck r/investing",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hfv3mp/i_have_500000_tied_up_in_the_market_and_want/",
        "created": 1593151059.0
    },
    {
        "author": "appleciroth",
        "created_utc": 1593019166,
        "id": "hf52uy",
        "num_comments": 425,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Properly engraved my Apple Card",
        "url": "https://i.redd.it/8q5efjec6w651.jpg",
        "created": 1593047966.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1591949220,
        "id": "h7gmt0",
        "num_comments": 380,
        "num_crossposts": 0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme and/or [post your arguments against fundamentals here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nMost fundamentals are updated every 3 months due to the fact that corporations release earnings reports every quarter, so traders are always speculating at what those earnings will say, and investors may change the size of their holdings based on those reports.  Expect a lot of volatility around earnings, but it usually doesn't matter if you're holding long term, but keep in mind the importance of earnings reports because a trend of declining earnings or a decline in some other fundamental will drive the stock down over the long term as well.\n\nSee the following word cloud and click through for the wiki:\n\n[Market Cap - Shares Outstanding - Volume - Dividend - EPS - P/E Ratio - EPS Q/Q - PEG - Sales Q/Q - Return on Assets (ROA) - Return on Equity (ROE) - BETA - SMA - quarterly earnings](https://www.reddit.com/r/stocks/wiki/fundamentals-themed-post)\n\nIf you have a basic question, for example \"what is EBITDA,\" then google \"investopedia EBITDA\" and click the Investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nUseful links:\n\n* [Investopedia Tuturiol](https://www.investopedia.com/university/all/fundamental-analysis/) on fundamental analysis including [Discounted Cash Flow](https://www.investopedia.com/university/dcf/) analysis; see [definition here](https://www.investopedia.com/terms/d/dcf.asp)\n* [FINVIZ](https://finviz.com/quote.ashx?t=aapl) for fundamental data, charts, and aggregated news\n* [Earnings Whisper](https://www.earningswhispers.com/stocks/aapl) for earnings details\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion &amp; Fundamentals Friday Jun 12, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/h7gmt0/rstocks_daily_discussion_fundamentals_friday_jun/",
        "created": 1591978020.0
    },
    {
        "author": "taco_steak",
        "created_utc": 1591210893,
        "id": "gw0719",
        "num_comments": 321,
        "num_crossposts": 0,
        "selftext": "There is a hidden gem that is trading on the Canadian stock exchange. That is WildBrain. The stock symbol is WILD or WLDBF( OTC). They have the largest content library for kids. They are partnering with Netflix, Amazon Prime, Apple TV+, Tencent, Alibaba,... They are one of the largest kid content producer on YouTube. Their channels are generating about 10bil views per quarter. They are making about $430mil a year, generating positive EBITDA and cash flow. They also produce Peanut movie for Apple TV+. Check them out.\n\n[presentation ](https://content.wildbrain.com/uploads/2020/05/Wildbrain-IR-Full-Deck_Q3-2020_Final_may-20-20-2.pdf)\n\n[small cap stock pitch](https://www.webcaster4.com/Player/Index?webcastId=33296&amp;g=e35b9ca4-9e39-430e-8d05-39316fd193ea&amp;uid=3672023&amp;sid=)",
        "subreddit": "CanadianInvestor",
        "title": "If you love GNUS, you must love WILD even more",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/gw0719/if_you_love_gnus_you_must_love_wild_even_more/",
        "created": 1591239693.0
    },
    {
        "author": "yukinara",
        "created_utc": 1592249940,
        "id": "h9n8zp",
        "num_comments": 318,
        "num_crossposts": 0,
        "selftext": "I'm not trying to pass as a genius or savvy investor at all but most of my positions have been up. I started investing in mid June 2016 and there was a time I dipped into 3x leveraged ETFs like JNUG hoping to make quick bucks. I failed a lost a bit of money (about $3000). Back then I read charts like crazy, trying to predict the trend, looking to the Fed minutes, etc. Guess what? One day I was sure that my positions would go up and when the Fed released their statement, it went down.\n\nI was sick of it. In the very beginning, I invested in AMD, NVIDIA, APPLE, and TWITTER. During all that time I toiled over fundamentals, charts, etc, those stocks steadily climbed. I realized had I not trying to get rich quick, I would be in far better position with those simple blue chip stocks. \n\nSo I changed the way I invest.\n\nI stopped paying too much attention to the news. I stopped reading annual reports, I don't care what the fundamentals are, I wouldn't give a damn if a apocalypse hit tomorrow. Candlesticks, earning, financial statements are all meaningless.\n\nI buy and DCA everything. Every paycheck I set aside a certain amount and put into stocks and ETF\n\nThis is my current portfolio\n\nAMD, NVDA, APPL, MSFT, VOO, VTI, SPY, SCHG, VGT, XLK, FINX, QQQ, QTEC, FTEC, ESPO, SMH, MGK.\n\nIf you think \"ha, this idiot actually bought SPY and VOO, they are the same shit\"\n\nYes, that's why I admitted I'm an idiot. Perhaps a lucky idiot. The only stock that I lost money is SQ. I bought it at all time high in 2018 and the stock went nearly sideway in 2019 so I sold it at a loss of $200 and invested that money into something else. All of my positions have been going up.\n\nSometimes I tried to dabble into options trading after seeing mad gains from wallstreetbet. \n\nThe main problem: again, I'm an idiot. A happy idiot in fact. No matter how much I read/watch YT videos, I don't understand theta, delta, exercise, short leg, long leg, time value, intrinsic value, strike price. Ok, I do understand the definitions but I don't know how they can connect to each other to make me money. \n\nSo I dropped option trading completely, not even attempt to do anything about it\n\nMy portfolio hit all time low on March 20 at -17.33%, today it hit all time high at 18%. It climbed about 40% for the past 3 months\n\nAll due to DCA. I steadily put money into stock every 2 weeks. I don't care if the market hit all time high or all time low, I buy. When RH crashed and everyone freaked out, it didn't affect me one bit. \n\nWhen I read the story about that guy who took his life over 700k loss, I realize it could be me had I not learn anything from the early $3000 loss. I don't do well with stress. I want to go home after work at night, check my stocks for 5 minutes, eat something, fap, and go to bed. I don't ever want to stress out every minutes of my life over things I can't control: the market.\n\nI don't try to give anyone advice because I'm still a learner. All I ever do is to expand my portfolio and put some more money every paycheck.\n\nBut before you buy any book or subscribe to any stock-picking or teaching service, do you realize that stocks picked by a monkey can beat the market?\n\nhttps://www.forbes.com/sites/rickferri/2012/12/20/any-monkey-can-beat-the-market/#324cef35630a\n\nhttps://www.stockinvestor.com/35446/beating-market-surprise-surprise-monkeys-win/\n\nI wouldn't waste money in any of that. Every penny I'm not putting into stock is a penny I loss from profit.\n\n**tl;dr**: an idiot made money by DCA into ETFs and blue chip stocks after failing basic math.",
        "subreddit": "stocks",
        "title": "I'm happy to admit that I'm a total idiot",
        "url": "https://www.reddit.com/r/stocks/comments/h9n8zp/im_happy_to_admit_that_im_a_total_idiot/",
        "created": 1592278740.0
    },
    {
        "author": "DrainBramage",
        "created_utc": 1593265362,
        "id": "hgtpu0",
        "num_comments": 318,
        "num_crossposts": 0,
        "selftext": "Nike missed analysts (COVID-revised) expectations significantly as one of the first major companies to report earnings for Q2+ \n\nThis “miss” caught headlines, but folks are attributing the drop in the market to the rise in COVID cases. I think Nike’s miss is the bigger headline. I expect Apple to have a huge miss on Q2 earnings, given 60% of their revenue comes from iPhone sales. With most retailer stores that sell iPhones closed in Q2, coupled with the significantly longer upgrade cycles (folks just don’t need a phone every 12 months), I think this will send the market down.",
        "subreddit": "wallstreetbets",
        "title": "Nike’s miss = Troubles ahead...",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hgtpu0/nikes_miss_troubles_ahead/",
        "created": 1593294162.0
    },
    {
        "author": "dramaticdan",
        "created_utc": 1592686178,
        "id": "hctisc",
        "num_comments": 307,
        "num_crossposts": 0,
        "selftext": "It’s apparent to me, maybe exclusively, that the shutdown didn’t flatten the curve but paused the growth. [Here’s NYTimes’ tracker](https://www.nytimes.com/interactive/2020/us/coronavirus-us-cases.html). \n\nMarket goes down 1.5% when Apple closes **only 10 of its 271 American stores**, or maybe it was because of quad witching. Who knows. \n\nWhat event are we looking for? Trump getting corona, 10 states going up in corona, unemployment ending in July, new trade war?\n\n[Free money to everyone that looks at this graph](https://imgur.com/gallery/Z9VWmYl)",
        "subreddit": "wallstreetbets",
        "title": "What’s it going to take to scare the market down?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hctisc/whats_it_going_to_take_to_scare_the_market_down/",
        "created": 1592714978.0
    },
    {
        "author": "oneofthephams",
        "created_utc": 1591751801,
        "id": "h00ues",
        "num_comments": 289,
        "num_crossposts": 5,
        "selftext": "This is NOT DD but more so my speculation from scouring the internet and what I have discovered. **Interpret it as you'd like.** (This is also my first Reddit post, so please don't be too harsh)\n\nFor those that have performed DD, you know CEO Ted Murphy has been counting down to Friday, with the first mysterious message this past Sunday. These cryptic posts can be found on IZEA's Twitter and Instagram. Each message has had lyrics to Harry Belafonte's calypso song, *Jump in the Line (Shake, Senora)*.\n\n([Twitter](https://twitter.com/izea) \\---- AND ------ [Instagram](https://www.instagram.com/izea/))\n\nAdditionally, with each message there has been a PR directly from IZEA or some sort of news:\n\n(Sunday:  [Zacks upgraded IZEA from Hold to STRONG-BUY](https://zolmax.com/investing/izea-worldwide-nasdaqizea-upgraded-to-strong-buy-at-zacks-investment-research/4246644.html))\n\nMonday: PR from IZEA  [Announces NEW Fortune 500 Customer](http://www.globenewswire.com/news-release/2020/06/08/2045140/0/en/IZEA-Announces-New-Fortune-500-Customer.html)\n\nTuesday: PR from IZEA  [Announces New Contracts with TWO Fortune 500 Retailers](http://www.globenewswire.com/news-release/2020/06/09/2045887/0/en/IZEA-Awarded-New-Contracts-by-Two-Fortune-500-Retailers.html)\n\nSO what is IZEA announcing Friday? Maybe revealing the *NEW* Fortune 500 customer. Maybe revealing the two Retailers that renewed contracts with IZEA, one of them a **Fortune 10** customer.\n\n[Current FORTUNE 10](https://preview.redd.it/83vzg0hu2z351.png?width=639&amp;format=png&amp;auto=webp&amp;s=3d5904999c04eb786904c21c5a6e3626e79288c1)\n\nOn IZEA's [Customers landing page](https://izea.com/managed-services/our-customers/), Wal-Mart is (technically) the only current Fortune 10 company that previously has had a contract with IZEA. \n\nhttps://preview.redd.it/pn2v0ffy2z351.png?width=995&amp;format=png&amp;auto=webp&amp;s=471d7a737bf9826697169060a5e62a1baa2473ec\n\nHowever, we know that [Twitch and IZEA are already in bed together](https://izea.com/influencer-marketing/twitch/). And who owns Twitch? Yep, you guessed it...AMAZON. Could Amazon indirectly be the Fortune 10 customer because they own Twitch? Maybe. But Twitch is not on the above Customer's page which was surprising to me.\n\nThis brings me to the Jump in Line lyrics that have been used as captions on each of the Social Media posts so far. The song has had appearances in:\n\n1. [The Little Mermaid](https://youtu.be/5p6DUZUFC7E)\n2. [Beetlejuice](https://youtu.be/QooqZkNk8Bw)\n3. Even [Pitbull and T-Pain made their own version](https://www.youtube.com/watch?v=AmuKdoe8MvI) (screenshot of lyrics below so you don't have to listen to the song....)\n4. Steve Wozniak\n\n&amp;#x200B;\n\n[Shake Senora lyrics](https://preview.redd.it/xqspo4956z351.png?width=379&amp;format=png&amp;auto=webp&amp;s=ef15c6818331ec2f9202fd9113c19884e95cef71)\n\n&amp;#x200B;\n\n**The Little Mermaid**: Disney is currently ranked 53rd in the Fortune 500. That eliminates them from being the Fortune 10 customer. Have they had a previous contract with IZEA? I couldn't find anything publicly but did confirm [the CEO has consulted with Disney before](https://izea.com/company/leadership/ted-murphy/).\n\n* [IZEA HQ is in Orlando, a short drive from Disney World](https://izea.com/contact-us/orlando/) (Keep in mind that Walt Disney Co. is technically HQed in Burbank, CA)\n* A Live-action remake of the Little Mermaid, originally announced back in 2016, was originally scheduled to begin production in April 2020. Then COVID happened. [Filming is now expected to begin as early as JULY 2020](https://en.wikipedia.org/wiki/The_Little_Mermaid_(franchise)#Live-action_remake) \n* [They have finished recording all the music for the film](https://thedisinsider.com/2020/04/17/first-look-at-prince-erics-castle-for-the-live-action-the-little-mermaid/) \n\n**Beetlejuice**\n\n* Distributed by Warner Bros. A sequel has been shelved as of April 2019.\n* One of the most memorable appearances of this song was in Beetlejuice during the climax of the movie.\n* Warner Music Group ($WMG) - On June 3, WMG officially had its second IPO on Nasdaq (went private in 2011), raising $2 billion with a valuation of $12.75 bilion.\n* Could there be some connection to WMG? Unlikely, since Harry Belafonte released all his albums with RCA Victor which is owned by Sony Music. With no sequel in the works and Sony owning rights to Belafonte's albums, it's hard to find a connection there.\n\n**T-Pain**\n\n* In a \"random\" social media post today, IZEA gave a shoutout to a past marketing campaign for  [Target and Trident Gum](https://www.instagram.com/p/CBN8qj5h0OB/) \n* I reached out to the users tagged on this post to find out how recent the campaign happened but received no responses.\n* HOWEVER, this past February, T-Pain had a pop-up performance in Chicago to unveil his partnership with Trident Gum and drive awareness to their new product Trident VIBES gum.\n* Yes, T-Pain was featured in Pitbull's rendition of Shake Senora, AND partnered with Trident Gum for this recent marketing campaign that IZEA spotlighted on its social media accounts TODAY.\n   * \"The campaign produced 41 pieces of content, 295k+ social interactions, and an engagement rate of 10.32% 🎯 Instagram stories drove 11x more click through traffic to the coupon redemption page than Instagram photos in this campaign\"\n*  [Trident's IG post revealing T-Pain partnership](https://www.instagram.com/p/B9Xio9NhifB/) \n* This still seems like a stretch to me, but Target is actually on IZEA's customer's page (link above), right next to Wal-Mart....\n* **Apple**\n* This one seems furthest from likely, but I wanted to include all my findings.\n* In 2009, in season 8 of Dancing with the Stars, Steve Wozniak danced a Samba to this song.\n* It was terrible lol. He got a 10 out of 30, the second lowest score in the history of the show. \"It was the only dance that got 3s or less and was not the celebrity's final dance.\"\n* Steve Wozniak co-founded Apple with Steve Jobs and AAPL, as you know, is #4 in the FORTUNE 10.\n\n&amp;#x200B;\n\nSo, this leaves us with the perpetual question:\n\n# What does it all mean? \n\nWell, I don't fucking know. But let us commence this Discussion. Share your feedback. Share your own thoughts that might connect some dots I didn't. Hell, maybe it'll become a megathread by Friday's announcement. I will add on as I make new discoveries. Bless everyone that is along for the ride! And cheers to all who may profit from IZEA.\n\n \n\nOP's Investments into IZEA:\n\nCurrently, here is my investment.\n\nhttps://preview.redd.it/xpgo5cuihz351.png?width=646&amp;format=png&amp;auto=webp&amp;s=5ed3fa6bb775b22f4688b1fc4bea900864dc03e0\n\nLast month, I had owned 5,547 shares at an avg price of 0.6199. \n\nhttps://preview.redd.it/18tqh3tmgz351.png?width=701&amp;format=png&amp;auto=webp&amp;s=9221064dfc0547716cfa2d4f850cf576bb0f86f1\n\nWith weak hands, I regrettably sold for a loss to put that equity elsewhere.\n\nhttps://preview.redd.it/rbrnongogz351.png?width=704&amp;format=png&amp;auto=webp&amp;s=9c2e106b100f12a4e8244f1dfcb491f451d1d2c1",
        "subreddit": "pennystocks",
        "title": "My Predictions for IZEA's Friday Announcement",
        "url": "https://www.reddit.com/r/pennystocks/comments/h00ues/my_predictions_for_izeas_friday_announcement/",
        "created": 1591780601.0
    },
    {
        "author": "whatatimetobealive22",
        "created_utc": 1593380006,
        "id": "hhmxqu",
        "num_comments": 274,
        "num_crossposts": 1,
        "selftext": "This phrase \"dont fight the fed\" has gained major popularity, you even got your wive's boyfriend saying it by now. yeah thats all fine and dandy but, how long can the fed keep pumping this shit. just last week  we've confirmed that there will be a second wave. Theres no ifs or buts, its confirmed. so what does that entail.  \n\n\nWell, for starters, the pent up demand is going to remain pent up. Mays numbers had given hopes to everyone that this was all over, that the rona was done for and everything will return to normal quicker than what people thought. Well... WRONG. Nothing is normal, and the market made a terrific bounce from the march lows without such a terrific bounce in the economy.  \n\n\nListen you autist dipshits, SOMETHING IS VERY WRONG HERE. There is a major restructuring of the economy happening right now that hasnt happend since the Great Depression. The service sector is taking a major major hit right now and the future is unclear on how were going to come out of it on the other side.\n\nGDP is 70% consumer spending. this is made up of two things, goods and services. Goods account for 25% of GDP and Services account for 45% of GDP. ([https://www.thebalance.com/components-of-gdp-explanation-formula-and-chart-3306015#:\\~:text=The%20four%20components%20of%20gross,economic%20output%20for%20each%20year.](https://www.thebalance.com/components-of-gdp-explanation-formula-and-chart-3306015#:~:text=The%20four%20components%20of%20gross,economic%20output%20for%20each%20year.))  \n\n\nNow lets be special little autists and put the pieces together. Nikes earning report were worse than expected by quite a lot actually, a whole 38%. what does that mean? well that people arent spending their cash, theyre saving, youve seen the charts. well, there goes the feds stimulus and unemplyment insurance. On top of that, as we all know, the service sector is as FUK as as my puts placed on march 24th. to reiterate to you illiterate bitch ass cock gobling autists, nobody is dining out, nobody is traveling, and nobody in casinos or hotels. rip bars and clubs.  \n\n\nThis is not all, which type of businesses has this whole thing hurt the most? well none other than your uncles small business. your uncles business is among the many that make up 45% of this economy's GDP.([https://www.jpmorganchase.com/corporate/institute/small-business-economic.htm#:\\~:text=Small%20businesses%20accounted%20for%2045,percent%20in%20the%20late%201990s.&amp;text=48%20percent%20of%20all%20US,percent%20in%20the%20early%202000s.](https://www.jpmorganchase.com/corporate/institute/small-business-economic.htm#:~:text=Small%20businesses%20accounted%20for%2045,percent%20in%20the%20late%201990s.&amp;text=48%20percent%20of%20all%20US,percent%20in%20the%20early%202000s.))\n\n Now you inpubesant bull, if even some of the big dogs in businesses are at the brink of bankruptcies, what does that mean for these small businesses? are they going to weather this thing like the likes of apple or microsoft or google? um \\*nervous laughter\\* proboblay not. at least half will close permanently.\n\nSo if 70% of GDP is FUK. the markets right now are in fairyland. straight up rosy sprinkled and evrything.\n\nThere is major uncertainty right now and this will remain for the foreseeable future. Listen, im pretty sure these earning reports are going to be worse than expected, we are half way til we see Q2 numbers for the year and things are looking gloomy. and yet somehow the markets are very close to being at all time highs with a few companies surpassing their ATHs. Tell me, are these companies better off since feb of this year, are the forecasts looking exceptional for growth? um i dont think so you autist peanut.  \n\n\nThere is a major disconnect with the markets and whats going on in the economy. MAJOR. sit back and reflect like the special autist you are. Something is wrong here, very wrong. The fastest 30% drop in history followed by the fastest 46% gain? what kinda bullshit is this? this would make sense if there was a terrorist attack and we've recovered from it, but this whole thing is not over yet as confirmed with the second wave. \n\nThe damage already done is so immense. So immense that the fed nearly doubled it balance sheet in less than a year compared to all of modern history. All of that and this is still not over.. oh no its far from over. the single biggest cases for CV happened 2 DAYS GO. TWO!! IN LATE JUNE! not even september, let alone october and novenmber. rip. sorry guys but in two weeks the CV deaths will begin to rise again. economy is FUK.\n\nMajor Major solvency issue going on here. Can the FED save all these businesses from going bankrupt?? Can the fed keep increasing their balance sheet by a Trilllion dollars every single month till everything returns to normal by august 2021?? That my good sir is at least 12 trillion dollars more. Will the almighty fed increase their their holy balance sheet to 20 trillion dollars?? WILL THEY??? Will the fed convince people to spend despite masses dying!?? Despite all these people \"furloughed\"? Can the fed return the unemplyment rate to less than 8%?????????  \n\n\nIm no financial analyst, but all these indicators are not ingredients for a booming or thriving economy, especially none that should make stock values to exceed ATHs. I hope im wrong, but its really hard to pretend everythings ok right now.",
        "subreddit": "wallstreetbets",
        "title": "Lets be rational autists and think about this whole thing for sec",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hhmxqu/lets_be_rational_autists_and_think_about_this/",
        "created": 1593408806.0
    },
    {
        "author": "ZeatLohh",
        "created_utc": 1592072025,
        "id": "h8ckbp",
        "num_comments": 268,
        "num_crossposts": 0,
        "selftext": "Hey all.\n\nI’ve been doing pennytrading for a decent period of time now, but decided recently that I would like to dedicate most of my portfolio to long term stocks and only use a small portion of buying power for fooling around with pennies. \n\nWith that said, what are your picks for the best stocks to get into for the long haul.. I would love all suggestions, from the safest picks to the picks that have the most potential to explode over the years. \n\nAs of now, I am thinking about just getting some Microsoft or Apple, but want some more diversity!\n\nThanks all, and good luck!",
        "subreddit": "stocks",
        "title": "Best stocks to hold for 5+ years?",
        "url": "https://www.reddit.com/r/stocks/comments/h8ckbp/best_stocks_to_hold_for_5_years/",
        "created": 1592100825.0
    },
    {
        "author": "ZloiAris",
        "created_utc": 1592852770,
        "id": "hdyke6",
        "num_comments": 247,
        "num_crossposts": 0,
        "selftext": "Any reasonable explanation why loosing of one of the biggest INTC clients lead to price going up?",
        "subreddit": "stocks",
        "title": "The moment AAPL announced ending partnership with INTC, INTC stock price ... JUMPED by 1%",
        "url": "https://www.reddit.com/r/stocks/comments/hdyke6/the_moment_aapl_announced_ending_partnership_with/",
        "created": 1592881570.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1592554038,
        "id": "hbwrf1",
        "num_comments": 203,
        "num_crossposts": 0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme and/or [post your arguments against fundamentals here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nMost fundamentals are updated every 3 months due to the fact that corporations release earnings reports every quarter, so traders are always speculating at what those earnings will say, and investors may change the size of their holdings based on those reports.  Expect a lot of volatility around earnings, but it usually doesn't matter if you're holding long term, but keep in mind the importance of earnings reports because a trend of declining earnings or a decline in some other fundamental will drive the stock down over the long term as well.\n\nSee the following word cloud and click through for the wiki:\n\n[Market Cap - Shares Outstanding - Volume - Dividend - EPS - P/E Ratio - EPS Q/Q - PEG - Sales Q/Q - Return on Assets (ROA) - Return on Equity (ROE) - BETA - SMA - quarterly earnings](https://www.reddit.com/r/stocks/wiki/fundamentals-themed-post)\n\nIf you have a basic question, for example \"what is EBITDA,\" then google \"investopedia EBITDA\" and click the Investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nUseful links:\n\n* [Investopedia Tuturiol](https://www.investopedia.com/university/all/fundamental-analysis/) on fundamental analysis including [Discounted Cash Flow](https://www.investopedia.com/university/dcf/) analysis; see [definition here](https://www.investopedia.com/terms/d/dcf.asp)\n* [FINVIZ](https://finviz.com/quote.ashx?t=aapl) for fundamental data, charts, and aggregated news\n* [Earnings Whisper](https://www.earningswhispers.com/stocks/aapl) for earnings details\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion &amp; Fundamentals Friday Jun 19, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/hbwrf1/rstocks_daily_discussion_fundamentals_friday_jun/",
        "created": 1592582838.0
    },
    {
        "author": "hibbjibbity",
        "created_utc": 1591628620,
        "id": "gz0yxj",
        "num_comments": 176,
        "num_crossposts": 0,
        "selftext": "Just sold my shares of CCL, PENN, and DKNG. More then doubled my money on all of them. \n \nMy only position left is MGM. \n\nI know very little about the stock market I got into it 2 months ago bc a friend said I could make money since most stocks crashed. Now I have no idea where to go from here as my initial strategy was to profit off of stocks wrecked by corona virus. I feel like I know nothing about what to invest in now or what is a good value as the market seems to be back to normal. \n\nIt seems as if I should dump all the money into MIcrosoft, Apple, etc. any advice is appreciated",
        "subreddit": "stocks",
        "title": "Sold",
        "url": "https://www.reddit.com/r/stocks/comments/gz0yxj/sold/",
        "created": 1591657420.0
    },
    {
        "author": "notbrokemexican",
        "created_utc": 1593424417,
        "id": "hhx2ax",
        "num_comments": 168,
        "num_crossposts": 0,
        "selftext": "# # The Basic Idea\n\nI'm building a portfolio that revolves around developing a post-covid world. The overarching theme behind these picks American Innovation &amp; Mexican Development. I'm 26 years old and hold a strong conviction that investing in Mexican development will reward me in the decades to come. I'm a software engineer in the US &amp; an avocado farmer in Mexico.\n\nYou may see that I avoid some industries in important sectors. These arenas, if compelling enough, would likely be subscribed to a weak ETF that gets contributed to lightly. For example, an oncology ETF if Joe Biden wins the presidency in 2020.\n\n&amp;#x200B;\n\n# # Basic Rules \n\nI generally try to exercise these rules and concepts in my framework\n\n* Applications of common sense\n* Applications of game theory\n* Modesty in asset allocation over aggression\n\n&amp;#x200B;\n\n# # The Practice\n\nI have multiple sets of investments using\n\n\\- Primary assets (12) which receive the priority allocation of assets\n\n\\- Secondaries that may be exchanged into the Primary asset group if compelling enough (6x)\n\n&amp;#x200B;\n\nFor example, I will have an **Augmented Reality Group** composed of\n\n1. **Facebook (Primary)**\n2. \\[Nintendo, Disney, Apple, Adobe\\]\n\n&amp;#x200B;\n\n# # Asset Group Breakdown \n\n* Augmented Reality\n* Machine Learning\n* Financial Access\n* Semiconductors\n* Cloud Infrastructure\n* Cloud Services\n* Network Infrastructure\n* Power Systems\n* Industry\n* Industrial Robotics\n* Consumer Supply\n* ETF Diversification &amp; Asset Amplification\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # Primary Assets \n\n*  Facebook \\[Augmented Reality\\]\n*  Microsoft \\[Machine Learning\\]\n*  Paypal \\[Financial Access\\]\n*  Texas Instruments \\[Semiconductors\\]\n*  Cloudflare \\[Cloud Infrastructure\\]\n*  DocuSign \\[Cloud Services\\]\n*  Crown Castle International \\[Network Infrastructure\\]\n*  Panasonic \\[Power Systems\\]\n*  Kansas City Union \\[Industry\\]\n*  FANUC \\[Industrial Robotics\\]\n*  Costco \\[Consumer Supply\\]\n*  SPY \\[ETF Diversification &amp; Asset Amplication\\]\n*  SPCE \\[Monkey Capitalist Casino\\]\n\n&amp;#x200B;\n\n# # Augmented Reality Group\n\n1. **Facebook**\n\n*    Adobe\n*    Apple\n*    Nintendo\n*    Disney\n\n&amp;#x200B;\n\n*The gist*\n\nThe Augmented Reality Group are companies with a vested interest in AR products and sufficient power for cultural impacts. \n\n&amp;#x200B;\n\n# # Machine Learning Group\n\n1. **Microsoft**\n\n*   Google\n*   Tesla\n\n&amp;#x200B;\n\n*The gist*\n\nThe Machine Learning Group are organizations that are ML advantaged. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # Financial Access Group\n\n1.  **Paypal**\n\n*    Square\n*    Visa\n\n&amp;#x200B;\n\n*The gist*\n\nThe Financial Access group focuses on modernizing accessibility to financial instruments.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # Semiconductors Group\n\n1.  **Texas** **Instruments**\n\n*   AMD\n*   Nvidia\n\n&amp;#x200B;\n\n*The gist*\n\nThe Semiconductors Group focuses on the access to technology and computing. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # Cloud Infrastructure Group \n\n1.  **Cloudflare**\n\n*   Fastly \n*   Z-Scaler\n*   Akamai\n\n&amp;#x200B;\n\n*The gist*\n\nThe Cloud Infrastructure Group focuses on stabilizing high quality advancements in computing.\n\n&amp;#x200B;\n\n# # Cloud Services Group\n\n1. **DocuSign**\n\n*   Twitter\n*   Chegg\n*   Dropbox\n*   Lyft\n*   1Life Medical\n*   Snapchat\n*   Salesforce\n*   Upwork\n*   Autodesk\n*   Twilio\n\n&amp;#x200B;\n\n*The gist*\n\nThe Cloud Services Group are inelastic cloud computing or service distribution.\n\n&amp;#x200B;\n\n# # Network Infrastructure Group\n\n1.  **Crown Castle International**\n\n*   T-Mobile\n*   America Movil\n\n&amp;#x200B;\n\n*The gist*\n\nThe Network Infrastructure Group focuses on the expansion of telecommunications across the US and Mexico. \n\n&amp;#x200B;\n\n# # Power Systems Group \n\n1. **Panasonic**\n\n*   Vestas\n*   Plug Power\n*   Siemens\n\n&amp;#x200B;\n\n*The gist*\n\nThe Power Systems Group focuses on the growth of alternative energy systems.\n\n&amp;#x200B;\n\n# # Industry Group\n\n1.  **Kansas City Southern Rail**\n\n*    Berkshire.B\n*    XLB Materials ETF\n\n&amp;#x200B;\n\n*The gist*\n\nThe Industry Group works on material development of US and Mexico. \n\n&amp;#x200B;\n\n# # Industrial Robotics Group  \n\n1. **FANUC**\n\n*   ABB\n*   Rockwell Automation\n\n&amp;#x200B;\n\n*The gist*\n\nThe Industrial Robotics group focuses on the increasing automation of labor.\n\n&amp;#x200B;\n\n# # Consumer Supply Group \n\n1.  **Costco**\n\n*   Amazon\n*   Shopify\n\n&amp;#x200B;\n\n*The gist*\n\nThe Consumer Supply has a similar focuses on customer satisfaction during purchase time.\n\n&amp;#x200B;\n\n# # ETF Diversification &amp; Asset Amplification \n\n1. **SPY**\n\n*   EWW Mexico ETF\n*   FIVG 5g \n*   IPO Startup \n*   WCLD Cloud \n*   ESPO Gaming\n*   CIBR Cybersecurity \n*   HACK Cybersecurity \n*   TPAY Financials\n*   ARKF Financial Technology\n*   IPAY Financial Services\n*   DFNL Banking Services\n*   SOXX Semiconductors\n*   IYT Railroad \n*   POTX Cannabis \n*   BOTZ Automation \n\n&amp;#x200B;\n\n*The gist*\n\nThe ETF &amp; Asset Amplification is a group of industries I would like to factor uncertainties for or better capture. \n\n&amp;#x200B;\n\n# # Monkey Capitalist Casino \n\n1.  **SPCE**\n\n*   DKNG\n*   Dennys\n\n&amp;#x200B;\n\n*The gist*\n\nDennys is a logistic stock that represents the American Trucking Economy. All of these stocks are sinful and this is the space I allow my monkey biases to come out.\n\n  \n\n&amp;#x200B;\n\nInvestment explanations in V2 Draft",
        "subreddit": "investing",
        "title": "My Covid Portfolio Restructure - Mexican-American Stock Meta",
        "url": "https://www.reddit.com/r/investing/comments/hhx2ax/my_covid_portfolio_restructure_mexicanamerican/",
        "created": 1593453217.0
    },
    {
        "author": "sleeping_in_",
        "created_utc": 1592559157,
        "id": "hbxoq7",
        "num_comments": 140,
        "num_crossposts": 0,
        "selftext": "\\- All companies are being forced onto the cloud and office 365 with \"work from home\"\n\n\\- Xbox revenue is through the roof as people need entertainment at home\n\n\\- Surface products are competing with Apple now and again benefit people to \"work from home\"\n\n\\- Windows is still widely used and supported by creative professionals in Adobe, engineering professionals in Autodesk and all of coding software (C sharp, Python etc).\n\n&amp;#x200B;\n\nTell me why MSFT isn't the greatest stock to own right now.",
        "subreddit": "stocks",
        "title": "Tell me why MSFT isn't the greatest stock to own right now.",
        "url": "https://www.reddit.com/r/stocks/comments/hbxoq7/tell_me_why_msft_isnt_the_greatest_stock_to_own/",
        "created": 1592587957.0
    },
    {
        "author": "sleepysol",
        "created_utc": 1592655214,
        "id": "hclbrj",
        "num_comments": 130,
        "num_crossposts": 0,
        "selftext": "There is an imbecile in another post on WSB who's struggles to put his diaper on in the morning who's attempting to give shit investment advice about how Florida will need to shut down. In an effort to justify his mom's hard fought public school education that he got he attempted to use big nickel words and graphs to show Arizona and Florida are in a doomsday pact with their residents and they're all going to need to lockdown again, or everyone is going to die. As the title suggests I watched the press conference yesterday by Gov Destanis so you don't have to, and am here to give the corrected information about what's going on in the nations best run state. \n\nFirst, one thing to understand about Florida is due to the constant hurricane issues and the large old people population they have had the most detailed data and fastest reporting data in the nation. The governor does not get up on stage with a crap PowerPoint every day and have no actual color to add to everything, instead they have very granular data which cuts through the polical nonsense.  All data referenced in this post will be in the imgur link at the end. \n\nSecond all their elder care facilities are still on high alert and locked down. These have not reported and travel into and out of them are still very limited and carefully monitored.  All PPD is directed towards the elder care facilities, with hospitals getting the over run. \n\nOkay now onto the data. Yesterday Gov Destatis had a 1 hour+ press conference were he said where the state was at and where it was heading too. I doubt anyone from this sub watched it as it started about 10 minutes after apple decided to tank the market by announcing they were closing 8 stores. \n \nIn this press conference he first discussed why the number of infected was increasing. (Chart 1) he showed that all the new cases are from people who are under the age of 40. Which for 99.6% of all people will not result in death but at worse will be a bad flu. Further he went on to state that nation wide the only 2 people have died under the age of 30 who didn't have huge co-morbidities before they got Covid. Basically if you are healthy today and catch it you will be fine. \n\nHe breaks the new infection numbers down even further in chart 4 if you wanted to look at age split.\n\nHe backs his claim about younger people not being at risk with Chart 2 showing how the death rate is doing a nose dive. If they were actually at risk of death and were dying we would see it.  Additionally, he said they aren't going into hospitals either, as there are more available beds now in June than there were at any point between now and March 1st.\n\nSo this is a crap investment group so I should post on what this means for the market. Here's the brass tax, young people getting infected is a really good thing. The world has seen at least 6 major Covid related massive illnesses that they've attempted to develop a vaccine for. Do you want to know how many were successful? ZERO. There will not be a vaccine for covid-19 either as it mutates too fast. There is only one way out of this, herd immunity. The faster young heathy people get infected and become immune the faster we can attempt to go back to normal.  Any doctor on TV telling you anything else is lying to you. Also remember, our grandparents lived through a great depression 3 pandemics and 2 world wars and kept on trucking. We can make it through this.\n\nLong story short, invest in America buy quality long positions and enjoy the ride. Also fuck idiots telling you the world is going to end. \n\nFlorida data: Florida data https://imgur.com/a/JfoZM1o",
        "subreddit": "wallstreetbets",
        "title": "I watch the press conference so you don't have to: Why Florida will not be shutting down",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hclbrj/i_watch_the_press_conference_so_you_dont_have_to/",
        "created": 1592684014.0
    },
    {
        "author": "dude-bro-man-dude",
        "created_utc": 1591283294,
        "id": "gwj8gj",
        "num_comments": 127,
        "num_crossposts": 0,
        "selftext": "If you're reminiscing on a bad trade, just remember in 1976 Ronald Wayne sold his 10% stake in Apple for $800. In August 2018, Apple shares hit a historic $1 trillion market cap value, becoming the first publicly traded U.S. company to ever reach the milestone. Wayne’s 10% stake would have been more than $95 Billion. Shit happens.",
        "subreddit": "wallstreetbets",
        "title": "Ronald Wayne",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gwj8gj/ronald_wayne/",
        "created": 1591312094.0
    },
    {
        "author": "baicunko",
        "created_utc": 1591709698,
        "id": "gzn94n",
        "num_comments": 114,
        "num_crossposts": 0,
        "selftext": " [https://www.bloomberg.com/news/articles/2020-06-09/apple-plans-to-announce-move-to-its-own-mac-chips-at-wwdc](https://www.bloomberg.com/news/articles/2020-06-09/apple-plans-to-announce-move-to-its-own-mac-chips-at-wwdc)\n\nTL:DR Apple will switch from x86 Intel Processors to ARM based meaning \\~10% of Intel Revenue in a bonfire.\n\nINTC $60p 17/07",
        "subreddit": "wallstreetbets",
        "title": "Apple drops Intel CPU. Puts on INTC",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gzn94n/apple_drops_intel_cpu_puts_on_intc/",
        "created": 1591738498.0
    },
    {
        "author": "encapsulated1",
        "created_utc": 1591994830,
        "id": "h7sszv",
        "num_comments": 108,
        "num_crossposts": 0,
        "selftext": "Woke up today with most my tendies gone from yesterday.\n\n35k -&gt; 90k from riding the wave a little bit today, thought the market was gonna full reverse at 3 so I bought these at 3, was correct until 3:30.\n\nHad a meeting at 3:00 so was unable to ride the last hour. Now holding these over the weekend.\n\nIt's no longer fomo, its yolo. This is my entire net worth. Moved 10k to cash so I can finally pay my landlord.\n\nhttps://preview.redd.it/pvkt4bkfkj451.jpg?width=946&amp;format=pjpg&amp;auto=webp&amp;s=d627ad19f4f7a6cffc8eb23cfaca30a6d6278920\n\nTo all the haters out there, if it is so easy, then why don't everyone just buy AAPL Calls. :D",
        "subreddit": "wallstreetbets",
        "title": "80K AAPL YOLO 6/26 320P",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/h7sszv/80k_aapl_yolo_626_320p/",
        "created": 1592023630.0
    },
    {
        "author": "YesImActuallyRich",
        "created_utc": 1592597561,
        "id": "hc7vbw",
        "num_comments": 108,
        "num_crossposts": 0,
        "selftext": "* \"you only lose if you sell\"\n* \"this is a great company with a great product, they will be at $10 soon!\"\n* \"I was bought at .80 and rode it to $5, and now it's back down to .80 and I didn't sell!\"\n* \"XSPA *this*, IDEX *that*, GNUS *to the moon\"*\n\nI could go on. Anyone who is reading this and is offended, I'm talking to you. You've got a lot to learn.\n\nTraders who actually have experience playing the markets are shitting on you. Literally, dumping on you.\n\nWhile you are busy buying **at the very fucking peak of a run** because you can't control your FOMO, other experienced traders are unloading their shares on you and walking away with nice profits.\n\nMeanwhile, you are stuck with a pump and dump stock, a negative balance (that is only getting worse), and you're spamming these subreddits with \"i tHiNkk thIs is A GReat cOmPanY wItH Real poTenTenEntial. YoU gUyS R miSsInG oUt On Huge GaiNZ!!\" because you can't grasp the reality of your situation. You fucked up.\n\n**We are trading penny stocks. not fucking Apple and Amazon**. Why are you treating these worthless penny stocks like long term investments?\n\nWITH THAT SAID...\n\n**I don't want to make this a worthless rant, so let me give some valuable pointers.**\n\n1. If you are up 5000% on a stock, take profits! If you feel like you will miss out on a bigger run, at least sell \\~50% of your position so that you at least have some profits secured **incase** it does get dumped.\n2. Stop buying **at the very peak of a run**. I know it can be difficult to know when the peak is, but that's why learning how to read price action and chart patterns are important. Where can you find this information? Google and YouTube, they're amazing resources of endless knowledge.\n3. Only trade with money you are willing to lose. When you are trading on the stock market, it's not a matter of IF you'll lose money, it's a matter of WHEN. Profitable traders know this, and that's why they set rules for themselves to govern their trading. What kind of rules? Stop losses (manual or automatic), profit targets, etc. Again, if you want to learn about setting rules for your trading, Google or YouTube it.\n\nThat's it.\n\nI'm saying all of this out of love.\n\nSeriously, when I first started trading years ago I lost a ton of money. And I see a lot of newbie's on this subreddit making the same mistakes that I was making.\n\nDo you really want to turn this into a long term game and change your life? Or do you just want to have fun and gamble?\n\nIf you want this to be long term. Study. Learn. Practice. If you are doing this to gamble, well then, the market welcome's your money and will happily take it.",
        "subreddit": "pennystocks",
        "title": "I keep seeing a lot of stupid shit posted on this subreddit, for example...",
        "url": "https://www.reddit.com/r/pennystocks/comments/hc7vbw/i_keep_seeing_a_lot_of_stupid_shit_posted_on_this/",
        "created": 1592626361.0
    },
    {
        "author": "notbrokemexican",
        "created_utc": 1592009346,
        "id": "h7x4l6",
        "num_comments": 104,
        "num_crossposts": 0,
        "selftext": "[https://preview.redd.it/d56i8543qk451.png?width=2192&amp;format=png&amp;auto=webp&amp;s=5696ee749fe79f6dd660c7e3b9c8d2ed39b8a8ee](https://preview.redd.it/d56i8543qk451.png?width=2192&amp;format=png&amp;auto=webp&amp;s=5696ee749fe79f6dd660c7e3b9c8d2ed39b8a8ee)\n\n[Cloudflare - Big Security](https://preview.redd.it/qvl409c9pk451.png?width=2018&amp;format=png&amp;auto=webp&amp;s=bc1334602948f2f82894dffee54fb2615ca0a220)\n\n# NET $40c 8/21\n\n# NET 35c 7/17\n\n# # WSBLearns Chapter 1 : An Introduction to the Cloud Computing Economy\n\n\\### Goals\n\n# - Answer \"What am I investing in when I risk money with CloudFlare?\"\n\n&amp;#x200B;\n\n# # My Motivation\n\nCloudFlare is releasing and bolstering support for streaming, video, and communications as a security-first cloud provider in the following week. This, on top of its rapidly growing developer platform, is consequential for many reasons as a market-mover in the industry. Theyre going to be printing a lot of money at a steady pace for a very long time and I thought you guys should know since you're all so desperate and pathetic right now for something good.\n\n&amp;#x200B;\n\n# # In Short\n\nCloudFlare so far has been shredding forward across multiple technical markets competing against by:\n\n&amp;#x200B;\n\n* Competing marketshare against CISCO, Palo Alto Networks, and other hardware customers\n* Offering a way to not lock your organization into a big tech vendor\n* Promoting security and challenging Big Tech's direction with web development\n* Forming positive relationships with Shopify, Facebook, JD, Twitter, Baidu, TOR, and Microsoft\n* Pioneering the ease-of-use privacy movement with [1.1.1.1](https://1.1.1.1) and distributing VPNs.\n* Growing a rapid, robust, cost-effective, and secure network across the world\n* *Providing a development platform that promotes the use extremely powerful and 'cutting edge' web computing.* \\-&gt; **YOU ARE HERE**\n\n&amp;#x200B;\n\n\\- Creating a better internet.\n\n&amp;#x200B;\n\n[This is the fucking Co-Founder of NPM who pioneered streaming technology en masse for developers.](https://preview.redd.it/zon44fsapk451.png?width=1204&amp;format=png&amp;auto=webp&amp;s=a1838127869af81ba9ff2fcaa50f4b8e2028af51)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # The Thesis\n\nThe economic value and convergence between e-commerce, global networking speeds, and video advancements is not anywhere close to realized. There has been an acceleration toward this reality but it's still early in the overall economic development cycle. This timeframe has been accelerated greatly due to global market lockdowns and further risk of lockdown.\n\n&amp;#x200B;\n\nPhysical and monetary assets being virtualized has recently been accelerated in importance and this will have positive effects, across time, on businesses that focus on securing those assets in its time spent delivering on multiple ultra-high-speed networks across the world. Computing is getting cheaper and easier to distribute in rather extreme ways and the execution of these ideas is happening right now.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[The network has enormous inherent value. Just look at Akamai's stock history for example. This data has been \\\\\"crunched\\\\\". 2-5 years accelerated in 1.](https://preview.redd.it/8fhkpr6cpk451.png?width=696&amp;format=png&amp;auto=webp&amp;s=3e2d6301242fd7526116a116cd27bb0d101d6bc4)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nInfrastructure that support these interactive ecosystems will be growing at incredible rates. This market is **\\*\\*BIG\\*\\*** and no one or two players will be large enough to capture the market. It ranges from manufacturers, energy departments, web products, hospitals, governments, and so on. Security is serviced differently based on the industry. This much is obvious - a hospital will clearly protect patient records more closely than a manufacturer controlling the runtime of their high-speed machining assembly line.\n\n&amp;#x200B;\n\n[Z-Scaler makes bank off manufacturing and supply chain operations](https://preview.redd.it/xzj23zndpk451.png?width=1880&amp;format=png&amp;auto=webp&amp;s=7e5e7aad5ede4a438f5eeffad6c4bfb1f8ae363b)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[Cloudflare prioritizes hospitals and offers a lot of good shit for very little.](https://preview.redd.it/jcusezeepk451.png?width=1912&amp;format=png&amp;auto=webp&amp;s=c5a66a435eb01690854f53eb3b63c5ca3a332100)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[Amazon and FB obvious target web retailers more](https://preview.redd.it/bws0ruafpk451.png?width=1926&amp;format=png&amp;auto=webp&amp;s=22bf2d5ac9eb01d871f16cdee3f25bb3a1c28946)\n\n&amp;#x200B;\n\n[Fastly targets fast media and video processing. PAN Network? That's Fastly delivering it without it sucking like Reddit Videos.  That's what happens when you build one product really well.](https://preview.redd.it/h8ur2w3gpk451.png?width=1308&amp;format=png&amp;auto=webp&amp;s=b15f3c6270019ba2fc3e33c0be6731a86c6dbb72)\n\n&amp;#x200B;\n\nThe need for secure video, transactions, VR, and user experiences will be dramatically shot up and this is evident across many exciting technologies like Apple VR, Google Gaming, Square Banking, Facebook Shops with VR shopping, Microsoft software automations, and government developments.\n\n&amp;#x200B;\n\nNET is one of the best positioned companies to pioneer this market at scale.\n\n&amp;#x200B;\n\n# # Market drivers &amp; a brief history of modern computing\n\n&amp;#x200B;\n\n[This technology spearheaded us toward 5G.](https://preview.redd.it/qaokr6bhpk451.png?width=795&amp;format=png&amp;auto=webp&amp;s=973e2994fd2781b53299527e4966a5ef92dce117)\n\nThe history of CDNs took a much larger turn when YouTube and Netflix became big players in data production and needed to cooperate with Internet Service Providers to manage the new dam and  tunnels of water that the market had created.\n\n&amp;#x200B;\n\nAs many of you know, video data is large and streaming high quality videos at high speed to millions of users in real time was no laughing matter. Around this time you also began to see new products in ESports like [Twitch.tv](https://Twitch.tv) which would \"stream\" video.\n\n&amp;#x200B;\n\nWhat had happened was that tech companies discovered a more cost effective way of delivering video and it was through controlling the actual pipeline. You would receive atomized content as needed rather than waiting for blocks of video to be received on your end (this was problematic in early Youtube days with broadband and DSL)\n\n&amp;#x200B;\n\nThe paradigm began to shift. Cloud computing and asynchronous models began to gain steam in the developer profession. We began a defining chapter of web optimizations that still continue today with serverless computing, real-time data, and growing user-experiences. At this time you began to notice that you no longer had to refresh your web page to receive new data. Remember when Facebook started to notify you rather than you checking your notifications? Do you remember when you had to check your email?\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nToday, developers are able to create or distribute product and services using networking and data center functions. This is largely what is recognized as cloud and serverless computing. This is has many consequences but primarily allows for unbelievably fast responses and avenues for user experiences.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[A solo developer can have a student upload a meme for an assignment, have that image analyzed for text, and automatically answer the question if it was right.](https://preview.redd.it/a645yz1jpk451.png?width=1626&amp;format=png&amp;auto=webp&amp;s=c0ce37c55836f08c86b95a5dec4150f247b7d175)\n\n&amp;#x200B;\n\n# # What is serverless computing?\n\n&amp;#x200B;\n\nServerless computing allows a 25 year old developer like me run 5 different businesses on my dinky little Macintosh while I let Google and Cloudflare run my servers under an extremely cheap pricing model. That is a revolutionary change for software. It is one of the bread and butter of SaaS, IaaS, and other cloud style businesses where many business problems come out of the box for you.\n\n&amp;#x200B;\n\n[Out of the box business solutions.](https://preview.redd.it/7qq6h6ujpk451.png?width=1330&amp;format=png&amp;auto=webp&amp;s=b0bf6314cf4c937427ff4011c3891eebc11477b4)\n\n&amp;#x200B;\n\n# # Other competitive advantages of network and cloud computing\n\nThe reason Snapchat did not gain any traction outside of the US was because Facebook provided a fundamentally faster service across WhatsApp and Instagram. Facebook's investment in Akamai and its personal networking infrastructure allowed them to create a product that was fast, cheap and would work in various rural or economic conditions. Snapchat never stood a chance in the global social media landscape as a result.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[Deep investments in infrastructure means DEEP growth](https://preview.redd.it/svayplokpk451.png?width=1866&amp;format=png&amp;auto=webp&amp;s=1bcc17951f303841dcaaa13f54063f927efd7dac)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # What's special about CloudFlare as a network?\n\nWhat CloudFlare specifically offers against its competitors is its ***\\*\\*privacy-first approach\\*\\**** and its quality of engineering. CloudFlare is essentially a distributed private content delivery network (pCDN) with a massive infrastructure effort to send data around the world safely and cheaply.\n\n&amp;#x200B;\n\nThis is fundamentally consequential as we are seeing massive nations tackle issues with how data can be utilized or privatized.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[Extremely high quality engineering = less costs = more market capture](https://preview.redd.it/pu4xoq3mpk451.png?width=1624&amp;format=png&amp;auto=webp&amp;s=6b4217b2bad4ffa80c00439499b00c79c420b77b)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[Good relationships with enterprise = money city. JD, Shopify, Facebook, Baidu, Microsoft, Google, the list is endless.](https://preview.redd.it/3jzf2xunpk451.png?width=1660&amp;format=png&amp;auto=webp&amp;s=860f163fe96972a221cfd356174e747535144d25)\n\n&amp;#x200B;\n\n# # Where Does CloudFlare currently stand in the market?\n\n&amp;#x200B;\n\n[These needs have only dramatically increased since covid.](https://preview.redd.it/djrvsq5zpk451.png?width=600&amp;format=png&amp;auto=webp&amp;s=634caaa6d9abe482ed7d7c5c6bb57768c91b552e)\n\n[How they view themselves in the market.](https://preview.redd.it/oicb754ypk451.png?width=1670&amp;format=png&amp;auto=webp&amp;s=ef1d3a8eeecf161a6387bf10cfbc1a4e389de52e)\n\n&amp;#x200B;\n\n[The local ecosystem.](https://preview.redd.it/tzcutumwpk451.png?width=1152&amp;format=png&amp;auto=webp&amp;s=158913217acdde59fd175ead4203cbe45481e842)\n\n&amp;#x200B;\n\n[Cloudflare is cyber security](https://preview.redd.it/nus93moopk451.png?width=1080&amp;format=png&amp;auto=webp&amp;s=02bea0bdefa6cbd00fb31410d4783415a3b8443e)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[Cloudflare allows Big Tech to tackle challenging issues they face as they scale with sensitive data.](https://preview.redd.it/ewkm8hhqpk451.png?width=1284&amp;format=png&amp;auto=webp&amp;s=7f2d75d76f3292a36f3e11778ab859b8031f9a47)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[Their network is larger than Amazon and theyre trusted around the world much more than other networks.](https://preview.redd.it/d56i8543qk451.png?width=2192&amp;format=png&amp;auto=webp&amp;s=5696ee749fe79f6dd660c7e3b9c8d2ed39b8a8ee)\n\n&amp;#x200B;\n\n# cant post more than 20 images because Fastly and Reddit sucks\n\n&amp;#x200B;\n\nvs Amazon below\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956536-11394680-a814-11ea-888f-e38467dc658d.png](https://user-images.githubusercontent.com/37036296/83956536-11394680-a814-11ea-888f-e38467dc658d.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # Deep market relationships\n\nCloudFlare has had large scale investments, partnerships, and business ventures with organizations like:\n\n&amp;#x200B;\n\n# JD Cloud and Chinese infrastructure, which will inevitably boom with revenue from video scaling, contentious privacy, e-commerce and infrastructure\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956688-8fe2b380-a815-11ea-934f-c6017bfa7395.png](https://user-images.githubusercontent.com/37036296/83956688-8fe2b380-a815-11ea-934f-c6017bfa7395.png))\n\n&amp;#x200B;\n\n# Supporting recent legends like Shopify\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956715-d1735e80-a815-11ea-8a0d-ad35a575866a.png](https://user-images.githubusercontent.com/37036296/83956715-d1735e80-a815-11ea-8a0d-ad35a575866a.png))\n\nhttps://preview.redd.it/nch0x7k1qk451.png?width=1254&amp;format=png&amp;auto=webp&amp;s=9303863a87f0cb84c408b414b89bd50e38b56a63\n\n&amp;#x200B;\n\n# Growing with global industry leaders\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956727-e94ae280-a815-11ea-9982-a1eabc5ec754.png](https://user-images.githubusercontent.com/37036296/83956727-e94ae280-a815-11ea-9982-a1eabc5ec754.png))\n\n&amp;#x200B;\n\n# A competitive proxy that approaches Big Tech's biggest legal problems\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956750-20b98f00-a816-11ea-97c2-89db7d3e94f1.png](https://user-images.githubusercontent.com/37036296/83956750-20b98f00-a816-11ea-97c2-89db7d3e94f1.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # So what does this mean for CloudFlare?\n\n# ## The missing puzzle piece: CloudFlare TV and Cloudflare Streaming\n\n# ### Target: Enterprise, profits, generosity, and long-term market capture.\n\n&amp;#x200B;\n\nA big piece that's missing from Cloudflare's economic puzzle is the release and support of distributed video and video development.\n\n&amp;#x200B;\n\n# Piece 1: Easy to use, distributed, private, secure networking\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956655-44300a00-a815-11ea-8d7b-36ceeae3eb2d.png](https://user-images.githubusercontent.com/37036296/83956655-44300a00-a815-11ea-8d7b-36ceeae3eb2d.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Piece 2: Easy to use, distributed, secure, cost-effective streaming\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956794-b3f2c480-a816-11ea-8b7b-5d2d3de080d9.png](https://user-images.githubusercontent.com/37036296/83956794-b3f2c480-a816-11ea-8b7b-5d2d3de080d9.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Piece 3: Easy to use, distributed, secure, cost-effective enterprise IT\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956818-d4228380-a816-11ea-81bf-5fa785b64bbd.png](https://user-images.githubusercontent.com/37036296/83956818-d4228380-a816-11ea-81bf-5fa785b64bbd.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Piece 4: Easy to use, distributed, secure, cost-effective software development\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956844-f1575200-a816-11ea-81b5-afbbcc12356e.png](https://user-images.githubusercontent.com/37036296/83956844-f1575200-a816-11ea-81b5-afbbcc12356e.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Piece 5: The missing piece. Easy to use, distributed, private, secure enterprise video.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956883-42674600-a817-11ea-995a-4db7f7b8b9db.png](https://user-images.githubusercontent.com/37036296/83956883-42674600-a817-11ea-995a-4db7f7b8b9db.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # My record\n\nI'm fairly conservative in my choice to purchase option or stock. I'm a software engineer that's passionate about education and have really enjoyed exercising my knowledge-base during this investment time. Usually i get really excited about a stock or two at best per year based on certain global developments. These stocks are selected based on powerful and consequential market relationships or competitions occurring in the arena and by simply just participating in the market as much as I can myself.\n\n&amp;#x200B;\n\nI have made a fair amount of money with\n\n&amp;#x200B;\n\n# - REDACTEDcoin &amp; AMD's computing relationship (Bought REDACTEDcoin at 2k, AMD at $11)\n\n&amp;#x200B;\n\n# - E-Commerce and Facebook's growing relationship with small businesses (my first options reached 20x on FB)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\ncurrently investing heavily in:\n\n&amp;#x200B;\n\n# - Privacy [CloudFlare, Big Tech, US, China, and global development]\n\n&amp;#x200B;\n\n# - Automation, manufacturing, and battery improvements [Panasonic, FANUC, Texas, Mexico and Japan]\n\n&amp;#x200B;\n\n# - Mexican-American trade [Kansas City Union, USMCA, and the Mexican economy]\n\n&amp;#x200B;\n\n# - Virtual Reality, gaming, AI with user-experience support, and fintech [Zoomers &amp; you]",
        "subreddit": "wallstreetbets",
        "title": "Cloudflare $NET DD - Cloud Infrastructure &amp; Security",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/h7x4l6/cloudflare_net_dd_cloud_infrastructure_security/",
        "created": 1592038146.0
    },
    {
        "author": "herk_destro",
        "created_utc": 1592447259,
        "id": "hb5u9q",
        "num_comments": 100,
        "num_crossposts": 0,
        "selftext": "I am waiting until Aug/Sep before I look for buying Puts on the market going down. Normally SPY would what I would think about.\n\nI started thinking S&amp;P is jacked, they have big winners like MSFT and AAPL jacking that stuff up. They also kicked a bunch of losers out of the club.  So SPY is more solid than it was back in March.\n\nWhat are better stocks/ETF than SPY for the coming crash?",
        "subreddit": "wallstreetbets",
        "title": "When the crash comes what should your Puts be on?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hb5u9q/when_the_crash_comes_what_should_your_puts_be_on/",
        "created": 1592476059.0
    },
    {
        "author": "chadlad101",
        "created_utc": 1592390850,
        "id": "haouhm",
        "num_comments": 100,
        "num_crossposts": 0,
        "selftext": "# Hey everyone, here is my take on SNAP (NYSE). Pls let me know your thoughts (supporting/ conflicting) etc. or if there's anything else I need to cover. This is just my opinion of the stock and I could definitely go into way more detail...\n\n&amp;#x200B;\n\n## 🔥 Investment Thesis\n\n1. Snapchat has the potential to become the first Western Super App\n2. Snapchat is a bet on innovation, and that innovation wins in the end\n3. Snapchat is leading the way with augmented reality and is a long-term hardware play\n\n#### (1) Snapchat has the potential to become the first Western SuperApp\n\n* On June 11th, Snap announced **Minis**. These are micro applications that third-party devs build for people to use inside of Snapchat.  \n\n   * Snap is starting with 7 Minis with some big partners including Headspace (meditate with friends) and Coachella (coordinate your festival line-up with friends).\n* We can look at the success and misfortunes of other companies who have launched micro applications to see if this is a good move for Snap:  \n\n   * **Bull Case: Snapchat replicates** [**WeChat’s success with Mini Programs**](https://melchers-china.com/wechat-mini-programs-a-rapidly-growing-trading-channel-in-china/)  \n\n      * Mini Programs launched on WeChat in 2017\n      * By August 2019, there were 2.36 million WeChat mini-programs\n      * In 2019, over 300 million people had spent a collective [$115B](http://routenote.com/blog/tencent-made-115-billion-just-from-wechats-mini-apps-in-2019/#:~:text=Tencent%20revealed%20the%20news%20that,expand%20the%20platform%20in%202020.) through WeChat Mini Programs\n      * Chinese research agency Kueclub and Tencent Research &amp; Development found 40% of 8000 research respondents believe they will completely replace standalone apps one day\n      * Since announcing WeChat Mini Programs in [December 2016](https://chinachannel.co/try-wechat-mini-programs-now/), Tencent (owner of WeChat) stock has increased over 130%\n   * **Bear Case: Snapchat follows the sad path of iMessage apps…**  \n\n      * These are small apps that you can access through iMessage on iPhone\n      * Developers seemed to [lose interest](https://www.macrumors.com/2017/03/16/developer-imessage-apps-fading/) in 2017 after 6 months.\n      * Hasn’t grown much beyond Sticker packs… and certainly nowhere near as big as WeChat Mini Programs\n* My Take:  \n\n   * **Evidence of Success:** Snap has killed it since opening its platform up to developers. Out of [800 apps integrated with Snapkit](https://www.businesswire.com/news/home/20200611005151/en/Snap-Announces-New-Developer-Products-Partnerships-Snap), 20 are in the top 100 of the app store at the moment. Snap Games have also seen a successful start with over [100 million users](https://venturebeat.com/2020/06/11/snap-hits-100-million-players-teams-with-zynga-and-launches-more-chat-games/) since they launched last year. I expect similar success for Snap Minis, and ultimately for them to follow the path of WeChat.\n   * **Snap becomes stickier:** If Minis are successful, it’ll make Snapchat very sticky. Why would people leave the Snap app when so many other convenient services are offered on it? Snap previously made their app sticky with Snap streaks, and now they’re going to make it even more so with Snap minis.\n   * **Growth opportunities:** If everyone is using Snap Minis to plan, shop, and socially book tickets together, non-users will be persuaded to download Snapchat to access these programs specifically.\n   * **Revenue diversification:** Snapchat has a huge opportunity to diversify revenue beyond adverts and brand partnerships, by taking a cut of revenue spent through e-commerce Snap Minis (see above: $115BUSD spent through WeChat mini-programs in 2019).\n\n### (2) Snapchat is the most innovative social media company\n\n* This is pretty clear from all the news articles released about Facebook copying everything Snapchat does\n* Snapchat was [**FastCompany’s most innovative company of 2020…**](https://www.fastcompany.com/most-innovative-companies/2020) a list that also placed Tesla, Shopify, Beyond Meat, and Spotify in the top 15.\n* It’s worth reading more about this [**here**](https://www.fastcompany.com/90457684/snap-most-innovative-companies-2020)\n\n### (3) Snapchat is leading the charge with Augmented Reality and is a long-term hardware play\n\n* **Leading the charge into Augmented Reality:**  \n\n   * According to Mordor Intelligence, the Augmented Reality market is expected to have a CAGR of [152%](https://www.mordorintelligence.com/industry-reports/augmented-reality-market) between 2019 and 2020, and the user base for AR technologies is also expected to grow beyond 1 billion by 2025.\n   * Researchandmarkets.com is more bearish, estimating the [size of the AR market](https://www.businesswire.com/news/home/20200515005267/en/Global-Augmented-Reality-Mixed-Reality-Market-Growth) to only grow at 44.74% (still ridiculously high) to USD 27.44 billion by 2025, up from USD 2.98 billion in 2019.\n   * Snap is positioning itself to take a large proportion of the consumer-facing AR market.  \n\n      * More than [170 million](https://www.bloomberg.com/news/articles/2020-06-11/snap-says-170-million-use-its-augmented-reality-tools-daily) people use Snapchats Augmented Reality tools daily\n      * Snap recently announced an AR tool called Scan that allows people to digitally interact with anything they see with their iPhone camera  \n\n   * Snap was rated as the #1 most innovative VR/ AR company of 2020 by Fast Company, and if they can use this to capture a large proportion of the consumer AR market (27.44B in 2025 - see above), their revenue and valuation could be off the charts in the medium - long term.\n* **Long-term hardware play**  \n\n   * Following the iPhone and subsequent Android smartphone releases in the past decade, AR glasses have long-believed to be the next major hardware step in computing that will change the way we interact with the world\n   * Evan Spiegel (Snapchat CEO) believes we are unlikely to see mainstream AR glasses for another 10 years\n   * In an interview, Evan Spiegel stated  \n*“Spectacles, because they’re a new type of camera, they’re still event-based in terms of usage. You go on a really cool trip, you’re playing with your kids, whatever it is — and you want to represent that moment in a totally new way, from your perspective in 3D. So for now, I do think it’s going to continue to be an event-based product.* ***But what’s really exciting is that over time, we’ve seen the capacity for these cameras to evolve from event-based products to products that are used all day long. So, I think we’re just on that journey with Spectacles****. And we’re fortunate that we can continue to invest along that path to get there.”*  \n\n      * While open to interpretation, this could mean that Snapchat is investing in Snap Spectacles, with the aim they will eventually become AR glasses armed with Snapchats AR software to compete with [Apple’s much-anticipated equivalent](https://www.macrumors.com/roundup/apple-glasses/).\n   * **EVEN MORE INTERESTING:** On top of Snap’s augmented reality software capabilities, Snap has also announced [voice-enabled](https://mashable.com/article/snapchat-voice-scan-lens-finder/) lenses called Voice Scan. This is similar to Apple’s Siri or Amazon’s Alexa.  \n\n      * Voice could potentially be used as a control-mechanism for AR glasses later down the track\n   * **My Take:** AR glasses seem to me like an inevitability, however, whether or not Snapchat create them is a pretty huge speculation. However, the upside of this speculation could be **ridiculous**. Using the case of Apple and the iPhone as an example:  \n\n      * There are currently [728 million iPhones ](https://www.statista.com/statistics/755625/iphones-in-use-in-us-china-and-rest-of-the-world/)in use around the world\n      * When Apple announced the iPhone on the 9th of January 2017, its stock price was [$11.94](https://www.businessinsider.com.au/apple-stock-price-in-the-10-years-of-the-iphone-2017-6?r=US&amp;IR=T)USD. Since then it has appreciated over 2500% to $352.08USD. Apple’s market cap was less than $80B when it announced the iPhone, today it is $1T.\n      * If AR achieves a similar reach, then the dominant AR hardware company could see similar success to this.\n\n## 👎Risks\n\nNo investment is without risks.\n\n* Many people believe Superapps will [fail in the Western world](https://blog.prototypr.io/why-chinas-super-apps-will-never-succeed-in-the-us-64c686c8c5d6), so Snapchat Minis won’t succeed in a big way.  \n\n   * Western world and Asia do have incredibly different internet ecosystems with China effectively jumping straight to mobile\n   * Snap has had recent success with its Snap Kit and Snap Games, however, only time will tell\n* Snapchat is dying and will be replaced by the next social network  \n\n   * Snap still reaches more 13-34-year-olds in the US than Facebook or Instagram. It also reaches more users in the US than TikTok and Twitter combined.\n   * Snapchat growth has significantly underperformed [Instagram](https://www.statista.com/chart/15034/worldwide-user-growth-of-instagram-and-snapchat/). However, it would be worth to look into where the growth comes from (age and country demographics).\n   * It is entirely possible that the next social network could be built on top of Snapchat ([Hoop](https://techcrunch.com/2020/02/05/hoop-snapchat-app/), [Wink](https://apps.apple.com/au/app/wink-make-new-snap-friends/id1482681335), [YOLO](https://techcrunch.com/2019/05/08/download-yolo-app/) are some of the fastest-growing consumer apps and are all heavily reliant on Snapchat)\n   * Snap isn’t afraid to acquire the next social network, having previously acquired [Bitmoji](https://www.bitmoji.com/) and [Zenly](https://play.google.com/store/apps/details?id=app.zenly.locator&amp;hl=en_AU)\n* Snapchat has Facebook copying everything they do  \n\n   * [Evan Spiegel doesn’t seem too worried about this](https://economictimes.indiatimes.com/magazines/panache/evan-spiegel-says-facebook-copying-their-popular-features-is-the-most-fantastic-feeling-ever/articleshow/64379256.cms) so long as Snapchat remain innovative and ahead of the park  \n\n      * *“If you can create something that is so beautiful and simple that the only thing other people can do is copy it exactly, that is the most fantastic feeling. It is the most fantastic thing in the entire world.”*\n* Snapchat won’t become profitable  \n\n   * One of the biggest tests for Snap will be figuring out a monetization model beyond advertising. No one has cracked this outside of China yet, and Snap’s messaging network of close friends makes it possibly the best positioned to do so.\n* Snap spectacles suck..  \n\n   * They do suck, but as mentioned above they could simply be a step in the process of getting to full AR glasses.\n* Snap is already huge ($23B company), it won’t grow much more  \n\n   * Snap has the long-term potential to be the size of any of the top consumer tech companies. Apple $1.47T (51x Snap), Google $964B (33x), Facebook $653B (23x) and Netflix $184B (6x).\n* Before investing, make sure you read Snapchat’s prospectus and yearly reports to see more risks.\n\n## Current valuation\n\n* Amongst the 35 analysts that cover Snap, the average target price is $18.66\n* At the current price, the consensus is Snapchat is marginally overvalued. However, with plenty of positive information being released at the Snap Partner Summit, this could change when analysts next update their ratings.\n\n## Conclusion\n\n* Worth digging deeper if you’re a patient investor, looking to buy and hold for the long-term (minimum 5-10 years)\n* Could crash again like in 2018 if Snap fails to execute mini-apps etc. or if young generation has a fundamental shift to another social network\n* *Disclosure: I’m long SNAP through underlying equity, but not that long… it represents a very small proportion of my overall portfolio. Everything expressed in this newsletter is personal opinion based on personal research. I’m not a trained professional nor a financial advisor, and this is not a suggestion or recommendation as to how to handle your money. Make sure to always do your own due diligence. I shall not be held liable for any losses you may incur for investing and trading in the stock market. Be careful my dudes and don't buy short-term call options on SNAP - this baby is a long-term play.*\n\n## 🔗Links and resources\n\n* [Snap Investor Centre](https://investor.snap.com/company-profile) \\- Read through snap financial reports \n* Diane gives a solid commentary on the news released from the Snap Partner Conference in her newsletter [snapshots](https://diane.substack.com/p/my-thoughts-on-everything-snap-launched)\n* Alexandre Dewez Snapchat investment [thesis](https://alexandre.substack.com/p/-snap-a-picture-is-worth-a-thousand) on Snapchat\n* [Why SuperApps will fail in US](https://blog.prototypr.io/why-chinas-super-apps-will-never-succeed-in-the-us-64c686c8c5d6)\n* Snap bull thesis with [Turner Novak](https://www.youtube.com/watch?v=PaL0CJKC1Ys).\n* **Book** on the creation of [Snapchat](https://www.amazon.com/How-Turn-Down-Billion-Dollars/dp/1250108616#:~:text=How%20to%20Turn%20Down%20a%20Billion%20Dollars%3A%20The,Story%20Hardcover%20%E2%80%93%20February%2013%2C%202018&amp;text=Find%20all%20the%20books%2C%20read%20about%20the%20author%2C%20and%20more.&amp;text=The%20improbable%20and%20exhilarating%20story,changed%20the%20way%20we%20communicate) \\- vital info for Snap investors that is often overlooked\n* [Fast Company](https://www.amazon.com/How-Turn-Down-Billion-Dollars/dp/1250108616#:~:text=How%20to%20Turn%20Down%20a%20Billion%20Dollars%3A%20The,Story%20Hardcover%20%E2%80%93%20February%2013%2C%202018&amp;text=Find%20all%20the%20books%2C%20read%20about%20the%20author%2C%20and%20more.&amp;text=The%20improbable%20and%20exhilarating%20story,changed%20the%20way%20we%20communicate)\\- Snap most innovative company in 2020 article\n* [Yahoo Finance](https://au.finance.yahoo.com/quote/SNAP?p=SNAP) \\- Financial stats and info\n* [Finbox.io](https://Finbox.io) \\- create your own DCF quickly",
        "subreddit": "wallstreetbets",
        "title": "My Analysis of Snapchat (NYSE: SNAP) - a long term bet on innovation",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/haouhm/my_analysis_of_snapchat_nyse_snap_a_long_term_bet/",
        "created": 1592419650.0
    },
    {
        "author": "asji4",
        "created_utc": 1593089109,
        "id": "hflgc6",
        "num_comments": 95,
        "num_crossposts": 0,
        "selftext": "# TLDR: I am bearish on Apple and Amazon in the short term and they will dip below March 2020 lows. This a fairly LONG post and uses Elliott Wave Theory and RSI. If you believe that is bullshit, immediately downvote this post to oblivion. Otherwise, please keep reading!\n\n**Disclosed positions:** SPX December 275 puts (because I'm unfortunately not American and hence can't directly short Amazon/Apple without insane capital requirements :(  )\n\n\\----------\n\nI have attached the charts for two of the largest companies in the S&amp;P500, each having a market capitalization of above $1 trillion. From the looks of the price action - it doesn't look too good. I expect a further decline in these stocks within the next few weeks and months, potentially exceeding even the lows made in March 2020.  \n\n\nLooking at the chart for Apple, the price as of June 25th 2020 seems to have reached the top of Wave (iii) of -v-. Maybe there could be some more room for the price to squeeze up, but a pullback in the form of Wave (iv) is imminent. If the internal structure holds, then we hit the target cluster under **\"Scenario 1\"**, where the price reaches **between 310 - 290** with a 50 - 58.6% Wave (iv) correction. If this support holds, then Wave (v) up is the next logical move.  \nHowever, I am of the strong belief now that the price will go down further, and this is based on alternation theory. The major Wave (II) was in fact only a shallow 33% decline (not shown in the image), which seems to indicate that Wave (IV) will be rather deep. This leads us to **\"Scenario 2\"**, where the price could reach **between the** **230 - 200 level** with more than a 50% correction. There is a possibility we could go lower, and this is because the internal Wave -iv- was a 76.4% correction - rather unusually deep. Generally, a correction such as this should not violate the Wave (b) of -iii-, but in rare cases such as this, the overall structure still seems to remain intact.  \nTo further solidify the hypothesis that Wave (IV) could go lower than the March 2020 lows, the wave structure seems to be forming an expanded flat pattern which I have highlighted, and also the RSI appears to be forming a rather **weak bearish divergence**.\n\n&amp;#x200B;\n\n[Price projections for AAPL \\(25th June 2020\\)](https://preview.redd.it/jhx5a108x1751.png?width=1545&amp;format=png&amp;auto=webp&amp;s=3c724f4a08670934ad38127776d79a69c2f3e9ae)\n\n Next up is of course, Amazon. Like Apple, the price action has practically been parabolic since 2008, and many a bear trap have caught bears off guard.\n\nBut this time, I think the bears may have it. It is quite rare for a Wave -v- forming inside of a major Wave (v) and (III), all aligning at the right projections. Wave (III) was a super extended rally, and I expect it to continue in the long term with a Wave (V). But as Wave (II) was a rather shallow 23.6% correction, it is expected that Wave (IV) be deep, supported by the developments of the internal Wave -v- and (v). The projection cluster here is **between 1630 - 1440** for the Wave (IV).\n\n&amp;#x200B;\n\n[Price projections for AMZN \\(25th June 2020\\)](https://preview.redd.it/bqotcoppx1751.png?width=1545&amp;format=png&amp;auto=webp&amp;s=3725424b60d3c7d69aa8c456489cfb6cc6f951f6)\n\nPerhaps my counts could be wrong and the price just keeps going up due to strong fiscal and monetary responses. But that would mean even the internal waves are wrong which currently strongly confirms the hypothesis that we have in fact, reached the top as of June 25th 2020 (plus or minus 7 days). If the price indeed goes up, then we can say for certain that Elliott Wave Theory does not possess much long-term predictive ability in identifying reversal points in the future, as this current forecast large rests on the assumption that the current top is a major Wave (III) supported by an internal Wave -v-.  ",
        "subreddit": "wallstreetbets",
        "title": "Apple and Amazon: The Big Short",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hflgc6/apple_and_amazon_the_big_short/",
        "created": 1593117909.0
    },
    {
        "author": "Marketman4life",
        "created_utc": 1591454560,
        "id": "gxs77g",
        "num_comments": 94,
        "num_crossposts": 0,
        "selftext": "For the people worried because others are saying they don’t make money. Yes they haven’t but they obviously are. Below is excerpt from there letter to shareholders yesterday when announcing David Neumann, the former Disney president, the content manager for there channel. Viewership and knowledge of the company, there products and content is going to SOAR! \n\n\n“As we run up to the launch of Kartoon Channel! on June 15, we are all excited about the unprecedented carriage and launch footprint, which covers more than 100 million U.S. TV households and 200 million mobile devices, across cable, satellite, digital, and OTT platforms, including Comcast, COX, Dish, Apple TV, Amazon Prime, Amazon Fire, Roku, and Tubi, among them.”\n\nMattel will be making toys and products, who obviously is a known brand! \n\n*** What could be the biggest help here is the addition of Alibaba. Full disclosure I will never own a Chinese companies stock, I don’t trust the news, the reporting or anything about that country (nothing against the people. Just the country is well...yea) but BABA (and Apple TV) will bring a lot of Chinese families to GNUS products both in toys and viewership to bring up the ratings to help ad revenue. Yes it’s free now but there will be advertising on the channel and content. \n\nThe wife and kids are telling me to go to the dock so I’m out for a bit but I will add to this when I get a chance. \n\nAnyone else post your DD here too. And let’s all ride this ship together! \n\nUpvote for GNUS making us all 💵💵",
        "subreddit": "pennystocks",
        "title": "GNUS Revenue/DD/Facts",
        "url": "https://www.reddit.com/r/pennystocks/comments/gxs77g/gnus_revenueddfacts/",
        "created": 1591483360.0
    },
    {
        "author": "nixunknown",
        "created_utc": 1593012598,
        "id": "hf317j",
        "num_comments": 92,
        "num_crossposts": 0,
        "selftext": "This morning I learnt a very valuable lesson.. Two actually. The first was to not be a dumbass and only make trades that make sense for your account size regardless of the potential reward and secondly, in my opinion even more importantly, never let emotions influence your trades. \n\nYesterday after the crazy rally that AAPL had, i knew there would be a pullback to stabilize the price a bit. My strategy was to enter the play at what I thought would be the peak of AAPL rally, around 370. At 371, with my opinion, great timing, i purchased the 365 put with a 6/26 expiration. Terrible expiration imo but it was the only contract close enough to the money at a reasonable price for my account. (The trade was around 70% of my buying power, my first lesson). I planned to sell bby end of day when the pullback occurs. I was busy at the time I wanted to sell and for family reasons had to hold through the night. Come this morning, AAPL opens lower and aim thinking, great it will continue a decline and correct its price. Welp around 10 min into market open I see it begin to rally again to 368 and get freaked out, knowing that this is practically my whole account and even a couple points higher could basically wipe me out. So i sold the contract due to the emotions. \n\nIn the moment, it seemed like a good idea since I did not want to take on the risk of blowing up my account. Now AAPl is at 362 and my contract is worth double the price. \n\nHopefully you guys can also learn from my mistake and not let emotions influence your trades.",
        "subreddit": "options",
        "title": "Disconnect Emotion from trading - A lesson",
        "url": "https://www.reddit.com/r/options/comments/hf317j/disconnect_emotion_from_trading_a_lesson/",
        "created": 1593041398.0
    },
    {
        "author": "WSBStockTickerBot",
        "created_utc": 1591120035,
        "id": "gvc07y",
        "num_comments": 91,
        "num_crossposts": 0,
        "selftext": "I'll set the scene for you. It's 1:03pm on a Friday. You've just worked hard to finish page 8 of the coloring book your wife's boyfriend bought you for Christmas last year. You deserve a break. Before nap time, you open RH only to see a 4x gilded post circle-jerking over the 10-bagger earnings play they've been milking over the last week. You stare, blank faced at the post. Your brain faintly remembers the ticker from months ago when your friend told you the company would blow up during the beer virus. The rage builds even as the half-eaten crayon hanging out of the side of your mouth wets with drool. A single syllable _guhhhh_ releases from your mouth as you realize the tendies could have been yours if only your feeble brain had processed enough TLDRs to fool you into buying a call\n\n\n# If this sounds like you, I've built something to help you out next time you need someone to hold your hand while you confidently swipe up on some OTM weeklies\n\n**[/u/WSBStockTickerBot](https://www.reddit.com/user/WSBStockTickerBot) scans [/r/wsb](https://www.reddit.com/r/wallstreetbets/ \"WSB\")'s new posts and will notify you when DD is being posted about tickers you're interested in**\n\n## How to use\n**EASY&gt;&gt;** [CLICK HERE TO SUBSCRIBE TO ALL DD FOR A TICKER(S)!](https://np.reddit.com/message/compose/?to=WSBStockTickerBot&amp;subject=Subcribe%20Me&amp;message=You%27ll%20be%20subscribed%20to%20%24MSFT%20and%20%24AAPL%20as%20an%20example%0AType%20more%20tickers%20anywhere%20and%2For%20erase%20the%20line%20above%20if%20you%20don%27t%20want%20those) **&lt;&lt;EASY**\n\n**EASY&gt;&gt;** [CLICK HERE TO SUBSCRIBE TO ALL DD FOR ALL TICKERS!](https://np.reddit.com/message/compose/?to=WSBStockTickerBot&amp;subject=Subcribe%20Me&amp;message=ALL%20DD) **&lt;&lt;EASY**\n\nOr...\n\n* Send [/u/WSBStockTickerBot](https://www.reddit.com/user/WSBStockTickerBot) a message or comment on something it's posted (this this post) with a ticker or tickers. **Chat is not supported by Reddit for bots please make sure you send a DM or respond to a [/u/WSBStockTickerBot](https://www.reddit.com/user/WSBStockTickerBot) comment**\n  * Example: `$AAPL $UCO` will subscribe you to the `$AAPL` and `$UCO` tickers\n* Use a message with stop at the beginning to be unsubscribed from specific tickers\n  * Example: `STOP $AAPL`\n* Use `STOP ALL` to unsubscribe from the \"ALL DD\" feed\n\n## A couple things to know\n* If you subscribed to an individual ticker you'll be notified of new posts with the `DD` flair for that ticker\n* If you subscribed to the \"ALL DD\" feed, you'll be notified of all new `DD` flaired posts \n\n## Need some help\n* Currently, the bot can be rate-limited when making posts. If you can give the bot some orange arrows would help. I'd like to have the bot post on rising DD-flaired posts with the tickers it finds in them to help other people find and use it\n* If you find any issues or have a suggestion or feature you'd like to see, send a message to [/u/WSBTickerBotHandler](https://www.reddit.com/user/WSBTickerBotHandler) or open an issue/PR here https://github.com/WsbTickerBotHandler/WSB-Ticker-Bot\n* Stopping your \"ALL DD\" subscription will not stop individual tickers you've subscribed to separately",
        "subreddit": "wallstreetbets",
        "title": "I've built a tool so you'll never miss a good DD post",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gvc07y/ive_built_a_tool_so_youll_never_miss_a_good_dd/",
        "created": 1591148835.0
    },
    {
        "author": "tristancode",
        "created_utc": 1592880126,
        "id": "he6ek5",
        "num_comments": 89,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Asking Tim Apple for help printing the PUTS 🌈🐻",
        "url": "https://i.redd.it/oj4yk585ok651.png",
        "created": 1592908926.0
    },
    {
        "author": "crimsonthrowaway2",
        "created_utc": 1592977532,
        "id": "hev9zy",
        "num_comments": 88,
        "num_crossposts": 0,
        "selftext": "There is no getting around it. AVGO (Broadcom) has been unstoppable over the last decade. Tremendous growth and a fat dividend kicker. If you owned this stock, you should be very pleased.\n\nWhat's is the next Broadcom? People are talking 5G. People are talking ARM. Qualcomm will supply hardware to Apple for 5G, but their performance has been underwhelming. Softbank has ARM, but the company is a waste of existence. MRVL may have potential, but its been stagnant.\n\nWhat is your next broadcom and why?",
        "subreddit": "investing",
        "title": "The semiconductor stock for the next 10 years",
        "url": "https://www.reddit.com/r/investing/comments/hev9zy/the_semiconductor_stock_for_the_next_10_years/",
        "created": 1593006332.0
    },
    {
        "author": "crimsonthrowaway2",
        "created_utc": 1592532091,
        "id": "hbrx53",
        "num_comments": 87,
        "num_crossposts": 0,
        "selftext": "I am going to put 6% of my IRA into a tech stock. I will hold it for at least ten years. I am leaning toward a megacap with lots of cash, in order of favorite 1.Google 2.Apple 3.Microsoft. I like google because they are debt free. I am also considering broadcom.  \n\nSpend my money and why?",
        "subreddit": "investing",
        "title": "Which tech megacap would you pick and why?",
        "url": "https://www.reddit.com/r/investing/comments/hbrx53/which_tech_megacap_would_you_pick_and_why/",
        "created": 1592560891.0
    },
    {
        "author": "afruchter",
        "created_utc": 1591196061,
        "id": "gvve6j",
        "num_comments": 84,
        "num_crossposts": 0,
        "selftext": "With this company running up like crazy, I figured I would dig through some old news and financials to see what's going on. I'll preface this by saying that I have no position in this company, and I'm just throwing ideas out there in order to determine if people really believe in this company in the long-term, or alternatively are capitalizing on the short-term volatility. It seems pretty clear that the latter is true, but I'm bored at work and would like to hear some of your thoughts, so here it goes.\n\n&amp;#x200B;\n\n**Right now this company is trading at \\~$6.00 per share, with a market cap of \\~$590M or roughly 100x 2019 revenue of 5.9M. They have also never posted a profitable year.**\n\nThe historical financials are not looking good: [https://imgur.com/gallery/ef0uEV1](https://imgur.com/gallery/ef0uEV1).\n\nI dug through some old 10-K's and it looks like the elevated revenue in 2012/2013 (6.6 million and 2.6 million) was due to physical media sales such as DVDs in addition to physical products, think merchandise. Revenue then drops to 0.9M for several years until 2017 where they sold Llama Llama to Netflix for what I'm assuming was in the ballpark of $4M based on the huge bump, was too lazy to find the actual sale amount. Revenue drops back down in 2018, then bumps in 2019 due to the sale of Llama Llama season 2 and Rainbow Rangers Season 1, which was in the ballpark of $4M+ again.\n\nLooking down towards their bottom line, they've run up significant losses over the past 8 years, not posting a single profitable year in the time horizon I evaluated. **The 8 years of revenue totals $24.1M while the losses total -$55.7M.** This is concerning from a long-term viability standpoint as it seems Genius is unable to generate any money for shareholders. While they have created several very successful programs in recent years, it seems that they are unable to profitably deliver content. \n\nFinancials aside, I decided to look into this newly announced Kartoon Channel! to learn more about the actual product. I found YouTube channels for Kartoon Channel!, Kartoon Channel! Jr., Rainbow Rangers, and Llama Llama as I figured this would be a somewhat useful proxy for popularity and viewership. KC and RR videos averaged several thousand views per video while KC Jr and LL videos averaged in the low ten thousand views per video. Maybe GNUS is hoping to monetize on ads and turn a profit on that revenue stream, but given their current viewership (proxied from YouTube), it doesn't seem that they are going to generate much money. I'm also not very well versed in advertising revenue, so thoughts on this component from more experienced people would be great.\n\nI'd like some more information on the Kartoon Channel launch on June 15th, I can't tell if this will be a stand-alone streaming application, or simply a combination and rebranding of their existing content. Hoping that some of you who are smarter than me can dig into this and provide some clarity. Reddit won't let me link the press release, so I'm copying it below:\n\n[https://www.globenewswire.com/news-release/2020/05/06/2028502/0/en/Genius-Brands-International-to-Launch-Kartoon-Channel-Digital-Network-Across-Amazon-Prime-Apple-TV-Comcast-Cox-SelectTV-DISH-Sling-TV-Tubi-Xumo-and-More.html#:\\~:text=Kartoon%20Channel%20is%20a%20digital,anywhere%20in%20a%20safe%20environment.&amp;text=New%20platforms%20launching%20Kartoon%20Channel,%2C%20Plex%2C%20and%20Canela%20Media.](https://www.globenewswire.com/news-release/2020/05/06/2028502/0/en/Genius-Brands-International-to-Launch-Kartoon-Channel-Digital-Network-Across-Amazon-Prime-Apple-TV-Comcast-Cox-SelectTV-DISH-Sling-TV-Tubi-Xumo-and-More.html#:~:text=Kartoon%20Channel%20is%20a%20digital,anywhere%20in%20a%20safe%20environment.&amp;text=New%20platforms%20launching%20Kartoon%20Channel,%2C%20Plex%2C%20and%20Canela%20Media.)  \n\n&amp;#x200B;\n\nTL;DR: GNUS seems like a pump and dump stock and I'm failing to see any long-term prospects for the company. I'm staying on the sidelines, but I hope you all make plenty of money on this one.",
        "subreddit": "StockMarket",
        "title": "GNUS - Some Thoughts",
        "url": "https://www.reddit.com/r/StockMarket/comments/gvve6j/gnus_some_thoughts/",
        "created": 1591224861.0
    },
    {
        "author": "edrowilson91",
        "created_utc": 1592151385,
        "id": "h8wnul",
        "num_comments": 82,
        "num_crossposts": 0,
        "selftext": "Full Disclaimer : Fully Retarded. \n\nNoticed the June 19 350 calls had 36.80k volume and 20,013 open interest on Friday.\n\nRelatively newer to option trading, wondering if that’s unusually high volume or standard?\n\nPossible run up anticipating there WWDC announcements?",
        "subreddit": "wallstreetbets",
        "title": "Is Apple going going to another new All Time High???",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/h8wnul/is_apple_going_going_to_another_new_all_time_high/",
        "created": 1592180185.0
    },
    {
        "author": "fruitservice",
        "created_utc": 1591809737,
        "id": "h0fg50",
        "num_comments": 81,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "What did AAPL do in the past 18 months to explain their cap growing by $500bn (to $1,5 trillion)?",
        "url": "https://i.redd.it/0woo8d93a4451.png",
        "created": 1591838537.0
    },
    {
        "author": "codingprofessor",
        "created_utc": 1591163589,
        "id": "gvo3ph",
        "num_comments": 80,
        "num_crossposts": 0,
        "selftext": "# edit: Looks like images arent previewing tonight.\n\n# tl;dr: $40c 8/21 &amp;&amp; 35c 7/17\n\n&amp;#x200B;\n\n# # Goals\n\n\\- Answer \"What am I investing in when I risk money with CloudFlare?\"\n\n# # The thesis\n\nThe economic value and convergence between e-commerce, networking speeds, and video advancements is not anywhere close to realized. There has been an acceleration toward this reality but it's still early in the overall development cycle.\n\nPhysical and monetary assets being virtualized has recently been accelerated in importance and this will have positive effects, across time, on businesses that focus on securing those assets in its time spent delivering on multiple ultra-high-speed networks across the world. Computing is getting cheaper and easier to distribute in rather extreme ways and the execution of these ideas is happening right now.\n\nThe need for secure video, transactions, VR, and user experiences will be dramatically shot up and this is evident across many exciting technologies like Apple VR, Google Gaming, Square Banking, Facebook Shops with VR shopping, Microsoft software automations, and government developments.\n\nInfrastructure that support these interactive ecosystems will be growing at incredible rates. NET is one of the best positioned companies to pioneer this market.\n\n[The networking market](https://mordorintelligence.com/images_db/RD_Images/1556091324027_Picture2.png)\n\n# # My motivation\n\nCloudFlare is releasing and bolstering support for streaming, video, and communications as a security-first cloud provider in the following week. This, on top of its rapidly growing developer platform, is consequential for many reasons as a market-mover in the industry.\n\n[CloudFlare Distributed Video Support](https://pbs.twimg.com/media/EZN7_YMVAAAE8Qg.jpg)\n\n&amp;#x200B;\n\n# # In Short\n\nCloudFlare so far has been shredding forward across multiple technical markets competing against by:\n\n\\- Competing marketshare against CISCO, Palo Alto Networks, and other hardware customers\n\n\\- Offering a way to not lock your organization into a big tech vendor\n\n\\- Promoting security and challenging Big Tech's direction with web development\n\n\\- Forming positive relationships with Shopify, Facebook, JD, Twitter, Baidu, TOR, and Microsoft\n\n\\- Pioneering the ease-of-use privacy movement with [1.1.1.1](https://1.1.1.1/) and distributing VPNs.\n\n\\- Growing a rapid, robust, cost-effective, and secure network across the world\n\n\\- **\\*\\*Providing a development platform that promotes the use extremely powerful and 'cutting edge' computing. -&gt; YOU ARE HERE**\n\n&amp;#x200B;\n\n[Cofounder of NPM - a module system where software developers shipped code. Acquired by Microsoft in the past year.](https://preview.redd.it/2upgkb0gvl251.png?width=1184&amp;format=png&amp;auto=webp&amp;s=4fc9c9c151e75d4b03671760e927bc5a75e8bc85)\n\n&amp;#x200B;\n\n# # So what is this technology anyway? A content delivery network.\n\nCDNs are distributed datacenters. This technology has been rapidly improving in the past 5 years and has drastically reduced the cost of business for small businesses and enterprises alike.\n\nThinking trucking logistics. You need to load up and send heavy duty materials, safely, quickly, and across multiple checkpoints along a highway.\n\nAn easy way to think about CDNs is to imagine it as the E in 4G LTE (Long Term Evolution). Through the power of CDNs, you're able to render images, videos, streams, content, data, transactions, privacy, and much more through the network.\n\n&amp;#x200B;\n\n[Securing digital assets on a reliable infrastructure for the most intensive computing cases.](https://preview.redd.it/dnpn9c3t4m251.png?width=2210&amp;format=png&amp;auto=webp&amp;s=2be51c709a803d5dbac47c4bb471d9ca77bc047c)\n\n&amp;#x200B;\n\n\\# Why does this market matter? Competitive advantages\n\nThe reason Snapchat did not gain any traction did not gain any traction outside of the US was because Facebook provided a fundamentally faster service across WhatsApp and Instagram. Facebook's investment in networking infrastructure allowed them to create a product that was fast , cheap and would work in various rural or economic conditions. Snapchat never stood a chance in the global social media landscape as a result.\n\n&amp;#x200B;\n\n# # What's special about CloudFlare as a network?\n\nWhat CloudFlare specifically offers against its competitors is its privacy-first approach. CloudFlare is essentially a distributed private network (VPN) with a massive infrastructure effort to send data around the world safely and cheaply. Privacy and speed sells.\n\n[Facebook: \"The future is private\"](https://preview.redd.it/gn6ibx4p4m251.png?width=1306&amp;format=png&amp;auto=webp&amp;s=8a88aa1e694ab0e62af8856bdeae914f62cd7182)\n\n&amp;#x200B;\n\n[Cloudflare grows with security](https://preview.redd.it/me09oa3pem251.png?width=2332&amp;format=png&amp;auto=webp&amp;s=658486274c4b3c61fa689c5166b14f8c5775a953)\n\n&amp;#x200B;\n\n# # What is serverless computing?\n\nServerless computing allows a 25 year old developer like me run 5 different businesses on my dinky little Macintosh while I let Google and Cloudflare run my servers under an extremely cheap pricing model. That is a revolutionary change for software.\n\n\\&amp;#x200B;\n\n[Google's ML kit offers developer solutions for common machining problems](https://preview.redd.it/bv4j6nx47m251.png?width=2494&amp;format=png&amp;auto=webp&amp;s=7989e5953258cc5bcc3293971a5780595e949c71)\n\n\\&amp;#x200B;\n\n[Cloudflare lets you create your own and distribute them.](https://preview.redd.it/6n4sn4gc7m251.png?width=1530&amp;format=png&amp;auto=webp&amp;s=cd8b30aa9608e4e4e3d959820716b33b29548898)\n\n&amp;#x200B;\n\n\\# Where Does CloudFlare currently stand in the market?\n\n[In 2020, security and delivery increases.](https://preview.redd.it/spptqgf6yl251.png?width=600&amp;format=png&amp;auto=webp&amp;s=8020aaaacfa37fe2f493f2c7a7b7c6dd4e2f7174)\n\n&amp;#x200B;\n\n[CRWD now at 19.7B, Z-Scaler at 13.3B](https://preview.redd.it/afq494qjzl251.png?width=1154&amp;format=png&amp;auto=webp&amp;s=3a89e1ee92fc1a9c373a9a1109497960231f076d)\n\n[An iron lock on VPN and distributed security](https://preview.redd.it/powropc40m251.png?width=1224&amp;format=png&amp;auto=webp&amp;s=27205ea3a6e282963f801fbf5d4583facbf84c91)\n\n&amp;#x200B;\n\n[Competes against vendor lock in. Cloudflare vs Amazon Cloudfront CDN](https://preview.redd.it/1x6gfsjd0m251.png?width=2444&amp;format=png&amp;auto=webp&amp;s=2d4d6b797bfda3d9f3829f16af6d8bdae392485d)\n\n&amp;#x200B;\n\n[Increases competition in the serverless/cloud computing space](https://preview.redd.it/wrofhb001m251.png?width=1612&amp;format=png&amp;auto=webp&amp;s=b400f0f5bc056d03d7aac046f609f3bcba4ce431)\n\n&amp;#x200B;\n\n[Drastically more edge locaitons than Amazon and Google.](https://preview.redd.it/un437p0u1m251.png?width=800&amp;format=png&amp;auto=webp&amp;s=58d7d269c33eff2868f8316768242960d9fe86c8)\n\n[As a DNS provider](https://preview.redd.it/4yo9rbd64m251.png?width=2472&amp;format=png&amp;auto=webp&amp;s=cc96b24eb9507f30cc6920f4b0d94e2b2a7ecc87)\n\n&amp;#x200B;\n\n# # So what does this mean for CloudFlare?\n\n# ## The missing puzzle piece: CloudFlare TV and Cloudflare Streaming\n\nA big piece that's missing from Cloudflare's economic puzzle is the release and support of distributed video and video development\n\n[Closing the gap on Fastly's primary product (media management)](https://preview.redd.it/1u6lp2as7m251.png?width=1798&amp;format=png&amp;auto=webp&amp;s=815098ee5393a88f35af86017f61c38fa7a2c531)\n\n&amp;#x200B;\n\n[Piece 1: Distributed, private, secure networking](https://preview.redd.it/zoi83xlahm251.png?width=2178&amp;format=png&amp;auto=webp&amp;s=8373be8ffc9e1f1bd54c81b5cde0fc40db98386c)\n\n&amp;#x200B;\n\n[Piece 2: Distributed, private, secure streaming](https://preview.redd.it/v0h5qneggm251.png?width=2262&amp;format=png&amp;auto=webp&amp;s=20990db7b1063a8f6f72b8d63aa8ce1087c3c9de)\n\n&amp;#x200B;\n\n[Piece 3: Distributed, secure, private IT](https://preview.redd.it/j6pnlun3hm251.png?width=2416&amp;format=png&amp;auto=webp&amp;s=08e1eb6556bd86af62096b12ec59e07b00dd2e0a)\n\n&amp;#x200B;\n\n[Piece 4: Distributed, private, secure software development](https://preview.redd.it/h7osbezxgm251.png?width=2330&amp;format=png&amp;auto=webp&amp;s=e1534e944349784a59cad390074ae2f94b9d8220)\n\n&amp;#x200B;\n\n[Piece 5: The missing piece. Distributed, private, secure video.](https://preview.redd.it/kklpe6mrgm251.png?width=1196&amp;format=png&amp;auto=webp&amp;s=c42fbada434f23fbe03b151004fd57b69f236bd9)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # My record\n\nI'm fairly conservative in my choice to purchase option or stock. I'm a software engineer that's passionate about education and have really enjoyed exercising my knowledge-base during this investment time. Usually i get really excited about a stock or two at best per year based on certain global developments. These stocks are selected based on powerful and consequential market relationships or competitions occurring in the and simply just participating in the market as much as I can myself.\n\nI have made a fair amount of money with\n\n\\- Bitcoin &amp; AMD's computing relationship (Bought bitcoin at 2k, AMD at $11)\n\n\\- E-Commerce and Facebook's growing relationship with small businesses (my first options were 20x FB)\n\nI'm currently investing heavily in\n\n\\- Privacy **\\[\\*\\*CloudFlare, Big Tech, US, China, and global development\\*\\*\\]**\n\n\\- Automation, manufacturing, and battery improvements **\\[\\*\\*Panasonic, FANUC, Texas, Mexico and Japan\\*\\*\\]**\n\n\\- Mexican-American trade **\\[\\*\\*Kansas City Union, USMCA, and the Mexican economy\\*\\*\\]**\n\n\\- Virtual Reality, gaming, AI with user-experience support, and fintech **\\[\\*\\*Zoomers &amp; you\\*\\*\\]**",
        "subreddit": "wallstreetbets",
        "title": "Cloudflare and CloudflareTV - A visual guide to understanding CDNs, security networking, and cloud computing for non-technical investors.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gvo3ph/cloudflare_and_cloudflaretv_a_visual_guide_to/",
        "created": 1591192389.0
    },
    {
        "author": "Rmac38",
        "created_utc": 1592326621,
        "id": "ha7ute",
        "num_comments": 77,
        "num_crossposts": 0,
        "selftext": "I just started my youngest brother on a good path. As a graduation present I had him open a Robbinhood account and gave him tech stocks $AAPL, $MSFT and $SNAP.\n\nIf I started investing at 18 I would be retired now and living on some tropical beach.",
        "subreddit": "stocks",
        "title": "New High School Grad Present",
        "url": "https://www.reddit.com/r/stocks/comments/ha7ute/new_high_school_grad_present/",
        "created": 1592355421.0
    },
    {
        "author": "usd2won",
        "created_utc": 1593128695,
        "id": "hfww9k",
        "num_comments": 74,
        "num_crossposts": 0,
        "selftext": "Premium for an year out $AAPL call options for 3 lots is almost $20k.  Why don't more of you guys do this?  &gt;10% guaranteed profit a year seems too good to me, or is there a catch?",
        "subreddit": "wallstreetbets",
        "title": "Why don't you retards sell covered calls",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hfww9k/why_dont_you_retards_sell_covered_calls/",
        "created": 1593157495.0
    },
    {
        "author": "CplKill",
        "created_utc": 1592493996,
        "id": "hbgqj1",
        "num_comments": 72,
        "num_crossposts": 1,
        "selftext": "Sup Autists,\n\nIf you caught my last DD on SWBI  [https://www.reddit.com/r/wallstreetbets/comments/gv9ilv/swbi\\_is\\_the\\_play/](https://www.reddit.com/r/wallstreetbets/comments/gv9ilv/swbi_is_the_play/)  \\-- I hope you're swimming in honey mustard today and didn't paper hands like a bitch for the down week before it jumped 30%.\n\n&amp;#x200B;\n\nToday we're talking about Fitbit (**FIT**)\n\nIf you don't know already,  Google announced last November they were planning on acquiring Fitbit for $2.1B, or $7.35 per share in cash. [https://markets.businessinsider.com/news/stocks/fitbit-stock-price-jumps-after-google-agrees-to-buy-company-2019-11-1028651757](https://markets.businessinsider.com/news/stocks/fitbit-stock-price-jumps-after-google-agrees-to-buy-company-2019-11-1028651757) \n\nNews has been mum for the most part since then, mainly due to the rona and Fitbit's share price has slowly bled down to $6.25 as of this post. \n\nRecently, however, Google has been moving forward with it's plans for the acquisition, having just formally notified the European Commission in writing.[https://ec.europa.eu/competition/mergers/cases/additional\\_data/m9660\\_387\\_3.pdf](https://ec.europa.eu/competition/mergers/cases/additional_data/m9660_387_3.pdf)  \n\nThe plan faces some hurdles. European regulators have until July 20th to decide if they want to block, and various privacy protection groups are raising concerns.  [https://www.euronews.com/2020/06/17/eu-commission-must-block-google-s-acquisition-of-fitbit-says-data-protection-ngo](https://www.euronews.com/2020/06/17/eu-commission-must-block-google-s-acquisition-of-fitbit-says-data-protection-ngo) \n\nAustralia also has concerns:  [https://www.reuters.com/article/us-fitbit-m-a-alphabet/google-fitbit-deal-may-hamper-competition-australian-regulator-idUSKBN23P032](https://www.reuters.com/article/us-fitbit-m-a-alphabet/google-fitbit-deal-may-hamper-competition-australian-regulator-idUSKBN23P032) \n\nSo if the deal faces so many hurdles, how we gonna make any money if it falls through?\n\nSimple, it's money.\n\n[https://appleinsider.com/articles/19/03/20/google-up-to-94-billion-in-total-fines-to-eu-with-latest-17-billion-adsense-penalty](https://appleinsider.com/articles/19/03/20/google-up-to-94-billion-in-total-fines-to-eu-with-latest-17-billion-adsense-penalty#:~:text=Google%20up%20to%20%249.4%20billion%20in%20total%20fines%20to%20EU,latest%20%241.7%20billion%20AdSense%20penalty&amp;text=The%20European%20Commission%20has%20fined,the%20region%20to%20%249.42%20billion.)\n\nThe EU has already raked in $9.4 billion dollars via fines from Google for various offenses. Between the obvious backhand deals that are gonna take place to grease some palms, and the regulator's chance to smack google with another billion dollar fine or two a year down the road over some perceived data offense, why would they block the chance to rake in free money when there's already a precedent for billion dollar+ fines?\n\nSo let's say the deal goes through and the European Commission doesn't block it. Fitbit is already one of the top 100 owned stocks on Robinhood, meaning once the deal gets approved by the EC everyone with ownership in Fitbit already will immediately see the news. Current stock price has over a dollar it needs to gap up to get back to that $7.35 target, so we have pretty much immediate upside if the acquisition passes the EC on the 20th.\n\nFinally, there's China.\n\n [https://9to5google.com/2020/06/17/smartwatch-market-q1-2020-report-fitbit-wear-os/](https://9to5google.com/2020/06/17/smartwatch-market-q1-2020-report-fitbit-wear-os/) \n\nSmartwatch market grew 12% in Q1, but it wasn't Apple Watches leading the charge, it was Huawei. Fitbit has also under performed year over year as far as market share...whereas Google's Wear OS isn't even in the top 5 smart watches. So, a Chinese company is capturing considerable market share of the wearable Internet of Things marketplace and we're gonna block 2 US companies from merging to create another competitor? \n\nOptions are dirt cheap right now for August. Relatively low volume but again, it's one of the most owned stocks on Robinhood. As we get closer to the 20th, i expect more news to come out that will help drive hype, we may see a bump even leading up to then. Fitbit also releases earnings on July 29th, so there's a secondary earnings play we can make as well on that run-up.\n\nWorst case scenario: The entire deal gets blown up, Google backs out, Autists pile into Fitbit stock like a Hertz rental car and for no discernible reason the stock moons anyway. \n\nTLDR/Positions or Ban:\n\nFIT 8/21 7c, 8c, 9c",
        "subreddit": "wallstreetbets",
        "title": "How are you going to FIT all these tendies in your mom's basement?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hbgqj1/how_are_you_going_to_fit_all_these_tendies_in/",
        "created": 1592522796.0
    },
    {
        "author": "ExperienceIn69",
        "created_utc": 1593544589,
        "id": "hiu2ys",
        "num_comments": 71,
        "num_crossposts": 0,
        "selftext": "If you invested in **Bitcoin** in 2010...\n\nIf you invested in **Apple** in 2007...\n\nIf you invested in **Netflix**...\n\nYeah, i could've also created **Microsoft**...\n\nBut i **didn't**.\n\nIt's foolish to look back at things you **didn't do**.\n\nFocus on the **Present**.\n\nFind gaps in the market you can **make money** from.\n\n&amp;#x200B;\n\nOn the other side buy TSX:MTY you won't regret.",
        "subreddit": "CanadianInvestor",
        "title": "Investors should focus on the present",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/hiu2ys/investors_should_focus_on_the_present/",
        "created": 1593573389.0
    },
    {
        "author": "ReflectAA",
        "created_utc": 1592494304,
        "id": "hbgu2r",
        "num_comments": 70,
        "num_crossposts": 0,
        "selftext": "**5. PINS Pinterest**\nWhat’s to like: they cornered a niche segment and are planing to build a referral system. Not only will that create much more revenues, but it will create a barrier of network effects that will make it impossible for another company to replace them.\n\nRisks: A shaky economy throws into question if anyone even has a need for this type of service in a few years. You’re not gonna look at things to buy if you have no money to buy things. And network effects might guard well against new competitors but it doesn’t guard against old ones. For example, Facebook already has the network scale to capture this market. But as Google Plus has shown, throwing money and scale at an idea is not a an automatic success. A competitor still has to outmaneuver and out-execute. \n\n**4. BA Boeing**\nThis company has a long and painful road ahead of them, and a huge culture problem that throws into question the quality and reliability of Boeing products. But like Comcast, you can hate them all day as a customer but none of that really matters unless you have another choice. Most airlines do not. Absurd barriers to entry in an industry most people don’t even want to bother with means Boeing will be entrenched for a long time no matter how badly they screw up. But not screwing up is a plus and it’s likely the new CEO brings them in that direction. \n\nRisks: If airlines are the worst industry to invest in, a company that depends on them isn’t far behind. Empty airplanes could be a devastating scenario. Boeing might be too big to fail but that doesn’t mean its shareholders are. This company is not immune to bankruptcy if the pandemic continues for a long time.\n\n**3. GM General Motors**\nThis company is boringness defined but their CEO Barra is magnificent and has given them a whole new level of resilience and efficiency that most manufacturers never reach. They also have an EV segment (Cruise LLC) that people are still overlooking. \n\nRisks: In a recession, a new car is the very last thing anyone ever buys. And while they have a well oiled machine, it’s not an invincible one. Bankruptcy caused by economic shock will always be risk #1 for any auto company. \n\n**2. Disney**\n...Just copy and paste what I said about Boeing but replace “airplanes” with “theme parks.” Disney has incredible brand equity and a stranglehold on the media industry. And all evidence shows that the next generation of children love them just as much, and Disney+ will be a huge growth catalyst for years to come. \n\nRisks: Disneyworld doesn’t have to literally be empty for it to be devastating.  Even a 10% reduction in attendance is a huge sum of money.  So any news along the lines of “turns out a vaccine isn’t possible oops” will be a major downer for your money invested here. Disney+ is also a bit shaky at this time. Disney is going to have to step up its game. \n\n**1. Apple**\nYears ago, Apple made huge investments in services and network growth and investors completely missed it. Even if no one buys an iPhone all year Apple will still see many billions in revenue due to royalties, licenses, advertising, and direct sales of Music and TV. The more this goes on, the more entrenched Apple will become. Imagine having 2 Apple speakers, an IPad, and a Mac, and then deciding to switch away from iPhone? It’s not going to happen. That “Apple Ecosystem” will lock everyone in and keep the money flowing in, regardless of where exactly the money comes from.\n\nAnd all evidence shows people still want to buy iPhones. \n\nRisks: Antitrust crackdowns can negate everything in the above paragraph, and Apple is already being investigated for exactly that, in multiple countries, including half of Europe. The valuation is also already quite high, so even a  small misstep will impact your investment. \n\nHonorable mentions: Intel, Cloudflare, Starbucks, Raytheon, and Amarin Corp all round out the top 10. \n\nTL;Dr: Apple, Disney, GM, BA, Cloudflare, and Pinterest are my favorite large cap investments right now. I’m only a guy on the internet. Do your own research before making any investment decisions.",
        "subreddit": "stocks",
        "title": "My Top 5 picks in the SP500",
        "url": "https://www.reddit.com/r/stocks/comments/hbgu2r/my_top_5_picks_in_the_sp500/",
        "created": 1592523104.0
    },
    {
        "author": "leontes",
        "created_utc": 1591793707,
        "id": "h0ac1c",
        "num_comments": 67,
        "num_crossposts": 0,
        "selftext": "About twenty years ago, I had just graduated college. My grandfather had died years ago,  and he had left me a small amount to invest which was an account that, now graduated, I had access to. \n\n He had utilized a stock broker  and I was to  meet  with him. \n\nI was on a bit of a  tear.  I had just gotten my liberal arts degree, and  thought  I was  super smart.  And in all the arrogance of a sure-fire smart “kid” coming out of a liberal arts school and still buzzing a bit from the dotcom boom,  I  learned that I could make my own trades for 29.95 using s new site called “E*Trade”.  I spoke to my Dad about it, he said, talk to  broker,  but if that’s what you want to, do, it’s  your money (sort of with the whole, I wouldn’t do it, but go for it, I guess, attitude)\n\n I spoke to the broker for  the first time, and  after his pitch of  what the portfolio had done in the last five years and some  stocks I was going buy, it all sounded reasonable and good.  He seemed to know what he was talking about, but I still, in my  pushy arrogance of late adolescence , inquired how much I paid him per trade.  it  was considerably more than 30 dollars. I then asked if  I could make some suggestions  as to what we could buy.\n\n“What were you thinking of?”\n\n“Apple, for one,” I said.\n\n“Oh no, I don’t know about that.  They’ve had a lot of issues the last few years, and I wouldn’t recommend it.”\n\nMore due to cost differential per trade than this vague analysis, I told him I think I’m going to go my own way.   I put about 1200 bucks into Apple, some less into the online book store  “amazon”, and a couple of index funds,  and a few other companies, that I  thought had a lot interesting hype around them.\n\nSure enough, my apple investment looked horrible to start, losing about 40%  of  the value  within three months.  Same with Amazon.  I decided, though, to do nothing, and I was onto do different things.  I never  sold those shares, and today they’ve are  pretty close to appreciating to  10,000%.  I bought Apple a few more times throughout my life, and that  one stock has accrued in value (I mean, all of it theoretical, I suppose, unless I do sell)  about the same for me  than my paychecks throughout my career.\n\nI have generally  picked winners. I own shares in Sam Adams, in Tesla, in google, in facebook, in nvidia, etc.  and still have those index funds, that did quite well as everything has over  the last twenty years.\n What’s the lesson in all of this? I don’t think there is one. Get lucky. Don’t sell. And listen to  yourself, I  guess.",
        "subreddit": "stocks",
        "title": "Buying and holding AAPL for twenty years",
        "url": "https://www.reddit.com/r/stocks/comments/h0ac1c/buying_and_holding_aapl_for_twenty_years/",
        "created": 1591822507.0
    },
    {
        "author": "cwsmay",
        "created_utc": 1592608855,
        "id": "hcb67p",
        "num_comments": 64,
        "num_crossposts": 0,
        "selftext": "As I look at my own account and the rest of those posting on gain/loss Friday, I notice most are sub $10k, and many sub $1k.  I than think why is it that the old guard investors frown upon the entry of the Robinhood investor (ok, true I know many of us newbies use other platforms, but for generality we keep with Robinhood).\n\nWhile I know that the Robinhood investor is inexperienced and often irrational.  They are also prone to chase and fall to FOMO.  However I ask myself why do experienced investors not want these new investors in the markets, while despite most being small accounts, their are millions of new small accounts which add up.  I suspect it is this irrationality of the Robinhood investor that draws the most ire, because it upsets the apple cart and the old way of market predictability to make money is changing.  Add to that the Robinhood investor lately has outperformed money managers which further adds to the ire.  Lastly, I don't think the money managers like us playing in their sand box\n\nI would add the Robinhood investor is here and many are here to stay, so its time for the money managers to adapt to a new way of investing.",
        "subreddit": "pennystocks",
        "title": "The effects of the Robinhood investor.",
        "url": "https://www.reddit.com/r/pennystocks/comments/hcb67p/the_effects_of_the_robinhood_investor/",
        "created": 1592637655.0
    },
    {
        "author": "Investinwaffl3s",
        "created_utc": 1591138109,
        "id": "gvhs5y",
        "num_comments": 62,
        "num_crossposts": 0,
        "selftext": "Any good stonks to park my winnings on? Ideally something that won't go tits up (barring a general market crash)?\n\nI am already parked on AAPL, AMZN, BABA (bought in April).\n\nLast week I put a bunch into CSCO and FLIR which worked out nicely.\n\nI am thinking of buying shares of AMD and SNE, but I have no idea what else to buy. Maybe MSFT but I want something that is not near ATH and still has predictable room to grow",
        "subreddit": "wallstreetbets",
        "title": "Need some long term stonks to park some winnings at",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gvhs5y/need_some_long_term_stonks_to_park_some_winnings/",
        "created": 1591166909.0
    },
    {
        "author": "yooniepark",
        "created_utc": 1592576766,
        "id": "hc1maf",
        "num_comments": 62,
        "num_crossposts": 0,
        "selftext": "tl;dr at the end\n\n# How Google Glass failed\n\nFollowing list was key reason why intensely hyped Google Glass failed miserably.\n\n* **How to use** – The product did not provide much meaningful feature to user\n* **Privacy concerns** – People got pissed for shoving camera in their face without consent\n* **Looked ridiculous** – It looked unnatural and very awkwardly looking.\n* **Battery life** – It lasted 2-3 hrs\n\n# How will Apple make it work\n\n**How to use?** – Basically, it will have most of Apple Watch functionality such as notification popping up and answering calls but improved with screen size plus without having to look at your wrist every time, **Key difference between Apple Watch and Apple Glasses is Apple Glasses will be able to place notification and information on actual objects or places in real world**. Which is huge.\n\nSome specific examples uses of AR\n\n* Displaying iPhone battery percentage over your pocket when you look at your pocket.\n* Displaying direction on the street so you won’t have to look at your iPhone or Apple Watch constantly\n* For example, touring in Paris, when you look at Eiffel tower it gives you basic historical facts right next to Eiffel tower.\n* Displays google/yelp reviews on restaurants door as you walk pass it.\n\nApple’s huge cash pile allows Apple to fund R&amp;D for VR tech and it’s already buying VR companies like NextVR – company that provided VR live events for NBA games, WWE, boxing, NHRA, ICC soccer, concerts, exclusive behind-the-scenes music experiences and stand-up comedy events.\n\nAlthough Apple Glasses will integrate iPhone notification lot better than Apple Watch, **it won’t cannibalize it**. Apple Watches have the features that Apple Glasses can’t have, health sensors + NFC for Apple Pay (unless you want to put your face on the NFC reader) + finger print authenticator + haptic sensor feedback.\n\n**Privacy concerns** – Use of Lidar censors, simple.\n\nFor people who aren’t familiar with what is Lidar I personally copy pasted Wikipedia’s summary to save you a click, *“Lidar is a method for measuring distances by illuminating the target with laser light and measuring the reflection with a sensor. Differences in laser return times and wavelengths can then be used to make digital 3-D representations of the target”.*\n\nLidar sensors are already being wildly used on self-driving car and proving their accuracy and usefulness.\n\n**Looked ridiculous** \\- Looking past history, Apple were able to make initially hated and memed Airpods into fashion statement and mega hit. I have no doubt Apple will do the same to Apple Glasses, leaked information also suggests they will look like glasses with prescription as well. Not only It won’t look ridiculous, I believe it will become fashion statement and status symbol like Airpods and Apple Watch.\n\n**Battery** – Having vertical integration of hardware and software, Apple is king of battery optimization and power to battery efficiency.\n\n&amp;#x200B;\n\nApple’s seaming-less iCloud integration between devices will let Apple Glasses complete the apple wearable saga. Although, I doubt first generation of Apple Glasses will be able to pull everything off smoothly, but I am certain it will lay foundation for next generation of Apple Glasses to become essential product line to Apple ecosystem and start the AR glasses race.\n\n# How Apple Glasses will dramatically boost revenue\n\nWith acceptable price tag Apple Glasses itself will sell like hot candies. Just how buying Apple Watches alone without iPhone doesn’t do much, Mass audience’s interest in Apple Glasses will draw them into Apple’s ecosystem, boosting entire Apple’s product line. **Airpods for audio support + Apple Watch for health and fitness info, Apple Pay, and authenticating fingerprint + iPhone being hub to connect all wearables.**\n\nMy bet is that Apple will integrate their Apple Watch tightly with Apple Glasses, displaying health and fitness info and working as an authenticator with its fingerprint censor. There’s a rumor next Apple Watch will include Touch ID on the watch crown, showing Apple’s intentions to give the Watch sort of health tracker with personal authenticator position if rumor is true.\n\nI have doubts on Apple Glasses’ long media viewing experience due to its transparent display. But if it’s pleasing enough, it will also boost Apple TV subscription.\n\n**Being able to argument reality means meaningful personalized ads for users.** For example, it will give you small pop-up suggestion to dine in some restaurant when walk pass it. Or gives you hotel suggestion when you are on a trip.\n\nAlso it’s very important Apple Glasses experience will be **very hard to replicate** from other competitors since creating well baked ecosystem with all devices aren’t easy, not to mention their ARM chip’s battery optimization.\n\n&amp;#x200B;\n\ntl;dr: Apple Glasses will do what Google Glass couldn’t and It will sell crazy, pulling them into Apple’s ecosystem prison.",
        "subreddit": "wallstreetbets",
        "title": "Apple Glasses DD and how it will go brrrrrr",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hc1maf/apple_glasses_dd_and_how_it_will_go_brrrrrr/",
        "created": 1592605566.0
    },
    {
        "author": "PostKevinMelone",
        "created_utc": 1592608223,
        "id": "hcazmt",
        "num_comments": 62,
        "num_crossposts": 0,
        "selftext": "What do we not have enough of right now? Tendies. \n\nWhat else? Marijuana.\n\nWhy is there a risk of deflation, rather than inflation? Because people don’t want to spend their tendies.\n\nWhat is green? Tendies. \n\nWhat else? Marijuana.\n\nThus, tendies == marijuana.\n\nHow can states fast track the recovery of the economy? Legalization.\n\nWhat happens when states legalize? People spend their tendies.\n\nWhat happens when people spend their tendies? Tendies circulate.\n\nWhat else happens? Autists pay a lot of taxes.\n\nWhat does this mean? Economy to the moon and inflations begins to take ahold.\n\nEdit: I don’t have a current position yet because I went all in AAPL and MSFT like a true autist. But, I am going to slowly go long on some companies. Not sure which ones yet.\n\nEdit: Maybe go long THCX ETF. Feeling 1/15 Exp or longer once it becomes available.",
        "subreddit": "wallstreetbets",
        "title": "Expect rampant marijuana legalization in couple of years",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hcazmt/expect_rampant_marijuana_legalization_in_couple/",
        "created": 1592637023.0
    },
    {
        "author": "elephantrypus",
        "created_utc": 1593024826,
        "id": "hf6xnx",
        "num_comments": 60,
        "num_crossposts": 0,
        "selftext": "I work in tech and hence I thought I'd share my thoughts on Apples tech and their impressive planning and execution. Let me preface this by saying that I am not qualified to judge whether Apple the stock is fairly valued however I can add some informed comments on why I think Apple has a very good moat in terms of technology and why Apple devices will continue to command a premium margin for many years to come :\n\n**Long term planning + Vertical Integration**\n\nTheres none of the move fast and break things culture over at Apple. They take the time to get things right. They also control all layers of the stack. Long term planning plus full control means that Apple can pull things off that its competitors would struggle with. Lets see what they just did at WWDC:\n\n* Announced that all Macs would move to the same SoC as iPhones\n* This means that in a few years all Mac apps can run on iPhones and iPads and vice versa\n* These chips are way ahead of Intel in terms of performance and power consumption. Its not even close.\n* No other laptop maker will even be able to approach this at scale any time soon.\n\n**Privacy**\n\n* Apple is the strongest on the privacy front.\n* This is a very smart long term stance because as technology becomes more and more intimate you want the guarantee of absolute privacy. If your AR glasses could read your thoughts you don't want that going to a company you don't trust.\n* This means Apple is well positioned for the intimate future of tech.\n\n**Growing services story**\n\n* Apple Card , Apple Pay and maybe Apple Health. This means Apple is now a monster service business that will keep generating recurring revenue.\n\n**Pieces falling into place for the next big product**\n\n* The same long term drive and vision is now being applied to next gen technologies like AR and VR.\n* Apple announced a feature called App clips that allows quick App / AR experiences to launch in response to a QR code. Now this might not seem like much but ...\n* When apple glass launches these AR experiences will be ready to go at thousands of places. Think being able to walk up to your Lime scooter. Your Apple glass scans the QR code logs you in and off you go on your scooter.\n* Spatial Audio built into airpods can deliver subtle 3D audio cues that alert you to potential AR experiences.\n* A highly optimized UI framework called SwiftUI which developers are using to build iPhone apps from now will carry over to Apple Glass.\n* Bloomberg published a piece about Apples new VR headset. I already own an Oculus Quest and I use it every day. Apple will definitely be able to push the display resolution to never before seen levels and achieve a polish that Facebook cannot. At that point it becomes almost like being lost in another world.\n\nWill all of these translate to sustained margins ? Will Apple Glass be a successful enough product ?\n\nI don't know.\n\n**TL;DR - Its highly likely that Apple will continue to crush its competition in terms of UX and margins on devices.**\n\nEager to know what others on this sub think.",
        "subreddit": "investing",
        "title": "My Thoughts On Apples Growing Lead Over Its Competitors",
        "url": "https://www.reddit.com/r/investing/comments/hf6xnx/my_thoughts_on_apples_growing_lead_over_its/",
        "created": 1593053626.0
    },
    {
        "author": "WhiteHoney88",
        "created_utc": 1592617912,
        "id": "hcdl1e",
        "num_comments": 59,
        "num_crossposts": 0,
        "selftext": "I bought a bunch of MSFT, GOOGL, AMZN, AAPL and a bit of VEEV today. Should I have waited? Or doesn’t it really matter since I’m long. I know stocks are higher but these techs aren’t that phased that badly by covid... and even when there is a dip, they bounce back fast. Was today a bad day to go long on these stocks?",
        "subreddit": "stocks",
        "title": "Going Long Today On Tech. Dumb move?",
        "url": "https://www.reddit.com/r/stocks/comments/hcdl1e/going_long_today_on_tech_dumb_move/",
        "created": 1592646712.0
    },
    {
        "author": "bioknockout",
        "created_utc": 1592930439,
        "id": "hei0b5",
        "num_comments": 59,
        "num_crossposts": 0,
        "selftext": "Currently thinking going long on\nApple, Amazon, Tesla, Paypal, Nvidia\n\nThe (obvious) thought being that if I believe in a company enough to buy/use their product or service, that should be a strong enough signal. \nWhich other companies fit the profile? AMD, Disney?",
        "subreddit": "wallstreetbets",
        "title": "New investing theory. If I use a companys product more than twice a day, I will also get their stonk. Wdyt?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hei0b5/new_investing_theory_if_i_use_a_companys_product/",
        "created": 1592959239.0
    },
    {
        "author": "once-upon-the-end",
        "created_utc": 1593475793,
        "id": "hic6o3",
        "num_comments": 54,
        "num_crossposts": 0,
        "selftext": "BLNK - killer AH today, news came out last week about Apple Maps featuring BLINK charging stations \n\nIDEX - a lot of hype, and Investors forum tomorrow with CEO Alf Poor\n\nSOLO - saw a lot of movement today, and with EV plays being hot this week we can expect this one to move with it too\n\nAYRO - low float, did well today and can also see a lot movement this week\n\nComment below if you’re looking at any other EV plays",
        "subreddit": "pennystocks",
        "title": "My EV plays for this week",
        "url": "https://www.reddit.com/r/pennystocks/comments/hic6o3/my_ev_plays_for_this_week/",
        "created": 1593504593.0
    },
    {
        "author": "kingkrool57",
        "created_utc": 1591057097,
        "id": "guwkdz",
        "num_comments": 53,
        "num_crossposts": 0,
        "selftext": "Their earnings are coming up in a few days - 6/4. Not sure why the date is more publicized, Robinhood and Yahoo doesn't have it correct for instance, but yeah now is your chance to get in before the earnings run-up.\n\nThey are a massive semi-conductor company, meaning they make all sorts of tiny, unique parts for all sorts of devices. Apple is totally reliant on them, as are many, many other tech companies. They made most of the internal wireless antennas for the last generation of cell phones, and they are making most of the next gen ones too.\n\nNvidia is also basically a semi-conductor firm and look at their recent results. I think AVGO will go on a similar run. It's just a clutch industry for the big boys.\n\nStill around 20% under pre-corona levels, unlike most stocks in tech.\n\nIVs for June 19th are literally still less than 40%, you will make a killing just from the IV crush.\n\nVery well run company. Rarely miss earnings, but did so in Q1 2020, so lowered expectations this time around. Almost every analyst has them with a Buy or Strong Buy rating.\n\nI personally will be buying 6/19 $330 and $340 calls.",
        "subreddit": "wallstreetbets",
        "title": "Broadcom $(AVGO) upcoming earnings play",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/guwkdz/broadcom_avgo_upcoming_earnings_play/",
        "created": 1591085897.0
    },
    {
        "author": "seekanddstry",
        "created_utc": 1592932081,
        "id": "heiivh",
        "num_comments": 53,
        "num_crossposts": 0,
        "selftext": "AAPL to 420 by 7/2. Rumors became news and this stock is skyrocketing. Now all we need is Tim Cook to go smoke weed with Joe Rogan. Make your money while you can, stocks only go up",
        "subreddit": "wallstreetbets",
        "title": "AAPL to 420",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/heiivh/aapl_to_420/",
        "created": 1592960881.0
    },
    {
        "author": "marabou_stork",
        "created_utc": 1592420954,
        "id": "haxwso",
        "num_comments": 52,
        "num_crossposts": 0,
        "selftext": "The FT recently published an article arguing that Warren Buffett and Berkshire Hathaway are [losing their touch](https://www.ft.com/content/ee69a200-6f3f-4c0e-948b-37e8f9519077).\n\n* The company is sitting on [$137B in cash](https://markets.businessinsider.com/news/stocks/why-warren-buffett-unhappy-berkshire-hathaway-record-137-billion-cash-2020-4-1029181516).\n* They typically avoids industries [Buffett says he doesn’t understand](https://business.financialpost.com/investing/buffetts-apple-losses-make-his-track-record-in-tech-even-worse), like technology or biotech.\n* As a result, it’s been doing quite poorly over the past 6 months, [losing about 20% of its value](https://finance.yahoo.com/quote/BRK-A?p=BRK-A&amp;.tsrc=fin-srch).\n\nWarren Buffett is a more seasoned and successful investor than I am; I’d like to defend him and his strategy. He’s not losing his touch, but his industry focus shows what the broader investment community gets wrong – and what your own advisors or analysts might also be missing.\n\nBerkshire Hathaway invests in traditional, tangible asset-focused companies. This includes banks, insurance companies (they own GEICO), railways, and until recently, airlines.\n\n* This strategy works well in how they approach value investing; they understand when companies take risks with their physical assets and how much those assets are truly worth.\n* These investors have a sophisticated and non-consensus (compared to other investors) view on how to depreciate assets properly, [how to avoid metrics like EBITDA](https://www.oldschoolvalue.com/investing-strategy/buffett-klarman-ebitda/), and how to think about a company’s long-term potential.\n* They have a deeply sophisticated view of how infrastructure, physical assets, and financial assets work.\n* This allows them to make very long-term bets and find opportunities that other investors miss due to their focus on P/E ratios and accounting jargon like EBITDA.\n\n***The fact that they’re not investing right now tells me they don’t see good opportunities in these traditional spaces*** (like banking, retail, transportation, and consumer goods).\n\n***But the term “traditional” is important.***. It tends to avoid hard and soft technology companies, like those in information technology, social media, and biotechnology. Many investors still don’t completely understand how “hard” and “soft” technology investments work and how to price them.\n\n* Many companies (e.g., Google, Shopify, Facebook) tend to be physical asset-poor but data-rich. [Valuing data is *very* difficult.](https://press.princeton.edu/books/hardcover/9780691175034/capitalism-without-capital)\n* These companies often facilitate transactions and take a cut of a broader market, rather than owning the market itself.\n* If you include “hard tech” like biotechnology research, pharma, or cybersecurity and quantum computing, then this is even more difficult.\n* Investment success depends on intangible assets generating cash *one day*, combined with experimental success in the short run. It’s immensely difficult to screen stocks or use traditional accounting measures to do so.\n\n***Case in point: how do you formally depreciate data assets?***\n\nBuffett and other traditional value and fundamental investors are being hit hard because COVID-19 is hitting the industries *they* focus on *disproportionately* hard.\n\nDigital companies, as well as ones focused on transaction facilitation and digital/data products, are particularly resilient when it comes to their business models.\n\nIn short, Buffett isn’t losing touch... But if you’re an investor that follows traditional industries then you should revisit your asset mix. Don’t just look at your stocks/bonds/cash/ETFs mix but also differentiate between traditional tangible industries/investments, and ***those which are intangible and often overlooked by asset managers following the “Oracle of Omaha”***.\n\nGiven how people view this -- I'd love to hear if YOU think about intangible vs. tangible assets, and also how you value the former.\n\n\\~\\~\\~\\~\\~\n\nNote, I [posted this online](https://chimerais.com/covid19-jun17-buffett-intangible-data-assets) for posterity as well.",
        "subreddit": "stocks",
        "title": "What Warren Buffett gets right (and wrong) on post-COVID-19 investing",
        "url": "https://www.reddit.com/r/stocks/comments/haxwso/what_warren_buffett_gets_right_and_wrong_on/",
        "created": 1592449754.0
    },
    {
        "author": "Becausereasons1",
        "created_utc": 1592147395,
        "id": "h8via6",
        "num_comments": 51,
        "num_crossposts": 0,
        "selftext": "Alright,\n\nThis post was removed from “another subreddit” without explanation. Can’t get an answer on why, but I DID NOT delete that post and I WILL NOT delete this one. I’ve cleaned up the language and humorous insults so it’s geared toward a broader audience and will treat you all like adults. \n\nI'm here to crack open the matrix and give you a framework to draw conclusions and ideas from. Much of this is known information, but I’m putting it into a context that connects the dots. \n\nAlso, now that you're in here I'm going to convince you that it's going to be a long burn down from here. Circuit breakers? Very likely. New lows? Absolutely. Do I have your attention? Proceed.\n\n**I know what you're thinking....**\n\n*\"Nobody could have seen this coming!*\n\n*\"Buy the dip!\"*\n\n*\"institutions are selling!\"*\n\n*\"Rug pull\"*\n\n*\"JPow will save us!\"*\n\nRetail is all caught with their pants down and are going to be holding Wall Street’s and the corporation’s bags. We’re the only ones left with any faith in the market going up. This is a game of musical chairs and the smart money just took the chairs and left the room.\n\nI've never posted here. I comment, I learn, I steal ideas, and I've been building my thesis while Robinhooders buy Hertz. Maybe we can discuss that later, there's no time to waste.\n\n**Few things...Keep this all in mind while we go along and if you don't know what I'm talking about just google. It's all out there.**\n\n1. We're in a bubble. We have been for a long time. Valuations are stupid, PE ratios off the charts, Nikola is big enough to enter the S&amp;P - IF IT HAD ANY EARNINGS!\n2. Debt and leverage globally absolutely DWARF the 2008 problems surrounding CDO's. You think there was a little corruption and clever lending in America's banking system? Imagine what goes on in the rest of the world\n3. Pretend Covid-19 doesn't exist. The \"crash\" in Feb/March was coming no matter what. Governments, corporations, banks all knew it was inevitable and that there is chaos in the financial system. Let's just operate under that assumption.\n4. Think of right now as being the 2008 housing crisis, but instead of houses in America it's COMPANIES IN THE WORLD (hint: its a lot bigger problem)\n5. First Crash was a liquidity crisis. Nobody had enough cash on their balance sheet to hand over to the people they owed. Think of it like when you don't pay rent. Your landlord might be financially able to take the hit, but he really doesn't want to sell his Tesla stock to pay HIS landlord and so on and so on until the entire financial system seizes up. (psst that's why it's called \"liquidity\")\n6. The fed and central banks came to the rescue the only ways they are legally allowed to. Now that's taken care of and everyone is rife with liquidity to keep the system turning. Today, we are entering a SOLVENCY CRISIS.\n\n**Part 1 - What the Fed is REALLY doing**\n\nNow... let me enlighten you for a second... THE FED DOESN'T ‘BUY STOCKS’. Well, at least not directly. If you remember one thing about the fed, remember - they are bound by RULES. They MUST keep a balance sheet like any other bank. And the money they \"print\" cannot enter the market the same way your paycheck buys condoms for your wife's boyfriend. It's there to sit on the other side of the balance sheet of BANKS or the TREASURY who can then lend \"real\" money into the economy. There's no money that gets \"out\" - It's all \"loaned\" unless it comes from \"stimulus\" which still goes through Congress and the Treasury. More on that later.\n\n**THE POINT IS THERE'S ALWAYS AT LEAST ONE MIDDLE MAN. THIS IS MASSIVELY IMPORTANT LATER!!!**\n\nHere is the breakdown of the steps the fed MUST take when conducting those \"Open Market Operations\" we've all heard about.\n\n**1. When the Fed buys government securities through securities dealers in the bond market, it deposits the payment into the bank accounts of the banks, businesses, and individuals who sold the securities.**\n\n**2. Those deposits become part of the funds commercial banks hold at the Federal Reserve and thus part of the funds commercial banks have available to lend.**\n\n**3. Because banks want to lend money, to attract borrowers they decrease interest rates, including the rate banks charge each other for overnight loans (the federal funds rate).**\n\nSee? The fed only provides \"money\" to institutions they are legally allowed to give money to (Treasury and banks). For simplicity's sake just think of JPow going into his computer and typing in a few zeroes on JP Morgan’s Computer. Doesn't matter. The fed's hands are tied and they can only control rates and print money. Oh by the way... The Fed lowered banks' fractional reserve requirement to ZERO in March. **That means banks don't have to have ANY money in the vault.** Make of this what you will.\n\n**Part 2 - Why Stimulus is Different than printed liquidity**\n\nSo now we hopefully understand where the new printing is going and how it gets there. It's going to anyone who needs a little bump to their cash pile in order to fulfill their existing debt obligations **ONLY TO KEEP THE SYSTEM WORKING.** No more, no less. Fed prints $ and banks give loans. Fed prints $ and Treasury writes checks. **NOBODY** ***WANTS*** **TO DO THIS**\n\nRead this whole article if you want, but I'll pull out what matters.\n\n[The Great Leverage Unwind](https://www.guggenheiminvestments.com/perspectives/global-cio-outlook/the-great-leverage-unwind) \\- **March 22 Before the Stimulus!!**\n\n*\"In order to get a foundation under the markets, we’re going to need something very large, something in the $2 trillion range in the form of a pool of liquidity that can be made quickly available to businesses and corporations that need it, along with the financing facilities of $2 trillion–$4 trillion from the Fed.\"*\n\n**\"Liquidity that can be made quickly available\" = YOUR STIMULUS BABY**\n\n**When it comes to getting fed money to individual companies WE are that middle man I mentioned earlier. It takes the responsibility off of the Fed, so they can claim “free market”.**\n\n**Part 3 - Creating a generation of bagholders**\n\nNow here we are at the March lows. You're locked down, sitting on a Zoom conference call and life sucks. But you're alright. You’ve still got a job and aren't really spending money. And hey, you’re are about to have a stack deposited in your Chase account.\n\n\"LOOK HOW CHEAP GAMESTOP STOCK IS!!! AND THE GUY FROM THE BIG SHORT BOUGHT IT!!! I'M A GENIUS!!!\"\n\nNo, Burry is a genius. And he’s already been dumping his bag on you. Along with TLRD, BA, FB, MIK and DISCA. Just wait until you see Scion's next quarterly filings. Hint: It ain't gonna be those companies no more\n\nSame with Buffett.\n\nSame with Ackman.\n\nSame with Hertz. \n\nOH YEAH....[YOU SOLD YOUR APPLE back TO APPLE](https://www.marketwatch.com/story/apple-expected-to-add-up-to-100-billion-to-buyback-program-while-many-companies-halt-repurchases-2020-04-22)\n\nQ2 filings will be very informative regarding who holds what. I can’t wait.\n\n-I feel I need to highlight this more. What’s it say about Apple and their stock that they made a massive share buyback “because the price is good”? DYOR \n-Also see the latest from Hertz on their insiders and buybacks. They’re raising capital from you guys. Maybe they can get out of bankruptcy, but probably you just gave them a free lunch.\n\n\nTLDR; Global economy is in a corporate debt bubble that works like housing in 2008. Only way this can be fixed is by the measures we see being taken during Covid. Retail has been MANIPULATED AND REQUIRED to perform the functions the Fed cannot(buying individual stocks). This has led to billionaires and institutions leaving retail holding the bag. It’s going to follow a bursting bubble pattern. Nobody is left to prop up the markets nor do they want to because the leverage has to unwind. Dollar might surge like last time and collapse (milkshake theory).\n\nAddition: Futures being green headed into an open just means we open higher for everyone to get a chance to dump. If you were a fund manager would you want the market to open green and THEN sell? Or sit and wait around all day for a sell price you might not get? Remember it’s all about manipulating retail. The “bounce” you figure is coming already happened overnight. Or there was selling overnight and the bounce is coming at the open. Look at the /ES charts and the market hour charts. That price action that happens in between matters to the patterns. A regular S&amp;P chart is basically cut in half. \n\nMessage me if you are interested in what I’m doing through all this.",
        "subreddit": "stocks",
        "title": "A Generation of Bag-Holders - New lows coming",
        "url": "https://www.reddit.com/r/stocks/comments/h8via6/a_generation_of_bagholders_new_lows_coming/",
        "created": 1592176195.0
    },
    {
        "author": "amadb23",
        "created_utc": 1591885416,
        "id": "h10968",
        "num_comments": 50,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "pennystocks",
        "title": "Okay but did you hear about the legend who bought Apple at $1.43?",
        "url": "https://i.redd.it/ansk83k4ja451.jpg",
        "created": 1591914216.0
    },
    {
        "author": "enronCoin",
        "created_utc": 1592456345,
        "id": "hb80hc",
        "num_comments": 48,
        "num_crossposts": 0,
        "selftext": "Hey Retards,\n\n&amp;#x200B;\n\nBefore I begin, I would like to apologize for the long break. I have been busy with work, being quarantined, and chasing hot chicks that already have boyfriends. If you've read my posts before then you already know the deal - we like to mess with dark voodoo and chains here. I'm talking chart voodoo and options chains, of course. \n\n&amp;#x200B;\n\nOkay so on the menu today we have Home Depot ($HD) and Spotify ($SPOT). These stonks are 180's from each other and have both performed exceptionally well YTD. If you held equity in these you would have reaped the tendies, but lets see if we can print some tendies playing options. \n\n&amp;#x200B;\n\nLet's start with the American classic: **$HD**. \n\n![img](dojt2x7ygl551 \"1 year chart\")\n\n![img](p4qkqgp3hl551 \"3 month chart\")\n\nO.K. so take a peak at that chart. That's a bullish flag right there you autists. We have a sharp rise in price (when the market recovered from the BIG GAY) and then a tight rising trading channel. The price fell below the trend line and is now struggling to break above intermediate term resistance levels of $250. \n\nRSI is trending towards the overbought realm, and MACD is signaling a bearish trend, although it is a weak indicator. EPS in recent quarters has been between $2-$3, lets see if they can do it again. \n\nOptions chains are pricing a $15/$13 upside/downside move after ER.\n\nI'm going to watch the volume on $HD throughout the rest of the week, but my plan here is a horizontal spread:\n\nSell the 7/17 255c and buy the 8/21 255c. The front month will expire worthless - and well before earnings - as the price of $HD hovers right above resistance levels. The idea is that IV will spike as we get closer to ER and the value of the back month option will spike with it. Sell the long leg for straight profit. Gravy. Tendies.\n\nPros: Take advantage of theta, $HD is a strong player, relatively cheap cost\n\nCons: If price moves too fast in either direction I will lose\n\n&amp;#x200B;\n\nHome Improvement wasn't your favorite T.V. show? No problem. Let's talk **$SPOT**:\n\n![img](ottqpuqqkl551 \"YTD chart\")\n\n![img](od9m6fjskl551 \"3 mo chart\")\n\nIf you aren't a total retard then you see what I see... That's right! Another bullish flag. Coronavirus hit the world and $SPOT said to the God of Death, \"Not today.\" Honestly, if you look at that graph it really wasn't hurt too much when the market tanked.\n\nWhat is there to say about $SPOT? The technicals are a mixed signal. The chart is forecasting that the stock could moon. RSI and MACD are signaling that the stock is overbought and may flip trend.\n\nIf we forget about that, though, $SPOT has hit ATHs in 2020 with relatively high trading volume in recent weeks (especially today). $SPOT recently signed podcast deals with Joe \"have you ever smoked DMT through your asshole\" Rogan and Kim Kardashian. Spotify has stiff competition from giants like Apple, Amazon and Google.\n\nThe options chain is pricing a $11.50 movement on both sides on the 7/17 expiry. Note, this is before the ER.\n\nTo be honest, when it comes to $SPOT I like the product but I don't love the stock. My recommendation here? I'm thinking cheap FDs or really wide debit spreads:\n\n$SPOT is breaching resistance levels and possibly confirming a bullish trend. This stock could rocket. I'm going to watch price action for momentum continuation and then pick up some 7/17 220c or 230c. These are so cheap and have high volume and open interest. The 210c is more likely to hit, but I want FDs here to take advantage of the IV before earnings.\n\n&amp;#x200B;\n\nTL;DR\n\n$HD horizontal spread - sell the 7/17 255c and buy the 8/21 255c.\n\n$SPOT cheap calls - get some FDs 7/17 220c or 230c \n\n&amp;#x200B;\n\nLet me know what you think.",
        "subreddit": "wallstreetbets",
        "title": "[Chart] Voodoo &amp; [Options] Chains - $HD and $SPOT",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hb80hc/chart_voodoo_options_chains_hd_and_spot/",
        "created": 1592485145.0
    },
    {
        "author": "MichaelSteeber",
        "created_utc": 1593558891,
        "id": "hiylvu",
        "num_comments": 47,
        "num_crossposts": 0,
        "selftext": "[https://9to5mac.com/2020/06/30/apple-stores-close-again-additional-locations/](https://9to5mac.com/2020/06/30/apple-stores-close-again-additional-locations/)\n\n**The following stores will re-close this week:**\n\n**Florida**\n\n* Apple St. Johns Town Center (Jacksonville)\n* University Town Center (Sarasota)\n\n**Mississippi**\n\n* Renaissance at Colony Park (Ridgeland)\n\n**Texas**\n\n* Barton Creek (Austin)\n* Domain NORTHSIDE (Austin)\n* Galleria Dallas (Dallas)\n* Knox Street (Dallas)\n* NorthPark Center (Dallas)\n* Cielo Vista Mall (El Paso)\n* University Park Village (Fort Worth)\n* La Cantera (San Antonio)\n* North Star (San Antonio)\n* Southlake Town Square (Southlake)\n\n**Utah**\n\n* Station Park (Farmington)\n* Fashion Place (Murray)\n* City Creek Center (Salt Lake City)",
        "subreddit": "StockMarket",
        "title": "16 Apple Stores reclosing this week in Florida, Mississippi, Texas, Utah",
        "url": "https://www.reddit.com/r/StockMarket/comments/hiylvu/16_apple_stores_reclosing_this_week_in_florida/",
        "created": 1593587691.0
    },
    {
        "author": "maddgadd",
        "created_utc": 1593209870,
        "id": "hghdmz",
        "num_comments": 47,
        "num_crossposts": 0,
        "selftext": "Hey guys I have 12k I want to invest for my son over the next 14+ years. I know index and etfs are good but am I just better investing in amazon Apple Microsoft google and Tesla??? I don’t know if I trust what other stocks are in the etf over a long time",
        "subreddit": "stocks",
        "title": "Investment for my 4 year old. I have 12k",
        "url": "https://www.reddit.com/r/stocks/comments/hghdmz/investment_for_my_4_year_old_i_have_12k/",
        "created": 1593238670.0
    },
    {
        "author": "icebiker",
        "created_utc": 1592850398,
        "id": "hdxs81",
        "num_comments": 47,
        "num_crossposts": 0,
        "selftext": "This is my first DD. I'm a lawyer, not a professional trader, so I'll only post DD if I'm really confident about something. The only other DD I've posted (not on this sub) was for Dexcom\\*, now up 90% for me.\n\n**Overview**:\n\n* [VERY.CN](https://VERY.CN) (or VERY if you're in Canada)\n* The Very Good Butchers are a plant based meat company based in Victoria, BC. They have a store front, do R&amp;D, and do some serious manufacturing.\n* Founded only in 2017, it went public last week. It doubled in the first day, as is the trend with plant-based meat companies.\n* When they opened in 2017, **they sold out of three weeks of food in one day**. I was there. They literally closed shop and hired more cooks to make more product. They could not keep enough on the shelf for months. Oh, and they still can't keep up with demand - **they're still 3-4 weeks behind on orders because they have so much demand**.\n* Now, they're shipping all over the country, they're making new products, and they're opening a new factory in Vancouver to scale up.\n* Their IPO has given them the money they need to take off.\n* **Products sold in 150+ restaurants and retailers.**\n\n**Risk**:\n\n* This is a very small cap stock - we could probably buy it. Small cap means high volatility. Volume is also huge right now.\n* This company had its IPO last week, so there are no trends to look at or technical analysis. You can only analyze the business as it was before it was public, and the hype.\n* Importantly, their founder is still their CEO. This person has less experience than a senior CEO, but it is expected because they literally just had their IPO.\n\n**My Position:**\n\n* I bought in at $1.91CAD and I'll be holding until it doubles or so. I anticipate a lot of movement over the next week as investors figure out where this stock is going to rest for a while.\n\n**Summary**:\n\n* Good: Demand is through the roof for this plant-based meat company (R&amp;D, manufacturing, storefronts) that IPO-ed last week. Volume is high, and plant-based meat stocks tend to really fly. It has tremendous potential.\n* Risk: This company is going to face a lot of volatility as it is freshly public. Set stop losses or be prepared to hold for a few months if it dips as investors figure out where they want this stock to land.\n\n\\*DXCM isn't a penny stock (around $400/share) but for anyone interested, this is a good long hold, or a good stock to buy calls for expiring Jan 2022 as they have a groundbreaking product coming out early 2021 (not a meme stock, it's like the Apple of diabetes). I won't elaborate because it's not a penny stock, but for anyone interested, PM me and I can tell you why it's a good long hold.",
        "subreddit": "pennystocks",
        "title": "DD: Very Good Butchers",
        "url": "https://www.reddit.com/r/pennystocks/comments/hdxs81/dd_very_good_butchers/",
        "created": 1592879198.0
    },
    {
        "author": "thiswasntgood",
        "created_utc": 1593100238,
        "id": "hfogf2",
        "num_comments": 45,
        "num_crossposts": 0,
        "selftext": "When you look at the portfolios of most big investors and hedge funds, you find out the largest portion of their portfolios is usually in these big popular stocks. What do you think of an investment strategy of investing the vast majority (say 80%) of your portfolio into these Big 5 Tech stocks and other popular stocks like Tesla, Coca-Cola, Walmart, Disney etc. as a good long term investment compared to putting your money into ETFs or trying to scour the market for lesser known stocks which may or may not bag big returns. \n\nI have seriously been considering reshuffling my portfolio next month where I sell off my small cap/lesser known stocks and put the major share of my money into these big stocks I can hold for long term. Especially sell off my \"crash economy\" stocks. I aim to limiting my portfolio to less than 10 strong companies, investing mainly into these large Tech giants and a few other companies I believe to be good value. I want to build thia low effort portfolio and forget about it, investing small savings into it regularly and check up on how it's performing once a month or so. Its really more of an experiment. I find after a year or something that it's not performing well then I can do something different. \n\nThe world is becoming more and more reliant on technology and computers everyday and I believe these tech giants are only going to get bigger in the future. Especially how much they're diversifying into other tech markets than what they started out with. Amazon getting into entertainment and Web hosting. Google investing heavily into AI, quantum computing and entertainment platforms. Microsoft too is investing heavily into quantum computing to develop OS and other software for quantum computers. Apple is becoming a consumer giant with all it's products people are fanatical about while also it has just started producing its own microchips for its macbook laptops. These tech giants look very well set for whatever future may be possible short of a zombie holocaust or something!",
        "subreddit": "investing",
        "title": "Investing in Big 5 Tech stocks and other popular stocks.",
        "url": "https://www.reddit.com/r/investing/comments/hfogf2/investing_in_big_5_tech_stocks_and_other_popular/",
        "created": 1593129038.0
    },
    {
        "author": "techie564",
        "created_utc": 1591448406,
        "id": "gxqjor",
        "num_comments": 44,
        "num_crossposts": 0,
        "selftext": "I am 29, I have just started investing from past month, long term growth is my main goal but I also like some dividend paying investments too, can you please take a look at my portfolio and give me suggestions? I am still learning my way in so I will appreciate your inputs. Thank you.\n\nETF\n\n10 x [QQC.F.TO](https://QQC.F.TO)\n\n11 X VGRO.TO\n\n1 X ZRE.TO\n\n1X SPHD\n\nSTOCKS\n\n2 x APPLE \n\n2 X DISNEY\n\n2 X MASTERCARD\n\n2 X PAYPAL\n\n2 X SYSCO\n\n2 X MICROSOFT\n\n2 X O REALTY INCOME CROP\n\n2 X UBER\n\n3 X BOEING\n\n1X NETFLIX\n\n1 X JOHNSON &amp; JOHNSON\n\n1 X COSTCO",
        "subreddit": "CanadianInvestor",
        "title": "New Invetster here, what do you think of my portfolio?",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/gxqjor/new_invetster_here_what_do_you_think_of_my/",
        "created": 1591477206.0
    },
    {
        "author": "gfrommia",
        "created_utc": 1591410469,
        "id": "gxiji5",
        "num_comments": 43,
        "num_crossposts": 0,
        "selftext": "I just can’t seem to maximize profits! I spent yesterday leveraging down AAPL calls for 335 from 1.05 down to .55 I had 16 fucking contracts!!!! Sold at 1 happy to get away they closed at 2.88 fuck my life and you’re wife’s boyfriend!!!!!\nAAPL 350 6/26",
        "subreddit": "wallstreetbets",
        "title": "I will learn once and for all to have diamond hands...",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gxiji5/i_will_learn_once_and_for_all_to_have_diamond/",
        "created": 1591439269.0
    },
    {
        "author": "BarrierRouteWager",
        "created_utc": 1592789857,
        "id": "hdiu1a",
        "num_comments": 43,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/e3jvdr5p7d651.png?width=842&amp;format=png&amp;auto=webp&amp;s=cb58b75ea192b08abadd956402ed82e5b9f9422d\n\n&amp;#x200B;\n\nApple went up June through August historically in recent years from worldwide developers conference.\n\nApple WWDC  this week and lots of rumor about apple releasing apple glass and making their own cpu and breaking off from intel.\n\nCalls are dirt cheap right now\n\n6/26 $370 Calls is risky ten bagger while  8/21 $370 Calls will be safe bet.",
        "subreddit": "wallstreetbets",
        "title": "AAPL Conference this week with major announcements",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hdiu1a/aapl_conference_this_week_with_major_announcements/",
        "created": 1592818657.0
    },
    {
        "author": "internetf1fan",
        "created_utc": 1593179353,
        "id": "hg7x1y",
        "num_comments": 43,
        "num_crossposts": 0,
        "selftext": "So Apple is moving to ARM and altough it's only a small part of Intels business, it has been generating lots of headlines. But crucial thing is, Apple isn't doing this wholesale. There will be a few years when x86 and ARM will be available in parallel until they fully transition to ARM. \n\nWhat will be interesting for Apple is if during that period, x86 devices vastly outsell the ARM ones. Ap\n\nI think this is exactly what will happen and Apple will be forced by the market to either move back completely to x86 or to keep on providing x86 alongside ARM. This would reinforce the strenght and demand for the x86 ecosystem and Intel, AMD and nvidia alongside anyone involved in x86 ecosystem will fly to the moon!",
        "subreddit": "wallstreetbets",
        "title": "Load up on Intel, AMD and nvidia now!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hg7x1y/load_up_on_intel_amd_and_nvidia_now/",
        "created": 1593208153.0
    },
    {
        "author": "averageblunder",
        "created_utc": 1592374413,
        "id": "halkly",
        "num_comments": 42,
        "num_crossposts": 0,
        "selftext": "Next week at the Apple developer's conference, Apple is expected to announce that they will be dumping Intel and moving to ARM chips.\n\n[Apple's shift to ARM Mac at WWDC next week](https://appleinsider.com/articles/20/06/13/apples-shift-to-arm-mac-from-intel-at-wwdc-will-define-a-decade-of-computing)\n\nThis has been a tech rumor for a while now, next week if it happens will be the official public announcement.\n\nIn terms of immediate impact, this is not huge - MacOS is has around just under 10% marketshare (depending on which survey)\n\n[macos reached 9.65 of desktop/laptop os marketshare](https://hostingtribunal.com/blog/operating-systems-market-share/)\n\nHowever it represents a deeper long term problem. Programs written for Intel x86 architecture chips do not run on ARM chips. Switching chips requires all the software vendors to make minor modifications to their programs to work on the new architecture. Given that the programs typically took years to develop, even a minor modification might take weeks. And, this will require that consumers making the transition obtain new versions of their programs.\n\nThe point is, it's a hassle, and not one that Apple would undertake unless there is a **major** advantage to moving to Intel.\n\nThe advantages are power and (surprisingly) speed. Intel chips have always been power hungry, which is not good for laptops. In years past Intel offset this by being faster, but surprisingly that gap had started to disappear by 2017\n\n[iPhone 8 faster than intel Core i5](https://9to5mac.com/2017/09/22/iphone-8-geekbench-test-scores/)\n\nand it's only gotten worse since then: on Geekbench the A13 (Iphone11) has the same single core performance as the I9. That's a tiny *phone* chip compared to the top-end *desktop* cpu targeted at gamers. Wait until Apple introduces a desktop-oriented ARM chip.\n\nOne key problem is that Intel is struggling to move to 10nm, whereas Apple is already shipping 7nm and moving to 5nm next. Smaller nm (nanometers) means less power and somewhat faster.\n\nThe ARM advantage over Intel has become too compelling to ignore, and other PC makers will be making the switch in coming years. Microsoft has already been trying (several times), with mixed success.\n\n[https://www.androidauthority.com/windows-on-arm-review-1074547/](https://www.androidauthority.com/windows-on-arm-review-1074547/)[https://www.theverge.com/2019/10/1/20887386/microsoft-surface-event-pro-7-arm-windows-laptops](https://www.theverge.com/2019/10/1/20887386/microsoft-surface-event-pro-7-arm-windows-laptops)\n\nPeople are also trying to replace Intel on Servers,[https://www.anandtech.com/show/15578/cloud-clash-amazon-graviton2-arm-against-intel-and-amd](https://www.anandtech.com/show/15578/cloud-clash-amazon-graviton2-arm-against-intel-and-amd)\n\nAnd (for different reasons) Intel is also loosing some ground to AMD.\n\nAll these efforts are having (or will have) mixed success initially. But the point is that ***everyone*** is trying to get away from Intel.\n\nPosition: crouching, sold INTC, and puts for next week.",
        "subreddit": "stocks",
        "title": "the slow death of Intel",
        "url": "https://www.reddit.com/r/stocks/comments/halkly/the_slow_death_of_intel/",
        "created": 1592403213.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1591980398,
        "id": "h7obdp",
        "num_comments": 42,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "pennystocks",
        "title": "IZEA's contract -- Possibly Apple/Shazam?",
        "url": "https://www.reddit.com/r/pennystocks/comments/h7obdp/izeas_contract_possibly_appleshazam/",
        "created": 1592009198.0
    },
    {
        "author": "Nick5mi",
        "created_utc": 1591762785,
        "id": "h03lne",
        "num_comments": 42,
        "num_crossposts": 0,
        "selftext": "Should I put majority of my money into ETFs like  QQQ or buy BRK. B instead if I just want solid long term growth?  Or buy Apple and Microsoft at the high knowing they are still gonna go up.",
        "subreddit": "stocks",
        "title": "For long term investment would it be a bad decision to buy Apple and Microsoft while they are at their historical highs or wait till a small drop.",
        "url": "https://www.reddit.com/r/stocks/comments/h03lne/for_long_term_investment_would_it_be_a_bad/",
        "created": 1591791585.0
    },
    {
        "author": "TheKingofDiapers",
        "created_utc": 1593456916,
        "id": "hi6351",
        "num_comments": 41,
        "num_crossposts": 0,
        "selftext": "  \n\nGonna try to keep this short. Spotify doesn't get enough love here. It is positioning itself to be the next major targeted digital advertiser, and most seem to be missing the boat.\n\n&amp;#x200B;\n\n**Quick background on Ek:**\n\nSpotify is a founder led company. Daniel Ek has a history of success (was successful at 13, several successful previous companies, high level executive  positions, and he is not motivated by money – I repeat, not motivated by money but he took on a notoriously difficult and entrenched music industry – and was successful).\n\nAnyone who’s worked with Ek, will vouch for his extreme, outlier intelligence, and competitiveness.\n\nFounder has track record of success, in an industry that has horrific margins, high royalties, entrenched wealthy incumbents, crazy regulations, and a list of failed attempts (ie Napster). \\*Reminds me of Elon Musk taking on online payments, auto industry, and space\\*\n\n&amp;#x200B;\n\n**Spotify is well positioned:**\n\nGross revenue is everything (ie Amazon). Top line growth is king. It’s ammo for the founder to do what they do best, innovate and execute. If your top line is growing at the rate that Spotify’s is growing, you can always find a way to be profitable. That’s MBA 101. Any management consultant will tell you that. The fact that they are not profitable, means they DO NOT WANT TO BE PROFITABLE. They are growing, there are executing plans and reinvesting. Amazon could have been profitable 8 years ago, but it reinvested in distribution centers. Spotify is also investing for the future, they're building for the future. \\*Notwithstanding their recent foray into profitability, which is sparse, but purposefully sparse. I would be very comfortable if they weren’t profitable for the next few years, as they reinvested into growth, and am hoping to add to my position.\n\nDynamic Ad insertion, that’s nothing new so I won’t go into great detail. Spotify’s phenomenal algorithm that recommends music to users, is also nothing new. But combined, that means Spotify has A LOT of data about you (what music you listen to, genres, when, where, how often, types of podcasts, interests, listening device, wifi, car, work place, home, location, gender, etc). They already do a great job of recommending music, arguably the best, why wouldn’t they be successful in recommending tailored ads to the user? On a platform that is natively streaming, so people don’t download and listen to old ads like other podcast players – users would constantly listen to fresh ads. Targeted advertising, like Facebook. No one can do this as well as spotify, simply based on the amount of data they already have on you.\n\nIn a space that is highly fragmented (READ: opportunity), they are the company best positioned to centralize and control it. Apple has failed to do so, and now Spotify will succeed. Ek is a winner, and he will find a way\n\n&amp;#x200B;\n\n**Opportunity:**\n\nMarket Cap, as of this writing, is about $50 billion. No Spotify is not the next Netflix of Audio, it is the Netflix/Facebook/Google/Apple Podcasts/Apple Music of audio. Success is not guaranteed for them, but dammit, they are in a fantastic position to succeed - if anyone is to succeed - in a decentralized open audio market. If you’re investing for the long haul, this is a great opportunity. Back a seasoned, successful founder with a fantastic track record, in an industry of fantastic opportunity, with great synergies for the existing business, in a tremendous marketplace full of potential that lacks a true winner. SPOT is a strong buy. I easily see this company as a $400+ billion company. \n\n&amp;#x200B;\n\n**TLDR:** CEO good, track record of success in very difficult industries, revenue growth strong, potential valuable market is fragmented and ripe for a leader, people use the app for hours everyday, lots of user data, great algorithm that can match users to advertising, lots of cash. \n\n&amp;#x200B;\n\nNotes:\n\nSorry for the typos, had a few glasses of wine and wrote this in 20 minutes.\n\nBoring financials: 286 MAU, 31% subscriber growth is not numbers to be taken lightly. Cost of revenue trending down (that is a great sign), to about 75% now, and projected to go down more. That’s HUGE. $2.2 billion or so USD in cash and cash equivalents. Improved their advertising platform for buyers. Based on average app usage per user/day and industry CPM rates, I calculate the value of a USA user to be $5-$12 dollars per month for Spotify.",
        "subreddit": "investing",
        "title": "Spotify analysis has been lacking here. It is a potential 10 bagger growth stock. It’s not Netflix of audio, it’s Facebook.",
        "url": "https://www.reddit.com/r/investing/comments/hi6351/spotify_analysis_has_been_lacking_here_it_is_a/",
        "created": 1593485716.0
    },
    {
        "author": "encapsulated1",
        "created_utc": 1592342343,
        "id": "had0l6",
        "num_comments": 40,
        "num_crossposts": 0,
        "selftext": "1. Never Fight the Fed.\n2. Never Fight the Mouse.\n3. Never Fight Apple\n4. Stonks only go up.\n\n&amp;#x200B;\n\nHidden and final truth:\n\n5. The market can stay irrational longer than you can stay solvent. It will work until it doesn’t work.\n\n&amp;#x200B;",
        "subreddit": "wallstreetbets",
        "title": "4 Truths of Life",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/had0l6/4_truths_of_life/",
        "created": 1592371143.0
    },
    {
        "author": "Nike-blue",
        "created_utc": 1592875214,
        "id": "he54wd",
        "num_comments": 39,
        "num_crossposts": 0,
        "selftext": "If I intend on exercising a option 5 months from now and keeping the stock, should I really care about implied volatility???\n\nApple 11-20-20 360C  $28.80\n\nI have all my capital on Shopify,teledoc,wayfair,Spotify,Microsoft.",
        "subreddit": "wallstreetbets",
        "title": "IV crush",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/he54wd/iv_crush/",
        "created": 1592904014.0
    },
    {
        "author": "KhingoBhingo",
        "created_utc": 1592534647,
        "id": "hbskjb",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "Occasionally people ask how these loans work. Here's how. \n\n&amp;#x200B;\n\nThe basics are the same everywhere but I'm doing this from a Canadian perspective which means I'm ignoring the US SEC Regulation T, special memorandum account, overnight maintenance requirement, initial margin, and pattern day trading rule, because all of those are concepts that have no equivalent or application in Canada. I'm also ignoring U.S. risk-based portfolio margin because we also don't have that in Canada, besides, in that case the calculations are based off of a commodity futures risk-based methdology, not rules-based traditional margin. But the basics are the same. \n\n&amp;#x200B;\n\nMargin in Canada hasn't really changed since the 1920's, except you have to put up at least 30% nowadays instead of 10% back before the crash of 1929.   \n\n&amp;#x200B;\n\nIn Canada you can borrow up to 70% of a position at once for most stocks.  In Canada, the government doesn't regulate margin. The banks do that job themselves, so it hasn't changed much in 100 years. Only difference is that you had to have a lot of money to do it 25 years ago and so far as I know, today banks in Canada will let you open margin accounts without minimums, at least BMO which I am with does.  \n\n&amp;#x200B;\n\nThis means that if you want to buy $10,000 worth of RBC or Apple, you only have to put up $3,000 and your broker lends you the rest.\n\n&amp;#x200B;\n\nMargin was invented by the Dutch who basically invented the modern financial system in the 1600s. Eventually the British took it over and ran with it, exporting that system to the 13 colonies. After they defeated Napoleon and went on to build the British Empire they exported that system to Canada and Australia for example. But it's really the Dutch who started it all around the time of Vermeer.\n\n&amp;#x200B;\n\nThe concept is that the bank will lend against some of your stock, but not all of it. They want a \"haircut.\" The haircut is the amount they won't lend against. In Canada the haircut is usually 30% but can be 50% and there are some stocks the banks won't lend against at all, like most of the stuff on the TSX-V or on the U.S. pink sheets. Every bank is different, so BMO InvestorLine might lend 50% on one small cap and TD Direct Investing 30% or vice versa for another. But most things are 30%, some are 50% and some are 100% (meaning no loan).   \n\n&amp;#x200B;\n\nThe leverage is 1/haircut.\n\n&amp;#x200B;\n\nSo say you have $3,000 and you want to buy on margin. As the bank haircut (margin rate) is 30%, you can buy $3,000/0.3 = $10,000 worth of stock. Obviously you then have a loan of $7,000. You now have $10,000 worth of stock, but remember, the bank won't let you borrow against 30%\\*$10,000 = $3,000. So your collateral is only $7,000. So you now have a $7,000 loan collateralized by $7,000 worth of stock. \n\n&amp;#x200B;\n\nIn the above example, you put up 30% margin, the same as the haircut. \n\n&amp;#x200B;\n\nIt's easy to see that if your total position slides so much as a dollar, you will have less collateral than $7,000 and therefore get what's called a margin call where the bank if it's BMO literally calls you on your cell and they tell you that you have to put up more money in a few hours or sell stock(which automatically pays down the loan to the extent of the sale) so that you have enough collateral to cover your loan, otherwise they wil automatically sell a stock of their choosing at an amount of their choosing. They are also allowed to sell whichever stock they choose automatically without calling you first, in the event of a margin call. That is explicitly set out in your margin agreement.  So obviously you need some \"buffer\" because of volatility, but how much do you borrow?\n\n&amp;#x200B;\n\nNow you have to understand some math. \n\n&amp;#x200B;\n\ntarget margin = 1-(1-x)\\*(1-haircut)\n\nx is the price drawdown\n\ntarget margin is how much margin you have to put up.\n\n&amp;#x200B;\n\nSay Apple is marginable at 30% (the haircut) by your bank. You decide you want to borrow on margin. But you decide, \"I will allow Apple to slide 40% from what I buy it at before I get a margin call.\" So how much margin should you put up?\n\n&amp;#x200B;\n\ntarget margin = 1-(1-0.4)\\*(1-0.3) = 1-0.6\\*0.7 = 1-0.42 = 0.58.\n\n&amp;#x200B;\n\nSo you have to put up 58% margin.\n\n&amp;#x200B;\n\nThat means if you have $3,000 to invest, you would buy $3,000/0.58 = $5,172 worth of Apple. If Apple is trading at $350 that means it can slide to $210 before you get a margin call. At which point you will have lost 0.4/0.58 = 68.9% of your money. (Remember, leverage is simply 1/margin.)\n\n&amp;#x200B;\n\nThe formula above is simply a rearrangement using basic algebra, of the basic margin equation which is:\n\n&amp;#x200B;\n\n**price at margin call = initial price of stock\\*(1-target margin)/(1-haircut)**\n\n&amp;#x200B;\n\nHope this is a handy reference.",
        "subreddit": "CanadianInvestor",
        "title": "How Margin Loans Work - a Primer",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/hbskjb/how_margin_loans_work_a_primer/",
        "created": 1592563447.0
    },
    {
        "author": "Start155",
        "created_utc": 1592762882,
        "id": "hdbgyn",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "Just remember this stock was at 5 cents sometime last year. This company have been burning cash since their inception. Their PRs are jokes, shuffling the same news with minor changes over and over. For instance, Margaret Loesch has been there since 2016 ( [https://twitter.com/GNUSBrands/status/810870585957949440](https://twitter.com/GNUSBrands/status/810870585957949440) ) and you got a PR this month they they hired her. Do you know how many free apps are in google pay store or apple app store where you can see better cartoons? Do you know Walmart sells toys made by more than 100 different manufacturers? Do you know all these celebrity connections with gnus have been known for years? Do you know this stock has been a penny stocks for better part of its life? Do you know how many times they diluted their stocks? Do you know they have never made any profit? GNUS is a pump and dump, you can believe otherwise but that does not change the fact.",
        "subreddit": "pennystocks",
        "title": "For delusional bag holders",
        "url": "https://www.reddit.com/r/pennystocks/comments/hdbgyn/for_delusional_bag_holders/",
        "created": 1592791682.0
    },
    {
        "author": "jay33802",
        "created_utc": 1592677144,
        "id": "hcr1v4",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "I’m looking to invest in stocks that went down to covid that aren’t apple or google.. looking at prices from $10-100 a share that were effected and will rise up again, I know I’m probably late to the party but oh well. I know spirit airlines or carnival will go back to its original prices in the next year. What are stocks that went crashing that will reach the same price they were at before covid? Thanks!",
        "subreddit": "StockMarket",
        "title": "Looking for cheaper stocks that went down during Covid 19",
        "url": "https://www.reddit.com/r/StockMarket/comments/hcr1v4/looking_for_cheaper_stocks_that_went_down_during/",
        "created": 1592705944.0
    },
    {
        "author": "guccirare",
        "created_utc": 1592327364,
        "id": "ha83uj",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "If I short sell for example AAPL $330p and $360c with the expiry date tomorrow, is it pretty much free money? If both of them expire worthless I win from both and if the stock price goes under 330 or over 360 I lose from one of the position but cover the losses with the other position, am I right? This sounds way too easy to actually work so what are the cons of this?",
        "subreddit": "wallstreetbets",
        "title": "Probably a dumb question",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ha83uj/probably_a_dumb_question/",
        "created": 1592356164.0
    },
    {
        "author": "LiveRedditOffice",
        "created_utc": 1592742792,
        "id": "hd67hp",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "Snapchat is the first thing that comes to mind.\n\nHello r/Investing, I’m looking for your guy’s picks on best companies under $25.\nNowadays companies are worth over $300 like AAPL AMZN NFLX BYND.\nI want to find a company that will eventually get to those high share prices but are at under $25.\nI’m looking for obscure and mainstream names.\nI’m just having a hard time finding ones that aren’t absolute junk and have a decent balance sheet.\n\nI like tech, industrials, finance.\nI’m open to other sectors as well.\n\nI’m not really interested in companies worth under $50m and have a share price under $3",
        "subreddit": "investing",
        "title": "Best Stock Under $25?",
        "url": "https://www.reddit.com/r/investing/comments/hd67hp/best_stock_under_25/",
        "created": 1592771592.0
    },
    {
        "author": "ZZ_x_Sleepy",
        "created_utc": 1592831074,
        "id": "hdrz5j",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "So since I'm quite bored and I want to see how autistic you guys really are I'll give you some money.\n\nI'm going to start an account with $1000 and I'll allow you to choose a stock to invest in.\n\nI will only be buying/selling options of stocks listed below:\n\nAlphabet\n\nFacebook\n\nApple\n\nDeutscheBank\n\nSnap\n\nTwitter\n\nAmazon\n\nMicrosoft\n\nNetflix\n\nTesla\n\n&amp;#x200B;\n\nI will listen to/do whatever the top reply/one with most up-votes says.\n\nWe'll either make lovely stonks or lose it all (what i'm expecting to happen). Let's go!",
        "subreddit": "wallstreetbets",
        "title": "WSB vs The World",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hdrz5j/wsb_vs_the_world/",
        "created": 1592859874.0
    },
    {
        "author": "creme_de_la_crop",
        "created_utc": 1591978815,
        "id": "h7nse2",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "I’m not a 🏳️‍🌈🐻 anymore...but do think Q2 results will be atrocious. Q1 barely scraped the surface of COVID impact since really only 2-3 weeks of March made it in. I made some bonehead short plays in April (got squeezed out already) but also picked up some killer longs (AAPL, ZNGA, CRWD, &amp; APPN). I don’t think Monday will be doom and gloom but do think the market will see a pullback in the next month or so with everything happening on top of a piss poor earnings season on the way. \n\nThinking of cashing out everything in the green and consolidating in cash to be ready. Worst case, I miss out on another 10% of upside before things correct. Best case, I wait out 10-20% on the downside and snag some deals. I’ve already got a list of 10-15 stocks I want to pick up if they hit my target price. How many other autists out there are doing the same?",
        "subreddit": "wallstreetbets",
        "title": "Q2 Earnings Bloodbath?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/h7nse2/q2_earnings_bloodbath/",
        "created": 1592007615.0
    },
    {
        "author": "suza727",
        "created_utc": 1592064187,
        "id": "h8a6xk",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "I read a post on the Baba split but I was hoping someone would spelled it out like I'm a 3rd grader (Guessing I'm not the only one)\n\nI can afford to buy a modest amount of current $200 shares of Baba.To help clarify..... If I buy let's just go with 1 $200 share and this split happens in July, I will end up with 8 lower priced shares (I'm assuming those 8 shares won't be equal to my initial investment). Then, I cross my fingers and hope people purchase Baba at the lower price and over time those 8 shares would be worth say... $30-40 each (just throwing numbers out there). So, my initial investment of $200 eventually becomes $240-320?\n\nOther question: some say this split will not happen in the US. I've tried to find out but received differing info. Anyone know for sure? \n\nIf I were to do this I would obviously buy more than 1 share but I just wanted to make it simple. \n\nThank you very much. This just so happened to my Mom back in the day. She owned quite a bit of Apple; it split 7 ways and well... you know the rest. Only thing, she had no idea it was in the works.",
        "subreddit": "stocks",
        "title": "BABA SPLIT: Explain please (again)",
        "url": "https://www.reddit.com/r/stocks/comments/h8a6xk/baba_split_explain_please_again/",
        "created": 1592092987.0
    },
    {
        "author": "jdogtor",
        "created_utc": 1591621911,
        "id": "gyz28y",
        "num_comments": 35,
        "num_crossposts": 0,
        "selftext": "[https://ir.gnusbrands.com/press-releases/detail/1067/genius-brands-international-responds-to-misleading-short](https://ir.gnusbrands.com/press-releases/detail/1067/genius-brands-international-responds-to-misleading-short)\n\n* **We are well positioned to create substantial value** – With Kartoon Channel! launching on June 15 and to be available in more than 100 million U.S. TV households and 200 million mobile devices, we are positioned to be one of the preeminent ad-supported kids’ digital networks. The service referred to as a ‘Netflix for kids’ is made even stronger by the distinct fact that it is a free service. There are no subscriptions fees, it is ad-supported. Further, we do not anticipate being impacted by COVID-19. The business of cartoons has historically had an appeal that is timeless, and is a rare asset class which has historically been resistant to typical market forces (e.g., the price of gold, oil, interest rates, elections, etc.). While the rest of Hollywood is grinding to a stop during the COVID-19 crisis, we're creating new products for an audience that is growing now out of the new technologies and streaming services. This is especially true at a time when there are more kids at home and in front of their devices during the pandemic. We believe we will see robust and accelerated revenue growth coming forth in this arena for the foreseeable future.\n* **Our balance sheet is strong** – We have $9.75 million of debt; in excess of $45 million of cash, significant receivables from a diverse array of companies across our industry with strong credit profiles, and low overhead. Today, Genius Brands has enough cash on our balance sheet to meet our existing obligations and execute on our business plan for at least 60 months, *and still fund continuing new production and content acquisitions each year*. Conveniently, last week when one of the short sellers stated we weren’t at the same revenue point as one of our Canadian-based competitors, he neglected to mention that the other company has *more than 60 times* ($600 million) as much debt as Genius Brands. We think identifying this omission is important to understanding the whole story. Finally, to clear up market confusion that we believe has been generated as a result of one short seller’s report, the shelf registration on form S-3 filed on June 4th was related to our capital raise in March 2020. We registered the resale of shares underlying the warrants we issued in March, and the S-3 filing does not in any way represent a new capital raise, nor is it related to recent changes in our stock price.\n* **The short sellers’ criticisms of our Programs highlight their own industry ignorance** – *Llama Llama* is an industry-recognized tremendous asset that we have on great terms, which are mutually beneficial with the IP’s author/book publisher and ourselves. We are also confident in the appeal of the soon to be launched *Stan Lee’s Superhero Kindergarten,* one of the last creations of Stan Lee, creator of *Spider-Man, X-Men, Iron Man, Incredible Hulk, Thor, Fantastic Four, Black Panther, and the Avengers,* among others. Similarly, we are happy with the outlook for *Rainbow Rangers.* The fact is that the show’s airings on Nick Jr. have been scaled back while we are currently producing new episodes, which is a standard industry practice known as “resting.” We expect the airings to ramp back up in August when the new episodes are completed and this will be timed with the launch of toys from Mattel hitting the shelves of Walmart in August. We are confident Nick Jr.’s interests are aligned with ours – after all, *they have a stake in the consumer products merchandising royalties related to this asset*.\n* **The track record of our leadership team speaks volumes** – Our senior management comes largely from the Walt Disney Company, DreamWorks Animation, and Hasbro Toys, and has been responsible for many of the biggest and most profitable hits in children's television history, as well as toy and consumer product programs generating Billions of dollars of program sales and royalty income. The management team and board have had creative, licensing, production, broadcasting, and sales roles in some of the biggest animated hits in children’s history, including *Lion King, Toy Story, Strawberry Shortcake, Care Bears, Power Rangers, My Little Pony, Spider-Man, Batman, X-Men, Transformers, Muppet Babies, Fraggle Rock, Real Ghostbusters, and Inspector Gadget*. Collectively, w*e have more than 150 years of experience in children’s media*, and have helped generate literally tens of billions of dollars of content and consumer products sales.   \nFurther, last Friday, we announced the addition of two of our industry’s most accomplished executives overseeing the new channel: Margaret Loesch as Executive Chairman of *Kartoon Channel!* (former President of Marvel Entertainment, FOX Kids, and Henson Television), and David Neuman as Chief Content Officer of *Kartoon Channel!* (former President of Walt Disney Television). Margaret was founding CEO of FOX Kids, and built it from zero to the most successful and profitable kids program service, and what was eventually sold to the Walt Disney Company for $5.5 billion dollars. None of us claim to be experts at ‘short selling’. But we also think it’s a stretch for short sellers to claim to know more about this industry than those of us who have been industry leaders and spent decades making money for investors while building some of the sector’s most successful brands and companies.\n* **Genius Brands is a long-term growth story** – We have a number of hit brands and shows today – but we are even more excited about what is coming, and the synergies with the newly announced *Kartoon Channel!*. We have over 450 licensed products contracted (with advances and guarantees) to come into the marketplace in the coming months. Our pipeline of new animated products, soon to be announced, is robust and pre-sold with significant brand equity. Our partners, licensees, and retail customers include Alibaba, Amazon, Mattel, Netflix, Target and Walmart, among others. *Rainbow Rangers* toys from Mattel, based on our hit series on Nick Jr., will hit Walmart stores in August beginning with a multipack of *Rainbow Rangers* figures. Over 350 other licensed consumer product SKUs are due as well, including publishing, room décor, bedding, footwear, apparel, health and beauty, bicycles, toothpaste, touring shows, among others, some of which are now already on Amazon.com, Walmart.com, and Target.com.\n\nAbove all else, we are focused on *long-term value*. After working with Warren Buffett for 25 years and producing the children’s animated series with Warren to teach financial literacy (*Warren Buffett’s Secret Millionaires Club*), I've learned to focus on the importance of the basics: asset creation and value-building for our shareholders.\n\nOn a personal note, *I have not sold a single share, and in fact, have materially increased my holdings in the Company in the last two years*. We take the views of all our investors seriously, and we and our board are committed to maintaining the highest standards of corporate governance and transparency.\n\nThe Company is not suggesting that any particular trading price for the Company’s securities is appropriate, whether in the short- or long-term. However, we would like to seek to clarify certain facts as it relates to the short seller information that has been put into the marketplace.\n\nFinally, the Company reserves the right to take appropriate legal action against Hindenburg Research and Citron Research, as we will always do what we can to protect our shareholders’ interests.\n\n**About Genius Brands International**\n\nGenius Brands International, Inc. (Nasdaq: GNUS) is a leading global kids media company developing, producing, marketing and licensing branded children’s entertainment properties and consumer products for media and retail distribution. The Company’s award-winning ‘content with a purpose’ portfolio includes *Stan Lee’s Superhero Kindergarten*, starring Arnold Schwarzenegger; *Rainbow Rangers* for Nick Jr.; *Llama Llama*, starring Jennifer Garner, for Netflix; award-winning toddler brand *Baby Genius*; adventure comedy STEM series *Thomas Edison's Secret Lab*; entrepreneurship series *Warren Buffett's Secret Millionaires Club*; and *Stan Lee's Cosmic Crusaders*, created with Stan Lee's Pow! Entertainment. Through licensing agreements with leading partners, characters from Genius Brands’ IP also appear on a wide range of consumer products for the worldwide retail marketplace. The Company’s Genius Brands Network of channels, including Kid Genius Cartoon Channel, Baby Genius TV, and Kid Genius Cartoons Plus!, are available in over 100 million U.S. television households via a multitude of distribution platforms, including Comcast, Cox, DISH, Amazon Prime, Sling TV, Apple TV, Roku, Amazon Fire and more. For additional information, please visit [www.gnusbrands.com](http://www.gnusbrands.com/).",
        "subreddit": "pennystocks",
        "title": "6/8 Genius Brands International Responds to Misleading Short Seller Criticisms",
        "url": "https://www.reddit.com/r/pennystocks/comments/gyz28y/68_genius_brands_international_responds_to/",
        "created": 1591650711.0
    },
    {
        "author": "idonthaveaskeleton",
        "created_utc": 1592449424,
        "id": "hb6dw4",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "Learn from HTZ, and research the costs and benefits of using bankruptcy to restructure your finances.\n\nIt doesn't matter if you are negative a million bajillion dollars, it could just get reset to zero, or down to a monthly payment you can afford. Corporations do this all the time. You know who declared bankruptcy and got back on their feet? Marvel Entertainment. Six Flags. Texaco. Sbarro. Apple nearly declared bankruptcy in 1997 before they accepted help from Microsoft. Celebrities file bankruptcy [all the time](https://www.levittslafkes.com/articles/famous-people-who-have-filed-bankruptcy/). Even Donny Pump.\n\nBankruptcy is a form of outside help written into the Constitution. It's an economic right that you should consider taking advantage of before doing something drastic.\n\nThere are downsides. If you spent money on dumb shit, you might have to give it up. You will face economic challenges others won't. It will be hard to buy a house. By the way though, you weren't going to buy a house any time soon anyway. An entire generation just spent the last 10 years being unable to buy houses even without bankruptcy on their records.  \n\nThere may be more. I have not gone through it myself. This isn't legal advice or investing advice. It's probably not as fun as trading options. But it's not like you're going to prison. \n\nIt's not like you're doing something permanent. It's not like your friends and family will spend the rest of their lives wondering what more they could have done for you.\n\nThink about the time you spent researching your trades, and think about the amount of time you should spend researching your economic options before you do something irreversible.\n\nYou have a lot of smart decisions ahead of you. Be glad, you learned an important economic lesson while you still have time to take advantage of it.",
        "subreddit": "wallstreetbets",
        "title": "Zoomers: If you are down more than you ever thought possible, and are staring into the abyss",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hb6dw4/zoomers_if_you_are_down_more_than_you_ever/",
        "created": 1592478224.0
    },
    {
        "author": "Reagorn",
        "created_utc": 1593312525,
        "id": "hh6y3o",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "To start off, Im not 100% on HXT. If you have better suggestions let me know. I'm also mid 20s, working on maxing my TFSA and holding for the long term. I'd have about 90% of my max contribution split equally among these ETFs. I do second guess myself on having such a large portion of my TFSA in ETFs because I want more/faster growth than the slow growth ETFs have, but I know there is a high risk in investing say 60k in dozens of multiple stocks \n\nMy thinking - I know VEQT holds all of the stocks in the other ETFS, but I want higher percentage of some of the stocks. Even though this is the case, VEQT would be a good hold I feel.\n\nVFV - I feel the returns on the S&amp;P 500 is going to continually to be positive in the future so I thought it would be a good add.\n\nTec.to - I think tech in going to improve in the future and believe in Apple, Microsoft, Visa, Mastercard, etc.\n\nZEB - I could own one bank stock, but maybe it would be smarter to take this ETF that holds them all.",
        "subreddit": "CanadianInvestor",
        "title": "Thoughts on owning VEQT, TEC.TO, ZEB, VFV and HXT at the same time?",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/hh6y3o/thoughts_on_owning_veqt_tecto_zeb_vfv_and_hxt_at/",
        "created": 1593341325.0
    },
    {
        "author": "veganbutcherno",
        "created_utc": 1593132219,
        "id": "hfxsja",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "Hey guys,\n\nHope everyone is safe on those crazy covid times. \n\nI’m thiking to distrbute my 5k on tesla, apple, paypal, disney, alibaba, microsoft, google, facebook. \n\nI know its not much but covid hit me hard aswell. I’m planning to invest long term. What you think about my stock picks? Also I can invest 2k on some risky stocks like boeing, so i would like to hear your ideas. \n\nStay safe!",
        "subreddit": "stocks",
        "title": "Investing 5k usd in following stocks",
        "url": "https://www.reddit.com/r/stocks/comments/hfxsja/investing_5k_usd_in_following_stocks/",
        "created": 1593161019.0
    },
    {
        "author": "alpharogueshit",
        "created_utc": 1592005622,
        "id": "h7w22s",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "It’s been 8 months since Google announced it was acquiring Fitbit in an all cash deal. In the M&amp;A world, for digital economy companies, it’s around this time things start to get interesting.  In the next couple months, either two things happen: the deal is approved or blocked. Here’s what you need to know:\n\n**Plays**\n\nFIT 6/19 $6.5c - Australia’s competition authority will make their decision on deal 6/18 (which will be 6/17 in the US). [Rod Simms statement on “Digital Giants”] (https://www.accc.gov.au/media-release/digital-giants’-buy-up-of-start-ups-poses-challenges-for-merger-laws) indicates the focus will be on whether Fitbit under Google enhances competition in the market. Since Fitbit already lost the battle to Apple, and [will be unable to compete very soon](https://www.google.com/amp/s/www.fool.com/amp/investing/2020/02/28/its-now-clear-fitbit-is-in-serious-trouble-without.aspx), an approval is likely. \n\nFIT 7/31 $6.5c or 7/31 $6p - The DOJ is expected to rule on the deal [after giving it scrutiny](https://www.google.com/amp/s/www.businessinsider.com/googles-fitbit-deal-more-scrutiny-from-the-justice-department-2020-4%3famp) by the end of July. Additionally, earnings are expected 7/29.  [Investors may be bullish on the financial results of their ventilator move](https://www.google.com/amp/s/www.theverge.com/platform/amp/2020/6/4/21280132/fitbit-flow-ventilator-coronavirus-shortage-fda-emergency-use-authorization-hospitals), but it could swing either way.\n\nFIT 8/7 $6.5p - The run up for Q1 earnings (obvious pump and dump) will probably happen again for Q2, especially with the ventilator move. If Fitbit closes above $6.80 on 7/27, BUY PUTS.\n\nFIT 11/20 $6c - Fitbit and Google agreed to close the deal by 11/1, otherwise Google will pay Fitbit $250 million. We know Google is good on their word, and has a 100% track record for closing acquisitions. This is the arbitrage play.\n\n*DD*\n\nSince the acquiring company is FAANG company, competition authorities around the world are giving the deal scrutiny which is expected. What makes this deal interest is two things: privacy and data concerns. Since Fitbit has a treasure trove of user health data, it makes sense regulators would be concerned how Google handles it. Is this a big deal? Yes and no. First of all, users have control of their data, and are under no obligation to share it with a Google. Second of all, Fitbit already protects data in accordance with the strict GPDR regulations. Lastly, competition laws do not prevent deals over privacy concerns. Data is a bigger deal IMO. Traditionally, this merger would not be considered horizontal or vertical (which would usually put it on the fast track for approval). However, Google’s Verily sciences already does health data analytics, which is a market Fitbit operates in. Regulators in the US have not seriously investigated a merger from the perspective of data, so this is a wildcard for this deal. However, we do know how it will be investigated at least in the EU, given [the Apple and Shazam merger](https://www.lexology.com/library/detail.aspx?g=b3ef6417-534e-408c-af89-1905bfd717ca). So the question is whether Fitbit’s data is valuable enough, that under the control of Google, competitors would not be able to compete? This seems unlikely as a) many other wearables collect the same data and b) Fitbit’s API allows anyone including Google to analyze user health data. The question that is yet to be addressed is how Google will use Fitbit’s data for their own business. They have already stated it won’t be used for targeted ads. This will probably be good enough for competition authorities, unless they can prove that merging Fitbit data sets with Google will give them a serious competitive advantage.\n\n**Players** \n\nAustralia ACCC - Rod Simms. Business man and economist. His opinion on Google acquisitions can be found [here](https://www.accc.gov.au/media-release/digital-giants’-buy-up-of-start-ups-poses-challenges-for-merger-laws). He will likely investigate the deal from a “what’s good for the market” perspective. AU Competition laws are similar to the US, so we can expect similar rulings from either authority. \n\nUnited States DOJ - William Barr. Attorney General under Trump administration. [He has made investigating Google and other online platforms a “top priority.”](https://www.google.com/amp/s/www.cnbc.com/amp/2019/01/15/attorney-general-nominee-william-barr-addresses-antitrust-and-tech.html) He is a wildcard, [because although he believes antitrust laws should be left alone](https://www.google.com/amp/s/www.cnbc.com/amp/2019/12/10/barr-defends-antitrust-law-as-warren-looks-to-reinvent-it.html), he also believes in unitary executive theory. In other words, his ruling may be swayed by Trump. While the deal should be a slam dunk from the perspective of US law, the politics involved make it uncertain. \n\nEuropean Union EC - Margrethe Vestager. Left wing politician. She does not like Google (or big tech), so immense scrutiny is expected. However, [she is not letting data watchdogs (regulators for big data) to participate in the review of the deal](https://www.google.com/amp/s/www.bloomberg.com/amp/news/articles/2020-02-25/google-fitbit-probe-is-for-me-not-data-watchdogs-vestager-says). So we can expect that she will scrutinize the competition effects of merging Fitbit and Google data sets. However, a similar investigation was brought into the Apple and Shazam deal, which was ultimately approved. \n\nThe UK CMA and Canadian Competition Bureau may also investigate the deal, but no filings have been made.\n\n**Conclusion** \n\nGoogle’s recent acquisition of Looker took 9 months to close, so we can expect a similar timeline for Fitbit. Options plays need to pay attention to the important review dates. In all likelihood the deal will be approved, sometime in October. Arbitrage with stocks will likely need to hedge in order for an acceptable risk reward parity.",
        "subreddit": "wallstreetbets",
        "title": "Fitbit Acquisition by Google DD (plays inside)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/h7w22s/fitbit_acquisition_by_google_dd_plays_inside/",
        "created": 1592034422.0
    },
    {
        "author": "gooby123456789",
        "created_utc": 1592940153,
        "id": "hel3gv",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": "I’ve made my fair share of money, is it time to get greedy or get out?",
        "subreddit": "stocks",
        "title": "I bought 100 shares of AAPL in November of 2016 at around $108 per. Is it time to sell?",
        "url": "https://www.reddit.com/r/stocks/comments/hel3gv/i_bought_100_shares_of_aapl_in_november_of_2016/",
        "created": 1592968953.0
    },
    {
        "author": "johnwyckk",
        "created_utc": 1593473294,
        "id": "hibhkr",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": "\n[article 1](https://www.google.com/amp/s/cleantechnica.com/2020/06/27/tesla-terafactories-lithium-securing-the-supply-chain/amp/) \n\n[article 2](https://insideevs-com.cdn.ampproject.org/v/s/insideevs.com/news/419466/tesla-nevada-lithium-supply-potential/amp/?amp_js_v=a3&amp;amp_gsa=1&amp;usqp=mq331AQFKAGwASA%3D#aoh=15934671760417&amp;referrer=https%3A%2F%2Fwww.google.com&amp;amp_tf=From%20%251%24s&amp;ampshare=https%3A%2F%2Finsideevs.com%2Fnews%2F419466%2Ftesla-nevada-lithium-supply-potential%2F)\n\n[article 3](https://www.google.com/amp/s/finance.yahoo.com/amphtml/news/tesla-wants-build-24-hour-093511331.html)\n\nAmerica's tech boom is in full flight.\n\nThe Nasdaq is up 126% in the last four years.\n\nEven the coronavirus pandemic didn't slow it down.\n\nThe tech-heavy index hit new highs in June \n\nApple, Microsoft and Amazon are all worth more than $1 trillion.\n\nThose three, plus Google and Facebook, make up the top 5 companies in the world by market cap.\n\nBut behind the scenes, these tech companies know they have a big problem.\n\nAmerica is short on lithium.\n\nIt's the most crucial ingredient in lithium-ion batteries.\n\nAnd those batteries are what power smartphones, laptops, Internet of Things devices, and more, including Tesla's breakthrough electric cars.\n\nIn fact, lithium is the lifeblood of the entire technology industry.\n\nBut most lithium mines are thousands of miles away in Australia. Or in South American countries with unfriendly regimes.\n\nChina consumes 60% of the world's lithium and directly competes with the U.S. for supplies.\n\nAmerican lithium production has long lagged behind.\n\nWe have 13% of the world's reserves — and only 2% of production.\n\nUntil now...\n\nThere's been a massive new discovery of lithium right here in America.\n\nIt could be enough to supply Tesla for the next 46 years...With plenty left over for the rest of America's tech giants.\n\nThe tiny company who owns the mine trades for around $4.\n\nAnd shares could soar on even the hint of a deal with Tesla.\n\nI invested in Lithium Americas Corp (ticker LAC) Lithium is what is needed to create the batteries for Electric Vehicles for companies like TESLA, NKLA, WKHS, NIO, etc. There are talks of TESLA potentially acquiring a company like LAC to secure the supply of lithium and at the same time be able to produce batteries at cheaper cost. I don’t see this being high risk and feel there is a lot of room to grow on a company like LAC that is why I purchased shares today. If Tesla acquires this company the share price will spike traumatically. This is obviously not guaranteed but a risk I’m willing to take.",
        "subreddit": "pennystocks",
        "title": "Lithium Americas Corp (LAC)",
        "url": "https://www.reddit.com/r/pennystocks/comments/hibhkr/lithium_americas_corp_lac/",
        "created": 1593502094.0
    },
    {
        "author": "Random_Dude_20",
        "created_utc": 1593021325,
        "id": "hf5s3m",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": "So im one of those guys, who invested in Wirecard and want to share some of my experience.\n\nAfterwards one is always smarter or what’s the word? With Wirecard, I was actually really wrong. I think that you have to stand up for it and you should check whether you made a mistake in your investment decision. I want to work through that in this report.\n\nHow did the investment come about, why did I hold on to the company despite the attacks of the short sellers and the reports of the Financial Times? No matter how the result turns out in the end, it is always worth thinking about your bad investments and questioning yourself even more self-critically. This is the only way, and I am convinced of this, to get ahead on the stock market.\n\n## Why did I invest in Wirecard at all?\n\nI actually stayed away from Wirecard for a long time. I missed the price increases of the last few years. Before contactless payment became more and more popular, I did not have this trend on my screen. So I did not continue to deal with the company. In addition, until a few years ago I only and exclusively dealt with strong dividend payers. That has changed somewhat in the last 3 years. I have further developed myself and my investment style, as probably everyone does.\n\nThen the Apple Watch came to my wrist and the possibility to pay contactlessly with the watch everywhere. More and more people were doing it and the topic was more and more often covered in the media and relevant stock market magazines. Since I don’t buy bank shares due to bad experiences, I had a gap in my portfolio. How do you fill it now? I decided on system providers who have their foot very far in the door. That was VISA on the one hand and Adyen and Wirecard on the other. I liked the story at Wirecard. Not least of all, that a man named Markus Braun is obviously such a passionate manager who managed to launch the store from nowhere into a world-famous corporation within a few years. Sales and profits knew only one direction. Due to the many untapped markets, the chance of a growth rocket emerged. Despite the already immense price increases – there was still plenty of room for the next few years. I dared the first small entry with 5 shares at a price of 135 Euro.  \n\n\n## The shortsellers are coming\n\nAt some point, the time was when the short sellers attacked and the reports in the Financial Times about inconsistencies in the balance sheet. For me it was a classic. I thought: Hey, we’re talking about a DAX company here. Who else would you choose to attack from the DAX? The business is entangled and you need subcontractors or partners all over the world to be able to represent the transaction at all. It is difficult to see through that, even if you do everything right. A real find, then. Moreover, the price of the share had long since been geared to the growth of the company. That means that future growth was already priced in. Such shares are increasingly susceptible to volatility as those of solidly valued companies where the price reflects the business. So what did I do? Repurchased, of course!\n\n## Why did I stick with Wirecard and what did I learn?\n\nI just couldn’t believe it. It was beyond irrational. If I have to realize that you can’t hide something like that forever, it should have been clear to a CEO of a DAX company long ago. Besides, every year there was a certificate and economic report from the renowned auditors. You look twice as much on the fingers of a DAX company.\n\nWrongly conceived! That is the greatest learning in history. You cannot even trust the auditors to do their job properly. I have closed my eyes for too long in good faith that there are too many functioning control bodies. With my capabilities, I have to trust my gut. But even large investment funds like DWS, which can have insight into the company at any time, have been deceived.\n\nI am convinced that no small shareholder could have foreseen the fraud itself, but I decided for myself that as soon as shortsellers on a large scale start attacking a stock somewhere, I am OUT! We small shareholders have even less insight than the big boys and then such an investment quickly turns into a gamble. Since my money is too good for gambling I will keep my hands off such shares in the future. There are so many wonderful opportunities and companies, it is not necessary to take such a ride on the cannonball.\n\n## What did I do with the Wirecard shares?\n\nI still have it! At the first massive slide last Thursday, I still thought something was wrong. Why does the auditor only come around the corner on the day the annual financial statements are published and say “Hey, we’re missing 1.9 billion euros”? I thought it was clearing up. If I sell now, I’ll have massive losses and tomorrow the price will go through the roof. On Friday, when it was clear that there was no 1.9 billion or the two banks did not know Wirecard as customers, it was too late to sell. All in all, I have never been heavily invested in Wirecard. I had and have a total of 20 shares. At a price of 80 euros I can sell them +/- 0. I have decided to sit out the dilemma. I have mentally written off the money but who knows: Maybe there will be a turn around story with new management at some point or another company or bank will buy Wirecard.\n\nIn this sense, my thoughts are with those who had to cope with high losses with Wirecard. It shows once again how important diversification is. Do not put all your eggs in one basket. A good guideline is certainly that no position in the portfolio should amount to more than 5%. I do very well with a maximum of 2-3 %. But that also means a lot of work, as I have to deal with more and more companies all the time.\n\nIt is important that you do not let your head hang down and question whether company investments are the right investment. To lie beside it belongs to it when investing. It is much more important to learn from it. To look the facts in the eye and to question critically where you could have done something better yourself. On the stock exchange, nothing is as important as experience – the good ones, and unfortunately also the bad ones!\n\nAre you invested in Wirecard or have you sold at a loss? I am looking forward to your comment.",
        "subreddit": "investing",
        "title": "Wirecard – I was so wrong! (my experience report)",
        "url": "https://www.reddit.com/r/investing/comments/hf5s3m/wirecard_i_was_so_wrong_my_experience_report/",
        "created": 1593050125.0
    },
    {
        "author": "alpe77",
        "created_utc": 1593475638,
        "id": "hic55k",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "So Apple will be designing its own silicon... but who will manufacture it? My first guess is TSMC, which already supplies the chips for the iPads. But Apple doesn't like to be dependent on its suppliers, and has a habit of either buying them, or switching between them to keep them on their toes.\n\nAt 280B market cap, TSM isn't \"cheap\", but Apple has the cash, or can trivially get financing at today's low rates. If it makes sense to design you own silicon, why not also manufacture it? The vertical integration would save costs, while also potentially denying Android competitors a chip vendor, which would likely drive up their costs as competition shrinks. (Long Samsung if this happens?) Or just keep selling chips to the competition and make money off Android sales too!\n\nEven if Apple doesn't buy them, it's likely they will manufacture more chips for Apple, so long TSM.\n\nIf the performance of the custom silicon is as good as promised, Apple will gain a huge and quite durable advantage over everyone except Samsung, who has their own chip fab. So, long AAPL too.\n\nWhat do you think?",
        "subreddit": "investing",
        "title": "Apple and TSMC",
        "url": "https://www.reddit.com/r/investing/comments/hic55k/apple_and_tsmc/",
        "created": 1593504438.0
    },
    {
        "author": "jacksonjuncture",
        "created_utc": 1591126741,
        "id": "gve5vw",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "Just kidding.  I’ve been going through companies that our family has been giving our money too. Of course everything seems oversold lately.  Wall mart, lululemon, Apple, target, visa/MC, McDonalds, Amazon, Microsoft, etc.    Are there any up and comers that you guys are watching across any industry?",
        "subreddit": "stocks",
        "title": "So what stock will make me rich?",
        "url": "https://www.reddit.com/r/stocks/comments/gve5vw/so_what_stock_will_make_me_rich/",
        "created": 1591155541.0
    },
    {
        "author": "SD_Lee",
        "created_utc": 1592438530,
        "id": "hb3e90",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "Hey Everyone,\n\nI’ve been investing in the stock market for the last ~4 years with majority of my investments being relatively “safe” (Amazon, Facebook, Google, Apple etc). \n\nI recently started to broaden my portfolio and started to invest in more of these ‘hype/meme’ stocks, hoping to get in right before it takes off (Tesla, DraftKings, Nikola etc).\n\nQuestion: It seems like I’m always a little late to catching the hype, where do you guys find these? How are you guys doing your research? Any recommendations where I can be more proactive?\n\nThanks in advance!",
        "subreddit": "StockMarket",
        "title": "How to Research / Getting in before the Hype",
        "url": "https://www.reddit.com/r/StockMarket/comments/hb3e90/how_to_research_getting_in_before_the_hype/",
        "created": 1592467330.0
    },
    {
        "author": "inthegreen07",
        "created_utc": 1592795533,
        "id": "hdk654",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "Built my bankroll swing trading and now it’s time to settle down and transfer my investments for the long haul. Love companies like NET, MSFT, DIS, RTX, DKNG, SHOP, TELSA. This would be my goal high risk high reward portfolio. \n\nI’ve always been anti ETF, seems like they never move and even if their biggest holdings do well they can go down.\n\nWell I cashed out my holdings in my trading app and am transferring to my big boy portfolio. Here are my holdings. \n\nFirst off screw spy and voo. Boring\n\nI went sectors I was interested in for example I love DraftKings and NET but who knows if the competition comes out of nowhere and eats them up. So let’s go with BETZ and WCLD\n\nSo here’s my ETFs I’ll be buying into and some of their top holdings.\n\nBUYZ- AMZN, SHOP, SE, BABA, Mercado\nOnline shopping if the future\n\nWCLD- Fastly, ZM, DDOG, DOCU, Wix\nEverything will be on the cloud \n\nBETZ- GAN, DKNG, Flutter, PENN\nIt’s like investing in alcohol during the prohibition \n\nXNTK- Telsa, SHOP, AMZN, AMD, Activison, NVDA\nWho doesn’t love those companies futures \n\nARKW- TSLA, SQ, PINS, ROKU\nYou had me at Telsa and square leading an ETF\n\nARKQ- TSLA, 2U, Autodesk, Teradyne\nIf telsa doesn’t moon one of these next gen stocks will\n\nQCLN- TSLA and bunch of clean energy stocks\nShut up I like telsa and oil will go dry eventually right?\n\nIETC - Microsoft, Apple , FB, google\nThis was my favorite MSFT heavy etf\n\nPPA- RTX, Lockheed, Honeywell, BA\nDefense stock of choice\n\nFDIS- AMZN, HD, Nike, telsa, McDonald’s \n30% Amazon\n\nPEJ- chipotle, DIS, PENN, LUV\nFavorite Disney etf (IYC gets a shoutout here)\n\nSHE- PayPal, V, MA, Gilead, HD\nMy banking etf with the most interesting holdings \n\nGERM- covid ETF\nI always wanted to invest in the cure(it’s in here) \n\nPW- my REIT, holds greenhouses for solar energy and marijuana. And railroads. None of which will be affected much when people can’t pay mortgage or start working from home.\n\nI went out of the box, some of these ETFs aren’t priced super high and make it easier for me to keep adding to positions. I think the total holdings were very unique that help with the potential.",
        "subreddit": "stocks",
        "title": "Making the switch to ETFs... here are my potential holdings. Let’s find gold",
        "url": "https://www.reddit.com/r/stocks/comments/hdk654/making_the_switch_to_etfs_here_are_my_potential/",
        "created": 1592824333.0
    },
    {
        "author": "wolley_dratsum",
        "created_utc": 1592566032,
        "id": "hbz0h8",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "If an investor were to put $1,000 into 100 stocks that dropped below $1 per share in 2008 they would be a multi, multi millionaire today.\n\nOn average there is a correction in the S&amp;P once per year.\n\nOn average there is a bear market every 3-5 years and it lasts on average 10-12 months.\n\nWhen the stock market is down, it means stocks are on sale. \n\nThis is important: If an investor missed out on the 20 best trading days in the last 10 years, their expected total returns would be cut in HALF.\n\nAll of this is to say, look for opportunities to buy on market pullbacks, but do not try to time the market because you never know when the best 20 trading days of the next 10 years will be. \n\nDollar cost averaging and buy and hold are the surest way to get rich investing in stocks, but also look for opportunities to buy the dips the inevitably happen every year. \n\nWhen the stock market crashes like it did this years, don’t panic; instead, get greedy and start buying. If an Apple MacBook was suddenly on sale for 50% you’d be happy; so why do people freak out when Apple stock goes on sale? It makes zero sense.\n\nTwo truths: the stock market always goes down, and it always goes up. Don’t sweat the “bad times” because I’m the long run they aren’t bad times they are opportunities to make a killing in the market.\n\nThis advice all comes from assorted billionaires, from Buffett to Bogle, who have shared their investing advice over the years.",
        "subreddit": "investing",
        "title": "Some very sage advice",
        "url": "https://www.reddit.com/r/investing/comments/hbz0h8/some_very_sage_advice/",
        "created": 1592594832.0
    },
    {
        "author": "PoopyInMyPants",
        "created_utc": 1591907303,
        "id": "h17as9",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "Hey guys - my friend who's pretty savvy in the stock market finally got me to start investing today. He gave me a few options, told me to diversify, and gave me some good starting points. He also told me that the last few days and the next week or so will probably be pretty bad for the market, so now is a good time to buy stocks. Here's what I bought today and my reasoning behind these. Let me know if I'm off to a good start. I only spent about $1200, I have more in savings that I'm willing to spend but I'm being a little conservative as I'm just starting. My goals are more long term (5-20 years) as I don't have the time or energy to trade daily.\n\n\\-Nikola ($NKLA): Just opened, competitor to Tesla, electric truck manufacturer. One of the hotter new stocks at the moment. I think there's room for other electric vehicle stocks alongside Tesla. I plan on buying Tesla stock once I can transfer more money to my account.\n\n\\-Xpress Spa: Fresh off a 1/3 split, my friend told me it's a good time to invest since they're doing COVID-19 testing. Don't know too much about these guys, but stock was cheap.\n\n\\-Ideanomics ($IDEX): Friend recommended this to me since it was cheap. Also did some research and saw they're planning on facilitating purchases of commercial electric vehicles. They've already made deals for commercial buses in China. Was only $1.01 a share today.\n\n\\-Draft Kings ($DKNG): Not only a casual user of the app, but sports gambling is going to explode in the next 1-5 years.\n\n\\-Eldorado Resorts ($ERI): Purchased Caesar's Palace and will be the first casino partner of the NFL. That alone is a good sign of future success, along with the fact that there are more and more pro sports teams moving to Vegas.\n\n\\-Penn National Gaming ($PENN): Owns 36% of Barstool Sports which has become one of the leaders in the sports blogging industry. Also owns 40+ gambling/gaming locations throughout the country.\n\n\\-GAN Ltd ($GAN): Online Casino Gaming\n\n\\-Heico ($HEI): Specializes in aerospace avionics, components and spare parts. Also makes medical equipment like ventilators, X-Ray systems, sterilization, and personal protective equipment. This was me trying to diversify and I did some research and it seemed like a solid buy.\n\n\\-II-VI ($IIVI): Friend told me to look in to some optics companies as they will be strong in the future of manufacturing. I did some research and found II-VI, which makes opto-electronic components for a wide range of manufacturers.\n\n\\-Viavi ($VIAV): Network test, assurance, and measurement company that tests equipment for networks. Don't know TOO much about this, but have seen it on multiple articles as a solid stock with the upcoming 5G revolution and ever expanding network across the world.\n\n\\-Tesla, for obvious reasons\n\n\\-Qualcomm ($QCOM): Finally made peace with Apple and will be supplying chips for the iPhone for next 6 years. With 5G inevitably booming in the next few years, I saw this as a must buy.\n\n\\-Ericsson ($ERIC): As a communications-equipment company who will be rolling out 5G technology worldwide, I saw this as a great buy. They also sell software and radio hardware and has a deal with Oppo, the Chinese smartphone manufacturer. Expects 2.6 billion 5G subscriptions by 2025 and is only selling at $8.76/share.\n\n\\-Verizon ($VZ): Just another attempt to get in on the 5G revolution.\n\n\\-PowerShares S&amp;P 500 High Dividend Low Volatility ETF ($SPHD): Watched some YouTube videos and I really liked what YouTuber Andre Jikh had to say about a few ETFs and Dividends. I like the sound of ETFs as they take a lot of work out of investing, provide consistent dividents, and aren't volatile.\n\n\\-Vanguard Total Stock Market ETF ($VTI): Want for the same reasons as SPHD, but after some research see that it's a bit more growth oriented (albeit volatile?) than SPHD. Thought it be good to grab this along with SPHD as it also gives dividends.\n\nSo...like I said I am a complete beginner in investing in stocks and really did all of this just by googling stuff and doing some research, watching youtube videos, etc. Please tell me if I'm an idiot about ANY OF THESE stocks and why I'm wrong, because that's why I'm posting this.\n\nAlso - what are some great FREE resources to use to get more stock education, advice, and trends on the market?",
        "subreddit": "stocks",
        "title": "First time buying stocks, did I make good first purchases?",
        "url": "https://www.reddit.com/r/stocks/comments/h17as9/first_time_buying_stocks_did_i_make_good_first/",
        "created": 1591936103.0
    },
    {
        "author": "Mansmisterio",
        "created_utc": 1592511657,
        "id": "hbm6ji",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "Let's try to answer this question !\n\n**Who ?**\n\n« Wirecard is an international supplier of electronic payment and risk management services. Wirecard offers products and services in the areas of [mobile payments](https://en.wikipedia.org/wiki/Mobile_payment), [e-commerce](https://en.wikipedia.org/wiki/E-commerce), [digitization](https://en.wikipedia.org/wiki/Digitization) and finance technology. This traditionally comprises the integration of payment methods, payment transactions via e-commerce as well as payment transactions at the stationary checkout ([POS](https://en.wikipedia.org/wiki/Point_of_sale)). In these areas, Wirecard currently works in cooperation with 280,000 companies (as of December 2018), including [Allianz](https://en.wikipedia.org/wiki/Allianz), [KLM](https://en.wikipedia.org/wiki/KLM), [Qatar Airways](https://en.wikipedia.org/wiki/Qatar_Airways),[Rakuten.com](https://en.wikipedia.org/wiki/Rakuten.com) and [Transport for London](https://en.wikipedia.org/wiki/Transport_for_London), among others. The transaction volume in 2018 was US$125 billion. In the first half of 2019 the transaction volume grew by 37.5 percent to EUR 77.3 billion. » Wikipedia \n\n**Shareholders ?**\n\n&amp;#x200B;\n\nhttps://preview.redd.it/rzpbs9z98q551.png?width=1280&amp;format=png&amp;auto=webp&amp;s=e65866db19ca77189d307e4f61b528e538b7f374\n\n**Creditors :**\n\n&amp;#x200B;\n\n* Deutsche Bank took half of Markus shares as a collateral for a loan of 150m € to Markus not Wirecard\n\n**Market share ?** \n\nThose are the countries using the most Wirecard :\n\n&amp;#x200B;\n\nhttps://preview.redd.it/wl1tg5xa8q551.png?width=416&amp;format=png&amp;auto=webp&amp;s=69082fc467534b0a127e1d42deefff048a4a9824\n\nMarket shares of the European competitors : \n\n&amp;#x200B;\n\nhttps://preview.redd.it/fsz15v5c8q551.png?width=1994&amp;format=png&amp;auto=webp&amp;s=30d876934f7ee8734a3a58f2c219a05e95d9ba0c\n\n*Side note* : Amongst international competitors there arePaypal, Visa, Apple Pay …\n\n**What happened ?**\n\nAll really begun with this 59 pages report written by KPMG ([https://www.wirecard.com/uploads/Bericht\\_Sonderpruefung\\_KPMG\\_EN\\_200501\\_Disclaimer.pdf](https://www.wirecard.com/uploads/Bericht_Sonderpruefung_KPMG_EN_200501_Disclaimer.pdf)) concerning a forensic special investigation on Wirecard, which basically mean that they are investigating about a **specific case** with the aim of fully clarifying a potential (not necessarily criminally relevant) violation or misconduct, so this is not a annual audit.\n\nIn this report, KPMG complained about the lack of will of Wirecard to give informations, KPMG was unable to obtain standard information that it requested from Wirecard such as bank statements, customer names and contracts as well as transaction data.\n\nThis document was the main reason of the Chris Hohn’s open letter. The famous hedge fund manager published an open letter on April 28 to Thomas Eichelmann, the chairman of Wirecard ([https://www.tcifund.com/files/corporateengageement/wirecard/TCI%20-%20Letter%20to%20Wirecard%2028%20April%202020.pdf](https://www.tcifund.com/files/corporateengageement/wirecard/TCI%20-%20Letter%20to%20Wirecard%2028%20April%202020.pdf)).\n\nIn his letter, he states the audit made by KPMG was inconclusive, « KPMG explains that it has encountered an “Untersuchungshemmnis” (in English: obstacles to the investigation) », basically, 1 billion $ was missing between 2016 and 2018. So it raises questions to how investors, lenders and regulators can be confident that Wirecard’s current and historic accounting is accurate, so they wanted for Wirecard to show some trust by firing Markus the CEO, but today he is still here. He concluded by announcing that he was short selling 1.04% of shares outstanding of Wirecard.\n\n**Since then :** \n\n&amp;#x200B;\n\n* TILP filed an investor lawsuit. The lawsuit claims that the KPMG report showed that the group for years had experienced a massive shortfall in compliance\u009d that it had been obliged to disclose to shareholders early on. Why is it important ? Because this law firm has already won cases against Porsche and Volkswagen during the diesel gate.\n\n&amp;#x200B;\n\n* Al Alam a Dubai business payment processor their most significant business partner entered liquidation on May 2\n\n&amp;#x200B;\n\n* Today the stock dropped 61% and their bonds by more than 40% because EY which was conducting an annual audit said that they were unable to confirm the existence of 2.1b $, and that «  spurious cash balance » have been provided to auditor by 3rd party. This missing fund represents 25% of the company. They have to come clean by tomorrow (June 18).\n\n**Conclusion :**\n\nConsidering the online payment business as fast very forward industry, Wirecard is facing two challenges :\n\n&amp;#x200B;\n\n* First, they will need to find a managerial equilibrium in a short time\n* Second, they will need earn back trust from current clients and future ones. They may loose more clients in the short term.\n\nThose challenges are actually very hard to tackle in an healthy market but in this one it seems nearly impossible, furthermore, big investors will be selling massively those next few days so we might see more loses.\n\n**I am not a financial advisor but I would say that in the long and short term the stock is going down as well as the company.**",
        "subreddit": "wallstreetbets",
        "title": "What is going on with Wirecard ?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hbm6ji/what_is_going_on_with_wirecard/",
        "created": 1592540457.0
    },
    {
        "author": "raebyagthefirst",
        "created_utc": 1591836647,
        "id": "h0omfy",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "Futures are red,\n\nViolets are blue,\n\nBulls r getting rect,\n\nBut u too.\n\n&amp;#x200B;\n\nP.S. Money printer go brrrrrrrr\n\nPositions: AAPL $340p 06/12, AAPL $340p 06/19",
        "subreddit": "wallstreetbets",
        "title": "Ode to the bears",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/h0omfy/ode_to_the_bears/",
        "created": 1591865447.0
    },
    {
        "author": "noentic",
        "created_utc": 1592866722,
        "id": "he2u9c",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "Welcome to another daily Unusual Options Activity post. Why do DD when you can see what stocks people are heavily investing in? \n\nRecap – S&amp;P 500 gained 0.7% today, with the Nasdaq gaining 1.1%. MSFT hit ATH of 200.57. The U.S exceeded 30,000 new cases on Saturday for it’s highest daily level since May, but some areas are reporting lower infections. There is an increasing rate of infections among younger individuals. The Existing Home Sales report declined 9.7%, it’s the third straight month of declines. \n\nFriday’s picks all faired reasonably well. KPTI declined -.10, (-0.53%). ITCI increased +.47, (+1.86%). NUAN increased +.88, (+3.55%). ENB declined -0.07, (-0.23%). \n\nSONO, a pick from June 17th, had rumors of a buyout from AAPL and increased +18.9%. I took this trade on June 18th after it declined and plan to hold a while longer. FSLY was also reported on the 17th and rose close to +20%. Sometimes patience pays with these picks.\n\nOption Activity Summary for today – \n\n**Today’s Option Activity Fast Facts (Stocks &gt;$6)**\n\n**Sentiment – CBOE Put/Call Ratio -** 0.78, VIX: (32.63, -2.49, -7.1%).\n\n**Highest Multiple over Daily Avg (with ADV &gt;1k) – NVO trading at 24x it’s ADV of 1,061. 25,449 calls and 320 puts were traded.**\n\n**Ticker with Most Contracts Traded – SPCE with 262,814 contracts traded. 220,449 calls and 42,365 puts.** \n\n**Largest Put to Call Ratio (w/ Option volume over 10k) –**  **FSLR with P/C ratio of 13.1. 10,758 puts and 783 calls were traded.** \n\n**Largest Call to Put Ratio (w/ Option volume over 10k) –VNQ with a C/P ratio of 133. 76,61 calls and 573 puts were traded.** \n\n***MOMENTUM UNSUAL OPTION ACTIVITY -*** \n\n1.  ***Ticker: NVO***\n\n**Spot Price** **: 67.94, +.39 (+.58%)**\n\n**Sector: HealthCare**  **Industry : Biotechnology**\n\n**Company Summary** (from Yahoo Finance)**:** Novo Nordisk A/S, a healthcare company, engages in the research, development, manufacture, and marketing of pharmaceutical products worldwide. It operates in two segments, Diabetes and Obesity care, and Biopharmaceuticals. The Diabetes and Obesity care segment provides products in the areas of insulins, GLP-1 and related delivery systems, oral antidiabetic products, obesity, and other chronic diseases. The Biopharmaceuticals segment offers products in the areas of haemophilia, growth disorders, and hormone replacement therapy. The company has a strategic alliance with Evotec AG to discover and develop small molecule therapies to treat patients suffering from diabetes, obesity, and co-morbidities, as well as has a research collaboration with Kallyope Inc. It also has collaboration agreements with Lund University to develop stem cell-derived treatment for Parkinson's diseases; Staten Biotechnology B.V. to develop novel therapeutics for the treatment of dyslipidaemia; Medtronic plc to develop integrated digital solutions for people with diabetes; and bluebird bio, Inc. to develop in vivo genome editing treatments for genetic diseases. The company was founded in 1923 and is headquartered in Bagsvaerd, Denmark.\n\n**Special Considerations** : 52WkHigh\n\n**Next Earnings Date**: 08/06/2020\n\n**Option Information :** \n\n**Today's Option Volume :**25,759  **Average Daily Volume :**1,061  **Multiple over ADV**: 24\n\n**Total Calls :**25,449  **Total Puts :**320  **C/P Ratio :**79.5\n\n**Calls at ask % :**45.6%  **Calls at bid % :** 37.7%  \n\n**Puts at ask % :**40.8%  **Puts at bid % :** 39.2%\n\n**Notable Strikes : Jul 17 ’20 72.5C had 22.5k VLM with 4.3k OI.** \n\n**My Impression : I have stayed away from Biotech stocks recently due to too much hype over a CoVID-19 cure giving false flags of positive news. However, NVO recently had completed two studies on obesity drugs. This stock could be decent candidate to buy and hold; however, I think buying the actual options are a bit riskier due to the erratic nature of clinical trials.**\n\n2.  ***Ticker: JNPR***\n\n**Spot Price** **:23.14, -.13, (-.56%)**\n\n**Sector:Technology**  **Industry :Communication Equipment** \n\n**Company Summary** (from Yahoo Finance)**:** Juniper Networks, Inc. designs, develops, and sells network products and services worldwide. The company offers routing products, such as ACX series universal access routers to deploy high-bandwidth services; MX series Ethernet routers that function as a universal edge platform; PTX series packet transport routers; cloud customer premises equipment; and NorthStar controllers. It also provides switching products, including EX series Ethernet switches to address the access, aggregation, and core layer switching requirements of micro branch, branch office, and campus environments; QFX series of core, spine, and top-of-rack data center switches; and mist access points, which provide wireless access and performance. In addition, the company offers security products comprising SRX series services gateways for the data center; Branch SRX family provides an integrated firewall and next-generation firewall; virtual firewall that delivers various features of physical firewalls; and advanced malware protection, a cloud-based service and Juniper ATP. Further, it offers Junos OS, a network operating system; Contrail networking and cloud platform, which provides an open-source and standards-based platform for SDN and NFV; Contrail Insights, an optimization and management software platform for public, private, and hybrid clouds; and Marvis Actions and AI-driven Virtual Network Assistant, which identifies the root cause of issues across the information technology, domains and automatically resolves issues. Additionally, the company provides technical support, maintenance, and professional services, as well as education and training programs. It sells its products through direct sales, distributors, value-added resellers, and original equipment manufacturer partners to end-users in the cloud, service provider, and enterprise markets. The company was founded in 1996 and is headquartered in Sunnyvale, California.\n\n**Special Considerations** : None\n\n**Next Earnings Date**: 07/28/2020\n\n**Option Information :** \n\n**Today's Option Volume :**20,972  **Average Daily Volume :**5,531  **Multiple over ADV**:4 \n\n**Total Calls :**20,454   **Total Puts :**518  **C/P Ratio :** 39.4\n\n**Calls at ask % :**25.5%  **Calls at bid % :**44.00%  \n\n**Puts at ask % :**17.5%    **Puts at bid % :** 37.5%\n\n**Notable strikes : Jul 10 ’20 25.5C had 11.1k VLM with 18.2k OI.** \n\n**My Impression :**  **A significant percentage of the calls placed today were at the bid, and more than half of the volume today was at the 25.5 strike price. It will be interesting to see what the OI is tomorrow at this strike price. Additionally, the chart looks pretty bearish. This may be a**  **candidate to do a bear call on.**\n\n**CLASSIC UNUSUAL OPTIONS ACTIVITY –** \n\n**1.**  **Ticker** :FSLY    **Earnings:** 08/06/2020\n\n**Sector**:  Technology  **Industry**: Software-Application\n\nOption Information : JUL 02 ’20 80C, 650 calls were bought for $2.35 at 3:49 PM as a BLOCK. Spot price – 73.31.  \n\nCompany Profile (from Yahoo Finance): Fastly, Inc. operates an edge cloud platform for processing, serving, and securing its customer's applications. The edge cloud is a category of Infrastructure as a Service that enables developers to build, secure, and deliver digital experiences at the edge of the Internet. It is a programmable platform designed for Web and application delivery. As of December 31, 2019, the company's edge network spans 68 points-of-presence worldwide. It serves customers operating in digital publishing, media and entertainment, technology, online retail, travel and hospitality, and financial technology services industries. The company was formerly known as SkyCache, Inc. and changed its name to Fastly, Inc. in May 2012. Fastly, Inc. was founded in 2011 and is headquartered in San Francisco, California.\n\n**2.**  **Ticker** : NCLH  17.09 (-1.13, -6.2%)  **Earnings:**\n\n**Sector**: Consumer Cyclical    **Industry**: Travel Services\n\nOption Information : JUL 2 ’20 20C, 3,063 calls were bought for $.70 at 3:59PM. Spot price – 17.12. \n\nCompany Profile (from Yahoo Finance): Norwegian Cruise Line Holdings Ltd., together with its subsidiaries, operates as a cruise company in the North America, Europe, the Asia-Pacific, and internationally. The company operates the Norwegian Cruise Line, Oceania Cruises, and Regent Seven Seas Cruises brands. It offers cruise itineraries ranging from a few days to 180-days calling on various locations, including destinations in Scandinavia, Russia, the Mediterranean, the Greek Isles, Alaska, Canada and New England, India and the rest of Asia, Tahiti and the South Pacific, Australia and New Zealand, Africa, South America, the Panama Canal, the Caribbean, and Harvest Caye. As of February 20, 2020, the company had 28 ships with approximately 59,150 berths. It distributes its products through retail/travel advisor, international travel advisor, and onboard cruise sales channels, as well as meetings, incentives, and charters. The company was founded in 1966 and is headquartered in Miami, Florida.\n\nNotable Mentions: \n\nMOMO – JUL 17 ’20 - 23.26C \n\nSPCE – JUN 26 ’20 – 19C &amp; 20C \n\nSONO – JUL 17 ’20 - 15C\n\nOther stocks with Unusual Option Activity: \n\nBullish : GERN AUG 2 Calls\n\nODP AUG 2 Calls \n\nCTL Jan 21 Calls\n\nBearish : \n\nVALE JUL10 Puts\n\nUpcoming Events for tomorrow – PMI Composite, New Home Sales, Richmond FED Manufacturing – times are available in the Economic Calendar section on the website. \n\nThanks for reading.   \n\n\nDISCLAIMER – These are my observations that I have made at the end of each day and trades that I am considering placing or watching. I am not responsible for your financial losses if you follow any of these trades. As always, do your due diligence.",
        "subreddit": "wallstreetbets",
        "title": "Unusual Option Activity Recap for June 22nd, 2020 - NVO, JNPR, FSLY, NCLH",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/he2u9c/unusual_option_activity_recap_for_june_22nd_2020/",
        "created": 1592895522.0
    },
    {
        "author": "Jburd6523",
        "created_utc": 1593285614,
        "id": "hgzmvz",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "I like to do summaries of the news throughout the week to keep myself up to date on all the bullshit that could affect the market. This is what happened this week. \n\nThe IMF revised their global GDP growth forecast this week estimating a -5% contraction which is worse than what was originally expected. Previously in April they had forecasted that GDP growth would contract only -3% in 2020. All indices saw massive selling pressure after the announcement wiping out previous gains to end the week in the red. The S&amp;P ended the week down nearly 3%, the Nasdaq declined 2.5% closing below 10,000 points, and the dow had a steep decline of 4.4%. They cited concerns over an output loss of over $12 trillion to the global economy, as well as debt levels reaching their highest ever in relation to GDP.\n\nDonald Trump signaled that further stimulus is being discussed for the month of July although no official plan has been proposed by congress yet. Steve Mnuchin seemed to suggest that another stimulus would be “much more targeted towards jobs”. This seemed to imply that rather than a second round of stimulus checks there would be incentives for getting back to work and creating jobs. This would probably be welcomed considering the extra $600 in unemployment benefits individuals have been receiving is set to end at the end of July. Although there is concern that the sudden drop in benefits will end up greatly affecting individuals who are relying on unemployment to stay afloat during the Covid crisis. Arizona current pays the lowest amount of unemployment at a max of $245 per week, and is also starting to be considered the new epicenter of Corona Virus in the US and is now seeing between 2500-3000 new cases per day.\n\nTech got their ass beat this week as $AAPL announced they would be closing down stores in states that have seen increases in Covid 19 cases. Earlier in the week they had reached a new ATH of $371 as some speculated they may have their best quarter ever, but ended the week almost $20 lower at $353.\n\nFacebook received a beating dropping 6.5% after Verizon pulled their ads from facebook after complaints that their ads were showing up next to anti-semetic ads. This sparked a boycott of $FB with many companies suspending their ads such as REI, North Face, Levi Strauss, Honda, Hersheys, Eddie Bauer, Coca Cola, &amp; Ben and Jerries. This caused Zuckerberg to take reverse his previous stance of non regulation of ads on his website, and is now beginning a new process of reviewing content to filter out hateful and deceitful advertising.\n\nDespite Steven Mnuchin claiming “The US can’t shut down again” although states have already rolled back reopening measures. So far the states that have slowed or abandoned reopening due to raise in Covid-19 cases are California, Texas, Florida, Louisiana, Idaho, New York, North Carolina, Florida, Kansas, Maine, Nevada, and Oregon. On Friday 06/26 Corona Virus cases surged more than 40% compared to the previous week, with 45K new cases reported across the US on Friday alone with the younger population between 20-40 accounting for a majority of those caes. This is believed to be in large part to young people being out in the general public from states reopening.\n\nTrump secured another deregulation victory this week loosening up reactions on banks that were placed on them after the 2008 financial crisis. The deregulation will free up capital for banks to make riskier investments that ultimately led to the great recession. Banks will now be able to make easier trades in venture capital, and removes requirements for setting aside capital when derivative trading. This will free up billions of dollars for banks to make investments such as swaps, and I for one can’t wait to be able to buy a house for pennies on the dollar again. This initially caused a financial sector rally on Thursday while the rest of the market was tanking until the Fed released the results of their stress test. The stress test of 33 banks showed that many would remain solvent during hard economic conditions, but some could fall dangerously low on their reserves. As a result the Fed capped bank dividend payments and share buy backs for the third quarter.",
        "subreddit": "wallstreetbets",
        "title": "This Weeks News &amp; Events 06/22 - 06/26",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hgzmvz/this_weeks_news_events_0622_0626/",
        "created": 1593314414.0
    },
    {
        "author": "SecretPeanutButter",
        "created_utc": 1593226531,
        "id": "hglrmp",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "TOO LONG DIDNT READ: 6/22 volume explodes from a typical 900k-2M range to 43M on news Apple wants to buy SONO. So I wanna buy SONO too. I'm broke af, but in big boy leaps hoping to ride the wave to $25.\n\nPositions: 2x SONO 15c 21/01/22 at $3.60 and 1x SONO 30c 21/01/22 at 1.05.\n\nCurrently up 33.33% on the 15c and 45.24% on the 30c. Hoping to buy a used Prius when this is all over. Options won't be exercised, only sold. I'm a degen tarder (trader?) like everyone else here, no air quote \"investing\" here.\n\n&amp;#x200B;\n\nSo... what is SONO? They make speakers, just google it. Why trader SONO? Ah, great question young dumb!\n\n* Rumor is Apple wants to buy it. This would be a great fit for three reasons. 1) SONO speakers sound good and are dick simple to set up and use. Apple loves products that reduce friction and allow immediate, deep engagement. 2) SONO makes its own speakers. Apple is on a vertical integration spree peaking with the announcement of ARM processors into Macs. It only makes sense to have a firm that produces speakers and drivers be brought into the fold. 3) SONO sells music to businesses via a third party license agreement, see below. this molds into Apples current service first business approach and would allow them to sell Apple Music + speakers + Siri to businesses.\n* Over 30% of SONO customers are repeat customers. This is important because repeat customers tend to stay loyal, meaning less money to maintain customers or more money to spend acquiring new customers. What other fruit named company does this?\n* SONO sells to businesses. Remember when stores were open and they played music? Well music ain't free and businesses can be sued for playing shit they didn't license properly. SONO resells music from Soundtrack Your Brand through three packages. The pricing is at 50, 80 and 100/month for business that are 1000, 2000 and over 3000 sqft. SONO leases them the speakers for free and provides all the support for them.\n* SONO sells to consumers. They're stuck at home and probably want to play some f\\*ck music when they get out the old fleshlight or hitachi magic wand. Other things go brrrrrr too!\n* Over 70% is owned by institutional investors, meaning they trust that it will at least not tank.\n* Earning Q1 2020 were 0.60 per share, up from -0.28 the previous quarter. Q2 2020 earnings were -0.48 per share. Q3 out in August\n* It busted through, then pulled back on the $15 resistance. One more push and It'll get through on good momentum\n\nBoring stuff\n\n* Current price - 15.00\n* 52 week high - 16.88\n* Resistance levels - 15.20, $15.68, 16.00, 16.88\n\nNews\n\n* 🐂6/26 - Laid off 12% of current employees, approx. 170, exec. pay reductions, and closing stores saving $25-30 million overall to be reflected in Q3\n* 🐂6/22 - Apple May Potentially Acquire Audio Company Sonos, Citron Research Speculates\n* 🐻6/18 - SONO raises $13.9 million via stock sale range $13.25-$13.50\n* 🐻6/16 - ISS - EVA downgrades SONOS INC from HOLD to UNDERWEIGHT. \n* 🐂6/11 - Morgan Stanley Lifts Sonos' Price Target to $19 From $13, Keeps Rating at Overweight\n* 🐂6/any - Numerous reports of unusual option activity related to SONO calls\n\n&amp;#x200B;\n\n[Look at that volume, mmmm](https://preview.redd.it/nw4tqzxd5d751.png?width=2396&amp;format=png&amp;auto=webp&amp;s=73df6663c8db0414af0772076026daacf3f5c3a8)\n\n&amp;#x200B;\n\n[Looks like come of you clever ones got in, good job](https://preview.redd.it/5j35b43tad751.png?width=1256&amp;format=png&amp;auto=webp&amp;s=17ba70eec5652ea54b6f1ba9dabf152999b8de87)\n\nSo the play... today it hit just over 15.20 to form a double top while SPY was eating itself alive. If you're a true WSBer, buy a long call at open Monday. If you can hold your orgasm longer than two seconds then look for a dip next week and get in on 2+ month out calls. Look to sell anywhere above $16.50\n\n&amp;#x200B;\n\nTL;DR - SONO calls on rumor Apple might buy them. Watch for IV crush you degens. **LONG LIVE KING JPOW**",
        "subreddit": "wallstreetbets",
        "title": "Wireless Home Tendies with SONO. My first DD, be hard.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hglrmp/wireless_home_tendies_with_sono_my_first_dd_be/",
        "created": 1593255331.0
    },
    {
        "author": "ilikepancakez",
        "created_utc": 1592940124,
        "id": "hel34k",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "https://www.marketwatch.com/story/in-this-case-losing-apple-as-a-customer-would-be-good-news-2020-06-15\n\nIntel's loss of Apple’s business will likely be a headwind to the tech company's client-computing group growth in the near to intermediate term, but as the world leader in microprocessors for data centers and PCs, Intel has many avenues for revenue and earnings growth in the future. Apple is only about 4% of Intel's total revenue. It’s estimated that Apple currently accounts for only 10% of the platform products revenues in Intel's Client Computing Group.",
        "subreddit": "investing",
        "title": "If Intel lost Apple as a customer, it would be good news: Intel would be better off without Apple’s CPU chip business",
        "url": "https://www.reddit.com/r/investing/comments/hel34k/if_intel_lost_apple_as_a_customer_it_would_be/",
        "created": 1592968924.0
    },
    {
        "author": "Lambo_Bob",
        "created_utc": 1591363530,
        "id": "gx4is2",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": " \n\n&gt;Spotify: [https://spoti.fi/2Ub3eU9](https://eur05.safelinks.protection.outlook.com/?url=https%3A%2F%2Fspoti.fi%2F2Ub3eU9&amp;data=02%7C01%7C%7Ccbf10f3e22ea427d53cb08d8094e55a6%7C84df9e7fe9f640afb435aaaaaaaaaaaa%7C1%7C0%7C637269579326647615&amp;sdata=Z9sHUTtwtQ92h%2BjC2PYMjUYw3TgIMpYh%2FJQSgibNEkk%3D&amp;reserved=0)  \nGoogle Play: [https://bit.ly/3gWf3Yi](https://eur05.safelinks.protection.outlook.com/?url=https%3A%2F%2Fbit.ly%2F3gWf3Yi&amp;data=02%7C01%7C%7Ccbf10f3e22ea427d53cb08d8094e55a6%7C84df9e7fe9f640afb435aaaaaaaaaaaa%7C1%7C0%7C637269579326657609&amp;sdata=L5WkuLLXHI%2F4KEg0%2FeVmIdFq%2BKqjoUW0tyIqWZpRwCE%3D&amp;reserved=0)  \nIt will debut on Apple Podcasts today for sure.\n\n&amp;#x200B;\n\nESPN guy was on that big podcast talking about it - This is crazy for a penny stock. We are talking deals with some of the biggest names in sports lol. crazy",
        "subreddit": "pennystocks",
        "title": "$CLIS Get ready - Just got a big feature on Spotify, Google play and Apple podcast - Bigger than I thought",
        "url": "https://www.reddit.com/r/pennystocks/comments/gx4is2/clis_get_ready_just_got_a_big_feature_on_spotify/",
        "created": 1591392330.0
    }
]