[
    {
        "author": "path0inthecity",
        "created_utc": 1581533631,
        "id": "f2w11t",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "$msft was fun and gave some great gains but my current position 195c 2/28 is down 30% and my $gpn 220c 3/20 is down 60%. problem is what’s tied up is my gambling money. Do I liquidate and try and make tendies somewhere else, or do I hit the ativan and let ‘em ride?",
        "subreddit": "wallstreetbets",
        "title": "I need another vaccine",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f2w11t/i_need_another_vaccine/",
        "created": 1581562431.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1581341481,
        "id": "f1qbsb",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/stocks sub! Welcome to the new trading week and a fresh start! Here are your pre-market movers and news this AM-\n\n*****\n\n#[Today's Top Headlines for Monday, February 10th, 2020](https://www.cnbc.com/2020/02/10/futures-steady-trump-new-budget-and-coronavirus-deaths-exceed-sars.html)\n\n* With coronavirus concerns still very much in the mix, U.S. stock futures point to more losses for Wall Street following a Friday sell-off. The major averages all had their best weekly gains in months despite that Friday drop, but the trend is clearly negative as we head into the new week. The Nasdaq’s weekly gain last week was its largest since November 2018, even after a 0.5% fall on Friday. Tech has been February’s strongest sector so far, and the Consumer Staples sector finished last week at a record high. (CNBC)\n* The Trump administration will release its fiscal 2021 budget today, which will show the economy growing at an average rate of 3% for the next 15 years. It’s also proposing to continue tax cuts for individuals through 2035 at a cost of $1.4 trillion, a figure that serves as a rough placeholder for President Donald Trump’s promised “Tax Cuts 2.0.” (CNBC)\n* Treasury yields move higher ahead of Trump’s 2021 budget (CNBC)\n* No economic releases are on today’s calendar. Two Fed officials have public speaking engagements today, with Fed Governor Michelle Bowman making a morning appearance in Florida and Philadelphia Fed President Patrick Harker speaking this afternoon in Delaware. (CNBC)\n* Allergan (AGN), Edgewell Personal Care (EPC), and Restaurant Brands International (QSR) are among the companies set to release quarterly earnings this morning. Callaway Golf (ELY) and XPO Logistics (XPO) issue numbers after the closing bell.\n* Tesla (TSLA) shares were up 9% in the premarket this morning after a tumultuous week, which saw the stock move more than $100 per share in either direction in three of five sessions. Tesla posted 10 consecutive weekly gains and have risen 127% over that span. (CNBC)\n* China’s National Health Commission said it confirmed 3,062 new coronavirus cases and 97 additional deaths, mostly in Hubei province. The government said a total of 40,171 cases have been confirmed and 908 people have died in the country. The U.K. has confirmed four further cases of the coronavirus, bringing the total number of cases in the country to eight. (CNBC)\n* Factories in China remain shuttered as some regions extend shutdowns (CNBC)\n* As virus deaths top SARS, survivor tells of treatment (WSJ)\n* Sen. Bernie Sanders remains at the top of the Democratic field in a new NBC News/Marist poll of tomorrow’s New Hampshire primary. Sanders gets 25% of likely Democratic primary voters in the poll, while former Mayor Pete Buttigieg receives support from 21%. Former Vice President Joe Biden, who had a dismal showing in the Iowa caucuses, comes in at 13%. (CNBC)\n* Biden predicts he will ‘take a hit’ in New Hampshire primary after ‘gut punch’ in Iowa (CNBC)\n* Mike Bloomberg is the only Democrat to top Trump in Gallup poll of small business owners (CNBC)\n* The Iowa Democratic Party allocated delegates based on the results of last week’s Iowa caucuses, giving Buttigieg the largest delegate count, followed closely by Sanders, though many news outlets remained unable to declare a winner. Sanders’ campaign plans to ask for a “partial recanvass” of the results of last week’s Iowa caucuses. (NBC News &amp; AP)\n* Sen. Josh Hawley is proposing putting the Federal Trade Commission, an independent agency, within the Department of Justice, which is part of the executive branch. The proposal is likely to raise alarms about removing the independence of a key regulatory body, especially as Democrats have speculated about Attorney General William Barr’s closeness to Trump. (CNBC)\n* Annegret Kramp-Karrenbauer, the leader of Germany’s Christian Democratic Union and the expected successor of Angela Merkel, will not run for chancellor. She will also give up the leadership of the CDU in the summer, according to an unnamed source cited by Reuters, setting in motion a party leadership contest. (CNBC)\n* L Brands (LB) is nearing a deal to sell its Victoria’s Secret brand to private equity firm Sycamore Partners in a deal that could be announced as soon this week. It’s not clear what role L Brands CEO Les Wexner would have in such a deal, as he’s under mounting pressure due to his ties to the late sex criminal Jeffrey Epstein. (CNBC)\n* The federally appointed oversight board in charge of Puerto Rico’s ongoing record debt restructuring saga announced they have come to terms with bondholders of around $35 billion, which accounts for nearly 50% of the bankrupt island’s total debt load. The deal will cut the Commonwealth’s outstanding bond debt from $35 billion to approximately $11 billion. (CNBC)\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](https://finviz.com/futures.ashx)**)\n\n*****\n\n#LAST WEEK'S MARKET MAP:\n######(**[CLICK HERE FOR LAST WEEK'S MARKET MAP!](https://finviz.com/publish/021020/sec_all_w1_075987823.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#LAST WEEK'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR LAST WEEK'S S&amp;P SECTORS CHART!](https://i.imgur.com/LUCTy7n.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/1zcutYE.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/yKvMhID.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/O4BbZMh.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n*($BABA $ROKU $SHOP $NVDA $CVS $CGC $CSCO $UAA $QSR $L $AGN $HAS $LYFT $TEVA $AMAT $MCY $SAFE $GBDC $GOLD $PEP $DO $KHC $D $CYBR $MELI $CHGG $CNA $EXAS $GT $HLT $AYX $AN $APPS $WM $GPN $CRNT $BIP $YETI $MPAA $LSCC $RNG $NMM $JE)*\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/8e4snrC.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n*($QSR $L $MCY $GBDC $DO $CNA $BIP $CRNT $JE $IVC $EPC $GFN $NMM $MPAA $AVYA)*\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/uE1CJHc.jpg)**)\n\n*****\n\n#THIS AFTERNOON'S POST-MARKET EARNINGS CALENDAR:\n*()*\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS CALENDAR!]()**)\nT.B.A.\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/PCtL4E4.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/BuiIish.png)**)\n\n*****\n\n#FRIDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR FRIDAY'S UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/4df33Zh.png)**)\n######(**[CLICK HERE FOR FRIDAY'S UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/YwquWUG.png)**)\n######(**[CLICK HERE FOR FRIDAY'S UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/nJe64uF.png)**)\n\n*****\n\n#FRIDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR FRIDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/nbAlnD0.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!](https://i.imgur.com/xN2pAi9.png)**)\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS:\n\n* BLK\n* AGN\n* QSR\n* AVYA\n* TCO\n* FDX\n* ADVM\n* BHVN\n* CMPR\n* COLL\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2020/02/10/stocks-making-the-biggest-moves-in-the-premarket-allergan-taubman-centers-eli-lilly-more.html)**)\n\n*****\n\n&gt; **Taubman Centers (TCO)** – Mall operator Simon Property Group (SPG) will buy rival Taubman for $52.50 per share in cash, or about $3.6 billion. Taubman’s properties will continue to be managed by its existing executive team.\n\n&gt; #**STOCK SYMBOL:** TCO\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TCO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TCO)**)\n\n*****\n\n&gt; **Allergan (AGN)** – The drugmaker reported quarterly earnings of $5.22 per share, compared to estimates of $4.57 a share. Revenue also beat Wall Street forecasts, helped by better-than-expected specialized therapeutics and general medicine sales.\n\n&gt; #**STOCK SYMBOL:** AGN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AGN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AGN)**)\n\n*****\n\n&gt; **Edgewell Personal Care (EPC)** – The maker of Schick razors reported quarterly profit of 55 cents per share, well above the consensus estimate of 29 cents a share. Revenue exceeded estimates as well, and its full-year outlook is also mostly above Street forecasts. Separately, Edgewell ended its agreement to buy razor maker Harry’s, after the Federal Trade Commission moved to block the deal.\n\n&gt; #**STOCK SYMBOL:** EPC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=EPC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/EPC)**)\n\n*****\n\n&gt; **Restaurant Brands (QSR)** – The restaurant operator reported quarterly profit of 75 cents per share, 2 cents a share above estimates. Revenue also came in above forecasts. Comparable sales were shy of expectations at Tim Hortons and Burger King, but well above forecasts at Popeyes. The company said systemwide sales at the Popeyes chain jumped 42%, thanks in large part to its popular spicy chicken sandwich.\n\n&gt; #**STOCK SYMBOL:** QSR\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=QSR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/QSR)**)\n\n*****\n\n&gt; **Eli Lilly (LLY)** – Lilly and partner Genentech said their experimental therapy for a rare form of Alzheimer’s disease missed its primary goal in a study.\n\n&gt; #**STOCK SYMBOL:** LLY\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=LLY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LLY)**)\n\n*****\n\n&gt; **L Brands (LB)** – L Brands is near a deal to sell its Victoria’s Secret division to private-equity firm Sycamore Partners, according to sources who spoke to CNBC. The price could not be learned, but a deal could be announced as soon as this week.\n\n&gt; #**STOCK SYMBOL:** LB\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=LB&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LB)**)\n\n*****\n\n&gt; **Mattel (MAT)** – Mattel is shutting two factories in Asia and will close another in Canada, as it seeks to cut costs. The toy maker has been seeking to streamline its manufacturing and supply chain.\n\n&gt; #**STOCK SYMBOL:** MAT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=MAT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/MAT)**)\n\n*****\n\n&gt; **Tesla (TSLA)** – Tesla remains on watch after a tumultuous week which saw in move more than $100 per share in either direction in three of five sessions. Tesla shares have posted 10 consecutive weekly gains and have risen 127% over that span.\n\n&gt; #**STOCK SYMBOL:** TSLA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TSLA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TSLA)**)\n\n*****\n\n&gt; **Apple (AAPL)** – Apple may postpone the launch of a cheaper iPhone due to the coronavirus, according to published reports in China.\n\n&gt; #**STOCK SYMBOL:** AAPL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AAPL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AAPL)**)\n\n*****\n\n&gt; **Yum China (YUMC)** – A Yum China employee in Northwest China responsible for food preparation was confirmed to have the coronavirus, according to the Global Times.\n\n&gt; #**STOCK SYMBOL:** YUMC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=YUMC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/YUMC)**)\n\n*****\n\n&gt; **Willis Towers Watson (WLTW)** – The stock was downgraded to “neutral” from “outperform” at Credit Suisse in a valuation call. The consulting firm had reported better than expected quarterly earnings last week, but the stock tumbled amid a 2020 earnings forecast that fell partially below consensus.\n\n&gt; #**STOCK SYMBOL:** WLTW\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WLTW&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WLTW)**)\n\n*****\n\n&gt; **FedEx (FDX)** – FedEx was upgraded to “buy” from “neutral” at UBS, which thinks consensus expectations are low for the company and that profit margins at FedEx’s Express service will expand.\n\n&gt; #**STOCK SYMBOL:** FDX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=FDX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/FDX)**)\n\n*****\n\n&gt; **World Wrestling (WWE)** – World Wrestling was downgraded to “underweight” from “overweight” at Wells Fargo Securities, with the price target slashed to $36 per share from $80 a share. Wells Fargo said there have been “too many misfires,” and that the company needs a new CFO and to issue long-term guidance.\n\n&gt; #**STOCK SYMBOL:** WWE\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WWE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WWE)**)\n\n*****\n\n&gt; **Nvidia (NVDA)** – RBC Capital increased its price target for the graphics chip maker’s stock to $301 per share from $251, saying the quarter ending January 31 is likely to come in above the high end of the company’s guidance due to strong gaming and data center markets.\n\n&gt; #**STOCK SYMBOL:** NVDA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=NVDA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/NVDA)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat is on everyone's radar for today's trading day ahead here at r/stocks?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Monday, February 10th, 2020! :)**",
        "subreddit": "stocks",
        "title": "Today's Pre-Market Movers &amp; News [Monday, February 10th, 2020]",
        "url": "https://www.reddit.com/r/stocks/comments/f1qbsb/todays_premarket_movers_news_monday_february_10th/",
        "created": 1581370281.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1581175075,
        "id": "f0svfy",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/stocks. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning February 10th, 2020.\n\n# **Markets could see a turbulent week as investors watch coronavirus, economy and Fed testimony  - [(Source)](https://www.cnbc.com/2020/02/07/markets-could-see-a-turbulent-week-as-investors-watch-coronavirus-economy-and-election.html)**\n*****\n&gt; The uncertainty around the coronavirus could continue to carry more weight in markets than corporate earnings or the consumer inflation and spending data expected in the week ahead.\n*****\n&gt; Fed Chairman Jerome Powell testifies Tuesday and Wednesday in his bi-annual appearance before Congress, and investors are watching to see if Powell looks ready to move away from the Fed’s neutral stand on interest rates.\n*****\n&gt; Trading was volatile in the past week, with stocks sharply higher four of the five days as investors viewed the virus’ progress to be less rapid than feared. But by Friday, the death of the doctor who discovered the illness and the addition of restrictions in Shenzen, a key manufacturing hub, were among the headlines that renewed investor fears. By Friday, 31,000 people were reported to be infected, mostly in China, but the amount of new cases slowed for a second day, according to the World Health Organization.\n*****\n&gt; Stocks were lower Friday even after a much stronger-than-expected January employment report showed 225,000 jobs were created — 65,000 more than expected. Treasury yields, higher much of the week, edged lower Friday, and the 10-year yield dipped below 1.60% once more.\n*****\n&gt; “The data has been very positive, but it’s looking in the rear view mirror. It doesn’t take into account any concerns about the coronavirus yet,” said Michael Arone, chief investment strategist at State Street Global Advisors.\n*****\n&gt; Analysts have said volatility will now be a common theme in the stock market, regardless of which way it trades. That may have been apparent in the story of one stock in the past week — Tesla.\n*****\n&gt; The electric car maker’s stock shot up in parabolic fashion to a high of $968.99 on Tuesday, and was trading more than $200 below that on Friday.\n*****\n&gt; “I do believe what happened in Tesla just does show some of the euphoria that got into the marketplace,” said Matt Maley, Miller Tabak chief market strategist. Maley said some investors were comparing the surge higher to 1999, when the tech bubble was building. “I really laugh when people justify the rally by saying, it’s not as crazy as it was in 1999.”\n*****\n&gt; Maley said now that the stock has “washed out” on the upside, there’s likely more downside ahead.\n*****\n&gt; “Some of these comments in the last couple of days ... talking about how the retail investors piled into the stock. Of course, that’s usually a sign of a top as well,” he said.\n*****\n&gt; # Brakes on growth\n&gt; UBS Global Wealth Management’s Chief Investment Officer Mark Haefele said next week could provide an important look at how the virus is impacting China’s economy.\n*****\n&gt; “Next week, Chinese factories are set to reopen after the extended Lunar New Year holiday, and important indicators to note will be to what extent the virus spreads as people resume travel back to work, and how long it takes for production to return to full capacity,” he wrote, adding he still likes emerging markets despite the potential hit on their economies.\n*****\n&gt; Economists expect the impact on the U.S. economy to be minimal, and say it should bounce back quickly.\n*****\n&gt; Thursday’s consumer price index and Friday’s retail sales, industrial production and consumer sentiment will be watched closely by economists. ISM manufacturing data was stronger than expected in the past week, ending a period of contraction that started during the trade war.\n*****\n&gt; The first quarter data has been providing a mixed picture of the economy, ahead of any impacts of the virus. Economists had been expecting manufacturing to get a boost after the trade deal, but Boeing’s production shut down and now the virus could muddy that picture.\n*****\n&gt; “I think there’s been a little bit of chicken little about the economy for awhile. It ebbs and flows,” said Arone, noting the Fed is the backstop if growth is choked. “Most of the indicators indicate the economy is going to chug along.”\n*****\n&gt; Powell testifies for two days before House and Senate committees on the state of the economy. Markets will be watching his comments closely to see what he has to say on the potential impact of the coronavirus. The markets have begun to price in more than one rate cut for this year, even though the Fed is not forecasting any.\n*****\n&gt; “With the strong jobs, I think it’s going to be more of the same. They raised the bar pretty high for them to signal any policy changes,” said John Roberts, U.S. rate strategist at NatWest Markets. “They mentioned the coronavirus already. We could get more insight into what they’re thinking about that. That’s the main thing we’re looking for.”\n*****\n&gt; China’s central bank has been adding stimulus, and that was seen as a booster for global stock markets in the past week.\n*****\n&gt; Capital Economics on Friday said it expects the coronavirus to cost the world economy $280 billion in the first quarter.\n*****\n&gt; “If we’re right, then this will mean that global GDP will not grow in [quarter over quarter] terms for the first time since 2009,” the economists wrote in a note. “We assume the virus will be contained soon, and that lost output is made up in subsequent quarters, so that world GDP reaches the level it would have done had there been no outbreak by the middle of 2021.”\n*****\n&gt; # Earnings Bonanza\n&gt; Better-than-expected earnings have helped stoke the market’s recent gains. There are dozens of earnings expected in the week ahead, including CVS Health Wednesday and Pepsi, Nvidia and Kraft Heinz Thursday.\n*****\n&gt; So far, more than 70% of companies are beating forecasts and profits are growing by 2.3%, when including both companies that have reported and those expected to report, according to Refinitiv. At the start of the earnings reporting period, earnings growth was expected to decline.\n*****\n&gt; Analysts will also look to companies to continue disclosing how the virus is impacting their operations. VF Corp, for instance, said 60% of its stores in China are now closed, and those that remain open have serous declines.\n*****\n&gt; # Playing Politics\n&gt; Vermont Sen. Bernie Sanders sent a shudder through markets when he began to rise in the polls ahead of Iowa’s caucuses. But the chaos in declaring a winner in Iowa this past week, leaves the Democratic field wide open. So New Hampshire’s primary Tuesday will also be important.\n*****\n&gt; The left-leaning Sanders is viewed as negative for the stock market, but his main rivals, Joseph Biden and now Pete Buttigieg, who seems to have led in Iowa, are both moderates. Sanders leads in the New Hampshire polls and is expected to win his neighboring state.\n*****\n&gt; “I think it’s going to continue to matter for quite some time, until we get clarity at least on who the Democratic candidate is going to be,” said Jon Hill, rates strategist at BMO. ”[Buttigieg] would be much more business friendly than some of the other candidates. Does that make him more or less electable? If he’s more that could be a market negative development.”\n*****\n&gt; The S&amp;P 500 has gained 55% since Donald Trump became president, and analysts say he is viewed by investors as having the best policies for the stock market. Some Democrats, particularly Sanders, would raise taxes sharply.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/qOqI74J.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/n8uJhuY.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/qSPsa54.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/yKvMhID.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/qFnHyJw.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/Zwtq6za.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/Crf7CiP.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/wSa5dB3.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/8e4snrC.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/O4BbZMh.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/4df33Zh.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/YwquWUG.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/nJe64uF.png))**\n\n*****\n\n# Week Before Presidents’ Day Bullish since 1990\n\n&gt; Page 100 of the Stock Trader’s Almanac 2020 points out Presidents’ Day as the poorest performing holiday of the eight holidays that are tracked. Unlike the others, the trading day before and the trading day after this three-day holiday weekend are both down on average over the past 40 years. However, the full week before the long holiday weekend has a bullish record. Since 1990 DJIA and S&amp;P 500 have advanced 20 times with average weekly gains of 0.66% and 0.48% respectively. NASDAQ has one additional weekly decline while Russell 2000 has been the strongest, up 23 times with an average gain of 0.79%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/87d4499ef13ff59956f4c6343e3c411e/5b2bbadb398d5a54-f0/s500x750/24f2f57a33d656e400f05e96ccd367ce42aa6af8.jpg))**\n\n*****\n\n# Strong Jobs Report to Begin 2020\n\n&gt; U.S. hiring came in stronger than expected in January, rebounding from a disappointing December print.\n\n&gt; Nonfarm payrolls rose by 225,000 in January, far surpassing Bloomberg’s consensus estimates for a 165,000 gain, according to the jobs report released today by the U.S. Bureau of Labor Statistics. This number may help alleviate some investor unease over December’s somewhat weak reading. We argued at the time that December’s reading likely was due in large part to calendar effects and the volatility of month-to-month changes. We prefer to base our views of the labor market’s vitality on the larger trend, which, has been undeniably strong, as shown in the LPL Chart of the Day.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/02/kciking-off-2020-with-a-strong-rebound.png?ssl=1))**\n\n&gt; Some investors have questioned how long hiring can remain elevated before we experience a worker shortage or a sharp rise in wages. The answer, according to this report, is not yet.\n\n&gt; In addition to the strong hiring numbers, workers also have enjoyed healthy wage gains. January saw average hourly earnings rise 3.1% year over year, a slight pickup from December, while average hours worked remained unchanged. “Today’s wage number exceeds inflation, meaning workers are growing their purchasing power in real terms and should be able to continue increasing their consumption of goods and services,” said LPL Financial Chief Investment Strategist John Lynch. “But the number is also lower than the 4% threshold that has historically signaled an overheating job market and potential for subsequent economic and market volatility. This is a very encouraging report.”\n\n&gt; The one slight blip in today’s release showed the unemployment rate inching 0.1% higher to 3.6%. This was mainly due to changes to the size of the labor force, which affected revisions. Still, given the extremely low unemployment level, the volatility of month-to-month numbers, and the overwhelmingly positive tone of the other data points released today, we feel confident about the prospects for the U.S. consumer to continue powering this economic expansion through 2020 and beyond.\n\n*****\n\n# New Highs Tilt Scales to Bulls\n\n&gt; China is cutting tariffs; the impeachment process has come to an end and the market is at new all-time highs. The coronavirus is still a concern, but apparently not as much as it was less than one week ago. Progress has been made. Official emergency declarations have mobilized a stronger response. China has quickly built additional hospitals and work is underway on a treatment. Gilead (GILD) appears to be the first to offer a potential cure although its drug remdesivir has not been approved to cure any disease yet. These recent developments along with solid earnings, have been the fuel to reverse the market’s late January retreat in just a few trading sessions this month.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/eb99cd5eedf67e83954c998976da3a81/8ea2bcc9db4c521e-49/s500x750/705cf31363591f72784f14fed6029effc84a4228.jpg))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/07db71096c88ddf9778d29d0bdb69e60/8ea2bcc9db4c521e-86/s500x750/e6f5479d3cea9759bc52d0c99fff7704947ff575.jpg))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/cdb9b967be268f1fcb154d09dfa8553b/8ea2bcc9db4c521e-2c/s500x750/4f3021be20791991f739de9273300f798a7cbf31.jpg))**\n\n&gt; In the above charts, the market’s strength since October can be seen along with second half of January weakness. DJIA, S&amp;P 500 and NASDAQ have remained comfortably above their respective 200-day moving averages since October. In January only DJIA actually (and briefly) closed below its even higher 50-day moving average. The market’s rebound surge in February has also reversed negative readings from Stochastic, relative strength and MACD indicators.\n\n&gt; Momentum clearly favors the bulls and January’s negative finish remains unconfirmed as of today. As long as economic data and corporate earnings remain positive then the market is likely to continue the trend that has been in place since last October, higher. There are likely to be some dips along the way with the next possible soft patch arriving when earnings season nears its end later this month and/or in the first half of March.\n\n*****\n\n# Typical February Trading: Tepid Month with Solid Mid-Month Rally\n\n&gt; February has historically been a rather bland month. Since 1950, S&amp;P 500 has averaged a measly 0.1%. Over the last 21-year period S&amp;P 500 average performance has declined to a loss of 0.4% in February. February’s first trading day has historically been good, like today, and trading days eight, nine, ten and eleven have offered repeatable long opportunities. Outside of these five days, the balance of February has been rather lacking.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/10b0e0be07d6824e6a082e13a26bc1d9/e1ddcea381248255-b9/s500x750/a2b1e806df3ec07b5e77c69efd297e5802fa1208.jpg))**\n\n*****\n\n# Does A Lower January Have Bears Smiling?\n\n&gt; Stocks got off to a nice start in 2020, until the late January selloff due to the coronavirus outbreak fears. In the end, the S&amp;P 500 Index fell only 0.2% for the month, but it did mark the end to a 4-month win streak. Should bulls worry about what a down January might mean for the rest of 2020?\n\n&gt; There’s an old adage on Wall Street that suggests, “As goes January, so goes the year.” This was first discussed in 1972 by Yale Hirsh of the Stock Trader’s Almanac, and it has an impressive track record. Simply put, when the first month of the year was green, it bodes well for the rest of the year (and vice versa). Given stocks closed red in January, how worried should investors be?\n\n&gt; As shown below in the LPL Chart of the Day, the numbers confirm that when the S&amp;P 500 has been green in January, the index has been up 11.9% on average over the rest of the year (final 11 months) and higher 86% of the time. However, when that first month was red, stocks rose only 1.2% on average over the final 11 months and were higher less than 60% of the time.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/02/so-goes-january-so-goes-the-year.png?ssl=1))**\n\n&gt; Another way to look at this data shows the average full year return based on if stocks are higher in January or not. As you can clearly see, stocks have tended to have trouble gaining any traction over the rest of the year after a January loss, while a green January has been quite strong.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/02/the-january-barometer.png?ssl=1)**\n\n&gt; It isn’t all bad news though. Remember the S&amp;P 500 was down only 0.2% in January, so one could argue that it was really flat. “Yes, a lower January is a potential worry for the bulls,” explained LPL Financial Senior Market Strategist Ryan Detrick. “But it is worth noting the previous 5 times (and 7 of 8) when stocks were lower in January, those final 11 months rallied. So this might not be the clear cut bearish signal so many think it is.”\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/02/a-lower-january-hasnt-been-as-bearish-lately.png?ssl=1))**\n\n*****\n\n# January Trifecta Spoiled by Coronavirus\n\n&gt; The market decline on the last day of January spoiled what would have been the fourth consecutive January Trifecta. S&amp;P 500 finished January down 0.2% and thus the January Barometer was negative.\n\n&gt; Devised by Yale Hirsch in 1972, the January Barometer has registered ten major errors since 1950 for an 85.7% accuracy ratio. This indicator adheres to propensity that as the S&amp;P 500 goes in January, so goes the year. Of the ten major errors Vietnam affected 1966 and 1968. 1982 saw the start of a major bull market in August. Two January rate cuts and 9/11 affected 2001.The market in January 2003 was held down by the anticipation of military action in Iraq. The second worst bear market since 1900 ended in March of 2009 and Federal Reserve intervention influenced 2010 and 2014. In 2016, DJIA slipped into an official Ned Davis bear market in January. Including the eight flat years yields a .743 batting average.\n\n&gt; This year’s combination of a positive Santa Claus Rally and First Five Days with a full-month January loss has only occurred eleven times (including this year) since 1950. In the previous ten occurrences S&amp;P 500 was down six times in February with an average loss of 1.5%. However, over the remaining 11 months of the year, S&amp;P 500 advanced 80% of the time with an average gain of 7.4%. Full-year performance was positive 70% of the time, but with an average gain of 2.9%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/6df473ecb7e9c5b9c107222c65f3131a/7be8cdb3803e5a29-77/s500x750/284bbb2175287530e6f02fc233a1772dce7a4852.jpg))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending February 7th, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED!)\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 2.9.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED!)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$BABA** \n&gt; * **$ROKU** \n&gt; * **$SHOP** \n&gt; * **$NVDA** \n&gt; * **$CVS** \n&gt; * **$CGC** \n&gt; * **$CSCO** \n&gt; * **$UAA** \n&gt; * **$QSR** \n&gt; * **$L** \n&gt; * **$AGN** \n&gt; * **$HAS** \n&gt; * **$LYFT** \n&gt; * **$TEVA** \n&gt; * **$AMAT** \n&gt; * **$MCY** \n&gt; * **$SAFE** \n&gt; * **$GBDC** \n&gt; * **$GOLD** \n&gt; * **$PEP** \n&gt; * **$DO** \n&gt; * **$KHC** \n&gt; * **$D** \n&gt; * **$CYBR**\n&gt; * **$MELI** \n&gt; * **$CHGG** \n&gt; * **$CNA** \n&gt; * **$EXAS** \n&gt; * **$GT** \n&gt; * **$HLT** \n&gt; * **$AYX** \n&gt; * **$AN** \n&gt; * **$APPS** \n&gt; * **$WM** \n&gt; * **$GPN** \n&gt; * **$CRNT** \n&gt; * **$BIP** \n&gt; * **$YETI** \n&gt; * **$MPAA** \n&gt; * **$LSCC** \n&gt; * **$RNG** \n&gt; * **$NMM** \n&gt; * **$JE**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 2.10.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Tvfxbnh.png))\n\n\n&gt; # ***Monday 2.10.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/DYTRi0w.png))\n\n\n*****\n\n&gt; # ***Tuesday 2.11.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/sWB49z5.png))\n\n&gt; # ***Tuesday 2.11.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/hiUR1ec.png))\n\n*****\n\n&gt; # ***Wednesday 2.12.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/w9FUjTz.png))\n\n&gt; # ***Wednesday 2.12.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/cPnIcpa.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/BBaSJcZ.png))\n\n*****\n\n&gt; # ***Thursday 2.13.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/tjUpFdY.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/D7eo9EG.png))\n\n&gt; # ***Thursday 2.13.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/Y4rdLiL.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/feUqB85.png))\n\n*****\n\n&gt; # ***Friday 2.14.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/TGxgQ96.png))\n\n*****\n\n&gt; # ***Friday 2.14.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/tC78cWW.png))\n\n*****\n\n# Alibaba Group Holding Ltd. $216.53\n&gt; **Alibaba Group Holding Ltd. (BABA)** is confirmed to report earnings at approximately 7:10 AM ET on Thursday, February 13, 2020. The consensus earnings estimate is $2.25 per share on revenue of $22.68 billion and the Earnings Whisper ® number is $2.35 per share. Investor sentiment going into the company's earnings release has 79% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 33.93% with revenue increasing by 32.97%. Short interest has increased by 52.7% since the company's last earnings release while the stock has drifted higher by 21.0% from its open following the earnings release to be 19.4% above its 200 day moving average of $181.36. Overall earnings estimates have been unchanged since the company's last earnings release. On Wednesday, January 29, 2020 there was some notable buying of 9,774 contracts of the $215.00 put expiring on Friday, March 20, 2020. Option traders are pricing in a 5.4% move on earnings and the stock has averaged a 2.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BABA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Roku Inc $124.25\n&gt; **Roku Inc (ROKU)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, February 13, 2020. The consensus estimate is for a loss of $0.14 per share on revenue of $392.43 million and the Earnings Whisper ® number is ($0.11) per share. Investor sentiment going into the company's earnings release has 70% expecting an earnings beat The company's guidance was for revenue of $380.00 million to $396.00 million. Consensus estimates are for earnings to decline year-over-year by 300.00% with revenue increasing by 42.32%. The stock has drifted higher by 4.6% from its open following the earnings release to be 3.1% above its 200 day moving average of $120.56. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, January 28, 2020 there was some notable buying of 8,443 contracts of the $115.00 put expiring on Friday, April 17, 2020. Option traders are pricing in a 14.7% move on earnings and the stock has averaged a 22.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ROKU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Shopify Inc. $478.69\n&gt; **Shopify Inc. (SHOP)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, February 12, 2020. The consensus earnings estimate is $0.23 per share on revenue of $481.99 million and the Earnings Whisper ® number is $0.30 per share. Investor sentiment going into the company's earnings release has 70% expecting an earnings beat The company's guidance was for revenue of $472.00 million to $482.00 million. Consensus estimates are for earnings to decline year-over-year by 8.00% with revenue increasing by 40.17%. Short interest has increased by 3.4% since the company's last earnings release while the stock has drifted higher by 56.4% from its open following the earnings release to be 41.2% above its 200 day moving average of $339.06. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, January 24, 2020 there was some notable buying of 1,017 contracts of the $470.00 put expiring on Friday, February 21, 2020. Option traders are pricing in a 9.7% move on earnings and the stock has averaged a 6.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SHOP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# NVIDIA Corp. $251.59\n&gt; **NVIDIA Corp. (NVDA)** is confirmed to report earnings at approximately 4:20 PM ET on Thursday, February 13, 2020. The consensus earnings estimate is $1.66 per share on revenue of $2.96 billion and the Earnings Whisper ® number is $1.73 per share. Investor sentiment going into the company's earnings release has 78% expecting an earnings beat The company's guidance was for earnings of $1.56 to $1.75 per share. Consensus estimates are for year-over-year earnings growth of 110.13% with revenue increasing by 34.24%. Short interest has decreased by 3.4% since the company's last earnings release while the stock has drifted higher by 20.0% from its open following the earnings release to be 33.8% above its 200 day moving average of $187.97. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, February 7, 2020 there was some notable buying of 2,222 contracts of the $320.00 call expiring on Friday, March 20, 2020. Option traders are pricing in a 6.8% move on earnings and the stock has averaged a 6.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NVDA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# CVS Health $71.56\n&gt; **CVS Health (CVS)** is confirmed to report earnings at approximately 6:30 AM ET on Wednesday, February 12, 2020. The consensus earnings estimate is $1.68 per share on revenue of $64.15 billion and the Earnings Whisper ® number is $1.74 per share. Investor sentiment going into the company's earnings release has 76% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 21.50% with revenue increasing by 17.87%. Short interest has decreased by 5.8% since the company's last earnings release while the stock has drifted higher by 3.1% from its open following the earnings release to be 13.0% above its 200 day moving average of $63.32. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, January 23, 2020 there was some notable buying of 2,522 contracts of the $66.00 put expiring on Friday, February 14, 2020. Option traders are pricing in a 5.4% move on earnings and the stock has averaged a 6.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CVS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Canopy Growth Corporation $19.63\n&gt; **Canopy Growth Corporation (CGC)** is confirmed to report earnings at approximately 6:30 AM ET on Friday, February 14, 2020. The consensus estimate is for a loss of $0.36 per share on revenue of $79.20 million and the Earnings Whisper ® number is ($0.43) per share. Investor sentiment going into the company's earnings release has 56% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 46.27% with revenue increasing by 26.02%. Short interest has increased by 17.7% since the company's last earnings release while the stock has drifted higher by 19.7% from its open following the earnings release to be 32.6% below its 200 day moving average of $29.13. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, January 29, 2020 there was some notable buying of 1,603 contracts of the $12.50 put expiring on Friday, March 20, 2020. Option traders are pricing in a 12.0% move on earnings and the stock has averaged a 13.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CGC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Cisco Systems, Inc. $47.97\n&gt; **Cisco Systems, Inc. (CSCO)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, February 12, 2020. The consensus earnings estimate is $0.76 per share on revenue of $11.99 billion and the Earnings Whisper ® number is $0.78 per share. Investor sentiment going into the company's earnings release has 71% expecting an earnings beat The company's guidance was for earnings of $0.75 to $0.77 per share. Consensus estimates are for year-over-year earnings growth of 2.70% with revenue decreasing by 3.66%. Short interest has decreased by 8.6% since the company's last earnings release while the stock has drifted higher by 5.3% from its open following the earnings release to be 4.4% below its 200 day moving average of $50.19. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, January 22, 2020 there was some notable buying of 4,630 contracts of the $30.00 put expiring on Friday, January 15, 2021. Option traders are pricing in a 5.1% move on earnings and the stock has averaged a 5.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CSCO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Under Armour, Inc. $20.25\n&gt; **Under Armour, Inc. (UAA)** is confirmed to report earnings at approximately 6:55 AM ET on Tuesday, February 11, 2020. The consensus earnings estimate is $0.10 per share on revenue of $1.47 billion and the Earnings Whisper ® number is $0.12 per share. Investor sentiment going into the company's earnings release has 53% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 11.11% with revenue increasing by 5.76%. Short interest has increased by 0.0% since the company's last earnings release while the stock has drifted higher by 13.6% from its open following the earnings release to be 5.8% below its 200 day moving average of $21.49. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, February 3, 2020 there was some notable buying of 1,205 contracts of the $20.00 put expiring on Friday, February 14, 2020. Option traders are pricing in a 12.8% move on earnings and the stock has averaged a 12.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=UAA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Restaurant Brands International Inc. $63.86\n&gt; **Restaurant Brands International Inc. (QSR)** is confirmed to report earnings at approximately 6:30 AM ET on Monday, February 10, 2020. The consensus earnings estimate is $0.73 per share on revenue of $1.46 billion. Investor sentiment going into the company's earnings release has 58% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 7.35% with revenue increasing by 5.42%. The stock has drifted lower by 4.6% from its open following the earnings release to be 7.2% below its 200 day moving average of $68.78. Overall earnings estimates have been unchanged since the company's last earnings release. Option traders are pricing in a 5.5% move on earnings and the stock has averaged a 2.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=QSR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Loews Corp $53.25\n&gt; **Loews Corp (L)** is confirmed to report earnings at approximately 6:00 AM ET on Monday, February 10, 2020. The consensus earnings estimate is $0.72 per share. Investor sentiment going into the company's earnings release has 14% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 100.00% with revenue decreasing by 69.61%. Short interest has increased by 37.8% since the company's last earnings release while the stock has drifted higher by 5.7% from its open following the earnings release to be 3.9% above its 200 day moving average of $51.23. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, January 24, 2020 there was some notable buying of 602 contracts of the $50.00 put expiring on Friday, March 20, 2020. Option traders are pricing in a 9.3% move on earnings and the stock has averaged a 3.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=L&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/stocks.",
        "subreddit": "stocks",
        "title": "Wall Street Week Ahead for the trading week beginning February 10th, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/f0svfy/wall_street_week_ahead_for_the_trading_week/",
        "created": 1581203875.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1581175263,
        "id": "f0swz6",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/smallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning February 10th, 2020.\n\n# **Markets could see a turbulent week as investors watch coronavirus, economy and Fed testimony  - [(Source)](https://www.cnbc.com/2020/02/07/markets-could-see-a-turbulent-week-as-investors-watch-coronavirus-economy-and-election.html)**\n*****\n&gt; The uncertainty around the coronavirus could continue to carry more weight in markets than corporate earnings or the consumer inflation and spending data expected in the week ahead.\n*****\n&gt; Fed Chairman Jerome Powell testifies Tuesday and Wednesday in his bi-annual appearance before Congress, and investors are watching to see if Powell looks ready to move away from the Fed’s neutral stand on interest rates.\n*****\n&gt; Trading was volatile in the past week, with stocks sharply higher four of the five days as investors viewed the virus’ progress to be less rapid than feared. But by Friday, the death of the doctor who discovered the illness and the addition of restrictions in Shenzen, a key manufacturing hub, were among the headlines that renewed investor fears. By Friday, 31,000 people were reported to be infected, mostly in China, but the amount of new cases slowed for a second day, according to the World Health Organization.\n*****\n&gt; Stocks were lower Friday even after a much stronger-than-expected January employment report showed 225,000 jobs were created — 65,000 more than expected. Treasury yields, higher much of the week, edged lower Friday, and the 10-year yield dipped below 1.60% once more.\n*****\n&gt; “The data has been very positive, but it’s looking in the rear view mirror. It doesn’t take into account any concerns about the coronavirus yet,” said Michael Arone, chief investment strategist at State Street Global Advisors.\n*****\n&gt; Analysts have said volatility will now be a common theme in the stock market, regardless of which way it trades. That may have been apparent in the story of one stock in the past week — Tesla.\n*****\n&gt; The electric car maker’s stock shot up in parabolic fashion to a high of $968.99 on Tuesday, and was trading more than $200 below that on Friday.\n*****\n&gt; “I do believe what happened in Tesla just does show some of the euphoria that got into the marketplace,” said Matt Maley, Miller Tabak chief market strategist. Maley said some investors were comparing the surge higher to 1999, when the tech bubble was building. “I really laugh when people justify the rally by saying, it’s not as crazy as it was in 1999.”\n*****\n&gt; Maley said now that the stock has “washed out” on the upside, there’s likely more downside ahead.\n*****\n&gt; “Some of these comments in the last couple of days ... talking about how the retail investors piled into the stock. Of course, that’s usually a sign of a top as well,” he said.\n*****\n&gt; # Brakes on growth\n&gt; UBS Global Wealth Management’s Chief Investment Officer Mark Haefele said next week could provide an important look at how the virus is impacting China’s economy.\n*****\n&gt; “Next week, Chinese factories are set to reopen after the extended Lunar New Year holiday, and important indicators to note will be to what extent the virus spreads as people resume travel back to work, and how long it takes for production to return to full capacity,” he wrote, adding he still likes emerging markets despite the potential hit on their economies.\n*****\n&gt; Economists expect the impact on the U.S. economy to be minimal, and say it should bounce back quickly.\n*****\n&gt; Thursday’s consumer price index and Friday’s retail sales, industrial production and consumer sentiment will be watched closely by economists. ISM manufacturing data was stronger than expected in the past week, ending a period of contraction that started during the trade war.\n*****\n&gt; The first quarter data has been providing a mixed picture of the economy, ahead of any impacts of the virus. Economists had been expecting manufacturing to get a boost after the trade deal, but Boeing’s production shut down and now the virus could muddy that picture.\n*****\n&gt; “I think there’s been a little bit of chicken little about the economy for awhile. It ebbs and flows,” said Arone, noting the Fed is the backstop if growth is choked. “Most of the indicators indicate the economy is going to chug along.”\n*****\n&gt; Powell testifies for two days before House and Senate committees on the state of the economy. Markets will be watching his comments closely to see what he has to say on the potential impact of the coronavirus. The markets have begun to price in more than one rate cut for this year, even though the Fed is not forecasting any.\n*****\n&gt; “With the strong jobs, I think it’s going to be more of the same. They raised the bar pretty high for them to signal any policy changes,” said John Roberts, U.S. rate strategist at NatWest Markets. “They mentioned the coronavirus already. We could get more insight into what they’re thinking about that. That’s the main thing we’re looking for.”\n*****\n&gt; China’s central bank has been adding stimulus, and that was seen as a booster for global stock markets in the past week.\n*****\n&gt; Capital Economics on Friday said it expects the coronavirus to cost the world economy $280 billion in the first quarter.\n*****\n&gt; “If we’re right, then this will mean that global GDP will not grow in [quarter over quarter] terms for the first time since 2009,” the economists wrote in a note. “We assume the virus will be contained soon, and that lost output is made up in subsequent quarters, so that world GDP reaches the level it would have done had there been no outbreak by the middle of 2021.”\n*****\n&gt; # Earnings Bonanza\n&gt; Better-than-expected earnings have helped stoke the market’s recent gains. There are dozens of earnings expected in the week ahead, including CVS Health Wednesday and Pepsi, Nvidia and Kraft Heinz Thursday.\n*****\n&gt; So far, more than 70% of companies are beating forecasts and profits are growing by 2.3%, when including both companies that have reported and those expected to report, according to Refinitiv. At the start of the earnings reporting period, earnings growth was expected to decline.\n*****\n&gt; Analysts will also look to companies to continue disclosing how the virus is impacting their operations. VF Corp, for instance, said 60% of its stores in China are now closed, and those that remain open have serous declines.\n*****\n&gt; # Playing Politics\n&gt; Vermont Sen. Bernie Sanders sent a shudder through markets when he began to rise in the polls ahead of Iowa’s caucuses. But the chaos in declaring a winner in Iowa this past week, leaves the Democratic field wide open. So New Hampshire’s primary Tuesday will also be important.\n*****\n&gt; The left-leaning Sanders is viewed as negative for the stock market, but his main rivals, Joseph Biden and now Pete Buttigieg, who seems to have led in Iowa, are both moderates. Sanders leads in the New Hampshire polls and is expected to win his neighboring state.\n*****\n&gt; “I think it’s going to continue to matter for quite some time, until we get clarity at least on who the Democratic candidate is going to be,” said Jon Hill, rates strategist at BMO. ”[Buttigieg] would be much more business friendly than some of the other candidates. Does that make him more or less electable? If he’s more that could be a market negative development.”\n*****\n&gt; The S&amp;P 500 has gained 55% since Donald Trump became president, and analysts say he is viewed by investors as having the best policies for the stock market. Some Democrats, particularly Sanders, would raise taxes sharply.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/qOqI74J.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/n8uJhuY.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/qSPsa54.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/yKvMhID.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/qFnHyJw.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/Zwtq6za.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/Crf7CiP.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/wSa5dB3.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/8e4snrC.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/O4BbZMh.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/4df33Zh.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/YwquWUG.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/nJe64uF.png))**\n\n*****\n\n# Week Before Presidents’ Day Bullish since 1990\n\n&gt; Page 100 of the Stock Trader’s Almanac 2020 points out Presidents’ Day as the poorest performing holiday of the eight holidays that are tracked. Unlike the others, the trading day before and the trading day after this three-day holiday weekend are both down on average over the past 40 years. However, the full week before the long holiday weekend has a bullish record. Since 1990 DJIA and S&amp;P 500 have advanced 20 times with average weekly gains of 0.66% and 0.48% respectively. NASDAQ has one additional weekly decline while Russell 2000 has been the strongest, up 23 times with an average gain of 0.79%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/87d4499ef13ff59956f4c6343e3c411e/5b2bbadb398d5a54-f0/s500x750/24f2f57a33d656e400f05e96ccd367ce42aa6af8.jpg))**\n\n*****\n\n# Strong Jobs Report to Begin 2020\n\n&gt; U.S. hiring came in stronger than expected in January, rebounding from a disappointing December print.\n\n&gt; Nonfarm payrolls rose by 225,000 in January, far surpassing Bloomberg’s consensus estimates for a 165,000 gain, according to the jobs report released today by the U.S. Bureau of Labor Statistics. This number may help alleviate some investor unease over December’s somewhat weak reading. We argued at the time that December’s reading likely was due in large part to calendar effects and the volatility of month-to-month changes. We prefer to base our views of the labor market’s vitality on the larger trend, which, has been undeniably strong, as shown in the LPL Chart of the Day.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/02/kciking-off-2020-with-a-strong-rebound.png?ssl=1))**\n\n&gt; Some investors have questioned how long hiring can remain elevated before we experience a worker shortage or a sharp rise in wages. The answer, according to this report, is not yet.\n\n&gt; In addition to the strong hiring numbers, workers also have enjoyed healthy wage gains. January saw average hourly earnings rise 3.1% year over year, a slight pickup from December, while average hours worked remained unchanged. “Today’s wage number exceeds inflation, meaning workers are growing their purchasing power in real terms and should be able to continue increasing their consumption of goods and services,” said LPL Financial Chief Investment Strategist John Lynch. “But the number is also lower than the 4% threshold that has historically signaled an overheating job market and potential for subsequent economic and market volatility. This is a very encouraging report.”\n\n&gt; The one slight blip in today’s release showed the unemployment rate inching 0.1% higher to 3.6%. This was mainly due to changes to the size of the labor force, which affected revisions. Still, given the extremely low unemployment level, the volatility of month-to-month numbers, and the overwhelmingly positive tone of the other data points released today, we feel confident about the prospects for the U.S. consumer to continue powering this economic expansion through 2020 and beyond.\n\n*****\n\n# New Highs Tilt Scales to Bulls\n\n&gt; China is cutting tariffs; the impeachment process has come to an end and the market is at new all-time highs. The coronavirus is still a concern, but apparently not as much as it was less than one week ago. Progress has been made. Official emergency declarations have mobilized a stronger response. China has quickly built additional hospitals and work is underway on a treatment. Gilead (GILD) appears to be the first to offer a potential cure although its drug remdesivir has not been approved to cure any disease yet. These recent developments along with solid earnings, have been the fuel to reverse the market’s late January retreat in just a few trading sessions this month.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/eb99cd5eedf67e83954c998976da3a81/8ea2bcc9db4c521e-49/s500x750/705cf31363591f72784f14fed6029effc84a4228.jpg))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/07db71096c88ddf9778d29d0bdb69e60/8ea2bcc9db4c521e-86/s500x750/e6f5479d3cea9759bc52d0c99fff7704947ff575.jpg))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/cdb9b967be268f1fcb154d09dfa8553b/8ea2bcc9db4c521e-2c/s500x750/4f3021be20791991f739de9273300f798a7cbf31.jpg))**\n\n&gt; In the above charts, the market’s strength since October can be seen along with second half of January weakness. DJIA, S&amp;P 500 and NASDAQ have remained comfortably above their respective 200-day moving averages since October. In January only DJIA actually (and briefly) closed below its even higher 50-day moving average. The market’s rebound surge in February has also reversed negative readings from Stochastic, relative strength and MACD indicators.\n\n&gt; Momentum clearly favors the bulls and January’s negative finish remains unconfirmed as of today. As long as economic data and corporate earnings remain positive then the market is likely to continue the trend that has been in place since last October, higher. There are likely to be some dips along the way with the next possible soft patch arriving when earnings season nears its end later this month and/or in the first half of March.\n\n*****\n\n# Typical February Trading: Tepid Month with Solid Mid-Month Rally\n\n&gt; February has historically been a rather bland month. Since 1950, S&amp;P 500 has averaged a measly 0.1%. Over the last 21-year period S&amp;P 500 average performance has declined to a loss of 0.4% in February. February’s first trading day has historically been good, like today, and trading days eight, nine, ten and eleven have offered repeatable long opportunities. Outside of these five days, the balance of February has been rather lacking.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/10b0e0be07d6824e6a082e13a26bc1d9/e1ddcea381248255-b9/s500x750/a2b1e806df3ec07b5e77c69efd297e5802fa1208.jpg))**\n\n*****\n\n# Does A Lower January Have Bears Smiling?\n\n&gt; Stocks got off to a nice start in 2020, until the late January selloff due to the coronavirus outbreak fears. In the end, the S&amp;P 500 Index fell only 0.2% for the month, but it did mark the end to a 4-month win streak. Should bulls worry about what a down January might mean for the rest of 2020?\n\n&gt; There’s an old adage on Wall Street that suggests, “As goes January, so goes the year.” This was first discussed in 1972 by Yale Hirsh of the Stock Trader’s Almanac, and it has an impressive track record. Simply put, when the first month of the year was green, it bodes well for the rest of the year (and vice versa). Given stocks closed red in January, how worried should investors be?\n\n&gt; As shown below in the LPL Chart of the Day, the numbers confirm that when the S&amp;P 500 has been green in January, the index has been up 11.9% on average over the rest of the year (final 11 months) and higher 86% of the time. However, when that first month was red, stocks rose only 1.2% on average over the final 11 months and were higher less than 60% of the time.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/02/so-goes-january-so-goes-the-year.png?ssl=1))**\n\n&gt; Another way to look at this data shows the average full year return based on if stocks are higher in January or not. As you can clearly see, stocks have tended to have trouble gaining any traction over the rest of the year after a January loss, while a green January has been quite strong.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/02/the-january-barometer.png?ssl=1)**\n\n&gt; It isn’t all bad news though. Remember the S&amp;P 500 was down only 0.2% in January, so one could argue that it was really flat. “Yes, a lower January is a potential worry for the bulls,” explained LPL Financial Senior Market Strategist Ryan Detrick. “But it is worth noting the previous 5 times (and 7 of 8) when stocks were lower in January, those final 11 months rallied. So this might not be the clear cut bearish signal so many think it is.”\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/02/a-lower-january-hasnt-been-as-bearish-lately.png?ssl=1))**\n\n*****\n\n# January Trifecta Spoiled by Coronavirus\n\n&gt; The market decline on the last day of January spoiled what would have been the fourth consecutive January Trifecta. S&amp;P 500 finished January down 0.2% and thus the January Barometer was negative.\n\n&gt; Devised by Yale Hirsch in 1972, the January Barometer has registered ten major errors since 1950 for an 85.7% accuracy ratio. This indicator adheres to propensity that as the S&amp;P 500 goes in January, so goes the year. Of the ten major errors Vietnam affected 1966 and 1968. 1982 saw the start of a major bull market in August. Two January rate cuts and 9/11 affected 2001.The market in January 2003 was held down by the anticipation of military action in Iraq. The second worst bear market since 1900 ended in March of 2009 and Federal Reserve intervention influenced 2010 and 2014. In 2016, DJIA slipped into an official Ned Davis bear market in January. Including the eight flat years yields a .743 batting average.\n\n&gt; This year’s combination of a positive Santa Claus Rally and First Five Days with a full-month January loss has only occurred eleven times (including this year) since 1950. In the previous ten occurrences S&amp;P 500 was down six times in February with an average loss of 1.5%. However, over the remaining 11 months of the year, S&amp;P 500 advanced 80% of the time with an average gain of 7.4%. Full-year performance was positive 70% of the time, but with an average gain of 2.9%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/6df473ecb7e9c5b9c107222c65f3131a/7be8cdb3803e5a29-77/s500x750/284bbb2175287530e6f02fc233a1772dce7a4852.jpg))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending February 7th, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=7gdnoSkR_Hk))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 2.9.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=3kQxYZ5sv6E))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$BABA** \n&gt; * **$ROKU** \n&gt; * **$SHOP** \n&gt; * **$NVDA** \n&gt; * **$CVS** \n&gt; * **$CGC** \n&gt; * **$CSCO** \n&gt; * **$UAA** \n&gt; * **$QSR** \n&gt; * **$L** \n&gt; * **$AGN** \n&gt; * **$HAS** \n&gt; * **$LYFT** \n&gt; * **$TEVA** \n&gt; * **$AMAT** \n&gt; * **$MCY** \n&gt; * **$SAFE** \n&gt; * **$GBDC** \n&gt; * **$GOLD** \n&gt; * **$PEP** \n&gt; * **$DO** \n&gt; * **$KHC** \n&gt; * **$D** \n&gt; * **$CYBR**\n&gt; * **$MELI** \n&gt; * **$CHGG** \n&gt; * **$CNA** \n&gt; * **$EXAS** \n&gt; * **$GT** \n&gt; * **$HLT** \n&gt; * **$AYX** \n&gt; * **$AN** \n&gt; * **$APPS** \n&gt; * **$WM** \n&gt; * **$GPN** \n&gt; * **$CRNT** \n&gt; * **$BIP** \n&gt; * **$YETI** \n&gt; * **$MPAA** \n&gt; * **$LSCC** \n&gt; * **$RNG** \n&gt; * **$NMM** \n&gt; * **$JE**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 2.10.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Tvfxbnh.png))\n\n\n&gt; # ***Monday 2.10.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/DYTRi0w.png))\n\n\n*****\n\n&gt; # ***Tuesday 2.11.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/sWB49z5.png))\n\n&gt; # ***Tuesday 2.11.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/hiUR1ec.png))\n\n*****\n\n&gt; # ***Wednesday 2.12.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/w9FUjTz.png))\n\n&gt; # ***Wednesday 2.12.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/cPnIcpa.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/BBaSJcZ.png))\n\n*****\n\n&gt; # ***Thursday 2.13.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/tjUpFdY.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/D7eo9EG.png))\n\n&gt; # ***Thursday 2.13.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/Y4rdLiL.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/feUqB85.png))\n\n*****\n\n&gt; # ***Friday 2.14.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/TGxgQ96.png))\n\n*****\n\n&gt; # ***Friday 2.14.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/tC78cWW.png))\n\n*****\n\n# Alibaba Group Holding Ltd. $216.53\n&gt; **Alibaba Group Holding Ltd. (BABA)** is confirmed to report earnings at approximately 7:10 AM ET on Thursday, February 13, 2020. The consensus earnings estimate is $2.25 per share on revenue of $22.68 billion and the Earnings Whisper ® number is $2.35 per share. Investor sentiment going into the company's earnings release has 79% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 33.93% with revenue increasing by 32.97%. Short interest has increased by 52.7% since the company's last earnings release while the stock has drifted higher by 21.0% from its open following the earnings release to be 19.4% above its 200 day moving average of $181.36. Overall earnings estimates have been unchanged since the company's last earnings release. On Wednesday, January 29, 2020 there was some notable buying of 9,774 contracts of the $215.00 put expiring on Friday, March 20, 2020. Option traders are pricing in a 5.4% move on earnings and the stock has averaged a 2.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BABA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Roku Inc $124.25\n&gt; **Roku Inc (ROKU)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, February 13, 2020. The consensus estimate is for a loss of $0.14 per share on revenue of $392.43 million and the Earnings Whisper ® number is ($0.11) per share. Investor sentiment going into the company's earnings release has 70% expecting an earnings beat The company's guidance was for revenue of $380.00 million to $396.00 million. Consensus estimates are for earnings to decline year-over-year by 300.00% with revenue increasing by 42.32%. The stock has drifted higher by 4.6% from its open following the earnings release to be 3.1% above its 200 day moving average of $120.56. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, January 28, 2020 there was some notable buying of 8,443 contracts of the $115.00 put expiring on Friday, April 17, 2020. Option traders are pricing in a 14.7% move on earnings and the stock has averaged a 22.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ROKU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Shopify Inc. $478.69\n&gt; **Shopify Inc. (SHOP)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, February 12, 2020. The consensus earnings estimate is $0.23 per share on revenue of $481.99 million and the Earnings Whisper ® number is $0.30 per share. Investor sentiment going into the company's earnings release has 70% expecting an earnings beat The company's guidance was for revenue of $472.00 million to $482.00 million. Consensus estimates are for earnings to decline year-over-year by 8.00% with revenue increasing by 40.17%. Short interest has increased by 3.4% since the company's last earnings release while the stock has drifted higher by 56.4% from its open following the earnings release to be 41.2% above its 200 day moving average of $339.06. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, January 24, 2020 there was some notable buying of 1,017 contracts of the $470.00 put expiring on Friday, February 21, 2020. Option traders are pricing in a 9.7% move on earnings and the stock has averaged a 6.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SHOP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# NVIDIA Corp. $251.59\n&gt; **NVIDIA Corp. (NVDA)** is confirmed to report earnings at approximately 4:20 PM ET on Thursday, February 13, 2020. The consensus earnings estimate is $1.66 per share on revenue of $2.96 billion and the Earnings Whisper ® number is $1.73 per share. Investor sentiment going into the company's earnings release has 78% expecting an earnings beat The company's guidance was for earnings of $1.56 to $1.75 per share. Consensus estimates are for year-over-year earnings growth of 110.13% with revenue increasing by 34.24%. Short interest has decreased by 3.4% since the company's last earnings release while the stock has drifted higher by 20.0% from its open following the earnings release to be 33.8% above its 200 day moving average of $187.97. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, February 7, 2020 there was some notable buying of 2,222 contracts of the $320.00 call expiring on Friday, March 20, 2020. Option traders are pricing in a 6.8% move on earnings and the stock has averaged a 6.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NVDA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# CVS Health $71.56\n&gt; **CVS Health (CVS)** is confirmed to report earnings at approximately 6:30 AM ET on Wednesday, February 12, 2020. The consensus earnings estimate is $1.68 per share on revenue of $64.15 billion and the Earnings Whisper ® number is $1.74 per share. Investor sentiment going into the company's earnings release has 76% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 21.50% with revenue increasing by 17.87%. Short interest has decreased by 5.8% since the company's last earnings release while the stock has drifted higher by 3.1% from its open following the earnings release to be 13.0% above its 200 day moving average of $63.32. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, January 23, 2020 there was some notable buying of 2,522 contracts of the $66.00 put expiring on Friday, February 14, 2020. Option traders are pricing in a 5.4% move on earnings and the stock has averaged a 6.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CVS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Canopy Growth Corporation $19.63\n&gt; **Canopy Growth Corporation (CGC)** is confirmed to report earnings at approximately 6:30 AM ET on Friday, February 14, 2020. The consensus estimate is for a loss of $0.36 per share on revenue of $79.20 million and the Earnings Whisper ® number is ($0.43) per share. Investor sentiment going into the company's earnings release has 56% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 46.27% with revenue increasing by 26.02%. Short interest has increased by 17.7% since the company's last earnings release while the stock has drifted higher by 19.7% from its open following the earnings release to be 32.6% below its 200 day moving average of $29.13. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, January 29, 2020 there was some notable buying of 1,603 contracts of the $12.50 put expiring on Friday, March 20, 2020. Option traders are pricing in a 12.0% move on earnings and the stock has averaged a 13.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CGC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Cisco Systems, Inc. $47.97\n&gt; **Cisco Systems, Inc. (CSCO)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, February 12, 2020. The consensus earnings estimate is $0.76 per share on revenue of $11.99 billion and the Earnings Whisper ® number is $0.78 per share. Investor sentiment going into the company's earnings release has 71% expecting an earnings beat The company's guidance was for earnings of $0.75 to $0.77 per share. Consensus estimates are for year-over-year earnings growth of 2.70% with revenue decreasing by 3.66%. Short interest has decreased by 8.6% since the company's last earnings release while the stock has drifted higher by 5.3% from its open following the earnings release to be 4.4% below its 200 day moving average of $50.19. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, January 22, 2020 there was some notable buying of 4,630 contracts of the $30.00 put expiring on Friday, January 15, 2021. Option traders are pricing in a 5.1% move on earnings and the stock has averaged a 5.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CSCO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Under Armour, Inc. $20.25\n&gt; **Under Armour, Inc. (UAA)** is confirmed to report earnings at approximately 6:55 AM ET on Tuesday, February 11, 2020. The consensus earnings estimate is $0.10 per share on revenue of $1.47 billion and the Earnings Whisper ® number is $0.12 per share. Investor sentiment going into the company's earnings release has 53% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 11.11% with revenue increasing by 5.76%. Short interest has increased by 0.0% since the company's last earnings release while the stock has drifted higher by 13.6% from its open following the earnings release to be 5.8% below its 200 day moving average of $21.49. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, February 3, 2020 there was some notable buying of 1,205 contracts of the $20.00 put expiring on Friday, February 14, 2020. Option traders are pricing in a 12.8% move on earnings and the stock has averaged a 12.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=UAA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Restaurant Brands International Inc. $63.86\n&gt; **Restaurant Brands International Inc. (QSR)** is confirmed to report earnings at approximately 6:30 AM ET on Monday, February 10, 2020. The consensus earnings estimate is $0.73 per share on revenue of $1.46 billion. Investor sentiment going into the company's earnings release has 58% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 7.35% with revenue increasing by 5.42%. The stock has drifted lower by 4.6% from its open following the earnings release to be 7.2% below its 200 day moving average of $68.78. Overall earnings estimates have been unchanged since the company's last earnings release. Option traders are pricing in a 5.5% move on earnings and the stock has averaged a 2.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=QSR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Loews Corp $53.25\n&gt; **Loews Corp (L)** is confirmed to report earnings at approximately 6:00 AM ET on Monday, February 10, 2020. The consensus earnings estimate is $0.72 per share. Investor sentiment going into the company's earnings release has 14% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 100.00% with revenue decreasing by 69.61%. Short interest has increased by 37.8% since the company's last earnings release while the stock has drifted higher by 5.7% from its open following the earnings release to be 3.9% above its 200 day moving average of $51.23. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, January 24, 2020 there was some notable buying of 602 contracts of the $50.00 put expiring on Friday, March 20, 2020. Option traders are pricing in a 9.3% move on earnings and the stock has averaged a 3.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=L&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/smallstreetbets.",
        "subreddit": "smallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning February 10th, 2020",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/f0swz6/wall_street_week_ahead_for_the_trading_week/",
        "created": 1581204063.0
    },
    {
        "author": "Noctumn",
        "created_utc": 1581389256,
        "id": "f21t7w",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I posted on this 24 days ago, and the underlying stock is up 6-7%. Earnings are expected to exceed the modest estimates on the 12th. \n\nI’ve been in this since $GPN was trading at $128 and not only am I a firm believer in the product, it has been consistently performing.\n\nTake a look!\n\n[MarketChameleon](https://marketchameleon.com/Overview/GPN/Earnings/Earnings-Dates)",
        "subreddit": "options",
        "title": "$GPN earnings on the 12th",
        "url": "https://www.reddit.com/r/options/comments/f21t7w/gpn_earnings_on_the_12th/",
        "created": 1581418056.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1581341601,
        "id": "f1qcoa",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/smallstreetbets sub! Welcome to the new trading week and a fresh start! Here are your pre-market movers and news this AM-\n\n*****\n\n#[Today's Top Headlines for Monday, February 10th, 2020](https://www.cnbc.com/2020/02/10/futures-steady-trump-new-budget-and-coronavirus-deaths-exceed-sars.html)\n\n* With coronavirus concerns still very much in the mix, U.S. stock futures point to more losses for Wall Street following a Friday sell-off. The major averages all had their best weekly gains in months despite that Friday drop, but the trend is clearly negative as we head into the new week. The Nasdaq’s weekly gain last week was its largest since November 2018, even after a 0.5% fall on Friday. Tech has been February’s strongest sector so far, and the Consumer Staples sector finished last week at a record high. (CNBC)\n* The Trump administration will release its fiscal 2021 budget today, which will show the economy growing at an average rate of 3% for the next 15 years. It’s also proposing to continue tax cuts for individuals through 2035 at a cost of $1.4 trillion, a figure that serves as a rough placeholder for President Donald Trump’s promised “Tax Cuts 2.0.” (CNBC)\n* Treasury yields move higher ahead of Trump’s 2021 budget (CNBC)\n* No economic releases are on today’s calendar. Two Fed officials have public speaking engagements today, with Fed Governor Michelle Bowman making a morning appearance in Florida and Philadelphia Fed President Patrick Harker speaking this afternoon in Delaware. (CNBC)\n* Allergan (AGN), Edgewell Personal Care (EPC), and Restaurant Brands International (QSR) are among the companies set to release quarterly earnings this morning. Callaway Golf (ELY) and XPO Logistics (XPO) issue numbers after the closing bell.\n* Tesla (TSLA) shares were up 9% in the premarket this morning after a tumultuous week, which saw the stock move more than $100 per share in either direction in three of five sessions. Tesla posted 10 consecutive weekly gains and have risen 127% over that span. (CNBC)\n* China’s National Health Commission said it confirmed 3,062 new coronavirus cases and 97 additional deaths, mostly in Hubei province. The government said a total of 40,171 cases have been confirmed and 908 people have died in the country. The U.K. has confirmed four further cases of the coronavirus, bringing the total number of cases in the country to eight. (CNBC)\n* Factories in China remain shuttered as some regions extend shutdowns (CNBC)\n* As virus deaths top SARS, survivor tells of treatment (WSJ)\n* Sen. Bernie Sanders remains at the top of the Democratic field in a new NBC News/Marist poll of tomorrow’s New Hampshire primary. Sanders gets 25% of likely Democratic primary voters in the poll, while former Mayor Pete Buttigieg receives support from 21%. Former Vice President Joe Biden, who had a dismal showing in the Iowa caucuses, comes in at 13%. (CNBC)\n* Biden predicts he will ‘take a hit’ in New Hampshire primary after ‘gut punch’ in Iowa (CNBC)\n* Mike Bloomberg is the only Democrat to top Trump in Gallup poll of small business owners (CNBC)\n* The Iowa Democratic Party allocated delegates based on the results of last week’s Iowa caucuses, giving Buttigieg the largest delegate count, followed closely by Sanders, though many news outlets remained unable to declare a winner. Sanders’ campaign plans to ask for a “partial recanvass” of the results of last week’s Iowa caucuses. (NBC News &amp; AP)\n* Sen. Josh Hawley is proposing putting the Federal Trade Commission, an independent agency, within the Department of Justice, which is part of the executive branch. The proposal is likely to raise alarms about removing the independence of a key regulatory body, especially as Democrats have speculated about Attorney General William Barr’s closeness to Trump. (CNBC)\n* Annegret Kramp-Karrenbauer, the leader of Germany’s Christian Democratic Union and the expected successor of Angela Merkel, will not run for chancellor. She will also give up the leadership of the CDU in the summer, according to an unnamed source cited by Reuters, setting in motion a party leadership contest. (CNBC)\n* L Brands (LB) is nearing a deal to sell its Victoria’s Secret brand to private equity firm Sycamore Partners in a deal that could be announced as soon this week. It’s not clear what role L Brands CEO Les Wexner would have in such a deal, as he’s under mounting pressure due to his ties to the late sex criminal Jeffrey Epstein. (CNBC)\n* The federally appointed oversight board in charge of Puerto Rico’s ongoing record debt restructuring saga announced they have come to terms with bondholders of around $35 billion, which accounts for nearly 50% of the bankrupt island’s total debt load. The deal will cut the Commonwealth’s outstanding bond debt from $35 billion to approximately $11 billion. (CNBC)\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](https://finviz.com/futures.ashx)**)\n\n*****\n\n#LAST WEEK'S MARKET MAP:\n######(**[CLICK HERE FOR LAST WEEK'S MARKET MAP!](https://finviz.com/publish/021020/sec_all_w1_075987823.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#LAST WEEK'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR LAST WEEK'S S&amp;P SECTORS CHART!](https://i.imgur.com/LUCTy7n.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/1zcutYE.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/yKvMhID.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/O4BbZMh.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n*($BABA $ROKU $SHOP $NVDA $CVS $CGC $CSCO $UAA $QSR $L $AGN $HAS $LYFT $TEVA $AMAT $MCY $SAFE $GBDC $GOLD $PEP $DO $KHC $D $CYBR $MELI $CHGG $CNA $EXAS $GT $HLT $AYX $AN $APPS $WM $GPN $CRNT $BIP $YETI $MPAA $LSCC $RNG $NMM $JE)*\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/8e4snrC.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n*($QSR $L $MCY $GBDC $DO $CNA $BIP $CRNT $JE $IVC $EPC $GFN $NMM $MPAA $AVYA)*\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/uE1CJHc.jpg)**)\n\n*****\n\n#THIS AFTERNOON'S POST-MARKET EARNINGS CALENDAR:\n*()*\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS CALENDAR!]()**)\nT.B.A.\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/PCtL4E4.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/BuiIish.png)**)\n\n*****\n\n#FRIDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR FRIDAY'S UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/4df33Zh.png)**)\n######(**[CLICK HERE FOR FRIDAY'S UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/YwquWUG.png)**)\n######(**[CLICK HERE FOR FRIDAY'S UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/nJe64uF.png)**)\n\n*****\n\n#FRIDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR FRIDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/nbAlnD0.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!](https://i.imgur.com/xN2pAi9.png)**)\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS:\n\n* BLK\n* AGN\n* QSR\n* AVYA\n* TCO\n* FDX\n* ADVM\n* BHVN\n* CMPR\n* COLL\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2020/02/10/stocks-making-the-biggest-moves-in-the-premarket-allergan-taubman-centers-eli-lilly-more.html)**)\n\n*****\n\n&gt; **Taubman Centers (TCO)** – Mall operator Simon Property Group (SPG) will buy rival Taubman for $52.50 per share in cash, or about $3.6 billion. Taubman’s properties will continue to be managed by its existing executive team.\n\n&gt; #**STOCK SYMBOL:** TCO\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TCO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TCO)**)\n\n*****\n\n&gt; **Allergan (AGN)** – The drugmaker reported quarterly earnings of $5.22 per share, compared to estimates of $4.57 a share. Revenue also beat Wall Street forecasts, helped by better-than-expected specialized therapeutics and general medicine sales.\n\n&gt; #**STOCK SYMBOL:** AGN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AGN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AGN)**)\n\n*****\n\n&gt; **Edgewell Personal Care (EPC)** – The maker of Schick razors reported quarterly profit of 55 cents per share, well above the consensus estimate of 29 cents a share. Revenue exceeded estimates as well, and its full-year outlook is also mostly above Street forecasts. Separately, Edgewell ended its agreement to buy razor maker Harry’s, after the Federal Trade Commission moved to block the deal.\n\n&gt; #**STOCK SYMBOL:** EPC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=EPC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/EPC)**)\n\n*****\n\n&gt; **Restaurant Brands (QSR)** – The restaurant operator reported quarterly profit of 75 cents per share, 2 cents a share above estimates. Revenue also came in above forecasts. Comparable sales were shy of expectations at Tim Hortons and Burger King, but well above forecasts at Popeyes. The company said systemwide sales at the Popeyes chain jumped 42%, thanks in large part to its popular spicy chicken sandwich.\n\n&gt; #**STOCK SYMBOL:** QSR\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=QSR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/QSR)**)\n\n*****\n\n&gt; **Eli Lilly (LLY)** – Lilly and partner Genentech said their experimental therapy for a rare form of Alzheimer’s disease missed its primary goal in a study.\n\n&gt; #**STOCK SYMBOL:** LLY\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=LLY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LLY)**)\n\n*****\n\n&gt; **L Brands (LB)** – L Brands is near a deal to sell its Victoria’s Secret division to private-equity firm Sycamore Partners, according to sources who spoke to CNBC. The price could not be learned, but a deal could be announced as soon as this week.\n\n&gt; #**STOCK SYMBOL:** LB\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=LB&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LB)**)\n\n*****\n\n&gt; **Mattel (MAT)** – Mattel is shutting two factories in Asia and will close another in Canada, as it seeks to cut costs. The toy maker has been seeking to streamline its manufacturing and supply chain.\n\n&gt; #**STOCK SYMBOL:** MAT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=MAT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/MAT)**)\n\n*****\n\n&gt; **Tesla (TSLA)** – Tesla remains on watch after a tumultuous week which saw in move more than $100 per share in either direction in three of five sessions. Tesla shares have posted 10 consecutive weekly gains and have risen 127% over that span.\n\n&gt; #**STOCK SYMBOL:** TSLA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TSLA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TSLA)**)\n\n*****\n\n&gt; **Apple (AAPL)** – Apple may postpone the launch of a cheaper iPhone due to the coronavirus, according to published reports in China.\n\n&gt; #**STOCK SYMBOL:** AAPL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AAPL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AAPL)**)\n\n*****\n\n&gt; **Yum China (YUMC)** – A Yum China employee in Northwest China responsible for food preparation was confirmed to have the coronavirus, according to the Global Times.\n\n&gt; #**STOCK SYMBOL:** YUMC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=YUMC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/YUMC)**)\n\n*****\n\n&gt; **Willis Towers Watson (WLTW)** – The stock was downgraded to “neutral” from “outperform” at Credit Suisse in a valuation call. The consulting firm had reported better than expected quarterly earnings last week, but the stock tumbled amid a 2020 earnings forecast that fell partially below consensus.\n\n&gt; #**STOCK SYMBOL:** WLTW\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WLTW&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WLTW)**)\n\n*****\n\n&gt; **FedEx (FDX)** – FedEx was upgraded to “buy” from “neutral” at UBS, which thinks consensus expectations are low for the company and that profit margins at FedEx’s Express service will expand.\n\n&gt; #**STOCK SYMBOL:** FDX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=FDX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/FDX)**)\n\n*****\n\n&gt; **World Wrestling (WWE)** – World Wrestling was downgraded to “underweight” from “overweight” at Wells Fargo Securities, with the price target slashed to $36 per share from $80 a share. Wells Fargo said there have been “too many misfires,” and that the company needs a new CFO and to issue long-term guidance.\n\n&gt; #**STOCK SYMBOL:** WWE\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WWE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WWE)**)\n\n*****\n\n&gt; **Nvidia (NVDA)** – RBC Capital increased its price target for the graphics chip maker’s stock to $301 per share from $251, saying the quarter ending January 31 is likely to come in above the high end of the company’s guidance due to strong gaming and data center markets.\n\n&gt; #**STOCK SYMBOL:** NVDA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=NVDA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/NVDA)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat is on everyone's radar for today's trading day ahead here at r/smallstreetbets?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Monday, February 10th, 2020! :)**",
        "subreddit": "smallstreetbets",
        "title": "Today's Pre-Market Movers &amp; News [Monday, February 10th, 2020]",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/f1qcoa/todays_premarket_movers_news_monday_february_10th/",
        "created": 1581370401.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1581175187,
        "id": "f0swap",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/wallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning February 10th, 2020.\n\n# **Markets could see a turbulent week as investors watch coronavirus, economy and Fed testimony  - [(Source)](https://www.cnbc.com/2020/02/07/markets-could-see-a-turbulent-week-as-investors-watch-coronavirus-economy-and-election.html)**\n*****\n&gt; The uncertainty around the coronavirus could continue to carry more weight in markets than corporate earnings or the consumer inflation and spending data expected in the week ahead.\n*****\n&gt; Fed Chairman Jerome Powell testifies Tuesday and Wednesday in his bi-annual appearance before Congress, and investors are watching to see if Powell looks ready to move away from the Fed’s neutral stand on interest rates.\n*****\n&gt; Trading was volatile in the past week, with stocks sharply higher four of the five days as investors viewed the virus’ progress to be less rapid than feared. But by Friday, the death of the doctor who discovered the illness and the addition of restrictions in Shenzen, a key manufacturing hub, were among the headlines that renewed investor fears. By Friday, 31,000 people were reported to be infected, mostly in China, but the amount of new cases slowed for a second day, according to the World Health Organization.\n*****\n&gt; Stocks were lower Friday even after a much stronger-than-expected January employment report showed 225,000 jobs were created — 65,000 more than expected. Treasury yields, higher much of the week, edged lower Friday, and the 10-year yield dipped below 1.60% once more.\n*****\n&gt; “The data has been very positive, but it’s looking in the rear view mirror. It doesn’t take into account any concerns about the coronavirus yet,” said Michael Arone, chief investment strategist at State Street Global Advisors.\n*****\n&gt; Analysts have said volatility will now be a common theme in the stock market, regardless of which way it trades. That may have been apparent in the story of one stock in the past week — Tesla.\n*****\n&gt; The electric car maker’s stock shot up in parabolic fashion to a high of $968.99 on Tuesday, and was trading more than $200 below that on Friday.\n*****\n&gt; “I do believe what happened in Tesla just does show some of the euphoria that got into the marketplace,” said Matt Maley, Miller Tabak chief market strategist. Maley said some investors were comparing the surge higher to 1999, when the tech bubble was building. “I really laugh when people justify the rally by saying, it’s not as crazy as it was in 1999.”\n*****\n&gt; Maley said now that the stock has “washed out” on the upside, there’s likely more downside ahead.\n*****\n&gt; “Some of these comments in the last couple of days ... talking about how the retail investors piled into the stock. Of course, that’s usually a sign of a top as well,” he said.\n*****\n&gt; # Brakes on growth\n&gt; UBS Global Wealth Management’s Chief Investment Officer Mark Haefele said next week could provide an important look at how the virus is impacting China’s economy.\n*****\n&gt; “Next week, Chinese factories are set to reopen after the extended Lunar New Year holiday, and important indicators to note will be to what extent the virus spreads as people resume travel back to work, and how long it takes for production to return to full capacity,” he wrote, adding he still likes emerging markets despite the potential hit on their economies.\n*****\n&gt; Economists expect the impact on the U.S. economy to be minimal, and say it should bounce back quickly.\n*****\n&gt; Thursday’s consumer price index and Friday’s retail sales, industrial production and consumer sentiment will be watched closely by economists. ISM manufacturing data was stronger than expected in the past week, ending a period of contraction that started during the trade war.\n*****\n&gt; The first quarter data has been providing a mixed picture of the economy, ahead of any impacts of the virus. Economists had been expecting manufacturing to get a boost after the trade deal, but Boeing’s production shut down and now the virus could muddy that picture.\n*****\n&gt; “I think there’s been a little bit of chicken little about the economy for awhile. It ebbs and flows,” said Arone, noting the Fed is the backstop if growth is choked. “Most of the indicators indicate the economy is going to chug along.”\n*****\n&gt; Powell testifies for two days before House and Senate committees on the state of the economy. Markets will be watching his comments closely to see what he has to say on the potential impact of the coronavirus. The markets have begun to price in more than one rate cut for this year, even though the Fed is not forecasting any.\n*****\n&gt; “With the strong jobs, I think it’s going to be more of the same. They raised the bar pretty high for them to signal any policy changes,” said John Roberts, U.S. rate strategist at NatWest Markets. “They mentioned the coronavirus already. We could get more insight into what they’re thinking about that. That’s the main thing we’re looking for.”\n*****\n&gt; China’s central bank has been adding stimulus, and that was seen as a booster for global stock markets in the past week.\n*****\n&gt; Capital Economics on Friday said it expects the coronavirus to cost the world economy $280 billion in the first quarter.\n*****\n&gt; “If we’re right, then this will mean that global GDP will not grow in [quarter over quarter] terms for the first time since 2009,” the economists wrote in a note. “We assume the virus will be contained soon, and that lost output is made up in subsequent quarters, so that world GDP reaches the level it would have done had there been no outbreak by the middle of 2021.”\n*****\n&gt; # Earnings Bonanza\n&gt; Better-than-expected earnings have helped stoke the market’s recent gains. There are dozens of earnings expected in the week ahead, including CVS Health Wednesday and Pepsi, Nvidia and Kraft Heinz Thursday.\n*****\n&gt; So far, more than 70% of companies are beating forecasts and profits are growing by 2.3%, when including both companies that have reported and those expected to report, according to Refinitiv. At the start of the earnings reporting period, earnings growth was expected to decline.\n*****\n&gt; Analysts will also look to companies to continue disclosing how the virus is impacting their operations. VF Corp, for instance, said 60% of its stores in China are now closed, and those that remain open have serous declines.\n*****\n&gt; # Playing Politics\n&gt; Vermont Sen. Bernie Sanders sent a shudder through markets when he began to rise in the polls ahead of Iowa’s caucuses. But the chaos in declaring a winner in Iowa this past week, leaves the Democratic field wide open. So New Hampshire’s primary Tuesday will also be important.\n*****\n&gt; The left-leaning Sanders is viewed as negative for the stock market, but his main rivals, Joseph Biden and now Pete Buttigieg, who seems to have led in Iowa, are both moderates. Sanders leads in the New Hampshire polls and is expected to win his neighboring state.\n*****\n&gt; “I think it’s going to continue to matter for quite some time, until we get clarity at least on who the Democratic candidate is going to be,” said Jon Hill, rates strategist at BMO. ”[Buttigieg] would be much more business friendly than some of the other candidates. Does that make him more or less electable? If he’s more that could be a market negative development.”\n*****\n&gt; The S&amp;P 500 has gained 55% since Donald Trump became president, and analysts say he is viewed by investors as having the best policies for the stock market. Some Democrats, particularly Sanders, would raise taxes sharply.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/qOqI74J.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/n8uJhuY.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/qSPsa54.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/yKvMhID.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/qFnHyJw.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/Zwtq6za.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/Crf7CiP.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/wSa5dB3.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/8e4snrC.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/O4BbZMh.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/4df33Zh.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/YwquWUG.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/nJe64uF.png))**\n\n*****\n\n# Week Before Presidents’ Day Bullish since 1990\n\n&gt; Page 100 of the Stock Trader’s Almanac 2020 points out Presidents’ Day as the poorest performing holiday of the eight holidays that are tracked. Unlike the others, the trading day before and the trading day after this three-day holiday weekend are both down on average over the past 40 years. However, the full week before the long holiday weekend has a bullish record. Since 1990 DJIA and S&amp;P 500 have advanced 20 times with average weekly gains of 0.66% and 0.48% respectively. NASDAQ has one additional weekly decline while Russell 2000 has been the strongest, up 23 times with an average gain of 0.79%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/87d4499ef13ff59956f4c6343e3c411e/5b2bbadb398d5a54-f0/s500x750/24f2f57a33d656e400f05e96ccd367ce42aa6af8.jpg))**\n\n*****\n\n# Strong Jobs Report to Begin 2020\n\n&gt; U.S. hiring came in stronger than expected in January, rebounding from a disappointing December print.\n\n&gt; Nonfarm payrolls rose by 225,000 in January, far surpassing Bloomberg’s consensus estimates for a 165,000 gain, according to the jobs report released today by the U.S. Bureau of Labor Statistics. This number may help alleviate some investor unease over December’s somewhat weak reading. We argued at the time that December’s reading likely was due in large part to calendar effects and the volatility of month-to-month changes. We prefer to base our views of the labor market’s vitality on the larger trend, which, has been undeniably strong, as shown in the LPL Chart of the Day.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/02/kciking-off-2020-with-a-strong-rebound.png?ssl=1))**\n\n&gt; Some investors have questioned how long hiring can remain elevated before we experience a worker shortage or a sharp rise in wages. The answer, according to this report, is not yet.\n\n&gt; In addition to the strong hiring numbers, workers also have enjoyed healthy wage gains. January saw average hourly earnings rise 3.1% year over year, a slight pickup from December, while average hours worked remained unchanged. “Today’s wage number exceeds inflation, meaning workers are growing their purchasing power in real terms and should be able to continue increasing their consumption of goods and services,” said LPL Financial Chief Investment Strategist John Lynch. “But the number is also lower than the 4% threshold that has historically signaled an overheating job market and potential for subsequent economic and market volatility. This is a very encouraging report.”\n\n&gt; The one slight blip in today’s release showed the unemployment rate inching 0.1% higher to 3.6%. This was mainly due to changes to the size of the labor force, which affected revisions. Still, given the extremely low unemployment level, the volatility of month-to-month numbers, and the overwhelmingly positive tone of the other data points released today, we feel confident about the prospects for the U.S. consumer to continue powering this economic expansion through 2020 and beyond.\n\n*****\n\n# New Highs Tilt Scales to Bulls\n\n&gt; China is cutting tariffs; the impeachment process has come to an end and the market is at new all-time highs. The coronavirus is still a concern, but apparently not as much as it was less than one week ago. Progress has been made. Official emergency declarations have mobilized a stronger response. China has quickly built additional hospitals and work is underway on a treatment. Gilead (GILD) appears to be the first to offer a potential cure although its drug remdesivir has not been approved to cure any disease yet. These recent developments along with solid earnings, have been the fuel to reverse the market’s late January retreat in just a few trading sessions this month.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/eb99cd5eedf67e83954c998976da3a81/8ea2bcc9db4c521e-49/s500x750/705cf31363591f72784f14fed6029effc84a4228.jpg))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/07db71096c88ddf9778d29d0bdb69e60/8ea2bcc9db4c521e-86/s500x750/e6f5479d3cea9759bc52d0c99fff7704947ff575.jpg))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/cdb9b967be268f1fcb154d09dfa8553b/8ea2bcc9db4c521e-2c/s500x750/4f3021be20791991f739de9273300f798a7cbf31.jpg))**\n\n&gt; In the above charts, the market’s strength since October can be seen along with second half of January weakness. DJIA, S&amp;P 500 and NASDAQ have remained comfortably above their respective 200-day moving averages since October. In January only DJIA actually (and briefly) closed below its even higher 50-day moving average. The market’s rebound surge in February has also reversed negative readings from Stochastic, relative strength and MACD indicators.\n\n&gt; Momentum clearly favors the bulls and January’s negative finish remains unconfirmed as of today. As long as economic data and corporate earnings remain positive then the market is likely to continue the trend that has been in place since last October, higher. There are likely to be some dips along the way with the next possible soft patch arriving when earnings season nears its end later this month and/or in the first half of March.\n\n*****\n\n# Typical February Trading: Tepid Month with Solid Mid-Month Rally\n\n&gt; February has historically been a rather bland month. Since 1950, S&amp;P 500 has averaged a measly 0.1%. Over the last 21-year period S&amp;P 500 average performance has declined to a loss of 0.4% in February. February’s first trading day has historically been good, like today, and trading days eight, nine, ten and eleven have offered repeatable long opportunities. Outside of these five days, the balance of February has been rather lacking.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/10b0e0be07d6824e6a082e13a26bc1d9/e1ddcea381248255-b9/s500x750/a2b1e806df3ec07b5e77c69efd297e5802fa1208.jpg))**\n\n*****\n\n# Does A Lower January Have Bears Smiling?\n\n&gt; Stocks got off to a nice start in 2020, until the late January selloff due to the coronavirus outbreak fears. In the end, the S&amp;P 500 Index fell only 0.2% for the month, but it did mark the end to a 4-month win streak. Should bulls worry about what a down January might mean for the rest of 2020?\n\n&gt; There’s an old adage on Wall Street that suggests, “As goes January, so goes the year.” This was first discussed in 1972 by Yale Hirsh of the Stock Trader’s Almanac, and it has an impressive track record. Simply put, when the first month of the year was green, it bodes well for the rest of the year (and vice versa). Given stocks closed red in January, how worried should investors be?\n\n&gt; As shown below in the LPL Chart of the Day, the numbers confirm that when the S&amp;P 500 has been green in January, the index has been up 11.9% on average over the rest of the year (final 11 months) and higher 86% of the time. However, when that first month was red, stocks rose only 1.2% on average over the final 11 months and were higher less than 60% of the time.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/02/so-goes-january-so-goes-the-year.png?ssl=1))**\n\n&gt; Another way to look at this data shows the average full year return based on if stocks are higher in January or not. As you can clearly see, stocks have tended to have trouble gaining any traction over the rest of the year after a January loss, while a green January has been quite strong.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/02/the-january-barometer.png?ssl=1)**\n\n&gt; It isn’t all bad news though. Remember the S&amp;P 500 was down only 0.2% in January, so one could argue that it was really flat. “Yes, a lower January is a potential worry for the bulls,” explained LPL Financial Senior Market Strategist Ryan Detrick. “But it is worth noting the previous 5 times (and 7 of 8) when stocks were lower in January, those final 11 months rallied. So this might not be the clear cut bearish signal so many think it is.”\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/02/a-lower-january-hasnt-been-as-bearish-lately.png?ssl=1))**\n\n*****\n\n# January Trifecta Spoiled by Coronavirus\n\n&gt; The market decline on the last day of January spoiled what would have been the fourth consecutive January Trifecta. S&amp;P 500 finished January down 0.2% and thus the January Barometer was negative.\n\n&gt; Devised by Yale Hirsch in 1972, the January Barometer has registered ten major errors since 1950 for an 85.7% accuracy ratio. This indicator adheres to propensity that as the S&amp;P 500 goes in January, so goes the year. Of the ten major errors Vietnam affected 1966 and 1968. 1982 saw the start of a major bull market in August. Two January rate cuts and 9/11 affected 2001.The market in January 2003 was held down by the anticipation of military action in Iraq. The second worst bear market since 1900 ended in March of 2009 and Federal Reserve intervention influenced 2010 and 2014. In 2016, DJIA slipped into an official Ned Davis bear market in January. Including the eight flat years yields a .743 batting average.\n\n&gt; This year’s combination of a positive Santa Claus Rally and First Five Days with a full-month January loss has only occurred eleven times (including this year) since 1950. In the previous ten occurrences S&amp;P 500 was down six times in February with an average loss of 1.5%. However, over the remaining 11 months of the year, S&amp;P 500 advanced 80% of the time with an average gain of 7.4%. Full-year performance was positive 70% of the time, but with an average gain of 2.9%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/6df473ecb7e9c5b9c107222c65f3131a/7be8cdb3803e5a29-77/s500x750/284bbb2175287530e6f02fc233a1772dce7a4852.jpg))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending February 7th, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=7gdnoSkR_Hk))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 2.9.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=3kQxYZ5sv6E))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$BABA** \n&gt; * **$ROKU** \n&gt; * **$SHOP** \n&gt; * **$NVDA** \n&gt; * **$CVS** \n&gt; * **$CGC** \n&gt; * **$CSCO** \n&gt; * **$UAA** \n&gt; * **$QSR** \n&gt; * **$L** \n&gt; * **$AGN** \n&gt; * **$HAS** \n&gt; * **$LYFT** \n&gt; * **$TEVA** \n&gt; * **$AMAT** \n&gt; * **$MCY** \n&gt; * **$SAFE** \n&gt; * **$GBDC** \n&gt; * **$GOLD** \n&gt; * **$PEP** \n&gt; * **$DO** \n&gt; * **$KHC** \n&gt; * **$D** \n&gt; * **$CYBR**\n&gt; * **$MELI** \n&gt; * **$CHGG** \n&gt; * **$CNA** \n&gt; * **$EXAS** \n&gt; * **$GT** \n&gt; * **$HLT** \n&gt; * **$AYX** \n&gt; * **$AN** \n&gt; * **$APPS** \n&gt; * **$WM** \n&gt; * **$GPN** \n&gt; * **$CRNT** \n&gt; * **$BIP** \n&gt; * **$YETI** \n&gt; * **$MPAA** \n&gt; * **$LSCC** \n&gt; * **$RNG** \n&gt; * **$NMM** \n&gt; * **$JE**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 2.10.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Tvfxbnh.png))\n\n\n&gt; # ***Monday 2.10.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/DYTRi0w.png))\n\n\n*****\n\n&gt; # ***Tuesday 2.11.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/sWB49z5.png))\n\n&gt; # ***Tuesday 2.11.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/hiUR1ec.png))\n\n*****\n\n&gt; # ***Wednesday 2.12.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/w9FUjTz.png))\n\n&gt; # ***Wednesday 2.12.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/cPnIcpa.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/BBaSJcZ.png))\n\n*****\n\n&gt; # ***Thursday 2.13.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/tjUpFdY.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/D7eo9EG.png))\n\n&gt; # ***Thursday 2.13.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/Y4rdLiL.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/feUqB85.png))\n\n*****\n\n&gt; # ***Friday 2.14.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/TGxgQ96.png))\n\n*****\n\n&gt; # ***Friday 2.14.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/tC78cWW.png))\n\n*****\n\n# Alibaba Group Holding Ltd. $216.53\n&gt; **Alibaba Group Holding Ltd. (BABA)** is confirmed to report earnings at approximately 7:10 AM ET on Thursday, February 13, 2020. The consensus earnings estimate is $2.25 per share on revenue of $22.68 billion and the Earnings Whisper ® number is $2.35 per share. Investor sentiment going into the company's earnings release has 79% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 33.93% with revenue increasing by 32.97%. Short interest has increased by 52.7% since the company's last earnings release while the stock has drifted higher by 21.0% from its open following the earnings release to be 19.4% above its 200 day moving average of $181.36. Overall earnings estimates have been unchanged since the company's last earnings release. On Wednesday, January 29, 2020 there was some notable buying of 9,774 contracts of the $215.00 put expiring on Friday, March 20, 2020. Option traders are pricing in a 5.4% move on earnings and the stock has averaged a 2.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BABA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Roku Inc $124.25\n&gt; **Roku Inc (ROKU)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, February 13, 2020. The consensus estimate is for a loss of $0.14 per share on revenue of $392.43 million and the Earnings Whisper ® number is ($0.11) per share. Investor sentiment going into the company's earnings release has 70% expecting an earnings beat The company's guidance was for revenue of $380.00 million to $396.00 million. Consensus estimates are for earnings to decline year-over-year by 300.00% with revenue increasing by 42.32%. The stock has drifted higher by 4.6% from its open following the earnings release to be 3.1% above its 200 day moving average of $120.56. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, January 28, 2020 there was some notable buying of 8,443 contracts of the $115.00 put expiring on Friday, April 17, 2020. Option traders are pricing in a 14.7% move on earnings and the stock has averaged a 22.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ROKU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Shopify Inc. $478.69\n&gt; **Shopify Inc. (SHOP)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, February 12, 2020. The consensus earnings estimate is $0.23 per share on revenue of $481.99 million and the Earnings Whisper ® number is $0.30 per share. Investor sentiment going into the company's earnings release has 70% expecting an earnings beat The company's guidance was for revenue of $472.00 million to $482.00 million. Consensus estimates are for earnings to decline year-over-year by 8.00% with revenue increasing by 40.17%. Short interest has increased by 3.4% since the company's last earnings release while the stock has drifted higher by 56.4% from its open following the earnings release to be 41.2% above its 200 day moving average of $339.06. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, January 24, 2020 there was some notable buying of 1,017 contracts of the $470.00 put expiring on Friday, February 21, 2020. Option traders are pricing in a 9.7% move on earnings and the stock has averaged a 6.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SHOP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# NVIDIA Corp. $251.59\n&gt; **NVIDIA Corp. (NVDA)** is confirmed to report earnings at approximately 4:20 PM ET on Thursday, February 13, 2020. The consensus earnings estimate is $1.66 per share on revenue of $2.96 billion and the Earnings Whisper ® number is $1.73 per share. Investor sentiment going into the company's earnings release has 78% expecting an earnings beat The company's guidance was for earnings of $1.56 to $1.75 per share. Consensus estimates are for year-over-year earnings growth of 110.13% with revenue increasing by 34.24%. Short interest has decreased by 3.4% since the company's last earnings release while the stock has drifted higher by 20.0% from its open following the earnings release to be 33.8% above its 200 day moving average of $187.97. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, February 7, 2020 there was some notable buying of 2,222 contracts of the $320.00 call expiring on Friday, March 20, 2020. Option traders are pricing in a 6.8% move on earnings and the stock has averaged a 6.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NVDA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# CVS Health $71.56\n&gt; **CVS Health (CVS)** is confirmed to report earnings at approximately 6:30 AM ET on Wednesday, February 12, 2020. The consensus earnings estimate is $1.68 per share on revenue of $64.15 billion and the Earnings Whisper ® number is $1.74 per share. Investor sentiment going into the company's earnings release has 76% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 21.50% with revenue increasing by 17.87%. Short interest has decreased by 5.8% since the company's last earnings release while the stock has drifted higher by 3.1% from its open following the earnings release to be 13.0% above its 200 day moving average of $63.32. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, January 23, 2020 there was some notable buying of 2,522 contracts of the $66.00 put expiring on Friday, February 14, 2020. Option traders are pricing in a 5.4% move on earnings and the stock has averaged a 6.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CVS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Canopy Growth Corporation $19.63\n&gt; **Canopy Growth Corporation (CGC)** is confirmed to report earnings at approximately 6:30 AM ET on Friday, February 14, 2020. The consensus estimate is for a loss of $0.36 per share on revenue of $79.20 million and the Earnings Whisper ® number is ($0.43) per share. Investor sentiment going into the company's earnings release has 56% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 46.27% with revenue increasing by 26.02%. Short interest has increased by 17.7% since the company's last earnings release while the stock has drifted higher by 19.7% from its open following the earnings release to be 32.6% below its 200 day moving average of $29.13. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, January 29, 2020 there was some notable buying of 1,603 contracts of the $12.50 put expiring on Friday, March 20, 2020. Option traders are pricing in a 12.0% move on earnings and the stock has averaged a 13.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CGC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Cisco Systems, Inc. $47.97\n&gt; **Cisco Systems, Inc. (CSCO)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, February 12, 2020. The consensus earnings estimate is $0.76 per share on revenue of $11.99 billion and the Earnings Whisper ® number is $0.78 per share. Investor sentiment going into the company's earnings release has 71% expecting an earnings beat The company's guidance was for earnings of $0.75 to $0.77 per share. Consensus estimates are for year-over-year earnings growth of 2.70% with revenue decreasing by 3.66%. Short interest has decreased by 8.6% since the company's last earnings release while the stock has drifted higher by 5.3% from its open following the earnings release to be 4.4% below its 200 day moving average of $50.19. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, January 22, 2020 there was some notable buying of 4,630 contracts of the $30.00 put expiring on Friday, January 15, 2021. Option traders are pricing in a 5.1% move on earnings and the stock has averaged a 5.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CSCO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Under Armour, Inc. $20.25\n&gt; **Under Armour, Inc. (UAA)** is confirmed to report earnings at approximately 6:55 AM ET on Tuesday, February 11, 2020. The consensus earnings estimate is $0.10 per share on revenue of $1.47 billion and the Earnings Whisper ® number is $0.12 per share. Investor sentiment going into the company's earnings release has 53% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 11.11% with revenue increasing by 5.76%. Short interest has increased by 0.0% since the company's last earnings release while the stock has drifted higher by 13.6% from its open following the earnings release to be 5.8% below its 200 day moving average of $21.49. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, February 3, 2020 there was some notable buying of 1,205 contracts of the $20.00 put expiring on Friday, February 14, 2020. Option traders are pricing in a 12.8% move on earnings and the stock has averaged a 12.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=UAA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Restaurant Brands International Inc. $63.86\n&gt; **Restaurant Brands International Inc. (QSR)** is confirmed to report earnings at approximately 6:30 AM ET on Monday, February 10, 2020. The consensus earnings estimate is $0.73 per share on revenue of $1.46 billion. Investor sentiment going into the company's earnings release has 58% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 7.35% with revenue increasing by 5.42%. The stock has drifted lower by 4.6% from its open following the earnings release to be 7.2% below its 200 day moving average of $68.78. Overall earnings estimates have been unchanged since the company's last earnings release. Option traders are pricing in a 5.5% move on earnings and the stock has averaged a 2.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=QSR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Loews Corp $53.25\n&gt; **Loews Corp (L)** is confirmed to report earnings at approximately 6:00 AM ET on Monday, February 10, 2020. The consensus earnings estimate is $0.72 per share. Investor sentiment going into the company's earnings release has 14% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 100.00% with revenue decreasing by 69.61%. Short interest has increased by 37.8% since the company's last earnings release while the stock has drifted higher by 5.7% from its open following the earnings release to be 3.9% above its 200 day moving average of $51.23. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, January 24, 2020 there was some notable buying of 602 contracts of the $50.00 put expiring on Friday, March 20, 2020. Option traders are pricing in a 9.3% move on earnings and the stock has averaged a 3.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=L&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/wallstreetbets.",
        "subreddit": "wallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning February 10th, 2020",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f0swap/wall_street_week_ahead_for_the_trading_week/",
        "created": 1581203987.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1581175075,
        "id": "f0svfy",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/stocks. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning February 10th, 2020.\n\n# **Markets could see a turbulent week as investors watch coronavirus, economy and Fed testimony  - [(Source)](https://www.cnbc.com/2020/02/07/markets-could-see-a-turbulent-week-as-investors-watch-coronavirus-economy-and-election.html)**\n*****\n&gt; The uncertainty around the coronavirus could continue to carry more weight in markets than corporate earnings or the consumer inflation and spending data expected in the week ahead.\n*****\n&gt; Fed Chairman Jerome Powell testifies Tuesday and Wednesday in his bi-annual appearance before Congress, and investors are watching to see if Powell looks ready to move away from the Fed’s neutral stand on interest rates.\n*****\n&gt; Trading was volatile in the past week, with stocks sharply higher four of the five days as investors viewed the virus’ progress to be less rapid than feared. But by Friday, the death of the doctor who discovered the illness and the addition of restrictions in Shenzen, a key manufacturing hub, were among the headlines that renewed investor fears. By Friday, 31,000 people were reported to be infected, mostly in China, but the amount of new cases slowed for a second day, according to the World Health Organization.\n*****\n&gt; Stocks were lower Friday even after a much stronger-than-expected January employment report showed 225,000 jobs were created — 65,000 more than expected. Treasury yields, higher much of the week, edged lower Friday, and the 10-year yield dipped below 1.60% once more.\n*****\n&gt; “The data has been very positive, but it’s looking in the rear view mirror. It doesn’t take into account any concerns about the coronavirus yet,” said Michael Arone, chief investment strategist at State Street Global Advisors.\n*****\n&gt; Analysts have said volatility will now be a common theme in the stock market, regardless of which way it trades. That may have been apparent in the story of one stock in the past week — Tesla.\n*****\n&gt; The electric car maker’s stock shot up in parabolic fashion to a high of $968.99 on Tuesday, and was trading more than $200 below that on Friday.\n*****\n&gt; “I do believe what happened in Tesla just does show some of the euphoria that got into the marketplace,” said Matt Maley, Miller Tabak chief market strategist. Maley said some investors were comparing the surge higher to 1999, when the tech bubble was building. “I really laugh when people justify the rally by saying, it’s not as crazy as it was in 1999.”\n*****\n&gt; Maley said now that the stock has “washed out” on the upside, there’s likely more downside ahead.\n*****\n&gt; “Some of these comments in the last couple of days ... talking about how the retail investors piled into the stock. Of course, that’s usually a sign of a top as well,” he said.\n*****\n&gt; # Brakes on growth\n&gt; UBS Global Wealth Management’s Chief Investment Officer Mark Haefele said next week could provide an important look at how the virus is impacting China’s economy.\n*****\n&gt; “Next week, Chinese factories are set to reopen after the extended Lunar New Year holiday, and important indicators to note will be to what extent the virus spreads as people resume travel back to work, and how long it takes for production to return to full capacity,” he wrote, adding he still likes emerging markets despite the potential hit on their economies.\n*****\n&gt; Economists expect the impact on the U.S. economy to be minimal, and say it should bounce back quickly.\n*****\n&gt; Thursday’s consumer price index and Friday’s retail sales, industrial production and consumer sentiment will be watched closely by economists. ISM manufacturing data was stronger than expected in the past week, ending a period of contraction that started during the trade war.\n*****\n&gt; The first quarter data has been providing a mixed picture of the economy, ahead of any impacts of the virus. Economists had been expecting manufacturing to get a boost after the trade deal, but Boeing’s production shut down and now the virus could muddy that picture.\n*****\n&gt; “I think there’s been a little bit of chicken little about the economy for awhile. It ebbs and flows,” said Arone, noting the Fed is the backstop if growth is choked. “Most of the indicators indicate the economy is going to chug along.”\n*****\n&gt; Powell testifies for two days before House and Senate committees on the state of the economy. Markets will be watching his comments closely to see what he has to say on the potential impact of the coronavirus. The markets have begun to price in more than one rate cut for this year, even though the Fed is not forecasting any.\n*****\n&gt; “With the strong jobs, I think it’s going to be more of the same. They raised the bar pretty high for them to signal any policy changes,” said John Roberts, U.S. rate strategist at NatWest Markets. “They mentioned the coronavirus already. We could get more insight into what they’re thinking about that. That’s the main thing we’re looking for.”\n*****\n&gt; China’s central bank has been adding stimulus, and that was seen as a booster for global stock markets in the past week.\n*****\n&gt; Capital Economics on Friday said it expects the coronavirus to cost the world economy $280 billion in the first quarter.\n*****\n&gt; “If we’re right, then this will mean that global GDP will not grow in [quarter over quarter] terms for the first time since 2009,” the economists wrote in a note. “We assume the virus will be contained soon, and that lost output is made up in subsequent quarters, so that world GDP reaches the level it would have done had there been no outbreak by the middle of 2021.”\n*****\n&gt; # Earnings Bonanza\n&gt; Better-than-expected earnings have helped stoke the market’s recent gains. There are dozens of earnings expected in the week ahead, including CVS Health Wednesday and Pepsi, Nvidia and Kraft Heinz Thursday.\n*****\n&gt; So far, more than 70% of companies are beating forecasts and profits are growing by 2.3%, when including both companies that have reported and those expected to report, according to Refinitiv. At the start of the earnings reporting period, earnings growth was expected to decline.\n*****\n&gt; Analysts will also look to companies to continue disclosing how the virus is impacting their operations. VF Corp, for instance, said 60% of its stores in China are now closed, and those that remain open have serous declines.\n*****\n&gt; # Playing Politics\n&gt; Vermont Sen. Bernie Sanders sent a shudder through markets when he began to rise in the polls ahead of Iowa’s caucuses. But the chaos in declaring a winner in Iowa this past week, leaves the Democratic field wide open. So New Hampshire’s primary Tuesday will also be important.\n*****\n&gt; The left-leaning Sanders is viewed as negative for the stock market, but his main rivals, Joseph Biden and now Pete Buttigieg, who seems to have led in Iowa, are both moderates. Sanders leads in the New Hampshire polls and is expected to win his neighboring state.\n*****\n&gt; “I think it’s going to continue to matter for quite some time, until we get clarity at least on who the Democratic candidate is going to be,” said Jon Hill, rates strategist at BMO. ”[Buttigieg] would be much more business friendly than some of the other candidates. Does that make him more or less electable? If he’s more that could be a market negative development.”\n*****\n&gt; The S&amp;P 500 has gained 55% since Donald Trump became president, and analysts say he is viewed by investors as having the best policies for the stock market. Some Democrats, particularly Sanders, would raise taxes sharply.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/qOqI74J.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/n8uJhuY.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/qSPsa54.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/yKvMhID.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/qFnHyJw.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/Zwtq6za.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/Crf7CiP.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/wSa5dB3.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/8e4snrC.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/O4BbZMh.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/4df33Zh.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/YwquWUG.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/nJe64uF.png))**\n\n*****\n\n# Week Before Presidents’ Day Bullish since 1990\n\n&gt; Page 100 of the Stock Trader’s Almanac 2020 points out Presidents’ Day as the poorest performing holiday of the eight holidays that are tracked. Unlike the others, the trading day before and the trading day after this three-day holiday weekend are both down on average over the past 40 years. However, the full week before the long holiday weekend has a bullish record. Since 1990 DJIA and S&amp;P 500 have advanced 20 times with average weekly gains of 0.66% and 0.48% respectively. NASDAQ has one additional weekly decline while Russell 2000 has been the strongest, up 23 times with an average gain of 0.79%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/87d4499ef13ff59956f4c6343e3c411e/5b2bbadb398d5a54-f0/s500x750/24f2f57a33d656e400f05e96ccd367ce42aa6af8.jpg))**\n\n*****\n\n# Strong Jobs Report to Begin 2020\n\n&gt; U.S. hiring came in stronger than expected in January, rebounding from a disappointing December print.\n\n&gt; Nonfarm payrolls rose by 225,000 in January, far surpassing Bloomberg’s consensus estimates for a 165,000 gain, according to the jobs report released today by the U.S. Bureau of Labor Statistics. This number may help alleviate some investor unease over December’s somewhat weak reading. We argued at the time that December’s reading likely was due in large part to calendar effects and the volatility of month-to-month changes. We prefer to base our views of the labor market’s vitality on the larger trend, which, has been undeniably strong, as shown in the LPL Chart of the Day.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/02/kciking-off-2020-with-a-strong-rebound.png?ssl=1))**\n\n&gt; Some investors have questioned how long hiring can remain elevated before we experience a worker shortage or a sharp rise in wages. The answer, according to this report, is not yet.\n\n&gt; In addition to the strong hiring numbers, workers also have enjoyed healthy wage gains. January saw average hourly earnings rise 3.1% year over year, a slight pickup from December, while average hours worked remained unchanged. “Today’s wage number exceeds inflation, meaning workers are growing their purchasing power in real terms and should be able to continue increasing their consumption of goods and services,” said LPL Financial Chief Investment Strategist John Lynch. “But the number is also lower than the 4% threshold that has historically signaled an overheating job market and potential for subsequent economic and market volatility. This is a very encouraging report.”\n\n&gt; The one slight blip in today’s release showed the unemployment rate inching 0.1% higher to 3.6%. This was mainly due to changes to the size of the labor force, which affected revisions. Still, given the extremely low unemployment level, the volatility of month-to-month numbers, and the overwhelmingly positive tone of the other data points released today, we feel confident about the prospects for the U.S. consumer to continue powering this economic expansion through 2020 and beyond.\n\n*****\n\n# New Highs Tilt Scales to Bulls\n\n&gt; China is cutting tariffs; the impeachment process has come to an end and the market is at new all-time highs. The coronavirus is still a concern, but apparently not as much as it was less than one week ago. Progress has been made. Official emergency declarations have mobilized a stronger response. China has quickly built additional hospitals and work is underway on a treatment. Gilead (GILD) appears to be the first to offer a potential cure although its drug remdesivir has not been approved to cure any disease yet. These recent developments along with solid earnings, have been the fuel to reverse the market’s late January retreat in just a few trading sessions this month.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/eb99cd5eedf67e83954c998976da3a81/8ea2bcc9db4c521e-49/s500x750/705cf31363591f72784f14fed6029effc84a4228.jpg))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/07db71096c88ddf9778d29d0bdb69e60/8ea2bcc9db4c521e-86/s500x750/e6f5479d3cea9759bc52d0c99fff7704947ff575.jpg))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/cdb9b967be268f1fcb154d09dfa8553b/8ea2bcc9db4c521e-2c/s500x750/4f3021be20791991f739de9273300f798a7cbf31.jpg))**\n\n&gt; In the above charts, the market’s strength since October can be seen along with second half of January weakness. DJIA, S&amp;P 500 and NASDAQ have remained comfortably above their respective 200-day moving averages since October. In January only DJIA actually (and briefly) closed below its even higher 50-day moving average. The market’s rebound surge in February has also reversed negative readings from Stochastic, relative strength and MACD indicators.\n\n&gt; Momentum clearly favors the bulls and January’s negative finish remains unconfirmed as of today. As long as economic data and corporate earnings remain positive then the market is likely to continue the trend that has been in place since last October, higher. There are likely to be some dips along the way with the next possible soft patch arriving when earnings season nears its end later this month and/or in the first half of March.\n\n*****\n\n# Typical February Trading: Tepid Month with Solid Mid-Month Rally\n\n&gt; February has historically been a rather bland month. Since 1950, S&amp;P 500 has averaged a measly 0.1%. Over the last 21-year period S&amp;P 500 average performance has declined to a loss of 0.4% in February. February’s first trading day has historically been good, like today, and trading days eight, nine, ten and eleven have offered repeatable long opportunities. Outside of these five days, the balance of February has been rather lacking.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/10b0e0be07d6824e6a082e13a26bc1d9/e1ddcea381248255-b9/s500x750/a2b1e806df3ec07b5e77c69efd297e5802fa1208.jpg))**\n\n*****\n\n# Does A Lower January Have Bears Smiling?\n\n&gt; Stocks got off to a nice start in 2020, until the late January selloff due to the coronavirus outbreak fears. In the end, the S&amp;P 500 Index fell only 0.2% for the month, but it did mark the end to a 4-month win streak. Should bulls worry about what a down January might mean for the rest of 2020?\n\n&gt; There’s an old adage on Wall Street that suggests, “As goes January, so goes the year.” This was first discussed in 1972 by Yale Hirsh of the Stock Trader’s Almanac, and it has an impressive track record. Simply put, when the first month of the year was green, it bodes well for the rest of the year (and vice versa). Given stocks closed red in January, how worried should investors be?\n\n&gt; As shown below in the LPL Chart of the Day, the numbers confirm that when the S&amp;P 500 has been green in January, the index has been up 11.9% on average over the rest of the year (final 11 months) and higher 86% of the time. However, when that first month was red, stocks rose only 1.2% on average over the final 11 months and were higher less than 60% of the time.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/02/so-goes-january-so-goes-the-year.png?ssl=1))**\n\n&gt; Another way to look at this data shows the average full year return based on if stocks are higher in January or not. As you can clearly see, stocks have tended to have trouble gaining any traction over the rest of the year after a January loss, while a green January has been quite strong.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/02/the-january-barometer.png?ssl=1)**\n\n&gt; It isn’t all bad news though. Remember the S&amp;P 500 was down only 0.2% in January, so one could argue that it was really flat. “Yes, a lower January is a potential worry for the bulls,” explained LPL Financial Senior Market Strategist Ryan Detrick. “But it is worth noting the previous 5 times (and 7 of 8) when stocks were lower in January, those final 11 months rallied. So this might not be the clear cut bearish signal so many think it is.”\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/02/a-lower-january-hasnt-been-as-bearish-lately.png?ssl=1))**\n\n*****\n\n# January Trifecta Spoiled by Coronavirus\n\n&gt; The market decline on the last day of January spoiled what would have been the fourth consecutive January Trifecta. S&amp;P 500 finished January down 0.2% and thus the January Barometer was negative.\n\n&gt; Devised by Yale Hirsch in 1972, the January Barometer has registered ten major errors since 1950 for an 85.7% accuracy ratio. This indicator adheres to propensity that as the S&amp;P 500 goes in January, so goes the year. Of the ten major errors Vietnam affected 1966 and 1968. 1982 saw the start of a major bull market in August. Two January rate cuts and 9/11 affected 2001.The market in January 2003 was held down by the anticipation of military action in Iraq. The second worst bear market since 1900 ended in March of 2009 and Federal Reserve intervention influenced 2010 and 2014. In 2016, DJIA slipped into an official Ned Davis bear market in January. Including the eight flat years yields a .743 batting average.\n\n&gt; This year’s combination of a positive Santa Claus Rally and First Five Days with a full-month January loss has only occurred eleven times (including this year) since 1950. In the previous ten occurrences S&amp;P 500 was down six times in February with an average loss of 1.5%. However, over the remaining 11 months of the year, S&amp;P 500 advanced 80% of the time with an average gain of 7.4%. Full-year performance was positive 70% of the time, but with an average gain of 2.9%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/6df473ecb7e9c5b9c107222c65f3131a/7be8cdb3803e5a29-77/s500x750/284bbb2175287530e6f02fc233a1772dce7a4852.jpg))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending February 7th, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED!)\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 2.9.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED!)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$BABA** \n&gt; * **$ROKU** \n&gt; * **$SHOP** \n&gt; * **$NVDA** \n&gt; * **$CVS** \n&gt; * **$CGC** \n&gt; * **$CSCO** \n&gt; * **$UAA** \n&gt; * **$QSR** \n&gt; * **$L** \n&gt; * **$AGN** \n&gt; * **$HAS** \n&gt; * **$LYFT** \n&gt; * **$TEVA** \n&gt; * **$AMAT** \n&gt; * **$MCY** \n&gt; * **$SAFE** \n&gt; * **$GBDC** \n&gt; * **$GOLD** \n&gt; * **$PEP** \n&gt; * **$DO** \n&gt; * **$KHC** \n&gt; * **$D** \n&gt; * **$CYBR**\n&gt; * **$MELI** \n&gt; * **$CHGG** \n&gt; * **$CNA** \n&gt; * **$EXAS** \n&gt; * **$GT** \n&gt; * **$HLT** \n&gt; * **$AYX** \n&gt; * **$AN** \n&gt; * **$APPS** \n&gt; * **$WM** \n&gt; * **$GPN** \n&gt; * **$CRNT** \n&gt; * **$BIP** \n&gt; * **$YETI** \n&gt; * **$MPAA** \n&gt; * **$LSCC** \n&gt; * **$RNG** \n&gt; * **$NMM** \n&gt; * **$JE**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 2.10.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Tvfxbnh.png))\n\n\n&gt; # ***Monday 2.10.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/DYTRi0w.png))\n\n\n*****\n\n&gt; # ***Tuesday 2.11.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/sWB49z5.png))\n\n&gt; # ***Tuesday 2.11.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/hiUR1ec.png))\n\n*****\n\n&gt; # ***Wednesday 2.12.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/w9FUjTz.png))\n\n&gt; # ***Wednesday 2.12.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/cPnIcpa.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/BBaSJcZ.png))\n\n*****\n\n&gt; # ***Thursday 2.13.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/tjUpFdY.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/D7eo9EG.png))\n\n&gt; # ***Thursday 2.13.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/Y4rdLiL.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/feUqB85.png))\n\n*****\n\n&gt; # ***Friday 2.14.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/TGxgQ96.png))\n\n*****\n\n&gt; # ***Friday 2.14.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/tC78cWW.png))\n\n*****\n\n# Alibaba Group Holding Ltd. $216.53\n&gt; **Alibaba Group Holding Ltd. (BABA)** is confirmed to report earnings at approximately 7:10 AM ET on Thursday, February 13, 2020. The consensus earnings estimate is $2.25 per share on revenue of $22.68 billion and the Earnings Whisper ® number is $2.35 per share. Investor sentiment going into the company's earnings release has 79% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 33.93% with revenue increasing by 32.97%. Short interest has increased by 52.7% since the company's last earnings release while the stock has drifted higher by 21.0% from its open following the earnings release to be 19.4% above its 200 day moving average of $181.36. Overall earnings estimates have been unchanged since the company's last earnings release. On Wednesday, January 29, 2020 there was some notable buying of 9,774 contracts of the $215.00 put expiring on Friday, March 20, 2020. Option traders are pricing in a 5.4% move on earnings and the stock has averaged a 2.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BABA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Roku Inc $124.25\n&gt; **Roku Inc (ROKU)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, February 13, 2020. The consensus estimate is for a loss of $0.14 per share on revenue of $392.43 million and the Earnings Whisper ® number is ($0.11) per share. Investor sentiment going into the company's earnings release has 70% expecting an earnings beat The company's guidance was for revenue of $380.00 million to $396.00 million. Consensus estimates are for earnings to decline year-over-year by 300.00% with revenue increasing by 42.32%. The stock has drifted higher by 4.6% from its open following the earnings release to be 3.1% above its 200 day moving average of $120.56. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, January 28, 2020 there was some notable buying of 8,443 contracts of the $115.00 put expiring on Friday, April 17, 2020. Option traders are pricing in a 14.7% move on earnings and the stock has averaged a 22.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ROKU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Shopify Inc. $478.69\n&gt; **Shopify Inc. (SHOP)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, February 12, 2020. The consensus earnings estimate is $0.23 per share on revenue of $481.99 million and the Earnings Whisper ® number is $0.30 per share. Investor sentiment going into the company's earnings release has 70% expecting an earnings beat The company's guidance was for revenue of $472.00 million to $482.00 million. Consensus estimates are for earnings to decline year-over-year by 8.00% with revenue increasing by 40.17%. Short interest has increased by 3.4% since the company's last earnings release while the stock has drifted higher by 56.4% from its open following the earnings release to be 41.2% above its 200 day moving average of $339.06. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, January 24, 2020 there was some notable buying of 1,017 contracts of the $470.00 put expiring on Friday, February 21, 2020. Option traders are pricing in a 9.7% move on earnings and the stock has averaged a 6.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SHOP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# NVIDIA Corp. $251.59\n&gt; **NVIDIA Corp. (NVDA)** is confirmed to report earnings at approximately 4:20 PM ET on Thursday, February 13, 2020. The consensus earnings estimate is $1.66 per share on revenue of $2.96 billion and the Earnings Whisper ® number is $1.73 per share. Investor sentiment going into the company's earnings release has 78% expecting an earnings beat The company's guidance was for earnings of $1.56 to $1.75 per share. Consensus estimates are for year-over-year earnings growth of 110.13% with revenue increasing by 34.24%. Short interest has decreased by 3.4% since the company's last earnings release while the stock has drifted higher by 20.0% from its open following the earnings release to be 33.8% above its 200 day moving average of $187.97. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, February 7, 2020 there was some notable buying of 2,222 contracts of the $320.00 call expiring on Friday, March 20, 2020. Option traders are pricing in a 6.8% move on earnings and the stock has averaged a 6.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NVDA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# CVS Health $71.56\n&gt; **CVS Health (CVS)** is confirmed to report earnings at approximately 6:30 AM ET on Wednesday, February 12, 2020. The consensus earnings estimate is $1.68 per share on revenue of $64.15 billion and the Earnings Whisper ® number is $1.74 per share. Investor sentiment going into the company's earnings release has 76% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 21.50% with revenue increasing by 17.87%. Short interest has decreased by 5.8% since the company's last earnings release while the stock has drifted higher by 3.1% from its open following the earnings release to be 13.0% above its 200 day moving average of $63.32. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, January 23, 2020 there was some notable buying of 2,522 contracts of the $66.00 put expiring on Friday, February 14, 2020. Option traders are pricing in a 5.4% move on earnings and the stock has averaged a 6.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CVS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Canopy Growth Corporation $19.63\n&gt; **Canopy Growth Corporation (CGC)** is confirmed to report earnings at approximately 6:30 AM ET on Friday, February 14, 2020. The consensus estimate is for a loss of $0.36 per share on revenue of $79.20 million and the Earnings Whisper ® number is ($0.43) per share. Investor sentiment going into the company's earnings release has 56% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 46.27% with revenue increasing by 26.02%. Short interest has increased by 17.7% since the company's last earnings release while the stock has drifted higher by 19.7% from its open following the earnings release to be 32.6% below its 200 day moving average of $29.13. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, January 29, 2020 there was some notable buying of 1,603 contracts of the $12.50 put expiring on Friday, March 20, 2020. Option traders are pricing in a 12.0% move on earnings and the stock has averaged a 13.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CGC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Cisco Systems, Inc. $47.97\n&gt; **Cisco Systems, Inc. (CSCO)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, February 12, 2020. The consensus earnings estimate is $0.76 per share on revenue of $11.99 billion and the Earnings Whisper ® number is $0.78 per share. Investor sentiment going into the company's earnings release has 71% expecting an earnings beat The company's guidance was for earnings of $0.75 to $0.77 per share. Consensus estimates are for year-over-year earnings growth of 2.70% with revenue decreasing by 3.66%. Short interest has decreased by 8.6% since the company's last earnings release while the stock has drifted higher by 5.3% from its open following the earnings release to be 4.4% below its 200 day moving average of $50.19. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, January 22, 2020 there was some notable buying of 4,630 contracts of the $30.00 put expiring on Friday, January 15, 2021. Option traders are pricing in a 5.1% move on earnings and the stock has averaged a 5.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CSCO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Under Armour, Inc. $20.25\n&gt; **Under Armour, Inc. (UAA)** is confirmed to report earnings at approximately 6:55 AM ET on Tuesday, February 11, 2020. The consensus earnings estimate is $0.10 per share on revenue of $1.47 billion and the Earnings Whisper ® number is $0.12 per share. Investor sentiment going into the company's earnings release has 53% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 11.11% with revenue increasing by 5.76%. Short interest has increased by 0.0% since the company's last earnings release while the stock has drifted higher by 13.6% from its open following the earnings release to be 5.8% below its 200 day moving average of $21.49. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, February 3, 2020 there was some notable buying of 1,205 contracts of the $20.00 put expiring on Friday, February 14, 2020. Option traders are pricing in a 12.8% move on earnings and the stock has averaged a 12.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=UAA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Restaurant Brands International Inc. $63.86\n&gt; **Restaurant Brands International Inc. (QSR)** is confirmed to report earnings at approximately 6:30 AM ET on Monday, February 10, 2020. The consensus earnings estimate is $0.73 per share on revenue of $1.46 billion. Investor sentiment going into the company's earnings release has 58% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 7.35% with revenue increasing by 5.42%. The stock has drifted lower by 4.6% from its open following the earnings release to be 7.2% below its 200 day moving average of $68.78. Overall earnings estimates have been unchanged since the company's last earnings release. Option traders are pricing in a 5.5% move on earnings and the stock has averaged a 2.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=QSR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Loews Corp $53.25\n&gt; **Loews Corp (L)** is confirmed to report earnings at approximately 6:00 AM ET on Monday, February 10, 2020. The consensus earnings estimate is $0.72 per share. Investor sentiment going into the company's earnings release has 14% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 100.00% with revenue decreasing by 69.61%. Short interest has increased by 37.8% since the company's last earnings release while the stock has drifted higher by 5.7% from its open following the earnings release to be 3.9% above its 200 day moving average of $51.23. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, January 24, 2020 there was some notable buying of 602 contracts of the $50.00 put expiring on Friday, March 20, 2020. Option traders are pricing in a 9.3% move on earnings and the stock has averaged a 3.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=L&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/stocks.",
        "subreddit": "stocks",
        "title": "Wall Street Week Ahead for the trading week beginning February 10th, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/f0svfy/wall_street_week_ahead_for_the_trading_week/",
        "created": 1581203875.0
    }
]