[
    {
        "author": "jackabood",
        "created_utc": 1579264506,
        "id": "epzt2y",
        "num_comments": 44,
        "num_crossposts": 0,
        "selftext": "i was sitting on money for years just collecting dust and but lately i opened a brokerage account and decided to just wing it lol. i invested around $14,000 on AMD, MSFT, MAIN, BABA, XLK and SWKS. i put it another $14,000 in ARAMCO IPO  thru some random brokerage. i still have around $50,000 that i want to invest as well. i'm 25 and make around $37,000 a year doing a job i hate. i really wanna set myself to leave my job and do a job i love without worrying too much about the finance. what do u guys recommend i do with the 50k i can invest?",
        "subreddit": "stocks",
        "title": "i want to invest some of my saving $80,000 but i don't know what to invest it on.",
        "url": "https://www.reddit.com/r/stocks/comments/epzt2y/i_want_to_invest_some_of_my_saving_80000_but_i/",
        "created": 1579293306.0
    },
    {
        "author": "brosephjones77",
        "created_utc": 1578953858,
        "id": "eobepp",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "Here is estimate of money I want to invest in each stock:\n\nSTOCKS-\n——————————————\n\nVerizon (VZ)- $600\n\nVisa (V)- $800\n\nApple (AAPL)- $1,500\n\nAmazon (AMZN) - $1,900\n\nMicrosoft (MSFT)- $4,000\n\nTesla (TSLA)- $1,500\n\nAbbievie (ABBV)- $500\n\nChase (JPM)- $1,000\n\nSkyworks (SWKS) - $500\n\nCRISPR (CRSP) - $500\n\nNvidia (NVDA) - $750\n\nAlphabet (GOOGL)- $1,400\n\n——————————————\n\nTotal Cost ~ $15,000\n\nGood choices? What would be the best way to cut $3000 from this list? I only have $12,000 to invest",
        "subreddit": "stocks",
        "title": "How should I cut $3000 from this list!",
        "url": "https://www.reddit.com/r/stocks/comments/eobepp/how_should_i_cut_3000_from_this_list/",
        "created": 1578982658.0
    },
    {
        "author": "Speedevee",
        "created_utc": 1579146817,
        "id": "epduo7",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "I actually like Jeremy from Financial Education. A lot of people hate him because he’s loud, cringy, and has click baity thumbnails, but I think he’s a real good investor. Sure he has some big losses like go pro, but he also had some big gains like Tesla and Skyworks solution. He actually made 90% gains last year and his normal gains are 20-30% a year. He pushes his expensive stock market course which I never tried and probably never will try, but his YouTube channel is worth a follow. He’s a student of Warren Buffet with an emphasis on more modern stocks, that actually makes long term investing interesting. A feat that is difficult because the standard advice is dollar cost average into the S&amp;P 500 or Vangaurd Total Stock Market index. I’ve been following him for over 2 years and made 60% gains last year.",
        "subreddit": "investing",
        "title": "Unpopular opinion: Financial Education is actually good",
        "url": "https://www.reddit.com/r/investing/comments/epduo7/unpopular_opinion_financial_education_is_actually/",
        "created": 1579175617.0
    },
    {
        "author": "DatFapnNap",
        "created_utc": 1578619825,
        "id": "emjmrv",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "  Alright you Autist,\n\nI'm back to lose more tendies with the homies.\n\nI wanted to write a follow-up to my previous post and show you the gains strategy, still waiting on losses (I’m sure they’re coming, like your mother in law, totally unexpected for dinner). First, some of you need Jesus...swear da bear gang lit a bag of bearshit on my porch last night, I seent it. Secondly, thanks to all who commented, questioned me, and made me better with knowledge; yall the real MVP’s u/webulltrade and u /chodmode2.\n\nSo, join me on my trip to Wendy’s for dat baconator (large combo now) while counting our tendies in our cybertrucks.\n\n**Previous post:** [https://www.reddit.com/r/wallstreetbets/comments/em4qnr/autist\\_trading\\_with\\_rsi\\_macd\\_and\\_gap/?utm\\_source=share&amp;utm\\_medium=web2x](https://www.reddit.com/r/wallstreetbets/comments/em4qnr/autist_trading_with_rsi_macd_and_gap/?utm_source=share&amp;utm_medium=web2x)\n\n&amp;#x200B;\n\n**Today | 09 Jan 2020**\n\n\\- Stock of Choice: Skyworks (SWKS)\n\n\\- Chart Setting: 5 Minutes (That’s 4.5 more minutes than I need…wife hates it \\*fml\\*)\n\n\\- Why – Noticed it was on a down trend the last few days by eyeballing the chart. It has decent volume so some bull gang will pay for the difference since this stock swings $2-3 on a given day.\n\nNow does it match my “three stars align” bullshit from my previous post? Wrote that shit when I was high and listening to Joe Rogan’s Bob Lazar podcast. Where do aliens get their lights from for their craft? Autozone??? Dat free diagnostics nawimsayin.\n\n&amp;#x200B;\n\n**In order that I looked:**\n\n**GAP:**\n\nI’m sitting here pre-market with SWKS up on my screen, eating cold pizza from last night (talk about all thunder no lightning gut rumbles all day), and see this beauty happen at market open:\n\nBaby got Gap: [https://imgur.com/a/WShOETr](https://imgur.com/a/WShOETr) \n\nThis told me to watch this stock today. (Also backed up by good volume.\n\n&amp;#x200B;\n\n**RSI 250 Day:**\n\nSo, what’s next? I wanted to see the overall nature of the stock, so 250’d the shit out of it and can see it says “fuck the bears”\n\nBear hating proof: [https://imgur.com/a/EC7PTG2](https://imgur.com/a/EC7PTG2) \n\nThis is a good sign (gamble) it’s going to go up in the short and long term, like my cholesterol, fucking wendys.\n\n&amp;#x200B;\n\n**RSI 10 &amp; MacDaddy (MACD):**\n\nThis was harder than watching Cats all the way through (punishment for my lack of 4.5 minutes as stated above). Probably the best 30 seconds of her life though.\n\nMight as well speak Latin to you autist: [https://imgur.com/a/cOhYQ2r](https://imgur.com/a/cOhYQ2r) \n\nActually, it’s not that bad:\n\n1. Look at your indicators after the gap up/down \n\n2. Start looking for your entry point for a call or put (I recommend call, “unlimited upside potential” – Wolf of Wallstreet dude\n\n3. Keep “watching” for a good point\n\n4. Execute when shit starts aligning (RSI 10/ MacDaddy/250) (250 is more “overall”)\n\n5. Watch for your exit point\n\n6. Take a chance\n\n7. Lock in Profit\n\n&amp;#x200B;\n\nHopefully this is making more sense, I did the same thing with AMD yesterday and made a 30% gain.\n\nHere’s my proof for SWKS gain using this method today. Yes, I’m a cheap bastard and ain’t ready to YOLO until I’m 10/10 on this strategy. \n\n“Standing here saying Fuck the ~~free world~~ bear gang”: [https://imgur.com/a/sFVoAzd](https://imgur.com/a/sFVoAzd) \n\nIght gents, time for my fap and nap, peace out bitches.\n\n&amp;#x200B;\n\n**Parting words of wisdom:**\n\n\\- Stonks only go up\n\n\\- If you can’t dazzle em’ with your brilliance, baffle em’ with your bullshit\n\n\\- Good luck – use at your own risk\n\n\\- Listen to me if you want, I’m posting on WSB’s for christs sake\n\n\\- Shit with the shower on\n\n&amp;#x200B;\n\nWhat I'm looking at Tomorrow?\n\nNFLX - Nice change today (tendies wise) - good chance for a short call play (or put...fucking bears). Wait for the morning dip to buy that shit, 10-11am ET. Profit and buy Fap-n-Nap a seat cover for his cybertruck and Wendy's chili addiction.\n\nLuv,\n\nFap-n-Nap",
        "subreddit": "wallstreetbets",
        "title": "Autist RCI/MacDaddy/GAP Follow-Up: Instructions unclear, bought Enron",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/emjmrv/autist_rcimacdaddygap_followup_instructions/",
        "created": 1578648625.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1579872358,
        "id": "etadlk",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/wallstreetbets sub! Happy Friday to all! Here are your pre-market mover &amp; news this AM-\n\n*****\n\n#[Today's Top Headlines for Friday, January 24th, 2020](https://www.cnbc.com/2020/01/24/coronavirus-closes-shanghai-disney-tech-layoffs-and-stumpf-ban.html)\n\n* U.S. stock futures are pointing to a higher open ahead of the Friday session, with the final disposition of the holiday-shortened trading week still to be determined. The Dow is currently on track to post a losing week, its second in four weeks, while the Nasdaq is likely to rise for the seventh week in a row after a record close Thursday. The S&amp;P 500 is just below breakeven for the week, and would post its eighth weekly gain in since weeks if it can erase that deficit. (CNBC)\nAmerican Express (AXP), a Dow component, releases earnings before today’s opening bell. No major earnings reports are scheduled after today’s closing bell, and no economic reports out today. (CNBC)\n* Dow stock Intel (INTC) was rising 5% in premarket trading after the chipmaker reported better-than-expected adjusted quarterly profit and revenue after the bell Thursday. Results were helped by improvement in personal computer and data center demand, and Intel also gave an upbeat current quarter outlook as well as announcing a 5% dividend increase. (CNBC)\n* A large broadcast satellite, owned by AT&amp;T’s (T) DirecTV, built by Boeing (BA) and operated by Intelsat (I), suffered major damage to its batteries in December and is now at risk of exploding. The satellite is notably several years beyond its intended lifespan. (CNBC)\n* Boeing reschedules 777X plane’s first test flight for today (Reuters)\n* China’s National Health Commission said as many as 26 people have died from a fast-spreading coronavirus, as the total number of confirmed cases in the country rose to 830. Multiple cases of the virus have been confirmed in Thailand, Vietnam, South Korea and Japan, while the United States, Taiwan and Singapore have each reported one case. China has extended its travel ban to 13 cities, covering 35 million people. (CNBC &amp; NY Times)\n* CDC: Level 3 health warning for coronavirus; State Department: Level 2 travel advisory (CNBC)\n* China to build 1000-bed hospital over weekend (Reuters)\n* Social controls, SARS experience help China close off cities (AP)\n* Walt Disney’s (DIS) Shanghai Disney Resort will be closed until further notice to help China stop the spread of the flu-like virus, costing the theme park operator revenue during the country’s biggest holiday season. China is on a seven-day Lunar New Year holiday, a period when the Shanghai Disney park would be usually packed with tourists. (Reuters)\n* The World Economic Forum is wrapping up today in Davos, Switzerland. A Hong Kong property developer said the U.S. chose the wrong decade to start a trade conflict with China. “They should have picked the war 10 years ago,” said David Chiu, chairman of Far East Consortium International. (CNBC)\n* George Soros rips Trump and Xi, says the ‘fate of the world’ is at stake in 2020 (CNBC)\n* Soros says Xi is the ‘most dangerous’ opponent of those who believe in open society (CNBC)\n* Soros warns Trump of potential economic doom before election (CNBC)\n* Soros says Elizabeth Warren ’is the most qualified to be president’ (CNBC)\n* Democrats will press their final day of arguments today before skeptical Republican senators at President Trump’s impeachment trail, focusing on the second article of impeachment, obstruction of Congress’ investigation. House prosecutors made an expansive case yesterday that he abused power like no other president in history, swept up by a “completely bogus” Ukraine theory pushed by attorney Rudy Giuliani. (AP)\n* Former VP Joe Biden leads other candidates for the Democratic presidential nomination, while several others appeared to be gaining momentum in their bid for the White House, according to a Reuters/Ipsos national opinion poll. The online poll showed that 24% of registered Democrats and independents supported Biden, while 20% backed U.S. Senator Bernie Sanders and 12% said they would vote for U.S. Senator Elizabeth Warren.\n* The Trump administration is set to release a report today that outlines its short-term and long-term plans for enlisting e-commerce companies to combat counterfeit products on their platforms. The Wall Street Journal reported that law enforcement will begin identifying cases immediately and “seek all available statutory authorities to pursue civil fines and other penalties against these entities.”\n* J.P. Morgan Chase (JPM) CEO Jamie Dimon got a 1.6% raise to $31.5 million for his work in 2019 after his bank posted record earnings and shares of the company surged. Dimon’s compensation package includes $1.5 million in salary and $30 million in performance-based incentives. (CNBC)\n* The U.S. government announced that former Wells Fargo CEO John Stumpf has been banned from ever working at a bank again and will pay $17.5 million for scandals in which millions of fake accounts were set up to meet sales quotas. Regulators plans to target other individuals, including former executives, for their role in the scandals. (CNBC)\n* Home DNA-testing company 23andMe is laying off about 100 people, or 14% of its staff, on Thursday, in the wake of declining sales. The company plans to tighten its focus on the * DTC business and its therapeutics arm while scaling back its clinical studies arm. Additionally, TripAdvisor is planning to cut 200 jobs, or 5% of its total workforce. (CNBC)\n* Jim Lehrer, co-host and later host of the nightly PBS “NewsHour” that for decades offered a thoughtful take on current events, has died. He was 85. Lehrer died “peacefully in his sleep,” according to PBS. He had suffered a heart attack in 1983 and more recently, had undergone heart valve surgery in April 2008. (AP)\n\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](http://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://finviz.com/publish/012420/sec_all_075225549.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/WVNuazs.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/qC4OLxU.png)**)\n\n*****\n\n#NEXT WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR NEXT WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/mbOqHih.png)**)\n\n*****\n\n#NEXT WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR NEXT WEEK'S UPCOMING IPO'S!](https://i.imgur.com/ueyg2Ui.png)**)\n\n*****\n\n#NEXT WEEK'S EARNINGS CALENDAR:\n######(**[CLICK HERE FOR NEXT WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/bAJoxEr.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n*($AXP $NEE $ERIC $SYF $NEP $APD $SNV $HRC $IBKC $MOG.A $SIFY $SPFI $ESXB)*\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/tgxTcfa.jpg)**)\n\n*****\n\n#THIS AFTERNOON'S POST-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS CALENDAR!]()**)\nNONE.\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/XIw1nDI.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!]()**)\nNONE.\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/I3J14LQ.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/c5LUfh9.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/lIGsxQh.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S UPGRADES/DOWNGRADES LINK #4!](https://i.imgur.com/CHrTWnJ.png)**)\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/ElgfPhM.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!](https://i.imgur.com/7ndTlZ0.png)**)\n\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS:\n\n* DIS\n* INTC\n* AXP\n* EPZM\n* NNVC\n* CVM\n* NEE\n* SYF\n* BLDP\n* ERIC\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2020/01/24/stocks-making-the-biggest-moves-premarket-intel-american-express-disney-broadcom-more.html)**)\n\n*****\n\n&gt; **American Express (AXP)** – American Express reported quarterly earnings of $2.03 per share, 2 cents a share above estimates. Revenue was slightly above consensus. The financial services giant said revenue growth during 2019 was driven by higher card fee income as well as increased spending by cardholders.\n\n&gt; #**STOCK SYMBOL:** AXP\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AXP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AXP)**)\n\n*****\n\n&gt; **Intel (INTC)** – Intel reported quarterly profit of $1.52 per share, beating the consensus estimate of $1.25. The chipmaker’s revenue also exceeded Wall Street forecasts, helped by an improvement in personal computer and data center demand. Intel also gave an upbeat current-quarter outlook, as well as announcing a 5% dividend increase.\n\n&gt; #**STOCK SYMBOL:** INTC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=INTC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/INTC)**)\n\n*****\n\n&gt; **Walt Disney (DIS)** – The Shanghai Disney resort will close until further notice, as officials try to stop the spread of the coronavirus. The closure comes during China’s seven-day Lunar New Year holiday, normally an extremely busy time for the resort.\n\n&gt; #**STOCK SYMBOL:** DIS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DIS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DIS)**)\n\n*****\n\n&gt; **Ericsson (ERIC)** – Ericsson posted a smaller-than-expected profit for the fourth quarter, with the Swedish telecom equipment maker hit by higher costs for 5G development as well as a weaker U.S. market.\n\n&gt; #**STOCK SYMBOL:** ERIC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ERIC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ERIC)**)\n\n*****\n\n&gt; **Broadcom (AVGO)** – Broadcom struck a deal to supply Apple (AAPL) with wireless components for Apple products through 2023, in a transaction worth an estimated $15 billion. Apple currently accounts for about 20% of Broadcom’s annual revenue.\n\n&gt; #**STOCK SYMBOL:** AVGO\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AVGO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AVGO)**)\n\n*****\n\n&gt; **Skyworks Solutions (SWKS)** – Skyworks shares are under pressure following the news that competitor Broadcom signed an Apple supply deal. Skyworks reported better-than-expected quarterly profit of $1.68 per share, 3 cents a share above estimates. Revenue also came in above forecasts.\n\n&gt; #**STOCK SYMBOL:** SWKS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SWKS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SWKS)**)\n\n*****\n\n&gt; **Intuitive Surgical (ISRG)** – Intuitive Surgical beat estimates by 10 cents a share, with adjusted quarterly earnings of $3.48 per share. The surgical instruments maker’s revenue also came in above Wall Street projections. Procedures performed with the company’s Da Vinci robotic surgical devices increased by 19% during the quarter compared to a year earlier.\n\n&gt; #**STOCK SYMBOL:** ISRG\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ISRG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ISRG)**)\n\n*****\n\n&gt; **E*Trade Financial (ETFC)** – E*Trade earned an adjusted 84 cents per share for the fourth quarter, a penny a share above estimates. Revenue also came in above consensus. The bottom line number excludes 8 cents a share of negative impact from restructuring and special charges. The online brokerage company saw a drop in net interest income and higher non-interest expenses but also reported record customer trading activity.\n\n&gt; #**STOCK SYMBOL:** ETFC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ETFC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ETFC)**)\n\n*****\n\n&gt; **Discover Financial (DFS)** – Discover came in a penny a share above estimates, with quarterly earnings of $2.25 per share. Revenue was essentially in line with forecasts. Evercore downgraded the credit card and financial services provider to “underperform” from “in line” following the report, saying it sees pressure on Discover’s bottom line this year from higher investments, increased credit costs, and fewer buybacks.\n\n&gt; #**STOCK SYMBOL:** DFS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DFS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DFS)**)\n\n*****\n\n&gt; **Generac (GNRC)** – Oppenheimer upgraded the maker of power generators to “outperform” from “perform,” based on expectations of solid revenue growth. Oppenheimer points to the emergence of the California market for Generac, as well as sustained strength in core demand fundamentals.\n\n&gt; #**STOCK SYMBOL:** GNRC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=GNRC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/GNRC)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/wallstreetbets?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Friday, January 24th, 2020! :)**",
        "subreddit": "wallstreetbets",
        "title": "Today's Pre-Market Movers &amp; News [Friday, January 24th, 2020]",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/etadlk/todays_premarket_movers_news_friday_january_24th/",
        "created": 1579901158.0
    },
    {
        "author": "oranguthang87",
        "created_utc": 1578664950,
        "id": "emrb0m",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": " \n\n## Today 8:37 AM ET (Benzinga)Print\n\n* Jefferies boosted the price target on **Microsoft Corporation** (NASDAQ: MSFT) from $160 to $185. Microsoft closed at $162.09 on Thursday.\n* Piper Sandler lowered the price target on **Aurora Cannabis Inc** (NYSE: ACB) from $3 to $1. Aurora Cannabis closed at $1.86 on Thursday.\n* KeyBanc lifted **Autodesk, Inc.** (NASDAQ: ADSK) price target from $191 to $210. Autodesk shares closed at $191.94 on Thursday.\n* Mizuho raised the price target for **Skyworks Solutions Inc** (NASDAQ: SWKS) from $90 to $132. Skyworks shares closed at $119.65 on Thursday.\n* Oppenheimer lowered the price target for **Portola Pharmaceuticals Inc** (NASDAQ: PTLA) from $40 to $17. Portola Pharmaceuticals closed at $24.74 on Thursday.\n* Keefe, Bruyette &amp; Woods cut **Travelers Companies Inc** (NYSE: TRV) price target from $144 to $125. Travelers shares closed at $137.62 on Thursday.\n* Susquehanna cut the price target for **Foot Locker, Inc.** (NYSE: FL) from $47 to $41. Foot Locker shares closed at $38.54 on Thursday.\n* KeyBanc cut the price target for **RealPage Inc** (NASDAQ: RP) from $72 to $67. RealPage shares closed at $55.22 on Thursday.\n* Jefferies cut **Dropbox Inc** (NASDAQ: DBX) price target from $28 to $19. Dropbox closed at $18.37 on Thursday.\n* Piper Sandler boosted the price target for **Tesla Inc** (NASDAQ: TSLA) from $423 to $553. Tesla shares closed at $481.34 on Thursday.",
        "subreddit": "wallstreetbets",
        "title": "Price Target Changes for Friday",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/emrb0m/price_target_changes_for_friday/",
        "created": 1578693750.0
    },
    {
        "author": "Speedevee",
        "created_utc": 1579147781,
        "id": "epe1mt",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "I actually like Jeremy from Financial Education. A lot of people hate him because he’s loud, cringy, and has click baity thumbnails, but I think he’s a real good investor. Sure he has some big losses like go pro, but he also had some big gains like Tesla and Skyworks solution. He actually made 90% gains last year and his normal gains are 20-30% a year. He pushes his expensive stock market course which I never tried and probably never will try, but his YouTube channel is worth a follow. He’s a student of Warren Buffet with an emphasis on more modern stocks, that actually makes long term investing interesting. A feat that is difficult because the standard advice is dollar cost average into the S&amp;P 500 or Vangaurd Total Stock Market index. I’ve been following him for over 2 years and made 60% gains last year.",
        "subreddit": "stocks",
        "title": "Unpopular Opinion: Financial Education actually has some good stock advice",
        "url": "https://www.reddit.com/r/stocks/comments/epe1mt/unpopular_opinion_financial_education_actually/",
        "created": 1579176581.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1579872101,
        "id": "etabwz",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/StockMarket sub! Happy Friday to all! Here are your pre-market mover &amp; news this AM-\n\n*****\n\n#(**[CLICK HERE TO VIEW THE FULL SOURCE!](https://www.stockaholics.net/threads/todays-pre-market-movers-news-friday-january-24th-2002.9382/)**)\n\n#[Today's Top Headlines for Friday, January 24th, 2020](https://www.cnbc.com/2020/01/24/coronavirus-closes-shanghai-disney-tech-layoffs-and-stumpf-ban.html)\n\n* U.S. stock futures are pointing to a higher open ahead of the Friday session, with the final disposition of the holiday-shortened trading week still to be determined. The Dow is currently on track to post a losing week, its second in four weeks, while the Nasdaq is likely to rise for the seventh week in a row after a record close Thursday. The S&amp;P 500 is just below breakeven for the week, and would post its eighth weekly gain in since weeks if it can erase that deficit. (CNBC)\nAmerican Express (AXP), a Dow component, releases earnings before today’s opening bell. No major earnings reports are scheduled after today’s closing bell, and no economic reports out today. (CNBC)\n* Dow stock Intel (INTC) was rising 5% in premarket trading after the chipmaker reported better-than-expected adjusted quarterly profit and revenue after the bell Thursday. Results were helped by improvement in personal computer and data center demand, and Intel also gave an upbeat current quarter outlook as well as announcing a 5% dividend increase. (CNBC)\n* A large broadcast satellite, owned by AT&amp;T’s (T) DirecTV, built by Boeing (BA) and operated by Intelsat (I), suffered major damage to its batteries in December and is now at risk of exploding. The satellite is notably several years beyond its intended lifespan. (CNBC)\n* Boeing reschedules 777X plane’s first test flight for today (Reuters)\n* China’s National Health Commission said as many as 26 people have died from a fast-spreading coronavirus, as the total number of confirmed cases in the country rose to 830. Multiple cases of the virus have been confirmed in Thailand, Vietnam, South Korea and Japan, while the United States, Taiwan and Singapore have each reported one case. China has extended its travel ban to 13 cities, covering 35 million people. (CNBC &amp; NY Times)\n* CDC: Level 3 health warning for coronavirus; State Department: Level 2 travel advisory (CNBC)\n* China to build 1000-bed hospital over weekend (Reuters)\n* Social controls, SARS experience help China close off cities (AP)\n* Walt Disney’s (DIS) Shanghai Disney Resort will be closed until further notice to help China stop the spread of the flu-like virus, costing the theme park operator revenue during the country’s biggest holiday season. China is on a seven-day Lunar New Year holiday, a period when the Shanghai Disney park would be usually packed with tourists. (Reuters)\n* The World Economic Forum is wrapping up today in Davos, Switzerland. A Hong Kong property developer said the U.S. chose the wrong decade to start a trade conflict with China. “They should have picked the war 10 years ago,” said David Chiu, chairman of Far East Consortium International. (CNBC)\n* George Soros rips Trump and Xi, says the ‘fate of the world’ is at stake in 2020 (CNBC)\n* Soros says Xi is the ‘most dangerous’ opponent of those who believe in open society (CNBC)\n* Soros warns Trump of potential economic doom before election (CNBC)\n* Soros says Elizabeth Warren ’is the most qualified to be president’ (CNBC)\n* Democrats will press their final day of arguments today before skeptical Republican senators at President Trump’s impeachment trail, focusing on the second article of impeachment, obstruction of Congress’ investigation. House prosecutors made an expansive case yesterday that he abused power like no other president in history, swept up by a “completely bogus” Ukraine theory pushed by attorney Rudy Giuliani. (AP)\n* Former VP Joe Biden leads other candidates for the Democratic presidential nomination, while several others appeared to be gaining momentum in their bid for the White House, according to a Reuters/Ipsos national opinion poll. The online poll showed that 24% of registered Democrats and independents supported Biden, while 20% backed U.S. Senator Bernie Sanders and 12% said they would vote for U.S. Senator Elizabeth Warren.\n* The Trump administration is set to release a report today that outlines its short-term and long-term plans for enlisting e-commerce companies to combat counterfeit products on their platforms. The Wall Street Journal reported that law enforcement will begin identifying cases immediately and “seek all available statutory authorities to pursue civil fines and other penalties against these entities.”\n* J.P. Morgan Chase (JPM) CEO Jamie Dimon got a 1.6% raise to $31.5 million for his work in 2019 after his bank posted record earnings and shares of the company surged. Dimon’s compensation package includes $1.5 million in salary and $30 million in performance-based incentives. (CNBC)\n* The U.S. government announced that former Wells Fargo CEO John Stumpf has been banned from ever working at a bank again and will pay $17.5 million for scandals in which millions of fake accounts were set up to meet sales quotas. Regulators plans to target other individuals, including former executives, for their role in the scandals. (CNBC)\n* Home DNA-testing company 23andMe is laying off about 100 people, or 14% of its staff, on Thursday, in the wake of declining sales. The company plans to tighten its focus on the * DTC business and its therapeutics arm while scaling back its clinical studies arm. Additionally, TripAdvisor is planning to cut 200 jobs, or 5% of its total workforce. (CNBC)\n* Jim Lehrer, co-host and later host of the nightly PBS “NewsHour” that for decades offered a thoughtful take on current events, has died. He was 85. Lehrer died “peacefully in his sleep,” according to PBS. He had suffered a heart attack in 1983 and more recently, had undergone heart valve surgery in April 2008. (AP)\n\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](http://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://finviz.com/publish/012420/sec_all_075225549.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/WVNuazs.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/qC4OLxU.png)**)\n\n*****\n\n#NEXT WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR NEXT WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/mbOqHih.png)**)\n\n*****\n\n#NEXT WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR NEXT WEEK'S UPCOMING IPO'S!](https://i.imgur.com/ueyg2Ui.png)**)\n\n*****\n\n#NEXT WEEK'S EARNINGS CALENDAR:\n######(**[CLICK HERE FOR NEXT WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/bAJoxEr.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n*($AXP $NEE $ERIC $SYF $NEP $APD $SNV $HRC $IBKC $MOG.A $SIFY $SPFI $ESXB)*\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/tgxTcfa.jpg)**)\n\n*****\n\n#THIS AFTERNOON'S POST-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS CALENDAR!]()**)\nNONE.\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/XIw1nDI.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!]()**)\nNONE.\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/I3J14LQ.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/c5LUfh9.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/lIGsxQh.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S UPGRADES/DOWNGRADES LINK #4!](https://i.imgur.com/CHrTWnJ.png)**)\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/ElgfPhM.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!](https://i.imgur.com/7ndTlZ0.png)**)\n\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS:\n\n* DIS\n* INTC\n* AXP\n* EPZM\n* NNVC\n* CVM\n* NEE\n* SYF\n* BLDP\n* ERIC\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2020/01/24/stocks-making-the-biggest-moves-premarket-intel-american-express-disney-broadcom-more.html)**)\n\n*****\n\n&gt; **American Express (AXP)** – American Express reported quarterly earnings of $2.03 per share, 2 cents a share above estimates. Revenue was slightly above consensus. The financial services giant said revenue growth during 2019 was driven by higher card fee income as well as increased spending by cardholders.\n\n&gt; #**STOCK SYMBOL:** AXP\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AXP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AXP)**)\n\n*****\n\n&gt; **Intel (INTC)** – Intel reported quarterly profit of $1.52 per share, beating the consensus estimate of $1.25. The chipmaker’s revenue also exceeded Wall Street forecasts, helped by an improvement in personal computer and data center demand. Intel also gave an upbeat current-quarter outlook, as well as announcing a 5% dividend increase.\n\n&gt; #**STOCK SYMBOL:** INTC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=INTC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/INTC)**)\n\n*****\n\n&gt; **Walt Disney (DIS)** – The Shanghai Disney resort will close until further notice, as officials try to stop the spread of the coronavirus. The closure comes during China’s seven-day Lunar New Year holiday, normally an extremely busy time for the resort.\n\n&gt; #**STOCK SYMBOL:** DIS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DIS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DIS)**)\n\n*****\n\n&gt; **Ericsson (ERIC)** – Ericsson posted a smaller-than-expected profit for the fourth quarter, with the Swedish telecom equipment maker hit by higher costs for 5G development as well as a weaker U.S. market.\n\n&gt; #**STOCK SYMBOL:** ERIC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ERIC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ERIC)**)\n\n*****\n\n&gt; **Broadcom (AVGO)** – Broadcom struck a deal to supply Apple (AAPL) with wireless components for Apple products through 2023, in a transaction worth an estimated $15 billion. Apple currently accounts for about 20% of Broadcom’s annual revenue.\n\n&gt; #**STOCK SYMBOL:** AVGO\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AVGO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AVGO)**)\n\n*****\n\n&gt; **Skyworks Solutions (SWKS)** – Skyworks shares are under pressure following the news that competitor Broadcom signed an Apple supply deal. Skyworks reported better-than-expected quarterly profit of $1.68 per share, 3 cents a share above estimates. Revenue also came in above forecasts.\n\n&gt; #**STOCK SYMBOL:** SWKS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SWKS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SWKS)**)\n\n*****\n\n&gt; **Intuitive Surgical (ISRG)** – Intuitive Surgical beat estimates by 10 cents a share, with adjusted quarterly earnings of $3.48 per share. The surgical instruments maker’s revenue also came in above Wall Street projections. Procedures performed with the company’s Da Vinci robotic surgical devices increased by 19% during the quarter compared to a year earlier.\n\n&gt; #**STOCK SYMBOL:** ISRG\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ISRG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ISRG)**)\n\n*****\n\n&gt; **E*Trade Financial (ETFC)** – E*Trade earned an adjusted 84 cents per share for the fourth quarter, a penny a share above estimates. Revenue also came in above consensus. The bottom line number excludes 8 cents a share of negative impact from restructuring and special charges. The online brokerage company saw a drop in net interest income and higher non-interest expenses but also reported record customer trading activity.\n\n&gt; #**STOCK SYMBOL:** ETFC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ETFC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ETFC)**)\n\n*****\n\n&gt; **Discover Financial (DFS)** – Discover came in a penny a share above estimates, with quarterly earnings of $2.25 per share. Revenue was essentially in line with forecasts. Evercore downgraded the credit card and financial services provider to “underperform” from “in line” following the report, saying it sees pressure on Discover’s bottom line this year from higher investments, increased credit costs, and fewer buybacks.\n\n&gt; #**STOCK SYMBOL:** DFS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DFS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DFS)**)\n\n*****\n\n&gt; **Generac (GNRC)** – Oppenheimer upgraded the maker of power generators to “outperform” from “perform,” based on expectations of solid revenue growth. Oppenheimer points to the emergence of the California market for Generac, as well as sustained strength in core demand fundamentals.\n\n&gt; #**STOCK SYMBOL:** GNRC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=GNRC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/GNRC)**)\n\n*****\n\n#**FULL DISCLOSURE:**\n\n&gt; /u/bigbear0083 has no positions in any stocks mentioned. Reddit, moderators, and the author do not advise making investment decisions based on discussion in these posts. Analysis is not subject to validation and users take action at their own risk. /u/bigbear0083 is an admin at the financial forums [Stockaholics.net](http://www.stockaholics.net/) where this content was originally posted.\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/StockMarket?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Friday, January 24th, 2020! :)**",
        "subreddit": "StockMarket",
        "title": "Today's Pre-Market Movers &amp; News [Friday, January 24th, 2020]",
        "url": "https://www.reddit.com/r/StockMarket/comments/etabwz/todays_premarket_movers_news_friday_january_24th/",
        "created": 1579900901.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1579363600,
        "id": "eqi5pk",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/smallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning January 20th, 2020.\n\n# **Earnings will decide whether the market continues to hit new highs after another week of records  - [(Source)](https://www.cnbc.com/2020/01/17/earnings-will-decide-whether-market-continues-to-hit-new-highs.html)**\n*****\n&gt; With the Chinese trade deal out of the way, earnings could be the biggest driver for stocks in the week ahead, as big tech, financial, consumer and industrial companies report.\n*****\n&gt; So far, the early rush of earnings are beating estimates at a pace of about 70%. Just a few dozen S&amp;P 500 companies report in the four-day trading week, including IBM Tuesday and Intel on Thursday. Johnson &amp; Johnson reports Wednesday; Procter &amp; Gamble is Thursday, and American Express releases results Friday. The stock market is closed Monday for the Martin Luther King holiday.\n*****\n&gt; President Donald Trump travels to Davos, Switzerland for the World Economic Forum, where he speaks Tuesday. With the China trade deal signed this past Wednesday, strategists say they are now watching for any signs of a bigger trade row brewing between the U.S. and Europe.\n*****\n&gt; There are a few economic reports, including existing home sales Wednesday; leading indicators Thursday, and the Markit PMI data for manufacturing and services on Friday.\n*****\n&gt; But it’s earnings, where investors will take the pulse of corporate America, and decide whether forward guidance is justifying the stock market’s record highs and price earnings ratio of more than 18.5. The S&amp;P 500 gained nearly 2% in the past week, its best week since August. The S&amp;P 500 closed at a record 3,329 Friday and is now up about 3% since the start of the year.\n*****\n&gt; The Dow and Nasdaq also ended the week at new highs. The Dow ended up 1.9% for the week, at 29,348. The Nasdaq rose 2.3% in the past week, ending at 9,388.\n*****\n&gt; Jonathan Golub, chief U.S. market strategist at Credit Suisse, said the fourth quarter could be a turning point for earnings, after a poor performance in 2019. So far, earnings are down about 0.8% this quarter, based on actual releases and estimates, according to Refinitiv. If not for the drag from energy companies, profits for S&amp;P 500 companies would have been 1.9% higher.\n*****\n&gt; “2019 was a year of lousy earnings, and the fourth quarter is the end of a lousy year,” said Golub. “I think earnings surprises will be fine, but what the real story here is, it looks like magically the 2020 numbers are going to be much, much stronger than 2019.”\n*****\n&gt; Golub said there are two big themes this earnings season. “The first one is tech-related companies. Many of the mega caps had okay earnings, but their margins were under a lot of pressure and it subtracted earnings growth in 2019. Those trends are supposed to reverse. So what was a negative because of easy comps becomes a positive,” Golub said. “The same thing with the energy sector which was a disaster in terms of earnings growth in 2019.”\n*****\n&gt; He said the market rally can continue in part because investors are not yet on board with the earnings story.\n*****\n&gt; “While everybody is looking at the fourth quarter, I think they’re not really reading the right script, and the script they should be reading was this was the last quarter where tech margins and energy sector headwinds are overwhelming the market,” he said.\n*****\n&gt; The hearings on Trump’s impeachment are so far ignored by markets and will be underway in the Senate. While the market continues to shrug it off, traders are monitoring the situation for any change in tone.\n*****\n&gt; “Will there be new evidence/witnesses at the Senate trial to make it politically significant?,” wrote Deutsche Bank foreign exchange strategist Alan Ruskin. “Let’s not forget that for many voters, the President seems to be the main motivator for voters on both sides of the political spectrum — for and against. This argument runs along the lines that Trump is running against himself/‘the anti-Trump’, and, the election will be heavily impacted by which Democrat candidate least impacts the ‘anti-Trump’ vote — a view that some argue tends to support centrists like Biden.”\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/7YCrtpo.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/9jQCYRG.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/oXureFC.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/3upRv6z.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/O07l30Z.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/BjiCdpH.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/w5fgr9y.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/L81ewyy.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/NE6QICD.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/V19lVTd.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/vroSSfA.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/MMO35Qf.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/dCxJl8u.png))**\n\n*****\n\n# Martin Luther King Jr. Holiday Week Trading Mixed since 1998, But Improving Lately\n\n&gt; Although Martin Luther King Jr. Day was a holiday in many states and cities throughout the U.S. beginning in 1971, it did not become a federal holiday until 1986. Even then it was not observed by the NYSE until 1998. In the 22 years since, the market’s performance during this four-trading-day week has been somewhat lackluster with average weekly performance negative for DJIA, S&amp;P 500, NASDAQ, Russell 1000 and Russell 2000. Average losses range from 0.79% by DJIA to 0.14% by NASDAQ. Of the five indexes, not one has a record better than 50/50. However, since 2012 performance has shown signs of improving. DJIA, NASDAQ and Russell 2000 have risen in six of the last eight years. S&amp;P 500 and Russell 1000 have climbed in five of the last eight.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/3ef3ff1e52532ea69e189a7cd90e7b27/bf3ce263396269e9-14/s500x750/4fc5ea153df07c1e2ab94f583409f214f2eae3c6.jpg))**\n\n*****\n\n# A Closer Look At Election Years\n\n&gt; 2020 is off to a roaring start, picking up right where 2019 left off. Many investors are eyeing the upcoming presidential election as an impending storm for the stock market. In the four-year presidential cycle, pre-election years have tended to be the strongest for stocks, as sitting presidents have taken measures to boost the economy and stock market higher to garner votes. It sure worked out well last year, with the S&amp;P 500 Index’s 31% total return.\n\n&gt; Returns in election years, however, have been quite bifurcated.\n\n&gt; “If an incumbent president was up for reelection, stocks tended to do extremely well,” explained LPL Financial Senior Market Strategist Ryan Detrick. “On the other hand, if there was a lame duck president in office, returns were quite muted.”\n\n&gt; Note that a “lame duck president” means the sitting president either isn’t running for reelection or has already fulfilled the maximum two terms. It makes sense, as the president could be less motivated to do things to heat up the economy if they know they are leaving office. Possibly, investors may also get cold feet knowing a change is coming. The S&amp;P 500 was down in 2000 and 2008, and the sitting president was a “lame duck president” both years.\n\n&gt; In the LPL Chart of the Day, we break down election years by whether the president was running for reelection or a lame duck. The chart shows the S&amp;P 500 up an impressive 11.7% on average if the President was running for reelection, compared to up an average of 2.4% if president was a “lame duck president”.\n\n&gt; Given most presidents who have run a second time have tended to win, this could be the market’s way of saying it is comfortable with the status quo over change.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/01/011720-pic-1.png?ssl=1))**\n\n&gt; Another encouraging historical trend is that the S&amp;P 500 hasn’t been lower during an election year with an incumbent president up for reelection since 1940. To be clear, stocks have been up during election years when the incumbent president actually lost. In 1980, the S&amp;P 500 gained nearly 26%, but Jimmy Carter still lost to Ronald Reagan. In other words, this does support the notion of higher stocks in 2020, but higher stocks can’t always tell you who will win in November.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/01/011720-pic-2.png?ssl=1))**\n\n*****\n\n# Q4 Earnings Season is All About 2020\n\n&gt; Fourth quarter earnings season kicked off this week with 24 S&amp;P 500 Index companies slated to report results. Our expectations are for a marginal increase in S&amp;P 500 earnings per share (EPS) on a year-over-year basis, based on current FactSet consensus estimates (-2% year over year) and the average historical upside of roughly 3 percentage points.\n\n&gt; We’ve become accustomed to meager earnings growth. As shown in the LPL Chart of the Day, if fourth quarter results are anywhere near expectations, 2019 will end up as a year with S&amp;P 500 returns of more than 30% and no corporate earnings growth to speak of. That means expanding stock valuations drove the market’s gains last year, a trend we do not expect to continue.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/01/Earnings-blog-011520-1.png?ssl=1))**\n\n&gt; “We expect earnings growth to drive stock market gains in 2020,” said LPL Financial Chief Investment Strategist John Lynch. “With valuations elevated, corporate America will probably have to do the heavy lifting to get stocks much above current levels.”\n\n&gt; Accordingly, the key to this reporting season will be whether the optimistic growth outlook reflected in consensus earnings estimates for this year remains intact after companies issue guidance. Many companies will be commenting on 2020 for the first time. Our estimate of $175 per share in S&amp;P 500 EPS for the entire year represents a 6–7% increase from our $165 forecast for 2019. Based on the latest consensus estimates, that growth rate may get pushed up a bit. We still think $175 is attainable if capital investment picks up after stalling last year and wage growth remains stable.\n\n&gt; Trade progress may help. The United States and China will sign the phase-one trade deal later today. While negotiations on the next phase will be tougher and could even stall out, businesses would welcome the additional clarity that de-escalation can provide, something that clearly weighed on corporate profits last year.\n\n*****\n\n# January Off To Stronger Than Usual Start – But 2nd Half Is Weaker\n\n&gt; Stocks are off to a stronger that usual so far in January 2020 when compared in the chart above to the average performance over the most recent 21-year period. As of today’s close DJIA is up 1.41%, S&amp;P 500 +1.61%, NASDAQ leads the pack +3.11% and the Russell 2000 was in the red until the past two days and is now up 0.44%. This is well above historical average performance in recent Januarys.\n\n&gt; The market was up nicely today until reports hit the newswires at about 1:30 pm ET creating uncertainty that the Phase 1 trade deal expected to be signed tomorrow between the US and China may be pabulum. The realization that the tariffs on Chinese goods may remain in place until after the election as the review process runs its course drove stocks lower this afternoon. The market gave back most of its early gains with only the Dow and Russell 2000 eking out gains today.\n\n&gt; However, as you can see in the dotted lines so far in 2020 the indices are tracking the last 21-years rather closely. If the pattern continues to pan out this year, look for a little strength over the next two days. Then weakness has been prone to appear just after mid-month after the eleventh trading day with mild average losses from on or around the eleventh trading day to the fourteenth trading day.\n\n&gt; ###### **([CLICK HERE FOR THE CHART LINK #1!](https://66.media.tumblr.com/e2f102c5c61bd803b4bc407e8c4812e3/1b34c8a8e7ad3e39-e9/s500x750/829ff7ea82b52109b737d17e4b24cb0a4d28e434.jpg))**\n\n*****\n\n# January Trifecta Jackpot for Stocks\n\n&gt; Solid across the board gains this year have put another January Trifecta Jackpot in our sights for 2020. So far our January Trifecta is two for two. Our First Five Day (FFD) early warning system came in positive up 0.7% on January 8 following up on a positive reading for our Santa Claus Rally (SCR) on January 3. The January Trifecta would be satisfied with a positive reading from our January Barometer (JB) at month’s end.\n\n&gt; We just published an update on The Incredible January Barometer: Only 11 Major Errors in 82 Years that runs through the reasons behind the efficacy of the January. We discuss how the passage of the Twentieth “Lame Duck” Amendment to the Constitution in 1933 created the January Barometer. We also compare the January Barometer results along with the full year results, the following eleven months results, and the subsequent twelve months results to all other “Monthly Barometers” using the Dow Jones Industrials, the S&amp;P 500 and the NASDAQ Composite\n\n&gt; The best case, most bullish scenario is when all three indicators, SCR, FFD and JB, are positive (in table below). In 31 previous Trifecta occurrences since 1950, S&amp;P 500 advanced 87.1% of the time during the subsequent eleven months and 90.3% of the time for the full year. However, a January Indicator Trifecta does not guarantee the year will be bear or correction free. Of the four losing “Last 11 Mon” years, in the table, 1966, 1987 and 2011 experienced short duration bear markets (2011, S&amp;P 500 –19.4% peak to trough). In 2018, S&amp;P 500 retreated 19.8% from its September high close to its December low close.\n\n&gt; Even if S&amp;P 500 was to suddenly reverse course and finish the full month in the red, the prospects for the next eleven months and the full year remain decent. Of the last 10 times since 1950 that the SCR and FFD were both positive (and the full-month January was negative), the next eleven months advanced 80% of the time and full year advanced 70% of the time with gains of 7.4% and 2.9% respectively.\n\n&gt; A positive SCR and FFD are encouraging and further clarity will be gained when the January Barometer (page 16, 2020 Stock Trader’s Almanac) reports at month’s end. A positive January Barometer would certainly boost prospects for full-year 2020. The December Low Indicator (2020 STA, page 34) should also be watched with the line in the sand at the Dow’s December Closing Low of 27502.81 on 12/3/19.\n\n&gt; ###### **([CLICK HERE FOR THE CHART LINK #1!](https://66.media.tumblr.com/c1bcaf64028a60761e27f90b96cd50a5/be57098a98452149-c8/s500x750/8bde32d516bf2811adabb784ab6de926796ad504.jpg))**\n\n*****\n\n# Global Equities Closing In On A Breakout\n\n&gt; Below is a chart of the Bloomberg World Equity Market index, which is a cap-weighted index made up of nearly 5,000 publicly listed companies around the world (including the US). While the S&amp;P 500 is up more than 15% from its January 2018 high, it's notable that we still haven't seen equities break out on a global scale. As shown, the Bloomberg World Index is now just a hair below its prior all-time highs (22 basis points to be exact).\n\n&gt; ###### **([CLICK HERE FOR THE CHART LINK #1!](https://media.bespokepremium.com/uploads/2020/01/011720-BBG-World.png))**\n&gt; ###### **([CLICK HERE FOR THE CHART LINK #2!](https://media.bespokepremium.com/uploads/2020/01/011720-SP-5-years.png))**\n\n*****\n\n# Three Months And Counting Since Last 1% Decline\n\n&gt; It has now been over three months since the S&amp;P 500's last decline of 1% or more back on 10/9. While it seems like an eternity, the current streak of 67 trading days is nowhere near any sort of record on either a long or short-term basis. The chart below shows historical streaks without a decline of 1%+ for the S&amp;P 500 dating back to 1928. The record for the longest streak was back in 1963 when the S&amp;P 500 went 174 trading days - a full eight months - without a 1% drop. Even more impressive is the fact that in both the 1950s and 1960s there were numerous streaks of 100 or more days. For a decade that is looked back on as one with a lot of upheaval in the US, the 1960s was a period of relative calm for the equity market.\n\n&gt; More recently, the current streak of 67 trading days doesn't look all that impressive relative to streaks we saw back in 2017 and 2018. Right after the election in 2016 and into March of 2017, the S&amp;P 500 had a 109-day streak without a 1% decline, and then from late 2017 through January 2018, there was another streak of 112 trading days without a 1% drop. Even in October 2018, there was another streak of 74 trading days. In other words, in just the last three years there have been three longer streaks without a 1% decline than the current one. In the S&amp;P 500's history, there have been 26 other streaks that have been as long or longer than the current one, and half of those went on to last at least 100 trading days.\n\n&gt; ###### **([CLICK HERE FOR THE CHART LINK!](https://media.bespokepremium.com/uploads/2020/01/011420-Streaks-Without-a-1-Percent-Decline.png))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending January 17th, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED)\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 1.12.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$NFLX** \n&gt; * **$FCEL** \n&gt; * **$HAL** \n&gt; * **$INTC** \n&gt; * **$PG** \n&gt; * **$UAL** \n&gt; * **$ABT** \n&gt; * **$AAL** \n&gt; * **$ALLY** \n&gt; * **$CMA** \n&gt; * **$AXP** \n&gt; * **$ASML** \n&gt; * **$TAL** \n&gt; * **$LUV** \n&gt; * **$JBLU** \n&gt; * **$TEAM** \n&gt; * **$KMI** \n&gt; * **$PLD** \n&gt; * **$SWKS** \n&gt; * **$ISRG** \n&gt; * **$MBWM** \n&gt; * **$TXN** \n&gt; * **$COF** \n&gt; * **$ONB** \n&gt; * **$UNP** \n&gt; * **$AMTD** \n&gt; * **$FNB** \n&gt; * **$SBNY** \n&gt; * **$RCI** \n&gt; * **$KMB** \n&gt; * **$STM** \n&gt; * **$AUB** \n&gt; * **$ERIC** \n&gt; * **$BKR** \n&gt; * **$KEY** \n&gt; * **$NAVI** \n&gt; * **$NEE** \n&gt; * **$APH** \n&gt; * **$NTRS** \n&gt; * **$CBU** \n&gt; * **$TER** \n&gt; * **$ZION**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/NE6QICD.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/cCUTW9b.png))**\n###### **([CLICK HERE FOR MOST ANTICIPATED EARNINGS RELEASES FOR THE NEXT 5 WEEKS!](https://i.imgur.com/HZqsu6j.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 1.20.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE. U.S. MARKETS CLOSED IN OBSERVANCE OF MLK DAY.\n\n&gt; # ***Monday 1.20.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE. U.S. MARKETS CLOSED IN OBSERVANCE OF MLK DAY.\n\n*****\n\n&gt; # ***Tuesday 1.21.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/z0BS7ov.png))\n\n&gt; # ***Tuesday 1.21.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/eYa9UPZ.png))\n\n*****\n\n&gt; # ***Wednesday 1.22.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Mkv2kTC.png))\n\n&gt; # ***Wednesday 1.22.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/DB4GuUs.png))\n\n*****\n\n&gt; # ***Thursday 1.23.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/OUhKPQ1.png))\n\n&gt; # ***Thursday 1.23.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/oQRSUSZ.png))\n\n*****\n\n&gt; # ***Friday 1.24.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/HXSOD6W.png))\n\n*****\n\n&gt; # ***Friday 1.24.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# Netflix, Inc. $339.67\n&gt; **Netflix, Inc. (NFLX)** is confirmed to report earnings at approximately 4:00 PM ET on Tuesday, January 21, 2020. The consensus earnings estimate is $0.50 per share on revenue of $5.44 billion and the Earnings Whisper ® number is $0.58 per share. Investor sentiment going into the company's earnings release has 60% expecting an earnings beat The company's guidance was for earnings of approximately $0.51 per share. Consensus estimates are for year-over-year earnings growth of 66.67% with revenue increasing by 29.93%. Short interest has decreased by 1.2% since the company's last earnings release while the stock has drifted higher by 11.6% from its open following the earnings release to be 5.6% above its 200 day moving average of $321.69. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, January 14, 2020 there was some notable buying of 2,714 contracts of the $400.00 call expiring on Friday, January 24, 2020. Option traders are pricing in a 7.6% move on earnings and the stock has averaged a 4.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NFLX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# FuelCell Energy, Inc. $2.40\n&gt; **FuelCell Energy, Inc. (FCEL)** is confirmed to report earnings at approximately 8:25 AM ET on Wednesday, January 22, 2020. The consensus estimate is for a loss of $0.07 per share on revenue of $8.90 million. Investor sentiment going into the company's earnings release has 63% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 63.16% with revenue decreasing by 50.23%. Short interest has increased by 223.8% since the company's last earnings release while the stock has drifted higher by 380.0% from its open following the earnings release to be 208.0% above its 200 day moving average of $0.78. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, January 17, 2020 there was some notable buying of 3,154 contracts of the $3.00 put expiring on Friday, February 21, 2020. The stock has averaged a 34.3% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FCEL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Halliburton Company $23.96\n&gt; **Halliburton Company (HAL)** is confirmed to report earnings at approximately 6:45 AM ET on Tuesday, January 21, 2020. The consensus earnings estimate is $0.29 per share on revenue of $5.10 billion and the Earnings Whisper ® number is $0.32 per share. Investor sentiment going into the company's earnings release has 47% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 29.27% with revenue decreasing by 14.08%. Short interest has increased by 17.4% since the company's last earnings release while the stock has drifted higher by 32.0% from its open following the earnings release to be 6.2% above its 200 day moving average of $22.55. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, January 3, 2020 there was some notable buying of 5,897 contracts of the $26.00 call expiring on Friday, February 21, 2020. Option traders are pricing in a 5.2% move on earnings and the stock has averaged a 5.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Intel Corp. $59.60\n&gt; **Intel Corp. (INTC)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, January 23, 2020. The consensus earnings estimate is $1.24 per share on revenue of $19.20 billion and the Earnings Whisper ® number is $1.31 per share. Investor sentiment going into the company's earnings release has 59% expecting an earnings beat The company's guidance was for earnings of approximately $1.24 per share. Consensus estimates are for earnings to decline year-over-year by 3.13% with revenue increasing by 2.91%. Short interest has increased by 5.8% since the company's last earnings release while the stock has drifted higher by 10.0% from its open following the earnings release to be 14.8% above its 200 day moving average of $51.94. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, January 17, 2020 there was some notable buying of 7,163 contracts of the $60.00 call expiring on Friday, January 31, 2020. Option traders are pricing in a 5.0% move on earnings and the stock has averaged a 5.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=INTC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Procter &amp; Gamble Co. $126.41\n&gt; **Procter &amp; Gamble Co. (PG)** is confirmed to report earnings at approximately 6:55 AM ET on Thursday, January 23, 2020. The consensus earnings estimate is $1.37 per share on revenue of $18.32 billion and the Earnings Whisper ® number is $1.40 per share. Investor sentiment going into the company's earnings release has 63% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 9.60% with revenue increasing by 5.06%. Short interest has decreased by 6.6% since the company's last earnings release while the stock has drifted higher by 1.9% from its open following the earnings release to be 9.0% above its 200 day moving average of $115.95. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, January 16, 2020 there was some notable buying of 5,930 contracts of the $65.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 3.2% move on earnings and the stock has averaged a 3.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=PG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# United Airlines $89.70\n&gt; **United Airlines (UAL)** is confirmed to report earnings at approximately 4:15 PM ET on Tuesday, January 21, 2020. The consensus earnings estimate is $2.64 per share on revenue of $10.86 billion and the Earnings Whisper ® number is $2.72 per share. Investor sentiment going into the company's earnings release has 72% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 3.53% with revenue increasing by 3.52%. Short interest has decreased by 19.7% since the company's last earnings release while the stock has drifted higher by 0.4% from its open following the earnings release to be 2.7% above its 200 day moving average of $87.38. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, January 13, 2020 there was some notable buying of 1,823 contracts of the $84.00 put expiring on Friday, January 24, 2020. Option traders are pricing in a 4.7% move on earnings and the stock has averaged a 4.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=UAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Abbott Laboratories $89.00\n&gt; **Abbott Laboratories (ABT)** is confirmed to report earnings at approximately 7:30 AM ET on Wednesday, January 22, 2020. The consensus earnings estimate is $0.95 per share on revenue of $8.26 billion and the Earnings Whisper ® number is $0.97 per share. Investor sentiment going into the company's earnings release has 65% expecting an earnings beat The company's guidance was for earnings of $0.94 to $0.96 per share. Consensus estimates are for year-over-year earnings growth of 17.28% with revenue increasing by 6.37%. Short interest has increased by 19.6% since the company's last earnings release while the stock has drifted higher by 9.4% from its open following the earnings release to be 8.0% above its 200 day moving average of $82.44. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, January 15, 2020 there was some notable buying of 1,670 contracts of the $86.00 call expiring on Friday, January 31, 2020. Option traders are pricing in a 2.8% move on earnings and the stock has averaged a 2.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ABT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# American Airlines Group Inc. $28.40\n&gt; **American Airlines Group Inc. (AAL)** is confirmed to report earnings at approximately 7:30 AM ET on Thursday, January 23, 2020. The consensus earnings estimate is $1.18 per share on revenue of $11.36 billion and the Earnings Whisper ® number is $1.27 per share. Investor sentiment going into the company's earnings release has 65% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 13.46% with revenue increasing by 3.86%. Short interest has increased by 54.2% since the company's last earnings release while the stock has drifted lower by 3.0% from its open following the earnings release to be 5.0% below its 200 day moving average of $29.89. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, January 8, 2020 there was some notable buying of 20,919 contracts of the $30.00 call expiring on Friday, February 21, 2020. Option traders are pricing in a 5.2% move on earnings and the stock has averaged a 5.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Ally Financial $30.45\n&gt; **Ally Financial (ALLY)** is confirmed to report earnings at approximately 7:30 AM ET on Wednesday, January 22, 2020. The consensus earnings estimate is $0.95 per share on revenue of $1.64 billion and the Earnings Whisper ® number is $0.97 per share. Investor sentiment going into the company's earnings release has 71% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 3.26% with revenue increasing by 14.05%. Short interest has increased by 41.9% since the company's last earnings release while the stock has drifted lower by 4.8% from its open following the earnings release to be 1.5% below its 200 day moving average of $30.93. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, January 9, 2020 there was some notable buying of 672 contracts of the $30.00 call expiring on Friday, February 21, 2020. Option traders are pricing in a 5.6% move on earnings and the stock has averaged a 3.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ALLY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# American Express Co. $131.52\n&gt; **American Express Co. (AXP)** is confirmed to report earnings at approximately 7:30 AM ET on Friday, January 24, 2020. The consensus earnings estimate is $2.00 per share on revenue of $11.36 billion and the Earnings Whisper ® number is $2.05 per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 14.94% with revenue increasing by 8.46%. Short interest has increased by 11.2% since the company's last earnings release while the stock has drifted higher by 9.8% from its open following the earnings release to be 9.6% above its 200 day moving average of $120.00. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, January 17, 2020 there was some notable buying of 4,510 contracts of the $131.00 call expiring on Friday, January 31, 2020. Option traders are pricing in a 2.9% move on earnings and the stock has averaged a 2.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AXP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful 3-day weekend and a great trading week ahead r/smallstreetbets.",
        "subreddit": "smallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning January 20th, 2020",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/eqi5pk/wall_street_week_ahead_for_the_trading_week/",
        "created": 1579392400.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1579363245,
        "id": "eqi2yn",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/StockMarket. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning January 20th, 2020.\n\n# **Earnings will decide whether the market continues to hit new highs after another week of records  - [(Source)](https://www.cnbc.com/2020/01/17/earnings-will-decide-whether-market-continues-to-hit-new-highs.html)**\n*****\n&gt; With the Chinese trade deal out of the way, earnings could be the biggest driver for stocks in the week ahead, as big tech, financial, consumer and industrial companies report.\n*****\n&gt; So far, the early rush of earnings are beating estimates at a pace of about 70%. Just a few dozen S&amp;P 500 companies report in the four-day trading week, including IBM Tuesday and Intel on Thursday. Johnson &amp; Johnson reports Wednesday; Procter &amp; Gamble is Thursday, and American Express releases results Friday. The stock market is closed Monday for the Martin Luther King holiday.\n*****\n&gt; President Donald Trump travels to Davos, Switzerland for the World Economic Forum, where he speaks Tuesday. With the China trade deal signed this past Wednesday, strategists say they are now watching for any signs of a bigger trade row brewing between the U.S. and Europe.\n*****\n&gt; There are a few economic reports, including existing home sales Wednesday; leading indicators Thursday, and the Markit PMI data for manufacturing and services on Friday.\n*****\n&gt; But it’s earnings, where investors will take the pulse of corporate America, and decide whether forward guidance is justifying the stock market’s record highs and price earnings ratio of more than 18.5. The S&amp;P 500 gained nearly 2% in the past week, its best week since August. The S&amp;P 500 closed at a record 3,329 Friday and is now up about 3% since the start of the year.\n*****\n&gt; The Dow and Nasdaq also ended the week at new highs. The Dow ended up 1.9% for the week, at 29,348. The Nasdaq rose 2.3% in the past week, ending at 9,388.\n*****\n&gt; Jonathan Golub, chief U.S. market strategist at Credit Suisse, said the fourth quarter could be a turning point for earnings, after a poor performance in 2019. So far, earnings are down about 0.8% this quarter, based on actual releases and estimates, according to Refinitiv. If not for the drag from energy companies, profits for S&amp;P 500 companies would have been 1.9% higher.\n*****\n&gt; “2019 was a year of lousy earnings, and the fourth quarter is the end of a lousy year,” said Golub. “I think earnings surprises will be fine, but what the real story here is, it looks like magically the 2020 numbers are going to be much, much stronger than 2019.”\n*****\n&gt; Golub said there are two big themes this earnings season. “The first one is tech-related companies. Many of the mega caps had okay earnings, but their margins were under a lot of pressure and it subtracted earnings growth in 2019. Those trends are supposed to reverse. So what was a negative because of easy comps becomes a positive,” Golub said. “The same thing with the energy sector which was a disaster in terms of earnings growth in 2019.”\n*****\n&gt; He said the market rally can continue in part because investors are not yet on board with the earnings story.\n*****\n&gt; “While everybody is looking at the fourth quarter, I think they’re not really reading the right script, and the script they should be reading was this was the last quarter where tech margins and energy sector headwinds are overwhelming the market,” he said.\n*****\n&gt; The hearings on Trump’s impeachment are so far ignored by markets and will be underway in the Senate. While the market continues to shrug it off, traders are monitoring the situation for any change in tone.\n*****\n&gt; “Will there be new evidence/witnesses at the Senate trial to make it politically significant?,” wrote Deutsche Bank foreign exchange strategist Alan Ruskin. “Let’s not forget that for many voters, the President seems to be the main motivator for voters on both sides of the political spectrum — for and against. This argument runs along the lines that Trump is running against himself/‘the anti-Trump’, and, the election will be heavily impacted by which Democrat candidate least impacts the ‘anti-Trump’ vote — a view that some argue tends to support centrists like Biden.”\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/7YCrtpo.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/9jQCYRG.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/oXureFC.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/3upRv6z.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/O07l30Z.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/BjiCdpH.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/w5fgr9y.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/L81ewyy.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/NE6QICD.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/V19lVTd.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/vroSSfA.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/MMO35Qf.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/dCxJl8u.png))**\n\n*****\n\n# Martin Luther King Jr. Holiday Week Trading Mixed since 1998, But Improving Lately\n\n&gt; Although Martin Luther King Jr. Day was a holiday in many states and cities throughout the U.S. beginning in 1971, it did not become a federal holiday until 1986. Even then it was not observed by the NYSE until 1998. In the 22 years since, the market’s performance during this four-trading-day week has been somewhat lackluster with average weekly performance negative for DJIA, S&amp;P 500, NASDAQ, Russell 1000 and Russell 2000. Average losses range from 0.79% by DJIA to 0.14% by NASDAQ. Of the five indexes, not one has a record better than 50/50. However, since 2012 performance has shown signs of improving. DJIA, NASDAQ and Russell 2000 have risen in six of the last eight years. S&amp;P 500 and Russell 1000 have climbed in five of the last eight.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/3ef3ff1e52532ea69e189a7cd90e7b27/bf3ce263396269e9-14/s500x750/4fc5ea153df07c1e2ab94f583409f214f2eae3c6.jpg))**\n\n*****\n\n# A Closer Look At Election Years\n\n&gt; 2020 is off to a roaring start, picking up right where 2019 left off. Many investors are eyeing the upcoming presidential election as an impending storm for the stock market. In the four-year presidential cycle, pre-election years have tended to be the strongest for stocks, as sitting presidents have taken measures to boost the economy and stock market higher to garner votes. It sure worked out well last year, with the S&amp;P 500 Index’s 31% total return.\n\n&gt; Returns in election years, however, have been quite bifurcated.\n\n&gt; “If an incumbent president was up for reelection, stocks tended to do extremely well,” explained LPL Financial Senior Market Strategist Ryan Detrick. “On the other hand, if there was a lame duck president in office, returns were quite muted.”\n\n&gt; Note that a “lame duck president” means the sitting president either isn’t running for reelection or has already fulfilled the maximum two terms. It makes sense, as the president could be less motivated to do things to heat up the economy if they know they are leaving office. Possibly, investors may also get cold feet knowing a change is coming. The S&amp;P 500 was down in 2000 and 2008, and the sitting president was a “lame duck president” both years.\n\n&gt; In the LPL Chart of the Day, we break down election years by whether the president was running for reelection or a lame duck. The chart shows the S&amp;P 500 up an impressive 11.7% on average if the President was running for reelection, compared to up an average of 2.4% if president was a “lame duck president”.\n\n&gt; Given most presidents who have run a second time have tended to win, this could be the market’s way of saying it is comfortable with the status quo over change.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/01/011720-pic-1.png?ssl=1))**\n\n&gt; Another encouraging historical trend is that the S&amp;P 500 hasn’t been lower during an election year with an incumbent president up for reelection since 1940. To be clear, stocks have been up during election years when the incumbent president actually lost. In 1980, the S&amp;P 500 gained nearly 26%, but Jimmy Carter still lost to Ronald Reagan. In other words, this does support the notion of higher stocks in 2020, but higher stocks can’t always tell you who will win in November.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/01/011720-pic-2.png?ssl=1))**\n\n*****\n\n# Q4 Earnings Season is All About 2020\n\n&gt; Fourth quarter earnings season kicked off this week with 24 S&amp;P 500 Index companies slated to report results. Our expectations are for a marginal increase in S&amp;P 500 earnings per share (EPS) on a year-over-year basis, based on current FactSet consensus estimates (-2% year over year) and the average historical upside of roughly 3 percentage points.\n\n&gt; We’ve become accustomed to meager earnings growth. As shown in the LPL Chart of the Day, if fourth quarter results are anywhere near expectations, 2019 will end up as a year with S&amp;P 500 returns of more than 30% and no corporate earnings growth to speak of. That means expanding stock valuations drove the market’s gains last year, a trend we do not expect to continue.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/01/Earnings-blog-011520-1.png?ssl=1))**\n\n&gt; “We expect earnings growth to drive stock market gains in 2020,” said LPL Financial Chief Investment Strategist John Lynch. “With valuations elevated, corporate America will probably have to do the heavy lifting to get stocks much above current levels.”\n\n&gt; Accordingly, the key to this reporting season will be whether the optimistic growth outlook reflected in consensus earnings estimates for this year remains intact after companies issue guidance. Many companies will be commenting on 2020 for the first time. Our estimate of $175 per share in S&amp;P 500 EPS for the entire year represents a 6–7% increase from our $165 forecast for 2019. Based on the latest consensus estimates, that growth rate may get pushed up a bit. We still think $175 is attainable if capital investment picks up after stalling last year and wage growth remains stable.\n\n&gt; Trade progress may help. The United States and China will sign the phase-one trade deal later today. While negotiations on the next phase will be tougher and could even stall out, businesses would welcome the additional clarity that de-escalation can provide, something that clearly weighed on corporate profits last year.\n\n*****\n\n# January Off To Stronger Than Usual Start – But 2nd Half Is Weaker\n\n&gt; Stocks are off to a stronger that usual so far in January 2020 when compared in the chart above to the average performance over the most recent 21-year period. As of today’s close DJIA is up 1.41%, S&amp;P 500 +1.61%, NASDAQ leads the pack +3.11% and the Russell 2000 was in the red until the past two days and is now up 0.44%. This is well above historical average performance in recent Januarys.\n\n&gt; The market was up nicely today until reports hit the newswires at about 1:30 pm ET creating uncertainty that the Phase 1 trade deal expected to be signed tomorrow between the US and China may be pabulum. The realization that the tariffs on Chinese goods may remain in place until after the election as the review process runs its course drove stocks lower this afternoon. The market gave back most of its early gains with only the Dow and Russell 2000 eking out gains today.\n\n&gt; However, as you can see in the dotted lines so far in 2020 the indices are tracking the last 21-years rather closely. If the pattern continues to pan out this year, look for a little strength over the next two days. Then weakness has been prone to appear just after mid-month after the eleventh trading day with mild average losses from on or around the eleventh trading day to the fourteenth trading day.\n\n&gt; ###### **([CLICK HERE FOR THE CHART LINK #1!](https://66.media.tumblr.com/e2f102c5c61bd803b4bc407e8c4812e3/1b34c8a8e7ad3e39-e9/s500x750/829ff7ea82b52109b737d17e4b24cb0a4d28e434.jpg))**\n\n*****\n\n# January Trifecta Jackpot for Stocks\n\n&gt; Solid across the board gains this year have put another January Trifecta Jackpot in our sights for 2020. So far our January Trifecta is two for two. Our First Five Day (FFD) early warning system came in positive up 0.7% on January 8 following up on a positive reading for our Santa Claus Rally (SCR) on January 3. The January Trifecta would be satisfied with a positive reading from our January Barometer (JB) at month’s end.\n\n&gt; We just published an update on The Incredible January Barometer: Only 11 Major Errors in 82 Years that runs through the reasons behind the efficacy of the January. We discuss how the passage of the Twentieth “Lame Duck” Amendment to the Constitution in 1933 created the January Barometer. We also compare the January Barometer results along with the full year results, the following eleven months results, and the subsequent twelve months results to all other “Monthly Barometers” using the Dow Jones Industrials, the S&amp;P 500 and the NASDAQ Composite\n\n&gt; The best case, most bullish scenario is when all three indicators, SCR, FFD and JB, are positive (in table below). In 31 previous Trifecta occurrences since 1950, S&amp;P 500 advanced 87.1% of the time during the subsequent eleven months and 90.3% of the time for the full year. However, a January Indicator Trifecta does not guarantee the year will be bear or correction free. Of the four losing “Last 11 Mon” years, in the table, 1966, 1987 and 2011 experienced short duration bear markets (2011, S&amp;P 500 –19.4% peak to trough). In 2018, S&amp;P 500 retreated 19.8% from its September high close to its December low close.\n\n&gt; Even if S&amp;P 500 was to suddenly reverse course and finish the full month in the red, the prospects for the next eleven months and the full year remain decent. Of the last 10 times since 1950 that the SCR and FFD were both positive (and the full-month January was negative), the next eleven months advanced 80% of the time and full year advanced 70% of the time with gains of 7.4% and 2.9% respectively.\n\n&gt; A positive SCR and FFD are encouraging and further clarity will be gained when the January Barometer (page 16, 2020 Stock Trader’s Almanac) reports at month’s end. A positive January Barometer would certainly boost prospects for full-year 2020. The December Low Indicator (2020 STA, page 34) should also be watched with the line in the sand at the Dow’s December Closing Low of 27502.81 on 12/3/19.\n\n&gt; ###### **([CLICK HERE FOR THE CHART LINK #1!](https://66.media.tumblr.com/c1bcaf64028a60761e27f90b96cd50a5/be57098a98452149-c8/s500x750/8bde32d516bf2811adabb784ab6de926796ad504.jpg))**\n\n*****\n\n# Global Equities Closing In On A Breakout\n\n&gt; Below is a chart of the Bloomberg World Equity Market index, which is a cap-weighted index made up of nearly 5,000 publicly listed companies around the world (including the US). While the S&amp;P 500 is up more than 15% from its January 2018 high, it's notable that we still haven't seen equities break out on a global scale. As shown, the Bloomberg World Index is now just a hair below its prior all-time highs (22 basis points to be exact).\n\n&gt; ###### **([CLICK HERE FOR THE CHART LINK #1!](https://media.bespokepremium.com/uploads/2020/01/011720-BBG-World.png))**\n&gt; ###### **([CLICK HERE FOR THE CHART LINK #2!](https://media.bespokepremium.com/uploads/2020/01/011720-SP-5-years.png))**\n\n*****\n\n# Three Months And Counting Since Last 1% Decline\n\n&gt; It has now been over three months since the S&amp;P 500's last decline of 1% or more back on 10/9. While it seems like an eternity, the current streak of 67 trading days is nowhere near any sort of record on either a long or short-term basis. The chart below shows historical streaks without a decline of 1%+ for the S&amp;P 500 dating back to 1928. The record for the longest streak was back in 1963 when the S&amp;P 500 went 174 trading days - a full eight months - without a 1% drop. Even more impressive is the fact that in both the 1950s and 1960s there were numerous streaks of 100 or more days. For a decade that is looked back on as one with a lot of upheaval in the US, the 1960s was a period of relative calm for the equity market.\n\n&gt; More recently, the current streak of 67 trading days doesn't look all that impressive relative to streaks we saw back in 2017 and 2018. Right after the election in 2016 and into March of 2017, the S&amp;P 500 had a 109-day streak without a 1% decline, and then from late 2017 through January 2018, there was another streak of 112 trading days without a 1% drop. Even in October 2018, there was another streak of 74 trading days. In other words, in just the last three years there have been three longer streaks without a 1% decline than the current one. In the S&amp;P 500's history, there have been 26 other streaks that have been as long or longer than the current one, and half of those went on to last at least 100 trading days.\n\n&gt; ###### **([CLICK HERE FOR THE CHART LINK!](https://media.bespokepremium.com/uploads/2020/01/011420-Streaks-Without-a-1-Percent-Decline.png))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending January 17th, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED)\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 1.12.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$NFLX** \n&gt; * **$FCEL** \n&gt; * **$HAL** \n&gt; * **$INTC** \n&gt; * **$PG** \n&gt; * **$UAL** \n&gt; * **$ABT** \n&gt; * **$AAL** \n&gt; * **$ALLY** \n&gt; * **$CMA** \n&gt; * **$AXP** \n&gt; * **$ASML** \n&gt; * **$TAL** \n&gt; * **$LUV** \n&gt; * **$JBLU** \n&gt; * **$TEAM** \n&gt; * **$KMI** \n&gt; * **$PLD** \n&gt; * **$SWKS** \n&gt; * **$ISRG** \n&gt; * **$MBWM** \n&gt; * **$TXN** \n&gt; * **$COF** \n&gt; * **$ONB** \n&gt; * **$UNP** \n&gt; * **$AMTD** \n&gt; * **$FNB** \n&gt; * **$SBNY** \n&gt; * **$RCI** \n&gt; * **$KMB** \n&gt; * **$STM** \n&gt; * **$AUB** \n&gt; * **$ERIC** \n&gt; * **$BKR** \n&gt; * **$KEY** \n&gt; * **$NAVI** \n&gt; * **$NEE** \n&gt; * **$APH** \n&gt; * **$NTRS** \n&gt; * **$CBU** \n&gt; * **$TER** \n&gt; * **$ZION**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/NE6QICD.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/cCUTW9b.png))**\n###### **([CLICK HERE FOR MOST ANTICIPATED EARNINGS RELEASES FOR THE NEXT 5 WEEKS!](https://i.imgur.com/HZqsu6j.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 1.20.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE. U.S. MARKETS CLOSED IN OBSERVANCE OF MLK DAY.\n\n&gt; # ***Monday 1.20.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE. U.S. MARKETS CLOSED IN OBSERVANCE OF MLK DAY.\n\n*****\n\n&gt; # ***Tuesday 1.21.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/z0BS7ov.png))\n\n&gt; # ***Tuesday 1.21.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/eYa9UPZ.png))\n\n*****\n\n&gt; # ***Wednesday 1.22.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Mkv2kTC.png))\n\n&gt; # ***Wednesday 1.22.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/DB4GuUs.png))\n\n*****\n\n&gt; # ***Thursday 1.23.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/OUhKPQ1.png))\n\n&gt; # ***Thursday 1.23.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/oQRSUSZ.png))\n\n*****\n\n&gt; # ***Friday 1.24.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/HXSOD6W.png))\n\n*****\n\n&gt; # ***Friday 1.24.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# Netflix, Inc. $339.67\n&gt; **Netflix, Inc. (NFLX)** is confirmed to report earnings at approximately 4:00 PM ET on Tuesday, January 21, 2020. The consensus earnings estimate is $0.50 per share on revenue of $5.44 billion and the Earnings Whisper ® number is $0.58 per share. Investor sentiment going into the company's earnings release has 60% expecting an earnings beat The company's guidance was for earnings of approximately $0.51 per share. Consensus estimates are for year-over-year earnings growth of 66.67% with revenue increasing by 29.93%. Short interest has decreased by 1.2% since the company's last earnings release while the stock has drifted higher by 11.6% from its open following the earnings release to be 5.6% above its 200 day moving average of $321.69. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, January 14, 2020 there was some notable buying of 2,714 contracts of the $400.00 call expiring on Friday, January 24, 2020. Option traders are pricing in a 7.6% move on earnings and the stock has averaged a 4.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NFLX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# FuelCell Energy, Inc. $2.40\n&gt; **FuelCell Energy, Inc. (FCEL)** is confirmed to report earnings at approximately 8:25 AM ET on Wednesday, January 22, 2020. The consensus estimate is for a loss of $0.07 per share on revenue of $8.90 million. Investor sentiment going into the company's earnings release has 63% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 63.16% with revenue decreasing by 50.23%. Short interest has increased by 223.8% since the company's last earnings release while the stock has drifted higher by 380.0% from its open following the earnings release to be 208.0% above its 200 day moving average of $0.78. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, January 17, 2020 there was some notable buying of 3,154 contracts of the $3.00 put expiring on Friday, February 21, 2020. The stock has averaged a 34.3% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FCEL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Halliburton Company $23.96\n&gt; **Halliburton Company (HAL)** is confirmed to report earnings at approximately 6:45 AM ET on Tuesday, January 21, 2020. The consensus earnings estimate is $0.29 per share on revenue of $5.10 billion and the Earnings Whisper ® number is $0.32 per share. Investor sentiment going into the company's earnings release has 47% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 29.27% with revenue decreasing by 14.08%. Short interest has increased by 17.4% since the company's last earnings release while the stock has drifted higher by 32.0% from its open following the earnings release to be 6.2% above its 200 day moving average of $22.55. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, January 3, 2020 there was some notable buying of 5,897 contracts of the $26.00 call expiring on Friday, February 21, 2020. Option traders are pricing in a 5.2% move on earnings and the stock has averaged a 5.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Intel Corp. $59.60\n&gt; **Intel Corp. (INTC)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, January 23, 2020. The consensus earnings estimate is $1.24 per share on revenue of $19.20 billion and the Earnings Whisper ® number is $1.31 per share. Investor sentiment going into the company's earnings release has 59% expecting an earnings beat The company's guidance was for earnings of approximately $1.24 per share. Consensus estimates are for earnings to decline year-over-year by 3.13% with revenue increasing by 2.91%. Short interest has increased by 5.8% since the company's last earnings release while the stock has drifted higher by 10.0% from its open following the earnings release to be 14.8% above its 200 day moving average of $51.94. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, January 17, 2020 there was some notable buying of 7,163 contracts of the $60.00 call expiring on Friday, January 31, 2020. Option traders are pricing in a 5.0% move on earnings and the stock has averaged a 5.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=INTC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Procter &amp; Gamble Co. $126.41\n&gt; **Procter &amp; Gamble Co. (PG)** is confirmed to report earnings at approximately 6:55 AM ET on Thursday, January 23, 2020. The consensus earnings estimate is $1.37 per share on revenue of $18.32 billion and the Earnings Whisper ® number is $1.40 per share. Investor sentiment going into the company's earnings release has 63% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 9.60% with revenue increasing by 5.06%. Short interest has decreased by 6.6% since the company's last earnings release while the stock has drifted higher by 1.9% from its open following the earnings release to be 9.0% above its 200 day moving average of $115.95. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, January 16, 2020 there was some notable buying of 5,930 contracts of the $65.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 3.2% move on earnings and the stock has averaged a 3.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=PG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# United Airlines $89.70\n&gt; **United Airlines (UAL)** is confirmed to report earnings at approximately 4:15 PM ET on Tuesday, January 21, 2020. The consensus earnings estimate is $2.64 per share on revenue of $10.86 billion and the Earnings Whisper ® number is $2.72 per share. Investor sentiment going into the company's earnings release has 72% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 3.53% with revenue increasing by 3.52%. Short interest has decreased by 19.7% since the company's last earnings release while the stock has drifted higher by 0.4% from its open following the earnings release to be 2.7% above its 200 day moving average of $87.38. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, January 13, 2020 there was some notable buying of 1,823 contracts of the $84.00 put expiring on Friday, January 24, 2020. Option traders are pricing in a 4.7% move on earnings and the stock has averaged a 4.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=UAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Abbott Laboratories $89.00\n&gt; **Abbott Laboratories (ABT)** is confirmed to report earnings at approximately 7:30 AM ET on Wednesday, January 22, 2020. The consensus earnings estimate is $0.95 per share on revenue of $8.26 billion and the Earnings Whisper ® number is $0.97 per share. Investor sentiment going into the company's earnings release has 65% expecting an earnings beat The company's guidance was for earnings of $0.94 to $0.96 per share. Consensus estimates are for year-over-year earnings growth of 17.28% with revenue increasing by 6.37%. Short interest has increased by 19.6% since the company's last earnings release while the stock has drifted higher by 9.4% from its open following the earnings release to be 8.0% above its 200 day moving average of $82.44. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, January 15, 2020 there was some notable buying of 1,670 contracts of the $86.00 call expiring on Friday, January 31, 2020. Option traders are pricing in a 2.8% move on earnings and the stock has averaged a 2.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ABT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# American Airlines Group Inc. $28.40\n&gt; **American Airlines Group Inc. (AAL)** is confirmed to report earnings at approximately 7:30 AM ET on Thursday, January 23, 2020. The consensus earnings estimate is $1.18 per share on revenue of $11.36 billion and the Earnings Whisper ® number is $1.27 per share. Investor sentiment going into the company's earnings release has 65% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 13.46% with revenue increasing by 3.86%. Short interest has increased by 54.2% since the company's last earnings release while the stock has drifted lower by 3.0% from its open following the earnings release to be 5.0% below its 200 day moving average of $29.89. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, January 8, 2020 there was some notable buying of 20,919 contracts of the $30.00 call expiring on Friday, February 21, 2020. Option traders are pricing in a 5.2% move on earnings and the stock has averaged a 5.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Ally Financial $30.45\n&gt; **Ally Financial (ALLY)** is confirmed to report earnings at approximately 7:30 AM ET on Wednesday, January 22, 2020. The consensus earnings estimate is $0.95 per share on revenue of $1.64 billion and the Earnings Whisper ® number is $0.97 per share. Investor sentiment going into the company's earnings release has 71% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 3.26% with revenue increasing by 14.05%. Short interest has increased by 41.9% since the company's last earnings release while the stock has drifted lower by 4.8% from its open following the earnings release to be 1.5% below its 200 day moving average of $30.93. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, January 9, 2020 there was some notable buying of 672 contracts of the $30.00 call expiring on Friday, February 21, 2020. Option traders are pricing in a 5.6% move on earnings and the stock has averaged a 3.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ALLY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# American Express Co. $131.52\n&gt; **American Express Co. (AXP)** is confirmed to report earnings at approximately 7:30 AM ET on Friday, January 24, 2020. The consensus earnings estimate is $2.00 per share on revenue of $11.36 billion and the Earnings Whisper ® number is $2.05 per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 14.94% with revenue increasing by 8.46%. Short interest has increased by 11.2% since the company's last earnings release while the stock has drifted higher by 9.8% from its open following the earnings release to be 9.6% above its 200 day moving average of $120.00. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, January 17, 2020 there was some notable buying of 4,510 contracts of the $131.00 call expiring on Friday, January 31, 2020. Option traders are pricing in a 2.9% move on earnings and the stock has averaged a 2.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AXP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful 3-day weekend and a great trading week ahead r/StockMarket.",
        "subreddit": "StockMarket",
        "title": "Wall Street Week Ahead for the trading week beginning January 20th, 2020",
        "url": "https://www.reddit.com/r/StockMarket/comments/eqi2yn/wall_street_week_ahead_for_the_trading_week/",
        "created": 1579392045.0
    },
    {
        "author": "ItsPul",
        "created_utc": 1579064100,
        "id": "eoxozj",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "My autism is telling me that SKYWORKS (83%  of some\n Bullshit in GYNA) will be punished by Tariff Man\nSWKS 115 PUTS 1/24",
        "subreddit": "wallstreetbets",
        "title": "SWKS PUTZ",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eoxozj/swks_putz/",
        "created": 1579092900.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1579872283,
        "id": "etad3k",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/stocks sub! Happy Friday to all! Here are your pre-market mover &amp; news this AM-\n\n*****\n\n#[Today's Top Headlines for Friday, January 24th, 2020](https://www.cnbc.com/2020/01/24/coronavirus-closes-shanghai-disney-tech-layoffs-and-stumpf-ban.html)\n\n* U.S. stock futures are pointing to a higher open ahead of the Friday session, with the final disposition of the holiday-shortened trading week still to be determined. The Dow is currently on track to post a losing week, its second in four weeks, while the Nasdaq is likely to rise for the seventh week in a row after a record close Thursday. The S&amp;P 500 is just below breakeven for the week, and would post its eighth weekly gain in since weeks if it can erase that deficit. (CNBC)\nAmerican Express (AXP), a Dow component, releases earnings before today’s opening bell. No major earnings reports are scheduled after today’s closing bell, and no economic reports out today. (CNBC)\n* Dow stock Intel (INTC) was rising 5% in premarket trading after the chipmaker reported better-than-expected adjusted quarterly profit and revenue after the bell Thursday. Results were helped by improvement in personal computer and data center demand, and Intel also gave an upbeat current quarter outlook as well as announcing a 5% dividend increase. (CNBC)\n* A large broadcast satellite, owned by AT&amp;T’s (T) DirecTV, built by Boeing (BA) and operated by Intelsat (I), suffered major damage to its batteries in December and is now at risk of exploding. The satellite is notably several years beyond its intended lifespan. (CNBC)\n* Boeing reschedules 777X plane’s first test flight for today (Reuters)\n* China’s National Health Commission said as many as 26 people have died from a fast-spreading coronavirus, as the total number of confirmed cases in the country rose to 830. Multiple cases of the virus have been confirmed in Thailand, Vietnam, South Korea and Japan, while the United States, Taiwan and Singapore have each reported one case. China has extended its travel ban to 13 cities, covering 35 million people. (CNBC &amp; NY Times)\n* CDC: Level 3 health warning for coronavirus; State Department: Level 2 travel advisory (CNBC)\n* China to build 1000-bed hospital over weekend (Reuters)\n* Social controls, SARS experience help China close off cities (AP)\n* Walt Disney’s (DIS) Shanghai Disney Resort will be closed until further notice to help China stop the spread of the flu-like virus, costing the theme park operator revenue during the country’s biggest holiday season. China is on a seven-day Lunar New Year holiday, a period when the Shanghai Disney park would be usually packed with tourists. (Reuters)\n* The World Economic Forum is wrapping up today in Davos, Switzerland. A Hong Kong property developer said the U.S. chose the wrong decade to start a trade conflict with China. “They should have picked the war 10 years ago,” said David Chiu, chairman of Far East Consortium International. (CNBC)\n* George Soros rips Trump and Xi, says the ‘fate of the world’ is at stake in 2020 (CNBC)\n* Soros says Xi is the ‘most dangerous’ opponent of those who believe in open society (CNBC)\n* Soros warns Trump of potential economic doom before election (CNBC)\n* Soros says Elizabeth Warren ’is the most qualified to be president’ (CNBC)\n* Democrats will press their final day of arguments today before skeptical Republican senators at President Trump’s impeachment trail, focusing on the second article of impeachment, obstruction of Congress’ investigation. House prosecutors made an expansive case yesterday that he abused power like no other president in history, swept up by a “completely bogus” Ukraine theory pushed by attorney Rudy Giuliani. (AP)\n* Former VP Joe Biden leads other candidates for the Democratic presidential nomination, while several others appeared to be gaining momentum in their bid for the White House, according to a Reuters/Ipsos national opinion poll. The online poll showed that 24% of registered Democrats and independents supported Biden, while 20% backed U.S. Senator Bernie Sanders and 12% said they would vote for U.S. Senator Elizabeth Warren.\n* The Trump administration is set to release a report today that outlines its short-term and long-term plans for enlisting e-commerce companies to combat counterfeit products on their platforms. The Wall Street Journal reported that law enforcement will begin identifying cases immediately and “seek all available statutory authorities to pursue civil fines and other penalties against these entities.”\n* J.P. Morgan Chase (JPM) CEO Jamie Dimon got a 1.6% raise to $31.5 million for his work in 2019 after his bank posted record earnings and shares of the company surged. Dimon’s compensation package includes $1.5 million in salary and $30 million in performance-based incentives. (CNBC)\n* The U.S. government announced that former Wells Fargo CEO John Stumpf has been banned from ever working at a bank again and will pay $17.5 million for scandals in which millions of fake accounts were set up to meet sales quotas. Regulators plans to target other individuals, including former executives, for their role in the scandals. (CNBC)\n* Home DNA-testing company 23andMe is laying off about 100 people, or 14% of its staff, on Thursday, in the wake of declining sales. The company plans to tighten its focus on the * DTC business and its therapeutics arm while scaling back its clinical studies arm. Additionally, TripAdvisor is planning to cut 200 jobs, or 5% of its total workforce. (CNBC)\n* Jim Lehrer, co-host and later host of the nightly PBS “NewsHour” that for decades offered a thoughtful take on current events, has died. He was 85. Lehrer died “peacefully in his sleep,” according to PBS. He had suffered a heart attack in 1983 and more recently, had undergone heart valve surgery in April 2008. (AP)\n\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](http://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://finviz.com/publish/012420/sec_all_075225549.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/WVNuazs.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/qC4OLxU.png)**)\n\n*****\n\n#NEXT WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR NEXT WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/mbOqHih.png)**)\n\n*****\n\n#NEXT WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR NEXT WEEK'S UPCOMING IPO'S!](https://i.imgur.com/ueyg2Ui.png)**)\n\n*****\n\n#NEXT WEEK'S EARNINGS CALENDAR:\n######(**[CLICK HERE FOR NEXT WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/bAJoxEr.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n*($AXP $NEE $ERIC $SYF $NEP $APD $SNV $HRC $IBKC $MOG.A $SIFY $SPFI $ESXB)*\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/tgxTcfa.jpg)**)\n\n*****\n\n#THIS AFTERNOON'S POST-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS CALENDAR!]()**)\nNONE.\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/XIw1nDI.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!]()**)\nNONE.\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/I3J14LQ.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/c5LUfh9.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/lIGsxQh.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S UPGRADES/DOWNGRADES LINK #4!](https://i.imgur.com/CHrTWnJ.png)**)\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/ElgfPhM.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!](https://i.imgur.com/7ndTlZ0.png)**)\n\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS:\n\n* DIS\n* INTC\n* AXP\n* EPZM\n* NNVC\n* CVM\n* NEE\n* SYF\n* BLDP\n* ERIC\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2020/01/24/stocks-making-the-biggest-moves-premarket-intel-american-express-disney-broadcom-more.html)**)\n\n*****\n\n&gt; **American Express (AXP)** – American Express reported quarterly earnings of $2.03 per share, 2 cents a share above estimates. Revenue was slightly above consensus. The financial services giant said revenue growth during 2019 was driven by higher card fee income as well as increased spending by cardholders.\n\n&gt; #**STOCK SYMBOL:** AXP\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AXP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AXP)**)\n\n*****\n\n&gt; **Intel (INTC)** – Intel reported quarterly profit of $1.52 per share, beating the consensus estimate of $1.25. The chipmaker’s revenue also exceeded Wall Street forecasts, helped by an improvement in personal computer and data center demand. Intel also gave an upbeat current-quarter outlook, as well as announcing a 5% dividend increase.\n\n&gt; #**STOCK SYMBOL:** INTC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=INTC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/INTC)**)\n\n*****\n\n&gt; **Walt Disney (DIS)** – The Shanghai Disney resort will close until further notice, as officials try to stop the spread of the coronavirus. The closure comes during China’s seven-day Lunar New Year holiday, normally an extremely busy time for the resort.\n\n&gt; #**STOCK SYMBOL:** DIS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DIS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DIS)**)\n\n*****\n\n&gt; **Ericsson (ERIC)** – Ericsson posted a smaller-than-expected profit for the fourth quarter, with the Swedish telecom equipment maker hit by higher costs for 5G development as well as a weaker U.S. market.\n\n&gt; #**STOCK SYMBOL:** ERIC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ERIC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ERIC)**)\n\n*****\n\n&gt; **Broadcom (AVGO)** – Broadcom struck a deal to supply Apple (AAPL) with wireless components for Apple products through 2023, in a transaction worth an estimated $15 billion. Apple currently accounts for about 20% of Broadcom’s annual revenue.\n\n&gt; #**STOCK SYMBOL:** AVGO\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AVGO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AVGO)**)\n\n*****\n\n&gt; **Skyworks Solutions (SWKS)** – Skyworks shares are under pressure following the news that competitor Broadcom signed an Apple supply deal. Skyworks reported better-than-expected quarterly profit of $1.68 per share, 3 cents a share above estimates. Revenue also came in above forecasts.\n\n&gt; #**STOCK SYMBOL:** SWKS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SWKS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SWKS)**)\n\n*****\n\n&gt; **Intuitive Surgical (ISRG)** – Intuitive Surgical beat estimates by 10 cents a share, with adjusted quarterly earnings of $3.48 per share. The surgical instruments maker’s revenue also came in above Wall Street projections. Procedures performed with the company’s Da Vinci robotic surgical devices increased by 19% during the quarter compared to a year earlier.\n\n&gt; #**STOCK SYMBOL:** ISRG\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ISRG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ISRG)**)\n\n*****\n\n&gt; **E*Trade Financial (ETFC)** – E*Trade earned an adjusted 84 cents per share for the fourth quarter, a penny a share above estimates. Revenue also came in above consensus. The bottom line number excludes 8 cents a share of negative impact from restructuring and special charges. The online brokerage company saw a drop in net interest income and higher non-interest expenses but also reported record customer trading activity.\n\n&gt; #**STOCK SYMBOL:** ETFC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ETFC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ETFC)**)\n\n*****\n\n&gt; **Discover Financial (DFS)** – Discover came in a penny a share above estimates, with quarterly earnings of $2.25 per share. Revenue was essentially in line with forecasts. Evercore downgraded the credit card and financial services provider to “underperform” from “in line” following the report, saying it sees pressure on Discover’s bottom line this year from higher investments, increased credit costs, and fewer buybacks.\n\n&gt; #**STOCK SYMBOL:** DFS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DFS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DFS)**)\n\n*****\n\n&gt; **Generac (GNRC)** – Oppenheimer upgraded the maker of power generators to “outperform” from “perform,” based on expectations of solid revenue growth. Oppenheimer points to the emergence of the California market for Generac, as well as sustained strength in core demand fundamentals.\n\n&gt; #**STOCK SYMBOL:** GNRC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=GNRC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/GNRC)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/stocks?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Friday, January 24th, 2020! :)**",
        "subreddit": "stocks",
        "title": "Today's Pre-Market Movers &amp; News [Friday, January 24th, 2020]",
        "url": "https://www.reddit.com/r/stocks/comments/etad3k/todays_premarket_movers_news_friday_january_24th/",
        "created": 1579901083.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1579872479,
        "id": "etaeff",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/smallstreetbets sub! Happy Friday to all! Here are your pre-market mover &amp; news this AM-\n\n*****\n\n#[Today's Top Headlines for Friday, January 24th, 2020](https://www.cnbc.com/2020/01/24/coronavirus-closes-shanghai-disney-tech-layoffs-and-stumpf-ban.html)\n\n* U.S. stock futures are pointing to a higher open ahead of the Friday session, with the final disposition of the holiday-shortened trading week still to be determined. The Dow is currently on track to post a losing week, its second in four weeks, while the Nasdaq is likely to rise for the seventh week in a row after a record close Thursday. The S&amp;P 500 is just below breakeven for the week, and would post its eighth weekly gain in since weeks if it can erase that deficit. (CNBC)\nAmerican Express (AXP), a Dow component, releases earnings before today’s opening bell. No major earnings reports are scheduled after today’s closing bell, and no economic reports out today. (CNBC)\n* Dow stock Intel (INTC) was rising 5% in premarket trading after the chipmaker reported better-than-expected adjusted quarterly profit and revenue after the bell Thursday. Results were helped by improvement in personal computer and data center demand, and Intel also gave an upbeat current quarter outlook as well as announcing a 5% dividend increase. (CNBC)\n* A large broadcast satellite, owned by AT&amp;T’s (T) DirecTV, built by Boeing (BA) and operated by Intelsat (I), suffered major damage to its batteries in December and is now at risk of exploding. The satellite is notably several years beyond its intended lifespan. (CNBC)\n* Boeing reschedules 777X plane’s first test flight for today (Reuters)\n* China’s National Health Commission said as many as 26 people have died from a fast-spreading coronavirus, as the total number of confirmed cases in the country rose to 830. Multiple cases of the virus have been confirmed in Thailand, Vietnam, South Korea and Japan, while the United States, Taiwan and Singapore have each reported one case. China has extended its travel ban to 13 cities, covering 35 million people. (CNBC &amp; NY Times)\n* CDC: Level 3 health warning for coronavirus; State Department: Level 2 travel advisory (CNBC)\n* China to build 1000-bed hospital over weekend (Reuters)\n* Social controls, SARS experience help China close off cities (AP)\n* Walt Disney’s (DIS) Shanghai Disney Resort will be closed until further notice to help China stop the spread of the flu-like virus, costing the theme park operator revenue during the country’s biggest holiday season. China is on a seven-day Lunar New Year holiday, a period when the Shanghai Disney park would be usually packed with tourists. (Reuters)\n* The World Economic Forum is wrapping up today in Davos, Switzerland. A Hong Kong property developer said the U.S. chose the wrong decade to start a trade conflict with China. “They should have picked the war 10 years ago,” said David Chiu, chairman of Far East Consortium International. (CNBC)\n* George Soros rips Trump and Xi, says the ‘fate of the world’ is at stake in 2020 (CNBC)\n* Soros says Xi is the ‘most dangerous’ opponent of those who believe in open society (CNBC)\n* Soros warns Trump of potential economic doom before election (CNBC)\n* Soros says Elizabeth Warren ’is the most qualified to be president’ (CNBC)\n* Democrats will press their final day of arguments today before skeptical Republican senators at President Trump’s impeachment trail, focusing on the second article of impeachment, obstruction of Congress’ investigation. House prosecutors made an expansive case yesterday that he abused power like no other president in history, swept up by a “completely bogus” Ukraine theory pushed by attorney Rudy Giuliani. (AP)\n* Former VP Joe Biden leads other candidates for the Democratic presidential nomination, while several others appeared to be gaining momentum in their bid for the White House, according to a Reuters/Ipsos national opinion poll. The online poll showed that 24% of registered Democrats and independents supported Biden, while 20% backed U.S. Senator Bernie Sanders and 12% said they would vote for U.S. Senator Elizabeth Warren.\n* The Trump administration is set to release a report today that outlines its short-term and long-term plans for enlisting e-commerce companies to combat counterfeit products on their platforms. The Wall Street Journal reported that law enforcement will begin identifying cases immediately and “seek all available statutory authorities to pursue civil fines and other penalties against these entities.”\n* J.P. Morgan Chase (JPM) CEO Jamie Dimon got a 1.6% raise to $31.5 million for his work in 2019 after his bank posted record earnings and shares of the company surged. Dimon’s compensation package includes $1.5 million in salary and $30 million in performance-based incentives. (CNBC)\n* The U.S. government announced that former Wells Fargo CEO John Stumpf has been banned from ever working at a bank again and will pay $17.5 million for scandals in which millions of fake accounts were set up to meet sales quotas. Regulators plans to target other individuals, including former executives, for their role in the scandals. (CNBC)\n* Home DNA-testing company 23andMe is laying off about 100 people, or 14% of its staff, on Thursday, in the wake of declining sales. The company plans to tighten its focus on the * DTC business and its therapeutics arm while scaling back its clinical studies arm. Additionally, TripAdvisor is planning to cut 200 jobs, or 5% of its total workforce. (CNBC)\n* Jim Lehrer, co-host and later host of the nightly PBS “NewsHour” that for decades offered a thoughtful take on current events, has died. He was 85. Lehrer died “peacefully in his sleep,” according to PBS. He had suffered a heart attack in 1983 and more recently, had undergone heart valve surgery in April 2008. (AP)\n\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](http://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://finviz.com/publish/012420/sec_all_075225549.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/WVNuazs.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/qC4OLxU.png)**)\n\n*****\n\n#NEXT WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR NEXT WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/mbOqHih.png)**)\n\n*****\n\n#NEXT WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR NEXT WEEK'S UPCOMING IPO'S!](https://i.imgur.com/ueyg2Ui.png)**)\n\n*****\n\n#NEXT WEEK'S EARNINGS CALENDAR:\n######(**[CLICK HERE FOR NEXT WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/bAJoxEr.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n*($AXP $NEE $ERIC $SYF $NEP $APD $SNV $HRC $IBKC $MOG.A $SIFY $SPFI $ESXB)*\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/tgxTcfa.jpg)**)\n\n*****\n\n#THIS AFTERNOON'S POST-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS CALENDAR!]()**)\nNONE.\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/XIw1nDI.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!]()**)\nNONE.\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/I3J14LQ.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/c5LUfh9.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/lIGsxQh.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S UPGRADES/DOWNGRADES LINK #4!](https://i.imgur.com/CHrTWnJ.png)**)\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/ElgfPhM.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!](https://i.imgur.com/7ndTlZ0.png)**)\n\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS:\n\n* DIS\n* INTC\n* AXP\n* EPZM\n* NNVC\n* CVM\n* NEE\n* SYF\n* BLDP\n* ERIC\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2020/01/24/stocks-making-the-biggest-moves-premarket-intel-american-express-disney-broadcom-more.html)**)\n\n*****\n\n&gt; **American Express (AXP)** – American Express reported quarterly earnings of $2.03 per share, 2 cents a share above estimates. Revenue was slightly above consensus. The financial services giant said revenue growth during 2019 was driven by higher card fee income as well as increased spending by cardholders.\n\n&gt; #**STOCK SYMBOL:** AXP\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AXP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AXP)**)\n\n*****\n\n&gt; **Intel (INTC)** – Intel reported quarterly profit of $1.52 per share, beating the consensus estimate of $1.25. The chipmaker’s revenue also exceeded Wall Street forecasts, helped by an improvement in personal computer and data center demand. Intel also gave an upbeat current-quarter outlook, as well as announcing a 5% dividend increase.\n\n&gt; #**STOCK SYMBOL:** INTC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=INTC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/INTC)**)\n\n*****\n\n&gt; **Walt Disney (DIS)** – The Shanghai Disney resort will close until further notice, as officials try to stop the spread of the coronavirus. The closure comes during China’s seven-day Lunar New Year holiday, normally an extremely busy time for the resort.\n\n&gt; #**STOCK SYMBOL:** DIS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DIS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DIS)**)\n\n*****\n\n&gt; **Ericsson (ERIC)** – Ericsson posted a smaller-than-expected profit for the fourth quarter, with the Swedish telecom equipment maker hit by higher costs for 5G development as well as a weaker U.S. market.\n\n&gt; #**STOCK SYMBOL:** ERIC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ERIC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ERIC)**)\n\n*****\n\n&gt; **Broadcom (AVGO)** – Broadcom struck a deal to supply Apple (AAPL) with wireless components for Apple products through 2023, in a transaction worth an estimated $15 billion. Apple currently accounts for about 20% of Broadcom’s annual revenue.\n\n&gt; #**STOCK SYMBOL:** AVGO\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AVGO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AVGO)**)\n\n*****\n\n&gt; **Skyworks Solutions (SWKS)** – Skyworks shares are under pressure following the news that competitor Broadcom signed an Apple supply deal. Skyworks reported better-than-expected quarterly profit of $1.68 per share, 3 cents a share above estimates. Revenue also came in above forecasts.\n\n&gt; #**STOCK SYMBOL:** SWKS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SWKS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SWKS)**)\n\n*****\n\n&gt; **Intuitive Surgical (ISRG)** – Intuitive Surgical beat estimates by 10 cents a share, with adjusted quarterly earnings of $3.48 per share. The surgical instruments maker’s revenue also came in above Wall Street projections. Procedures performed with the company’s Da Vinci robotic surgical devices increased by 19% during the quarter compared to a year earlier.\n\n&gt; #**STOCK SYMBOL:** ISRG\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ISRG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ISRG)**)\n\n*****\n\n&gt; **E*Trade Financial (ETFC)** – E*Trade earned an adjusted 84 cents per share for the fourth quarter, a penny a share above estimates. Revenue also came in above consensus. The bottom line number excludes 8 cents a share of negative impact from restructuring and special charges. The online brokerage company saw a drop in net interest income and higher non-interest expenses but also reported record customer trading activity.\n\n&gt; #**STOCK SYMBOL:** ETFC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ETFC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ETFC)**)\n\n*****\n\n&gt; **Discover Financial (DFS)** – Discover came in a penny a share above estimates, with quarterly earnings of $2.25 per share. Revenue was essentially in line with forecasts. Evercore downgraded the credit card and financial services provider to “underperform” from “in line” following the report, saying it sees pressure on Discover’s bottom line this year from higher investments, increased credit costs, and fewer buybacks.\n\n&gt; #**STOCK SYMBOL:** DFS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DFS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DFS)**)\n\n*****\n\n&gt; **Generac (GNRC)** – Oppenheimer upgraded the maker of power generators to “outperform” from “perform,” based on expectations of solid revenue growth. Oppenheimer points to the emergence of the California market for Generac, as well as sustained strength in core demand fundamentals.\n\n&gt; #**STOCK SYMBOL:** GNRC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=GNRC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/GNRC)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/smallstreetbets?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Friday, January 24th, 2020! :)**",
        "subreddit": "smallstreetbets",
        "title": "Today's Pre-Market Movers &amp; News [Friday, January 24th, 2020]",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/etaeff/todays_premarket_movers_news_friday_january_24th/",
        "created": 1579901279.0
    },
    {
        "author": "brosephjones77",
        "created_utc": 1578953179,
        "id": "eob8p3",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Here is estimate of money I want to invest in each stock:\n\nSTOCKS-\n\nVerizon (VZ)- $600\nVisa (V)- $800\nApple (AAPL)- $1,500\nAmazon (AMZN) - $1,900\nMicrosoft (MSFT)- $4,000\nTesla (TSLA)- $1,500\nAbbievie (ABBV)- $500\nChase (JPM)- $1,000\nSkyworks (SWKS) - $500\nCRISPR (CRSP) - $500\nNvidia (NVDA) - $750\nAlphabet (GOOGL)- $1,400\n\nTotal Cost ~ $15,000\n\nAre these good choices? Also, the cost of all those stocks tally up to $15000. What would be the best way to cut $3000 form this list? Any suggestions helpful!",
        "subreddit": "stocks",
        "title": "First Time Investor with $12000 to Invest! Need help!",
        "url": "https://www.reddit.com/r/stocks/comments/eob8p3/first_time_investor_with_12000_to_invest_need_help/",
        "created": 1578981979.0
    }
]