[
    {
        "author": "RETAW57",
        "created_utc": 1586162730,
        "id": "fvv80i",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Hello /r/investing friends,\n\nI'm an Australian, and just wanted to hear your perspectives on the difference between now and December 2018. The December 2018 correction was well overdue, but reversed quickly and failed to even enter a bear market, since the Bull sentiment was too strong.\n\nP/E for many companies are still sky high (and will be even higher once they start getting revised)\n\nDJIA - 2018 - 21712.53  Now - 21052.53\n\nDow Jones is nearly at same level as 2018 December and that's despite Boeing almost collapsing from it's former heights and was happening even without coronavirus (sad to see one of my past favourite companies in this state, but c'est la vie)\n\nS&amp;P500 - 2018 - 2346.58 Now - 2488.65\n\nS&amp;P 500 is signficantly higher now than then despite the material damage and reduction in earnings and increase in debt of most constituent companies. XOM, CVX, AAL, CCL, RCL are the well knowns but even HON, 3M, DXC and most other constituents are expecting heavy losses or revisions.\n\nNASDAQ - 2018 - 6190.17 Now - 7373.08\n\nNASDAQ is signficantly higher despite many of it's unicorns and stars like TESLA, UBER (which tbf didn't exist in 2018). But let's ignore that one, the tech bubble will keep going for a bit still.\n\nNYSE - 2018 - 10724.19 Now - 9880.63\n\nNYSE despite oil, airlines, retail, engineering, resources companies facing signficant losses/debt.\n\nDAX - 2018 - 10279.20 Now - 9882.68 (at time of post)\n\nDAX is barely down on it's DEC 2018 low, despite Lufthansa being brought to it's knees, Adidas with major sales and supply disruption, VW BMW and Daimler losing sales and money (for Daimler this is worse with F1) to name a few major impacts. Plus the already strained deutshce bank, post and reduction in business for siemens, eon, BASF.\n\nCAC40 - 2018 - 4555.99 Now - 4284.94\n\nCAC is headstrong despite many major REIT's, hotels airlines, fashion brands which will have material impact and be only servicing a debt till maybe Q4 this year.\n\nASX200 - 2018 - 5410.20 Now - 5286.80\n\nASX200 is barely worse off despite China's demand for resources materially impacted, Australian banks being asked to take the burden of the pandemic, REIT's &amp; travel agents just left servicing debt, one our two major airlines going bankrupt by June, Major Casino's and retailers servicing debt for 6 months.\n\n&amp;#x200B;\n\nSo if you read that, congrats, but if not, all good.... but my question is... \\*at these prices... how is the material impact, job losses, etc priced in as many here say? And how are we already going to be rebounding, when the situation right now is way worse than Dec 2018, and yet we see similar pricing?\\*\n\nSky High PE's, Mounting Debt, Poorer leverage, Lack of expansions/project? Is this some weird Bear bubble?\n\nIs some extra stimulus priced in? Because currently most stimulus is loans, which will still burden companies, heck, Australia has given practically nothing to businesses over 500 mil (which comprise most of our ASX), besides to one childcare provider.",
        "subreddit": "investing",
        "title": "Dec 2018 vs Now..",
        "url": "https://www.reddit.com/r/investing/comments/fvv80i/dec_2018_vs_now/",
        "created": 1586191530.0
    },
    {
        "author": "Reeeetail_Investor",
        "created_utc": 1587747767,
        "id": "g7c35k",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "DXC Technology Company, together with its subsidiaries, provides  information technology services and solutions primarily in North  America, Europe, Asia, and Australia. It operates in two segments,  Global Business Services (GBS) and Global Infrastructure Services (GIS). \n\nThe GBS segment offers technology solutions comprising enterprise,  cloud application, and consulting services; application services;  analytics services; business process services; and industry software and  solutions. The GIS segment provides cloud and platform services;  workplace, mobility, and Internet of Things services; and security  solutions. \n\nThe company was formerly known as Computer Sciences  Corporation and changed its name to DXC Technology Company in April 2017  as a result of its merger with the Enterprise Services business of  Hewlett Packard Enterprise Company. DXC Technology Company was founded  in 1959 and is headquartered in Tysons, Virginia.\n\n**52 week high/low**\n\n67.09/7.90\n\nIt's currently trading at 15.63.\n\n**Financials**\n\nCash on hand:\n\nCurrent Ratio: .93\n\nDebt/Equity: .97\n\nBook Value: $35.90/share\n\nPrice target 2021: $33/share\n\n**Technicals**\n\nRSI: 50.95\n\nMACD: At signal, momentum UP\n\nSupport: 15.67\n\nResistance: 36.25\n\nStochastic: 58.25\n\nBollinger Bands: Squeeze\n\n**Potential Plays**\n\nDXC 15c 1/15/21\n\nDXC 17.5c 1/15/21",
        "subreddit": "smallstreetbets",
        "title": "DXC",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/g7c35k/dxc/",
        "created": 1587776567.0
    },
    {
        "author": "BattletoadRash",
        "created_utc": 1586099270,
        "id": "fvf4dm",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "What do you guys think?\n\nBrief history: Computer Sciences Corporation (CSC), a \\~$16B IT company (2/3 commercial, 1/3 govt.) spun off their govt side a few years back into CS Gov Solutions, which then merged with SRA to form CSRA, who was subsequently bought by GDIT. Anyway...\n\nThe larger commercial side stayed as CSC and merged in 2017 with the Enterprise Services side of HPE to form DXC, doing \\~$25B in annual rev.\n\nInvestors where initially very bullish on this merger, and took DXC from a $25 stock in May '16 to a $95 stock in Sept '18. Since those highs, the stock has plummeted all the way to 8 bucks at its low a few weeks ago and is currently sitting just below 12 bucks. They recently announced they're selling off their healthcare business to a PE firm for $5B in cash to help pay down debt.\n\nSo what's the outlook here? With the low stock price, their 21 cent quarterly dividend yields 7% though it could certainly be in jeopardy. Dividend aside, I see this a huge potential growth opportunity. \n\nThere's risk involved, for sure, but I'd argue it's less risky than a cruise line or airline right now. Interested to see what you fine folks think. Cheers.",
        "subreddit": "investing",
        "title": "DXC Technology",
        "url": "https://www.reddit.com/r/investing/comments/fvf4dm/dxc_technology/",
        "created": 1586128070.0
    },
    {
        "author": "SPYFAG",
        "created_utc": 1587526075,
        "id": "g5tt23",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Down 75% since IPO in 2017\n\n•Positive cash flow \n•$3.5B market cap\n•consistently have $2.5B cash on hand (could buy 71% of shares on a moments notice)\n•$7B LTD\n•pending sale of subsidiary for $5B (Claimed to be paying back LTD)\n•great track record of flipping companies for ridiculous profits\n•10% dividend \n\nEarnings fluctuates annually due to nature of their business (buying companies, fixing them, and selling)\n\nLong term trend 📈\n\nIn my humble opinion .... one of the most undervalued stocks on the market. This is a buy and hold to mellow out your penny fluctuations.",
        "subreddit": "pennystocks",
        "title": "DXC Technologies",
        "url": "https://www.reddit.com/r/pennystocks/comments/g5tt23/dxc_technologies/",
        "created": 1587554875.0
    }
]