[
    {
        "author": "cookingboy",
        "created_utc": 1580153461,
        "id": "eusz3g",
        "num_comments": 683,
        "num_crossposts": 0,
        "selftext": "**Disclamer**: This isn’t a fear mongering post about the virus itself. To put it into perspective the Swine Flu epidemic of 2009 has over 110k confirmed cases and close to 4000 deaths in the US alone yet many people don’t even remember that. But that’s for a different discussion in a different sub.\n\nI’m currently in Shanghai now, from my observation people in the West are not spending enough time talking about how devastating this virus has been to the Chinese economy and its certain global ramifications.\n\nLet’s take the city of Shanghai for example. It’s not one of the more heavily impacted cities, it’s not quarantined and people can mostly come and go freely. Many businesses are still open, from restaurants to malls.\n\nHowever for the first time ever I saw an Apple store with more employees than customers, and an open Starbucks with absolutely zero customers inside. The streets on a Saturday afternoon were about as empty as it would be at midnight on a regular weekday. All of this is happening during what’s supposed to be the  busiest week for consumer spendings in China.\n\nThe worst part is this doesn’t seem like it will change any time soon. Shanghai just announced that they will extend the CNY holidays by another week and people will like remain fearful for the coming weeks, if not months if we don’t see a dramatic turnaround of the virus situation.\n\nWhat this means is that any Western company that relies significantly on China for revenue would see their first quarter earning absolutely *crushed*, especially considering their forecasts were done with the assumption of this quarter being the best quarter of the year. For example I’m foreseeing Apple miss their Greater China’s revenue by as much as 50% this quarter, and it would be even worse for companies like GM, Ford and the airlines.\n\nFurther more this will impact the global manufacturing and supply chain significantly. I don’t know enough to model out a detailed scenario but my gut feeling tells me a prolonged manufacturing shutdown across major Chinese cities would be more than a little disruptive in that regard.\n\nI’m discounting the impact of the virus if it were spread to other countries in any significant numbers, but even considering the situation in China alone it’s extremely worrying.",
        "subreddit": "investing",
        "title": "People aren’t fully realizing the economic impact of the Chinese Corona Virus",
        "url": "https://www.reddit.com/r/investing/comments/eusz3g/people_arent_fully_realizing_the_economic_impact/",
        "created": 1580182261.0
    },
    {
        "author": "jeweled_sky",
        "created_utc": 1577914666,
        "id": "eio7dn",
        "num_comments": 643,
        "num_crossposts": 0,
        "selftext": "The year is 2017, my parents had a successful real estate business with over a dozen rental properties and several fix and flip projects in production. Our assets totaled a million and a half after paying off all loans if we ever liquidated everything. Which we did, and that’s just the tip of the iceberg.\n\nMy oldest brother made the brilliant decision that because he lost his job, he should start day trading. He quickly made $30k on Apple by yoloing his saving in shares before an Apple products release event. Excited by this, he made an entire PowerPoint presentation convincing the family to get into day trading. We were reluctant at first, and I wish it stayed that way.\n\nIn the background he worked with my parents in setting up a family company and opening trading accounts and buying courses. Keep in mind my parents will do anything he says, completely wrapped around his finger. During this time I was getting into the house flipping business in full swing. Working on my parents properties and going to auctions for future projects. I had already set up in my mind that I was going to be a real estate investor because it was the only work I actually enjoyed doing, my parents were very profitable, and even after the 2008 housing market crash, when we lost everything, they were able to bounce back.\nThen one day everything stopped, my parents stopped working real estate and with no capital of my own I couldn’t continue doing it myself. \n\nThey liquidated most of their assets and set up trading accounts with TD. They tried setting up weekly quotas and profit targets, which looking back, were really unrealistic. We needed 20k per month and sometimes more to cover loans from the very last rentals that hadn’t sold just yet. So naturally while they were on the market the quota for the month was 20k...for inexperienced day traders. It dawned on me that money is easy to make every month when a tenant gives it to you rather than we ourselves have to endure risk to make it, but my parents didn’t listen to me, it had to be my brothers way.\n\nYou can probably guess what happened. Loss after loss made our account grow smaller and smaller; and the smaller it got the more we had to risk to make bigger profits. Which only happened once where I made nearly 50k trading Netflix on its highest volume day in 2018. That quickly gotten absorbed by bills. But. By 2018 we were already down some 200k and our bills had been quickly eating up our saving. All the way to the point we starting taking loans just cover expenses and continue trading. Then one day I lost 80k on netflix when it’s earnings made it drop nearly a hundred dollars. If it went up well I’d be into real estate again. I nearly had a heart attack and stayed in bed for I don’t even know how long. If it weren’t for my girlfriend I think I might have killed myself.\n\nWe were forced to live in our last property for a few months before selling it to avoid foreclosure and then my entire family moved into a 1 bedroom apartment my brother still had in Pasadena. Which is an urban city so the rent was 3k. Which was nearly impossible to pay. We did Uber Eats deliveries every single day to just try to make enough money to eat and did some trading with money we borrowed from our extended family. All of our credit scores were shot and there was nothing left to borrow on. Then we sold our very last property and made 100k on the sale. Which we lost.\n\nNearly all of our losses were on options, and they were a direct result of our trading strategy, which was laughable. They set guidelines for the option expiration, loss tolerance, and investment amount(no swing trading). Which hey sounds great why not. Except that when our expenses were so great, the low risk meant we were burning more than we were making, the stress made me make some good and bad trades in an attempt to save my family from ruin. On some trades I would have made literal hundreds of thousands if my parents and older brother didn’t force sell my positions because they couldn’t stomach swing a loss(16k in HD $215 strike bought at $201 and it reached $215 a day before expiration which would have been a $170k profit because instead was forced to be a $2k loss). It really kills your heart to see how much money you could have made, not because you took profits too early, because no one believed you and took a loss on your behalf.\n\nWith no more options we packed up and moved to Maryland were my older brother got a 100k plus job coding websites. Things were good for a while and with no rush to cover rent or bills I was actually able to grow a small account from 4K to 17k. All good things must come to end sadly. He developed MS because of the stress of losing hundreds of thousands in a few years and his relationship was failing as well. These things affected his ability to learn new programing languages or work efficiently so his job fired him. Then it was up to me to make enough to cover the expenses and slowly I saw the account cannibalized to 0. They blame me almost exclusively for losing all the money by the way.\n\nWe moved back to California being forced to stay within the same apartment complex company because no where else will accept us. Now my brother is suicidal, he’s also diabetic and he’s tried killing himself by overdosing on insulin. His hope is at 0. I’ve matured more than any young adult should have from this ordeal so I feel like I can keep going. But moral is low. My parents work nearly 14 hours a day driving for Uber eats. I can’t really help because I had my ankle fused back in July. My other brother doesn’t live with us anymore because of all the chaos that happened. My parents have real estate licenses and they are trying really hard to find clients. I wish there was more I can do. I learned I should have fought more for our family to continue real estate investing. Nothing made us happier than flipping houses. If I had the opportunity to flip a house I’m sure we could jumpstart that career with my parents’ experience. I’m not against trading even after losing everything, sadly it took that much for me to do it half decently. I’m sticking to vertical spreads on etfs and precious metals, which brings in some profits every few weeks but not enough to make living. Sometimes I’ll use around $50 on near expiration out of the money calls of puts to try to get lucky. Sometimes the temptation to let my whole account ride on naked options is strong. Not because I want to be rich, but because I just want my parents to stop working so hard in something they don’t even enjoy doing at their age. I wanted to share my story because I saw how some of you guys shared similar experiences, and some of you were the exceptions that won in the end. Invest in real estate, it’s profitable if you work with someone who has experience and the market hasn’t tanked. I’m going to Texas in a few days to propose to my girlfriend and bring her back to California. If she says yes it’ll be the highlight of my life.\n\nTLDR; Stocks bad, Real Estate good",
        "subreddit": "wallstreetbets",
        "title": "Day Trading, how I lost it all.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eio7dn/day_trading_how_i_lost_it_all/",
        "created": 1577943466.0
    },
    {
        "author": "DickzOutForHarambe",
        "created_utc": 1580312899,
        "id": "evole4",
        "num_comments": 625,
        "num_crossposts": 0,
        "selftext": "Bought $TSLA calls for $635, 2/7 expiry. Don’t even have enough in my bank account now to cover this. Honestly I barely know what options are and all I can see if that I somehow am down $200+ already today? Am I in trouble here? I prayed to Elon for almost a full minute today but it keeps going down :(",
        "subreddit": "wallstreetbets",
        "title": "ELI5 How Screwed Am I?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/evole4/eli5_how_screwed_am_i/",
        "created": 1580341699.0
    },
    {
        "author": "13beerbeer",
        "created_utc": 1578508371,
        "id": "elwpih",
        "num_comments": 506,
        "num_crossposts": 0,
        "selftext": "I bought in sub 250 and sold out at 350. I'm hating my life right now",
        "subreddit": "stocks",
        "title": "Is $TSLA in a bubble or was it just ridiculously undervalued?",
        "url": "https://www.reddit.com/r/stocks/comments/elwpih/is_tsla_in_a_bubble_or_was_it_just_ridiculously/",
        "created": 1578537171.0
    },
    {
        "author": "SUP4oc",
        "created_utc": 1580220719,
        "id": "ev62vt",
        "num_comments": 437,
        "num_crossposts": 0,
        "selftext": "Why do you do this to yourselves?\n\nWho hurt you? \n\nDid you know the Robinhood screen can turn green?\n\nBuy a call and see.",
        "subreddit": "wallstreetbets",
        "title": "Right now, bears are desperately refreshing their browser hoping more people are dead from disease",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ev62vt/right_now_bears_are_desperately_refreshing_their/",
        "created": 1580249519.0
    },
    {
        "author": "KissmyASSthmaa",
        "created_utc": 1577976085,
        "id": "eiz0o0",
        "num_comments": 339,
        "num_crossposts": 0,
        "selftext": "https://investor.vanguard.com/investing/vanguard-brokerage?cmpgn=RIG:OSM:TSM:RMTGTW:01022020:TXL:VID:XX:XX:CNEW:OTH:OTS:XX:XX:POST:VG:sf226347029&amp;sf226347029=1",
        "subreddit": "investing",
        "title": "Vanguard now offering 0$ commission for all stocks and ETFs",
        "url": "https://www.reddit.com/r/investing/comments/eiz0o0/vanguard_now_offering_0_commission_for_all_stocks/",
        "created": 1578004885.0
    },
    {
        "author": "Progr4mmatic",
        "created_utc": 1579531013,
        "id": "erdz3e",
        "num_comments": 299,
        "num_crossposts": 0,
        "selftext": "command|syntax\n\n:--|:--\n\n!buy|e.g.!buy %1 TSLA 530C 01/24/20%\n\n!sell| same pattern\n\n!positions| account information\n\nHere's the idea. We post a lot of yolos around here which is great and all but we don't really have much in terms of track records besides the yearly leaderboard thread. By tracking our trades we can give people reputation scores and learn who's really killing it. Initially the bot will be limited to $1000 a week so everyone starts off on the same foot. \n\nThe options chain data it uses is from a free api right now so it's delayed by an hour or so I think. I'll work on trying to get this running in real time.",
        "subreddit": "wallstreetbets",
        "title": "I created an options trade tracker bot.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/erdz3e/i_created_an_options_trade_tracker_bot/",
        "created": 1579559813.0
    },
    {
        "author": "BezosButthole",
        "created_utc": 1577997747,
        "id": "ej3xwd",
        "num_comments": 299,
        "num_crossposts": 0,
        "selftext": "I've been watching this site for forever and started trading in October with $5,000 and turned it into $40,000 trading earnings and Dis in Nov. It was awesome and I felt badass. \n\nAround Dec 1st I told my gf I would stop trading since I was having sleepless nights, stress headaches, and was somewhat obsessed with this shit. I had to get back in.... and that bad karma made me lose on almost every trade and added $30,000 of real money (to get above $25k) which I lost as well and am down currently $32,000 of real money in additions to all the gains from November. \n\nHere are some highlights: \n\nLulu earnings Dec 11th: I felt it would do well on earnings and lost $22,050 on a $25,000 yolo 10 minutes after purchasing. (My first big guh moment and I f'ing KNEW not to do this) \n\nNVDA Dec 23rd: Bought $25,000 of 1/10 calls that dipped 30 minutes after buying... got weak hands... and lost $13,384. (I bought at the ATH at the time and felt it would just keep going up) \n\nAMD Dec 26th: Bought $15,000 of AMD $50 calls at $47.10 (1/3 and 1/10)... dipped immediately after buying... got weak hands a couple days ago on Dec 30th... and sold around $45.80 for a $11,800 loss. Now I see that fucker is up around $49 today and figured it might since $50 seems doable next week. Fuck me and my shitty decisions... I knew I should have held until today with CES next week but Trump bombing Iraq got me twitchy and I just wanted out. (My $3k would be worth $18k if I would have stayed in one more day) \n\nThe highlight of November was selling my $28k of DIS fd's... 2 hours prior to the stock rocketing up once subscriber numbers were released. I took a $9,000 loss instead of a $150k+ gain. I still got in afterwards and it went up $40k.... which I held until it was a $12k gain and sold. (Selling 368 contracts 2 hours before subscriber numbers came out still makes my heart want to explode) \n\nWell that's my story. Not sure why I am posting but it kinda feels therapeutic in a way to let this shit out. I haven't told anyone since 1. Most my friends wouldn't understand 2. My gf would probably be pissed I lied to her. I have $3,200 left in my restricted from purchasing Robinhood account that I am transferring over to WeBull and the funds should be there in 2 days. I am thinking with earnings this month I can turn this $3,200 around with some smart purchases instead of yolo'ing stupidly. But maybe fucking not. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n [https://imgur.com/gallery/4kVnfVS](https://imgur.com/gallery/4kVnfVS)",
        "subreddit": "wallstreetbets",
        "title": "AMA: I am the world's worst trader - ASK ME ANYTHING",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ej3xwd/ama_i_am_the_worlds_worst_trader_ask_me_anything/",
        "created": 1578026547.0
    },
    {
        "author": "realister",
        "created_utc": 1578879623,
        "id": "enx5fh",
        "num_comments": 291,
        "num_crossposts": 0,
        "selftext": "According to her financial disclosures Nancy Pelosi purchased 30 $FB $140 strike calls expiring 1/17/20 (this Friday) and she paid 35.5 ($3550) for each of them in October 2018 right before the Christmas correction.\n\n She paid a total of around $105,000 for this trade. At one point her position was down more than 70% in January last year!\n\n[Pelosi Periodic Transaction Report](https://i.imgur.com/LRJWzB5.jpg)\n\nHow much is that position worth today? I did some quick backtesting in Thinkorswim to find out and those call options are now worth a cool **78.25 ($7250)**  \n\nhttps://i.imgur.com/DSd4pOr.png\n\nWhich comes out to around $130,000 profit. \n\n[Backtesting results in Thinkorswim](https://i.imgur.com/EE71dBh.png)\n\nIt looks like she did not have any secret info from her powerful friends before the huge correction in 2018 (she bought RIGHT before the dip) but she still came out on top anyway by having IRON HANDS and buying long dated LEAPS! \n\nJudging by her past actions she will most likely exercise these options and keep the shares of Facebook for now.",
        "subreddit": "wallstreetbets",
        "title": "Nancy Pelosi has 30 $140 strike $FB calls expiring this week how much money did she make? Lets do some backtesting and find out!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/enx5fh/nancy_pelosi_has_30_140_strike_fb_calls_expiring/",
        "created": 1578908423.0
    },
    {
        "author": "jinnyjuice",
        "created_utc": 1578125012,
        "id": "ejtvsq",
        "num_comments": 288,
        "num_crossposts": 0,
        "selftext": "With the competition getting stiff these days, I'm having a hard time deciding between the three with a casual Robinhood on the side.\n\nSome of the comparisons or information in general online are outdated these days, so I'm asking for help here.",
        "subreddit": "investing",
        "title": "Now that Vanguard charges no fees (though it was already no fees for some part), what's your choice of a platform? Vanguard, Schwab, or Ally?",
        "url": "https://www.reddit.com/r/investing/comments/ejtvsq/now_that_vanguard_charges_no_fees_though_it_was/",
        "created": 1578153812.0
    },
    {
        "author": "nabuko_donosor",
        "created_utc": 1579002795,
        "id": "eokaau",
        "num_comments": 284,
        "num_crossposts": 0,
        "selftext": "Literally everyone and their mother is making money right now.  How close are we to a blow off top in your opinion?",
        "subreddit": "stocks",
        "title": "Are we in the irrational exuberance phase?",
        "url": "https://www.reddit.com/r/stocks/comments/eokaau/are_we_in_the_irrational_exuberance_phase/",
        "created": 1579031595.0
    },
    {
        "author": "stormwillpass",
        "created_utc": 1578557237,
        "id": "em6pwa",
        "num_comments": 275,
        "num_crossposts": 0,
        "selftext": "Hey everyone, I appreciate the welfare checks after TSLA went up today. I had previously only posted about TSLA plays a few times, so it's flattering that you guys associate and know me for TSLA plays. I wasn't going to post this since I'm really embarrassed and ashamed that I let things get out of control. I feel like I let myself and everyone down.\n\nYes, I got screwed very hard. As I have been the past several weeks or so as it has been continuing up. I previously made over $65k at the peak of selling options (both puts and calls) on TSLA in 2019 in just eight or nine months, but that may or may not be gone now with TSLA's surge to the upside.\n\nI fucked up pretty badly and did not manage the trades like I should have. As with a lot of people here, I'm shocked and in disbelief that it hit $498.49. It'll probably break over $500 this week to reach another milestone.\n\nA couple months ago I did talk shit about how TSLA would not get above $400 or even $420 anytime soon. Boy was I dead wrong. You guys are more than welcome to talk shit to me now if you like. I'm happy that a lot of you were able to make massive gains. It did have to come at the expense of people on the other side of the trade.\n\nYou might be wondering if I still have short calls on TSLA. The answer is yes, and I'm not quite sure why. Stubbornness, inability to take a loss at the high even though it keeps making new highs, etc. Basically the opposite of bagholding a long position. Nobody wants to sell for a loss at the bottom similar to not wanting to sell for a loss at the top.\n\nEven the \"no way it will reach this point\" call strikes that I have sold ended up becoming deep in the money. If you'd like to capitalize on this information, some of the \"no way it will reach this point\" strikes that I have are in the $500s.\n\nThe really annoying part is having to pay taxes on gains that may or may not have all been lost and more in the first five trading days of 2020. Even though I did say to myself that I wouldn't sell naked calls as a new year's resolution, I ended up doing so anyways and I paid the consequences.\n\nIf others are in a similar boat after selling calls, I hope you're doing okay and that you didn't put yourself in a really bad situation. Taking a loss is tough. By the time we do, it gets way out of control and ends up being an even bigger one.\n\nDon't worry about me, I'll be fine and will continue trading. My trading confidence took a huge hit and the entire experience has been humbling. This was not how I was hoping 2020 would start. I guess you could let this post/update be a cautionary tale to manage risk better and not take on positions with potentially unlimited risk. More pain will probably come as I still have short calls that I have yet to close.\n\nI do still plan on messing with TSLA once the dust settles from the current positions. Best of luck to everyone out there. Might not post/comment as often since I want to focus on trading and getting on the right track first. Will still answer PMs and mod when I can though. Thank you again for everyone's concerns.",
        "subreddit": "wallstreetbets",
        "title": "The $65k I previously made from selling naked options on TSLA may or may not be all gone and more now.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/em6pwa/the_65k_i_previously_made_from_selling_naked/",
        "created": 1578586037.0
    },
    {
        "author": "InfiniteAccuracy",
        "created_utc": 1578028600,
        "id": "ejaqzf",
        "num_comments": 256,
        "num_crossposts": 0,
        "selftext": "I just wanna say, I'm sorry.  \n\nI thought \"Hey, spy calls have been free money and the new years is off strong, I will buy some spy calls because its not going down anytime soon\"\n\nso, I put some money in some spy calls literally expiring tomorrow, they were up nearly 100% from that end of day rally.  All it had to do was open slightly green and I was raking in tendies...\n\nBUT THE FIRST DAY I TRY TO DO SOMETHING WE GO TO FUCKING WAR!?!?!  \n\nOf course, I saw the AH rally and futures looking strong, I thought for sure I was gonna kill it tomorrow, but instead, I'm literally gonna lose every penny more than likely...  \n\nThis absolutely floors me though... I didn't touch SPY this entire bull market, not once.  I literally played roku mostly, and some other random stocks, but the first day I buy SPY calls, FD's at that, futures plummet because Orange man decided he wanted to provoke a war overnight instead of just letting me make some money... What a bunch of absolute garbage...\n\nPlease kill me.\n\nEdit:  Like the Autist I am, I doubled down on SPY calls this morning and its recovering!!  Wish me luck lol\n\nEdit2:  Im gay... And single handedly ended the Bull market...  Im sorry.  Im very sorry guys.\n\nEdit3: On the bright side, Cramer said its a bad time to buy so inverse Cramer and I might get lucky lol.  But really.  Cramer, the ultimate hype man extraordinaire turns bearish the day I buy Calls.  Literally insane I actually single handedly ended the bull market and started a war.  \n\nWent from up 25% two days ago to down 60% today. Im optimistic. Afterall, money is just paper anyway.  \n\n Final Edit 4: ok.  So.  Rode some dailies all the way up till just now.  Ended up selling on this spike down because I made like 20-30% and it dropped so I decided to take profits instead of holding while this dumpster fire unfolds.  Currently sitting at about down 40% overall, compared to my 2 days ago up 25-30% so not great, but better than my -60% earlier today.  Not gonna lie.  Its been a wild ride, prolly gonna do it again next week, I havent learned shit.  Im either going broke or gonna be rich.  Prolly broke.  But hey, its just paper anyway.  To the idiot that said \"this is on you for buying at ATH\" Its been at ATH for like 10 years bud.  \n\nFinal edit #2:  its my post, I can make as many edits as I want.  Fuck you.   Im dumbfounded I missed that massive drop right there.  Somehow sold my dailies for a gain and bought puts after to spiked down then back up, I bought puts at that top there.  So gonna ride these puts over the weekend as this dumpster fire political environment unfolds.  I assume theres just gonna be a massive cuckfest about to unfold over the weekend thatll give this atleast 1 more red day.  Who knows. Earnings season will turn it all green again im sure and I can cause the recession then too.",
        "subreddit": "wallstreetbets",
        "title": "Literally the first time I buy spy calls, We go to war over night",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ejaqzf/literally_the_first_time_i_buy_spy_calls_we_go_to/",
        "created": 1578057400.0
    },
    {
        "author": "My0nlyThrowaway",
        "created_utc": 1578182750,
        "id": "ek4w11",
        "num_comments": 250,
        "num_crossposts": 0,
        "selftext": "I usually just wake up with cold sweats at 5:30am right before market opens but now it's only Saturday evening and I am violently ill, puking and shaking non stop",
        "subreddit": "wallstreetbets",
        "title": "Anyone else feel like they're quitting heroin cold turkey over the weekend after hours when market is closed?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ek4w11/anyone_else_feel_like_theyre_quitting_heroin_cold/",
        "created": 1578211550.0
    },
    {
        "author": "TheOnlyCompetent",
        "created_utc": 1579860388,
        "id": "et8eg6",
        "num_comments": 228,
        "num_crossposts": 0,
        "selftext": "1. You begin investing diligently, small from a young age, or large later on to catch up.\n2. Over 25 or so years you build up a portfolio of $800,000, the majority of which consists of index funds and growth stocks.\n3. You decide you'd like to retire early. Aswell as having this amount of savings, you've also paid your mortgage of last year early, so you can make it work.\n4. You sell your whole portfolio and invest completely in a High Dividend ETF, like 'SPHD.' You understand that this opens you to considerable risk, but you know with an annual 4% dividend yield to live off of, whether stocks go up or down, you should be able to weather a recession.\n5. You earn $32,000 a year before tax (doing absolutely nothing). Now you have the freedom to spend the rest of your life working on your writing career, or spend more time with your kids. Whatever you feel like.\n\nIs there anything wrong with this?",
        "subreddit": "investing",
        "title": "Are there downsides to High Dividend ETFs?",
        "url": "https://www.reddit.com/r/investing/comments/et8eg6/are_there_downsides_to_high_dividend_etfs/",
        "created": 1579889188.0
    },
    {
        "author": "BiergartenDayTrader",
        "created_utc": 1580492787,
        "id": "ews0c1",
        "num_comments": 225,
        "num_crossposts": 0,
        "selftext": "You've called us gay. You've told us to eat shit. You told us to worship your Daddy Elon and AAPL. You laughed at us while you won millions on your calls and wasted it on autistic hookers, bad blow, and gloryholes.\n\nBut now we're the ones laughing. Activate Order Covfefe. \n\nBEAR GANG, AWAKEN!!",
        "subreddit": "wallstreetbets",
        "title": "To all Bulls",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ews0c1/to_all_bulls/",
        "created": 1580521587.0
    },
    {
        "author": "Dynomic3",
        "created_utc": 1580425435,
        "id": "ewe6b6",
        "num_comments": 221,
        "num_crossposts": 0,
        "selftext": "You see, I'm new to investing and dropped 14k right before the \"virus\" hit the media. I'm in the red now.... but I grabbed some good growth stocks. At least I hope... Now I can't stop checking and refreshing! I feel like I have a stock virus! Lol",
        "subreddit": "stocks",
        "title": "Is the stock market addicting or is it just me?",
        "url": "https://www.reddit.com/r/stocks/comments/ewe6b6/is_the_stock_market_addicting_or_is_it_just_me/",
        "created": 1580454235.0
    },
    {
        "author": "Yottahz",
        "created_utc": 1578838926,
        "id": "ennzp8",
        "num_comments": 213,
        "num_crossposts": 0,
        "selftext": "I started my Robinhood account in July 2018 with $2,500.   I have had to abide by the pattern day trade rules for over a year and a half, but I am getting really close now to the $25,000 that makes you a \"sophisticated trader\" according to the SEC.   Currently I am up 768% and have made no withdrawals or deposits since starting.   My goal was/is to make 60% a year so that in 10 years I would have $250,000 from the original $2,500.\n\n&amp;#x200B;\n\nHere is my all time chart along with my latest venture into Nektar (I posted about this a few weeks ago...hope you didn't inverse me cause  it is up 25%).\n\n&amp;#x200B;\n\n![img](btrksde6xca41)",
        "subreddit": "wallstreetbets",
        "title": "Getting super close to being a \"sophisticated trader\"!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ennzp8/getting_super_close_to_being_a_sophisticated/",
        "created": 1578867726.0
    },
    {
        "author": "DYZJSZKMZ",
        "created_utc": 1578344974,
        "id": "el0da6",
        "num_comments": 197,
        "num_crossposts": 0,
        "selftext": "So I just recently started trading options, and like most noob retards I just bought calls and puts because everything else was too confusing and hard.  Credit spreads, iron condors, butterflies?  What the fuck does that mean?  Stock going up= Calls, stock going down= Puts.  I thought that was so simple and easy.  Turns out it was simple and easy except my win percentage was like 20%, and I was losing a bunch of money.  I started to get pissed off, but then I realized that if buying calls and puts only won like 20% of the time, then selling them must win 80% of the time.  So I switched strategies and looked into selling calls/puts.  I learned ( I know learning might be too difficult a concept for some of you retards) that selling calls/puts had a much higher probability of success, but also had basically unlimited loss potential if you're wrong.  Now since I'm a huge pussy and don't like unlimited losses, I learned about credit spreads, which not only have a massively high probability of winning, but also cap your losses at a certain amount.  These things literally CAN'T go tits up.  I'm now trading credit spreads and holy shit these things are literally free money.  Like just pick a number you know the stock isn't going to go past and sell that call/put. Then just buy a call/put and little further out of the money, just in case shit goes bad, and you get to keep all that juicy premium you collected when you sold.  FREE FUCKING MONEY.  Check it out.  AMD is a fucking bull train running harder than the train your friend's ran on your sister last night.  No way that shit drops below $47 again.  Sell the $47 put, buy the $45 because I'm a huge pussy and don't like unlimited losses, and the difference premium is all yours when the options expire, mine are 1/10s.  Free fucking money.  This shit is so easy.  I will trade nothing but credit spreads for the rest of my life.",
        "subreddit": "wallstreetbets",
        "title": "Credit Spreads Are Literally Free Money",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/el0da6/credit_spreads_are_literally_free_money/",
        "created": 1578373774.0
    },
    {
        "author": "dont-speak-everrr",
        "created_utc": 1578886781,
        "id": "enylse",
        "num_comments": 194,
        "num_crossposts": 0,
        "selftext": "“Casper is filling to go public at over a billion valuation. I love when these “unicorns” or “billion” dollar companies decided to go public because you get access to their financials.\n\nTo simplify these numbers-\n\nThey sell a mattress for $1,000\nThat mattress cost them $500 to make \n\nNow they have $500 of profit left\n20% get returned, so subtract another $100\n\nNow they have $400 of profit left\nThey spend $290 on advertising to get that one order  \n\nNow they have $110 of profit left\nThey spend $270 per mattress sold on employees costs/admin/office/etc.\n\nNow they are at negative $160.\n\nEvery mattress they sell, they lost $160. In 2019, they lost $65M dollars.  \n\nCan someone please explain to be how this company is worth a billion dollars??? What am I not understanding?”",
        "subreddit": "wallstreetbets",
        "title": "Guy on LinkedIn posted this. Have fun.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/enylse/guy_on_linkedin_posted_this_have_fun/",
        "created": 1578915581.0
    },
    {
        "author": "cheesequake516",
        "created_utc": 1579535752,
        "id": "erezze",
        "num_comments": 194,
        "num_crossposts": 0,
        "selftext": "I don't want to panic sell especially at a loss but the outlook for Slack looks less promising and I'm thinking I might be able to put the capital somewhere more promising. I know Slack is a good product and I thought they had a good niche but its hard to fight against something that Microsoft bundles for free.  Thoughts?",
        "subreddit": "stocks",
        "title": "Bought Slack at $34.41, down 34.5% and have been holding while everything else in the market has gone up. And Microsoft has started advertising their Teams, now with Tv ads. What are your thoughts on Slack vs Microsoft?",
        "url": "https://www.reddit.com/r/stocks/comments/erezze/bought_slack_at_3441_down_345_and_have_been/",
        "created": 1579564552.0
    },
    {
        "author": "photowanderer",
        "created_utc": 1579319035,
        "id": "eqbd04",
        "num_comments": 188,
        "num_crossposts": 0,
        "selftext": "https://www.bloomberg.com/news/articles/2020-01-17/boeing-s-calhoun-warned-by-air-force-that-it-s-not-happy-either\n\nBoeing won the contract, but now a few years late in delivering. How \"normal\" is this type of delivering late with requirements not met. Wonder what were the contract terms and how this would affect Boeing going forward.",
        "subreddit": "investing",
        "title": "Air Force Warns Boeing’s New CEO That It’s Not Happy Either",
        "url": "https://www.reddit.com/r/investing/comments/eqbd04/air_force_warns_boeings_new_ceo_that_its_not/",
        "created": 1579347835.0
    },
    {
        "author": "Vast_Cricket",
        "created_utc": 1580179936,
        "id": "euzcw4",
        "num_comments": 187,
        "num_crossposts": 0,
        "selftext": "Before it gets better it appears to get worse. [Now 106 death out of 4428 infected.  How it quantum jump its figures must have to do with more openness.](https://www.washingtonpost.com/world/coronavirus-china-latest-updates/2020/01/27/3634db9a-40a7-11ea-aa6a-083d01b3ed18_story.html)   According to Washington Post UN Center of Disease Control (CDC) raised travel warning to III -highest level not to go to China at all if one can not helped. About 5 million people have left the area. Optimistic prediction from Washington Post is  59,000 infections and 1,500 deaths will occur — twice the toll of the 2002-2003 SARS outbreak. \n\nThis is a stock post I just don't see how this serious exposure from one of the largest global economy will not impact stock market and GDP. Understand we are eternal optimistic.",
        "subreddit": "stocks",
        "title": "Coronavirus in China is not undercontrol potentially drag global stocks down",
        "url": "https://www.reddit.com/r/stocks/comments/euzcw4/coronavirus_in_china_is_not_undercontrol/",
        "created": 1580208736.0
    },
    {
        "author": "rascally1980",
        "created_utc": 1579965010,
        "id": "etrv6x",
        "num_comments": 187,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "investing",
        "title": "Apple stock is soaring right now. How do you know if this is a time to be “fearful when others are greedy” and sell some shares?",
        "url": "https://www.reddit.com/r/investing/comments/etrv6x/apple_stock_is_soaring_right_now_how_do_you_know/",
        "created": 1579993810.0
    },
    {
        "author": "alltime_pf_guru",
        "created_utc": 1578495778,
        "id": "eltto0",
        "num_comments": 173,
        "num_crossposts": 0,
        "selftext": "Hoe does this thing keep going up non-stop?  No news has derailed this recent boom. How is this possible?",
        "subreddit": "investing",
        "title": "What keeps driving the market up right now?",
        "url": "https://www.reddit.com/r/investing/comments/eltto0/what_keeps_driving_the_market_up_right_now/",
        "created": 1578524578.0
    },
    {
        "author": "UKARCADIA",
        "created_utc": 1579451235,
        "id": "eqydnd",
        "num_comments": 173,
        "num_crossposts": 0,
        "selftext": "* First public space company with a cool ticker\n* With actual spaceships able to take passengers into sub-orbit\n* No other close competitors (SpaceX are focusing on high orbit) (Blue Origin is owned by a book seller and their rockets look like tiny dicks)\n* 500million dollars in the bank\n* Virgin are specialists in travel (see Virgin Airlines)\n* When Richard Branson flies on the first flight later this year this stock will go to the moon\n* Stock will be powered by MEME energy just like TSLA is right now",
        "subreddit": "wallstreetbets",
        "title": "$SPCE is a rocket ship to Tender Tendies",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eqydnd/spce_is_a_rocket_ship_to_tender_tendies/",
        "created": 1579480035.0
    },
    {
        "author": "kriptonicx",
        "created_utc": 1579276885,
        "id": "eq297b",
        "num_comments": 172,
        "num_crossposts": 0,
        "selftext": "https://www.multpl.com/s-p-500-pe-ratio\n\nI thought this was interesting. I remember the market felt quite hot towards the end of Jan 2018, and we are now trading at comparable levels again.\n\nDo you think valuations are fair, or do you think we could see a repeat of Jan '18? With elections coming up I think it's quite likely this could be the peak for the year.",
        "subreddit": "investing",
        "title": "Stocks are now trading at their highest PEs since the financial crisis",
        "url": "https://www.reddit.com/r/investing/comments/eq297b/stocks_are_now_trading_at_their_highest_pes_since/",
        "created": 1579305685.0
    },
    {
        "author": "futuretrollshark",
        "created_utc": 1578988183,
        "id": "eoi9mu",
        "num_comments": 171,
        "num_crossposts": 0,
        "selftext": "Went all in $23k on BYND 85C last week @ 2.30\n\nThis is what it looks like now and I’m not fucking selling [Bynd tendiesss](https://imgur.com/gallery/QjtLALN)",
        "subreddit": "wallstreetbets",
        "title": "YOLO $23k to $271k with BYND 85c",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eoi9mu/yolo_23k_to_271k_with_bynd_85c/",
        "created": 1579016983.0
    },
    {
        "author": "Tobokie121",
        "created_utc": 1578713582,
        "id": "en265g",
        "num_comments": 164,
        "num_crossposts": 0,
        "selftext": "I’ve started to paper trade options about a year ago. I started to trade real money in June. I started with $10000 and I’m now at $23000. I’ve decided this is what I want to be when I go up. I just wanted to ask how do I make this happen. What road do I need to follow?",
        "subreddit": "options",
        "title": "Is being an options trader a valid job for when I grow up?",
        "url": "https://www.reddit.com/r/options/comments/en265g/is_being_an_options_trader_a_valid_job_for_when_i/",
        "created": 1578742382.0
    },
    {
        "author": "howtoreadspaghetti",
        "created_utc": 1578199067,
        "id": "ek84pk",
        "num_comments": 164,
        "num_crossposts": 0,
        "selftext": "[https://docs.google.com/spreadsheets/d/1naBI-0-7pjZOpUV4P9F6HY\\_PjP4fb53caSo1iZ9jSAM/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1naBI-0-7pjZOpUV4P9F6HY_PjP4fb53caSo1iZ9jSAM/edit?usp=sharing)\n\nA few things scream out to me immediately:  \n\n\nI. They had no capital in their business. The story was that they had no profits (I question that now) but they had no capital in their business for a long time. Invested capital was negative for a long time until 2012 when they got into the cloud systems they're known for (and AWS is the massive cash flow machine it is). Chanos pointed this out in a fireside chat he had with Dan Gilbert (which ultimately created my interest in looking into the statements now). \"The money followed the investment\". \n\n&amp;#x200B;\n\nII. They only had two years where they were shrinking more than they were growing (I see this as Capex&lt;D&amp;A) and those two years were 2007 and 2009. They shrank by a very small amount. No business grows continually forever so this comes as no surprise. \n\n&amp;#x200B;\n\nIII. For the years chosen here they were free cash flow positive, net revenue positive, and EBITDA positive. They had negative net income in 2014. An amazing run. Consistent gross margins also with very little fluctuation. They had negative book value in 2004. Their return on net tangible equity also was fantastic with one negative year in 2004.",
        "subreddit": "investing",
        "title": "I got bored and went through Amazon's financial statements between 2004-2014. They were a sitting goldmine in front of everyone's eyes the whole time. Some of these numbers will be of little surprise, some of them may be a great big surprise. Look at this.",
        "url": "https://www.reddit.com/r/investing/comments/ek84pk/i_got_bored_and_went_through_amazons_financial/",
        "created": 1578227867.0
    },
    {
        "author": "quencher00",
        "created_utc": 1578112797,
        "id": "ejrsye",
        "num_comments": 161,
        "num_crossposts": 0,
        "selftext": "Good day,\n\nSHOP is in an excellent position to make some money buying puts on it. The [1Y1D](https://imgur.com/o5kLyk0) chart recently had a MACD cross, indicating the stock is now bearish. Looking closer at the [180D4H](https://imgur.com/Xy488FT) chart, the decreasing volume and MACD peaks tell me SHOP has lost all its steam, and is set to decline.\n\nPosition: [2/21/2020 $350 Puts](https://imgur.com/L5ovDgw)",
        "subreddit": "wallstreetbets",
        "title": "SHOP - Technical Analysis Screams Of Impending Drop",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ejrsye/shop_technical_analysis_screams_of_impending_drop/",
        "created": 1578141597.0
    },
    {
        "author": "JakeFromStateFarm462",
        "created_utc": 1579454490,
        "id": "eqz4sr",
        "num_comments": 157,
        "num_crossposts": 0,
        "selftext": "NFLX is insanely overpriced\n\nAight, here me out\n\nI don’t understand why people think NFLX is worth $340.00. The stock is a time bomb about to go off faster than a lonely backpack on a park bench.\n\nNFLX loses BILLIONS in cash every year and doesn’t seem to be stopping anytime soon.\n\nNot only that but for the first time in history the sales growth is slowing down. \n\nThey are getting actual viable competition as well now compared to that depressed unknown high schooler HULU. DIS and AAPL are going to smash Netflix and take over the streaming industry.\n\nDIS has a monthly cost of only $7.00 while the full version of NFLX costs fookin $16.00. Who ain’t going to switch to DIS and get that sweet deal.\n\nThe only reason NFLX got where it is, is because of there move against Blockbuster. I tell you what though, AAPL and DIS are definitely going to beat NFLX’s ass this time.\n\nShort NFLX.",
        "subreddit": "wallstreetbets",
        "title": "NFLX is Insanely Overpriced",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eqz4sr/nflx_is_insanely_overpriced/",
        "created": 1579483290.0
    },
    {
        "author": "saeed47",
        "created_utc": 1579729059,
        "id": "esinxa",
        "num_comments": 153,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "weedstocks",
        "title": "Aphria shares jump, company now ‘uniquely positioned’ for German sales",
        "url": "https://ca.finance.yahoo.com/news/aphria-shares-jump-company-now-uniquely-positioned-for-german-sales-204239031.html",
        "created": 1579757859.0
    },
    {
        "author": "LiquidityMan",
        "created_utc": 1580414035,
        "id": "ewb620",
        "num_comments": 153,
        "num_crossposts": 0,
        "selftext": "I have said it and I'm gonna keep on saying it, if you're in any Chinese positions GTFO now and short the Chinese market. This virus is not under control. Stop holding out and get on the winning side. Convert your positions to short.\n\nThe Hang Seng market in Hong Kong and TWSE in Taiwan are continuing to tank. It is just a whiff of what is going to happen in Shanghai come Monday. \n\nMarket volatility is brewing and bubbling. 10 days of closed markets in Shanghai have backed up market volatility so high that it is going to come spewing out and spill over to all the other asiatic markets.\n\nIt will be equivalent of that scene in Stand By Me when everyone is throwing up on each other except coming out of Chinese companies assholes.\n\nPeople saying it's already priced in because things are already trading down on other markets are going to be sorely disappointed and left putting vaseline on their anal fissures from getting fucking so hard.\n\nMarkets are going to bleed red on Monday. R.I.P. chinese equities.\n\nGet your puts in on anything Chinese. My choices are on index funds. Here's what to play:\n\n- Puts on FXI (cheapest)\n- Puts on YINN \n- Calls on YANG (it's an inverse fund)\n\nOnce you make your money, consider feeling out the market for the bottom and buy back in on Chinese equities or calls there on out and ride the market back up. \n\nDespite being a third world country in many parts of the countryside and causing this kind of fucked up market volatility in the first place, China's middle class is larger than the entire population of the United States. You won't lose in the long run by betting on them to succeed. \n\nMy big three stock choices for the next 10 years are:\n\n- Luckin Coffee\n- Alibaba\n- NIO\n\nCheck out my other previous posts and DD on the subject:\n\nConsolidated Chinese Market Buying Guide:\nhttps://www.reddit.com/r/wallstreetbets/comments/euz7s4/consolidated_chinese_market_virus_guide/\n\nVolatility Buildup In The Chinese Market\nhttps://www.reddit.com/r/wallstreetbets/comments/ew1jkt/volatility_buildup_in_chinese_market/\n\nGodspeed retards, LiquidityFam",
        "subreddit": "wallstreetbets",
        "title": "Short the Chinese Market",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ewb620/short_the_chinese_market/",
        "created": 1580442835.0
    },
    {
        "author": "flyingtable_",
        "created_utc": 1579177916,
        "id": "epiprx",
        "num_comments": 152,
        "num_crossposts": 0,
        "selftext": "I've just learned about options and I don't understand how we don't have way more millionaires. It should be so easy. All you have to do is pick a super volatile stock, and then bet against the herd's belief about that stock. Now everyone ejaculates in their dreams thinking about Elon, and look at Tesla options that expire on April 17, 2020 ([https://www.marketwatch.com/investing/stock/tsla/options](https://www.marketwatch.com/investing/stock/tsla/options)):\n\n400.00  quote   13.85   1.92    76.00   13.05   14.35   768.00\n\nYou can buy 100 contracts for just 1385$! It is 10,000 shares. So, if Tesla moves to 350$ by April 17, you make:\n\n10000 \\* (400 - 350) - 1385 = 498,615$\n\nWtf? Obviously it is super likely that's going to happen. But even if it doesn't, all you have to do is be right a few times in your life before you become a millionaire.\n\nWtf am I missing? I must be wrong about my calculations or some shit, it can't be that easy?\n\nIf it is, where can I buy options in EU?\n\nI must be fucking dreaming.",
        "subreddit": "wallstreetbets",
        "title": "Why don't we have more millionaires? It should be very easy with options? Isn't it? Wtf? [serious]",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/epiprx/why_dont_we_have_more_millionaires_it_should_be/",
        "created": 1579206716.0
    },
    {
        "author": "kenjijr",
        "created_utc": 1578400682,
        "id": "elb0ru",
        "num_comments": 150,
        "num_crossposts": 0,
        "selftext": "Im sure it is, but right now I’m hesitant, I feel like it will go down, then I should buy it. Am I not wrong?",
        "subreddit": "StockMarket",
        "title": "Is TSLA a good buy?",
        "url": "https://www.reddit.com/r/StockMarket/comments/elb0ru/is_tsla_a_good_buy/",
        "created": 1578429482.0
    },
    {
        "author": "SmokeyBuns",
        "created_utc": 1578886055,
        "id": "enygsq",
        "num_comments": 147,
        "num_crossposts": 0,
        "selftext": "I asked this on r/investing but didn't really get much feedback. I didn't know this sub existed or i would of came here first.\n\nMy brother recently started a new job at the local pizza place and the owner has been talking up the dinar to him for a while. Apparently the owner has at least 10k in dinar and most likely more. My brother recently bought about $800 worth of dinar and wants to get more. My worries are that my brothers boss is hyping up the dinar and my brother is getting bad info from him and letting that cloud his judgement. \n\nIm not an investor and when i tried to do some research into this i felt like i was just spinning wheels. https://www.investopedia.com/terms/forex/i/iqd-iraqi-dinar.asp was the best article i could find. I can safely say that however he's getting the dinar is legit and he's not getting scammed that way. I've read a few articles that claim dinar investors are \"just dumb trump supporters\" buying into a scheme. Other articles are by \"Dinarians\" who've been waiting over a decade for something that's coming any day now. \n\nAccording to the article people are confusing re-denomination with reevaluation and that if Iraq re-denominates then any investment will basically be worthless. I've read some claims from people and my brother has said that if they do re-denominate that they will still come out ahead. Is that possible? How does that work?\n\nIs my brother wasting his money? I cant and wont fault him for taking a gamble on something that could pan out in the future even if it turns out to be a huge loss but if he's going on bad information from his boss (a pizza maker not an investor) who's over-hyping this dinar scheme i wanna stop him before he gets anymore.",
        "subreddit": "wallstreetbets",
        "title": "Is Iraqi Dinar a good bet or bad?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/enygsq/is_iraqi_dinar_a_good_bet_or_bad/",
        "created": 1578914855.0
    },
    {
        "author": "TheFilterJustLeaves",
        "created_utc": 1579482278,
        "id": "er5ip4",
        "num_comments": 146,
        "num_crossposts": 0,
        "selftext": "$MSFT growth continues into 2020. See $24k YOLO below.\n\n&amp;#x200B;\n\n* **MARKETSHARE CREEP**: As the collective US/EU retail industry looks around and wonders if they should be establishing or growing their competitor's cash cow, they'll be looking to strategically invest elsewhere. There are only a handful of major IaaS providers: Microsoft, Google, IBM. Microsoft has greater IaaS market share than every other remaining hyperspace cloud player combined.\n\n&amp;#x200B;\n\n|Player|2018 IaaS Market Share / Year Prior +/-|\n|:-|:-|\n|Amazon Web Services $AMZN|47.8% (-1.6)|\n|Microsoft Azure $MSFT|15.5% (+2.8)|\n|Alibaba Cloud $BABA|7.7% (+2.4)|\n|Google Cloud Platform $GOOG|4% (+0.7)|\n|IBM Cloud $IBM|1.8% (-0.1)|\n\nSource:  [https://www.gartner.com/en/newsroom/press-releases/2019-07-29-gartner-says-worldwide-iaas-public-cloud-services-market-grew-31point3-percent-in-2018](https://www.gartner.com/en/newsroom/press-releases/2019-07-29-gartner-says-worldwide-iaas-public-cloud-services-market-grew-31point3-percent-in-2018) \n\nFor the time being, $BABA and $MSFT have culturally different clientele, providing a favorable moat to $MSFT in the US and with allies (UK, EU, AU, NZ) and the Western hemisphere neighborhood (LATAM). Of course, that's before we get to PaaS, which $MSFT serves as a leader in some of the most cutting edge (AI/ML, IoT), and as the uncontested king of on premise and hybrid cloud in enterprises.\n\n&amp;#x200B;\n\n* **THE MILITARY-INDUSTRIAL COMPLEX HATH SPOKEN:** Unless you're living under a rock, you've probably heard about JEDI and DEOS. The monopoly that $AMZN once enjoyed in the cleared space  is now in the crosshairs of big blue. This opens the door for Microsoft to gain all types of opportunities in the highly profitable federal space, and some of which it is uniquely positioned for with it's Azure Stack Hub and array of edge devices. Microsoft, with it's already deeply established sales and relationships with the DoD, will have no problems capitalizing on this opportunity. It's only just beginning. Microsoft can leverage a huge partner base, and don't forget that US defense companies can increase that leverage too.\n* **O365, DYNAMICS, LINKEDIN, AND GITHUB ARE EASY MONEY:** $MSFT is enjoying the fruits of its acquisition(al) labors on one hand, and the easiest inflows of cash via O365, which will see increased growth as more cleared / defense onboard into O365 and dog-whistle Teams.\n* **ENJOYS THE TAILWINDS OF A RECORD YEAR**: $MSFT and Azure are coming along from record highs, with yearly gains between the 50-60% respectively. If you're bullish on the S&amp;P 500/DOW, you can be bullish on Microsoft - and expect it to outperform. Microsoft has enjoyed steady climbs after most favorable earning events, provided its largely institutional (\\~73%) ownership isn't panicking. \n\n[MSFT 07\\/18 - present day](https://preview.redd.it/3p9ccnoj0ub41.png?width=1196&amp;format=png&amp;auto=webp&amp;s=191d019a0e7af40f2cca475e20db6d2bd60cedb4)\n\nMY $23,958.32‬ YOLO: \n\nhttps://preview.redd.it/uvizq7hj1ub41.png?width=645&amp;format=png&amp;auto=webp&amp;s=246b5fccb66ce5191d9e562bc723df21bb892f5e",
        "subreddit": "wallstreetbets",
        "title": "Long live Azure! Microsoft will moonwalk past $180.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/er5ip4/long_live_azure_microsoft_will_moonwalk_past_180/",
        "created": 1579511078.0
    },
    {
        "author": "hossmanTK",
        "created_utc": 1578533841,
        "id": "em2ij5",
        "num_comments": 145,
        "num_crossposts": 0,
        "selftext": "I am a younger investor (26) and constantly come to this subreddit for advice and general info about investing. I constantly see investors talking about \"make your mistakes early\". What exactly were those mistakes and how are you investing now because of it?",
        "subreddit": "investing",
        "title": "Seasoned investors, what mistakes did you make early on that you learned from?",
        "url": "https://www.reddit.com/r/investing/comments/em2ij5/seasoned_investors_what_mistakes_did_you_make/",
        "created": 1578562641.0
    },
    {
        "author": "TheSalami77",
        "created_utc": 1578756599,
        "id": "en8qxz",
        "num_comments": 144,
        "num_crossposts": 0,
        "selftext": "40% is the average, but if you have your own picks of quality companies you’re up anywhere from 60-100%. The correction in gold is over and we are well on our way into the new bull market. The gold stocks don’t get much coverage, but they’ve been the best performing sector and will continue to do so. \n\nThe federal reserve has injected over 500 billion into the repo markets; if you take a look at a chart you can see spikes of green directly corresponding with the amount of liquidity injected. We’re well into QE 4, it’s laughable that the fed won’t call it that; but if they did they would be admitting to debt monetization. Who gives a fuck what they say, care about what they do. They flip flopped on monetary policy last winter, rates going back to 0. Its honestly fucked up how they teach monetary policy and inflation to children. Scumbags would rather see the stock market up in nominal terms, than actually do their jobs and not get involved. \n\nWe’re headed right into a currency crisis. Surprisingly gold has gone up before the drop in the dollar has even started; shows just how weak the dollar is, and how the risk premiums are starting to be built in. \n\nNow I don’t expect the public/general investors to hop into gold until it is well over $2000 an oz. Increasing demand has come from central banks globally, they’ve been buying large amounts of gold and selling off US treasuries. Some people will take advantage of this undervalued asset and buy while it’s cheap; most will be deterred from the stigma. \n\nA lot of people will get caught up in the passive investing scheme. General investors WILL ride this market all the way down. Out of greed they won’t sell, they’d rather lock up their money for years while waiting for it to come back.",
        "subreddit": "stocks",
        "title": "Gold mining stocks up 40% over the past year, outperforming SPY and still highly undervalued. Gold at $1563 an oz (up around 20% over the past year, 50% in the last 4 years).",
        "url": "https://www.reddit.com/r/stocks/comments/en8qxz/gold_mining_stocks_up_40_over_the_past_year/",
        "created": 1578785399.0
    },
    {
        "author": "ReSuLTStatic",
        "created_utc": 1580433201,
        "id": "ewg5u5",
        "num_comments": 141,
        "num_crossposts": 0,
        "selftext": "**The Average Autist** – down about 500 dollars from dumb plays but isn’t high enough on the spectrum to refill his Robinhood.\n\n**The Advanced Autist** – Slams every McDonalds paycheck into Robinhood like it’s a slot machine on a monthly basis.\n\n**The Lucky Guy** – has 1000% gains and thinks he is a \"gifted investor\" until it all comes crashing down. Says its just paper after the luck runs out.\n\n**The Rich Guy** – has a massive source of income and drops 100k on options as a hobby\n\n**The New Guy** – Drops $300 on options without knowing how any of it works. Buys same day OTM options that expire worthless.\n\n**The Innovator** – Thinks he came up with a way to make \"free money\". Now he’s got 3 laws suits and is legally not allowed within 10 feet of a computer.\n\n**The Broker** – collects a fat paycheck and inverses all his plays from work on his personal account. The only guy actually making money here.\n\n**The Gambling Addict** – was a normal guy until he came across Robinhood, now he’s 30k in debt and just secured another loan to win it all back.",
        "subreddit": "wallstreetbets",
        "title": "Every type of person at WSB",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ewg5u5/every_type_of_person_at_wsb/",
        "created": 1580462001.0
    },
    {
        "author": "lol558237",
        "created_utc": 1580416776,
        "id": "ewbv8q",
        "num_comments": 141,
        "num_crossposts": 0,
        "selftext": "https://imgur.com/a/Ff6I8gg\n\nWho says you need options to make those tendies? All you need is a 25k starting and some good ol max leverage from rh and TD and youre good.\n\nI started with 25k, and through going all in on swings on leverage, was able to get it to 60k in about 3/4 of a year. Then I realized rh is shit for trading and switched to td, where you get 4x leverage. Thats right. 4x. Now I could buy up to 240k of shares. And 1% of 240k is 2400, its like trading options except you actually have a good chance of making money.\n\nTldr, buy shares on max leverage for tendies",
        "subreddit": "wallstreetbets",
        "title": "I quadrupled my account in 1 year only using shares and leverage",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ewbv8q/i_quadrupled_my_account_in_1_year_only_using/",
        "created": 1580445576.0
    },
    {
        "author": "throwitaway19",
        "created_utc": 1578504710,
        "id": "elvun7",
        "num_comments": 139,
        "num_crossposts": 0,
        "selftext": "I've considered adding tesla to portfolio the past couple weeks but it feels to overvalued. Yet here we are, two days in a row with 5% gains...\n\nIs there still any reason to think it's overvalued?",
        "subreddit": "RobinHood",
        "title": "Is tesla ever going to slow down? Now the most valuable automaker in US history...",
        "url": "https://www.reddit.com/r/RobinHood/comments/elvun7/is_tesla_ever_going_to_slow_down_now_the_most/",
        "created": 1578533510.0
    },
    {
        "author": "SuggestedName90",
        "created_utc": 1579376932,
        "id": "eqlb49",
        "num_comments": 138,
        "num_crossposts": 0,
        "selftext": "**Alright so we have 3 main objectives here:**\n\n1. Establish A Tax Haven in Detroit\n2. Make Tendies when the Cheap real estate goes up as we buy it\n3. Run the City?\n\nAlright, so let's start with the first one.\n\nElections for local officials are in November, so we must get registered there before then. Detroit has around  479,267  registered voters. Meaning it only takes just above half that to infiltrate the city offices. If we abuse the gerrymandered counties we could do it with even less. Now let's look at offices, we can ignore all senate and house positions which leaves us with the Mayor, Attorney General, and Secretary of State. Once we hold these positions we expand programs helping us and boosting investment from outside who in turn ensure our re-election.\n\nNext, we have to buy cheap real estate.\n\n   As another user pointed out we can buy real estate at  [https://buildingdetroit.org/](https://buildingdetroit.org/) . But as others pointed out people could move in an cause many liabilities. To circumvent this we must become the ruling gang. If all of us arm then we can become the main gang running the city from the government from the offices and streets. Via transferring all your assets to a hospitality company whose sole customer is you we can qualify for property tax exemption as seen here. [https://detroitmi.gov/government/boards/property-assessment-board-review/homeowners-property-tax-assistance-program-hptap](https://detroitmi.gov/government/boards/property-assessment-board-review/homeowners-property-tax-assistance-program-hptap). This surge in investment, as well as the renovations for even more tax exemptions prices for real estate, will go up as long as enough of us do it.\n\nFinally, We will have taken over Detroit we now have to figure out what to do here. Any suggestions? Also because several things I mentioned are illegal I would like to tell the SEC, FBI, NSA, that all of this is an exaggerated theoretical joke and I am not responsible for the actions of those who cannot differentiate a joke from reality.",
        "subreddit": "wallstreetbets",
        "title": "Invasion of Detroit Organization Megathread",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eqlb49/invasion_of_detroit_organization_megathread/",
        "created": 1579405732.0
    },
    {
        "author": "marknu",
        "created_utc": 1579317424,
        "id": "eqb2qk",
        "num_comments": 137,
        "num_crossposts": 0,
        "selftext": "I have a very small account and didn’t really expect to make any money. But I listened to what the autists were saying and bought some spy calls. Now I am up 177% this week and can finally afford the puppy I have been trying to get for years. Thank you again wsb.",
        "subreddit": "wallstreetbets",
        "title": "Thank you wsb",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eqb2qk/thank_you_wsb/",
        "created": 1579346224.0
    },
    {
        "author": "Samhema",
        "created_utc": 1579472768,
        "id": "er3g1p",
        "num_comments": 131,
        "num_crossposts": 0,
        "selftext": "Sitting here smoking a wood thinking about where it all started...a broke young padawan who fills up gas with $5 with a spending budget of $40 a week. I had a drug addiction, taking a break from school, no job. Love of my life broke up with me and is now with someone else (for 2 years). She mainly left me because ultimately I was a loser...days of crying like a little bitch in my car. I was at rock bottom. Siblings are all in medical school which also made me feel like the biggest loser on earth. I just wanted to be successful and prove everyone wrong especially my ex. Then, I got the idea...stonks. Borrowed $2k from my mother and the rest is history.",
        "subreddit": "wallstreetbets",
        "title": "What made you start trading?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/er3g1p/what_made_you_start_trading/",
        "created": 1579501568.0
    },
    {
        "author": "MaxAds1",
        "created_utc": 1579830610,
        "id": "et3dad",
        "num_comments": 131,
        "num_crossposts": 0,
        "selftext": "Hey Fuckers.\n\nI'm real new to this but I've made about +$6,000 in January so far (including my $4k Telsa loss, GUH). I've been looking for a way out of my job for awhile now (tech sales) and I think this could be the way. I've also got a little ecomm business on the side to fall back on if this turns out to not be the way.\n\nStarting Feb 1st, I'm going to put 3-4 hours into day trading options everyday with the goal of making 500-1000 daily. I work remote so I'm lucky I have some flexibility here. If I can make at least 10k before the end of February, I quit my job and go full time blow and hookers. \n\nWhat I'm looking to do here is post either daily or weekly my positions, gains and losses, and rationale behind everything. I think a lot of people ask if people on here make money so I'd like to be a case study. If I fail and go 100k in debt, I will give out discounted blowjobs to everyone on the thread to recoup my losses.\n\nIs gay to post the journey daily, is not gay?",
        "subreddit": "wallstreetbets",
        "title": "Day trading Journey",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/et3dad/day_trading_journey/",
        "created": 1579859410.0
    },
    {
        "author": "CallMeZeta",
        "created_utc": 1579844910,
        "id": "et64hq",
        "num_comments": 128,
        "num_crossposts": 0,
        "selftext": "Listen up morons. This isnt r/investing. If you try to be \"responsible\" and wait to throw money at SPCE once space tourism is fully operational, you're simply going to end up paying 10x more money for the chance of significantly lower returns. \n\nOnce Branson steps off the first flight successfully this year, do you morons really think the stock is going to wait for you to to step on board? **Of course not!** It's going to blast off along with Virgin Galactics ships and you'll be in full FOMO, desperately scrambling money together to pick up shares/calls at double, if not triple the the price you can now. The strategy is to position yourself early. Because by the time it's a proven success, itll already be too late. \n\nDon't let a minor occasional dip bend you out of shape, because it's likely to pay off very well down the line... 🚀\n\n*Not financial advice, don't sue me*",
        "subreddit": "wallstreetbets",
        "title": "You're going to be kicking yourself for not holding SPCE...",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/et64hq/youre_going_to_be_kicking_yourself_for_not/",
        "created": 1579873710.0
    },
    {
        "author": "7figurebetontesla",
        "created_utc": 1578506304,
        "id": "elw7we",
        "num_comments": 128,
        "num_crossposts": 0,
        "selftext": "No one has been more bullish than me on telsa as evidenced by my large bets over the last year. However this is getting ridiculous. Momentum trades like this work until they don’t and there are going to be a lot of unhappy bag holders a few weeks/months from now. \n\nI just sold 30 naked calls between 485-510 strike for Friday. So if I’m wrong I’m gonna be short 1.5 million dollars in Tesla at around 495. \n\nPart of me wants them to be executed so I can ride this down to the low to mid 400s. \n\nThen again it could go to 600 and I’m Fucked",
        "subreddit": "wallstreetbets",
        "title": "Getting near the top on Tesla",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/elw7we/getting_near_the_top_on_tesla/",
        "created": 1578535104.0
    },
    {
        "author": "CrushingInvesting",
        "created_utc": 1578365125,
        "id": "el4z47",
        "num_comments": 127,
        "num_crossposts": 0,
        "selftext": "\r\nWrite down that plan. Explain how you would invest in different situations that the market could throw at you. Only by writing your steps and plan down will you be able to fight through the noise that will no doubt be hyped on every financial news channel, late night tv spot, Facebook ad, and every YouTube commercial telling you how to make millions their way.\r\nEverything and nothing will sound logical. Anyone who was invested in 2008-2009 will understand the pulls and pushes of information overload that will be coming. \r\nThe stories of people on the streets, people losing their jobs, houses getting foreclosed on. Lions, tigers , and bears, oh my. Get your actions steps together now before the nonsense and noise attempt to take you on a wild desperate ride that could cost you tens of thousands or more in fees, taxes, and capital losses.\r\nAre you going to sell everything? Are you going to sell half, a third? Are you going to hold fast at your current levels? Are you going to fight the noise and actually add to your holdings? Are you going to hold a specific percentage of cash? 10, 20, 30%? More? How far down will you wait for stocks to drop before you begin deploying the cash into stocks again?\r\nWill you be patient and change nothing because you understand your investments and don’t fear short-term losses? If so, will you continue to add capital on the way down? How much capital will you add. The same as before? More, less?\r\nWill you be moving your money out of the market completely and move into other investments? Are you going into precious metals, bonds, real estate? Something else? \r\nWrite it down, access,  adjust, stick to your plan.\r\nStart Investing Early, Never Stop, Stay Focused.",
        "subreddit": "StockMarket",
        "title": "What is your investment plan for the next major market decline?",
        "url": "https://www.reddit.com/r/StockMarket/comments/el4z47/what_is_your_investment_plan_for_the_next_major/",
        "created": 1578393925.0
    },
    {
        "author": "MikeGDASK",
        "created_utc": 1578315603,
        "id": "ektuix",
        "num_comments": 127,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "StockMarket",
        "title": "Is now a good time to invest in Vanguard Index Funds or should I wait for the next recession? Thoughts? I’m in my late 20s and thinking of a 3 fund portfolio!",
        "url": "https://www.reddit.com/r/StockMarket/comments/ektuix/is_now_a_good_time_to_invest_in_vanguard_index/",
        "created": 1578344403.0
    },
    {
        "author": "jfrank6",
        "created_utc": 1579119164,
        "id": "ep7ntk",
        "num_comments": 126,
        "num_crossposts": 0,
        "selftext": "Recently, I have noticed the increase in posts about market crashing, recession, etc.\nAlot are stating they are holding bags waiting for a massive correction wherein they can toss the whole kitchen sink in and make tons of profit or waiting for a better entry point. I do think there will be individuals who will take advantage of this, I honestly do. \n\nHowever, the common investor will probably be too scared to invest at a time of financial uncertainty, you make not even have a job at that time (see 2008). So if you are holding bags now, due to fear of the market crashing I highly doubt you will invest if it does happen and there is no clear end in sight. For the others who believe in staying the course, continue to invest regardless of market environment.",
        "subreddit": "investing",
        "title": "For all the market crash talk",
        "url": "https://www.reddit.com/r/investing/comments/ep7ntk/for_all_the_market_crash_talk/",
        "created": 1579147964.0
    },
    {
        "author": "Daddl7",
        "created_utc": 1578330400,
        "id": "ekwwoz",
        "num_comments": 125,
        "num_crossposts": 0,
        "selftext": "Germany, the country full of people who think work is superior to mindless gambling, but then wonder why their pensions are so small, essentially kills what this sub stands for. How, you ask?\n\nWell, our beloved Minister of Finance Olaf Scholz (who proudly admitted all his private money sits in a 0% interest bank account because everything else would be far too risky) really is determined to kill off trading. After he got backlash for his ideas to abolish the capital gains tax (to tax financial gains under the almost always higher personal income tax) and introduce a 0.2% tax on stock transactions (yes, just stocks, not derivatives, because he is dumb), now actually managed to slip something into a law that no one seemed to notice.\n\nActive from 2021, the maximum loss from derivatives you can deduct from your taxes will be 10.000 EUR. I know, I know, taxes and shit is too complicated fo you guys here. So I will give you an example.\n\nSuppose its January 2019, TSLA is at 300$, and you bought 420$ TSLA Calls expiring in August for 50.000 EUR, because you believe in mighty Elon and he surely won't fail you. Except he does, and as a true bagholder you clinch to the sunken ship until it hits the ground, and all your money is gone. You post your losses here and everyone calls you a True Hero, so you can somehow live with it, but you swear you will never gamble like this again. Except two months later with TSLA at 220$ you do it anyway and throw the 10.000 EUR you have left at Calls again. You watch the stock rise and rise and rightfully think you are the goddamn smartest person to ever have existed on earth. You cash out and celebrate that you came back and now have 70.000 EUR. \n\nNow its tax season and you expect to pay 25% capital gains tax on your gains, which surely should be 0.25\\*(-50.000+60.000) = 2.500. So instead of 60.000 EUR you now have 67.500 EUR, paid 2500 EUR in taxes and everyone is happy, right?\n\nExcept with this law change the losses you can deduct per year are now kept at 10.000 EUR. That means you pay 0.25\\*(-10.000+60.000) = 12.500 EUR in taxes and are left with...57.500 EUR? Less than you started with? You are telling me I just risked 60.000 EUR to make 10.000 EUR and then the taxes I have to pay on that are bigger than my gains?\n\nYep, thats entirely correct.",
        "subreddit": "wallstreetbets",
        "title": "Germany is killing autism",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ekwwoz/germany_is_killing_autism/",
        "created": 1578359200.0
    },
    {
        "author": "vullun",
        "created_utc": 1578587864,
        "id": "emc4nl",
        "num_comments": 125,
        "num_crossposts": 0,
        "selftext": "I am a broke college student. Thanks to AMD and Su bae, I can now afford the paperwork and website hosting to start my own business selling fish online. Gone are the days of being a wagecuck. I shall now force fish to fuck and sell their children for more AMD calls. How has AMD changed your life?",
        "subreddit": "wallstreetbets",
        "title": "Thank You AMD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/emc4nl/thank_you_amd/",
        "created": 1578616664.0
    },
    {
        "author": "suckfail",
        "created_utc": 1579058927,
        "id": "eowos1",
        "num_comments": 124,
        "num_crossposts": 0,
        "selftext": "One of the big reasons people hold physical gold and silver is to hedge against economic collapse.\n\nHowever we've now had quite a few, including the fall of East Germany, the Soviet Union, hyperinflation in Africa, many countries in the middle east and most recently, Venezuela.\n\nIs there any evidence that people holding physical gold and silver were actually able to do anything with it? Because if not I think that kind of proves it's fairly useless.\n\nFor my own personal anecdote, I do know one family who escaped from Iraq during Suddam's reign by bribing many, including border guards, with gold. But as a Canadian I just don't think that would ever apply to me...",
        "subreddit": "investing",
        "title": "Did physical gold and silver ever work as a hedge in any modern economic collapse?",
        "url": "https://www.reddit.com/r/investing/comments/eowos1/did_physical_gold_and_silver_ever_work_as_a_hedge/",
        "created": 1579087727.0
    },
    {
        "author": "YeahDucks",
        "created_utc": 1578024913,
        "id": "eja18h",
        "num_comments": 124,
        "num_crossposts": 0,
        "selftext": "So now that an Iran was attacked per say by one of US airstrikes in Baghdad (Google for specifics - it seems bad) , it seems like Trump may incite a war. I rather not debate whether or not at the moment, but say he does, what stocks historically have done well when we go into a new war? Sorry if I'm coming off like a dumb dumb. I'm fairly smart but still an autist at heart and appreciate your input from fellow autists",
        "subreddit": "wallstreetbets",
        "title": "Stocks that do well during war times",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eja18h/stocks_that_do_well_during_war_times/",
        "created": 1578053713.0
    },
    {
        "author": "Taylor_work",
        "created_utc": 1580250548,
        "id": "evcvzp",
        "num_comments": 122,
        "num_crossposts": 0,
        "selftext": "Has any been on Disney + for more than a month or two and figuring out that their content is super limited? I re-watched all the Marvel and Star wars movies and now I feel like I've consumed it all. I tried watching old Disney channel shows like Even Stevens or Brink but they all don't hit like they did when i was a kid. I don't get why people think that users will delete Netflix for Disney +. Unless its for a small child.",
        "subreddit": "stocks",
        "title": "Netflix &gt; Disney +",
        "url": "https://www.reddit.com/r/stocks/comments/evcvzp/netflix_disney/",
        "created": 1580279348.0
    },
    {
        "author": "likesundayslikerain",
        "created_utc": 1579305033,
        "id": "eq8og8",
        "num_comments": 119,
        "num_crossposts": 0,
        "selftext": "Even though I know it’s better to spend your time in the market instead of timing the market, I still fail to follow this advice. I always think “what if the price is lower in a month” or “what if there’s a recession soon?” I’ve been waiting for dips and good entry prices for many stocks, such as Microsoft, Tesla, AMD, Twitter, Disney, etc., but this just leads to missed opportunities.\n\nRecently, the market has been just getting higher and higher. Everything now seems to be reaching its 52 week high.\n\nAre there any stocks in particular you would recommend right now?\n\nI know it’s not a good idea to wait for dips, but I don’t have much to invest, so I just hope to make the most gains I could, but I have realized that I want to hold safe stocks for a very long time and hope to seem they grow haha\n\nAlso, I’m a person who likes science a lot (particularly bio and med related items) and anything that would benefit the earth/future, such as solar power or any other energy. Along with recommendations, if there were any you have in these areas, I would love to hear them!! I will definitely do my own research about the stock.\n\nAny help/insight/recommendations are greatly appreciated!! I definitely want to spend more time in the market, so I’m planning on doing research this weekend and investing right away. Thank you so incredibly much!! Good luck investing!",
        "subreddit": "stocks",
        "title": "What stock would you recommend buying now (next week) and holding onto for 10+ years?",
        "url": "https://www.reddit.com/r/stocks/comments/eq8og8/what_stock_would_you_recommend_buying_now_next/",
        "created": 1579333833.0
    },
    {
        "author": "MushroomCake28",
        "created_utc": 1579622366,
        "id": "erwiyu",
        "num_comments": 118,
        "num_crossposts": 0,
        "selftext": "It's my first time discovering that service, and I've been using Wealthsimple Trade for some time now. Any thoughts on the cash holding service? 2.4% interest rate is very high, and I haven't seen a savings account with a higher interest rate in Canada.\n\nIf someone is using that service, is it connected to the other services like Wealthsimple Trade? Like can you quickly move your money between the Trade and Cash accounts?",
        "subreddit": "CanadianInvestor",
        "title": "Thoughts on Wealthsimple Cash?",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/erwiyu/thoughts_on_wealthsimple_cash/",
        "created": 1579651166.0
    },
    {
        "author": "TheOnlyCompetent",
        "created_utc": 1579362233,
        "id": "eqhvb4",
        "num_comments": 118,
        "num_crossposts": 0,
        "selftext": "All time high is close to $450 a share, and I see the recent troubles with the company all relatively short term problems. Unlike some other companies Boeing is very secure, a rock of a stock. I don't think there's any risk long term. Over the next decade even with a likely recession I'm convinced Boeing will be able to reach a share price of over $1000, maybe even hit $1300 with more optimism.",
        "subreddit": "investing",
        "title": "Is Boeing a Buy right now?",
        "url": "https://www.reddit.com/r/investing/comments/eqhvb4/is_boeing_a_buy_right_now/",
        "created": 1579391033.0
    },
    {
        "author": "koggit",
        "created_utc": 1578629580,
        "id": "emlnt6",
        "num_comments": 116,
        "num_crossposts": 0,
        "selftext": "P/E ratio of almost 11, dividend of almost 3%.\n\nWhat’s the catch?\n\nTheir plugin hybrids are great. They obviously understand EVs. Seems like they’re poised to grow AT LEAST as fast as the industry does,\n\nAutomaker growth is projected to be low but I disagree. Batteries and EVs are advancing quickly. Cars are advancing more quickly. There hadn’t been much progress in cars for decades, until now. People can comfortably drive a 20 year old vehicle today, I drive a 2001 VW GTI and it’s not terribly different from a 2020 VW GTI. Literally 20 years without much progress.\n\n20 years from now I guarantee EVs will be a lot more advanced than they are today. Batteries will advance more quickly than the internal combustion engine has. Someone driving a 5 year old EV will have a lot more reason to upgrade than someone driving a 5 year old ICE.\n\nSo I believe people will start buying cars more frequently. I’m bullish on EVs. PHEVs are the most rational transition and Toyota has the best PHEVs. I see no reason to believe they won’t be making great EVs soon.\n\nI can’t really think of a bear case for Toyota except the fear that startups will beat them, but I don’t see why that would happen. And without assuming a doom future for them the current valuation seems way too low.",
        "subreddit": "investing",
        "title": "Toyota - what’s the catch?",
        "url": "https://www.reddit.com/r/investing/comments/emlnt6/toyota_whats_the_catch/",
        "created": 1578658380.0
    },
    {
        "author": "GotTheTrumpCard",
        "created_utc": 1579720743,
        "id": "esgosi",
        "num_comments": 116,
        "num_crossposts": 0,
        "selftext": "Virgin Galactic is going up fast and all you autists disbelieved me. It’s going to hit 20 before the end of the week. Space is the next big thing and all of you are too pigheaded to profit from it. For all you previous disbelievers, guess who’s laughing now.",
        "subreddit": "wallstreetbets",
        "title": "$SPCE to the Moon",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/esgosi/spce_to_the_moon/",
        "created": 1579749543.0
    },
    {
        "author": "RealStratBeckerYT",
        "created_utc": 1579751073,
        "id": "esnn1l",
        "num_comments": 116,
        "num_crossposts": 0,
        "selftext": "Here's some real DD for you all. SPCE has more than doubled in the past month and everyone is hype for it. Do you know why it's up? Speculation alone. Their operating income is $0 as they have never recorded a sale and their only profits from Q4 2018 to Q3 2019 came from issuance of common stock, more commonly known as dilution. Now, the latest filings we have from SPCE are from November 12th, 2019 where their market cap was under $900 million and their stock price was just over $10. Now as we know their stock closed at almost $20 today, January 22nd, but their market cap has skyrocketed to over $3.8 billion. How has this happened? Dilution which means that the company is just pumping shares into the market. Per the November 12th filings SPCE had under 83 million shares outstanding, which includes insider shares and the float shares. Today though that amount is 196 million, which means they have more than doubled their total amount of shares on the market. Keep in mind that the only reliable guess of their cash balance is $0-$100 million, which is not nearly enough to really roll operations forward. If you're long for tendies be careful for the secondary offering to come out of nowhere and screw you hard. Best of luck betters.\n\n&amp;#x200B;\n\nIf anyone wants to validate this go ahead and do so its all in their filings and accounting. Basic links to show some of the info that leads to such conclusions are  [https://www.sharesoutstandinghistory.com/?symbol=spce](https://www.sharesoutstandinghistory.com/?symbol=spce)",
        "subreddit": "wallstreetbets",
        "title": "SPCE is a dilution machine (DD)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/esnn1l/spce_is_a_dilution_machine_dd/",
        "created": 1579779873.0
    },
    {
        "author": "TuckandRoll91",
        "created_utc": 1578671364,
        "id": "emsqoa",
        "num_comments": 116,
        "num_crossposts": 0,
        "selftext": "A brief introduction: Hi, I'm Mike. I'm a carrier for the US Postal Service, writer, husband and Dad. I am in no way a Wall Street Expert. Of course, I'm not an electrician, either, so when I have an electrical problem, I call one.\n\nI've taken the approach with my investing. Back in August I bought a subscription to the Motley Fool. Every bit of advice I've followed from t hem has made me money. \n\nBut you don't want to pay $20 a month for stock tips? \n\nWell, that's good, because you don't have to, as I'm going to share it. \n\nThe Fool recommends the fice following stocks; APPN, HUBS, TSLA, TDD and ZM.\n\n&amp;#x200B;\n\nI look at this way, If I invest $100 and make $20, and you invest $100 and make $50, what have I lost?\n\n&amp;#x200B;\n\nEverything that follows is taken straight from the email they sent yesterday.\n\n&amp;#x200B;\n\n **CURRENT PRICE:** [APPN](https://www.fool.com/premium/company/339157/) $ 45.26  $ 2.37 (5.5%) *Price as of* *January 10, 9:59 a.m.*\n\n**Appian** [(NASDAQ: APPN)](https://www.fool.com/premium/company/339157) is making its fourth Best Buys Now appearance in the past six months as it pursues a better way to create apps. If you don't own shares or if you've been thinking about adding, consider this a nudge.\n\nAppian's solutions are sometimes called \"low-code,\" but this is a misnomer; the company offers large, complex integrations for its clients' work forces, featuring elegant programming tools allowing them to build their own solutions. (Hence the term \"low-code\" — you don't need to be an engineer to use Appian's products.)\n\nAfter seeing sluggish growth rates in the first half of 2019, Appian bounced back in the third quarter, with total sales climbing 26% year over year on an encouraging 38% jump in subscription revenue. Subscription revenue retention rates remained strong at 119%, an impressive display of customer loyalty.\n\nWe're still impressed with founder and CEO Matt Calkins and his long-term strategy in tapping what he sees as an addressable market that's growing toward $50 billion. Even as Appian goes up against some much larger players in the technology sector, the company's strong internal culture gives it a big competitive advantage. Enterprise customers need solid software solutions, and that will keep Appian's services in demand for the long run.\n\n&amp;#x200B;\n\n \n\n**HubSpot** [(NYSE: HUBS)](https://www.fool.com/premium/company/317364) joins our Best Buys Now for the second time since Tom recommended it in [December](https://www.fool.com/premium/stock-advisor/coverage/18/coverage/updates/2019/12/05/buy-hubspot.aspx). The \"inbound marketing\" pioneer is helping more than 68,000 clients, including 28,000 multi-solution clients, build better sales and marketing channels than traditional advertising can offer. The results show up in the company's top-line subscription growth of more than 30%.\n\nTo drive those kinds of results, HubSpot's co-founders, CEO Brian Halligan and CTO Dharmesh Shah, are investing heavily in people and development. The latest addition to the C-suite is Yamini Rangan as the company's first-ever chief customer officer. She is formerly of **Dropbox** [(NASDAQ: DBX)](https://www.fool.com/premium/company/339953) and fellow *Stock Advisor* recommendation **Workday** [(NASDAQ: WDAY)](https://www.fool.com/premium/company/273717). In a \"physician heal thyself\" way, HubSpot's marketing, sales, and customer services team will fall under Rangan's leadership to help improve the company's own [flywheel](https://www.hubspot.com/flywheel) model, just as the company does for its clients.\n\nCompanies are becoming more focused on customers and friendly marketing than ever before (or at least, they should). HubSpot is here to help them. Halligan and Shah have built a superior culture that shows up in exceptional Glassdoor ratings that list HubSpot as the [top tech company](https://venturebeat.com/2019/12/10/glassdoor-hubspot-dethrones-zoom-as-the-best-tech-company-to-work-for-in-the-u-s/) to work for (topping fellow Best Buy Now **Zoom Video Communications** [(NASDAQ: ZM)](https://www.fool.com/premium/company/341090)). And after a rough patch in mid-2019, HubSpot's stock has been rallying, but it's still well off its all-time highs. With a market cap just over $7.4 billion and annual sales of $630 million, HubSpot has plenty of room to run in a dynamic market. If you haven't yet added it to your own portfolio, take a closer look today.\n\n&amp;#x200B;\n\n **CURRENT PRICE:** [TSLA](https://www.fool.com/premium/company/224257/) $ 479.50  -$ 1.84 (-0.4%) *Price as of* *January 10, 10:18 a.m.*\n\nTom recommended **Tesla** [(NASDAQ: TSLA)](https://www.fool.com/premium/company/224257) just last week, and if you haven't bought shares yet, we think it's still a great time. Under visionary CEO Elon Musk, the company has zoomed from 1,500 deliveries of high-end Tesla Roadsters in 2010 to 367,500 vehicles overall in 2019. The mass-market Model 3 has been a big success, and Tesla remains committed to innovation with future electric models including its Cybertruck pickup and its Semi tractor-trailer.\n\nYet we don't see Tesla staying solely within the electric vehicle niche for long. We think there's more than a little Jeff Bezos in Musk; just Bezos took **Amazon.com** [(NASDAQ: AMZN)](https://www.fool.com/premium/company/202816) far beyond selling books into e-commerce and cloud computing, Tesla has the potential to make big waves in autonomous driving, renewable-energy building materials, artificial intelligence, and ride-sharing.\n\nMusk has his haters, but Tesla is succeeding. We're reminded of the doubters Bezos faced for years even as Amazon's stock soared — and Musk has a reputation among key players in technology as one of the smartest visionaries alive. He also has a fiercely loyal customer base supporting him in all of his efforts. Good things are happening at Tesla, and we're happy to be along for the ride.\n\n&amp;#x200B;\n\n **CURRENT PRICE:** [TTD](https://www.fool.com/premium/company/338635/) $ 281.92  -$ 4.72 (-1.6%) *Price as of* *January 10, 10:18 a.m.*\n\nWe've been beating the drum for **The Trade Desk** [(NASDAQ: TTD)](https://www.fool.com/premium/company/338635) for quite a while. Today marks the eighth  time we've named it a Best Buy Now since the start of 2019, and that's on top of Tom's latest recommendation just [two months ago](https://www.fool.com/premium/stock-advisor/coverage/18/coverage/updates/2019/11/07/buy-the-trade-desk.aspx). Why do we bring it to your attention so often? Because we believe this remains one of the best opportunities in the market.\n\nFace it, advertising isn't going away any time soon. What The Trade Desk is doing is disrupting the industry. Basically, it offers transparency to ad buyers (those who want to advertise to us) and helps those companies place the ads where they do the most good. When their ads work, buyers come back (the company's had greater than 95% customer retention for the past 24 quarters) and more buyers try it out.\n\nAs a result, The Trade Desk's revenue has been growing by leaps and bounds. In the third quarter of 2019, revenue grew by 38%. Admittedly, that's down from the 50% growth from the same period in 2018, but look at it this way: In absolute dollars, the most recent quarter's 38% increase represented revenue growth of $45.4 million, while Q3 2018's 50% increase was just $32.4 million of revenue growth. And for the just-ended fourth quarter of 2019, the company is expecting $52.5 million more in revenue than it brought in during Q4 2018. That's a bigger dollar increase than last quarter, meaning even more advertisers are using the platform.\n\nThe Trade Desk's share price is volatile. For example, it fell hard last fall before rising again to new highs. We expect more of that going forward, too. But with the large opportunity we believe is still ahead of it (and a dedicated CEO who owns 11% of the company), we're willing to make it a Best Buy once again, even at these prices, expecting it to be much higher down the road.\n\n&amp;#x200B;\n\n **CURRENT PRICE:** [ZM](https://www.fool.com/premium/company/341090/) $ 72.95  $ 0.33 (0.5%) *Price as of* *January 10, 10:18 a.m.*\n\nVideo conferencing platform provider **Zoom Video Communications** [(NASDAQ: ZM)](https://www.fool.com/premium/company/341090) makes its fourth consecutive Best Buys Now appearance today because the stock price remains attractively inexpensive even as the fundamental business has kept picking up momentum.\n\nIn the third quarter of Zoom's fiscal 2020, revenue jumped 85% year over year, and the company nearly doubled the number of customers paying $100,000 or more in annualized revenue for its services. We're particularly excited about Zoom's net dollar expansion rate, which stayed above 130% for the sixth straight quarter (this metric measures how much more existing customers are spending now than they were a year ago). With new clients coming in and existing customers committing more to the platform, we see Zoom's growth staying strong well into the future. The company now counts more than 74,000 customers with more than 10 employees.\n\nWe can't help but make the **Shopify** [(NYSE: SHOP)](https://www.fool.com/premium/company/335227) comparison when we look at Zoom. Both are founder-led, with Eric Yuan at Zoom and Tobi Lutke at Shopify each driving thriving cultures at the companies they founded. Both companies have built far better tools than the ones they replaced. Both are becoming more integral and important to their clients' lives, providing newer and better solutions. And Zoom offers all this at a $20 billion market cap.\n\nZoom still hasn't been publicly traded for a full year, and if you buy, it's wise to prepare for more volatility. But there's a lot we like about its future, and we think today is a good time to buy.",
        "subreddit": "RobinHood",
        "title": "Picks from The Motley Fool. (1-9-2020)",
        "url": "https://www.reddit.com/r/RobinHood/comments/emsqoa/picks_from_the_motley_fool_192020/",
        "created": 1578700164.0
    },
    {
        "author": "Lisvane20",
        "created_utc": 1579273439,
        "id": "eq1hpq",
        "num_comments": 114,
        "num_crossposts": 0,
        "selftext": "* PHASE 1 - Space Tourism is ramping up. \n   * First Flight this year. Rumours new God Richard Branson will fly on his birthday.\n   * 2 spaceships ready, 3 more to be built.\n   * 270 flights planned in 2023. That will turn in about $500mill revenue.\n* PHASE 2 - THIS IS WHERE THE MONEY IS BOIS. SPACE HYPERSONIC TRAVEL.\n   * Point to point travel via space.\n   * London to Australia in 2 hours.\n   * Completely overturning the aviation industry.\n   * Plans to build spaceports all over the world.\n\nConfirmed Sir Richard Branson is new JESUS. Elon Musky dust bin. \n\n$SPCE CALLS NOW. $420.69 in 2023",
        "subreddit": "wallstreetbets",
        "title": "Investing in $SPCE is literally free money. Branson confirmed new Elon Musk",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eq1hpq/investing_in_spce_is_literally_free_money_branson/",
        "created": 1579302239.0
    },
    {
        "author": "LiquidityMan",
        "created_utc": 1580025278,
        "id": "eu3yoq",
        "num_comments": 112,
        "num_crossposts": 0,
        "selftext": "Other than the fact that Tesla is a great company and will undoubtedly do well worldwide in the coming years, I think NIO will give them a run for their money in China and hopefully the rest of the world.\n\nNIO has the opportunity to stand on the shoulder of a giant and do what Tesla has done, but do it better. Let me list off a few points of what's made me bullish as fuck on them:\n\n- Gone from concept to mass production faster than Tesla\n- CEO and founder William Li believes they will turn a profit faster than Tesla\n- Has NIO Formula E Team, a professional European sports car racing team that has set multiple records at world-reknown racetracks\n- Backed by the Chinese fucking government\n- First production car to have an interactive proprietary artificial intelligence, NOMI\n- Has their own clothing collection, NIO Life\n- Fucking in-seat massagers\n- 5 minute battery swap stations\n- NIO house, a showroom on the first floor with 3 more floors of community center space, look it up!\n- 200 planned NIO House/NIO Space showroom openings in 2020\n- Developed a driverless car while waiting for driverless tech\n- Can literally use Tesla's shared IP to get a competitive edge \n- Shared environmental preservation sentiment as Tesla, their name in Chinese literally means Blue Sky Ahead \n- NIO Service, can charge your car/swap the battery for you while you sleep if your home does not have a charging station\n- Cheap as fuck right now because people think they're going to run out of money\n\nThey're about to be even more heavily discounted over the next few weeks due to some hick ass bat soup disease. Gettin my money ready to wade deeper into the communist waters of China. You should to! Imagine being able to get into Tesla when it was this cheap. \n\nTesla is more than a car company you say? So will NIO be I believe. They, like China, have a far future in mind. They're looking to the horizon while others are looking at today. It's a company I have come to love and will stand by.\n\nGodspeed rewtards.",
        "subreddit": "wallstreetbets",
        "title": "Why NIO is a Better Investment Than Tesla",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eu3yoq/why_nio_is_a_better_investment_than_tesla/",
        "created": 1580054078.0
    },
    {
        "author": "CIARRAPUNGI",
        "created_utc": 1578074791,
        "id": "ejj52x",
        "num_comments": 111,
        "num_crossposts": 0,
        "selftext": " https://imgur.com/gallery/RgV64RV\n\nThats the contract I bought, it's not going up nor down even though AMD is going up",
        "subreddit": "wallstreetbets",
        "title": "I bought long leveraged contracts on AMD while it was -0.45% down, and now that it has gone up the price remains the same? Am I missing something?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ejj52x/i_bought_long_leveraged_contracts_on_amd_while_it/",
        "created": 1578103591.0
    },
    {
        "author": "LiquidityMan",
        "created_utc": 1580179291,
        "id": "euz7s4",
        "num_comments": 110,
        "num_crossposts": 0,
        "selftext": "Ok, so we all know there's the Coronavirus going around. Here's my unsolicited advice:\n\n*What to do right now*\nIf you own any Chinese stock, get out of your position right now. If you have any calls that expire within the next few weeks, I would strongly advise you exit those as well. Protect yourself from further losses immediately. \n\n*What to watch for*\nKeep your eyes and ears peeled for the apex of viral infection. When numbers of infected peak and level off, you may want to consider getting back into the market. \n\n*What to buy right now*\nRight now buying puts on most individual Chinese stocks and indexes should prove to be fruitful. Better to get them now rather than later.\n\n*What to buy later*\nAny stock that was heavily depressed by the news, that you believe is undervalued and will rebound quickly. You may want to also keep an eye on American companies that manufacture in China. If this goes on longer than a week, their production lines will be affected and they will be ripe for buying opportunities later as well.\n\nSome of my favorite stocks at the moment are Chinese. The big three I am most interested in are Luckin' Coffee, NIO and Alibaba. All are in and will continue to be driven into bargain territory this week due to the extended Chinese New Years Holiday and likely even further beyond that.\n\n*What's the buy point*\nThis is hugely speculative, but here are my predictions on the best buying points for my three mentioned stocks above:\n\nLK:\nAttractive - $30\nGet In Now - $24\nMust Buy - $18 and below\n\nNIO:\nAttractive - $3\nBuy Now - $2.50\nThrow Your Money At It - $2 and below\n\nBABA:\nAttractive: $200\nBuy Now: $160\nMortgage your home: $135 and below\n\n*What does all of this mean*\nIt means you have the buying opportunity of the year or possibly even years in these stocks. As long as the virus doesnt kill off too many people, the Chinese economy will bounce back even stronger and your profits will swell along with it. \n\n*Final Thoughts*\nKeep your cool and focus on profiting in these market conditions. Many opportunities are presenting themselves, have the calm sense to realize what they are. I have already eaten losses myself. If you have too, pick yourselves up, pat yourself on the back and get your ass back in the game\n\nBest of luck to all my WSBros and well-wishes to all those who are suffering in China from the direct and indirect effects of the coronavirus.",
        "subreddit": "wallstreetbets",
        "title": "Consolidated Chinese Market Virus Guide",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/euz7s4/consolidated_chinese_market_virus_guide/",
        "created": 1580208091.0
    },
    {
        "author": "HappyCamper1980",
        "created_utc": 1579105078,
        "id": "ep4bok",
        "num_comments": 110,
        "num_crossposts": 0,
        "selftext": "After many years of autistic posting and taking huge ass losses in NVDA last year I finally made it to level 7.  https://imgur.com/a/UHT9pof  Couldn't have done it without you retards (also boring shit like COST AAPL NOW DIS HD GOOG FAST).  Thanks!",
        "subreddit": "wallstreetbets",
        "title": "After many years of autistic posting",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ep4bok/after_many_years_of_autistic_posting/",
        "created": 1579133878.0
    },
    {
        "author": "throwawayeue",
        "created_utc": 1578669054,
        "id": "ems7oz",
        "num_comments": 110,
        "num_crossposts": 0,
        "selftext": "Imagine making so much money on the dip last year that you can't just step back and see that Roku is poisonous now. Imagine all your gains from the past few weeks simply covering up your losses from Roku. Imagine, basically losing at least half of your gains from Roku's run to bad put credit spreads the past few months, and STILL buying more put credit spreads that \"just have to work this time\".\n\nImagine being that dumb, that arrogant. Imagine never learning your lesson. Imagine being me.",
        "subreddit": "wallstreetbets",
        "title": "Imagine still being bullish on Roku",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ems7oz/imagine_still_being_bullish_on_roku/",
        "created": 1578697854.0
    },
    {
        "author": "jsally17",
        "created_utc": 1580270197,
        "id": "evhee6",
        "num_comments": 110,
        "num_crossposts": 0,
        "selftext": "I’m still learning about IV Crush and I’m stressing about whether I should grab these profits now or wait until MSFT reports. \n\nCan a more experienced trader offer some wisdom here?",
        "subreddit": "options",
        "title": "Still learning, I have $MSFT $150 2/21 Call that I bought back in November. I’m up about 160%. Should I sell the option before earnings tomorrow or wait it out until after earnings?",
        "url": "https://www.reddit.com/r/options/comments/evhee6/still_learning_i_have_msft_150_221_call_that_i/",
        "created": 1580298997.0
    },
    {
        "author": "Mrbusiness2019",
        "created_utc": 1577903652,
        "id": "eilqy4",
        "num_comments": 108,
        "num_crossposts": 0,
        "selftext": "I would love a healthy dose of responses to this statement. \n\n10yrs ago (2010), I began selling old books on amazon and old DVD’s on eBay. It wasn’t consistent, I was making something like £50 a month. \n\nI had just turned 16 and I had a few friends who did this online sales thing with me. We used to do everything to keep our little business a secret from people because we knew that, these sites (amazon and eBay) were going to be very popular in the future and we wanted to keep the opportunity to ourselves. \n\nLooking back now, one can see that we were pretty much sold on both platforms and my much older self would have gladly invested in these companies based on our little success selling online. \n\nHowever, when I look at the historical balance sheets of these businesses, especially amazon , I realise that I would have hesitated to invest in the company because they had 0 earnings, PE ratio was ridiculously high etc. \n\nToday I wonder if that fundamental analysis can sometimes be a hinderance when it comes to picking obvious (amazon was a gold mine for anyone with spare stuff lying around) growth companies. \n\nI wonder if there was a very clever adult (retail investor without Bloomberg terminal and all that fancy stuff) who figured (10yrs ago) that the internet was going to be the future and aggressively bought shares in some of the trendy public companies back then (Fbook, amazon, eBay, Netflix)\n\n\nAny thoughts on this?",
        "subreddit": "investing",
        "title": "Correct me if I am wrong, but I feel that sometimes looking at the fundamentals of a business can put you off a great investment.",
        "url": "https://www.reddit.com/r/investing/comments/eilqy4/correct_me_if_i_am_wrong_but_i_feel_that/",
        "created": 1577932452.0
    },
    {
        "author": "crossroadie666",
        "created_utc": 1580023478,
        "id": "eu3q9v",
        "num_comments": 108,
        "num_crossposts": 0,
        "selftext": "Yes you were short and lost monies\n\nAnd now you think it’s your turn to make monies on Monday on corona virus news\nAnd even that’s still not a reality till markets open \n\nBut in some corner of your mind, you want this  epidemic to go ballistic and  make monies off it , you must evaluate your mental health \n\nLosing monies can have this effect. The devil creeps in slowly.\n\nBut it is your duty to exorcise all these thoughts from your mind and pray for the better of mankind \n\nYou can make a million out of a $ but you cannot bring life back. The suffering is terrible \n\nReminds the cycle of karma . What goes around comes around \n\nSo think over this and do the exorcism of bad thoughts \n\nMay we find a cure quick and this situation is contained swiftly \n\nMuch prayers for the Chinese brothers and sisters out there fighting.",
        "subreddit": "wallstreetbets",
        "title": "Remember money can be made. But if you are short and rooting for epidemic , check your mental health",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eu3q9v/remember_money_can_be_made_but_if_you_are_short/",
        "created": 1580052278.0
    },
    {
        "author": "fallouthong",
        "created_utc": 1579115881,
        "id": "ep6v4x",
        "num_comments": 106,
        "num_crossposts": 0,
        "selftext": "SO WE CAN BUY THE MOTHER FUKING DIP. CALLS ARE ON SALE RIGHT NOW. IS TIME TO STOCK UP. GOD HIMSELF GAVE YOU GUYS THIS ONE TIME 50% off discount that will expire in 2 hours. Better buy it now or forever hold your peace.",
        "subreddit": "wallstreetbets",
        "title": "TSM, WHY YOU DO THIS TO ME RIGHT BEFORE EARNINGS???",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ep6v4x/tsm_why_you_do_this_to_me_right_before_earnings/",
        "created": 1579144681.0
    },
    {
        "author": "Yasai101",
        "created_utc": 1577885439,
        "id": "eiicnv",
        "num_comments": 104,
        "num_crossposts": 0,
        "selftext": "Every time I talk in public or write some message I start talking like a god damn autist straight from wsb. \"Fuck this, fuck that, retards, fuckers\" are like every other word out of my mouth.\n\nI feel so alone now. You people are too damn rare out in the real world.",
        "subreddit": "wallstreetbets",
        "title": "You people have ruined me",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eiicnv/you_people_have_ruined_me/",
        "created": 1577914239.0
    },
    {
        "author": "The_Pandemonium",
        "created_utc": 1578859231,
        "id": "enshqa",
        "num_comments": 102,
        "num_crossposts": 0,
        "selftext": "God this sub really is retarded. The last couple of days I've been reading that people don't understand what a put credit spread is or don't understand how spreads work. Just yesterday I read a post where op was clearly bullish on spy and did put credit spreads and calls but people called him retarded cause they only read \"put\" and think \"he want market down\"\n\nAlright retards this is how it works. \n\nYou sell a put that's out of the money. You buy a put that's one strike below the put you sell. The difference between the two strikes is your collat. If you sell a put at 315, and buy a put at 314, your max lose is 100 dollars. The difference for you retards is 314-315=1. 1x100= 100.(if your really dumb, we multiply by 100 because options are contracts that move 100 shares per option) 100 is your max lose. You collect the premium that is the difference between the two strikes. If the premium for the 315 strike is 10 bucks, and the premium for the 314 is 5 bucks, your risking 100 dollars to make 5 dollars. \n\nHope your still following along retards. \n\nAt exp you collect your 5 dollar premium. The put you sold becomes worthless, as does the put you bought. The put you sold is worth more than the put you bought. Which is why you make 5 dollars. \n\n\"oh but I'm scared and too stupid to understand this stuff, what if I get assigned\" \n\nThat's alright retard, the put you bought is insurance that your ok if the stock goes into free fall. Once you get assigned, your exercise the put you bought to sell the shares back into the market. Your brokerage understands whats happening. You receive negative buying power for the meantime til you exercise your long leg. \n\n\"oh but I'm still really dumb and can't critically think, what happens if the put I bought doesn't end up in the money, am I fuckkkkedddd? \n\nNo retard just think about it for a second. If the put you bought can't be exercised, you just sell the 100 shares back into the market. Let's do some simple math (which I failed in 12th grade). You get assigned on your 315 put sell. You receive the 100 shares. The stock drops to 314.50. You can't exercise your long leg. You sell the shares back at 314.50. The difference between 315 and 314.50 is 50 cents. Multiply .50x100. It equals 50 dollars. Your lose is 50 dollars. \n\nSame goes for call credit spreads. Congrats your now less retarded. If your really too dumb to understand this, keep reading this post til it clicks.",
        "subreddit": "wallstreetbets",
        "title": "How to/ what is a put credit spread: because half this sub is retarded",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/enshqa/how_to_what_is_a_put_credit_spread_because_half/",
        "created": 1578888031.0
    },
    {
        "author": "runtothesun",
        "created_utc": 1578641951,
        "id": "emnqn7",
        "num_comments": 100,
        "num_crossposts": 0,
        "selftext": "I fucking love Apple.\n\nI don't even use a checking account. Or savings. I put tens of thousands into Apple at $210 thinking it would just stabilize and grow slowly. Cuz fuck bank interest and slow gains - what am I? Gay? Fuck no. Bless Tim Apple. This company is a rocket with room to go higher. For a year it's only gone in a 45 degree angle. It's hilarious because bears still exist. This company made goofy pcs 15 years ago and has since killed Nokia and the record store. They make the most popular phone ever - and all they do is re-release them with 1 new feature over and over as if they're Avengers sequels. It's amazing, retarded, and brilliant at the same time. I cant wait for iPhone 57 Pro Max. We're all gonna buy it. How? With the fucking CREDIT CARD made by the same fucking company cuz \"fuck it, lets be a bank too.\"\n\nYou're an idiot if you ain't in Apple. Think about it. Cinematic legend, autist and ping-pong retard, Forrest Gump even invested in 1994. Invested all that shrimp money in that \"fruit company\". 14,627% increase since then. He now mows lawns for 20 minutes and then fucks hookers and snorts cocaine off Jenny's grave.\n\nAnd some of you dumbasses just watch it fly instead of getting on the elevator.\n\nImagine being more retarded than Forrest Gump",
        "subreddit": "wallstreetbets",
        "title": "Forrest Gump bought Apple he's retarded. What does that make you?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/emnqn7/forrest_gump_bought_apple_hes_retarded_what_does/",
        "created": 1578670751.0
    },
    {
        "author": "Fair_Criticism",
        "created_utc": 1578811617,
        "id": "enk8bw",
        "num_comments": 100,
        "num_crossposts": 0,
        "selftext": " Joel Tillinghast, a once-legendary portfolio fund manager and colleague at Fidelity, sometimes describes retail apparel investing as \"momentum-based\". After all, when it works, you look like a genius: people throw $20 bills at you in exchange for flimsy cotton shifts that cost $3.50 to manufacture and $5 to market. Every appareler is convinced they have the Midas touch, and [when it stops working](https://en.wikipedia.org/wiki/Forever_21), the public reacts to the your brand as if they'd awakened in some haze: \"Why did we buy this stuff to begin with?\" consumers wonder. \"Why did we give this thing such a high multiple?\" investors wonder. Somehow, we never learn the lesson with apparel, and so the cycle continues.  \n\n\nThere's a subtle distinction I'd like to make, though. While \"momentum\" is a good first-order approximation, it doesn't really describe what's actually going on: a realization gradient. Consumers over time realize the social capital that's being conveyed through apparel, and buy it because they come to an understanding. The realization gradient works both ways: some consumers are less quick to realize the death of a brand, but they eventually catch on and stop buying as well. The belief that apparel is a random walk down human preferences isn't accurate: rather, the social-capital zeitgeist shifts over time, and brands that are well-positioned to trade on that social capital do well.  \n\n\nVictoria's Secret (owned by publicly traded Limited Brands) is entering the negative realization death spiral. The clothing is now perceived as uncomfortable, overpriced vs alternatives, and promoting unhealthy expectations. Les Wexner's [Epstein connection](https://www.vox.com/the-goods/2019/7/10/20689134/jeffrey-epstein-les-wexner-l-brands-victoria-secret-limited) is certainly not helping. The optics are horrendous. What was once sexy is now complicit. Worse, there are far, far too many competent competitors. Let's review.  \n\n\nGap Body has been exceptionally successful at targeting lingerie \"basics\", Journelle and Nordstrom round out the midtier, and Agent Provocateur and La Perla round out the high end.\n\n[Link to lots of women in lingerie.  For science.](http://theyieldblog.com/l_brands)\n\nDon't even get me started on the infinity of online competitors -- Adore Me, Panache, Hanky Panky, Heidi Klum Intimates, Mapale, Yummie, Addiction Nouvelle, Parfait, Le Mystere, Montelle Intimates, Giapenta, and Cosabella turn up with a few seconds of searching. Victoria's Secret is deader-than-dead, and worse yet, has massive operating leases and a fleet of retail sales associates that will accelerate its demise. To be honest, I've never understood how lingerie at Victoria's Secret became such a dominant in-store purchasing phenomenon to begin with: the shopping experience for men is at best awkward, and for women the brand is currently perceived as regressive, uncomfortable, and sexist. I'd also argue that the competition is broader than we realize: various athleisure brands fulfill a similar body-positivity drive while mitigating any feelings of being [complicit](https://www.forbes.com/sites/pamdanziger/2018/11/25/thirdlove-tells-john-mehas-how-to-fix-victorias-secret-in-full-page-new-york-times-ad/#292449f72285). Limited Brands will of course cut non-performing VS stores, but the question is how fast?  \n\n\nThere's an inherent tension between bondholders and equity holders here: Les Wexner owns 17% of the outstanding equity, his wife owns another 5%, and will issue dividends until it becomes [fraudulent conveyance](https://www.investopedia.com/terms/f/fraudulentconveyance.asp) to continue to do so. The fact that any dividends are being issued while a). the company needs to cut leases b). the company holds &gt;$5bn in debt yielding 6%+ and c). sales are imploding demonstrates either incompetent corporate finance or denial on the part of Les Wexner. If US creditor protection were stronger, bondholders might be able to fire off warning letters now asking Limited Brands leadership to start cutting leases, paying down debt, and halting dividend issuance. As it stands now, the only thing bondholders can do is sit back and record grievances until Chapter 11 gets filed.  \n\n\nI see only one way Limited Brands can pull itself out of this mess: Grow Bath &amp; Body Works fast enough to offset Victoria's Secret losses, and cut VS costs rather than trying to save a dead brand on the wrong side of the realization gradient. On Bath &amp; Body Works:\n\n*\"Their target is what we call the mastige segment,\" she continues. \"It's not prestige and it's not mass—it's really about figuring out this niche of very American-centric shoppers that wants a notch above drugstore brands, but are still quite conscious. They don't want the prestige segment, which is where the Estée Lauders and the L'Oreals of the world play.\" A compelling factor here is the price point. The largest size room spray (5.3 ounces) is only $9.50; foam soaps are $5.50; fragrance mists are $14. You can buy one item from every major category and barely spend $100. Kang confirms that's a huge part of the appeal. She says the diehard fan \"is someone who just absolutely loves fragrances, and sees fragrance as an essential part of her lifestyle.\" She adds, \"A lot of our customers actually own multiple fragrances, and they engage in fragrance the way that they do other fashion items in their life. It's a way to accessorize their style. It's not this sort of serious, deep-commitment kind of purchase that you see with a more traditional model in a department store.\"*\n\n1. I once mistakenly stayed in the AirBnB of what I at the time could only describe as a \"crazy candle lady\" who burned a different scent every 6 hours. It's a little bit sad that corporate marketing accords more nuance and empathy to their customers than anyone else ever would.  \n\n\n2. Bath &amp; Bodyworks' product is defensible: most \"nice things\" are expensive for most Americans, whereas Bath and Body Works offers an affordable, guiltless, if synthetic form of self-care. The guiltlessness of the brand is the ultimate growth driver: its products are sweets-adjacent (notice how many of the candles below are food-oriented), and inexpensive. Most activities I personally enjoy are either expensive enough to induce some amount of guilt, or unhealthy enough to do the same. There are almost no \"free pleasures\" -- an inexpensive scent from Bath &amp; Body Works might be one of the few. I think this is ultimately what's giving Bath &amp; Body Works its incredible comps, and being scent-based, it's of course naturally resistant to online competition.\n\n[Limited Brands Financial Model](http://theyieldblog.com/l_brands)  (Link to financial model)\n\nHere's a model of my best guess of what will happen (click on the image so you don't have to squint). There are a couple noteworthy things here:\n\n1). VS has not yet signficiantly cut non-lease SG&amp;A -- in fact it appears to still be growing in the low-single digits. This is totally unacceptable and honestly shows that LB management is either delusional or incompetent: if your revenues are declining 8% a year and you somehow find a way to grow SG&amp;A, you are either flailing, an imbecile, or a flailing imbecile. My guess, after having worked at many companies, is that Limited Brands management never set up the kind of performance-attribution tracking necessary to intelligently allocate capital. Their internal planning is likely just budget-based departmental fights. What's worse, new CEO Mehas is likely ride-or-die on Victoria's Secret: so long as he continues to describe his job as \"listening to the consumer\", rather than \"tying a tourniquet\", I expect SG&amp;A to be flat at best. There's also the \"stubborn founder\" angle -- for Les Wexner to order Mehas to cut VS would be a repudiation of his life's work. Old billionaires tend to get very sticky, and given Wexner's affiliations with Epstein, doubly so.  \n\n\n2). Various gross margins have been adjusted -- many non-cash impairments are negatively impacting earnings in a way that is irrelevant to the business.  \n\n\n3). Store leases are typically around 10 years long and non-cancellable, but management is only cutting total VS store square footage by around 3% a year, which means it's only closing around 30% of available \"closeable\" stores. This is not remotely aggressive enough. Management should be aggressively negotiating subleases and taking lease break restructuring impairments on their worst-performing stores. They should also avoid opening new stores, especially not ones in [nearly-Brexit](https://tietheknot.scot/the-first-victorias-secret-store-in-scotland-opens-today/) Scotland. I mean really, what is Les Wexner thinking?  \n\n\n4). While I continue to model growth in Bath &amp; Body Works, I think we are close to hitting a wall on growth: most women I know consider the brand to be for tweens and low-income young mothers. There's also minimal international appeal -- this is a niche brand for middle American women that is nearing saturation. Even if we assume 50m American women buy $100 a year of the stuff, that still only gets us $5bn of annual revenues. I think we are very close to hitting a wall in overall appetite unless Bath and Body Works can find some new realization gradient with very different demographics.  \n\n\n5). VS sales and gross margin decline comes almost completely from promotions, aka price cuts. VS will likely struggle to keep gross margins above 30% in the future.  \n\n\n6). I really want to emphasize how much the core of this conflict is fundamentally about capital structure ownership: equity performance via leveraged SG&amp;A, versus debt de-leveraging via decreased SG&amp;A. Non-rent SG&amp;A is the single largest controllable driver of VS operating profits. Yes, the [fashion show was cancelled](https://variety.com/2019/tv/news/victorias-secret-fashion-show-canceled-why-1203413186/), but it's not enough: literally the entire company hinges on whether it can cut SG&amp;A or not -- by 2025 VS will be 0% operating margins from VS declines, even if they manage to reverse SG&amp;A growth and cut it by 3%. Dramatic restructuring will be necessary to save Limited Brands.  \n\n\nPersonally, I am going to own a small holding of LBrands bonds: it doesn't look like the company as a whole will become insolvent by 2027, whereas the stock will almost certainly be unable to avoid a complete implosion in a few years, so I am planning on shorting 1/3 of the amount of my bond holdings amount in equity. The goal here is to target a very narrow, carefully modeled valuation range of stub equity value mismanaged by thumb-sucking leadership that will pull themselves out of a crisis only when things get dire.",
        "subreddit": "investing",
        "title": "Slow-motion trainwreck that is Victoria's Secret: Short Equity &amp; Go Long Bonds?",
        "url": "https://www.reddit.com/r/investing/comments/enk8bw/slowmotion_trainwreck_that_is_victorias_secret/",
        "created": 1578840417.0
    },
    {
        "author": "Kristoloy",
        "created_utc": 1578756079,
        "id": "en8n1q",
        "num_comments": 100,
        "num_crossposts": 0,
        "selftext": "Damn. [$bynd](https://i.imgur.com/pwNQhXk.png) is holding a very important level right now at 95.25-50.\n\nIt's only [$0.30](https://i.imgur.com/ASHCuKP.png) from a golden cross with its 20/50 MA. [chart](https://i.imgur.com/ugJMcgD.png) With over 25% short interest and [RISING](https://i.imgur.com/Az3AQq7.png), if the market is volatile on Monday, many shorts will want OUT. This is your opportunity to get IN you fucking idiot why didn't you get in on Wednesday when they made this fucking deal with the king clown himself ROnald FUCKING mcdonald. You know whos safe in volatility? THE FUCKING KING IS! dont bet against mcdonalds. dont bet against bynd here. you will lose.\n\nIf they break this fucking level, BYND is taking the moon with it on its way to the fucking SUN. THis shit is going ETERNAL",
        "subreddit": "wallstreetbets",
        "title": "Bulls, bears, idgaf who you are... listen up. $BYND is your opportunity to get paid this week regardless of what the market does. DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/en8n1q/bulls_bears_idgaf_who_you_are_listen_up_bynd_is/",
        "created": 1578784879.0
    },
    {
        "author": "Szeen_R",
        "created_utc": 1578086028,
        "id": "ejlv76",
        "num_comments": 98,
        "num_crossposts": 0,
        "selftext": "This is it you fucking autists, 5 more years of rallying. Do you not get it? Am I the only one who gets it?\n\nBear gang is FUCKED. Bull gang will ride out on apaches and Lockheed Martin calls for the next 5 years while those middle eastern sand monkeys get fried up in GBU-43/B remnants. Don't believe me? This is all a fucking ploy!\n\nThe markets were on their way down when the FED repo'd the living shit out of it. You get 60 billion, you get 60 billion, every index gets 60 fucking billion. Well that dust has settled and now its time for new dust to rise from Baghdad to Tehran.\n\nStill don't get it you autistic dummy? What happened after the great depression? WWII baby, markets roared all through the 50's. The fucking GOLDEN AGE BABY! What happened in the 60's? VIET-FUCKING-KONG. Markets soared higher than the the Eagles that brace the grate nation of the United Fucking States. And how the fuck can you forget the 2003 visit to Iraq? They hid those goddamn nuclear weapons somewhere, I just fucking know it. And while we were looking for them, what do we find? Liquid cocaine.\n\nAnd I know what you're thinking. You're thinking I'm so horrible right-wing reactionary who had a horrible up-bringing and whose father beat him every day with a bible, well maybe its true **BUT IT NEVER DID ME ANY HARM.**\n\nIts time to show the world the TRUE strength of the most overfunded military in the god damn world. Double down on those calls you beautiful sons of bitches, and lets go profit off those fucking Camel Jockeys.\n\n&amp;#x200B;\n\nEdit: [Proof of concept](https://imgur.com/gallery/q0cc6QD)",
        "subreddit": "wallstreetbets",
        "title": "War = Rallies you fucktards",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ejlv76/war_rallies_you_fucktards/",
        "created": 1578114828.0
    },
    {
        "author": "DatFapnNap",
        "created_utc": 1578544897,
        "id": "em4qnr",
        "num_comments": 96,
        "num_crossposts": 0,
        "selftext": " Alright you Autist,\n\nMy first post on WSB, long live bull gang.\n\nLet’s get to options trading using cool shit like MACD, RSI, and GAP so we can go all in and lose our money together, head to the “Winchester, have a nice cold pint, and wait for 2020 to blow over.” Note: I’m not a pro or a financial advisor, use at your own risk. What I am is a 300lb neckbeard that loves the show Billions, cries at the end of Wolf of Wallstreet, and comments on Pornhub videos. But anyway…I’ll be using AMD due to the bull gang love and CGC cause some autist is giving out wrong info, don’t buy that shit.\n\n&amp;#x200B;\n\n**RSI:**\n\nDafuq is RSI? Well…it stands for Relative Strength Index…and Wikipedia says it’s “a momentum indicator that measures the magnitude of recent price changes to evaluate overbought or oversold conditions in the price of a stock.” For our purposes here, think of it as just one word, **Momentum**. We can look at the momentum of a stock based on specific criteria, 250 days and 10 days and select times to buy and sell contracts of said stock. This generally works on a 1day – 5minute chart. I like to day trade options, scalp, take my tendies, hit up Wendy’s…dat baconator nawmean. *Find what works best for your trading style*.\n\n\\*RSI | 250-day Indicator\\*\n\nThink of this as the “overall” momentum of the stock.  RSI is used for overbought/oversold positions and floats between 30-70. For our trading, think of 50 as our indicator line. Anything above is a “bullish” stock and anything below is a “bearish” stock.\n\nBullish: AMD –  [https://imgur.com/a/sbTXDb7](https://imgur.com/a/sbTXDb7) \n\nBearshit: CGC – [https://imgur.com/a/nI2BTpd](https://imgur.com/a/nI2BTpd) \n\nThis shows the long-term trend of the stock, rather it’s on fire or crashing like Pier 1 imports. As you can see AMD is bullish and well, I will repeat don’t by that shit CGC yet options wise (until it hits the below stuff, the call the fuck out of it).\n\n\\*RSI | 10-day Indicator\\*\n\nThe 10-day chart shows your entry and exist points (look to call / look to put) for potentially gaining max profit.\n\nSimilar to the 50 line for the 250-day indicator, we’re looking at the 30 and 60 lines for the 10-day chart.\n\nTreasure Map: AMD - [https://imgur.com/a/K12HIkG](https://imgur.com/a/K12HIkG) \n\nAs you can see, usually charts come around after the 30 and 6 levels. So for buying calls, watch for the stock to drop below 30 and then place a put on the loop-around back once it crosses 30 again. Ride it up as long as you want, but once it crosses 60, I sell the option, rather ITM, ATM, or OTM.\n\nSame for puts, but inverse, put at the 2nd 60 line , exist at the first 30 line break.\n\nHopefully you’ll profit. I even added in some puts to show the bear gang some luv. &lt;3 fap n nap\n\n&amp;#x200B;\n\n**MACD:**\n\nNow that you’re an expert options ~~trader~~ autist at RSI, let’s move to MACD…I like to call it the MacDaddy. But really, MACD stands for Moving Average Convergence Divergence and it’s a trend-following momentum indicator that shows the relationship between two moving averages of a security's price. For our purposes, none of that shit matters, we’re looking for X marks the spot on calls or puts.\n\nThis one is simple, use the 50 line as your baseline (similar to RSI 250) with 12 and 26 as your settings. Anytime the moving averages cross (make an X) above the 50 line, that’s usually a sign to put, if below the 50 line, that’s usually a call option.\n\nExample: [https://imgur.com/a/C9KdtDm](https://imgur.com/a/C9KdtDm) \n\nMake sure you review the chart overall, look at the amount of time it took to move $X amount. Based on your dollar movement estimate for either calls or puts, always multiple by 10. For example, if a stock is $11, and I put a call for $13, I wouldn’t want to cut myself short, so I’d get a call that’s about 20 days out ($2 x 10 = 20) Jesus titty fucking Christ break out the calculator already and do your own math.\n\n&amp;#x200B;\n\n**GAP:** \n\nMy personal favorite and I’m not talking about the GAP between my eyebrows either, thanks genetics. Fucking 2020 caveman over here. Anyway…\n\nI like it cause it’s easy and narrows down my choices for what to call or put. I look at stocks that gapped up or down and use the above RSI and MacDaddy to see if it’s at a good entry point. If all 3 stars align, viola, you’ll be driving a cybertruck in no time.\n\nExample GAP: [https://imgur.com/a/peLJBTk](https://imgur.com/a/peLJBTk) \n\n&amp;#x200B;\n\n**Parting words of wisdom:**\n\n\\- It’s a marathon, not a race\n\n\\- No one went broke locking in profits\n\n\\- Don’t be greedy, build you stack once option at a time\n\n\\- F for the Bear gang\n\nLuv, \n\nFap-n-Nap",
        "subreddit": "wallstreetbets",
        "title": "Autist Trading with RSI, MACD, and GAP",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/em4qnr/autist_trading_with_rsi_macd_and_gap/",
        "created": 1578573697.0
    },
    {
        "author": "InfiniteAccuracy",
        "created_utc": 1578001169,
        "id": "ej4rqr",
        "num_comments": 95,
        "num_crossposts": 0,
        "selftext": "Literally everything is mooning right now, but buying puts is idiotic, and borderline completely retarded.  Is there anything that still has plenty of room to run, and wont randomly cuck me when they inevitably get some B.S. downgrade or unexpected \"end of the world\" type news?  Im really not sure what to pick up here except maybe just keep buying spy calls?  Just curious what everyone's 2020 picks are and such.",
        "subreddit": "wallstreetbets",
        "title": "Is anything still cheap?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ej4rqr/is_anything_still_cheap/",
        "created": 1578029969.0
    },
    {
        "author": "helio987",
        "created_utc": 1579961431,
        "id": "etr794",
        "num_comments": 95,
        "num_crossposts": 0,
        "selftext": "I know a lot of you guys will say to handle my own portfolio, which I do for about 25% of it.  Years ago, I was failing big time, in over my head so I brought it to RBC to straighten out.  Some of the stocks I still have from my initial purchases like msft, intc, cn rail, which now I have done great on.  The other day I went to see him and his new team wants to reconfigure my entire profile, basically sell all my stocks and purchase a series of dynamic asset allocation funds.  They are companies similar to Berskshire.  I asked what about my current stocks, are they transferable in kind to these funds.  He said no, they would be sold.  I brought up the fact that between a group of stocks that I own, I counted capital gain of 300k and with a few loser stocks that I lost about 40k.  So I have to pay tax on that now, which would put me in the highest tax bracket.  I could not believe he had no answer for that and did not even think about that.  I am not that smart but even I knew that.  He was proud that last year my portfolio did 15%, which is a mix of stocks, bonds, GIC.  Well on my own side, I did 15 % as well with some basic TD bank mutual funds, VTI and a few good stocks.  A lot of you guys on here are well versed in trading, I know enough to be dangerous and the dangerous part got me in trouble.  Face it, the last 8 years, anyone could have made money.  When I first started in the late 90's, it was like now.  I would buy 5k of stocks, in a few months, it was worth 7k, I would sell and go on vacation. Then the tech crash came  and i lost a ton. I am getting older, so you don't want to lose it all and that is what rbs is supposed to do but to sell all my stuff and hand me a huge capital gain bill was insane.",
        "subreddit": "investing",
        "title": "Why I should terminate my financial adviser.",
        "url": "https://www.reddit.com/r/investing/comments/etr794/why_i_should_terminate_my_financial_adviser/",
        "created": 1579990231.0
    },
    {
        "author": "likesundayslikerain",
        "created_utc": 1578413283,
        "id": "eldi22",
        "num_comments": 94,
        "num_crossposts": 0,
        "selftext": "It looks like the market is dipping a bit. Are you getting any stocks now? If so, do you have any reccomendations of what to get or what to look out for? Or do you think the dip will go even further and you’re just waiting?",
        "subreddit": "stocks",
        "title": "Any stocks you are thinking of getting today/this week?",
        "url": "https://www.reddit.com/r/stocks/comments/eldi22/any_stocks_you_are_thinking_of_getting_todaythis/",
        "created": 1578442083.0
    },
    {
        "author": "BadDoctorMD",
        "created_utc": 1578406607,
        "id": "elc3l6",
        "num_comments": 91,
        "num_crossposts": 0,
        "selftext": "So many people asking \"What happened to INPX??!\"\n\nPRICE JUMPED SO HIGH! I'M SO RICH! BUT NOW I HAVE NO SHARES??? RH IS A SCAM!\n\nMan, just GOOGLE INPX and the first news article is that it went through a 45:1 R/S\n\nIf you then google what a reverse split is....",
        "subreddit": "RobinHood",
        "title": "Do you guys just not follow your own stock or...?",
        "url": "https://www.reddit.com/r/RobinHood/comments/elc3l6/do_you_guys_just_not_follow_your_own_stock_or/",
        "created": 1578435407.0
    },
    {
        "author": "tickbird",
        "created_utc": 1580496176,
        "id": "ewsumq",
        "num_comments": 91,
        "num_crossposts": 0,
        "selftext": "It's not even close to SARS, I was live in Taiwan and know 2003 trust me.\n\nFirst, infection increase start to decelerated. Some dude already made a graph for me see this diagram\n\n[https://www.reddit.com/r/dataisbeautiful/comments/evlmqr/oc\\_update\\_on\\_timelapse\\_of\\_wuhan\\_coronavirus/](https://www.reddit.com/r/dataisbeautiful/comments/evlmqr/oc_update_on_timelapse_of_wuhan_coronavirus/)\n\nYou can see S curve green region, that is what exactly I expect and every expert think that most likely happen. I'll expect total infection should end around 15k.\n\nVirus infection increments start to significantly decreasing (+%)\n\nPast 5 days 1200, 2000, 4500, 6000, 8000, 9600\n\nnotice? first day +800(+50%), +2500(+125%), +1500(+33%), +2000(+33%), +1200(+20%)\n\n2000 -&gt; 4500 was panic really terrible, terrifying but I think now it's over.\n\nWe are very in good shape this represent virus infection chart shows S curve\n\nand conclude virus will be over soon and probably in a month.\n\nI would expect total maximum infection around 25k (very unlikely happen)\n\nFatality rate start to decreasing, no people dead by virus except in China so far, less than 2% fatality rate if infected by virus and 90% death are old people who already has more than one serious disease. Only 2 people dead 30-40 and nobody dead in 10-30.\n\nHK already made vaccin, what these mean is even if something worst happen and much people infected we produce vaccin and game over. The only reason they hesitate to produce vaccin is there is no much demand. Also, UK found antibodies for nCovrius today news.\n\nSummary\n\n1. Infection decelerated\n2. Fatality rate decrease (most are old people)\n3. We already had solution.\n4. Nothing to worry.\n\n# \"Buy fear sell greed\"\n\nBest quote for today. I already bought 30 SPY 330$ exp on Feb/12 we will see. I'll expect there will be huge gap up on monday.",
        "subreddit": "wallstreetbets",
        "title": "Corona virus isn't that serious market over reacting.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ewsumq/corona_virus_isnt_that_serious_market_over/",
        "created": 1580524976.0
    },
    {
        "author": "vntoknt0",
        "created_utc": 1577904978,
        "id": "eim1g2",
        "num_comments": 91,
        "num_crossposts": 0,
        "selftext": "https://www.facebook.com/pg/intelelp/posts/\n\npromoting women and ethnics rather than based purely on merit. \n\nlook at that banner photo, almost 50% are women. no engineering class has 50% women. its obvious most of these women wouldn't end up as new engineers in intel if the criteria was truly merit based\n\nthen you see 3 black people in total. what a  joke. \n\nand there are 5 Asians. ONLY 1 MAN, rest 4 are all women. are you telling me Asian women are better at semiconductor engineering than Asian men? once again, huge gynocentric bias. its almost certain that Asian guy is highly competent because he's subject to the same strict criteria as a \"normal\" white male applicant, while the 4 Asian women are most likely not and chosen because of their gender and being a minority (despite the fact that being an Asian man brings no advantage at all despite being a minority)\n\n\n&gt;Intel named to the NAFE Top 50 Companies for Executive Women.\nThe National Association for Female Executives (NAFE) list celebrates U.S. companies that have programs and policies in place that promote the advancement of women, including training, accountability and succession planning. This year marks the 6th time Intel has been recognized on NAFE’s list of top companies for executive women. \n\nJFL at the blatant gender discrimination\n\nFor those who don't know, Intel has fucked up their CPU roadmap. It's been stuck at 14nm for 5 years and the 10nm process has been delayed again and again. And investors and gamers are not happy about it. \n\nTheir former CEO,  Brian Krzanich, was fired for failing to deliver 10nm. To avoid admitting Intel has screwed up their technology, the official reason for his firing was for him having relationship with a female coworker LOL talking about a fucking hypocrite (he wouldn't be fired for that reason or excuse, if he actually delivered the 10nm). and now a bean counter is the new CEO and been in charge. Under that cuck Brian Krzanich, Intel was focused on identify politics, promoting women and blacks, as well as other PC stuffs such as declaring their CPUs \"conflict minerals free\". \n\nAll the nerds on reddit know Intel's 10nm fuckup, how it stagnated CPU tech by keep releasing 4 core mainstream products for 10 years rather than giving out more cores,  and how it allowed its rival AMD to catch up. None of them know the real reason, they just think its greed. The real reasons are far worse. It's because of cuckoldry, pussy worship, and mangina-ism.",
        "subreddit": "wallstreetbets",
        "title": "Real reason Intel why failed to deliver 10nm for so long is because of feminism",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eim1g2/real_reason_intel_why_failed_to_deliver_10nm_for/",
        "created": 1577933778.0
    },
    {
        "author": "fuma000",
        "created_utc": 1578398579,
        "id": "elao84",
        "num_comments": 90,
        "num_crossposts": 0,
        "selftext": "Guys honestly...if you had some money to invest right now, would you invest in AMD even though its at 48,39$ highest price ever?\n\nWhy or why not?\n\nPlease dont come at me im a dummy im still a rookie on these technology. (English not native language)",
        "subreddit": "wallstreetbets",
        "title": "AMD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/elao84/amd/",
        "created": 1578427379.0
    },
    {
        "author": "livestrong2209",
        "created_utc": 1580305924,
        "id": "evn4vk",
        "num_comments": 90,
        "num_crossposts": 0,
        "selftext": "I know we all joke around telling everyone there on the spectrum. However, I want to be serious for a second. I'm seeing a lot of investors jumping out of stocks with a 5 year 300% run up on 75% year over year returns, low PE, and solid profits report. Then buying into stocks that have a lot of hype around them. Please be careful about what you're investing in right now, one big reversal will cush the trendies. Buying into bubbles is an easy way to hand all your money over to institutional investors. I just want to say make sure you're researching your stock picks and have at least some understanding of the market your buying into.",
        "subreddit": "wallstreetbets",
        "title": "Jokes Aside - Everyone Please Be Careful",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/evn4vk/jokes_aside_everyone_please_be_careful/",
        "created": 1580334724.0
    },
    {
        "author": "DemonWrangler",
        "created_utc": 1580133326,
        "id": "euo70p",
        "num_comments": 89,
        "num_crossposts": 0,
        "selftext": "The spread of the Wuhan virus is already significantly damaging my portfolio. What will be your move to keep profit? Is now the right time to cash out, or should I buy more considering price drops?",
        "subreddit": "stocks",
        "title": "Coronavorus impact",
        "url": "https://www.reddit.com/r/stocks/comments/euo70p/coronavorus_impact/",
        "created": 1580162126.0
    },
    {
        "author": "Jowemaha",
        "created_utc": 1580258831,
        "id": "eveycu",
        "num_comments": 89,
        "num_crossposts": 0,
        "selftext": "Thesis: Predicting the future is hard. But predicting the psychology of the mob, is sometimes much easier. The introduction of coronavirus into the most bullish stock market and economy of all time presents an interesting opportunity where I feel that we can predict a market downturn as well as the timing of said downturn, with just a little old fashioned psychology, and publicly available facts.\n\n\n\n#Predicting the future is hard\n\nI do not know how many people will die from Coronavirus. I do not know the eventual death rate. I do not know the probability of a full scale pandemic. Neither does anybody else, really. So this point does not stand against me. \n\n#Predicting the mob is easy.\n\nPeople read the news, still. This news seeps into their mind and subtly changes the way their fingers interact with their big swinging hedge fund dicks, and Robinhood portfolios. Hedge fund managers definitely still read the news, even if you autists don't. What's my point? The news media is wildly misrepresenting the current situation with the Coronavirus. Dipshit journalists will cite things like \"the flu infects more people than corona\" or \"death rate of only 3%\" as if these are not wildly naive statistical calculations. What's my point? When corona has infected more people than SARS(should be the case in just 2-3 days), you will see very panicky headlines stating that fact. When the US shuts all travel to China, journalists will likewise create a broad sense of panic. People will take to social media and become aware of the scale. This will create an atmosphere of panic. When the virus starts to slow down, and things are actually getting better, in a twist of irony, the sample mortality rate will creep up. This is a basic statistical fact -- as the growth remains high, the mortality rate will be understated as the population is predominated by relatively more healthy recently infected persons, and as the growth rate slows, the mortality rate will approach reality. \n\nAs these facts become more widely known, optimism will turn to panic. Future surprises with Coronavirus to be negative! That is the nature of this kind of thing. Dr. Taleb has done some great work on this subject which I recommend.\n\n#Coronavirus will have some impact on S&amp;P 500. \n\nThe fed is pumping money to all time highs. We are in the most bullish stock market of all time. All we need is a little fear, and the change in animal spirits will be self-reinforcing. The economy is slowing despite the roaring stock market. In addition we have the real economic impact of shutting down large parts of China, cancelling travel between countries, etc. Even a small change to absolute GDP can mean a  relatively significant change to a quarterly growth rate figure, which is what moves the markets.\n\n#Will Coronavirus spread to Europe and the USA in a significant way?\n\nI hope not. I don't think my thesis depends on it. I'm not here to fearmonger. However, I absolutely recommend taking minor medical precautions with some awareness that this is a possibility. For instance, if you are a gross person who does not wash their hands, maybe now is the time to learn. (don't sell your 401ks people!!)\n\n#What is the timing of these puts?\n\nSeeing as how the virus has to slow down in the next 40 days or infection rates will be higher than the entire world population, you are safe with puts that far out. I am going a little earlier, because I feel that surpassing SARS will be a critical psychological point. What strike? Fuck if I know. Go with something that's not too hot, not too cold, just right. The baby bear amount. (whose name has been unrightfully stolen by that human bitch Goldilocks who steals from innocent bears!!)\n\n#Should I listen to you?\n\nAbsolutely not. I am a dipshit with an internet connection, not Mr. Dow Jones himself.",
        "subreddit": "wallstreetbets",
        "title": "Whipped up some Gay Bear panic DD for you all",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eveycu/whipped_up_some_gay_bear_panic_dd_for_you_all/",
        "created": 1580287631.0
    },
    {
        "author": "xJetSetLifex",
        "created_utc": 1579697764,
        "id": "esbizc",
        "num_comments": 88,
        "num_crossposts": 0,
        "selftext": "I am trying to get approved to sell options and or trade futures depending on market conditions. I have tried a couple times now and they keep saying:\n\n“At this time, we're not able to approve your application for an options upgrade. Your options level remains Standard Cash.” \n\nDoes anyone know what is required to get tier 3 so I can trade what I planned on? I am already approved for margin and advanced features, I just need to be approved for this last tier so I can trade futures/forex/and sell naked options. I have changed all of my investor profile settings and the only thing left I can think of is income and net liquidity. Do they check this or do people tend to embellish to get approved?\n\nAny help will be greatly appreciated!",
        "subreddit": "options",
        "title": "What is Required for Tier 3? TD Ameritrade",
        "url": "https://www.reddit.com/r/options/comments/esbizc/what_is_required_for_tier_3_td_ameritrade/",
        "created": 1579726564.0
    },
    {
        "author": "NineteenEighty9",
        "created_utc": 1580304281,
        "id": "evmtxl",
        "num_comments": 88,
        "num_crossposts": 0,
        "selftext": "The author Bill Dudley is a senior research scholar at Princeton University’s Center for Economic Policy Studies. He served as president of the Federal Reserve Bank of New York from 2009 to 2018, and as vice chairman of the Federal Open Market Committee. He was previously chief U.S. economist at Goldman Sachs.\n\nhttps://www.bloomberg.com/opinion/articles/2020-01-29/fed-s-repo-response-isn-t-fueling-the-stock-market\n\nDuring the past few months, the U.S. stock market has surged as the the Federal Reserve bought hundreds of billions dollars of Treasury bills to add reserves to the banking system and calm the repo market. Are the two connected? Or is the stock market going up for other reasons? The answer is important because the Fed’s large T-bill purchases will end  soon. If the central bank’s balance-sheet expansion is truly lifting stocks, then the market is vulnerable when these purchases cease. \n\nI am skeptical that the Fed’s balance-sheet expansion is having a major effect on U.S. stock prices. First, of course, correlation isn't the same as causation. Just because two things are moving together doesn’t mean that one causes the other. Second, and more importantly, the notion that the Fed’s actions are fueling a stock market bubble isn’t supported by how the Fed’s T-bill purchases are affecting short-term interest rates or how the Fed’s actions are increasing liquidity in the financial system. Third, there is a more obvious explanation behind the stock market’s rise: the prospect of a sustained economic expansion and a Fed that is likely to stay on the sidelines and not raise its federal funds rate target in 2020. \n\n\nTurning first to the impact of the Fed’s purchases on short-term interest rates -- it has been trivial. At the beginning of September, before the upward pressure on repo rates and the Fed’s decision to buy $60 billion of T-bills per month, the spread between the effective fed funds rate and the rate that the Fed pays on reserve balances was about three basis points, or three-hundredths of a percentage point. Today, that spread has fallen to roughly zero. When the supply of bank reserves increases substantially, this puts modest downward pressure on the fed funds rate because more of the trading activity occurs between banks and the government-sponsored enterprises that cannot earn interest on their cash balances at the Fed, rather than trading among banks. \n\nSimilarly, the Fed’s T-bill purchases have had only a small impact on the level of T-bill rates relative to the fed funds rate and the interest rate that the Fed pays on reserves. This is a bit harder to sort out because the longer maturity of T-bills means that expectations of Fed rate cuts affect T-bill rates but not overnight rates. But even here it is hard to discern much impact from the Fed’s asset purchases. At the beginning of November, after the Fed’s last rate cut, the spread between the four-week T-bill and the effective fed funds rate was three basis points. That spread now is close to zero.\n\nSo it isn’t rates. But couldn’t it be that the rise in bank reserves is increasing liquidity, fueling the equity market? The problem with this argument is that when the Fed buys T-bills and increases the amount of reserves in the banking system, that liquidity can’t go elsewhere. It can move from bank to bank as households and businesses shift where they hold their bank balances. The only exception is if bank customers decide to increase their holdings of currency. But if they do that, that reduces the amount of excess reserves in the banking system. \n\nThe Fed’s T-bill purchases substitute a bank reserve (essentially equivalent to a one-day T-bill) for a slightly longer risk-free asset (a T-bill) that the Fed now holds in its portfolio. But that’s it. There are no funds created to purchase equities. \n\nIn contrast, the quantitative easing by the Fed from 2009 to 2013 removed long-duration, fixed-income assets from the market. This pushed down long-term bond yields significantly and made equities relatively more attractive.    \n\nThere are much better explanations for the recent rise in the U.S. stock market than the Fed’s T-bill purchases. I would put three developments front and center: \n\nThe Fed cut its fed funds rate target by 75 basis points in 2019 to a range of 1.5% to 1.75%. Monetary policy is more accommodative now than a year ago. Longer-dated yields are also lower as a consequence. \nThe Fed has signaled that it is unlikely to raise rates until inflation climbs meaningfully above the central bank's 2% inflation target. As a result, both the Fed and market participants believe that monetary policy will remain on hold in 2020. \nThe risk of a U.S. economic slowdown seems to have subsided. Most notable is the abatement of trade tensions with China and the expectation that in an election year, they will remain subdued this year. \n\nThe Fed’s expansion of its balance sheet and the increase in bank reserves have stabilized U.S. money markets. As a result, the Fed is likely to gradually taper its repo-market interventions and significantly slow its T-bill purchases after the April tax season. The end of this aggressive provision of bank reserves, however, is unlikely to create major problems for the U.S. equity market. Instead, what will matter is the economic outlook, the risk of a U.S. economic downturn, whether inflation rises and whether the Fed will stay accommodative.",
        "subreddit": "investing",
        "title": "Fed’s Repo Response Isn’t Fueling the Stock Market: Equities are being driven by low rates and a healthy economy, not central bank T-bill purchases.",
        "url": "https://www.reddit.com/r/investing/comments/evmtxl/feds_repo_response_isnt_fueling_the_stock_market/",
        "created": 1580333081.0
    },
    {
        "author": "PocketRocketMarket",
        "created_utc": 1579138172,
        "id": "epc10y",
        "num_comments": 87,
        "num_crossposts": 0,
        "selftext": "[https://www.amazon.com/Federal-Reserve-Not-No/dp/B07QNZ3X3B](https://www.amazon.com/Federal-Reserve-Not-No/dp/B07QNZ3X3B)\n\nHow many of you knew this? This is probably the wrong place to post this but I know a lot of you actually have a good idea of whats going on.  If the fed is seriously a for profit organization of course they want to boost the economy even if it's unhealthy.\n\nI am especially concerned because I have already heard people talking about the next recession as a \"Fed Bubble\" . But this whole time I thought it was a joke because why would the fed want to make a bubble?\n\nAt the beginning of this movie it talks about how the fed is actually owned by a bunch of other smaller banks.. UMMMM What? How is this not common knowledge.  Obviously the Lehman Brothers did't own them but Im starting to see why \"Banks are too big to fail\" .   How can a private bank, designed to make profit, be so interconnected to government.  The video mentions that they have literally never been audited.  Makes since when they can just print money but how is this legit?\n\nI am really hoping for some knowledgeable insight here.  Youtube has sent me down a rabbit hole of conspiracy theory and now I'm just scared.",
        "subreddit": "wallstreetbets",
        "title": "The federal reserve is a for profit, private bank?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/epc10y/the_federal_reserve_is_a_for_profit_private_bank/",
        "created": 1579166972.0
    },
    {
        "author": "bcorbust",
        "created_utc": 1579271411,
        "id": "eq12hn",
        "num_comments": 87,
        "num_crossposts": 0,
        "selftext": "Hey there.\n\nSince everyone has been complaining about Ontario not having stores open the last few months, British Columbia has added close to 100 stores.\n\nJust thought everyone should know how robust the retail side of things have grown in the past little while.\n\nStore counts have increased *significantly* in the past 12 months so Cannabis 2.0 is a very different beast than 1.0.\n\n&amp;#x200B;\n\n*Western Canada - 605 retail cannabis stores open*\n\n**British Columbia:**\n\n138 stores open\n\n60 stores approved to open soon\n\n**Alberta:** \n\n397 stores open\n\n8 stores soon to be approved\n\n**Saskatchewan:** \n\n40 stores licensed\n\n**Manitoba:**\n\n30 stores licensed\n\n&amp;#x200B;\n\n*Central Canada - 61 stores open*\n\n**Ontario:**\n\n28 stores open\n\n41 store applications in progress\n\n**Quebec:**\n\n33 stores open\n\n&amp;#x200B;\n\n*Atlantic Canada - 61 stores open*\n\n**New Brunswick:**\n\n20 stores open\n\n**Nova Scotia:**\n\n12 stores open\n\n**P.E.I.:**\n\n4 stores open\n\n**Newfoundland &amp; Labrador:**\n\n25 stores open",
        "subreddit": "weedstocks",
        "title": "Canadian Retail Cannabis Stores - 727 licensed stores now open!",
        "url": "https://www.reddit.com/r/weedstocks/comments/eq12hn/canadian_retail_cannabis_stores_727_licensed/",
        "created": 1579300211.0
    },
    {
        "author": "joeyvee93",
        "created_utc": 1579531299,
        "id": "ere175",
        "num_comments": 87,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "weedstocks",
        "title": "Marijuana legalization may hit 40 states. Now what?",
        "url": "https://www.politico.com/news/2020/01/20/marijuana-legalization-federal-laws-100688",
        "created": 1579560099.0
    },
    {
        "author": "pacosteles",
        "created_utc": 1578325244,
        "id": "ekvqb6",
        "num_comments": 87,
        "num_crossposts": 0,
        "selftext": "This time last year, Slack Technologies, the popular workplace chat provider, was one of the most eagerly anticipated public tech debuts of 2019. That seems like a long time ago. Since Slack went public in June, its stock has dropped about 40%.\n\n\nThe reason for the slump: Revenue growth at Slack is slowing and competition is intensifying, especially from Microsoft. The tech giant is relying on a familiar tactic—bundling a Slack killer with a widely used existing product, its Office 365 suite of apps. Given that competitive pressure, I predict 2020 will be the year that—after years of acquisition speculation—a larger tech company will finally buy Slack.\n\n\nPotential suitors could include Amazon—which has reportedly eyed Slack in the past—and Google. Both companies are top providers of cloud computing services and could plug Slack into their cloud units to increase the revenue they generate from online applications. \n\n\nAlready a big Amazon cloud customer, Slack has committed to spending a minimum of $250 million with the Amazon Web Services division between 2018 and 2023, according to regulatory filings. Becoming part of Amazon could help Slack—which is currently unprofitable—trim some costs.    \n\n\nCisco Systems and Salesforce, both of which could use a spark to fire up their collaboration software businesses, might also make sense as acquirers. Both companies have relationships with corporate chief information officers that could open the door to customers in the Fortune 500. \n\n\nA Slack purchase would be a sizable deal. Slack has a market capitalization of just over $12 billion, although its management would likely push for a higher price. One benchmark they might point to: A few weeks before it went public, Slack was valued in private market trades at about $19 billion. At that price, Slack would be the largest acquisition ever for the likes of Amazon, Google, Cisco, and Salesforce.  \n\n\nOne company that likely won’t buy Slack is the company that would arguably be most responsible for its sale: Microsoft. Owning Slack, along with its in-house Slack competitor, Teams, would give Microsoft a dominant position in workplace collaboration software. Microsoft reportedly considered offering an $8 billion bid for Slack in 2016 before deciding to funnel more investment into building out Teams. \n\n\nBut I’m skeptical that Microsoft could pull off such a deal. Gaining regulatory approval would be an ordeal, if not impossible, because Microsoft already offers a directly competitive product. Microsoft went through the antitrust wringer two decades ago and is happy to avoid joining other big tech companies in the regulatory spotlight now. \n\n\nSpokespeople from AWS and Salesforce declined to comment. A Microsoft spokesperson didn’t have a comment. Spokespeople from Cisco and Google didn’t respond to requests for comment. \n\n\nIf Slack CEO and co-founder Stewart Butterfield doesn’t want to sell, he will have to find a way to win back investor confidence. Clearly what is worrying Wall Street is Slack’s slowing revenue growth and increasing losses. \n\n\nThe company’s annual sales grew 110% in fiscal 2018, which ended last Jan. 31, from the prior year. In fiscal 2019, that figure fell to 82%. In its most recent earnings report, Slack forecast that revenue growth for fiscal 2020 will fall even further to around 55%. Meanwhile, its net loss rose to about $88 million in the third quarter, from nearly $48 million a year earlier.\n\n\nSlack has spread like wildfire as a business tool largely through a free version of its product. To continue to grow, it must find ways to convince these users to become paying ones. During its recent earnings call, for the quarter ended Oct. 31, the company said it had 105,000 paying customers, up 30% from the same period a year earlier. \n\n\nIn an interview, Daniel Newman, founder and principal analyst at Futurum Research, said Slack’s early growth was partly due to developers’ frustration with the limitations of older products like Microsoft’s Skype and Cisco’s Webex. Now, with Microsoft pouring money into Teams and making improvements to the product to entice large companies, Slack has to work much harder to attract customers, he said. And a host of younger companies, such as Zoom and Asana, and open source startups, including Mattermost and Rocket.Chat, also offer workplace collaboration tools. \n\n\n“There is a lot of competition in the collaboration space right now,” Newman said. \n\n\nThe growing competition highlights another issue for Slack. Having captured a loyal following of developers and technical users through word of mouth, it is now spending heavily on sales and marketing to show how its software can help companies be more productive. During the third quarter, its sales and marketing expenses jumped 42% to over $96 million. \n\n\nMicrosoft appears to have gotten into Butterfield’s head. This first became apparent in 2016 when Slack took out a full-page ad in The New York Times to “welcome” Microsoft to the market around the time it introduced Teams. More recently, Butterfield has sounded a defensive note on earnings calls, pointing out that Slack has to earn every customer and can’t rely on bundling its product with other business applications, as Microsoft does. \n\n\nHe often pushes back on Microsoft’s framing of its daily active user numbers for Teams, claiming that the company muddies the waters by counting people who make voice calls using Skype. Slack’s usage figures more accurately reflect the deep level of engagement its users have with the service, according to Butterfield. “The confusion is deliberately created,” Butterfield said on Slack’s recent fiscal third quarter earnings call with investors. \n\n\nWhatever the reason, Butterfield faces a choice: Keep fighting or surrender by selling.",
        "subreddit": "wallstreetbets",
        "title": "Why Slack Will be Acquired",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ekvqb6/why_slack_will_be_acquired/",
        "created": 1578354044.0
    },
    {
        "author": "Canadiannewcomer",
        "created_utc": 1578130213,
        "id": "ejulz3",
        "num_comments": 84,
        "num_crossposts": 0,
        "selftext": "Curious as to know what the fellow Canadian investors are looking to buy for the limit this year 6000 CAD?  Please explain your reasons as well. I am buying on a hypothesis, that 'I get to' buy six stocks/etfs for 1k each (commission free).\n\nI'll be buying \n1) RBC- Largest of the big banks, US exposure, diversified all across the financial services and also I have high hopes of RBC Ventures investments  in the long run\n2) CNR- Coast to Coast, CNR is the best,\n3) PDC (Invesco Canadian Dividend ETF)- More diversified than the rest of Canadian Dividend ETFs, less concentration risk.\n4) Fairfax Financial- Canadian value 'ETF';\n5) Berkshire Class B- US Value 'ETF' and 122B$ in cash waiting to be deployed;\n6) QQQ- Cause I am a chicken to invest in Tesla.\n\nNow let the games begin.\n\nEdit: As I said, this is just a hypothesis. The idea is to share stock picks and reasons for choosing the stock.",
        "subreddit": "CanadianInvestor",
        "title": "TFSA 2020- Ideas",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/ejulz3/tfsa_2020_ideas/",
        "created": 1578159013.0
    },
    {
        "author": "ProductCoordinator",
        "created_utc": 1580485455,
        "id": "ewq93b",
        "num_comments": 82,
        "num_crossposts": 0,
        "selftext": "Within the next month we're going to get the final decision from a judge about whether or not the merge will happen. There's a ton of doubt about this merger, but I for one can't fathom it not going through. It would make no logical sense for a judge to deny a merger under the grounds that it would create less competition (which is what the states are suing over) for the following reasons:\n\n&amp;#x200B;\n\n* If the deal falls through, Sprint wouldn't survive independently anyway\n   * It could potentially be bought out by a number of other companies in this case\n* In exchange for the deal, Sprint has a deal to sell off Boost mobile to Dish networks which would maintain a cheaper cellular service alternative\n* T-Mobile has made an agreement not to raise any prices on any of their plans for a number of years after the deal\n* This plan would allow T-Mobile to make custom deals with varying degrees of connection once they combine Sprint's bandwidth with their own\n\n&amp;#x200B;\n\nIf and when this merger is accepted in the following weeks, the price is bound to rise past $7.83 which is the value that the merger offer places Sprint stock at. The last time it was believed the merger was going through, $S jumped to over $8.50. It currently sits at $4.37 as I type this. \n\nThe new T-Mobile will immediately become a powerhouse player and start eating away at Verizon and AT&amp;T's market share. It will position them to have the best 5G in existence due to Sprint's investments in the technology over the years. \n\nAnother motive for this merger is to beat Huawei at 5G coverage in the states. It would be a serious injustice for us to stop this kind of technological race from completing over a bunch of district attorneys trying to act virtuous for political points. \n\nIt's unlikely that a failure to merge would really destroy Sprint as a whole. They've just set up a round of a billion dollars in funding to helpcover their debts. I can't imagine $S falling below $3.40 if this fails.\n\nLet's say there's a 40% chance of this merger going through. In poker, if you have a 40% chance of winning a hand with a promise of 200% return on your investment, and the risk is only a 25% loss if you're wrong, you gamble. No brainer.\n\nI'm long on $S and please feel free to set your !RemindMe for a month to check back on this one.",
        "subreddit": "stocks",
        "title": "$TMUS is 50% off right now if you buy it as $S!",
        "url": "https://www.reddit.com/r/stocks/comments/ewq93b/tmus_is_50_off_right_now_if_you_buy_it_as_s/",
        "created": 1580514255.0
    },
    {
        "author": "Kazul28",
        "created_utc": 1580187061,
        "id": "ev0s7i",
        "num_comments": 82,
        "num_crossposts": 0,
        "selftext": "Cheating ex-wife had to pay me in the divorce. Took part of the money and bought a car, YOLO'd the rest into PHM calls ahead of earnings. Is this what it feels like to win at life?\n\nFirst time buying options....beginners luck or galaxy brain?",
        "subreddit": "wallstreetbets",
        "title": "Am I autistic now?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ev0s7i/am_i_autistic_now/",
        "created": 1580215861.0
    }
]