[
    {
        "author": "AndrewWKPartyParty2",
        "created_utc": 1598542800,
        "id": "ihnavy",
        "num_comments": 59,
        "num_crossposts": 0,
        "selftext": "Seriously F@$% this market.  Their revenue is down like 99%.  Oh 10 people nationally have bought movie tickets?  Some manatee gray wearing mother-f@$%er bought popcorn at the window?  This market is insane.  Nothing makes sense.  I hate you all!  Have a nice day and stay safe everybody",
        "subreddit": "wallstreetbets",
        "title": "AMC is now worth more than it was in early January",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ihnavy/amc_is_now_worth_more_than_it_was_in_early_january/",
        "created": 1598571600.0
    },
    {
        "author": "Thermohelp",
        "created_utc": 1596571721,
        "id": "i3qqif",
        "num_comments": 57,
        "num_crossposts": 0,
        "selftext": "Look retards. I've been burned by so many DD's in the past, trying to 4x+ the measly 1k in disposable YOLO funds chasing DraftKings, NIO, AMC, tons of bullshit that I would research for 30 minutes and then pray, hit the yahoo message boards to see what the grandparents were saying, and watch my position piss itself down to $0. Typical high risk behavior that I've spent my entire life engaging in. I had no idea what I was doing and suffered from confirmation bias in my research. Moving on. \n\nTLRY has earnings upcoming on the 10th. I work as an engineer in the commercial cannabis space, and retail and commercial grow ops are booming. Consumers are buying more cannabis, more frequently, and care more about quality with a generalized concern for lung health. Federal and international governments are looking for ways to generate revenue and Tilray is well positioned to be a huge international distributor. Transportation costs are down, storage costs are down, testing costs are down, material costs are down, industry consolidation is happening rapidly and large license and building assets are being acquired rapidly by the leaders (which was their plan all along).\n\nEarnings on the 10th are expected to show a $0.27 loss per share. I think they'll beat these estimates by 30%\n\nShort position as of July is 22 million shares or \\~%20 off the float, expecting a huge short squeeze before earnings\n\nHigher realized margins, APHA confirmed record sales in the last 10 days and I expect TLRY to follow suit. Higher margins + competitors in space beating forecasted earnings \n\nBrendan Kennedy is a Silicon Valley billionaire who I'd let be my step dad.\n\nPosition 8/21 $10c purchase at open tomorrow. Look to ride up rest of week for that 3-4x bagger as the price moves to $11-12 before earnings with potential to jump to $20 if EPS is beat by more than 20%.",
        "subreddit": "wallstreetbets",
        "title": "TLRY Earnings, your next best YOLO",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i3qqif/tlry_earnings_your_next_best_yolo/",
        "created": 1596600521.0
    },
    {
        "author": "ListerineInMyPeehole",
        "created_utc": 1597968667,
        "id": "idm5gr",
        "num_comments": 49,
        "num_crossposts": 0,
        "selftext": "Listen here you degenerates. Cinemark ($CNK) popped 11% today on news of movie theaters reopening around the country. Apparently AMC is reopening this weekend and [tickets are sold out EVERYWHERE](https://www.foxbusiness.com/lifestyle/amc-reopen-movie-theaters-sold-out-adam-aron). Bmark companies upgraded from Hold to Buy today with a PT of $18 and says \"We are optimistic that movie-goers will return to the theaters over the next several months and that over merdium term CNK can return to historical performance levels.\" Consensus price target is at $16.25, so upside from here, especially since it hit $20 during the middle of the fucking pandemic in June. Before today, valuation butchered the stock (down 72% from 52-week high)... so now is THE entry point.\n\nLast weekend CNK represented 10% of US theater open and generated 40% of the box office. CNK survey of its consumers reports 50% would feel safe returning to the theater within 1 month and 75% within 3 months.\n\nEven if you assume 60-70% capacity upon wider theater openings, CNK should be at least \\~$20/share, given CNK was $40/share a peak price. No one talked about it here today so thought I'd drop some knowledge. OH and also fuck $AMC - consensus price target on that shits like $3 and it was already at $5 before the run-up today.\n\n$12.5C 9/18",
        "subreddit": "wallstreetbets",
        "title": "$CNK short-term can't go tits up ($AMC already overvalued)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/idm5gr/cnk_shortterm_cant_go_tits_up_amc_already/",
        "created": 1597997467.0
    },
    {
        "author": "nobody876543",
        "created_utc": 1597691098,
        "id": "ibkju4",
        "num_comments": 45,
        "num_crossposts": 0,
        "selftext": "I really liked Plug a few months ago but it’s now over $10. I also like AMC to rebound, (I know I know... I’ve got a local KC bias). \n\nAnything you guys like? I’m selling covered calls in my Roth and trying to use that $ to buy up cheap stock in it that I think have growth potential over the next 10+ years.\n\nThanks.",
        "subreddit": "stocks",
        "title": "What are cheap stocks (&lt;$10/share but not penny stocks) that you guys like for growth potential?",
        "url": "https://www.reddit.com/r/stocks/comments/ibkju4/what_are_cheap_stocks_10share_but_not_penny/",
        "created": 1597719898.0
    },
    {
        "author": "perfectingperfection",
        "created_utc": 1597412878,
        "id": "i9m9rv",
        "num_comments": 39,
        "num_crossposts": 0,
        "selftext": "AMC is beginning it's reopen on Aug 20th. Since the news was announced 2 days ago, the stock has risen 20%. AMC is doing a \"special promotion / grand reopening\" only charging $0.15 on the first day of re opening.  \n\n[https://www.cnn.com/2020/08/13/media/amc-reopening-ticket-prices/index.html](https://www.cnn.com/2020/08/13/media/amc-reopening-ticket-prices/index.html) \n\nAMC taking the first shot in the dark will pave the way for CNK. They are essentially advertising for CNK. People will quickly get familiar with the idea of going to the movies. Sure, some people will remain in fear about the idea, but AMC is starting off with a 30% capacity. They are also requiring customers to wear mask during the movie unless you are eating/drinking. Here's the thing. You are not suppose to be talking during the movies anyways. Food is ordered before walking into the theater. Other chains like alamo drafthouse have a system where you write your order on a paper slip, and your waiter swoops by to snag it. There's no speaking involved. \n\nWhat I am getting at is... being that there's no talking in theaters, transmission of C-19 is extremely low risk as long as they sanitize properly in between showtimes. Currently, AMC is requiring you to wear a mask.  This could sound annoying and uncomfortable to some people and discourage them, but this is phase 1. I speculate this requirement wont last long for reasons mentioned above. \n\nFinally, Cinemark is down 62%, it's has plenty of room to recover. Now that the first steps of reopening in the industry are finally being made, it makes for a bet with high upside / low downside. Since AMC's announcement, CNK has only gotten a little boost from AMC's news, so we're early to the party. Another plus, calls are cheap. Oh and this is the theater we all know and love, not a damn mattress company. \n\nPosition: LEAPS\n\nEDIT: It took me way too long to write this, the stock i taking off this morning.",
        "subreddit": "wallstreetbets",
        "title": "Cinemark (CNK) - Reasons why now is a good time to add it to your portfolio - DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i9m9rv/cinemark_cnk_reasons_why_now_is_a_good_time_to/",
        "created": 1597441678.0
    },
    {
        "author": "panozojx",
        "created_utc": 1596640873,
        "id": "i478tr",
        "num_comments": 35,
        "num_crossposts": 0,
        "selftext": "I’m normally bullish because stonks only go up, but there’s no way there’s any good news coming from the earnings call for AMC entertainment. With their stores closures to due coronavirus and social distancing, they’ve forced themselves into a crap deal with universal and lets be honest that won’t make them much profit. They’ll try to make their outlook look better, assuming they provide guidance, but I think this stonk is going to get crushed. \n\nI’m having trouble finding any goods news over AMC, maybe another fellow bull has some better insight? \n\nI would short this stock but the stock is currently hard to borrow, meaning a lot of people having shorted this stock. Options are pretty cheap though because AMC is hovering around $4. \n\n 8/7 AMC 4p",
        "subreddit": "wallstreetbets",
        "title": "AMC is screwed?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i478tr/amc_is_screwed/",
        "created": 1596669673.0
    },
    {
        "author": "crustycontractor",
        "created_utc": 1597533554,
        "id": "iahood",
        "num_comments": 35,
        "num_crossposts": 0,
        "selftext": "Sup men. Most industries have more than recovered from their march lows and most of us retards have missed out on those gains. That said, there's a few companies out there that are still near march lows that have potential for a rebound and I think CNK is one of them. \n\nCinemark Theatres is the third largest operator in North America behind AMC and Regal Entertainment Group. Unlike AMC, Cinemark is not overburdened with debt and has stated that even in the event of indefinite theatre closures, they have enough cash runway to last until late 2021.  \n\nAs of a couple days ago, AMC announced they were reopening theatres across the country and Cinemark followed suit a day later with a phased re-opening announcement. As of now, theatres will only be showing \"classics\" but they are slated to begin showing new movies in the coming weeks. Obviously this is very fluid situation and they might get shut down on any news. \n\nInsider ownership, unlike AMC, is also a plus. You can check the details yourself, but basically during this whole pandemic, only 5k shares have been sold and millions worth have been bought up. The CEO, Mark Zoradi, bought 10k shares at 25ish right along the time all of us MSFT 2/28 200c were getting fucked. He then bought more when the price was half of what he paid weeks earlier. \n\nAnyways, yes, there's a bearish argument to the future of theatres. I also believe that direct to consumer media is going to royally fuck them but not to the extent where the average American consumer would be willing to let them go. Add on the covid uncertainty and theatres are in a shit situation short and long term. No doubt about that. \n\nCNK is currently trading just below 13. I'm personally long on this with shares because I'm unsure the furthest leaps being sold (MAR 2021) give CNK enough time for a recovery, especially if shit gets worse this winter. But I do believe they'll eventually make a comeback. Just my two cents.",
        "subreddit": "wallstreetbets",
        "title": "Cinemark Theatres",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iahood/cinemark_theatres/",
        "created": 1597562354.0
    },
    {
        "author": "Torontolego",
        "created_utc": 1597302094,
        "id": "i8v7u6",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "\nHe (Head Mouse) also said he’d make “Mulan,” the live-action remake of the 1998 animated hit, available to purchase for US$30 on the Disney+ service at the same time it’s released in theaters.\n\n... Now I understand the 30 dollar price tag.  None of the news explained the theater bit.\n\nFor 30 bucks, watch it legally, opening night, in your home theater, instead of 70 bucks at a covid theater.\n\nBuh bye every blockbuster for 2 years.",
        "subreddit": "wallstreetbets",
        "title": "Smart Mouse. AMC doesn't see it coming",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i8v7u6/smart_mouse_amc_doesnt_see_it_coming/",
        "created": 1597330894.0
    },
    {
        "author": "MrRag3r14",
        "created_utc": 1597593851,
        "id": "iauvpe",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "I’ve been doing pretty good since June.  I’ve been playing the trends and covid game here.  My next play or predictions is AMC obviously like asking for opinions sometimes.  I really don’t see this gigantic theater going out of business.  Currently trading at just under 6.  Previous high prior to covid 12-13.  Theaters opening August 20.  Anyone think it’s a safe pick for at least a swing trade or long term.  Thinking of putting a small 1k on it.  I have other safe stocks but I like to jump on a chance before it spikes up.",
        "subreddit": "stocks",
        "title": "AMC",
        "url": "https://www.reddit.com/r/stocks/comments/iauvpe/amc/",
        "created": 1597622651.0
    },
    {
        "author": "street-guru",
        "created_utc": 1596814782,
        "id": "i5g28p",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "Might take a few quarters to recover. Not sure I'd try to catch this falling knife today...\n\n**Oppenheimer:** \"Alteryx delivered 2Q results ahead of lowered expectations, with solid new customer additions and continued traction with G2K accounts (137% retention rate). However, persistent COVID-19/macro headwinds weighed on customer behavior negatively impacting expansion/renewal activity, deal sizes, and sales cycles. With no visibility into the timing of a recovery, management is taking action to improve execution (sales training, resource reallocation), support customer needs (adoption licenses), and maintain profitability (S&amp;M optimization, profit/growth balance). While the shares will come under pressure near-term, our long-term view is unchanged, and we remain positive seeing Alteryx as strongly positioned to capitalize on multiple secular trends (digitization, automation, AI/ML...). Adjusting estimates based on results/guidance and lowering PT to $180 (from $190). Maintain Outperform.\"\n\n**Needham:** \"AYX reported mixed 2Q20 results as revenue and EPS were ahead of consensus, but guidance introduced for 3Q and FY20 revenue was well behind. Although FY20 revenue guidance implies a material growth slowdown at the mid-point, we believe the biggest component that is creating a headwind may be a tougher compare created by increased duration in 2H19. Importantly, management introduced ARR guidance of \\~30% growth, which we believe may serve as a better metric for growth since it normalizes for differences in revenue recognition between licenses and terms. Although mgmt acknowledged that AYX is facing longer sales cycles and is now selling shorter duration licenses (which may be a small component of guidance), we continue to believe AYX's organic growth remains well ahead of its implied guidance. Reiterate BUY rating and adjust our PT to $172.\"\n\n**Goldman:** \"The combination of ongoing macro pressures from COVID and a financial model with mostly upfront revenue recognition caused a steep deceleration in F2Q revenue to 17%, down from 43% in F1Q, with guidance for a further deceleration to 9% (at midpoint) in F3Q and implied F4Q growth of -8%. Customer buying patterns were irregular in the quarter and didn’t follow an upward linear trend; as a result, we think it will take many quarters for new bookings growth to return to pre-COVID levels. However, we were encouraged to see that ARR still grew 40% in F2Q; management expects ARR to still grow &gt;30% at the end of the year. With strong interest in the quarter in adoption licenses (short-term trials), which were up 60% y/y, we are optimistic that these customers could start to scale up business next year and lead to a recovery in ARR (and revenue growth). Due to the disappointing outlook, our FY20/21 revenue estimates come down by 12%/8%, and our PT goes to $195 from $216. We maintain a Buy rating on AYX shares.\"\n\n**DA Davidson:** \"AYX reported a rough 2Q, with 3Q and 2020 guidance coming below consensus (and implied 4Q guidance calling for negative Y/Y growth), leading shares down 19% AMC. This was the result of COVID-19 headwinds, leading to longer sales cycles, smaller deal sizes, and higher spending scrutiny. In addition, AYX saw issues with sales onboarding and enablement. In response to COVID, AYX increased its use of adoption licenses and views COVID as a longer-term tailwind.\"",
        "subreddit": "investing",
        "title": "$AYX - down 28% today on weak outlook, but analysts still bullish long term",
        "url": "https://www.reddit.com/r/investing/comments/i5g28p/ayx_down_28_today_on_weak_outlook_but_analysts/",
        "created": 1596843582.0
    },
    {
        "author": "_WinnerTakesAll_",
        "created_utc": 1596637385,
        "id": "i46897",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "Here is my list of companies reporting earnings next week. Please add the ones you are watching. What are your bets and thesis? \n\n&amp;#x200B;\n\nMonday: Aug 10, 2020:\n\nBMO: Canopy Growth, RoyalCaribbean, Marriott, Barrick Gold, GBDC capital, Seaworld\n\nAMC: Tilray; Simon Property; Inovio; SunRun\n\n&amp;#x200B;\n\nTuesday: Aug 11, 2020\n\nBMO: NIO, SYSCO, RADCOM\n\nAMC:Neptune Wellness solute, Red Robin, Shockwave, T2 biosystems, Super league gaming, Motus, K12\n\n&amp;#x200B;\n\nWednesday: Aug 12, 2020\n\nBMO: JMIA\n\nAMC: Cisco; Lyft; SmileDirect; Joyy (yy)\n\n&amp;#x200B;\n\nThursday: Aug 13, 2020\n\nBMO: Netease; Veru; Teekay Tankers; GrowGeneration; IIVI; Tapestry; Youdao\n\nAMC: AudioEye, BlinkCharging, AppliedMaterials, Arcadia Biosci, Farfetch, AudioEye, WidePoint\n\n&amp;#x200B;\n\nFriday: Aug 14, 2020\n\nBMO: DraftKings\n\nAMC: your mom's pregnancy test",
        "subreddit": "wallstreetbets",
        "title": "Earning reports next week",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i46897/earning_reports_next_week/",
        "created": 1596666185.0
    },
    {
        "author": "HeyGreggg",
        "created_utc": 1598649226,
        "id": "iifon8",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "The stock is currently trading at the same price it was in January before the virus. They have been closed for 5 months and opened up 170 locations yesterday offering tickets for 15 cents to try at get people back in the theater. Theaters will be opened up slowly and at a reduced capacity. Analysts all say it's overpriced. However, there are a bunch of retards out there buying stock because they recognize the name and they think recovery is instant. \n\nI say buy puts.. what do you think?",
        "subreddit": "wallstreetbets",
        "title": "$AMC is Shit",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iifon8/amc_is_shit/",
        "created": 1598678026.0
    },
    {
        "author": "nathanwe44",
        "created_utc": 1598272750,
        "id": "ifo5y9",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "good morning you beautiful bastards. planning to sell 2k worth of draft king shares at open and buy a 9/11 500c appl for $1990. what do you think? nice move or hall of fame tardo? hoping Apple back to $150 a week after split which would net about 3k per contract post split\n\nrkt 10/16 27c bj 9/18 45c AMC 3/21 5c x2 (amc purchased when I was very fucked up haha) currently hold 10 boomer shares of appl and 4 of tsla.",
        "subreddit": "wallstreetbets",
        "title": "APPL 9/11 500 call going to print?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ifo5y9/appl_911_500_call_going_to_print/",
        "created": 1598301550.0
    },
    {
        "author": "breezy__7777",
        "created_utc": 1598037911,
        "id": "ie3f1p",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "What stocks are you guys looking into for next week? I was thinking AMC would be a good play for next week since they just opened up some theaters",
        "subreddit": "stocks",
        "title": "Plays for next week?",
        "url": "https://www.reddit.com/r/stocks/comments/ie3f1p/plays_for_next_week/",
        "created": 1598066711.0
    },
    {
        "author": "saysvishal",
        "created_utc": 1597886705,
        "id": "id0x94",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "Movie theaters are openings this week. Is it worth to buy AMC, CNK, MCS, NCMI,IMAX.\n\nI am only following market since march this year, but I feel this is worth to look in to. Thoughts\n\n\nhttps://www.nbcnews.com/news/all/amc-open-100-theaters-next-week-majority-locations-early-september-n1236590\n\n\nhttps://abcnews.go.com/Business/wireStory/qa-cineworld-ceo-opening-regal-theaters-us-72238236",
        "subreddit": "stocks",
        "title": "Movie theaters are opening this week",
        "url": "https://www.reddit.com/r/stocks/comments/id0x94/movie_theaters_are_opening_this_week/",
        "created": 1597915505.0
    },
    {
        "author": "-0-itisaplane",
        "created_utc": 1598728273,
        "id": "iiy9bl",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "I want to make an account separate from my diversified longterm investment account, just something to play around with a little. \n\nI want to go :\n\n25% amc entertainment \n\n25% ciniplex \n\n25% air canada \n\n25% united airlines \n\n... buying at the right time of course , maybe i’ll put 250$ into each of these stock, just a thought i’m playing around with, opinions ?",
        "subreddit": "stocks",
        "title": "Thinking of making another account that I use exclusively for high risk, high potential investing.",
        "url": "https://www.reddit.com/r/stocks/comments/iiy9bl/thinking_of_making_another_account_that_i_use/",
        "created": 1598757073.0
    },
    {
        "author": "Cicero1982",
        "created_utc": 1597907729,
        "id": "id5nlj",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "# Your Pre Market Brief for Thursday August 20th 2020\n\nYou can subscribe to the daily 4:00 AM Pre Market Brief on [The Twitter Link Here](https://www.tradinganalysisresources.com/2020/05/free-references-and-resources.html?m=1) . Alerts in the tweets will direct you to the daily 4:00 AM Pre Market Brief in this sub.\n\n[Morning Research and Trading Prep Tool Kit](https://www.tradinganalysisresources.com/2020/05/free-references-and-resources.html?m=1)\n\n[The Ultimate Quick Resource For the Amateur Trader.](https://www.reddit.com/r/pennystocks/comments/hcja2q/the_ultimate_quick_resource_for_the_amateur_trader/)\n\n*Published* ***3:15*** ***AM*** *EST / Updated as of* ***3:15 AM*** *EST*\n\n\\-----------------------------------------------\n\n***Stock Futures:***\n\n* [Pre-Market Trading](https://money.cnn.com/data/premarket/)\n* [Dow futures](https://www.cnbc.com/2020/08/19/stock-market-futures-open-to-close-news.html) drop after the Fed highlights economic uncertainty\n* [Stock futures](https://finance.yahoo.com/news/stock-market-news-live-august-20-2020-221258239.html) open slightly lower as investors await jobless claims \n* [Asian markets](https://www.marketwatch.com/story/asian-markets-fall-after-fed-minutes-bring-reality-check-2020-08-19) fall after Fed minutes bring reality check\n* [European](https://www.cnbc.com/2020/08/20/europe-markets-fed-flags-uncertainty-of-us-recovery.html) markets fall after Fed flags uncertainty of U.S. recovery\n\n**Tuesday** ***08/19/2020 News and Markets Recap:***\n\n* [Your Pre Market Brief for 08/19/2020](https://www.reddit.com/r/pennystocks/comments/iciv8u/your_premarket_brief_for_08192020/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)\n* [Market Recap](https://finance.yahoo.com/video/market-recap-wednesday-august-19-204524314.html)\n\n***Thursday*** ***August 20th 2020*** [***Economic Calendar***](https://tradingeconomics.com/calendar) (All times are Eastern)\n\n***JOBLESS CLAIMS TODAY!***\n\n* **08:30 AM** [**Jobless Claims 4-Week Average**](https://tradingeconomics.com/united-states/jobless-claims-4-week-average) 15/AUG \n* **08:30 AM** [**Initial Jobless Claims**](https://tradingeconomics.com/united-states/jobless-claims) 15/AUG \n* **08:30 AM** [**Philadelphia Fed Manufacturing Index**](https://tradingeconomics.com/united-states/philadelphia-fed-manufacturing-index) AUG \n* **08:30 AM** [**Continuing Jobless Claims**](https://tradingeconomics.com/united-states/continuing-jobless-claims) 08/AUG \n* **10:00 AM** CB Leading Index MoM JUL \n* **10:30 AM** [**EIA Natural Gas Stocks Change**](https://tradingeconomics.com/united-states/natural-gas-stocks-change) 14/AUG \n* **11:30 AM** [**4-Week Bill Auction**](https://tradingeconomics.com/united-states/4-week-bill-yield) \n* **11:30 AM** 8-Week Bill Auction \n* **01:00 PM** [**Fed Daly Speech**](https://tradingeconomics.com/united-states/interest-rate)  \n* **01:00 PM** 30-Year TIPS Auction \n\n***News Heading into Thursday August 20th 2020***\n\n*NOTE: PLEASE DO NOT YOLO THE VARIOUS TICKERS WITHOUT DOING RESEARCH. THE TIME STAMPS ON THE FOLLOWING ARTICLES MAY BE LATER THAN OTHERS ON THE WEB. THE CREATOR OF THIS THREAD COMPILED THE FOLLOWING IN A QUICK MANNER AND DOES NOT ATTEST TO THE VERACITY OF THE INFORMATION BELOW. YOU ARE RESPONSIBLE FOR VETTING YOUR OWN SOURCES AND DOING YOUR OWN DD.*\n\n*  [7 Stocks](https://www.benzinga.com/news/20/08/17163870/7-stocks-moving-in-wednesdays-after-hours-session) Moving In Wednesday's After-Hours Session  (SNPS, AUTO, PBYI, LB, CLIR)  \n* [XSPA](https://www.globenewswire.com/news-release/2020/08/19/2080947/0/en/XpresSpa-Group-Provides-Business-Update-and-Announces-Second-Quarter-2020-Financial-Results.html) XpresSpa Group Provides Business Update and Announces Second Quarter 2020 Financial Results  \n* [RXT](https://www.globenewswire.com/news-release/2020/08/20/2081041/0/en/Rackspace-Technology-upgrades-Central-and-North-West-London-NHS-Foundation-Trust-s-operations-providing-essential-health-services-remotely.html) Rackspace Technology upgrades Central and North West London NHS Foundation Trust’s operations providing essential health services remotely (Overnight News)\n* [ESGR](https://www.sec.gov/Archives/edgar/data/1363829/000136382920000167/enstarfinancellcjuniorsubn.htm) Enstar Group prices $350M debt offering (Overnight News)\n* FTI ($8.21) TechnipFMC wins Subsea EPCI for the Libra Consortium’s Mero 2 Project, operated by Petrobras in Brazil (Overnight News)\n* [GFI](https://finance.yahoo.com/news/gold-fields-limited-results-six-063200779.html) Gold Fields - Results for the six months ended 30 June 2020 (Overnight News)\n* [BA](https://www.businessinsider.com/boeing-737-max-name-change-rebrand-2020-8) Boeing Gets First Order For The Troubled 737 MAX Aircraft This Year  (Overnight News)\n* [CNTG](https://www.globenewswire.com/news-release/2020/08/20/2081044/0/en/CENTOGENE-and-Evotec-Expand-Collaboration-Into-Gaucher-Disease.html) ($12.28) Centogene and Evotec expand collaboration into Gaucher disease  (Overnight News)\n* [IAA](https://www.businesswire.com/news/home/20200820005280/en/IAA-Enhances-Efficiencies-Transportation-Management-System-Investment) IAA Enhances Efficiencies With Transportation Management System Investment in the United Kingdom (Overnight News)\n* [FTI](https://www.businesswire.com/news/home/20200819005670/en/TechnipFMC-wins-Subsea-EPCI-Libra-Consortium%E2%80%99s-Mero) TechnipFMC wins Subsea EPCI for the Libra Consortium’s Mero 2 Project, operated by Petrobras in Brazil (Overnight News)\n* [TLSA](https://www.globenewswire.com/news-release/2020/08/20/2081061/0/en/Tiziana-is-Pleased-to-Retain-Dr-Napoleone-Ferrara-to-Serve-on-Its-Scientific-Advisory-Board-for-an-Additional-Three-Year-Term.html) Tiziana is Pleased to Retain Dr. Napoleone Ferrara to Serve on Its Scientific Advisory Board for an Additional Three-Year Term  (Overnight News)\n* APM ($3,28) Aptorum Group Appoints Dr. Herman Weiss as CEO of microbiome-based platform Claves Life Sciences and Dr. Robbie Majzner as scientific advisor to SACT-1 drug for Neuroblastoma and others (Overnight News)\n* [TMBR](https://www.globenewswire.com/news-release/2020/08/19/2080916/0/en/Timber-Pharmaceuticals-Announces-Appointment-of-Dr-David-Cohen-and-Dr-Lubor-Gaal-to-Board-of-Directors.html) ($1.62) Timber Pharmaceuticals Announces Appointment of Dr. David Cohen and Dr. Lubor Gaal to Board of Directors  \n* [TMQ](https://finance.yahoo.com/news/trilogy-metals-hold-conference-call-011500069.html) ($2.04) Trilogy Metals to Hold Conference Call for the Arctic Feasibility Study (Overnight News)\n* [XLNX](https://www.businesswire.com/news/home/20200819005691/en/Subaru-Selects-Xilinx-Power-New-Generation-EyeSight-System) Subaru Selects Xilinx to Power New-Generation EyeSight System (Overnight News)\n* [FB](https://www.reuters.com/article/us-facebook-privacy-lawsuit/facebook-wins-preliminary-approval-to-settle-facial-recognition-lawsuit-idUSKCN25G08M) Facebook wins court approval to settle biometric privacy lawsuit (Overnight News)\n* [ZI](https://finance.yahoo.com/news/zoominfo-announces-pricing-secondary-offering-014000207.html) ZoomInfo Announces Pricing of Secondary Offering of Shares of Class A Common Stock (Overnight News)\n* [INTC](https://www.benzinga.com/news/20/08/17166382/intel-shares-jump-over-3-as-it-announces-10b-stock-buyback-plan) Intel Shares Jump Over 3% As It Announces $10B Stock Buyback Plan\n* [INTC](https://www.barrons.com/articles/intel-stock-jumps-on-10-billion-stock-buyback-51597876288) Intel Jumps on Buyback News, as CEO Calls the Stock Too Cheap \n* [CALM](https://www.businesswire.com/news/home/20200819005768/en/Cal-Maine-Foods-Announces-Pricing-Secondary-Offering-Common) Cal-Maine prices secondary offering at $39  \n* [GE](https://www.reuters.com/article/us-ge-iraq/ge-signs-power-agreements-worth-over-1-2-billion-with-iraq-idUSKCN25F2SM) GE signs deals to add 1.5 GW to Iraq's power grid  \n* [TWI](https://www.prnewswire.com/news-releases/titan-international-inc-responds-to-trumps-suggested-goodyear-boycott-301115337.html) Titan International responds to Trump's suggested Goodyear boycott  \n* [REGN](https://www.prnewswire.com/news-releases/new-england-journal-of-medicine-publishes-positive-phase-3-evinacumab-results-in-patients-with-severe-inherited-form-of-high-cholesterol-301115122.html) New England Journal of Medicine Publishes Positive Phase 3 Evinacumab Results in Patients with Severe Inherited Form of High Cholesterol  \n* [ESGR](https://www.globenewswire.com/news-release/2020/08/20/2081001/0/en/Enstar-Group-Limited-Announces-Pricing-of-350-Million-of-5-750-Fixed-Rate-Reset-Junior-Subordinated-Notes-Due-2040.html) Enstar Group Announces Pricing of $350 Million of 5.750% Fixed-Rate Reset Junior Subordinated Notes Due 2040  \n* [NVDA INTC](https://finance.yahoo.com/news/nvidia-beats-estimates-data-center-022854397.html) Nvidia beats estimates but data center performance leaves shares flat \n* [XRX](https://www.bloomberg.com/news/articles/2020-08-19/icahn-files-13d-a-on-xerox) Icahn Boosts Stake in Xerox Holdings, Filing Shows   \n* [MOBL](https://www.businesswire.com/news/home/20200819005577/en/MobileIron-Earns-Certification-World-Class-Customer-Support-Consecutive) MobileIron Earns Certification for World-Class Customer Support for Third Consecutive Year\n* [SWX](https://finance.yahoo.com/quote/SWX/) Southwest Gas upped at Wells Fargo on more balanced risk/reward  \n* [ADM](https://money.yahoo.com/adm-announces-pricing-secondary-block-231500147.html) ADM Announces Pricing of Its Secondary Block Trade of Ordinary Shares of Wilmar International and Concurrent Offering of US$300,000,000 Zero Coupon Exchangeable Bonds Due 2023, Exchangeable For Wilmar Ordinary Shares\n* [AIG](https://www.businesswire.com/news/home/20200819005760/en/Affirms-Credit-Ratings-American-International-Group-Subsidiaries) AM Best Affirms Credit Ratings of American International Group and Most Subsidiaries; Downgrades Issuer Credit Ratings of Life/Health Subsidiaries  \n* [GT](https://www.reuters.com/article/us-goodyear-trump-boycott/trump-says-not-happy-with-goodyear-would-swap-tires-on-presidential-limo-idUSKCN25F2TQ) Trump says 'not happy' with Goodyear; would swap tires on presidential limo  \n* [LB](https://www.reuters.com/article/us-l-brands-results/l-brands-reports-surprise-profit-on-demand-for-soaps-lingerie-idUSKCN25F2LO) L Brands reports surprise profit on demand for soaps, lingerie  \n* [LB](https://www.barrons.com/articles/l-brands-stock-earnings-beat-expectations-victorias-secret-bath-body-works-pandemic-51597872304) L Brands Stock Is Rising After Earnings Beat Expectations \n* [LB](https://www.nytimes.com/reuters/2020/08/19/business/19reuters-l-brands-results.html) Bath &amp; Body Works parent reports 63% surge in same-store sales   \n* [ED](https://www.bloomberg.com/news/articles/2020-08-19/new-york-s-coned-faces-steep-penalties-for-storm-response) New York's ConEd Faces 'Steep Penalties' for Storm Response\n* [MRNA](https://www.bloomberg.com/news/articles/2020-08-19/a-5-000-surge-makes-medical-wear-firm-singapore-s-top-stock) A 5,000% Surge Makes Medical-Wear Firm Singapore’s Top Stock  \n* [CWH](https://finance.yahoo.com/news/camping-world-holder-crestview-offers-210901951.html) Camping World Holder Crestview Offers 6 Million Shares  \n* [NVDA](https://www.barrons.com/articles/nvidia-is-officially-a-data-center-company-heres-why-51597874187) Nvidia Is Officially a Data Center Company. Here’s Why.  \n* [FB](https://www.bloombergquint.com/onweb/facebook-resists-handing-over-documents-in-genocide-probe) Facebook Resists Handing Over Documents in Genocide Probe  \n* [AUTO](https://www.globenewswire.com/news-release/2020/08/19/2080912/0/en/AutoWeb-Reports-Preliminary-July-2020-Results.html) AutoWeb reports preliminary July 2020 results; shares +20%  \n* [PCG](https://finance.yahoo.com/news/california-grid-operator-doesn-t-211503253.html) California grid operator foresees no rolling blackouts  \n* [BD](https://www.prnewswire.com/news-releases/walker--dunlop-provides-financing-for-84-unit-affordable-housing-development-in-sarasota-301115232.html) Walker and Dunlop Provides Financing for 84-Unit Affordable Housing Development in Sarasota  \n* [WGO](https://www.globenewswire.com/news-release/2020/08/19/2080967/0/en/Winnebago-Industries-Board-of-Directors-Approves-9-Increase-to-Quarterly-Cash-Dividend.html) Winnebago Industries Board of Directors Approves 9% Increase to Quarterly Cash Dividend \n* [GVA](https://finance.yahoo.com/news/granite-team-installs-log-jam-213000408.html) Granite Team Installs Log Jam at Derby Dam Fish Screen   \n* [SNPS](https://www.prnewswire.com/news-releases/nsitexe-adopts-synopsys-haps-prototyping-to-validate-data-flow-processor-ip-301114800.html) NSITEXE Adopts Synopsys HAPS Prototyping to Validate Data Flow Processor IP  \n* [GD](https://www.defense.gov/Newsroom/Contracts/Contract/Article/2318657/) US Department of Defense awards new contracts to GD\n* [BATL](https://www.globenewswire.com/news-release/2020/08/19/2080931/0/en/Battalion-Announces-Appointment-of-New-Chief-Financial-Officer.html) Battalion appoints new CFO  \n* [AMC](https://www.cnbc.com/video/2020/08/19/amc-entertainment-ceo-on-reopening-100-locations.html) AMC +7.6% as CEO Aron touts U.S. reopening on CNBC \n* [HBB](https://www.prnewswire.com/news-releases/hamilton-beach-brands-holding-company-increases-dividend-by-6-301115222.html) Hamilton Beach Brands Holding Company Increases Dividend By 6% \n* [NFE](https://www.businesswire.com/news/home/20200819005737/en/New-Fortress-Energy-Announces-Pricing-1000-Million) New Fortress Energy Announces Pricing of $1,000 Million of Senior Secured Notes \n* [MDT](http://www.globenewswire.com/news-release/2020/08/19/2080961/0/en/Study-Published-in-The-New-England-Journal-of-Medicine-Demonstrates-Patients-Experience-Fewer-Disruptions-to-Dialysis-Therapy-When-Treated-with-Medtronic-Drug-Coated-Balloon.html) Study Published in The New England Journal of Medicine Demonstrates Patients Experience Fewer Disruptions to Dialysis Therapy When Treated with Medtronic Drug-Coated Balloon   \n* [BF](https://www.businesswire.com/news/home/20200819005734/en/Brown-Forman-Quarter-Earnings-Release-Conference-Call-Scheduled) Brown-Forman First Quarter Earnings Release and Conference Call Scheduled for September 2, 2020  \n* [TPC](https://www.businesswire.com/news/home/20200819005720/en/Tutor-Perini-Announces-Refinancing-New-Credit-Agreement) Tutor Perini announces refinancing and new credit agreement  \n* [TPB](https://www.businesswire.com/news/home/20200819005733/en/Turning-Point-Brands-Announces-Retirement-General-Counsel) Turning Point Brands Announces Retirement of General Counsel James Dobbins and Appoints Brittani Cushman as Successor \n* [SPLP](https://www.businesswire.com/news/home/20200819005726/en/Steel-Partners-Holdings-Declares-Regular-Quarterly-Distribution) Steel Partners Holdings Declares Regular Quarterly Distribution on its Series A Preferred Units  \n* [CREE](https://www.benzinga.com/analyst-ratings/analyst-color/20/08/17159293/why-cree-analysts-are-lifting-price-targets-despite-post-q4-selloff) Why Cree Analysts Are Lifting Price Targets Despite Post-Q4 Selloff  \n* [WSM](https://www.businesswire.com/news/home/20200819005197/en/Williams-Sonoma-announces-release-date-quarter-2020-results) Williams-Sonoma announces release date for second quarter 2020 results: Wednesday, August 26, 2020  \n* [NVDA](https://www.yahoo.com/news/nvidia-rings-record-q2-revenues-205155614.html) Nvidia Rings In Record Q2 Revenues Powered By Ampere GPUs, Mellanox Acquisition  \n* [RDFN](https://www.prnewswire.com/news-releases/redfin-appoints-kerry-d-chandler-to-board-of-directors-301115109.html) Redfin Appoints Kerry D. Chandler to Board of Directors  \n* [IGT](https://www.prnewswire.com/news-releases/igt-announces-sports-betting-technology-agreement-with-boyd-gaming-301114892.html) IGT Announces Sports Betting Technology Agreement with Boyd Gaming\n* [AVTR](https://www.prnewswire.com/news-releases/avantor-announces-secondary-offering-of-38-500-000-shares-of-common-stock-301115185.html) Avantor launches stock offering, shares down 4%  \n* [KSU](https://www.businesswire.com/news/home/20200819005728/en/Kansas-City-Southern-Receives-Quest-Quality-Award) Kansas City Southern Receives Quest for Quality Award for On-Time Performance, Customer Service  \n* [ANGI](https://www.globenewswire.com/news-release/2020/08/19/2080909/0/en/ANGI-Homeservices-Appoints-Christopher-Bohnert-to-Chief-Accounting-Officer.html) ANGI names Bohnert its new chief accounting officer \n* [GOOD](https://finance.yahoo.com/news/gladstone-commercial-corporation-provides-business-203000263.html) Gladstone Commercial's August rent collections are steady with July's \n* [PBYI](https://www.businesswire.com/news/home/20200819005522/en/Puma-Biotechnology-Announces-Publication-Interim-Results-Phase) Puma Biotech announces new data on strategies to improve tolerability of neratinib   \n* [SNPS](https://www.prnewswire.com/news-releases/synopsys-appoints-sassine-ghazi-as-chief-operating-officer-301115113.html) Synopsys cheers COO appointment  \n* [HMLP](https://www.prnewswire.com/news-releases/hoegh-lng-partners-lp-announces-new-chief-executive-officer-and-chief-financial-officer-301115115.html) Hoegh LNG Partners names new CEO, CFO \n* [CRNC](https://www.globenewswire.com/news-release/2020/08/19/2080937/0/en/Cerence-to-Present-at-Raymond-James-Diversified-Industrials-Conference.html) Cerence to Present at Raymond James Diversified Industrials Conference   \n* [OEC](https://www.businesswire.com/news/home/20200819005687/en/Orion-Engineered-Carbons-Participate-UBS-Virtual-Chemicals) Orion Engineered Carbons to Participate in the UBS Virtual Chemicals Conference  \n* [AVNW](https://www.nasdaq.com/press-release/aviat-networks-sets-date-for-its-fiscal-2020-fourth-quarter-and-full-year-financial) Aviat Networks Sets Date for Its Fiscal 2020 Fourth Quarter and Full Year Financial Results Announcement and Conference Call  \n* [RKT](https://finance.yahoo.com/news/rocket-companies-announces-second-quarter-202300257.html) Rocket Companies Announces Second Quarter 2020 Earnings Date \n* [OXY](https://www.reuters.com/article/usa-carboncapture-dac/occidental-financing-major-co2-removal-plant-in-texas-idUSL1N2FL0RT) Occidental to finance biggest U.S. carbon dioxide removal plant   \n* [AN](https://www.prnewswire.com/news-releases/autonation-continues-aggressive-approach-to-streamline-business-and-reduce-costs-301115078.html) AutoNation Continues Aggressive Approach to Streamline Business and Reduce Costs\n* [NX](https://www.globenewswire.com/news-release/2020/08/19/2080920/0/en/Quanex-Building-Products-Announces-Third-Quarter-2020-Earnings-Release-and-Conference-Call-Schedule.html) Quanex Building Products Announces Third Quarter 2020 Earnings Release and Conference Call Schedule  \n* [UVE](https://www.businesswire.com/news/home/20200819005701/en/Universal-Insurance-Holdings-Appoints-Michael-J.-Poloskey) Universal Insurance Holdings Appoints Michael J. Poloskey as New COO  \n* [KDP](https://www.prnewswire.com/news-releases/keurig-dr-pepper-announces-closing-of-secondary-offering-of-common-stock-301115162.html) Keurig Dr Pepper Announces Closing of Secondary Offering of Common Stock\n* [DOV](https://www.prnewswire.com/news-releases/dover-precision-components-opens-new-innovation-lab-301115081.html) Dover Precision Components Opens New Innovation Lab  \n* [OTIS](https://markets.businessinsider.com/news/stocks/otis-ceo-and-cfo-to-speak-on-barclays-conference-call-1029518330) Otis CEO and CFO to speak on Barclays conference call  \n* [TSLA PDD](https://finance.yahoo.com/news/tesla-denies-affiliation-pinduoduo-group-200334695.html) Tesla Denies Affiliation With Pinduoduo Group Model 3 Purchase In China  \n* [TECK](https://www.globenewswire.com/news-release/2020/08/19/2080915/0/en/Teck-Announces-Senior-Executive-Appointments.html) Teck Announces Senior Executive Appointments  \n\nNote: Seeking A url's and Reddit do not get along.\n\n***Upcoming Earnings:***\n\n* [Earnings Calendar](https://finance.yahoo.com/calendar/earnings/)\n* [Earnings Calendar II](https://tradingeconomics.com/earnings)\n\n***COVID-19 Stats and News:*** \n\n* [COVID-19 Stats](https://www.worldometers.info/coronavirus/country/us/)\n* [Latest Map and Case Count](https://www.nytimes.com/interactive/2020/us/coronavirus-us-cases.html)\n\n***Macro Considerations:***\n\n* [Economic Indicators](https://tradingeconomics.com/united-states/indicators)\n* [Economic Indicator Forecasts](https://tradingeconomics.com/united-states/forecast)\n* [Tracking America’s Recovery](https://www.cnn.com/business/us-economic-recovery-coronavirus)\n\n[***Most Recent SEC Filings***](https://www.lazyfa.com/events/)\n\n* [SEC Form 10-K](https://sec.report/Form/10-K) (Annual Performance)\n* [SEC Form 10-Q](https://sec.report/Form/10-Q) (Quarterly Performance)\n* [SEC Form 8-K](https://sec.report/Form/8-K) (Information of Shareholder Interest)\n* [SEC Form DEFA14A](https://sec.report/Form/DEFA14A) (Upcoming Shareholder Meeting)\n* [SEC Form 4](https://sec.report/Form/4) (Insider Trading)\n* [SEC Form 144](https://sec.report/Form/144) (Insider Selling)\n* [SEC Form 13F](https://sec.report/Form/13F-HR) (Institutional Investment)\n\n***Other***\n\n* [Current Trading Halts](https://www.nasdaqtrader.com/trader.aspx?id=TradeHalts)\n* [Reg SHO Threshold List](https://www.nasdaqtrader.com/trader.aspx?id=RegSHOThreshold)\n* [Short Sale Circuit Breaker](https://www.nasdaqtrader.com/trader.aspx?id=ShortSaleCircuitBreaker)\n* [Highest Short Interest](https://www.highshortinterest.com)\n* [Most Recent Insider Filings](https://m.insidertracking.com)\n* [Fear and Greed Index](https://money.cnn.com/data/fear-and-greed/)\n* [OTC Market Snapshot](https://www.otcmarkets.com)\n* [Highest Implied Volatility](https://www.barchart.com/options/highest-implied-volatility/stocks)\n* [Most Recent IPO Filings](https://www.ipomonitor.com/pages/ipo-filings.html)\n* [Dividend Calendar](https://www.thestreet.com/dividends/index.html)\n* [Most Active Stocks](https://finance.yahoo.com/most-active)\n* [Daily Gainers](https://finance.yahoo.com/screener/predefined/day_gainers)\n* [Daily Losers](https://finance.yahoo.com/screener/predefined/day_losers)\n\n\\-----------------------------------------------\n\n[Morning Research and Trading Prep Tool Kit](https://www.tradinganalysisresources.com/2020/05/free-references-and-resources.html?m=1)\n\nOther Useful Resources:\n\n[The Ultimate Quick Resource For the Amateur Trader.](https://www.reddit.com/r/pennystocks/comments/hcja2q/the_ultimate_quick_resource_for_the_amateur_trader/)\n\nSubscribe to This Brief and the daily 4:00 AM Pre Market Brief on [The Twitter Link Here](https://www.tradinganalysisresources.com/2020/05/free-references-and-resources.html?m=1) . Alerts in the tweets will direct you to the daily brief in this sub\n\nIt is up to you to judge the accuracy and veracity of these headlines before trading.",
        "subreddit": "pennystocks",
        "title": "Your Pre-Market Brief for 08/20/2020",
        "url": "https://www.reddit.com/r/pennystocks/comments/id5nlj/your_premarket_brief_for_08202020/",
        "created": 1597936529.0
    },
    {
        "author": "Owlagami",
        "created_utc": 1597360971,
        "id": "i9aqtj",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "Just thinking they will win back a lot of market and be profitable within a week due to the opening. Not much news has been out about it, I actually got an email from them today about it.",
        "subreddit": "pennystocks",
        "title": "$AMC announced they open in about a week, anyone getting in asap to hold?",
        "url": "https://www.reddit.com/r/pennystocks/comments/i9aqtj/amc_announced_they_open_in_about_a_week_anyone/",
        "created": 1597389771.0
    },
    {
        "author": "spock23",
        "created_utc": 1597867031,
        "id": "icv32i",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "Hello WSB, what's your current outlook on AMC?  I hear they ain't doing so hot.  Gonna open 100 theaters this weekend.  Probably get some new coverage for a day or two showing people in line at the theaters.  \n\nMaybe the stock pops a little on the hype.  Then we buy puts.  \n\nYour thoughts?",
        "subreddit": "wallstreetbets",
        "title": "AMC puts",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/icv32i/amc_puts/",
        "created": 1597895831.0
    },
    {
        "author": "indonesian_activist",
        "created_utc": 1598061862,
        "id": "iea6hk",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "**Previous Post** \n\n [https://www.reddit.com/r/wallstreetbets/comments/i9wrpv/coverage\\_on\\_splk\\_part\\_2/](https://www.reddit.com/r/wallstreetbets/comments/i9wrpv/coverage_on_splk_part_2/) \n\n&amp;#x200B;\n\n&gt;Anything Splunk can do, Elasticsearch(ESTC) ELK stack can do faster, cheaper and under expert hands probably better  \n&gt;  \n&gt;I'm bullish on SaaS medium &gt; term, cyber security remote work the whole thing. I'm bearish on traditional on-prem license companies that charge per GB data like &gt; Splunk pretending to be hip with splunk cloud/signal fx. Investors  panicked after DDOG earnings, I'm betting if cloud optimized DDOG got  hit hard, splunk will be hit harder comes earnings.  \n&gt;  \n&gt;TL;DR: AMZN AWS's ElasticSearch Cloud, CloudTrail and Cloudwatch will eat SPLK's lunch  \n&gt;  \n&gt;$SPLK BUY 185P 8/28  \n&gt;  \n&gt;price target 175  \n&gt;  \n&gt;The purpose of this post is to ask and reconfirm assumptions, with this week development have you changed your general outlook on SPLK and or have new information/analysis regarding it ? I'm planning to hold the shorts till earnings. Should we also go long on ESTC ? (earnings 8/26)\n\n&amp;#x200B;\n\n[1 Year SPLK vs ESTC vs DDOG vs QQQ vs SKYY](https://preview.redd.it/t62tsgm0ngi51.png?width=1614&amp;format=png&amp;auto=webp&amp;s=67c29fd6eee170ad361bd8945627baf47f1b4416)\n\n&amp;#x200B;\n\n[2 weeks SPLK vs peers](https://preview.redd.it/en8783c3ngi51.png?width=1620&amp;format=png&amp;auto=webp&amp;s=15edd0c72ccf42ee2480805d98e0ab1a80e38478)\n\nAmazing performance by ESTC these past 2 weeks, from the graphs ESTC is still trailing QQQ and SKYY for the year, so it might have some room grow.  Furthermore SPLK recent bounce was partly due to VO ETF inflows.\n\non 8/19 ESTC announced these two core features that will challenge SPLK\n\n&gt;**Elastic Announces A Single, Unified Agent And New Integrations To Bring Speed, Scale, And Simplicity To Users Everywhere**  \n&gt;  \n&gt;..................  \n&gt;  \n&gt;Elastic Observability  \n&gt;  \n&gt;Streamlining the entire data ingest process with simplified one-click ingestions using the beta of Elastic Agent and Ingest Manager Launching an observability overview page in Kibana that showcases all the data in a single datastore to support investigative workflows Adding OpenTelemetry integration in Elastic APM so users can explore without making any changes to their instrumentation Strengthening ties between DevOps and SecOps with more than 50 turnkey detection rules  \n&gt;  \n&gt;..............  \n&gt;  \n&gt;Elastic Security  \n&gt;  \n&gt;Delivering a beta of malware prevention on Windows and macOS and advanced detections and deep visibility for all major operating systems including Windows, macOS, and Linux Simplifying ingestion and providing deep data visibility for SIEM use cases with a beta of a unified agent to protect hosts on premises and in the cloud Offering a beta of out-of-the-box cloud security posture monitoring to help teams protect the cloud-enabled workforce without disruption Introducing a new integration with IBM Security's security orchestration, automation, and response (SOAR) platform, IBM Security Resilient Expanding data integrations across Microsoft Defender ATP, Windows PowerShell, and G Suite to bring deeper visibility to security teams\n\nIn hindsight,actually much easier to be long in this market, like buying calls for ESTC, but I can't help it I'm a proud 🌈 🐻 it feels unnatural to go by the week without a short. Hence I'll be hanging on to my SPLK puts through earnings.",
        "subreddit": "wallstreetbets",
        "title": "ESTC and SPLK earnings next week 8/26 AMC, (SaaS &amp; SIEM sector)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iea6hk/estc_and_splk_earnings_next_week_826_amc_saas/",
        "created": 1598090662.0
    },
    {
        "author": "noobieinvestor101",
        "created_utc": 1597409672,
        "id": "i9lfa5",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "My reasoning is people are getting tired of COVID and people like Christopher Nolan. Considering this will provide a sense of normalcy for people and they get to see an anticipated movie, I can totally see AMC share price rise as theaters open and Tenet releases. Technically not a penny stock atm and it's pretty speculative but I mean this whole subreddit is fairly speculative. Also the float isn't too bad.\n\nWhat do you guys think?",
        "subreddit": "pennystocks",
        "title": "Holding AMC until Tenet comes out",
        "url": "https://www.reddit.com/r/pennystocks/comments/i9lfa5/holding_amc_until_tenet_comes_out/",
        "created": 1597438472.0
    },
    {
        "author": "pop710",
        "created_utc": 1597574049,
        "id": "iaq70c",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Looking for some cheap and good options plays. Around .01-.5 options that will most likely execute. Thinking about AMC call for 21st cause of their 20th opening.",
        "subreddit": "pennystocks",
        "title": "Cheap Options?",
        "url": "https://www.reddit.com/r/pennystocks/comments/iaq70c/cheap_options/",
        "created": 1597602849.0
    },
    {
        "author": "Noderpsy",
        "created_utc": 1598895942,
        "id": "ik2q41",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "# Tenet grossed $53 already, U.S premiere is this week, $AMC dipped fiddy cent per share because ??, and moviegoers have retard strength so I'm buying... See link below.  u love the thick text don't u?\n\n[https://www.cbc.ca/news/entertainment/tenet-launch-overseas-1.5702423](https://www.cbc.ca/news/entertainment/tenet-launch-overseas-1.5702423)\n\nOptions, shares whatever. Get it. Reasonable PT: $7.50 in the next couple weeks. I'm in for 100 at $5.80\n\nSorry no rocket ships, just a fear play, just like MGM. You're going to inverse this play aren't you fam?",
        "subreddit": "wallstreetbets",
        "title": "Box offices have opened surprisingly strong internationally. You going to the movies?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ik2q41/box_offices_have_opened_surprisingly_strong/",
        "created": 1598924742.0
    },
    {
        "author": "smoothjazz123",
        "created_utc": 1597521728,
        "id": "iaec15",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Looking to invest in AMC, should I go with the stock or go with the bond at around 25.\n\nhttps://markets.businessinsider.com/bonds/amc_entertainment_incdl-notes_201520-25-bond-2025-us00165aah14",
        "subreddit": "stocks",
        "title": "AMC Bond or Stock?",
        "url": "https://www.reddit.com/r/stocks/comments/iaec15/amc_bond_or_stock/",
        "created": 1597550528.0
    },
    {
        "author": "vrashabh",
        "created_utc": 1598540710,
        "id": "ihmntm",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Given the news of theatre openings, is this stock a buy or P&amp;D for bag holders?",
        "subreddit": "pennystocks",
        "title": "What's happening with $AMC?",
        "url": "https://www.reddit.com/r/pennystocks/comments/ihmntm/whats_happening_with_amc/",
        "created": 1598569510.0
    },
    {
        "author": "0ncc",
        "created_utc": 1597410691,
        "id": "i9lot9",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Why don't i see anyone talking about the fucking movies??? they shits went up 60 cents in the past 24 hours??? time to make some money off the real popcorn.",
        "subreddit": "wallstreetbets",
        "title": "AMC?????",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i9lot9/amc/",
        "created": 1597439491.0
    },
    {
        "author": "SafeBet5",
        "created_utc": 1597343239,
        "id": "i95bqy",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "My account is under 25k So I'm limited to only 3 day trade. Before call my broker I want to make sure I understand the rules. \n\nI purchased AMC Four different times today and sold it once. and got a patterned daytrader notification that I did 4 trades in one day.  Should this be only one day trade as I open the position 4 different times But only Closed it Once.?",
        "subreddit": "StockMarket",
        "title": "Daytrading question",
        "url": "https://www.reddit.com/r/StockMarket/comments/i95bqy/daytrading_question/",
        "created": 1597372039.0
    },
    {
        "author": "mrsimbau",
        "created_utc": 1598557308,
        "id": "ihrz6n",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "[https://imgur.com/bqusUOG](https://imgur.com/bqusUOG)\n\nExpected it to be just like every other major hurricanes, Barry(CAT1), Harvey(CAT4). I expect this Laura(CAT4) to plump them down a little bit. But no no no. They got to have a fucking rally on my gay ass bear butt.\n\nLucky I didn't bought AMC and AAL put. That would be a triple fuck in the ass\n\nShould I hold this butt plug till Monday ?",
        "subreddit": "wallstreetbets",
        "title": "Nice play Oil and Gas",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ihrz6n/nice_play_oil_and_gas/",
        "created": 1598586108.0
    },
    {
        "author": "CulturalArmadillo4",
        "created_utc": 1597330561,
        "id": "i91cpe",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "If your looking for a safe recovery from this week AMC is a pretty safe bet. Obviously theyre going to keep going up and it looks like they have plans to reopen august 20th.",
        "subreddit": "pennystocks",
        "title": "Amc just got out of “penny” category",
        "url": "https://www.reddit.com/r/pennystocks/comments/i91cpe/amc_just_got_out_of_penny_category/",
        "created": 1597359361.0
    },
    {
        "author": "I_Enjoy_Taffy",
        "created_utc": 1597324189,
        "id": "i8zmjd",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Article here: https://www.theverge.com/2020/8/12/21365960/amc-a-list-subscription-covid-19-coronavirus-december-deadline-cancel-reactivate\n\nSome notes: \n\n- AMC A-List subscribers have a deadline of December 1st to cancel or reactivate\n\n- Masks are required for all\n\n- All auditoriums will be set at 30% capacity or less\n\n- They're also doing a welcome back to the movies promo called \"Movies in 2020 at 1920 Prices\" where any movie shown on 8/20 is 15 cents.\n\nStates that have no date for reopening as of now:\n\nNew York, California, Arizona, Washington DC, Maryland, Michigan, New Jersey, New Mexico, North Carolina, Washington (state),",
        "subreddit": "stocks",
        "title": "AMC Theaters plans to open 100 theaters in the US starting next week (8/20). NY and CA still tbd when guidelines allow for it.",
        "url": "https://www.reddit.com/r/stocks/comments/i8zmjd/amc_theaters_plans_to_open_100_theaters_in_the_us/",
        "created": 1597352989.0
    },
    {
        "author": "CHIEFROLLIN1",
        "created_utc": 1598638327,
        "id": "iic9d5",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "In a demonstration of true autistic strategy, I'd like to introduce you to my current matra, TTMAT (talk to me at ten) \n\nWatching these stocks bounce closer to potential rally news, I've committed to being a retard of the highest quality and will dump my load into these stocks the moment they reach $10. Why? Because I like even and nice looking numbers and the growth prospect with stocks at this price. Do I know what I'm doing? No. Do I have 10k to blow? Yes. So 4k on Ford, because my wife's boyfriend really wants the new electric Mustang, and the rest will be 2k. \n\nL8er sk8ers",
        "subreddit": "wallstreetbets",
        "title": "TTMAT Ford, GE, SIRI, AMC",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iic9d5/ttmat_ford_ge_siri_amc/",
        "created": 1598667127.0
    },
    {
        "author": "mrsimbau",
        "created_utc": 1598556041,
        "id": "ihrjpq",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Expected it to be just like every other major hurricanes, Barry(CAT1), Harvey(CAT4). I expect this Laura(CAT4) to plump them down a little bit. But no no no. They got to have a fucking rally on my gay ass bear butt.\n\nLucky I didn't bought AMC and AAL put. That would be a triple fuck in the ass \n\nShould I hold this butt plug  till Monday ?",
        "subreddit": "wallstreetbets",
        "title": "Expected Oil and gas to come down but got F*CKed!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ihrjpq/expected_oil_and_gas_to_come_down_but_got_fcked/",
        "created": 1598584841.0
    },
    {
        "author": "ab2497",
        "created_utc": 1597589853,
        "id": "iatqmy",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "I know I know there reopening and selling movie tickets at 15¢. But with streaming services dominating the market and COVID-19 showing no signs of easing restrictions movie theaters might have trouble filling seats. Not only that but with AMC already at $5 this feels like a good play after the overreaction to drop once again and maybe even lower. Would love to hear some opinions!",
        "subreddit": "options",
        "title": "AMC Puts?",
        "url": "https://www.reddit.com/r/options/comments/iatqmy/amc_puts/",
        "created": 1597618653.0
    },
    {
        "author": "0ncc",
        "created_utc": 1597410321,
        "id": "i9ll7w",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "AMC???",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i9ll7w/amc/",
        "created": 1597439121.0
    },
    {
        "author": "SpacklerCarl",
        "created_utc": 1598281299,
        "id": "ifqmpw",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Good feeling about CNK, AMC as theatres scheduled to reopen!!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ifqmpw/good_feeling_about_cnk_amc_as_theatres_scheduled/",
        "created": 1598310099.0
    },
    {
        "author": "YourIceCreamBoy",
        "created_utc": 1596284285,
        "id": "i1ras0",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Theaters and entertainment stocks like AMC-What do you think?",
        "url": "https://www.reddit.com/r/stocks/comments/i1ras0/theaters_and_entertainment_stocks_like_amcwhat_do/",
        "created": 1596313085.0
    },
    {
        "author": "_WinnerTakesAll_",
        "created_utc": 1596635761,
        "id": "i45s2n",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Here is my incomplete list of companies reporting earnings next week. Please add major ones you are aware of or watching. \n\nWhat are your bets?\n\n  \n\nMonday: Aug 10, 2020: \n\nBMO: Canopy Growth, RoyalCaribbean, Marriott, Barrick Gold, GBDC capital, Seaworld \n\nAMC: Tilray; Simon Property; Inovio; SunRun\n\n&amp;#x200B;\n\nTuesday: Aug 11, 2020\n\nBMO: NIO, SYSCO, RADCOM \n\nAMC:Neptune Wellness solute, Red Robin, Shockwave, T2 biosystems, Super league gaming, Motus, K12 \n\n&amp;#x200B;\n\nWednesday: Aug 12, 2020\n\nBMO: JMIA\n\nAMC: Cisco; Lyft; SmileDirect; Joyy (yy)\n\n  \n\nThursday: Aug 13, 2020\n\nBMO:  Netease; Veru; Teekay Tankers; GrowGeneration; IIVI; Tapestry; Youdao \n\nAMC: AudioEye, BlinkCharging, AppliedMaterials, Arcadia Biosci, Farfetch, AudioEye, WidePoint \n\n  \n\nFriday: Aug 14, 2020\n\nBMO: DraftKings \n\nAMC: your mom's pregnancy test",
        "subreddit": "wallstreetbets",
        "title": "Next week earnings play:",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i45s2n/next_week_earnings_play/",
        "created": 1596664561.0
    },
    {
        "author": "Noderpsy",
        "created_utc": 1598895796,
        "id": "ik2ody",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Box offices have opened surprisingly strong. Tenet grossed $53 already, U.S premiere is this week, $AMC dipped fiddy cent per share because ??, and moviegoers have retard strength so I'm buying... (Link in comments)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ik2ody/box_offices_have_opened_surprisingly_strong_tenet/",
        "created": 1598924596.0
    },
    {
        "author": "coronastocks",
        "created_utc": 1596996250,
        "id": "i6nvf4",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing_discussion",
        "title": "Last chance to escape bankruptcy? AMC’s (AMC) CEO Adam Oren disclosed second-quarter financial results calling it “the most challenging quarter in the 100-year history of AMC”.",
        "url": "https://www.reddit.com/r/investing_discussion/comments/i6nvf4/last_chance_to_escape_bankruptcy_amcs_amc_ceo/",
        "created": 1597025050.0
    },
    {
        "author": "lawson2g",
        "created_utc": 1597446239,
        "id": "i9wela",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "So I listened to the earnings call last week.. which, for the most part, went how I expected it to. However I learned about their plans to make money from video streams. I think they used the acronym PVOD or something of that sort. Anyhow this announcement didn't cause share prices to go up. No increase until they announced theaters opening back up on the 20th.\n      I'm curious to know people's opinions as to weather they think AMC making money off of streams will be positive for the AMC share value. Long or short term. and weather or not AMC is now looking Bullish.",
        "subreddit": "RobinHood",
        "title": "$AMC... BULLISH OR NAHH? 20-30% INCREASE SINCE ANNOUNCEMENT OF REOPENING",
        "url": "https://www.reddit.com/r/RobinHood/comments/i9wela/amc_bullish_or_nahh_2030_increase_since/",
        "created": 1597475039.0
    },
    {
        "author": "kyan-",
        "created_utc": 1597408660,
        "id": "i9l60c",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "AMC reopening theaters, offering day 1 tickets at Great Depression pricing",
        "url": "https://amp.cnn.com/cnn/2020/08/13/media/amc-reopening-ticket-prices/index.html",
        "created": 1597437460.0
    },
    {
        "author": "Don718BK",
        "created_utc": 1597927373,
        "id": "id9k3s",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "StockMarket",
        "title": "Does anyone have knowledge on AMC stock......",
        "url": "https://www.reddit.com/r/StockMarket/comments/id9k3s/does_anyone_have_knowledge_on_amc_stock/",
        "created": 1597956173.0
    },
    {
        "author": "WumboActivate",
        "created_utc": 1597869065,
        "id": "icvrad",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "RobinHoodPennyStocks",
        "title": "Just starting out. My first noteworthy win. I knew holding on to AMC would give me something 🙏",
        "url": "https://www.reddit.com/gallery/icvrad",
        "created": 1597897865.0
    },
    {
        "author": "thebeastboi4",
        "created_utc": 1598562915,
        "id": "ihtr2p",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "BOTH AMC AND MGM CAME THROUGH WITH CLUTCH",
        "url": "https://i.redd.it/94ws42ar2mj51.jpg",
        "created": 1598591715.0
    },
    {
        "author": "urn0tsm3rt",
        "created_utc": 1597806898,
        "id": "icfwmc",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "HAI - If you didn't invest in AMC 2022 $5 calls a month ago you missed the boat - bye",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/icfwmc/hai_if_you_didnt_invest_in_amc_2022_5_calls_a/",
        "created": 1597835698.0
    },
    {
        "author": "QuePasaMoofasa",
        "created_utc": 1597431294,
        "id": "i9rwkx",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Saw the news on AMC..is it a long term play or am I just overreacting?",
        "subreddit": "RobinHood",
        "title": "Do I buy AMC at six dollars?",
        "url": "https://www.reddit.com/r/RobinHood/comments/i9rwkx/do_i_buy_amc_at_six_dollars/",
        "created": 1597460094.0
    },
    {
        "author": "SpartanMDX",
        "created_utc": 1597413765,
        "id": "i9mikx",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "RobinHood",
        "title": "----------AMC&amp;DKNG@10:10AM----------",
        "url": "https://www.reddit.com/r/RobinHood/comments/i9mikx/amcdkng1010am/",
        "created": 1597442565.0
    },
    {
        "author": "mountainhb",
        "created_utc": 1597421872,
        "id": "i9oy0n",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "IPO on 7/15/20\n\nEarnings on 8/19/20\n\n\nStock Description\tOption Volume Statistics\n\n\nGOCO\n      \n     Calls.      Puts.     Volume.         Price\n\t99%\t1%\t        9.4\t                 16.40\t+4.4%\t\n\n\nEarnings \n\n\n19-Aug-2020 AMC\t\t85.1\t100%",
        "subreddit": "stocks",
        "title": "GOCO",
        "url": "https://www.reddit.com/r/stocks/comments/i9oy0n/goco/",
        "created": 1597450672.0
    },
    {
        "author": "Nydas",
        "created_utc": 1597342040,
        "id": "i94yao",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "RobinHoodPennyStocks",
        "title": "AMC has left penny market status again, but this time i dont think itll be back!",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/i94yao/amc_has_left_penny_market_status_again_but_this/",
        "created": 1597370840.0
    },
    {
        "author": "QuePasaMoofasa",
        "created_utc": 1598018148,
        "id": "idx603",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Anyone else bullish on AMC?",
        "url": "https://www.reddit.com/r/stocks/comments/idx603/anyone_else_bullish_on_amc/",
        "created": 1598046948.0
    },
    {
        "author": "jagerade",
        "created_utc": 1598646115,
        "id": "iiepw3",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "smallstreetbets",
        "title": "I pulled most my cash early this week on the week I get a 90% run for fucks sake. AMC 7$ call 9/11",
        "url": "https://i.redd.it/basdgkj5ysj51.jpg",
        "created": 1598674915.0
    }
]