[
    {
        "author": "achicomp",
        "created_utc": 1591190918,
        "id": "gvtxww",
        "num_comments": 656,
        "num_crossposts": 0,
        "selftext": "Absolutely monster job report beat. Stock futures move higher.\n\n&gt;\"The Covid-19 recession is over,” says Zandi, on ADP. He sees job growth returning in June and U-3 falling to around the financial crisis high of 10%, where it will stay absent aggressive fiscal response.\n\n\nhttps://adpemploymentreport.com/2020/May/NER/Report",
        "subreddit": "investing",
        "title": "May ADP employment report: -2.76 million vs expected -8.66 million job loss.",
        "url": "https://www.reddit.com/r/investing/comments/gvtxww/may_adp_employment_report_276_million_vs_expected/",
        "created": 1591219718.0
    },
    {
        "author": "patrickbateman02",
        "created_utc": 1591187146,
        "id": "gvszsu",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Adp private payroll down 2.76 million. Expected 8. Shit so crazy they can’t even get the numbers right. I’m sure a revision is coming but also sure markets will rally over this",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gvszsu/adp_private_payroll_down_276_million_expected_8/",
        "created": 1591215946.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1591459750,
        "id": "gxtpfc",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/StockMarket. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning June 8th, 2020.\n\n# **Look for the S&amp;P 500 to turn positive for the year with a boost from the Fed in the week ahead  - [(Source)](https://www.cnbc.com/2020/06/05/look-for-the-sp-500-to-turn-positive-for-the-year-with-a-boost-from-the-fed-in-the-week-ahead.html)**\n*****\n&gt; Federal Reserve Chairman Jerome Powell is expected to reassure markets next week the central bank will do whatever it takes to help the economy heal. That should be enough to keep investors moving into stocks that benefit from an economic rebound and push the S&amp;P 500 into the green for 2020.\n*****\n&gt; The Fed’s two-day meeting is the big event for markets in the coming week. There are a few economic reports, including inflation data, the consumer price index Wednesday and producer prices Thursday. Weekly jobless claims will be important Thursday to see if there’s a drop in continuing clams, after May’s employment report showed a surprising record gain of 2.5 million jobs.\n*****\n&gt; The reopening trade was in full swing in the past week, especially Friday when stocks surged on the jobs report, which was expected to show a loss of 8.3 million jobs. The Nasdaq broke above its record high set on Feb. 19, and the S&amp;P 500 was just 1.1% away from turning positive for 2020.\n*****\n&gt; Even before the jobs report, investors were loading up on financials, industrials, transports and small caps, which were up more than 8% for the week and 18.4% in the past month. S&amp;P financials were 12.1% higher on the week, S&amp;P industrials were up 10.5, and the NYSE airline index jumped more than 35.4.%.\n*****\n&gt; “I think next week is dominated by the reopening and it will be for another month,” said James Paulsen, chief investment strategist at Leuthold Group. “With cyclicals outperforming, small [caps] outperforming, credit spreads coming in and then the bond yields going up, everybody — all facets of the financial markets — are sort of suggesting the same outcome.”\n*****\n&gt; The S&amp;P 500 ended the week at 3,193, a gain of 4.9%, and now traders are watching to see if it can scale the psychological 3,200 level. The Dow closed Friday at 27,110, up 6.8% for the week, and the Nasdaq Composite was up 3.4%, at 9,814 after reaching an intraday record high of 9,845 Friday.\n*****\n&gt; Analysts say the market will likely look past the protests that broke out in cities across the U.S. after the death of George Floyd in Minneapolis. Four policemen were charged with murder in his death. Looters joined the protests, some of which turned violent, but they quieted down towards the end of the week.\n*****\n&gt; Stocks were higher for a third week in a row, but a change this past week has been the abrupt lurch higher in Treasury yields. The 10-year rose to a high of 0.95% Friday, a quarter-point move in just three sessions. The move was already underway but got a lift Wednesday when ADP jobs data was not nearly as bad as expected. Yields ripped even higher after the May employment report showed the unemployment rate actually fell to 13.3%, instead of climbing to 20%, as expected by economists.\n*****\n&gt; Bond strategists said the Treasury market was now acknowledging the potential for a recovery, but not in the exuberant way the stock market has been. Since March 23, the S&amp;P 500 has risen more than 45%, but it took the 10-year Treasury until this week to get back the yield level it was at when stocks bottomed.\n*****\n&gt; Paulsen said he believes a new bull market has been launched, but there could be pullbacks and some headwinds for the market coming up.\n*****\n&gt; “When GDP is minus 30%, other issues don’t matter. There’s just one issue. But as the economy reopens again, the trade battles will matter again, presidential politics will matter again,” said Paulsen, adding the budget deficit could also matter. “I think we’ll get removed from a sole focus. That isn’t quite there but I think it’s coming.”\n*****\n&gt; # Fed ahead\n&gt; The Fed begins its two-day meeting Tuesday, and will release its statement Wednesday afternoon, followed by a video briefing by Powell.\n*****\n&gt; “Whey would the Fed want to disrupt this with anything?” Paulsen said. “They’re still going to support the economy. They’re going to stay away from negative rates or yield curve management. They’re not going to do anything to scare the markets. They might certainly reassure people that they are still ready to provide support.”\n*****\n&gt; Ethan Harris, head of global economics at Bank of America, said the Fed may clarify where it stands on some of the extraordinary moves it has taken since it cut rates to zero. The Fed has been supporting the markets with asset purchases and multiple programs for commercial paper, corporate bonds, and municipal bonds, for example.\n*****\n&gt; “We think right now they’re just trying to get this Main Street lending program to work. The question is are they going to do more things around what they do in terms of forward guidance and next steps of macro easing,” Harris said.\n*****\n&gt; There has been speculation that the Fed would do some type of so-called yield curve control, a program to keep interest rates capped at certain levels. “I think it’s too early for that,” said Harris. He said the Fed would be guaranteeing low rates for a long period of time if it does yield curve control.\n*****\n&gt; “Yield curve control is basically open-ended quantitative easing,” he said. The Fed is currently buying Treasurys but if it wanted to stop yields from rising too much as the economy improves, it could make targeted purchases.\n*****\n&gt; Barclays chief U.S. economist Michael Gapen said it’s possible the Fed could announce the yield curve control. “We’ve said they could implement yield curve control out to three years,” he said. “In my mind that matches the length of the horizon of the economic projections.”\n*****\n&gt; Powell has said the economy needs more fiscal help, and he could reiterate those comments Wednesday. President Donald Trump on Friday said he backs more stimulus. So far, the Democrats have put out a marker with their wish list for further spending, but there have been no negotiations.\n*****\n&gt; There was concern the strong jobs report could make it harder to get buy in for another big spending package. But some economists say the recovery needs a boost and states need funding to fill the holes in their budgets from coronavirus-related spending and a lack of tax receipts.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/7klaXQm.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/PKTBzT2.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/a5JkAB6.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/M2x4Qoq.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/qtJYfXN.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/bjiJWjV.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/UAi19KJ.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/GQm4ruO.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/PQzyXLa.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/uV1U7FN.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/wm2XJND.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/yarkiMO.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/hFblu2G.png))**\n\n*****\n\n# S&amp;P 500 Stocks Outpacing Analyst Price Targets\n\n&gt; This morning's jobs report shocked the financial world -- most notably the economists whose job it is to provide estimates. The consensus estimate among economists for May nonfarm payrolls was projecting a loss of more than 7 million jobs. The actual number that was reported did not just show a smaller than expected job loss, but it actually showed a gain in jobs of more than 2.5 million.\n\n&gt; We're seeing a similar situation play out in the equity analyst community. With the S&amp;P 500 now up 40%+ since its low less than three months ago, the average stock in the index is now trading above its consensus analyst price target that looks 12 months out. Analysts have simply not been able to catch up to the rapid rise we've seen for equity prices.\n\n&gt; It's extremely rare to see share prices move above consensus analyst price targets. We don't have the historical daily data on this, but anecdotally we can't remember a time when the spread has been this wide. As shown below, at the end of 2019 when the S&amp;P finished a massive rally, equity prices were 5.5% below the consensus price target. That was seen as a very tight spread prior to what we're seeing now. At the lows in March, the average share price had dropped all the way to $92.50 compared to an average consensus price target of $143.20. That projected a gain of 54.9% at the time!\n\n&gt; Since March 23rd, the average share price has risen from $92.50 up to $138.40, while the average analyst price target has fallen from $143.20 to $136. Current price targets no longer project a gain for the average S&amp;P 500 stock, but rather a 1.7% drop.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/avgpricetarget.png))**\n\n&gt; # Nasdaq's Historical Run\n\n&gt; At its highs earlier this morning, the Nasdaq Composite was within 2% of its record high from earlier in the year. Besides the steep V-shape of the Nasdaq's pattern over the last four months, the other aspect of the chart that stands out is just how steep the 50-day moving average is trending lately.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060420-Nasdaq-50DMAa.png))**\n\n&gt; To illustrate just how steep the Nasdaq's 50-DMA has become, the chart below shows the daily percentage change of the 50-day going back to 1971. Currently, the Nasdaq 50-DMA is rising at an average of over 0.5% per day. That's an incredible slope and a level that has been exceeded only a handful of times in the Nasdaq's 50-year history.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060420-Nasdaq-Composite1.png))**\n\n*****\n\n# Big Gains From Smaller Tech\n\n&gt; It's still difficult to fathom the moves in the US equity market over the last four months. The fact that the Nasdaq and more specifically the Technology sector aren't far from record highs is definitely something no one was expecting two months ago. There's an old market saying that equities take the stairs up and the elevator down, but in the latest market cycle, the elevator up was almost as fast as the way down!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060320-Nasdaq.png))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060320-Technology-Sector.png))**\n\n&gt; If you've been following the markets, all you've likely heard up until recently is that large-cap tech, and more specifically, Microsoft (MSFT), Apple (AAPL), Amazon (AMZN), Alphabet (GOOGL), and Facebook (FB), are single-handedly driving the market higher. The reality is not nearly as clear-cut. Given their market caps, the \"Big 5\" (as they're often referred to) have done a lot of heavy lifting, but in terms of performance, they're hardly the only game in town.\n\n&gt; The table below lists Technology sector stocks in the Russell 3000 with market caps of more than $1 billion that are outperforming all of the 'big 5' tech stocks on a YTD basis. Actually, since Amazon is doing so well relative to the rest of the \"big 5\" these are all stocks that are outperforming Amazon. If we looked for stocks that were doing better than the average return of the \"big 5\" the list would be a lot, lot longer (+16.4%).\n\n&gt; Looking through the list of names below, the two top-performing names are Zscaler (ZS) and Twilio (TWLO), which have both more than doubled. Behind these two, DocuSign (DOCU) and Sprout Social (SPT) are both knocking on the door of triple-digits. All 28 of the names listed have market caps of $1 billion, but the average market cap is just over $21 billion, while Nvidia (NVDA) is the largest company on the list with a market cap of $216 billion. For the most part, these aren't names that have been driving the indices, but anyone holding these stocks in their portfolio probably doesn't care!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060320-Tech-Stocks.png))**\n\n*****\n\n# Best 50-Day Rally Ever\n\n&gt; In many ways, what we’ve seen so far in 2020 has been both record-breaking and devastating. From the S&amp;P 500 Index peak on February 19 to the bear market lows March 23, stocks lost 33.9%. Now, 50 trading days later, stocks have gained 39.6%, for the largest 50-day rally since the S&amp;P 500 moved to 500 stocks in 1957.\n\n&gt; “There are no rollercoasters that can replicate what stocks have done so far in 2020,” exclaimed LPL Financial Senior Market Strategist Ryan Detrick. “Here’s the catch though: Big 50-day rallies in the past have taken place near the start of new bull markets, and the returns going out a year were quite bullish.”\n\n&gt; As shown in the LPL Chart of the Day, the 39.6% gain in 50 days was the greatest 50-day rally ever, besting the previous best in October 1982. What’s important to note here is that many of these rallies took place coming off major market lows, and delivered quite strong returns going out 6 to 12 months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/06/best-fifty-days.png?ssl=1))**\n\n&gt; Although we have near-term worries given this historic run, as some sentiment indicators such as put/call ratios are showing some froth, from a bigger picture perspective, this strong 50-day rally offers a reason to think stock prices may be even higher this time next year.\n\n*****\n\n# 2020 In Charts\n\n&gt; 2020 is only five months old, but in many ways it is one of the most historic years we’ve ever seen. “2020 went from moving along nicely, to seeing the worst recession in a generation and the fastest bear market ever,” explained LPL Financial Senior Market Strategist Ryan Detrick. “Now stocks are in the midst of one of the best bull runs ever, even though the economy remains extremely weak, thanks to record stimulus and hopes over a vaccine.”\n&gt; \nTo best sum it all up, here are 10 charts that tell the picture of 2020 so far.\n\n&gt; 1.) The 2010s were the first decade in history to go all 10 years without a recession, which of course ended just months into the new decade, as the economy stopped. Stocks gained 13.5% on an annual basis last decade, surprisingly, only the third-best decade over the past four.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/06/1-blog-chart.png?ssl=1))**\n\n&gt; 2.) This is an election year, and the S&amp;P 500 Index hasn’t been lower when a President is up for reelection since FDR in 1940. Although this seemed nearly impossible at the March lows, it is looking like this incredible streak could have a chance in 2020.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/2-blog-chart.png?ssl=1))**\n\n&gt; 3.) One of the first signs something could go wrong in 2020 was stocks fell in January. Historically, this has meant potential trouble for the final 11 months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/3-blog-chart.png?ssl=1))**\n\n&gt; 4.) As fears over COVID-19 gripped the world, the Dow Jones Industrial Average had its fastest bear market ever, in only 19 days. To put this in perspective, this was the fastest bear market in the 124-year history of the Dow.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/4-blog-chart.png?ssl=1))**\n\n&gt; 5.) Mark Twain said “History doesn’t repeat itself, but it often rhymes”. Looking at history, every 50 years there has been a terrible pandemic and stocks fell more than 30%. We don’t know if the ultimate lows are in this time, but so far, history is rhyming.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/blog-chart-5.png?ssl=1))**\n\n&gt; 6.) More than 20 million people in the US lost their jobs in April, while the unemployment rate soared to near 15%, the highest since the Great Depression. Record drops in manufacturing, industrial production, retail sales, and consumer spending have all taken place in the past two months as well.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/6-blog-chart.png?ssl=1))**\n\n&gt; 7.) A recession is here, ending the streak of 128 months in a row without one. What is unique about the previous expansion was nominal gross domestic product (GDP) grew only 50%, about the average growth seen during the previous expansions, but this expansion was nearly twice as long as the average expansion (10 years versus 5 years).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/7-blog-chart.png?ssl=1))**\n\n&gt; 8.) The bounce off of the March 23 S&amp;P 500 lows has been historic in many ways. In fact, it was one of the best 20-day rallies ever, with previous best rallies seeing strong returns 6 and 12 months later.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/8-blog-chart.png?ssl=1))**\n\n&gt; 9.) As scary as it was on the way down, stocks have come roaring back, gaining more than 35% from the March 23 lows. This would classify as the greatest bear market bounce ever, which opens the question: is this more than a bear market bounce and instead the start of a new bull market?\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/9-blog-chart.png?ssl=1))**\n\n&gt; 10.) The number of COVID-19 tests in the US nearly doubled in May versus what was seen in April. Additionally, fewer and fewer tests are coming back positive. Testing is one of the key ways we will beat this and this is a step in the right direction. We’ve also seen new monthly lows in people on ventilators, in the ICU, and in hospitals.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/9-blog-chart.png?ssl=1))**\n\n&gt; Hard to believe, but there are still 7 months left in 2020. It hasn’t been easy for any of us, and we continue to keep everyone impacted by this pandemic in mind, but we continue to see the glass as half full. The dual benefit of record monetary and fiscal policy should help create a bridge to help those most impacted, while the economy can slowly come back online later this year.\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending June 5th, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=p1HAZbHiMUI))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 6.7.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n*(VIDEO NOT YET POSTED!)*\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$ADBE** \n&gt; * **$UNFI** \n&gt; * **$CHWY** \n&gt; * **$TIF** \n&gt; * **$LULU** \n&gt; * **$COUP** \n&gt; * **$SFIX** \n&gt; * **$LOVE** \n&gt; * **$NEPT** \n&gt; * **$GHM** \n&gt; * **$REVG** \n&gt; * **$GME** \n&gt; * **$HDS** \n&gt; * **$FIVE** \n&gt; * **$SIG** \n&gt; * **$CASY** \n&gt; * **$CVGW** \n&gt; * **$AMC** \n&gt; * **$FCEL** \n&gt; * **$QTNT** \n&gt; * **$PLCE** \n&gt; * **$CHS** \n&gt; * **$THO** \n&gt; * **$GCO** \n&gt; * **$BF.B** \n&gt; * **$LMNR** \n&gt; * **$WSG** \n&gt; * **$PRTY** \n&gt; * **$GES** \n&gt; * **$BBCP** \n&gt; * **$CONN** \n&gt; * **$HEXO** \n&gt; * **$PHR** \n&gt; * **$PVH** \n&gt; * **$RRGB** \n&gt; * **$PLAY** \n&gt; * **$TNP** \n&gt; * **$JW.A** \n&gt; * **$SB** \n&gt; * **$GSM** \n&gt; * **$SRT**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/PQzyXLa.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/bgPdMCr.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 6.8.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/d2EW1kr.png))\n\n&gt; # ***Monday 6.8.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/uxSiJJr.png))\n\n*****\n\n&gt; # ***Tuesday 6.9.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/3SIjcG7.png))\n\n&gt; # ***Tuesday 6.9.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/cRBrPlt.png))\n\n*****\n\n&gt; # ***Wednesday 6.10.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/DaheXAm.png))\n\n&gt; # ***Wednesday 6.10.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/9mcHxTl.png))\n\n*****\n\n&gt; # ***Thursday 6.11.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/i8SNjWM.png))\n\n&gt; # ***Thursday 6.11.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/9xcBZPK.png))\n\n*****\n\n&gt; # ***Friday 6.12.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n&gt; # ***Friday 6.12.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# Adobe Inc. $392.90\n&gt; **Adobe Inc. (ADBE)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, June 11, 2020. The consensus earnings estimate is $2.33 per share on revenue of $3.17 billion and the Earnings Whisper ® number is $2.39 per share. Investor sentiment going into the company's earnings release has 79% expecting an earnings beat The company's guidance was for earnings of approximately $2.35 per share. Consensus estimates are for year-over-year earnings growth of 26.63% with revenue increasing by 15.51%. Short interest has increased by 3.0% since the company's last earnings release while the stock has drifted higher by 25.6% from its open following the earnings release to be 23.1% above its 200 day moving average of $319.27. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, May 19, 2020 there was some notable buying of 3,194 contracts of the $410.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 4.8% move on earnings and the stock has averaged a 6.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ADBE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# United Natural Foods, Inc. $20.78\n&gt; **United Natural Foods, Inc. (UNFI)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, June 10, 2020. The consensus earnings estimate is $1.41 per share on revenue of $6.67 billion and the Earnings Whisper ® number is $1.42 per share. Investor sentiment going into the company's earnings release has 78% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 131.15% with revenue increasing by 11.86%. Short interest has decreased by 16.0% since the company's last earnings release while the stock has drifted higher by 202.5% from its open following the earnings release to be 96.1% above its 200 day moving average of $10.60. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, June 2, 2020 there was some notable buying of 2,226 contracts of the $22.50 call expiring on Friday, June 19, 2020. Option traders are pricing in a 17.7% move on earnings and the stock has averaged a 15.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=UNFI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Chewy, Inc. $48.44\n&gt; **Chewy, Inc. (CHWY)** is confirmed to report earnings at approximately 4:10 PM ET on Tuesday, June 9, 2020. The consensus estimate is for a loss of $0.11 per share on revenue of $1.55 billion and the Earnings Whisper ® number is ($0.09) per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 37.50% with revenue increasing by 39.78%. Short interest has increased by 37.9% since the company's last earnings release while the stock has drifted higher by 37.5% from its open following the earnings release to be 56.4% above its 200 day moving average of $30.97. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 5.8% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CHWY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Tiffany &amp; Co. $121.99\n&gt; **Tiffany &amp; Co. (TIF)** is confirmed to report earnings at approximately 6:40 AM ET on Tuesday, June 9, 2020. The consensus earnings estimate is $0.21 per share on revenue of $646.40 million. Investor sentiment going into the company's earnings release has 6% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 79.61% with revenue decreasing by 35.56%. Short interest has decreased by 26.5% since the company's last earnings release while the stock has drifted lower by 4.7% from its open following the earnings release to be 1.9% above its 200 day moving average of $119.75. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, June 5, 2020 there was some notable buying of 9,022 contracts of the $110.00 put expiring on Friday, August 21, 2020. Option traders are pricing in a 6.2% move on earnings and the stock has averaged a 3.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TIF&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# lululemon athletica inc. $319.78\n&gt; **lululemon athletica inc. (LULU)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, June 11, 2020. The consensus earnings estimate is $0.28 per share on revenue of $724.78 million and the Earnings Whisper ® number is $0.30 per share. Investor sentiment going into the company's earnings release has 47% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 62.16% with revenue decreasing by 7.35%. Short interest has increased by 53.3% since the company's last earnings release while the stock has drifted higher by 66.1% from its open following the earnings release to be 46.8% above its 200 day moving average of $217.77. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, June 4, 2020 there was some notable buying of 1,385 contracts of the $350.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 9.4% move on earnings and the stock has averaged a 7.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LULU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Coupa Software $216.94\n&gt; **Coupa Software (COUP)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, June 8, 2020. The consensus earnings estimate is $0.07 per share on revenue of $111.83 million and the Earnings Whisper ® number is $0.10 per share. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat The company's guidance was for earnings of $0.06 to $0.08 per share on revenue of $112.00 million to $112.00 million. Consensus estimates are for year-over-year earnings growth of 450.00% with revenue increasing by 37.48%. Short interest has increased by 7.9% since the company's last earnings release while the stock has drifted higher by 94.9% from its open following the earnings release to be 40.3% above its 200 day moving average of $154.59. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, June 4, 2020 there was some notable buying of 1,085 contracts of the $220.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 12.7% move on earnings and the stock has averaged a 9.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=COUP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Stitch Fix, Inc. $24.96\n&gt; **Stitch Fix, Inc. (SFIX)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, June 8, 2020. The consensus estimate is for a loss of $0.17 per share on revenue of $401.40 million and the Earnings Whisper ® number is ($0.13) per share. Investor sentiment going into the company's earnings release has 53% expecting an earnings beat The company's guidance was for revenue of $465.00 million to $475.00 million. Consensus estimates are for earnings to decline year-over-year by 342.86% with revenue decreasing by 1.83%. Short interest has increased by 4.0% since the company's last earnings release while the stock has drifted higher by 66.4% from its open following the earnings release to be 19.1% above its 200 day moving average of $20.96. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, June 2, 2020 there was some notable buying of 5,092 contracts of the $25.00 call expiring on Friday, June 12, 2020. Option traders are pricing in a 21.2% move on earnings and the stock has averaged a 13.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SFIX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Lovesac Company $17.84\n&gt; **Lovesac Company (LOVE)** is confirmed to report earnings at approximately 7:00 AM ET on Tuesday, June 9, 2020. The consensus estimate is for a loss of $0.69 per share on revenue of $48.22 million and the Earnings Whisper ® number is ($0.65) per share. Investor sentiment going into the company's earnings release has 52% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 2.99% with revenue increasing by 17.73%. Short interest has increased by 20.5% since the company's last earnings release while the stock has drifted higher by 109.9% from its open following the earnings release to be 31.5% above its 200 day moving average of $13.57. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 20.1% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LOVE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Neptune Wellness Solutions Inc. $3.14\n&gt; **Neptune Wellness Solutions Inc. (NEPT)** is confirmed to report earnings after the market closes on Wednesday, June 10, 2020. The consensus estimate is for a loss of $0.08 per share on revenue of $6.32 million and the Earnings Whisper ® number is ($0.10) per share. Investor sentiment going into the company's earnings release has 63% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 100.00% with revenue increasing by 48.36%. Short interest has decreased by 4.7% since the company's last earnings release while the stock has drifted higher by 56.2% from its open following the earnings release to be 6.4% above its 200 day moving average of $2.95. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, May 19, 2020 there was some notable buying of 2,960 contracts of the $3.00 call expiring on Friday, June 19, 2020. The stock has averaged a 8.1% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NEPT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Graham Corporation $15.58\n&gt; **Graham Corporation (GHM)** is confirmed to report earnings at approximately 6:30 AM ET on Wednesday, June 10, 2020. The consensus earnings estimate is $0.12 per share on revenue of $32.00 million. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 50.00% with revenue increasing by 35.36%. Short interest has increased by 89.8% since the company's last earnings release while the stock has drifted lower by 21.7% from its open following the earnings release. Overall earnings estimates have been revised lower since the company's last earnings release.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=GHM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/StockMarket.",
        "subreddit": "StockMarket",
        "title": "Wall Street Week Ahead for the trading week beginning June 8th, 2020",
        "url": "https://www.reddit.com/r/StockMarket/comments/gxtpfc/wall_street_week_ahead_for_the_trading_week/",
        "created": 1591488550.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1591460250,
        "id": "gxtut4",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "Good Saturday afternoon to all of you here on r/smallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning June 8th, 2020.\n\n# **Look for the S&amp;P 500 to turn positive for the year with a boost from the Fed in the week ahead  - [(Source)](https://www.cnbc.com/2020/06/05/look-for-the-sp-500-to-turn-positive-for-the-year-with-a-boost-from-the-fed-in-the-week-ahead.html)**\n*****\n&gt; Federal Reserve Chairman Jerome Powell is expected to reassure markets next week the central bank will do whatever it takes to help the economy heal. That should be enough to keep investors moving into stocks that benefit from an economic rebound and push the S&amp;P 500 into the green for 2020.\n*****\n&gt; The Fed’s two-day meeting is the big event for markets in the coming week. There are a few economic reports, including inflation data, the consumer price index Wednesday and producer prices Thursday. Weekly jobless claims will be important Thursday to see if there’s a drop in continuing clams, after May’s employment report showed a surprising record gain of 2.5 million jobs.\n*****\n&gt; The reopening trade was in full swing in the past week, especially Friday when stocks surged on the jobs report, which was expected to show a loss of 8.3 million jobs. The Nasdaq broke above its record high set on Feb. 19, and the S&amp;P 500 was just 1.1% away from turning positive for 2020.\n*****\n&gt; Even before the jobs report, investors were loading up on financials, industrials, transports and small caps, which were up more than 8% for the week and 18.4% in the past month. S&amp;P financials were 12.1% higher on the week, S&amp;P industrials were up 10.5, and the NYSE airline index jumped more than 35.4.%.\n*****\n&gt; “I think next week is dominated by the reopening and it will be for another month,” said James Paulsen, chief investment strategist at Leuthold Group. “With cyclicals outperforming, small [caps] outperforming, credit spreads coming in and then the bond yields going up, everybody — all facets of the financial markets — are sort of suggesting the same outcome.”\n*****\n&gt; The S&amp;P 500 ended the week at 3,193, a gain of 4.9%, and now traders are watching to see if it can scale the psychological 3,200 level. The Dow closed Friday at 27,110, up 6.8% for the week, and the Nasdaq Composite was up 3.4%, at 9,814 after reaching an intraday record high of 9,845 Friday.\n*****\n&gt; Analysts say the market will likely look past the protests that broke out in cities across the U.S. after the death of George Floyd in Minneapolis. Four policemen were charged with murder in his death. Looters joined the protests, some of which turned violent, but they quieted down towards the end of the week.\n*****\n&gt; Stocks were higher for a third week in a row, but a change this past week has been the abrupt lurch higher in Treasury yields. The 10-year rose to a high of 0.95% Friday, a quarter-point move in just three sessions. The move was already underway but got a lift Wednesday when ADP jobs data was not nearly as bad as expected. Yields ripped even higher after the May employment report showed the unemployment rate actually fell to 13.3%, instead of climbing to 20%, as expected by economists.\n*****\n&gt; Bond strategists said the Treasury market was now acknowledging the potential for a recovery, but not in the exuberant way the stock market has been. Since March 23, the S&amp;P 500 has risen more than 45%, but it took the 10-year Treasury until this week to get back the yield level it was at when stocks bottomed.\n*****\n&gt; Paulsen said he believes a new bull market has been launched, but there could be pullbacks and some headwinds for the market coming up.\n*****\n&gt; “When GDP is minus 30%, other issues don’t matter. There’s just one issue. But as the economy reopens again, the trade battles will matter again, presidential politics will matter again,” said Paulsen, adding the budget deficit could also matter. “I think we’ll get removed from a sole focus. That isn’t quite there but I think it’s coming.”\n*****\n&gt; # Fed ahead\n&gt; The Fed begins its two-day meeting Tuesday, and will release its statement Wednesday afternoon, followed by a video briefing by Powell.\n*****\n&gt; “Whey would the Fed want to disrupt this with anything?” Paulsen said. “They’re still going to support the economy. They’re going to stay away from negative rates or yield curve management. They’re not going to do anything to scare the markets. They might certainly reassure people that they are still ready to provide support.”\n*****\n&gt; Ethan Harris, head of global economics at Bank of America, said the Fed may clarify where it stands on some of the extraordinary moves it has taken since it cut rates to zero. The Fed has been supporting the markets with asset purchases and multiple programs for commercial paper, corporate bonds, and municipal bonds, for example.\n*****\n&gt; “We think right now they’re just trying to get this Main Street lending program to work. The question is are they going to do more things around what they do in terms of forward guidance and next steps of macro easing,” Harris said.\n*****\n&gt; There has been speculation that the Fed would do some type of so-called yield curve control, a program to keep interest rates capped at certain levels. “I think it’s too early for that,” said Harris. He said the Fed would be guaranteeing low rates for a long period of time if it does yield curve control.\n*****\n&gt; “Yield curve control is basically open-ended quantitative easing,” he said. The Fed is currently buying Treasurys but if it wanted to stop yields from rising too much as the economy improves, it could make targeted purchases.\n*****\n&gt; Barclays chief U.S. economist Michael Gapen said it’s possible the Fed could announce the yield curve control. “We’ve said they could implement yield curve control out to three years,” he said. “In my mind that matches the length of the horizon of the economic projections.”\n*****\n&gt; Powell has said the economy needs more fiscal help, and he could reiterate those comments Wednesday. President Donald Trump on Friday said he backs more stimulus. So far, the Democrats have put out a marker with their wish list for further spending, but there have been no negotiations.\n*****\n&gt; There was concern the strong jobs report could make it harder to get buy in for another big spending package. But some economists say the recovery needs a boost and states need funding to fill the holes in their budgets from coronavirus-related spending and a lack of tax receipts.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/7klaXQm.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/PKTBzT2.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/a5JkAB6.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/M2x4Qoq.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/qtJYfXN.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/bjiJWjV.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/UAi19KJ.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/GQm4ruO.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/PQzyXLa.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/uV1U7FN.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/wm2XJND.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/yarkiMO.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/hFblu2G.png))**\n\n*****\n\n# S&amp;P 500 Stocks Outpacing Analyst Price Targets\n\n&gt; This morning's jobs report shocked the financial world -- most notably the economists whose job it is to provide estimates. The consensus estimate among economists for May nonfarm payrolls was projecting a loss of more than 7 million jobs. The actual number that was reported did not just show a smaller than expected job loss, but it actually showed a gain in jobs of more than 2.5 million.\n\n&gt; We're seeing a similar situation play out in the equity analyst community. With the S&amp;P 500 now up 40%+ since its low less than three months ago, the average stock in the index is now trading above its consensus analyst price target that looks 12 months out. Analysts have simply not been able to catch up to the rapid rise we've seen for equity prices.\n\n&gt; It's extremely rare to see share prices move above consensus analyst price targets. We don't have the historical daily data on this, but anecdotally we can't remember a time when the spread has been this wide. As shown below, at the end of 2019 when the S&amp;P finished a massive rally, equity prices were 5.5% below the consensus price target. That was seen as a very tight spread prior to what we're seeing now. At the lows in March, the average share price had dropped all the way to $92.50 compared to an average consensus price target of $143.20. That projected a gain of 54.9% at the time!\n\n&gt; Since March 23rd, the average share price has risen from $92.50 up to $138.40, while the average analyst price target has fallen from $143.20 to $136. Current price targets no longer project a gain for the average S&amp;P 500 stock, but rather a 1.7% drop.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/avgpricetarget.png))**\n\n&gt; # Nasdaq's Historical Run\n\n&gt; At its highs earlier this morning, the Nasdaq Composite was within 2% of its record high from earlier in the year. Besides the steep V-shape of the Nasdaq's pattern over the last four months, the other aspect of the chart that stands out is just how steep the 50-day moving average is trending lately.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060420-Nasdaq-50DMAa.png))**\n\n&gt; To illustrate just how steep the Nasdaq's 50-DMA has become, the chart below shows the daily percentage change of the 50-day going back to 1971. Currently, the Nasdaq 50-DMA is rising at an average of over 0.5% per day. That's an incredible slope and a level that has been exceeded only a handful of times in the Nasdaq's 50-year history.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060420-Nasdaq-Composite1.png))**\n\n*****\n\n# Big Gains From Smaller Tech\n\n&gt; It's still difficult to fathom the moves in the US equity market over the last four months. The fact that the Nasdaq and more specifically the Technology sector aren't far from record highs is definitely something no one was expecting two months ago. There's an old market saying that equities take the stairs up and the elevator down, but in the latest market cycle, the elevator up was almost as fast as the way down!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060320-Nasdaq.png))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060320-Technology-Sector.png))**\n\n&gt; If you've been following the markets, all you've likely heard up until recently is that large-cap tech, and more specifically, Microsoft (MSFT), Apple (AAPL), Amazon (AMZN), Alphabet (GOOGL), and Facebook (FB), are single-handedly driving the market higher. The reality is not nearly as clear-cut. Given their market caps, the \"Big 5\" (as they're often referred to) have done a lot of heavy lifting, but in terms of performance, they're hardly the only game in town.\n\n&gt; The table below lists Technology sector stocks in the Russell 3000 with market caps of more than $1 billion that are outperforming all of the 'big 5' tech stocks on a YTD basis. Actually, since Amazon is doing so well relative to the rest of the \"big 5\" these are all stocks that are outperforming Amazon. If we looked for stocks that were doing better than the average return of the \"big 5\" the list would be a lot, lot longer (+16.4%).\n\n&gt; Looking through the list of names below, the two top-performing names are Zscaler (ZS) and Twilio (TWLO), which have both more than doubled. Behind these two, DocuSign (DOCU) and Sprout Social (SPT) are both knocking on the door of triple-digits. All 28 of the names listed have market caps of $1 billion, but the average market cap is just over $21 billion, while Nvidia (NVDA) is the largest company on the list with a market cap of $216 billion. For the most part, these aren't names that have been driving the indices, but anyone holding these stocks in their portfolio probably doesn't care!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060320-Tech-Stocks.png))**\n\n*****\n\n# Best 50-Day Rally Ever\n\n&gt; In many ways, what we’ve seen so far in 2020 has been both record-breaking and devastating. From the S&amp;P 500 Index peak on February 19 to the bear market lows March 23, stocks lost 33.9%. Now, 50 trading days later, stocks have gained 39.6%, for the largest 50-day rally since the S&amp;P 500 moved to 500 stocks in 1957.\n\n&gt; “There are no rollercoasters that can replicate what stocks have done so far in 2020,” exclaimed LPL Financial Senior Market Strategist Ryan Detrick. “Here’s the catch though: Big 50-day rallies in the past have taken place near the start of new bull markets, and the returns going out a year were quite bullish.”\n\n&gt; As shown in the LPL Chart of the Day, the 39.6% gain in 50 days was the greatest 50-day rally ever, besting the previous best in October 1982. What’s important to note here is that many of these rallies took place coming off major market lows, and delivered quite strong returns going out 6 to 12 months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/06/best-fifty-days.png?ssl=1))**\n\n&gt; Although we have near-term worries given this historic run, as some sentiment indicators such as put/call ratios are showing some froth, from a bigger picture perspective, this strong 50-day rally offers a reason to think stock prices may be even higher this time next year.\n\n*****\n\n# 2020 In Charts\n\n&gt; 2020 is only five months old, but in many ways it is one of the most historic years we’ve ever seen. “2020 went from moving along nicely, to seeing the worst recession in a generation and the fastest bear market ever,” explained LPL Financial Senior Market Strategist Ryan Detrick. “Now stocks are in the midst of one of the best bull runs ever, even though the economy remains extremely weak, thanks to record stimulus and hopes over a vaccine.”\n&gt; \nTo best sum it all up, here are 10 charts that tell the picture of 2020 so far.\n\n&gt; 1.) The 2010s were the first decade in history to go all 10 years without a recession, which of course ended just months into the new decade, as the economy stopped. Stocks gained 13.5% on an annual basis last decade, surprisingly, only the third-best decade over the past four.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/06/1-blog-chart.png?ssl=1))**\n\n&gt; 2.) This is an election year, and the S&amp;P 500 Index hasn’t been lower when a President is up for reelection since FDR in 1940. Although this seemed nearly impossible at the March lows, it is looking like this incredible streak could have a chance in 2020.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/2-blog-chart.png?ssl=1))**\n\n&gt; 3.) One of the first signs something could go wrong in 2020 was stocks fell in January. Historically, this has meant potential trouble for the final 11 months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/3-blog-chart.png?ssl=1))**\n\n&gt; 4.) As fears over COVID-19 gripped the world, the Dow Jones Industrial Average had its fastest bear market ever, in only 19 days. To put this in perspective, this was the fastest bear market in the 124-year history of the Dow.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/4-blog-chart.png?ssl=1))**\n\n&gt; 5.) Mark Twain said “History doesn’t repeat itself, but it often rhymes”. Looking at history, every 50 years there has been a terrible pandemic and stocks fell more than 30%. We don’t know if the ultimate lows are in this time, but so far, history is rhyming.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/blog-chart-5.png?ssl=1))**\n\n&gt; 6.) More than 20 million people in the US lost their jobs in April, while the unemployment rate soared to near 15%, the highest since the Great Depression. Record drops in manufacturing, industrial production, retail sales, and consumer spending have all taken place in the past two months as well.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/6-blog-chart.png?ssl=1))**\n\n&gt; 7.) A recession is here, ending the streak of 128 months in a row without one. What is unique about the previous expansion was nominal gross domestic product (GDP) grew only 50%, about the average growth seen during the previous expansions, but this expansion was nearly twice as long as the average expansion (10 years versus 5 years).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/7-blog-chart.png?ssl=1))**\n\n&gt; 8.) The bounce off of the March 23 S&amp;P 500 lows has been historic in many ways. In fact, it was one of the best 20-day rallies ever, with previous best rallies seeing strong returns 6 and 12 months later.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/8-blog-chart.png?ssl=1))**\n\n&gt; 9.) As scary as it was on the way down, stocks have come roaring back, gaining more than 35% from the March 23 lows. This would classify as the greatest bear market bounce ever, which opens the question: is this more than a bear market bounce and instead the start of a new bull market?\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/9-blog-chart.png?ssl=1))**\n\n&gt; 10.) The number of COVID-19 tests in the US nearly doubled in May versus what was seen in April. Additionally, fewer and fewer tests are coming back positive. Testing is one of the key ways we will beat this and this is a step in the right direction. We’ve also seen new monthly lows in people on ventilators, in the ICU, and in hospitals.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/9-blog-chart.png?ssl=1))**\n\n&gt; Hard to believe, but there are still 7 months left in 2020. It hasn’t been easy for any of us, and we continue to keep everyone impacted by this pandemic in mind, but we continue to see the glass as half full. The dual benefit of record monetary and fiscal policy should help create a bridge to help those most impacted, while the economy can slowly come back online later this year.\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$ADBE** \n&gt; * **$UNFI** \n&gt; * **$CHWY** \n&gt; * **$TIF** \n&gt; * **$LULU** \n&gt; * **$COUP** \n&gt; * **$SFIX** \n&gt; * **$LOVE** \n&gt; * **$NEPT** \n&gt; * **$GHM** \n&gt; * **$REVG** \n&gt; * **$GME** \n&gt; * **$HDS** \n&gt; * **$FIVE** \n&gt; * **$SIG** \n&gt; * **$CASY** \n&gt; * **$CVGW** \n&gt; * **$AMC** \n&gt; * **$FCEL** \n&gt; * **$QTNT** \n&gt; * **$PLCE** \n&gt; * **$CHS** \n&gt; * **$THO** \n&gt; * **$GCO** \n&gt; * **$BF.B** \n&gt; * **$LMNR** \n&gt; * **$WSG** \n&gt; * **$PRTY** \n&gt; * **$GES** \n&gt; * **$BBCP** \n&gt; * **$CONN** \n&gt; * **$HEXO** \n&gt; * **$PHR** \n&gt; * **$PVH** \n&gt; * **$RRGB** \n&gt; * **$PLAY** \n&gt; * **$TNP** \n&gt; * **$JW.A** \n&gt; * **$SB** \n&gt; * **$GSM** \n&gt; * **$SRT**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/PQzyXLa.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/bgPdMCr.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 6.8.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/d2EW1kr.png))\n\n&gt; # ***Monday 6.8.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/uxSiJJr.png))\n\n*****\n\n&gt; # ***Tuesday 6.9.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/3SIjcG7.png))\n\n&gt; # ***Tuesday 6.9.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/cRBrPlt.png))\n\n*****\n\n&gt; # ***Wednesday 6.10.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/DaheXAm.png))\n\n&gt; # ***Wednesday 6.10.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/9mcHxTl.png))\n\n*****\n\n&gt; # ***Thursday 6.11.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/i8SNjWM.png))\n\n&gt; # ***Thursday 6.11.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/9xcBZPK.png))\n\n*****\n\n&gt; # ***Friday 6.12.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n&gt; # ***Friday 6.12.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# Adobe Inc. $392.90\n&gt; **Adobe Inc. (ADBE)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, June 11, 2020. The consensus earnings estimate is $2.33 per share on revenue of $3.17 billion and the Earnings Whisper ® number is $2.39 per share. Investor sentiment going into the company's earnings release has 79% expecting an earnings beat The company's guidance was for earnings of approximately $2.35 per share. Consensus estimates are for year-over-year earnings growth of 26.63% with revenue increasing by 15.51%. Short interest has increased by 3.0% since the company's last earnings release while the stock has drifted higher by 25.6% from its open following the earnings release to be 23.1% above its 200 day moving average of $319.27. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, May 19, 2020 there was some notable buying of 3,194 contracts of the $410.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 4.8% move on earnings and the stock has averaged a 6.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ADBE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# United Natural Foods, Inc. $20.78\n&gt; **United Natural Foods, Inc. (UNFI)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, June 10, 2020. The consensus earnings estimate is $1.41 per share on revenue of $6.67 billion and the Earnings Whisper ® number is $1.42 per share. Investor sentiment going into the company's earnings release has 78% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 131.15% with revenue increasing by 11.86%. Short interest has decreased by 16.0% since the company's last earnings release while the stock has drifted higher by 202.5% from its open following the earnings release to be 96.1% above its 200 day moving average of $10.60. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, June 2, 2020 there was some notable buying of 2,226 contracts of the $22.50 call expiring on Friday, June 19, 2020. Option traders are pricing in a 17.7% move on earnings and the stock has averaged a 15.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=UNFI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Chewy, Inc. $48.44\n&gt; **Chewy, Inc. (CHWY)** is confirmed to report earnings at approximately 4:10 PM ET on Tuesday, June 9, 2020. The consensus estimate is for a loss of $0.11 per share on revenue of $1.55 billion and the Earnings Whisper ® number is ($0.09) per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 37.50% with revenue increasing by 39.78%. Short interest has increased by 37.9% since the company's last earnings release while the stock has drifted higher by 37.5% from its open following the earnings release to be 56.4% above its 200 day moving average of $30.97. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 5.8% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CHWY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Tiffany &amp; Co. $121.99\n&gt; **Tiffany &amp; Co. (TIF)** is confirmed to report earnings at approximately 6:40 AM ET on Tuesday, June 9, 2020. The consensus earnings estimate is $0.21 per share on revenue of $646.40 million. Investor sentiment going into the company's earnings release has 6% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 79.61% with revenue decreasing by 35.56%. Short interest has decreased by 26.5% since the company's last earnings release while the stock has drifted lower by 4.7% from its open following the earnings release to be 1.9% above its 200 day moving average of $119.75. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, June 5, 2020 there was some notable buying of 9,022 contracts of the $110.00 put expiring on Friday, August 21, 2020. Option traders are pricing in a 6.2% move on earnings and the stock has averaged a 3.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TIF&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# lululemon athletica inc. $319.78\n&gt; **lululemon athletica inc. (LULU)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, June 11, 2020. The consensus earnings estimate is $0.28 per share on revenue of $724.78 million and the Earnings Whisper ® number is $0.30 per share. Investor sentiment going into the company's earnings release has 47% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 62.16% with revenue decreasing by 7.35%. Short interest has increased by 53.3% since the company's last earnings release while the stock has drifted higher by 66.1% from its open following the earnings release to be 46.8% above its 200 day moving average of $217.77. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, June 4, 2020 there was some notable buying of 1,385 contracts of the $350.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 9.4% move on earnings and the stock has averaged a 7.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LULU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Coupa Software $216.94\n&gt; **Coupa Software (COUP)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, June 8, 2020. The consensus earnings estimate is $0.07 per share on revenue of $111.83 million and the Earnings Whisper ® number is $0.10 per share. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat The company's guidance was for earnings of $0.06 to $0.08 per share on revenue of $112.00 million to $112.00 million. Consensus estimates are for year-over-year earnings growth of 450.00% with revenue increasing by 37.48%. Short interest has increased by 7.9% since the company's last earnings release while the stock has drifted higher by 94.9% from its open following the earnings release to be 40.3% above its 200 day moving average of $154.59. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, June 4, 2020 there was some notable buying of 1,085 contracts of the $220.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 12.7% move on earnings and the stock has averaged a 9.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=COUP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Stitch Fix, Inc. $24.96\n&gt; **Stitch Fix, Inc. (SFIX)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, June 8, 2020. The consensus estimate is for a loss of $0.17 per share on revenue of $401.40 million and the Earnings Whisper ® number is ($0.13) per share. Investor sentiment going into the company's earnings release has 53% expecting an earnings beat The company's guidance was for revenue of $465.00 million to $475.00 million. Consensus estimates are for earnings to decline year-over-year by 342.86% with revenue decreasing by 1.83%. Short interest has increased by 4.0% since the company's last earnings release while the stock has drifted higher by 66.4% from its open following the earnings release to be 19.1% above its 200 day moving average of $20.96. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, June 2, 2020 there was some notable buying of 5,092 contracts of the $25.00 call expiring on Friday, June 12, 2020. Option traders are pricing in a 21.2% move on earnings and the stock has averaged a 13.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SFIX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Lovesac Company $17.84\n&gt; **Lovesac Company (LOVE)** is confirmed to report earnings at approximately 7:00 AM ET on Tuesday, June 9, 2020. The consensus estimate is for a loss of $0.69 per share on revenue of $48.22 million and the Earnings Whisper ® number is ($0.65) per share. Investor sentiment going into the company's earnings release has 52% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 2.99% with revenue increasing by 17.73%. Short interest has increased by 20.5% since the company's last earnings release while the stock has drifted higher by 109.9% from its open following the earnings release to be 31.5% above its 200 day moving average of $13.57. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 20.1% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LOVE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Neptune Wellness Solutions Inc. $3.14\n&gt; **Neptune Wellness Solutions Inc. (NEPT)** is confirmed to report earnings after the market closes on Wednesday, June 10, 2020. The consensus estimate is for a loss of $0.08 per share on revenue of $6.32 million and the Earnings Whisper ® number is ($0.10) per share. Investor sentiment going into the company's earnings release has 63% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 100.00% with revenue increasing by 48.36%. Short interest has decreased by 4.7% since the company's last earnings release while the stock has drifted higher by 56.2% from its open following the earnings release to be 6.4% above its 200 day moving average of $2.95. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, May 19, 2020 there was some notable buying of 2,960 contracts of the $3.00 call expiring on Friday, June 19, 2020. The stock has averaged a 8.1% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NEPT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Graham Corporation $15.58\n&gt; **Graham Corporation (GHM)** is confirmed to report earnings at approximately 6:30 AM ET on Wednesday, June 10, 2020. The consensus earnings estimate is $0.12 per share on revenue of $32.00 million. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 50.00% with revenue increasing by 35.36%. Short interest has increased by 89.8% since the company's last earnings release while the stock has drifted lower by 21.7% from its open following the earnings release. Overall earnings estimates have been revised lower since the company's last earnings release.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=GHM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/smallstreetbets.",
        "subreddit": "smallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning June 8th, 2020",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/gxtut4/wall_street_week_ahead_for_the_trading_week/",
        "created": 1591489050.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1591460055,
        "id": "gxtspc",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "Good Saturday afternoon to all of you here on r/stocks. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning June 8th, 2020.\n\n# **Look for the S&amp;P 500 to turn positive for the year with a boost from the Fed in the week ahead  - [(Source)](https://www.cnbc.com/2020/06/05/look-for-the-sp-500-to-turn-positive-for-the-year-with-a-boost-from-the-fed-in-the-week-ahead.html)**\n*****\n&gt; Federal Reserve Chairman Jerome Powell is expected to reassure markets next week the central bank will do whatever it takes to help the economy heal. That should be enough to keep investors moving into stocks that benefit from an economic rebound and push the S&amp;P 500 into the green for 2020.\n*****\n&gt; The Fed’s two-day meeting is the big event for markets in the coming week. There are a few economic reports, including inflation data, the consumer price index Wednesday and producer prices Thursday. Weekly jobless claims will be important Thursday to see if there’s a drop in continuing clams, after May’s employment report showed a surprising record gain of 2.5 million jobs.\n*****\n&gt; The reopening trade was in full swing in the past week, especially Friday when stocks surged on the jobs report, which was expected to show a loss of 8.3 million jobs. The Nasdaq broke above its record high set on Feb. 19, and the S&amp;P 500 was just 1.1% away from turning positive for 2020.\n*****\n&gt; Even before the jobs report, investors were loading up on financials, industrials, transports and small caps, which were up more than 8% for the week and 18.4% in the past month. S&amp;P financials were 12.1% higher on the week, S&amp;P industrials were up 10.5, and the NYSE airline index jumped more than 35.4.%.\n*****\n&gt; “I think next week is dominated by the reopening and it will be for another month,” said James Paulsen, chief investment strategist at Leuthold Group. “With cyclicals outperforming, small [caps] outperforming, credit spreads coming in and then the bond yields going up, everybody — all facets of the financial markets — are sort of suggesting the same outcome.”\n*****\n&gt; The S&amp;P 500 ended the week at 3,193, a gain of 4.9%, and now traders are watching to see if it can scale the psychological 3,200 level. The Dow closed Friday at 27,110, up 6.8% for the week, and the Nasdaq Composite was up 3.4%, at 9,814 after reaching an intraday record high of 9,845 Friday.\n*****\n&gt; Analysts say the market will likely look past the protests that broke out in cities across the U.S. after the death of George Floyd in Minneapolis. Four policemen were charged with murder in his death. Looters joined the protests, some of which turned violent, but they quieted down towards the end of the week.\n*****\n&gt; Stocks were higher for a third week in a row, but a change this past week has been the abrupt lurch higher in Treasury yields. The 10-year rose to a high of 0.95% Friday, a quarter-point move in just three sessions. The move was already underway but got a lift Wednesday when ADP jobs data was not nearly as bad as expected. Yields ripped even higher after the May employment report showed the unemployment rate actually fell to 13.3%, instead of climbing to 20%, as expected by economists.\n*****\n&gt; Bond strategists said the Treasury market was now acknowledging the potential for a recovery, but not in the exuberant way the stock market has been. Since March 23, the S&amp;P 500 has risen more than 45%, but it took the 10-year Treasury until this week to get back the yield level it was at when stocks bottomed.\n*****\n&gt; Paulsen said he believes a new bull market has been launched, but there could be pullbacks and some headwinds for the market coming up.\n*****\n&gt; “When GDP is minus 30%, other issues don’t matter. There’s just one issue. But as the economy reopens again, the trade battles will matter again, presidential politics will matter again,” said Paulsen, adding the budget deficit could also matter. “I think we’ll get removed from a sole focus. That isn’t quite there but I think it’s coming.”\n*****\n&gt; # Fed ahead\n&gt; The Fed begins its two-day meeting Tuesday, and will release its statement Wednesday afternoon, followed by a video briefing by Powell.\n*****\n&gt; “Whey would the Fed want to disrupt this with anything?” Paulsen said. “They’re still going to support the economy. They’re going to stay away from negative rates or yield curve management. They’re not going to do anything to scare the markets. They might certainly reassure people that they are still ready to provide support.”\n*****\n&gt; Ethan Harris, head of global economics at Bank of America, said the Fed may clarify where it stands on some of the extraordinary moves it has taken since it cut rates to zero. The Fed has been supporting the markets with asset purchases and multiple programs for commercial paper, corporate bonds, and municipal bonds, for example.\n*****\n&gt; “We think right now they’re just trying to get this Main Street lending program to work. The question is are they going to do more things around what they do in terms of forward guidance and next steps of macro easing,” Harris said.\n*****\n&gt; There has been speculation that the Fed would do some type of so-called yield curve control, a program to keep interest rates capped at certain levels. “I think it’s too early for that,” said Harris. He said the Fed would be guaranteeing low rates for a long period of time if it does yield curve control.\n*****\n&gt; “Yield curve control is basically open-ended quantitative easing,” he said. The Fed is currently buying Treasurys but if it wanted to stop yields from rising too much as the economy improves, it could make targeted purchases.\n*****\n&gt; Barclays chief U.S. economist Michael Gapen said it’s possible the Fed could announce the yield curve control. “We’ve said they could implement yield curve control out to three years,” he said. “In my mind that matches the length of the horizon of the economic projections.”\n*****\n&gt; Powell has said the economy needs more fiscal help, and he could reiterate those comments Wednesday. President Donald Trump on Friday said he backs more stimulus. So far, the Democrats have put out a marker with their wish list for further spending, but there have been no negotiations.\n*****\n&gt; There was concern the strong jobs report could make it harder to get buy in for another big spending package. But some economists say the recovery needs a boost and states need funding to fill the holes in their budgets from coronavirus-related spending and a lack of tax receipts.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/7klaXQm.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/PKTBzT2.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/a5JkAB6.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/M2x4Qoq.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/qtJYfXN.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/bjiJWjV.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/UAi19KJ.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/GQm4ruO.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/PQzyXLa.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/uV1U7FN.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/wm2XJND.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/yarkiMO.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/hFblu2G.png))**\n\n*****\n\n# S&amp;P 500 Stocks Outpacing Analyst Price Targets\n\n&gt; This morning's jobs report shocked the financial world -- most notably the economists whose job it is to provide estimates. The consensus estimate among economists for May nonfarm payrolls was projecting a loss of more than 7 million jobs. The actual number that was reported did not just show a smaller than expected job loss, but it actually showed a gain in jobs of more than 2.5 million.\n\n&gt; We're seeing a similar situation play out in the equity analyst community. With the S&amp;P 500 now up 40%+ since its low less than three months ago, the average stock in the index is now trading above its consensus analyst price target that looks 12 months out. Analysts have simply not been able to catch up to the rapid rise we've seen for equity prices.\n\n&gt; It's extremely rare to see share prices move above consensus analyst price targets. We don't have the historical daily data on this, but anecdotally we can't remember a time when the spread has been this wide. As shown below, at the end of 2019 when the S&amp;P finished a massive rally, equity prices were 5.5% below the consensus price target. That was seen as a very tight spread prior to what we're seeing now. At the lows in March, the average share price had dropped all the way to $92.50 compared to an average consensus price target of $143.20. That projected a gain of 54.9% at the time!\n\n&gt; Since March 23rd, the average share price has risen from $92.50 up to $138.40, while the average analyst price target has fallen from $143.20 to $136. Current price targets no longer project a gain for the average S&amp;P 500 stock, but rather a 1.7% drop.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/avgpricetarget.png))**\n\n&gt; # Nasdaq's Historical Run\n\n&gt; At its highs earlier this morning, the Nasdaq Composite was within 2% of its record high from earlier in the year. Besides the steep V-shape of the Nasdaq's pattern over the last four months, the other aspect of the chart that stands out is just how steep the 50-day moving average is trending lately.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060420-Nasdaq-50DMAa.png))**\n\n&gt; To illustrate just how steep the Nasdaq's 50-DMA has become, the chart below shows the daily percentage change of the 50-day going back to 1971. Currently, the Nasdaq 50-DMA is rising at an average of over 0.5% per day. That's an incredible slope and a level that has been exceeded only a handful of times in the Nasdaq's 50-year history.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060420-Nasdaq-Composite1.png))**\n\n*****\n\n# Big Gains From Smaller Tech\n\n&gt; It's still difficult to fathom the moves in the US equity market over the last four months. The fact that the Nasdaq and more specifically the Technology sector aren't far from record highs is definitely something no one was expecting two months ago. There's an old market saying that equities take the stairs up and the elevator down, but in the latest market cycle, the elevator up was almost as fast as the way down!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060320-Nasdaq.png))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060320-Technology-Sector.png))**\n\n&gt; If you've been following the markets, all you've likely heard up until recently is that large-cap tech, and more specifically, Microsoft (MSFT), Apple (AAPL), Amazon (AMZN), Alphabet (GOOGL), and Facebook (FB), are single-handedly driving the market higher. The reality is not nearly as clear-cut. Given their market caps, the \"Big 5\" (as they're often referred to) have done a lot of heavy lifting, but in terms of performance, they're hardly the only game in town.\n\n&gt; The table below lists Technology sector stocks in the Russell 3000 with market caps of more than $1 billion that are outperforming all of the 'big 5' tech stocks on a YTD basis. Actually, since Amazon is doing so well relative to the rest of the \"big 5\" these are all stocks that are outperforming Amazon. If we looked for stocks that were doing better than the average return of the \"big 5\" the list would be a lot, lot longer (+16.4%).\n\n&gt; Looking through the list of names below, the two top-performing names are Zscaler (ZS) and Twilio (TWLO), which have both more than doubled. Behind these two, DocuSign (DOCU) and Sprout Social (SPT) are both knocking on the door of triple-digits. All 28 of the names listed have market caps of $1 billion, but the average market cap is just over $21 billion, while Nvidia (NVDA) is the largest company on the list with a market cap of $216 billion. For the most part, these aren't names that have been driving the indices, but anyone holding these stocks in their portfolio probably doesn't care!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060320-Tech-Stocks.png))**\n\n*****\n\n# Best 50-Day Rally Ever\n\n&gt; In many ways, what we’ve seen so far in 2020 has been both record-breaking and devastating. From the S&amp;P 500 Index peak on February 19 to the bear market lows March 23, stocks lost 33.9%. Now, 50 trading days later, stocks have gained 39.6%, for the largest 50-day rally since the S&amp;P 500 moved to 500 stocks in 1957.\n\n&gt; “There are no rollercoasters that can replicate what stocks have done so far in 2020,” exclaimed LPL Financial Senior Market Strategist Ryan Detrick. “Here’s the catch though: Big 50-day rallies in the past have taken place near the start of new bull markets, and the returns going out a year were quite bullish.”\n\n&gt; As shown in the LPL Chart of the Day, the 39.6% gain in 50 days was the greatest 50-day rally ever, besting the previous best in October 1982. What’s important to note here is that many of these rallies took place coming off major market lows, and delivered quite strong returns going out 6 to 12 months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/06/best-fifty-days.png?ssl=1))**\n\n&gt; Although we have near-term worries given this historic run, as some sentiment indicators such as put/call ratios are showing some froth, from a bigger picture perspective, this strong 50-day rally offers a reason to think stock prices may be even higher this time next year.\n\n*****\n\n# 2020 In Charts\n\n&gt; 2020 is only five months old, but in many ways it is one of the most historic years we’ve ever seen. “2020 went from moving along nicely, to seeing the worst recession in a generation and the fastest bear market ever,” explained LPL Financial Senior Market Strategist Ryan Detrick. “Now stocks are in the midst of one of the best bull runs ever, even though the economy remains extremely weak, thanks to record stimulus and hopes over a vaccine.”\n&gt; \nTo best sum it all up, here are 10 charts that tell the picture of 2020 so far.\n\n&gt; 1.) The 2010s were the first decade in history to go all 10 years without a recession, which of course ended just months into the new decade, as the economy stopped. Stocks gained 13.5% on an annual basis last decade, surprisingly, only the third-best decade over the past four.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/06/1-blog-chart.png?ssl=1))**\n\n&gt; 2.) This is an election year, and the S&amp;P 500 Index hasn’t been lower when a President is up for reelection since FDR in 1940. Although this seemed nearly impossible at the March lows, it is looking like this incredible streak could have a chance in 2020.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/2-blog-chart.png?ssl=1))**\n\n&gt; 3.) One of the first signs something could go wrong in 2020 was stocks fell in January. Historically, this has meant potential trouble for the final 11 months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/3-blog-chart.png?ssl=1))**\n\n&gt; 4.) As fears over COVID-19 gripped the world, the Dow Jones Industrial Average had its fastest bear market ever, in only 19 days. To put this in perspective, this was the fastest bear market in the 124-year history of the Dow.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/4-blog-chart.png?ssl=1))**\n\n&gt; 5.) Mark Twain said “History doesn’t repeat itself, but it often rhymes”. Looking at history, every 50 years there has been a terrible pandemic and stocks fell more than 30%. We don’t know if the ultimate lows are in this time, but so far, history is rhyming.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/blog-chart-5.png?ssl=1))**\n\n&gt; 6.) More than 20 million people in the US lost their jobs in April, while the unemployment rate soared to near 15%, the highest since the Great Depression. Record drops in manufacturing, industrial production, retail sales, and consumer spending have all taken place in the past two months as well.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/6-blog-chart.png?ssl=1))**\n\n&gt; 7.) A recession is here, ending the streak of 128 months in a row without one. What is unique about the previous expansion was nominal gross domestic product (GDP) grew only 50%, about the average growth seen during the previous expansions, but this expansion was nearly twice as long as the average expansion (10 years versus 5 years).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/7-blog-chart.png?ssl=1))**\n\n&gt; 8.) The bounce off of the March 23 S&amp;P 500 lows has been historic in many ways. In fact, it was one of the best 20-day rallies ever, with previous best rallies seeing strong returns 6 and 12 months later.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/8-blog-chart.png?ssl=1))**\n\n&gt; 9.) As scary as it was on the way down, stocks have come roaring back, gaining more than 35% from the March 23 lows. This would classify as the greatest bear market bounce ever, which opens the question: is this more than a bear market bounce and instead the start of a new bull market?\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/9-blog-chart.png?ssl=1))**\n\n&gt; 10.) The number of COVID-19 tests in the US nearly doubled in May versus what was seen in April. Additionally, fewer and fewer tests are coming back positive. Testing is one of the key ways we will beat this and this is a step in the right direction. We’ve also seen new monthly lows in people on ventilators, in the ICU, and in hospitals.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/9-blog-chart.png?ssl=1))**\n\n&gt; Hard to believe, but there are still 7 months left in 2020. It hasn’t been easy for any of us, and we continue to keep everyone impacted by this pandemic in mind, but we continue to see the glass as half full. The dual benefit of record monetary and fiscal policy should help create a bridge to help those most impacted, while the economy can slowly come back online later this year.\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$ADBE** \n&gt; * **$UNFI** \n&gt; * **$CHWY** \n&gt; * **$TIF** \n&gt; * **$LULU** \n&gt; * **$COUP** \n&gt; * **$SFIX** \n&gt; * **$LOVE** \n&gt; * **$NEPT** \n&gt; * **$GHM** \n&gt; * **$REVG** \n&gt; * **$GME** \n&gt; * **$HDS** \n&gt; * **$FIVE** \n&gt; * **$SIG** \n&gt; * **$CASY** \n&gt; * **$CVGW** \n&gt; * **$AMC** \n&gt; * **$FCEL** \n&gt; * **$QTNT** \n&gt; * **$PLCE** \n&gt; * **$CHS** \n&gt; * **$THO** \n&gt; * **$GCO** \n&gt; * **$BF.B** \n&gt; * **$LMNR** \n&gt; * **$WSG** \n&gt; * **$PRTY** \n&gt; * **$GES** \n&gt; * **$BBCP** \n&gt; * **$CONN** \n&gt; * **$HEXO** \n&gt; * **$PHR** \n&gt; * **$PVH** \n&gt; * **$RRGB** \n&gt; * **$PLAY** \n&gt; * **$TNP** \n&gt; * **$JW.A** \n&gt; * **$SB** \n&gt; * **$GSM** \n&gt; * **$SRT**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/PQzyXLa.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/bgPdMCr.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 6.8.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/d2EW1kr.png))\n\n&gt; # ***Monday 6.8.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/uxSiJJr.png))\n\n*****\n\n&gt; # ***Tuesday 6.9.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/3SIjcG7.png))\n\n&gt; # ***Tuesday 6.9.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/cRBrPlt.png))\n\n*****\n\n&gt; # ***Wednesday 6.10.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/DaheXAm.png))\n\n&gt; # ***Wednesday 6.10.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/9mcHxTl.png))\n\n*****\n\n&gt; # ***Thursday 6.11.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/i8SNjWM.png))\n\n&gt; # ***Thursday 6.11.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/9xcBZPK.png))\n\n*****\n\n&gt; # ***Friday 6.12.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n&gt; # ***Friday 6.12.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# Adobe Inc. $392.90\n&gt; **Adobe Inc. (ADBE)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, June 11, 2020. The consensus earnings estimate is $2.33 per share on revenue of $3.17 billion and the Earnings Whisper ® number is $2.39 per share. Investor sentiment going into the company's earnings release has 79% expecting an earnings beat The company's guidance was for earnings of approximately $2.35 per share. Consensus estimates are for year-over-year earnings growth of 26.63% with revenue increasing by 15.51%. Short interest has increased by 3.0% since the company's last earnings release while the stock has drifted higher by 25.6% from its open following the earnings release to be 23.1% above its 200 day moving average of $319.27. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, May 19, 2020 there was some notable buying of 3,194 contracts of the $410.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 4.8% move on earnings and the stock has averaged a 6.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ADBE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# United Natural Foods, Inc. $20.78\n&gt; **United Natural Foods, Inc. (UNFI)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, June 10, 2020. The consensus earnings estimate is $1.41 per share on revenue of $6.67 billion and the Earnings Whisper ® number is $1.42 per share. Investor sentiment going into the company's earnings release has 78% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 131.15% with revenue increasing by 11.86%. Short interest has decreased by 16.0% since the company's last earnings release while the stock has drifted higher by 202.5% from its open following the earnings release to be 96.1% above its 200 day moving average of $10.60. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, June 2, 2020 there was some notable buying of 2,226 contracts of the $22.50 call expiring on Friday, June 19, 2020. Option traders are pricing in a 17.7% move on earnings and the stock has averaged a 15.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=UNFI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Chewy, Inc. $48.44\n&gt; **Chewy, Inc. (CHWY)** is confirmed to report earnings at approximately 4:10 PM ET on Tuesday, June 9, 2020. The consensus estimate is for a loss of $0.11 per share on revenue of $1.55 billion and the Earnings Whisper ® number is ($0.09) per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 37.50% with revenue increasing by 39.78%. Short interest has increased by 37.9% since the company's last earnings release while the stock has drifted higher by 37.5% from its open following the earnings release to be 56.4% above its 200 day moving average of $30.97. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 5.8% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CHWY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Tiffany &amp; Co. $121.99\n&gt; **Tiffany &amp; Co. (TIF)** is confirmed to report earnings at approximately 6:40 AM ET on Tuesday, June 9, 2020. The consensus earnings estimate is $0.21 per share on revenue of $646.40 million. Investor sentiment going into the company's earnings release has 6% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 79.61% with revenue decreasing by 35.56%. Short interest has decreased by 26.5% since the company's last earnings release while the stock has drifted lower by 4.7% from its open following the earnings release to be 1.9% above its 200 day moving average of $119.75. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, June 5, 2020 there was some notable buying of 9,022 contracts of the $110.00 put expiring on Friday, August 21, 2020. Option traders are pricing in a 6.2% move on earnings and the stock has averaged a 3.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TIF&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# lululemon athletica inc. $319.78\n&gt; **lululemon athletica inc. (LULU)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, June 11, 2020. The consensus earnings estimate is $0.28 per share on revenue of $724.78 million and the Earnings Whisper ® number is $0.30 per share. Investor sentiment going into the company's earnings release has 47% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 62.16% with revenue decreasing by 7.35%. Short interest has increased by 53.3% since the company's last earnings release while the stock has drifted higher by 66.1% from its open following the earnings release to be 46.8% above its 200 day moving average of $217.77. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, June 4, 2020 there was some notable buying of 1,385 contracts of the $350.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 9.4% move on earnings and the stock has averaged a 7.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LULU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Coupa Software $216.94\n&gt; **Coupa Software (COUP)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, June 8, 2020. The consensus earnings estimate is $0.07 per share on revenue of $111.83 million and the Earnings Whisper ® number is $0.10 per share. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat The company's guidance was for earnings of $0.06 to $0.08 per share on revenue of $112.00 million to $112.00 million. Consensus estimates are for year-over-year earnings growth of 450.00% with revenue increasing by 37.48%. Short interest has increased by 7.9% since the company's last earnings release while the stock has drifted higher by 94.9% from its open following the earnings release to be 40.3% above its 200 day moving average of $154.59. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, June 4, 2020 there was some notable buying of 1,085 contracts of the $220.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 12.7% move on earnings and the stock has averaged a 9.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=COUP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Stitch Fix, Inc. $24.96\n&gt; **Stitch Fix, Inc. (SFIX)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, June 8, 2020. The consensus estimate is for a loss of $0.17 per share on revenue of $401.40 million and the Earnings Whisper ® number is ($0.13) per share. Investor sentiment going into the company's earnings release has 53% expecting an earnings beat The company's guidance was for revenue of $465.00 million to $475.00 million. Consensus estimates are for earnings to decline year-over-year by 342.86% with revenue decreasing by 1.83%. Short interest has increased by 4.0% since the company's last earnings release while the stock has drifted higher by 66.4% from its open following the earnings release to be 19.1% above its 200 day moving average of $20.96. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, June 2, 2020 there was some notable buying of 5,092 contracts of the $25.00 call expiring on Friday, June 12, 2020. Option traders are pricing in a 21.2% move on earnings and the stock has averaged a 13.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SFIX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Lovesac Company $17.84\n&gt; **Lovesac Company (LOVE)** is confirmed to report earnings at approximately 7:00 AM ET on Tuesday, June 9, 2020. The consensus estimate is for a loss of $0.69 per share on revenue of $48.22 million and the Earnings Whisper ® number is ($0.65) per share. Investor sentiment going into the company's earnings release has 52% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 2.99% with revenue increasing by 17.73%. Short interest has increased by 20.5% since the company's last earnings release while the stock has drifted higher by 109.9% from its open following the earnings release to be 31.5% above its 200 day moving average of $13.57. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 20.1% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LOVE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Neptune Wellness Solutions Inc. $3.14\n&gt; **Neptune Wellness Solutions Inc. (NEPT)** is confirmed to report earnings after the market closes on Wednesday, June 10, 2020. The consensus estimate is for a loss of $0.08 per share on revenue of $6.32 million and the Earnings Whisper ® number is ($0.10) per share. Investor sentiment going into the company's earnings release has 63% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 100.00% with revenue increasing by 48.36%. Short interest has decreased by 4.7% since the company's last earnings release while the stock has drifted higher by 56.2% from its open following the earnings release to be 6.4% above its 200 day moving average of $2.95. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, May 19, 2020 there was some notable buying of 2,960 contracts of the $3.00 call expiring on Friday, June 19, 2020. The stock has averaged a 8.1% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NEPT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Graham Corporation $15.58\n&gt; **Graham Corporation (GHM)** is confirmed to report earnings at approximately 6:30 AM ET on Wednesday, June 10, 2020. The consensus earnings estimate is $0.12 per share on revenue of $32.00 million. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 50.00% with revenue increasing by 35.36%. Short interest has increased by 89.8% since the company's last earnings release while the stock has drifted lower by 21.7% from its open following the earnings release. Overall earnings estimates have been revised lower since the company's last earnings release.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=GHM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/stocks.",
        "subreddit": "stocks",
        "title": "Wall Street Week Ahead for the trading week beginning June 8th, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/gxtspc/wall_street_week_ahead_for_the_trading_week/",
        "created": 1591488855.0
    },
    {
        "author": "Cicero1982",
        "created_utc": 1593315033,
        "id": "hh7iao",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Subscribe to This Brief and the daily 4:00 AM Pre Market Brief on [**The Twitter Link Here**](https://www.tradinganalysisresources.com/2020/05/free-references-and-resources.html?m=1) . Alerts in the tweets will direct you to the daily 4:00 AM Pre Market Brief in this sub.\n\nUpdated as of 6/27/2020 11:30 PM EST\n\n[**Next Week's Economic Calendar**](https://tradingeconomics.com/calendar) (All times are in EST)\n\n***Monday June 29th 2020***\n\n* **10:00 AM** [**Pending Home Sales YoY**](https://tradingeconomics.com/united-states/pending-home-sales) (Year Over Year) MAY: Previous -33.8% / Forecast [\\-16.2%](https://tradingeconomics.com/united-states/pending-home-sales)\n* **10:00 AM** **Pending Home Sales MoM** (Month Over Month) MAY: Previous -21.8 / Consensus 19.9% / Forecast 18%\n* **10:30 AM** [**Dallas Fed Manufacturing Index**](https://tradingeconomics.com/united-states/dallas-fed-manufacturing-index)  JUN: Previous -49.2 / Forecast -26%\n* **11:00 AM** [**Fed Daly Speech**](https://tradingeconomics.com/united-states/interest-rate)\n* **11:30 AM** [**3-Month Bill Auction**](https://tradingeconomics.com/united-states/3-month-bill-yield)**:** Previous  0.155%\n* **11:30 AM** [**6-Month Bill Auction**](https://tradingeconomics.com/united-states/6-month-bill-yield) : Previous  0.175%\n* **3:00 PM** [**Fed Williams Speech**](https://tradingeconomics.com/united-states/interest-rate)\n\n***Tuesday June 30th 2020***\n\n* **8:55 AM** [**Redbook YoY**](https://tradingeconomics.com/united-states/redbook-index) 27/JUN: Previous -6.1%\n* **8:55 AM** [**Redbook MoM**](https://tradingeconomics.com/united-states/redbook-index) 27/JUN: Previous -1.4%\n* **9:00 AM** [**S&amp;P/Case-Shiller Home Price MoM**](https://tradingeconomics.com/united-states/case-shiller-home-price-index) APR: Previous 1.1% / Forecast 0.4%\n* **9:00 AM** [**S&amp;P/Case-Shiller Home Price YoY**](https://tradingeconomics.com/united-states/case-shiller-home-price-index) APR: Previous 3.9% / Consensus 3.7% / Forecast 3.8%\n* **9:45 AM** [**Chicago PMI**](https://tradingeconomics.com/united-states/chicago-pmi) JUN: Previous 32.3% / Consensus 44.5% / Forecast 44%\n* **10:00 AM** **CB Consumer Confidence** JUN: Previous 86.6% / Consensus 90% / Forecast 90.1%\n* **11:00 AM** [**Fed Williams Speech**](https://tradingeconomics.com/united-states/interest-rate)\n* **11:05 AM** [**Fed Brainard Speech**](https://tradingeconomics.com/united-states/interest-rate)\n* **12:30 PM** [**Fed Chair Powell Testimony**](https://tradingeconomics.com/united-states/interest-rate)\n* **4:30 PM** [**API Crude Oil Stock Change**](https://tradingeconomics.com/united-states/api-crude-oil-stock-change) 26/JUN: Previous 1.7M\n\n***Wednesday July 1st 2020***\n\n* **7:00 AM** [**MBA Mortgage Applications**](https://tradingeconomics.com/united-states/mortgage-applications) 26/JUN: Previous -8.7%\n* **7:00 AM** [**MBA 30-Year Mortgage Rate**](https://tradingeconomics.com/united-states/mortgage-rate) 26/JUN: Previous 3.3%\n* **7:30 AM** [**Challenger Job Cuts**](https://tradingeconomics.com/united-states/challenger-job-cuts) JUN: Previous 397.016K / Forecast 180K\n* **8:15 AM** [**ADP Employment Change**](https://tradingeconomics.com/united-states/adp-employment-change) JUN: Previous -2760K / Consensus [3000K](https://tradingeconomics.com/united-states/adp-employment-change) / Forecast [3000K](https://tradingeconomics.com/united-states/adp-employment-change)\n* **9:45 AM** [**Markit Manufacturing PMI Final**](https://tradingeconomics.com/united-states/manufacturing-pmi) JUN:  Previous 39.8 / Consensus [49.6](https://tradingeconomics.com/united-states/manufacturing-pmi) / Forecast [49.6](https://tradingeconomics.com/united-states/manufacturing-pmi)\n* **10:00 AM** [**ISM Manufacturing Prices**](https://tradingeconomics.com/united-states/business-confidence) JUN: Previous 40.8 / Forecast 34.8\n* **10:00 AM** [**ISM Manufacturing New Orders**](https://tradingeconomics.com/united-states/business-confidence) JUN: Previous  31.8 / Forecast 44.1\n* **10:00 AM** [**ISM Manufacturing Employment**](https://tradingeconomics.com/united-states/business-confidence) JUN: Previous 32.1 / Forecast 40.9\n* **10:00 AM** [**Construction Spending MoM**](https://tradingeconomics.com/united-states/construction-spending) MAY: Previous -2.9% / Consensus [1%](https://tradingeconomics.com/united-states/construction-spending) / Forecast [1.5%](https://tradingeconomics.com/united-states/construction-spending)\n* **10:00 AM** [**ISM Manufacturing PMI**](https://tradingeconomics.com/united-states/business-confidence) JUN: Previous  43.1 / Consensus [49](https://tradingeconomics.com/united-states/business-confidence) / Forecast [48.6](https://tradingeconomics.com/united-states/business-confidence)\n* **10:00 AM** [**Fed Evans Speech**](https://tradingeconomics.com/united-states/interest-rate)\n* **10:30 AM** [**EIA Crude Oil Stocks Change**](https://tradingeconomics.com/united-states/crude-oil-stocks-change) 26/JUN: Previous 1.442M\n* **10:30 AM** [**EIA Gasoline Stocks Change**](https://tradingeconomics.com/united-states/gasoline-stocks-change) 26/JUN: Previous -1.673M\n* **10:30 AM** [**EIA Distillate Stocks Change**](https://tradingeconomics.com/united-states/distillate-stocks) 26/JUN: Previous 0.249M\n* **10:30 AM** [**EIA Cushing Crude Oil Stocks Change**](https://tradingeconomics.com/united-states/cushing-crude-oil-stocks) 26/JUN: Previous  -0.991M\n* **10:30 AM** [**EIA Refinery Crude Runs Change**](https://tradingeconomics.com/united-states/refinery-crude-runs) 26/JUN: Previous 0.24M\n* **10:30 AM** [**EIA Heating Oil Stocks Change**](https://tradingeconomics.com/united-states/heating-oil-stocks-) 26/JUN: Previous  0.164M\n* **10:30 AM** [**EIA Distillate Fuel Production Change**](https://tradingeconomics.com/united-states/distillate-fuel-production) 26/JUN: Previous  0.063M\n* **10:30 AM** [**EIA Gasoline Production Change**](https://tradingeconomics.com/united-states/gasoline-production) 26/JUN: Previous  0.438M\n* **10:30 AM** [**EIA Crude Oil Imports Change**](https://tradingeconomics.com/united-states/crude-oil-imports) 26/JUN: Previous -0.797M\n* **2:00 PM** [**FOMC Minutes**](https://tradingeconomics.com/united-states/interest-rate)\n* **8:00 PM** [**Total Vehicle Sales**](https://tradingeconomics.com/united-states/total-vehicle-sales) JUN: Previous 12.2M\n\n***Thursday July 2nd 2020***\n\n* **8:30 AM** [**Non Farm Payrolls**](https://tradingeconomics.com/united-states/non-farm-payrolls) JUN: Previous 2509K / Consensus [3000K](https://tradingeconomics.com/united-states/non-farm-payrolls) / Forecast [2900K](https://tradingeconomics.com/united-states/non-farm-payrolls)\n* **8:30 AM** [**Balance of Trade**](https://tradingeconomics.com/united-states/balance-of-trade) MAY: Previous  $-49.4B / Consensus [$-52B](https://tradingeconomics.com/united-states/balance-of-trade) / Forecast [$-53B](https://tradingeconomics.com/united-states/balance-of-trade)\n* **8:30 AM** [**Unemployment Rate**](https://tradingeconomics.com/united-states/unemployment-rate) JUN:  Previous 13.3% / Consensus [12.3%](https://tradingeconomics.com/united-states/unemployment-rate) / Forecast [12.3%](https://tradingeconomics.com/united-states/unemployment-rate)\n* **8:30 AM** [**Initial Jobless Claims**](https://tradingeconomics.com/united-states/jobless-claims) 27/JUN: Previous 1480K / Consensus [1325K](https://tradingeconomics.com/united-states/jobless-claims) / Forecast [1340K](https://tradingeconomics.com/united-states/jobless-claims)\n* **8:30 AM** [**Jobless Claims 4-Week Average**](https://tradingeconomics.com/united-states/jobless-claims-4-week-average) 27/JUN: Previous 1620.75K / Forecast [1482K](https://tradingeconomics.com/united-states/jobless-claims-4-week-average)\n* **8:30 AM** [**Average Hourly Earnings MoM**](https://tradingeconomics.com/united-states/average-hourly-earnings) JUN: Previous -1% / Consensus [\\-0.6%](https://tradingeconomics.com/united-states/average-hourly-earnings) / Forecast [\\-0.7%](https://tradingeconomics.com/united-states/average-hourly-earnings)\n* **8:30 AM** [**Continuing Jobless Claims**](https://tradingeconomics.com/united-states/continuing-jobless-claims) 20/JUN: Previous 19522K / Consensus [19000K](https://tradingeconomics.com/united-states/continuing-jobless-claims) / Forecast [18800K](https://tradingeconomics.com/united-states/continuing-jobless-claims)\n* **8:30 AM** [**Participation Rate**](https://tradingeconomics.com/united-states/labor-force-participation-rate) JUN: Previous 60.8% / Forecast [61%](https://tradingeconomics.com/united-states/labor-force-participation-rate)\n* **8:30 AM** [**Manufacturing Payrolls**](https://tradingeconomics.com/united-states/manufacturing-payrolls) JUN: Previous 225K / Consensus [300K](https://tradingeconomics.com/united-states/manufacturing-payrolls) / Forecast [350K](https://tradingeconomics.com/united-states/manufacturing-payrolls)\n* **8:30 AM** [**Average Weekly Hours**](https://tradingeconomics.com/united-states/average-weekly-hours) JUN: Previous 34.7 / Consensus [34.5](https://tradingeconomics.com/united-states/average-weekly-hours) / Forecast [34.4](https://tradingeconomics.com/united-states/average-weekly-hours)\n* **8:30 AM** [**Average Hourly Earnings YoY**](https://tradingeconomics.com/united-states/average-hourly-earnings) JUN: Previous 6.7% / Consensus 5.3% / Forecast 5%\n* **8:30 AM** [**Government Payrolls**](https://tradingeconomics.com/united-states/government-payrolls) JUN: Previous -585K / Forecast [100K](https://tradingeconomics.com/united-states/government-payrolls)\n* **8:30 AM** [**Nonfarm Payrolls Private**](https://tradingeconomics.com/united-states/nonfarm-payrolls-private) JUN: Previous 094K / Consensus [2900K](https://tradingeconomics.com/united-states/nonfarm-payrolls-private) / Forecast [2800K](https://tradingeconomics.com/united-states/nonfarm-payrolls-private)\n* **8:30 AM** [**Exports**](https://tradingeconomics.com/united-states/exports) MAY: Previous $151.28B / Forecast [$140B](https://tradingeconomics.com/united-states/exports)\n* **8:30 AM** [**Imports**](https://tradingeconomics.com/united-states/imports) MAY: Previous $200.69B / Forecast [$193B](https://tradingeconomics.com/united-states/imports)\n* **9:45 AM**  [**ISM New York Index**](https://tradingeconomics.com/united-states/ism-new-york-index) JUN: Previous 19.5 / Forecast [43.8](https://tradingeconomics.com/united-states/ism-new-york-index)\n* **10:00 AM** [**Factory Orders MoM**](https://tradingeconomics.com/united-states/factory-orders) MAY: Previous -13% / Consensus [8.5%](https://tradingeconomics.com/united-states/factory-orders) / Forecast [8%](https://tradingeconomics.com/united-states/factory-orders)\n* **10:00 AM** [**Factory Orders ex Transportation**](https://tradingeconomics.com/united-states/factory-orders-ex-transportation) MAY: Previous -8.5% / Forecast [4.9%](https://tradingeconomics.com/united-states/factory-orders-ex-transportation)\n* **10:30 AM** [**EIA Natural Gas Stocks Change**](https://tradingeconomics.com/united-states/natural-gas-stocks-change) 26/JUN: Previous 120Bcf / Consensus [70Bcf](https://tradingeconomics.com/united-states/natural-gas-stocks-change)\n* **11:30 AM** [**4-Week Bill Auction**](https://tradingeconomics.com/united-states/4-week-bill-yield)**:** Previous  0.110%\n* **11:30 AM 8-Week Bill Auction**: Previous  0.140%\n* **1:00 PM** [**Baker Hughes Oil Rig Count**](https://tradingeconomics.com/united-states/crude-oil-rigs) 02/JUL: Previous 188\n* **1:00 PM** [**Baker Hughes Total Rig Count**](https://tradingeconomics.com/united-states/crude-oil-rigs) 02/JUL: Previous 265\n\n***Friday July 3rd 2020***\n\n* N/A\n\n***Other Useful Resources:***\n\n[**The Ultimate Quick Resource For the Amateur Trader.**](https://www.reddit.com/r/pennystocks/comments/hcja2q/the_ultimate_quick_resource_for_the_amateur_trader/)\n\nSubscribe to This Brief and the daily 4:00 AM Pre Market Brief on [**The Twitter Link Here**](https://www.tradinganalysisresources.com/2020/05/free-references-and-resources.html?m=1) . Alerts in the tweets will direct you to the daily brief in this sub.\n\n.",
        "subreddit": "pennystocks",
        "title": "Next Weeks Economic Calendar Brief 06/29/2020 - 07/03/2020",
        "url": "https://www.reddit.com/r/pennystocks/comments/hh7iao/next_weeks_economic_calendar_brief_06292020/",
        "created": 1593343833.0
    },
    {
        "author": "patrickbateman02",
        "created_utc": 1591187104,
        "id": "gvszgv",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Adp private payroll down 2.76millipn. Expected 8. Shit so crazy they can’t even get the numbers right. I’m sure a revision is coming but also share markets will rally over this",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gvszgv/adp_private_payroll_down_276millipn_expected_8/",
        "created": 1591215904.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1591460166,
        "id": "gxttxj",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Good Saturday afternoon to all of you here on r/wallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning June 8th, 2020.\n\n# **Look for the S&amp;P 500 to turn positive for the year with a boost from the Fed in the week ahead  - [(Source)](https://www.cnbc.com/2020/06/05/look-for-the-sp-500-to-turn-positive-for-the-year-with-a-boost-from-the-fed-in-the-week-ahead.html)**\n*****\n&gt; Federal Reserve Chairman Jerome Powell is expected to reassure markets next week the central bank will do whatever it takes to help the economy heal. That should be enough to keep investors moving into stocks that benefit from an economic rebound and push the S&amp;P 500 into the green for 2020.\n*****\n&gt; The Fed’s two-day meeting is the big event for markets in the coming week. There are a few economic reports, including inflation data, the consumer price index Wednesday and producer prices Thursday. Weekly jobless claims will be important Thursday to see if there’s a drop in continuing clams, after May’s employment report showed a surprising record gain of 2.5 million jobs.\n*****\n&gt; The reopening trade was in full swing in the past week, especially Friday when stocks surged on the jobs report, which was expected to show a loss of 8.3 million jobs. The Nasdaq broke above its record high set on Feb. 19, and the S&amp;P 500 was just 1.1% away from turning positive for 2020.\n*****\n&gt; Even before the jobs report, investors were loading up on financials, industrials, transports and small caps, which were up more than 8% for the week and 18.4% in the past month. S&amp;P financials were 12.1% higher on the week, S&amp;P industrials were up 10.5, and the NYSE airline index jumped more than 35.4.%.\n*****\n&gt; “I think next week is dominated by the reopening and it will be for another month,” said James Paulsen, chief investment strategist at Leuthold Group. “With cyclicals outperforming, small [caps] outperforming, credit spreads coming in and then the bond yields going up, everybody — all facets of the financial markets — are sort of suggesting the same outcome.”\n*****\n&gt; The S&amp;P 500 ended the week at 3,193, a gain of 4.9%, and now traders are watching to see if it can scale the psychological 3,200 level. The Dow closed Friday at 27,110, up 6.8% for the week, and the Nasdaq Composite was up 3.4%, at 9,814 after reaching an intraday record high of 9,845 Friday.\n*****\n&gt; Analysts say the market will likely look past the protests that broke out in cities across the U.S. after the death of George Floyd in Minneapolis. Four policemen were charged with murder in his death. Looters joined the protests, some of which turned violent, but they quieted down towards the end of the week.\n*****\n&gt; Stocks were higher for a third week in a row, but a change this past week has been the abrupt lurch higher in Treasury yields. The 10-year rose to a high of 0.95% Friday, a quarter-point move in just three sessions. The move was already underway but got a lift Wednesday when ADP jobs data was not nearly as bad as expected. Yields ripped even higher after the May employment report showed the unemployment rate actually fell to 13.3%, instead of climbing to 20%, as expected by economists.\n*****\n&gt; Bond strategists said the Treasury market was now acknowledging the potential for a recovery, but not in the exuberant way the stock market has been. Since March 23, the S&amp;P 500 has risen more than 45%, but it took the 10-year Treasury until this week to get back the yield level it was at when stocks bottomed.\n*****\n&gt; Paulsen said he believes a new bull market has been launched, but there could be pullbacks and some headwinds for the market coming up.\n*****\n&gt; “When GDP is minus 30%, other issues don’t matter. There’s just one issue. But as the economy reopens again, the trade battles will matter again, presidential politics will matter again,” said Paulsen, adding the budget deficit could also matter. “I think we’ll get removed from a sole focus. That isn’t quite there but I think it’s coming.”\n*****\n&gt; # Fed ahead\n&gt; The Fed begins its two-day meeting Tuesday, and will release its statement Wednesday afternoon, followed by a video briefing by Powell.\n*****\n&gt; “Whey would the Fed want to disrupt this with anything?” Paulsen said. “They’re still going to support the economy. They’re going to stay away from negative rates or yield curve management. They’re not going to do anything to scare the markets. They might certainly reassure people that they are still ready to provide support.”\n*****\n&gt; Ethan Harris, head of global economics at Bank of America, said the Fed may clarify where it stands on some of the extraordinary moves it has taken since it cut rates to zero. The Fed has been supporting the markets with asset purchases and multiple programs for commercial paper, corporate bonds, and municipal bonds, for example.\n*****\n&gt; “We think right now they’re just trying to get this Main Street lending program to work. The question is are they going to do more things around what they do in terms of forward guidance and next steps of macro easing,” Harris said.\n*****\n&gt; There has been speculation that the Fed would do some type of so-called yield curve control, a program to keep interest rates capped at certain levels. “I think it’s too early for that,” said Harris. He said the Fed would be guaranteeing low rates for a long period of time if it does yield curve control.\n*****\n&gt; “Yield curve control is basically open-ended quantitative easing,” he said. The Fed is currently buying Treasurys but if it wanted to stop yields from rising too much as the economy improves, it could make targeted purchases.\n*****\n&gt; Barclays chief U.S. economist Michael Gapen said it’s possible the Fed could announce the yield curve control. “We’ve said they could implement yield curve control out to three years,” he said. “In my mind that matches the length of the horizon of the economic projections.”\n*****\n&gt; Powell has said the economy needs more fiscal help, and he could reiterate those comments Wednesday. President Donald Trump on Friday said he backs more stimulus. So far, the Democrats have put out a marker with their wish list for further spending, but there have been no negotiations.\n*****\n&gt; There was concern the strong jobs report could make it harder to get buy in for another big spending package. But some economists say the recovery needs a boost and states need funding to fill the holes in their budgets from coronavirus-related spending and a lack of tax receipts.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/7klaXQm.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/PKTBzT2.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/a5JkAB6.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/M2x4Qoq.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/qtJYfXN.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/bjiJWjV.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/UAi19KJ.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/GQm4ruO.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/PQzyXLa.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/uV1U7FN.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/wm2XJND.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/yarkiMO.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/hFblu2G.png))**\n\n*****\n\n# S&amp;P 500 Stocks Outpacing Analyst Price Targets\n\n&gt; This morning's jobs report shocked the financial world -- most notably the economists whose job it is to provide estimates. The consensus estimate among economists for May nonfarm payrolls was projecting a loss of more than 7 million jobs. The actual number that was reported did not just show a smaller than expected job loss, but it actually showed a gain in jobs of more than 2.5 million.\n\n&gt; We're seeing a similar situation play out in the equity analyst community. With the S&amp;P 500 now up 40%+ since its low less than three months ago, the average stock in the index is now trading above its consensus analyst price target that looks 12 months out. Analysts have simply not been able to catch up to the rapid rise we've seen for equity prices.\n\n&gt; It's extremely rare to see share prices move above consensus analyst price targets. We don't have the historical daily data on this, but anecdotally we can't remember a time when the spread has been this wide. As shown below, at the end of 2019 when the S&amp;P finished a massive rally, equity prices were 5.5% below the consensus price target. That was seen as a very tight spread prior to what we're seeing now. At the lows in March, the average share price had dropped all the way to $92.50 compared to an average consensus price target of $143.20. That projected a gain of 54.9% at the time!\n\n&gt; Since March 23rd, the average share price has risen from $92.50 up to $138.40, while the average analyst price target has fallen from $143.20 to $136. Current price targets no longer project a gain for the average S&amp;P 500 stock, but rather a 1.7% drop.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/avgpricetarget.png))**\n\n&gt; # Nasdaq's Historical Run\n\n&gt; At its highs earlier this morning, the Nasdaq Composite was within 2% of its record high from earlier in the year. Besides the steep V-shape of the Nasdaq's pattern over the last four months, the other aspect of the chart that stands out is just how steep the 50-day moving average is trending lately.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060420-Nasdaq-50DMAa.png))**\n\n&gt; To illustrate just how steep the Nasdaq's 50-DMA has become, the chart below shows the daily percentage change of the 50-day going back to 1971. Currently, the Nasdaq 50-DMA is rising at an average of over 0.5% per day. That's an incredible slope and a level that has been exceeded only a handful of times in the Nasdaq's 50-year history.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060420-Nasdaq-Composite1.png))**\n\n*****\n\n# Big Gains From Smaller Tech\n\n&gt; It's still difficult to fathom the moves in the US equity market over the last four months. The fact that the Nasdaq and more specifically the Technology sector aren't far from record highs is definitely something no one was expecting two months ago. There's an old market saying that equities take the stairs up and the elevator down, but in the latest market cycle, the elevator up was almost as fast as the way down!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060320-Nasdaq.png))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060320-Technology-Sector.png))**\n\n&gt; If you've been following the markets, all you've likely heard up until recently is that large-cap tech, and more specifically, Microsoft (MSFT), Apple (AAPL), Amazon (AMZN), Alphabet (GOOGL), and Facebook (FB), are single-handedly driving the market higher. The reality is not nearly as clear-cut. Given their market caps, the \"Big 5\" (as they're often referred to) have done a lot of heavy lifting, but in terms of performance, they're hardly the only game in town.\n\n&gt; The table below lists Technology sector stocks in the Russell 3000 with market caps of more than $1 billion that are outperforming all of the 'big 5' tech stocks on a YTD basis. Actually, since Amazon is doing so well relative to the rest of the \"big 5\" these are all stocks that are outperforming Amazon. If we looked for stocks that were doing better than the average return of the \"big 5\" the list would be a lot, lot longer (+16.4%).\n\n&gt; Looking through the list of names below, the two top-performing names are Zscaler (ZS) and Twilio (TWLO), which have both more than doubled. Behind these two, DocuSign (DOCU) and Sprout Social (SPT) are both knocking on the door of triple-digits. All 28 of the names listed have market caps of $1 billion, but the average market cap is just over $21 billion, while Nvidia (NVDA) is the largest company on the list with a market cap of $216 billion. For the most part, these aren't names that have been driving the indices, but anyone holding these stocks in their portfolio probably doesn't care!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060320-Tech-Stocks.png))**\n\n*****\n\n# Best 50-Day Rally Ever\n\n&gt; In many ways, what we’ve seen so far in 2020 has been both record-breaking and devastating. From the S&amp;P 500 Index peak on February 19 to the bear market lows March 23, stocks lost 33.9%. Now, 50 trading days later, stocks have gained 39.6%, for the largest 50-day rally since the S&amp;P 500 moved to 500 stocks in 1957.\n\n&gt; “There are no rollercoasters that can replicate what stocks have done so far in 2020,” exclaimed LPL Financial Senior Market Strategist Ryan Detrick. “Here’s the catch though: Big 50-day rallies in the past have taken place near the start of new bull markets, and the returns going out a year were quite bullish.”\n\n&gt; As shown in the LPL Chart of the Day, the 39.6% gain in 50 days was the greatest 50-day rally ever, besting the previous best in October 1982. What’s important to note here is that many of these rallies took place coming off major market lows, and delivered quite strong returns going out 6 to 12 months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/06/best-fifty-days.png?ssl=1))**\n\n&gt; Although we have near-term worries given this historic run, as some sentiment indicators such as put/call ratios are showing some froth, from a bigger picture perspective, this strong 50-day rally offers a reason to think stock prices may be even higher this time next year.\n\n*****\n\n# 2020 In Charts\n\n&gt; 2020 is only five months old, but in many ways it is one of the most historic years we’ve ever seen. “2020 went from moving along nicely, to seeing the worst recession in a generation and the fastest bear market ever,” explained LPL Financial Senior Market Strategist Ryan Detrick. “Now stocks are in the midst of one of the best bull runs ever, even though the economy remains extremely weak, thanks to record stimulus and hopes over a vaccine.”\n&gt; \nTo best sum it all up, here are 10 charts that tell the picture of 2020 so far.\n\n&gt; 1.) The 2010s were the first decade in history to go all 10 years without a recession, which of course ended just months into the new decade, as the economy stopped. Stocks gained 13.5% on an annual basis last decade, surprisingly, only the third-best decade over the past four.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/06/1-blog-chart.png?ssl=1))**\n\n&gt; 2.) This is an election year, and the S&amp;P 500 Index hasn’t been lower when a President is up for reelection since FDR in 1940. Although this seemed nearly impossible at the March lows, it is looking like this incredible streak could have a chance in 2020.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/2-blog-chart.png?ssl=1))**\n\n&gt; 3.) One of the first signs something could go wrong in 2020 was stocks fell in January. Historically, this has meant potential trouble for the final 11 months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/3-blog-chart.png?ssl=1))**\n\n&gt; 4.) As fears over COVID-19 gripped the world, the Dow Jones Industrial Average had its fastest bear market ever, in only 19 days. To put this in perspective, this was the fastest bear market in the 124-year history of the Dow.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/4-blog-chart.png?ssl=1))**\n\n&gt; 5.) Mark Twain said “History doesn’t repeat itself, but it often rhymes”. Looking at history, every 50 years there has been a terrible pandemic and stocks fell more than 30%. We don’t know if the ultimate lows are in this time, but so far, history is rhyming.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/blog-chart-5.png?ssl=1))**\n\n&gt; 6.) More than 20 million people in the US lost their jobs in April, while the unemployment rate soared to near 15%, the highest since the Great Depression. Record drops in manufacturing, industrial production, retail sales, and consumer spending have all taken place in the past two months as well.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/6-blog-chart.png?ssl=1))**\n\n&gt; 7.) A recession is here, ending the streak of 128 months in a row without one. What is unique about the previous expansion was nominal gross domestic product (GDP) grew only 50%, about the average growth seen during the previous expansions, but this expansion was nearly twice as long as the average expansion (10 years versus 5 years).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/7-blog-chart.png?ssl=1))**\n\n&gt; 8.) The bounce off of the March 23 S&amp;P 500 lows has been historic in many ways. In fact, it was one of the best 20-day rallies ever, with previous best rallies seeing strong returns 6 and 12 months later.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/8-blog-chart.png?ssl=1))**\n\n&gt; 9.) As scary as it was on the way down, stocks have come roaring back, gaining more than 35% from the March 23 lows. This would classify as the greatest bear market bounce ever, which opens the question: is this more than a bear market bounce and instead the start of a new bull market?\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/9-blog-chart.png?ssl=1))**\n\n&gt; 10.) The number of COVID-19 tests in the US nearly doubled in May versus what was seen in April. Additionally, fewer and fewer tests are coming back positive. Testing is one of the key ways we will beat this and this is a step in the right direction. We’ve also seen new monthly lows in people on ventilators, in the ICU, and in hospitals.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/9-blog-chart.png?ssl=1))**\n\n&gt; Hard to believe, but there are still 7 months left in 2020. It hasn’t been easy for any of us, and we continue to keep everyone impacted by this pandemic in mind, but we continue to see the glass as half full. The dual benefit of record monetary and fiscal policy should help create a bridge to help those most impacted, while the economy can slowly come back online later this year.\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$ADBE** \n&gt; * **$CHWY** \n&gt; * **$TIF** \n&gt; * **$LULU** \n&gt; * **$COUP** \n&gt; * **$SFIX** \n&gt; * **$LOVE** \n&gt; * **$NEPT** \n&gt; * **$GHM** \n&gt; * **$REVG** \n&gt; * **$GME** \n&gt; * **$HDS** \n&gt; * **$FIVE** \n&gt; * **$SIG** \n&gt; * **$CASY** \n&gt; * **$CVGW** \n&gt; * **$AMC** \n&gt; * **$FCEL** \n&gt; * **$QTNT** \n&gt; * **$PLCE** \n&gt; * **$CHS** \n&gt; * **$THO** \n&gt; * **$GCO** \n&gt; * **$BF.B** \n&gt; * **$LMNR** \n&gt; * **$WSG** \n&gt; * **$PRTY** \n&gt; * **$GES** \n&gt; * **$BBCP** \n&gt; * **$CONN** \n&gt; * **$HEXO** \n&gt; * **$PHR** \n&gt; * **$PVH** \n&gt; * **$RRGB** \n&gt; * **$PLAY** \n&gt; * **$TNP** \n&gt; * **$JW.A** \n&gt; * **$SB** \n&gt; * **$GSM** \n&gt; * **$SRT**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/PQzyXLa.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/bgPdMCr.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 6.8.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/d2EW1kr.png))\n\n&gt; # ***Monday 6.8.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/uxSiJJr.png))\n\n*****\n\n&gt; # ***Tuesday 6.9.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/3SIjcG7.png))\n\n&gt; # ***Tuesday 6.9.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/cRBrPlt.png))\n\n*****\n\n&gt; # ***Wednesday 6.10.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/DaheXAm.png))\n\n&gt; # ***Wednesday 6.10.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/9mcHxTl.png))\n\n*****\n\n&gt; # ***Thursday 6.11.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/i8SNjWM.png))\n\n&gt; # ***Thursday 6.11.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/9xcBZPK.png))\n\n*****\n\n&gt; # ***Friday 6.12.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n&gt; # ***Friday 6.12.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# Adobe Inc. $392.90\n&gt; **Adobe Inc. (ADBE)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, June 11, 2020. The consensus earnings estimate is $2.33 per share on revenue of $3.17 billion and the Earnings Whisper ® number is $2.39 per share. Investor sentiment going into the company's earnings release has 79% expecting an earnings beat The company's guidance was for earnings of approximately $2.35 per share. Consensus estimates are for year-over-year earnings growth of 26.63% with revenue increasing by 15.51%. Short interest has increased by 3.0% since the company's last earnings release while the stock has drifted higher by 25.6% from its open following the earnings release to be 23.1% above its 200 day moving average of $319.27. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, May 19, 2020 there was some notable buying of 3,194 contracts of the $410.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 4.8% move on earnings and the stock has averaged a 6.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ADBE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# United Natural Foods, Inc. $20.78\n&gt; **United Natural Foods, Inc. (UNFI)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, June 10, 2020. The consensus earnings estimate is $1.41 per share on revenue of $6.67 billion and the Earnings Whisper ® number is $1.42 per share. Investor sentiment going into the company's earnings release has 78% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 131.15% with revenue increasing by 11.86%. Short interest has decreased by 16.0% since the company's last earnings release while the stock has drifted higher by 202.5% from its open following the earnings release to be 96.1% above its 200 day moving average of $10.60. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, June 2, 2020 there was some notable buying of 2,226 contracts of the $22.50 call expiring on Friday, June 19, 2020. Option traders are pricing in a 17.7% move on earnings and the stock has averaged a 15.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=UNFI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Chewy, Inc. $48.44\n&gt; **Chewy, Inc. (CHWY)** is confirmed to report earnings at approximately 4:10 PM ET on Tuesday, June 9, 2020. The consensus estimate is for a loss of $0.11 per share on revenue of $1.55 billion and the Earnings Whisper ® number is ($0.09) per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 37.50% with revenue increasing by 39.78%. Short interest has increased by 37.9% since the company's last earnings release while the stock has drifted higher by 37.5% from its open following the earnings release to be 56.4% above its 200 day moving average of $30.97. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 5.8% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CHWY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Tiffany &amp; Co. $121.99\n&gt; **Tiffany &amp; Co. (TIF)** is confirmed to report earnings at approximately 6:40 AM ET on Tuesday, June 9, 2020. The consensus earnings estimate is $0.21 per share on revenue of $646.40 million. Investor sentiment going into the company's earnings release has 6% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 79.61% with revenue decreasing by 35.56%. Short interest has decreased by 26.5% since the company's last earnings release while the stock has drifted lower by 4.7% from its open following the earnings release to be 1.9% above its 200 day moving average of $119.75. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, June 5, 2020 there was some notable buying of 9,022 contracts of the $110.00 put expiring on Friday, August 21, 2020. Option traders are pricing in a 6.2% move on earnings and the stock has averaged a 3.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TIF&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# lululemon athletica inc. $319.78\n&gt; **lululemon athletica inc. (LULU)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, June 11, 2020. The consensus earnings estimate is $0.28 per share on revenue of $724.78 million and the Earnings Whisper ® number is $0.30 per share. Investor sentiment going into the company's earnings release has 47% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 62.16% with revenue decreasing by 7.35%. Short interest has increased by 53.3% since the company's last earnings release while the stock has drifted higher by 66.1% from its open following the earnings release to be 46.8% above its 200 day moving average of $217.77. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, June 4, 2020 there was some notable buying of 1,385 contracts of the $350.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 9.4% move on earnings and the stock has averaged a 7.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LULU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Coupa Software $216.94\n&gt; **Coupa Software (COUP)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, June 8, 2020. The consensus earnings estimate is $0.07 per share on revenue of $111.83 million and the Earnings Whisper ® number is $0.10 per share. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat The company's guidance was for earnings of $0.06 to $0.08 per share on revenue of $112.00 million to $112.00 million. Consensus estimates are for year-over-year earnings growth of 450.00% with revenue increasing by 37.48%. Short interest has increased by 7.9% since the company's last earnings release while the stock has drifted higher by 94.9% from its open following the earnings release to be 40.3% above its 200 day moving average of $154.59. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, June 4, 2020 there was some notable buying of 1,085 contracts of the $220.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 12.7% move on earnings and the stock has averaged a 9.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=COUP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Stitch Fix, Inc. $24.96\n&gt; **Stitch Fix, Inc. (SFIX)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, June 8, 2020. The consensus estimate is for a loss of $0.17 per share on revenue of $401.40 million and the Earnings Whisper ® number is ($0.13) per share. Investor sentiment going into the company's earnings release has 53% expecting an earnings beat The company's guidance was for revenue of $465.00 million to $475.00 million. Consensus estimates are for earnings to decline year-over-year by 342.86% with revenue decreasing by 1.83%. Short interest has increased by 4.0% since the company's last earnings release while the stock has drifted higher by 66.4% from its open following the earnings release to be 19.1% above its 200 day moving average of $20.96. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, June 2, 2020 there was some notable buying of 5,092 contracts of the $25.00 call expiring on Friday, June 12, 2020. Option traders are pricing in a 21.2% move on earnings and the stock has averaged a 13.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SFIX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Lovesac Company $17.84\n&gt; **Lovesac Company (LOVE)** is confirmed to report earnings at approximately 7:00 AM ET on Tuesday, June 9, 2020. The consensus estimate is for a loss of $0.69 per share on revenue of $48.22 million and the Earnings Whisper ® number is ($0.65) per share. Investor sentiment going into the company's earnings release has 52% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 2.99% with revenue increasing by 17.73%. Short interest has increased by 20.5% since the company's last earnings release while the stock has drifted higher by 109.9% from its open following the earnings release to be 31.5% above its 200 day moving average of $13.57. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 20.1% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LOVE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Neptune Wellness Solutions Inc. $3.14\n&gt; **Neptune Wellness Solutions Inc. (NEPT)** is confirmed to report earnings after the market closes on Wednesday, June 10, 2020. The consensus estimate is for a loss of $0.08 per share on revenue of $6.32 million and the Earnings Whisper ® number is ($0.10) per share. Investor sentiment going into the company's earnings release has 63% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 100.00% with revenue increasing by 48.36%. Short interest has decreased by 4.7% since the company's last earnings release while the stock has drifted higher by 56.2% from its open following the earnings release to be 6.4% above its 200 day moving average of $2.95. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, May 19, 2020 there was some notable buying of 2,960 contracts of the $3.00 call expiring on Friday, June 19, 2020. The stock has averaged a 8.1% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NEPT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Graham Corporation $15.58\n&gt; **Graham Corporation (GHM)** is confirmed to report earnings at approximately 6:30 AM ET on Wednesday, June 10, 2020. The consensus earnings estimate is $0.12 per share on revenue of $32.00 million. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 50.00% with revenue increasing by 35.36%. Short interest has increased by 89.8% since the company's last earnings release while the stock has drifted lower by 21.7% from its open following the earnings release. Overall earnings estimates have been revised lower since the company's last earnings release.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=GHM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/wallstreetbets.",
        "subreddit": "wallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning June 8th, 2020",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gxttxj/wall_street_week_ahead_for_the_trading_week/",
        "created": 1591488966.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1591195896,
        "id": "gvvciz",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "[We're saved! This is why the market is always going up: ADP report shows 2.8 million jobs lost in May](https://thehill.com/policy/finance/500873-adp-report-shows-28-million-jobs-lost-in-may)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gvvciz/were_saved_this_is_why_the_market_is_always_going/",
        "created": 1591224696.0
    },
    {
        "author": "memecaptial",
        "created_utc": 1591362849,
        "id": "gx4cd4",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Just want to point out ADP report showed a loss of 2.5 mil payrolls compared to labor dept claiming a gain in 2.5 jobs",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gx4cd4/just_want_to_point_out_adp_report_showed_a_loss/",
        "created": 1591391649.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1591344424,
        "id": "gx0fbe",
        "num_comments": 512,
        "num_crossposts": 0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme and/or [post your arguments against fundamentals here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nMost fundamentals are updated every 3 months due to the fact that corporations release earnings reports every quarter, so traders are always speculating at what those earnings will say, and investors may change the size of their holdings based on those reports.  Expect a lot of volatility around earnings, but it usually doesn't matter if you're holding long term, but keep in mind the importance of earnings reports because a trend of declining earnings or a decline in some other fundamental will drive the stock down over the long term as well.\n\nSee the following word cloud and click through for the wiki:\n\n[Market Cap - Shares Outstanding - Volume - Dividend - EPS - P/E Ratio - EPS Q/Q - PEG - Sales Q/Q - Return on Assets (ROA) - Return on Equity (ROE) - BETA - SMA - quarterly earnings](https://www.reddit.com/r/stocks/wiki/fundamentals-themed-post)\n\nIf you have a basic question, for example \"what is EBITDA,\" then google \"investopedia EBITDA\" and click the Investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nUseful links:\n\n* [Investopedia Tuturiol](https://www.investopedia.com/university/all/fundamental-analysis/) on fundamental analysis including [Discounted Cash Flow](https://www.investopedia.com/university/dcf/) analysis; see [definition here](https://www.investopedia.com/terms/d/dcf.asp)\n* [FINVIZ](https://finviz.com/quote.ashx?t=aapl) for fundamental data, charts, and aggregated news\n* [Earnings Whisper](https://www.earningswhispers.com/stocks/aapl) for earnings details\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion &amp; Fundamentals Friday Jun 05, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/gx0fbe/rstocks_daily_discussion_fundamentals_friday_jun/",
        "created": 1591373224.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1591171618,
        "id": "gvprm2",
        "num_comments": 458,
        "num_crossposts": 0,
        "selftext": "These daily discussions run from Monday to Friday including during our themed posts.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?sort=new&amp;q=Rate+My+Portfolio+-+r%2FStocks+Quarterly+Thread&amp;t=all&amp;restrict_sr=on).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion Wednesday - Jun 03, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/gvprm2/rstocks_daily_discussion_wednesday_jun_03_2020/",
        "created": 1591200418.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1591257985,
        "id": "gwd4gg",
        "num_comments": 435,
        "num_crossposts": 0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on stock options, but if options aren't your thing then just ignore the theme and/or [post your arguments against options here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nRequired info to start understanding options:\n\n* [Call option Investopedia video](https://www.investopedia.com/terms/c/calloption.asp) basically a call option allows you to buy 100 shares of a stock at a certain price (strike price), but without the obligation to buy\n* [Put option Investopedia video](https://www.investopedia.com/terms/p/putoption.asp) a put option allows you to sell 100 shares of a stock at a certain price (strike price), but without the obligation to sell\n\nSee the following word cloud and click through for the wiki:\n\n[Call option - Put option - Exercising an option - Strike price - ITM - OTM - ATM - Long options - Short options - Combo - Debit - Credit or Premium - Covered call - Naked - Debit call spread - Credit call spread - Strangle - Iron condor - Vertical debit spreads - Iron Fly](https://www.reddit.com/r/stocks/wiki/options-themed-post)\n\nIf you have a basic question, for example \"what is delta,\" then google \"investopedia delta\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion &amp; Options Trading Thursday - Jun 04, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/gwd4gg/rstocks_daily_discussion_options_trading_thursday/",
        "created": 1591286785.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1591085241,
        "id": "gv3853",
        "num_comments": 272,
        "num_crossposts": 0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on technical analysis (TA), but if TA is not your thing then just ignore the theme and/or [post your arguments against TA here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\n**Technical analysis (TA)** uses historical price movements, real time data, indicators based on math and/or statistics, and charts; all of which help measure the trajectory of a security.  TA can also be used to interpret the actions of other market participants and predict their actions.\n\nThe main benefit to TA is that everything shows up in the price (commonly known as **\"priced in\"**):  All news, investor sentiment, and changes to fundamentals are reflected in a security's price.\n\nTA can be useful on any timeframe, both short and long term.\n\nIntro to technical analysis by [Stockcharts chartschool](https://stockcharts.com/school/doku.php?id=chart_school:technical_indicators:introduction_to_technical_indicators_and_oscillators#benefits_and_drawbacks_of_leading_indicators) and their [article on candlesticks](https://stockcharts.com/school/doku.php?id=chart_school:chart_analysis:introduction_to_candlesticks)\n\nIf you have questions, please see the following word cloud and click through for the wiki:\n\n[Indicator - Trade Signals - Lagging Indicator - Leading Indicator - Oversold - Overbought - Divergence - Whipsaw - Resistance - Support - Breakout/Breakdown - Alerts - Trend line - Market Participants - Moving average - RSI - VWAP - MACD - ATR - Bollinger Bands - Ichimoku clouds - Methods - Trend Following - Fading - Channels - Patterns - Pivots](https://www.reddit.com/r/stocks/wiki/ta-themed-post)\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion &amp; Technicals Tuesday - Jun 02, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/gv3853/rstocks_daily_discussion_technicals_tuesday_jun/",
        "created": 1591114041.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1590998962,
        "id": "gugkmx",
        "num_comments": 242,
        "num_crossposts": 0,
        "selftext": "These daily discussions run from Monday to Friday including during our themed posts.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?sort=new&amp;q=Rate+My+Portfolio+-+r%2FStocks+Quarterly+Thread&amp;t=all&amp;restrict_sr=on).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion Monday - Jun 01, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/gugkmx/rstocks_daily_discussion_monday_jun_01_2020/",
        "created": 1591027762.0
    },
    {
        "author": "codingprofessor",
        "created_utc": 1591163589,
        "id": "gvo3ph",
        "num_comments": 80,
        "num_crossposts": 0,
        "selftext": "# edit: Looks like images arent previewing tonight.\n\n# tl;dr: $40c 8/21 &amp;&amp; 35c 7/17\n\n&amp;#x200B;\n\n# # Goals\n\n\\- Answer \"What am I investing in when I risk money with CloudFlare?\"\n\n# # The thesis\n\nThe economic value and convergence between e-commerce, networking speeds, and video advancements is not anywhere close to realized. There has been an acceleration toward this reality but it's still early in the overall development cycle.\n\nPhysical and monetary assets being virtualized has recently been accelerated in importance and this will have positive effects, across time, on businesses that focus on securing those assets in its time spent delivering on multiple ultra-high-speed networks across the world. Computing is getting cheaper and easier to distribute in rather extreme ways and the execution of these ideas is happening right now.\n\nThe need for secure video, transactions, VR, and user experiences will be dramatically shot up and this is evident across many exciting technologies like Apple VR, Google Gaming, Square Banking, Facebook Shops with VR shopping, Microsoft software automations, and government developments.\n\nInfrastructure that support these interactive ecosystems will be growing at incredible rates. NET is one of the best positioned companies to pioneer this market.\n\n[The networking market](https://mordorintelligence.com/images_db/RD_Images/1556091324027_Picture2.png)\n\n# # My motivation\n\nCloudFlare is releasing and bolstering support for streaming, video, and communications as a security-first cloud provider in the following week. This, on top of its rapidly growing developer platform, is consequential for many reasons as a market-mover in the industry.\n\n[CloudFlare Distributed Video Support](https://pbs.twimg.com/media/EZN7_YMVAAAE8Qg.jpg)\n\n&amp;#x200B;\n\n# # In Short\n\nCloudFlare so far has been shredding forward across multiple technical markets competing against by:\n\n\\- Competing marketshare against CISCO, Palo Alto Networks, and other hardware customers\n\n\\- Offering a way to not lock your organization into a big tech vendor\n\n\\- Promoting security and challenging Big Tech's direction with web development\n\n\\- Forming positive relationships with Shopify, Facebook, JD, Twitter, Baidu, TOR, and Microsoft\n\n\\- Pioneering the ease-of-use privacy movement with [1.1.1.1](https://1.1.1.1/) and distributing VPNs.\n\n\\- Growing a rapid, robust, cost-effective, and secure network across the world\n\n\\- **\\*\\*Providing a development platform that promotes the use extremely powerful and 'cutting edge' computing. -&gt; YOU ARE HERE**\n\n&amp;#x200B;\n\n[Cofounder of NPM - a module system where software developers shipped code. Acquired by Microsoft in the past year.](https://preview.redd.it/2upgkb0gvl251.png?width=1184&amp;format=png&amp;auto=webp&amp;s=4fc9c9c151e75d4b03671760e927bc5a75e8bc85)\n\n&amp;#x200B;\n\n# # So what is this technology anyway? A content delivery network.\n\nCDNs are distributed datacenters. This technology has been rapidly improving in the past 5 years and has drastically reduced the cost of business for small businesses and enterprises alike.\n\nThinking trucking logistics. You need to load up and send heavy duty materials, safely, quickly, and across multiple checkpoints along a highway.\n\nAn easy way to think about CDNs is to imagine it as the E in 4G LTE (Long Term Evolution). Through the power of CDNs, you're able to render images, videos, streams, content, data, transactions, privacy, and much more through the network.\n\n&amp;#x200B;\n\n[Securing digital assets on a reliable infrastructure for the most intensive computing cases.](https://preview.redd.it/dnpn9c3t4m251.png?width=2210&amp;format=png&amp;auto=webp&amp;s=2be51c709a803d5dbac47c4bb471d9ca77bc047c)\n\n&amp;#x200B;\n\n\\# Why does this market matter? Competitive advantages\n\nThe reason Snapchat did not gain any traction did not gain any traction outside of the US was because Facebook provided a fundamentally faster service across WhatsApp and Instagram. Facebook's investment in networking infrastructure allowed them to create a product that was fast , cheap and would work in various rural or economic conditions. Snapchat never stood a chance in the global social media landscape as a result.\n\n&amp;#x200B;\n\n# # What's special about CloudFlare as a network?\n\nWhat CloudFlare specifically offers against its competitors is its privacy-first approach. CloudFlare is essentially a distributed private network (VPN) with a massive infrastructure effort to send data around the world safely and cheaply. Privacy and speed sells.\n\n[Facebook: \"The future is private\"](https://preview.redd.it/gn6ibx4p4m251.png?width=1306&amp;format=png&amp;auto=webp&amp;s=8a88aa1e694ab0e62af8856bdeae914f62cd7182)\n\n&amp;#x200B;\n\n[Cloudflare grows with security](https://preview.redd.it/me09oa3pem251.png?width=2332&amp;format=png&amp;auto=webp&amp;s=658486274c4b3c61fa689c5166b14f8c5775a953)\n\n&amp;#x200B;\n\n# # What is serverless computing?\n\nServerless computing allows a 25 year old developer like me run 5 different businesses on my dinky little Macintosh while I let Google and Cloudflare run my servers under an extremely cheap pricing model. That is a revolutionary change for software.\n\n\\&amp;#x200B;\n\n[Google's ML kit offers developer solutions for common machining problems](https://preview.redd.it/bv4j6nx47m251.png?width=2494&amp;format=png&amp;auto=webp&amp;s=7989e5953258cc5bcc3293971a5780595e949c71)\n\n\\&amp;#x200B;\n\n[Cloudflare lets you create your own and distribute them.](https://preview.redd.it/6n4sn4gc7m251.png?width=1530&amp;format=png&amp;auto=webp&amp;s=cd8b30aa9608e4e4e3d959820716b33b29548898)\n\n&amp;#x200B;\n\n\\# Where Does CloudFlare currently stand in the market?\n\n[In 2020, security and delivery increases.](https://preview.redd.it/spptqgf6yl251.png?width=600&amp;format=png&amp;auto=webp&amp;s=8020aaaacfa37fe2f493f2c7a7b7c6dd4e2f7174)\n\n&amp;#x200B;\n\n[CRWD now at 19.7B, Z-Scaler at 13.3B](https://preview.redd.it/afq494qjzl251.png?width=1154&amp;format=png&amp;auto=webp&amp;s=3a89e1ee92fc1a9c373a9a1109497960231f076d)\n\n[An iron lock on VPN and distributed security](https://preview.redd.it/powropc40m251.png?width=1224&amp;format=png&amp;auto=webp&amp;s=27205ea3a6e282963f801fbf5d4583facbf84c91)\n\n&amp;#x200B;\n\n[Competes against vendor lock in. Cloudflare vs Amazon Cloudfront CDN](https://preview.redd.it/1x6gfsjd0m251.png?width=2444&amp;format=png&amp;auto=webp&amp;s=2d4d6b797bfda3d9f3829f16af6d8bdae392485d)\n\n&amp;#x200B;\n\n[Increases competition in the serverless/cloud computing space](https://preview.redd.it/wrofhb001m251.png?width=1612&amp;format=png&amp;auto=webp&amp;s=b400f0f5bc056d03d7aac046f609f3bcba4ce431)\n\n&amp;#x200B;\n\n[Drastically more edge locaitons than Amazon and Google.](https://preview.redd.it/un437p0u1m251.png?width=800&amp;format=png&amp;auto=webp&amp;s=58d7d269c33eff2868f8316768242960d9fe86c8)\n\n[As a DNS provider](https://preview.redd.it/4yo9rbd64m251.png?width=2472&amp;format=png&amp;auto=webp&amp;s=cc96b24eb9507f30cc6920f4b0d94e2b2a7ecc87)\n\n&amp;#x200B;\n\n# # So what does this mean for CloudFlare?\n\n# ## The missing puzzle piece: CloudFlare TV and Cloudflare Streaming\n\nA big piece that's missing from Cloudflare's economic puzzle is the release and support of distributed video and video development\n\n[Closing the gap on Fastly's primary product (media management)](https://preview.redd.it/1u6lp2as7m251.png?width=1798&amp;format=png&amp;auto=webp&amp;s=815098ee5393a88f35af86017f61c38fa7a2c531)\n\n&amp;#x200B;\n\n[Piece 1: Distributed, private, secure networking](https://preview.redd.it/zoi83xlahm251.png?width=2178&amp;format=png&amp;auto=webp&amp;s=8373be8ffc9e1f1bd54c81b5cde0fc40db98386c)\n\n&amp;#x200B;\n\n[Piece 2: Distributed, private, secure streaming](https://preview.redd.it/v0h5qneggm251.png?width=2262&amp;format=png&amp;auto=webp&amp;s=20990db7b1063a8f6f72b8d63aa8ce1087c3c9de)\n\n&amp;#x200B;\n\n[Piece 3: Distributed, secure, private IT](https://preview.redd.it/j6pnlun3hm251.png?width=2416&amp;format=png&amp;auto=webp&amp;s=08e1eb6556bd86af62096b12ec59e07b00dd2e0a)\n\n&amp;#x200B;\n\n[Piece 4: Distributed, private, secure software development](https://preview.redd.it/h7osbezxgm251.png?width=2330&amp;format=png&amp;auto=webp&amp;s=e1534e944349784a59cad390074ae2f94b9d8220)\n\n&amp;#x200B;\n\n[Piece 5: The missing piece. Distributed, private, secure video.](https://preview.redd.it/kklpe6mrgm251.png?width=1196&amp;format=png&amp;auto=webp&amp;s=c42fbada434f23fbe03b151004fd57b69f236bd9)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # My record\n\nI'm fairly conservative in my choice to purchase option or stock. I'm a software engineer that's passionate about education and have really enjoyed exercising my knowledge-base during this investment time. Usually i get really excited about a stock or two at best per year based on certain global developments. These stocks are selected based on powerful and consequential market relationships or competitions occurring in the and simply just participating in the market as much as I can myself.\n\nI have made a fair amount of money with\n\n\\- Bitcoin &amp; AMD's computing relationship (Bought bitcoin at 2k, AMD at $11)\n\n\\- E-Commerce and Facebook's growing relationship with small businesses (my first options were 20x FB)\n\nI'm currently investing heavily in\n\n\\- Privacy **\\[\\*\\*CloudFlare, Big Tech, US, China, and global development\\*\\*\\]**\n\n\\- Automation, manufacturing, and battery improvements **\\[\\*\\*Panasonic, FANUC, Texas, Mexico and Japan\\*\\*\\]**\n\n\\- Mexican-American trade **\\[\\*\\*Kansas City Union, USMCA, and the Mexican economy\\*\\*\\]**\n\n\\- Virtual Reality, gaming, AI with user-experience support, and fintech **\\[\\*\\*Zoomers &amp; you\\*\\*\\]**",
        "subreddit": "wallstreetbets",
        "title": "Cloudflare and CloudflareTV - A visual guide to understanding CDNs, security networking, and cloud computing for non-technical investors.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gvo3ph/cloudflare_and_cloudflaretv_a_visual_guide_to/",
        "created": 1591192389.0
    },
    {
        "author": "Investinwaffl3s",
        "created_utc": 1591138109,
        "id": "gvhs5y",
        "num_comments": 62,
        "num_crossposts": 0,
        "selftext": "Any good stonks to park my winnings on? Ideally something that won't go tits up (barring a general market crash)?\n\nI am already parked on AAPL, AMZN, BABA (bought in April).\n\nLast week I put a bunch into CSCO and FLIR which worked out nicely.\n\nI am thinking of buying shares of AMD and SNE, but I have no idea what else to buy. Maybe MSFT but I want something that is not near ATH and still has predictable room to grow",
        "subreddit": "wallstreetbets",
        "title": "Need some long term stonks to park some winnings at",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gvhs5y/need_some_long_term_stonks_to_park_some_winnings/",
        "created": 1591166909.0
    },
    {
        "author": "BlueGulfCamel",
        "created_utc": 1591180486,
        "id": "gvrk1y",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "Hi All\n\nI’m am quite new to trading. I have been reading studying and researching stocks. \n\nI had a portfolio of T KO AMD PFE NKE and SP500 index. \n\nWhen the virus hit I held, then sold when the market rebounded around end April start of May for a profit. I sold because I believe the market is overvalued and when Q2 earning come the market will drop. \n\nDue to the QE and FED the market is stable or rising. \nI am hesitant to re enter the market as I still think there will be a crash once Q2 earning are revealed so holding cash for the drop. \n\nI was looking for your opinions if you are keeping a cash reserve or active and if there will be a crash?",
        "subreddit": "stocks",
        "title": "Keeping cash for a fall or still active?",
        "url": "https://www.reddit.com/r/stocks/comments/gvrk1y/keeping_cash_for_a_fall_or_still_active/",
        "created": 1591209286.0
    },
    {
        "author": "Inquisitive10",
        "created_utc": 1591039632,
        "id": "gur4s1",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "24y.o., risk tolerance: high, I have an emergency savings fund and a decent amount in my savings account as well. Plan to be in the market for 25+ years. Amount invested: 50,000.\n\n&amp;#x200B;\n\nMKL - 30%\n\nVFV.TO - 22.5%\n\nMSFT - 10%\n\nAMZN - 10%\n\nDIS - 10%\n\nNVDA - 5%\n\nAMD - 5%\n\nVEE.TO - 5%\n\nQSR.TO - 2.5%\n\nAlways love to hear insights from redditors about my portfolio. I won't take any of it to heart, but I think it is nice to hear everyone's thoughts.",
        "subreddit": "CanadianInvestor",
        "title": "Portfolio Review/Recommendations",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/gur4s1/portfolio_reviewrecommendations/",
        "created": 1591068432.0
    },
    {
        "author": "tommytatertots",
        "created_utc": 1591219130,
        "id": "gw2wy9",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "First, I want to say I know most of us, even the professionals have no idea what is going on, ever.\n\nSecond, nearly every news article and blog to me is consistently wrong. But what really pisses me off is the follow up news articles, postings, etc have a bogus explanation why something happened. The information that should of been presented prior if it were a true future analysis. There is no benefit figuring out a short term explanation for increase or decrease in a stock after the fact when the stock market is a future fight.\n\nFinally, I am no better than anyone else, but I get gut feeling on some stocks that just stand out based of their trend and my intuition. I haven't got cocky and gone all out on any of these, but I have strong feelings. For example:\n\no 2016 I invested $200 dollars into AMD (60 Shares) which is worth \\~$3200 today. I was looking through various businesses and saw AMD significantly lower than Intel at the time. It was like 2 dollars a share! I was certain it would have substantial growth, maybe dumb luck, maybe intuition. I won't lie, I have no idea when to sell and rarely do. They still appear to be doing so well and will have a significant hand in AI, future of gaming and other technologies. \n\no 2020 At the bottom of Tesla's stock in March trading about \\~350 a share, I knew that would quickly rebound as the future is now, the clear path to transportation is self driving just as significant as all revolutionary technologies. For me, when I retire in 30-40 years I see myself in a self driving RV, with virtual reality capabilities. So, I held off on Tesla at this time because I listed to people full of shit thinking the economy was going to crash and Tesla would be worth less than 250 a share. \n\no Currently, I've invested in a couple commercial airliners, because look at those margins. Analyzing how long it takes airlines to recover, I say full recovery in 2-3 years. I eyeballed Boeing hard, many articles cautioning 'too big to fail' what a load of garbage. They are critical to national transportation. I was going to put down $1,000 on them at about $120 per share. They are up to $173 per share today, and I believe this is only the beginning. \n\no Also, Ford is a lot like the airlines, I have watch this stock sadly die away for four years, and I don't think it will be gone for good. It was \\~9 a share prior to COVID, and went sub $5. I bought a little then and I think they could get to $7 maybe even 8$ before continued their downward trend. \n\nI deviated with my own holdings, but I want this to be about inaccurate articles saying we are going into a recession, specific companies are the next Apple/Amazon that usually go down. Seriously, look up old news articles on companies are overwhelmingly wrong. \n\nIf you are curious of my holdings: ALK, F, SBUX, WEN, MSFT, TSLA, CSCO, SFM, NVIDIA, KR, AMD, CANN\n\nIn the past 4 years, I have 50% gain. Whatever you do, don't buy CANN, I knew this was a dumb move, but i had a little greed in me when I did it.",
        "subreddit": "investing",
        "title": "Is it just me or is all investment news always wrong?",
        "url": "https://www.reddit.com/r/investing/comments/gw2wy9/is_it_just_me_or_is_all_investment_news_always/",
        "created": 1591247930.0
    },
    {
        "author": "Joloven",
        "created_utc": 1591206580,
        "id": "gvyohx",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "My AMD is up 9%. I'm thinking about selling and buying citibank, not sure if this  s is wise.\n\nI sold bud at 42 a share to buy facebook. Right now I am kicking myself but I don't think I want to buy bud back. Took a 4 dollar a share loss in that.\n\nMy best buys this year were Google, discover and amc. All three are up consistently. I sold xlu for discover, pondering if I want a little xlu back now.\n\nLost money on moderna and gilead but are holding these.\n\nMade modest 20% profits on disney. I think I might hold this.\n\nI invested in visa and am moderately happy with the results. Still my results are only 90% as good as what s&amp;p would have been. Should I just buy some s&amp;p and hold for a bit?",
        "subreddit": "StockMarket",
        "title": "How are your investments going?",
        "url": "https://www.reddit.com/r/StockMarket/comments/gvyohx/how_are_your_investments_going/",
        "created": 1591235380.0
    },
    {
        "author": "Stlblues1516",
        "created_utc": 1591287226,
        "id": "gwkheq",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "I am looking to add some growth stocks to my portfolio and was looking to see what people like most.\n\nCurrently my portfolio consists of the following:\nTsla\nFb\nMsft\nGoog\nAmd\nSq\nSbux\nMa\nV\nAbt\nAxp\nJpm\nC\nDis\nCcl\nDal\nNke \nXom \n\nI am looking for something in the sq/amd/tsla range with higher upsides rather than the faangs.",
        "subreddit": "stocks",
        "title": "Favorite growth stocks",
        "url": "https://www.reddit.com/r/stocks/comments/gwkheq/favorite_growth_stocks/",
        "created": 1591316026.0
    },
    {
        "author": "nmcal",
        "created_utc": 1591321137,
        "id": "gwv3ui",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "New investor here, looking to pick up my first ETF. \n\nI’m considering VYM, but I’ve seen a lot of people say VOO. Would either be a good first ETF buy?\n\nHere is my current portfolio, % of Portfolio is almost dead even across all tickers.\n\nT BAC STOR KO F NRZ MGM AMD",
        "subreddit": "stocks",
        "title": "Picking my first ETF",
        "url": "https://www.reddit.com/r/stocks/comments/gwv3ui/picking_my_first_etf/",
        "created": 1591349937.0
    },
    {
        "author": "Motahababy",
        "created_utc": 1591285167,
        "id": "gwjttb",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "OTLK DD - done by Prado\n\n**What is Outlook Therapeutics &amp; what do they do?**\n\n* [Outlook Therapeutics is a late clinical-stage](https://outlooktherapeutics.com/about/overview/) biopharmaceutical company working to develop the first FDA-approved ophthalmic formulation of bevacizumab for use in approved retinal indications.\n\n* Their goal is to launch ONS-5010 as the first and only approved ophthalmic formulation of bevacizumab in the United States, Europe, Japan and other markets for the treatment of wet age-related macular degeneration (wet AMD), diabetic macular edema (DME) and branch retinal vein occlusion (BRVO).\n\n**What is ONS-5010/Lytenava?** \n\n* [ONS-5010 is an investigational ophthalmic formulation of bevacizumab](https://outlooktherapeutics.com/lytenava-overview/) under development to be administered as an intravitreal injection for the treatment of wet AMD and other approved retinal diseases.\n* If approved, ONS-5010 will be the first and only FDA-approved ophthalmic formulation of bevacizumab for retinal indications.\n\n**What does their Pipeline product (ONA-5010/Lytenava) plan to treat?**\n\n* With ONS-5010, [which will be named Lytenava](https://www.globenewswire.com/news-release/2020/03/05/1995800/0/en/Outlook-Therapeutics-Announces-LYTENAVA-bevacizumab-vikg-Anticipated-Brand-Name-for-ONS-5010-If-Approved.html), they plan to treat:\n * Wet AMD\n * DME\n * BRVO\n\n**What is Wet AMD?**\n\n* Wet AMD is also known as Wet Age-related Macular Degeneration\n\n* In [the “wet” type of macular degeneration](https://www.macular.org/wet-amd), abnormal blood vessels (known as choroidal neovascularization or CNV) grow under the retina and macula. These new blood vessels may then bleed and leak fluid, causing the macula to bulge or lift up from its normally flat position, thus distorting or destroying central vision. Under these circumstances, vision loss may be rapid and severe.\n\n* Right now, the three standard forms of treatment for Wet AMD is **Eylea,  Lucentis &amp; Bevacizumab** [Link1](https://www.webmd.com/eye-health/macular-degeneration/qa/what-are-the-treatments-for-wet-macular-degeneration) [Link 2](https://www.mayoclinic.org/diseases-conditions/wet-macular-degeneration/diagnosis-treatment/drc-20351113)\n\n**What is DME?**\n\n* It is also known as Diabetic macular edema\n* In people with diabetes, too much blood sugar can damage the tiny blood vessels at the back inner wall of the eye (retina) or block them completely. This condition is diabetic retinopathy. Sometimes, tiny bulges (microaneurysms) protrude from the vessel walls, leaking or oozing fluid and blood into the retina. This fluid can cause swelling (edema) in the central part of the retina (macula). This is a [serious eye complication called diabetic macular edema](https://www.mayoclinic.org/diseases-conditions/diabetic-retinopathy/multimedia/diabetic-macular-edema/img-20124558) that can cause vision problems or blindness.\n* As previously mentioned with Wet AMD, the standard form of treatment right now for patients with DME is the [use of Eylea &amp; Lucentis](https://www.webmd.com/eye-health/diabetic-macular-edema-treatment)\n\n**What is BRVO?**\n* BRVO is also known as Branch Retinal Vein Occlusion\n* Arteries and veins carry blood throughout your body, including your eyes. The eye’s retina has one main artery and one main vein. When branches of the retinal vein become blocked, it is called branch retinal vein occlusion (BRVO). When the vein is blocked, blood and fluid spills out into the retina. The macula can swell from this fluid, affecting your central vision. Eventually, without blood circulation, nerve cells in the eye can die causing a loss of vision.\n* Just like the previous two, the standard form of treatment applies to BRVO as well which is [Eylea &amp; Lucentis](https://www.nvisioncenters.com/conditions/branch-retinal-vein-occlusion/)\n\n**What are the current forms of treat for the mentioned eye diseases?**\n* Current form of treatment is known as [Anti-VEGF drugs](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4322736/#s1title)\n*Those Anti-VEGF drugs are: Bevacizumab, Lucentis &amp; Eylea\n* Bevacizumab:\n * Bevacizumab is also known as Avastin. Avastin is the brand name for the drug, which is called bevacizumab. [It blocks the growth of abnormal blood vessels in the back of the eye.](https://www.aao.org/eye-health/drugs/avastin) Those blood vessels can leak and affect vision, causing vision loss from wet AMD and diabetic eye disease.\n* Lucentis:\n * Lucentis is the brand name for the drug, which is called ranibizumab. [It works by keeping new blood vessels from forming](https://www.drugs.com/lucentis.html) under the retina (a sensory membrane that lines the inside of the eye). In people with certain types of eye disorders, new blood vessels grow under the retina where they leak blood and fluid.\n* Eylea:\n * Eylea is a type of drug called a vascular endothelial growth factor inhibitor. [It reduces leaking from blood vessels](https://www.medicalnewstoday.com/articles/eylea) in the eye and slows down the growth of new blood vessels.\n\n**How does Lytenava work as treatment?**\n* It is a full-length, humanized anti-VEGF (Vascular Endothelial Growth Factor) recombinant monoclonal antibody (or mAb) that [inhibits VEGF and associated angiogenic activity](https://www.biospace.com/article/releases/outlook-therapeutics-announces-lytenava-bevacizumab-vikg-anticipated-brand-name-for-ons-5010-if-approved/). With wet AMD, abnormally high levels of VEGF are secreted in the eye. VEGF is a protein that promotes the growth of new abnormal blood vessels. Anti-VEGF injection therapy blocks this growth.\n* If it is approved, it will become the first FDA Approved opthalmic formulation of Bevacizumab. \n* It is a very big deal in this particular industry because the standard regular Bevacizumab [accounts for an estimated 50% of all wet AMD prescriptions in the United States](https://outlooktherapeutics.com/lytenava-overview/)\n\n**Overview of their Pipeline Product, Lytenava**\n* [If approved and commercialized for ophthalmic use, ONS-5010 has the potential to help](https://outlooktherapeutics.com/pipeline/unmet-patient-needs/) address the existing quality, safety and availability issues associated with repackaged IV bevacizumab from compounding pharmacists (e.g., cGMP-quality control issues, product shortages, inconsistent potency, sterility issues and liability risks associated with off-label, unregulated use of repackaged bevacizumab).\n* ONS-5010 has the potential, if approved and commercialized with a responsible pricing strategy, to help lower the aggregate costs of treating retinal diseases for the overall healthcare system.\n* Doctors who wish to treat their retinal patients with a less expensive anti-VEGF drug often use bevacizumab But because there is no FDA-approved ophthalmic formulation of bevacizumab, doctors must use repackaged IV bevacizumab provided by compounding pharmacists. The repackaged intravenous (IV) bevacizumab for ophthalmic use that is provided by compounding pharmacies can carry known risks of contamination and inconsistent potency, with potentially severe consequences, as leading retinal societies have reported. To combat this, [Outlook firmly believes that Lytenava will avoid the potential safety, sterility, potency, availability and syringe drawbacks](https://outlooktherapeutics.com/pipeline/repackaged-bevacizumab/) that can occur with repackaged intravenous (IV) bevacizumab from compounding pharmacies.\n\n\n**Current prices of the three Anti-VEGF treatments &amp; OTLK's statement regarding their projected price**\n* [Bevacizumab:](https://www.google.com/amp/s/www.businessinsider.com/price-difference-lucentis-and-avastin-2014-6%3famp) Average cost per dose is around $55\n* [Lucentis:](https://www.google.com/amp/s/www.businessinsider.com/price-difference-lucentis-and-avastin-2014-6%3famp) Average costs of $2000 per dose\n* [Eylea:](https://www.drugs.com/price-guide/eylea&amp;ved=2ahUKEwjgmfG4kdDpAhXPrJ4KHavJB4kQFjABegQIDBAG&amp;usg=AOvVaw0v8XRHazcPNDLUpe7GqZBQ&amp;cshid=1590448291724) Average cost of around $1900 per dose\n* [Lytenava:](https://outlooktherapeutics.com/pipeline/new-anti-vegf-for-ophthalmic_indications/) As stated by Outlook Therapeutics, \"Outlook Therapeutics expects to establish responsible pricing for ONS-5010, if approved. If approved for marketing, ONS-5010 has the potential to help lower the aggregate costs of treating retinal diseases for the overall healthcare system.\" Seeing that **Bevacizumab** is already very cheap compared to the other two treatments, this gives you a range/estimated price of what Lytenava will be.\n\n**Q2 Financials report**\n* Earnings for [Q2 was reported](https://ir.outlooktherapeutics.com/news-releases/news-release-details/outlook-therapeutics-reports-financial-results-second-quarter) back on May 15th 2020\n* Operating income (EBITDA)\n * Estimated: -8.43M, Reported: -6.76M, Difference: +20%\n* Operating profit (EBIT)\n *Estimated: -8.95M, Reported: -5.70M, Difference: +36%\n* For the fiscal second quarter ended March 31, 2020, the Company reported a net loss attributable to common stockholders of $17.5 million, or $0.36 per basic and diluted share, compared to a net loss attributable to common stockholders of $11.3 million, or $0.98 per basic and diluted share, for the same period last fiscal year. For the fiscal second quarter ended March 31, 2020, the Company also reported an adjusted net loss attributable to common stockholders of $6.4 million, or $0.13 per basic and diluted share, as compared to an adjusted net loss attributable to common stockholders of $6.7 million, or $0.58 per basic and diluted share, for the same period last fiscal year.\n* Links to their financials: [Link1](https://ir.outlooktherapeutics.com/news-releases/news-release-details/outlook-therapeutics-reports-financial-results-second-quarter) [Link 2](https://m.marketscreener.com/OUTLOOK-THERAPEUTICS-INC-57291679/calendar/) [Link3](https://www.marketwatch.com/press-release/10-q-outlook-therapeutics-inc-2020-05-15?mod=mw_quote_news) [Link 4](https://research.tdameritrade.com/grid/public/research/stocks/earnings?symbol=OTLK)\n\n**Corporate Presentation**\n*Highlights of the presentation includes:\n * Potential FDA Approval in 2022\n * Targeting $9.1 Billion Anti-VEGF Market1\n * Potential for 12 Years of Market Exclusivity\n * Has the potential to replace standard Bevacizumab as the first line for therapies as currently, Eylea &amp; Lucentis are used if Bevacizumab fails.\n * Their regulatory Strategy Aligned with FDA guidelines thus further cementing the forecast of FDA approval.\n* Here is the [link to their corporate Presentation](https://ir.outlooktherapeutics.com/static-files/2363481b-db6a-45e7-9bcc-dbb2b90a769c)\n\n**Lytenava Manufacturing deal signed with Fujifilm Diosynth Biotechnologies**\n* Outlook Therapeutics [signed a master services agreement with FUJIFILM Diosynth Biotechnologies (FDB) for the production of ONS-5010.](https://www.globenewswire.com/news-release/2019/06/03/1863195/0/en/Outlook-Therapeutics-Signs-Manufacturing-Supply-Agreement-with-FUJIFILM-Diosynth-Biotechnologies-as-Part-of-Commercialization-Strategy-for-ONS-5010.html) Under the terms of this agreement, FDB will provide global manufacturing of ONS-5010 to Outlook in support of the commercialization strategy for the drug. \n* Their master services agreement with FDB secures a world class manufacturing facility for the potential commercial launch of ONS-5010. Most importantly, FDB has the ability to rapidly scale manufacturing of ONS-5010 while maintaining the quality controls that meet or exceed regulatory requirements.\n* This new partnership with FDB is a critical next step as ONS-5010 advances through Phase 3 clinical trials towards a BLA submission they are planning for late 2020.\n* [Link](https://ir.outlooktherapeutics.com/news-releases/news-release-details/outlook-therapeutics-signs-manufacturing-supply-agreement) to the signing of their manufacturing agreement\n\n**Events to positively impact Q1-Q4**\n* On April 1st 2019, Outlook [announced the U.S. Food and Drug Administration (FDA) acceptance](https://ir.outlooktherapeutics.com/news-releases/news-release-details/outlook-therapeutics-announces-fda-acceptance-ind-ons-5010) and activation of the Investigational New Drug (IND) application of Lytenava. \n * The Company is now able to begin enrolling patients with wet AMD in the U.S. portion of its ONS-5010-002 Phase 3 clinical trial\n* On June 3rd 2019, [Outlook Therapeutics announced](https://ir.outlooktherapeutics.com/news-releases/news-release-details/outlook-therapeutics-signs-manufacturing-supply-agreement) that they signed a master services agreement with FUJIFILM Diosynth Biotechnologies (FDB) for the production of ONS-5010. \n* On July 16th 2019, [Outlook Therapeutics announced](https://ir.outlooktherapeutics.com/news-releases/news-release-details/outlook-therapeutics-doses-first-patient-second-phase-3-clinical) that they have dosed the first patient in the ONS-5010-002 Phase 3 clinical trial.\n * This represents the achievement of another important milestone in our streamlined clinical and regulatory strategy, which is designed to support a Biologics License Application, or BLA, submission for ONS-5010 in wet AMD by the end of 2020. \n* On December 3rd 2019, [Outlook Therapeutics announced](https://ir.outlooktherapeutics.com/news-releases/news-release-details/outlook-therapeutics-receives-fda-agreement-three-special) that they received an agreement from the FDA on three Special Protocol Assessments (“SPAs”) for three additional registration clinical trials for its ongoing Phase 3 program for ONS-5010. The agreements reached with the FDA on these SPAs cover the protocols for NORSE 4, a registration clinical trial to treat BRVO, and NORSE 5 and NORSE 6, two registration clinical trials to treat DME. Outlook Therapeutics intends to initiate NORSE 4, 5 and 6 in 2020.\n* On January 28th 2020, [OTLK announced](https://ir.outlooktherapeutics.com/news-releases/news-release-details/outlook-therapeutics-announces-agreements-streamline-capital) that they entered into agreements with BioLexis Pte, its largest stockholder, and MTTR, its development partner for ONS-5010, to better align the interests of all parties with the Company’s common stockholders and support the continued development of ONS-5010. This agreement will Streamline Capital Structure and Regain 100% Ownership of Any Future Net Profits for ONS-5010.\n* On February 26th 2020, [OTLK announced](https://ir.outlooktherapeutics.com/news-releases/news-release-details/outlook-therapeutics-announces-closing-102-million-financings) the Closing of $10.2 Million Financings Priced At-The-Market.\n* On March 5th 2020, [OTLK announced](https://ir.outlooktherapeutics.com/news-releases/news-release-details/outlook-therapeutics-announces-lytenavatm-bevacizumab-vikg) that the FDA has made a tentative approval of the Tradename for ONS-5010 as Lytenava.\n* On April 21st 2020, [OTLK Announced](https://ir.outlooktherapeutics.com/news-releases/news-release-details/outlook-therapeutics-bolsters-clinical-and-commercial-expertise) that they have bolstered its Board of Directors with the appointments of Prof. Dr. Gerd Auffarth and Mr. Julian Gangolli.\n * Prof. Dr. Auffarth is an internationally recognized ophthalmologist in the area of research and development as well as clinical care for patients. He currently serves as the Medical Director of Heidelberg University Eye Clinic. is considered one of the most experienced surgeons in cataract and corneal surgery.\n * Mr. Gangolli is a leader in commercialization with a well-established track record and experience, having served as President of the North American Pharmaceutical division of Allergan, Inc. for 11 years where he was a member of the Executive Committee of Allergan and was responsible for a 1,400-person commercial operation with sales exceeding $3.8 billion in 2014.\n\n**Very important upcoming date**\n* In August 2020, Outlook Therapeutics will announce the topline results for the clinical studies done on Lytenava\n* As [stated by Outlook Therapeutics:](https://ir.oncobiologics.com/news-releases/news-release-details/outlook-therapeutics-reports-financial-results-second-quarter) \"Company remains on track to report topline data results from NORSE 1, it's first registration clinical trial evaluating LOns-5010, an investigational ophthalmic formulation of Bevacizumab to treat wet AMD, in August 2020.\"\n\n**Target price &amp; forecasts**\n* [CNN Money](https://money.cnn.com/quote/forecast/forecast.html?symb=otlk) sets the median target of **$6.00**, with a high estimate of **$11.00** and a low estimate of **$3.25**\n* [TipRanks](https://www.tipranks.com/stocks/otlk/price-target) sets The average price target of $9.50 with a high forecast of $11.00 and a low forecast of $8.00\n* [NASDAQ website](https://www.nasdaq.com/market-activity/stocks/otlk/analyst-research) sets it at a **strong buy**. They set the average price target of $9.5 with a high estimate of $11 and a low estimate of $8.\n* [The Wall Street Journal](https://www.wsj.com/market-data/quotes/OTLK/research-ratings) sets the average target price of **$6.65** with a low TP of **$3.25**, median TP of **$6.00** and a high TP of **$11.00**\n\n**Important SEC filings &amp; presentation I highly recommend you read**\n* Latest [SEC Filing](https://ir.outlooktherapeutics.com/node/8706/html)\n* [Corporate Presentation](https://ir.outlooktherapeutics.com/static-files/2363481b-db6a-45e7-9bcc-dbb2b90a769c)\n\n**Risks involved**\n* As with everything good in life, there are always risks present.\n* One of the biggest risks is if the Topline data from the studies that will be announced in August are not good, then it will cause big problems from the company as everything that they are is behind this product being successful\n* Another risk, as stated on [their latest SEC Filings:](https://ir.outlooktherapeutics.com/node/8706/html) \"On March 27, 2020, we received written notification from The Nasdaq Stock Market LLC, or Nasdaq, indicating that as of March 27, 2020, we were not in compliance with Nasdaq Listing Rule 5550(a)(2) for continued listing on The Nasdaq Capital Market, as the minimum bid price of our listed securities was less than $1.00 per share for the previous 30 consecutive business days.\"\n * They have been given until December 7th 2020 to reach compliance. If they do not reach compliance, they run the risk of being \"delisted from Nasdaq and begin trading in the over-the-counter markets if we are not successful in regaining compliance with Nasdaq’s continued listing standards, which may negatively impact the price of our common stock and our ability to access the capital markets.\"\n\n**Final thoughts &amp; comments**\n* For starters, I will get this out of the way as I usually do. Please do not see the stock symbol and then blindly make purchases tomorrow when the market opens. Please read each and every single link, sec &amp; presentation I have linked to my posts.\n* I want you guys to read this post and obtain as much knowledge as possible so **you** can make the best well informed decision on your own.\n*Anyways, as for myself, alongside with my previous DD post, I do not have any shares in this stock. But tomorrow I will definitely purchase 500-1000 shares tomorrow as I, myself, truly am confident in this company and their products\n * I feel so confident in them because of the two new board members they've brought in, the manufacturing agreement with Fujifilm, the agreement to streamline their capital and secure 100% of net profits of future sales of Lytenava &amp; because they've been on track with their clinical studies.\n\nIt’s going to hit $3 by the end of next week. And $5 by July. \n\nGoodluck to all",
        "subreddit": "pennystocks",
        "title": "OTLK",
        "url": "https://www.reddit.com/r/pennystocks/comments/gwjttb/otlk/",
        "created": 1591313967.0
    },
    {
        "author": "codingprofessor",
        "created_utc": 1591158980,
        "id": "gvn3n3",
        "num_comments": 9,
        "num_crossposts": 1,
        "selftext": "tl;dr: $40c 8/21 &amp;&amp; 35c 7/17\n\n&amp;#x200B;\n\n\\# Goals\n\n\\- Answer \"What am I investing in when I risk money with CloudFlare?\"\n\n\\- Answer \"What's the difference between Fastly and Cloudflare?\"\n\n&amp;#x200B;\n\n\\# The thesis\n\nThe economic value and convergence between e-commerce, networking speeds, and video advancements is not anywhere close to realized. There has been an acceleration toward this reality but it's still early in the overall development cycle. \n\nPhysical and monetary assets being virtualized has recently been accelerated in importance and this will have positive effects, across time, on businesses that focus on securing those assets in its time spent delivering on multiple ultra-high-speed networks across the world.  Computing is getting cheaper and easier to distribute in rather extreme ways and the execution of these ideas is happening right now.\n\nThe need for secure video, transactions, VR, and user experiences will be dramatically shot up and this is evident across many exciting technologies like Apple VR, Google Gaming, Square Banking, Facebook Shops with VR shopping, Microsoft software automations, and government developments.\n\nInfrastructure that support these interactive ecosystems will be growing at incredible rates. NET is one of the best positioned companies to pioneer this market.\n\n[This graph has been crunched where 2019 skips straight to 2021-2023 levels.](https://preview.redd.it/2u6ede9bul251.png?width=1392&amp;format=png&amp;auto=webp&amp;s=95bf6696f2deaec72d5b3cce869d0aef5d2e59f9)\n\n&amp;#x200B;\n\n\\# My motivation\n\nCloudFlare is releasing and bolstering support for streaming, video, and communications as a security-first cloud provider in the following week. This, on top of its rapidly growing developer platform, is consequential for many reasons as a market-mover in the industry. \n\n&amp;#x200B;\n\n\\# In Short\n\nCloudFlare so far has been shredding forward across multiple technical markets competing against by:\n\n\\- Competing marketshare against CISCO, Palo Alto Networks, and other hardware customers \n\n\\- Offering a way to not lock your organization into a big tech vendor\n\n\\- Promoting security and challenging Big Tech's direction with web development\n\n\\- Forming positive relationships with Shopify, Facebook, JD, Twitter, Baidu, TOR, and Microsoft\n\n\\- Pioneering the ease-of-use privacy movement with [1.1.1.1](https://1.1.1.1) and distributing VPNs.\n\n\\- Growing a rapid, robust, cost-effective, and secure network across the world \n\n\\- \\*\\*Providing a development platform that promotes the use extremely powerful and 'cutting edge'  computing. -&gt; YOU ARE HERE\n\n&amp;#x200B;\n\n[Co-founder of NPM, a system developers used to send software modules. Pioneers in web computing. Acquired by Microsoft](https://preview.redd.it/2upgkb0gvl251.png?width=1184&amp;format=png&amp;auto=webp&amp;s=4fc9c9c151e75d4b03671760e927bc5a75e8bc85)\n\n&amp;#x200B;\n\n\\# So what is this technology anyway? A content delivery network.\n\nCDNs are distributed datacenters. This technology has been rapidly improving in the past 5 years and has drastically reduced the cost of business for small businesses and enterprises alike.\n\nThinking trucking logistics. You need to load up and send heavy duty materials, safely, quickly, and across multiple checkpoints along a highway.\n\nAn easy way to think about CDNs is to imagine it as the E in 4G LTE (Long Term Evolution). Through the power of CDNs, you're able to render images, videos, streams, content, data, transactions, privacy, and much more through the network.\n\n&amp;#x200B;\n\n[As a pioneer in the e-commerce space](https://preview.redd.it/dnpn9c3t4m251.png?width=2210&amp;format=png&amp;auto=webp&amp;s=2be51c709a803d5dbac47c4bb471d9ca77bc047c)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# Why does this market matter? Competitive advantages\n\nThe reason Snapchat did not gain any traction did not gain any traction outside of the US was because Facebook provided a fundamentally faster service across WhatsApp and Instagram. Facebook's investment in networking infrastructure allowed them to create a product that was fast , cheap and would work in various rural or economic conditions. Snapchat never stood a chance in the global social media landscape as a result.\n\n&amp;#x200B;\n\n\\# What's special about CloudFlare as a network?\n\nWhat CloudFlare specifically offers against its competitors is its privacy-first approach. CloudFlare is essentially a distributed private network (VPN) with a massive infrastructure effort to send data around the world safely and cheaply.  Privacy and speed sells.  \n\n\n&amp;#x200B;\n\n[Facebook: \\\\\"The future is private\\\\\"](https://preview.redd.it/gn6ibx4p4m251.png?width=1306&amp;format=png&amp;auto=webp&amp;s=8a88aa1e694ab0e62af8856bdeae914f62cd7182)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/me09oa3pem251.png?width=2332&amp;format=png&amp;auto=webp&amp;s=658486274c4b3c61fa689c5166b14f8c5775a953\n\n\\# What is serverless computing?\n\nServerless computing allows a 25 year old developer like me run 5 different businesses on my dinky little Macintosh while I let Google and Cloudflare run my servers under an extremely cheap pricing model. That is a revolutionary change for software.\n\n&amp;#x200B;\n\n[Google's ML kit offers developer solutions for common machining problems](https://preview.redd.it/bv4j6nx47m251.png?width=2494&amp;format=png&amp;auto=webp&amp;s=7989e5953258cc5bcc3293971a5780595e949c71)\n\n&amp;#x200B;\n\n[Cloudflare lets you create your own and distribute them.](https://preview.redd.it/6n4sn4gc7m251.png?width=1530&amp;format=png&amp;auto=webp&amp;s=cd8b30aa9608e4e4e3d959820716b33b29548898)\n\n&amp;#x200B;\n\n\\# Where Does CloudFlare currently stand in the market?\n\n[In 2020, security and delivery increases.](https://preview.redd.it/spptqgf6yl251.png?width=600&amp;format=png&amp;auto=webp&amp;s=8020aaaacfa37fe2f493f2c7a7b7c6dd4e2f7174)\n\n&amp;#x200B;\n\n[CRWD now at 19.7B, Z-Scaler at 13.3B](https://preview.redd.it/afq494qjzl251.png?width=1154&amp;format=png&amp;auto=webp&amp;s=3a89e1ee92fc1a9c373a9a1109497960231f076d)\n\n  \n\n\n[An iron lock on VPN and distributed security](https://preview.redd.it/powropc40m251.png?width=1224&amp;format=png&amp;auto=webp&amp;s=27205ea3a6e282963f801fbf5d4583facbf84c91)\n\n&amp;#x200B;\n\n[Competes against vendor lock in. Cloudflare vs Amazon Cloudfront CDN](https://preview.redd.it/1x6gfsjd0m251.png?width=2444&amp;format=png&amp;auto=webp&amp;s=2d4d6b797bfda3d9f3829f16af6d8bdae392485d)\n\n&amp;#x200B;\n\n[Increases competition in the serverless\\/cloud computing space](https://preview.redd.it/wrofhb001m251.png?width=1612&amp;format=png&amp;auto=webp&amp;s=b400f0f5bc056d03d7aac046f609f3bcba4ce431)\n\n&amp;#x200B;\n\n[Drastically more edge locaitons than Amazon and Google.](https://preview.redd.it/un437p0u1m251.png?width=800&amp;format=png&amp;auto=webp&amp;s=58d7d269c33eff2868f8316768242960d9fe86c8)\n\n[As a DNS provider](https://preview.redd.it/4yo9rbd64m251.png?width=2472&amp;format=png&amp;auto=webp&amp;s=cc96b24eb9507f30cc6920f4b0d94e2b2a7ecc87)\n\n&amp;#x200B;\n\n\\# So what does this mean for CloudFlare?   \n\n\n\\## The missing puzzle piece: CloudFlare TV and Cloudflare Streaming\n\nA big piece that's missing from Cloudflare's economic puzzle is the release and support of distributed video and video development\n\n[Closing the gap on Fastly's  primary product \\(media management\\)](https://preview.redd.it/1u6lp2as7m251.png?width=1798&amp;format=png&amp;auto=webp&amp;s=815098ee5393a88f35af86017f61c38fa7a2c531)\n\n&amp;#x200B;\n\n[Piece 1: Distributed, private, secure networking](https://preview.redd.it/zoi83xlahm251.png?width=2178&amp;format=png&amp;auto=webp&amp;s=8373be8ffc9e1f1bd54c81b5cde0fc40db98386c)\n\n&amp;#x200B;\n\n[Piece 2: Distributed, private, secure streaming](https://preview.redd.it/v0h5qneggm251.png?width=2262&amp;format=png&amp;auto=webp&amp;s=20990db7b1063a8f6f72b8d63aa8ce1087c3c9de)\n\n&amp;#x200B;\n\n[Piece 3: Distributed, secure, private IT](https://preview.redd.it/j6pnlun3hm251.png?width=2416&amp;format=png&amp;auto=webp&amp;s=08e1eb6556bd86af62096b12ec59e07b00dd2e0a)\n\n&amp;#x200B;\n\n[Piece 4: Distributed, private, secure software development](https://preview.redd.it/h7osbezxgm251.png?width=2330&amp;format=png&amp;auto=webp&amp;s=e1534e944349784a59cad390074ae2f94b9d8220)\n\n&amp;#x200B;\n\n[Piece 5: The missing piece. Distributed, private, secure video.](https://preview.redd.it/kklpe6mrgm251.png?width=1196&amp;format=png&amp;auto=webp&amp;s=c42fbada434f23fbe03b151004fd57b69f236bd9)\n\nPiece 2\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# My record\n\nI'm fairly conservative in my choice to purchase option or stock. I'm a software engineer that's passionate about education and have really enjoyed exercising my knowledge-base during this investment time. Usually i get really excited about a stock or two at best per year based on certain global developments. These stocks are selected based on powerful and consequential market relationships or competitions occurring in the and simply just participating in the market as much as I can myself. \n\nI have made a fair amount of money with\n\n\\- Bitcoin &amp; AMD's computing relationship (Bought bitcoin at 2k, AMD at $11)\n\n\\- E-Commerce and Facebook's growing relationship with small businesses  (my first options were 20x FB)\n\nI'm currently investing heavily in\n\n\\- Privacy \\[\\*\\*CloudFlare, Big Tech, US, China, and global development\\*\\*\\]\n\n\\- Automation, manufacturing, and battery improvements \\[\\*\\*Panasonic, FANUC, Texas, Mexico and Japan\\*\\*\\]\n\n\\- Mexican-American trade \\[\\*\\*Kansas City Union, USMCA, and the Mexican economy\\*\\*\\]\n\n\\- Virtual Reality, gaming, AI with user-experience support, and fintech \\[\\*\\*Zoomers &amp; you\\*\\*\\]",
        "subreddit": "wallstreetbets",
        "title": "Cloudflare's upcoming release of CloudflareTV - A Visual Guide to understanding CDNs, cybersecurity, and cloud computing as a non-technical investor.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gvn3n3/cloudflares_upcoming_release_of_cloudflaretv_a/",
        "created": 1591187780.0
    },
    {
        "author": "HeidNuu",
        "created_utc": 1591208449,
        "id": "gvzbz1",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "(OP Newbie alert) \n\nTheir stock prices are dropping and their growth seems pretty solid. Would it be a good idea to invest in them even today? I noticed some people talking about it some days ago but idk if I missed the train or not. Thanks in advance. \n\nOn another note.. I have 3k to throw down... any hot grabs floating in the wind that I can look into? Trying to fast track to a house :). Right now I have AMD, TMO, BILI, ZNGA, GAN",
        "subreddit": "stocks",
        "title": "Buy some shares in NET?",
        "url": "https://www.reddit.com/r/stocks/comments/gvzbz1/buy_some_shares_in_net/",
        "created": 1591237249.0
    },
    {
        "author": "esportsdude3",
        "created_utc": 1591219658,
        "id": "gw33cl",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "AMD - 2.7\nENPH - 1\nNET - 1.2\nT - 1\nKO - 1\n\nThis is my portfolio so far. I’m buying more positions in these stocks just building it up and still have a few stocks that I’m currently looking into. I’m long on all of them. Let me know what your thoughts are. I was thinking of getting into an ETF but not sure what to invest in. I’m from the UK and us Trading212 so my stocks are limited to that. If anyone could give me some advice on an ETF to look into I’m happy to do my own DD just would like some ideas. Cheers guys!",
        "subreddit": "investing",
        "title": "My portfolio and a question about ETF’s",
        "url": "https://www.reddit.com/r/investing/comments/gw33cl/my_portfolio_and_a_question_about_etfs/",
        "created": 1591248458.0
    },
    {
        "author": "shreyasbkulkarni",
        "created_utc": 1591325161,
        "id": "gww6h5",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Was wondering what you guys think of Broadcom ($AVGO) in the semicon space? It is currently priced at $310+ and reported a $5.14 EPS, meeting expectations. Given that it has a good IP portfolio, do you think the stock is reasonably priced right now?\n\nFor comparisons, AVGO has a P/E of ~50, while INTC is at 12, QCOM at 25 and AMD at 130.\n\nI’m a total noob, but I was thinking of investing in it. But I felt $300+ is a bit steep given the current scenario in the market. How would you evaluate it?\nLooking for some advise.",
        "subreddit": "investing",
        "title": "Thoughts on Broadcom ($AVGO)?",
        "url": "https://www.reddit.com/r/investing/comments/gww6h5/thoughts_on_broadcom_avgo/",
        "created": 1591353961.0
    },
    {
        "author": "780jatt",
        "created_utc": 1591295866,
        "id": "gwnax4",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Hey guys, I just recently turned 18 and started buying stocks and would like some help on my portfolio. I’m looking to put $1000 in every month and am not looking for a get rich quick scheme just figured it’d be better to have my savings go into stocks than to accrue almost no interest from my bank. What’s the safest long term, I’m talking many years stocks to purchase? As of right now I only own DIS and AMD stocks. I use Questrade and I am located in Canada for reference.",
        "subreddit": "stocks",
        "title": "Best long term stocks?",
        "url": "https://www.reddit.com/r/stocks/comments/gwnax4/best_long_term_stocks/",
        "created": 1591324666.0
    },
    {
        "author": "Inquisitive10",
        "created_utc": 1591060803,
        "id": "guxlck",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "24y.o., risk tolerance: high, I have an emergency savings fund and a decent amount in my savings account as well. Plan to be in the market for 25+ years. Amount invested: 50,000.\n\nMKL - 25%\n\nVFV.TO - 22.5%\n\nMSFT - 10%\n\nAMZN - 10%\n\nDIS - 10%\n\nNVDA - 5%\n\nAMD - 5%\n\nVEE.TO - 5%\n\nBMO - 2.5%\n\nTD - 2.5%\n\nQSR.TO - 2.5%\n\nAlways love to hear insights from redditors about my portfolio. I won't take any of it to heart, but I think it is nice to hear everyone's thoughts.",
        "subreddit": "investing",
        "title": "Portfolio Questions!",
        "url": "https://www.reddit.com/r/investing/comments/guxlck/portfolio_questions/",
        "created": 1591089603.0
    },
    {
        "author": "rubicontraveler",
        "created_utc": 1591311731,
        "id": "gwsfxx",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Started investing outside of 401(k) about six months ago. Just 1K and bought tap, bac, amd and ford. When the virus hit I bought another 1K of dis at 94/97 (10 shares). Sold ford, tap and boa today for a loss and put half into IVR and half into wpg. I think I did right by my money.",
        "subreddit": "stocks",
        "title": "Moved positions",
        "url": "https://www.reddit.com/r/stocks/comments/gwsfxx/moved_positions/",
        "created": 1591340531.0
    },
    {
        "author": "allgaspedalnobrakes",
        "created_utc": 1591291495,
        "id": "gwluyf",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "labeled as a strong buy... this one has room to run.\n\nany thoughts on this?\n\n&amp;#x200B;\n\nalso looking at clsd---\n\nboth getting out of pennystock status but pretty cheap if they are set for a run long term.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhere's some info:\n\n&amp;#x200B;\n\n \n\n**Proteostasis Therapeutics (**[**PTI**](https://www.tipranks.com/stocks/pti/price-target)**)**\n\nProteostasis Therapeutics is developing CFTR modulator combinations to provide more drug options for people with cystic fibrosis (CF). As the company gears up for the release of clinical data in Q1 2021, some analysts believe that at $1.38 per share, its price tag reflects an attractive entry point.  \n\nWriting for Cantor, analyst [Kristen Kluska](https://www.tipranks.com/analysts/kristen-kluska) tells clients that PTI completed enrollment and collected rectal biopsies for the CHOICES study, which features patients with ultra-rare cystic fibrosis mutations, before COVID-19 started causing delays. Currently, samples are being stored in liquid nitrogen until the company can conduct the ex vivo testing, which may take a few weeks, and the organoids are being tested in four labs in Europe.\n\nKluska noted, “Proteostasis is in weekly engagement with centers, and notes that timelines remain on track at this time... From our calculation, we think these timelines assume that labs will be able to re-open and complete the analysis by or around August.”\n\nAdditionally, Kluska points out that data in Q1 2021 may include ppFEV1, sweat chloride and safety measures. Expounding on the implications of the data readout, she said, “We think this will be a major catalyst for PTI considering results could help frame whether these assays are predictive in determining who best responds to PTI drugs (which could ultimately frame the basis for utilizing the personalized medicine approach across the MORE trial, which patients, physicians and regulators have encouraged).”\n\nThe readout will also represent the first look at the triplet data beyond 28 days, which unlike the doublet, kept demonstrating an increased benefit in ppFEV1. “We think a trial double in length of eight weeks will provide more context on the amplifier's potential. Additionally, we believe there is a lower bar for efficacy for the ultra-rate mutation population (as patients are ineligible for all approved modulators), and results could help explain how many patients show some level of benefit,” Kluska stated.\n\nWith its $57.1 million in cash expected to support the company’s operations into 2H21, the deal is sealed for Kluska. In line with her optimistic take, she reiterated an Overweight rating and $4 price target. Should the target be met, a twelve-month gain of 190% could be in store.   \n\nLooking at the consensus breakdown, other analysts are on the same page. With 4 Buys and no Holds or Sells, the word on the Street is that PTI is a Strong Buy. The $5.50 average price target puts the upside potential at 299%.\n\n&amp;#x200B;\n\n \n\n**Clearside Biomedical (**[**CLSD**](https://www.tipranks.com/stocks/clsd/price-target)**)**\n\nUsing its patented SCS Microinjector that targets the suprachoroidal space (SCS), Clearside Biomedical develops treatments that could potentially be capable of restoring and preserving vision for people with serious back of the eye diseases. Given the strength of its platform and its $1.91 share price, several members of the Street believe that now is the time to pull the trigger.\n\nRepresenting Roth Capital, analyst [Zegbeh Jallah](https://www.tipranks.com/analysts/zegbeh-jallah) cites its technology as a key component of his bullish thesis, calling the platform “undervalued.\" The microinjector is able to inject fluid into the SCS, which is between the choroid and sclera, so it can be effectively absorbed by adjacent tissues. This is important as it reduces off-target delivery.\n\nTo provide evidence of the device’s efficacy, Jallah points to the clinical data from the pivotal studies evaluating XIPERE, its first drug using the microinjector. “The potential of Clearside's proprietary SCS microinjector to limit off-target delivery was evident by the lower rates of elevated IOP in patients treated with SC-injected triamcinolone due to lower concentrations of the drug flowing into the anterior chamber,” the analyst commented.\n\nAccording to Jallah, this makes it very likely that the therapy will get the FDA’s stamp of approval in mid-2021 after the company resubmits the NDA by year end 2020. It should be noted that XIPERE is currently licensed to Bausch and Artic Vision, with CLSD also finalizing a licensing agreement with Aura in July 2019 and REGENXBIO in August 2019. The analyst argues these agreements “highlight the attractiveness of Clearside's SCS microinjector.”\n\nLooking specifically at the REGENXBIO partnership, Jallah stated, “Despite some loss of that momentum due to the pandemic and the announced pushback of XIPERE's NDA resubmission date, we are bullish that promising data from the planned Phase 2 study by REGENXBIO, and Clearside's planned Phase 1 study of suprachoroidal delivery of axitinib (CLS-AX) for wet AMD, which could provide significant upside to Clearside's valuation, and make it a strong M&amp;A target.”\n\nTo this end, Jallah rates CLSD a Buy, while setting an $8 price target. This target suggests shares could soar 319% in the next year.",
        "subreddit": "pennystocks",
        "title": "pti and clsd thoughts? dd",
        "url": "https://www.reddit.com/r/pennystocks/comments/gwluyf/pti_and_clsd_thoughts_dd/",
        "created": 1591320295.0
    },
    {
        "author": "SirKrohan",
        "created_utc": 1591201390,
        "id": "gvx0yl",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Big volume on bullish options for TXN, AMD yesterday",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gvx0yl/big_volume_on_bullish_options_for_txn_amd/",
        "created": 1591230190.0
    },
    {
        "author": "wreckhouse0",
        "created_utc": 1591226301,
        "id": "gw57sk",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "pennystocks",
        "title": "after $xspa hits $3 im pulling out most of my money but need help with what positions you guys would think would be smart to go long on after this pays off ? so far i have amd, msft, &amp; O",
        "url": "https://i.redd.it/chq5i0l83s251.jpg",
        "created": 1591255101.0
    },
    {
        "author": "lolnephew",
        "created_utc": 1591125735,
        "id": "gvdu2x",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "RobinHoodPennyStocks",
        "title": "Bluestock $AMD just want this subs opinion sorry mods. *Ignore for bluestock*",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/gvdu2x/bluestock_amd_just_want_this_subs_opinion_sorry/",
        "created": 1591154535.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1591085241,
        "id": "gv3853",
        "num_comments": 272,
        "num_crossposts": 0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on technical analysis (TA), but if TA is not your thing then just ignore the theme and/or [post your arguments against TA here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\n**Technical analysis (TA)** uses historical price movements, real time data, indicators based on math and/or statistics, and charts; all of which help measure the trajectory of a security.  TA can also be used to interpret the actions of other market participants and predict their actions.\n\nThe main benefit to TA is that everything shows up in the price (commonly known as **\"priced in\"**):  All news, investor sentiment, and changes to fundamentals are reflected in a security's price.\n\nTA can be useful on any timeframe, both short and long term.\n\nIntro to technical analysis by [Stockcharts chartschool](https://stockcharts.com/school/doku.php?id=chart_school:technical_indicators:introduction_to_technical_indicators_and_oscillators#benefits_and_drawbacks_of_leading_indicators) and their [article on candlesticks](https://stockcharts.com/school/doku.php?id=chart_school:chart_analysis:introduction_to_candlesticks)\n\nIf you have questions, please see the following word cloud and click through for the wiki:\n\n[Indicator - Trade Signals - Lagging Indicator - Leading Indicator - Oversold - Overbought - Divergence - Whipsaw - Resistance - Support - Breakout/Breakdown - Alerts - Trend line - Market Participants - Moving average - RSI - VWAP - MACD - ATR - Bollinger Bands - Ichimoku clouds - Methods - Trend Following - Fading - Channels - Patterns - Pivots](https://www.reddit.com/r/stocks/wiki/ta-themed-post)\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion &amp; Technicals Tuesday - Jun 02, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/gv3853/rstocks_daily_discussion_technicals_tuesday_jun/",
        "created": 1591114041.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1590998962,
        "id": "gugkmx",
        "num_comments": 242,
        "num_crossposts": 0,
        "selftext": "These daily discussions run from Monday to Friday including during our themed posts.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?sort=new&amp;q=Rate+My+Portfolio+-+r%2FStocks+Quarterly+Thread&amp;t=all&amp;restrict_sr=on).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion Monday - Jun 01, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/gugkmx/rstocks_daily_discussion_monday_jun_01_2020/",
        "created": 1591027762.0
    },
    {
        "author": "Inquisitive10",
        "created_utc": 1591039632,
        "id": "gur4s1",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "24y.o., risk tolerance: high, I have an emergency savings fund and a decent amount in my savings account as well. Plan to be in the market for 25+ years. Amount invested: 50,000.\n\n&amp;#x200B;\n\nMKL - 30%\n\nVFV.TO - 22.5%\n\nMSFT - 10%\n\nAMZN - 10%\n\nDIS - 10%\n\nNVDA - 5%\n\nAMD - 5%\n\nVEE.TO - 5%\n\nQSR.TO - 2.5%\n\nAlways love to hear insights from redditors about my portfolio. I won't take any of it to heart, but I think it is nice to hear everyone's thoughts.",
        "subreddit": "CanadianInvestor",
        "title": "Portfolio Review/Recommendations",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/gur4s1/portfolio_reviewrecommendations/",
        "created": 1591068432.0
    },
    {
        "author": "Inquisitive10",
        "created_utc": 1591060803,
        "id": "guxlck",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "24y.o., risk tolerance: high, I have an emergency savings fund and a decent amount in my savings account as well. Plan to be in the market for 25+ years. Amount invested: 50,000.\n\nMKL - 25%\n\nVFV.TO - 22.5%\n\nMSFT - 10%\n\nAMZN - 10%\n\nDIS - 10%\n\nNVDA - 5%\n\nAMD - 5%\n\nVEE.TO - 5%\n\nBMO - 2.5%\n\nTD - 2.5%\n\nQSR.TO - 2.5%\n\nAlways love to hear insights from redditors about my portfolio. I won't take any of it to heart, but I think it is nice to hear everyone's thoughts.",
        "subreddit": "investing",
        "title": "Portfolio Questions!",
        "url": "https://www.reddit.com/r/investing/comments/guxlck/portfolio_questions/",
        "created": 1591089603.0
    }
]