[
    {
        "author": "veritasinvestments",
        "created_utc": 1591235028,
        "id": "gw7nuz",
        "num_comments": 77,
        "num_crossposts": 0,
        "selftext": "I'm a numbers kinda guy, and lately I've been looking at what are some of the trends before a penny stock becomes the next insane momentum runner. To be honest, darkpool data is typically the one that shows up a lot. Biotech pennies (for instance) have large darkpool prints before a major hype. For instance, if you do have access, look at the PTI Darkpools before the last data catalyst. You can distinctly see that darkpool prints happened before the hype and then distinctly dropped a bit before the data release. Once these hedgefunds take positions, then they a) field their pumpers and eventually it becomes a self-fulfilled prophecy or b) the hype naturally becomes known to retail because of news articles etc or c) both. \n\nOne of the stocks that has consistently been coming up on the top 20 stocks on darkpools is HEXO, and recently, it just registered one of its highest DPIs (darkpool indicator). Generally, the higher the DPI, the more bullish the hedgefunds are feeling towards a particular stock. DPIs are great indicators for upcoming momentum (for instance, for the past two days, MU, RTX and JPM have had the highest DPIs across the entire stock market, and thus I wasn't surprised much today to see that these stocks made monstrous moves). On the other hand, the registry of low DPIs often indicates that a rally on a stock may be dying a bit. Tesla registered one of the lowest DPIs yesterday so I wasn't watching it today. As it happened, it didn't really make much of a move. While DPIs are not an end all be all, they're a great tool for finding some of the stocks that so-called smart money is pouring money into (or taking money out of). \n\nNow, let's be honest here: this is pennyland and there are stocktwits pumpers that are propping stocks up. There are some massive pumpers on HEXO (primarily mrinvestorpro, who basically manipulates the market). It's noticeable to see that the large prints on darkpools started as mrinvestorpro started pumping HEXO. Is Mrinvestorpro just a paid promoter for a bunch of sleazy hedgefunds? Most likely yes. With that said, will the stock run up a lot? Absolutely. I think everyone here knows that pennies are pumps and dumps and here it seems like HEXO is about to experience the next pump.",
        "subreddit": "RobinHoodPennyStocks",
        "title": "HEXO will make a huge run",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/gw7nuz/hexo_will_make_a_huge_run/",
        "created": 1591263828.0
    },
    {
        "author": "HanSoloCenturyFalkon",
        "created_utc": 1591222442,
        "id": "gw40hc",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Today I traded several NASDAQ stocks such as INTC,JETS,MU,NFLX,ZM, and I see I have $8.45 in Fees charged with no breakdown on what are the charges.",
        "subreddit": "stocks",
        "title": "What are E*Trades hidden fees/commissions on short trades of NASDAQ stocks?",
        "url": "https://www.reddit.com/r/stocks/comments/gw40hc/what_are_etrades_hidden_feescommissions_on_short/",
        "created": 1591251242.0
    },
    {
        "author": "SunnyIdealist",
        "created_utc": 1591071421,
        "id": "gv0b3k",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "I have the following Top Performers Portfolio at a 3.5 years return:\n\nAAPL - 182%\nTSLA - 367%\nAMZN - 221%\nABDE - 273%\nNFLX - 246%\nMA - 188%\nISRG - 175%\nMU - 126%\nBABA - 121%\nNVDA - 230%\n\nOverall Return - 185%\nS&amp;P 500 - 31%\n3 Year Alpha - 153%\n\nHolding period since 10 Dec 2016. \n\nWhat do you investors think of this portfolio?\n\nThoughts please.",
        "subreddit": "investing",
        "title": "Top Performance Asset Assessment",
        "url": "https://www.reddit.com/r/investing/comments/gv0b3k/top_performance_asset_assessment/",
        "created": 1591100221.0
    },
    {
        "author": "DaymanOhOhOh",
        "created_utc": 1591317496,
        "id": "gwu48k",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Will MU go BRRR?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gwu48k/will_mu_go_brrr/",
        "created": 1591346296.0
    },
    {
        "author": "Dashover",
        "created_utc": 1591061704,
        "id": "guxucp",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "\n \nA YAWN OF A DAY\n \nISM Below 50 for 3rd Month\n \nU.S. DOLLAR WEAKENS\n \n \nToday’s market was lower at the open but quickly came back to the upside, but spent all day in a fairly narrow range, finishing the session +91.91 (.36%), NASDAQ +62.18 (.66%), SP 500 +11.42 (.38%), the Russell +11.34 (.81%) and the DJ Transports -3.88.  The day couldn’t have been more boring if it had been closed.  Volume was light and the A/D on NYSE was 3:1 while NASDAQ was only 3:2, and 18 of the 30 DJIA stocks were positive with the biggest mover, BA adding 37 DPs to the average.  Financials, Energy, real estate and utilities were the strongest while information tech and healthcare were the weaker groups.  Commodities were relatively unchanged while the US$ was weak again having broken below 99 just 3 days ago broke below 98 and closed 97.82 -.52 while all the world’s currencies moved higher.\n \n \nOur “open forum” on Discord, which allows me to interact with subscribers and others to allow direct questions and chart opinions on just about any stock, continues to grow with more participants every day.  It is informative and allows me to share insights as the market is open and moving.  The link is: https://discord.gg/ATvC7YZ  and I will be there and active from before the open and all day.  It’s a great place to share ideas and gain some insights, and we’ve grown to almost 1900 members.  I also did this video titled “How to survive being an options trader and not blow up your account,” over the long weekend.  I think it’s very informative as a guide to stock selection and option choices.  The link is\nhttps://youtu.be/Y7H9RpWfLlo  Enjoy!!\n \n \nTonight’s closing comment video https://youtu.be/MkHi1Je6hdA\n \n \nSECTORS: Pharma had a mixed day news wise with more disappointment in GILD with their finding that Remdesivir is not the panacea that was originally thought.  It seems to have limited use for a limited number of patients.  While the stock was heartily rewarded when it was first discussed, hitting $86, it closed the day $75.16 -2.67 (3.43%).  Also a disappointment were the results from PFE on their breast cancer drug, Ibrance, announced after the close on Friday, and after several price targets were lowered, it finished the day $35.46 -2.73 (7.15%).\n \nOn Thursday, the HOMERUN OF THE DAY was ARCA Biopharma: ABIO with a novel approach for COVID-19 treatment.  It is testing their “selective inhibitor of tissue factor.”  It has already completed phase 1 and 2 and if results continue, they are confident that they will file an NDA in the third quarter.  The stock was as high as $22.00 before closing $19.21 +15.26 (386.33%) but since has had no follow up press and has come back to earth finishing the day $9.20 -3.40 (26.8%).  The main reason for the drop was an offering of $9.4million stock offering at $9.00.\n \n \nFOOD SUPPLY: was MIXED with TSN +1.26, BGS +1.22, FLO -.01, CAG -.07, MDLZ +.13, KHC -.05, CALM -.31, JJSF +2.48, SAFM -4.70, LANC +.65, GO -.49, HRL +.02 and PBJ $31.79 + .10 (.32%).\n \nBIOPHARMA was LOWER with BIIB -5.64, ABBV -1.02, REGN -13.34, ISRG -5.44, GILD -2.67, MYL +.53, TEVA +.56 (4.47%), VRTX -1.32, BHC +.68, INCY -.16, ICPT +1.24, LABU +.74, and IBB $134.00 -.74 (.66%).\n \nCANNABIS: This group was HIGHER with TLRY +.23, CGC -.90, CRON +.07, GWPH +2.07, ACB -.01, PYX unch., NBEV -.01, CURLF -.15, KERN +.43, and MJ $13.87 +.11 (.80%).\n\n \nDEFENSE: was LOWER with LMT + .52, GD +.57, TXT +.58, NOC -4.53, BWXT -.63, TDY -8.98, RTX -.32 and ITA $166.27 +1.72 (1.05%).\n \n \nRETAIL was HIGHER with M +.01, JWN +.57, KSS +1.48, DDS -.86, WMT -.29, TGT -2.83, TJX +.57, RL +1.20, UAA +.51, LULU +8.90, TPR +.59, CPRI +1.76 and XRT $41.10 +.30 (.74%).\n \n \nFAANG and Big Cap: were HIGHER with GOOGL +1.98, AMZN +26.23, AAPL +3.46, FB +6.91, NFLX +5.48, NVDA -3.22, TSLA +61.00, BABA -1.09, BIDU +.60, CMG +41.96, CAT +.37, BA +5.49, DIS +1.20, and XLK 97.95 -.02 (.02%).\n \n \nFINANCIALS were HIGHER with GS +3.06, JPM +1.02, BAC +.45, MS +.40, C +1.42, PNC +.63, AIG +.69, TRV +2.24, AXP +1.43, V -1.24, and XLF $23.63 +.22 (.94%).\n \n \nOIL, $35.44 -.05. Oil has managed to trade $35.90 today but has run into the 100-day MA and a top at $36.35 back on 3/11.  I will be on watch to get back into the USO puts for a move back to $30-31.00.  The stocks were higher and XLE was $39.35 +.59 (1.52%).\n \n \nMETALS, GOLD: $1,750.30 -1.40. After trading 1761 overnight the gold traded down to 1737 and managed to come all the way back to close basically unchanged, The action in the US$ is projecting higher prices for the metals. We bought back 2 lots of NEM roughly $6.00 lower that our sale last week and even when gold was lower today NEM was higher.\n \n \nBITCOIN: closed $9,443 -7 After breaking down from just over 10,000 and trading as low as 8630 last Tuesday we have been clawing our way back toward 10,000.  Today’s close was one of the smallest net changes I’ve seen in quite a while.  This continues to look higher.  We added 350 shares of GBTC last Wednesday @ $10.02 to our position of 400 @ $8.06, bringing our average price to $8.97. GBTC closed $11.25 +.35 today.\n \n \nTomorrow is another day.\n \nCAM",
        "subreddit": "options",
        "title": "For Trading June 2nd",
        "url": "https://www.reddit.com/r/options/comments/guxucp/for_trading_june_2nd/",
        "created": 1591090504.0
    }
]