[
    {
        "author": "wannabecameraguy",
        "created_utc": 1586589485,
        "id": "fyyxc9",
        "num_comments": 59,
        "num_crossposts": 0,
        "selftext": "I was doing some DD and came across these 2 legal cases:  \n\n\n In *United States Shipping Board Emergency Fleet Corporation v. Western Union Telegraph Co.*,[\\[5\\]](https://en.wikipedia.org/wiki/Federal_Reserve_Bank#cite_note-5) the U.S. Supreme Court stated, \"Instrumentalities like the national banks or the federal reserve banks, in which there are private interests, are not departments of the government. They are private corporations in which the government has an interest.\" \n\nand\n\n In *Lewis v. United States*,[\\[7\\]](https://en.wikipedia.org/wiki/Federal_Reserve_Bank#cite_note-Lewis-vs-U.S.-7) the [United States Court of Appeals for the Ninth Circuit](https://en.wikipedia.org/wiki/United_States_Court_of_Appeals_for_the_Ninth_Circuit) stated that: \"The Reserve Banks are not federal instrumentalities for purposes of the FTCA \\[the [Federal Tort Claims Act](https://en.wikipedia.org/wiki/Federal_Tort_Claims_Act)\\], but are independent, privately owned and locally controlled corporations.\"   \n\n\nSo since the Federal Reserve is a private corporation and doesn't seem to have a copyright to the name (since there are already 12 of these things). What if we just start our own? Then we can buy one of those brand new money printers everyone talks so much about instead of wasting our money on puts!  \n\n\nTLDR: Federal reserve is a private company. Start our own Federal Reserve of WSB. Purchase money printer. Profit???",
        "subreddit": "wallstreetbets",
        "title": "What if we just start our own Federal Reserve Bank?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fyyxc9/what_if_we_just_start_our_own_federal_reserve_bank/",
        "created": 1586618285.0
    },
    {
        "author": "augusttrip2019",
        "created_utc": 1585934020,
        "id": "fucaer",
        "num_comments": 58,
        "num_crossposts": 0,
        "selftext": "Q2 2020: Are our markets under a coordinated financial attack spearheaded by none other than the killer tiger queen herself and gay Starbucks? Losses posted below. \n\nu/variation-separate can confirm: Jian Liu is the COO of “Luckin Coffee”. What do you you think happens when you rearrange Luckin Coffee, Jian Liu? Exactly: “If Con, u Cufflink, Jail.”\n\nEstimated revenue for LK was off by $300mm, since Jian Liu fabricated the numbers harder than China fabricated the Wu-Tang-Flu. If you haven’t noticed yet, Carole Baskin already made her first move.\n\nSo how does Carole Baskin fit into all of this? Good question, glad you asked. \n\nTake a look at the put/call ratio and volume on $LK: outsized put volume for $28 strikes on 6/3 and overwhelmingly large volume for 8/3 $57 calls. \n\nReason this- what are the latitude/longitudes of Carole’s Big Cat Rescue? Yup, you guessed it, the coordinates are 28.0603° N, 82.5716° W. \n\n**Are you following? Jian Liu and Carole Baskin are both guilty of one thing: MURDER. That bitch killed** \n\n**Don Lewis and Jian Liu Killed my $LK 6/1 $50 calls. Only difference is Don got a proper burial underneath her septic tank and I got double fucked by fake numbers and buying when VIX was 80.** \n\n**Equally as bad, both deserve to go to prison.** \n\n&amp;#x200B;\n\nI know this may be difficult to believe. \n\nSo where do we go from here? \n\n&amp;#x200B;\n\nGood question. \n\nAutism be damned. \n\nYou need to look at the facts.\n\n\\_\\_ \n\nTL;DR: Find the hidden message. Positions: $AMD $60c 5/1. Here's some loss porn for you all: \n\nhttps://preview.redd.it/7lekf5jbymq41.png?width=218&amp;format=png&amp;auto=webp&amp;s=372d9e51c83488a5b03d90f322cf7fdfde0f621e",
        "subreddit": "wallstreetbets",
        "title": "The Shadow War: How Luckin Coffee and Carole Baskin Set up for Another Engineered Circuitbreaker Next Monday 4/7/20.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fucaer/the_shadow_war_how_luckin_coffee_and_carole/",
        "created": 1585962820.0
    },
    {
        "author": "limes_huh",
        "created_utc": 1587077444,
        "id": "g2pnc8",
        "num_comments": 33,
        "num_crossposts": 1,
        "selftext": "Ok so the premise is simple. Tianjin Airlines from Wuhan to Paris lands in 4 hours and 2 minutes. If you live in Paris we need your help ASAP. We need you to go to baggage claim and await this plane's arrival. Pose as a driver, maybe, and hold a sign like \"Mr. Wu Han\" to blend in.\n\nYou can then gather information like the number of people on board. One of their A330's can seat 293 people so we can actually get a solid percentage to work off.\n\nPay attention, this is where it gets important. Befriend one of the Chinese passengers (if there even are any) and invite them for a french kiss as a sign of welcoming them to your country. Now that you've gained their trust, bring them to the bathroom. Flush the toilet and ask them if the Chinese government is lying. Don't worry, you tell them, Xi can't hear them from here.\n\nReport back with your findings. Hurry! 3 hours and 55 minutes until touchdown. Track the flight here [https://www.flightradar24.com/GCR7967/245e0df6](https://www.flightradar24.com/GCR7967/245e0df6)\n\n&amp;#x200B;\n\nEDIT positions\n\nTSLA 4/24 $420, HOG 5/15 $10, SPY 5/15 $140 and a whole bunch that expire tomorrow u do NOT want to see",
        "subreddit": "wallstreetbets",
        "title": "Forget the numbers governments and businesses want us to see – we may have a good chance for the best DD this sub has ever seen",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/g2pnc8/forget_the_numbers_governments_and_businesses/",
        "created": 1587106244.0
    },
    {
        "author": "KATsapuss",
        "created_utc": 1585999857,
        "id": "fus61x",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "* NVIDEA\n* Peleton\n* Dropbox\n* Gilead Sciences\n* Rapid7\n* Splunk\n* Paypal\n* Apple\n* Synopsys\n* Micron\n* Microsoft\n* Western Union\n* Starbucks\n* Facebook\n* Intuitive Surgical",
        "subreddit": "stocks",
        "title": "List of stocks I'm looking at, thoughts?",
        "url": "https://www.reddit.com/r/stocks/comments/fus61x/list_of_stocks_im_looking_at_thoughts/",
        "created": 1586028657.0
    },
    {
        "author": "infrequentstoner",
        "created_utc": 1585763091,
        "id": "ft4m40",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "In the first scene of Indiana Jones: Temple of Doom, Indy’s friend named Wu Han gets shot in China while exchanging ruins for a diamond while holding a female singer hostage. One of the first outbreaks coronavirus is on, take a guess, the Diamond Princess. When Indy and the singer crash land in India, they end up walking through the forest and the singer points up to sky and says “look at all of these birds in the sky”, but they were bats. Indy’s sidekicks name is Short, I can’t see how market doesn’t go tits up. \n\nSpy 180p 5/1",
        "subreddit": "wallstreetbets",
        "title": "Archeological Documentary Predicted Coronavirus",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ft4m40/archeological_documentary_predicted_coronavirus/",
        "created": 1585791891.0
    },
    {
        "author": "fallweathercamping",
        "created_utc": 1587587910,
        "id": "g68x1i",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "https://imgur.com/gallery/3UgNFDZ\n\nIt appears that many folks haven’t read the incredible excerpts from Shkreli’s witness selection a few years ago.\n\nWell, for your reading pleasure, I present the IRL musings of a selection of your (unfortunately rejected) peers.\n\nhttps://harpers.org/archive/2017/09/public-enemy/\n\nBottom line: don’t fuck wit the Wu Tang. Wu Tang is for the children.",
        "subreddit": "wallstreetbets",
        "title": "For all the Shkreli fanboys and fancucks",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/g68x1i/for_all_the_shkreli_fanboys_and_fancucks/",
        "created": 1587616710.0
    },
    {
        "author": "anteater22",
        "created_utc": 1587448400,
        "id": "g59o4k",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "I think corona virus invented in a lab bc China es criminales. Wu-tang  invented this bc trump like to golf n listen while listening to “shame on a nigga”. 🦇 disease was invented by trump stoned when he got stoned the wutang clan. \n\n\n\nIf you never hear from me again remember if thou shall END up buying puts, thy shall be stoned while his girlfriend gets tittyfucked by a appl 495 autistic monkey that she now calls big papa. \n\n\nEdit :she ain’t never call me big papa",
        "subreddit": "wallstreetbets",
        "title": "Wuh-t(h)ang🦇",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/g59o4k/wuhthang/",
        "created": 1587477200.0
    }
]