[
    {
        "author": "LifeTaylor",
        "created_utc": 1598805768,
        "id": "ijfqxy",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "Started buying stocks a few weeks ago, and have kind of just been adding onto it every week. \n\nPlan is too hold them all long-term, and at first i just buy $100-worth of each company I know of and expect to do well.\n\nThan I buy more of the companies I believe more strongly in. \n\nMSFT, INTC, DAL, AMZN, GOOGL, WDC  are where the majority of my stocks are currently\n\nbut i also have about 30+ other stocks that range that have about $100 to $500 in each one, primarily in the tech sector, but some are a bit more diverse.\n\nJust wanted to know your thoughts.  I'm not sure if its better to just put everything into a handful of companies, or if its better to have a small stake in many companies.",
        "subreddit": "stocks",
        "title": "Is having \"too many\" different stocks a bad thing?",
        "url": "https://www.reddit.com/r/stocks/comments/ijfqxy/is_having_too_many_different_stocks_a_bad_thing/",
        "created": 1598834568.0
    },
    {
        "author": "CluelessProphet",
        "created_utc": 1597723589,
        "id": "ibtze9",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "I am not one to typically follow or pay attention to the investing of those that consider themselves \"professionals\", but when it comes to the man, the myth, the legend, Dr. Michael Burry, I do. Recently, his fund, Scion Asset Management, filed it's 13-F Filing and there was some interesting information in it. (Bear in mind, some of these positions could be a few months old, however since I am focusing on the call options in his portfolio many of these positions would most likely be long-term and therefore would still be valid investments). Of note, Burry had 16 call positions which represented 71.19% of his portfolio. I would suspect that these are LEAP options (at least one year options) and not short-term call options, which clearly shows that he believes the economy has seen the worst of the coronavirus and is poised for a recovery. The reason I suspect Burry is invested in LEAP options is due to their tendency to be mispriced and cheaper than holding a higher priced stock like GOOG or BKNG long-term. They would offer far more upside than just holding the stock itself. We also know from history that Michael Burry is not a short-term investor and his \"Big Short\" positions, which were also derivatives, took over one year to profit. With that in mind here are the companies that made up the biggest positions in his call options:\n\nGOOG (36% of his portfolio)\n\nFB (7%)\n\nBKNG (6%)\n\nGS (5%)\n\nWDC (4%)\n\nVarious other companies made up his other positions which primarily consisted of energy, retail, gaming (casino) and financial companies. All these companies are in sectors which are market laggards currently, but would increase dramatically with a market recovery, hence his use of call options. From looking at his portfolio, it is evident Michael Burry is bullish on the market and believes that it is set to recover. He is clearly betting on higher interest rates in the future (financial stocks), higher energy prices (energy stocks), higher consumer spending (retail stocks), increased discretionary spending (casino/gaming/travel stocks), and overall increase in the dominant tech stocks (FB/GOOG). I think this is a solid portfolio and thesis. I am not one to argue with the legend and I will be following his lead into some of the stocks he has bought. Specifically GOOG, WYNN, LVS, JPM, BAC, GS calls.\n\nLINK TO OVERVIEW OF THE 13-F filing:\n\n[https://fintel.io/i13f/scion-asset-management-llc/2020-06-30-0](https://fintel.io/i13f/scion-asset-management-llc/2020-06-30-0)",
        "subreddit": "investing",
        "title": "Analysis of Scion Asset Management 13-F Filing",
        "url": "https://www.reddit.com/r/investing/comments/ibtze9/analysis_of_scion_asset_management_13f_filing/",
        "created": 1597752389.0
    },
    {
        "author": "Baconator69420",
        "created_utc": 1597268927,
        "id": "i8n1lt",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "\nI’ve been noticing a large trend with secondary tech and even some big tech companies. Most of them get average to alright earnings but most of them have dropped. Unless they are a big name *Some are* there has been a trend of these stocks getting clapped and readjusting to a more adequate evaluation. Here is some of my numbers explaining this finding. \n\n*These are approximate numbers not exact\n\nWDC $45 Pre - $36.09 Post  (-17%)\n\nCSCO $48.10 Pre - $44.80 Post (-6.50%)\n\nATVI $86.84 Pre - $82.47 Post (-5.20%) \n\nINTC $60.20 Pre - $ 50.49 Post (-17%)\n\nNFLX $530 Pre - $490 Post (-8%)\n\nAlphabet $ 1,444 Pre - $1362 Post (-5%)\n\nMSFT $211 Pre - 202 Post (-4.50%)\n\nFeel free to add to the list and disprove this but I got too lazy to search and add more.\n\nOverall, keep an eye out for average tech companies taking a beating on earnings there seems to be a pattern following.",
        "subreddit": "wallstreetbets",
        "title": "*Important Earnings Tech Discovery*",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i8n1lt/important_earnings_tech_discovery/",
        "created": 1597297727.0
    },
    {
        "author": "GoodN1ght94",
        "created_utc": 1596658835,
        "id": "i4d0fg",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Beats expectations by 2C for Q4 then misses by 60 for Q1.   \n\n\nCurrently down 12% in afterhours. What a dumpster fire of a year for them. Everybody expected it to go up because of the work at home and general server growth. Guess they're outta the game.   \n\n\nGoing to be interesting to see how the earnings call will move the stock but I don't expect anything that can justify such a miss.",
        "subreddit": "wallstreetbets",
        "title": "WDC Fire dumpster thread",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i4d0fg/wdc_fire_dumpster_thread/",
        "created": 1596687635.0
    },
    {
        "author": "hydershykh",
        "created_utc": 1596761448,
        "id": "i543y1",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "So we've done pretty good in the last week and in yesterday's alerts with multiple alerts panning out really well e.g **$AAPL, $MELI, $SRNE, $NVAX, $SQ, $NKLA, $KNDI, $NFLX. $PDD** etc. I also posted a [detailed spreadsheet](https://docs.google.com/spreadsheets/d/1fT2P9JKxmnyZFFXEOl9QWBsqAqzTwYi-UXSPJ2InECw/edit?usp=sharing) with results from the last week. We had an accuracy of **75%** last week. Some alerts like **$TDOC** also did not pan out yesterday which just shows that the tool is not 100% perfect.\n\nThe tool is still very new so please be careful with all the alerts. **I would recommend paper trading these for a few days and doing your own DD as well**.  The overall accuracy is around 60-70% which means it can make mistakes.\n\nBullish    means the stock is expected to move up more than 1% from the current     close at least 1 day in the next 1-5 days. Bearish means the stock is  expected to stay the same or go low in the next few days.\n\n# Bullish Alerts\n\n**$ILMN** \\- Bullish probability of 88.43%. I know this dropped hard today but the tool is bullish on it. If it starts to go back, it will be a good setup. If it continue going down, don't get in. **Risky setup, careful!**\n\n**$NVAX** \\- Bullish probability of 77.14%. I like that it dropped today. Either get in if it touches the support at $160 and bounces back or get in on a pull back at the moving averages ([https://i.imgur.com/EXdP8y1.png](https://i.imgur.com/EXdP8y1.png))\n\n**$LULU** \\- Bullish probability of 74.80%. Seems like a good setup, especially with a small pullback ([https://i.imgur.com/5misOTH.png](https://i.imgur.com/5misOTH.png))\n\n**$FSLY** \\- Bullish probability of 74.46%. This dropped right at its 50 MA. A good setup as long as the price stays above 50MA ([https://i.imgur.com/GS9bBot.png](https://i.imgur.com/GS9bBot.png)). Exit otherwise.\n\n# Bearish Alerts\n\n**$BAC** \\-  Bearish probability of 86.76%. I like it for a bearish setup if it can below the support of $25.2 ([https://i.imgur.com/wAiBWbo.png](https://i.imgur.com/wAiBWbo.png)).\n\n**$ZNGA** \\-  Bearish probability of 83.96%. This is at a very strong support level at $9.9. **Do not get in unless it breaks the support** ([https://i.imgur.com/kUJuBgr.png](https://i.imgur.com/kUJuBgr.png)).\n\n**$GILD** \\-  Bearish probability of 82.68%. Might go up a bit before going down further. Healthcare stocks are risky though so be careful.\n\n**$WDC** \\-  Bearish probability of 82.66%. Only a good setup if price stays below the support level of $37.8 ([https://i.imgur.com/8ky7k3v.png](https://i.imgur.com/8ky7k3v.png))\n\n \n\n**Note:**  A lot of time has gone into these tools and it takes time to write  these alerts, look at    charts, and post them here. Would love for you  guys to **try out our** [discord](https://discord.gg/X2hHeJ) **channel** where I post alerts from various tools, not just the options one. Please hit me up if you want to link, it's free to join.\n\n**If you don't like these alerts, please don't be a hater, just ignore them. They are not perfect and I know that.**",
        "subreddit": "smallstreetbets",
        "title": "August 7th Alerts from My AI Options Tool | NVAX, FSLY, GILD, ILMN, BAC",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/i543y1/august_7th_alerts_from_my_ai_options_tool_nvax/",
        "created": 1596790248.0
    },
    {
        "author": "HunterMitchell625",
        "created_utc": 1596668783,
        "id": "i4g18m",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Roku, Softbank, Micron Technology, Seagate Technology, Western Digital, Beyond Meat, and Fastly. Some dipped 3% and some are over 10%. It's 10% of my income and I'm not going above it. I've only been doing this pseudo day trading shit for a week now. I made 3% on $440. My goal is 0.75% a business day. I will post updates then.",
        "subreddit": "wallstreetbets",
        "title": "I am splitting $500 on 7 stocks tomorrow.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i4g18m/i_am_splitting_500_on_7_stocks_tomorrow/",
        "created": 1596697583.0
    },
    {
        "author": "Brap_Rotatoe",
        "created_utc": 1596725764,
        "id": "i4t9fh",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Why the sudden 17% drop in Western Digital today? With cloud computing and storage usage projections going up for the foreseeable future, what caused this big drop?",
        "subreddit": "stocks",
        "title": "What Happened With WDC???",
        "url": "https://www.reddit.com/r/stocks/comments/i4t9fh/what_happened_with_wdc/",
        "created": 1596754564.0
    },
    {
        "author": "JTrem67",
        "created_utc": 1596727731,
        "id": "i4tuds",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Is WDC a buy?",
        "url": "https://www.reddit.com/r/stocks/comments/i4tuds/is_wdc_a_buy/",
        "created": 1596756531.0
    },
    {
        "author": "APensiveMonkey",
        "created_utc": 1596744417,
        "id": "i4z4lv",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Western Digital had a so-so quarter but guided down on weak demand sending shares down ~16%. This also gave a big hit to Micron, down ~4.5%. But is this valid? Based on my research, they're quite different beasts and the digitization trends happening benefit Micron far moreso than WD. Does anyone who's more knowledgeable have any color on this?",
        "subreddit": "stocks",
        "title": "Western Digital &amp; Micron",
        "url": "https://www.reddit.com/r/stocks/comments/i4z4lv/western_digital_micron/",
        "created": 1596773217.0
    },
    {
        "author": "rp_ush",
        "created_utc": 1597084697,
        "id": "i7ao7p",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "ONTO &gt; AMAT, here’s why. ONTO has a technological edge with their equipment and are way under valued. They are taking at about 21 P/E right now, but as they build out their portfolio, they expect to earn over $5/sh with increased margins. So, a FPE of closer to 7. AMAT is a great company, but they are already built out. ONTO has that TAM SAM gap to fill in addition to eating market share and the growing industry. I wouldn't be shocked if AMAT or LRCX buys ONTO, frankly. It would make sense.\n\nThey have Advanced node and advanced packaging. As customers move toward 3nm 6th gen dual layer, they need Atlas III. And with pattern control software with machine learning, they provide an end to end solution. So if Intel or Western Digital want to survive in their competitive marketplaces, they need to have the best tools to print the wafers. They are a small company, but they are #1 or #2 in their core markets. They win because they have the best tools.",
        "subreddit": "StockMarket",
        "title": "Alert: ONTO",
        "url": "https://www.reddit.com/r/StockMarket/comments/i7ao7p/alert_onto/",
        "created": 1597113497.0
    },
    {
        "author": "Dashover",
        "created_utc": 1596671607,
        "id": "i4gttu",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "\nFor Trading August 6th\n \nDIS +10% on Earnings\n \nADP Number a MAJOR MISS\n \nAnother New High for NASDAQ\n \n \nToday’s market got off to a positive start even though the ADP payroll number, expected to be +1 million jobs came in at a meager +167,000.  This was before the good ISM numbers came in well above both expectations and last months number.  By the end of the day the DJIA was +373.05 (1.39%), NASDAQ +57.24 (.52%), S&amp;P 500 +21.26 (.64%), the Russell the big winner +29.02 (1.91%), and the DJ Transports +128.75 (1.28%).  Market internals were a sold 2:1 on both NYSE and NASDAQ and NYSE volume was better at 3:1 up.  Bond markets were slightly lower with the long end actually gaining a bit and steepening the yield curve.  The U.S. Dollar index continues to fall and I will be working on an advisory for the Weekly Insights letter for ways to play the weak dollar using ETFs.\n \n \nTonight’s closing comment video  https://youtu.be/1vHMDfnYaIs\n \n \nSECTORS: There was plenty of earnings news around with the big name, DIS reporting and after a decline from 117 to 113.50 in last night’s trading it reversed higher and finished higher last night and followed today to hit $130.31, finished the day $127.61 +10.32 (8.8%).  Also reporting, SQ with a beat finished the day $146.20 +9.37 (6.9%).  CTL beat and was $10.29 +.45 (4.57%), ROKU with a beat, but soft guidance $162.10 -3.32, SONO, with a loss but a revenue beat $15.40 -2.10, WDC with a miss on revenues and poor guidance $38.56 -5.89 (13.25$), and FSLY with a beat top and bottom lines but $93.20 -15.80 (14.5%).  Also, in the news, Teladoc (TDOC) and Livongo Health (LVGO) announced a merger that evidently no one likes as both stocks were sharply lower.  TDOC $202.01 -47.41 (19%) and LVGO $128.06 -16.47 (11.4%).\nFOOD SUPPLY CHAIN was LOWER with TSN -2.20, BGS +.84, FLO -.08, CPB -.71, CAG -.48, MDLZ -.43, KHC -.30, CALM -.90, JJSF +2.02, SAFM -1.66, HRL -.75, SJM -2.00, PPC -.35, KR -.36 and PBJ $33.60 -.17 (.51%).\n \n \nBIOPHARMA was MIXED with BIIB + .09, ABBV -1.03, REGN -23.91, ISRG +9.39, GILD -1.73, MYL +.63, TEVA +.71 (6.02%), VRTX -2.48, BHC +.51, INCY -2.33, ICPT +.46, LABU +1.14, and IBB $137.45 -.23 (.17%).\nCANNABIS: was LOWER with TLRY -.58, CGC -.11, CRON -.12, GWPH -.27, ACB -.02, NBEV +.06, CURLF -.08, KERN -.,06, and MJ $13.52 -.07 (.52%).\n\nDEFENSE:  was HIGHER with LMT +5.51, GD +1.95, TXT +.59, NOC +4.70, BWXT -.77, TDY +7.65, RTX +2.77 (4.82%), and ITA $165.75 +5.56 (3.47%).\n\n \nRETAIL: was HIGHER with M +.23, JWN +1.09, KSS +1.11, DDS +.70, WMT -1.83, TGT -1.04, TJX +.26, RL +2.57, UAA +.68, LULU +12.29, TPR +.65, CPRI +1/.60, and XRT $50.20 +1.19 (2.43%).\n \nFAANG and Big Cap: were MIXED with GOOGL +6.70, AMZN +59.69, AAPL +.60, FB -.78, NFLX -9.14, NVDA +1.58, TSLA -3.00, BABA +2.80, BIDU -.82, CMG +.43, CAT +3.48, MSFT -.88, BA +10.68, DIS +10.41 (6.41%), and XLK $113.89 +.45 (.40%).\nPLEASE BE AWARE THAT THESE PRICES ARE LATE MARKET QUOTES AND DO NOT REPRESENT THE 4:00 CLOSES.\n \n \nFINANCIALS were HIGHER with GS +2.41, JPM +1.60, BAC +.46, MS +.49, C +.87, PNC +1.27, AIG +.40, TRV +1.98, AXP +1.91, V +3.70, and XLF $24.34 +.34 (1.42%).\n \n \nOIL, $42.19 + .49. Oil was lower in last night’s trading before we rallied in the morning on a bigger than expected drawdown of supplies. We have tried several times to break to the upside and traded as high as $43.52 today before running into supply and turned it back.  The stocks were HIGHER with XLE $37.43 +.39 (1.05%).\n \n \nGOLD $2049.30 +28.30. It was a continuation rally and a new recovery high of $2,070.30.  I have only the NEM August 65 / 70 spread on in the Gold market. The spread was put on at $1.30 and finished the day @ $3.38.\n \n \nBITCOIN: closed $11,850 +480. After breaking out over $10,000 we have had a “running correction” pushing prices toward $12,000, reaching a recovery high of $11980 today. We had added 350 shares of GBTC @ $10.02 to our position of 400 @ $8.06, bringing our average price to $8.97, but sold 250 shares today @ $13.93. GBTC closed $13.84 + .64 today.\n \n \nTomorrow is another day.\n \nCAM",
        "subreddit": "options",
        "title": "DIS pleases...",
        "url": "https://www.reddit.com/r/options/comments/i4gttu/dis_pleases/",
        "created": 1596700407.0
    }
]