[
    {
        "author": "Narzghal",
        "created_utc": 1591189448,
        "id": "gvtk96",
        "num_comments": 244,
        "num_crossposts": 1,
        "selftext": "https://www.cnn.com/2020/06/03/media/amc-theatres-business-coronavirus/index.html",
        "subreddit": "wallstreetbets",
        "title": "AMC going down, has \"substantial doubts it can remain in business.\"",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gvtk96/amc_going_down_has_substantial_doubts_it_can/",
        "created": 1591218248.0
    },
    {
        "author": "stillness0072",
        "created_utc": 1592825636,
        "id": "hdqpz6",
        "num_comments": 120,
        "num_crossposts": 0,
        "selftext": "Form 8k was just dropped for $AMC, and what I can tell is they will reduce debt by about $1.4 Billion. That's pretty good news if I'm reading it right. One of the biggest movie theatre chains seems to not be going away anytime soon. Can't wait to see the re-release of Inception. Here is the SEC link below\n\n[https://www.sec.gov/ix?doc=/Archives/edgar/data/1411579/000110465920075414/tm2023105d1\\_8k.htm](https://www.sec.gov/ix?doc=/Archives/edgar/data/1411579/000110465920075414/tm2023105d1_8k.htm)",
        "subreddit": "stocks",
        "title": "Did AMC just reduce debt by $1.4 Billion?",
        "url": "https://www.reddit.com/r/stocks/comments/hdqpz6/did_amc_just_reduce_debt_by_14_billion/",
        "created": 1592854436.0
    },
    {
        "author": "BlueLight03",
        "created_utc": 1591194280,
        "id": "gvuvig",
        "num_comments": 94,
        "num_crossposts": 0,
        "selftext": "[https://www.cnn.com/2020/06/03/media/amc-theatres-business-coronavirus/index.html](https://www.cnn.com/2020/06/03/media/amc-theatres-business-coronavirus/index.html)\n\nAMC Theatres, the world's biggest movie theater chain, said on Wednesday that it has \"substantial doubt\" it can remain in business after closing locations across the globe during the coronavirus pandemic.\n\nThe theater chain, which closed its theaters earlier this year, expects to have lost between $2.1 billion and $2.4 billion in the first quarter.\n\nThe company also said that its revenue fell to $941.5 million, which was down roughly 22% from $1.2 billion in the same quarter last year. This quarter, the situation has gotten substantially worse.\n\n\"We are generating effectively no revenue,\" the company said in a regulatory filing Wednesday.\n\nAMC (AMC) will continue to monitor the \"potential lifting of various government operating restrictions,\" but added that the chain has serious challenges even if restrictions are lifted. That includes studios holding back new films from being shown.\n\n\"Even if governmental operating restrictions are lifted in certain jurisdictions, distributors may delay the release of new films until such time that operating restrictions are eased more broadly domestically and internationally, which may further limit our operations,\" the company said.\n\nThe company said that it had a cash balance of $718.3 million as of April.\n\n\"We believe we have the cash resources to reopen our theatres and resume our operations this summer or later,\" AMC said. \"Our liquidity needs thereafter will depend, among other things, on the timing of a full resumption of operations, the timing of movie releases and our ability to generate revenues.\"",
        "subreddit": "investing",
        "title": "AMC Theatres has 'substantial doubt' it can remain in business (yet is up 5%???)",
        "url": "https://www.reddit.com/r/investing/comments/gvuvig/amc_theatres_has_substantial_doubt_it_can_remain/",
        "created": 1591223080.0
    },
    {
        "author": "NCGiant",
        "created_utc": 1592522756,
        "id": "hbpgge",
        "num_comments": 74,
        "num_crossposts": 0,
        "selftext": "Just got an email announcing they are reopening 90% of their theaters on 7/15 and plan to open the rest by the end of July. There has been a lot of speculation about their financials and possibly bankruptcy, but the email indicates that they are strong financially and in no risk after raising $500 million in new investments. They’ve been floating between $5 and $6 the last month and slowly climbing for the last 3. The 1 year high of $12 was last August in the middle of the summer blockbuster season, which is a far cry from the 5 year of $35. \n\nAs we’ve seen across the country, nobody is being rational about social distancing so I’m not so sure people avoid theaters once they open. With a lot of movie releases being pushed back I don’t know how much steam they can pick up in the short term. Calls are pretty cheap premiums right now, but does anyone else think the stock has any life in it this summer?",
        "subreddit": "wallstreetbets",
        "title": "AMC theaters reopening mid July",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hbpgge/amc_theaters_reopening_mid_july/",
        "created": 1592551556.0
    },
    {
        "author": "JPowellsPrinter",
        "created_utc": 1592078801,
        "id": "h8epm4",
        "num_comments": 56,
        "num_crossposts": 0,
        "selftext": "We crashin again. Covered calls and puts all the fuckin way, TSLA / AMC leaps at the bottom.\n\nDidnt one guy make 450k off of fucking H? Sure. Ill get some cheap post-crash H calls. SPY calls too, calls on your mom and her boyfriend my dad, fucking leaps man.\n\nRemember when you didn’t get TSLA calls when they were $200? Cause I do. That was dumb. Let’s fix that.\n\n\npositions: SPY $300 1/15/22. TSLA $300c 1/15/22\n\nBut like, in a month.\n\nBURN MARKET BURN",
        "subreddit": "wallstreetbets",
        "title": "We gon be rich boys",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/h8epm4/we_gon_be_rich_boys/",
        "created": 1592107601.0
    },
    {
        "author": "RyFba",
        "created_utc": 1591921165,
        "id": "h7a3bi",
        "num_comments": 46,
        "num_crossposts": 0,
        "selftext": "[https://www.theatlantic.com/magazine/archive/2020/07/coronavirus-banks-collapse/612247/](https://www.theatlantic.com/magazine/archive/2020/07/coronavirus-banks-collapse/612247/)\n\nRead time: 20 mins, long I know but worth it I'm super serial\n\nCliffs: Remember 2008 when banks were swapping around bundles of subprime mortgages with AAA credit ratings like they were coked out strippers in heat? Well that shit is happening all over again except this time it's corporate debt. And they are designed to be safe as long defaults all don't happen at the same time... like some kindof black swan event like a global pandemic ya know? Oh shit. And who's been gobbling down this cheap ass debt? Companies like AMC Entertainment, Bob’s Discount Furniture, California Pizza Kitchen, the Container Store, Lands’ End, Men’s Wearhouse, and Party City. Some were totally are fuk before bat flu. Well $JPOW says all this risk is housed outside of the banks so they're gucci let's keep printing. But turns out banks are lying little shits, are trying to hide their exposure on their balance sheets and there's actually more of this shit floating around than there was of CDOs in 2008. Remember AIG? If you don't just take a peek at their 10 year chart. They're jacked to the tits on this new fangled collateralized debt again.\n\nPositions: nothing open, thinking WFC 10P 2021, AIG 5P 2021 and SPY 240P Oct. I want to dig in and find out who else is exposed to this shit, gonna watch Big Short again tonight to hype me up.\n\nBonus previous discussion on credit rating agencies gently fluffing wall streets balls: [https://www.reddit.com/r/wallstreetbets/comments/gk93sv/whistleblower\\_wall\\_street\\_has\\_engaged\\_in/](https://www.reddit.com/r/wallstreetbets/comments/gk93sv/whistleblower_wall_street_has_engaged_in/)",
        "subreddit": "wallstreetbets",
        "title": "Mom, banks are doing it again",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/h7a3bi/mom_banks_are_doing_it_again/",
        "created": 1591949965.0
    },
    {
        "author": "Force_Hammer",
        "created_utc": 1591740256,
        "id": "gzxecn",
        "num_comments": 42,
        "num_crossposts": 0,
        "selftext": "[https://www.marketwatch.com/story/amc-reports-22-billion-q1-loss-2020-06-09?mod=mw\\_quote\\_news](https://www.marketwatch.com/story/amc-reports-22-billion-q1-loss-2020-06-09?mod=mw_quote_news)\n\nI should note that I'm an investing n00b, but I don't see how AMC can survive the pandemic without bankruptcy.  Per the above article, AMC Entertainment Holdings Inc. reported a Q1 2020 loss of $2.2 billion.  If I remember correctly, shutdowns didn't really start occurring until mid-March, so that means they were operational for 2.5 months, and still losing money. Also,\n\n&gt;\"In our two largest territories, we are currently planning to reopen almost all of our U.S. and U.K. theatres in July\" to be ready to show the new film \"Tenet\" that is slated for release on July 17 and \"Mulan,\" the Walt Disney Co. film slated to be released July 24.\n\nThat sounds good, but I'm pretty sure that to keep patrons safe, full capacity in theatres will not be allowed until the pandemic is over.  Also, even with heavy cleaning after each movie showing, I'm not sure how many people will be willing to risk the virus to see a movie.  I think there were also several \"big\" movies that were moved from a 2020 release, to 2021 or 2022.\n\nIf AMC can come out of this pandemic without bankruptcy, maybe it's worth putting a few dollars in their stock? What are your thoughts?",
        "subreddit": "investing",
        "title": "Do you think AMC Theatres can survive the pandemic without going bankrupt?",
        "url": "https://www.reddit.com/r/investing/comments/gzxecn/do_you_think_amc_theatres_can_survive_the/",
        "created": 1591769056.0
    },
    {
        "author": "AuthorForNoOne",
        "created_utc": 1592419113,
        "id": "haxa2c",
        "num_comments": 39,
        "num_crossposts": 0,
        "selftext": "AMC is clearly not being bought as Deadline reported, and it cannot operate at full capacity, and it will miss out on revenue for months due to fear, and it has taken on massive debt - it is doomed. How is it doing better than before we knew about the impact of COVID?\n\nThe markets know all this information surely, what am I missing?",
        "subreddit": "investing",
        "title": "AMC is doomed.",
        "url": "https://www.reddit.com/r/investing/comments/haxa2c/amc_is_doomed/",
        "created": 1592447913.0
    },
    {
        "author": "Koolaids5459",
        "created_utc": 1592364690,
        "id": "haj6b5",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": "I put 15k of my savings in to amc!! Then RH let me use free money ?! I’m so excited my credit score is like 715 or something,I’m guessing thats why they gave me so much margin . It pays to be financially smart. I’m only 21 and I’m already going to have more money then all of you sad retards. I’m the one true autist , besides the man him self Jpow. God Bless America",
        "subreddit": "wallstreetbets",
        "title": "I margined all in baby gonna hit it big!!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/haj6b5/i_margined_all_in_baby_gonna_hit_it_big/",
        "created": 1592393490.0
    },
    {
        "author": "Nydas",
        "created_utc": 1591302875,
        "id": "gwpm4o",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "Im sure Cinemark doesnt have the capital to buyout AMC, right? Would AMC be sold peacemeal to the various other movie theater companies? Will congress allow someone like Amazon or Disney to buy them out?\n\nAssuming the worst for AMC, what ends up happening to the theaters owned by the largest chain in America?",
        "subreddit": "investing",
        "title": "How would bankruptcy of AMC effect the movie theater market?",
        "url": "https://www.reddit.com/r/investing/comments/gwpm4o/how_would_bankruptcy_of_amc_effect_the_movie/",
        "created": 1591331675.0
    },
    {
        "author": "stillness0072",
        "created_utc": 1592523727,
        "id": "hbpq7n",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "Looking at the AH action of $AMC. Looks like its shooting up. I have my suspections its cause of them opening in July, but maybe I'm missing something cause its moving pretty fast. My assumtion is whatever it is, it is a good sign for a company with such a low share float.",
        "subreddit": "investing",
        "title": "AH price action on Major Movie Theatre chain weird",
        "url": "https://www.reddit.com/r/investing/comments/hbpq7n/ah_price_action_on_major_movie_theatre_chain_weird/",
        "created": 1592552527.0
    },
    {
        "author": "stillness0072",
        "created_utc": 1592516485,
        "id": "hbnnv6",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "Movie theatres like $AMC and Cineworld(Regal) are opening up in July. With big budget movies Tenet and Mulan opening will be a huge catalyst. People need something to do other than worry. I know I do at least.\n\n I feel movie theatre stocks are gonna be moving up. They've been beaten down for too long. Things aren't going to close back up again, and have the social distancing in theatres. Personally I can't wait to see the re-release of Inception.",
        "subreddit": "investing",
        "title": "With movie theatres opeing in July a catalyst is forming",
        "url": "https://www.reddit.com/r/investing/comments/hbnnv6/with_movie_theatres_opeing_in_july_a_catalyst_is/",
        "created": 1592545285.0
    },
    {
        "author": "eddurham",
        "created_utc": 1591712479,
        "id": "gzo2t9",
        "num_comments": 26,
        "num_crossposts": 1,
        "selftext": "Information on AMC theaters possibly permantely closing\n\nhttps://www.cnn.com/2020/06/03/media/amc-theatres-business-coronavirus/index.html\n\nhttps://patch.com/california/across-ca/amc-theatres-54-locations-california-could-permanently-close\n\nThis comes out ahead of its quarterly report today after hours.\n\nTo quote, AMC said they have “substantial doubt” they will remain open.",
        "subreddit": "smallstreetbets",
        "title": "AMC Theatres “Substantial Doubt” it will remain open",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/gzo2t9/amc_theatres_substantial_doubt_it_will_remain_open/",
        "created": 1591741279.0
    },
    {
        "author": "astas33",
        "created_utc": 1591504796,
        "id": "gy6088",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "Examples of this include:\n\nHertz - after the bankruptcy filing announcement the stock tumbled a whopping ~51%. Now up ~200%.\nL Brands - don’t know too much about this stock, I have a friend who monitors this stock and has mentioned the rallies.\nAMC theaters - despite a rumor running around that said Amazon was planning on purchasing this company.\n\nI tried doing some research and finding out about this on my own; however, I could find anything.",
        "subreddit": "stocks",
        "title": "What is the correlation between companies filling for bankruptcy and their stocks rallying shortly after?",
        "url": "https://www.reddit.com/r/stocks/comments/gy6088/what_is_the_correlation_between_companies_filling/",
        "created": 1591533596.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1591459750,
        "id": "gxtpfc",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/StockMarket. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning June 8th, 2020.\n\n# **Look for the S&amp;P 500 to turn positive for the year with a boost from the Fed in the week ahead  - [(Source)](https://www.cnbc.com/2020/06/05/look-for-the-sp-500-to-turn-positive-for-the-year-with-a-boost-from-the-fed-in-the-week-ahead.html)**\n*****\n&gt; Federal Reserve Chairman Jerome Powell is expected to reassure markets next week the central bank will do whatever it takes to help the economy heal. That should be enough to keep investors moving into stocks that benefit from an economic rebound and push the S&amp;P 500 into the green for 2020.\n*****\n&gt; The Fed’s two-day meeting is the big event for markets in the coming week. There are a few economic reports, including inflation data, the consumer price index Wednesday and producer prices Thursday. Weekly jobless claims will be important Thursday to see if there’s a drop in continuing clams, after May’s employment report showed a surprising record gain of 2.5 million jobs.\n*****\n&gt; The reopening trade was in full swing in the past week, especially Friday when stocks surged on the jobs report, which was expected to show a loss of 8.3 million jobs. The Nasdaq broke above its record high set on Feb. 19, and the S&amp;P 500 was just 1.1% away from turning positive for 2020.\n*****\n&gt; Even before the jobs report, investors were loading up on financials, industrials, transports and small caps, which were up more than 8% for the week and 18.4% in the past month. S&amp;P financials were 12.1% higher on the week, S&amp;P industrials were up 10.5, and the NYSE airline index jumped more than 35.4.%.\n*****\n&gt; “I think next week is dominated by the reopening and it will be for another month,” said James Paulsen, chief investment strategist at Leuthold Group. “With cyclicals outperforming, small [caps] outperforming, credit spreads coming in and then the bond yields going up, everybody — all facets of the financial markets — are sort of suggesting the same outcome.”\n*****\n&gt; The S&amp;P 500 ended the week at 3,193, a gain of 4.9%, and now traders are watching to see if it can scale the psychological 3,200 level. The Dow closed Friday at 27,110, up 6.8% for the week, and the Nasdaq Composite was up 3.4%, at 9,814 after reaching an intraday record high of 9,845 Friday.\n*****\n&gt; Analysts say the market will likely look past the protests that broke out in cities across the U.S. after the death of George Floyd in Minneapolis. Four policemen were charged with murder in his death. Looters joined the protests, some of which turned violent, but they quieted down towards the end of the week.\n*****\n&gt; Stocks were higher for a third week in a row, but a change this past week has been the abrupt lurch higher in Treasury yields. The 10-year rose to a high of 0.95% Friday, a quarter-point move in just three sessions. The move was already underway but got a lift Wednesday when ADP jobs data was not nearly as bad as expected. Yields ripped even higher after the May employment report showed the unemployment rate actually fell to 13.3%, instead of climbing to 20%, as expected by economists.\n*****\n&gt; Bond strategists said the Treasury market was now acknowledging the potential for a recovery, but not in the exuberant way the stock market has been. Since March 23, the S&amp;P 500 has risen more than 45%, but it took the 10-year Treasury until this week to get back the yield level it was at when stocks bottomed.\n*****\n&gt; Paulsen said he believes a new bull market has been launched, but there could be pullbacks and some headwinds for the market coming up.\n*****\n&gt; “When GDP is minus 30%, other issues don’t matter. There’s just one issue. But as the economy reopens again, the trade battles will matter again, presidential politics will matter again,” said Paulsen, adding the budget deficit could also matter. “I think we’ll get removed from a sole focus. That isn’t quite there but I think it’s coming.”\n*****\n&gt; # Fed ahead\n&gt; The Fed begins its two-day meeting Tuesday, and will release its statement Wednesday afternoon, followed by a video briefing by Powell.\n*****\n&gt; “Whey would the Fed want to disrupt this with anything?” Paulsen said. “They’re still going to support the economy. They’re going to stay away from negative rates or yield curve management. They’re not going to do anything to scare the markets. They might certainly reassure people that they are still ready to provide support.”\n*****\n&gt; Ethan Harris, head of global economics at Bank of America, said the Fed may clarify where it stands on some of the extraordinary moves it has taken since it cut rates to zero. The Fed has been supporting the markets with asset purchases and multiple programs for commercial paper, corporate bonds, and municipal bonds, for example.\n*****\n&gt; “We think right now they’re just trying to get this Main Street lending program to work. The question is are they going to do more things around what they do in terms of forward guidance and next steps of macro easing,” Harris said.\n*****\n&gt; There has been speculation that the Fed would do some type of so-called yield curve control, a program to keep interest rates capped at certain levels. “I think it’s too early for that,” said Harris. He said the Fed would be guaranteeing low rates for a long period of time if it does yield curve control.\n*****\n&gt; “Yield curve control is basically open-ended quantitative easing,” he said. The Fed is currently buying Treasurys but if it wanted to stop yields from rising too much as the economy improves, it could make targeted purchases.\n*****\n&gt; Barclays chief U.S. economist Michael Gapen said it’s possible the Fed could announce the yield curve control. “We’ve said they could implement yield curve control out to three years,” he said. “In my mind that matches the length of the horizon of the economic projections.”\n*****\n&gt; Powell has said the economy needs more fiscal help, and he could reiterate those comments Wednesday. President Donald Trump on Friday said he backs more stimulus. So far, the Democrats have put out a marker with their wish list for further spending, but there have been no negotiations.\n*****\n&gt; There was concern the strong jobs report could make it harder to get buy in for another big spending package. But some economists say the recovery needs a boost and states need funding to fill the holes in their budgets from coronavirus-related spending and a lack of tax receipts.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/7klaXQm.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/PKTBzT2.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/a5JkAB6.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/M2x4Qoq.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/qtJYfXN.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/bjiJWjV.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/UAi19KJ.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/GQm4ruO.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/PQzyXLa.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/uV1U7FN.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/wm2XJND.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/yarkiMO.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/hFblu2G.png))**\n\n*****\n\n# S&amp;P 500 Stocks Outpacing Analyst Price Targets\n\n&gt; This morning's jobs report shocked the financial world -- most notably the economists whose job it is to provide estimates. The consensus estimate among economists for May nonfarm payrolls was projecting a loss of more than 7 million jobs. The actual number that was reported did not just show a smaller than expected job loss, but it actually showed a gain in jobs of more than 2.5 million.\n\n&gt; We're seeing a similar situation play out in the equity analyst community. With the S&amp;P 500 now up 40%+ since its low less than three months ago, the average stock in the index is now trading above its consensus analyst price target that looks 12 months out. Analysts have simply not been able to catch up to the rapid rise we've seen for equity prices.\n\n&gt; It's extremely rare to see share prices move above consensus analyst price targets. We don't have the historical daily data on this, but anecdotally we can't remember a time when the spread has been this wide. As shown below, at the end of 2019 when the S&amp;P finished a massive rally, equity prices were 5.5% below the consensus price target. That was seen as a very tight spread prior to what we're seeing now. At the lows in March, the average share price had dropped all the way to $92.50 compared to an average consensus price target of $143.20. That projected a gain of 54.9% at the time!\n\n&gt; Since March 23rd, the average share price has risen from $92.50 up to $138.40, while the average analyst price target has fallen from $143.20 to $136. Current price targets no longer project a gain for the average S&amp;P 500 stock, but rather a 1.7% drop.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/avgpricetarget.png))**\n\n&gt; # Nasdaq's Historical Run\n\n&gt; At its highs earlier this morning, the Nasdaq Composite was within 2% of its record high from earlier in the year. Besides the steep V-shape of the Nasdaq's pattern over the last four months, the other aspect of the chart that stands out is just how steep the 50-day moving average is trending lately.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060420-Nasdaq-50DMAa.png))**\n\n&gt; To illustrate just how steep the Nasdaq's 50-DMA has become, the chart below shows the daily percentage change of the 50-day going back to 1971. Currently, the Nasdaq 50-DMA is rising at an average of over 0.5% per day. That's an incredible slope and a level that has been exceeded only a handful of times in the Nasdaq's 50-year history.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060420-Nasdaq-Composite1.png))**\n\n*****\n\n# Big Gains From Smaller Tech\n\n&gt; It's still difficult to fathom the moves in the US equity market over the last four months. The fact that the Nasdaq and more specifically the Technology sector aren't far from record highs is definitely something no one was expecting two months ago. There's an old market saying that equities take the stairs up and the elevator down, but in the latest market cycle, the elevator up was almost as fast as the way down!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060320-Nasdaq.png))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060320-Technology-Sector.png))**\n\n&gt; If you've been following the markets, all you've likely heard up until recently is that large-cap tech, and more specifically, Microsoft (MSFT), Apple (AAPL), Amazon (AMZN), Alphabet (GOOGL), and Facebook (FB), are single-handedly driving the market higher. The reality is not nearly as clear-cut. Given their market caps, the \"Big 5\" (as they're often referred to) have done a lot of heavy lifting, but in terms of performance, they're hardly the only game in town.\n\n&gt; The table below lists Technology sector stocks in the Russell 3000 with market caps of more than $1 billion that are outperforming all of the 'big 5' tech stocks on a YTD basis. Actually, since Amazon is doing so well relative to the rest of the \"big 5\" these are all stocks that are outperforming Amazon. If we looked for stocks that were doing better than the average return of the \"big 5\" the list would be a lot, lot longer (+16.4%).\n\n&gt; Looking through the list of names below, the two top-performing names are Zscaler (ZS) and Twilio (TWLO), which have both more than doubled. Behind these two, DocuSign (DOCU) and Sprout Social (SPT) are both knocking on the door of triple-digits. All 28 of the names listed have market caps of $1 billion, but the average market cap is just over $21 billion, while Nvidia (NVDA) is the largest company on the list with a market cap of $216 billion. For the most part, these aren't names that have been driving the indices, but anyone holding these stocks in their portfolio probably doesn't care!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060320-Tech-Stocks.png))**\n\n*****\n\n# Best 50-Day Rally Ever\n\n&gt; In many ways, what we’ve seen so far in 2020 has been both record-breaking and devastating. From the S&amp;P 500 Index peak on February 19 to the bear market lows March 23, stocks lost 33.9%. Now, 50 trading days later, stocks have gained 39.6%, for the largest 50-day rally since the S&amp;P 500 moved to 500 stocks in 1957.\n\n&gt; “There are no rollercoasters that can replicate what stocks have done so far in 2020,” exclaimed LPL Financial Senior Market Strategist Ryan Detrick. “Here’s the catch though: Big 50-day rallies in the past have taken place near the start of new bull markets, and the returns going out a year were quite bullish.”\n\n&gt; As shown in the LPL Chart of the Day, the 39.6% gain in 50 days was the greatest 50-day rally ever, besting the previous best in October 1982. What’s important to note here is that many of these rallies took place coming off major market lows, and delivered quite strong returns going out 6 to 12 months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/06/best-fifty-days.png?ssl=1))**\n\n&gt; Although we have near-term worries given this historic run, as some sentiment indicators such as put/call ratios are showing some froth, from a bigger picture perspective, this strong 50-day rally offers a reason to think stock prices may be even higher this time next year.\n\n*****\n\n# 2020 In Charts\n\n&gt; 2020 is only five months old, but in many ways it is one of the most historic years we’ve ever seen. “2020 went from moving along nicely, to seeing the worst recession in a generation and the fastest bear market ever,” explained LPL Financial Senior Market Strategist Ryan Detrick. “Now stocks are in the midst of one of the best bull runs ever, even though the economy remains extremely weak, thanks to record stimulus and hopes over a vaccine.”\n&gt; \nTo best sum it all up, here are 10 charts that tell the picture of 2020 so far.\n\n&gt; 1.) The 2010s were the first decade in history to go all 10 years without a recession, which of course ended just months into the new decade, as the economy stopped. Stocks gained 13.5% on an annual basis last decade, surprisingly, only the third-best decade over the past four.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/06/1-blog-chart.png?ssl=1))**\n\n&gt; 2.) This is an election year, and the S&amp;P 500 Index hasn’t been lower when a President is up for reelection since FDR in 1940. Although this seemed nearly impossible at the March lows, it is looking like this incredible streak could have a chance in 2020.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/2-blog-chart.png?ssl=1))**\n\n&gt; 3.) One of the first signs something could go wrong in 2020 was stocks fell in January. Historically, this has meant potential trouble for the final 11 months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/3-blog-chart.png?ssl=1))**\n\n&gt; 4.) As fears over COVID-19 gripped the world, the Dow Jones Industrial Average had its fastest bear market ever, in only 19 days. To put this in perspective, this was the fastest bear market in the 124-year history of the Dow.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/4-blog-chart.png?ssl=1))**\n\n&gt; 5.) Mark Twain said “History doesn’t repeat itself, but it often rhymes”. Looking at history, every 50 years there has been a terrible pandemic and stocks fell more than 30%. We don’t know if the ultimate lows are in this time, but so far, history is rhyming.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/blog-chart-5.png?ssl=1))**\n\n&gt; 6.) More than 20 million people in the US lost their jobs in April, while the unemployment rate soared to near 15%, the highest since the Great Depression. Record drops in manufacturing, industrial production, retail sales, and consumer spending have all taken place in the past two months as well.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/6-blog-chart.png?ssl=1))**\n\n&gt; 7.) A recession is here, ending the streak of 128 months in a row without one. What is unique about the previous expansion was nominal gross domestic product (GDP) grew only 50%, about the average growth seen during the previous expansions, but this expansion was nearly twice as long as the average expansion (10 years versus 5 years).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/7-blog-chart.png?ssl=1))**\n\n&gt; 8.) The bounce off of the March 23 S&amp;P 500 lows has been historic in many ways. In fact, it was one of the best 20-day rallies ever, with previous best rallies seeing strong returns 6 and 12 months later.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/8-blog-chart.png?ssl=1))**\n\n&gt; 9.) As scary as it was on the way down, stocks have come roaring back, gaining more than 35% from the March 23 lows. This would classify as the greatest bear market bounce ever, which opens the question: is this more than a bear market bounce and instead the start of a new bull market?\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/9-blog-chart.png?ssl=1))**\n\n&gt; 10.) The number of COVID-19 tests in the US nearly doubled in May versus what was seen in April. Additionally, fewer and fewer tests are coming back positive. Testing is one of the key ways we will beat this and this is a step in the right direction. We’ve also seen new monthly lows in people on ventilators, in the ICU, and in hospitals.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/9-blog-chart.png?ssl=1))**\n\n&gt; Hard to believe, but there are still 7 months left in 2020. It hasn’t been easy for any of us, and we continue to keep everyone impacted by this pandemic in mind, but we continue to see the glass as half full. The dual benefit of record monetary and fiscal policy should help create a bridge to help those most impacted, while the economy can slowly come back online later this year.\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending June 5th, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=p1HAZbHiMUI))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 6.7.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n*(VIDEO NOT YET POSTED!)*\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$ADBE** \n&gt; * **$UNFI** \n&gt; * **$CHWY** \n&gt; * **$TIF** \n&gt; * **$LULU** \n&gt; * **$COUP** \n&gt; * **$SFIX** \n&gt; * **$LOVE** \n&gt; * **$NEPT** \n&gt; * **$GHM** \n&gt; * **$REVG** \n&gt; * **$GME** \n&gt; * **$HDS** \n&gt; * **$FIVE** \n&gt; * **$SIG** \n&gt; * **$CASY** \n&gt; * **$CVGW** \n&gt; * **$AMC** \n&gt; * **$FCEL** \n&gt; * **$QTNT** \n&gt; * **$PLCE** \n&gt; * **$CHS** \n&gt; * **$THO** \n&gt; * **$GCO** \n&gt; * **$BF.B** \n&gt; * **$LMNR** \n&gt; * **$WSG** \n&gt; * **$PRTY** \n&gt; * **$GES** \n&gt; * **$BBCP** \n&gt; * **$CONN** \n&gt; * **$HEXO** \n&gt; * **$PHR** \n&gt; * **$PVH** \n&gt; * **$RRGB** \n&gt; * **$PLAY** \n&gt; * **$TNP** \n&gt; * **$JW.A** \n&gt; * **$SB** \n&gt; * **$GSM** \n&gt; * **$SRT**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/PQzyXLa.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/bgPdMCr.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 6.8.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/d2EW1kr.png))\n\n&gt; # ***Monday 6.8.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/uxSiJJr.png))\n\n*****\n\n&gt; # ***Tuesday 6.9.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/3SIjcG7.png))\n\n&gt; # ***Tuesday 6.9.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/cRBrPlt.png))\n\n*****\n\n&gt; # ***Wednesday 6.10.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/DaheXAm.png))\n\n&gt; # ***Wednesday 6.10.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/9mcHxTl.png))\n\n*****\n\n&gt; # ***Thursday 6.11.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/i8SNjWM.png))\n\n&gt; # ***Thursday 6.11.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/9xcBZPK.png))\n\n*****\n\n&gt; # ***Friday 6.12.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n&gt; # ***Friday 6.12.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# Adobe Inc. $392.90\n&gt; **Adobe Inc. (ADBE)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, June 11, 2020. The consensus earnings estimate is $2.33 per share on revenue of $3.17 billion and the Earnings Whisper ® number is $2.39 per share. Investor sentiment going into the company's earnings release has 79% expecting an earnings beat The company's guidance was for earnings of approximately $2.35 per share. Consensus estimates are for year-over-year earnings growth of 26.63% with revenue increasing by 15.51%. Short interest has increased by 3.0% since the company's last earnings release while the stock has drifted higher by 25.6% from its open following the earnings release to be 23.1% above its 200 day moving average of $319.27. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, May 19, 2020 there was some notable buying of 3,194 contracts of the $410.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 4.8% move on earnings and the stock has averaged a 6.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ADBE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# United Natural Foods, Inc. $20.78\n&gt; **United Natural Foods, Inc. (UNFI)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, June 10, 2020. The consensus earnings estimate is $1.41 per share on revenue of $6.67 billion and the Earnings Whisper ® number is $1.42 per share. Investor sentiment going into the company's earnings release has 78% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 131.15% with revenue increasing by 11.86%. Short interest has decreased by 16.0% since the company's last earnings release while the stock has drifted higher by 202.5% from its open following the earnings release to be 96.1% above its 200 day moving average of $10.60. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, June 2, 2020 there was some notable buying of 2,226 contracts of the $22.50 call expiring on Friday, June 19, 2020. Option traders are pricing in a 17.7% move on earnings and the stock has averaged a 15.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=UNFI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Chewy, Inc. $48.44\n&gt; **Chewy, Inc. (CHWY)** is confirmed to report earnings at approximately 4:10 PM ET on Tuesday, June 9, 2020. The consensus estimate is for a loss of $0.11 per share on revenue of $1.55 billion and the Earnings Whisper ® number is ($0.09) per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 37.50% with revenue increasing by 39.78%. Short interest has increased by 37.9% since the company's last earnings release while the stock has drifted higher by 37.5% from its open following the earnings release to be 56.4% above its 200 day moving average of $30.97. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 5.8% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CHWY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Tiffany &amp; Co. $121.99\n&gt; **Tiffany &amp; Co. (TIF)** is confirmed to report earnings at approximately 6:40 AM ET on Tuesday, June 9, 2020. The consensus earnings estimate is $0.21 per share on revenue of $646.40 million. Investor sentiment going into the company's earnings release has 6% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 79.61% with revenue decreasing by 35.56%. Short interest has decreased by 26.5% since the company's last earnings release while the stock has drifted lower by 4.7% from its open following the earnings release to be 1.9% above its 200 day moving average of $119.75. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, June 5, 2020 there was some notable buying of 9,022 contracts of the $110.00 put expiring on Friday, August 21, 2020. Option traders are pricing in a 6.2% move on earnings and the stock has averaged a 3.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TIF&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# lululemon athletica inc. $319.78\n&gt; **lululemon athletica inc. (LULU)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, June 11, 2020. The consensus earnings estimate is $0.28 per share on revenue of $724.78 million and the Earnings Whisper ® number is $0.30 per share. Investor sentiment going into the company's earnings release has 47% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 62.16% with revenue decreasing by 7.35%. Short interest has increased by 53.3% since the company's last earnings release while the stock has drifted higher by 66.1% from its open following the earnings release to be 46.8% above its 200 day moving average of $217.77. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, June 4, 2020 there was some notable buying of 1,385 contracts of the $350.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 9.4% move on earnings and the stock has averaged a 7.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LULU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Coupa Software $216.94\n&gt; **Coupa Software (COUP)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, June 8, 2020. The consensus earnings estimate is $0.07 per share on revenue of $111.83 million and the Earnings Whisper ® number is $0.10 per share. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat The company's guidance was for earnings of $0.06 to $0.08 per share on revenue of $112.00 million to $112.00 million. Consensus estimates are for year-over-year earnings growth of 450.00% with revenue increasing by 37.48%. Short interest has increased by 7.9% since the company's last earnings release while the stock has drifted higher by 94.9% from its open following the earnings release to be 40.3% above its 200 day moving average of $154.59. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, June 4, 2020 there was some notable buying of 1,085 contracts of the $220.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 12.7% move on earnings and the stock has averaged a 9.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=COUP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Stitch Fix, Inc. $24.96\n&gt; **Stitch Fix, Inc. (SFIX)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, June 8, 2020. The consensus estimate is for a loss of $0.17 per share on revenue of $401.40 million and the Earnings Whisper ® number is ($0.13) per share. Investor sentiment going into the company's earnings release has 53% expecting an earnings beat The company's guidance was for revenue of $465.00 million to $475.00 million. Consensus estimates are for earnings to decline year-over-year by 342.86% with revenue decreasing by 1.83%. Short interest has increased by 4.0% since the company's last earnings release while the stock has drifted higher by 66.4% from its open following the earnings release to be 19.1% above its 200 day moving average of $20.96. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, June 2, 2020 there was some notable buying of 5,092 contracts of the $25.00 call expiring on Friday, June 12, 2020. Option traders are pricing in a 21.2% move on earnings and the stock has averaged a 13.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SFIX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Lovesac Company $17.84\n&gt; **Lovesac Company (LOVE)** is confirmed to report earnings at approximately 7:00 AM ET on Tuesday, June 9, 2020. The consensus estimate is for a loss of $0.69 per share on revenue of $48.22 million and the Earnings Whisper ® number is ($0.65) per share. Investor sentiment going into the company's earnings release has 52% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 2.99% with revenue increasing by 17.73%. Short interest has increased by 20.5% since the company's last earnings release while the stock has drifted higher by 109.9% from its open following the earnings release to be 31.5% above its 200 day moving average of $13.57. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 20.1% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LOVE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Neptune Wellness Solutions Inc. $3.14\n&gt; **Neptune Wellness Solutions Inc. (NEPT)** is confirmed to report earnings after the market closes on Wednesday, June 10, 2020. The consensus estimate is for a loss of $0.08 per share on revenue of $6.32 million and the Earnings Whisper ® number is ($0.10) per share. Investor sentiment going into the company's earnings release has 63% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 100.00% with revenue increasing by 48.36%. Short interest has decreased by 4.7% since the company's last earnings release while the stock has drifted higher by 56.2% from its open following the earnings release to be 6.4% above its 200 day moving average of $2.95. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, May 19, 2020 there was some notable buying of 2,960 contracts of the $3.00 call expiring on Friday, June 19, 2020. The stock has averaged a 8.1% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NEPT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Graham Corporation $15.58\n&gt; **Graham Corporation (GHM)** is confirmed to report earnings at approximately 6:30 AM ET on Wednesday, June 10, 2020. The consensus earnings estimate is $0.12 per share on revenue of $32.00 million. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 50.00% with revenue increasing by 35.36%. Short interest has increased by 89.8% since the company's last earnings release while the stock has drifted lower by 21.7% from its open following the earnings release. Overall earnings estimates have been revised lower since the company's last earnings release.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=GHM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/StockMarket.",
        "subreddit": "StockMarket",
        "title": "Wall Street Week Ahead for the trading week beginning June 8th, 2020",
        "url": "https://www.reddit.com/r/StockMarket/comments/gxtpfc/wall_street_week_ahead_for_the_trading_week/",
        "created": 1591488550.0
    },
    {
        "author": "TacticalDrinkin",
        "created_utc": 1591859069,
        "id": "h0u5ha",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Theatres have been closed for months, the rumors of an Amazon buyout were false, they are looking at bankruptcy and their recent earnings were absolutely garbage. How and why were they up almost 10% today after missing earnings by 40+% ?",
        "subreddit": "stocks",
        "title": "Why is AMC up?",
        "url": "https://www.reddit.com/r/stocks/comments/h0u5ha/why_is_amc_up/",
        "created": 1591887869.0
    },
    {
        "author": "anonymousthoughtsss",
        "created_utc": 1591903312,
        "id": "h160oh",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Should I ???? I mean just in case they get bought out by amazon or make a comeback because damnn lmaoo",
        "subreddit": "stocks",
        "title": "AMC STOCK IS 5$!?!?",
        "url": "https://www.reddit.com/r/stocks/comments/h160oh/amc_stock_is_5/",
        "created": 1591932112.0
    },
    {
        "author": "kiskka0999",
        "created_utc": 1592570253,
        "id": "hbzxvc",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "I am new to trading.what do you guys think about cinema stocks. In what direction will J Powell affect today?",
        "subreddit": "stocks",
        "title": "Will CNK and AMC going up?",
        "url": "https://www.reddit.com/r/stocks/comments/hbzxvc/will_cnk_and_amc_going_up/",
        "created": 1592599053.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1591460250,
        "id": "gxtut4",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "Good Saturday afternoon to all of you here on r/smallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning June 8th, 2020.\n\n# **Look for the S&amp;P 500 to turn positive for the year with a boost from the Fed in the week ahead  - [(Source)](https://www.cnbc.com/2020/06/05/look-for-the-sp-500-to-turn-positive-for-the-year-with-a-boost-from-the-fed-in-the-week-ahead.html)**\n*****\n&gt; Federal Reserve Chairman Jerome Powell is expected to reassure markets next week the central bank will do whatever it takes to help the economy heal. That should be enough to keep investors moving into stocks that benefit from an economic rebound and push the S&amp;P 500 into the green for 2020.\n*****\n&gt; The Fed’s two-day meeting is the big event for markets in the coming week. There are a few economic reports, including inflation data, the consumer price index Wednesday and producer prices Thursday. Weekly jobless claims will be important Thursday to see if there’s a drop in continuing clams, after May’s employment report showed a surprising record gain of 2.5 million jobs.\n*****\n&gt; The reopening trade was in full swing in the past week, especially Friday when stocks surged on the jobs report, which was expected to show a loss of 8.3 million jobs. The Nasdaq broke above its record high set on Feb. 19, and the S&amp;P 500 was just 1.1% away from turning positive for 2020.\n*****\n&gt; Even before the jobs report, investors were loading up on financials, industrials, transports and small caps, which were up more than 8% for the week and 18.4% in the past month. S&amp;P financials were 12.1% higher on the week, S&amp;P industrials were up 10.5, and the NYSE airline index jumped more than 35.4.%.\n*****\n&gt; “I think next week is dominated by the reopening and it will be for another month,” said James Paulsen, chief investment strategist at Leuthold Group. “With cyclicals outperforming, small [caps] outperforming, credit spreads coming in and then the bond yields going up, everybody — all facets of the financial markets — are sort of suggesting the same outcome.”\n*****\n&gt; The S&amp;P 500 ended the week at 3,193, a gain of 4.9%, and now traders are watching to see if it can scale the psychological 3,200 level. The Dow closed Friday at 27,110, up 6.8% for the week, and the Nasdaq Composite was up 3.4%, at 9,814 after reaching an intraday record high of 9,845 Friday.\n*****\n&gt; Analysts say the market will likely look past the protests that broke out in cities across the U.S. after the death of George Floyd in Minneapolis. Four policemen were charged with murder in his death. Looters joined the protests, some of which turned violent, but they quieted down towards the end of the week.\n*****\n&gt; Stocks were higher for a third week in a row, but a change this past week has been the abrupt lurch higher in Treasury yields. The 10-year rose to a high of 0.95% Friday, a quarter-point move in just three sessions. The move was already underway but got a lift Wednesday when ADP jobs data was not nearly as bad as expected. Yields ripped even higher after the May employment report showed the unemployment rate actually fell to 13.3%, instead of climbing to 20%, as expected by economists.\n*****\n&gt; Bond strategists said the Treasury market was now acknowledging the potential for a recovery, but not in the exuberant way the stock market has been. Since March 23, the S&amp;P 500 has risen more than 45%, but it took the 10-year Treasury until this week to get back the yield level it was at when stocks bottomed.\n*****\n&gt; Paulsen said he believes a new bull market has been launched, but there could be pullbacks and some headwinds for the market coming up.\n*****\n&gt; “When GDP is minus 30%, other issues don’t matter. There’s just one issue. But as the economy reopens again, the trade battles will matter again, presidential politics will matter again,” said Paulsen, adding the budget deficit could also matter. “I think we’ll get removed from a sole focus. That isn’t quite there but I think it’s coming.”\n*****\n&gt; # Fed ahead\n&gt; The Fed begins its two-day meeting Tuesday, and will release its statement Wednesday afternoon, followed by a video briefing by Powell.\n*****\n&gt; “Whey would the Fed want to disrupt this with anything?” Paulsen said. “They’re still going to support the economy. They’re going to stay away from negative rates or yield curve management. They’re not going to do anything to scare the markets. They might certainly reassure people that they are still ready to provide support.”\n*****\n&gt; Ethan Harris, head of global economics at Bank of America, said the Fed may clarify where it stands on some of the extraordinary moves it has taken since it cut rates to zero. The Fed has been supporting the markets with asset purchases and multiple programs for commercial paper, corporate bonds, and municipal bonds, for example.\n*****\n&gt; “We think right now they’re just trying to get this Main Street lending program to work. The question is are they going to do more things around what they do in terms of forward guidance and next steps of macro easing,” Harris said.\n*****\n&gt; There has been speculation that the Fed would do some type of so-called yield curve control, a program to keep interest rates capped at certain levels. “I think it’s too early for that,” said Harris. He said the Fed would be guaranteeing low rates for a long period of time if it does yield curve control.\n*****\n&gt; “Yield curve control is basically open-ended quantitative easing,” he said. The Fed is currently buying Treasurys but if it wanted to stop yields from rising too much as the economy improves, it could make targeted purchases.\n*****\n&gt; Barclays chief U.S. economist Michael Gapen said it’s possible the Fed could announce the yield curve control. “We’ve said they could implement yield curve control out to three years,” he said. “In my mind that matches the length of the horizon of the economic projections.”\n*****\n&gt; Powell has said the economy needs more fiscal help, and he could reiterate those comments Wednesday. President Donald Trump on Friday said he backs more stimulus. So far, the Democrats have put out a marker with their wish list for further spending, but there have been no negotiations.\n*****\n&gt; There was concern the strong jobs report could make it harder to get buy in for another big spending package. But some economists say the recovery needs a boost and states need funding to fill the holes in their budgets from coronavirus-related spending and a lack of tax receipts.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/7klaXQm.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/PKTBzT2.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/a5JkAB6.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/M2x4Qoq.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/qtJYfXN.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/bjiJWjV.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/UAi19KJ.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/GQm4ruO.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/PQzyXLa.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/uV1U7FN.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/wm2XJND.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/yarkiMO.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/hFblu2G.png))**\n\n*****\n\n# S&amp;P 500 Stocks Outpacing Analyst Price Targets\n\n&gt; This morning's jobs report shocked the financial world -- most notably the economists whose job it is to provide estimates. The consensus estimate among economists for May nonfarm payrolls was projecting a loss of more than 7 million jobs. The actual number that was reported did not just show a smaller than expected job loss, but it actually showed a gain in jobs of more than 2.5 million.\n\n&gt; We're seeing a similar situation play out in the equity analyst community. With the S&amp;P 500 now up 40%+ since its low less than three months ago, the average stock in the index is now trading above its consensus analyst price target that looks 12 months out. Analysts have simply not been able to catch up to the rapid rise we've seen for equity prices.\n\n&gt; It's extremely rare to see share prices move above consensus analyst price targets. We don't have the historical daily data on this, but anecdotally we can't remember a time when the spread has been this wide. As shown below, at the end of 2019 when the S&amp;P finished a massive rally, equity prices were 5.5% below the consensus price target. That was seen as a very tight spread prior to what we're seeing now. At the lows in March, the average share price had dropped all the way to $92.50 compared to an average consensus price target of $143.20. That projected a gain of 54.9% at the time!\n\n&gt; Since March 23rd, the average share price has risen from $92.50 up to $138.40, while the average analyst price target has fallen from $143.20 to $136. Current price targets no longer project a gain for the average S&amp;P 500 stock, but rather a 1.7% drop.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/avgpricetarget.png))**\n\n&gt; # Nasdaq's Historical Run\n\n&gt; At its highs earlier this morning, the Nasdaq Composite was within 2% of its record high from earlier in the year. Besides the steep V-shape of the Nasdaq's pattern over the last four months, the other aspect of the chart that stands out is just how steep the 50-day moving average is trending lately.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060420-Nasdaq-50DMAa.png))**\n\n&gt; To illustrate just how steep the Nasdaq's 50-DMA has become, the chart below shows the daily percentage change of the 50-day going back to 1971. Currently, the Nasdaq 50-DMA is rising at an average of over 0.5% per day. That's an incredible slope and a level that has been exceeded only a handful of times in the Nasdaq's 50-year history.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060420-Nasdaq-Composite1.png))**\n\n*****\n\n# Big Gains From Smaller Tech\n\n&gt; It's still difficult to fathom the moves in the US equity market over the last four months. The fact that the Nasdaq and more specifically the Technology sector aren't far from record highs is definitely something no one was expecting two months ago. There's an old market saying that equities take the stairs up and the elevator down, but in the latest market cycle, the elevator up was almost as fast as the way down!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060320-Nasdaq.png))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060320-Technology-Sector.png))**\n\n&gt; If you've been following the markets, all you've likely heard up until recently is that large-cap tech, and more specifically, Microsoft (MSFT), Apple (AAPL), Amazon (AMZN), Alphabet (GOOGL), and Facebook (FB), are single-handedly driving the market higher. The reality is not nearly as clear-cut. Given their market caps, the \"Big 5\" (as they're often referred to) have done a lot of heavy lifting, but in terms of performance, they're hardly the only game in town.\n\n&gt; The table below lists Technology sector stocks in the Russell 3000 with market caps of more than $1 billion that are outperforming all of the 'big 5' tech stocks on a YTD basis. Actually, since Amazon is doing so well relative to the rest of the \"big 5\" these are all stocks that are outperforming Amazon. If we looked for stocks that were doing better than the average return of the \"big 5\" the list would be a lot, lot longer (+16.4%).\n\n&gt; Looking through the list of names below, the two top-performing names are Zscaler (ZS) and Twilio (TWLO), which have both more than doubled. Behind these two, DocuSign (DOCU) and Sprout Social (SPT) are both knocking on the door of triple-digits. All 28 of the names listed have market caps of $1 billion, but the average market cap is just over $21 billion, while Nvidia (NVDA) is the largest company on the list with a market cap of $216 billion. For the most part, these aren't names that have been driving the indices, but anyone holding these stocks in their portfolio probably doesn't care!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060320-Tech-Stocks.png))**\n\n*****\n\n# Best 50-Day Rally Ever\n\n&gt; In many ways, what we’ve seen so far in 2020 has been both record-breaking and devastating. From the S&amp;P 500 Index peak on February 19 to the bear market lows March 23, stocks lost 33.9%. Now, 50 trading days later, stocks have gained 39.6%, for the largest 50-day rally since the S&amp;P 500 moved to 500 stocks in 1957.\n\n&gt; “There are no rollercoasters that can replicate what stocks have done so far in 2020,” exclaimed LPL Financial Senior Market Strategist Ryan Detrick. “Here’s the catch though: Big 50-day rallies in the past have taken place near the start of new bull markets, and the returns going out a year were quite bullish.”\n\n&gt; As shown in the LPL Chart of the Day, the 39.6% gain in 50 days was the greatest 50-day rally ever, besting the previous best in October 1982. What’s important to note here is that many of these rallies took place coming off major market lows, and delivered quite strong returns going out 6 to 12 months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/06/best-fifty-days.png?ssl=1))**\n\n&gt; Although we have near-term worries given this historic run, as some sentiment indicators such as put/call ratios are showing some froth, from a bigger picture perspective, this strong 50-day rally offers a reason to think stock prices may be even higher this time next year.\n\n*****\n\n# 2020 In Charts\n\n&gt; 2020 is only five months old, but in many ways it is one of the most historic years we’ve ever seen. “2020 went from moving along nicely, to seeing the worst recession in a generation and the fastest bear market ever,” explained LPL Financial Senior Market Strategist Ryan Detrick. “Now stocks are in the midst of one of the best bull runs ever, even though the economy remains extremely weak, thanks to record stimulus and hopes over a vaccine.”\n&gt; \nTo best sum it all up, here are 10 charts that tell the picture of 2020 so far.\n\n&gt; 1.) The 2010s were the first decade in history to go all 10 years without a recession, which of course ended just months into the new decade, as the economy stopped. Stocks gained 13.5% on an annual basis last decade, surprisingly, only the third-best decade over the past four.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/06/1-blog-chart.png?ssl=1))**\n\n&gt; 2.) This is an election year, and the S&amp;P 500 Index hasn’t been lower when a President is up for reelection since FDR in 1940. Although this seemed nearly impossible at the March lows, it is looking like this incredible streak could have a chance in 2020.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/2-blog-chart.png?ssl=1))**\n\n&gt; 3.) One of the first signs something could go wrong in 2020 was stocks fell in January. Historically, this has meant potential trouble for the final 11 months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/3-blog-chart.png?ssl=1))**\n\n&gt; 4.) As fears over COVID-19 gripped the world, the Dow Jones Industrial Average had its fastest bear market ever, in only 19 days. To put this in perspective, this was the fastest bear market in the 124-year history of the Dow.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/4-blog-chart.png?ssl=1))**\n\n&gt; 5.) Mark Twain said “History doesn’t repeat itself, but it often rhymes”. Looking at history, every 50 years there has been a terrible pandemic and stocks fell more than 30%. We don’t know if the ultimate lows are in this time, but so far, history is rhyming.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/blog-chart-5.png?ssl=1))**\n\n&gt; 6.) More than 20 million people in the US lost their jobs in April, while the unemployment rate soared to near 15%, the highest since the Great Depression. Record drops in manufacturing, industrial production, retail sales, and consumer spending have all taken place in the past two months as well.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/6-blog-chart.png?ssl=1))**\n\n&gt; 7.) A recession is here, ending the streak of 128 months in a row without one. What is unique about the previous expansion was nominal gross domestic product (GDP) grew only 50%, about the average growth seen during the previous expansions, but this expansion was nearly twice as long as the average expansion (10 years versus 5 years).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/7-blog-chart.png?ssl=1))**\n\n&gt; 8.) The bounce off of the March 23 S&amp;P 500 lows has been historic in many ways. In fact, it was one of the best 20-day rallies ever, with previous best rallies seeing strong returns 6 and 12 months later.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/8-blog-chart.png?ssl=1))**\n\n&gt; 9.) As scary as it was on the way down, stocks have come roaring back, gaining more than 35% from the March 23 lows. This would classify as the greatest bear market bounce ever, which opens the question: is this more than a bear market bounce and instead the start of a new bull market?\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/9-blog-chart.png?ssl=1))**\n\n&gt; 10.) The number of COVID-19 tests in the US nearly doubled in May versus what was seen in April. Additionally, fewer and fewer tests are coming back positive. Testing is one of the key ways we will beat this and this is a step in the right direction. We’ve also seen new monthly lows in people on ventilators, in the ICU, and in hospitals.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/9-blog-chart.png?ssl=1))**\n\n&gt; Hard to believe, but there are still 7 months left in 2020. It hasn’t been easy for any of us, and we continue to keep everyone impacted by this pandemic in mind, but we continue to see the glass as half full. The dual benefit of record monetary and fiscal policy should help create a bridge to help those most impacted, while the economy can slowly come back online later this year.\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$ADBE** \n&gt; * **$UNFI** \n&gt; * **$CHWY** \n&gt; * **$TIF** \n&gt; * **$LULU** \n&gt; * **$COUP** \n&gt; * **$SFIX** \n&gt; * **$LOVE** \n&gt; * **$NEPT** \n&gt; * **$GHM** \n&gt; * **$REVG** \n&gt; * **$GME** \n&gt; * **$HDS** \n&gt; * **$FIVE** \n&gt; * **$SIG** \n&gt; * **$CASY** \n&gt; * **$CVGW** \n&gt; * **$AMC** \n&gt; * **$FCEL** \n&gt; * **$QTNT** \n&gt; * **$PLCE** \n&gt; * **$CHS** \n&gt; * **$THO** \n&gt; * **$GCO** \n&gt; * **$BF.B** \n&gt; * **$LMNR** \n&gt; * **$WSG** \n&gt; * **$PRTY** \n&gt; * **$GES** \n&gt; * **$BBCP** \n&gt; * **$CONN** \n&gt; * **$HEXO** \n&gt; * **$PHR** \n&gt; * **$PVH** \n&gt; * **$RRGB** \n&gt; * **$PLAY** \n&gt; * **$TNP** \n&gt; * **$JW.A** \n&gt; * **$SB** \n&gt; * **$GSM** \n&gt; * **$SRT**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/PQzyXLa.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/bgPdMCr.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 6.8.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/d2EW1kr.png))\n\n&gt; # ***Monday 6.8.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/uxSiJJr.png))\n\n*****\n\n&gt; # ***Tuesday 6.9.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/3SIjcG7.png))\n\n&gt; # ***Tuesday 6.9.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/cRBrPlt.png))\n\n*****\n\n&gt; # ***Wednesday 6.10.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/DaheXAm.png))\n\n&gt; # ***Wednesday 6.10.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/9mcHxTl.png))\n\n*****\n\n&gt; # ***Thursday 6.11.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/i8SNjWM.png))\n\n&gt; # ***Thursday 6.11.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/9xcBZPK.png))\n\n*****\n\n&gt; # ***Friday 6.12.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n&gt; # ***Friday 6.12.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# Adobe Inc. $392.90\n&gt; **Adobe Inc. (ADBE)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, June 11, 2020. The consensus earnings estimate is $2.33 per share on revenue of $3.17 billion and the Earnings Whisper ® number is $2.39 per share. Investor sentiment going into the company's earnings release has 79% expecting an earnings beat The company's guidance was for earnings of approximately $2.35 per share. Consensus estimates are for year-over-year earnings growth of 26.63% with revenue increasing by 15.51%. Short interest has increased by 3.0% since the company's last earnings release while the stock has drifted higher by 25.6% from its open following the earnings release to be 23.1% above its 200 day moving average of $319.27. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, May 19, 2020 there was some notable buying of 3,194 contracts of the $410.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 4.8% move on earnings and the stock has averaged a 6.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ADBE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# United Natural Foods, Inc. $20.78\n&gt; **United Natural Foods, Inc. (UNFI)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, June 10, 2020. The consensus earnings estimate is $1.41 per share on revenue of $6.67 billion and the Earnings Whisper ® number is $1.42 per share. Investor sentiment going into the company's earnings release has 78% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 131.15% with revenue increasing by 11.86%. Short interest has decreased by 16.0% since the company's last earnings release while the stock has drifted higher by 202.5% from its open following the earnings release to be 96.1% above its 200 day moving average of $10.60. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, June 2, 2020 there was some notable buying of 2,226 contracts of the $22.50 call expiring on Friday, June 19, 2020. Option traders are pricing in a 17.7% move on earnings and the stock has averaged a 15.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=UNFI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Chewy, Inc. $48.44\n&gt; **Chewy, Inc. (CHWY)** is confirmed to report earnings at approximately 4:10 PM ET on Tuesday, June 9, 2020. The consensus estimate is for a loss of $0.11 per share on revenue of $1.55 billion and the Earnings Whisper ® number is ($0.09) per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 37.50% with revenue increasing by 39.78%. Short interest has increased by 37.9% since the company's last earnings release while the stock has drifted higher by 37.5% from its open following the earnings release to be 56.4% above its 200 day moving average of $30.97. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 5.8% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CHWY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Tiffany &amp; Co. $121.99\n&gt; **Tiffany &amp; Co. (TIF)** is confirmed to report earnings at approximately 6:40 AM ET on Tuesday, June 9, 2020. The consensus earnings estimate is $0.21 per share on revenue of $646.40 million. Investor sentiment going into the company's earnings release has 6% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 79.61% with revenue decreasing by 35.56%. Short interest has decreased by 26.5% since the company's last earnings release while the stock has drifted lower by 4.7% from its open following the earnings release to be 1.9% above its 200 day moving average of $119.75. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, June 5, 2020 there was some notable buying of 9,022 contracts of the $110.00 put expiring on Friday, August 21, 2020. Option traders are pricing in a 6.2% move on earnings and the stock has averaged a 3.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TIF&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# lululemon athletica inc. $319.78\n&gt; **lululemon athletica inc. (LULU)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, June 11, 2020. The consensus earnings estimate is $0.28 per share on revenue of $724.78 million and the Earnings Whisper ® number is $0.30 per share. Investor sentiment going into the company's earnings release has 47% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 62.16% with revenue decreasing by 7.35%. Short interest has increased by 53.3% since the company's last earnings release while the stock has drifted higher by 66.1% from its open following the earnings release to be 46.8% above its 200 day moving average of $217.77. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, June 4, 2020 there was some notable buying of 1,385 contracts of the $350.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 9.4% move on earnings and the stock has averaged a 7.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LULU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Coupa Software $216.94\n&gt; **Coupa Software (COUP)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, June 8, 2020. The consensus earnings estimate is $0.07 per share on revenue of $111.83 million and the Earnings Whisper ® number is $0.10 per share. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat The company's guidance was for earnings of $0.06 to $0.08 per share on revenue of $112.00 million to $112.00 million. Consensus estimates are for year-over-year earnings growth of 450.00% with revenue increasing by 37.48%. Short interest has increased by 7.9% since the company's last earnings release while the stock has drifted higher by 94.9% from its open following the earnings release to be 40.3% above its 200 day moving average of $154.59. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, June 4, 2020 there was some notable buying of 1,085 contracts of the $220.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 12.7% move on earnings and the stock has averaged a 9.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=COUP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Stitch Fix, Inc. $24.96\n&gt; **Stitch Fix, Inc. (SFIX)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, June 8, 2020. The consensus estimate is for a loss of $0.17 per share on revenue of $401.40 million and the Earnings Whisper ® number is ($0.13) per share. Investor sentiment going into the company's earnings release has 53% expecting an earnings beat The company's guidance was for revenue of $465.00 million to $475.00 million. Consensus estimates are for earnings to decline year-over-year by 342.86% with revenue decreasing by 1.83%. Short interest has increased by 4.0% since the company's last earnings release while the stock has drifted higher by 66.4% from its open following the earnings release to be 19.1% above its 200 day moving average of $20.96. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, June 2, 2020 there was some notable buying of 5,092 contracts of the $25.00 call expiring on Friday, June 12, 2020. Option traders are pricing in a 21.2% move on earnings and the stock has averaged a 13.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SFIX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Lovesac Company $17.84\n&gt; **Lovesac Company (LOVE)** is confirmed to report earnings at approximately 7:00 AM ET on Tuesday, June 9, 2020. The consensus estimate is for a loss of $0.69 per share on revenue of $48.22 million and the Earnings Whisper ® number is ($0.65) per share. Investor sentiment going into the company's earnings release has 52% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 2.99% with revenue increasing by 17.73%. Short interest has increased by 20.5% since the company's last earnings release while the stock has drifted higher by 109.9% from its open following the earnings release to be 31.5% above its 200 day moving average of $13.57. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 20.1% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LOVE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Neptune Wellness Solutions Inc. $3.14\n&gt; **Neptune Wellness Solutions Inc. (NEPT)** is confirmed to report earnings after the market closes on Wednesday, June 10, 2020. The consensus estimate is for a loss of $0.08 per share on revenue of $6.32 million and the Earnings Whisper ® number is ($0.10) per share. Investor sentiment going into the company's earnings release has 63% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 100.00% with revenue increasing by 48.36%. Short interest has decreased by 4.7% since the company's last earnings release while the stock has drifted higher by 56.2% from its open following the earnings release to be 6.4% above its 200 day moving average of $2.95. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, May 19, 2020 there was some notable buying of 2,960 contracts of the $3.00 call expiring on Friday, June 19, 2020. The stock has averaged a 8.1% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NEPT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Graham Corporation $15.58\n&gt; **Graham Corporation (GHM)** is confirmed to report earnings at approximately 6:30 AM ET on Wednesday, June 10, 2020. The consensus earnings estimate is $0.12 per share on revenue of $32.00 million. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 50.00% with revenue increasing by 35.36%. Short interest has increased by 89.8% since the company's last earnings release while the stock has drifted lower by 21.7% from its open following the earnings release. Overall earnings estimates have been revised lower since the company's last earnings release.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=GHM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/smallstreetbets.",
        "subreddit": "smallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning June 8th, 2020",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/gxtut4/wall_street_week_ahead_for_the_trading_week/",
        "created": 1591489050.0
    },
    {
        "author": "stillness0072",
        "created_utc": 1592572395,
        "id": "hc0gri",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "It's way under book value. They are one of the biggest movie theatre chains in the world. Practially has a moat, since its hard to open a theatre. They got hit with debt from investing in the business for the long term, and aquiring Odeon and UCI in Europe. They are working hard to reduce debt and make things more efficent. With Theatres opening up around the world and big movies around the corner in July, I would say this fits a buffet bill.",
        "subreddit": "investing",
        "title": "Is AMC a Buffet stock?",
        "url": "https://www.reddit.com/r/investing/comments/hc0gri/is_amc_a_buffet_stock/",
        "created": 1592601195.0
    },
    {
        "author": "Cicero1982",
        "created_utc": 1593502204,
        "id": "hiil72",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "**Pre Market Brief for Tuesday June 30th 2020**\n\nYou can subscribe to the daily 4:00 AM Pre Market Brief on [**The Twitter Link Here**](https://www.tradinganalysisresources.com/2020/05/free-references-and-resources.html?m=1) . Alerts in the tweets will direct you to the daily 4:00 AM Pre Market Brief in this sub.\n\nUpdated as of 6/30/2020 3:30 AM EST\n\n\\-----------------------------------------------\n\n***Tuesday June 30th 2020 Economic Calendar*** (All times are in EST)\n\n* **8:55 AM** [**Redbook YoY**](https://tradingeconomics.com/united-states/redbook-index) 27/JUN: Previous -6.1%\n* **8:55 AM** [**Redbook MoM**](https://tradingeconomics.com/united-states/redbook-index) 27/JUN: Previous -1.4%\n* **9:00 AM** [**S&amp;P/Case-Shiller Home Price MoM**](https://tradingeconomics.com/united-states/case-shiller-home-price-index) APR: Previous 1.1% / Forecast 0.4%\n* **9:00 AM** [**S&amp;P/Case-Shiller Home Price YoY**](https://tradingeconomics.com/united-states/case-shiller-home-price-index) APR: Previous 3.9% / Consensus 3.7% / Forecast 3.8%\n* **9:45 AM** [**Chicago PMI**](https://tradingeconomics.com/united-states/chicago-pmi) JUN: Previous 32.3% / Consensus 44.5% / Forecast 44%\n* **10:00 AM** **CB Consumer Confidence** JUN: Previous 86.6% / Consensus 90% / Forecast 90.1%\n* **11:00 AM** [**Fed Williams Speech**](https://tradingeconomics.com/united-states/interest-rate)\n* **11:05 AM** [**Fed Brainard Speech**](https://tradingeconomics.com/united-states/interest-rate)\n* **12:30 PM** [**Fed Chair Powell Testimony**](https://tradingeconomics.com/united-states/interest-rate)\n* **4:30 PM** [**API Crude Oil Stock Change**](https://tradingeconomics.com/united-states/api-crude-oil-stock-change) 26/JUN: Previous 1.7M\n\n***Monday*** ***06/29/2020*** ***News and Markets Recap:***\n\n* [Pre Market Brief for 06/29/2020](https://www.reddit.com/r/pennystocks/comments/hhvhah/your_pre_market_brief_for_06292020/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)\n* [Market Recap](https://www.cnn.com/2020/06/29/investing/dow-stock-market-today/index.html) Monday June 29th\n\n***News Heading into Tuesday June 30th 2020:***\n\n* [Covia Files](https://www.nasdaq.com/articles/covia-files-for-bankruptcy-protection-2020-06-29?amp) For Bankruptcy Protection\n* [Wells Fargo](https://www.msn.com/en-us/finance/mutualfunds/wells-fargo-to-cut-dividends-while-bofa-citi-jpmorgan-goldman-seen-holding-shareholder-payouts-steady-after-stress-tests/ar-BB167EUi) to cut dividends while BofA, Citi, JPMorgan, Goldman seen holding shareholder payouts steady after stress tests\n* [Bioasis](https://www.businesswire.com/news/home/20200629005790/en/Bioasis-Chiesi-Group-Announce-Rare-Diseases-Strategic) and Chiesi Group Announce Rare Diseases Strategic Alliance\n* [U.S. Department](https://www.newsweek.com/us-department-commerce-rescinds-hong-kongs-special-status-1514235) of Commerce Rescinds Hong Kong's Special Status\n* [Kirkland Lake](https://mobile.reuters.com/article/amp/idUSKBN2402RR) Gold sued in U.S. over Detour purchase\n* [After-Hours](https://www.streetinsider.com/dr/news.php?id=17060453) Stock Movers 06/29: (XLNX) (MU) (LULU) Higher; (LQDA) (SYNC) (MLHR) Lower (more...)\n* [Norwegian](https://www.channelnewsasia.com/news/business/norwegian-air-cancels-97-boeing-planes--files-legal-claim-for-compensation-12883896) Air cancels 97 Boeing planes, files legal claim for compensation\n* [Duke Realty](https://www.globenewswire.com/news-release/2020/06/29/2055017/0/en/Duke-Realty-Announces-Results-of-Tender-Offer-for-3-875-Senior-Notes-Due-2022.html) Announces Results of Tender Offer for 3.875% Senior Notes Due 2022\n* [CenturyLinks](https://theudallreport.com/2020/06/29/seekingalpha-centurylinks-qwest-wraps-partial-redemption-of-2054-notes-nysectl/) Qwest wraps partial redemption of 2054 notes (NYSE:CTL)\n* [Marathon Patent](https://theudallreport.com/2020/06/29/seekingalpha-marathon-patent-files-for-equity-offering-nasdaqmara/) files for equity offering \n* [Bloom Energy](https://www.fool.com/investing/2019/10/06/bloom-energy-takes-to-the-seas-with-samsung-heavy.aspx) Takes to the Seas With Samsung Heavy Industries\n* [F5 Flrtifies](https://finance.yahoo.com/news/f5-fortifies-partnership-rakuten-mobile-010000325.html) Partnership with Rakuten Mobile to Provide Advanced Application Security Services for the Rakuten Communications Platform\n* [Uber Makes](https://www.nytimes.com/2020/06/29/technology/uber-postmates-buy-offer.html) Offer to Buy Postmates Delivery Service\n* [Jim Cramer](https://www.cnbc.com/2020/06/29/jim-cramer-we-saw-a-lot-of-encouraging-signs-monday.html): We saw a lot of ‘encouraging signs’ in Monday’s session\n* [Middle seats](https://www.cnn.com/2020/06/29/economy/middle-seats-airlines-covid-19/index.html) and packed planes are coming back as airlines prepare to ease restrictions\n* [The Facebook](https://www.cnn.com/2020/06/29/tech/facebook-ad-boycott-stock/index.html) ad boycott is starting to rattle investors\n* [AMC Delays](https://www.cnn.com/2020/06/29/business/amc-reopening-delayed/index.html) US theater openings as it waits for summer blockbusters\n* [The Nasdaq](https://www.marketwatch.com/story/the-nasdaq-isnt-just-beating-the-dow-and-sp-500-its-having-one-of-its-best-first-halves-ever-against-its-stock-market-peers-2020-06-29?mod=home-page) isn’t just beating the Dow and S&amp;P 500, it’s having one of its best first halves ever against its stock-market peers\n* [Asia Stocks](https://www.bloomberg.com/news/articles/2020-06-29/asia-stocks-set-to-track-u-s-gains-on-better-data-markets-wrap?srnd=markets-vp) Rise, Extending Second-Quarter Rebound: Markets Wrap\n* [One in four](https://www.msn.com/-us/money/markets/one-in-four-us-ceos-see-full-recovery-delayed-until-after-2021/ar-BB167DBA) US CEOs see full recovery delayed until after 2021\n* [The massive](https://www.msn.com/en-us/autos/enthusiasts/the-massive-used-car-market-is-getting-the-ebay-treatment/ar-BB166mXw) used-car market is getting the eBay treatment\n* [Boeing begins](https://www.msn.com/en-us/money/companies/boeing-begins-crucial-certification-test-flights-for-grounded-737-max/ar-BB167b19) crucial certification test flights for grounded 737 MAX\n* [China Defies](https://www.msn.com/en-us/news/world/china-defies-u-s-threats-to-impose-security-law-on-hong-kong/ar-BB166PH2) U.S. Threats to Impose Security Law on Hong Kong\n* [Amazon’s brand](https://www.cnbc.com/2020/06/30/amazons-brand-value-tops-400-billion-according-to-kantar-report.html) value tops $400 billion, boosted by the coronavirus pandemic: Survey\n* [Lululemon](https://www.marketwatch.com/story/lululemon-to-acquire-interactive-fitness-company-mirror-for-500-million-2020-06-29?mod=home-page) to acquire interactive fitness company Mirror for $500 million\n* [Emerging](https://finance.yahoo.com/news/emerging-market-carry-trades-risk-230700294.html)-Market Carry Trades Risk More Losses After Decade of Gains Wiped Out\n\n***Futures:***\n\n* [Premarket Trading](https://money.cnn.com/data/premarket/)\n* [Stock Futures](https://www.cnbc.com/2020/06/29/stock-market-futures-open-to-close-news.html) rise slightly, headed for gains to finish out June\n* [Stock Market](https://finance.yahoo.com/news/stock-market-news-live-june-30-2020-221903237.html) news live updates: Stock futures little changed heading into final session of June\n\n***Upcoming Earnings:***\n\n* [Earnings Calendar](https://finance.yahoo.com/calendar/earnings/)\n* [Earnings Calendar II](https://tradingeconomics.com/earnings)\n* [Notable](https://m.investing.com/news/stock-market-news/notable-earnings-after-tuesdays-close-1422817) earnings after Tuesday’s close\n\n***Commodities:***\n\n* [Commodity Prices](https://tradingeconomics.com/commodities)\n\n***COVID-19 Stats and News:***\n\n* [COVID-19 Stats](https://www.worldometers.info/coronavirus/country/us/)\n* [Latest Map and Case Count](https://www.nytimes.com/interactive/2020/us/coronavirus-us-cases.html)\n* [Coronavirus](https://www.marketwatch.com/story/coronavirus-pandemic-not-even-close-to-being-over-who-chief-warns-the-worst-is-yet-to-come-2020-06-29?mod=home-page) pandemic ‘not even close to being over,’ WHO chief warns. ‘The worst is yet to come’\n* [Powell says](https://www.cnbc.com/2020/06/29/powell-says-recovery-path-is-extraordinarily-uncertain-amid-efforts-to-control-virus.html) recovery path is ‘extraordinarily uncertain’ amid efforts to control virus\n\n***Macro Considerations:***\n\n* [Economic Indicators](https://tradingeconomics.com/united-states/indicators)\n* [Economic Indicator Forecasts](https://tradingeconomics.com/united-states/forecast)\n* [Tracking America’s Recovery](https://www.cnn.com/business/us-economic-recovery-coronavirus)\n\n\\-----------------------------------------------\n\n[**Morning Research and Trading Prep Tool Kit**](https://www.tradinganalysisresources.com/2020/05/free-references-and-resources.html?m=1)\n\n***Other Useful Resources:***\n\n[**The Ultimate Quick Resource For the Amateur Trader.**](https://www.reddit.com/r/pennystocks/comments/hcja2q/the_ultimate_quick_resource_for_the_amateur_trader/)\n\nSubscribe to This Brief and the daily 4:00 AM Pre Market Brief on [**The Twitter Link Here**](https://www.tradinganalysisresources.com/2020/05/free-references-and-resources.html?m=1) . Alerts in the tweets will direct you to the daily brief in this sub",
        "subreddit": "pennystocks",
        "title": "Your Pre Market Brief for 06/30/2020",
        "url": "https://www.reddit.com/r/pennystocks/comments/hiil72/your_pre_market_brief_for_06302020/",
        "created": 1593531004.0
    },
    {
        "author": "DayTrader4Hire",
        "created_utc": 1592059064,
        "id": "h88pg3",
        "num_comments": 18,
        "num_crossposts": 1,
        "selftext": "           This past week has been a rollercoaster for the market to say the least. As many investors sold their holdings Thursday to then reinvest profits on Friday heading into the weekend. These key components will dictate what this following week has in store for traders...\n\n                      *KEY POINTS* \n\n• Stocks plummet due to concerns of second wave of Covid-19 across the US\n\n• All sectors were affected in the down trend (with very few exceptions)\n\n• Major US states including Texas, North Carolina, California, Arizona, Alaska, Kentucky, Oregon, and more report increase in Covid-19 cases\n\n• Cannabis sector widely speculated as possible fast track way to increase lost revenue from Covid-19 short term\n\n• Travel sector rapidly sells off in fear of cash burn which can unavoidably lead to chapter 11 bankruptcy short term. Creating a buy opportunity due to gathered 30% to 40% losses in share price drop this past week only to rebound 10% to 20% on Friday\n\n• Feds show no sign of raising interest rates during this weeks news briefing \n\n• Resistance shown Friday afternoon combined with oversold and over bought trends historically points in the direction of a steady incline over the course of the next 1-2 weeks\n\n• Italy, Jamaica, Bulgaria, Portugal, Germany, Greece, including many other locations are opened back up for travel with minor regulations \n\nAttractive tickers this week include:\n\n$BA, $BUD, $HEXO, $UAL, $DAL, $LUV, $AMC, $AAL, $VFF, $OGI, $CCL, $GE, $GNK, $TAP, $CRON, $EMAN, $OPES\n\nFeel free to add your thoughts below! \n\nGood luck to everyone and good\n fortune!",
        "subreddit": "StockMarket",
        "title": "Wondering What The Market Will Do This Week? *READ*",
        "url": "https://www.reddit.com/r/StockMarket/comments/h88pg3/wondering_what_the_market_will_do_this_week_read/",
        "created": 1592087864.0
    },
    {
        "author": "Joloven",
        "created_utc": 1591206580,
        "id": "gvyohx",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "My AMD is up 9%. I'm thinking about selling and buying citibank, not sure if this  s is wise.\n\nI sold bud at 42 a share to buy facebook. Right now I am kicking myself but I don't think I want to buy bud back. Took a 4 dollar a share loss in that.\n\nMy best buys this year were Google, discover and amc. All three are up consistently. I sold xlu for discover, pondering if I want a little xlu back now.\n\nLost money on moderna and gilead but are holding these.\n\nMade modest 20% profits on disney. I think I might hold this.\n\nI invested in visa and am moderately happy with the results. Still my results are only 90% as good as what s&amp;p would have been. Should I just buy some s&amp;p and hold for a bit?",
        "subreddit": "StockMarket",
        "title": "How are your investments going?",
        "url": "https://www.reddit.com/r/StockMarket/comments/gvyohx/how_are_your_investments_going/",
        "created": 1591235380.0
    },
    {
        "author": "variousbakedgoodies",
        "created_utc": 1591492277,
        "id": "gy31w6",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "Hey guys. Happy Saturday.   \nI'm hoping this post can help the beginners like me learn how the greeks relate to one another. \n\nI have filled in my understanding of the greeks below, but it would be helpful if some experienced people could give feedback.\n\nBelow our the details of my AMC CALL and my breakdown of the Greeks.\n\n* **I have a 1/21/22 $5 Call on AMC.**\n* **Break even is $6.65 on RH.**\n* **AMC currently at $5.91....but**\n\n...the Call is  up .20 cents.\n\n* **Why is my contract worth even though I'm below my breakeven?**\n\n**Is the IV moving up because of earnings coming up/ movement of the undy?**\n\n**Earnings are coming up this week.**\n\nhttps://preview.redd.it/qp63wuj2pd351.png?width=699&amp;format=png&amp;auto=webp&amp;s=6982ebdcd5bd599767a7d024abdeaa80dcf34f98\n\n&amp;#x200B;\n\n* &amp;#x200B;\n\nhttps://preview.redd.it/nep0ry0bpd351.png?width=680&amp;format=png&amp;auto=webp&amp;s=36e57a657d7ffd2b39c6aea33a4532c07579dd69\n\n**Delta**\\-approx 0.72 increase in contract for every $1 AMC moves up//Prob a option expiring ITM.\n\n(I'm a long buyer so the higher the delta the better-more $$)\n\n&amp;#x200B;\n\n**Gamma**\\- 0.09 how fast the delta changes with a single point move in UNDY//Inverse relationship with theta.\n\n(the more gamma the better sin\n\n**Theta**\\- 0.0011 how much the value the option losses over time- in this case its less than a penny a day.\n\n(Im a long buyer here so i want as little theta as possible)\n\n**Vega**\\- how delicate the options price is to a change in the volatility of the underlying. How sensitive the contracts price is to a 1% move in IV of underlying. \n\n(I'm a long buyer here so I want lots and lots of vega because i want lots of IV)",
        "subreddit": "options",
        "title": "AMC LEAP FEEDBACK PLEASE.",
        "url": "https://www.reddit.com/r/options/comments/gy31w6/amc_leap_feedback_please/",
        "created": 1591521077.0
    },
    {
        "author": "WHiSPERRcs",
        "created_utc": 1592541363,
        "id": "hbu65h",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "I’m new to all of this, usually someone does it for me but I thought doing some myself would be fun. Today I got an email saying AMC is opening 90% of theaters by 7/15. The one catch is they aren’t requiring customers to wear masks. Would this increase or decrease the price of AMC?\n\nAnd thoughts on 6/26 7.5$c at .01 premium? Currently at 6.10.",
        "subreddit": "investing",
        "title": "Thoughts on AMC?",
        "url": "https://www.reddit.com/r/investing/comments/hbu65h/thoughts_on_amc/",
        "created": 1592570163.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1591460055,
        "id": "gxtspc",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "Good Saturday afternoon to all of you here on r/stocks. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning June 8th, 2020.\n\n# **Look for the S&amp;P 500 to turn positive for the year with a boost from the Fed in the week ahead  - [(Source)](https://www.cnbc.com/2020/06/05/look-for-the-sp-500-to-turn-positive-for-the-year-with-a-boost-from-the-fed-in-the-week-ahead.html)**\n*****\n&gt; Federal Reserve Chairman Jerome Powell is expected to reassure markets next week the central bank will do whatever it takes to help the economy heal. That should be enough to keep investors moving into stocks that benefit from an economic rebound and push the S&amp;P 500 into the green for 2020.\n*****\n&gt; The Fed’s two-day meeting is the big event for markets in the coming week. There are a few economic reports, including inflation data, the consumer price index Wednesday and producer prices Thursday. Weekly jobless claims will be important Thursday to see if there’s a drop in continuing clams, after May’s employment report showed a surprising record gain of 2.5 million jobs.\n*****\n&gt; The reopening trade was in full swing in the past week, especially Friday when stocks surged on the jobs report, which was expected to show a loss of 8.3 million jobs. The Nasdaq broke above its record high set on Feb. 19, and the S&amp;P 500 was just 1.1% away from turning positive for 2020.\n*****\n&gt; Even before the jobs report, investors were loading up on financials, industrials, transports and small caps, which were up more than 8% for the week and 18.4% in the past month. S&amp;P financials were 12.1% higher on the week, S&amp;P industrials were up 10.5, and the NYSE airline index jumped more than 35.4.%.\n*****\n&gt; “I think next week is dominated by the reopening and it will be for another month,” said James Paulsen, chief investment strategist at Leuthold Group. “With cyclicals outperforming, small [caps] outperforming, credit spreads coming in and then the bond yields going up, everybody — all facets of the financial markets — are sort of suggesting the same outcome.”\n*****\n&gt; The S&amp;P 500 ended the week at 3,193, a gain of 4.9%, and now traders are watching to see if it can scale the psychological 3,200 level. The Dow closed Friday at 27,110, up 6.8% for the week, and the Nasdaq Composite was up 3.4%, at 9,814 after reaching an intraday record high of 9,845 Friday.\n*****\n&gt; Analysts say the market will likely look past the protests that broke out in cities across the U.S. after the death of George Floyd in Minneapolis. Four policemen were charged with murder in his death. Looters joined the protests, some of which turned violent, but they quieted down towards the end of the week.\n*****\n&gt; Stocks were higher for a third week in a row, but a change this past week has been the abrupt lurch higher in Treasury yields. The 10-year rose to a high of 0.95% Friday, a quarter-point move in just three sessions. The move was already underway but got a lift Wednesday when ADP jobs data was not nearly as bad as expected. Yields ripped even higher after the May employment report showed the unemployment rate actually fell to 13.3%, instead of climbing to 20%, as expected by economists.\n*****\n&gt; Bond strategists said the Treasury market was now acknowledging the potential for a recovery, but not in the exuberant way the stock market has been. Since March 23, the S&amp;P 500 has risen more than 45%, but it took the 10-year Treasury until this week to get back the yield level it was at when stocks bottomed.\n*****\n&gt; Paulsen said he believes a new bull market has been launched, but there could be pullbacks and some headwinds for the market coming up.\n*****\n&gt; “When GDP is minus 30%, other issues don’t matter. There’s just one issue. But as the economy reopens again, the trade battles will matter again, presidential politics will matter again,” said Paulsen, adding the budget deficit could also matter. “I think we’ll get removed from a sole focus. That isn’t quite there but I think it’s coming.”\n*****\n&gt; # Fed ahead\n&gt; The Fed begins its two-day meeting Tuesday, and will release its statement Wednesday afternoon, followed by a video briefing by Powell.\n*****\n&gt; “Whey would the Fed want to disrupt this with anything?” Paulsen said. “They’re still going to support the economy. They’re going to stay away from negative rates or yield curve management. They’re not going to do anything to scare the markets. They might certainly reassure people that they are still ready to provide support.”\n*****\n&gt; Ethan Harris, head of global economics at Bank of America, said the Fed may clarify where it stands on some of the extraordinary moves it has taken since it cut rates to zero. The Fed has been supporting the markets with asset purchases and multiple programs for commercial paper, corporate bonds, and municipal bonds, for example.\n*****\n&gt; “We think right now they’re just trying to get this Main Street lending program to work. The question is are they going to do more things around what they do in terms of forward guidance and next steps of macro easing,” Harris said.\n*****\n&gt; There has been speculation that the Fed would do some type of so-called yield curve control, a program to keep interest rates capped at certain levels. “I think it’s too early for that,” said Harris. He said the Fed would be guaranteeing low rates for a long period of time if it does yield curve control.\n*****\n&gt; “Yield curve control is basically open-ended quantitative easing,” he said. The Fed is currently buying Treasurys but if it wanted to stop yields from rising too much as the economy improves, it could make targeted purchases.\n*****\n&gt; Barclays chief U.S. economist Michael Gapen said it’s possible the Fed could announce the yield curve control. “We’ve said they could implement yield curve control out to three years,” he said. “In my mind that matches the length of the horizon of the economic projections.”\n*****\n&gt; Powell has said the economy needs more fiscal help, and he could reiterate those comments Wednesday. President Donald Trump on Friday said he backs more stimulus. So far, the Democrats have put out a marker with their wish list for further spending, but there have been no negotiations.\n*****\n&gt; There was concern the strong jobs report could make it harder to get buy in for another big spending package. But some economists say the recovery needs a boost and states need funding to fill the holes in their budgets from coronavirus-related spending and a lack of tax receipts.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/7klaXQm.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/PKTBzT2.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/a5JkAB6.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/M2x4Qoq.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/qtJYfXN.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/bjiJWjV.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/UAi19KJ.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/GQm4ruO.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/PQzyXLa.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/uV1U7FN.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/wm2XJND.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/yarkiMO.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/hFblu2G.png))**\n\n*****\n\n# S&amp;P 500 Stocks Outpacing Analyst Price Targets\n\n&gt; This morning's jobs report shocked the financial world -- most notably the economists whose job it is to provide estimates. The consensus estimate among economists for May nonfarm payrolls was projecting a loss of more than 7 million jobs. The actual number that was reported did not just show a smaller than expected job loss, but it actually showed a gain in jobs of more than 2.5 million.\n\n&gt; We're seeing a similar situation play out in the equity analyst community. With the S&amp;P 500 now up 40%+ since its low less than three months ago, the average stock in the index is now trading above its consensus analyst price target that looks 12 months out. Analysts have simply not been able to catch up to the rapid rise we've seen for equity prices.\n\n&gt; It's extremely rare to see share prices move above consensus analyst price targets. We don't have the historical daily data on this, but anecdotally we can't remember a time when the spread has been this wide. As shown below, at the end of 2019 when the S&amp;P finished a massive rally, equity prices were 5.5% below the consensus price target. That was seen as a very tight spread prior to what we're seeing now. At the lows in March, the average share price had dropped all the way to $92.50 compared to an average consensus price target of $143.20. That projected a gain of 54.9% at the time!\n\n&gt; Since March 23rd, the average share price has risen from $92.50 up to $138.40, while the average analyst price target has fallen from $143.20 to $136. Current price targets no longer project a gain for the average S&amp;P 500 stock, but rather a 1.7% drop.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/avgpricetarget.png))**\n\n&gt; # Nasdaq's Historical Run\n\n&gt; At its highs earlier this morning, the Nasdaq Composite was within 2% of its record high from earlier in the year. Besides the steep V-shape of the Nasdaq's pattern over the last four months, the other aspect of the chart that stands out is just how steep the 50-day moving average is trending lately.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060420-Nasdaq-50DMAa.png))**\n\n&gt; To illustrate just how steep the Nasdaq's 50-DMA has become, the chart below shows the daily percentage change of the 50-day going back to 1971. Currently, the Nasdaq 50-DMA is rising at an average of over 0.5% per day. That's an incredible slope and a level that has been exceeded only a handful of times in the Nasdaq's 50-year history.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060420-Nasdaq-Composite1.png))**\n\n*****\n\n# Big Gains From Smaller Tech\n\n&gt; It's still difficult to fathom the moves in the US equity market over the last four months. The fact that the Nasdaq and more specifically the Technology sector aren't far from record highs is definitely something no one was expecting two months ago. There's an old market saying that equities take the stairs up and the elevator down, but in the latest market cycle, the elevator up was almost as fast as the way down!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060320-Nasdaq.png))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060320-Technology-Sector.png))**\n\n&gt; If you've been following the markets, all you've likely heard up until recently is that large-cap tech, and more specifically, Microsoft (MSFT), Apple (AAPL), Amazon (AMZN), Alphabet (GOOGL), and Facebook (FB), are single-handedly driving the market higher. The reality is not nearly as clear-cut. Given their market caps, the \"Big 5\" (as they're often referred to) have done a lot of heavy lifting, but in terms of performance, they're hardly the only game in town.\n\n&gt; The table below lists Technology sector stocks in the Russell 3000 with market caps of more than $1 billion that are outperforming all of the 'big 5' tech stocks on a YTD basis. Actually, since Amazon is doing so well relative to the rest of the \"big 5\" these are all stocks that are outperforming Amazon. If we looked for stocks that were doing better than the average return of the \"big 5\" the list would be a lot, lot longer (+16.4%).\n\n&gt; Looking through the list of names below, the two top-performing names are Zscaler (ZS) and Twilio (TWLO), which have both more than doubled. Behind these two, DocuSign (DOCU) and Sprout Social (SPT) are both knocking on the door of triple-digits. All 28 of the names listed have market caps of $1 billion, but the average market cap is just over $21 billion, while Nvidia (NVDA) is the largest company on the list with a market cap of $216 billion. For the most part, these aren't names that have been driving the indices, but anyone holding these stocks in their portfolio probably doesn't care!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060320-Tech-Stocks.png))**\n\n*****\n\n# Best 50-Day Rally Ever\n\n&gt; In many ways, what we’ve seen so far in 2020 has been both record-breaking and devastating. From the S&amp;P 500 Index peak on February 19 to the bear market lows March 23, stocks lost 33.9%. Now, 50 trading days later, stocks have gained 39.6%, for the largest 50-day rally since the S&amp;P 500 moved to 500 stocks in 1957.\n\n&gt; “There are no rollercoasters that can replicate what stocks have done so far in 2020,” exclaimed LPL Financial Senior Market Strategist Ryan Detrick. “Here’s the catch though: Big 50-day rallies in the past have taken place near the start of new bull markets, and the returns going out a year were quite bullish.”\n\n&gt; As shown in the LPL Chart of the Day, the 39.6% gain in 50 days was the greatest 50-day rally ever, besting the previous best in October 1982. What’s important to note here is that many of these rallies took place coming off major market lows, and delivered quite strong returns going out 6 to 12 months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/06/best-fifty-days.png?ssl=1))**\n\n&gt; Although we have near-term worries given this historic run, as some sentiment indicators such as put/call ratios are showing some froth, from a bigger picture perspective, this strong 50-day rally offers a reason to think stock prices may be even higher this time next year.\n\n*****\n\n# 2020 In Charts\n\n&gt; 2020 is only five months old, but in many ways it is one of the most historic years we’ve ever seen. “2020 went from moving along nicely, to seeing the worst recession in a generation and the fastest bear market ever,” explained LPL Financial Senior Market Strategist Ryan Detrick. “Now stocks are in the midst of one of the best bull runs ever, even though the economy remains extremely weak, thanks to record stimulus and hopes over a vaccine.”\n&gt; \nTo best sum it all up, here are 10 charts that tell the picture of 2020 so far.\n\n&gt; 1.) The 2010s were the first decade in history to go all 10 years without a recession, which of course ended just months into the new decade, as the economy stopped. Stocks gained 13.5% on an annual basis last decade, surprisingly, only the third-best decade over the past four.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/06/1-blog-chart.png?ssl=1))**\n\n&gt; 2.) This is an election year, and the S&amp;P 500 Index hasn’t been lower when a President is up for reelection since FDR in 1940. Although this seemed nearly impossible at the March lows, it is looking like this incredible streak could have a chance in 2020.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/2-blog-chart.png?ssl=1))**\n\n&gt; 3.) One of the first signs something could go wrong in 2020 was stocks fell in January. Historically, this has meant potential trouble for the final 11 months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/3-blog-chart.png?ssl=1))**\n\n&gt; 4.) As fears over COVID-19 gripped the world, the Dow Jones Industrial Average had its fastest bear market ever, in only 19 days. To put this in perspective, this was the fastest bear market in the 124-year history of the Dow.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/4-blog-chart.png?ssl=1))**\n\n&gt; 5.) Mark Twain said “History doesn’t repeat itself, but it often rhymes”. Looking at history, every 50 years there has been a terrible pandemic and stocks fell more than 30%. We don’t know if the ultimate lows are in this time, but so far, history is rhyming.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/blog-chart-5.png?ssl=1))**\n\n&gt; 6.) More than 20 million people in the US lost their jobs in April, while the unemployment rate soared to near 15%, the highest since the Great Depression. Record drops in manufacturing, industrial production, retail sales, and consumer spending have all taken place in the past two months as well.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/6-blog-chart.png?ssl=1))**\n\n&gt; 7.) A recession is here, ending the streak of 128 months in a row without one. What is unique about the previous expansion was nominal gross domestic product (GDP) grew only 50%, about the average growth seen during the previous expansions, but this expansion was nearly twice as long as the average expansion (10 years versus 5 years).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/7-blog-chart.png?ssl=1))**\n\n&gt; 8.) The bounce off of the March 23 S&amp;P 500 lows has been historic in many ways. In fact, it was one of the best 20-day rallies ever, with previous best rallies seeing strong returns 6 and 12 months later.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/8-blog-chart.png?ssl=1))**\n\n&gt; 9.) As scary as it was on the way down, stocks have come roaring back, gaining more than 35% from the March 23 lows. This would classify as the greatest bear market bounce ever, which opens the question: is this more than a bear market bounce and instead the start of a new bull market?\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/9-blog-chart.png?ssl=1))**\n\n&gt; 10.) The number of COVID-19 tests in the US nearly doubled in May versus what was seen in April. Additionally, fewer and fewer tests are coming back positive. Testing is one of the key ways we will beat this and this is a step in the right direction. We’ve also seen new monthly lows in people on ventilators, in the ICU, and in hospitals.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/9-blog-chart.png?ssl=1))**\n\n&gt; Hard to believe, but there are still 7 months left in 2020. It hasn’t been easy for any of us, and we continue to keep everyone impacted by this pandemic in mind, but we continue to see the glass as half full. The dual benefit of record monetary and fiscal policy should help create a bridge to help those most impacted, while the economy can slowly come back online later this year.\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$ADBE** \n&gt; * **$UNFI** \n&gt; * **$CHWY** \n&gt; * **$TIF** \n&gt; * **$LULU** \n&gt; * **$COUP** \n&gt; * **$SFIX** \n&gt; * **$LOVE** \n&gt; * **$NEPT** \n&gt; * **$GHM** \n&gt; * **$REVG** \n&gt; * **$GME** \n&gt; * **$HDS** \n&gt; * **$FIVE** \n&gt; * **$SIG** \n&gt; * **$CASY** \n&gt; * **$CVGW** \n&gt; * **$AMC** \n&gt; * **$FCEL** \n&gt; * **$QTNT** \n&gt; * **$PLCE** \n&gt; * **$CHS** \n&gt; * **$THO** \n&gt; * **$GCO** \n&gt; * **$BF.B** \n&gt; * **$LMNR** \n&gt; * **$WSG** \n&gt; * **$PRTY** \n&gt; * **$GES** \n&gt; * **$BBCP** \n&gt; * **$CONN** \n&gt; * **$HEXO** \n&gt; * **$PHR** \n&gt; * **$PVH** \n&gt; * **$RRGB** \n&gt; * **$PLAY** \n&gt; * **$TNP** \n&gt; * **$JW.A** \n&gt; * **$SB** \n&gt; * **$GSM** \n&gt; * **$SRT**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/PQzyXLa.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/bgPdMCr.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 6.8.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/d2EW1kr.png))\n\n&gt; # ***Monday 6.8.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/uxSiJJr.png))\n\n*****\n\n&gt; # ***Tuesday 6.9.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/3SIjcG7.png))\n\n&gt; # ***Tuesday 6.9.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/cRBrPlt.png))\n\n*****\n\n&gt; # ***Wednesday 6.10.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/DaheXAm.png))\n\n&gt; # ***Wednesday 6.10.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/9mcHxTl.png))\n\n*****\n\n&gt; # ***Thursday 6.11.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/i8SNjWM.png))\n\n&gt; # ***Thursday 6.11.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/9xcBZPK.png))\n\n*****\n\n&gt; # ***Friday 6.12.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n&gt; # ***Friday 6.12.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# Adobe Inc. $392.90\n&gt; **Adobe Inc. (ADBE)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, June 11, 2020. The consensus earnings estimate is $2.33 per share on revenue of $3.17 billion and the Earnings Whisper ® number is $2.39 per share. Investor sentiment going into the company's earnings release has 79% expecting an earnings beat The company's guidance was for earnings of approximately $2.35 per share. Consensus estimates are for year-over-year earnings growth of 26.63% with revenue increasing by 15.51%. Short interest has increased by 3.0% since the company's last earnings release while the stock has drifted higher by 25.6% from its open following the earnings release to be 23.1% above its 200 day moving average of $319.27. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, May 19, 2020 there was some notable buying of 3,194 contracts of the $410.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 4.8% move on earnings and the stock has averaged a 6.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ADBE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# United Natural Foods, Inc. $20.78\n&gt; **United Natural Foods, Inc. (UNFI)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, June 10, 2020. The consensus earnings estimate is $1.41 per share on revenue of $6.67 billion and the Earnings Whisper ® number is $1.42 per share. Investor sentiment going into the company's earnings release has 78% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 131.15% with revenue increasing by 11.86%. Short interest has decreased by 16.0% since the company's last earnings release while the stock has drifted higher by 202.5% from its open following the earnings release to be 96.1% above its 200 day moving average of $10.60. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, June 2, 2020 there was some notable buying of 2,226 contracts of the $22.50 call expiring on Friday, June 19, 2020. Option traders are pricing in a 17.7% move on earnings and the stock has averaged a 15.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=UNFI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Chewy, Inc. $48.44\n&gt; **Chewy, Inc. (CHWY)** is confirmed to report earnings at approximately 4:10 PM ET on Tuesday, June 9, 2020. The consensus estimate is for a loss of $0.11 per share on revenue of $1.55 billion and the Earnings Whisper ® number is ($0.09) per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 37.50% with revenue increasing by 39.78%. Short interest has increased by 37.9% since the company's last earnings release while the stock has drifted higher by 37.5% from its open following the earnings release to be 56.4% above its 200 day moving average of $30.97. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 5.8% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CHWY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Tiffany &amp; Co. $121.99\n&gt; **Tiffany &amp; Co. (TIF)** is confirmed to report earnings at approximately 6:40 AM ET on Tuesday, June 9, 2020. The consensus earnings estimate is $0.21 per share on revenue of $646.40 million. Investor sentiment going into the company's earnings release has 6% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 79.61% with revenue decreasing by 35.56%. Short interest has decreased by 26.5% since the company's last earnings release while the stock has drifted lower by 4.7% from its open following the earnings release to be 1.9% above its 200 day moving average of $119.75. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, June 5, 2020 there was some notable buying of 9,022 contracts of the $110.00 put expiring on Friday, August 21, 2020. Option traders are pricing in a 6.2% move on earnings and the stock has averaged a 3.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TIF&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# lululemon athletica inc. $319.78\n&gt; **lululemon athletica inc. (LULU)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, June 11, 2020. The consensus earnings estimate is $0.28 per share on revenue of $724.78 million and the Earnings Whisper ® number is $0.30 per share. Investor sentiment going into the company's earnings release has 47% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 62.16% with revenue decreasing by 7.35%. Short interest has increased by 53.3% since the company's last earnings release while the stock has drifted higher by 66.1% from its open following the earnings release to be 46.8% above its 200 day moving average of $217.77. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, June 4, 2020 there was some notable buying of 1,385 contracts of the $350.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 9.4% move on earnings and the stock has averaged a 7.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LULU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Coupa Software $216.94\n&gt; **Coupa Software (COUP)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, June 8, 2020. The consensus earnings estimate is $0.07 per share on revenue of $111.83 million and the Earnings Whisper ® number is $0.10 per share. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat The company's guidance was for earnings of $0.06 to $0.08 per share on revenue of $112.00 million to $112.00 million. Consensus estimates are for year-over-year earnings growth of 450.00% with revenue increasing by 37.48%. Short interest has increased by 7.9% since the company's last earnings release while the stock has drifted higher by 94.9% from its open following the earnings release to be 40.3% above its 200 day moving average of $154.59. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, June 4, 2020 there was some notable buying of 1,085 contracts of the $220.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 12.7% move on earnings and the stock has averaged a 9.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=COUP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Stitch Fix, Inc. $24.96\n&gt; **Stitch Fix, Inc. (SFIX)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, June 8, 2020. The consensus estimate is for a loss of $0.17 per share on revenue of $401.40 million and the Earnings Whisper ® number is ($0.13) per share. Investor sentiment going into the company's earnings release has 53% expecting an earnings beat The company's guidance was for revenue of $465.00 million to $475.00 million. Consensus estimates are for earnings to decline year-over-year by 342.86% with revenue decreasing by 1.83%. Short interest has increased by 4.0% since the company's last earnings release while the stock has drifted higher by 66.4% from its open following the earnings release to be 19.1% above its 200 day moving average of $20.96. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, June 2, 2020 there was some notable buying of 5,092 contracts of the $25.00 call expiring on Friday, June 12, 2020. Option traders are pricing in a 21.2% move on earnings and the stock has averaged a 13.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SFIX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Lovesac Company $17.84\n&gt; **Lovesac Company (LOVE)** is confirmed to report earnings at approximately 7:00 AM ET on Tuesday, June 9, 2020. The consensus estimate is for a loss of $0.69 per share on revenue of $48.22 million and the Earnings Whisper ® number is ($0.65) per share. Investor sentiment going into the company's earnings release has 52% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 2.99% with revenue increasing by 17.73%. Short interest has increased by 20.5% since the company's last earnings release while the stock has drifted higher by 109.9% from its open following the earnings release to be 31.5% above its 200 day moving average of $13.57. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 20.1% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LOVE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Neptune Wellness Solutions Inc. $3.14\n&gt; **Neptune Wellness Solutions Inc. (NEPT)** is confirmed to report earnings after the market closes on Wednesday, June 10, 2020. The consensus estimate is for a loss of $0.08 per share on revenue of $6.32 million and the Earnings Whisper ® number is ($0.10) per share. Investor sentiment going into the company's earnings release has 63% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 100.00% with revenue increasing by 48.36%. Short interest has decreased by 4.7% since the company's last earnings release while the stock has drifted higher by 56.2% from its open following the earnings release to be 6.4% above its 200 day moving average of $2.95. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, May 19, 2020 there was some notable buying of 2,960 contracts of the $3.00 call expiring on Friday, June 19, 2020. The stock has averaged a 8.1% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NEPT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Graham Corporation $15.58\n&gt; **Graham Corporation (GHM)** is confirmed to report earnings at approximately 6:30 AM ET on Wednesday, June 10, 2020. The consensus earnings estimate is $0.12 per share on revenue of $32.00 million. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 50.00% with revenue increasing by 35.36%. Short interest has increased by 89.8% since the company's last earnings release while the stock has drifted lower by 21.7% from its open following the earnings release. Overall earnings estimates have been revised lower since the company's last earnings release.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=GHM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/stocks.",
        "subreddit": "stocks",
        "title": "Wall Street Week Ahead for the trading week beginning June 8th, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/gxtspc/wall_street_week_ahead_for_the_trading_week/",
        "created": 1591488855.0
    },
    {
        "author": "jxdewey",
        "created_utc": 1593107985,
        "id": "hfqt3q",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "I see AMC has had some recent significant drops, would now be a good time to buy some shares or is it a lost cause at this point with COVID? \n\nI’m asking because I bought shares last week and wondering if I should just get rid of them and take my losses.",
        "subreddit": "investing",
        "title": "AMC stock predictions",
        "url": "https://www.reddit.com/r/investing/comments/hfqt3q/amc_stock_predictions/",
        "created": 1593136785.0
    },
    {
        "author": "stillness123",
        "created_utc": 1592154159,
        "id": "h8xfxc",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "I believe choosing stocks that are in upward channels are the way to go. Like for example AMC theatres. Buy at the low of the channel and let it do the work for you. Looking at some individual charts there are a lot of options. Stocks with downward channels short at the top of the channel",
        "subreddit": "investing",
        "title": "Stocks in upward channels generate income!",
        "url": "https://www.reddit.com/r/investing/comments/h8xfxc/stocks_in_upward_channels_generate_income/",
        "created": 1592182959.0
    },
    {
        "author": "maxbarkow",
        "created_utc": 1591743922,
        "id": "gzylu0",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "I just saw that AMC announced that they are planning to reopen 1,000 stores. Should I buy some of their stock at opening tomorrow? I’m new to this and trying to figure out what will trigger an increase in stock price.",
        "subreddit": "stocks",
        "title": "AMC opening up theaters",
        "url": "https://www.reddit.com/r/stocks/comments/gzylu0/amc_opening_up_theaters/",
        "created": 1591772722.0
    },
    {
        "author": "toomuchBenZaye",
        "created_utc": 1591288882,
        "id": "gwl0kt",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "AMC dropped down to $5 a share. There are some rumors about amazon buying out AMC. AMC is expecting to reopen in the next two months. I’m thinking maybe calls?",
        "subreddit": "RobinHood",
        "title": "What are your opinions on AMC?",
        "url": "https://www.reddit.com/r/RobinHood/comments/gwl0kt/what_are_your_opinions_on_amc/",
        "created": 1591317682.0
    },
    {
        "author": "CivilRightsLawyer",
        "created_utc": 1592572434,
        "id": "hc0h4f",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "So, you got fucked by beer flu?  Welcome to the club.  Don’t fuck Joe-Q stonk holder over when we KNOW JPOW is buying up all those bonds that fuckface nerd ass bond holders made you go into wanky banky for.\n\nYou are a red blooded 100 year old American company that was started by a Ford salesman.  Ur as American as you get (buying a bunch of foreign cars for your fleet aside).  Don’t screw stonk holders over.  We want you to succeed!\n\nAs for DD, rented a car from Hertz a few weeks ago and the dude told me what was up.  Hertz was fine in Jan, so fine that they bought a shit ton of 2020 cars to make the people happy.   Beer flu is asshole.  Everyone fired.   Can’t cover new car payments (or something).  Beer flu went bye flu.  Now they are hiring everyone back and the cars are flying off the lots because no one wants to fly or take mass transit.\n\nI don't know jack about wanky banky because I'm not a total failure yet (obviously), can't you just take it back or something?\n\nPosition: bought stonk at 3 casue it was cheap, and fuck, look what happened to AMC when you bought that shit at 2.\n\nBull prayer (execute) PAPA ELON and UNCLE TRUMP, don’t let Hertz die!\n\ntldr: all you cunts dunkin' on Hertz sound like a bunch of assholes and I hope your puts turn to fuckin' dust.",
        "subreddit": "wallstreetbets",
        "title": "HTZ! I’m with ya! Don’t be asshole!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hc0h4f/htz_im_with_ya_dont_be_asshole/",
        "created": 1592601234.0
    },
    {
        "author": "tundraaaa",
        "created_utc": 1592495388,
        "id": "hbh6gx",
        "num_comments": 14,
        "num_crossposts": 1,
        "selftext": "# MEGA DD FAGITS  \n  \nSup autists, I’m a proud  🐻    \n    \nScroll down for autistic DD.    \n    \nMy list of stonks for this DD:    \n    \n| Ticker       | Company      | 🐻? |  \n| ------------ | ------------ | --- |  \n| NASDAQ:MDB   | MongoDB      | 🐻 |  \n| NASDAQ:ZM    | Zoom         | 🐻 |  \n| NYSE:SHOP    | Shopify      | 🐻 |  \n| NASDAQ:NFLX  | Netflix      | 🐻 |  \n| NASDAQ:AMD   | AMD          | 🐻 |  \n| NYSE:CMG     | Chipotle     | 🐻 |  \n| NASDAQ:NVDA  | NVIDIA       | 🐻 |  \n| NASDAQ:ADBE  | Adobe        | 🐻 |  \n| NASDAQ:PYPL  | PayPal       | 🐻 |  \n| NYSE:SQ      | Square       | 🐻 |  \n| NYSE:GDDY    | Godaddy      | 🐻 |  \n| NASDAQ:WIX   | Wix.Com      | 🐻 |  \n| NASDAQ:NVDA  | NVIDIA       | 🐻 |  \n| NASDAQ:ZNGA  | Zynga        | 🐻 |  \n| NASDAQ:ETSY  | Etsy         | 🐻 |  \n| NASDAQ:PZZA  | Papa John's  | 🐻 |  \n  \nTime to review this shit for you retards.  \nAll prices in $$ USD for you autists.  \n  \nP/E ratio: N/A = THESE RETARDS LOSE MONEY.  \n  \n## NASDAQ:MDB | MongoDB  \n| Market Cap | Stonk Price | EPS    | P/E ratio | Dividend Yield % | 52 week range  |  \n| ---------- | ----------- | ------ | --------- | ---------------- | -------------- |  \n| 12.21B     | 211.46      | -3.46  | N/A       | N/A              | 93.81 - 243.73 |  \n  \nDecent product for retards who don't know how to use relational databases.  \nMost people use free version without mongoloid hosting from MongoCorp, so no $$.  \nConsistently loses 1-2 per share, annualized. Never been profitable. Never paid out dividends. Revenue growth, so a retard bull would be inclined to say \"stonk go up!!\". Revenue is fucking low anyway. Their debt is trash. CR of 4.57 is very good.  \n  \n## NASDAQ:ZM | Zoom  \n| Market Cap | Stonk Price | EPS    | P/E ratio | Dividend Yield % | 52 week range  |  \n| ---------- | ----------- | ------ | --------- | ---------------- | -------------- |  \n| 66.79B     | 241.78      | 0.18   | 1309.01   | N/A              | 60.97 - 243.83 |  \n  \nYou all know this fucking stupid stonk. Ever heard of Microsoft Teams, Skype For Business, Discord, Slack, Google Hangouts and probably a thousand other solutions?  \nThe last 4 quarters were so great. 0.52 EPS annualized, with nice growth. Good revenue growth too! Never paid dividends. CR of 1.72 is decent. Debt isn't too bad, but still not very impressive for a tech company. Their margins are poo-poo. Not at all overpriced, P/E doesn't matter! New paradigm!  \n  \n## NYSE:SHOP | Shopify  \n| Market Cap | Stonk Price | EPS    | P/E ratio | Dividend Yield % | 52 week range  |  \n| ---------- | ----------- | ------ | --------- | ---------------- | -------------- |  \n| 99.32B     | 862.50      | ~0.60  | N/A       | N/A              | 281.69 - 860   | \n  \nShopify actually has a good product, and is miles ahead of its competition. (Other website builders for small business/dropshipping/noob-e-comm. Valuation doesn't make sense though. Their revenue dropped in that second quarter of 2020. EPS dropped too. Short track record. Never paid dividends. Debt to Equity is incredible on this one! Furthermore, CR is 9.45, which is extremely good. Lockdown and future e-comm won't boost their customer demographics at all. Huge corporations will take the e-comm market share, and they won't be using Shopify. Most private sellers/small businesses are about to run out of money to spend on stupid shit, and they probably can't compete with the big boys.  \n  \n## NASDAQ:NFLX | Netflix  \n| Market Cap | Stonk Price | EPS    | P/E ratio | Dividend Yield % | 52 week range  |  \n| ---------- | ----------- | ------ | --------- | ---------------- | -------------- |  \n| 195.28B    | 444.71      | 4.66   | 96.16     | N/A              | 442.8 - 452.6  |  \n  \nProduct is OK I guess. They have major competition now, though, and will have to fight Disney, Amazon, HBO, AMC, and probably many more.  At least they're profitable, which is a rare sight in tech. CR of 0.82 is garbage. Very high debt. Never paid dividends. Earnings growth is pretty consistent. Revenue growth is consistent as well.  \n  \nCBA to write more since reddit markdown is retarded. lmk if you want p2 of an autistic take on stonk market",
        "subreddit": "wallstreetbets",
        "title": "Mega DD on Stonks 😂👌",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hbh6gx/mega_dd_on_stonks/",
        "created": 1592524188.0
    },
    {
        "author": "arjayinvests",
        "created_utc": 1591473718,
        "id": "gxxyzp",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Is anyone here buying into AMC puts? Curious what people are doing there.",
        "subreddit": "stocks",
        "title": "AMC",
        "url": "https://www.reddit.com/r/stocks/comments/gxxyzp/amc/",
        "created": 1591502518.0
    },
    {
        "author": "goofyturtle",
        "created_utc": 1593373885,
        "id": "hhl3nt",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Just wondering what you guys think of AMC’s value right now. They are opening back up July 13th I believe and on the verge of getting bought by amazon.",
        "subreddit": "stocks",
        "title": "Thoughts on AMC STOCK?",
        "url": "https://www.reddit.com/r/stocks/comments/hhl3nt/thoughts_on_amc_stock/",
        "created": 1593402685.0
    },
    {
        "author": "powerpunk5000",
        "created_utc": 1591819334,
        "id": "h0ivv2",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "Bought some 1 put for AMC today was up $25 after it crashed and I didn't sell ( held it for 10 mins, knew it crash after the spike) \n\nBought one put of starbucks for $78 on bad news was up $15 ( again max profit in 5-10 mins after news of 200 stores closing, now I'm down almost 50%) \n\nI need to learn to take these quick little scalps off these news stories. I am being to greedy.",
        "subreddit": "options",
        "title": "I need to learn to scalp and sell fast",
        "url": "https://www.reddit.com/r/options/comments/h0ivv2/i_need_to_learn_to_scalp_and_sell_fast/",
        "created": 1591848134.0
    },
    {
        "author": "abcool123",
        "created_utc": 1593149410,
        "id": "hg1ryu",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "- CBS produces content already for Prime \n- CBS owns Pluto TV, free liner TV service, 37M active users.. and Prime announced they are adding liner TV lineup. \n- CBS is one of the largest content producers for Netflix, Prime, and such\n- CBS owns Showtime, Paramount, and other properties that can boost Prime lineup and bottom line. \n- CBS needs someone to buy em, if they want to survive and Amazon needs something to compete with Netflix \n- Bezos is a huge Star Trek fan and wants to own CBS just for that. He even made a cameo in one of the movies.. look it up \n\nWhat do you guys think... first AMC, now CBS? Think something is cooking at Amazon... If so $20 is a great entry point for a big payday \n\nhttps://www.theverge.com/2020/6/23/21300940/amazon-prime-video-live-linear-tv",
        "subreddit": "smallstreetbets",
        "title": "It looks like Amazon may buy ViamcomCBS (VIAC).",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/hg1ryu/it_looks_like_amazon_may_buy_viamcomcbs_viac/",
        "created": 1593178210.0
    },
    {
        "author": "thenewredditguy99",
        "created_utc": 1592588451,
        "id": "hc548g",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Yesterday, AMC Theatres announced they will not require patrons to wear face coverings when they reopen. Customers and scientific advisors rebuked that statement, and AMC listened. They will now require patrons to wear masks when they reopen.\n\nLink to article: https://www.marketwatch.com/story/amc-theatres-reverses-face-mask-policy-after-outcry-and-will-now-require-guests-to-wear-them-2020-06-19?mod=bnbh",
        "subreddit": "stocks",
        "title": "AMC Theatres reverses policy related to mask-wearing when they reopen.",
        "url": "https://www.reddit.com/r/stocks/comments/hc548g/amc_theatres_reverses_policy_related_to/",
        "created": 1592617251.0
    },
    {
        "author": "stillness0072",
        "created_utc": 1593179233,
        "id": "hg7vwy",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "AMC is shooting up starting market open. I'm not seeing any major news. The only thing I can think of is movie theatres are opening up in July. Either that, or some buyout/merger news that small players don't know about.",
        "subreddit": "stocks",
        "title": "AMC shooting up! Is it cause of July openings?",
        "url": "https://www.reddit.com/r/stocks/comments/hg7vwy/amc_shooting_up_is_it_cause_of_july_openings/",
        "created": 1593208033.0
    },
    {
        "author": "P4cific4",
        "created_utc": 1591189458,
        "id": "gvtkd3",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Read this.  Even AMC doubts it can survive.\n\n[https://www.cnn.com/2020/06/03/media/amc-theatres-business-coronavirus/index.html](https://www.cnn.com/2020/06/03/media/amc-theatres-business-coronavirus/index.html)",
        "subreddit": "CanadianInvestor",
        "title": "For those invested in Cineplex...",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/gvtkd3/for_those_invested_in_cineplex/",
        "created": 1591218258.0
    },
    {
        "author": "stillness0072",
        "created_utc": 1593261902,
        "id": "hgswec",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "An article on Friday talked about Amazon or Netflix buying up a  movie theatre chain, on benzinga. BofA Securities analyst [Nat Schindler](https://www.tipranks.com/analysts/nat-schindler) , a analyst says that makes sense. Now the article pushes for Cinemark, which makes no sense to me cause AMC has a bigger foothold, and are in most of europe and eastern europe. If anything, I could see one of them buying the world's biggest chain AMC over Cinemark. Especially at such depressed valuation.\n\nSource:\n\n[https://www.benzinga.com/analyst-ratings/analyst-color/20/06/16408055/will-amazon-or-netflix-buy-a-movie-theater-chain](https://www.benzinga.com/analyst-ratings/analyst-color/20/06/16408055/will-amazon-or-netflix-buy-a-movie-theater-chain)",
        "subreddit": "stocks",
        "title": "Will Amazon Or Netflix Buy A Movie Theater Chain?",
        "url": "https://www.reddit.com/r/stocks/comments/hgswec/will_amazon_or_netflix_buy_a_movie_theater_chain/",
        "created": 1593290702.0
    },
    {
        "author": "micaelreis",
        "created_utc": 1591867348,
        "id": "h0vvpz",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "They are reopening, but do people really want to go to movies at such times?  \n\n\nI am thinking  **7/10 $4 put for 0.30**, how retarded that sounds? \n\n  \nStock is currently sitting at **$6.29.**",
        "subreddit": "smallstreetbets",
        "title": "Your thoughts on AMC 7/10p",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/h0vvpz/your_thoughts_on_amc_710p/",
        "created": 1591896148.0
    },
    {
        "author": "stillness0072",
        "created_utc": 1592511733,
        "id": "hbm7ef",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": " \n\nThe world's largest movie-theater chain, AMC Entertainment Holdings Inc., said it plans to reopen nearly all  its U.S. locations by July 24     \n\nAMC will open 450 of its domestic theaters on July 15, followed by about 150 more coming by July  24. That would mean virtually all locations would be open in time for the first major studio releases to hit screens. \n\nI can see this as a catalyst for the stock. They will be getting money from A-list membership, as well as viewerships. They own Odeon and UCI in Europe which are already opening and filling seats. Price is way below book value. Share float is below 53mil and a set up for a short squeeze in July is coming to furition. My take. Curious of other people's take.",
        "subreddit": "stocks",
        "title": "$AMC opening movie theatres in July catalyst?",
        "url": "https://www.reddit.com/r/stocks/comments/hbm7ef/amc_opening_movie_theatres_in_july_catalyst/",
        "created": 1592540533.0
    },
    {
        "author": "patrickwang1998",
        "created_utc": 1593200785,
        "id": "hgek7l",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Hi Guys so I've purchased 4 AMC $11.45 Call Options contracts expiring on 1/15/2021. I bought the options last year with a $2.35 premium per contract (total $9.4) and on Robinhood, it shows my cost was $940 (I assume it's the total value of stocks at the strike price). Since AMC's stock price dropped so much, I didn't want to exercise/sell it because I thought with a call option I was given a right but not an obligation to exercise it (i.e. I thought if I waited until the option expires, even if the stock price is well below the strike price, I would only lose the premium ($9.4 but not $940). However, after reading some articles published by Robinhood, it says that when my option contract expires, \"the contract itself would become worthless\". I was a little panicked after reading that. Does it mean that if I don't take any actions, when the options expire, I would lose the $940 instead of just the $9.4? (Because currently on my Robinhood account it shows that my AMC option has a market value of only $80 (with $860 loss). Since it's been a week since I emailed Robinhood about this question and no answer has been received, I would be much appreciative if anyone can help me!! Thanks!!",
        "subreddit": "RobinHood",
        "title": "HELP! Call Option Trading",
        "url": "https://www.reddit.com/r/RobinHood/comments/hgek7l/help_call_option_trading/",
        "created": 1593229585.0
    },
    {
        "author": "brandondabass",
        "created_utc": 1591371319,
        "id": "gx6tfm",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "I’m very new to the stock market - growing my initial capital since everything tanked in March. AMC was one that I bought at $3 before news of an Amazon buyout happened. I know they are close to bankruptcy and may not make it despite opening theaters in July, but they seem to be going up quite a bit (hit $6 this morning) for a company that is failing financially and has said they may not make it through COVID. \n\nI’m unsure if I should sell now that it’s doubled, or gamble for a possible Amazon buyout and see what happens then. Insight would be greatly appreciated for a nube such as I.",
        "subreddit": "StockMarket",
        "title": "Thoughts on AMC?",
        "url": "https://www.reddit.com/r/StockMarket/comments/gx6tfm/thoughts_on_amc/",
        "created": 1591400119.0
    },
    {
        "author": "stillness123",
        "created_utc": 1592165428,
        "id": "h90rq9",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "$AMC is in an upward channel, and since it's below book value + movie theatres opening in July it has a catalyst to move up. My take",
        "subreddit": "stocks",
        "title": "Movie stock upward channel",
        "url": "https://www.reddit.com/r/stocks/comments/h90rq9/movie_stock_upward_channel/",
        "created": 1592194228.0
    },
    {
        "author": "tmoss726",
        "created_utc": 1592529474,
        "id": "hbr92q",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Call or no? \n\nhttps://variety.com/2020/film/news/amc-coronavirus-movie-theaters-covid-19-1234642047/",
        "subreddit": "smallstreetbets",
        "title": "AMC Theaters coming back?",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/hbr92q/amc_theaters_coming_back/",
        "created": 1592558274.0
    },
    {
        "author": "gynnam",
        "created_utc": 1591671569,
        "id": "gzej9n",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Theaters are gradually going to start opening up this month. Which of these two stocks have the most potential growth? I’m more leaning on CNK. What’s your take?",
        "subreddit": "stocks",
        "title": "CNK or AMC?",
        "url": "https://www.reddit.com/r/stocks/comments/gzej9n/cnk_or_amc/",
        "created": 1591700369.0
    },
    {
        "author": "cykwon",
        "created_utc": 1593486794,
        "id": "hif4oh",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Looks like AMC is pushing its opening date and was announced an hour and a half before close today.\n\nhttps://variety.com/2020/film/news/amc-theatres-tenet-coronavirus-1234693262/",
        "subreddit": "stocks",
        "title": "AMC Theatres Delays Reopening as Coronavirus Spreads",
        "url": "https://www.reddit.com/r/stocks/comments/hif4oh/amc_theatres_delays_reopening_as_coronavirus/",
        "created": 1593515594.0
    },
    {
        "author": "stillness0072",
        "created_utc": 1592522424,
        "id": "hbpd1m",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Anyone know why $AMC is moving up so much AH?",
        "subreddit": "stocks",
        "title": "Weird AH action on $AMC",
        "url": "https://www.reddit.com/r/stocks/comments/hbpd1m/weird_ah_action_on_amc/",
        "created": 1592551224.0
    },
    {
        "author": "debbiethecopilot",
        "created_utc": 1591673590,
        "id": "gzf2fu",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "AMC\n\nSPCE\n\nET\n\n\nif you only had to choose between these three which one would you invest in and why?",
        "subreddit": "stocks",
        "title": "Best option out of these three to invest ?",
        "url": "https://www.reddit.com/r/stocks/comments/gzf2fu/best_option_out_of_these_three_to_invest/",
        "created": 1591702390.0
    },
    {
        "author": "stillness0072",
        "created_utc": 1593215868,
        "id": "hgj2cw",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "With Covid affecting park attendence at Universal, as well as Cinmark,Cineworld,AMC,Odeon,UCI etc... not showing their movies cause of Universal studios breaking an unspoken rule with them. Not to mention the huge debt load Comcast has. Plus low short interest fee, it seems like a no brainer.",
        "subreddit": "stocks",
        "title": "Is CMCSA a short candidate?",
        "url": "https://www.reddit.com/r/stocks/comments/hgj2cw/is_cmcsa_a_short_candidate/",
        "created": 1593244668.0
    },
    {
        "author": "jxdewey",
        "created_utc": 1593107879,
        "id": "hfqrxj",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "Predictions for AMC stock",
        "url": "https://www.reddit.com/r/investing/comments/hfqrxj/predictions_for_amc_stock/",
        "created": 1593136679.0
    },
    {
        "author": "stillness0072",
        "created_utc": 1592588792,
        "id": "hc57ze",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "News just broke that AMC has reversed the mask issue when seeing a movie. Don't get me wrong, I think that's a good thing they'll make people wear masks. But what I find weird is Cinemark(Regal) said they won't force people to wear mask on their ER and no one sweated it. Am I wrong to see this as a double standard?",
        "subreddit": "stocks",
        "title": "Weird double standard for AMC and CNK",
        "url": "https://www.reddit.com/r/stocks/comments/hc57ze/weird_double_standard_for_amc_and_cnk/",
        "created": 1592617592.0
    },
    {
        "author": "armedcandy",
        "created_utc": 1592530600,
        "id": "hbrjij",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "pennystocks",
        "title": "AMC",
        "url": "https://www.reddit.com/r/pennystocks/comments/hbrjij/amc/",
        "created": 1592559400.0
    },
    {
        "author": "cykwon",
        "created_utc": 1593486642,
        "id": "hif3d1",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "AMC delays its reopening",
        "url": "https://www.reddit.com/r/stocks/comments/hif3d1/amc_delays_its_reopening/",
        "created": 1593515442.0
    },
    {
        "author": "stillness0072",
        "created_utc": 1593042289,
        "id": "hfc46n",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "AMC theatre short interest info just came out today. Short interest reduced by more than 4.4 million shares! With only 51.22 million public float shares available, I wonder if this will be a  catalyst for the upside with theatres opening in July in US and parts of Europe that they have theatres in. Also seems some big names own quite a bit of shares as well.\n\nSource of short interest:\n\n[https://www.wsj.com/market-data/quotes/AMC](https://www.wsj.com/market-data/quotes/AMC)\n\nSource of major ownerships:\n\n[https://fintel.io/so/us/amc](https://fintel.io/so/us/amc)",
        "subreddit": "stocks",
        "title": "Crazy reduction of short interest at AMC catalyst for upside?",
        "url": "https://www.reddit.com/r/stocks/comments/hfc46n/crazy_reduction_of_short_interest_at_amc_catalyst/",
        "created": 1593071089.0
    },
    {
        "author": "eddurham",
        "created_utc": 1591712079,
        "id": "gznyib",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Information on AMC theaters possibly permantely closing",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gznyib/information_on_amc_theaters_possibly_permantely/",
        "created": 1591740879.0
    },
    {
        "author": "stillness123",
        "created_utc": 1592155098,
        "id": "h8xpnv",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "pennystocks",
        "title": "$AMC in upward channel",
        "url": "https://www.reddit.com/r/pennystocks/comments/h8xpnv/amc_in_upward_channel/",
        "created": 1592183898.0
    },
    {
        "author": "BigMoneyBets",
        "created_utc": 1591209063,
        "id": "gvzk1a",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "AMC stock",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gvzk1a/amc_stock/",
        "created": 1591237863.0
    },
    {
        "author": "darrynloyola",
        "created_utc": 1592540304,
        "id": "hbtxj1",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "AMC Theaters reopening; up 12% AH already",
        "url": "https://i.redd.it/5l21lzyfms551.jpg",
        "created": 1592569104.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1591711843,
        "id": "gznvxj",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "AMC Theatres has 'substantial doubt' it can remain in business ahead of Quarterly Report today",
        "url": "https://www.cnn.com/2020/06/03/media/amc-theatres-business-coronavirus/index.html",
        "created": 1591740643.0
    },
    {
        "author": "v1rility",
        "created_utc": 1591718687,
        "id": "gzq0pn",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "options",
        "title": "My AMC puts not moved at all despite AMC being down today.",
        "url": "https://i.redd.it/g3j1c1scrw351.jpg",
        "created": 1591747487.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1591460166,
        "id": "gxttxj",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Good Saturday afternoon to all of you here on r/wallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning June 8th, 2020.\n\n# **Look for the S&amp;P 500 to turn positive for the year with a boost from the Fed in the week ahead  - [(Source)](https://www.cnbc.com/2020/06/05/look-for-the-sp-500-to-turn-positive-for-the-year-with-a-boost-from-the-fed-in-the-week-ahead.html)**\n*****\n&gt; Federal Reserve Chairman Jerome Powell is expected to reassure markets next week the central bank will do whatever it takes to help the economy heal. That should be enough to keep investors moving into stocks that benefit from an economic rebound and push the S&amp;P 500 into the green for 2020.\n*****\n&gt; The Fed’s two-day meeting is the big event for markets in the coming week. There are a few economic reports, including inflation data, the consumer price index Wednesday and producer prices Thursday. Weekly jobless claims will be important Thursday to see if there’s a drop in continuing clams, after May’s employment report showed a surprising record gain of 2.5 million jobs.\n*****\n&gt; The reopening trade was in full swing in the past week, especially Friday when stocks surged on the jobs report, which was expected to show a loss of 8.3 million jobs. The Nasdaq broke above its record high set on Feb. 19, and the S&amp;P 500 was just 1.1% away from turning positive for 2020.\n*****\n&gt; Even before the jobs report, investors were loading up on financials, industrials, transports and small caps, which were up more than 8% for the week and 18.4% in the past month. S&amp;P financials were 12.1% higher on the week, S&amp;P industrials were up 10.5, and the NYSE airline index jumped more than 35.4.%.\n*****\n&gt; “I think next week is dominated by the reopening and it will be for another month,” said James Paulsen, chief investment strategist at Leuthold Group. “With cyclicals outperforming, small [caps] outperforming, credit spreads coming in and then the bond yields going up, everybody — all facets of the financial markets — are sort of suggesting the same outcome.”\n*****\n&gt; The S&amp;P 500 ended the week at 3,193, a gain of 4.9%, and now traders are watching to see if it can scale the psychological 3,200 level. The Dow closed Friday at 27,110, up 6.8% for the week, and the Nasdaq Composite was up 3.4%, at 9,814 after reaching an intraday record high of 9,845 Friday.\n*****\n&gt; Analysts say the market will likely look past the protests that broke out in cities across the U.S. after the death of George Floyd in Minneapolis. Four policemen were charged with murder in his death. Looters joined the protests, some of which turned violent, but they quieted down towards the end of the week.\n*****\n&gt; Stocks were higher for a third week in a row, but a change this past week has been the abrupt lurch higher in Treasury yields. The 10-year rose to a high of 0.95% Friday, a quarter-point move in just three sessions. The move was already underway but got a lift Wednesday when ADP jobs data was not nearly as bad as expected. Yields ripped even higher after the May employment report showed the unemployment rate actually fell to 13.3%, instead of climbing to 20%, as expected by economists.\n*****\n&gt; Bond strategists said the Treasury market was now acknowledging the potential for a recovery, but not in the exuberant way the stock market has been. Since March 23, the S&amp;P 500 has risen more than 45%, but it took the 10-year Treasury until this week to get back the yield level it was at when stocks bottomed.\n*****\n&gt; Paulsen said he believes a new bull market has been launched, but there could be pullbacks and some headwinds for the market coming up.\n*****\n&gt; “When GDP is minus 30%, other issues don’t matter. There’s just one issue. But as the economy reopens again, the trade battles will matter again, presidential politics will matter again,” said Paulsen, adding the budget deficit could also matter. “I think we’ll get removed from a sole focus. That isn’t quite there but I think it’s coming.”\n*****\n&gt; # Fed ahead\n&gt; The Fed begins its two-day meeting Tuesday, and will release its statement Wednesday afternoon, followed by a video briefing by Powell.\n*****\n&gt; “Whey would the Fed want to disrupt this with anything?” Paulsen said. “They’re still going to support the economy. They’re going to stay away from negative rates or yield curve management. They’re not going to do anything to scare the markets. They might certainly reassure people that they are still ready to provide support.”\n*****\n&gt; Ethan Harris, head of global economics at Bank of America, said the Fed may clarify where it stands on some of the extraordinary moves it has taken since it cut rates to zero. The Fed has been supporting the markets with asset purchases and multiple programs for commercial paper, corporate bonds, and municipal bonds, for example.\n*****\n&gt; “We think right now they’re just trying to get this Main Street lending program to work. The question is are they going to do more things around what they do in terms of forward guidance and next steps of macro easing,” Harris said.\n*****\n&gt; There has been speculation that the Fed would do some type of so-called yield curve control, a program to keep interest rates capped at certain levels. “I think it’s too early for that,” said Harris. He said the Fed would be guaranteeing low rates for a long period of time if it does yield curve control.\n*****\n&gt; “Yield curve control is basically open-ended quantitative easing,” he said. The Fed is currently buying Treasurys but if it wanted to stop yields from rising too much as the economy improves, it could make targeted purchases.\n*****\n&gt; Barclays chief U.S. economist Michael Gapen said it’s possible the Fed could announce the yield curve control. “We’ve said they could implement yield curve control out to three years,” he said. “In my mind that matches the length of the horizon of the economic projections.”\n*****\n&gt; Powell has said the economy needs more fiscal help, and he could reiterate those comments Wednesday. President Donald Trump on Friday said he backs more stimulus. So far, the Democrats have put out a marker with their wish list for further spending, but there have been no negotiations.\n*****\n&gt; There was concern the strong jobs report could make it harder to get buy in for another big spending package. But some economists say the recovery needs a boost and states need funding to fill the holes in their budgets from coronavirus-related spending and a lack of tax receipts.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/7klaXQm.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/PKTBzT2.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/a5JkAB6.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/M2x4Qoq.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/qtJYfXN.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/bjiJWjV.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/UAi19KJ.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/GQm4ruO.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/PQzyXLa.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/uV1U7FN.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/wm2XJND.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/yarkiMO.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/hFblu2G.png))**\n\n*****\n\n# S&amp;P 500 Stocks Outpacing Analyst Price Targets\n\n&gt; This morning's jobs report shocked the financial world -- most notably the economists whose job it is to provide estimates. The consensus estimate among economists for May nonfarm payrolls was projecting a loss of more than 7 million jobs. The actual number that was reported did not just show a smaller than expected job loss, but it actually showed a gain in jobs of more than 2.5 million.\n\n&gt; We're seeing a similar situation play out in the equity analyst community. With the S&amp;P 500 now up 40%+ since its low less than three months ago, the average stock in the index is now trading above its consensus analyst price target that looks 12 months out. Analysts have simply not been able to catch up to the rapid rise we've seen for equity prices.\n\n&gt; It's extremely rare to see share prices move above consensus analyst price targets. We don't have the historical daily data on this, but anecdotally we can't remember a time when the spread has been this wide. As shown below, at the end of 2019 when the S&amp;P finished a massive rally, equity prices were 5.5% below the consensus price target. That was seen as a very tight spread prior to what we're seeing now. At the lows in March, the average share price had dropped all the way to $92.50 compared to an average consensus price target of $143.20. That projected a gain of 54.9% at the time!\n\n&gt; Since March 23rd, the average share price has risen from $92.50 up to $138.40, while the average analyst price target has fallen from $143.20 to $136. Current price targets no longer project a gain for the average S&amp;P 500 stock, but rather a 1.7% drop.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/avgpricetarget.png))**\n\n&gt; # Nasdaq's Historical Run\n\n&gt; At its highs earlier this morning, the Nasdaq Composite was within 2% of its record high from earlier in the year. Besides the steep V-shape of the Nasdaq's pattern over the last four months, the other aspect of the chart that stands out is just how steep the 50-day moving average is trending lately.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060420-Nasdaq-50DMAa.png))**\n\n&gt; To illustrate just how steep the Nasdaq's 50-DMA has become, the chart below shows the daily percentage change of the 50-day going back to 1971. Currently, the Nasdaq 50-DMA is rising at an average of over 0.5% per day. That's an incredible slope and a level that has been exceeded only a handful of times in the Nasdaq's 50-year history.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060420-Nasdaq-Composite1.png))**\n\n*****\n\n# Big Gains From Smaller Tech\n\n&gt; It's still difficult to fathom the moves in the US equity market over the last four months. The fact that the Nasdaq and more specifically the Technology sector aren't far from record highs is definitely something no one was expecting two months ago. There's an old market saying that equities take the stairs up and the elevator down, but in the latest market cycle, the elevator up was almost as fast as the way down!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060320-Nasdaq.png))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060320-Technology-Sector.png))**\n\n&gt; If you've been following the markets, all you've likely heard up until recently is that large-cap tech, and more specifically, Microsoft (MSFT), Apple (AAPL), Amazon (AMZN), Alphabet (GOOGL), and Facebook (FB), are single-handedly driving the market higher. The reality is not nearly as clear-cut. Given their market caps, the \"Big 5\" (as they're often referred to) have done a lot of heavy lifting, but in terms of performance, they're hardly the only game in town.\n\n&gt; The table below lists Technology sector stocks in the Russell 3000 with market caps of more than $1 billion that are outperforming all of the 'big 5' tech stocks on a YTD basis. Actually, since Amazon is doing so well relative to the rest of the \"big 5\" these are all stocks that are outperforming Amazon. If we looked for stocks that were doing better than the average return of the \"big 5\" the list would be a lot, lot longer (+16.4%).\n\n&gt; Looking through the list of names below, the two top-performing names are Zscaler (ZS) and Twilio (TWLO), which have both more than doubled. Behind these two, DocuSign (DOCU) and Sprout Social (SPT) are both knocking on the door of triple-digits. All 28 of the names listed have market caps of $1 billion, but the average market cap is just over $21 billion, while Nvidia (NVDA) is the largest company on the list with a market cap of $216 billion. For the most part, these aren't names that have been driving the indices, but anyone holding these stocks in their portfolio probably doesn't care!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/060320-Tech-Stocks.png))**\n\n*****\n\n# Best 50-Day Rally Ever\n\n&gt; In many ways, what we’ve seen so far in 2020 has been both record-breaking and devastating. From the S&amp;P 500 Index peak on February 19 to the bear market lows March 23, stocks lost 33.9%. Now, 50 trading days later, stocks have gained 39.6%, for the largest 50-day rally since the S&amp;P 500 moved to 500 stocks in 1957.\n\n&gt; “There are no rollercoasters that can replicate what stocks have done so far in 2020,” exclaimed LPL Financial Senior Market Strategist Ryan Detrick. “Here’s the catch though: Big 50-day rallies in the past have taken place near the start of new bull markets, and the returns going out a year were quite bullish.”\n\n&gt; As shown in the LPL Chart of the Day, the 39.6% gain in 50 days was the greatest 50-day rally ever, besting the previous best in October 1982. What’s important to note here is that many of these rallies took place coming off major market lows, and delivered quite strong returns going out 6 to 12 months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/06/best-fifty-days.png?ssl=1))**\n\n&gt; Although we have near-term worries given this historic run, as some sentiment indicators such as put/call ratios are showing some froth, from a bigger picture perspective, this strong 50-day rally offers a reason to think stock prices may be even higher this time next year.\n\n*****\n\n# 2020 In Charts\n\n&gt; 2020 is only five months old, but in many ways it is one of the most historic years we’ve ever seen. “2020 went from moving along nicely, to seeing the worst recession in a generation and the fastest bear market ever,” explained LPL Financial Senior Market Strategist Ryan Detrick. “Now stocks are in the midst of one of the best bull runs ever, even though the economy remains extremely weak, thanks to record stimulus and hopes over a vaccine.”\n&gt; \nTo best sum it all up, here are 10 charts that tell the picture of 2020 so far.\n\n&gt; 1.) The 2010s were the first decade in history to go all 10 years without a recession, which of course ended just months into the new decade, as the economy stopped. Stocks gained 13.5% on an annual basis last decade, surprisingly, only the third-best decade over the past four.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/06/1-blog-chart.png?ssl=1))**\n\n&gt; 2.) This is an election year, and the S&amp;P 500 Index hasn’t been lower when a President is up for reelection since FDR in 1940. Although this seemed nearly impossible at the March lows, it is looking like this incredible streak could have a chance in 2020.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/2-blog-chart.png?ssl=1))**\n\n&gt; 3.) One of the first signs something could go wrong in 2020 was stocks fell in January. Historically, this has meant potential trouble for the final 11 months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/3-blog-chart.png?ssl=1))**\n\n&gt; 4.) As fears over COVID-19 gripped the world, the Dow Jones Industrial Average had its fastest bear market ever, in only 19 days. To put this in perspective, this was the fastest bear market in the 124-year history of the Dow.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/4-blog-chart.png?ssl=1))**\n\n&gt; 5.) Mark Twain said “History doesn’t repeat itself, but it often rhymes”. Looking at history, every 50 years there has been a terrible pandemic and stocks fell more than 30%. We don’t know if the ultimate lows are in this time, but so far, history is rhyming.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/blog-chart-5.png?ssl=1))**\n\n&gt; 6.) More than 20 million people in the US lost their jobs in April, while the unemployment rate soared to near 15%, the highest since the Great Depression. Record drops in manufacturing, industrial production, retail sales, and consumer spending have all taken place in the past two months as well.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/6-blog-chart.png?ssl=1))**\n\n&gt; 7.) A recession is here, ending the streak of 128 months in a row without one. What is unique about the previous expansion was nominal gross domestic product (GDP) grew only 50%, about the average growth seen during the previous expansions, but this expansion was nearly twice as long as the average expansion (10 years versus 5 years).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/7-blog-chart.png?ssl=1))**\n\n&gt; 8.) The bounce off of the March 23 S&amp;P 500 lows has been historic in many ways. In fact, it was one of the best 20-day rallies ever, with previous best rallies seeing strong returns 6 and 12 months later.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/8-blog-chart.png?ssl=1))**\n\n&gt; 9.) As scary as it was on the way down, stocks have come roaring back, gaining more than 35% from the March 23 lows. This would classify as the greatest bear market bounce ever, which opens the question: is this more than a bear market bounce and instead the start of a new bull market?\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/9-blog-chart.png?ssl=1))**\n\n&gt; 10.) The number of COVID-19 tests in the US nearly doubled in May versus what was seen in April. Additionally, fewer and fewer tests are coming back positive. Testing is one of the key ways we will beat this and this is a step in the right direction. We’ve also seen new monthly lows in people on ventilators, in the ICU, and in hospitals.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/9-blog-chart.png?ssl=1))**\n\n&gt; Hard to believe, but there are still 7 months left in 2020. It hasn’t been easy for any of us, and we continue to keep everyone impacted by this pandemic in mind, but we continue to see the glass as half full. The dual benefit of record monetary and fiscal policy should help create a bridge to help those most impacted, while the economy can slowly come back online later this year.\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$ADBE** \n&gt; * **$CHWY** \n&gt; * **$TIF** \n&gt; * **$LULU** \n&gt; * **$COUP** \n&gt; * **$SFIX** \n&gt; * **$LOVE** \n&gt; * **$NEPT** \n&gt; * **$GHM** \n&gt; * **$REVG** \n&gt; * **$GME** \n&gt; * **$HDS** \n&gt; * **$FIVE** \n&gt; * **$SIG** \n&gt; * **$CASY** \n&gt; * **$CVGW** \n&gt; * **$AMC** \n&gt; * **$FCEL** \n&gt; * **$QTNT** \n&gt; * **$PLCE** \n&gt; * **$CHS** \n&gt; * **$THO** \n&gt; * **$GCO** \n&gt; * **$BF.B** \n&gt; * **$LMNR** \n&gt; * **$WSG** \n&gt; * **$PRTY** \n&gt; * **$GES** \n&gt; * **$BBCP** \n&gt; * **$CONN** \n&gt; * **$HEXO** \n&gt; * **$PHR** \n&gt; * **$PVH** \n&gt; * **$RRGB** \n&gt; * **$PLAY** \n&gt; * **$TNP** \n&gt; * **$JW.A** \n&gt; * **$SB** \n&gt; * **$GSM** \n&gt; * **$SRT**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/PQzyXLa.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/bgPdMCr.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 6.8.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/d2EW1kr.png))\n\n&gt; # ***Monday 6.8.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/uxSiJJr.png))\n\n*****\n\n&gt; # ***Tuesday 6.9.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/3SIjcG7.png))\n\n&gt; # ***Tuesday 6.9.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/cRBrPlt.png))\n\n*****\n\n&gt; # ***Wednesday 6.10.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/DaheXAm.png))\n\n&gt; # ***Wednesday 6.10.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/9mcHxTl.png))\n\n*****\n\n&gt; # ***Thursday 6.11.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/i8SNjWM.png))\n\n&gt; # ***Thursday 6.11.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/9xcBZPK.png))\n\n*****\n\n&gt; # ***Friday 6.12.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n&gt; # ***Friday 6.12.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# Adobe Inc. $392.90\n&gt; **Adobe Inc. (ADBE)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, June 11, 2020. The consensus earnings estimate is $2.33 per share on revenue of $3.17 billion and the Earnings Whisper ® number is $2.39 per share. Investor sentiment going into the company's earnings release has 79% expecting an earnings beat The company's guidance was for earnings of approximately $2.35 per share. Consensus estimates are for year-over-year earnings growth of 26.63% with revenue increasing by 15.51%. Short interest has increased by 3.0% since the company's last earnings release while the stock has drifted higher by 25.6% from its open following the earnings release to be 23.1% above its 200 day moving average of $319.27. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, May 19, 2020 there was some notable buying of 3,194 contracts of the $410.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 4.8% move on earnings and the stock has averaged a 6.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ADBE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# United Natural Foods, Inc. $20.78\n&gt; **United Natural Foods, Inc. (UNFI)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, June 10, 2020. The consensus earnings estimate is $1.41 per share on revenue of $6.67 billion and the Earnings Whisper ® number is $1.42 per share. Investor sentiment going into the company's earnings release has 78% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 131.15% with revenue increasing by 11.86%. Short interest has decreased by 16.0% since the company's last earnings release while the stock has drifted higher by 202.5% from its open following the earnings release to be 96.1% above its 200 day moving average of $10.60. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, June 2, 2020 there was some notable buying of 2,226 contracts of the $22.50 call expiring on Friday, June 19, 2020. Option traders are pricing in a 17.7% move on earnings and the stock has averaged a 15.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=UNFI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Chewy, Inc. $48.44\n&gt; **Chewy, Inc. (CHWY)** is confirmed to report earnings at approximately 4:10 PM ET on Tuesday, June 9, 2020. The consensus estimate is for a loss of $0.11 per share on revenue of $1.55 billion and the Earnings Whisper ® number is ($0.09) per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 37.50% with revenue increasing by 39.78%. Short interest has increased by 37.9% since the company's last earnings release while the stock has drifted higher by 37.5% from its open following the earnings release to be 56.4% above its 200 day moving average of $30.97. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 5.8% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CHWY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Tiffany &amp; Co. $121.99\n&gt; **Tiffany &amp; Co. (TIF)** is confirmed to report earnings at approximately 6:40 AM ET on Tuesday, June 9, 2020. The consensus earnings estimate is $0.21 per share on revenue of $646.40 million. Investor sentiment going into the company's earnings release has 6% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 79.61% with revenue decreasing by 35.56%. Short interest has decreased by 26.5% since the company's last earnings release while the stock has drifted lower by 4.7% from its open following the earnings release to be 1.9% above its 200 day moving average of $119.75. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, June 5, 2020 there was some notable buying of 9,022 contracts of the $110.00 put expiring on Friday, August 21, 2020. Option traders are pricing in a 6.2% move on earnings and the stock has averaged a 3.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TIF&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# lululemon athletica inc. $319.78\n&gt; **lululemon athletica inc. (LULU)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, June 11, 2020. The consensus earnings estimate is $0.28 per share on revenue of $724.78 million and the Earnings Whisper ® number is $0.30 per share. Investor sentiment going into the company's earnings release has 47% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 62.16% with revenue decreasing by 7.35%. Short interest has increased by 53.3% since the company's last earnings release while the stock has drifted higher by 66.1% from its open following the earnings release to be 46.8% above its 200 day moving average of $217.77. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, June 4, 2020 there was some notable buying of 1,385 contracts of the $350.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 9.4% move on earnings and the stock has averaged a 7.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LULU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Coupa Software $216.94\n&gt; **Coupa Software (COUP)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, June 8, 2020. The consensus earnings estimate is $0.07 per share on revenue of $111.83 million and the Earnings Whisper ® number is $0.10 per share. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat The company's guidance was for earnings of $0.06 to $0.08 per share on revenue of $112.00 million to $112.00 million. Consensus estimates are for year-over-year earnings growth of 450.00% with revenue increasing by 37.48%. Short interest has increased by 7.9% since the company's last earnings release while the stock has drifted higher by 94.9% from its open following the earnings release to be 40.3% above its 200 day moving average of $154.59. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, June 4, 2020 there was some notable buying of 1,085 contracts of the $220.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 12.7% move on earnings and the stock has averaged a 9.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=COUP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Stitch Fix, Inc. $24.96\n&gt; **Stitch Fix, Inc. (SFIX)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, June 8, 2020. The consensus estimate is for a loss of $0.17 per share on revenue of $401.40 million and the Earnings Whisper ® number is ($0.13) per share. Investor sentiment going into the company's earnings release has 53% expecting an earnings beat The company's guidance was for revenue of $465.00 million to $475.00 million. Consensus estimates are for earnings to decline year-over-year by 342.86% with revenue decreasing by 1.83%. Short interest has increased by 4.0% since the company's last earnings release while the stock has drifted higher by 66.4% from its open following the earnings release to be 19.1% above its 200 day moving average of $20.96. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, June 2, 2020 there was some notable buying of 5,092 contracts of the $25.00 call expiring on Friday, June 12, 2020. Option traders are pricing in a 21.2% move on earnings and the stock has averaged a 13.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SFIX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Lovesac Company $17.84\n&gt; **Lovesac Company (LOVE)** is confirmed to report earnings at approximately 7:00 AM ET on Tuesday, June 9, 2020. The consensus estimate is for a loss of $0.69 per share on revenue of $48.22 million and the Earnings Whisper ® number is ($0.65) per share. Investor sentiment going into the company's earnings release has 52% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 2.99% with revenue increasing by 17.73%. Short interest has increased by 20.5% since the company's last earnings release while the stock has drifted higher by 109.9% from its open following the earnings release to be 31.5% above its 200 day moving average of $13.57. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 20.1% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LOVE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Neptune Wellness Solutions Inc. $3.14\n&gt; **Neptune Wellness Solutions Inc. (NEPT)** is confirmed to report earnings after the market closes on Wednesday, June 10, 2020. The consensus estimate is for a loss of $0.08 per share on revenue of $6.32 million and the Earnings Whisper ® number is ($0.10) per share. Investor sentiment going into the company's earnings release has 63% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 100.00% with revenue increasing by 48.36%. Short interest has decreased by 4.7% since the company's last earnings release while the stock has drifted higher by 56.2% from its open following the earnings release to be 6.4% above its 200 day moving average of $2.95. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, May 19, 2020 there was some notable buying of 2,960 contracts of the $3.00 call expiring on Friday, June 19, 2020. The stock has averaged a 8.1% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NEPT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Graham Corporation $15.58\n&gt; **Graham Corporation (GHM)** is confirmed to report earnings at approximately 6:30 AM ET on Wednesday, June 10, 2020. The consensus earnings estimate is $0.12 per share on revenue of $32.00 million. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 50.00% with revenue increasing by 35.36%. Short interest has increased by 89.8% since the company's last earnings release while the stock has drifted lower by 21.7% from its open following the earnings release. Overall earnings estimates have been revised lower since the company's last earnings release.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=GHM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/wallstreetbets.",
        "subreddit": "wallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning June 8th, 2020",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gxttxj/wall_street_week_ahead_for_the_trading_week/",
        "created": 1591488966.0
    },
    {
        "author": "DashingDudes",
        "created_utc": 1592621964,
        "id": "hceisx",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "RobinHoodPennyStocks",
        "title": "AMC",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/hceisx/amc/",
        "created": 1592650764.0
    },
    {
        "author": "DashingDudes",
        "created_utc": 1592621902,
        "id": "hceic1",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "RobinHoodPennyStocks",
        "title": "AMC",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/hceic1/amc/",
        "created": 1592650702.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1591292040,
        "id": "gwm1h9",
        "num_comments": 0,
        "num_crossposts": 0,
        "subreddit": "wallstreetbets",
        "title": "AMC is fuk and nobody needs to buy it. Just let it die and then take over the space.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gwm1h9/amc_is_fuk_and_nobody_needs_to_buy_it_just_let_it/",
        "created": 1591320840.0
    },
    {
        "author": "J_nicks",
        "created_utc": 1591658159,
        "id": "gzaqsi",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "AMC “guys we will not survive” stock market “But stocks only go up?”",
        "url": "https://i.redd.it/k68j0nedrr351.jpg",
        "created": 1591686959.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1591666951,
        "id": "gzda8m",
        "num_comments": 0,
        "num_crossposts": 0,
        "subreddit": "wallstreetbets",
        "title": "Missed on HTZ, AMC, and LTM, then you won’t want to miss TLRD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gzda8m/missed_on_htz_amc_and_ltm_then_you_wont_want_to/",
        "created": 1591695751.0
    },
    {
        "author": "Natmanfr",
        "created_utc": 1591728474,
        "id": "gztawo",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "AMC Play",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gztawo/amc_play/",
        "created": 1591757274.0
    },
    {
        "author": "G23456789",
        "created_utc": 1591804792,
        "id": "h0dtsn",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "AMC and GameStop",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/h0dtsn/amc_and_gamestop/",
        "created": 1591833592.0
    },
    {
        "author": "TacticalDrinkin",
        "created_utc": 1591790425,
        "id": "h09h8p",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "How in the hell is AMC up 10% premarket",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/h09h8p/how_in_the_hell_is_amc_up_10_premarket/",
        "created": 1591819225.0
    },
    {
        "author": "Curle01",
        "created_utc": 1592511818,
        "id": "hbm8as",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "RobinHoodPennyStocks",
        "title": "Who’s up for BK. AAL &amp; AMC",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/hbm8as/whos_up_for_bk_aal_amc/",
        "created": 1592540618.0
    },
    {
        "author": "Mugtown",
        "created_utc": 1591201503,
        "id": "gvx2bz",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "RobinHood",
        "title": "AMC reporting again they may go bankrupt",
        "url": "https://variety.com/2020/film/news/amc-theatres-bankruptcy-coronavirus-losses-1234624144/",
        "created": 1591230303.0
    },
    {
        "author": "variousbakedgoodies",
        "created_utc": 1591487857,
        "id": "gy1vfs",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "options",
        "title": "AMC LEAP CAll",
        "url": "https://www.reddit.com/r/options/comments/gy1vfs/amc_leap_call/",
        "created": 1591516657.0
    },
    {
        "author": "variousbakedgoodies",
        "created_utc": 1591487791,
        "id": "gy1us8",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "options",
        "title": "AMC Call(s)",
        "url": "https://www.reddit.com/r/options/comments/gy1us8/amc_calls/",
        "created": 1591516591.0
    },
    {
        "author": "Nydas",
        "created_utc": 1591302825,
        "id": "gwpll8",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "How would AMC bankruptcy effect Cinemark?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gwpll8/how_would_amc_bankruptcy_effect_cinemark/",
        "created": 1591331625.0
    },
    {
        "author": "MichaelP26",
        "created_utc": 1591621081,
        "id": "gyyu6b",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Is AMC fucked or am I just a 🌈🐻?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gyyu6b/is_amc_fucked_or_am_i_just_a/",
        "created": 1591649881.0
    },
    {
        "author": "OfficerCollins",
        "created_utc": 1591809807,
        "id": "h0fgzm",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "AMC has gone full retard!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/h0fgzm/amc_has_gone_full_retard/",
        "created": 1591838607.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1591728012,
        "id": "gzt5d2",
        "num_comments": 0,
        "num_crossposts": 0,
        "subreddit": "wallstreetbets",
        "title": "AMC play",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gzt5d2/amc_play/",
        "created": 1591756812.0
    },
    {
        "author": "Swol_Braham",
        "created_utc": 1591671580,
        "id": "gzeje8",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "TLDR is the next HTZ and AMC",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gzeje8/tldr_is_the_next_htz_and_amc/",
        "created": 1591700380.0
    },
    {
        "author": "stillness123",
        "created_utc": 1592238032,
        "id": "h9jgj8",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "$AMC moving up on theatre openings?",
        "url": "https://www.reddit.com/r/stocks/comments/h9jgj8/amc_moving_up_on_theatre_openings/",
        "created": 1592266832.0
    },
    {
        "author": "stillness0072",
        "created_utc": 1592521680,
        "id": "hbp5jj",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "RobinHood",
        "title": "Thoughts $AMC and $CNK will rise in July?",
        "url": "https://www.reddit.com/r/RobinHood/comments/hbp5jj/thoughts_amc_and_cnk_will_rise_in_july/",
        "created": 1592550480.0
    },
    {
        "author": "Acataleptic23",
        "created_utc": 1593191293,
        "id": "hgbk3j",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "So Robinhood is saying the the Q1 Earnings for WUBA(58.com) was supposed to be released yesterday, AMC. BUT...RH shows no dot for their “actual eps” of this quarter. I checked 58.com and found that they did in fact release their earnings. Anyone have idea why RH, yahoo, or marketwatch don’t show an update for their Q1 earnings??",
        "subreddit": "RobinHood",
        "title": "$WUBA (58.com) Q1 Earnings Report",
        "url": "https://www.reddit.com/r/RobinHood/comments/hgbk3j/wuba_58com_q1_earnings_report/",
        "created": 1593220093.0
    }
]