[
    {
        "author": "anoukbonami",
        "created_utc": 1588137278,
        "id": "ga3ea8",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "\n5 DO’s of Investing\n\nAbout a year ago, I wrote an open letter to my fellow millennials about their financial wins and financial fails.\n\nThe post got pretty good traction and I wanted to follow it up with a list of 5 Simple Do’s and Don’ts of Investing that I’ve acquired over the years.\n\nAlso, I wanted to share some of the great (and mostly free) financial products that I love and steer people who don’t have a financial services background away from some of the more common pitfalls of investing.\nIf you can follow these simple rules, you’ll be in great shape for retirement and achieving your goals. If you neglect them, your financial health will suffer.\n\n1. DO Track All the Things (automatically)!\n\nOne of the challenges that most people face is simply tracking their spending and saving. With hundreds of transactions per month across (often) dozens of accounts, you can’t do it on your own!\nFortunately, there is a great tool that let’s you connect your checking, savings, investment accounts + credit cards to see them all in one place.\nBetter yet, it automatically creates budgets for you to help you achieve your short and long-term goals.\nThe (free) product to use: Mint\n\n2. DO Keep an Emergency Fund for 6 Months of Expenses\nIn my Open Letter to Millennials, one of the most surprising facts I found in my research was how few people have an emergency fund.\nMore than half of Millennials either had $0 saved or didn’t even have a savings account.\n\nOne of the best things you can do for your financial well-being is fortunately also one of the simplest: Save enough money to cover your expenses for 6 months.\nNow that you know how much you spend per month (see #1), you know how much you need for a half year with no income. No one ever expects to be out of a job, have a major medical expense, or some other emergency, which is exactly why you need to start preparing and saving today.\n\n3. DO Invest Early and Often in Low-Cost Investments\n\nDon’t waste your money on high-fee Mutual Funds\nOnce you’ve started tracking your spending and earnings with Mint and built your emergency fund with Ally, you’re ready to start investing.\nInvest early, invest regularly, and invest in low-cost investments.\nFirst, from your Mint account, determine how much left over money you have each month. Set up an automatic transfer to your investment account.\nWith investment accounts, pick a diversified or index-tracking ETF with low costs (&lt;.2%).\nMy personal favorite is Vanguard, who has built their massive business on being a low-cost leader and low-cost innovator.\nThe best products to use:\nVanguard ETFs\nAcorns (invest your spare change automatically)\n\n4. DO Maximize your employer match and contribute at least 10% of salary to your 401k or a Roth IRA (if you don’t have a 401k)\n\nIf your employer provides a match to your 401k contributions, that’s FREE MONEY! At the very least, you should contribute enough to take advantage of this benefit. However, I’d recommend that you contribute at least 10% of your salary to your 401k or your Roth IRA.\nThe sooner you start contributing the better.\nEven if you feel your salary is low in your 20’s or 30’s, the power of compounding interest means that your money will often grow faster than higher income individuals who don’t start contributing until their 40's.\n\n5. DO Open a Health Savings Account (HSA)\n\nThe future of healthcare is employee-driven. Chances are, your employer already offers a “self-directed” or “high deductible” plan. If you don’t visit the doctor too often or have a complicated medical history, this type of plan can be a great option for you.\nThese plans come with either a FSA or an HSA. If you have an HSA, you’re in luck. In an HSA, your account balance rolls over each year, you can contribute pre-tax, and you can withdraw for medical expenses without paying taxes (free money!) Better yet, you can actually invest in the same low-cost funds I mentioned in #3 above in your HSA.\nA 65-year-old, healthy couple can expect to spend $266,600 over the course of their retirement on Medicare premiums alone, according to HealthView Services.\nWith that amount of medical expense, opening an HSA today is a great decision. You can find a list of 20 top HSA providers here.\n\n5 DON’Ts of Investing\n\n1. DON’T Buy and Sell Stocks Frequently\nWith the growth of no-trading-fee products like Robinhood, it’s easy to believe that in order to be successful investing, you need to trade often.\n\nChurning. Good for butter. Not for investing.\nThis couldn’t be more untrue.\nYou can’t “time” the market and you’re much more likely to hurt your returns than help them by trading on a weekly (or more frequent) basis. The likelihood that you’ll be able to pick individual stocks that beat the overall market is incredibly low (read: 0, unless your last name is Buffet).\nPlus, with this strategy, you won’t be diversified (see #2)\n\n2. DON’T Put All Your Eggs in One Basket\n\nIf these are your investments, you’re in serious trouble.\nOne of the quickest ways to get yourself into financial trouble is to focus a significant portion of your net worth in only one investment.\nWhether it’s a speculative fixer-upper, a friend’s business, or a too-good-to-be-true, once-in-a-lifetime opportunity, avoid trouble by diversifying.\nA safe rule of thumb is to never put more than 20% of your net worth in any one investment.\nDiversifying not only mitigates (some) risk, but if done right, can also increase your net returns in the long-run. As one sector or type of investment declines, another in your portfolio will thrive.\n\n3. DON’T Check Your Investment Performance Every Single Day\n\nShe just checked her portfolio.\nFinances are very emotional. If you’re following the stock market and your account balances on a daily basis, you’ll be riding a roller coaster of ups-and-downs that not many people can handle.\nEven worse, you’re increasing the likelihood you make a spur-of-a-moment decision to sell everything or double-down that will more than likely cost you in the future. Find a cadence of checking your investment performance that works for you. I recommend every 2–4 weeks as a good place to start.\n4. DON’T Live Beyond (or even at) Your Means\n\nSo you just got a promotion or a raise, great news!\nBut, instead of upgrading your car or your rental apartment, put it towards a longer term financial goal.\nIn my Open Letter to Millennials, the main reason Millennials aren’t saving is because they are spending every last dollar they earned. Do an inventory of your spending and budgets with Mint.\nWhat can you live without?\nWhat can you buy less frequently?\nWhere can you downgrade?\nDon’t spend more than you earn. It’s harder than it sounds.\n5. DON’T Take on Debt You Don’t Have To\n\nIn a good economy, debt is very easy to acquire. Take a minute to think of the debt you have today: Student Loans, Credit Cards, Car Payment, Mortgage. The list goes on and on and on.\nDo you have an iPhone? If you’re on their “upgrade plan”, congratulations, you’ve taken on another loan! (P.S. Don’t worry, I am too)\nOne of the best things you can do for your financial health is to avoid taking on this debt at all costs.\nInstead of trading in your older car for a new lease, fix it up and stretch it for a few more years.\n\nInstead of buying a new wardrobe, pay more towards your credit card bills.\nCreate a plan for getting rid of the debt that you have today and avoid new debt in the future. Also, not all debt is bad (like a house mortgage), it just creates more risk when the economy falters or an unexpected life event occurs.",
        "subreddit": "investing",
        "title": "5 Simple Do’s and 5 Don’ts of Investing",
        "url": "https://www.reddit.com/r/investing/comments/ga3ea8/5_simple_dos_and_5_donts_of_investing/",
        "created": 1588166078.0
    },
    {
        "author": "buystuffonline",
        "created_utc": 1587969195,
        "id": "g8v9oy",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I recently see a youtuber talking about setting up off shore trading accounts with little start up cash 1000 gives them leverage of 4x to 6x in an account.. does anyone have experience with this?   Vs trading in the USA or Canada where the big brokerage firms dont allow as much leverage or none at all.  Main reason you can grow your stock account much faster. I'm trading with smaller account. Thanks I'm a younger lad with alot of trading experience not new to the game.   Im looking for max leverage .. also herd some companies in the Caribbean area go under and you lose all your coin.",
        "subreddit": "stocks",
        "title": "Question about off shore trading stocks accounts for us and cdns",
        "url": "https://www.reddit.com/r/stocks/comments/g8v9oy/question_about_off_shore_trading_stocks_accounts/",
        "created": 1587997995.0
    },
    {
        "author": "Antennangry",
        "created_utc": 1587411532,
        "id": "g4zjwy",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Sup fellow poors.\n\nSo I'm posting here instead of big WSB, primarily because the OI is pretty low on the options I'm about to discuss, but it's perfect for those of us (re)starting small. To that end, let's talk about Cadence Design Systems ($CDNS), who has their Q1 earnings call today.\n\nCadence is provider of CAD software for PCB and integrated circuit design. They bought a simulation software company called AWR back in December, which has everyone's dicks hard because they'll be just about the only company that offers an integrated platform for IC and interconnect design that also does simulation at the dawn of 5G. As both businesses are relatively mature software companies, they've come to enjoy high and growing revenue and a low debt load, which has resulted in them retracing 97% of Februaries ATH. That is to say, they were $80 before the crash, now they're $78.\n\nNow I'm in RF. I do 5G shit. More importantly, I know how fucking much their software costs. We're talking 10's or 100's of $k a per seat per year on some of this shit. Now, they sell into a lot of big chip companies like AMD and NVDA which have done reasonable well during the market bounce. However, they sell to a lot of smaller cap companies, a lot of whom have been getting squeezes since early February when factories in China started shutting down. Because smaller companies tend to renew a lot of software licenses near the beginning of the fiscal year as budget allocations start to become available, this could have major implications for earnings. I'm betting that Q1 budget squeezes and layoffs will motivate smaller businesses to buy fewer seats, or make moves to software from different vendors, which is highly attractive because Cadence's UI is fucking godawful.\n\nNow I could be wrong here. The technology industry could really be as ironclad as market trends seem to indicate and 5G will lead us into some capitalist techno-paradise where stonks only go up. But in my little corner of the RF industry, I've seen some significant layoffs and a looooooot of cancelled PO's. I have to believe that earnings today will fall below expectations, and that we'll see a dip.\n\nIn the interest of getting this out before market close, I'll cut the greeks disclaimer (only monthlies available, weeklies would have been better) and post positions.\n\nTL;DR $CDNS 75p 5/15.  \n\n\nEdit: And sell tomorrow.",
        "subreddit": "smallstreetbets",
        "title": "Bearish $CDNS earnings play",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/g4zjwy/bearish_cdns_earnings_play/",
        "created": 1587440332.0
    }
]