[
    {
        "author": "fgh125312",
        "created_utc": 1588973411,
        "id": "gg24r2",
        "num_comments": 74,
        "num_crossposts": 0,
        "selftext": "From the weekend thread before its lost for all you zoomers who are describing this tech giant as a meme stock\n\nFundamentals\n\n· Diversified hardware/software company, provide switches/enterprise networking hardware, VPN, cyber security\n\n· Aim has been to pivot away from hardware sales (56%) toward more of a software play including a large focus on cyber security\n\n· Previous ER recorded a 4% decrease in Non-GAAP operating margins\n\n·  Circa USD 9 bln net cash position/rock solid balance sheet – big enough to provide USD 2.5 bln financing for large hardware purchases until 2021 to ensure companies can still upgrade despite uncertainty (from CEO)\n\n· Owns Webex (recording 14 billion meeting minutes in March vs 6 in January) \n\n·  COVID-19 potential catalysts from an increase in work from home (VPN/Cloud), WebEx adoption and also possible upgrades of data centers/Cisco Meraki hardware. Also active in the tele-health sector\n\n·  Increase in web traffic (remember Netflix reducing video quality?) is another potential catalyst for their hardware segment as tech companies  could be panic adding capacity\n\n·  CEO mentioned they had been working around the clock on video interview with CNBC, to ensure businesses stay functioning through COVID-19\n\n·  Recent conference call on their investor relations website outlining  their remote work portfolio seems to have been slept on also price wise\n\nTechnical\n\n· Stock traded in 50’s, for much of 2019 then was slapped down by trade war headlines\n\n· Dumped last 3 ER’s , trade war related fears – expectations for upcoming ER are low\n\n· Previous ER’s have shown decent jumps (check 2018)\n\n· Hasn’t recovered like competing networking stocks (Juniper Networks, Arista networks)\n\n· Option volatility has also remained quite low throughout March/April – options pretty much imply no movement\n\n· Bottomed and bounced from the upper 30’s to low 40’s and has been stuck in a range since\n\n·  Stock has tried to break out several times in April, random dumps due to macro related factors (mid April – negative Oil fears, 29th - 1st May  dump from tech sell-off/supposed trade deal collapsing tweet)\n\nPossible risk factors mostly come from big IT spending being potentially put on hold due to companies having cash flow issues/supply chain issues  delaying hardware production (as stated by other networking hardware markers) – biggest catalysts for a potential dump post ER. Equally could  surprise to upside given all the coronavirus related catalysts and low expectations\n\nDisclaimer: I own 50c LEAPs, building a position since March, great company fundamentals, survived multiple crises (tech bubble, 2008) and has the highest dividend yield in the NASDAQ – how this has been slept on since March/April I have no idea. As always, do your own DD",
        "subreddit": "wallstreetbets",
        "title": "CSCO DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gg24r2/csco_dd/",
        "created": 1589002211.0
    },
    {
        "author": "CD_Johanna",
        "created_utc": 1589561266,
        "id": "gkcpbr",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "This is really leading to paralysis. I have a belief that cloud computing will perform very well over the next 10 years. But I'm very daunted at building a portfolio around this.\n\nI recently bought a small number of shares of the below stocks:\n\nAMD, Amazon, Arista, DataDog, Five9, Google, IBM, Intel, Microsoft, Nvidia, and Twilio\n\nSome things I'm struggling with:\n\n1. Weighting of each stock by %. \n2. When I have more money to contribute to these stocks, which ones should I boost up (leads to 1.)\n3. Should I add more companies and expand my list to 20 stocks? It gets very hard to keep track of.\n\nThere's so many other cloud computing and technology companies. There are a good 30 cloud computing stocks I know of.\n\nThere's also ETF's that take care of these issues for me, but I get hung up on their expense ratios, and then also which one to pick. There's broad technology like IGM, ITEC, VGT, QQQ, etc. \n\nBut then there's also cloud specific ones like SKYY, CLOU, WCLD, IVES. These have higher expense ratios than overall tech.\n\nAny tips for getting over my paralysis?",
        "subreddit": "investing",
        "title": "Feeling paralyzed about which cloud/technology ETF's or individual stocks to buy.",
        "url": "https://www.reddit.com/r/investing/comments/gkcpbr/feeling_paralyzed_about_which_cloudtechnology/",
        "created": 1589590066.0
    },
    {
        "author": "CD_Johanna",
        "created_utc": 1589561951,
        "id": "gkcx72",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "This is really leading to paralysis. I have a belief that cloud computing will perform very well over the next 10 years. But I'm very daunted at building a portfolio around this.\n\nI recently bought a small number of shares of the below stocks:\n\nAMD, Amazon, Arista, DataDog, Five9, Google, IBM, Intel, Microsoft, Nvidia, and Twilio\n\nSome things I'm struggling with:\n\n1. Weighting of each stock by %.\n2. When I have more money to contribute to these stocks, which ones should I boost up (leads to 1.)\n3. Should I add more companies and expand my list to 20 stocks? It gets very hard to keep track of.\n\nThere's so many other cloud computing and technology companies. There are a good 30 cloud computing stocks I know of.\n\nThere's also ETF's that take care of these issues for me, but I get hung up on their expense ratios, and then also which one to pick. There's broad technology like IGM, ITEC, VGT, QQQ, etc.\n\nBut then there's also cloud specific ones like SKYY, CLOU, WCLD, IVES. These have higher expense ratios than overall tech.\n\nAny tips for getting over my paralysis?",
        "subreddit": "stocks",
        "title": "Feeling paralyzed about which cloud/technology ETF's or individual stocks to buy.",
        "url": "https://www.reddit.com/r/stocks/comments/gkcx72/feeling_paralyzed_about_which_cloudtechnology/",
        "created": 1589590751.0
    },
    {
        "author": "counterfeittheory",
        "created_utc": 1588446345,
        "id": "gcbwpz",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Thoughts on MRO? \n\nChesapeake is going BR. MRO CO’s taking pay cuts through December to offset op’s costs. IMO, strong company with solid financial history. At &lt; $6 no where to go but up, and with dividends.",
        "subreddit": "stocks",
        "title": "Marathon",
        "url": "https://www.reddit.com/r/stocks/comments/gcbwpz/marathon/",
        "created": 1588475145.0
    },
    {
        "author": "o_ohi",
        "created_utc": 1589275169,
        "id": "gi7tp7",
        "num_comments": 330,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\n[How did I spend 20 minutes in Photoshop makin this trash?](https://preview.redd.it/se8178ouway41.png?width=1000&amp;format=png&amp;auto=webp&amp;s=c0e3186708cbe3691e7403be7bc4934558a5f8d6)\n\nI learned about Robinhood a few month ago when WSBgod’s (bamboozle) post went viral. With dollar signs in my eyes I tried my hardest to unlock the green RH theme buying $ROPE and $CSV like the memes said, but I was #redgang until all my savings were gone. So I studied all the DD posts for months, made new savings, and set out to lose that too. I found a JavaScript machine learning tutorial on YouTube and got to work, mostly watching tendie porn on wsb every few minutes to refresh my false sense of hope.\n\nNow my script is finished, using machine learning on every DD thread I could find, analyzing the resistance, taking into account I, II, III, IV crush groups like they said, and cross referencing the greeks against fibonacci sequencing models. Everything I could possibly learn from WSB, I fed into the machine learning script so it generates a list of the top 69,420 positions on the market every time I open Internet Explorer. Then I inversed the list order, flipped the strike projections, watched The Big Short for the 3rd time that morning, and started trading. This shitter bot then somehow pulled off three consecutive weeks of 100% returns paper trading, so I decided to share the automated autism with you broke fucks so we can all lose our money together. For you retards, $5K +25% weekly compounded is a million in 24 weeks.\n\nHere are the positions for this week, selected by Retard Bot on Monday:\n\n&amp;#x200B;\n\n[I should flair this shit as DD.](https://preview.redd.it/ypt8ubl0xay41.png?width=1000&amp;format=png&amp;auto=webp&amp;s=bd3980d41aff851b55848a1fa57e0c8c981e3c67)\n\nCRM 187.5c 6/26 | projections:\n\n* $198 @ exp\n* \\+69% tendies\n\nCRM 200c 7/17 | projections:\n\n* $212 @ exp\n* \\+214% tendies\n\n&amp;#x200B;\n\n[Here's to drinking away our losses.](https://preview.redd.it/2f4d4bd2xay41.png?width=1000&amp;format=png&amp;auto=webp&amp;s=af96b8d99da6e13f06b9a2a47619eb05d984b0ef)\n\nCLX 200c 7/17 | projections:\n\n* $228 @ exp\n* \\+124% tendies\n\n&amp;#x200B;\n\n[Recession who?](https://preview.redd.it/bh4af0s3xay41.png?width=1000&amp;format=png&amp;auto=webp&amp;s=1a5f2896d7ac21f04d0953953cd54e5ef80bd861)\n\nRNG 320c 7/17\n\n* ???\n* idk… the script stopped giving projections around this point\n\nTECH 280c 7/17\n\n* stonks only go up\n* what does DD actually stand for?\n\nTECH 330c 7/17\n\n* cool name\n* saw a vaguely positive blog post on it\n\nHD 260c 7/17\n\n* if this works my dad might finally understand RH is not a gambling addiction\n* GUH\n\nWhy do I trust these positions? What do I know about them? Absolutely fucking nothing. The bot could literally pick positions at random and make more tendies than me. Who fucking cares.\n\nSo yeah, thank you autists for all the meme positions. At least you gay fucks make the losses worth it. I’ll be posting every friday with POV RH porn of returns for the positions here and mondays with new positions. According to my script’s projections of upcoming high efficiency SPY IV crush waves I’ll be at 1Mil tendies in 6 months, so enjoy calling me a retard, send gay emojis, and feel free to share the loot.\n\nAiming for 3% weekly with the bot, which, for you  🌈 🐻 s that failed 4th grade math, would turn $25K into 30 million dollars in 5 years. Since we're in a stupid synthetic JPOW bull-market rn, I think this thing's gonna keep printing 100% weekly for a while.",
        "subreddit": "wallstreetbets",
        "title": "Climbing from $5K to $1Mil in 24 weeks with a retard bot [ week 1 ]",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gi7tp7/climbing_from_5k_to_1mil_in_24_weeks_with_a/",
        "created": 1589303969.0
    },
    {
        "author": "DANNYBOYLOVER",
        "created_utc": 1588873551,
        "id": "gfbcp9",
        "num_comments": 62,
        "num_crossposts": 0,
        "selftext": "I've spent the last 13 hours scouring through their 10ks, 10qs, earnings, interviews, everything.  Feel free to ask below if you have any questions.\n\n\\#1 They blew Q4 2019 earnings out of the water.  151% YoY growth in their enterprise business.  Spiked 20% and the covid-19 market crash happened literally the next day.\n\n\\#2 they've followed $SPY pretty closely since then and has been on a tear since the beginning of this week but are still well below the $21 high they hit in February.\n\n\\#3  I was doing the math on their user numbers last night. They have such a a larger active user base that the up sell on just 2% would nearly double their enterprise revenue and their enterprise revenue was already 21% of overall revenue.\n\n\\#4 Covid-19 has had little (arguably no) impact on Survey Monkeys current pipelines, if anything, it has increased it.  That’s why the flat growth QoQ being projected is a little boggling.  How can you increase sales and marketing and get 2 acquisitions last year and still be flat on revenue QoQ... All while having 770K paid users to tap into and cross-sell and up sell across 335K different organizations\n\n\\#5  Look at their integrations, their 10k reflects  that’s 100% what they are focused on.Those integrations lead to enterprise sales and stickiness - and they can command price.  They had 6500 enterprise customers in q4 2019 - the remaining addressable market is massive and not in any way decreased by COVID-19,\n\n\\#6  When I look at the compeitors for survey monkey, I think yeah I’ve used it, it sucks it’s not scalable doesn’t map over seemlessly to my CRM or I have to spend $100k on consultants and research firms. Survery monkey fills a very solid niche and they appear to do it really well.  Anectdotally, I am working in COVID-19 relief and have had to do more surveys / analysis / community feedback tpye shit than ever before and a majority of them have been on Survey Monkey.\n\nvolume is low right now so I would suggest not buying OTM calls if you don't have the capital to actually execute.  If you do, $20/$25 June/July calls are dirt cheap.  ITM calls are priced appropriately and will be much easier to offload once it spikes AH.\n\n&amp;#x200B;\n\ntldr; $SVMK 7/17 $20c // 7/17 $15c",
        "subreddit": "wallstreetbets",
        "title": "$SVMK AH. Buy now, easy tendies. Thank me later",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gfbcp9/svmk_ah_buy_now_easy_tendies_thank_me_later/",
        "created": 1588902351.0
    },
    {
        "author": "zakwill",
        "created_utc": 1588907435,
        "id": "gfl9oa",
        "num_comments": 40,
        "num_crossposts": 0,
        "selftext": "Trading options during earnings season definitely adds to the intensity level, but makes it very interesting and rewarding. Yesterday I bought a 120 TWLO 5/22 p @5.30. I also bought a 135 TWLO c @ 6.10. Now, I have been buying calls in TWLO from 90 and up in the past month. I thought the recent run up provided for a difficult earnings season. However, I bought the call around 12:30pm because I didn’t want to miss a potential pop. Got lucky. In retrospect I shouldn’t have even bought the Put, but a little protection is fine if it fell hard. I sold the C this morning for a $2800 profit. The news was so good on TWLO, that I also bought an OTM, at the time, 165 C later on the day. Up another $1200 unrealized. \n\nI had 8 UBER calls. My strategy was to sell all if UBER traded above 30 in the AM which I did. After I had time to digest LYFTs report, I bought 4 ITM 28 UBER back. Still holding. \n\nROKU was another great holding of mine. However, I sold all three deep ITMs before the close because I was up over 6k from them. I did buy one OTM 145 C. Gone. \n\nI’m a huge believer in SQ so I picked up 5 ITMs today. Granted, I sold all 10 ITM calls yesterday before earnings. I held 3 ITM PYPLs. I thought Square May have bad earnings based on the pre earnings trade and PYPL would be good. The markets could easily sell a stock no matter how good the earnings, INTC. AMZN, AMD for example but I held my PYPLs. \n\nAlso, during the day I kept buying and adding to my SBUX ITM C positions and bought more CRM options on the strength of TWLOs report. I’m also holding several other positions. Very good day overall!! \n\nI’m looking to create a good group discussion to bounce trade ideas and strategies. I welcome other successful trade stories! I’m happy to help others also. As I said numerous times, I am a strong confident directional trader. Most of all, be patient, learn from your mistakes, take calculated risks and stay mentally strong. Good luck!!",
        "subreddit": "options",
        "title": "Mind of a trader. Today’s/ yesterday’s trades on UBER TWLO SQ and others",
        "url": "https://www.reddit.com/r/options/comments/gfl9oa/mind_of_a_trader_todays_yesterdays_trades_on_uber/",
        "created": 1588936235.0
    },
    {
        "author": "Rotatos",
        "created_utc": 1588859499,
        "id": "gf6x4b",
        "num_comments": 39,
        "num_crossposts": 0,
        "selftext": "Why you ask? Because this bullshit propped up market is fucking inept. They can literally light shit on fire during any earnings call and its green by morning. Did you see lyft? Fucking dumpster fire. \n\nTTD IS FUCKING EXPENSIVE. Buy a spread, they are actually REALLY FUCKING CHEAP. \n\nPLAY SYMPATHY PLAYS. CRWD, NOW, CRM, etc. All those are going to get a boost from NET or TTD going through the roof.\n\nSwitch sounds good, haven't looked at them too much.\n\nNET is still kinda cheap and I could see them die mid day a bit before rocketing at EOD. I already got a call on them as insurance, but likely will go in further later today.\n\nDropbox? Everyone is bearish as shit on them. google trends says they suck dicks, but who cares, bad news is good news and the good news says fuck you dropbox up 20% ah. \n\nIm 3 for 3 on 3 different plays I said to do, lets keep it going. I don't think i can ask for money or tips but please post some gain porn and donate to a good cause, we are all really fucked in middle and lower classes. god save us all.",
        "subreddit": "wallstreetbets",
        "title": "YOU READY FOR TODAY EARNINGS DD???? Dropbox, TTD Spreads, NET",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gf6x4b/you_ready_for_today_earnings_dd_dropbox_ttd/",
        "created": 1588888299.0
    },
    {
        "author": "zakwill",
        "created_utc": 1589093790,
        "id": "ggwo3k",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "First off, I authentically want to say that I am trying to help people better their trading skills and think of option trading in a different light. I am happy to help, answer questions and even after many years of trading, I’m still excited and always learning. \n\nI was holding roughly a 80/20% call / put portfolio. As the S&amp;P was pushing up to resistance, barring some bad virus news, I felt the bias was to the upside. Advancers vs decliners, overall participation and sentiment led me to believe we were / are heading higher. Even with the dreaded jobs report coming out Friday morning, it seems people were expecting the worst, so I felt it was baked in for now. \n\nAfter Musks outburst, I had traded OTM TSLA calls well, and my gut told me it wanted to break over 800. At around 795, I bought 1 OTM TSLA 830 5/29. Still holding up $3000. I also added to my TWLO c as I think its hitting 190-200 on a push. I noticed the strength in DIS and BA and felt early on Friday morning that an overall positive market tone was in place for the day. So I bought more ITM SBUX and NKE. I had been accumulating PENN, around 20 ITM c that I unloaded for a 80% profit, but if the MMA fight night proves to be what I think is a winner, sports, DIS. Gaming and indirectly casinos could benefit from pent up demand for live action so I may rebuy Monday. I also added to my stock in CRM, DKNG and calls. Very Good Friday! \n\nI firmly believe that as more and more companies announce reopening, albeit with minimum capacity and utilizing safety measures,  it will be perceived positively. DIS opened Shanghai theme park with a max of 30% occupancy and it sold out in 3 minutes. Towards the end of the trading day, Apple announced they were going to open many of their stores next week in select areas. I bought 3 more AAPL ITMs \n\nWhen trading options, you have to go with your gut and you have to be quick. Don’t overthink the trade. I cannot stress enough how important the timing is for entry and exit. If you are just trying to scalp or hedge then it’s a different story, but If you truly want to make or have the potential to make substantial money off your trades, you have to always be listening to the news, time your trades well, and watch them throughout the trading day. Very important! Good luck! I hope all your trades are well Thought out and timed well.",
        "subreddit": "options",
        "title": "Mind of a Trader Part 2. TWLO AAPL TSLA PENN SBUX and more",
        "url": "https://www.reddit.com/r/options/comments/ggwo3k/mind_of_a_trader_part_2_twlo_aapl_tsla_penn_sbux/",
        "created": 1589122590.0
    },
    {
        "author": "m2rik",
        "created_utc": 1588969433,
        "id": "gg0vbj",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "Yolod on $210c 05/29. God I hope it prints.",
        "subreddit": "wallstreetbets",
        "title": "What about Salesforce?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gg0vbj/what_about_salesforce/",
        "created": 1588998233.0
    },
    {
        "author": "SanitysLastRefuge",
        "created_utc": 1588865619,
        "id": "gf8qf4",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "When I saw everyone shitting on Zoom as an undifferentiated hype stock at WSB, figured there may be a contrarian play, so started doing some digging. Just my view - disclosure, obviously long shares and calls, a few FDs included. Earnings coming up in early June and think there's 2-3x price appreciation potential in the next 6-12 mos. \n\nTLDR: Zoom undervalued at anything less than $200 a share as market discounting new subscribers. Sorry for the bullet formatting, I tried. \n\nHigh level thesis: \n*\tMarket underestimating the impact of daily participants growth from 10MM/day at end of 2019 to 300MM/day as of early April\n*        \tWhile education and other venues have received free access, this does not explain the broader growth. There are 60-70MM people in US at school age. Assuming 25% using Zoom at 5x instances a day, that yields 80-100MM of the 290MM growth from education\n*      \tBoth new and existing enterprise Zoom users have likely rapidly increased adoption in the last 90 days, adding more paying users per company than previously assumed (e.g., a firm with 50 employees that may have shared 4-5 licenses or used a free version is now ramping usage)\n*\tHigh free cash flow, subscription revenue business provides visibility into earnings potential on an annualized, runrate basis\n*      \tSubscription based model that is a small cost per employee, especially compared to traveling for in person meetings (e.g., annual subscription a fraction of the cost of one business trip per year)\n*      \tMarket will price ZM on a quarterly runrate basis derived from paying users, which will be reported in early June along with MD&amp;A on new users through that date\n*\tContinued COVID issues will drive subscription and paying user growth\n*      \tEarly state reopenings will drive companies to delay return to work and travel due to risks of virus continuing to circulate (e.g., many financial firms banning travel until 2021); consensus for a 2nd wave in the 2H of 2021\n*      \tDespite reopenings, dual income households unable to go to work due to childcare constraints as schools, daycares, and camps closed until the fall or beyond\n*      \tCOVID accelerating long term shift toward remote working; commercial air travel to remain challenged for next 6-12 months (Evercore surveys point to investors’ belief that business travel does not recover until 2H2021) further entrenching people being comfortable working from home or doing remote meetings\n*\tCompetitive moat built through brand, GUI, and early mover advantage\n*      \tZoom is a name brand in the business community; technology not just an app but becomes entrenched in conference room set-ups, internal company procedures and IT stack\n*      \tCost of service is de minimis for recent competitive activity from Google or Facebook to matter ($120/user/year not worth behavioral change/shift requirements)\n*      \tZM preferred due to GUI, user friendliness (prior to it being banned, Google’s own employees overwhelmingly preferred Zoom and company considered buying Zoom)\n*      \tOther larger tech companies have challenges in switching Zoom users (FB: personal privacy and bridge to enterprise applications; GOOG: niche user base and need to be in GOOG ecosystem; MSFT: clunky user interface embedded in complex Teams universe, slow to roll out upgrades)\n\nIn terms of the risks / bear case for the story, common questions and concerns are the following:\n\n*\tValuation too high: “1000 PE,” “ridiculous revenue multiple” to be addressed shortly. Net net there is visibility into near term runrate $2B in annualized EBITDA, which at a 50x multiple (appropriate given growth), implies substantial price upside\n*\t“Muh competition”: addressed above. Solutions provided by FB are geared toward social users (who are not paying and ZM doesn’t want anyway); MSFT is too clunky and ZM viewed as a complementary application; GOOG: not everyone wants a gmail account and even Google’s own employees prefer Zoom. Thankfully for the bull case, all these threats are now out in the open and “priced in”\n*\tAll the growth will go away post COVID: 1) COVID not going away anytime soon (see: second wave, mutations, too early openings, residual fears; 2) post conversion, video conferencing will still be used, particularly to save on corporate travel and will replace conference calls that were done prior to COVID. Additionally, companies will want this capability in place for risk mitigation/business continuity. Given this, the subscription users will stay in place and continue to convert from free users 3) the education (K-12/college) users who will go away weren’t paying and will plant seeds for future growth as they join the workforce 4) the growth in users was 30x in the course of 30-60 days\n*\t“Muh security concerns and Zoom bombing”: acquisition of KeyBase + Eric’s 90 day plan appears to be allaying concerns. Separately, the security concerns appear to be hyped up by competitors vs. actual threats – a number of reputable firms continue to onboard Zoom and NYC schools has reversed its decision. Just note that FB channeled Russian hackers on its platform that changed the outcome of US elections and appears to not effect its valuation. \n\nValuation: the gutcheck – stock has appreciated ~2x pre-COVID though daily participants have grown 30x. All else being equal, market is discounting a substantial portion of upside growth. However, it is important to note that FYQ2 (the next quarter being reported for period ending 4/30) will not nearly reflect the runrate performance given most of the recent surge happened late in the quarter. \n\n*\tContext of where we are and what we know about the numbers\n**\tIn the most recent quarter ending January, Zoom generated $188MM in revenue and $10MM of EBITDA. It is important to note that Zoom operates at 82-83% gross margin (that means each incremental dollar generates 80 cents of profit or EBITDA assuming no scale up of backoffice and overhead). Said differently, it is very cheap for Zoom to support incremental user growth as is with most software/subscription businesses\n**\tOn an annualized basis pre-COVID, Zoom was generating roughly $800MM in revenue and $40MM of EBITDA. The low EBITDA margins are due to the SG&amp;A/overhead that has yet to be (but soon will be) leveraged\n**\tExiting the most recent quarter, Zoom had 10MM daily participants, which translates into ~$75 of annualized revenue per daily participant (includes both paying and non-paying participants). Note that this 10MM includes those who used the platform for free prior to COVID, so if the same mix of paying and non-paying participants continued, you’d see an unbelievably large ramp in revenue and earnings\n**\tZoom grew to 200MM daily participants in early April, then 300MM toward the end of April\n**\tObviously, you can’t just take the 300MM x $75 a year factor, which would translate into $24B in annualized revenue – it is likely a larger percentage of free users joined, including college and K-12 students. The question is what %? That’s what I will lay out below. \n\n*\t Valuing the growth potential – anything less than $200/share is drastically undervaluing Zoom\n**\tThe question is then of the 290MM new daily participants, how closely does that match to the profile of the preexisting 10MM daily participants. That is what we will then apply the $80/annualized revenue figure\n**\tBeing conservative, let’s just assume 20%. That implies 58MM out of the 290MM new daily participants that match the mix of paying/non-paying as pre-COVID users and that the rest of the 230MM will not pay at all\n**\tThat yields to an INCREMENTAL annualized revenue figure of $4.4B ($75/year x 58MM)\n**\tBack to our gross margin point, Zoom generates 82-83% gross margins\n**\tInstead of doing a straight calculation on that as flow through, let’s assume another 20-25% cost on the incremental revenue in additional SG&amp;A as well as costs to serve the incremental free users\n**\t$4.4B x 60% = $2.2B in annualized operating profit (EBITDA)\n**\tSo how do we value ZM on that basis? Question is comparable TEV / EBITDA multiples for fast growing software/SAAS businesses:\n***\tCRM: 55x LTM EBITDA (35% revenue growth), 8x revenue (more mature, lower margin biz)\n***   TDOC: not profitable; 20x LTM Revenue\n***\tDOCU: not profitable, 20x LTM Revenue\n***\tTWLO: not profitable, 17x LTM Revenue\n**\tAssuming a 15x revenue multiple for ZM on runrate revenue ($5B total runrate) = $75B TEV, or $250 share price on 300M shares\n***\tAssuming a 50x EBITDA multiple like CRM: $108B TEV, or $360 share price\n***\tAssuming a 30x EBITDA multiple: $65B TEV, $215 share price\n**\tNow, assume 50x EBITDA and what the value would be if greater than 20% of the new users looked like the profile of Zoom’s existing users, should it be 30 or 50%: \n***\t30%: $580/share at 50x EBITDA, $350/share at 30x\n***\t50%: $1,015/share at 50x, $600/share at 30x, $400/share at 20x (at larger TEV, multiple will be lower as more growth has been realized\n\nSo there you have it. Maybe informative, maybe one of the most retarded things you've read in a while. Take your pick.",
        "subreddit": "wallstreetbets",
        "title": "ZM: why the market may be substantially underestimating the upside",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gf8qf4/zm_why_the_market_may_be_substantially/",
        "created": 1588894419.0
    },
    {
        "author": "jamnormal",
        "created_utc": 1588692144,
        "id": "gdzpl5",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "**BBSI Description:**\n\nBarrett Business Services, Inc. provides HR consulting, staffing, and payroll functions for small and medium sized businesses in 29 states across the US. There are two ways they generate revenue: Professional Employer Services (PEO) and Staffing and Recruiting. Most of their revenue (87%) comes from PEO where they provide a suite of corporate functions for small businesses. They establish a co-employment relationship with each client company and assume responsibility for payroll functions, payroll taxes, and workers’ compensation claims. They have over 7,200 PEO clients in 2019 across 29 states utilizing 64 different branch locations.\n\n [US map with Barrett Branch locations](https://www.reddit.com/user/jamnormal/comments/gdzoc3/barrett_branches_2019/?ref=share&amp;ref_source=link)\n\n&amp;nbsp;\n\n**Business Model:**\n\nBBSI helps small businesses grow by allowing them to outsource a task with high administrative burden. For many small businesses, payroll and administrative tasks are a fixed costs through HR employee salaries. PEO clients are billed for a percentage of client payroll, with the gross amount invoiced including direct payroll costs, employer payroll-related taxes, workers’ compensation coverage, and a service fee. By charging a percent of wages at the client firm, they help their clients by turning their former fixed cost administrative services into variable costs based on wages. PEO revenue is reported net of direct payroll costs, such as salaries, wages, and health insurance because BBSI is not the primary obligor for these payments, their clients are. “Indirect” payroll costs, such as payroll taxes and benefits and Workers’ Compensation expenses make up the bulk of operating costs.\n\n\nThe key to understanding BBSI’s financial statements comes down to establishing the co-employment relationship with their clients. BBSI’s primary operating expenses are Direct Payroll costs (10% of 2019 revenue), Payroll taxes and Benefits (46%), and Workers’ Compensation (22%). These three costs are passed entirely onto clients. Direct Payroll costs are related to their staffing business, while the latter two expenses are related to PEO clients. In addition to billing these above expenses, BBSI includes a service fee that is based on the total wages of employees. Their operating income can be simplified down to the service fee less their own corporate SG&amp;A expenses. \n\n&amp;nbsp;\n\n**Competition:**\n\nImplementing HR and admin solutions has become a big business for big businesses, but the small business market has had less focus from large players. Paychex &amp; Salesforce both provide tech suites aimed at larger companies and white collar firms. Barrett’s average client size is roughly 30 employees, and the focus is on blue and gray collar firms.\nFocusing on small business PEO, the main competition is TriNet Group Inc (TNET) and Insperity Inc(NSP). Focusing on geographical growth is the major differentiating strategy factor that Barrett uses to succeed in the PEO market. Focusing on conversions from internal HR departments, a substitute good for PEO, they achieve more aggressive pricing while still having net client ads quarter over quarter. Since 2016, their client base has grown at roughly 13.7% per year. The strength of growing geographically using branches allows them to fully flex their network of new clients from referral partners and clients.\n\n&amp;nbsp;\n\n**Why is it a good buy now?**\n\n\n•\t**Barrett is trading at a significant discount to their historical trading valuations, as well as at discounts relative to their PEO peers.** After Q4’19, they reduced 2020 guidance on the eve of the full COVID pandemic, leading to a cool reception from the street. Alone, this would not be enough to feel it as a discount considering the significant impact COVID will have on their business. However, they also trade at a significant discount to their PEO peers while simultaneously leading their PEO peer group in FCF yield.\n\n\nFirm | EV/FCF | P/E| FCF Yield | Net Debt/EBITDA\n---|---|----|----|----\nBarrett Business Services Inc (BBSI) | 3.73 | 7.18 | 19.3% | N/A\nTriNet Group Inc (TNET)* | 7.44 | 14.08 | 14.5% | 0.77\nInsperity Inc (NSP)* | 11.65 | 13.34 | 8.5% | N/A\n\n^*Comparisons ^are ^made ^for ^same ^periods. ^While ^TNET ^and ^NSP ^have ^reported ^Q1’20 ^earnings, ^it ^makes ^more ^sense ^to ^compare ^the ^same ^period ^for ^all ^three ^firms\n\n\n•\t**Barrett has a strong balance sheet consisting of a negative net debt position, giving them significant leeway in weathering the COVID pandemic storm.** Less than 10% of their TEV being made up of interest-bearing debt, they are sitting pretty when it comes to weathering this storm. At some points during the business cycle it feels silly to start financial analysis at the balance sheet, but during a recession is not one of those times. With so few financial obligations, they are expected to trim corporate SG&amp;A and investment in their new technology platform to keep more cash within the firm. Barrett stands a high chance of making it out the other side with a low chance of bankruptcy.\n\n•\t**Focusing on growth from a geographical perspective, Barrett’s management has carved out a small business niche that has seen success in their ability to open new branches.** Focusing on small businesses (average client firm size is ~30 employees) gives them an edge over some of the larger payroll companies in the market. Clients typically find BBSI through a strong referral network of both existing clients and external referral partners. Most of BBSI’s new clients are converting from internal HR/admin staff, which allows BBSI to provide a powerful value proposition. They turn small businesses’ fixed cost employee salaries into a variable cost based on total employee wages.\n\n•\t**Quality branch economics shows a model with strong operating leverage and marginal ROIC.** New branches take roughly a 500k investment and take about 5 years to become a mature branch. To be expected, more mature branches have more billing generation and more profit margin contribution. Barrett grows new branches geographically, allowing it to maintain high concentrations in local markets, ramp up the speeds of growth, and reduce fixed costs associated with new regions. Their strategies in opening new branches culminate in an ROIC in 2019 of 30.6%. The IRR on new branches that take 7 years to reach maturity is still more than 150%. \n\n\nBranch Stratification:\n\nNumber of Branches | Size | Run Rate| Average Profit Margin\n---|---|----|----\n18 | Mature | &gt;$100 Mil | ~60%\n20 | Emerging | $30-$100 | ~40%\n26 | Developing | &lt;$30 | ~10%\n64 | Total |  | \n\n&amp;nbsp;\n\n**Conclusion:**\n\n\nBased on the underlying business model and execution of the management, BBSI seems undervalued. Based solely on their strong balance sheet and large multiple discrepancy between both themselves historically and their fellow PEO peers, they seem like a buy and hold until well after the COVID-19 Crisis has ended. Their business will have the ability to ramp up naturally as their clients begin to hire again and small businesses are looking for a way to outsource admin they may have laid off. In conjunction with their strong branch economics, BBSI is currently undervalued for investors who can take a 3+ year time horizon allowing for the business to recover and their multiple to converge with peers.\nA model has not been completed as Q1’20 results have not been released, which will likely contain big indications into how BBSI will perform for the coming quarter and year. A model will be completed, and an update posted once Q1’20 data has been released. \nQ1’20 is expected to be released 5/5 after market close. In the absence of a model, I have already thoroughly investigated their past few 10-k’s and read through most of their earnings calls over the past few years. I have spent a considerable amount of time insuring I understand how their business and financials tie to one another. To feel comfortable going long this business, I felt the need to dig in and understand it from their branch economics to how their workers’ compensation claims policy works with Chubb.\n\n I am more than happy to discuss the company and delve deeper into the financials of the company if anyone has any questions/comments. \n\n&amp;nbsp;\n\n**Disclaimer:**\n\nThis is not investment or financial advice and the above thesis is predicated on my opinion &amp; interpretation of the facts mentioned. I am currently long BBSI in my personal portfolio.\n\n&amp;nbsp;\n\n**Sources:**\n\nSEC Edgar 10-k’s and 10-Q’s\n\nTIKR.com’s Earnings Call Transcripts\n\nPrice and share data from TIKR and Excel add-in feed\n\n“Competition Demystified” by Bruce Greenald &amp; Judd Kahn for ROIC formula/concepts\n\n&amp;nbsp;\n\nEdit: added disclaimer",
        "subreddit": "SecurityAnalysis",
        "title": "The Bull case for Barrett (BBSI)",
        "url": "https://www.reddit.com/r/SecurityAnalysis/comments/gdzpl5/the_bull_case_for_barrett_bbsi/",
        "created": 1588720944.0
    },
    {
        "author": "Sportsguy02431",
        "created_utc": 1589401482,
        "id": "gj6ysi",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "Well today was still a good day! Just not as good a day as yesterday - but I'll take an up day over a down day any day of the week. I did well in the first hour, but my losses halved my gains from that time - and then ran out of free cash.\n\nToday was another hold my breath at open and see where we go - I managed to stay patient and find good entry points. I was tracking OKTA, TWLO, WIX, CODX, and DDOG this morning - and managed to get into good entry points on CODX, TWLO, and DDOG. Unfortunately CODX went the wrong direction and got stopped out quickly in the morning - If I had the cash I was looking at reentering at around 1PM when the MACD crossed - but missed out on those +200% tendies - would've been around $350 additional.\n\nAfter TWLO and DDOG worked out, I got impatient looking for some new plays, and dropped into NVDA, ZM, and got pretty quickly stopped out of those as well, with those losses halving my gains for the day. Glad that I got stopped out of them - but wish I had respected the MACD for NVDA and not gotten in when I did- it was overbought and crossing in the wrong direction. ZM was also overbought but hadn't crossed yet. SPY then fell out and that was the day. \n\n* Lesson for the day is patience - wait for the good plays, they will come. For example as I'm writing this CRM, WIX, and VTIQ are solidly heading in the direction I like and I was tracking them.\n* Another lesson is watching my trailing stops a bit closer - they were a bit too tight on DDOG, the small drop below consolidation at 10:15 caught it out.\n* Final lesson is that sectors tend to move together - I could've caught OKTA along with TWLO but I moved a bit too slow on it and missed the entry - that should come with experience though\n\n**The Plan:**\n\n1. Get a TDA cash account and fund with $2000\n2. Play intra-day swing and momentum trades\n3. Cut losses early and often - wins will accumulate over losses.\n4. Take profits Regularly  \n\n   1. Account Balance $4000 - take $2000 to cover initial investment\n   2. Account Balance $14328 - take $12328 to cover cash losses\n   3. Account balance of $6057.37 - take $4057.37 to cover equity losses\n\n**Position History:**\n\n**Position History:**\n\nDay 3: 5/13 +8.35% - $1356.57 - $1469.84\n\n|Position|Day P/L|Quantity|Bought|Sold|\n|:-|:-|:-|:-|:-|\n|CODX 6/19 20C|\\-$22|1|$277|$255|\n|TWLO 5/22 200C|\\+$174|1|$469|$643|\n|DDOG 5/15 70C|\\+$45|1|$200|$245|\n|NVDA 5/15 335C|\\-$39|1|$213|$174|\n|ZM 5/15 180C|\\-$39|1|$180|$141|\n\n&amp;#x200B;\n\nDay 2: 5/12 +29.53% - $1046.34 - $1356.57\n\n|Position|Day P/L|Quantity|Bought|Sold|\n|:-|:-|:-|:-|:-|\n|CRM 6/19 200C|\\+2|1|$263|$265|\n|EGHT 6/19 20C|\\+59|1|$191|$250|\n|TWLO 5/29 205C|\\+30|1|$370|$400|\n|VTIQ 5/15 30C|\\+224|2|$103|$215|\n\n&amp;#x200B;\n\nDay 1: 5/11 +5% - $1000.89 - $1046.34\n\n|Position|Day P/L|Quantity|Bought|Sold|\n|:-|:-|:-|:-|:-|\n|DDOG 5/15 55c|\\+54|1|$380|$434|\n|CSCO 5/15 44.5c|\\-16|2|$214|$198|\n|CHWY 5/15 39.5c|\\+12|1|$134|$146|",
        "subreddit": "wallstreetbets",
        "title": "Day 3 5/13 : From Down to Up - The Road to $18385.37 - +8.35% ($1356.57 - $1469.84)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gj6ysi/day_3_513_from_down_to_up_the_road_to_1838537_835/",
        "created": 1589430282.0
    },
    {
        "author": "inthegreen07",
        "created_utc": 1589232982,
        "id": "ghx0m2",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Looking to get into one or both of these tomorrow. Anyone have any suggestions. Think they will both do well this month with earnings coming up. So who ya got?",
        "subreddit": "stocks",
        "title": "Workday or Salesforce",
        "url": "https://www.reddit.com/r/stocks/comments/ghx0m2/workday_or_salesforce/",
        "created": 1589261782.0
    },
    {
        "author": "Rotatos",
        "created_utc": 1589392959,
        "id": "gj43n8",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Hi all. I'm mostly broke now since CRM crashed 10 points this morning and LOGI smashed earnings but still barely moved.\n\nCODX is my final yolo, and if I can take my whole paycheck that comes on the 15th and put it on CODX, I would.\n\nGod help us all.",
        "subreddit": "wallstreetbets",
        "title": "CODX Earnings - Moved up!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gj43n8/codx_earnings_moved_up/",
        "created": 1589421759.0
    },
    {
        "author": "sodndbbdjsjsjshdhh",
        "created_utc": 1589331435,
        "id": "giokuq",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Adbe expiration 5/15 CRM expiration 5/22 and 5/29",
        "subreddit": "wallstreetbets",
        "title": "Should I give up hope on my adobe and CRM calls?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/giokuq/should_i_give_up_hope_on_my_adobe_and_crm_calls/",
        "created": 1589360235.0
    },
    {
        "author": "Horrawful",
        "created_utc": 1588783515,
        "id": "genkp2",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Hi!\n\nI have about $80k that I'm planning on investing in. I have been thinking of a couple of different investment strategies, but I'm a rookie so I'd love to get some feedback.\n\n# About me\n\n* Age: Early 20s\n* Location: Europe\n* Investment horizon: Until retirement? \n* Willing to rebalance a couple of times per year, at most\n\n# Potential Strategies\n\nSince I'm fairly young and have a long horizon, I'm willing to take some extra risk at this point. I've spent the last week or so doing analysis and DD on all companies I have considered below. However, I also prefer a fairly simple approach as I'm not planning on conducting DD on too many more companies. The tech focus is deliberate. The strategies I've been thinking about range from relying heavily on ETFs to some stock picking.\n\nMy main question is if you would suggest more of an ETF approach or more stock picking? Which of the strategies would be the best?\n\n&amp;#x200B;\n\n||Strategy 1|Strategy 2|Strategy 3|Strategy 4|\n|:-|:-|:-|:-|:-|\n|**ETFs**|VOO, QQQ, VGT|VOO, VGT|VOO, QQQ|VOO|\n|**Stocks**|DIS, BAM, European stocks in Life Sciences and Industrials|DIS, BAM, AMZN, GOOG, FB, PYPL, European stocks in Life Sciences and Industrials|DIS, BAM, MA, European stocks in Life Sciences and Industrials|DIS, BAM, AMZN, GOOG, FB, MA, MSFT, NVDA, AMD, PYPL, European stocks in Life Sciences and Industrials|\n|**Comment**|Keep it as simple as possible. Get a lot of tech from ETFs. Worried about the overlap between QQQ and VGT, which made me consider the other strategies.|Keep VGT and take direct positions in AMZN, GOOG, and FB, etc. that QQQ would have covered|Keep QQQ and take positions in MA, CRM, AMD and potentially some other stocks that VGT would have covered|Keep VOO as the foundation of my portfolio and then take direct positions in some tech stocks that would have been covered in VGT/QQQ|\n\n&amp;#x200B;\n\nThank you!",
        "subreddit": "investing",
        "title": "Feedback on Investment Strategy",
        "url": "https://www.reddit.com/r/investing/comments/genkp2/feedback_on_investment_strategy/",
        "created": 1588812315.0
    },
    {
        "author": "Drghettoj",
        "created_utc": 1589294008,
        "id": "gicbyd",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "CRM dip anyone? Getting dumped tommorow",
        "url": "https://i.redd.it/n9l93ahjhcy41.jpg",
        "created": 1589322808.0
    },
    {
        "author": "CD_Johanna",
        "created_utc": 1588874621,
        "id": "gfbpnr",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "I am making a bet on cloud computing over the next 10 years, and building a portfolio consisting of individual stocks. (Ignore for a minute if this is a bad idea or not)\n\nLet's say these stocks are: Amazon, Microsoft, Google, IBM, Alibaba, Salesforce, Oracle, and Tencent\n\nI am trying to determine what ratios I should keep the stocks in.\n\nShould I weight them by market share? https://cdn.statcdn.com/Infographic/images/normal/18819.jpeg\n\nWith this idea, I would have 33% in Amazon, 18% in Azure, 8% in Google, etc.\n\nI plan to buy and hold, and never sell. Then as the market share %'s change, I would simply buy more of the under-weighted stock in proportion.\n\nIs this a reasonable approach? Since I don't know who will come out ahead, but I am confident that cloud will dominate the next 10 years.",
        "subreddit": "stocks",
        "title": "Creating a cloud computing position with individual stocks. Should I weight by market share?",
        "url": "https://www.reddit.com/r/stocks/comments/gfbpnr/creating_a_cloud_computing_position_with/",
        "created": 1588903421.0
    },
    {
        "author": "Sportsguy02431",
        "created_utc": 1589383438,
        "id": "gj145d",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Well today was still a good day! Just not as good a day as yesterday - but I'll take an up day over a down day any day of the week. I did well in the first hour, but my losses halved my gains from that time. I'm posting early because I'm all out of cash.\n\nToday was another hold my breath at open and see where we go - I managed to stay patient and find good entry points. I was tracking OKTA, TWLO, WIX, CODX, and DDOG this morning - and managed to get into good entry points on CODX, TWLO, and DDOG. Unfortunately CODX went the wrong direction and got stopped out quickly.\n\nAfter TWLO and DDOG worked out, I got impatient looking for some new plays, and dropped into NVDA, ZM, and got pretty quickly stopped out of those as well, with those losses halving my gains for the day. Glad that I got stopped out of them - but wish I had respected the MACD for NVDA and not gotten in when I did- it was overbought and crossing in the wrong direction. ZM was also overbought but hadn't crossed yet. \n\n* Lesson for the day is patience - wait for the good plays, they will come. For example as I'm writing this CRM, WIX, and VTIQ are solidly heading in the direction I like and I was tracking them. \n* Another lesson is watching my trailing stops a bit closer - they were a bit too tight on DDOG, the small drop below consolidation at 10:15 caught it out. \n* Final lesson is that sectors tend to move together - I could've caught OKTA along with TWLO but I moved a bit too slow on it and missed the entry - that should come with experience though\n\n**The Plan:**\n\n1. Get a TDA cash account and fund with $2000\n2. Play intra-day swing and momentum trades\n3. Cut losses early and often - wins will accumulate over losses.\n4. Take profits Regularly\n   1. Account Balance $4000 - take $2000 to cover initial investment\n   2. Account Balance $14328 - take $12328 to cover cash losses\n   3. Account balance of $6057.37 - take $4057.37 to cover equity losses\n\n**Position History:**\n\nDay 3: 5/13 +8.35% - $1356.57 - $1469.84\n\n|Position|Day P/L|Quantity|Bought|Sold|\n|:-|:-|:-|:-|:-|\n|CODX 6/19 20C|\\-$22|1|$277|$255|\n|TWLO 5/22 200C|\\+$174|1|$469|$643|\n|DDOG 5/15 70C|\\+$45|1|$200|$245|\n|NVDA 5/15 335C|\\-$39|1|$213|$174|\n|ZM 5/15 180C|\\-$39|1|$180|$141|\n\n&amp;#x200B;\n\nDay 2: 5/12 +29.53% - $1046.34 - $1356.57\n\n|Position|Day P/L|Quantity|Bought|Sold|\n|:-|:-|:-|:-|:-|\n|CRM 6/19 200C|\\+2|1|$263|$265|\n|EGHT 6/19 20C|\\+59|1|$191|$250|\n|TWLO 5/29 205C|\\+30|1|$370|$400|\n|VTIQ 5/15 30C|\\+224|2|$103|$215|\n\n&amp;#x200B;\n\nDay 1: 5/11 +5% - $1000.89 - $1046.34\n\n|Position|Day P/L|Quantity|Bought|Sold|\n|:-|:-|:-|:-|:-|\n|DDOG 5/15 55c|\\+54|1|$380|$434|\n|CSCO 5/15 44.5c|\\-16|2|$214|$198|\n|CHWY 5/15 39.5c|\\+12|1|$134|$146|",
        "subreddit": "wallstreetbets",
        "title": "Day 3 5/13 : From Down to Up - The Road to $18385.37 - +8.35% ($1356.57 - $1469.84)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gj145d/day_3_513_from_down_to_up_the_road_to_1838537_835/",
        "created": 1589412238.0
    },
    {
        "author": "psndvdhsba",
        "created_utc": 1589331321,
        "id": "giojqc",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Should I give up hope on my adobe and CRM calls?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/giojqc/should_i_give_up_hope_on_my_adobe_and_crm_calls/",
        "created": 1589360121.0
    },
    {
        "author": "sodndbbdjsjsjshdhh",
        "created_utc": 1589331497,
        "id": "giolfz",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "options",
        "title": "Should I give up on adobe and CRM calls?",
        "url": "https://www.reddit.com/r/options/comments/giolfz/should_i_give_up_on_adobe_and_crm_calls/",
        "created": 1589360297.0
    },
    {
        "author": "foxyfox71",
        "created_utc": 1588951528,
        "id": "gfv64m",
        "num_comments": 211,
        "num_crossposts": 1,
        "selftext": " I have another DD for those who want to ride the last bit of tech ER opportunity left out there.\n\nCSCO to announce their earnings on 5/13. Here's the optimal strategy:\n\n* Step 1: Go to CSCO 5/29 options, select the lowest premium possible which is 50c @ $0.06 atm\n* Step 2: Buy loads of contracts. Lets assume we buy 80 contracts for $480\n* Step 3: CSCO is currently $42.00... Let it climb to $45 until Wednesday 5/13. Ride the IV fluctuations until 5/13\n* Step 4: CSCO goes up by a mere 8% to $45 (which is extremely possible given how undervalued it is). The value of your stock is 2.5x your investment, you get $1,250. If it goes up to $46.33, your stock is up 6x times and your return is $2880.\n* Step 5: Sell your CSCO calls and take a lil break\n\nYou can see it for yourself using this calculator:  [https://www.optionsprofitcalculator.com/calculator/long-call.html](https://www.optionsprofitcalculator.com/calculator/long-call.html)\n\nTake my advice but use your own judgement. Good luck dickheads.",
        "subreddit": "wallstreetbets",
        "title": "Ok... Here's another good DD for you twats: CSCO 5/29 calls",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gfv64m/ok_heres_another_good_dd_for_you_twats_csco_529/",
        "created": 1588980328.0
    },
    {
        "author": "expander2",
        "created_utc": 1589211736,
        "id": "ghpxxn",
        "num_comments": 130,
        "num_crossposts": 0,
        "selftext": "Welcome back to the WSB DD Summary! This is for 5/9-5/11. I’m your host and resident autist u/expander2. You have to be able to read to gain anything from this so that rules out about half of you. As always, ticker is in bold on the left and what I deem \"important\" is near the top of the post. A TLDR, plays, and previous DD summaries will be at the bottom. My last posts still stand and hold some good info so check it out for more plays if this isn't enough for you greedy fucks.\n\n&amp;#x200B;\n\nNot much good stuff for this weekend. Just watching the DD from Friday seeing how it pans out. We will get right into a couple plays but this one doesn't have many plays.\n\n&amp;#x200B;\n\n**OKTA;**  Okay, Okta is another cloud company. Straight from Wikipedia it;\n\n&gt;...provides cloud software that helps companies manage and secure user authentication into modern applications, and for developers to build identity controls into applications, website web services and devices.\n\nThis means that they can make lots of money when everyone is working at home and overhauling their network because of the increased web traffic. This equates into more growth for an already growing company. I'm just gonna copy and paste the important shit [from this post](https://www.reddit.com/r/wallstreetbets/comments/gez830/why_okta_is_a_solid_play/) which gives you everything you need to make a decision.\n\n&gt;Financial performance has been truly outstanding in recent years, with revenue growth reaching 54% annually since 2017. Management comments during the company's investor day on April 1 confirmed that the business keeps firing on all cylinders based on recent data, and several research firms increased their price targets for Okta after the conference.  \n&gt;  \n&gt;Most high-growth companies in the sector are losing money due to aggressive reinvestment needs to support long-term growth. Okta, on the other hand, is already generating positive free cash flows, and management has ambitious targets over the middle term.  \n&gt;  \n&gt;Okta intends to deliver revenue growth rates in the range of 30% to 35% over the next five years and a free cash flow margin of 20-25% in fiscal 2024. These targets are not easy to achieve, but they are not unrealistic either when considering the company's track record and future opportunities.  \n&gt;  \n&gt;Total revenue last quarter reached $167.3 million, an increase of 45% year over year. Subscription revenue was $158.5 million, an increase of 46%. Remaining Performance Obligations (RPO) reached $1.21 billion, growing by 66% year over year.\n\nEarnings come out 5/28 and should be a beat. I don't plan on entering this myself but I will absolutely look into it again next week and make a firm decision by then. I will update in one of my posts that week what I will do with Okta.\n\n&amp;#x200B;\n\n**CDLX;**  Cardlytics is a company that provides a marketing channel inside apps like Wells Fargo &amp; Bank of America, through consumer cash-back deals. For the retards, they put ads in banking apps with discounts so that people are likely to buy them. As we know, people are spending a shit ton of money online. Amazon, Shopify, Etsy, etc. are all making money hand over fist because of our consumer culture. People are spending money and this is good for any company that advertises deals. Here is what is interesting and the reason I might buy into this, according to the [OP of this post](https://www.reddit.com/r/wallstreetbets/comments/gg0jz7/cardlytics_nyse_cdlx_preearnings_call_next_monday/), before covid most of the ads in these banking apps were for airlines, cruises, theme parks; attractions. Now, most of these ads are for clothing deals, carryout, amazon, movies. This means they have successfully flipped their market to generate maximum profit from consumer trends in the wake of a quarantine. If this is true then it is brilliant. Another indicator of performance is the fact that Cardlytics insiders have been buying into their company to the point of spending around $33 million to buy shares of their own company.\n\nIf I had the liquidity to buy in, I would. Earnings release after hours today and I can see them reaching above $50 easily. I'm tied up right now but if I would have seen this earlier I would be in. Do your own research though.\n\n&amp;#x200B;\n\n**Guidance;**  If you have SmileDirectClub (SDC) calls then I would sell today, this is if you bought them because of my post on Friday. This run-up is indicative of a massive sell off after earnings no matter if they are good or not. If you got the $8.5 then you are a wealthy man. Don't be greedy. Wish I would have bought it on Friday last week. \n\nedit; My bad I thought earnings came out after hours today. Disregard this I would still hold.\n\n&amp;#x200B;\n\n**My moves;**  Because of popular demand and as a credibility enhancer, I have decided to include my moves in regards to the stocks that I write about. This will include things from past DD summaries and ongoing trades. Most of them will not be this long and will only include my moves not an explanation but because this is the first I will include that stuff and more.\n\nToday (5/11) I bought CSCO $45.5c 5/15 and LOGI $60c 5/15 because both are down today and report earning very soon. Both were in my last DD summary so read that for more information on why. I plan to use the earnings from both of those plays to get in on BOX and carry over into next week. I also have some SATS calls that I am still trying to offload. I made quite a bit on SATS $35c so I used a small percentage of my profits to buy back in at $40 and lost that money but I’m not hurt over that.\n\nI have a project going on with another user which will help find the perfect options contract to make a reasonable amount of money based on the smallest moves in underlying price. It is in its testing phases right now but we plan to use it next week for ourselves to see how well it works then I will look into releasing some of that information to you guys. That's all I can really say about it but know that it's taking up a bit of my time because of research and implementation.\n\n&amp;#x200B;\n\nGood luck fuckers and tune in on Mondays, Wednesdays, and Fridays for more WSB DD Summaries!\n\n&amp;#x200B;\n\n**TLDR;** Okta could make big bucks I will update on that one, Cardlytics will get above $50, Sell SmileDirectClub calls today.\n\n**Plays;** OKTA calls for 6/5 (but dont buy yet), CDLX calls above $50 for 5/15 and buy today because they report after hours.\n\n**Previous WSB DD Summaries;**[ 4/28-5/1](https://www.reddit.com/r/wallstreetbets/comments/gby6ez/dd_from_42851_match_alphabet_and_a_reminder_tldr/), [5/2-5/4](https://www.reddit.com/r/wallstreetbets/comments/gdkvqf/dd_from_5254_zillow_next_leg_down_oil_reminder/),[ 5/5-5/8](https://www.reddit.com/r/wallstreetbets/comments/gfxy98/dd_from_5558_cisco_logitech_box_and_smiledirect/)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nDISCLAIMER; I am not personally advocating for any play that I add to this list. I merely go through a couple of days of posts and find what I think is competent DD. PLAY AT YOUR OWN RISK.",
        "subreddit": "wallstreetbets",
        "title": "DD from 5/9-5/11, Okta, Cardlytics, and Guidance, TLDR and Plays included",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ghpxxn/dd_from_59511_okta_cardlytics_and_guidance_tldr/",
        "created": 1589240536.0
    },
    {
        "author": "Dbetancourt92",
        "created_utc": 1589135536,
        "id": "gh6qgk",
        "num_comments": 112,
        "num_crossposts": 0,
        "selftext": "Alright guys, just wanted to share some earnings knowledge that I’ve been using for a while now and it’s worked pretty nicely for me.\n\nSo what I do is I play earnings IV run ups with far OTM 2 months out expirations and I then I buy a put that prices in a 10% drop ten minutes before market close on ER day. \n\nFor example, BABA ER is coming up. Tomorrow at open, I’m hoping that BABA opens red. I will be buying 10 contracts of July 17 290C for 0.15 and I will leave those until ER day. Before the market closes on ER day, I will sell half of those contracts and I will be buying a few puts that price in a 10% drop that expire in two weeks. \n\nDon’t play this on stocks that have already ran up a ridiculous amount because you will most likely get IV crushed when it trades flat on ER. \n\nCurrently holding \n\nCSCO 49c July and 5/22   \n\nVTIQ October 20c\n\nMCD 195c 5/15\n\nIWM 5/15 140C (hoping for a gap up)\n\nTWLO 5/22 185C\n\nCSOD 5/29 47.5",
        "subreddit": "smallstreetbets",
        "title": "Earnings Strategy that works 70% of the time.",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/gh6qgk/earnings_strategy_that_works_70_of_the_time/",
        "created": 1589164336.0
    },
    {
        "author": "zennox_",
        "created_utc": 1588872278,
        "id": "gfax7l",
        "num_comments": 107,
        "num_crossposts": 0,
        "selftext": "One of the most undervalued technology stocks at the moment: $CSCO. Zoom has been getting the lion's share of attention, but Cisco has been seeing crazy growth in usage of both its teleconferencing (Webex) and VPN (AnyConnect) software. $CSCO has a lot of room to grow -- it is still down \\~28% of its 52W high.\n\nCisco's earning announcement is expected May 13th, and they'll beat their estimates. Here's why:\n\n* First off, Cisco consistently beats its earning estimates. Last quarter's report [delivered an EPS surprise of 3.7%.](https://www.nasdaq.com/articles/why-the-earnings-surprise-streak-could-continue-for-cisco-csco-2020-05-01)\n* In February, when East Asia was being hit the hardest, Cisco saw [22 times the amount of network traffic per second it normally gets for its Webex service from users in China](https://www.cnbc.com/2020/03/17/cisco-webex-sees-record-usage-during-coronavirus-expansion-like-zoom.html)\n* Webex saw incredible growth in March, too, with registered attendees and hosted meeting minutes more than doubling to [324 million](https://blogs.cisco.com/news/easing-the-everyday-challenges-of-sheltering-in-place) and [14 billion](https://blogs.cisco.com/news/connected-and-secure-webex-in-todays-world), respectively. If even a fraction of that growth continued in April...\n* Okta, the enterprise SSO provider, indicates that March's number of unique users of Cisco's VPN software [peaked at 238% when compared to 28 days prior.](https://www.okta.com/businesses-at-work/2020/work-from-home)\n\nAll of this leads me to believe that estimates are quite low, and we'll see a pump before and following the announcement.\n\n$CSCO 45c 5/22",
        "subreddit": "wallstreetbets",
        "title": "Cisco ($CSCO) calls will print",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gfax7l/cisco_csco_calls_will_print/",
        "created": 1588901078.0
    },
    {
        "author": "kylenusser",
        "created_utc": 1588979119,
        "id": "gg3tc5",
        "num_comments": 100,
        "num_crossposts": 0,
        "selftext": "There were 40k calls placed on CSCO today according to Bar Chart. 26k of those were at the 50 dollar strike price lol. WSB is the market. Confirmed",
        "subreddit": "wallstreetbets",
        "title": "CSCO Call Volume",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gg3tc5/csco_call_volume/",
        "created": 1589007919.0
    },
    {
        "author": "kylenusser",
        "created_utc": 1589089563,
        "id": "ggvtl3",
        "num_comments": 97,
        "num_crossposts": 0,
        "selftext": "This is my first attempt at DD, But this is one of my big gambles this week along with Cisco.\n\nTL;DR along with positions at the bottom. \n\nJD is incredibly unknown relative to Alibaba, and guarantee half this sub knew nothing about them before news of their earnings this week came out.\n\nHere are there last 3 years revenues \n\nJD annual revenue for 2019 was $82.865B, a 23.31% increase from 2018.\n\nJD annual revenue for 2018 was $67.198B, a 20.67% increase from 2017.\n\nJD annual revenue for 2017 was $55.689B, a 48.64% increase from 2016\n\n\nHere is a Quote about JD not being as affected by Corona \n\n\"But unlike Alibaba, competing Chinese e-commerce company JD.com (NASDAQ:JD) does not rely on outside logistics companies to deliver its packages. Instead, it owns a complete logistics company, JD Logistics. With JD Logistics of course prioritizing the deliveries of JD’s orders, I think that a much higher percentage of JD’s orders will be delivered within a reasonable time than those of Alibaba.\nMeanwhile, JD is using drones and robots to deliver products to areas that have been hit hard by the new virus. I did not see any evidence suggesting that Alibaba has been able to adopt a similar strategy. Given these dynamics, I’m convinced that JD’s results will be much less affected by the new virus than those of Alibaba.\" - https://investorplace.com/2020/02/jd-com-is-still-a-better-pick-than-alibaba-stock/amp/\n\nJD is also almost exclusively Chinese based. And China opened up almost two months ago now, giving them a huge head start for their upcoming earnings. \n\nTheir expected eps is -.13 per share... Their stock didn't tank with covid. Their business didn't seem to suffer relative to the market. In fact, with their own logistics and drones, they stood better than they could have hoped for. \n\nFinally, announced today was their cloud based block chain as a service option. \nhttps://jdcorporateblog.com/jd-launches-cloud-based-blockchain-as-a-service-platform/\n\nI'm not entirely sure how the last part will affect them, if at all going into Friday's earnings, but further ease and integration for their services can't hurt, imo.\n\nAgain buy at your own risk, but good luck and godspeed\n\nTL;DR JD stock is undervalued and they aren't well known yet as they are still seen second fiddle to baba.\n\nPositions:\nCSCO 5/29 50C\nJD 5/15 50C (Plan to sell before earnings) \nJD 6/19 60C (Plan to hold through earnings)",
        "subreddit": "wallstreetbets",
        "title": "JD.com Earnings Play",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ggvtl3/jdcom_earnings_play/",
        "created": 1589118363.0
    },
    {
        "author": "jaguarpawww",
        "created_utc": 1589205094,
        "id": "ghnwiq",
        "num_comments": 88,
        "num_crossposts": 0,
        "selftext": " Happy Monday fellow retards.\n\nAs always, inverse what i'm posting below - this is merely just for a discussion. What else are you playing?\n\nWix 170c exp 5/15\n\nSDC $9c 5/15\n\nCSCO 45c 5/15\n\nDKING $30c 5/15\n\nTTWO 135c 5/22\n\nHD 245c 5/22\n\nTGT 120c 5/22\n\nBABA $220c 5/22\n\nOKTA 200c 5/29\n\nOH and i'm still sitting with a LYFT PUT expriing 5/15 that i got my hands fried on",
        "subreddit": "wallstreetbets",
        "title": "Earnings plays for week 5/11 and 5/18",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ghnwiq/earnings_plays_for_week_511_and_518/",
        "created": 1589233894.0
    },
    {
        "author": "fgh125312",
        "created_utc": 1588973411,
        "id": "gg24r2",
        "num_comments": 74,
        "num_crossposts": 0,
        "selftext": "From the weekend thread before its lost for all you zoomers who are describing this tech giant as a meme stock\n\nFundamentals\n\n· Diversified hardware/software company, provide switches/enterprise networking hardware, VPN, cyber security\n\n· Aim has been to pivot away from hardware sales (56%) toward more of a software play including a large focus on cyber security\n\n· Previous ER recorded a 4% decrease in Non-GAAP operating margins\n\n·  Circa USD 9 bln net cash position/rock solid balance sheet – big enough to provide USD 2.5 bln financing for large hardware purchases until 2021 to ensure companies can still upgrade despite uncertainty (from CEO)\n\n· Owns Webex (recording 14 billion meeting minutes in March vs 6 in January) \n\n·  COVID-19 potential catalysts from an increase in work from home (VPN/Cloud), WebEx adoption and also possible upgrades of data centers/Cisco Meraki hardware. Also active in the tele-health sector\n\n·  Increase in web traffic (remember Netflix reducing video quality?) is another potential catalyst for their hardware segment as tech companies  could be panic adding capacity\n\n·  CEO mentioned they had been working around the clock on video interview with CNBC, to ensure businesses stay functioning through COVID-19\n\n·  Recent conference call on their investor relations website outlining  their remote work portfolio seems to have been slept on also price wise\n\nTechnical\n\n· Stock traded in 50’s, for much of 2019 then was slapped down by trade war headlines\n\n· Dumped last 3 ER’s , trade war related fears – expectations for upcoming ER are low\n\n· Previous ER’s have shown decent jumps (check 2018)\n\n· Hasn’t recovered like competing networking stocks (Juniper Networks, Arista networks)\n\n· Option volatility has also remained quite low throughout March/April – options pretty much imply no movement\n\n· Bottomed and bounced from the upper 30’s to low 40’s and has been stuck in a range since\n\n·  Stock has tried to break out several times in April, random dumps due to macro related factors (mid April – negative Oil fears, 29th - 1st May  dump from tech sell-off/supposed trade deal collapsing tweet)\n\nPossible risk factors mostly come from big IT spending being potentially put on hold due to companies having cash flow issues/supply chain issues  delaying hardware production (as stated by other networking hardware markers) – biggest catalysts for a potential dump post ER. Equally could  surprise to upside given all the coronavirus related catalysts and low expectations\n\nDisclaimer: I own 50c LEAPs, building a position since March, great company fundamentals, survived multiple crises (tech bubble, 2008) and has the highest dividend yield in the NASDAQ – how this has been slept on since March/April I have no idea. As always, do your own DD",
        "subreddit": "wallstreetbets",
        "title": "CSCO DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gg24r2/csco_dd/",
        "created": 1589002211.0
    },
    {
        "author": "senpaistarkiller",
        "created_utc": 1589318217,
        "id": "gikmdd",
        "num_comments": 45,
        "num_crossposts": 0,
        "selftext": "I'm an 18 year old college student, I started investing with $500 in March and made 10% by investing in stocks in a month. I then decided to get into options and doubled my portfolio to around a $1000 with BA calls and TWTR calls, but by dumb luck I'm guessing now. Then I just spiraled downwards. I bought and sold AMD, ATVI, GRUB calls for losses, only to have them bounce back significantly over the next few days. I bought a CSOD call and watched the value plummet, a SPY put and watched it skyrocket...I began to believe I was unlucky and decided to chase my losses. I'm currently sitting at a good $80, with my CSCO call probably bringing that down further tomorrow. I'm so exasperated, especially since I told myself I was going to quit multiple times while I was in the green. The worst part is that I feel like transferring another $500 from my bank account right now and chasing my losses. I don't know what to do, I'm really stressed and have developed a habit of checking my portfolio every five minutes. That $500 represented 20% of my net worth and I'm not sure I've learned much except that I suck at this.",
        "subreddit": "options",
        "title": "Lost my entire portfolio, regret",
        "url": "https://www.reddit.com/r/options/comments/gikmdd/lost_my_entire_portfolio_regret/",
        "created": 1589347017.0
    },
    {
        "author": "zero_gains",
        "created_utc": 1589219266,
        "id": "ghsgpd",
        "num_comments": 39,
        "num_crossposts": 0,
        "selftext": "Hey guys, \n\nI’m really trying to wrap my head around Delta and benefits I should I be looking for when purchasing an option. For Instance let’s say:\n\nSpy is at 292, premium 5.00 with .54 Delta\nCSCO is at 43 premium at $1 with .54 Delta\n\nIf the stock goes up $1 then the options would see a .54 increase in premium. \nWould buying 5 CSCO vs 1 spy option for the same total cost be the better trade since I expect both to go up $1 but with CSCO I’m getting 5(.54)? Considering I am bullish short term on both. \n\nHypothetically speaking",
        "subreddit": "options",
        "title": "Delta Vs. Premium Price Vs. Stock Price",
        "url": "https://www.reddit.com/r/options/comments/ghsgpd/delta_vs_premium_price_vs_stock_price/",
        "created": 1589248066.0
    },
    {
        "author": "11_hundred",
        "created_utc": 1588955775,
        "id": "gfwgv0",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "After my turtle beach tendies took a plastic straw to the nose, trying to claw my way back with CSCO earnings",
        "url": "https://imgur.com/qv5svfM",
        "created": 1588984575.0
    },
    {
        "author": "ScallyWag-Idiot",
        "created_utc": 1588888468,
        "id": "gfg47b",
        "num_comments": 37,
        "num_crossposts": 1,
        "selftext": "Amid the coronavirus bear market and imminent global recession, Cisco Systems (CSCO) remains one of the top U.S. tech companies in terms of cash on its balance sheet. As a result, Cisco stock provides an attractive dividend.     \n\n   \n\nCorporate spending on information technology was expected to plunge due to COVID - BUT IT HASN'T.\n\nThere's a long-term view. Cisco could go shopping once the dust settles and make the kind of big, transformational acquisition that some have been looking for.   \n   \n\n\nIn the January quarter, Cisco's fiscal second quarter, the company paid a cash dividend of $1.5 billion and bought back $870 million of its own shares. Cisco stock had some $27 billion in cash and equivalents. In 2019, Cisco reduced debt by some $5 billion. Heading into the April quarter, Cisco had about $12 billion remaining in a stock repurchase program.     \n    \n\n\nIn its glory days from a 1990 initial public offering through early 2000, Cisco thrived as a major supplier of the hardware to build internet networks, both to telecom firms and large companies outside that sector. Cisco stock soared more than 100,000% in that period, before the dot.com bubble burst.\n     \n     \n\nMore recently, after a breakout in October 2017, Cisco stock gained 70% through mid-July 2019.      \n    \n\n\n\nBut CSCO stock swooned in the latter half of 2019. It plunged like most tech stocks in the coronavirus-driven market correction. The upper echelon tech stocks are providing strong bounce backs to the rest of the market. CSCO should be no different, infact - with upside for more growth than the company has seen in the last 10 years. They're more diverse in cloud computing services, software, and equipment.   \n   \n\n  \n\n\nThe tech industry icon is shifting away from its core business of selling network switches and routers. With acquisitions, Cisco has aimed to increase revenue from software and services.     \n\n     \n   \n\nBefore the coronavirus emergency, management has stated that 30% of all revenue would come from software in fiscal 2020, up from 22% in 2017.      \n     \nTL;DR  \n05/29 50C   \n05/15 44C",
        "subreddit": "wallstreetbets",
        "title": "CISCO SYSTEMS (CSCO)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gfg47b/cisco_systems_csco/",
        "created": 1588917268.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1589054815,
        "id": "ggmm18",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "Good Saturday afternoon to all of you here on r/smallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning May 11th, 2020.\n\n# **Stocks are expected to trade the economy’s reopening in the week ahead  - [(Source)](https://www.cnbc.com/2020/05/08/stocks-expected-to-trade-the-economys-reopening-in-the-week-ahead.html)**\n*****\n&gt; Investors will watch the economy’s reopening progress, as well as a series of economic reports in the coming week that will provide a look at the consumer during April as the economy shed 20.5 million jobs.\n*****\n&gt; Fed Chairman Jerome Powell speaks on a webcast held by the Peterson Institute on Wednesday at 9 a.m., and he will be watched closely for any new insights on the economy or Fed programs.\n*****\n&gt; There are just a few earnings releases ahead, but there will be a barrage of economic reports, including consumer and producer inflation, consumer sentiment and most importantly retail sales on Friday. \n*****\n&gt; # Stocks versus bonds\n&gt; Stocks were higher in the past week, even as some bond yields touched record lows. Yields move opposite price, and bonds usually move opposite stocks.\n*****\n&gt; “The stock market is trading the reopening, and the bond market is doubting the vibrant pace of an economic recovery upon the reopening,” said Peter Boockvar, chief investment strategist at Bleakley Advisory Group.\n*****\n&gt; Small cap stocks and tech led the way higher in the past week. The Nasdaq jumped 6% in a week, where it wiped out its losses for the year and turned positive. The small cap Russell 2000 was up 5.5%.\n*****\n&gt; The S&amp;P 500 was up 3.5% for the week to 2,929, with tech up 6.6% and consumer discretionary stocks up 4.4%.\n*****\n&gt; The bond market and stock market have both responded to the Fed’s programs that put more liquidity into the financial system, with bond rates falling and stocks rising sharply.\n*****\n&gt; “Stocks just seem to be disconnected from everything else,” said Michael Schumacher, director rates at Wells Fargo. Some bond yields, like the benchmark 10-year yield, which impacts many types of loans, were slightly higher ahead of the Treasury’s record $96 billion in auctions in the coming week. But the 2-year, at a new low of 0.10%, was trading on concerns about the economy.\n*****\n&gt; Market pros will look for Powell to comment on market speculation that the Fed could take its benchmark rate to a negative yield. Fed officials have said they have no interest in negative rates, which are being used by central banks in Europe and Japan. But for the first time this past week, traders drove futures on fed funds to show slightly negative rates in contracts starting in  November. \n*****\n&gt; “He could quash negative yields if he wants to,” said Schumacher. “The Fed has consistently argued against negative policy rates. Now there’s a chance Powell could comment on this. He’s commented about it, several times in the last six months.”\n*****\n&gt; Much of the gains in the stock market have been driven by big technology companies with operations that haven’t been deeply affected by the coronavirus.\n*****\n&gt; “Tech was the shutdown trade and small caps are the reopening,” said Boockvar, noting small caps are domestically focused and are sensitive to the back-to-work trade.\n*****\n&gt; Apple joined the reopening trade Friday, when its stock rose after it announced it would reopen some of its U.S. stores.\n*****\n&gt; “The stock market has sort of a hall pass as the months proceed and things reopen. At some point, that hall pass is going to expire” and the reopenings will have to result in rebound, Boockvar said.\n*****\n&gt; Investors have been watching for anything that suggests state reopenings are stimulating activity.\n*****\n&gt; Retail sales Friday will be a big focus and are expected to show sharp decline of 11%, but more like 6% when automobiles and gasoline are removed, he said.\n*****\n&gt; In the oil market in the past week, crude was up as much as 24% as traders reacted to information that showed gasoline demand picking up around the U.S. States have been opening up at different speeds, and California was the latest to reopen some activity Friday.\n*****\n&gt; “Some of the reason the market is up because the virus curve is bending, the economic data is showing signs of a bounce. It hasn’t here yet but you know it’s coming. It’s a global phenomenon,” said James Paulsen, chief investment strategist at Leuthold Group. He noted that China’s export numbers unexpectedly rose in April, for the first time this year.\n*****\n&gt; Paulsen said he expects stocks to remain in an upswing.\n*****\n&gt; “There’s a lot of value out there if you’re outside the high growth in the S&amp;P 500,” he said, “When fear is as high as it is, that’s typically been a great time to lean toward risk assets. Gold is at a 50-year high relative to commodity prices. People are buying bonds at virtually zero yield. To me, there’s fairly defensive behavior and scared attitudes rather than the other way around.”\n*****\n&gt; Strategists say the market could retest its March lows, but a good number say the bottom has been set.\n*****\n&gt; “I’m getting more confident that we’ve seen the lows, and we’re starting a recovery in the stock market, but I think the volatility is going to stay there, and there will be challenges. I think the general direction is up rather than down at the moment,” said Paulsen.\n*****\n&gt; Paulsen said the fear of reinfection remains, should there be a new wave of the virus. “There’s a lot of terrible things that could happen and be terrible for the stock market,” he said.  “A headline could create an up or down week and then go away again. ” \n*****\n&gt; “I think the rise in the stock market is really more about a lack of sellers. But I don’t think there’s a lot of buyers. If more people believed this is winding down ... there could be a  lot more money that’s going to come back into equities, to some extent,” Paulsen said.\n*****\n&gt; Market pros are keeping an eye on yields, ahead of the government’s record sized $96 billion in auctions in the coming week for 3- and 10-year notes and 30-year bonds.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/4HGQyi7.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/2lmIrzt.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/eEihRrS.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/DR6SfIc.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/fXS8KN3.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/8V6CfZy.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/VHY2OWA.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/G3fxr2S.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/sx0HDsl.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/udABitD.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/zujuIT6.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/PxZA6w2.png))**\n\n*****\n\n# Market Too Far Ahead of Economy?\n\n&gt; Another 3.2 million Americans filed for unemployment last week bringing the seven-week total to 33.5 million. This is an unprecedented streak for an unprecedented time, and it highlights the significant impact that the coronavirus pandemic shutdown is having. One small positive aspect of this week’s number is the fact that it is a decline from the previous reading which lends further support to the possibility that the market’s lows of March could be the bottom and that bottom could hold based upon the historical correlation of jobless claims and past market bottoms that we covered in a recent post.\n\n&gt; However, the seven-week total is an unsettling number that suggests the road back to “normal” could be longer than the market appears to currently expect. It is getting increasingly more challenging to envision 33.5 million Americans returning to work as quickly as they left. And with NASDAQ returning to positive for the year in today’s trading it may be time to wonder if the market’s brisk recovery is possibly too far ahead of the actual economy.\n\n&gt; One early sign that the rally may be getting well ahead of the economy can be seen in the following chart of cumulative daily advance/decline lines for NYSE, NASDAQ, Russell 2000 and the S&amp;P 500. The recent trend since the end of April has been lower while the indexes have managed to move modestly higher. This suggests that fewer and fewer stocks are still participating in the rally. Historically when this persisted the major indexes frequently failed to move meaningfully higher and often turned lower.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/1ff6838e7d4a8493b62fad589a840223/2faca2fd2c71ed13-d0/s500x750/93ab9274fcf5f85882ed91b1eeb70ec5bcc54b88.jpg))**\n\n*****\n\n# Market Gains in Celebration of Mother’s Day\n\n&gt; With just a few days remaining to Mother’s Day, today’s post is also a reminder. Over the last twenty-five years on the Friday before Mother’s Day the Dow Jones Industrials have gained ground seventeen times. On the Monday after, DJIA has advanced seventeen times over the same time period. Average gain on Friday has been 0.20% and a respectable 0.36% on Monday. However, in five of the last eight years, the Monday following Mother’s Day has been down. Last year, DJIA suffered its worst post Mother’s Day loss, off 2.38%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/91ef736cb31d1b665b1933aa28dc680c/577c38f8de114a58-46/s500x750/e29f63d6af8b2ae4a172b03a5a3ba2af28fe345b.jpg))**\n\n*****\n\n# Group Breadth Improving From a Record Low Base\n\n&gt; After a disastrous late February and early March period, breadth among S&amp;P 500 groups cratered to the point where not a single one of the S&amp;P 500's 24 industry groups were above their 50-day moving average. Before the most recent occurrence, that's something we hadn't seen since early 2019.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/05/050820-Groups-above-520DMA.png))**\n\n&gt; While there have been numerous instances in the last few years where every industry group was below its 50-DMA, the most recent period was unique in that it lasted more than four full weeks (21 trading days). Going all the way back to 1990, there has only been one other period where every industry group was below its 50-day moving average for as long as it just was. That was during the depths of the financial crisis in the 21-day stretch ending 11/3/08. It took a bear market of more than a year to finally reach that level back then, but this time around, it took less than two months. Besides that period, there has never been another four-week stretch where every industry group was below its 50-day moving average.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/05/050820-Groups-above-520DMA-Streaks.png))**\n\n&gt; Overall breadth readings have already improved in terms of industry groups above their 50-day moving averages, but at this point, the number of industry groups with rising 50-day moving averages remains extremely depressed at just 8.3% as of midday Friday. Similar to the streak above, during the most recent period every group had a declining 50-day moving average for 26 straight days, and that was also the longest such streak since 2008. Granted, this is a lagging indicator and should improve the longer equities remain around current levels, but it once again serves as a reminder of how steep the declines actually were.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/05/050820-Groups-rising-50DMA.png))**\n\n*****\n\n# Sector Relative Strength\n\n&gt; Although the S&amp;P 500 (SPY) is down around 1% over the past week, there are two sectors that have made a push higher: Communication Services (XLC) and Technology (XLK). While these moves have left both sectors in overbought territory, a snapshot from our Trend Analyzer tool shows that Tech's rally has brought it into the green YTD.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/05/050720-TA.png))**\n\n&gt; Technology's outperformance is nothing new. As shown in the relative strength charts from our Sector Snapshot below, Technology has been a serial outperformer versus the S&amp;P 500 for pretty much all of the past year (a rising line indicates outperformance versus the S&amp;P 500 and vice versa). As for the other sectors, Health Care has also seen some drastic outperformance over the past few months. Communication Services and Consumer Discretionary have also seen some outperformance in recent weeks. Contrary to Technology, Energy, Financials, Industrials, and Materials have all been consistent underperformers over the past year.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/05/RS.png))**\n\n*****\n\n# Performance on Earnings Days\n\n&gt; Roughly 1,300 companies have reported since the start of earnings season on 4/13 when the first of the big banks kicked things off. For those stocks that have beaten EPS estimates, the reaction has not been as strong as past years with just a 9 bps difference between this earnings season and all seasons since 2001. On the other hand, those that have missed EPS have not been as badly punished dropping 0.86% compared to an average drop of 3.56% since 2001. For all stocks, the average gain of 0.79% this earnings season is much stronger than the 0.06% gain of all other seasons.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/05/Earn-React-4.png))**\n\n&gt; With stock price reactions being generally positive this season, most of the gain has come at the open. Stocks reporting earnings have gapped up an average of 1.24%. But intraday they have tended to sell-off, averaging a 0.44% decline from open to close.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/05/Earn-React-2.png))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$UAA** \n&gt; * **$AMAT** \n&gt; * **$CLF** \n&gt; * **$MAR** \n&gt; * **$CSCO** \n&gt; * **$CPE** \n&gt; * **$JD** \n&gt; * **$INO** \n&gt; * **$KOS** \n&gt; * **$ON** \n&gt; * **$TLRY** \n&gt; * **$CAH** \n&gt; * **$ACB** \n&gt; * **$AN** \n&gt; * **$WIX** \n&gt; * **$SDC** \n&gt; * **$GBDC** \n&gt; * **$NCLH** \n&gt; * **$DUK** \n&gt; * **$NBEV**\n&gt; * **$ICPT** \n&gt; * **$SPG** \n&gt; * **$CYBR** \n&gt; * **$DDOG** \n&gt; * **$CEVA** \n&gt; * **$MYL** \n&gt; * **$CHH** \n&gt; * **$HMC** \n&gt; * **$ET** \n&gt; * **$LOGI** \n&gt; * **$OAS** \n&gt; * **$NVAX** \n&gt; * **$ZBH** \n&gt; * **$PRTK** \n&gt; * **$ABUS** \n&gt; * **$GWPH** \n&gt; * **$VCTR** \n&gt; * **$SALT** \n&gt; * **$WVE** \n&gt; * **$GNC** \n&gt; * **$AMRX** \n&gt; * **$ETR** \n&gt; * **$NOG**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/sx0HDsl.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/SeXyhoI.png))**\n###### **([CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES BEFORE MONDAY'S OPEN!](https://i.imgur.com/dp54bLF.jpg))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 5.11.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/NOhb3L5.png))\n\n\n&gt; # ***Monday 5.11.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/GVcHqQw.png))\n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/II5ukMy.png))\n\n\n*****\n\n&gt; # ***Tuesday 5.12.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/1RbrpI3.png))\n\n&gt; # ***Tuesday 5.12.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/FrASNRG.png))\n\n*****\n\n&gt; # ***Wednesday 5.13.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/tZs8hms.png))\n\n&gt; # ***Wednesday 5.13.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/GwtxPwV.png))\n\n*****\n\n&gt; # ***Thursday 5.14.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/jUwjUuj.png))\n\n&gt; # ***Thursday 5.14.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/s2yx68v.png))\n\n*****\n\n&gt; # ***Friday 5.15.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ofgb6gF.png))\n\n*****\n\n&gt; # ***Friday 5.15.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ofgb6gF.png))\nNONE.\n\n*****\n\n# Under Armour, Inc. $9.98\n&gt; **Under Armour, Inc. (UAA)** is confirmed to report earnings at approximately 6:55 AM ET on Monday, May 11, 2020. The consensus estimate is for a loss of $0.19 per share on revenue of $961.78 million and the Earnings Whisper ® number is ($0.18) per share. Investor sentiment going into the company's earnings release has 4% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 480.00% with revenue decreasing by 20.17%. Short interest has decreased by 29.1% since the company's last earnings release while the stock has drifted lower by 41.6% from its open following the earnings release to be 42.3% below its 200 day moving average of $17.29. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, May 7, 2020 there was some notable buying of 7,725 contracts of the $9.50 put expiring on Friday, May 15, 2020. Option traders are pricing in a 14.6% move on earnings and the stock has averaged a 14.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=UAA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Applied Materials, Inc. $53.81\n&gt; **Applied Materials, Inc. (AMAT)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, May 14, 2020. The consensus earnings estimate is $0.92 per share on revenue of $4.25 billion and the Earnings Whisper ® number is $0.96 per share. Investor sentiment going into the company's earnings release has 70% expecting an earnings beat The company's guidance was for earnings of $0.98 to $1.10 per share. Consensus estimates are for year-over-year earnings growth of 31.43% with revenue increasing by 20.09%. Short interest has increased by 26.9% since the company's last earnings release while the stock has drifted lower by 19.4% from its open following the earnings release to be 0.1% above its 200 day moving average of $53.76. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, April 28, 2020 there was some notable buying of 1,768 contracts of the $72.50 call expiring on Friday, October 16, 2020. Option traders are pricing in a 7.4% move on earnings and the stock has averaged a 3.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AMAT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Cleveland-Cliffs Inc $4.82\n&gt; **Cleveland-Cliffs Inc (CLF)** is confirmed to report earnings at approximately 7:00 AM ET on Monday, May 11, 2020. The consensus estimate is for a loss of $0.18 per share on revenue of $367.81 million and the Earnings Whisper ® number is ($0.23) per share. Investor sentiment going into the company's earnings release has 41% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 125.00% with revenue increasing by 134.27%. Short interest has decreased by 1.1% since the company's last earnings release while the stock has drifted lower by 34.4% from its open following the earnings release to be 30.0% below its 200 day moving average of $6.89. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, May 8, 2020 there was some notable buying of 3,060 contracts of the $4.00 put and 2,389 contracts of the $6.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 13.2% move on earnings and the stock has averaged a 4.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CLF&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Marriott International Inc. $87.17\n&gt; **Marriott International Inc. (MAR)** is confirmed to report earnings at approximately 6:15 AM ET on Monday, May 11, 2020. The consensus earnings estimate is $0.90 per share on revenue of $4.25 billion and the Earnings Whisper ® number is $0.83 per share. Investor sentiment going into the company's earnings release has 29% expecting an earnings miss The company's guidance was for earnings of $1.47 to $1.50 per share. Consensus estimates are for earnings to decline year-over-year by 36.17% with revenue decreasing by 15.20%. Short interest has increased by 116.6% since the company's last earnings release while the stock has drifted lower by 25.5% from its open following the earnings release to be 28.7% below its 200 day moving average of $122.26. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, May 1, 2020 there was some notable buying of 2,686 contracts of the $70.00 put expiring on Friday, May 15, 2020. Option traders are pricing in a 8.6% move on earnings and the stock has averaged a 2.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MAR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Cisco Systems, Inc. $42.99\n&gt; **Cisco Systems, Inc. (CSCO)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, May 13, 2020. The consensus earnings estimate is $0.71 per share on revenue of $11.88 billion and the Earnings Whisper ® number is $0.73 per share. Investor sentiment going into the company's earnings release has 58% expecting an earnings beat The company's guidance was for earnings of $0.79 to $0.81 per share. Consensus estimates are for earnings to decline year-over-year by 10.13% with revenue decreasing by 8.32%. Short interest has decreased by 8.2% since the company's last earnings release while the stock has drifted lower by 8.8% from its open following the earnings release to be 5.9% below its 200 day moving average of $45.70. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, May 8, 2020 there was some notable buying of 26,151 contracts of the $50.00 call expiring on Friday, May 29, 2020. Option traders are pricing in a 6.4% move on earnings and the stock has averaged a 5.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CSCO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Callon Petroleum Company $0.81\n&gt; **Callon Petroleum Company (CPE)** is confirmed to report earnings at approximately 5:00 AM ET on Monday, May 11, 2020. The consensus earnings estimate is $0.15 per share on revenue of $344.75 million. Investor sentiment going into the company's earnings release has 48% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 6.25% with revenue increasing by 125.26%. Short interest has decreased by 3.4% since the company's last earnings release while the stock has drifted lower by 64.0% from its open following the earnings release to be 76.5% below its 200 day moving average of $3.45. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, May 8, 2020 there was some notable buying of 666 contracts of the $3.00 put expiring on Friday, June 19, 2020. The stock has averaged a 7.2% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CPE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Kosmos Energy Ltd. $1.49\n&gt; **Kosmos Energy Ltd. (KOS)** is confirmed to report earnings at approximately 2:00 AM ET on Monday, May 11, 2020. The consensus estimate is for a loss of $0.14 per share on revenue of $234.50 million and the Earnings Whisper ® number is ($0.17) per share. Investor sentiment going into the company's earnings release has 14% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 133.33% with revenue decreasing by 20.99%. Short interest has increased by 38.8% since the company's last earnings release while the stock has drifted lower by 68.0% from its open following the earnings release to be 69.3% below its 200 day moving average of $4.85. Overall earnings estimates have been revised lower since the company's last earnings release. The stock has averaged a 7.5% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=KOS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# JD.com, Inc. $46.78\n&gt; **JD.com, Inc. (JD)** is confirmed to report earnings at approximately 5:00 AM ET on Friday, May 15, 2020. The consensus earnings estimate is $0.11 per share on revenue of $19.17 billion and the Earnings Whisper ® number is $0.18 per share. Investor sentiment going into the company's earnings release has 71% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 59.26% with revenue increasing by 6.25%. Short interest has decreased by 18.0% since the company's last earnings release while the stock has drifted higher by 13.0% from its open following the earnings release to be 31.7% above its 200 day moving average of $35.52. On Friday, May 1, 2020 there was some notable buying of 20,424 contracts of the $41.50 call expiring on Friday, May 22, 2020. Option traders are pricing in a 8.2% move on earnings and the stock has averaged a 7.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=JD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# ON Semiconductor Corporation $17.12\n&gt; **ON Semiconductor Corporation (ON)** is confirmed to report earnings at approximately 6:00 AM ET on Monday, May 11, 2020. The consensus earnings estimate is $0.15 per share on revenue of $1.30 billion and the Earnings Whisper ® number is $0.15 per share. Investor sentiment going into the company's earnings release has 43% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 65.12% with revenue decreasing by 6.25%. Short interest has decreased by 8.4% since the company's last earnings release while the stock has drifted lower by 20.2% from its open following the earnings release to be 10.6% below its 200 day moving average of $19.14. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, May 8, 2020 there was some notable buying of 14,949 contracts of the $18.00 call and 12,073 contracts of the $15.00 put expiring on Friday, May 15, 2020. Option traders are pricing in a 12.6% move on earnings and the stock has averaged a 9.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ON&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Inovio Biomedical Corp $10.86\n&gt; **Inovio Biomedical Corp (INO)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, May 11, 2020. The consensus estimate is for a loss of $0.23 per share on revenue of $1.55 million and the Earnings Whisper ® number is ($0.25) per share. Investor sentiment going into the company's earnings release has 52% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 23.33% with revenue decreasing by 45.23%. Short interest has increased by 28.3% since the company's last earnings release while the stock has drifted higher by 35.9% from its open following the earnings release to be 153.3% above its 200 day moving average of $4.29. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, May 8, 2020 there was some notable buying of 25,511 contracts of the $13.50 call expiring on Friday, May 15, 2020. Option traders are pricing in a 24.0% move on earnings and the stock has averaged a 6.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=INO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/smallstreetbets.",
        "subreddit": "smallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning May 11th, 2020",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/ggmm18/wall_street_week_ahead_for_the_trading_week/",
        "created": 1589083615.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1589054760,
        "id": "ggmle1",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "Good Saturday afternoon to all of you here on r/wallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning May 11th, 2020.\n\n# **Stocks are expected to trade the economy’s reopening in the week ahead  - [(Source)](https://www.cnbc.com/2020/05/08/stocks-expected-to-trade-the-economys-reopening-in-the-week-ahead.html)**\n*****\n&gt; Investors will watch the economy’s reopening progress, as well as a series of economic reports in the coming week that will provide a look at the consumer during April as the economy shed 20.5 million jobs.\n*****\n&gt; Fed Chairman Jerome Powell speaks on a webcast held by the Peterson Institute on Wednesday at 9 a.m., and he will be watched closely for any new insights on the economy or Fed programs.\n*****\n&gt; There are just a few earnings releases ahead, but there will be a barrage of economic reports, including consumer and producer inflation, consumer sentiment and most importantly retail sales on Friday. \n*****\n&gt; # Stocks versus bonds\n&gt; Stocks were higher in the past week, even as some bond yields touched record lows. Yields move opposite price, and bonds usually move opposite stocks.\n*****\n&gt; “The stock market is trading the reopening, and the bond market is doubting the vibrant pace of an economic recovery upon the reopening,” said Peter Boockvar, chief investment strategist at Bleakley Advisory Group.\n*****\n&gt; Small cap stocks and tech led the way higher in the past week. The Nasdaq jumped 6% in a week, where it wiped out its losses for the year and turned positive. The small cap Russell 2000 was up 5.5%.\n*****\n&gt; The S&amp;P 500 was up 3.5% for the week to 2,929, with tech up 6.6% and consumer discretionary stocks up 4.4%.\n*****\n&gt; The bond market and stock market have both responded to the Fed’s programs that put more liquidity into the financial system, with bond rates falling and stocks rising sharply.\n*****\n&gt; “Stocks just seem to be disconnected from everything else,” said Michael Schumacher, director rates at Wells Fargo. Some bond yields, like the benchmark 10-year yield, which impacts many types of loans, were slightly higher ahead of the Treasury’s record $96 billion in auctions in the coming week. But the 2-year, at a new low of 0.10%, was trading on concerns about the economy.\n*****\n&gt; Market pros will look for Powell to comment on market speculation that the Fed could take its benchmark rate to a negative yield. Fed officials have said they have no interest in negative rates, which are being used by central banks in Europe and Japan. But for the first time this past week, traders drove futures on fed funds to show slightly negative rates in contracts starting in  November. \n*****\n&gt; “He could quash negative yields if he wants to,” said Schumacher. “The Fed has consistently argued against negative policy rates. Now there’s a chance Powell could comment on this. He’s commented about it, several times in the last six months.”\n*****\n&gt; Much of the gains in the stock market have been driven by big technology companies with operations that haven’t been deeply affected by the coronavirus.\n*****\n&gt; “Tech was the shutdown trade and small caps are the reopening,” said Boockvar, noting small caps are domestically focused and are sensitive to the back-to-work trade.\n*****\n&gt; Apple joined the reopening trade Friday, when its stock rose after it announced it would reopen some of its U.S. stores.\n*****\n&gt; “The stock market has sort of a hall pass as the months proceed and things reopen. At some point, that hall pass is going to expire” and the reopenings will have to result in rebound, Boockvar said.\n*****\n&gt; Investors have been watching for anything that suggests state reopenings are stimulating activity.\n*****\n&gt; Retail sales Friday will be a big focus and are expected to show sharp decline of 11%, but more like 6% when automobiles and gasoline are removed, he said.\n*****\n&gt; In the oil market in the past week, crude was up as much as 24% as traders reacted to information that showed gasoline demand picking up around the U.S. States have been opening up at different speeds, and California was the latest to reopen some activity Friday.\n*****\n&gt; “Some of the reason the market is up because the virus curve is bending, the economic data is showing signs of a bounce. It hasn’t here yet but you know it’s coming. It’s a global phenomenon,” said James Paulsen, chief investment strategist at Leuthold Group. He noted that China’s export numbers unexpectedly rose in April, for the first time this year.\n*****\n&gt; Paulsen said he expects stocks to remain in an upswing.\n*****\n&gt; “There’s a lot of value out there if you’re outside the high growth in the S&amp;P 500,” he said, “When fear is as high as it is, that’s typically been a great time to lean toward risk assets. Gold is at a 50-year high relative to commodity prices. People are buying bonds at virtually zero yield. To me, there’s fairly defensive behavior and scared attitudes rather than the other way around.”\n*****\n&gt; Strategists say the market could retest its March lows, but a good number say the bottom has been set.\n*****\n&gt; “I’m getting more confident that we’ve seen the lows, and we’re starting a recovery in the stock market, but I think the volatility is going to stay there, and there will be challenges. I think the general direction is up rather than down at the moment,” said Paulsen.\n*****\n&gt; Paulsen said the fear of reinfection remains, should there be a new wave of the virus. “There’s a lot of terrible things that could happen and be terrible for the stock market,” he said.  “A headline could create an up or down week and then go away again. ” \n*****\n&gt; “I think the rise in the stock market is really more about a lack of sellers. But I don’t think there’s a lot of buyers. If more people believed this is winding down ... there could be a  lot more money that’s going to come back into equities, to some extent,” Paulsen said.\n*****\n&gt; Market pros are keeping an eye on yields, ahead of the government’s record sized $96 billion in auctions in the coming week for 3- and 10-year notes and 30-year bonds.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/4HGQyi7.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/2lmIrzt.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/eEihRrS.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/DR6SfIc.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/fXS8KN3.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/8V6CfZy.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/VHY2OWA.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/G3fxr2S.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/sx0HDsl.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/udABitD.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/zujuIT6.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/PxZA6w2.png))**\n\n*****\n\n# Market Too Far Ahead of Economy?\n\n&gt; Another 3.2 million Americans filed for unemployment last week bringing the seven-week total to 33.5 million. This is an unprecedented streak for an unprecedented time, and it highlights the significant impact that the coronavirus pandemic shutdown is having. One small positive aspect of this week’s number is the fact that it is a decline from the previous reading which lends further support to the possibility that the market’s lows of March could be the bottom and that bottom could hold based upon the historical correlation of jobless claims and past market bottoms that we covered in a recent post.\n\n&gt; However, the seven-week total is an unsettling number that suggests the road back to “normal” could be longer than the market appears to currently expect. It is getting increasingly more challenging to envision 33.5 million Americans returning to work as quickly as they left. And with NASDAQ returning to positive for the year in today’s trading it may be time to wonder if the market’s brisk recovery is possibly too far ahead of the actual economy.\n\n&gt; One early sign that the rally may be getting well ahead of the economy can be seen in the following chart of cumulative daily advance/decline lines for NYSE, NASDAQ, Russell 2000 and the S&amp;P 500. The recent trend since the end of April has been lower while the indexes have managed to move modestly higher. This suggests that fewer and fewer stocks are still participating in the rally. Historically when this persisted the major indexes frequently failed to move meaningfully higher and often turned lower.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/1ff6838e7d4a8493b62fad589a840223/2faca2fd2c71ed13-d0/s500x750/93ab9274fcf5f85882ed91b1eeb70ec5bcc54b88.jpg))**\n\n*****\n\n# Market Gains in Celebration of Mother’s Day\n\n&gt; With just a few days remaining to Mother’s Day, today’s post is also a reminder. Over the last twenty-five years on the Friday before Mother’s Day the Dow Jones Industrials have gained ground seventeen times. On the Monday after, DJIA has advanced seventeen times over the same time period. Average gain on Friday has been 0.20% and a respectable 0.36% on Monday. However, in five of the last eight years, the Monday following Mother’s Day has been down. Last year, DJIA suffered its worst post Mother’s Day loss, off 2.38%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/91ef736cb31d1b665b1933aa28dc680c/577c38f8de114a58-46/s500x750/e29f63d6af8b2ae4a172b03a5a3ba2af28fe345b.jpg))**\n\n*****\n\n# Group Breadth Improving From a Record Low Base\n\n&gt; After a disastrous late February and early March period, breadth among S&amp;P 500 groups cratered to the point where not a single one of the S&amp;P 500's 24 industry groups were above their 50-day moving average. Before the most recent occurrence, that's something we hadn't seen since early 2019.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/05/050820-Groups-above-520DMA.png))**\n\n&gt; While there have been numerous instances in the last few years where every industry group was below its 50-DMA, the most recent period was unique in that it lasted more than four full weeks (21 trading days). Going all the way back to 1990, there has only been one other period where every industry group was below its 50-day moving average for as long as it just was. That was during the depths of the financial crisis in the 21-day stretch ending 11/3/08. It took a bear market of more than a year to finally reach that level back then, but this time around, it took less than two months. Besides that period, there has never been another four-week stretch where every industry group was below its 50-day moving average.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/05/050820-Groups-above-520DMA-Streaks.png))**\n\n&gt; Overall breadth readings have already improved in terms of industry groups above their 50-day moving averages, but at this point, the number of industry groups with rising 50-day moving averages remains extremely depressed at just 8.3% as of midday Friday. Similar to the streak above, during the most recent period every group had a declining 50-day moving average for 26 straight days, and that was also the longest such streak since 2008. Granted, this is a lagging indicator and should improve the longer equities remain around current levels, but it once again serves as a reminder of how steep the declines actually were.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/05/050820-Groups-rising-50DMA.png))**\n\n*****\n\n# Sector Relative Strength\n\n&gt; Although the S&amp;P 500 (SPY) is down around 1% over the past week, there are two sectors that have made a push higher: Communication Services (XLC) and Technology (XLK). While these moves have left both sectors in overbought territory, a snapshot from our Trend Analyzer tool shows that Tech's rally has brought it into the green YTD.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/05/050720-TA.png))**\n\n&gt; Technology's outperformance is nothing new. As shown in the relative strength charts from our Sector Snapshot below, Technology has been a serial outperformer versus the S&amp;P 500 for pretty much all of the past year (a rising line indicates outperformance versus the S&amp;P 500 and vice versa). As for the other sectors, Health Care has also seen some drastic outperformance over the past few months. Communication Services and Consumer Discretionary have also seen some outperformance in recent weeks. Contrary to Technology, Energy, Financials, Industrials, and Materials have all been consistent underperformers over the past year.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/05/RS.png))**\n\n*****\n\n# Performance on Earnings Days\n\n&gt; Roughly 1,300 companies have reported since the start of earnings season on 4/13 when the first of the big banks kicked things off. For those stocks that have beaten EPS estimates, the reaction has not been as strong as past years with just a 9 bps difference between this earnings season and all seasons since 2001. On the other hand, those that have missed EPS have not been as badly punished dropping 0.86% compared to an average drop of 3.56% since 2001. For all stocks, the average gain of 0.79% this earnings season is much stronger than the 0.06% gain of all other seasons.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/05/Earn-React-4.png))**\n\n&gt; With stock price reactions being generally positive this season, most of the gain has come at the open. Stocks reporting earnings have gapped up an average of 1.24%. But intraday they have tended to sell-off, averaging a 0.44% decline from open to close.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/05/Earn-React-2.png))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$UAA** \n&gt; * **$AMAT** \n&gt; * **$CLF** \n&gt; * **$MAR** \n&gt; * **$CSCO** \n&gt; * **$CPE** \n&gt; * **$JD** \n&gt; * **$INO** \n&gt; * **$KOS** \n&gt; * **$ON** \n&gt; * **$TLRY** \n&gt; * **$CAH** \n&gt; * **$ACB** \n&gt; * **$AN** \n&gt; * **$WIX** \n&gt; * **$SDC** \n&gt; * **$GBDC** \n&gt; * **$NCLH** \n&gt; * **$DUK** \n&gt; * **$NBEV**\n&gt; * **$ICPT** \n&gt; * **$SPG** \n&gt; * **$CYBR** \n&gt; * **$DDOG** \n&gt; * **$CEVA** \n&gt; * **$MYL** \n&gt; * **$CHH** \n&gt; * **$HMC** \n&gt; * **$ET** \n&gt; * **$LOGI** \n&gt; * **$OAS** \n&gt; * **$NVAX** \n&gt; * **$ZBH** \n&gt; * **$PRTK** \n&gt; * **$ABUS** \n&gt; * **$GWPH** \n&gt; * **$VCTR** \n&gt; * **$SALT** \n&gt; * **$WVE** \n&gt; * **$GNC** \n&gt; * **$AMRX** \n&gt; * **$ETR** \n&gt; * **$NOG**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/sx0HDsl.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/SeXyhoI.png))**\n###### **([CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES BEFORE MONDAY'S OPEN!](https://i.imgur.com/dp54bLF.jpg))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 5.11.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/NOhb3L5.png))\n\n\n&gt; # ***Monday 5.11.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/GVcHqQw.png))\n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/II5ukMy.png))\n\n\n*****\n\n&gt; # ***Tuesday 5.12.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/1RbrpI3.png))\n\n&gt; # ***Tuesday 5.12.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/FrASNRG.png))\n\n*****\n\n&gt; # ***Wednesday 5.13.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/tZs8hms.png))\n\n&gt; # ***Wednesday 5.13.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/GwtxPwV.png))\n\n*****\n\n&gt; # ***Thursday 5.14.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/jUwjUuj.png))\n\n&gt; # ***Thursday 5.14.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/s2yx68v.png))\n\n*****\n\n&gt; # ***Friday 5.15.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ofgb6gF.png))\n\n*****\n\n&gt; # ***Friday 5.15.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ofgb6gF.png))\nNONE.\n\n*****\n\n# Under Armour, Inc. $9.98\n&gt; **Under Armour, Inc. (UAA)** is confirmed to report earnings at approximately 6:55 AM ET on Monday, May 11, 2020. The consensus estimate is for a loss of $0.19 per share on revenue of $961.78 million and the Earnings Whisper ® number is ($0.18) per share. Investor sentiment going into the company's earnings release has 4% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 480.00% with revenue decreasing by 20.17%. Short interest has decreased by 29.1% since the company's last earnings release while the stock has drifted lower by 41.6% from its open following the earnings release to be 42.3% below its 200 day moving average of $17.29. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, May 7, 2020 there was some notable buying of 7,725 contracts of the $9.50 put expiring on Friday, May 15, 2020. Option traders are pricing in a 14.6% move on earnings and the stock has averaged a 14.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=UAA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Applied Materials, Inc. $53.81\n&gt; **Applied Materials, Inc. (AMAT)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, May 14, 2020. The consensus earnings estimate is $0.92 per share on revenue of $4.25 billion and the Earnings Whisper ® number is $0.96 per share. Investor sentiment going into the company's earnings release has 70% expecting an earnings beat The company's guidance was for earnings of $0.98 to $1.10 per share. Consensus estimates are for year-over-year earnings growth of 31.43% with revenue increasing by 20.09%. Short interest has increased by 26.9% since the company's last earnings release while the stock has drifted lower by 19.4% from its open following the earnings release to be 0.1% above its 200 day moving average of $53.76. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, April 28, 2020 there was some notable buying of 1,768 contracts of the $72.50 call expiring on Friday, October 16, 2020. Option traders are pricing in a 7.4% move on earnings and the stock has averaged a 3.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AMAT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Cleveland-Cliffs Inc $4.82\n&gt; **Cleveland-Cliffs Inc (CLF)** is confirmed to report earnings at approximately 7:00 AM ET on Monday, May 11, 2020. The consensus estimate is for a loss of $0.18 per share on revenue of $367.81 million and the Earnings Whisper ® number is ($0.23) per share. Investor sentiment going into the company's earnings release has 41% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 125.00% with revenue increasing by 134.27%. Short interest has decreased by 1.1% since the company's last earnings release while the stock has drifted lower by 34.4% from its open following the earnings release to be 30.0% below its 200 day moving average of $6.89. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, May 8, 2020 there was some notable buying of 3,060 contracts of the $4.00 put and 2,389 contracts of the $6.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 13.2% move on earnings and the stock has averaged a 4.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CLF&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Marriott International Inc. $87.17\n&gt; **Marriott International Inc. (MAR)** is confirmed to report earnings at approximately 6:15 AM ET on Monday, May 11, 2020. The consensus earnings estimate is $0.90 per share on revenue of $4.25 billion and the Earnings Whisper ® number is $0.83 per share. Investor sentiment going into the company's earnings release has 29% expecting an earnings miss The company's guidance was for earnings of $1.47 to $1.50 per share. Consensus estimates are for earnings to decline year-over-year by 36.17% with revenue decreasing by 15.20%. Short interest has increased by 116.6% since the company's last earnings release while the stock has drifted lower by 25.5% from its open following the earnings release to be 28.7% below its 200 day moving average of $122.26. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, May 1, 2020 there was some notable buying of 2,686 contracts of the $70.00 put expiring on Friday, May 15, 2020. Option traders are pricing in a 8.6% move on earnings and the stock has averaged a 2.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MAR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Cisco Systems, Inc. $42.99\n&gt; **Cisco Systems, Inc. (CSCO)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, May 13, 2020. The consensus earnings estimate is $0.71 per share on revenue of $11.88 billion and the Earnings Whisper ® number is $0.73 per share. Investor sentiment going into the company's earnings release has 58% expecting an earnings beat The company's guidance was for earnings of $0.79 to $0.81 per share. Consensus estimates are for earnings to decline year-over-year by 10.13% with revenue decreasing by 8.32%. Short interest has decreased by 8.2% since the company's last earnings release while the stock has drifted lower by 8.8% from its open following the earnings release to be 5.9% below its 200 day moving average of $45.70. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, May 8, 2020 there was some notable buying of 26,151 contracts of the $50.00 call expiring on Friday, May 29, 2020. Option traders are pricing in a 6.4% move on earnings and the stock has averaged a 5.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CSCO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Callon Petroleum Company $0.81\n&gt; **Callon Petroleum Company (CPE)** is confirmed to report earnings at approximately 5:00 AM ET on Monday, May 11, 2020. The consensus earnings estimate is $0.15 per share on revenue of $344.75 million. Investor sentiment going into the company's earnings release has 48% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 6.25% with revenue increasing by 125.26%. Short interest has decreased by 3.4% since the company's last earnings release while the stock has drifted lower by 64.0% from its open following the earnings release to be 76.5% below its 200 day moving average of $3.45. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, May 8, 2020 there was some notable buying of 666 contracts of the $3.00 put expiring on Friday, June 19, 2020. The stock has averaged a 7.2% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CPE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Kosmos Energy Ltd. $1.49\n&gt; **Kosmos Energy Ltd. (KOS)** is confirmed to report earnings at approximately 2:00 AM ET on Monday, May 11, 2020. The consensus estimate is for a loss of $0.14 per share on revenue of $234.50 million and the Earnings Whisper ® number is ($0.17) per share. Investor sentiment going into the company's earnings release has 14% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 133.33% with revenue decreasing by 20.99%. Short interest has increased by 38.8% since the company's last earnings release while the stock has drifted lower by 68.0% from its open following the earnings release to be 69.3% below its 200 day moving average of $4.85. Overall earnings estimates have been revised lower since the company's last earnings release. The stock has averaged a 7.5% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=KOS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# JD.com, Inc. $46.78\n&gt; **JD.com, Inc. (JD)** is confirmed to report earnings at approximately 5:00 AM ET on Friday, May 15, 2020. The consensus earnings estimate is $0.11 per share on revenue of $19.17 billion and the Earnings Whisper ® number is $0.18 per share. Investor sentiment going into the company's earnings release has 71% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 59.26% with revenue increasing by 6.25%. Short interest has decreased by 18.0% since the company's last earnings release while the stock has drifted higher by 13.0% from its open following the earnings release to be 31.7% above its 200 day moving average of $35.52. On Friday, May 1, 2020 there was some notable buying of 20,424 contracts of the $41.50 call expiring on Friday, May 22, 2020. Option traders are pricing in a 8.2% move on earnings and the stock has averaged a 7.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=JD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# ON Semiconductor Corporation $17.12\n&gt; **ON Semiconductor Corporation (ON)** is confirmed to report earnings at approximately 6:00 AM ET on Monday, May 11, 2020. The consensus earnings estimate is $0.15 per share on revenue of $1.30 billion and the Earnings Whisper ® number is $0.15 per share. Investor sentiment going into the company's earnings release has 43% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 65.12% with revenue decreasing by 6.25%. Short interest has decreased by 8.4% since the company's last earnings release while the stock has drifted lower by 20.2% from its open following the earnings release to be 10.6% below its 200 day moving average of $19.14. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, May 8, 2020 there was some notable buying of 14,949 contracts of the $18.00 call and 12,073 contracts of the $15.00 put expiring on Friday, May 15, 2020. Option traders are pricing in a 12.6% move on earnings and the stock has averaged a 9.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ON&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Inovio Biomedical Corp $10.86\n&gt; **Inovio Biomedical Corp (INO)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, May 11, 2020. The consensus estimate is for a loss of $0.23 per share on revenue of $1.55 million and the Earnings Whisper ® number is ($0.25) per share. Investor sentiment going into the company's earnings release has 52% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 23.33% with revenue decreasing by 45.23%. Short interest has increased by 28.3% since the company's last earnings release while the stock has drifted higher by 35.9% from its open following the earnings release to be 153.3% above its 200 day moving average of $4.29. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, May 8, 2020 there was some notable buying of 25,511 contracts of the $13.50 call expiring on Friday, May 15, 2020. Option traders are pricing in a 24.0% move on earnings and the stock has averaged a 6.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=INO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/wallstreetbets.",
        "subreddit": "wallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning May 11th, 2020",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ggmle1/wall_street_week_ahead_for_the_trading_week/",
        "created": 1589083560.0
    },
    {
        "author": "ItsreallyQ",
        "created_utc": 1589044722,
        "id": "ggjg07",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "Reported net profits yet somehow stock price barely moves. Only explanation I can conclude is because I bought calls and money hates me. Is this how CSCO is about to play out? Huge gains all week and then drops flat?",
        "subreddit": "wallstreetbets",
        "title": "What happened to DBX? Same thing that's about to happen to CSCO?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ggjg07/what_happened_to_dbx_same_thing_thats_about_to/",
        "created": 1589073522.0
    },
    {
        "author": "Double_Anybody",
        "created_utc": 1589308679,
        "id": "gihdol",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "How are we feeling about that one boys?",
        "subreddit": "options",
        "title": "Cisco (CSCO) earnings tomorrow",
        "url": "https://www.reddit.com/r/options/comments/gihdol/cisco_csco_earnings_tomorrow/",
        "created": 1589337479.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1589054538,
        "id": "ggmiu9",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/StockMarket. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning May 11th, 2020.\n\n# **Stocks are expected to trade the economy’s reopening in the week ahead  - [(Source)](https://www.cnbc.com/2020/05/08/stocks-expected-to-trade-the-economys-reopening-in-the-week-ahead.html)**\n*****\n&gt; Investors will watch the economy’s reopening progress, as well as a series of economic reports in the coming week that will provide a look at the consumer during April as the economy shed 20.5 million jobs.\n*****\n&gt; Fed Chairman Jerome Powell speaks on a webcast held by the Peterson Institute on Wednesday at 9 a.m., and he will be watched closely for any new insights on the economy or Fed programs.\n*****\n&gt; There are just a few earnings releases ahead, but there will be a barrage of economic reports, including consumer and producer inflation, consumer sentiment and most importantly retail sales on Friday. \n*****\n&gt; # Stocks versus bonds\n&gt; Stocks were higher in the past week, even as some bond yields touched record lows. Yields move opposite price, and bonds usually move opposite stocks.\n*****\n&gt; “The stock market is trading the reopening, and the bond market is doubting the vibrant pace of an economic recovery upon the reopening,” said Peter Boockvar, chief investment strategist at Bleakley Advisory Group.\n*****\n&gt; Small cap stocks and tech led the way higher in the past week. The Nasdaq jumped 6% in a week, where it wiped out its losses for the year and turned positive. The small cap Russell 2000 was up 5.5%.\n*****\n&gt; The S&amp;P 500 was up 3.5% for the week to 2,929, with tech up 6.6% and consumer discretionary stocks up 4.4%.\n*****\n&gt; The bond market and stock market have both responded to the Fed’s programs that put more liquidity into the financial system, with bond rates falling and stocks rising sharply.\n*****\n&gt; “Stocks just seem to be disconnected from everything else,” said Michael Schumacher, director rates at Wells Fargo. Some bond yields, like the benchmark 10-year yield, which impacts many types of loans, were slightly higher ahead of the Treasury’s record $96 billion in auctions in the coming week. But the 2-year, at a new low of 0.10%, was trading on concerns about the economy.\n*****\n&gt; Market pros will look for Powell to comment on market speculation that the Fed could take its benchmark rate to a negative yield. Fed officials have said they have no interest in negative rates, which are being used by central banks in Europe and Japan. But for the first time this past week, traders drove futures on fed funds to show slightly negative rates in contracts starting in  November. \n*****\n&gt; “He could quash negative yields if he wants to,” said Schumacher. “The Fed has consistently argued against negative policy rates. Now there’s a chance Powell could comment on this. He’s commented about it, several times in the last six months.”\n*****\n&gt; Much of the gains in the stock market have been driven by big technology companies with operations that haven’t been deeply affected by the coronavirus.\n*****\n&gt; “Tech was the shutdown trade and small caps are the reopening,” said Boockvar, noting small caps are domestically focused and are sensitive to the back-to-work trade.\n*****\n&gt; Apple joined the reopening trade Friday, when its stock rose after it announced it would reopen some of its U.S. stores.\n*****\n&gt; “The stock market has sort of a hall pass as the months proceed and things reopen. At some point, that hall pass is going to expire” and the reopenings will have to result in rebound, Boockvar said.\n*****\n&gt; Investors have been watching for anything that suggests state reopenings are stimulating activity.\n*****\n&gt; Retail sales Friday will be a big focus and are expected to show sharp decline of 11%, but more like 6% when automobiles and gasoline are removed, he said.\n*****\n&gt; In the oil market in the past week, crude was up as much as 24% as traders reacted to information that showed gasoline demand picking up around the U.S. States have been opening up at different speeds, and California was the latest to reopen some activity Friday.\n*****\n&gt; “Some of the reason the market is up because the virus curve is bending, the economic data is showing signs of a bounce. It hasn’t here yet but you know it’s coming. It’s a global phenomenon,” said James Paulsen, chief investment strategist at Leuthold Group. He noted that China’s export numbers unexpectedly rose in April, for the first time this year.\n*****\n&gt; Paulsen said he expects stocks to remain in an upswing.\n*****\n&gt; “There’s a lot of value out there if you’re outside the high growth in the S&amp;P 500,” he said, “When fear is as high as it is, that’s typically been a great time to lean toward risk assets. Gold is at a 50-year high relative to commodity prices. People are buying bonds at virtually zero yield. To me, there’s fairly defensive behavior and scared attitudes rather than the other way around.”\n*****\n&gt; Strategists say the market could retest its March lows, but a good number say the bottom has been set.\n*****\n&gt; “I’m getting more confident that we’ve seen the lows, and we’re starting a recovery in the stock market, but I think the volatility is going to stay there, and there will be challenges. I think the general direction is up rather than down at the moment,” said Paulsen.\n*****\n&gt; Paulsen said the fear of reinfection remains, should there be a new wave of the virus. “There’s a lot of terrible things that could happen and be terrible for the stock market,” he said.  “A headline could create an up or down week and then go away again. ” \n*****\n&gt; “I think the rise in the stock market is really more about a lack of sellers. But I don’t think there’s a lot of buyers. If more people believed this is winding down ... there could be a  lot more money that’s going to come back into equities, to some extent,” Paulsen said.\n*****\n&gt; Market pros are keeping an eye on yields, ahead of the government’s record sized $96 billion in auctions in the coming week for 3- and 10-year notes and 30-year bonds.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/4HGQyi7.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/2lmIrzt.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/eEihRrS.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/DR6SfIc.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/fXS8KN3.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/8V6CfZy.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/VHY2OWA.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/G3fxr2S.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/sx0HDsl.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/udABitD.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/zujuIT6.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/PxZA6w2.png))**\n\n*****\n\n# Market Too Far Ahead of Economy?\n\n&gt; Another 3.2 million Americans filed for unemployment last week bringing the seven-week total to 33.5 million. This is an unprecedented streak for an unprecedented time, and it highlights the significant impact that the coronavirus pandemic shutdown is having. One small positive aspect of this week’s number is the fact that it is a decline from the previous reading which lends further support to the possibility that the market’s lows of March could be the bottom and that bottom could hold based upon the historical correlation of jobless claims and past market bottoms that we covered in a recent post.\n\n&gt; However, the seven-week total is an unsettling number that suggests the road back to “normal” could be longer than the market appears to currently expect. It is getting increasingly more challenging to envision 33.5 million Americans returning to work as quickly as they left. And with NASDAQ returning to positive for the year in today’s trading it may be time to wonder if the market’s brisk recovery is possibly too far ahead of the actual economy.\n\n&gt; One early sign that the rally may be getting well ahead of the economy can be seen in the following chart of cumulative daily advance/decline lines for NYSE, NASDAQ, Russell 2000 and the S&amp;P 500. The recent trend since the end of April has been lower while the indexes have managed to move modestly higher. This suggests that fewer and fewer stocks are still participating in the rally. Historically when this persisted the major indexes frequently failed to move meaningfully higher and often turned lower.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/1ff6838e7d4a8493b62fad589a840223/2faca2fd2c71ed13-d0/s500x750/93ab9274fcf5f85882ed91b1eeb70ec5bcc54b88.jpg))**\n\n*****\n\n# Market Gains in Celebration of Mother’s Day\n\n&gt; With just a few days remaining to Mother’s Day, today’s post is also a reminder. Over the last twenty-five years on the Friday before Mother’s Day the Dow Jones Industrials have gained ground seventeen times. On the Monday after, DJIA has advanced seventeen times over the same time period. Average gain on Friday has been 0.20% and a respectable 0.36% on Monday. However, in five of the last eight years, the Monday following Mother’s Day has been down. Last year, DJIA suffered its worst post Mother’s Day loss, off 2.38%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/91ef736cb31d1b665b1933aa28dc680c/577c38f8de114a58-46/s500x750/e29f63d6af8b2ae4a172b03a5a3ba2af28fe345b.jpg))**\n\n*****\n\n# Group Breadth Improving From a Record Low Base\n\n&gt; After a disastrous late February and early March period, breadth among S&amp;P 500 groups cratered to the point where not a single one of the S&amp;P 500's 24 industry groups were above their 50-day moving average. Before the most recent occurrence, that's something we hadn't seen since early 2019.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/05/050820-Groups-above-520DMA.png))**\n\n&gt; While there have been numerous instances in the last few years where every industry group was below its 50-DMA, the most recent period was unique in that it lasted more than four full weeks (21 trading days). Going all the way back to 1990, there has only been one other period where every industry group was below its 50-day moving average for as long as it just was. That was during the depths of the financial crisis in the 21-day stretch ending 11/3/08. It took a bear market of more than a year to finally reach that level back then, but this time around, it took less than two months. Besides that period, there has never been another four-week stretch where every industry group was below its 50-day moving average.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/05/050820-Groups-above-520DMA-Streaks.png))**\n\n&gt; Overall breadth readings have already improved in terms of industry groups above their 50-day moving averages, but at this point, the number of industry groups with rising 50-day moving averages remains extremely depressed at just 8.3% as of midday Friday. Similar to the streak above, during the most recent period every group had a declining 50-day moving average for 26 straight days, and that was also the longest such streak since 2008. Granted, this is a lagging indicator and should improve the longer equities remain around current levels, but it once again serves as a reminder of how steep the declines actually were.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/05/050820-Groups-rising-50DMA.png))**\n\n*****\n\n# Sector Relative Strength\n\n&gt; Although the S&amp;P 500 (SPY) is down around 1% over the past week, there are two sectors that have made a push higher: Communication Services (XLC) and Technology (XLK). While these moves have left both sectors in overbought territory, a snapshot from our Trend Analyzer tool shows that Tech's rally has brought it into the green YTD.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/05/050720-TA.png))**\n\n&gt; Technology's outperformance is nothing new. As shown in the relative strength charts from our Sector Snapshot below, Technology has been a serial outperformer versus the S&amp;P 500 for pretty much all of the past year (a rising line indicates outperformance versus the S&amp;P 500 and vice versa). As for the other sectors, Health Care has also seen some drastic outperformance over the past few months. Communication Services and Consumer Discretionary have also seen some outperformance in recent weeks. Contrary to Technology, Energy, Financials, Industrials, and Materials have all been consistent underperformers over the past year.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/05/RS.png))**\n\n*****\n\n# Performance on Earnings Days\n\n&gt; Roughly 1,300 companies have reported since the start of earnings season on 4/13 when the first of the big banks kicked things off. For those stocks that have beaten EPS estimates, the reaction has not been as strong as past years with just a 9 bps difference between this earnings season and all seasons since 2001. On the other hand, those that have missed EPS have not been as badly punished dropping 0.86% compared to an average drop of 3.56% since 2001. For all stocks, the average gain of 0.79% this earnings season is much stronger than the 0.06% gain of all other seasons.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/05/Earn-React-4.png))**\n\n&gt; With stock price reactions being generally positive this season, most of the gain has come at the open. Stocks reporting earnings have gapped up an average of 1.24%. But intraday they have tended to sell-off, averaging a 0.44% decline from open to close.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/05/Earn-React-2.png))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending May 8th, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=2-I3PBvQBrQ))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 5.3.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=DciOIqiGJBs))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$UAA** \n&gt; * **$AMAT** \n&gt; * **$CLF** \n&gt; * **$MAR** \n&gt; * **$CSCO** \n&gt; * **$CPE** \n&gt; * **$JD** \n&gt; * **$INO** \n&gt; * **$KOS** \n&gt; * **$ON** \n&gt; * **$TLRY** \n&gt; * **$CAH** \n&gt; * **$ACB** \n&gt; * **$AN** \n&gt; * **$WIX** \n&gt; * **$SDC** \n&gt; * **$GBDC** \n&gt; * **$NCLH** \n&gt; * **$DUK** \n&gt; * **$NBEV**\n&gt; * **$ICPT** \n&gt; * **$SPG** \n&gt; * **$CYBR** \n&gt; * **$DDOG** \n&gt; * **$CEVA** \n&gt; * **$MYL** \n&gt; * **$CHH** \n&gt; * **$HMC** \n&gt; * **$ET** \n&gt; * **$LOGI** \n&gt; * **$OAS** \n&gt; * **$NVAX** \n&gt; * **$ZBH** \n&gt; * **$PRTK** \n&gt; * **$ABUS** \n&gt; * **$GWPH** \n&gt; * **$VCTR** \n&gt; * **$SALT** \n&gt; * **$WVE** \n&gt; * **$GNC** \n&gt; * **$AMRX** \n&gt; * **$ETR** \n&gt; * **$NOG**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/sx0HDsl.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/SeXyhoI.png))**\n###### **([CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES BEFORE MONDAY'S OPEN!](https://i.imgur.com/dp54bLF.jpg))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 5.11.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/NOhb3L5.png))\n\n\n&gt; # ***Monday 5.11.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/GVcHqQw.png))\n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/II5ukMy.png))\n\n\n*****\n\n&gt; # ***Tuesday 5.12.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/1RbrpI3.png))\n\n&gt; # ***Tuesday 5.12.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/FrASNRG.png))\n\n*****\n\n&gt; # ***Wednesday 5.13.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/tZs8hms.png))\n\n&gt; # ***Wednesday 5.13.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/GwtxPwV.png))\n\n*****\n\n&gt; # ***Thursday 5.14.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/jUwjUuj.png))\n\n&gt; # ***Thursday 5.14.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/s2yx68v.png))\n\n*****\n\n&gt; # ***Friday 5.15.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ofgb6gF.png))\n\n*****\n\n&gt; # ***Friday 5.15.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ofgb6gF.png))\nNONE.\n\n*****\n\n# Under Armour, Inc. $9.98\n&gt; **Under Armour, Inc. (UAA)** is confirmed to report earnings at approximately 6:55 AM ET on Monday, May 11, 2020. The consensus estimate is for a loss of $0.19 per share on revenue of $961.78 million and the Earnings Whisper ® number is ($0.18) per share. Investor sentiment going into the company's earnings release has 4% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 480.00% with revenue decreasing by 20.17%. Short interest has decreased by 29.1% since the company's last earnings release while the stock has drifted lower by 41.6% from its open following the earnings release to be 42.3% below its 200 day moving average of $17.29. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, May 7, 2020 there was some notable buying of 7,725 contracts of the $9.50 put expiring on Friday, May 15, 2020. Option traders are pricing in a 14.6% move on earnings and the stock has averaged a 14.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=UAA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Applied Materials, Inc. $53.81\n&gt; **Applied Materials, Inc. (AMAT)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, May 14, 2020. The consensus earnings estimate is $0.92 per share on revenue of $4.25 billion and the Earnings Whisper ® number is $0.96 per share. Investor sentiment going into the company's earnings release has 70% expecting an earnings beat The company's guidance was for earnings of $0.98 to $1.10 per share. Consensus estimates are for year-over-year earnings growth of 31.43% with revenue increasing by 20.09%. Short interest has increased by 26.9% since the company's last earnings release while the stock has drifted lower by 19.4% from its open following the earnings release to be 0.1% above its 200 day moving average of $53.76. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, April 28, 2020 there was some notable buying of 1,768 contracts of the $72.50 call expiring on Friday, October 16, 2020. Option traders are pricing in a 7.4% move on earnings and the stock has averaged a 3.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AMAT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Cleveland-Cliffs Inc $4.82\n&gt; **Cleveland-Cliffs Inc (CLF)** is confirmed to report earnings at approximately 7:00 AM ET on Monday, May 11, 2020. The consensus estimate is for a loss of $0.18 per share on revenue of $367.81 million and the Earnings Whisper ® number is ($0.23) per share. Investor sentiment going into the company's earnings release has 41% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 125.00% with revenue increasing by 134.27%. Short interest has decreased by 1.1% since the company's last earnings release while the stock has drifted lower by 34.4% from its open following the earnings release to be 30.0% below its 200 day moving average of $6.89. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, May 8, 2020 there was some notable buying of 3,060 contracts of the $4.00 put and 2,389 contracts of the $6.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 13.2% move on earnings and the stock has averaged a 4.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CLF&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Marriott International Inc. $87.17\n&gt; **Marriott International Inc. (MAR)** is confirmed to report earnings at approximately 6:15 AM ET on Monday, May 11, 2020. The consensus earnings estimate is $0.90 per share on revenue of $4.25 billion and the Earnings Whisper ® number is $0.83 per share. Investor sentiment going into the company's earnings release has 29% expecting an earnings miss The company's guidance was for earnings of $1.47 to $1.50 per share. Consensus estimates are for earnings to decline year-over-year by 36.17% with revenue decreasing by 15.20%. Short interest has increased by 116.6% since the company's last earnings release while the stock has drifted lower by 25.5% from its open following the earnings release to be 28.7% below its 200 day moving average of $122.26. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, May 1, 2020 there was some notable buying of 2,686 contracts of the $70.00 put expiring on Friday, May 15, 2020. Option traders are pricing in a 8.6% move on earnings and the stock has averaged a 2.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MAR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Cisco Systems, Inc. $42.99\n&gt; **Cisco Systems, Inc. (CSCO)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, May 13, 2020. The consensus earnings estimate is $0.71 per share on revenue of $11.88 billion and the Earnings Whisper ® number is $0.73 per share. Investor sentiment going into the company's earnings release has 58% expecting an earnings beat The company's guidance was for earnings of $0.79 to $0.81 per share. Consensus estimates are for earnings to decline year-over-year by 10.13% with revenue decreasing by 8.32%. Short interest has decreased by 8.2% since the company's last earnings release while the stock has drifted lower by 8.8% from its open following the earnings release to be 5.9% below its 200 day moving average of $45.70. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, May 8, 2020 there was some notable buying of 26,151 contracts of the $50.00 call expiring on Friday, May 29, 2020. Option traders are pricing in a 6.4% move on earnings and the stock has averaged a 5.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CSCO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Callon Petroleum Company $0.81\n&gt; **Callon Petroleum Company (CPE)** is confirmed to report earnings at approximately 5:00 AM ET on Monday, May 11, 2020. The consensus earnings estimate is $0.15 per share on revenue of $344.75 million. Investor sentiment going into the company's earnings release has 48% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 6.25% with revenue increasing by 125.26%. Short interest has decreased by 3.4% since the company's last earnings release while the stock has drifted lower by 64.0% from its open following the earnings release to be 76.5% below its 200 day moving average of $3.45. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, May 8, 2020 there was some notable buying of 666 contracts of the $3.00 put expiring on Friday, June 19, 2020. The stock has averaged a 7.2% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CPE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Kosmos Energy Ltd. $1.49\n&gt; **Kosmos Energy Ltd. (KOS)** is confirmed to report earnings at approximately 2:00 AM ET on Monday, May 11, 2020. The consensus estimate is for a loss of $0.14 per share on revenue of $234.50 million and the Earnings Whisper ® number is ($0.17) per share. Investor sentiment going into the company's earnings release has 14% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 133.33% with revenue decreasing by 20.99%. Short interest has increased by 38.8% since the company's last earnings release while the stock has drifted lower by 68.0% from its open following the earnings release to be 69.3% below its 200 day moving average of $4.85. Overall earnings estimates have been revised lower since the company's last earnings release. The stock has averaged a 7.5% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=KOS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# JD.com, Inc. $46.78\n&gt; **JD.com, Inc. (JD)** is confirmed to report earnings at approximately 5:00 AM ET on Friday, May 15, 2020. The consensus earnings estimate is $0.11 per share on revenue of $19.17 billion and the Earnings Whisper ® number is $0.18 per share. Investor sentiment going into the company's earnings release has 71% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 59.26% with revenue increasing by 6.25%. Short interest has decreased by 18.0% since the company's last earnings release while the stock has drifted higher by 13.0% from its open following the earnings release to be 31.7% above its 200 day moving average of $35.52. On Friday, May 1, 2020 there was some notable buying of 20,424 contracts of the $41.50 call expiring on Friday, May 22, 2020. Option traders are pricing in a 8.2% move on earnings and the stock has averaged a 7.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=JD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# ON Semiconductor Corporation $17.12\n&gt; **ON Semiconductor Corporation (ON)** is confirmed to report earnings at approximately 6:00 AM ET on Monday, May 11, 2020. The consensus earnings estimate is $0.15 per share on revenue of $1.30 billion and the Earnings Whisper ® number is $0.15 per share. Investor sentiment going into the company's earnings release has 43% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 65.12% with revenue decreasing by 6.25%. Short interest has decreased by 8.4% since the company's last earnings release while the stock has drifted lower by 20.2% from its open following the earnings release to be 10.6% below its 200 day moving average of $19.14. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, May 8, 2020 there was some notable buying of 14,949 contracts of the $18.00 call and 12,073 contracts of the $15.00 put expiring on Friday, May 15, 2020. Option traders are pricing in a 12.6% move on earnings and the stock has averaged a 9.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ON&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Inovio Biomedical Corp $10.86\n&gt; **Inovio Biomedical Corp (INO)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, May 11, 2020. The consensus estimate is for a loss of $0.23 per share on revenue of $1.55 million and the Earnings Whisper ® number is ($0.25) per share. Investor sentiment going into the company's earnings release has 52% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 23.33% with revenue decreasing by 45.23%. Short interest has increased by 28.3% since the company's last earnings release while the stock has drifted higher by 35.9% from its open following the earnings release to be 153.3% above its 200 day moving average of $4.29. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, May 8, 2020 there was some notable buying of 25,511 contracts of the $13.50 call expiring on Friday, May 15, 2020. Option traders are pricing in a 24.0% move on earnings and the stock has averaged a 6.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=INO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/StockMarket.",
        "subreddit": "StockMarket",
        "title": "Wall Street Week Ahead for the trading week beginning May 11th, 2020",
        "url": "https://www.reddit.com/r/StockMarket/comments/ggmiu9/wall_street_week_ahead_for_the_trading_week/",
        "created": 1589083338.0
    },
    {
        "author": "WVULuke",
        "created_utc": 1589323149,
        "id": "gim5nn",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "[POSITIONS &amp; ACCOUNT ](https://m.imgur.com/gallery/upZaqm5)\n\nSo I don’t really know to tag this as a gain or loss post, so I’m going off the last week. Up a few thousand from around 21k. Took a hard hit on ARWR last week, paper hands and panic sold. Also took way too big of a position based off some dumb DD. Made a comeback by selling CSOD last Friday for around 6k gains on RH and 2.3k on TDA Account. \n\nMade little to nothing from yesterday-today on CSCO. Could’ve scalped 600ish profit but was greedy holding and sold at break even. Maybe paper hands who knows. \n\nNOW going into tomorrow, I’m holding APPL BABA &amp; BA puts and was up a lil over 2k at close. Never been team bear really but I’m liking it. \n\nGod speed retards",
        "subreddit": "wallstreetbets",
        "title": "It’s been a long few months",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gim5nn/its_been_a_long_few_months/",
        "created": 1589351949.0
    },
    {
        "author": "rennocsemaj",
        "created_utc": 1588544100,
        "id": "gczeay",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Hello, as a new investor myself i thought this message might make you think before making rash decisions you may later go on to regret.\n\nAbout 2 weeks ago while the markets were down i thought great, what a good time to invest. So i put some of my money onto a trading212 account and without even doing any research I bought contracts on crude oil without even knowing what the contracts meant. I did however, thanks to a reddit post realise my stupidity and got out of that quickly. \n\nI then thought right well i'll do some research and then re-evaluate. Now in my mind at this point doing research was simply browsing reddit, looking at what the general consensus was, seeing others portfolios and going off analysts. However, after doing that my portfolio was around 25 stocks big not even checking if they were overvalued or had a large amount of debt i just went for them because they were good companies imo. People commented say that this was way to many for a low amount of investment money (£5000). So i sold all the ones i could but i had to leave some that were in the red hoping that they recover.\n\nThis is where i really did my research. I wanted to invest long term so i was looking for profitable companies, with a decent dividend and large growth potential and preferably little debt. For me I much prefer comparing number but i found flicking through webpage to webpage was hard to keep up with especially when comparing multiple companies. So i decided to create my own google sheets page, which imported companies data depending on the ticker and i did calculations to get other values (this took some time). This allowed me to get a much clearer picture of what the different companies futures were like. It looks at their margins, ROI, ROE, ROA, EPS (tts), 1 year EPS, D/E, trailing P/E, forward P/E, P/B, P/C, P/FCF, PEG, dividend information, stock information as well as graphs to see which way the market is going (roughly, i know it unpredictable). I also looked and thought about the future of the companies and how it might affect their price e.g. Sony and Microsoft with the new generation consoles.\n\nAfter doing all this i have to say i found myself addicted to analysis, i **LOVE** it, i've managed to narrow down my stocks to 9 so they are easily trackable and i only plan to invest small amounts at a time (around £500 a week) until a clearer idea can be gathered amount the current market.\n\nI would encourage any of you new investors to do the same, it may take some time but it is worth it in the long run. You will also feel much more confident in your picks once you have done this.\n\nStock Picks:\n\nVUSA - 25%\n\nMA - 10%\n\nJNJ - 10%\n\nMSFT - 10%\n\nCSCO - 10%\n\nABBV - 10%\n\nPEP - 10%\n\nLOW - 10%\n\nRTX - 5%\n\n(There are others that i'm watching that are currently overvalued imo so waiting to see what the month brings)\n\nPlease let me know what you think, if you have any questions or have any advice for me.\n\nThanks!:):)",
        "subreddit": "stocks",
        "title": "Message to New Investors",
        "url": "https://www.reddit.com/r/stocks/comments/gczeay/message_to_new_investors/",
        "created": 1588572900.0
    },
    {
        "author": "bluebirds2020",
        "created_utc": 1588543249,
        "id": "gcz5v2",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "Hello everyone, I just need your opinion on my taxable \"dividend\" portfolio and if it's okay. I already maxed out my ROTH IRA . I'm investing $1,500 monthly in dividend stocks on my taxable account. I'm going to include only the ones I will invest regularly and not the ones I just rarely invest. Please see below and let me know what you think. Any others I should invest once in a while or regularly? Thank you!\n\nCSCO\n\nFZILX\n\nFZROX\n\nJNJ\n\nLEG\n\nMMM\n\nMO\n\nO\n\nPEP\n\nSBUX\n\nSTOR\n\nWFC",
        "subreddit": "investing",
        "title": "My Dividend Portfolio:",
        "url": "https://www.reddit.com/r/investing/comments/gcz5v2/my_dividend_portfolio/",
        "created": 1588572049.0
    },
    {
        "author": "rennocsemaj",
        "created_utc": 1588544751,
        "id": "gczkqx",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Hello, as a beginner investor myself i thought this message might make you think before making rash decisions you may later go on to regret.\n\nAbout 2 weeks ago while the markets were down i thought great, what a good time to invest. So i put some of my money onto a trading212 account and without even doing any research I bought contracts on crude oil without even knowing what the contracts meant. I did however, thanks to a reddit post realise my stupidity and got out of that quickly. \n\nI then thought right well i'll do some research and then re-evaluate. Now in my mind at this point doing research was simply browsing reddit, looking at what the general consensus was, seeing others portfolios and going off analysts. However, after doing that my portfolio was around 25 stocks big not even checking if they were overvalued or had a large amount of debt i just went for them because they were good companies imo. People commented say that this was way to many for a low amount of investment money (£5000). So i sold all the ones i could but i had to leave some that were in the red hoping that they recover.\n\nThis is where i really did my research. I wanted to invest long term so i was looking for profitable companies, with a decent dividend and large growth potential and preferably little debt. For me I much prefer comparing number but i found flicking through webpage to webpage was hard to keep up with especially when comparing multiple companies. So i decided to create my own google sheets page, which imported companies data depending on the ticker and i did calculations to get other values (this took some time). This allowed me to get a much clearer picture of what the different companies futures were like. It looks at their margins, ROI, ROE, ROA, EPS (tts), 1 year EPS, D/E, trailing P/E, forward P/E, P/B, P/C, P/FCF, PEG, dividend information, stock information as well as graphs to see which way the market is going (roughly, i know it unpredictable). I also looked and thought about the future of the companies and how it might affect their price e.g. Sony and Microsoft with the new generation consoles.\n\nAfter doing all this i have to say i found myself addicted to analysis, i **LOVE** it, i've managed to narrow down my stocks to 9 so they are easily trackable and i only plan to invest small amounts at a time (around £500 a week) until a clearer idea can be gathered amount the current market.\n\nI would encourage any of you new investors to do the same, it may take some time but it is worth it in the long run. You will also feel much more confident in your picks once you have done this.\n\nStock Picks:\n\nVUSA - 25%\n\nMA - 10%\n\nJNJ - 10%\n\nMSFT - 10%\n\nCSCO - 10%\n\nABBV - 10%\n\nPEP - 10%\n\nLOW - 10%\n\nRTX - 5%\n\n(There are others that i'm watching that are currently overvalued imo so waiting to see what the month brings)\n\nPlease let me know what you think, if you have any questions or have any advice for me.\n\nThanks!:):)",
        "subreddit": "investing",
        "title": "Message to other new investors",
        "url": "https://www.reddit.com/r/investing/comments/gczkqx/message_to_other_new_investors/",
        "created": 1588573551.0
    },
    {
        "author": "Afinancialloser",
        "created_utc": 1589246397,
        "id": "gi11vb",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "I know dividend stocks really aren't meant for growth but I have a few good ones.\n\n&amp;#x200B;\n\n$SBUX\n\n$MSFT\n\n$CSCO\n\n$RTX\n\n&amp;#x200B;\n\nWhat are yours?\n\nEdit: What are the tax implications if you DRIP and hodl?",
        "subreddit": "stocks",
        "title": "What are your favorite DRIP growth stocks?",
        "url": "https://www.reddit.com/r/stocks/comments/gi11vb/what_are_your_favorite_drip_growth_stocks/",
        "created": 1589275197.0
    },
    {
        "author": "kurtesh",
        "created_utc": 1589038514,
        "id": "gghgqj",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Hello retards.  Going to keep this short and simple, just like your dicks and minds.  \n\n&amp;#x200B;\n\nYou are fucking up constantly for a few small reasons - myself included.  The best thing you can do for yourself immediately is watch this [Peter Lynch lecture](https://youtu.be/72Pq5zKEi_g?t=538) right now.  You will learn more in an hour's time than you've learned in the past month.  Done watching it?  Good, now it's time for you to attempt to read words.  I know it's hard, but you can do it!!\n\n&amp;#x200B;\n\n**Fear of missing out (FOMO)**\n\nThis is your greatest enemy.  If you're about to make a trade and you're anxious because you're afraid the stock will 'keep dropping' or 'keep climbing', do not trade.  Simple as that.  You must recognize you're experiencing FOMO and avoid trading until you're calm and can make a rational decision.  Yesterday I lost \\~30% potential gain because I waited a half hour longer than I should have on a trade.  I have no regret - when I made the purchase I was confident in the position and at that point knew it was a good play.\n\n&amp;#x200B;\n\n**Shorting Stocks**\n\nHoly fuck.  You autists need to understand that shorting is an *extremely challenging* trading strategy and very few people do well with it.  Look at a 5 year chart of SPY.  How much of that chart is steady climbs vs. sharp drops?  How many days do the drops last?  Stop.  Shorting.  Buying puts because \"this should be going down by now\" is completely irrational.  You're assuming the market will do something just because it makes sense to you.  Hell, Michael Burry, our lord and savior, had to wait over a year for his short to print.  And you fuckers are repeatedly betting on it happening within a few weeks time?  \n\n&amp;#x200B;\n\n**The \"Fundamentals\"**\n\nDid you watch the video?  If not, then you should.  The numbers on websites like Zack's are completely irrelevant now.  That's why HOG, UBER, and W are going bonkers and it doesn't make sense.  So, what does matter then, how do we make a play?  Think about the product itself, current market, and amateur investors.  Look at CMG and BYND for fuck's sake.   Hell even Elon knows TSLA is overpriced, but it's a sexy stock.  \n\nIt's difficult for us, because we like to jerk off to charts every night using our bear tears as lube, but it's time to suck it up and face reality.  Remember the guy that posted about his friend making +80% or something with a paper trade account where he just chose products he likes?  That's how the market works.  Fuck your charts, EPS, and P/E ratios.  \n\nTake CSCO, for example.  Our new meme stock that's going to shit on everyone.  It might not tank, but it sure as hell isn't skyrocketing.  Who the fuck is going to suddenly want to invest in CSCO because of a good quarter?  People that might be interested in CSCO probably already have their money tied up in stocks like ZM, FB, PYPL - and they're not pulling it to switch to fucking CSCO.  There are much, much better plays to be made.\n\n&amp;#x200B;\n\n**Confidence in trades**\n\nDo not blindly jump into any position ever.  In the video linked above, Peter humorously points out that people will spend countless hours weighing pros and cons of a vehicle purchase, but when it comes to the market they'll dump their whole life savings into one stock because of a tip they received from a stranger on a bus.  This is what happens to you guys when you look at a DD post.  Even if some autist spent hours doing research for you, it doesn't mean the play is a win.  Right before you execute a trade, look at the money you're putting on the table and take a few moments to consider \"could this go wrong?\".  Stop letting FOMO bleed money out of your account.  \n\n&amp;#x200B;\n\n**TL;DR:**  If you're not interested then why'd you open the post?",
        "subreddit": "wallstreetbets",
        "title": "Read this to stop losing money",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gghgqj/read_this_to_stop_losing_money/",
        "created": 1589067314.0
    },
    {
        "author": "malibu_danube",
        "created_utc": 1588971139,
        "id": "gg1etr",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "The $BOOM etf is comprised of three market sectors:\n\n* Oil\n* The company with its name on your home router\n* Any major company that was around when you were a kid that is now struggling. \n\n\nThat means invest in XOM, CSCO, and pick GM, GE, or BA depending on if you're into plane frames or lightbulbs. \n\n\nThese stocks are dip resistant. I repeat dip resistant. If they go down every boomer will buy it up real quick. Don't believe me? Go ask your dad which stocks to invest in. \n\nTL;DR $XOM, $CSCO, $BA calls.",
        "subreddit": "wallstreetbets",
        "title": "Calls on $BOOM and why you need to think like a boomer to succeed.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gg1etr/calls_on_boom_and_why_you_need_to_think_like_a/",
        "created": 1588999939.0
    },
    {
        "author": "namsilat",
        "created_utc": 1589229468,
        "id": "ghvyt5",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "CSCO earnings call discussion.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ghvyt5/csco_earnings_call_discussion/",
        "created": 1589258268.0
    },
    {
        "author": "twinhed",
        "created_utc": 1589211457,
        "id": "ghpuqq",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "I'm not one to post trades but I've been monitoring high OI flow for cheap OTM options and the one that keeps printing every other day is $CSCO 5/29 50C ($0.16 at the moment). Do you want with the info, but coming from someone that monitors cheap option flow, this the highest volume and OI I've seen printed the most often the past week.",
        "subreddit": "wallstreetbets",
        "title": "High OI prints for $CSCO ER",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ghpuqq/high_oi_prints_for_csco_er/",
        "created": 1589240257.0
    },
    {
        "author": "bennyboiioo",
        "created_utc": 1588916208,
        "id": "gfn7bc",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Invest?",
        "subreddit": "wallstreetbets",
        "title": "Tencent, Intel, and Cuckso (Cisco) making calls next week",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gfn7bc/tencent_intel_and_cuckso_cisco_making_calls_next/",
        "created": 1588945008.0
    },
    {
        "author": "tenziki",
        "created_utc": 1588824836,
        "id": "gezmgq",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Everyone knows that TMobile recently purchased Sprint.  \nBut people dont know that they are perhaps the leading company in 5g right now, its coverage compared to other carriers is the best(though not the fastest). They're currently rolling out the Stand Alone 5G mode which delivers better performance and range.  \n\"T-Mobile has partnered with companies like Cisco, Ericsson, MediaTek, Nokia, OnePlus, and Qualcomm to accomplish several standalone (SA) 5G world firsts. These include the first SA 5G data session between two commercial modems from two suppliers on a production network with Cisco, Ericsson, MediaTek, Nokia, and Qualcomm \"  \n [https://www.rcrwireless.com/20200505/carriers/t-mobile-ericsson-sa-5g-achievements](https://www.rcrwireless.com/20200505/carriers/t-mobile-ericsson-sa-5g-achievements)   \nMoreover, TMobile has continued to add new subscribers to its base beating all other carriers(Not including Sprint)   [https://www.barrons.com/articles/t-mobile-continues-to-outpace-at-t-verizon-now-the-focus-turns-to-sprint-and-5g-51588802443](https://www.barrons.com/articles/t-mobile-continues-to-outpace-at-t-verizon-now-the-focus-turns-to-sprint-and-5g-51588802443)   \nIts balance sheet does not look the best but it has been holding steady.\n\nIn the next 2 years we may see Tmobile achieving the top spot.  \n\n\nTMUS CALL 2021  \nERIC  CALL 2021",
        "subreddit": "wallstreetbets",
        "title": "Long $TMUS DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gezmgq/long_tmus_dd/",
        "created": 1588853636.0
    },
    {
        "author": "lamanis",
        "created_utc": 1588957676,
        "id": "gfx28i",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Hello fellow autists. After lurking the subreddit for some time I decided to yolo $1000 on CSCO calls.\n\nAfter looking at the candles today I wonder, is this how an addiction starts?",
        "subreddit": "wallstreetbets",
        "title": "Thoughts from a new member",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gfx28i/thoughts_from_a_new_member/",
        "created": 1588986476.0
    },
    {
        "author": "tradingkingeric",
        "created_utc": 1589162152,
        "id": "gheiic",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "SO obvs Ebay is going higher but check out the chart for $CSCO   \n\n\n&amp;#x200B;\n\n[https:\\/\\/chrt.biz\\/CSCO\\/119271tkq06\\/chart](https://preview.redd.it/8k1svcddl1y41.png?width=1257&amp;format=png&amp;auto=webp&amp;s=de8bdd2001c485ac6a8ddb84532f16687b931e12)\n\nI have an alert when it passes $1 past this trendline. Get read for a move to $45+",
        "subreddit": "options",
        "title": "Check it out. I think this is Best play youll make this week !!!!!!!!",
        "url": "https://www.reddit.com/r/options/comments/gheiic/check_it_out_i_think_this_is_best_play_youll_make/",
        "created": 1589190952.0
    },
    {
        "author": "73hebdhyd6h36dhld",
        "created_utc": 1588382704,
        "id": "gbwp6y",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "I'm a new investor. Here's what I plan to buy. I have long term and short-term strategies mixed in. I have missed the optimal buying times for a few stocks but I wasn't aware of them at the time. I know I could buy my long-term stocks now but I want to see how well they will survive over the next months, especially the airlines so I want to wait. I'm still trying to decide on what to buy. I don't have FOMO. I will take what I can get.\n\nBudget: 50k+ (as I earn more money, it will increase. The more money I have, the more stocks I can hold long-term)\n\nLength of time: 2-3 years and 10+ years. 2-3 years is not a set time frame. It is a general time I would like to pull out for short-term gains but I can keep it in there longer if it needs more time.\n\nI'm trying to learn as much as I can. I know the market will rally during crashes and bear markets can last 1-3 years. I have bought stocks in the past two months but I'm not used to holding stocks during a volatile market so I prefer to stay out so I don't have to worry about them Some of the stocks I want aren't going to move much in price anyway so I'm not in a hurry to buy them. Any suggestions for stocks or objections to the ones I currently have are welcomed.\n\nVZ 1k\nJPM 1k\nPYPL 1k\nLUV 2K\nUAL 2k\nDAL 4K\nSAVE 4k\nSPG 5k\nAirbus 5k\nCSCO 3k \nIMAX 3k \nPRU and/or AFL 5k (want AFL more than PRU)\n$36k so far\n\nOther stocks I was considering\nMA, V, WM, HON, TSLA, SPCE, JNJ, FLIR, TER",
        "subreddit": "stocks",
        "title": "What do you think of my tentative portfolio?",
        "url": "https://www.reddit.com/r/stocks/comments/gbwp6y/what_do_you_think_of_my_tentative_portfolio/",
        "created": 1588411504.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1589054689,
        "id": "ggmklg",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Good Saturday afternoon to all of you here on r/stocks. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning May 11th, 2020.\n\n# **Stocks are expected to trade the economy’s reopening in the week ahead  - [(Source)](https://www.cnbc.com/2020/05/08/stocks-expected-to-trade-the-economys-reopening-in-the-week-ahead.html)**\n*****\n&gt; Investors will watch the economy’s reopening progress, as well as a series of economic reports in the coming week that will provide a look at the consumer during April as the economy shed 20.5 million jobs.\n*****\n&gt; Fed Chairman Jerome Powell speaks on a webcast held by the Peterson Institute on Wednesday at 9 a.m., and he will be watched closely for any new insights on the economy or Fed programs.\n*****\n&gt; There are just a few earnings releases ahead, but there will be a barrage of economic reports, including consumer and producer inflation, consumer sentiment and most importantly retail sales on Friday. \n*****\n&gt; # Stocks versus bonds\n&gt; Stocks were higher in the past week, even as some bond yields touched record lows. Yields move opposite price, and bonds usually move opposite stocks.\n*****\n&gt; “The stock market is trading the reopening, and the bond market is doubting the vibrant pace of an economic recovery upon the reopening,” said Peter Boockvar, chief investment strategist at Bleakley Advisory Group.\n*****\n&gt; Small cap stocks and tech led the way higher in the past week. The Nasdaq jumped 6% in a week, where it wiped out its losses for the year and turned positive. The small cap Russell 2000 was up 5.5%.\n*****\n&gt; The S&amp;P 500 was up 3.5% for the week to 2,929, with tech up 6.6% and consumer discretionary stocks up 4.4%.\n*****\n&gt; The bond market and stock market have both responded to the Fed’s programs that put more liquidity into the financial system, with bond rates falling and stocks rising sharply.\n*****\n&gt; “Stocks just seem to be disconnected from everything else,” said Michael Schumacher, director rates at Wells Fargo. Some bond yields, like the benchmark 10-year yield, which impacts many types of loans, were slightly higher ahead of the Treasury’s record $96 billion in auctions in the coming week. But the 2-year, at a new low of 0.10%, was trading on concerns about the economy.\n*****\n&gt; Market pros will look for Powell to comment on market speculation that the Fed could take its benchmark rate to a negative yield. Fed officials have said they have no interest in negative rates, which are being used by central banks in Europe and Japan. But for the first time this past week, traders drove futures on fed funds to show slightly negative rates in contracts starting in  November. \n*****\n&gt; “He could quash negative yields if he wants to,” said Schumacher. “The Fed has consistently argued against negative policy rates. Now there’s a chance Powell could comment on this. He’s commented about it, several times in the last six months.”\n*****\n&gt; Much of the gains in the stock market have been driven by big technology companies with operations that haven’t been deeply affected by the coronavirus.\n*****\n&gt; “Tech was the shutdown trade and small caps are the reopening,” said Boockvar, noting small caps are domestically focused and are sensitive to the back-to-work trade.\n*****\n&gt; Apple joined the reopening trade Friday, when its stock rose after it announced it would reopen some of its U.S. stores.\n*****\n&gt; “The stock market has sort of a hall pass as the months proceed and things reopen. At some point, that hall pass is going to expire” and the reopenings will have to result in rebound, Boockvar said.\n*****\n&gt; Investors have been watching for anything that suggests state reopenings are stimulating activity.\n*****\n&gt; Retail sales Friday will be a big focus and are expected to show sharp decline of 11%, but more like 6% when automobiles and gasoline are removed, he said.\n*****\n&gt; In the oil market in the past week, crude was up as much as 24% as traders reacted to information that showed gasoline demand picking up around the U.S. States have been opening up at different speeds, and California was the latest to reopen some activity Friday.\n*****\n&gt; “Some of the reason the market is up because the virus curve is bending, the economic data is showing signs of a bounce. It hasn’t here yet but you know it’s coming. It’s a global phenomenon,” said James Paulsen, chief investment strategist at Leuthold Group. He noted that China’s export numbers unexpectedly rose in April, for the first time this year.\n*****\n&gt; Paulsen said he expects stocks to remain in an upswing.\n*****\n&gt; “There’s a lot of value out there if you’re outside the high growth in the S&amp;P 500,” he said, “When fear is as high as it is, that’s typically been a great time to lean toward risk assets. Gold is at a 50-year high relative to commodity prices. People are buying bonds at virtually zero yield. To me, there’s fairly defensive behavior and scared attitudes rather than the other way around.”\n*****\n&gt; Strategists say the market could retest its March lows, but a good number say the bottom has been set.\n*****\n&gt; “I’m getting more confident that we’ve seen the lows, and we’re starting a recovery in the stock market, but I think the volatility is going to stay there, and there will be challenges. I think the general direction is up rather than down at the moment,” said Paulsen.\n*****\n&gt; Paulsen said the fear of reinfection remains, should there be a new wave of the virus. “There’s a lot of terrible things that could happen and be terrible for the stock market,” he said.  “A headline could create an up or down week and then go away again. ” \n*****\n&gt; “I think the rise in the stock market is really more about a lack of sellers. But I don’t think there’s a lot of buyers. If more people believed this is winding down ... there could be a  lot more money that’s going to come back into equities, to some extent,” Paulsen said.\n*****\n&gt; Market pros are keeping an eye on yields, ahead of the government’s record sized $96 billion in auctions in the coming week for 3- and 10-year notes and 30-year bonds.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/4HGQyi7.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/2lmIrzt.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/eEihRrS.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/DR6SfIc.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/fXS8KN3.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/8V6CfZy.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/VHY2OWA.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/G3fxr2S.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/sx0HDsl.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/udABitD.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/zujuIT6.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/PxZA6w2.png))**\n\n*****\n\n# Market Too Far Ahead of Economy?\n\n&gt; Another 3.2 million Americans filed for unemployment last week bringing the seven-week total to 33.5 million. This is an unprecedented streak for an unprecedented time, and it highlights the significant impact that the coronavirus pandemic shutdown is having. One small positive aspect of this week’s number is the fact that it is a decline from the previous reading which lends further support to the possibility that the market’s lows of March could be the bottom and that bottom could hold based upon the historical correlation of jobless claims and past market bottoms that we covered in a recent post.\n\n&gt; However, the seven-week total is an unsettling number that suggests the road back to “normal” could be longer than the market appears to currently expect. It is getting increasingly more challenging to envision 33.5 million Americans returning to work as quickly as they left. And with NASDAQ returning to positive for the year in today’s trading it may be time to wonder if the market’s brisk recovery is possibly too far ahead of the actual economy.\n\n&gt; One early sign that the rally may be getting well ahead of the economy can be seen in the following chart of cumulative daily advance/decline lines for NYSE, NASDAQ, Russell 2000 and the S&amp;P 500. The recent trend since the end of April has been lower while the indexes have managed to move modestly higher. This suggests that fewer and fewer stocks are still participating in the rally. Historically when this persisted the major indexes frequently failed to move meaningfully higher and often turned lower.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/1ff6838e7d4a8493b62fad589a840223/2faca2fd2c71ed13-d0/s500x750/93ab9274fcf5f85882ed91b1eeb70ec5bcc54b88.jpg))**\n\n*****\n\n# Market Gains in Celebration of Mother’s Day\n\n&gt; With just a few days remaining to Mother’s Day, today’s post is also a reminder. Over the last twenty-five years on the Friday before Mother’s Day the Dow Jones Industrials have gained ground seventeen times. On the Monday after, DJIA has advanced seventeen times over the same time period. Average gain on Friday has been 0.20% and a respectable 0.36% on Monday. However, in five of the last eight years, the Monday following Mother’s Day has been down. Last year, DJIA suffered its worst post Mother’s Day loss, off 2.38%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/91ef736cb31d1b665b1933aa28dc680c/577c38f8de114a58-46/s500x750/e29f63d6af8b2ae4a172b03a5a3ba2af28fe345b.jpg))**\n\n*****\n\n# Group Breadth Improving From a Record Low Base\n\n&gt; After a disastrous late February and early March period, breadth among S&amp;P 500 groups cratered to the point where not a single one of the S&amp;P 500's 24 industry groups were above their 50-day moving average. Before the most recent occurrence, that's something we hadn't seen since early 2019.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/05/050820-Groups-above-520DMA.png))**\n\n&gt; While there have been numerous instances in the last few years where every industry group was below its 50-DMA, the most recent period was unique in that it lasted more than four full weeks (21 trading days). Going all the way back to 1990, there has only been one other period where every industry group was below its 50-day moving average for as long as it just was. That was during the depths of the financial crisis in the 21-day stretch ending 11/3/08. It took a bear market of more than a year to finally reach that level back then, but this time around, it took less than two months. Besides that period, there has never been another four-week stretch where every industry group was below its 50-day moving average.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/05/050820-Groups-above-520DMA-Streaks.png))**\n\n&gt; Overall breadth readings have already improved in terms of industry groups above their 50-day moving averages, but at this point, the number of industry groups with rising 50-day moving averages remains extremely depressed at just 8.3% as of midday Friday. Similar to the streak above, during the most recent period every group had a declining 50-day moving average for 26 straight days, and that was also the longest such streak since 2008. Granted, this is a lagging indicator and should improve the longer equities remain around current levels, but it once again serves as a reminder of how steep the declines actually were.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/05/050820-Groups-rising-50DMA.png))**\n\n*****\n\n# Sector Relative Strength\n\n&gt; Although the S&amp;P 500 (SPY) is down around 1% over the past week, there are two sectors that have made a push higher: Communication Services (XLC) and Technology (XLK). While these moves have left both sectors in overbought territory, a snapshot from our Trend Analyzer tool shows that Tech's rally has brought it into the green YTD.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/05/050720-TA.png))**\n\n&gt; Technology's outperformance is nothing new. As shown in the relative strength charts from our Sector Snapshot below, Technology has been a serial outperformer versus the S&amp;P 500 for pretty much all of the past year (a rising line indicates outperformance versus the S&amp;P 500 and vice versa). As for the other sectors, Health Care has also seen some drastic outperformance over the past few months. Communication Services and Consumer Discretionary have also seen some outperformance in recent weeks. Contrary to Technology, Energy, Financials, Industrials, and Materials have all been consistent underperformers over the past year.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/05/RS.png))**\n\n*****\n\n# Performance on Earnings Days\n\n&gt; Roughly 1,300 companies have reported since the start of earnings season on 4/13 when the first of the big banks kicked things off. For those stocks that have beaten EPS estimates, the reaction has not been as strong as past years with just a 9 bps difference between this earnings season and all seasons since 2001. On the other hand, those that have missed EPS have not been as badly punished dropping 0.86% compared to an average drop of 3.56% since 2001. For all stocks, the average gain of 0.79% this earnings season is much stronger than the 0.06% gain of all other seasons.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/05/Earn-React-4.png))**\n\n&gt; With stock price reactions being generally positive this season, most of the gain has come at the open. Stocks reporting earnings have gapped up an average of 1.24%. But intraday they have tended to sell-off, averaging a 0.44% decline from open to close.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/05/Earn-React-2.png))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$UAA** \n&gt; * **$AMAT** \n&gt; * **$CLF** \n&gt; * **$MAR** \n&gt; * **$CSCO** \n&gt; * **$CPE** \n&gt; * **$JD** \n&gt; * **$INO** \n&gt; * **$KOS** \n&gt; * **$ON** \n&gt; * **$TLRY** \n&gt; * **$CAH** \n&gt; * **$ACB** \n&gt; * **$AN** \n&gt; * **$WIX** \n&gt; * **$SDC** \n&gt; * **$GBDC** \n&gt; * **$NCLH** \n&gt; * **$DUK** \n&gt; * **$NBEV**\n&gt; * **$ICPT** \n&gt; * **$SPG** \n&gt; * **$CYBR** \n&gt; * **$DDOG** \n&gt; * **$CEVA** \n&gt; * **$MYL** \n&gt; * **$CHH** \n&gt; * **$HMC** \n&gt; * **$ET** \n&gt; * **$LOGI** \n&gt; * **$OAS** \n&gt; * **$NVAX** \n&gt; * **$ZBH** \n&gt; * **$PRTK** \n&gt; * **$ABUS** \n&gt; * **$GWPH** \n&gt; * **$VCTR** \n&gt; * **$SALT** \n&gt; * **$WVE** \n&gt; * **$GNC** \n&gt; * **$AMRX** \n&gt; * **$ETR** \n&gt; * **$NOG**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/sx0HDsl.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/SeXyhoI.png))**\n###### **([CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES BEFORE MONDAY'S OPEN!](https://i.imgur.com/dp54bLF.jpg))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 5.11.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/NOhb3L5.png))\n\n\n&gt; # ***Monday 5.11.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/GVcHqQw.png))\n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/II5ukMy.png))\n\n\n*****\n\n&gt; # ***Tuesday 5.12.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/1RbrpI3.png))\n\n&gt; # ***Tuesday 5.12.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/FrASNRG.png))\n\n*****\n\n&gt; # ***Wednesday 5.13.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/tZs8hms.png))\n\n&gt; # ***Wednesday 5.13.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/GwtxPwV.png))\n\n*****\n\n&gt; # ***Thursday 5.14.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/jUwjUuj.png))\n\n&gt; # ***Thursday 5.14.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/s2yx68v.png))\n\n*****\n\n&gt; # ***Friday 5.15.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ofgb6gF.png))\n\n*****\n\n&gt; # ***Friday 5.15.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ofgb6gF.png))\nNONE.\n\n*****\n\n# Under Armour, Inc. $9.98\n&gt; **Under Armour, Inc. (UAA)** is confirmed to report earnings at approximately 6:55 AM ET on Monday, May 11, 2020. The consensus estimate is for a loss of $0.19 per share on revenue of $961.78 million and the Earnings Whisper ® number is ($0.18) per share. Investor sentiment going into the company's earnings release has 4% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 480.00% with revenue decreasing by 20.17%. Short interest has decreased by 29.1% since the company's last earnings release while the stock has drifted lower by 41.6% from its open following the earnings release to be 42.3% below its 200 day moving average of $17.29. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, May 7, 2020 there was some notable buying of 7,725 contracts of the $9.50 put expiring on Friday, May 15, 2020. Option traders are pricing in a 14.6% move on earnings and the stock has averaged a 14.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=UAA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Applied Materials, Inc. $53.81\n&gt; **Applied Materials, Inc. (AMAT)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, May 14, 2020. The consensus earnings estimate is $0.92 per share on revenue of $4.25 billion and the Earnings Whisper ® number is $0.96 per share. Investor sentiment going into the company's earnings release has 70% expecting an earnings beat The company's guidance was for earnings of $0.98 to $1.10 per share. Consensus estimates are for year-over-year earnings growth of 31.43% with revenue increasing by 20.09%. Short interest has increased by 26.9% since the company's last earnings release while the stock has drifted lower by 19.4% from its open following the earnings release to be 0.1% above its 200 day moving average of $53.76. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, April 28, 2020 there was some notable buying of 1,768 contracts of the $72.50 call expiring on Friday, October 16, 2020. Option traders are pricing in a 7.4% move on earnings and the stock has averaged a 3.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AMAT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Cleveland-Cliffs Inc $4.82\n&gt; **Cleveland-Cliffs Inc (CLF)** is confirmed to report earnings at approximately 7:00 AM ET on Monday, May 11, 2020. The consensus estimate is for a loss of $0.18 per share on revenue of $367.81 million and the Earnings Whisper ® number is ($0.23) per share. Investor sentiment going into the company's earnings release has 41% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 125.00% with revenue increasing by 134.27%. Short interest has decreased by 1.1% since the company's last earnings release while the stock has drifted lower by 34.4% from its open following the earnings release to be 30.0% below its 200 day moving average of $6.89. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, May 8, 2020 there was some notable buying of 3,060 contracts of the $4.00 put and 2,389 contracts of the $6.00 call expiring on Friday, June 19, 2020. Option traders are pricing in a 13.2% move on earnings and the stock has averaged a 4.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CLF&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Marriott International Inc. $87.17\n&gt; **Marriott International Inc. (MAR)** is confirmed to report earnings at approximately 6:15 AM ET on Monday, May 11, 2020. The consensus earnings estimate is $0.90 per share on revenue of $4.25 billion and the Earnings Whisper ® number is $0.83 per share. Investor sentiment going into the company's earnings release has 29% expecting an earnings miss The company's guidance was for earnings of $1.47 to $1.50 per share. Consensus estimates are for earnings to decline year-over-year by 36.17% with revenue decreasing by 15.20%. Short interest has increased by 116.6% since the company's last earnings release while the stock has drifted lower by 25.5% from its open following the earnings release to be 28.7% below its 200 day moving average of $122.26. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, May 1, 2020 there was some notable buying of 2,686 contracts of the $70.00 put expiring on Friday, May 15, 2020. Option traders are pricing in a 8.6% move on earnings and the stock has averaged a 2.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MAR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Cisco Systems, Inc. $42.99\n&gt; **Cisco Systems, Inc. (CSCO)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, May 13, 2020. The consensus earnings estimate is $0.71 per share on revenue of $11.88 billion and the Earnings Whisper ® number is $0.73 per share. Investor sentiment going into the company's earnings release has 58% expecting an earnings beat The company's guidance was for earnings of $0.79 to $0.81 per share. Consensus estimates are for earnings to decline year-over-year by 10.13% with revenue decreasing by 8.32%. Short interest has decreased by 8.2% since the company's last earnings release while the stock has drifted lower by 8.8% from its open following the earnings release to be 5.9% below its 200 day moving average of $45.70. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, May 8, 2020 there was some notable buying of 26,151 contracts of the $50.00 call expiring on Friday, May 29, 2020. Option traders are pricing in a 6.4% move on earnings and the stock has averaged a 5.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CSCO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Callon Petroleum Company $0.81\n&gt; **Callon Petroleum Company (CPE)** is confirmed to report earnings at approximately 5:00 AM ET on Monday, May 11, 2020. The consensus earnings estimate is $0.15 per share on revenue of $344.75 million. Investor sentiment going into the company's earnings release has 48% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 6.25% with revenue increasing by 125.26%. Short interest has decreased by 3.4% since the company's last earnings release while the stock has drifted lower by 64.0% from its open following the earnings release to be 76.5% below its 200 day moving average of $3.45. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, May 8, 2020 there was some notable buying of 666 contracts of the $3.00 put expiring on Friday, June 19, 2020. The stock has averaged a 7.2% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CPE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Kosmos Energy Ltd. $1.49\n&gt; **Kosmos Energy Ltd. (KOS)** is confirmed to report earnings at approximately 2:00 AM ET on Monday, May 11, 2020. The consensus estimate is for a loss of $0.14 per share on revenue of $234.50 million and the Earnings Whisper ® number is ($0.17) per share. Investor sentiment going into the company's earnings release has 14% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 133.33% with revenue decreasing by 20.99%. Short interest has increased by 38.8% since the company's last earnings release while the stock has drifted lower by 68.0% from its open following the earnings release to be 69.3% below its 200 day moving average of $4.85. Overall earnings estimates have been revised lower since the company's last earnings release. The stock has averaged a 7.5% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=KOS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# JD.com, Inc. $46.78\n&gt; **JD.com, Inc. (JD)** is confirmed to report earnings at approximately 5:00 AM ET on Friday, May 15, 2020. The consensus earnings estimate is $0.11 per share on revenue of $19.17 billion and the Earnings Whisper ® number is $0.18 per share. Investor sentiment going into the company's earnings release has 71% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 59.26% with revenue increasing by 6.25%. Short interest has decreased by 18.0% since the company's last earnings release while the stock has drifted higher by 13.0% from its open following the earnings release to be 31.7% above its 200 day moving average of $35.52. On Friday, May 1, 2020 there was some notable buying of 20,424 contracts of the $41.50 call expiring on Friday, May 22, 2020. Option traders are pricing in a 8.2% move on earnings and the stock has averaged a 7.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=JD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# ON Semiconductor Corporation $17.12\n&gt; **ON Semiconductor Corporation (ON)** is confirmed to report earnings at approximately 6:00 AM ET on Monday, May 11, 2020. The consensus earnings estimate is $0.15 per share on revenue of $1.30 billion and the Earnings Whisper ® number is $0.15 per share. Investor sentiment going into the company's earnings release has 43% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 65.12% with revenue decreasing by 6.25%. Short interest has decreased by 8.4% since the company's last earnings release while the stock has drifted lower by 20.2% from its open following the earnings release to be 10.6% below its 200 day moving average of $19.14. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, May 8, 2020 there was some notable buying of 14,949 contracts of the $18.00 call and 12,073 contracts of the $15.00 put expiring on Friday, May 15, 2020. Option traders are pricing in a 12.6% move on earnings and the stock has averaged a 9.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ON&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Inovio Biomedical Corp $10.86\n&gt; **Inovio Biomedical Corp (INO)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, May 11, 2020. The consensus estimate is for a loss of $0.23 per share on revenue of $1.55 million and the Earnings Whisper ® number is ($0.25) per share. Investor sentiment going into the company's earnings release has 52% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 23.33% with revenue decreasing by 45.23%. Short interest has increased by 28.3% since the company's last earnings release while the stock has drifted higher by 35.9% from its open following the earnings release to be 153.3% above its 200 day moving average of $4.29. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, May 8, 2020 there was some notable buying of 25,511 contracts of the $13.50 call expiring on Friday, May 15, 2020. Option traders are pricing in a 24.0% move on earnings and the stock has averaged a 6.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=INO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/stocks.",
        "subreddit": "stocks",
        "title": "Wall Street Week Ahead for the trading week beginning May 11th, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/ggmklg/wall_street_week_ahead_for_the_trading_week/",
        "created": 1589083489.0
    },
    {
        "author": "krullord",
        "created_utc": 1588986585,
        "id": "gg5usy",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "5/29 $45\n6/19 $46\n\nWas going to bail up 40% but decided to let it ride through to Monday and probably dump before earnings. Holding through the weekend has burned me before though so I'm wary, hopefully theta doesn't cuck me too hard",
        "subreddit": "smallstreetbets",
        "title": "Anyone else holding CSCO calls through the weekend?",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/gg5usy/anyone_else_holding_csco_calls_through_the_weekend/",
        "created": 1589015385.0
    },
    {
        "author": "foxyfox71",
        "created_utc": 1588903131,
        "id": "gfk6p1",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Hear this strategy for the upcoming Cisco (CSCO) earnings:\n\n* Step 1: Buy a shit ton of CSCO 50c 5/29 calls at $0.08\n* Step 2: Wait until Wednesday ER for the pump\n* Step 3: Ride the IV fluctuations until Wednesday and sell right before market close\n\nYou can basically buy 200 contracts (20,000 shares) for $1,000. If CSCO stock goes from $41.60 to $45.00 by 5/13, the estimated value of the contracts would be $4,600 (try yourself using the simulator below). This assumes that Cisco shares will increase by a moderate 7.8% in 5 days, which is nothing since there will be so much hype around it on Monday &amp; Tuesday! Am I missing something?\n\n[https://www.optionsprofitcalculator.com/calculator/long-call.html](https://www.optionsprofitcalculator.com/calculator/long-call.html)",
        "subreddit": "wallstreetbets",
        "title": "CSCO strategy: 3.6x returns almost guaranteed",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gfk6p1/csco_strategy_36x_returns_almost_guaranteed/",
        "created": 1588931931.0
    },
    {
        "author": "lilwaynesdoublecup",
        "created_utc": 1589064635,
        "id": "ggpk35",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "This is the first weekend all the non essential businesses around me have been open. Just went to Lowe’s and passed Olive Garden, Longhorn steakhouse, Buffalo Wild Wings and some Japanese hibachi rimjob place. All of the parking lots were full and when I got to Lowe’s this obese couple waddled halfway from their car across the parking lot and took their masks off before they even got in the store I’m assuming to free their blow holes. This is all to say that all those cheese dick analysts saying NoTHinG wiLl eVEr be noRMaL AgAin could not have been more wrong and severely underestimated how bad these boomers want their unlimited breadsticks and to eat dinner at 4 o’clock with their boomer friends. \n\nTLDR CSCO $44C 5/15",
        "subreddit": "wallstreetbets",
        "title": "If you’re still buying puts you’re a retard",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ggpk35/if_youre_still_buying_puts_youre_a_retard/",
        "created": 1589093435.0
    },
    {
        "author": "m2rik",
        "created_utc": 1589310518,
        "id": "gii11x",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "$CSCO hold or sell?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gii11x/csco_hold_or_sell/",
        "created": 1589339318.0
    },
    {
        "author": "BlueLight03",
        "created_utc": 1588372236,
        "id": "gbrxjj",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": " \n\n\\- Apple\n\n\\- Amazon\n\n\\- Google\n\n\\- MSFT \n\n\\- TSLA\n\n\\- SBUX\n\n\\- PG\n\n\\- WFC \n\n\\- BNS\n\n\\- JPM\n\n\\- C\n\n\\- CSCO\n\n\\- IBM\n\n\\- LMT\n\n\\- RTX\n\n\\- Roku\n\n\\- BA\n\n\\- DAL\n\n\\- DIS\n\n\\- MA\n\n\\- DFS\n\n\\- AXP\n\n\\- XOM\n\n\\- CVX\n\n\\- DUK\n\n\\- KO\n\n\\- PepsiCo\n\n\\- ABBV\n\n\\- Pfizer\n\n\\- AMGN\n\n\\- JNJ\n\n\\- LOW\n\n\\- HD\n\n\\- WMT",
        "subreddit": "investing",
        "title": "Rate my Portfolio",
        "url": "https://www.reddit.com/r/investing/comments/gbrxjj/rate_my_portfolio/",
        "created": 1588401036.0
    },
    {
        "author": "jrubin04",
        "created_utc": 1589299409,
        "id": "gie1sf",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "It ain’t much but it’s honest work (CZR CSCO LOGI)",
        "url": "https://i.redd.it/p6xpdrklxcy41.jpg",
        "created": 1589328209.0
    },
    {
        "author": "Articunozard",
        "created_utc": 1589299856,
        "id": "gie79y",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "[Shitpost/DD] Cisco Earnings After Hours - Peak Google Trending in March",
        "url": "https://i.redd.it/tw5rizoiycy41.png",
        "created": 1589328656.0
    },
    {
        "author": "btoned",
        "created_utc": 1588961193,
        "id": "gfy6uv",
        "num_comments": 7,
        "num_crossposts": 1,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "This is Enough for Me $CSCO",
        "url": "https://i.redd.it/4d0w57rwzkx41.png",
        "created": 1588989993.0
    },
    {
        "author": "avelasquez170",
        "created_utc": 1588966922,
        "id": "gg0261",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Earlier today I saw u/foxyfox71’s DD on CSCO and was convinced enough to want to play them. Only problem for me is I usually don’t buy options. After the initial crash in March I’ve switched to being a proud Theta-Ganger.\n\nI’ve been on the correct side of a lot of earnings plays these past few weeks: BYND, PTON, SNAP to name a few. Only difference is when y’all were buying Calls, I was mainly selling Cash Covered Puts.\n\nThis resulted in a lot of quick flips and easy money, but far less profit than if I had bought Calls.\n\nMy theta-gang compromise involves both. Using CSCO as an example, I sold a CCP, bought Calls, and still came out with a net-credit.\n\n$39.50p 5/29 is what I sold for $60 credit\n$50c 5/29 x4 is what I bought for $46\n\nFor those not familiar, selling a Put requires a lot more collateral, in this case $3950. This is one downside to being an options seller. The upside is there’s a lot more scenarios where I’m a “winner”. IV crush (Vega), and time decay (Theta) are my best friends, especially the day after earnings.\n\nAnother personal upside is that I’m perfectly okay with buying CSCO at $39.50. In fact I think that’s a fucking steal, and I can even sell Covered Calls on them if I do get assigned.\n\nAlso, at the time I made this play, there was a 75% chance that my Put doesn’t end up in the money. This puts the odds very much in my favor to exit this trade profitably.\n\nI haven’t seen a name for this play but I unofficially deem it the Cash Covered YOLO.\n\nThis will be my first time trying it out, but it appears to be a nice way to get some more upside on your plays, while sacrificing some credit upfront.",
        "subreddit": "wallstreetbets",
        "title": "The Cash Covered YOLO: An Amatuer’s Guide To Free Lottery Tickets",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gg0261/the_cash_covered_yolo_an_amatuers_guide_to_free/",
        "created": 1588995722.0
    },
    {
        "author": "StrategicVictor",
        "created_utc": 1589104602,
        "id": "ggyqb7",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Yesterday I  listened to this very interesting podcast ( We Study Billionaires - TIP295: Mohnish Pabrai on Value Investing &amp; Philanthropy) where Mohnish Pabrai mentions what he calls secret compounders. The concept sounds very interesting to me, the company that compounds earnings like Visa or Mastercard, but doesn't demand the premium yet, since market doesn't know it yet. He mentions his investment in Fiat - Chrysler (FCAU) where he thought that Ferrari (RACE) alone is worth the whole company due to this reason. I have been thinking about it since yesterday, but I couldn't think of any. I also tried to identify some requirements for such a company.\n\n1. Low P/E: goal is obviously to find the ones that haven't appreciated in value yet, since Mr. Market doesn't know about or doesn't value their compounding ability yet. So they have to have earnings and P/E multiple growth potential. If they have high P/E I can just buy V or MA, where I am sure of their copounding ability.\n2. Addresable market that they dominate and is also growing, enabling the future growth of the company.\n3. High operating and net margin that signal strong moat and ability to earn a lot of money which they then reinvest in the bussines.\n4. Scalability without increasing costs; costs percentage should be decreasing considerably with scale. Something like Saas is the best representation of this.\n5. Reinvested earnings are effective at raising revenue. If company is just investing a lot of money, but there is no growth, then they lack compounding ability imo (like IBM for example).\n\nThese are just a few points that I am not even sure that apply so I would like to get your opinion.\n\nWhat criteria should we use to figure our if the company is a secret compunder? And do you have any ideas which companies would that be and why?\n\nTo me, the closest I could think of is Cisco (CSCO). They generate huge cash flow, have great balance sheet and pay nice and sustainable dividend. However, this doesn't make them a compunder, but just a nice company to invest in. Their shift from legacy business to Saas could make them one, but only if they are successful in making it a larger part of their revenue. This would increase their earnings power and also make their revenue more predictable, warranting P/E multiple expansion.\n\nI appreciate any feedback :)",
        "subreddit": "investing",
        "title": "Secret compounders",
        "url": "https://www.reddit.com/r/investing/comments/ggyqb7/secret_compounders/",
        "created": 1589133402.0
    },
    {
        "author": "GoobyStonk",
        "created_utc": 1589218594,
        "id": "ghs8fk",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "CISCO Q1 Earnings",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ghs8fk/cisco_q1_earnings/",
        "created": 1589247394.0
    },
    {
        "author": "Strategery_Man",
        "created_utc": 1588950495,
        "id": "gfuvea",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "CSCO Calls Train",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gfuvea/csco_calls_train/",
        "created": 1588979295.0
    },
    {
        "author": "Team_player444",
        "created_utc": 1588817361,
        "id": "gextp9",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "I'm itching to buy some calls ahead of earnings. I saw that they're expected to beat, and the chart seems like tomorow will be a good time to jump in. \n\nI usually find myself having trouble weighing the bad. What would be reasons not to buy in? Say $45 strike.",
        "subreddit": "stocks",
        "title": "CSCO Thoughts",
        "url": "https://www.reddit.com/r/stocks/comments/gextp9/csco_thoughts/",
        "created": 1588846161.0
    },
    {
        "author": "Sirwompus",
        "created_utc": 1588944042,
        "id": "gft3o8",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I've done all my trading during normal market hours so this is new to me.  When I bought some CSCO $42 pre market the actual purchase was at $44 because of a 5% increase robinhood puts in place. Does that mean I'll really get the stock at $44 or that's the max I'll pay?",
        "subreddit": "RobinHood",
        "title": "Clarification on pre market buys",
        "url": "https://www.reddit.com/r/RobinHood/comments/gft3o8/clarification_on_pre_market_buys/",
        "created": 1588972842.0
    },
    {
        "author": "sawslayer9",
        "created_utc": 1588962133,
        "id": "gfyi1l",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Cisco outlook",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gfyi1l/cisco_outlook/",
        "created": 1588990933.0
    },
    {
        "author": "zennox_",
        "created_utc": 1588872278,
        "id": "gfax7l",
        "num_comments": 107,
        "num_crossposts": 0,
        "selftext": "One of the most undervalued technology stocks at the moment: $CSCO. Zoom has been getting the lion's share of attention, but Cisco has been seeing crazy growth in usage of both its teleconferencing (Webex) and VPN (AnyConnect) software. $CSCO has a lot of room to grow -- it is still down \\~28% of its 52W high.\n\nCisco's earning announcement is expected May 13th, and they'll beat their estimates. Here's why:\n\n* First off, Cisco consistently beats its earning estimates. Last quarter's report [delivered an EPS surprise of 3.7%.](https://www.nasdaq.com/articles/why-the-earnings-surprise-streak-could-continue-for-cisco-csco-2020-05-01)\n* In February, when East Asia was being hit the hardest, Cisco saw [22 times the amount of network traffic per second it normally gets for its Webex service from users in China](https://www.cnbc.com/2020/03/17/cisco-webex-sees-record-usage-during-coronavirus-expansion-like-zoom.html)\n* Webex saw incredible growth in March, too, with registered attendees and hosted meeting minutes more than doubling to [324 million](https://blogs.cisco.com/news/easing-the-everyday-challenges-of-sheltering-in-place) and [14 billion](https://blogs.cisco.com/news/connected-and-secure-webex-in-todays-world), respectively. If even a fraction of that growth continued in April...\n* Okta, the enterprise SSO provider, indicates that March's number of unique users of Cisco's VPN software [peaked at 238% when compared to 28 days prior.](https://www.okta.com/businesses-at-work/2020/work-from-home)\n\nAll of this leads me to believe that estimates are quite low, and we'll see a pump before and following the announcement.\n\n$CSCO 45c 5/22",
        "subreddit": "wallstreetbets",
        "title": "Cisco ($CSCO) calls will print",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gfax7l/cisco_csco_calls_will_print/",
        "created": 1588901078.0
    },
    {
        "author": "ScallyWag-Idiot",
        "created_utc": 1588888468,
        "id": "gfg47b",
        "num_comments": 37,
        "num_crossposts": 1,
        "selftext": "Amid the coronavirus bear market and imminent global recession, Cisco Systems (CSCO) remains one of the top U.S. tech companies in terms of cash on its balance sheet. As a result, Cisco stock provides an attractive dividend.     \n\n   \n\nCorporate spending on information technology was expected to plunge due to COVID - BUT IT HASN'T.\n\nThere's a long-term view. Cisco could go shopping once the dust settles and make the kind of big, transformational acquisition that some have been looking for.   \n   \n\n\nIn the January quarter, Cisco's fiscal second quarter, the company paid a cash dividend of $1.5 billion and bought back $870 million of its own shares. Cisco stock had some $27 billion in cash and equivalents. In 2019, Cisco reduced debt by some $5 billion. Heading into the April quarter, Cisco had about $12 billion remaining in a stock repurchase program.     \n    \n\n\nIn its glory days from a 1990 initial public offering through early 2000, Cisco thrived as a major supplier of the hardware to build internet networks, both to telecom firms and large companies outside that sector. Cisco stock soared more than 100,000% in that period, before the dot.com bubble burst.\n     \n     \n\nMore recently, after a breakout in October 2017, Cisco stock gained 70% through mid-July 2019.      \n    \n\n\n\nBut CSCO stock swooned in the latter half of 2019. It plunged like most tech stocks in the coronavirus-driven market correction. The upper echelon tech stocks are providing strong bounce backs to the rest of the market. CSCO should be no different, infact - with upside for more growth than the company has seen in the last 10 years. They're more diverse in cloud computing services, software, and equipment.   \n   \n\n  \n\n\nThe tech industry icon is shifting away from its core business of selling network switches and routers. With acquisitions, Cisco has aimed to increase revenue from software and services.     \n\n     \n   \n\nBefore the coronavirus emergency, management has stated that 30% of all revenue would come from software in fiscal 2020, up from 22% in 2017.      \n     \nTL;DR  \n05/29 50C   \n05/15 44C",
        "subreddit": "wallstreetbets",
        "title": "CISCO SYSTEMS (CSCO)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gfg47b/cisco_systems_csco/",
        "created": 1588917268.0
    },
    {
        "author": "rennocsemaj",
        "created_utc": 1588544100,
        "id": "gczeay",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Hello, as a new investor myself i thought this message might make you think before making rash decisions you may later go on to regret.\n\nAbout 2 weeks ago while the markets were down i thought great, what a good time to invest. So i put some of my money onto a trading212 account and without even doing any research I bought contracts on crude oil without even knowing what the contracts meant. I did however, thanks to a reddit post realise my stupidity and got out of that quickly. \n\nI then thought right well i'll do some research and then re-evaluate. Now in my mind at this point doing research was simply browsing reddit, looking at what the general consensus was, seeing others portfolios and going off analysts. However, after doing that my portfolio was around 25 stocks big not even checking if they were overvalued or had a large amount of debt i just went for them because they were good companies imo. People commented say that this was way to many for a low amount of investment money (£5000). So i sold all the ones i could but i had to leave some that were in the red hoping that they recover.\n\nThis is where i really did my research. I wanted to invest long term so i was looking for profitable companies, with a decent dividend and large growth potential and preferably little debt. For me I much prefer comparing number but i found flicking through webpage to webpage was hard to keep up with especially when comparing multiple companies. So i decided to create my own google sheets page, which imported companies data depending on the ticker and i did calculations to get other values (this took some time). This allowed me to get a much clearer picture of what the different companies futures were like. It looks at their margins, ROI, ROE, ROA, EPS (tts), 1 year EPS, D/E, trailing P/E, forward P/E, P/B, P/C, P/FCF, PEG, dividend information, stock information as well as graphs to see which way the market is going (roughly, i know it unpredictable). I also looked and thought about the future of the companies and how it might affect their price e.g. Sony and Microsoft with the new generation consoles.\n\nAfter doing all this i have to say i found myself addicted to analysis, i **LOVE** it, i've managed to narrow down my stocks to 9 so they are easily trackable and i only plan to invest small amounts at a time (around £500 a week) until a clearer idea can be gathered amount the current market.\n\nI would encourage any of you new investors to do the same, it may take some time but it is worth it in the long run. You will also feel much more confident in your picks once you have done this.\n\nStock Picks:\n\nVUSA - 25%\n\nMA - 10%\n\nJNJ - 10%\n\nMSFT - 10%\n\nCSCO - 10%\n\nABBV - 10%\n\nPEP - 10%\n\nLOW - 10%\n\nRTX - 5%\n\n(There are others that i'm watching that are currently overvalued imo so waiting to see what the month brings)\n\nPlease let me know what you think, if you have any questions or have any advice for me.\n\nThanks!:):)",
        "subreddit": "stocks",
        "title": "Message to New Investors",
        "url": "https://www.reddit.com/r/stocks/comments/gczeay/message_to_new_investors/",
        "created": 1588572900.0
    },
    {
        "author": "bluebirds2020",
        "created_utc": 1588543249,
        "id": "gcz5v2",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "Hello everyone, I just need your opinion on my taxable \"dividend\" portfolio and if it's okay. I already maxed out my ROTH IRA . I'm investing $1,500 monthly in dividend stocks on my taxable account. I'm going to include only the ones I will invest regularly and not the ones I just rarely invest. Please see below and let me know what you think. Any others I should invest once in a while or regularly? Thank you!\n\nCSCO\n\nFZILX\n\nFZROX\n\nJNJ\n\nLEG\n\nMMM\n\nMO\n\nO\n\nPEP\n\nSBUX\n\nSTOR\n\nWFC",
        "subreddit": "investing",
        "title": "My Dividend Portfolio:",
        "url": "https://www.reddit.com/r/investing/comments/gcz5v2/my_dividend_portfolio/",
        "created": 1588572049.0
    },
    {
        "author": "rennocsemaj",
        "created_utc": 1588544751,
        "id": "gczkqx",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Hello, as a beginner investor myself i thought this message might make you think before making rash decisions you may later go on to regret.\n\nAbout 2 weeks ago while the markets were down i thought great, what a good time to invest. So i put some of my money onto a trading212 account and without even doing any research I bought contracts on crude oil without even knowing what the contracts meant. I did however, thanks to a reddit post realise my stupidity and got out of that quickly. \n\nI then thought right well i'll do some research and then re-evaluate. Now in my mind at this point doing research was simply browsing reddit, looking at what the general consensus was, seeing others portfolios and going off analysts. However, after doing that my portfolio was around 25 stocks big not even checking if they were overvalued or had a large amount of debt i just went for them because they were good companies imo. People commented say that this was way to many for a low amount of investment money (£5000). So i sold all the ones i could but i had to leave some that were in the red hoping that they recover.\n\nThis is where i really did my research. I wanted to invest long term so i was looking for profitable companies, with a decent dividend and large growth potential and preferably little debt. For me I much prefer comparing number but i found flicking through webpage to webpage was hard to keep up with especially when comparing multiple companies. So i decided to create my own google sheets page, which imported companies data depending on the ticker and i did calculations to get other values (this took some time). This allowed me to get a much clearer picture of what the different companies futures were like. It looks at their margins, ROI, ROE, ROA, EPS (tts), 1 year EPS, D/E, trailing P/E, forward P/E, P/B, P/C, P/FCF, PEG, dividend information, stock information as well as graphs to see which way the market is going (roughly, i know it unpredictable). I also looked and thought about the future of the companies and how it might affect their price e.g. Sony and Microsoft with the new generation consoles.\n\nAfter doing all this i have to say i found myself addicted to analysis, i **LOVE** it, i've managed to narrow down my stocks to 9 so they are easily trackable and i only plan to invest small amounts at a time (around £500 a week) until a clearer idea can be gathered amount the current market.\n\nI would encourage any of you new investors to do the same, it may take some time but it is worth it in the long run. You will also feel much more confident in your picks once you have done this.\n\nStock Picks:\n\nVUSA - 25%\n\nMA - 10%\n\nJNJ - 10%\n\nMSFT - 10%\n\nCSCO - 10%\n\nABBV - 10%\n\nPEP - 10%\n\nLOW - 10%\n\nRTX - 5%\n\n(There are others that i'm watching that are currently overvalued imo so waiting to see what the month brings)\n\nPlease let me know what you think, if you have any questions or have any advice for me.\n\nThanks!:):)",
        "subreddit": "investing",
        "title": "Message to other new investors",
        "url": "https://www.reddit.com/r/investing/comments/gczkqx/message_to_other_new_investors/",
        "created": 1588573551.0
    },
    {
        "author": "bennyboiioo",
        "created_utc": 1588916208,
        "id": "gfn7bc",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Invest?",
        "subreddit": "wallstreetbets",
        "title": "Tencent, Intel, and Cuckso (Cisco) making calls next week",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gfn7bc/tencent_intel_and_cuckso_cisco_making_calls_next/",
        "created": 1588945008.0
    },
    {
        "author": "tenziki",
        "created_utc": 1588824836,
        "id": "gezmgq",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Everyone knows that TMobile recently purchased Sprint.  \nBut people dont know that they are perhaps the leading company in 5g right now, its coverage compared to other carriers is the best(though not the fastest). They're currently rolling out the Stand Alone 5G mode which delivers better performance and range.  \n\"T-Mobile has partnered with companies like Cisco, Ericsson, MediaTek, Nokia, OnePlus, and Qualcomm to accomplish several standalone (SA) 5G world firsts. These include the first SA 5G data session between two commercial modems from two suppliers on a production network with Cisco, Ericsson, MediaTek, Nokia, and Qualcomm \"  \n [https://www.rcrwireless.com/20200505/carriers/t-mobile-ericsson-sa-5g-achievements](https://www.rcrwireless.com/20200505/carriers/t-mobile-ericsson-sa-5g-achievements)   \nMoreover, TMobile has continued to add new subscribers to its base beating all other carriers(Not including Sprint)   [https://www.barrons.com/articles/t-mobile-continues-to-outpace-at-t-verizon-now-the-focus-turns-to-sprint-and-5g-51588802443](https://www.barrons.com/articles/t-mobile-continues-to-outpace-at-t-verizon-now-the-focus-turns-to-sprint-and-5g-51588802443)   \nIts balance sheet does not look the best but it has been holding steady.\n\nIn the next 2 years we may see Tmobile achieving the top spot.  \n\n\nTMUS CALL 2021  \nERIC  CALL 2021",
        "subreddit": "wallstreetbets",
        "title": "Long $TMUS DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gezmgq/long_tmus_dd/",
        "created": 1588853636.0
    },
    {
        "author": "73hebdhyd6h36dhld",
        "created_utc": 1588382704,
        "id": "gbwp6y",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "I'm a new investor. Here's what I plan to buy. I have long term and short-term strategies mixed in. I have missed the optimal buying times for a few stocks but I wasn't aware of them at the time. I know I could buy my long-term stocks now but I want to see how well they will survive over the next months, especially the airlines so I want to wait. I'm still trying to decide on what to buy. I don't have FOMO. I will take what I can get.\n\nBudget: 50k+ (as I earn more money, it will increase. The more money I have, the more stocks I can hold long-term)\n\nLength of time: 2-3 years and 10+ years. 2-3 years is not a set time frame. It is a general time I would like to pull out for short-term gains but I can keep it in there longer if it needs more time.\n\nI'm trying to learn as much as I can. I know the market will rally during crashes and bear markets can last 1-3 years. I have bought stocks in the past two months but I'm not used to holding stocks during a volatile market so I prefer to stay out so I don't have to worry about them Some of the stocks I want aren't going to move much in price anyway so I'm not in a hurry to buy them. Any suggestions for stocks or objections to the ones I currently have are welcomed.\n\nVZ 1k\nJPM 1k\nPYPL 1k\nLUV 2K\nUAL 2k\nDAL 4K\nSAVE 4k\nSPG 5k\nAirbus 5k\nCSCO 3k \nIMAX 3k \nPRU and/or AFL 5k (want AFL more than PRU)\n$36k so far\n\nOther stocks I was considering\nMA, V, WM, HON, TSLA, SPCE, JNJ, FLIR, TER",
        "subreddit": "stocks",
        "title": "What do you think of my tentative portfolio?",
        "url": "https://www.reddit.com/r/stocks/comments/gbwp6y/what_do_you_think_of_my_tentative_portfolio/",
        "created": 1588411504.0
    },
    {
        "author": "foxyfox71",
        "created_utc": 1588903131,
        "id": "gfk6p1",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Hear this strategy for the upcoming Cisco (CSCO) earnings:\n\n* Step 1: Buy a shit ton of CSCO 50c 5/29 calls at $0.08\n* Step 2: Wait until Wednesday ER for the pump\n* Step 3: Ride the IV fluctuations until Wednesday and sell right before market close\n\nYou can basically buy 200 contracts (20,000 shares) for $1,000. If CSCO stock goes from $41.60 to $45.00 by 5/13, the estimated value of the contracts would be $4,600 (try yourself using the simulator below). This assumes that Cisco shares will increase by a moderate 7.8% in 5 days, which is nothing since there will be so much hype around it on Monday &amp; Tuesday! Am I missing something?\n\n[https://www.optionsprofitcalculator.com/calculator/long-call.html](https://www.optionsprofitcalculator.com/calculator/long-call.html)",
        "subreddit": "wallstreetbets",
        "title": "CSCO strategy: 3.6x returns almost guaranteed",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gfk6p1/csco_strategy_36x_returns_almost_guaranteed/",
        "created": 1588931931.0
    },
    {
        "author": "BlueLight03",
        "created_utc": 1588372236,
        "id": "gbrxjj",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": " \n\n\\- Apple\n\n\\- Amazon\n\n\\- Google\n\n\\- MSFT \n\n\\- TSLA\n\n\\- SBUX\n\n\\- PG\n\n\\- WFC \n\n\\- BNS\n\n\\- JPM\n\n\\- C\n\n\\- CSCO\n\n\\- IBM\n\n\\- LMT\n\n\\- RTX\n\n\\- Roku\n\n\\- BA\n\n\\- DAL\n\n\\- DIS\n\n\\- MA\n\n\\- DFS\n\n\\- AXP\n\n\\- XOM\n\n\\- CVX\n\n\\- DUK\n\n\\- KO\n\n\\- PepsiCo\n\n\\- ABBV\n\n\\- Pfizer\n\n\\- AMGN\n\n\\- JNJ\n\n\\- LOW\n\n\\- HD\n\n\\- WMT",
        "subreddit": "investing",
        "title": "Rate my Portfolio",
        "url": "https://www.reddit.com/r/investing/comments/gbrxjj/rate_my_portfolio/",
        "created": 1588401036.0
    },
    {
        "author": "Team_player444",
        "created_utc": 1588817361,
        "id": "gextp9",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "I'm itching to buy some calls ahead of earnings. I saw that they're expected to beat, and the chart seems like tomorow will be a good time to jump in. \n\nI usually find myself having trouble weighing the bad. What would be reasons not to buy in? Say $45 strike.",
        "subreddit": "stocks",
        "title": "CSCO Thoughts",
        "url": "https://www.reddit.com/r/stocks/comments/gextp9/csco_thoughts/",
        "created": 1588846161.0
    }
]