[
    {
        "author": "TripleBrain",
        "created_utc": 1591032018,
        "id": "guoo5j",
        "num_comments": 166,
        "num_crossposts": 1,
        "selftext": "Alright, ZM is on that retard running exercise program again. Looks like scalpers looking for a quick buck before earnings. This stock looks like it’s exactly higher lows for the last 3 months but it’s all driven by hype and disillusionment.\n\nHere’s what I know. Most people aren’t a paid subscriber. For example, from the info I’ve collected so far, 18/20 school districts that I had contact with are not on a paid plan. In fact, three of the local school districts in my area in the East Bay held fiscal meetings on Zoom, but they would tell everyone in the beginning of the meeting that there is a 45 minute limit and the meeting will close - that we would have to wait for another think to rejoin. That’s basically another way of saying, we ain’t paying for this shit. We on that free free. \n\nOn the topic of education, tutoring is a big income stream for ZM. A lot of tutors hosting 1-2 hour lessons actually pay for the professional option. My son and daughter’s tutors can host Zoom lessons for 2 hours without interruption for that reason. But just recently, both tutors are saying that they are preferring to meet in person now so save the cost of doing Zoom lessons. They said most tutors are returning in person lessons and that it should be safe to do so. So, there you have it. Another sector that is breaking off from Zoom. \n\nFor tech businesses which I’m directly associated with, some do pay for zoom and others don’t. Had a 2.5 hour conference with a partnering tech company a week ago and they had us rejoin with a new link twice. You would think a tech company would just buy a professional account if not better to host meetings, but no. For my company, I know that our plan is set to be canceled by end of June since people are heading back to work. \n\nMoreover, let’s take a look at ZM vs competitors. \nSkype fucked it up. Their one big moment and they busted too early. Google Meets/Hangouts has an incredibly simple UI and extended functions that work with Google’s numerous applications. Cisco webex, Google Hangouts, Jitsi Meet, Slack, Microsoft Teams to name a few are all doing virtually the same things. Nothing novel about ZM other than the frequent security issues. \n\nCompany is currently valued at 57B where 3 months ago it was worth around 10B. The shelter in place was great, but it’s about time ZM gets a big correction. I wouldn’t be surprised if this dips below $100 by July.",
        "subreddit": "wallstreetbets",
        "title": "ZM Will Lose 30% By Mid June",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/guoo5j/zm_will_lose_30_by_mid_june/",
        "created": 1591060818.0
    },
    {
        "author": "TripleBrain",
        "created_utc": 1591156008,
        "id": "gvmf01",
        "num_comments": 146,
        "num_crossposts": 0,
        "selftext": "TLDR: The numbers don't add up + 2021 guidance is complete garbage + standing firm on my previous prediction that ZM will correct 30% by mid June.\n\nReport Revenue: 328M\n\nReports that 88% of revenue comes from Enterprises, meaning 288M came from these businesses.\n\nReported Enterprise Users: 275,000\n\nThe Math:\n\nCost of enterprise plan - $19.99 per host/per month\n\nGiven that the 275,000 enterprise customers consist of companies with 10+ employees, lets say the ratio of host to employees is 1 host per 10 employees. Seems fair?\n\n Now lets assume that the average # of employees for these 275,000 accounts is 100 employees. Seems fair right? JPM Data for 2014 finds that 99% of American businesses are small businesses and 88% of that employs less than 20 employees. Based on my approximation of 100 employees on average, that would be 10 hosts per company or $199.90 per company/per month.\n\nSo, 275,000 accounts x $199.90 x 3 months for the quarter = \\~165M\n\n165M is pretty far off from 288M, no? Maybe they rounded up or something.\n\nBut wait, they also said 768 customers contribute 100K for a 12-month trailing revenue. So... that's an additional 76.8M in revenue. \n\n2 problems here: 1) they said these customers are not adjusted into the revenue since these are trailing (or extrapolated) numbers assuming they don't cancel their subscription. \n\n2) Even if we add the 76.8M, we are still short $46.2M.\n\nIf you're still following the math at this point, congrats!\n\nHere's the second part of this analysis and it has to do with it's outrageous guidance. Their CFO said they are estimating \"conservatively\" in their guidance, but they somehow suddenly doubled their forward 2021 guidance from $900M to $1.8B. Yes, you didn't read that wrong. $1.8B is their estimated 2021 \"conservative\" guidance. Does this remind you of any company that did this type of magic math when their underlying value increased by 200% in the month? Tilray anyone?\n\nWe are at a point where the peak pandemic is over and people can care less about getting infected at this point because their UI claims are running dry and they have to go back to work soon. Conveniently, Google hangouts/meets + Cisco Webex + Microsoft Teams among others are competing for their lion's share of this space. Here's the difference: They all have integrated technology that can link applications and they are also free. Teams and Google are also significantly safer from a security standpoint. Tech companies are also mainly using Teams. That leaves that 275,000 customers most likely small businesses with much fewer than 100 average employees. \n\nThe point is that Zoom will NEVER be able to hit 1.8B in revenue unless COVID-19 kills 1 million people overnight, Kim Jong Jun says he will be hosting his deathbed message on Zoom, a 5-year shelter in place is effective immediately, and they start pimping Zoom employees as escorts. \n\nThey are down in AH btw. Even after all that.",
        "subreddit": "wallstreetbets",
        "title": "Zoom Technology: Post ER Analysis",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gvmf01/zoom_technology_post_er_analysis/",
        "created": 1591184808.0
    },
    {
        "author": "notbrokemexican",
        "created_utc": 1592009346,
        "id": "h7x4l6",
        "num_comments": 104,
        "num_crossposts": 0,
        "selftext": "[https://preview.redd.it/d56i8543qk451.png?width=2192&amp;format=png&amp;auto=webp&amp;s=5696ee749fe79f6dd660c7e3b9c8d2ed39b8a8ee](https://preview.redd.it/d56i8543qk451.png?width=2192&amp;format=png&amp;auto=webp&amp;s=5696ee749fe79f6dd660c7e3b9c8d2ed39b8a8ee)\n\n[Cloudflare - Big Security](https://preview.redd.it/qvl409c9pk451.png?width=2018&amp;format=png&amp;auto=webp&amp;s=bc1334602948f2f82894dffee54fb2615ca0a220)\n\n# NET $40c 8/21\n\n# NET 35c 7/17\n\n# # WSBLearns Chapter 1 : An Introduction to the Cloud Computing Economy\n\n\\### Goals\n\n# - Answer \"What am I investing in when I risk money with CloudFlare?\"\n\n&amp;#x200B;\n\n# # My Motivation\n\nCloudFlare is releasing and bolstering support for streaming, video, and communications as a security-first cloud provider in the following week. This, on top of its rapidly growing developer platform, is consequential for many reasons as a market-mover in the industry. Theyre going to be printing a lot of money at a steady pace for a very long time and I thought you guys should know since you're all so desperate and pathetic right now for something good.\n\n&amp;#x200B;\n\n# # In Short\n\nCloudFlare so far has been shredding forward across multiple technical markets competing against by:\n\n&amp;#x200B;\n\n* Competing marketshare against CISCO, Palo Alto Networks, and other hardware customers\n* Offering a way to not lock your organization into a big tech vendor\n* Promoting security and challenging Big Tech's direction with web development\n* Forming positive relationships with Shopify, Facebook, JD, Twitter, Baidu, TOR, and Microsoft\n* Pioneering the ease-of-use privacy movement with [1.1.1.1](https://1.1.1.1) and distributing VPNs.\n* Growing a rapid, robust, cost-effective, and secure network across the world\n* *Providing a development platform that promotes the use extremely powerful and 'cutting edge' web computing.* \\-&gt; **YOU ARE HERE**\n\n&amp;#x200B;\n\n\\- Creating a better internet.\n\n&amp;#x200B;\n\n[This is the fucking Co-Founder of NPM who pioneered streaming technology en masse for developers.](https://preview.redd.it/zon44fsapk451.png?width=1204&amp;format=png&amp;auto=webp&amp;s=a1838127869af81ba9ff2fcaa50f4b8e2028af51)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # The Thesis\n\nThe economic value and convergence between e-commerce, global networking speeds, and video advancements is not anywhere close to realized. There has been an acceleration toward this reality but it's still early in the overall economic development cycle. This timeframe has been accelerated greatly due to global market lockdowns and further risk of lockdown.\n\n&amp;#x200B;\n\nPhysical and monetary assets being virtualized has recently been accelerated in importance and this will have positive effects, across time, on businesses that focus on securing those assets in its time spent delivering on multiple ultra-high-speed networks across the world. Computing is getting cheaper and easier to distribute in rather extreme ways and the execution of these ideas is happening right now.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[The network has enormous inherent value. Just look at Akamai's stock history for example. This data has been \\\\\"crunched\\\\\". 2-5 years accelerated in 1.](https://preview.redd.it/8fhkpr6cpk451.png?width=696&amp;format=png&amp;auto=webp&amp;s=3e2d6301242fd7526116a116cd27bb0d101d6bc4)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nInfrastructure that support these interactive ecosystems will be growing at incredible rates. This market is **\\*\\*BIG\\*\\*** and no one or two players will be large enough to capture the market. It ranges from manufacturers, energy departments, web products, hospitals, governments, and so on. Security is serviced differently based on the industry. This much is obvious - a hospital will clearly protect patient records more closely than a manufacturer controlling the runtime of their high-speed machining assembly line.\n\n&amp;#x200B;\n\n[Z-Scaler makes bank off manufacturing and supply chain operations](https://preview.redd.it/xzj23zndpk451.png?width=1880&amp;format=png&amp;auto=webp&amp;s=7e5e7aad5ede4a438f5eeffad6c4bfb1f8ae363b)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[Cloudflare prioritizes hospitals and offers a lot of good shit for very little.](https://preview.redd.it/jcusezeepk451.png?width=1912&amp;format=png&amp;auto=webp&amp;s=c5a66a435eb01690854f53eb3b63c5ca3a332100)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[Amazon and FB obvious target web retailers more](https://preview.redd.it/bws0ruafpk451.png?width=1926&amp;format=png&amp;auto=webp&amp;s=22bf2d5ac9eb01d871f16cdee3f25bb3a1c28946)\n\n&amp;#x200B;\n\n[Fastly targets fast media and video processing. PAN Network? That's Fastly delivering it without it sucking like Reddit Videos.  That's what happens when you build one product really well.](https://preview.redd.it/h8ur2w3gpk451.png?width=1308&amp;format=png&amp;auto=webp&amp;s=b15f3c6270019ba2fc3e33c0be6731a86c6dbb72)\n\n&amp;#x200B;\n\nThe need for secure video, transactions, VR, and user experiences will be dramatically shot up and this is evident across many exciting technologies like Apple VR, Google Gaming, Square Banking, Facebook Shops with VR shopping, Microsoft software automations, and government developments.\n\n&amp;#x200B;\n\nNET is one of the best positioned companies to pioneer this market at scale.\n\n&amp;#x200B;\n\n# # Market drivers &amp; a brief history of modern computing\n\n&amp;#x200B;\n\n[This technology spearheaded us toward 5G.](https://preview.redd.it/qaokr6bhpk451.png?width=795&amp;format=png&amp;auto=webp&amp;s=973e2994fd2781b53299527e4966a5ef92dce117)\n\nThe history of CDNs took a much larger turn when YouTube and Netflix became big players in data production and needed to cooperate with Internet Service Providers to manage the new dam and  tunnels of water that the market had created.\n\n&amp;#x200B;\n\nAs many of you know, video data is large and streaming high quality videos at high speed to millions of users in real time was no laughing matter. Around this time you also began to see new products in ESports like [Twitch.tv](https://Twitch.tv) which would \"stream\" video.\n\n&amp;#x200B;\n\nWhat had happened was that tech companies discovered a more cost effective way of delivering video and it was through controlling the actual pipeline. You would receive atomized content as needed rather than waiting for blocks of video to be received on your end (this was problematic in early Youtube days with broadband and DSL)\n\n&amp;#x200B;\n\nThe paradigm began to shift. Cloud computing and asynchronous models began to gain steam in the developer profession. We began a defining chapter of web optimizations that still continue today with serverless computing, real-time data, and growing user-experiences. At this time you began to notice that you no longer had to refresh your web page to receive new data. Remember when Facebook started to notify you rather than you checking your notifications? Do you remember when you had to check your email?\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nToday, developers are able to create or distribute product and services using networking and data center functions. This is largely what is recognized as cloud and serverless computing. This is has many consequences but primarily allows for unbelievably fast responses and avenues for user experiences.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[A solo developer can have a student upload a meme for an assignment, have that image analyzed for text, and automatically answer the question if it was right.](https://preview.redd.it/a645yz1jpk451.png?width=1626&amp;format=png&amp;auto=webp&amp;s=c0ce37c55836f08c86b95a5dec4150f247b7d175)\n\n&amp;#x200B;\n\n# # What is serverless computing?\n\n&amp;#x200B;\n\nServerless computing allows a 25 year old developer like me run 5 different businesses on my dinky little Macintosh while I let Google and Cloudflare run my servers under an extremely cheap pricing model. That is a revolutionary change for software. It is one of the bread and butter of SaaS, IaaS, and other cloud style businesses where many business problems come out of the box for you.\n\n&amp;#x200B;\n\n[Out of the box business solutions.](https://preview.redd.it/7qq6h6ujpk451.png?width=1330&amp;format=png&amp;auto=webp&amp;s=b0bf6314cf4c937427ff4011c3891eebc11477b4)\n\n&amp;#x200B;\n\n# # Other competitive advantages of network and cloud computing\n\nThe reason Snapchat did not gain any traction outside of the US was because Facebook provided a fundamentally faster service across WhatsApp and Instagram. Facebook's investment in Akamai and its personal networking infrastructure allowed them to create a product that was fast, cheap and would work in various rural or economic conditions. Snapchat never stood a chance in the global social media landscape as a result.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[Deep investments in infrastructure means DEEP growth](https://preview.redd.it/svayplokpk451.png?width=1866&amp;format=png&amp;auto=webp&amp;s=1bcc17951f303841dcaaa13f54063f927efd7dac)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # What's special about CloudFlare as a network?\n\nWhat CloudFlare specifically offers against its competitors is its ***\\*\\*privacy-first approach\\*\\**** and its quality of engineering. CloudFlare is essentially a distributed private content delivery network (pCDN) with a massive infrastructure effort to send data around the world safely and cheaply.\n\n&amp;#x200B;\n\nThis is fundamentally consequential as we are seeing massive nations tackle issues with how data can be utilized or privatized.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[Extremely high quality engineering = less costs = more market capture](https://preview.redd.it/pu4xoq3mpk451.png?width=1624&amp;format=png&amp;auto=webp&amp;s=6b4217b2bad4ffa80c00439499b00c79c420b77b)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[Good relationships with enterprise = money city. JD, Shopify, Facebook, Baidu, Microsoft, Google, the list is endless.](https://preview.redd.it/3jzf2xunpk451.png?width=1660&amp;format=png&amp;auto=webp&amp;s=860f163fe96972a221cfd356174e747535144d25)\n\n&amp;#x200B;\n\n# # Where Does CloudFlare currently stand in the market?\n\n&amp;#x200B;\n\n[These needs have only dramatically increased since covid.](https://preview.redd.it/djrvsq5zpk451.png?width=600&amp;format=png&amp;auto=webp&amp;s=634caaa6d9abe482ed7d7c5c6bb57768c91b552e)\n\n[How they view themselves in the market.](https://preview.redd.it/oicb754ypk451.png?width=1670&amp;format=png&amp;auto=webp&amp;s=ef1d3a8eeecf161a6387bf10cfbc1a4e389de52e)\n\n&amp;#x200B;\n\n[The local ecosystem.](https://preview.redd.it/tzcutumwpk451.png?width=1152&amp;format=png&amp;auto=webp&amp;s=158913217acdde59fd175ead4203cbe45481e842)\n\n&amp;#x200B;\n\n[Cloudflare is cyber security](https://preview.redd.it/nus93moopk451.png?width=1080&amp;format=png&amp;auto=webp&amp;s=02bea0bdefa6cbd00fb31410d4783415a3b8443e)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[Cloudflare allows Big Tech to tackle challenging issues they face as they scale with sensitive data.](https://preview.redd.it/ewkm8hhqpk451.png?width=1284&amp;format=png&amp;auto=webp&amp;s=7f2d75d76f3292a36f3e11778ab859b8031f9a47)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[Their network is larger than Amazon and theyre trusted around the world much more than other networks.](https://preview.redd.it/d56i8543qk451.png?width=2192&amp;format=png&amp;auto=webp&amp;s=5696ee749fe79f6dd660c7e3b9c8d2ed39b8a8ee)\n\n&amp;#x200B;\n\n# cant post more than 20 images because Fastly and Reddit sucks\n\n&amp;#x200B;\n\nvs Amazon below\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956536-11394680-a814-11ea-888f-e38467dc658d.png](https://user-images.githubusercontent.com/37036296/83956536-11394680-a814-11ea-888f-e38467dc658d.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # Deep market relationships\n\nCloudFlare has had large scale investments, partnerships, and business ventures with organizations like:\n\n&amp;#x200B;\n\n# JD Cloud and Chinese infrastructure, which will inevitably boom with revenue from video scaling, contentious privacy, e-commerce and infrastructure\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956688-8fe2b380-a815-11ea-934f-c6017bfa7395.png](https://user-images.githubusercontent.com/37036296/83956688-8fe2b380-a815-11ea-934f-c6017bfa7395.png))\n\n&amp;#x200B;\n\n# Supporting recent legends like Shopify\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956715-d1735e80-a815-11ea-8a0d-ad35a575866a.png](https://user-images.githubusercontent.com/37036296/83956715-d1735e80-a815-11ea-8a0d-ad35a575866a.png))\n\nhttps://preview.redd.it/nch0x7k1qk451.png?width=1254&amp;format=png&amp;auto=webp&amp;s=9303863a87f0cb84c408b414b89bd50e38b56a63\n\n&amp;#x200B;\n\n# Growing with global industry leaders\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956727-e94ae280-a815-11ea-9982-a1eabc5ec754.png](https://user-images.githubusercontent.com/37036296/83956727-e94ae280-a815-11ea-9982-a1eabc5ec754.png))\n\n&amp;#x200B;\n\n# A competitive proxy that approaches Big Tech's biggest legal problems\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956750-20b98f00-a816-11ea-97c2-89db7d3e94f1.png](https://user-images.githubusercontent.com/37036296/83956750-20b98f00-a816-11ea-97c2-89db7d3e94f1.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # So what does this mean for CloudFlare?\n\n# ## The missing puzzle piece: CloudFlare TV and Cloudflare Streaming\n\n# ### Target: Enterprise, profits, generosity, and long-term market capture.\n\n&amp;#x200B;\n\nA big piece that's missing from Cloudflare's economic puzzle is the release and support of distributed video and video development.\n\n&amp;#x200B;\n\n# Piece 1: Easy to use, distributed, private, secure networking\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956655-44300a00-a815-11ea-8d7b-36ceeae3eb2d.png](https://user-images.githubusercontent.com/37036296/83956655-44300a00-a815-11ea-8d7b-36ceeae3eb2d.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Piece 2: Easy to use, distributed, secure, cost-effective streaming\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956794-b3f2c480-a816-11ea-8b7b-5d2d3de080d9.png](https://user-images.githubusercontent.com/37036296/83956794-b3f2c480-a816-11ea-8b7b-5d2d3de080d9.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Piece 3: Easy to use, distributed, secure, cost-effective enterprise IT\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956818-d4228380-a816-11ea-81bf-5fa785b64bbd.png](https://user-images.githubusercontent.com/37036296/83956818-d4228380-a816-11ea-81bf-5fa785b64bbd.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Piece 4: Easy to use, distributed, secure, cost-effective software development\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956844-f1575200-a816-11ea-81b5-afbbcc12356e.png](https://user-images.githubusercontent.com/37036296/83956844-f1575200-a816-11ea-81b5-afbbcc12356e.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Piece 5: The missing piece. Easy to use, distributed, private, secure enterprise video.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956883-42674600-a817-11ea-995a-4db7f7b8b9db.png](https://user-images.githubusercontent.com/37036296/83956883-42674600-a817-11ea-995a-4db7f7b8b9db.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # My record\n\nI'm fairly conservative in my choice to purchase option or stock. I'm a software engineer that's passionate about education and have really enjoyed exercising my knowledge-base during this investment time. Usually i get really excited about a stock or two at best per year based on certain global developments. These stocks are selected based on powerful and consequential market relationships or competitions occurring in the arena and by simply just participating in the market as much as I can myself.\n\n&amp;#x200B;\n\nI have made a fair amount of money with\n\n&amp;#x200B;\n\n# - REDACTEDcoin &amp; AMD's computing relationship (Bought REDACTEDcoin at 2k, AMD at $11)\n\n&amp;#x200B;\n\n# - E-Commerce and Facebook's growing relationship with small businesses (my first options reached 20x on FB)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\ncurrently investing heavily in:\n\n&amp;#x200B;\n\n# - Privacy [CloudFlare, Big Tech, US, China, and global development]\n\n&amp;#x200B;\n\n# - Automation, manufacturing, and battery improvements [Panasonic, FANUC, Texas, Mexico and Japan]\n\n&amp;#x200B;\n\n# - Mexican-American trade [Kansas City Union, USMCA, and the Mexican economy]\n\n&amp;#x200B;\n\n# - Virtual Reality, gaming, AI with user-experience support, and fintech [Zoomers &amp; you]",
        "subreddit": "wallstreetbets",
        "title": "Cloudflare $NET DD - Cloud Infrastructure &amp; Security",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/h7x4l6/cloudflare_net_dd_cloud_infrastructure_security/",
        "created": 1592038146.0
    },
    {
        "author": "codingprofessor",
        "created_utc": 1591163589,
        "id": "gvo3ph",
        "num_comments": 80,
        "num_crossposts": 0,
        "selftext": "# edit: Looks like images arent previewing tonight.\n\n# tl;dr: $40c 8/21 &amp;&amp; 35c 7/17\n\n&amp;#x200B;\n\n# # Goals\n\n\\- Answer \"What am I investing in when I risk money with CloudFlare?\"\n\n# # The thesis\n\nThe economic value and convergence between e-commerce, networking speeds, and video advancements is not anywhere close to realized. There has been an acceleration toward this reality but it's still early in the overall development cycle.\n\nPhysical and monetary assets being virtualized has recently been accelerated in importance and this will have positive effects, across time, on businesses that focus on securing those assets in its time spent delivering on multiple ultra-high-speed networks across the world. Computing is getting cheaper and easier to distribute in rather extreme ways and the execution of these ideas is happening right now.\n\nThe need for secure video, transactions, VR, and user experiences will be dramatically shot up and this is evident across many exciting technologies like Apple VR, Google Gaming, Square Banking, Facebook Shops with VR shopping, Microsoft software automations, and government developments.\n\nInfrastructure that support these interactive ecosystems will be growing at incredible rates. NET is one of the best positioned companies to pioneer this market.\n\n[The networking market](https://mordorintelligence.com/images_db/RD_Images/1556091324027_Picture2.png)\n\n# # My motivation\n\nCloudFlare is releasing and bolstering support for streaming, video, and communications as a security-first cloud provider in the following week. This, on top of its rapidly growing developer platform, is consequential for many reasons as a market-mover in the industry.\n\n[CloudFlare Distributed Video Support](https://pbs.twimg.com/media/EZN7_YMVAAAE8Qg.jpg)\n\n&amp;#x200B;\n\n# # In Short\n\nCloudFlare so far has been shredding forward across multiple technical markets competing against by:\n\n\\- Competing marketshare against CISCO, Palo Alto Networks, and other hardware customers\n\n\\- Offering a way to not lock your organization into a big tech vendor\n\n\\- Promoting security and challenging Big Tech's direction with web development\n\n\\- Forming positive relationships with Shopify, Facebook, JD, Twitter, Baidu, TOR, and Microsoft\n\n\\- Pioneering the ease-of-use privacy movement with [1.1.1.1](https://1.1.1.1/) and distributing VPNs.\n\n\\- Growing a rapid, robust, cost-effective, and secure network across the world\n\n\\- **\\*\\*Providing a development platform that promotes the use extremely powerful and 'cutting edge' computing. -&gt; YOU ARE HERE**\n\n&amp;#x200B;\n\n[Cofounder of NPM - a module system where software developers shipped code. Acquired by Microsoft in the past year.](https://preview.redd.it/2upgkb0gvl251.png?width=1184&amp;format=png&amp;auto=webp&amp;s=4fc9c9c151e75d4b03671760e927bc5a75e8bc85)\n\n&amp;#x200B;\n\n# # So what is this technology anyway? A content delivery network.\n\nCDNs are distributed datacenters. This technology has been rapidly improving in the past 5 years and has drastically reduced the cost of business for small businesses and enterprises alike.\n\nThinking trucking logistics. You need to load up and send heavy duty materials, safely, quickly, and across multiple checkpoints along a highway.\n\nAn easy way to think about CDNs is to imagine it as the E in 4G LTE (Long Term Evolution). Through the power of CDNs, you're able to render images, videos, streams, content, data, transactions, privacy, and much more through the network.\n\n&amp;#x200B;\n\n[Securing digital assets on a reliable infrastructure for the most intensive computing cases.](https://preview.redd.it/dnpn9c3t4m251.png?width=2210&amp;format=png&amp;auto=webp&amp;s=2be51c709a803d5dbac47c4bb471d9ca77bc047c)\n\n&amp;#x200B;\n\n\\# Why does this market matter? Competitive advantages\n\nThe reason Snapchat did not gain any traction did not gain any traction outside of the US was because Facebook provided a fundamentally faster service across WhatsApp and Instagram. Facebook's investment in networking infrastructure allowed them to create a product that was fast , cheap and would work in various rural or economic conditions. Snapchat never stood a chance in the global social media landscape as a result.\n\n&amp;#x200B;\n\n# # What's special about CloudFlare as a network?\n\nWhat CloudFlare specifically offers against its competitors is its privacy-first approach. CloudFlare is essentially a distributed private network (VPN) with a massive infrastructure effort to send data around the world safely and cheaply. Privacy and speed sells.\n\n[Facebook: \"The future is private\"](https://preview.redd.it/gn6ibx4p4m251.png?width=1306&amp;format=png&amp;auto=webp&amp;s=8a88aa1e694ab0e62af8856bdeae914f62cd7182)\n\n&amp;#x200B;\n\n[Cloudflare grows with security](https://preview.redd.it/me09oa3pem251.png?width=2332&amp;format=png&amp;auto=webp&amp;s=658486274c4b3c61fa689c5166b14f8c5775a953)\n\n&amp;#x200B;\n\n# # What is serverless computing?\n\nServerless computing allows a 25 year old developer like me run 5 different businesses on my dinky little Macintosh while I let Google and Cloudflare run my servers under an extremely cheap pricing model. That is a revolutionary change for software.\n\n\\&amp;#x200B;\n\n[Google's ML kit offers developer solutions for common machining problems](https://preview.redd.it/bv4j6nx47m251.png?width=2494&amp;format=png&amp;auto=webp&amp;s=7989e5953258cc5bcc3293971a5780595e949c71)\n\n\\&amp;#x200B;\n\n[Cloudflare lets you create your own and distribute them.](https://preview.redd.it/6n4sn4gc7m251.png?width=1530&amp;format=png&amp;auto=webp&amp;s=cd8b30aa9608e4e4e3d959820716b33b29548898)\n\n&amp;#x200B;\n\n\\# Where Does CloudFlare currently stand in the market?\n\n[In 2020, security and delivery increases.](https://preview.redd.it/spptqgf6yl251.png?width=600&amp;format=png&amp;auto=webp&amp;s=8020aaaacfa37fe2f493f2c7a7b7c6dd4e2f7174)\n\n&amp;#x200B;\n\n[CRWD now at 19.7B, Z-Scaler at 13.3B](https://preview.redd.it/afq494qjzl251.png?width=1154&amp;format=png&amp;auto=webp&amp;s=3a89e1ee92fc1a9c373a9a1109497960231f076d)\n\n[An iron lock on VPN and distributed security](https://preview.redd.it/powropc40m251.png?width=1224&amp;format=png&amp;auto=webp&amp;s=27205ea3a6e282963f801fbf5d4583facbf84c91)\n\n&amp;#x200B;\n\n[Competes against vendor lock in. Cloudflare vs Amazon Cloudfront CDN](https://preview.redd.it/1x6gfsjd0m251.png?width=2444&amp;format=png&amp;auto=webp&amp;s=2d4d6b797bfda3d9f3829f16af6d8bdae392485d)\n\n&amp;#x200B;\n\n[Increases competition in the serverless/cloud computing space](https://preview.redd.it/wrofhb001m251.png?width=1612&amp;format=png&amp;auto=webp&amp;s=b400f0f5bc056d03d7aac046f609f3bcba4ce431)\n\n&amp;#x200B;\n\n[Drastically more edge locaitons than Amazon and Google.](https://preview.redd.it/un437p0u1m251.png?width=800&amp;format=png&amp;auto=webp&amp;s=58d7d269c33eff2868f8316768242960d9fe86c8)\n\n[As a DNS provider](https://preview.redd.it/4yo9rbd64m251.png?width=2472&amp;format=png&amp;auto=webp&amp;s=cc96b24eb9507f30cc6920f4b0d94e2b2a7ecc87)\n\n&amp;#x200B;\n\n# # So what does this mean for CloudFlare?\n\n# ## The missing puzzle piece: CloudFlare TV and Cloudflare Streaming\n\nA big piece that's missing from Cloudflare's economic puzzle is the release and support of distributed video and video development\n\n[Closing the gap on Fastly's primary product (media management)](https://preview.redd.it/1u6lp2as7m251.png?width=1798&amp;format=png&amp;auto=webp&amp;s=815098ee5393a88f35af86017f61c38fa7a2c531)\n\n&amp;#x200B;\n\n[Piece 1: Distributed, private, secure networking](https://preview.redd.it/zoi83xlahm251.png?width=2178&amp;format=png&amp;auto=webp&amp;s=8373be8ffc9e1f1bd54c81b5cde0fc40db98386c)\n\n&amp;#x200B;\n\n[Piece 2: Distributed, private, secure streaming](https://preview.redd.it/v0h5qneggm251.png?width=2262&amp;format=png&amp;auto=webp&amp;s=20990db7b1063a8f6f72b8d63aa8ce1087c3c9de)\n\n&amp;#x200B;\n\n[Piece 3: Distributed, secure, private IT](https://preview.redd.it/j6pnlun3hm251.png?width=2416&amp;format=png&amp;auto=webp&amp;s=08e1eb6556bd86af62096b12ec59e07b00dd2e0a)\n\n&amp;#x200B;\n\n[Piece 4: Distributed, private, secure software development](https://preview.redd.it/h7osbezxgm251.png?width=2330&amp;format=png&amp;auto=webp&amp;s=e1534e944349784a59cad390074ae2f94b9d8220)\n\n&amp;#x200B;\n\n[Piece 5: The missing piece. Distributed, private, secure video.](https://preview.redd.it/kklpe6mrgm251.png?width=1196&amp;format=png&amp;auto=webp&amp;s=c42fbada434f23fbe03b151004fd57b69f236bd9)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # My record\n\nI'm fairly conservative in my choice to purchase option or stock. I'm a software engineer that's passionate about education and have really enjoyed exercising my knowledge-base during this investment time. Usually i get really excited about a stock or two at best per year based on certain global developments. These stocks are selected based on powerful and consequential market relationships or competitions occurring in the and simply just participating in the market as much as I can myself.\n\nI have made a fair amount of money with\n\n\\- Bitcoin &amp; AMD's computing relationship (Bought bitcoin at 2k, AMD at $11)\n\n\\- E-Commerce and Facebook's growing relationship with small businesses (my first options were 20x FB)\n\nI'm currently investing heavily in\n\n\\- Privacy **\\[\\*\\*CloudFlare, Big Tech, US, China, and global development\\*\\*\\]**\n\n\\- Automation, manufacturing, and battery improvements **\\[\\*\\*Panasonic, FANUC, Texas, Mexico and Japan\\*\\*\\]**\n\n\\- Mexican-American trade **\\[\\*\\*Kansas City Union, USMCA, and the Mexican economy\\*\\*\\]**\n\n\\- Virtual Reality, gaming, AI with user-experience support, and fintech **\\[\\*\\*Zoomers &amp; you\\*\\*\\]**",
        "subreddit": "wallstreetbets",
        "title": "Cloudflare and CloudflareTV - A visual guide to understanding CDNs, security networking, and cloud computing for non-technical investors.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gvo3ph/cloudflare_and_cloudflaretv_a_visual_guide_to/",
        "created": 1591192389.0
    },
    {
        "author": "bigfatbear2020",
        "created_utc": 1592154180,
        "id": "h8xg4i",
        "num_comments": 73,
        "num_crossposts": 0,
        "selftext": "\nPreface: I am not a tax advisor, accountant, or attorney so do your own due diligence......\n\nWarning: Fucking Wall of Text. \n\n**Super Gay Preface**:  Been a member of this sub for a short while, but like so many of you, I'm hooked. Though sometimes fully retarded and always highly dysfunctional, it always entertains. \n\nRegardless of what you think this place is, I would even go as far to say that with this pandemic and its collateral issues, WSB has provided a place where many go to escape reality for moment, lose money, and share in a good laugh. \n\nI couple months back, I noticed that there was a common theme that kept popping up in posts and continues to creep into the conversation recently: **charitable giving**. \n\nWhen those sweet Tendies get done printing, many of us are looking for a way to give back. Given the current level of volatility in the markets, we face unprecedented times in which to make (and lose) a fuckton of capital. (I use this term \"fuckton\" loosely as a fuckton to some is $500 and others it may be $500,000.)\n\nAt the same time, given the current social unrest, pandemic issues, and the state of the economy, there are also many ways to give back in meaningful ways and the act of charitable giving will become more relevant the further our society gets fucked with the beer virus.\n\nWithin the last four months, there have been posts like those of u/Minty_Fresh1, that discuss setting up charities and an actual GoFundMe page *Tendies for Tots* set up by u/haupt91 *(which is a fucking awesome name btw)*. There has also been an effort to do some live stream events for charity.\n\nWhat I am not seeing is a *permanent* vehicle for the WSB community's charitable donations.\n\nUp until now, you either see a post like “What charity should I give to?” or posts telling autists they should give to charity. This is a good start, but perhaps there is a better way for us to give and to deploy charitable donations as a group, versus sporadically as individuals. \n\n**The solution?**\n\nWe form our own fucking non-profit 501(c)(3) charity. **We call it AUTISTS UNITED. (AU).**\n\n**What do those numbers mean?**\n\nFor the uninitiated……\n\nA **501**(**c**)(**3**) **organization** is a corporation, trust, unincorporated association, or other type of **organization** exempt from federal income tax under section **501**(**c**)(**3**) of Title 26 of the United States Code. It is one of the 29 types of **501**(**c**) **nonprofit organizations** in the US.\n\n**Purpose of 501(c)(3) organizations and Autists United.**\n\nCongress has long recognized the importance of charitable and philanthropic organizations. Often, these organizations work hand-in-hand with the government serving the needy, revitalizing urban areas, protecting the environment and educating the public. \n\nCertain organizations formed with the public good as their paramount mission can apply for 501 (c)(3) tax-exempt status. This allows them to reinvest the full amount of money it earns and raises since no tax is ever due to the IRS.\n\nIn a nutshell, **AU** will be a non-profit 501 (c)(3) with the mission to invest, grow, and give assets to charities or other societal causes we select for meaningful and lasting impact. \n\nWSB members, instead of giving randomly to charities, donate into **AU** and then recommend and/or vote on how those assets should be invested. **The contributions are tax-deductible to WSB members and the assets in AU grow tax fucking free.** \n\nTHE RESULT: A tax efficient way to give back with charitable funds deployed according to the desire of our merry band of misfits vs. random charitable giving. \n\n**How does Autists United qualify for tax exempt status?**\n\nWhat most clearly distinguishes 501(c)(3) charities from other nonprofits is that donations to 501(c)(3) organizations are tax-deductible to their donors.\n\nTo qualify for tax-exempt status, an organization must be formed and operate for the benefit of the public good. However, a large majority of the organization’s activities must always further a charitable purpose. Any activity engaged in for profit can potentially cause the organization to lose its tax-exempt status. \n\nThere are certain states (think DE, WI, AZ, NV – leaning to DE formation) that are more favorable for setting up a non-profit, and we would form in one of those states. \n\nTax exempt status is then applied for with the IRS. The IRS has streamlined the application process which would allow us to obtain status much quicker than in previous years. \n\n**What is the advantage of a WSB charity vs. donating to the hundreds of other charities?**\n\n1. **Fucking control**. Right now, you select a charity, send a portion of your Tendies, and just hope that those funds are used according to your wishes. \n\nWith **AU,** we would have full control over how our charitable funds are allocated and to which cause. \n\n2. **Avoid the Bullshit**. Many \"charities\" have alarming issues with how donor funds are ultimately allocated. By establishing our own charity, we eliminate the noise and can ensure that donor funds are properly allocated and deployed to actual charitable causes. \n\nSome charities are awesome, don't get me wrong, but there are some bad fucking apples out there. Without getting into the many pitfalls of donating to many charities, here are a few links:\n\n[https://smartasset.com/mortgage/the-50-worst-charities-in-america-how-to-keep-from-being-scammed](https://smartasset.com/mortgage/the-50-worst-charities-in-america-how-to-keep-from-being-scammed)\n\n[https://medium.com/bestcompany/charity-scandals-the-six-ugliest-of-2016-19d3f1149a]\n\n3. **More focused giving**. By controlling our charitable contributions, we can be more focused on which organizations are most deserving at the time, or even which causes are most applicable depending on the current state of the country. \n\nTo play with this idea further: we could allocate charitable funds directly to communities of our members which many need it the most, or directly to deserving individuals or businesses. In other words, a sniper approach vs. using a shotgun. \n\n4. **Ability to pivot a charitable direction**. Instead of being locked in to one type of charity with your donation where the charitable mission is very niche, **AU** would be positioned to pivot to different charitable causes or specific areas of the country as the need arises.  \n\nI have been involved with private social clubs where this has worked very well. We could select, via voting or some other rational way, 3-4 charitable causes every quarter that we would, *en bloc*, provide contributions, or have member input on a rolling basis as to which causes are most applicable *now*. \n\nThere are other advantages and perks to providing large donations as a group, which I can address at a later time.\n\n**How the do we fund Autists United?**\n\nSame way as any other charity. Tax-exempt entities raise money to fund their activities in many ways. This can include soliciting donations and fundraising events (which WSB has dabbled in the past with live streaming funding of Autism Society of America). \n\nIn short, you give a portion of your Tendies via a donation to **AU**, and you get a tax-write off in return. **AU** can also be funded by stock donations and by it making investments via its own **stock portfolio**. \n\n**What the fuck did you just say about Stonks?**\n\nYes. While completely contrarian to WSB, the AU charity could *hold stonks as assets*. The value and appreciation of those assets can then be used for further charitable giving. \n\nTaking this concept even further----**AU** can hold stock in companies *to which it provides charitable contributions* provided that the contributions comply with IRS guidelines. \n\nIf you think this would be a conflict of interest and super fucked up, look at the Gates Foundation. They have been doing this shit for years. \n\nThe IRS doesn’t treat donations any differently than the profits the organization earns when making investments. As a result, the IRS does not impose income tax when a stock investment pays dividends or when it sells the stock for more than it purchased it for. \n\nAnd since 501(c)(3) organizations can receive donations of stock that are deductible to the donor, the tax savings to the organization are significant when it pays nothing for the stock. \n\nAgain, nothing novel here as most brokerages have vehicles set up for donating stock to charity. However, the difference by donating to the **AU** charity **is that we maintain control over how the charitable funds are used and deployed.** \n\nWe will also be in a much better position to see the impact of our charitable giving as a direct Donor - Recipient relationship is possible. AU would provide ongoing reports of activity and charitable giving to the WSB community. \n\nAny of you had parents who adopted a whale or a star or some shit for you when you were growing up and you got a report on it’s status every month? Like that. \n\n**Can I donate stocks to AU? What if the stonk is a winner?**\n\nGiving appreciated stock you’ve held for more than a year is better than giving cash. If you donate stonk that has increased in value since you bought it more than a year ago – and if you itemize deductions -- you can take a charitable deduction for the stonk’s fair market value on the day you give it away. \n\nYou’ll also avoid capital-gains taxes on the increase in value over time, which you would have had to pay if you sold the stonk then gave the charity the cash proceeds. \n\nYou can deduct the fair market value only if you hold the stock for more than a year before giving it away. If you’ve held it for less than a year, your deduction is limited to your cost basis -- what you paid for the stonk -- not the current value.\n\nBy donating stonk that has appreciated for more than a year, you are actually giving 20 percent more than if you sold the stonk and then made a cash donation. The reason is simple: avoiding capital gains taxes. The maximum federal capital gains tax rate is 20 percent on long-term holdings. \n\n**What if the stonk is a fucking loser?**\n\nIf it’s a losing stonk, it’s better to sell it and give the cash. If the stonk has lost value, it’s better to sell the stonk first and give the cash to the charity. You’ll still be able to deduct your charitable donation if you itemize, *but you’ll also be able to take a capital loss when you sell the investment*.\n\nIf you are concerned about capital gains in the future, a donation of some appreciated shares and then buying new shares to reset your cost basis at the current, higher price will reduce your future capital gains tax exposure if the stock continues to grow in value. \n\nFor stonk donations, many charities may not be able to easily accept a stonk donation. We will. \n\n**What the fuck is next?** \n\nCorporate formation, bylaws, IRS recognition of exemption for tax exempt status, state tax exemption (if required), and mission and vision statements. Treasury controls and accounting would be handled by reputable third-party firms selected by board of directors.\n\nDomain name is locked in for **AU**, and the toll-free telephone number **1-888-4-TENDIES** is reserved.\n\nI will pay for the legal fees and costs for setting this up using the proceeds I made from selling one of you retarded HTZ calls the day before the delisting news.  \n\n**What can I do to help?**\n\nWe need to set up a board of directors, as the board needs to be named for formation, so any WSB members that wish to be on the Board, just DM me. \n\nIt would be ideal if we have representation on the board from each geographical region in the country for balance, but this is not essential. \n\nWe need at least three members on the board, but the more the merrier, provided it is an odd number. In the DM, **please say a little about yourself and skill set, not just \"I'm in!\"**. \n\nTypically, IRS 501(c)(3) approval takes between 2 and 12 months, inclusive of likely written follow-up questions. Sometimes it takes a little less; sometimes a little more. \n\nThe goal would be to get IRS tax-exempt status ASAP, but before December 31st, so we can realize the charitable deductions on this year’s tax return. (Given the current state of IRS filings and the 10m pieces of unopened mail, this may be impossible, but at least we will be in queue.)\n\n**Who’s in...........?**\n\n&amp;#x200B;\n\nMy positions: long on LUV, LYV, CISCO calls; fucking daily with TVIX with large margin in 30-60 seconds scalps and then not calling her back; going in on AMEX tomorrow.",
        "subreddit": "wallstreetbets",
        "title": "The Convergence of Retardation and Philanthropy......Autists United, Inc.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/h8xg4i/the_convergence_of_retardation_and/",
        "created": 1592182980.0
    },
    {
        "author": "Investinwaffl3s",
        "created_utc": 1591138109,
        "id": "gvhs5y",
        "num_comments": 62,
        "num_crossposts": 0,
        "selftext": "Any good stonks to park my winnings on? Ideally something that won't go tits up (barring a general market crash)?\n\nI am already parked on AAPL, AMZN, BABA (bought in April).\n\nLast week I put a bunch into CSCO and FLIR which worked out nicely.\n\nI am thinking of buying shares of AMD and SNE, but I have no idea what else to buy. Maybe MSFT but I want something that is not near ATH and still has predictable room to grow",
        "subreddit": "wallstreetbets",
        "title": "Need some long term stonks to park some winnings at",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gvhs5y/need_some_long_term_stonks_to_park_some_winnings/",
        "created": 1591166909.0
    },
    {
        "author": "icyhotatortot",
        "created_utc": 1593133535,
        "id": "hfy4e0",
        "num_comments": 47,
        "num_crossposts": 0,
        "selftext": "I’m going to make this short and sweet because no one can read past the first paragraph anyway. \n\n\nPremiums are still cheap and volume is increasing everyday. Started around 24mil this morning and currently sitting above 40million. Lots of good news out there such as Nok picking up Singapore contracts, the resistance to Huwaeii, &amp; their backing from our boy Trump. \n\nI’m balls deep in Nokia. I strongly believe and have sources to show, that NOK will climb steadily over the next year. You can either jump in now or buy it off some idiot who sells next year when you realize you missed the big jump. \n\n\nhttps://investorplace.com/2020/06/buy-nokia-nok-stock-because-it-will-run-above-5-on-5g-hype/\n\nhttps://www.wsj.com/articles/white-house-federal-intervention-5g-huawei-china-nokia-trump-cisco-11593099054\n\n\nhttps://www.google.com/amp/s/www.cnbc.com/amp/2020/06/25/huawei-loses-out-to-nokia-ericsson-in-building-singapores-main-5g-networks.html\n\nPositions:\n\nJust over 11k in shares\n500 10/16 $5c\n300 8/31 8$c",
        "subreddit": "smallstreetbets",
        "title": "$Nok getting more attention.",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/hfy4e0/nok_getting_more_attention/",
        "created": 1593162335.0
    },
    {
        "author": "Rocfranklogjam001",
        "created_utc": 1591103372,
        "id": "gv71kp",
        "num_comments": 44,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Anecdotal DD to short csco",
        "url": "https://i.redd.it/gj91eveoxh251.jpg",
        "created": 1591132172.0
    },
    {
        "author": "WannabeStonks69",
        "created_utc": 1591036705,
        "id": "guq5v8",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "Boomers have absolutely rushed ZM like a bunch of Freshmen at Penn State. I don't think Zoom's earning's are gonna be good at ALL because of A.) the privacy fiasco, B.) Unrealistic market expectations and overvaluation, C.) Multiple other competitors. My relative's offices uses WebEx, and my teachers use MS teams. Zoom doesn't have enough of a backing in the corporate world as much as Cisco and Microsoft do, it seems absolutely out of touch with any semblance of reality. It's up another 13% today on the earnings hype, and I'm gonna print so many tendies riding this rollercoaster down. Lockdowns are ending, there is 0 rationale for this bullshit. Earnings are not gonna live up to market sentiment, and guidance will be down. Op income was down even though they barely added any new features. Idk wtf they're smoking up at the rating agencies but this is gonna be the next big short. Only bears buy zoom and bears are gay for taking covid seriously. [https://simfin.com/data/companies/963384](https://simfin.com/data/companies/963384)\n\nPremiums are high and I'm broke asf so:\n\npositions: 185/182.5 PDS 6/5",
        "subreddit": "smallstreetbets",
        "title": "ZM POOTS",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/guq5v8/zm_poots/",
        "created": 1591065505.0
    },
    {
        "author": "beta-one",
        "created_utc": 1591626324,
        "id": "gz0ah3",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "Converge Technology is a name I've been following for a while now and have been invested in for quite some time. I think this is a huge play that is not well-known and as someone who works in the industry here in Canada (for my US brethren there is an OTC listing as well) I can tell you it is starting to garner a lot of attention with 2 investment banks launching coverage on them recently (Raymond James, VIII Capital and they have previously been covered by Paradigm)\n\nSo what the hell is CTS and why should you care?\n\nConverge Technology acquires Information Technology Service Providers (ITSPs) that traditionally have a large component of hardware sales and convert them to a hybrid model that offers softwares. With 13 acquisitions to date, they are some of largest resellers of solutions from IBM, Cisco, and Dell.\n\nThe real value comes from reselling software &amp; cloud solutions. This includes VMware, Microsoft Azure, Amazon Cloud - they are also the second largest reseller of Red Hat in North America. They also incorporate managed services that include redundancy networks, disaster recovery, cybersecurity solutions + AI solutions.\n\nThe company is a roll-up play but does not issue equity, rather finance acquisitions with debt against their targets receivables. Accordingly they have ~$150m in debt so far. Part of managements strategy to deal with it this year is to swap it out for lower rate date (they pay 9.25% right now as a function of needing to be able to do acquisitions quickly.)\n\nFinancial Highlights\n\nRevenue Run rate of $1B in 2020. This includes $175m in recurring revenue from software, cloud and managed services Adjusted EBITDA Run Rate between $40m-$50m in 2020 Expected to be net income positive this year\n\nLet's take a look at valuation.\n\nI'll use $1.30 SP &amp; $150m just for nice round numbers. That takes us to an 2020 EV/S of ~0.3x and 2020 EV/EBITDA of ~5.6x using 50m (I expect them to be on the upper end of their guidance). Relatively speaking, these types of companies usually trade between 7-9x EV/EBITDA but DO NOT have a software component. As I mentioned, these guys last reported $175m of ARR (annual recurring revenue). That should take them up to about a 9-11x. So basically, we are looking at about a double from the current prices.\n\nAnd that's what is in line with analyst estimates. Targets have them between $2.50-$3.00.\n\nSo what are the catalysts that are going to take them there?\n\ni) Uplisting to the TSX later this year (here in Canada, that's the big board akin to NASDAQ/NYSE). This will bring more eyeballs and liquidity ii) More acquisitions later this year - these guys target 4-6 a year but with COVID hitting they are playing it cool for now. They have no real impact from COVID on their business, but they claim to be prudent and will wait to see how things play out on their targets over the next few months. iii) Swapping out the debt - As I mentioned, these guys will swap out the current debt for a facility with a much lower rate (LIBOR+2) or something to that effect. All that sweet sweet interest savings fall right to the bottom line. That will boost net income/EBITDA this year.\n\nWhat's the real catalyst that excites me?\n\nA takeout. Listen to the CEO speak. He constantly says \"we are the farm-team for private equity\". One day, and I have absolutely no idea when, but these guys will be bought out at a nice premium. This is a perfect PE business. Steady cash flows, recurring revenue and once you pay down the debt nothing to do but sit back and collect those sweet sexy cash flows.\n\nSo, that's my big play. Happy to answer questions and hear any feedback/thoughts.",
        "subreddit": "CanadianInvestor",
        "title": "Converge Technology (TSXV:CTS) - Small-Cap CDN Play",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/gz0ah3/converge_technology_tsxvcts_smallcap_cdn_play/",
        "created": 1591655124.0
    },
    {
        "author": "tommytatertots",
        "created_utc": 1591219130,
        "id": "gw2wy9",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "First, I want to say I know most of us, even the professionals have no idea what is going on, ever.\n\nSecond, nearly every news article and blog to me is consistently wrong. But what really pisses me off is the follow up news articles, postings, etc have a bogus explanation why something happened. The information that should of been presented prior if it were a true future analysis. There is no benefit figuring out a short term explanation for increase or decrease in a stock after the fact when the stock market is a future fight.\n\nFinally, I am no better than anyone else, but I get gut feeling on some stocks that just stand out based of their trend and my intuition. I haven't got cocky and gone all out on any of these, but I have strong feelings. For example:\n\no 2016 I invested $200 dollars into AMD (60 Shares) which is worth \\~$3200 today. I was looking through various businesses and saw AMD significantly lower than Intel at the time. It was like 2 dollars a share! I was certain it would have substantial growth, maybe dumb luck, maybe intuition. I won't lie, I have no idea when to sell and rarely do. They still appear to be doing so well and will have a significant hand in AI, future of gaming and other technologies. \n\no 2020 At the bottom of Tesla's stock in March trading about \\~350 a share, I knew that would quickly rebound as the future is now, the clear path to transportation is self driving just as significant as all revolutionary technologies. For me, when I retire in 30-40 years I see myself in a self driving RV, with virtual reality capabilities. So, I held off on Tesla at this time because I listed to people full of shit thinking the economy was going to crash and Tesla would be worth less than 250 a share. \n\no Currently, I've invested in a couple commercial airliners, because look at those margins. Analyzing how long it takes airlines to recover, I say full recovery in 2-3 years. I eyeballed Boeing hard, many articles cautioning 'too big to fail' what a load of garbage. They are critical to national transportation. I was going to put down $1,000 on them at about $120 per share. They are up to $173 per share today, and I believe this is only the beginning. \n\no Also, Ford is a lot like the airlines, I have watch this stock sadly die away for four years, and I don't think it will be gone for good. It was \\~9 a share prior to COVID, and went sub $5. I bought a little then and I think they could get to $7 maybe even 8$ before continued their downward trend. \n\nI deviated with my own holdings, but I want this to be about inaccurate articles saying we are going into a recession, specific companies are the next Apple/Amazon that usually go down. Seriously, look up old news articles on companies are overwhelmingly wrong. \n\nIf you are curious of my holdings: ALK, F, SBUX, WEN, MSFT, TSLA, CSCO, SFM, NVIDIA, KR, AMD, CANN\n\nIn the past 4 years, I have 50% gain. Whatever you do, don't buy CANN, I knew this was a dumb move, but i had a little greed in me when I did it.",
        "subreddit": "investing",
        "title": "Is it just me or is all investment news always wrong?",
        "url": "https://www.reddit.com/r/investing/comments/gw2wy9/is_it_just_me_or_is_all_investment_news_always/",
        "created": 1591247930.0
    },
    {
        "author": "notbrokemexican",
        "created_utc": 1591497640,
        "id": "gy4f7p",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "[https://github.com/Sheilf/Investment-Research/blob/master/Cloudflare.md](https://github.com/Sheilf/Investment-Research/blob/master/Cloudflare.md)\n\n\\- 40c NET 8/21\n\nGithub link so you guys can see inline pictures with captions since mods in investing forums wont let us epic DD threads anymore\n\n&amp;#x200B;\n\nIGNORE BELOW, USE THE LINK ABOVE \n\nIGNORE BELOW, USE THE LINK ABOVE\n\n==============\n\n&amp;#x200B;\n\n[https://user-images.githubusercontent.com/37036296/83950335-dbc63600-a7de-11ea-8307-c31c08faf49d.png](https://user-images.githubusercontent.com/37036296/83950335-dbc63600-a7de-11ea-8307-c31c08faf49d.png)\n\n&amp;#x200B;\n\nText for keywords:\n\n `\\`\\`\\``\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83950335-dbc63600-a7de-11ea-8307-c31c08faf49d.png`](https://user-images.githubusercontent.com/37036296/83950335-dbc63600-a7de-11ea-8307-c31c08faf49d.png)`)`\n\n`### Mods allow us to post images to DD threads wtf`\n\n`NET $40c 8/21`\n\n`NET 35c 7/17`\n\n`# WSBLearns Chapter 1 : An Introduction to the Cloud Computing Economy`\n\n`### Goals`\n\n`- Answer \"What am I investing in when I risk money with CloudFlare?\"`\n\n`# My Motivation`\n\n`CloudFlare is releasing and bolstering support for streaming, video, and communications as a security-first cloud provider in the following week. This, on top of its rapidly growing developer platform, is consequential for many reasons as a market-mover in the industry.`\n\n`# In Short`\n\n`CloudFlare so far has been shredding forward across multiple technical markets competing against by:`\n\n`- Competing marketshare against CISCO, Palo Alto Networks, and other hardware customers`\n\n`- Offering a way to not lock your organization into a big tech vendor`\n\n`- Promoting security and challenging Big Tech's direction with web development`\n\n`- Forming positive relationships with Shopify, Facebook, JD, Twitter, Baidu, TOR, and Microsoft`\n\n`- Pioneering the ease-of-use privacy movement with` [`1.1.1.1`](https://1.1.1.1/) `and distributing VPNs.`\n\n`- Growing a rapid, robust, cost-effective, and secure network across the world`\n\n`- _Providing a development platform that promotes the use extremely powerful and 'cutting edge' web computing._ **-&gt; YOU ARE HERE**`\n\n`- Creating a better internet.`\n\n`_**Cofounder of NPM - a primary pioneer in the cloud market**_`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83951310-7164c400-a7e5-11ea-8675-e265e7c15336.png`](https://user-images.githubusercontent.com/37036296/83951310-7164c400-a7e5-11ea-8675-e265e7c15336.png)`)`\n\n`# The Thesis`\n\n`The economic value and convergence between e-commerce, global networking speeds, and video advancements is not anywhere close to realized. There has been an acceleration toward this reality but it's still early in the overall economic development cycle. This timeframe has been accelerated greatly due to global market lockdowns and further risk of lockdown.`\n\n`Physical and monetary assets being virtualized has recently been accelerated in importance and this will have positive effects, across time, on businesses that focus on securing those assets in its time spent delivering on multiple ultra-high-speed networks across the world. Computing is getting cheaper and easier to distribute in rather extreme ways and the execution of these ideas is happening right now.`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83950869-9c99e400-a7e2-11ea-8373-3e6f2b42b4bc.png`](https://user-images.githubusercontent.com/37036296/83950869-9c99e400-a7e2-11ea-8373-3e6f2b42b4bc.png)`)`\n\n`Infrastructure that support these interactive ecosystems will be growing at incredible rates. This market is **BIG** and no one or two players will be large enough to capture the market. It ranges from manufacturers, energy departments, web products, hospitals, governments, and so on. Security is serviced differently based on the industry. This much is obvious - a hospital will clearly protect patient records more closely than a manufacturer controlling the runtime of their high-speed machining assembly line.`\n\n`_**ZScaler servicing manufacturing, IT, and industrial operations**_`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83950190-a5d48200-a7dd-11ea-8208-567a6345c005.png`](https://user-images.githubusercontent.com/37036296/83950190-a5d48200-a7dd-11ea-8208-567a6345c005.png)`)`\n\n`_**CloudFlare prioritizing hospital security over web retailers**_`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83950400-6e66d500-a7df-11ea-8814-212983bade56.png`](https://user-images.githubusercontent.com/37036296/83950400-6e66d500-a7df-11ea-8814-212983bade56.png)`)`\n\n`_**Amazon &amp;&amp; Facebook angling for web retailers over hospitals**_`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83950431-a66e1800-a7df-11ea-933e-1ac98bda30e8.png`](https://user-images.githubusercontent.com/37036296/83950431-a66e1800-a7df-11ea-933e-1ac98bda30e8.png)`)`\n\n`_**Fastly executes on video and media delivery**_`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83950653-45474400-a7e1-11ea-9e73-bdf121115612.png`](https://user-images.githubusercontent.com/37036296/83950653-45474400-a7e1-11ea-9e73-bdf121115612.png)`)`\n\n`The need for secure video, transactions, VR, and user experiences will be dramatically shot up and this is evident across many exciting technologies like Apple VR, Google Gaming, Square Banking, Facebook Shops with VR shopping, Microsoft software automations, and government developments.`\n\n`NET is one of the best positioned companies to pioneer this market at scale.`\n\n`# Market drivers &amp; a brief history of modern computing`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83951016-9bb58200-a7e3-11ea-8398-151ec1df2bae.png`](https://user-images.githubusercontent.com/37036296/83951016-9bb58200-a7e3-11ea-8398-151ec1df2bae.png)`)`\n\n`The history of CDNs took a much larger turn when YouTube and Netflix became big players in data production and needed to cooperate with Internet Service Providers to manage the new dam and tunnels of water that the market had created.`\n\n`As many of you know, video data is large and streaming high quality videos at high speed to millions of users in real time was no laughing matter. Around this time you also began to see new products in ESports like` [`Twitch.tv`](https://twitch.tv/) `which would \"stream\" video.`\n\n`What had happened was that tech companies discovered a more cost effective way of delivering video and it was through controlling the actual pipeline. You would receive atomized content as needed rather than waiting for blocks of video to be received on your end (this was problematic in early Youtube days with broadband and DSL)`\n\n`The paradigm began to shift. Cloud computing and asynchronous models began to gain steam in the developer profession. We began a defining chapter of web optimizations that still continue today with serverless computing, real-time data, and growing user-experiences. At this time you began to notice that you no longer had to refresh your web page to receive new data. Remember when Facebook started to notify you rather than you checking your notifications? Do you remember when you had to check your email?`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83951531-e1c01500-a7e6-11ea-87c0-f7bcdf9e6ffd.png`](https://user-images.githubusercontent.com/37036296/83951531-e1c01500-a7e6-11ea-87c0-f7bcdf9e6ffd.png)`)`\n\n`Today, developers are able to create or distribute product and services using networking and data center functions. This is largely what is recognized as cloud and serverless computing. This is has many consequences but primarily allows for unbelievably fast responses and avenues for user experiences.`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83951289-5003d800-a7e5-11ea-9aaf-c5b44063a66e.png`](https://user-images.githubusercontent.com/37036296/83951289-5003d800-a7e5-11ea-9aaf-c5b44063a66e.png)`)`\n\n`# What is serverless computing?`\n\n`Serverless computing allows a 25 year old developer like me run 5 different businesses on my dinky little Macintosh while I let Google and Cloudflare run my servers under an extremely cheap pricing model. That is a revolutionary change for software. It is one of the bread and butter of SaaS, IaaS, and other cloud style businesses where many business problems come out of the box for you.`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83955922-1941b800-a80d-11ea-8675-28c216be50eb.png`](https://user-images.githubusercontent.com/37036296/83955922-1941b800-a80d-11ea-8675-28c216be50eb.png)`)`\n\n`# Other competitive advantages of network and cloud computing`\n\n`The reason Snapchat did not gain any traction outside of the US was because Facebook provided a fundamentally faster service across WhatsApp and Instagram. Facebook's investment in Akamai and its personal networking infrastructure allowed them to create a product that was fast, cheap and would work in various rural or economic conditions. Snapchat never stood a chance in the global social media landscape as a result.`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83951349-b7218c80-a7e5-11ea-9901-abd22b1f776e.png`](https://user-images.githubusercontent.com/37036296/83951349-b7218c80-a7e5-11ea-9901-abd22b1f776e.png)`)`\n\n`# What's special about CloudFlare as a network?`\n\n`What CloudFlare specifically offers against its competitors is its **privacy-first approach** and its quality of engineering. CloudFlare is essentially a distributed private content delivery network (pCDN) with a massive infrastructure effort to send data around the world safely and cheaply.`\n\n`This is fundamentally consequential as we are seeing massive nations tackle issues with how data can be utilized or privatized.`\n\n`Privacy and speed sells. A Cloudflare sells it at the best price.`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83955846-4772c800-a80c-11ea-8f93-fc4fa6125455.png`](https://user-images.githubusercontent.com/37036296/83955846-4772c800-a80c-11ea-8f93-fc4fa6125455.png)`)`\n\n`_**Facebook: \"The future is private\"**_`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83955789-c0255480-a80b-11ea-87b6-d701ca44fb31.png`](https://user-images.githubusercontent.com/37036296/83955789-c0255480-a80b-11ea-87b6-d701ca44fb31.png)`)`\n\n`_**Cloudflare grows with the internet's need for security.**_`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83955755-6cb30680-a80b-11ea-8c18-8cd2ad32fb49.png`](https://user-images.githubusercontent.com/37036296/83955755-6cb30680-a80b-11ea-8c18-8cd2ad32fb49.png)`)`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83955821-067ab380-a80c-11ea-9c07-562e63977c79.png`](https://user-images.githubusercontent.com/37036296/83955821-067ab380-a80c-11ea-9c07-562e63977c79.png)`)`\n\n`# Where Does CloudFlare currently stand in the market?`\n\n`_**How they see themselves**_`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83956451-31b4d100-a813-11ea-93d0-2c273a982ce5.png`](https://user-images.githubusercontent.com/37036296/83956451-31b4d100-a813-11ea-93d0-2c273a982ce5.png)`)`\n\n`_**Against the ecosystem**_`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83956485-92440e00-a813-11ea-9ffc-2967560d639e.png`](https://user-images.githubusercontent.com/37036296/83956485-92440e00-a813-11ea-9ffc-2967560d639e.png)`)`\n\n`_**In 2020, all needs have increased.**_`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83956379-42187c00-a812-11ea-8c67-b2ba25016a61.png`](https://user-images.githubusercontent.com/37036296/83956379-42187c00-a812-11ea-8c67-b2ba25016a61.png)`)`\n\n`_**Drastically more edge locations than Big Tech globally in contested regions like Africa, China, and other economic frontiers.**_`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83956530-f9fa5900-a813-11ea-94af-d6da6774f8e5.png`](https://user-images.githubusercontent.com/37036296/83956530-f9fa5900-a813-11ea-94af-d6da6774f8e5.png)`)`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83956536-11394680-a814-11ea-888f-e38467dc658d.png`](https://user-images.githubusercontent.com/37036296/83956536-11394680-a814-11ea-888f-e38467dc658d.png)`)`\n\n`# Deep market relationships`\n\n`CloudFlare has had large scale investments, partnerships, and business ventures with organizations like:`\n\n`_**JD Cloud and Chinese infrastructure, which will inevitably boom with revenue from video scaling, contentious privacy, e-commerce and infrastructure**_`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83956688-8fe2b380-a815-11ea-934f-c6017bfa7395.png`](https://user-images.githubusercontent.com/37036296/83956688-8fe2b380-a815-11ea-934f-c6017bfa7395.png)`)`\n\n`_**Supporting recent legends like Shopify**_`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83956715-d1735e80-a815-11ea-8a0d-ad35a575866a.png`](https://user-images.githubusercontent.com/37036296/83956715-d1735e80-a815-11ea-8a0d-ad35a575866a.png)`)`\n\n`_**Growing with global industry leaders**_`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83956727-e94ae280-a815-11ea-9982-a1eabc5ec754.png`](https://user-images.githubusercontent.com/37036296/83956727-e94ae280-a815-11ea-9982-a1eabc5ec754.png)`)`\n\n`_**A competitive proxy that approaches Big Tech's biggest legal problems**_`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83956750-20b98f00-a816-11ea-97c2-89db7d3e94f1.png`](https://user-images.githubusercontent.com/37036296/83956750-20b98f00-a816-11ea-97c2-89db7d3e94f1.png)`)`\n\n`# So what does this mean for CloudFlare?`\n\n`## The missing puzzle piece: CloudFlare TV and Cloudflare Streaming`\n\n`### Target: Enterprise, profits, generosity, and long-term market capture.`\n\n`A big piece that's missing from Cloudflare's economic puzzle is the release and support of distributed video and video development.`\n\n`_**Piece 1: Easy to use, distributed, private, secure networking**_`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83956655-44300a00-a815-11ea-8d7b-36ceeae3eb2d.png`](https://user-images.githubusercontent.com/37036296/83956655-44300a00-a815-11ea-8d7b-36ceeae3eb2d.png)`)`\n\n`**_Piece 2: Easy to use, distributed, secure, cost-effective streaming_**`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83956794-b3f2c480-a816-11ea-8b7b-5d2d3de080d9.png`](https://user-images.githubusercontent.com/37036296/83956794-b3f2c480-a816-11ea-8b7b-5d2d3de080d9.png)`)`\n\n`**_Piece 3: Easy to use, distributed, secure, cost-effective enterprise IT_**`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83956818-d4228380-a816-11ea-81bf-5fa785b64bbd.png`](https://user-images.githubusercontent.com/37036296/83956818-d4228380-a816-11ea-81bf-5fa785b64bbd.png)`)`\n\n`**_Piece 4: Easy to use, distributed, secure, cost-effective software development_**`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83956844-f1575200-a816-11ea-81b5-afbbcc12356e.png`](https://user-images.githubusercontent.com/37036296/83956844-f1575200-a816-11ea-81b5-afbbcc12356e.png)`)`\n\n`**_Piece 5: The missing piece. Easy to use, distributed, private, secure enterprise video._**`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83956883-42674600-a817-11ea-995a-4db7f7b8b9db.png`](https://user-images.githubusercontent.com/37036296/83956883-42674600-a817-11ea-995a-4db7f7b8b9db.png)`)`\n\n`# My record`\n\n`I'm fairly conservative in my choice to purchase option or stock. I'm a software engineer that's passionate about education and have really enjoyed exercising my knowledge-base during this investment time. Usually i get really excited about a stock or two at best per year based on certain global developments. These stocks are selected based on powerful and consequential market relationships or competitions occurring in the arena and by simply just participating in the market as much as I can myself.`\n\n`I have made a fair amount of money with`\n\n`- Bitcoin &amp; AMD's computing relationship (Bought bitcoin at 2k, AMD at $11)`\n\n`- E-Commerce and Facebook's growing relationship with small businesses (my first options reached 20x on FB)`\n\n`currently investing heavily in:`\n\n`- Privacy [**CloudFlare, Big Tech, US, China, and global development**]`\n\n`- Automation, manufacturing, and battery improvements [**Panasonic, FANUC, Texas, Mexico and Japan**]`\n\n`- Mexican-American trade [**Kansas City Union, USMCA, and the Mexican economy**]`\n\n`- Virtual Reality, gaming, AI with user-experience support, and fintech [**Zoomers &amp; you**]`\n\n`\\`\\`\\``",
        "subreddit": "stocks",
        "title": "Cloudflare &amp; CloudflareTV - A visual guide to CDNs, Networking, and the Cloud for non-technical investors.",
        "url": "https://www.reddit.com/r/stocks/comments/gy4f7p/cloudflare_cloudflaretv_a_visual_guide_to_cdns/",
        "created": 1591526440.0
    },
    {
        "author": "hrm015",
        "created_utc": 1593376368,
        "id": "hhluqj",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "If both stocks were to drop, which one would you prioritize picking up? \n\nI like both because of the increasingly likely long-term shift to remote working. Curious what everyone here thinks. \n\nCSCO has a higher dividend, but we all feel that MSFT has higher capital gain upside, right?",
        "subreddit": "stocks",
        "title": "CSCO vs. MSFT",
        "url": "https://www.reddit.com/r/stocks/comments/hhluqj/csco_vs_msft/",
        "created": 1593405168.0
    },
    {
        "author": "notbrokemexican",
        "created_utc": 1591862171,
        "id": "h0utep",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Use this link for visuals\n\n[https://github.com/Sheilf/Investment-Research/blob/master/Cloudflare.md](https://github.com/Sheilf/Investment-Research/blob/master/Cloudflare.md)\n\n# **USE THE FUCKING LINK**\n\nimage\n\nMods allow us to post images to DD threads wtf\n\nNET $40c 8/21 NET 35c 7/17\n\nWSBLearns Chapter 1 : An Introduction to the Cloud Computing EconomyGoals\n\n* Answer \"What am I investing in when I risk money with CloudFlare?\"\n\nMy Motivation\n\nCloudFlare is releasing and bolstering support for streaming, video, and communications as a security-first cloud provider in the following week. This, on top of its rapidly growing developer platform, is consequential for many reasons as a market-mover in the industry.\n\nIn Short\n\nCloudFlare so far has been shredding forward across multiple technical markets competing against by:\n\n* Competing marketshare against CISCO, Palo Alto Networks, and other hardware customers\n* Offering a way to not lock your organization into a big tech vendor\n* Promoting security and challenging Big Tech's direction with web development\n* Forming positive relationships with Shopify, Facebook, JD, Twitter, Baidu, TOR, and Microsoft\n* Pioneering the ease-of-use privacy movement with 1.1.1.1 and distributing VPNs.\n* Growing a rapid, robust, cost-effective, and secure network across the world\n* *Providing a development platform that promotes the use extremely powerful and 'cutting edge' web computing.* **-&gt; YOU ARE HERE**\n* Creating a better internet.\n\n***Cofounder of NPM - a primary pioneer in the cloud market*** image\n\nThe Thesis\n\nThe economic value and convergence between e-commerce, global networking speeds, and video advancements is not anywhere close to realized. There has been an acceleration toward this reality but it's still early in the overall economic development cycle. This timeframe has been accelerated greatly due to global market lockdowns and further risk of lockdown.\n\nPhysical and monetary assets being virtualized has recently been accelerated in importance and this will have positive effects, across time, on businesses that focus on securing those assets in its time spent delivering on multiple ultra-high-speed networks across the world. Computing is getting cheaper and easier to distribute in rather extreme ways and the execution of these ideas is happening right now.\n\nimage\n\nInfrastructure that support these interactive ecosystems will be growing at incredible rates. This market is **BIG** and no one or two players will be large enough to capture the market. It ranges from manufacturers, energy departments, web products, hospitals, governments, and so on. Security is serviced differently based on the industry. This much is obvious - a hospital will clearly protect patient records more closely than a manufacturer controlling the runtime of their high-speed machining assembly line.\n\n***ZScaler servicing manufacturing, IT, and industrial operations*** image\n\n***CloudFlare prioritizing hospital security over web retailers*** image\n\n***Amazon &amp;&amp; Facebook angling for web retailers over hospitals*** image\n\n***Fastly executes on video and media delivery*** image\n\nThe need for secure video, transactions, VR, and user experiences will be dramatically shot up and this is evident across many exciting technologies like Apple VR, Google Gaming, Square Banking, Facebook Shops with VR shopping, Microsoft software automations, and government developments.\n\nNET is one of the best positioned companies to pioneer this market at scale.\n\nMarket drivers &amp; a brief history of modern computing\n\nimage\n\nThe history of CDNs took a much larger turn when YouTube and Netflix became big players in data production and needed to cooperate with Internet Service Providers to manage the new dam and tunnels of water that the market had created.\n\nAs many of you know, video data is large and streaming high quality videos at high speed to millions of users in real time was no laughing matter. Around this time you also began to see new products in ESports like Twitch.tv which would \"stream\" video.\n\nWhat had happened was that tech companies discovered a more cost effective way of delivering video and it was through controlling the actual pipeline. You would receive atomized content as needed rather than waiting for blocks of video to be received on your end (this was problematic in early Youtube days with broadband and DSL)\n\nThe paradigm began to shift. Cloud computing and asynchronous models began to gain steam in the developer profession. We began a defining chapter of web optimizations that still continue today with serverless computing, real-time data, and growing user-experiences. At this time you began to notice that you no longer had to refresh your web page to receive new data. Remember when Facebook started to notify you rather than you checking your notifications? Do you remember when you had to check your email?\n\nimage\n\nToday, developers are able to create or distribute product and services using networking and data center functions. This is largely what is recognized as cloud and serverless computing. This is has many consequences but primarily allows for unbelievably fast responses and avenues for user experiences.\n\nimage\n\nWhat is serverless computing?\n\nServerless computing allows a 25 year old developer like me run 5 different businesses on my dinky little Macintosh while I let Google and Cloudflare run my servers under an extremely cheap pricing model. That is a revolutionary change for software. It is one of the bread and butter of SaaS, IaaS, and other cloud style businesses where many business problems come out of the box for you.\n\nimage\n\nOther competitive advantages of network and cloud computing\n\nThe reason Snapchat did not gain any traction outside of the US was because Facebook provided a fundamentally faster service across WhatsApp and Instagram. Facebook's investment in Akamai and its personal networking infrastructure allowed them to create a product that was fast, cheap and would work in various rural or economic conditions. Snapchat never stood a chance in the global social media landscape as a result.\n\nimage\n\nWhat's special about CloudFlare as a network?\n\nWhat CloudFlare specifically offers against its competitors is its **privacy-first approach** and its quality of engineering. CloudFlare is essentially a distributed private content delivery network (pCDN) with a massive infrastructure effort to send data around the world safely and cheaply.\n\nThis is fundamentally consequential as we are seeing massive nations tackle issues with how data can be utilized or privatized.\n\nPrivacy and speed sells. A Cloudflare sells it at the best price. image\n\n***Facebook: \"The future is private\"*** image\n\n***Cloudflare grows with the internet's need for security.*** image image\n\nWhere Does CloudFlare currently stand in the market?\n\n***How they see themselves*** image\n\n***Against the ecosystem*** image\n\n***In 2020, all needs have increased.*** image\n\n***Drastically more edge locations than Big Tech globally in contested regions like Africa, China, and other economic frontiers.*** image image\n\nDeep market relationships\n\nCloudFlare has had large scale investments, partnerships, and business ventures with organizations like:\n\n***JD Cloud and Chinese infrastructure, which will inevitably boom with revenue from video scaling, contentious privacy, e-commerce and infrastructure*** image\n\n***Supporting recent legends like Shopify*** image\n\n***Growing with global industry leaders*** image\n\n***A competitive proxy that approaches Big Tech's biggest legal problems*** image\n\nSo what does this mean for CloudFlare?The missing puzzle piece: CloudFlare TV and Cloudflare StreamingTarget: Enterprise, profits, generosity, and long-term market capture.\n\nA big piece that's missing from Cloudflare's economic puzzle is the release and support of distributed video and video development.\n\n***Piece 1: Easy to use, distributed, private, secure networking*** image\n\n***Piece 2: Easy to use, distributed, secure, cost-effective streaming*** image\n\n***Piece 3: Easy to use, distributed, secure, cost-effective enterprise IT*** image\n\n***Piece 4: Easy to use, distributed, secure, cost-effective software development*** image\n\n***Piece 5: The missing piece. Easy to use, distributed, private, secure enterprise video.*** image\n\nMy record\n\nI'm fairly conservative in my choice to purchase option or stock. I'm a software engineer that's passionate about education and have really enjoyed exercising my knowledge-base during this investment time. Usually i get really excited about a stock or two at best per year based on certain global developments. These stocks are selected based on powerful and consequential market relationships or competitions occurring in the arena and by simply just participating in the market as much as I can myself.\n\nI have made a fair amount of money with\n\n* \\[REDACTED\\]COIN &amp; AMD's computing relationship (Bought \\[REDACTED\\]COIN at 2k, AMD at $11)\n* E-Commerce and Facebook's growing relationship with small businesses (my first options reached 20x on FB)\n\ncurrently investing heavily in:\n\n* Privacy \\[**CloudFlare, Big Tech, US, China, and global development**\\]\n* Automation, manufacturing, and battery improvements \\[**Panasonic, FANUC, Texas, Mexico and Japan**\\]\n* Mexican-American trade \\[**Kansas City Union, USMCA, and the Mexican economy**\\]\n* Virtual Reality, gaming, AI with user-experience support, and fintech \\[**Zoomers &amp; you**\\]",
        "subreddit": "wallstreetbets",
        "title": "Cloudflare $NET DD - CDNs, cybersecurity, and Big Tech data centers",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/h0utep/cloudflare_net_dd_cdns_cybersecurity_and_big_tech/",
        "created": 1591890971.0
    },
    {
        "author": "nplbmf",
        "created_utc": 1593223457,
        "id": "hgl0c1",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "I’ve been staring at and buying Nokia for at least six months. It’s intraday trading seems to be like a penny stock (which it is, technically) bouncing around by half a cent all day, everyday x10000000. News of US Govt investment? Doesn’t budge. New contract in China? Goes up .02. Cisco might buy us? Goes down. Corporate approves massive buyback? Crickets. It’s Nokia and Ericsson vs Huawei for global 5G, guaranteed income, yet it just doesn’t budge. What is happening?",
        "subreddit": "stocks",
        "title": "NOKIA OYJ: NOK: Is anyone else deep into NOK trying to figure out why it’s not going bananas?",
        "url": "https://www.reddit.com/r/stocks/comments/hgl0c1/nokia_oyj_nok_is_anyone_else_deep_into_nok_trying/",
        "created": 1593252257.0
    },
    {
        "author": "notbrokemexican",
        "created_utc": 1591497234,
        "id": "gy4bwg",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "[https://github.com/Sheilf/Investment-Research/blob/master/Cloudflare.md](https://github.com/Sheilf/Investment-Research/blob/master/Cloudflare.md)\n\n\\- 40c NET 8/21\n\nGithub link so you guys can see inline pictures with captions since mods in investing forums wont let us epic DD threads anymore\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nIGNORE THIS, USE THE LINK ABOVE IGNORE THIS, USE THE LINK ABOVE\n\nText for keywords:\n\n&amp;#x200B;\n\n[https://user-images.githubusercontent.com/37036296/83950335-dbc63600-a7de-11ea-8307-c31c08faf49d.png](https://user-images.githubusercontent.com/37036296/83950335-dbc63600-a7de-11ea-8307-c31c08faf49d.png) \\`\\`\\`\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83950335-dbc63600-a7de-11ea-8307-c31c08faf49d.png](https://user-images.githubusercontent.com/37036296/83950335-dbc63600-a7de-11ea-8307-c31c08faf49d.png))\n\n\\### Mods allow us to post images to DD threads wtf\n\nNET $40c 8/21\n\nNET 35c 7/17\n\n\\# WSBLearns Chapter 1 : An Introduction to the Cloud Computing Economy\n\n\\### Goals\n\n\\- Answer \"What am I investing in when I risk money with CloudFlare?\"\n\n\\# My Motivation\n\nCloudFlare is releasing and bolstering support for streaming, video, and communications as a security-first cloud provider in the following week. This, on top of its rapidly growing developer platform, is consequential for many reasons as a market-mover in the industry.\n\n\\# In Short\n\nCloudFlare so far has been shredding forward across multiple technical markets competing against by:\n\n\\- Competing marketshare against CISCO, Palo Alto Networks, and other hardware customers\n\n\\- Offering a way to not lock your organization into a big tech vendor\n\n\\- Promoting security and challenging Big Tech's direction with web development\n\n\\- Forming positive relationships with Shopify, Facebook, JD, Twitter, Baidu, TOR, and Microsoft\n\n\\- Pioneering the ease-of-use privacy movement with [1.1.1.1](https://1.1.1.1/) and distributing VPNs.\n\n\\- Growing a rapid, robust, cost-effective, and secure network across the world\n\n\\- \\_Providing a development platform that promotes the use extremely powerful and 'cutting edge' web computing.\\_ \\*\\*-&gt; YOU ARE HERE\\*\\*\n\n\\- Creating a better internet.\n\n\\_\\*\\*Cofounder of NPM - a primary pioneer in the cloud market\\*\\*\\_\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83951310-7164c400-a7e5-11ea-8675-e265e7c15336.png](https://user-images.githubusercontent.com/37036296/83951310-7164c400-a7e5-11ea-8675-e265e7c15336.png))\n\n\\# The Thesis\n\nThe economic value and convergence between e-commerce, global networking speeds, and video advancements is not anywhere close to realized. There has been an acceleration toward this reality but it's still early in the overall economic development cycle. This timeframe has been accelerated greatly due to global market lockdowns and further risk of lockdown.\n\nPhysical and monetary assets being virtualized has recently been accelerated in importance and this will have positive effects, across time, on businesses that focus on securing those assets in its time spent delivering on multiple ultra-high-speed networks across the world. Computing is getting cheaper and easier to distribute in rather extreme ways and the execution of these ideas is happening right now.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83950869-9c99e400-a7e2-11ea-8373-3e6f2b42b4bc.png](https://user-images.githubusercontent.com/37036296/83950869-9c99e400-a7e2-11ea-8373-3e6f2b42b4bc.png))\n\nInfrastructure that support these interactive ecosystems will be growing at incredible rates. This market is \\*\\*BIG\\*\\* and no one or two players will be large enough to capture the market. It ranges from manufacturers, energy departments, web products, hospitals, governments, and so on. Security is serviced differently based on the industry. This much is obvious - a hospital will clearly protect patient records more closely than a manufacturer controlling the runtime of their high-speed machining assembly line.\n\n\\_\\*\\*ZScaler servicing manufacturing, IT, and industrial operations\\*\\*\\_\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83950190-a5d48200-a7dd-11ea-8208-567a6345c005.png](https://user-images.githubusercontent.com/37036296/83950190-a5d48200-a7dd-11ea-8208-567a6345c005.png))\n\n\\_\\*\\*CloudFlare prioritizing hospital security over web retailers\\*\\*\\_\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83950400-6e66d500-a7df-11ea-8814-212983bade56.png](https://user-images.githubusercontent.com/37036296/83950400-6e66d500-a7df-11ea-8814-212983bade56.png))\n\n\\_\\*\\*Amazon &amp;&amp; Facebook angling for web retailers over hospitals\\*\\*\\_\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83950431-a66e1800-a7df-11ea-933e-1ac98bda30e8.png](https://user-images.githubusercontent.com/37036296/83950431-a66e1800-a7df-11ea-933e-1ac98bda30e8.png))\n\n\\_\\*\\*Fastly executes on video and media delivery\\*\\*\\_\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83950653-45474400-a7e1-11ea-9e73-bdf121115612.png](https://user-images.githubusercontent.com/37036296/83950653-45474400-a7e1-11ea-9e73-bdf121115612.png))\n\nThe need for secure video, transactions, VR, and user experiences will be dramatically shot up and this is evident across many exciting technologies like Apple VR, Google Gaming, Square Banking, Facebook Shops with VR shopping, Microsoft software automations, and government developments.\n\nNET is one of the best positioned companies to pioneer this market at scale.\n\n\\# Market drivers &amp; a brief history of modern computing\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83951016-9bb58200-a7e3-11ea-8398-151ec1df2bae.png](https://user-images.githubusercontent.com/37036296/83951016-9bb58200-a7e3-11ea-8398-151ec1df2bae.png))\n\nThe history of CDNs took a much larger turn when YouTube and Netflix became big players in data production and needed to cooperate with Internet Service Providers to manage the new dam and tunnels of water that the market had created.\n\nAs many of you know, video data is large and streaming high quality videos at high speed to millions of users in real time was no laughing matter. Around this time you also began to see new products in ESports like [Twitch.tv](https://twitch.tv/) which would \"stream\" video.\n\nWhat had happened was that tech companies discovered a more cost effective way of delivering video and it was through controlling the actual pipeline. You would receive atomized content as needed rather than waiting for blocks of video to be received on your end (this was problematic in early Youtube days with broadband and DSL)\n\nThe paradigm began to shift. Cloud computing and asynchronous models began to gain steam in the developer profession. We began a defining chapter of web optimizations that still continue today with serverless computing, real-time data, and growing user-experiences. At this time you began to notice that you no longer had to refresh your web page to receive new data. Remember when Facebook started to notify you rather than you checking your notifications? Do you remember when you had to check your email?\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83951531-e1c01500-a7e6-11ea-87c0-f7bcdf9e6ffd.png](https://user-images.githubusercontent.com/37036296/83951531-e1c01500-a7e6-11ea-87c0-f7bcdf9e6ffd.png))\n\nToday, developers are able to create or distribute product and services using networking and data center functions. This is largely what is recognized as cloud and serverless computing. This is has many consequences but primarily allows for unbelievably fast responses and avenues for user experiences.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83951289-5003d800-a7e5-11ea-9aaf-c5b44063a66e.png](https://user-images.githubusercontent.com/37036296/83951289-5003d800-a7e5-11ea-9aaf-c5b44063a66e.png))\n\n\\# What is serverless computing?\n\nServerless computing allows a 25 year old developer like me run 5 different businesses on my dinky little Macintosh while I let Google and Cloudflare run my servers under an extremely cheap pricing model. That is a revolutionary change for software. It is one of the bread and butter of SaaS, IaaS, and other cloud style businesses where many business problems come out of the box for you.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83955922-1941b800-a80d-11ea-8675-28c216be50eb.png](https://user-images.githubusercontent.com/37036296/83955922-1941b800-a80d-11ea-8675-28c216be50eb.png))\n\n\\# Other competitive advantages of network and cloud computing\n\nThe reason Snapchat did not gain any traction outside of the US was because Facebook provided a fundamentally faster service across WhatsApp and Instagram. Facebook's investment in Akamai and its personal networking infrastructure allowed them to create a product that was fast, cheap and would work in various rural or economic conditions. Snapchat never stood a chance in the global social media landscape as a result.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83951349-b7218c80-a7e5-11ea-9901-abd22b1f776e.png](https://user-images.githubusercontent.com/37036296/83951349-b7218c80-a7e5-11ea-9901-abd22b1f776e.png))\n\n\\# What's special about CloudFlare as a network?\n\nWhat CloudFlare specifically offers against its competitors is its \\*\\*privacy-first approach\\*\\* and its quality of engineering. CloudFlare is essentially a distributed private content delivery network (pCDN) with a massive infrastructure effort to send data around the world safely and cheaply.\n\nThis is fundamentally consequential as we are seeing massive nations tackle issues with how data can be utilized or privatized.\n\nPrivacy and speed sells. A Cloudflare sells it at the best price.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83955846-4772c800-a80c-11ea-8f93-fc4fa6125455.png](https://user-images.githubusercontent.com/37036296/83955846-4772c800-a80c-11ea-8f93-fc4fa6125455.png))\n\n\\_\\*\\*Facebook: \"The future is private\"\\*\\*\\_\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83955789-c0255480-a80b-11ea-87b6-d701ca44fb31.png](https://user-images.githubusercontent.com/37036296/83955789-c0255480-a80b-11ea-87b6-d701ca44fb31.png))\n\n\\_\\*\\*Cloudflare grows with the internet's need for security.\\*\\*\\_\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83955755-6cb30680-a80b-11ea-8c18-8cd2ad32fb49.png](https://user-images.githubusercontent.com/37036296/83955755-6cb30680-a80b-11ea-8c18-8cd2ad32fb49.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83955821-067ab380-a80c-11ea-9c07-562e63977c79.png](https://user-images.githubusercontent.com/37036296/83955821-067ab380-a80c-11ea-9c07-562e63977c79.png))\n\n\\# Where Does CloudFlare currently stand in the market?\n\n\\_\\*\\*How they see themselves\\*\\*\\_\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956451-31b4d100-a813-11ea-93d0-2c273a982ce5.png](https://user-images.githubusercontent.com/37036296/83956451-31b4d100-a813-11ea-93d0-2c273a982ce5.png))\n\n\\_\\*\\*Against the ecosystem\\*\\*\\_\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956485-92440e00-a813-11ea-9ffc-2967560d639e.png](https://user-images.githubusercontent.com/37036296/83956485-92440e00-a813-11ea-9ffc-2967560d639e.png))\n\n\\_\\*\\*In 2020, all needs have increased.\\*\\*\\_\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956379-42187c00-a812-11ea-8c67-b2ba25016a61.png](https://user-images.githubusercontent.com/37036296/83956379-42187c00-a812-11ea-8c67-b2ba25016a61.png))\n\n\\_\\*\\*Drastically more edge locations than Big Tech globally in contested regions like Africa, China, and other economic frontiers.\\*\\*\\_\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956530-f9fa5900-a813-11ea-94af-d6da6774f8e5.png](https://user-images.githubusercontent.com/37036296/83956530-f9fa5900-a813-11ea-94af-d6da6774f8e5.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956536-11394680-a814-11ea-888f-e38467dc658d.png](https://user-images.githubusercontent.com/37036296/83956536-11394680-a814-11ea-888f-e38467dc658d.png))\n\n\\# Deep market relationships\n\nCloudFlare has had large scale investments, partnerships, and business ventures with organizations like:\n\n\\_\\*\\*JD Cloud and Chinese infrastructure, which will inevitably boom with revenue from video scaling, contentious privacy, e-commerce and infrastructure\\*\\*\\_\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956688-8fe2b380-a815-11ea-934f-c6017bfa7395.png](https://user-images.githubusercontent.com/37036296/83956688-8fe2b380-a815-11ea-934f-c6017bfa7395.png))\n\n\\_\\*\\*Supporting recent legends like Shopify\\*\\*\\_\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956715-d1735e80-a815-11ea-8a0d-ad35a575866a.png](https://user-images.githubusercontent.com/37036296/83956715-d1735e80-a815-11ea-8a0d-ad35a575866a.png))\n\n\\_\\*\\*Growing with global industry leaders\\*\\*\\_\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956727-e94ae280-a815-11ea-9982-a1eabc5ec754.png](https://user-images.githubusercontent.com/37036296/83956727-e94ae280-a815-11ea-9982-a1eabc5ec754.png))\n\n\\_\\*\\*A competitive proxy that approaches Big Tech's biggest legal problems\\*\\*\\_\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956750-20b98f00-a816-11ea-97c2-89db7d3e94f1.png](https://user-images.githubusercontent.com/37036296/83956750-20b98f00-a816-11ea-97c2-89db7d3e94f1.png))\n\n\\# So what does this mean for CloudFlare?\n\n\\## The missing puzzle piece: CloudFlare TV and Cloudflare Streaming\n\n\\### Target: Enterprise, profits, generosity, and long-term market capture.\n\nA big piece that's missing from Cloudflare's economic puzzle is the release and support of distributed video and video development.\n\n\\_\\*\\*Piece 1: Easy to use, distributed, private, secure networking\\*\\*\\_\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956655-44300a00-a815-11ea-8d7b-36ceeae3eb2d.png](https://user-images.githubusercontent.com/37036296/83956655-44300a00-a815-11ea-8d7b-36ceeae3eb2d.png))\n\n\\*\\*\\_Piece 2: Easy to use, distributed, secure, cost-effective streaming\\_\\*\\*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956794-b3f2c480-a816-11ea-8b7b-5d2d3de080d9.png](https://user-images.githubusercontent.com/37036296/83956794-b3f2c480-a816-11ea-8b7b-5d2d3de080d9.png))\n\n\\*\\*\\_Piece 3: Easy to use, distributed, secure, cost-effective enterprise IT\\_\\*\\*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956818-d4228380-a816-11ea-81bf-5fa785b64bbd.png](https://user-images.githubusercontent.com/37036296/83956818-d4228380-a816-11ea-81bf-5fa785b64bbd.png))\n\n\\*\\*\\_Piece 4: Easy to use, distributed, secure, cost-effective software development\\_\\*\\*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956844-f1575200-a816-11ea-81b5-afbbcc12356e.png](https://user-images.githubusercontent.com/37036296/83956844-f1575200-a816-11ea-81b5-afbbcc12356e.png))\n\n\\*\\*\\_Piece 5: The missing piece. Easy to use, distributed, private, secure enterprise video.\\_\\*\\*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956883-42674600-a817-11ea-995a-4db7f7b8b9db.png](https://user-images.githubusercontent.com/37036296/83956883-42674600-a817-11ea-995a-4db7f7b8b9db.png))\n\n\\# My record\n\nI'm fairly conservative in my choice to purchase option or stock. I'm a software engineer that's passionate about education and have really enjoyed exercising my knowledge-base during this investment time. Usually i get really excited about a stock or two at best per year based on certain global developments. These stocks are selected based on powerful and consequential market relationships or competitions occurring in the arena and by simply just participating in the market as much as I can myself.\n\nI have made a fair amount of money with\n\n\\- Bitcoin &amp; AMD's computing relationship (Bought bitcoin at 2k, AMD at $11)\n\n\\- E-Commerce and Facebook's growing relationship with small businesses (my first options reached 20x on FB)\n\ncurrently investing heavily in:\n\n\\- Privacy \\[\\*\\*CloudFlare, Big Tech, US, China, and global development\\*\\*\\]\n\n\\- Automation, manufacturing, and battery improvements \\[\\*\\*Panasonic, FANUC, Texas, Mexico and Japan\\*\\*\\]\n\n\\- Mexican-American trade \\[\\*\\*Kansas City Union, USMCA, and the Mexican economy\\*\\*\\]\n\n\\- Virtual Reality, gaming, AI with user-experience support, and fintech \\[\\*\\*Zoomers &amp; you\\*\\*\\]\n\n\\`\\`\\`",
        "subreddit": "investing",
        "title": "Cloudflare &amp; CloudflareTV - A visual guide to CDNs, Networking, and the Cloud for non-technical investors.",
        "url": "https://www.reddit.com/r/investing/comments/gy4bwg/cloudflare_cloudflaretv_a_visual_guide_to_cdns/",
        "created": 1591526034.0
    },
    {
        "author": "EatAAs",
        "created_utc": 1593504745,
        "id": "hij3q7",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "HEWLETT PACKARD ENTERPRISE (HPE)\n\nI spent a good few hours looking into HPE on friday. its one of the few tech stocks which is still hanging about its post covid lows. Used to trade aound $15 per share pre Covid and after dropping to $8 in march its still just at $9.50, about 36% down.\n\nI have a thing for stocks which are underperforming, i feel like im getting a good deal. I take a look at the price over the past years and love to buy something at an all time low. In truth this is a behavioural bias and in no way provides better returns. In fact, an underperforming stock will likely continue to underperform and an outperforming stock will contiue to outperform. Having said that, every so often you come accross a gem, so long as you can rationalise the reasons the stock keeps dropping and can see the situation changing. \n\nBack to HPE, i like the sector, i like the current price level. Whats next?\n\nTime to look at some research and numbers.\n\nPrice earnings ratio is 8.3\n\nDividend is 5% - not bad, not great, but certainly not bad.\n\nRevneue - dropping year on year - very bad sign\n\nCredit Rating - BBB - Company has a low chance of going bankrupt - Google credit ratings for more info\n\na few more numbers, a bit more complex so i wont go into details now, but i also look at\n\nHow much equity in the company\n\nIntangible assets as a % of total assets\n\nFree Cash Flow\n\nCash from from operations\n\nAll in all the company has ok fundemental numbers, its certainly not a growing company but it wont go bankrupt. The main thing which should be a flashing warning sign is the falling revenue.\n\nCompanies where revenue is decreasing year on year indiciates that the company isnt performing well. Will probably not grow and provides little reason for the stock price to increase down the line.\n\nTime to look at what people are saying on the interenet about HPE.\n\nThere are quite a few investing forums on the interenet so you should be able to google the company and see what people are saying about the stock. usually peoples opinions are biased depending on whether they are invested in the stock or not, so take what you read with a pinch of salt.\n\nI did read one thing on reddit which was another red flag for me. It was an employee who spoke about work ethic at the company. It seems many of the employees there beleive they arent working for a leading tech company and have the attitde that they are only 'HP' not Apple/Amazon/Cisco so employees arent going the extra mile.\n\nAlso people on the HPE reddit were saying that their support is terrible and their products arent that great. Seems to me they are surviving by selling to their existing client base and provide few reasons for new clients to choose them.\n\nFinally i take a look at the professional analysts recomendations, usually analyst recomendations are biased and hardly anyone would say a stock is crap and should not be bought. There are quite a few reasons for this but i wont go into it now.\n\nIve attached a screen shot of the analyst recomendations for HPE. In short the red/yellow/green bar shows the number of analysts recomending you to sell/hold/buy the stock atm. Currently the stock is showing 26% of anaylsts say buy it, 65% say hold it (dont buy it if if you dont have it but dont sell it if you already hold it), and 9% say sell it. [https://imgur.com/tkVwH3Z](https://imgur.com/tkVwH3Z) (bloomberg)\n\nIn the end this stock is probably worth buying if you want to hold onto it for a month or two only as it might pull back to previous levels. Its not a good long term buy though, in my opinion. Revenue falling, lots of competition and bad employee work ethic.",
        "subreddit": "stocks",
        "title": "HEWLETT PACKARD ENTERPRISE (HPE) - My thoughts",
        "url": "https://www.reddit.com/r/stocks/comments/hij3q7/hewlett_packard_enterprise_hpe_my_thoughts/",
        "created": 1593533545.0
    },
    {
        "author": "victoryknocks1000",
        "created_utc": 1593068511,
        "id": "hfhjtj",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Tryna decide on how long I want to hold my stocks. I am a long-term investor, however I was kinda wondering if companies can actually stay strong for 10+ years. I know a few do like Apple, Microsoft, Disney, McDonalds, etc...however not sure if  growth stocks can stay strong for long time like SQ, NVDA, TTD, Shopify, or other growth stocks\n\nDon't most companies not actually stay strong for 10+ years? like only a handful do. Like GE or Cisco for example. They were humongous companies that seemed to be super strong forever but then kinda died down. (not an expert on those companies just using them as example if its possible for companies to actually sustain growth for long-term over 10-15+ years)",
        "subreddit": "investing",
        "title": "How long is long-term?",
        "url": "https://www.reddit.com/r/investing/comments/hfhjtj/how_long_is_longterm/",
        "created": 1593097311.0
    },
    {
        "author": "Torlek1",
        "created_utc": 1592965063,
        "id": "hesbvl",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Three articles came out recently, laying out the bull case and the bear case for Shopify (SHOP) with numbers:\n\n[Shopify is still undervalued, RBC analyst says](https://www.cantechletter.com/2020/06/shopify-is-still-undervalued-rbc-analyst-says/)\n\n[Cisco Vs. Shopify: A Cautionary Tale](https://seekingalpha.com/article/4355196-cisco-vs-shopify-cautionary-tale)\n\n[Dear Wall Street Analysts: Please Stop Upgrading Overhyped Tech Stocks](https://seekingalpha.com/article/4355112-dear-wall-street-analysts-please-stop-upgrading-overhyped-tech-stocks)\n\nThe first bear case suggests a two-thirds drop in market cap after the peak. I just don't think SHOP is anywhere near that peak.\n\nThe second bear case criticizes the very idea of a Total Addressable Market. However, this metric wasn't around at all during the dot-com bubble. I would say this metric actually serves as a good check against having dot-com valuations.\n\nI think the bull case made by RBC analyst may have stumbled upon the really long-term valuation of SHOP.\n\nIf one were to combine insights from all three articles, then SHOP has the potential to reach $1,000 with 0.4% of the current total addressable market ($800 billion). It could then shoot all the way past and reach $3,000, with perhaps ten times the market size. It could then either crash down or settle down over the long haul to $1,000.\n\n*Disclosure: Long on SHOP.*",
        "subreddit": "investing",
        "title": "Bull and bear case for Shopify (SHOP)?",
        "url": "https://www.reddit.com/r/investing/comments/hesbvl/bull_and_bear_case_for_shopify_shop/",
        "created": 1592993863.0
    },
    {
        "author": "zenitude97",
        "created_utc": 1591220984,
        "id": "gw3j2p",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Cisco Webex, MS Teams, Skype etc.\n\nThere are similar existing services provided by established and more trusted companies, they provide the same functionality zoom does as far as I know. So, is there any particular reason it surged during the pandemic with significant competition? Or are there something unique functions zoom provides which I'm not aware of?",
        "subreddit": "stocks",
        "title": "Is there any particular reason zoom has surged so much with existing competition?",
        "url": "https://www.reddit.com/r/stocks/comments/gw3j2p/is_there_any_particular_reason_zoom_has_surged_so/",
        "created": 1591249784.0
    },
    {
        "author": "codingprofessor",
        "created_utc": 1591158980,
        "id": "gvn3n3",
        "num_comments": 9,
        "num_crossposts": 1,
        "selftext": "tl;dr: $40c 8/21 &amp;&amp; 35c 7/17\n\n&amp;#x200B;\n\n\\# Goals\n\n\\- Answer \"What am I investing in when I risk money with CloudFlare?\"\n\n\\- Answer \"What's the difference between Fastly and Cloudflare?\"\n\n&amp;#x200B;\n\n\\# The thesis\n\nThe economic value and convergence between e-commerce, networking speeds, and video advancements is not anywhere close to realized. There has been an acceleration toward this reality but it's still early in the overall development cycle. \n\nPhysical and monetary assets being virtualized has recently been accelerated in importance and this will have positive effects, across time, on businesses that focus on securing those assets in its time spent delivering on multiple ultra-high-speed networks across the world.  Computing is getting cheaper and easier to distribute in rather extreme ways and the execution of these ideas is happening right now.\n\nThe need for secure video, transactions, VR, and user experiences will be dramatically shot up and this is evident across many exciting technologies like Apple VR, Google Gaming, Square Banking, Facebook Shops with VR shopping, Microsoft software automations, and government developments.\n\nInfrastructure that support these interactive ecosystems will be growing at incredible rates. NET is one of the best positioned companies to pioneer this market.\n\n[This graph has been crunched where 2019 skips straight to 2021-2023 levels.](https://preview.redd.it/2u6ede9bul251.png?width=1392&amp;format=png&amp;auto=webp&amp;s=95bf6696f2deaec72d5b3cce869d0aef5d2e59f9)\n\n&amp;#x200B;\n\n\\# My motivation\n\nCloudFlare is releasing and bolstering support for streaming, video, and communications as a security-first cloud provider in the following week. This, on top of its rapidly growing developer platform, is consequential for many reasons as a market-mover in the industry. \n\n&amp;#x200B;\n\n\\# In Short\n\nCloudFlare so far has been shredding forward across multiple technical markets competing against by:\n\n\\- Competing marketshare against CISCO, Palo Alto Networks, and other hardware customers \n\n\\- Offering a way to not lock your organization into a big tech vendor\n\n\\- Promoting security and challenging Big Tech's direction with web development\n\n\\- Forming positive relationships with Shopify, Facebook, JD, Twitter, Baidu, TOR, and Microsoft\n\n\\- Pioneering the ease-of-use privacy movement with [1.1.1.1](https://1.1.1.1) and distributing VPNs.\n\n\\- Growing a rapid, robust, cost-effective, and secure network across the world \n\n\\- \\*\\*Providing a development platform that promotes the use extremely powerful and 'cutting edge'  computing. -&gt; YOU ARE HERE\n\n&amp;#x200B;\n\n[Co-founder of NPM, a system developers used to send software modules. Pioneers in web computing. Acquired by Microsoft](https://preview.redd.it/2upgkb0gvl251.png?width=1184&amp;format=png&amp;auto=webp&amp;s=4fc9c9c151e75d4b03671760e927bc5a75e8bc85)\n\n&amp;#x200B;\n\n\\# So what is this technology anyway? A content delivery network.\n\nCDNs are distributed datacenters. This technology has been rapidly improving in the past 5 years and has drastically reduced the cost of business for small businesses and enterprises alike.\n\nThinking trucking logistics. You need to load up and send heavy duty materials, safely, quickly, and across multiple checkpoints along a highway.\n\nAn easy way to think about CDNs is to imagine it as the E in 4G LTE (Long Term Evolution). Through the power of CDNs, you're able to render images, videos, streams, content, data, transactions, privacy, and much more through the network.\n\n&amp;#x200B;\n\n[As a pioneer in the e-commerce space](https://preview.redd.it/dnpn9c3t4m251.png?width=2210&amp;format=png&amp;auto=webp&amp;s=2be51c709a803d5dbac47c4bb471d9ca77bc047c)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# Why does this market matter? Competitive advantages\n\nThe reason Snapchat did not gain any traction did not gain any traction outside of the US was because Facebook provided a fundamentally faster service across WhatsApp and Instagram. Facebook's investment in networking infrastructure allowed them to create a product that was fast , cheap and would work in various rural or economic conditions. Snapchat never stood a chance in the global social media landscape as a result.\n\n&amp;#x200B;\n\n\\# What's special about CloudFlare as a network?\n\nWhat CloudFlare specifically offers against its competitors is its privacy-first approach. CloudFlare is essentially a distributed private network (VPN) with a massive infrastructure effort to send data around the world safely and cheaply.  Privacy and speed sells.  \n\n\n&amp;#x200B;\n\n[Facebook: \\\\\"The future is private\\\\\"](https://preview.redd.it/gn6ibx4p4m251.png?width=1306&amp;format=png&amp;auto=webp&amp;s=8a88aa1e694ab0e62af8856bdeae914f62cd7182)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/me09oa3pem251.png?width=2332&amp;format=png&amp;auto=webp&amp;s=658486274c4b3c61fa689c5166b14f8c5775a953\n\n\\# What is serverless computing?\n\nServerless computing allows a 25 year old developer like me run 5 different businesses on my dinky little Macintosh while I let Google and Cloudflare run my servers under an extremely cheap pricing model. That is a revolutionary change for software.\n\n&amp;#x200B;\n\n[Google's ML kit offers developer solutions for common machining problems](https://preview.redd.it/bv4j6nx47m251.png?width=2494&amp;format=png&amp;auto=webp&amp;s=7989e5953258cc5bcc3293971a5780595e949c71)\n\n&amp;#x200B;\n\n[Cloudflare lets you create your own and distribute them.](https://preview.redd.it/6n4sn4gc7m251.png?width=1530&amp;format=png&amp;auto=webp&amp;s=cd8b30aa9608e4e4e3d959820716b33b29548898)\n\n&amp;#x200B;\n\n\\# Where Does CloudFlare currently stand in the market?\n\n[In 2020, security and delivery increases.](https://preview.redd.it/spptqgf6yl251.png?width=600&amp;format=png&amp;auto=webp&amp;s=8020aaaacfa37fe2f493f2c7a7b7c6dd4e2f7174)\n\n&amp;#x200B;\n\n[CRWD now at 19.7B, Z-Scaler at 13.3B](https://preview.redd.it/afq494qjzl251.png?width=1154&amp;format=png&amp;auto=webp&amp;s=3a89e1ee92fc1a9c373a9a1109497960231f076d)\n\n  \n\n\n[An iron lock on VPN and distributed security](https://preview.redd.it/powropc40m251.png?width=1224&amp;format=png&amp;auto=webp&amp;s=27205ea3a6e282963f801fbf5d4583facbf84c91)\n\n&amp;#x200B;\n\n[Competes against vendor lock in. Cloudflare vs Amazon Cloudfront CDN](https://preview.redd.it/1x6gfsjd0m251.png?width=2444&amp;format=png&amp;auto=webp&amp;s=2d4d6b797bfda3d9f3829f16af6d8bdae392485d)\n\n&amp;#x200B;\n\n[Increases competition in the serverless\\/cloud computing space](https://preview.redd.it/wrofhb001m251.png?width=1612&amp;format=png&amp;auto=webp&amp;s=b400f0f5bc056d03d7aac046f609f3bcba4ce431)\n\n&amp;#x200B;\n\n[Drastically more edge locaitons than Amazon and Google.](https://preview.redd.it/un437p0u1m251.png?width=800&amp;format=png&amp;auto=webp&amp;s=58d7d269c33eff2868f8316768242960d9fe86c8)\n\n[As a DNS provider](https://preview.redd.it/4yo9rbd64m251.png?width=2472&amp;format=png&amp;auto=webp&amp;s=cc96b24eb9507f30cc6920f4b0d94e2b2a7ecc87)\n\n&amp;#x200B;\n\n\\# So what does this mean for CloudFlare?   \n\n\n\\## The missing puzzle piece: CloudFlare TV and Cloudflare Streaming\n\nA big piece that's missing from Cloudflare's economic puzzle is the release and support of distributed video and video development\n\n[Closing the gap on Fastly's  primary product \\(media management\\)](https://preview.redd.it/1u6lp2as7m251.png?width=1798&amp;format=png&amp;auto=webp&amp;s=815098ee5393a88f35af86017f61c38fa7a2c531)\n\n&amp;#x200B;\n\n[Piece 1: Distributed, private, secure networking](https://preview.redd.it/zoi83xlahm251.png?width=2178&amp;format=png&amp;auto=webp&amp;s=8373be8ffc9e1f1bd54c81b5cde0fc40db98386c)\n\n&amp;#x200B;\n\n[Piece 2: Distributed, private, secure streaming](https://preview.redd.it/v0h5qneggm251.png?width=2262&amp;format=png&amp;auto=webp&amp;s=20990db7b1063a8f6f72b8d63aa8ce1087c3c9de)\n\n&amp;#x200B;\n\n[Piece 3: Distributed, secure, private IT](https://preview.redd.it/j6pnlun3hm251.png?width=2416&amp;format=png&amp;auto=webp&amp;s=08e1eb6556bd86af62096b12ec59e07b00dd2e0a)\n\n&amp;#x200B;\n\n[Piece 4: Distributed, private, secure software development](https://preview.redd.it/h7osbezxgm251.png?width=2330&amp;format=png&amp;auto=webp&amp;s=e1534e944349784a59cad390074ae2f94b9d8220)\n\n&amp;#x200B;\n\n[Piece 5: The missing piece. Distributed, private, secure video.](https://preview.redd.it/kklpe6mrgm251.png?width=1196&amp;format=png&amp;auto=webp&amp;s=c42fbada434f23fbe03b151004fd57b69f236bd9)\n\nPiece 2\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# My record\n\nI'm fairly conservative in my choice to purchase option or stock. I'm a software engineer that's passionate about education and have really enjoyed exercising my knowledge-base during this investment time. Usually i get really excited about a stock or two at best per year based on certain global developments. These stocks are selected based on powerful and consequential market relationships or competitions occurring in the and simply just participating in the market as much as I can myself. \n\nI have made a fair amount of money with\n\n\\- Bitcoin &amp; AMD's computing relationship (Bought bitcoin at 2k, AMD at $11)\n\n\\- E-Commerce and Facebook's growing relationship with small businesses  (my first options were 20x FB)\n\nI'm currently investing heavily in\n\n\\- Privacy \\[\\*\\*CloudFlare, Big Tech, US, China, and global development\\*\\*\\]\n\n\\- Automation, manufacturing, and battery improvements \\[\\*\\*Panasonic, FANUC, Texas, Mexico and Japan\\*\\*\\]\n\n\\- Mexican-American trade \\[\\*\\*Kansas City Union, USMCA, and the Mexican economy\\*\\*\\]\n\n\\- Virtual Reality, gaming, AI with user-experience support, and fintech \\[\\*\\*Zoomers &amp; you\\*\\*\\]",
        "subreddit": "wallstreetbets",
        "title": "Cloudflare's upcoming release of CloudflareTV - A Visual Guide to understanding CDNs, cybersecurity, and cloud computing as a non-technical investor.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gvn3n3/cloudflares_upcoming_release_of_cloudflaretv_a/",
        "created": 1591187780.0
    },
    {
        "author": "someguygirl",
        "created_utc": 1591055712,
        "id": "guw5po",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "\\-Crosspost-\n\nMy portfolio has been like this for  \\~3 years and it's time to change. Something! I entered these at low  prices, Cisco has doubled and the FB/MSFT I was in at \\~143$, BioPath -  forget it, down 73%\n\nWhat should I  do? Take half and invest in a Tech ETF and the other in a global fund?  Or take some gains  and speculate on whatever stock and grow the  investment xxx%?\n\n&amp;#x200B;\n\nBPTH\n\nBIO-PATH HOLDINGS \t      $522 \t\t1.22% \n\nCSCO\n\nCISCO SYSTEMS INC \t\t     $21,652.26 \t50.62% \t\t\n\nFB\n\nFACEBOOK INC CLASS A \t      $11,595.50 \t27.11% \t\t\n\nMSFT\n\nMICROSOFT CORP \t\t\t$7,729.47 \t18.07%",
        "subreddit": "investing",
        "title": "Rate my portfolio - how do I move forward?",
        "url": "https://www.reddit.com/r/investing/comments/guw5po/rate_my_portfolio_how_do_i_move_forward/",
        "created": 1591084512.0
    },
    {
        "author": "top-shelf20",
        "created_utc": 1593057139,
        "id": "hffkci",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "I am in the search for tech stocks trading at decent valuations. What are the more underrated tech stocks in your opinion?  \n\nI can’t seem to find that many besides Intel, IBM, Cisco, Verizon and a few others.",
        "subreddit": "stocks",
        "title": "Tech stocks for value investors",
        "url": "https://www.reddit.com/r/stocks/comments/hffkci/tech_stocks_for_value_investors/",
        "created": 1593085939.0
    },
    {
        "author": "sheesh-lxfty",
        "created_utc": 1591456156,
        "id": "gxsnw7",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "You get to sell off for profits in this sector who you got for safe keeping for the next 4-6 months?",
        "subreddit": "stocks",
        "title": "USF vs. Cisco vs. UNFI",
        "url": "https://www.reddit.com/r/stocks/comments/gxsnw7/usf_vs_cisco_vs_unfi/",
        "created": 1591484956.0
    },
    {
        "author": "realslimcheney",
        "created_utc": 1592244509,
        "id": "h9li7w",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Cisco? Thoughts?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/h9li7w/cisco_thoughts/",
        "created": 1592273309.0
    },
    {
        "author": "adutchgent",
        "created_utc": 1592684809,
        "id": "hct5jm",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Dear fellow investors,\n\nI’m slowly but surely looking to build a portfolio for a minimum holding period of 5+ years. One of the trends I would like to invest in is Digital / IOT. I’ve been doing some preliminary research and there’s a ton of applications within this industry that we can seek to exploit. Think security, cloud, payments, communications, smoother b2b activity, etc. This has led me to mammoth companies like Cisco and Microsoft, but also newer players like Okta, Docusign, and Genpact. \n\nI was wondering who else is actively following this theme, and if so which companies you are monitoring / investing in, and for which reasons. Note this is purposely a very broad question as I have much more to learn about this industry before actually investing in it. \n\nThanks!",
        "subreddit": "stocks",
        "title": "Investing in IOT / Digitization",
        "url": "https://www.reddit.com/r/stocks/comments/hct5jm/investing_in_iot_digitization/",
        "created": 1592713609.0
    },
    {
        "author": "Elekcktra",
        "created_utc": 1593095867,
        "id": "hfn6zf",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "As the title suggests, is it a buy? I read a bit about CSCO having short term troubles because it's failing to adapt. BMY looks good but I just want a bit more confirmation. I'm not sure about MS (Morgan Stanley) since I read that it is not good in the short term and I already have a share in JPM. I plan to hold these long term, so any help and advice are appreciated! Thanks!",
        "subreddit": "StockMarket",
        "title": "Are any of CSCO, BMY, MS a buy?",
        "url": "https://www.reddit.com/r/StockMarket/comments/hfn6zf/are_any_of_csco_bmy_ms_a_buy/",
        "created": 1593124667.0
    },
    {
        "author": "la_tete_finance",
        "created_utc": 1592416507,
        "id": "hawdov",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "options",
        "title": "Trade Idea - $CSCO Wheel - Feedback Requested",
        "url": "/r/ActiveOptionTraders/comments/hawasx/trade_idea_csco_wheel_feedback_requested/",
        "created": 1592445307.0
    },
    {
        "author": "rocketdotcom",
        "created_utc": 1593518927,
        "id": "him4mv",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "I have CSCO Call 17/July $52, Do you think Dividend day gonna take the stock down after it happens?",
        "subreddit": "options",
        "title": "What is the real effect of Dividend Day on Stocks?",
        "url": "https://www.reddit.com/r/options/comments/him4mv/what_is_the_real_effect_of_dividend_day_on_stocks/",
        "created": 1593547727.0
    },
    {
        "author": "za01",
        "created_utc": 1593102401,
        "id": "hfp3o4",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I got into stocks at 16 and been watching the market since. Started investing back in December 2019. \n\nI currently hold TEC.TO, BAM, CAR and Nokia as my more long term plays. I’m adding to these positions when I can and opening more positions for diversification. I’m young so I don’t think holding individual companies is a problem. I plan on purchasing, MSFT, Visa, WM and CSCO in the upcoming future as well. \n\nJust plan to DCA with these. \n\nBeen trading penny stocks too. Again, not the safest but I have all the time in the world and I know when I’ll get it a point where I need to be more cautious. I don’t invest enough into penny stocks for it to be a problem. \n\nI also plan to buy calls and puts to hedge my positions given the condition of a certain market. \n\nAny advice to improve this? Thanks!",
        "subreddit": "CanadianInvestor",
        "title": "18 years old. Any advice or tune ups to my current approach?",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/hfp3o4/18_years_old_any_advice_or_tune_ups_to_my_current/",
        "created": 1593131201.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1591998425,
        "id": "h7tv64",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "4k-10k-1k-13k-5k Lost on puts during first drop, climbed back with csco and viac calls. Held too long both times. Up 1k after 5 months.",
        "url": "https://i.redd.it/yqe78nh5vj451.jpg",
        "created": 1592027225.0
    },
    {
        "author": "teatrouble",
        "created_utc": 1592954210,
        "id": "hepgtq",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "\nMTSL is a telecom expense management company based in Israel (with US operations) with notable partners on their website including:\n\nMicrosoft, Panasonic , Avaya , Cisco, Verizon, HP, Chase, Tmobile, Unify, and many others\n\nhttps://mtsint.com/partners/\n\nER for is expected any day now based on prior year schedules. Net Income from 2015-2019 has become better YoY, as with QoQ. \n\nALSO, it was mentioned in their last quarter ER they are “continuing efforts to find a suitable M&amp;A candidate for our company which will enhance shareholder value.” which an announcement or update can be expected during this upcoming ER. \n\nThis company is a low float 2.34M out of 5.33M shares outstanding and 71.9% insider owned meaning there are people who will want the stock to perform well. Current market cap is $2.95M while 2019 assets on the books is $8M alone. Low floats mean high volatility but can also run hard. This was $2.85 last week PM and has ran in the past to $6.50+. The upside at these levels are huge with enough volume and little downside at current prices IMO given balance sheet. I am swinging and will continue to accumulate at these levels. \n\nAverage volume last week and this week was 6M-7M+. Today was bearish in my opinion due to lack of volume &lt;2M and breaking of support levels and triggering stop losses. Again this is volatile and low float, hence the giant dump.\n\nThis is not on all brokers so positives and negatives. However, large sharks and mainstream traders have called this a multi day (possibly week) swing trade and once this runs, upside is nice. The set up on charts is all there.",
        "subreddit": "stocks",
        "title": "MTSL- a light read on some DD and upside potential",
        "url": "https://www.reddit.com/r/stocks/comments/hepgtq/mtsl_a_light_read_on_some_dd_and_upside_potential/",
        "created": 1592983010.0
    }
]