[
    {
        "author": "dkats94",
        "created_utc": 1598274196,
        "id": "ifojnz",
        "num_comments": 112,
        "num_crossposts": 0,
        "selftext": "This will be the first full week of the challenge so I'm hoping for a good run up to my goal of 50k. \n\nGoing forward I'll only make a new post if there is significant updates, if not, I'll edit this post daily with updates.\n\n*Positions:*\n\n**1st Position:**\n\n6x CTXS 9/18 140c.\n\nBought at $5/Contract (\\~3k)\n\nTarget exit is around 80%, so looking at around $9\n\n**2nd Position:**\n\nSTRANGLE: 30x SBUX 9/4 78.5c AND 30x SBUX 9/4 77p.\n\nBought calls for 1.15, Bought Puts for 1.25 (\\~$7200)\n\nTarget is a 30%-50% gain so looking for a combined price of $3.2-$3.6  \n\n\n*Current Balance:*\n\n*\\~$9,985*\n\nCTXS: + 30%  or + $900\n\nSBUX:  -12.5% or  -$915\n\nPretty much at break even.   But I'm not sweating as I'm confident the SBUX strangle will play out.  Looking at a few plays that triggered last week and seeing if they are worth a rotation on Monday or if it makes sense to hold onto the CTXS calls.\n\n&amp;#x200B;\n\nFor those following along, hopefully you made some money as many of you took the CTXS trade and not the SBUX trade from the comments/messages.   Overall it was a great week as some other calls I had on FSLY printed.",
        "subreddit": "wallstreetbets",
        "title": "10k to 50k Challenge - Day 3",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ifojnz/10k_to_50k_challenge_day_3/",
        "created": 1598302996.0
    },
    {
        "author": "dkats94",
        "created_utc": 1598645019,
        "id": "iiedml",
        "num_comments": 103,
        "num_crossposts": 0,
        "selftext": "First week of the challenge is a success in my mind as we hit approach our first milestone of 20k! Feel really good about the plays going into Monday, pretty much 100% invested, so let's hope the Monday green trend continues.    Going forward, I'll update this post with any trades next week.\n\n*Current Balance (as of 9/28):*\n\n***$19,545 (+95.45%)***\n\nCTXS: +$480 \\[Closed\\]\n\nSBUX: +$1800 \\[Closed\\]\n\nDOCU: +$1540 \\[Closed\\]\n\nZM: +$4250 \\[Closed\\]\n\nHOME: -$200\n\nMDB: -$215\n\nCLDR: +1550 \\[Closed\\]\n\nKR: +340\n\n&amp;#x200B;\n\n*Positions:*\n\n**Position 8**\n\n85x KR 9/11 36.5\n\nBought for $0.85 ($7,225)\n\nTarget exit is 40%\n\n**Position 7 +1550**\n\n~~50 x CLDR 9/4 13c~~\n\n~~Bought for $0.69 each ($3,450)~~\n\n**Position 6**\n\n10x MDB 9/18 250c\n\nBought 5 for $7.75 ($3,875)\n\nBought 5 for $6.5 ($3,250)\n\nTarget exit around 60%\n\n**Position 5**\n\n35 x HOME 9/18 20c\n\nBought for 1.8 ($6,300)\n\nExit around 40-50%\n\n**4th Position +4250**\n\n~~10x ZM 9/4 310c~~\n\n~~Bought for $9.00 ($9,000)~~\n\n~~Target exit is 40%~~\n\n**3rd Position +1540**\n\n~~4x DOCU 9/18 220c~~\n\n~~Bought for 8.15 ($3,260)~~\n\n~~Target exit is 40-50%~~\n\n**2nd Position: +1800**\n\n~~STRANGLE: 30x SBUX 9/4 78.5c AND 30x SBUX 9/4 77p.~~\n\n~~Bought calls for 1.15, Bought Puts for 1.25 (\\~$7200)~~\n\n~~Target is a 30%-50% gain so looking for a combined price of $3.2-$3.6~~\n\n**1st Position: +480**\n\n~~6x CTXS 9/18 140c.~~\n\n~~Bought at $5/Contract (\\~3k)~~\n\n~~Target exit is around 80%, so looking at around $9~~",
        "subreddit": "wallstreetbets",
        "title": "10k to 50k Challenge - Day 7 , 95.45% gain",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iiedml/10k_to_50k_challenge_day_7_9545_gain/",
        "created": 1598673819.0
    },
    {
        "author": "Cicero1982",
        "created_utc": 1597910611,
        "id": "id66dz",
        "num_comments": 92,
        "num_crossposts": 0,
        "selftext": "[The Safe &amp; Consistent Short Term Trading Strategy](https://www.tradinganalysisresources.com/2020/08/the-safe-consistent-short-term-trading.html)\n\nIt has indeed been a while since I made one of [THESE](https://www.tradinganalysisresources.com/2020/08/the-safe-consistent-short-term-trading.html). For those of you who want a decent profit without all the fear and anxiety of penny stocks this is right up your alley! Back when I first started and I lost a ton of money playing the pennies this is how I clawed my way back. It is now added to [THIS THREAD](https://www.reddit.com/r/pennystocks/comments/hcja2q/the_ultimate_quick_resource_for_the_amateur_trader/) as well (Number 9). \n\nImagine going about your life knowing that you will likely make a 10-20% monthly gain (In a normal market) without searching for pennies or checking your phone every thirty seconds to see if your penny stock is dumping. Or imagine bag-holding a stock but without the worry as to whether it will net you a return. Everyone here knows that I trade normal securities more than I do pennies. I only go in on pennies on the rare occasion that I am 70% certain it will net me a profit. This strategy is the strategy I used the most in the stock market. It's a strategy for the risk adverse trader with a little discipline and patience. \n\nFor all of you managing many thousands of $$ you know it only gets harder to manage as your money grows. You can no longer dump a good bit of your portfolio into the pennies. This is the strategy I use. After solid gains on SUM, AGCO, PFSW, ASUR, BOX, CORE, &amp; CTXS over the past month, I thought I would share it with you. Please feel free to ask questions. \n\n[**Summary**](https://www.tradinganalysisresources.com/2020/08/the-safe-consistent-short-term-trading.html)**:** How to find and buy reliable and undervalued securities that consistently beat earnings on a market maker induced dip netting you a probable 10-20% per month (In a amenable market). \n\n(NOTE: I may still edit and work on this some more, I want to include the many ways you can value a company other than P/E multiple)\n\n\\-----------------------------------------------------------------------------------------------------------------------------------------------\n\n[The Safe &amp; Consistent Short Term Trading Strategy](https://www.tradinganalysisresources.com/2020/08/the-safe-consistent-short-term-trading.html)\n\n **OVERVIEW**\n\nIf you wanted to make moderate returns you would have given your money to a financial advisory firm. That’s how I first started years ago. However, my returns consistently under-performed the market. I received a call from my financial advisor once or twice a year to review my portfolio and he would suggest changes. I was in the standard “safe bet,” low return cocktail; mutual funds, large cap, medium cap, bonds, treasuries, emerging markets, cash etc… my adviser did not buy value. It seems to be a strategy of diversify, under-perform, and wait. My advisor certainly did not buy when the price was attractive. He simply threw money into whatever he already had me invested in. That’s why I decided to manage my own money. As of writing this I am up 54% for the year (2020). \n\nPeople nevertheless give their money to financial advisors for a reason, they don’t know what they’re doing. And neither did I when I first began managing my own money. Fast forward a few years and I see people making the same mistakes I did when I first began. And though I am not a financial professional or certified advisor, I am nevertheless committed to helping others by detailing what has and has not worked for me. Once again let’s stress the fact that I am not a certified financial professional. I am simply an amateur investor, as I am sure you are, if you are reading this. \n\nThis entry will discuss *what I consider* the safest, surest, and quickest method of growing your portfolio value. It does not advocate throwing your money in all at once, but assuming that the security will drop granting you the opportunity to buy into the red and average down. It takes advantage of the ebbs and flows of the market, taking into account market maker manipulation, and adhering to the classic principles of buying low and selling high. It may or may not be the best investment strategy as markets change and develop. It may not be the best investment strategy for you. But at the moment of this publication, its my favorite. Below you will find the step by step methods I use to turn a safe, quick, and consistent profit. \n\n**WARNING:** IF YOU HAVE A BROKER THAT CHARGES YOU FEES FOR EVERY TRADE THIS STRATEGY MAY NOT BE FOR YOU.\n\n**1.** **Finding attractive securities**\n\n**2.** **Things to Know Before Buying in**\n\n**3.** **Finding an Attractive Buy in Price**\n\n**4. How to Buy in**\n\n**5. The Psychology of Holding**\n\n**6. When to Sell**\n\n**7. Conclusion**\n\n[Continues HERE....](https://www.tradinganalysisresources.com/2020/08/the-safe-consistent-short-term-trading.html)\n\n.",
        "subreddit": "pennystocks",
        "title": "The Safe &amp; Consistent Short Term Trading Strategy: How to Make A Great Profit Without all the Anxiety or Risk of Penny Stocks",
        "url": "https://www.reddit.com/r/pennystocks/comments/id66dz/the_safe_consistent_short_term_trading_strategy/",
        "created": 1597939411.0
    },
    {
        "author": "farting_tomato",
        "created_utc": 1597612865,
        "id": "ib0pdh",
        "num_comments": 79,
        "num_crossposts": 0,
        "selftext": " [https://www.zerohedge.com/markets/what-hedge-funds-bought-and-sold-second-quarter](https://www.zerohedge.com/markets/what-hedge-funds-bought-and-sold-second-quarter)\n\nTL;DR\n\nADAGE CAPITAL PARTNERS\n\n* Top new buys: RPRX, ABBV, W, HZNP, FIVE, ST, CCK, TRV, USB, JCI\n* Top exits: BMY, GILD, ETN, PNC, MAS, EXC, AON, CCMP, NI, CX\n* Boosted stakes in: BURL, PYPL, FTV, ITT, LOW, GOOGL, TMUS, EYE, AZO, BMRN\n* Cut stakes in: LMT, JNJ, PFE, HON, VZ, VRTX, TGT, VMC, PXD, LLY\n\nAPPALOOSA\n\n* Top new buys: T, V, MA, PYPL, DIS, SYY, EMR, MO, SQ, TEN\n* Top exits: INTEQ, XLU, BKLN\n* Boosted stakes in: TMUS, BABA, MU, HCA, MSFT, BSX, TWTR, WFC, CRM, GT\n* Cut stakes in: PCG, UNH, TSLA, HUM, VST, AMLP, AVGO, NFLX, QCOM, ADBE\n\nBALYASNY ASSET MANAGEMENT\n\n* Top new buys: SCHW, ABT, TGT, HD, ADBE, SHOP, ITW, COST, C\n* Top exits: JCI, AMTD, INTC, CHTR, KR, TMUS, TTWO, NVDA, ICE, ROST\n* Boosted stakes in: PYPL, FISV, BABA, JPM, FLT, NSC, LITE, DKS, QCOM, LHX\n* Cut stakes in: BSX, LOW, DG, FIS, ABBV, BAX, INTU, JD, BK, ETFC\n\nBAUPOST GROUP\n\n* Top new buys: HCA, VRNT, VTR, SSNC\n* Top exits: LNG, ET, XPO, SPR, CARS\n* Boosted stakes in: LBTYK, TBIO, QRVO, ATRA, HDS\n* Cut stakes in: FB, GOOG, PCG, UNVR, ABC, HPQ, CLNY, VIST, AKBA\n\nBERKSHIRE HATHAWAY\n\n* Top new buys: GOLD\n* Top exits: DAL, LUV, UAL, AAL, QSR, GS, OXY\n* Boosted stakes in: STOR, KR, SU\n* Cut stakes in: WFC, JPM, SIRI, PNC, MTB, BK, MA, V, CHTR, USB\n\nBRIDGEWATER ASSOCIATES\n\n* Top new buys: UPS, ZLAB, CSX, ECL, TT, RNG, PAYC, ROP, GWW, FICO\n* Top exits: TLT, HYG, EMB, RY, TD, TIP, CNI, BNS, TRP, BCE\n* Boosted stakes in: SPY, GLD, IVV, FXI, BABA, MCHI, IAU, JD, PDD, VEA\n* Cut stakes in: EWZ, LQD, INDA, EWY, EEM, IEMG, VWO, EWW, BAM, EWT\n\nCOATUE MANAGEMENT\n\n* Top new buys: BA, DOCU, INO, DXCM, WYNN, HWM, LYV, ALGN, TDG, DHT\n* Top exits: RNG, SNAP, BYND, LKNCY, GLUU, ISRG, CGC, STNE, MCD, VGK\n* Boosted stakes in: DIS, PYPL, ZM, SQ, CRWD, PTON, LRCX, SHOP, MU, PODD\n* Cut stakes in: MSFT, LBRDK, BABA, TWTR, JD, NKE, GPN, CREE, GH, NFLX\n\nCORSAIR CAPITAL MANAGEMENT\n\n* Top new buys: IWO, IWM, WMB, NATR, MFIN\n* Top exits: LAUR, RHP, ECPG, ATKR, NMRK, TROX, KRA, FSK, HHC, SATS\n* Boosted stakes in: VRT, WSC, GDDY, CC, BH, BBCP, METC, BRK/B\n* Cut stakes in: HGV, HMHC, FMC, NWSA, REPH, GOOG, CHDN, C, CUBI, PLYA\n\nCORVEX MANAGEMENT\n\n* Top new buys: TMUS, EXC, EVRG, CMCSA, JPM, IAA, TIF, LYV, PCG\n* Top exits: ZEN, CRM, FANG, UNP, VMC, MPC, UNH, ANTM, SPY\n* Boosted stakes in: MGM, GLD, BABA, CNP, NFLX, HUM, CNC, MSGS\n* Cut stakes in: ADBE, ATUS, ATVI, AMZN\n\nD1 CAPITAL PARTNERS\n\n* Top new buys: JPM, AVB, EXPE, TGT, DEI, AAP, ESS, CVNA, SMAR, PNC\n* Top exits: LIN, GWRE, TME, NKE, UNH, BAC, PDD, DHI, INMD\n* Boosted stakes in: BABA, USB, JD, LVS, MSFT, HPP, KRC, CCC, LYV, HLT\n* Cut stakes in: NFLX, FB, AMZN, DIS, RACE, ORLY, PPD, AZO, SBUX, GOOGL\n\nDUQUESNE FAMILY OFFICE\n\n* Top new buys: TMUS, JPM, XBI, SBUX, BKNG, SMAR, CCL, WFC, LYV, CB\n* Top exits: ABT, QCOM, NOW, ADBE, INDA, COUP, TWOU, EDU, SNE, TWLO\n* Boosted stakes in: MSFT, JD, FCX, FSLY, BABA, CRWD, RETA, PLAN, FLEX\n* Cut stakes in: NFLX, FB, AMZN, WDAY, ATVI, GOOGL, GE, IQV, FIS, DISH\n\nELLIOTT MANAGEMENT\n\n* Top new buys: WELL, FSCT\n* Top exits: LQD, RRTS, ESI, HYG, XOP, NEWR, CSOD, NTNX, CNHI, EGHT\n* Boosted stakes in: DELL, TWTR, RYAAY\n\nENGAGED CAPITAL\n\n* Top new buys: JACK, MGLN, SMPL, IWM\n* Top exits: APOG\n* Boosted stakes in: STKL, NCR\n* Cut stakes in: HAIN\n\nFIR TREE\n\n* Top new buys: SQ, LYV, PS, SNAP, VG, EIX, SABR, EXPE, J, PCPL\n* Top exits: FLT, FPAC, BKNG, SHLL, CCH, GOOG, APXT, OAC, DMS, EXPC\n* Boosted stakes in: CNC, CTXS\n* Cut stakes in: DIS, MSFT, TMUS, LAUR, ANTM, DELL, EXC, CMCSA, SLM, TRNE\n\nGREENLIGHT CAPITAL\n\n* Top new buys: GDX, AAWW, TECK, REZI, JACK, GLD, APG, TPX, SATS, WHR\n* Top exits: ATUS, ADNT, CNC, MO, PAYX, AXP, GS, DHR, BRK/B, DIS\n* Boosted stakes in: AER, CHNG, NBSE, GPOR\n* Cut stakes in: CNX, XELA, CC\n\nICAHN\n\n* Top exits: HPQ, HTZ, FCX\n* Boosted stakes in: IEP, LNG, TEN\n* Cut stakes in: CLDR\n\nIMPALA ASSET MANAGEMENT\n\n* Top new buys: LAD, DRI, NSC, HES, CMI, VAC, TOL, ADNT, DOOO, MU\n* Top exits: MSFT, PCAR, CSX, KBH, VMC, MA, AMZN, FDX, EXP\n* Boosted stakes in: HOG, RIO, AAWW, FUN, WYNN, UFI\n* Cut stakes in: TGT, QCOM, KSU, SBLK, TTWO, SIX, KNX, TCKRF, NVR, TECK\n\nJANA PARTNERS\n\n* Top exits: NEWR, JACK\n* Boosted stakes in: PRSP, SPY\n* Cut stakes in: AXTA, HDS, HI, BLMN, ELY, CAG\n\nLAKEWOOD CAPITAL MANAGEMENT\n\n* Top new buys: HDS, CRL, LBTYK, LBTYA, UE, CDK, NKLA, ABG, CROX, SHAK\n* Top exits: WUBA, AMZN, ICE, FNF, TWO, YY, RNR, TPR, WW, REAL\n* Boosted stakes in: FAF, BABA, ANTM, AXS, BIDU, BHC, HCA, SKX, C, ACGL\n* Cut stakes in: GOOGL, CI, FB, MA, DELL, GS, AGNC, APO, CMCSA, BC\n\nLANSDOWNE\n\n* Top new buys: C, VMC, LUV, ED, FCX, RYAAY, AES, COG, TMUS, BKNG\n* Top exits: DHT, NKLA, AGI, TT, IQ, BABA\n* Boosted stakes in: MU\n* Cut stakes in: UAL, DAL, FSLR, GE, ETN, ADI, REGI, LRCX, TSM, SMMT\n\nLONG POND\n\n* Top new buys: PEAK, LVS, DEI, EQR, SHO, WELL, SEAS, UDR, INVH, MAR\n* Top exits: H, DHI, VNO, PEB, PGRE, MGM, VAC, RRR, JLL, CUZ\n* Boosted stakes in: CPT, AVB, MAA, AIV, HLT, ESS, FR, KRC, JBGS\n* Cut stakes in: WH, HGV, RHP, HPP, SBRA\n\nMAGNETAR FINANCIAL\n\n* Top new buys: ADCT, NVS, PKI\n* Top exits: HPQ, TSG, DLR, DKNG, ET, EPD, KMI, LHCG, CRL\n* Boosted stakes in: GRUB, WLTW, LH, BDX, LCA, CPAA, SYNH, ABBV, CRSA, DGX\n* Cut stakes in: PFE, ADSW, TIF, UBER, NVST, BAX, WMB, PPD, MEET, FREE\n\nMAVERICK CAPITAL\n\n* Top new buys: AXP, LIVN, VFC, MKC, GE, BGS, THS, GIS, CRI, FL\n* Top exits: QSR, COMM, ALKS, H, BX, GME, WING, ARMK, ORCL, LB\n* Boosted stakes in: FB, AMZN, DLTR, MSFT, LRCX, APD, ATRA, NFLX, NKTR, UBER\n* Cut stakes in: FLT, BABA, DD, CCK, STNE, PRSP, TMUS, CNC, ADBE, KKR\n\nMELVIN CAPITAL MANAGEMENT\n\n* Top new buys: DOCU, TWLO, SE, GOOGL, AEO, LOW, NUAN, HLT, TPX, PINS\n* Top exits: TTWO, CPRT, EDU, DG, ADYEN, EFX, ADI, LKNCY, IQV, QSR\n* Boosted stakes in: FISV, AZO, BKNG, JD, PYPL, LB, AAP, MA, FICO, DPZ\n* Cut stakes in: FIS, FB, CSGP, LH, NFLX, DRI, VRSN, AMZN, EL, PLAN\n\nOAKTREE CAPITAL MANAGEMENT\n\n* Top new buys: PCG, GTH, API, SRNE\n* Top exits: CEO, SRLP, WMB, BRFS, ASRT, ORCC, PVAC, MDRIQ\n* Boosted stakes in: TMHC, AU, TSM, CX, ITUB, MELI, BIDU, AFYA, IBN, AZUL\n* Cut stakes in: BABA, BCEI, CZR, CCS, SMCI\n\nOMEGA ADVISORS\n\n* Top new buys: DNRCQ\n* Top exits: GOOGL, SSSS, TWO, GPMT\n* Boosted stakes in: COOP, JPM, FOE, GTN, MGY, SNR, SRGA, AMCX\n* Cut stakes in: VICI, GCI, FCRD, NBR, ASPU, OCN, EFC, MVC, PE, ABR\n\nNEVER MISS THE NEWS THAT MATTERS MOST\n\nZEROHEDGE DIRECTLY TO YOUR INBOX\n\n*Receive a daily recap featuring a curated list of must-read stories.*\n\nPERSHING SQUARE\n\n* Top exits: BRK/B, BX, PK\n* Boosted stakes in: QSR, LOW\n* Cut stakes in: HHC\n\nSOROBAN CAPITAL\n\n* Top new buys: RTX, CMCSA, HLT, MAR, YUM\n* Top exits: LHX, QSR, NSC\n* Boosted stakes in: BABA, SNE\n* Cut stakes in: NOC, UNP, CSX, ATUS, AMZN, MSFT\n\nSOROS FUND MANAGEMENT\n\n* Top new buys: IGSB, SLQT, HAIN, PCG, DKNG, DRI, SPSB, BAC, MS, C\n* Top exits: XLU, WMGI, UNH, LNT, SHW, ALL, CBOE, LEN, DIS, CVE\n* Boosted stakes in: LQD, TMUS, NLOK, VICI, TDG, ARMK, BK, GS, ETFC, FOCS\n* Cut stakes in: PTON, TIF, TCO, ORCC, VST, KKR, CLVS, AVTR, ATVI, DHI\n\nSTARBOARD\n\n* Top new buys: IWM, IWR\n* Top exits: REZI\n* Boosted stakes in: MD, ACIW\n* Cut stakes in: EBAY, IWN, CERN, NLOK, CVLT, BOX, MMSI, GDOT\n\nTEMASEK HOLDINGS\n\n* Top new buys: BLK, PDD, SBUX\n* Top exits: BMRN, UNVR, RDS/B, PAGS, STNE, TOUR, FSLY, WORK\n* Boosted stakes in: BGNE, HDB, IBN, CBPO, VMW\n* Cut stakes in: BABA, FIS, VIRT, NIO, DDOG, VNET, INFO\n\nTIGER GLOBAL\n\n* Top new buys: ZI, API, DADA\n* Top exits: IQ, LVGO, BILL, STG, JCPNQ\n* Boosted stakes in: JD, AMZN, MSFT, CRWD, SPOT, PDD, DDOG, CRM, WDAY, ZM\n* Cut stakes in: ATH, SVMK, RDFN, MA, STNE, PYPL\n\nTUDOR INVESTMENT\n\n* Top new buys: ADSW, PCG, TMUS, TME, LHX, ATHM, BXMT, NFLX, ESS, EQR\n* Top exits: TIP, DEI, ABBV, FHN, KRC, GLPI, COP, PEG, LAD, MS\n* Boosted stakes in: AMTD, ETFC, GLIBA, SOXX, X, O, AAPL, UBER, CRWD, TCO\n* Cut stakes in: SPY, JAZZ, CERN, TEAM, HPQ, MCD, EA, LRCX, CUZ, PSB\n\nVIKING GLOBAL INVESTORS\n\n* Top new buys: TMO, HLT, APG, NUAN, MCO, PH, ADI, SHW, DRI, ZNTL\n* Top exits: ANTM, GOOGL, FB, NSC, ORLY, A, NOW, PGR, BMRN, AJG\n* Boosted stakes in: AXP, CMCSA, FIS, LVS, TMUS, PLAN, JPM, AON, CB, SE\n* Cut stakes in: NFLX, BSX, JD, LOW, UBER, CME, MELI, MU, CRM, CHNG\n\nWHALE ROCK CAPITAL MANAGEMENT\n\n* Top new buys: SQ, NXPI, MELI, CREE, VRM, ZI\n* Top exits: DIS, BABA, INTC, MU, MIME, ZS, ATVI, TSM, KLIC, PLAN\n* Boosted stakes in: FSLY, SHOP, DOCU, TSLA, COUP, AMZN, W, FB, OKTA, BILL\n* Cut stakes in: NOW, MSFT, NET, PTON, SMAR, FTNT, CRWD, AVLR, ZM, DDOG",
        "subreddit": "StockMarket",
        "title": "This Is What Hedge Funds Bought And Sold In The Second Quarter",
        "url": "https://www.reddit.com/r/StockMarket/comments/ib0pdh/this_is_what_hedge_funds_bought_and_sold_in_the/",
        "created": 1597641665.0
    },
    {
        "author": "WannabeStonks69",
        "created_utc": 1598571163,
        "id": "ihw51a",
        "num_comments": 55,
        "num_crossposts": 0,
        "selftext": "**The Case for Nutanix**\n\n**Tl;dr NTNX will recover from financial instability soon so get 2022/2021 LEAPs** \n\nNutanix is a company that provides enterprise solutions via SaaS and PaaS to integrate data, computing, networking, and security using hyper converged infrastructure. Nutanix’s Acropolis HCI runs all enterprise applications such from Oracle, SAP, Microsoft, Citrix, Splunk, and SQL, just to give you an idea of what type of league it’s running with. Nutanix makes running IT solutions integrated, efficient and secure.\n\nNutanix’s solutions are unique for the industry and are great at locking in customers, a trait that Warren Buffett looks out for on all of his investments. Nutanix has dug up a niche in terms of being one of the only companies to integrate enterprise software seamlessly for so many businesses, and its new subscription-based business plan is bound to lock in more customers. Nutanix also runs ML-based automation of workload management, ticketing integration, and output date forecasting. A senior director at Home Depot (HD) had to say this about NTNX: “Prism Pro makes it extremely easy to watch all of the clusters in our environment and quickly reconfigure things as needed. It provides very clear metrics on oversubscription and utilization, giving us a powerful, proactive capacity management function that we never had before...Since Prism Pro is so easy to use, we told the database engineers they could quickly learn to manage their own environments and monitor capacity utilization”. Prism Pro has just been one software product of many to remove complication and coding out of everyday business use cases. Nutanix also offers services similar to VMWare in its VM management solutions, but the highlight of Nutanix is the integration of public and private cloud into one software. Their innovation on multiple fronts and in multiple industries is just one reason why the vision for them is limitless, but now it’s time to get into the numbers. \n\nNutanix also has Xi IoT solutions, another developing branch of their services which is involved in manufacturing, oil and gas, and smart city infrastructure (Xi IoT helps improve traffic flows, guides emergency vehicles, and more!). \n\n&amp;#x200B;\n\nFinancials are the biggest insight into a company’s stability and growth prospectuses, and although I love the business structure and the innovative drive, the financials look somewhat concerning, but the surprise ER today clears up plenty of doubts I had held previously.\n\nFinancially, 2018 appeared to be by far the best year for Nutanix, as these next metrics will show: \n\n&amp;#x200B;\n\nhttps://preview.redd.it/1lf664ifqmj51.png?width=562&amp;format=png&amp;auto=webp&amp;s=296cbfa5b6489205893ade30b32cd73bde18fbe8\n\nAs you can see, in 2018 the interest expense to gross profit ratio was the lowest\n\n&amp;#x200B;\n\nR&amp;D to Gross profit was the lowest\n\nhttps://preview.redd.it/7i43rckiqmj51.png?width=624&amp;format=png&amp;auto=webp&amp;s=755a74355b1b43dbbf69040505f8492f5289094a\n\nSG&amp;A Expenses were far lower as well\n\nhttps://preview.redd.it/crzzuekoqmj51.png?width=614&amp;format=png&amp;auto=webp&amp;s=fc3a3c34833ee7f3e0b1185cd0c28a619656fe3f\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/04uyzkntqmj51.png?width=554&amp;format=png&amp;auto=webp&amp;s=56bcf12f2d6240db0524000e3391ab873cbbfd24\n\nAs you can see, NTNX had heavily levered itself in 2018, so a lot of the decline in price after 2018 was due to the over leveraging (I’ll explain why this was bad later) and led to negative free cash flow : \n\n&amp;#x200B;\n\nhttps://preview.redd.it/w6t2k2kvqmj51.png?width=365&amp;format=png&amp;auto=webp&amp;s=95c145fca89dbfa2b0af3e0a5aaeaed148fd34a5\n\nAnd the simple reason why this happened to their financials is because of a change in business model to a subscription-based platform ([https://www](https://www/). fool.com/investing/2019/06/03/nutanix-stumbles-on-sales-execution-and-subscripti.aspx). Basically a transformation in financing structure led to massive increases in SGA and R&amp;D expenses, which will, in my opinion be great for the long run as software sales had increased in 2019 while hardware sales went down, which shows the company’s transition to digitizing. So Nutanix felt that there were lots of sharks in the water, and were quick to transition to a more sustainable model for the long term as profit margins continued to increase and so did liquidity. CEO Dheeraj Pandey had this to say about the transition during the financial reporting year of 2019, and all this obviously factored into the stock price as forecasted cash flows were heavily damaged \n\n*“During Q3, we executed well on the strong plan to ramp lead generation and thus improved sales execution. As we noted in both our Q2 earnings call and at our Investor Day in March, we continue to believe our actions to address this will drive improved business into FY '20 as these changes take a couple of quarters to show results. We will be watchful and conservative in the near term as we give New Americas sales leadership time to effect change as we understand the top line impact of even higher subscriptions.”*\n\nHere were some immediately positive effects of this change: \n\nhttps://preview.redd.it/y85xkq2yqmj51.png?width=536&amp;format=png&amp;auto=webp&amp;s=187a33377137a649282191e65756e68980b6c31a\n\nCash conversion was pushed back into negative (good liquidity)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/bs5lq1uzqmj51.png?width=482&amp;format=png&amp;auto=webp&amp;s=97ef577b4562a47079f20aaaa8ec8ad126404a2a\n\nLower Debt/Ebitda\n\n&amp;#x200B;\n\nhttps://preview.redd.it/5sxgaid1rmj51.png?width=621&amp;format=png&amp;auto=webp&amp;s=d20911a3355b8a5425526555c69e93558c91d487\n\nLower Capex/Ebitda\n\n&amp;#x200B;\n\nhttps://preview.redd.it/3itievv2rmj51.png?width=558&amp;format=png&amp;auto=webp&amp;s=22188c80a30c0e24c89dc2c9a82f6fee188b3cf1\n\nHigher net profit margins\n\nAnd if you compare the current ratio to its much larger competitor, VMWare, you’ll see that although NTNX has more solutions, it has maintained a higher asset/debt ratio (2.13 vs 0.98). And so although current growth and value may be concerning, know it’s because of a change in business structure that’s causing this and not incompetence. \n\nAs today’s surprise ER came out, NTNX shares jumped 17% after hours, meeting my expectations that this company was digging its way out. I had good expectations, but Nutanix handily surpassed them: “**Reached 88 Percent of Billings from Subscription:** Nutanix continued its transition to a subscription-based business model, with subscription billings up 29% year-over-year to $341 million, representing 88% of total billings, and subscription revenue up 46% year-over-year to $285 million, representing 87% of total revenue.” [Nutanix Reports Fourth Quarter and Fiscal 2020 Financial Results](https://finance.yahoo.com/news/nutanix-reports-fourth-quarter-fiscal-200600203.html)\n\nNow that the financial report has come out and we know this new structure will be taking it in the right direction, \n\n“In conjunction with its move to a subscription-based business model, the Company is shifting its guidance to Annual Contract Value (ACV) billings instead of Total Contract Value (TCV) billings and revenue. Management will resume providing quarterly guidance with Q1 Fiscal 2021 during its earnings conference call today in order to provide context to this shift.”\n\n*This just means that Nutanix’s financials will be far more consistent and bolstered now. Nutanix was also able to add far more customers to its HCI product this quarter and was recognized as a Forrester Analyst leader in this sector: “****Recognized as a Leader:*** *Nutanix was* [*named a Leader*](https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.nutanix.com%2Fpress-releases%2F2020%2Fnutanix-named-a-leader-in-hyperconverged-infrastructure-by-prominent-independent-research-firm&amp;esheet=52273899&amp;newsitemid=20200827005684&amp;lan=en-US&amp;anchor=named+a+Leader&amp;index=7&amp;md5=ba30cfc91de704bbf0227854577029f9) *in The Forrester Wave™: Hyper Converged Infrastructure, Q3 2020 report, published by Forrester Research, Inc. Nutanix believes this is consistent with additional independent market research, all of which conclude that Nutanix software is an undisputed leader in the fast-growing HCI market.” NTNX also reduced the use of cash flows by 66% this quarter “****Free Cash Flow:*** *Use of $13.8 million, compared to use of $33.3 million in the fourth quarter of fiscal 2019”*\n\n*and had a 30% increase in deferred revenue since the 4th quarter of 2019.* \n\nNutanix’s new leadership and financial restructuring will lead to a much better financial outlook for the company, and if it doesn’t as soon as we expect their innovation, outreach, and compatibility will be more than enough to lift the share’s prices. On top of that, NTNX has stayed aggressive in terms of offering the most they can, they have become a conglomerate of SaaS, devouring smaller startups and similar SaaS companies: \n\nAll in all, Nutanix has a bright and storied future ahead of it, and that is even more apparent after these earnings. Now my only concern is the possible change in leadership, but the market is seeing it as good news for the future of the company. \n\nTl:dr NTNX LEAPs for 2021 and 2022, I like the Jan 2022 35 call",
        "subreddit": "wallstreetbets",
        "title": "NTNX DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ihw51a/ntnx_dd/",
        "created": 1598599963.0
    },
    {
        "author": "hansjohnson123",
        "created_utc": 1597859332,
        "id": "icsjr7",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "It seems **very**, **very** apparent to me that COVID-19 will **undoubtedly** spike in college towns across the next 2-4 weeks and beyond. Just take a look at what is going on at the University of North Carolina (UNC) when 130 students tested positive [last week](https://www.cnn.com/2020/08/17/us/coronavirus-college-university/index.html) after being on-campus for just a couple of days. \n\n[The same thing](https://www.cnn.com/2020/08/18/health/colleges-return-coronavirus-cases-wellness/index.html) is happening at the University of Kentucky, Notre Dame, Eastern Kentucky, East Carolina University, Colorado College, Oklahoma State, NC State, Iowa State, with more **definitely** to be reported very soon as classes begin before Sept 1. \n\nI'm thinking of investing in Wayfair, Citrix, and Zoom due to the influx of students that will be taking online classes rather than in-person, as well as the number of students who need to start to build home offices in their bedrooms and basements at their homes -- not to mention professors too. \n\nWhat do you guys think about this? Any companies that may be on your radar to invest in if there is an influx of students who will have to leave campuses and return home due to a spike in COVID-19.",
        "subreddit": "stocks",
        "title": "COVID-19 in Collegetowns",
        "url": "https://www.reddit.com/r/stocks/comments/icsjr7/covid19_in_collegetowns/",
        "created": 1597888132.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1597440067,
        "id": "i9ulho",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Good Friday evening to all of you here on r/StockMarket. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning August 17th, 2020.\n\n# **Stocks are ignoring the lack of a stimulus package from Congress, but that could change  - [(Source)](https://www.cnbc.com/2020/08/14/stocks-are-ignoring-the-lack-of-a-stimulus-package-from-congress-but-that-could-change.html)**\n*****\n&gt; Stocks could hang at record levels but gains may be capped until Congress agrees to a new stimulus package to help the economy and the millions of unemployed Americans.\n*****\n&gt; Stocks were higher in the past week, and the S&amp;P 500 flirted with record levels it set in February.\n*****\n&gt; In the coming week, there are some major retailers reporting earnings, including Walmart, Home Depot and Target, but the season is mostly over and the market is entering a quiet period. There are minutes from the Fed’s last meeting, released Wednesday, and housing data, including starts Tuesday and existing sales Friday.\n*****\n&gt; Investors had been watching efforts by Congress to agree to a new stimulus package, but talks have failed and the Senate has gone on recess. There is a concern that Congress will not be convinced to provide a big enough package when it does get to work again on the next stimulus round because recent economic reports look stronger. July’s retail sales, for example, climbed to a record level and recovered to pre-pandemic levels.\n*****\n&gt; “The juxtaposition of getting more fiscal stimulus and better data has paralyzed us in our tracks … we’ve seen this sideways [market] action,” said Art Hogan, chief market strategist at National Alliance. “It feels like we need more action from Congress, and the concern is the longer we wait, the better the data gets and the less impactful the next round of stimulus will be.”\n*****\n&gt; Some technical analysts say the market may pull back around the high, to allow it to consolidate gains before moving higher into the end of the year. The S&amp;P 500 reached an all-time high of 3,393 on Feb. 19.\n*****\n&gt; Hogan said he expects stocks to tread sideways during the dog days of August, but they could begin to react negatively to the election in September. He also said it is important that progress continue against the spread of Covid-19, as the economy continues to reopen.\n*****\n&gt; Peter Boockvar, chief investment strategist at Bleakley Advisory Group, said the market could have a wakeup call at some point that the stimulus package has not been approved.\n*****\n&gt; “I think it will cross over a line where they care,” he said. “I think the market is in suspended animation of believing there will be a magical deal.” Boockvar said he expects a deal ultimately, but the impact is not likely to be as big as the last round of funding.\n*****\n&gt; “What they’re not grasping is any deal, any extension of unemployment benefits, is going to be smaller than it was, and the rate of change should be the most important thing investors focus on,” he said. “Not the binary outcome of whether there’s a deal or no deal. There’s going to be less air going into the balloon.”\n*****\n&gt; # It’s the economy\n&gt; Still, economists expect to see a strong rebound in the third quarter, and are anticipating about about a 20% jump in third-quarter growth. But they also say that could be threatened if Congress does not help with another stimulus package.\n*****\n&gt; Mark Zandi, chief economist at Moody’s Analytics, described the July retail sales as a perfect V-shaped recovery, but cautioned it would not last unless more aid gets to individuals and cities and states. Democrats have sought a $3 trillion spending package, and Republicans in the Senate offered a $1 trillion package. They could not reach a compromise, including on a $600 weekly payment to individuals on unemployment which expired July 31.\n*****\n&gt; President Donald Trump has tried to fill the gap with executive orders to provide extra benefits to those on unemployment, but the $300 federal payment and $100 from states may take some time to reach individuals, as the processing varies by state. He has also issued an order instructing the Treasury to temporarily defer collection of payroll taxes from individuals making up to $104,000.\n*****\n&gt; “I think in August and September, there will be a lot of Ws, if there’s not more help here,” said Zandi, referring to an economic recovery that retrenches from a V shape before heading higher again. “It’s clearly perplexing. It may take the stock market to say we’re not going to get what we expect, and sell off and light a fire.”\n*****\n&gt; Zandi said it could come to a situation like 2008, where the stock market sold off sharply before Congress would agree to a program that helped financial companies.\n*****\n&gt; “We need a TARP moment to get these guys to help. Maybe if the claims tick higher and the August employment numbers are soft, given the president is focused on the stock market, that might be what it takes to get them back to the table in earnest,” he said, referring to the Troubled Asset Relief Program that helped rescue banks during the financial crisis.\n*****\n&gt; He ultimately expects a package of about $1.5 trillion to be approved in September.\n*****\n&gt; The lack of funding for state and local governments could result in more layoffs, as they struggle with their current 2021 budgets, Zandi said. Already 1.3 million public sector jobs have been lost since February, and there will be more layoffs and more programs and projects cancelled. The impact will hit contractors and other businesses that provide services to local governments.\n*****\n&gt; “The multipliers on state and local government are among the highest of any form of support, so if you don’t provide it, it’s going to ripple through the economy pretty fast,” he said.\n*****\n&gt; Economists expect to see a softening in consumer spending in August with the more than 28 million Americans on unemployment benefits as of mid-July no longer receiving any supplemental pay.\n*****\n&gt; “The real irony is things are shaping up that September is going to be a bad month, and that’s going to show up in all the data in October,” Zandi said. “They are really taking a chance on this election by not acting.”\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/0VN7xgL.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/CqxPmuk.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/pw7FpMd.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.postimg.cc/Jz178H45/econcal1.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/BaRJleM.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/YQIFlRp.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/O9Ufbwy.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/ceoh8Vj.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!]())**\n(T.B.A. THIS WEEKEND)\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.postimg.cc/zXNCDPYY/ipos1.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.postimg.cc/DzhkxTtY/upgradesdowngrades1.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.postimg.cc/W1gcm3fk/upgradesdowngrades2.png))**\n\n*****\n\n&gt; # 4 Charts That Will Amaze You\n\n&gt; The S&amp;P 500 Index is a few points away from a new all-time high, completing one of the fastest recoveries from a bear market ever. But this will also seal the deal on the shortest bear market ever. Remember, the S&amp;P 500 Index lost 20% from an all-time high in only 16 trading days back in February and March, so it makes sense that this recovery could be one of the fastest ever.\n\n&gt; From the lows on March 23, the S&amp;P 500 has now added more than 50%. Many have been calling this a bear market rally for months, while we have been in the camp this is something more. It’s easy to see why this rally is different based on where it stands versus other bear market rallies:\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/08/8.12.20-Blog-Chart-1.png?ssl=1))**\n\n&gt; They say the stock market is the only place where things go on sale, yet everyone runs out of the store screaming. We absolutely saw that back in March and now with stocks near new highs, many have missed this record run. Here we show how stocks have been usually higher a year or two after corrections.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/08/8.12.20-Blog-Chart-2.png?ssl=1))**\n\n&gt; After a historic drop in March, the S&amp;P 500 has closed higher in April, May, June, and July. This rare event has happened only 11 other times, with stocks gaining the final five months of the year a very impressive 10 times. Only 2018 and the nearly 20% collapse in December saw a loss those final five months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/08/GS-Blog-Chart.png?ssl=1))**\n\n&gt; As shown in the LPL Chart of the Day, this bear market will go down as the fastest ever, at just over one month. The recovery back to new highs will be five months if we get there by August 23, making this one of the fastest recoveries ever. Not surprisingly, it usually takes longer for bear markets in a recession to recover; only adding to the impressiveness of this rally.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/08/8.12.20-Blog-Chart-4.png?ssl=1))**\n\n&gt; “It normally takes 30 months for bear markets during a recession to recover their losses, which makes this recovery all the more amazing,” said LPL Financial Chief Market Strateigst Ryan Detrick.. “Then again, there has been nothing normal about this recession, so maybe we shouldn’t be shocked about yet another record going down in 2020.”\n\n*****\n\n&gt; # When a Few Basis Points Packs a Punch\n\n&gt; US Treasury yields have been on the rise this week with the 10-year yield rising 13 basis points (bps) from 0.56% up to 0.69% after getting as high as 0.72% on Thursday. A 13 bps move higher in interest rates may not seem like a whole lot, but with rates already at such low levels, a small move can have a pretty big impact on the prices of longer-term maturities.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/08/081420-10-Year-Yield.png))**\n\n&gt; Starting with longer-term US Treasuries, TLT, which measures the performance of maturities greater than 20 years, has declined 3.5% this week. Now, for a growth stock, 3.5% is par for the course, but that kind of move in the Treasury market is no small thing. The latest pullback for TLT also coincides with another failed attempt by the ETF to trade and stay above $170 for more than a day.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/08/081420-TLT.png))**\n\n&gt; The further out the maturity window you go in the fixed income market, the bigger the impact of the move higher in interest rates. The Republic of Austria issued a 100-year bond in 2017, and its movements exemplify the wild moves that small changes in interest rates (from a low base) can have on prices. Just this week, the Austrian 100-year was down over 5%, which is a painful move no matter what type of asset class you are talking about. This week's move, though, was nothing compared to the stomach-churning swings from earlier this year. When Covid was first hitting the fan, the 100-year rallied 57% in the span of less than two months. That kind of move usually occurs over years rather than days, but in less than a third of that time, all those gains disintegrated in a two-and-a-half week span from early to late March. Easy come, easy go. Ironically enough, despite all the big up and down moves in this bond over the last year, as we type this, the bond's price is the same now as it was on this same day last year.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/08/081420-Austria.png))**\n\n*****\n\n&gt; # Retail Sales Rock to New Highs\n\n&gt; At the headline level, July’s Retail Sales report disappointed as the reading missed expectations by nearly a full percentage point. Just as soon as the report was released, we saw a number of stories pounce on the disappointment as a sign that the economy was losing steam. Looked at in more detail, though, the July report wasn’t all that bad. While the headline reading rose less than expected (1.2% vs 2.1%), Ex Autos and Ex Autos and Gas, the results were much better than expected. Not only that, but June’s original readings were all revised higher by around a full percentage point.\n\n&gt; Besides the fact that this month’s report was better underneath the surface and June’s reading was revised higher, it was also notable as the seasonally-adjusted annualized rate of sales in July hit a new record high. After the last record high back in January, only five months passed until American consumers were back to their pre-Covid spending ways. For the sake of comparison, back during the Financial Crisis, 40 months passed between the original high in Retail Sales in November 2007 and the next record high in April 2011. 5 months versus 40? Never underestimate the power of the US consumer!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/08/081420-retail-sales-chart1.png))**\n\n&gt; While the monthly pace of retail sales is back at all-time highs, the characteristics behind the total level of sales have changed markedly in the post COVID world. In our just released B.I.G. Tips report we looked at these changing dynamics to highlight the groups that have been the biggest winners and losers from the shifts.\n\n*****\n\n&gt; # 100 Days of Gains\n\n&gt; Today marked 100 trading days since the Nasdaq 100's March 20th COVID Crash closing low. Below is a chart showing the rolling 100-trading day percentage change of the Nasdaq 100 since 1985. The 59.8% gain over the last 100 trading days ranks as the 3rd strongest run on record. The only two stronger 100-day rallies ended in January 1999 and March 2000.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/08/ndx100use.png))**\n\n&gt; While the Nasdaq 100 bottomed on Friday, March 20th, the S&amp;P 500 bottomed the following Monday (3/23). This means tomorrow will mark 100 trading days since the S&amp;P 500's COVID Crash closing low. Right now the rolling 100-day percentage change for the S&amp;P 500 sits at +46.7%. But if the S&amp;P manages to trade at current levels tomorrow, the 100-day gain will jump above 50%. It has been 87 years (1933) since we've seen a 100-day gain of more than 50%!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/08/spxrolling0812.png))**\n\n*****\n\n&gt; # B.I.G. Tips - New Highs In Sight\n\n&gt; Whether you want to look at it from the perspective of closing prices or intraday levels, the S&amp;P 500 is doing what just about everybody thought would be impossible less than five months ago - approaching record highs. Relative to its closing high of 3,386.15, the S&amp;P 500 is just 0.27% lower, while it's within half of a percent from its record intraday high of 3,393.52. Through today, the S&amp;P 500 has gone 120 trading days without a record high, and as shown in the chart below, the current streak is barely even visible when viewed in the perspective of all streaks since 1928. Even if we zoom in on just the last five years, the current streak of 120 trading days only ranks as the fourth-longest streak without a new high.\n\n&gt; While the S&amp;P 500's 120-trading day streak without a new high isn't extreme by historical standards, the turnaround off the lows has been extraordinary. In the S&amp;P 500's history, there have been ten prior declines of at least 20% from a record closing high. Of those ten prior periods, the shortest gap between the original record high and the next one was 309 trading days, and the shortest gap between highs that had a pullback of at least 30% was 484 tradings days (or more than four times the current gap of 120 trading days). For all ten streaks without a record high, the median drought was 680 trading days.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/08/Streaks-Chart.png))**\n\n&gt; Whenever the S&amp;P 500 does take out its 2/19 high, the question is whether the new high represents a breakout where the S&amp;P 500 keeps rallying into evergreen territory, or does it run out of gas after finally reaching a new milestone? To shed some light on this question, we looked at the S&amp;P 500's performance following each prior streak of similar duration without a new high.\n\n*****\n\n&gt; # Rocket Reversals\n\n&gt; Over the last few days, we've been seeing a moderate rotation in the market as red-hot growth stocks sell-off and investors shift into other areas of the market that have been lagging. To highlight this, the table below highlights 24 companies in the Russell 3,000 with market caps of more than $1 billion that traded at a 52-week high within the last month but are currently down more than 20% from that high. The vast majority of these stocks are names that investors haven't been able to get enough of in 2020 but now appear to have had their fill.\n\n&gt; Topping the list of these reversals is Eastman Kodak (KODK). On 7/29, the stock surged to a 52-week high of $60.00 after being awarded a questionable government contract to domestically produce components for prescription drugs. With the SEC and government agency that originally awarded the contract now looking into stock option awards at the company just before it was announced, the stock has pulled back sharply and is now down over 80% from its high less than two weeks ago.\n\n&gt; While KODK is more of a unique example, other names on the list are primarily growth or health care stocks that have benefited from the COVID outbreak. However, now that signs suggest the summer wave in the south has crested, investors appear to be taking some profits. Shares of Vaxart (VXRT) hit a high of $17.49 on July 14th but have since lost nearly half of their value and trade back in the single-digits. Additionally, Bloom Energy (BE), 1Life Healthcare (ONEM), and Bioxcel Therapeutics (BTAI) have all lost more than a third of their value.\n\n&gt; In terms of market cap, most of the names listed are on the small side, but Tesla (TSLA) is a notable exception as it is now just over 20% below its 52-week high on 7/13. Other relatively large companies on the list include Moderna (MRNA), Citrix Systems (CTXS), Teladoc (TDOC), and Livongo (LVGO). TDOC and LVGO both hit all-time highs last week but after announcing a mostly stock merger last Wednesday, both have lost nearly a quarter of their value.\n\n&gt; While all of the stocks listed below have seen sharp pullbacks in the last several days, a little perspective is in order. Of the 24 names listed, the average YTD change even after the declines has been a gain of 219.7% (median: +94.6%). Only two of the stocks shown (New Relic- NEWR and Sonos- SONO) are down YTD, and half of them have at least doubled and in many cases much more.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/08/081020-Reversals.png))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending August 14th, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED!)\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 8.16.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED!)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **TICKERS T.B.A.**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!]())**\n(T.B.A. THIS WEEKEND)\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!]())**\n(T.B.A. THIS WEEKEND)\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 8.17.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ILeuUCn.png))\n\n&gt; # ***Monday 8.17.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/sR89byw.png))\n\n*****\n\n&gt; # ***Tuesday 8.18.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/uzJCGGO.png))\n\n&gt; # ***Tuesday 8.18.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/0gUoYvK.png))\n\n*****\n\n&gt; # ***Wednesday 8.19.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/V2jCvoz.png))\n\n&gt; # ***Wednesday 8.19.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/gpfSG2w.png))\n\n*****\n\n&gt; # ***Thursday 8.20.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/0TZ1FzI.png))\n\n&gt; # ***Thursday 8.20.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/I2K0BoN.png))\n\n*****\n\n&gt; # ***Friday 8.21.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/armLGC0.png))\n\n*****\n\n&gt; # ***Friday 8.21.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE)\n\n*****\n\n&gt; # T.B.A. THIS WEEKEND\n&gt; **T.B.A. THIS WEEKEND** T.B.A. THIS WEEKEND.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SPY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/StockMarket.",
        "subreddit": "StockMarket",
        "title": "Wall Street Week Ahead for the trading week beginning August 17th, 2020",
        "url": "https://www.reddit.com/r/StockMarket/comments/i9ulho/wall_street_week_ahead_for_the_trading_week/",
        "created": 1597468867.0
    },
    {
        "author": "WannabeStonks69",
        "created_utc": 1598572086,
        "id": "ihwe6l",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "**The Case for Nutanix**\n\n**Tl;dr NTNX will recover from financial instability soon so get 2022/2021 LEAPs**\n\nNutanix is a company that provides enterprise solutions via SaaS and PaaS to integrate data, computing, networking, and security using hyper converged infrastructure. Nutanix’s Acropolis HCI runs all enterprise applications such from Oracle, SAP, Microsoft, Citrix, Splunk, and SQL, just to give you an idea of what type of league it’s running with. Nutanix makes running IT solutions integrated, efficient and secure.\n\nNutanix’s solutions are unique for the industry and are great at locking in customers, a trait that Warren Buffett looks out for on all of his investments. Nutanix has dug up a niche in terms of being one of the only companies to integrate enterprise software seamlessly for so many businesses, and its new subscription-based business plan is bound to lock in more customers. Nutanix also runs ML-based automation of workload management, ticketing integration, and output date forecasting. A senior director at Home Depot (HD) had to say this about NTNX: “Prism Pro makes it extremely easy to watch all of the clusters in our environment and quickly reconfigure things as needed. It provides very clear metrics on oversubscription and utilization, giving us a powerful, proactive capacity management function that we never had before...Since Prism Pro is so easy to use, we told the database engineers they could quickly learn to manage their own environments and monitor capacity utilization”. Prism Pro has just been one software product of many to remove complication and coding out of everyday business use cases. Nutanix also offers services similar to VMWare in its VM management solutions, but the highlight of Nutanix is the integration of public and private cloud into one software. Their innovation on multiple fronts and in multiple industries is just one reason why the vision for them is limitless, but now it’s time to get into the numbers.\n\nNutanix also has Xi IoT solutions, another developing branch of their services which is involved in manufacturing, oil and gas, and smart city infrastructure (Xi IoT helps improve traffic flows, guides emergency vehicles, and more!).\n\nFinancials are the biggest insight into a company’s stability and growth prospectuses, and although I love the business structure and the innovative drive, the financials look somewhat concerning, but the surprise ER today clears up plenty of doubts I had held previously.\n\nFinancially, 2018 appeared to be by far the best year for Nutanix, as these next metrics will show:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/4iaqf4sntmj51.png?width=562&amp;format=png&amp;auto=webp&amp;s=313b257e2ec65a61205e5bb73e0f12498fa3a3e0\n\nAs you can see, in 2018 the interest expense to gross profit ratio was the lowest\n\n&amp;#x200B;\n\nhttps://preview.redd.it/y7ss71tptmj51.png?width=624&amp;format=png&amp;auto=webp&amp;s=8b4bad6abecc41bb12a8bd55678bef4f0985c917\n\nR&amp;D to Gross profit was the lowest\n\n&amp;#x200B;\n\nhttps://preview.redd.it/xwfjl1mqtmj51.png?width=614&amp;format=png&amp;auto=webp&amp;s=2abec84fd95d1ef223f6fb340548867dca80b2f3\n\nSG&amp;A Expenses were far lower as well\n\n&amp;#x200B;\n\nhttps://preview.redd.it/fhbkzatstmj51.png?width=554&amp;format=png&amp;auto=webp&amp;s=5aa2c2badb6824c6bc6eb97c0c92ff73913c76a5\n\nAs you can see, NTNX had heavily levered itself in 2018, so a lot of the decline in price after 2018 was due to the over leveraging (I’ll explain why this was bad later) and led to negative free cash flow :\n\n&amp;#x200B;\n\nhttps://preview.redd.it/lg57d9uutmj51.png?width=365&amp;format=png&amp;auto=webp&amp;s=a1cf9fdeacdd8fe1cd87df24ca2ba49cc8124b48\n\nAnd the simple reason why this happened to their financials is because of a change in business model to a subscription-based platform ([https://www](https://www/). fool.com/investing/2019/06/03/nutanix-stumbles-on-sales-execution-and-subscripti.aspx). Basically a transformation in financing structure led to massive increases in SGA and R&amp;D expenses, which will, in my opinion be great for the long run as software sales had increased in 2019 while hardware sales went down, which shows the company’s transition to digitizing. So Nutanix felt that there were lots of sharks in the water, and were quick to transition to a more sustainable model for the long term as profit margins continued to increase and so did liquidity. CEO Dheeraj Pandey had this to say about the transition during the financial reporting year of 2019, and all this obviously factored into the stock price as forecasted cash flows were heavily damaged\n\n*“During Q3, we executed well on the strong plan to ramp lead generation and thus improved sales execution. As we noted in both our Q2 earnings call and at our Investor Day in March, we continue to believe our actions to address this will drive improved business into FY '20 as these changes take a couple of quarters to show results. We will be watchful and conservative in the near term as we give New Americas sales leadership time to effect change as we understand the top line impact of even higher subscriptions.”*\n\nHere were some immediately positive effects of this change:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/sel7ywlwtmj51.png?width=536&amp;format=png&amp;auto=webp&amp;s=24c56863abd3d37427a14204e1987f85929de63d\n\nCash conversion was pushed back into negative (good liquidity)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/o0zm2psxtmj51.png?width=482&amp;format=png&amp;auto=webp&amp;s=8178a09bb3eb6e5fee9464e86561139269c000d8\n\nLower Debt/Ebitda\n\n&amp;#x200B;\n\nhttps://preview.redd.it/8jrooiuytmj51.png?width=621&amp;format=png&amp;auto=webp&amp;s=1beb4c392e9744feacffd09add600cac55086616\n\nLower Capex/Ebitda\n\n&amp;#x200B;\n\nhttps://preview.redd.it/80hsj900umj51.png?width=558&amp;format=png&amp;auto=webp&amp;s=f6b77c0974f5f434d86cd0ea130a9144e06f6c00\n\nHigher net profit margins\n\nAnd if you compare the current ratio to its much larger competitor, VMWare, you’ll see that although NTNX has more solutions, it has maintained a higher asset/debt ratio (2.13 vs 0.98). And so although current growth and value may be concerning, know it’s because of a change in business structure that’s causing this and not incompetence.\n\nAs today’s surprise ER came out, NTNX shares jumped 17% after hours, meeting my expectations that this company was digging its way out. I had good expectations, but Nutanix handily surpassed them: “**Reached 88 Percent of Billings from Subscription:** Nutanix continued its transition to a subscription-based business model, with subscription billings up 29% year-over-year to $341 million, representing 88% of total billings, and subscription revenue up 46% year-over-year to $285 million, representing 87% of total revenue.” [Nutanix Reports Fourth Quarter and Fiscal 2020 Financial Results](https://finance.yahoo.com/news/nutanix-reports-fourth-quarter-fiscal-200600203.html)\n\nNow that the financial report has come out and we know this new structure will be taking it in the right direction,\n\n“In conjunction with its move to a subscription-based business model, the Company is shifting its guidance to Annual Contract Value (ACV) billings instead of Total Contract Value (TCV) billings and revenue. Management will resume providing quarterly guidance with Q1 Fiscal 2021 during its earnings conference call today in order to provide context to this shift.”\n\n\\*This just means that Nutanix’s financials will be far more consistent and bolstered now. Nutanix was also able to add far more customers to its HCI product this quarter and was recognized as a Forrester Analyst leader in this sector: “\\****Recognized as a Leader:*** *Nutanix was* [*named a Leader*](https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.nutanix.com%2Fpress-releases%2F2020%2Fnutanix-named-a-leader-in-hyperconverged-infrastructure-by-prominent-independent-research-firm&amp;esheet=52273899&amp;newsitemid=20200827005684&amp;lan=en-US&amp;anchor=named+a+Leader&amp;index=7&amp;md5=ba30cfc91de704bbf0227854577029f9) \\*in The Forrester Wave™: Hyper Converged Infrastructure, Q3 2020 report, published by Forrester Research, Inc. Nutanix believes this is consistent with additional independent market research, all of which conclude that Nutanix software is an undisputed leader in the fast-growing HCI market.” NTNX also reduced the use of cash flows by 66% this quarter “\\****Free Cash Flow:*** *Use of $13.8 million, compared to use of $33.3 million in the fourth quarter of fiscal 2019”*\n\n*and had a 30% increase in deferred revenue since the 4th quarter of 2019.*\n\nNutanix’s new leadership and financial restructuring will lead to a much better financial outlook for the company, and if it doesn’t as soon as we expect their innovation, outreach, and compatibility will be more than enough to lift the share’s prices. On top of that, NTNX has stayed aggressive in terms of offering the most they can, they have become a conglomerate of SaaS, devouring smaller startups and similar SaaS companies:\n\nAll in all, Nutanix has a bright and storied future ahead of it, and that is even more apparent after these earnings. Now my only concern is the possible change in leadership, but the market is seeing it as good news for the future of the company.\n\nTl:dr NTNX LEAPs for 2021 and 2022, I like the Jan 2022 35 call\n\nbonus: [https://finance.yahoo.com/news/korea-western-power-deploys-nutanix-130000609.html](https://finance.yahoo.com/news/korea-western-power-deploys-nutanix-130000609.html)\n\nGovt's using them for infrastructure help during covid",
        "subreddit": "smallstreetbets",
        "title": "Nutanix DD",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/ihwe6l/nutanix_dd/",
        "created": 1598600886.0
    },
    {
        "author": "Haalt",
        "created_utc": 1597705396,
        "id": "ibp4av",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I've been looking into investing in Citrix due to increasing demand for employees to work remotely. I understand that the market hasn't necessarily been following fundamentals this year, but looking at the company's financial statements and their summary statistics, wouldn't this stock be more attractive to tech investors? I don't understand the stagnation in stock price seen since March 31st or the crash after Q2 earnings. Am I missing something?",
        "subreddit": "stocks",
        "title": "Sentiment on CTXS (Citrix Systems)",
        "url": "https://www.reddit.com/r/stocks/comments/ibp4av/sentiment_on_ctxs_citrix_systems/",
        "created": 1597734196.0
    },
    {
        "author": "Cicero1982",
        "created_utc": 1597820553,
        "id": "iciv8u",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "# Pre Market Brief for Wednesday August 19th 2020\n\nYou can subscribe to the daily 4:00 AM Pre Market Brief on [The Twitter Link Here](https://www.tradinganalysisresources.com/2020/05/free-references-and-resources.html?m=1) . Alerts in the tweets will direct you to the daily 4:00 AM Pre Market Brief in this sub.\n\n[Morning Research and Trading Prep Tool Kit](https://www.tradinganalysisresources.com/2020/05/free-references-and-resources.html?m=1)\n\n[The Ultimate Quick Resource For the Amateur Trader.](https://www.reddit.com/r/pennystocks/comments/hcja2q/the_ultimate_quick_resource_for_the_amateur_trader/)\n\n*Published* **3*****:00*** ***AM*** *EST / Updated as of* ***3:00 AM*** *EST*\n\n\\-----------------------------------------------\n\n***Stock Futures:***\n\n* [Pre-Market Trading](https://money.cnn.com/data/premarket/)\n* [Stock](https://finance.yahoo.com/news/stock-market-news-live-august-19-2020-221817551.html) futures open flat after S&amp;P 500's record close\n* [Asia](https://www.cnbc.com/2020/08/19/asia-markets-wall-street-australia-china-relations-currencies-in-focus.html) Pacific stocks mixed; Japan’s exports in July slide on-year\n* [European](https://www.cnbc.com/2020/08/19/europe-markets-stocks-seen-higher-after-wall-street-record-highs.html) markets set to open slightly higher after record highs on Wall Street\n\n**Tuesday** ***08/18/2020 News and Markets Recap:***\n\n* [Your Pre Market Brief for 08/18/2020](https://www.reddit.com/r/pennystocks/comments/ibxl4u/your_premarket_brief_for_08182020/)\n* [Market Recap](https://finance.yahoo.com/video/market-recap-tuesday-august-18-201742935.html)\n\n***Wednesday*** ***August 19th 2020*** [***Economic Calendar***](https://tradingeconomics.com/calendar) (All times are Eastern)\n\n* **07:00 AM** [**MBA 30-Year Mortgage Rate**](https://tradingeconomics.com/united-states/mortgage-rate) 14/AUG \n* **07:00 AM** [**MBA Mortgage Applications**](https://tradingeconomics.com/united-states/mortgage-applications) 14/AUG \n* **10:30 AM** [**EIA Crude Oil Stocks Change**](https://tradingeconomics.com/united-states/crude-oil-stocks-change) 14/AUG \n* **10:30 AM** [**EIA Gasoline Stocks Change**](https://tradingeconomics.com/united-states/gasoline-stocks-change) 14/AUG \n* **10:30 AM** [**EIA Distillate Stocks Change**](https://tradingeconomics.com/united-states/distillate-stocks) 14/AUG \n* **10:30 AM** [**EIA Cushing Crude Oil Stocks Change**](https://tradingeconomics.com/united-states/cushing-crude-oil-stocks) 14/AUG \n* **10:30 AM** [**EIA Refinery Crude Runs Change**](https://tradingeconomics.com/united-states/refinery-crude-runs) 14/AUG \n* **10:30 AM** [**EIA Heating Oil Stocks Change**](https://tradingeconomics.com/united-states/heating-oil-stocks-) 14/AUG \n* **10:30 AM** [**EIA Distillate Fuel Production Change**](https://tradingeconomics.com/united-states/distillate-fuel-production) 14/AUG \n* **10:30 AM** [**EIA Gasoline Production Change**](https://tradingeconomics.com/united-states/gasoline-production) 14/AUG \n* **10:30 AM** [**EIA Crude Oil Imports Change**](https://tradingeconomics.com/united-states/crude-oil-imports) 14/AUG \n* **01:00 PM** 20-Year Bond Auction \n* **02:00 PM** [**FOMC Minutes**](https://tradingeconomics.com/united-states/interest-rate) \n\n***News Heading into Wednesday August 19th 2020***\n\n*NOTE: PLEASE DO NOT YOLO THE VARIOUS TICKERS WITHOUT DOING RESEARCH. THE TIME STAMPS ON THE FOLLOWING ARTICLES MAY BE LATER THAN OTHERS ON THE WEB. THE CREATOR OF THIS THREAD COMPILED THE FOLLOWING IN A QUICK MANNER AND DOES NOT ATTEST TO THE VERACITY OF THE INFORMATION BELOW. YOU ARE RESPONSIBLE FOR VETTING YOUR OWN SOURCES AND DOING YOUR OWN DD.* \n\n* [GNCA](https://www.sec.gov/Archives/edgar/data/1457612/000145761220000142/s3august2020.htm) Genocea -1.8% as holders file to offer 21.39M shares  \n* [VRNA](https://www.globenewswire.com/news-release/2020/08/19/2080411/0/en/Verona-Pharma-Initiates-Multiple-Dose-Part-of-Phase-2-Clinical-Trial-with-pMDI-Formulation-of-Ensifentrine-in-COPD.html) Verona Pharma Initiates Multiple Dose Part of Phase 2 Clinical Trial with pMDI Formulation of Ensifentrine in COPD (Overnight News).\n* [AXDX](http://ir.axdx.com/2020-08-18-Accelerate-Diagnostics-Announces-FDA-Emergency-Use-Authorization-for-COVID-19-Antibody-Testing-System) Accelerate Diagnostics up 13% on FDA emergency use nod for COVID-19 test (Overnight News).\n* [CYDY](https://www.globenewswire.com/news-release/2020/08/19/2080404/0/en/CytoDyn-Requests-Fast-Track-Approval-for-COVID-19-Patients-from-U-K-s-Regulatory-Agency-MHRA-based-on-its-Top-line-Report-Showing-Statistically-Significant-Endpoint-NEWS2-p-0-023-a.html) CytoDyn requests “Fast Track Approval” in U.K for COVID-19 trial (Overnight News).\n* [CNTG](https://www.globenewswire.com/news-release/2020/08/19/2080412/0/en/CENTOGENE-Opens-Walk-In-COVID-19-Testing-Facility-at-Hamburg-Airport.html) CENTOGENE Opens Walk-In COVID-19 Testing Facility at Hamburg Airport (Overnight News).\n* [HUD](https://www.reuters.com/article/us-hudson-m-a-dufry/dufry-to-buy-rest-of-hudson-in-311-million-deal-idUSKCN25F0HE) Dufry to buy rest of Hudson in $311 million deal (Overnight News).\n* [REGN](https://www.marketwatch.com/story/regeneron-enlists-roche-to-help-make-covid-19-drug-2020-08-19) Regeneron teams with Roche to triple supply of its COVID-19 drug (Overnight News).\n* [MTP](https://finance.yahoo.com/news/midatech-pharma-plc-announces-exercise-060000702.html) Midatech Pharma Announces Exercise of Warrants and Issue of Equity (Overnight News).\n* [ON](https://www.businesswire.com/news/home/20200818005824/en/Semiconductor-Announces-Upsize-Pricing-Private-Offering-700) ON Semiconductor Announces Upsize and Pricing of Private Offering of $700 Million of 3.875% Senior Notes (Overnight News).\n* [RXT](https://www.globenewswire.com/news-release/2020/08/19/2080400/0/en/Rackspace-Technology-Announces-Results-of-Global-Cloud-Budget-Survey-Uncovers-the-Hidden-Complexities-of-IT-Spend-Management.html) Rackspace Technology Announces Results of Global Cloud Budget Survey, Uncovers the Hidden Complexities of IT Spend Management (Overnight News).\n* [GS](https://in.reuters.com/article/us-tech-omio/booking-app-omio-raises-100-million-in-travel-recovery-bet-idINKCN25F0LO?il=0) Booking app Omio raises $100 million in travel recovery bet (Overnight News).\n* [CHGG](https://www.businesswire.com/news/home/20200818005858/en/Chegg-Prices-Offering-900.0-Million-0-Convertible) Chegg Prices Offering of $900.0 Million of 0% Convertible Senior Notes Due 2026 (Overnight News).\n* [FUTU](https://www.globenewswire.com/news-release/2020/08/19/2080425/0/en/Futu-Announces-Pricing-of-Offering-of-9-500-000-American-Depositary-Shares.html) Futu Announces Pricing of Offering of 9,500,000 American Depositary Shares (Overnight News).\n* [BCOV](https://www.businesswire.com/news/home/20200818005479/en/Streamed-Video-Content-Dominates-Media-Entertainment-Consumption) Streamed Video Content Dominates Media and Entertainment Consumption According to the Brightcove Q2 2020 Global Video Index (Overnight News).\n* [ORCL](https://www.wsj.com/articles/trump-expresses-support-for-oracle-to-buy-tiktok-11597799352) Trump Expresses Support for Oracle to Buy TikTok (Overnight News).\n* [BX](https://www.reuters.com/article/us-takeda-m-a-blackstone/takeda-preparing-to-sell-japan-consumer-health-unit-to-blackstone-kyodo-idUSKCN25F039) Takeda preparing to sell Japan consumer health unit to Blackstone: Kyodo (Overnight News).\n* [NOVA](https://www.prnewswire.com/news-releases/gaf-energy-and-sunnova-launch-strategic-partnership-to-expand-roof-integrated-solar-options-for-homeowners-301114525.html) GAF Energy and Sunnova Launch Strategic Partnership to Expand Roof-Integrated Solar Options for Homeowners (Overnight News).\n* [EQNR](https://www.globenewswire.com/news-release/2020/08/19/2080407/0/en/Equinor-s-share-saving-plan-allocates-shares.html) Equinor’s share saving plan allocates shares (Overnight News).\n* [AAPL](https://www.benzinga.com/news/20/08/17149799/apple-revamps-music-radio-service-with-a-rebranded-beats-1-and-two-new-stations) Apple Revamps Music Radio Service With A Rebranded Beats 1, And Two New Stations (Overnight News).\n* [World’s](https://www.cnbc.com/2020/08/19/maersk-earnings-q2-2020.html) largest shipping firm says demand will ‘significantly decline’ this year(Overnight News).\n* [NI](https://www.prnewswire.com/news-releases/nisource-inc-announces-pricing-and-preliminary-results-of-its-any-and-all-tender-offer-301114476.html) NiSource Inc. Announces Pricing and Preliminary Results of its Any and All Tender Offer\n* [WU](https://finance.yahoo.com/news/western-union-now-available-card-010000707.html) Western Union Now Available at CARD Bank (Overnight News).\n* [INBX](https://www.sec.gov/Archives/edgar/data/1739614/000162828020012838/inbxs-1mefaug2020.htm) Form S-1MEF (registration adding securities to prior form s-1 registration \\[rule 462(b)\\]) filed with the SEC  \n* [GILD](https://www.businesswire.com/news/home/20200818005811/en/Gilead-Receives-Complete-Response-Letter-Filgotinib-Treatment) Gilead comes up empty with U.S. application for filgotinib for rheumatoid arthritis  \n* [MIDD](https://www.businesswire.com/news/home/20200818005844/en/Middleby-Corporation-Prices-Upsized-Offering-650-Million) The Middleby Prices Upsized Offering of $650 Million Convertible Senior Notes Due 2025 \n* [U.S.](https://www.marketwatch.com/story/us-china-agree-to-expand-airline-flights-between-them-to-8-per-week-2020-08-18), China to expand airline flights between them to eight per week.  (UAL, DAL, CEA, ZNH) \n* [JUUL MO](https://www.bloomberg.com/news/articles/2020-08-18/juul-e-cigarette-getting-fda-review-to-stay-on-the-u-s-market) Juul E-Cigarette Getting FDA Review to Stay on the U.S. Market\n* [HRMY](https://www.sec.gov/Archives/edgar/data/1802665/000119312520223850/d794185ds1mef.htm) Form S-1MEF (registration adding securities to prior form s-1 registration \\[rule 462(b)\\]) filed with the SEC  \n* [CDNS](https://finance.yahoo.com/news/cadences-john-wall-present-keybanc-000000616.html) Cadence's John Wall to Present at KeyBanc Future of Technology Series  \n* [EHTH](https://www.sec.gov/cgi-bin/browse-edgar?CIK=1333493) EHealth chief bullish on future, increases stake to 703K shares  \n* [ZNGA](https://www.barrons.com/articles/zynga-is-largest-mobile-game-maker-by-market-share-51597793969) Zynga Becomes Largest Mobile Game Maker by Market Share \n* [CNDT](https://www.sec.gov/Archives/edgar/data/921669/000092846420000047/cndtsc13da08182020.htm) Conduent +3.2% as it names Icahn's Gary to board for settlement  \n* [RMAX](https://www.prnewswire.com/news-releases/remax-2020-broker-owner-conference-features-memorable-speakers-valuable-lessons-and-the-launch-of-new-tools-training-and-technology-for-its-global-network-of-entrepreneurs-301114468.html) RE/MAX 2020 Broker Owner Conference Features Memorable Speakers, Valuable Lessons and the Launch of New Tools, Training and Technology for its Global Network of Entrepreneurs\n* [CNNE](https://www.businesswire.com/news/home/20200818005810/en/Cannae-Holdings-Announces-Investment-Foley-Trasimene-Acquisition) Cannae Holdings Announces Investment in Foley Trasimene Acquisition Corp. II’s Recently Priced $1.3 Billion Initial Public Offering  \n* [BFT](https://finance.yahoo.com/news/foley-trasimene-acquisition-corp-ii-231500321.html) Foley Trasimene Acquisition Corp. II Announces Pricing of Upsized $1.3 Billion Initial Public Offering\n* [RIO](https://www.reuters.com/article/us-rio-tinto-outlook-copper/rio-tinto-cuts-2020-refined-copper-outlook-on-smelter-restart-delay-in-utah-mine-idUSKCN25E2X8) Rio Tinto cuts 2020 refined copper outlook on smelter restart delay in Utah mine\n* [AR](https://www.prnewswire.com/news-releases/antero-resources-announces-pricing-of-250-million-offering-of-convertible-senior-notes-301114462.html) Antero Resources Announces Pricing of $250 Million Offering of Convertible Senior Notes  \n* [III](https://www.globenewswire.com/news-release/2020/08/18/2080350/0/en/Asia-Pacific-Sourcing-Slumps-in-Q2-on-Pandemic-Concerns.html) Asia Pacific Sourcing Slumps in Q2 on Pandemic Concerns\n* [QHRC](https://www.globenewswire.com/news-release/2020/08/18/2080351/0/en/Quest-Resource-Holding-Corporation-to-Present-Virtually-and-Host-1x1-Investor-Meetings-at-the-11th-Annual-Midwest-Ideas-Investor-Conference-on-August-26th-27th.html) Quest Resource Holding to Present Virtually and Host 1x1 Investor Meetings at the 11th Annual Midwest Ideas Investor Conference on August 26th &amp; 27th  \n* [REV C](https://www.bloomberg.com/news/articles/2020-08-18/citi-resigns-role-on-brigade-clo-deal-amid-escalating-loan-feud) Citi Resigns Role on Brigade CLO Deal Amid Escalating Loan Feud  \n* [REV C](https://www.reuters.com/article/us-citigroup-revlon-lawsuit/citigroup-wins-freeze-on-funds-mistakenly-sent-to-revlon-creditors-idUSKCN25E2GO) Citigroup wins freeze on funds mistakenly sent to Revlon creditors\n* [RDFN](https://www.prnewswire.com/news-releases/late-summer-housing-market-is-unseasonably-hot-prices-up-10-and-pending-sales-up-13-301114453.html) Late-Summer Housing Market is Unseasonably Hot, Prices Up 10% and Pending Sales Up 13%  \n* [RPAI](https://www.prnewswire.com/news-releases/retail-properties-of-america-inc-prices-400-0-million-offering-of-senior-unsecured-notes-301114449.html) Retail Properties Of America Prices $400.0 Million Offering Of Senior Unsecured Notes  \n* [SRNE](https://www.sec.gov/ix?doc=/Archives/edgar/data/850261/000110465920096566/tm2028939d1_8k.htm) Sorrento Therapeutics -10.4% after CFO's ouster  \n* [STAR](https://www.prnewswire.com/news-releases/istar-pricing-400-million-of-senior-unsecured-notes-301114447.html) iStar Pricing $400 Million of Senior Unsecured Notes\n* [CWT](https://www.globenewswire.com/news-release/2020/08/18/2080338/0/en/California-Water-Service-Group-Honored-as-Silver-Stevie-Award-Winner-for-COVID-19-Employer-Response.html) California Water Service Group Honored as Silver Stevie® Award Winner for COVID-19 Employer Response  \n* [JNPR](https://www.globenewswire.com/news-release/2020/08/18/2080340/0/en/Archdiocese-of-Brisbane-Selects-Juniper-Networks-to-Provide-AI-Driven-Wi-Fi-Solutions-Across-Its-Operations.html) Archdiocese of Brisbane Selects Juniper Networks to Provide AI-Driven Wi-Fi Solutions Across Its Operations  \n* [ROP](https://www.globenewswire.com/news-release/2020/08/18/2080341/0/en/Roper-Technologies-Prices-Public-Offering-Of-300-Million-Senior-Unsecured-Notes-Due-2022-700-Million-Senior-Unsecured-Notes-Due-2025-700-Million-Senior-Unsecured-Notes-Due-2027-And.html) Roper Technologies Prices Public Offering Of $300 Million Senior Unsecured Notes Due 2022, $700 Million Senior Unsecured Notes Due 2025, $700 Million Senior Unsecured Notes Due 2027 And $1 Billion Senior Unsecured Notes Due 2031\n* [TTEK](https://www.businesswire.com/news/home/20200818005799/en/Tetra-Tech-Wins-29.7-Million-USAID-Renewable) Tetra Tech Wins $29.7 Million USAID Renewable Energy Contract\n* [SPKE](https://finance.yahoo.com/news/spark-energy-inc-announces-class-220000352.html) Spark Energy Announces Class A Common Stock Share Buyback Program  \n* [DMYD](https://www.businesswire.com/news/home/20200818005791/en/dMY-Technology-Group-II-Announces-Closing-Underwriters%E2%80%99) dMY Technology Group II Announces Closing of Underwriters’ Over-Allotment Option in Connection with its Initial Public Offering  \n* [GVA](https://www.graniteconstruction.com/newsroom/granite-inliner-awarded-c12-million-sewer-maintenance-project-ontario-canada) Granite Inliner receives C$12M sewer maintenance project in Canada  \n* [BPYU](https://www.globenewswire.com/news-release/2020/08/18/2080324/0/en/Brookfield-Property-REIT-Inc-Announces-Final-Results-of-Tender-Offer.html) Brookfield Property REIT Inc. Announces Final Results of Tender Offer\n* [KKR](https://www.sec.gov/ix?doc=/Archives/edgar/data/1404912/000114036120018689/nt10014196x8_8k.htm) KKR prices $750M senior notes  \n* [GSIT](http://www.globenewswire.com/news-release/2020/08/18/2080322/0/en/GSI-Technology-to-Participate-in-the-LD-500-Virtual-Conference-on-September-3-2020.html) GSI Technology to Participate in the LD 500 Virtual Conference on September 3, 2020  \n* [ADI](https://investor.analog.com/news-releases/news-release-details/analog-devices-appoints-dr-laurie-h-glimcher-board-directors) Analog Devices Appoints Dr. Laurie H. Glimcher to Board of Directors \n* [DNB](https://www.sec.gov/ix?doc=/Archives/edgar/data/1799208/000179920820000011/dnb-20200812.htm) Dun and Bradstreet adds Jackson to expanded board   \n* [STNG](https://www.globenewswire.com/news-release/2020/08/18/2080319/0/en/Scorpio-Tankers-Inc-Announces-Purchase-of-Common-Shares-by-Scorpio-Services-Holding-Limited.html) Scorpio Tankers Announces Purchase of Common Shares by Scorpio Services Holding  \n* [MDC](https://www.prnewswire.com/news-releases/richmond-american-debuts-new-models-at-popular-folsom-masterplan-301114415.html) Richmond American Debuts New Models at Popular Folsom Masterplan  \n* [HAL](https://www.halliburton.com/en-US/default.html) Halliburton wins contact to bring cloud-based tech to Thailand offshore rigs  \n* [FLUX](https://www.businesswire.com/news/home/20200818005786/en/Flux-Power-Announces-Closing-12.4-Million-Underwritten) Flux Power Announces Closing of $12.4 Million Underwritten Public Offering Including Full Exercise of Over-Allotment Option  \n* [FISV](https://finance.yahoo.com/news/fiserv-announces-pricing-secondary-offering-212500775.html) Fiserv Announces Pricing of Secondary Offering of Common Stock by New Omaha Holdings\n* [EBC](https://www.businesswire.com/news/home/20200818005783/en/Eastern-Bank-Announces-Commencement-Stock-Offering) Eastern Bank Announces Commencement of Stock Offering    \n* [RRR](https://www.prnewswire.com/news-releases/station-casinos-offers-cashless-gaming-with-playon-at-las-vegas-properties-301114409.html) Station Casinos offers \"Cashless Gaming\" with \"PlayOn\" at Las Vegas Properties  \n* [ICMB](https://apnews.com/PR%20Newswire/2f2ea99b0f76c31b3e5f1827b45b9367) Investcorp Credit Management BDC Schedules Earnings Release of Fourth Quarter Ended June 30, 2020  \n* [GLDD](https://www.defense.gov/Newsroom/Contracts/Contract/Article/2317151/) US Department of Defense awards new contracts to GLDD\n* [SWN](https://www.businesswire.com/news/home/20200818005768/en/Southwestern-Energy-Prices-Offering-350-Million-Senior) Southwestern Energy prices senior notes offering  \n* [ORCC](https://www.bloombergquint.com/onweb/mindbody-software-maker-for-gyms-slapped-with-higher-loan-cost) Mindbody, Software Maker for Gyms, Slapped With Higher Loan Cost  \n* [CALB](https://www.globenewswire.com/news-release/2020/08/18/2080310/0/en/California-Bank-of-Commerce-Adds-Veteran-Bankers-to-Growing-Team.html) California Bank of Commerce Adds Veteran Bankers to Growing Team  \n* [AMZN](https://www.cnbc.com/2020/08/18/amazon-pushes-sellers-to-meet-prime-delivery-guarantees.html) Amazon pushes sellers to meet two-day delivery guarantees so more people can get Prime-eligible products\n* [SSP](https://www.businesswire.com/news/home/20200818005724/en/Triton-Digital-Releases-Webcast-Metrics-Rankings-Top) Triton Digital Releases Webcast Metrics Rankings for the Top Digital Audio Properties for June 2020  \n* [MJCO](https://www.businesswire.com/news/home/20200818005654/en/Majesco-Taps-Minds-Today%E2%80%99s-Influential-Industry-Leaders) Majesco Taps into the Minds of ’s Most Influential Industry Leaders Shaping the Future of Insurance  \n* [RRC](https://www.globenewswire.com/news-release/2020/08/18/2080304/0/en/Range-Announces-Pricing-of-Upsized-300-Million-Offering-of-Additional-9-250-Senior-Notes-Due-2026-and-Amends-Terms-of-Tender-Offers.html) Range Announces Pricing of Upsized $300 Million Offering of Additional 9.250% Senior Notes Due 2026 and Amends Terms of Tender Offers  \n* [IRTC](https://www.globenewswire.com/news-release/2020/08/18/2080299/0/en/iRhythm-Technologies-Announces-Proposed-Public-Offering-of-Common-Stock.html) iRhythm Technologies launches equity offering  \n* [ALBO](https://www.globenewswire.com/news-release/2020/08/18/2080294/0/en/Albireo-Reports-Topline-Results-from-Phase-2-Trial-of-Elobixibat-in-NAFLD-NASH.html) Albireo Reports Topline Results from Phase 2 Trial of Elobixibat in NAFLD/NASH\n* [CXO](https://www.businesswire.com/news/home/20200818005763/en/Concho-Resources-Publishes-Inaugural-2020-Sustainability-Report) Concho Resources Publishes Inaugural 2020 Sustainability Report  \n* [PSN](https://www.prnewswire.com/news-releases/parsons-completes-requirements-for-operations-at-salt-waste-processing-facility-301114377.html) Parsons completes requirements for operations at SWPF  \n* [LE](https://www.sec.gov/Archives/edgar/data/799288/000156459020040577/le-8k_20200812.htm) Lands' End works out deal for more financial breathing room  \n* [SABR](https://www.sec.gov/ix?doc=/Archives/edgar/data/1597033/000119312520223619/d54448d8k.htm) Sabre falls after $250M convertible, common stock offerings  \n* [HDS](https://www.globenewswire.com/news-release/2020/08/18/2080290/0/en/HD-Supply-Holdings-Inc-Announces-Fiscal-2020-Second-Quarter-Earnings-Release-Date-and-Conference-Call.html) HD Supply Holdings Announces Fiscal 2020 Second-Quarter Earnings Release Date and Conference Call  \n* [HHC](https://www.prnewswire.com/news-releases/the-howard-hughes-corporation-announces-closing-of-an-offering-of-750-000-000-senior-notes-due-2028--301114321.html) The Howard Hughes® Announces Closing Of An Offering Of $750,000,000 Senior Notes Due 2028  \n* [GASS](https://www.globenewswire.com/news-release/2020/08/18/2080286/0/en/STEALTHGAS-INC-Announces-the-Date-for-the-Release-of-the-Second-Quarter-and-Six-Months-2020-Financial-and-Operating-Results-Conference-Call-and-Webcast.html) STEALTHGAS Announces the Date for the Release of the Second Quarter and Six Months 2020 Financial and Operating Results, Conference Call and Webcast  \n* [AFG](https://www.businesswire.com/news/home/20200818005745/en/American-Financial-Group-Increases-Annual-Common-Stock) American Financial Group Increases Annual Common Stock Dividend by 11%; Fifteenth Consecutive Year of Dividend Increases  \n* [RXT](https://www.globenewswire.com/news-release/2020/08/18/2080285/0/en/Onica-a-Rackspace-Technology-Company-Introduces-Contact-Center-Intelligence-Solution-Built-on-Amazon-Web-Services.html) Onica Introduces Contact Center Intelligence Solution Built on Amazon Web Services  \n* [MRCY](https://www.globenewswire.com/news-release/2020/08/18/2080274/0/en/Mercury-Systems-Awarded-Patent-for-Cyberattack-Protection-Technology.html) Mercury Systems awarded patent for cyberattack protection technology  \n* [PRTS](https://www.prnewswire.com/news-releases/carpartscom-announces-closing-of-public-offering-of-common-stock-and-full-exercise-of-the-underwriters-over-allotment-option-301114334.html) Announces Closing of Public Offering of Common Stock and Full Exercise of the Underwriters' Over-Allotment Option  \n* [PLV](https://www.businesswire.com/news/home/20200818005691/en/Permianville-Royalty-Trust-Announces-Monthly-Operational-Update) Permianville Royalty Trust Announces Monthly Operational Update  \n* [WM](https://www.businesswire.com/news/home/20200818005718/en/Waste-Management-Announces-Cash-Dividend) Waste Management Announces Cash Dividend  \n* [EYEN](https://www.sec.gov/Archives/edgar/data/1682639/000110465920096532/tm2028879-1_424b5.htm) Eyenovia under pressure on planned equity offering  \n* [JKHY](https://www.sec.gov/Archives/edgar/data/779152/000077915220000061/jkhy-20200630xexhibit9.htm) Jack Henry and Associates falls 6% after earnings report, downside EPS forecast  \n* [MASI](https://www.businesswire.com/news/home/20200818005857/en/New-Studies-Investigate-Accuracy-Noninvasive-Continuous-Hemoglobin) New Studies Investigate the Accuracy of Noninvasive, Continuous Hemoglobin Monitoring with Masimo SpHb® on Neonates  \n\nNote: Seeking A url's and Reddit do not get along.\n\n***Upcoming Earnings:***\n\n* [Earnings Calendar](https://finance.yahoo.com/calendar/earnings/)\n* [Earnings Calendar II](https://tradingeconomics.com/earnings)\n\n***COVID-19 Stats and News:***\n\n* [COVID-19 Stats](https://www.worldometers.info/coronavirus/country/us/)\n* [Latest Map and Case Count](https://www.nytimes.com/interactive/2020/us/coronavirus-us-cases.html)\n* [Universities](https://finance.yahoo.com/news/coronavirus-college-classess-campus-211709998.html) begin U-turns as campus life brings outbreaks\n* [Coronavirus](https://finance.yahoo.com/news/coronavirus-gut-check-how-small-businesses-are-surviving-205917890.html) gut check: How small businesses are surviving\n* [Treasury](https://www.cnbc.com/2020/08/18/us-bonds-treasury-yields-in-focus-amid-economic-data-auctions.html) yields hold steady as investors monitor stimulus deal\n\n***Macro Considerations:***\n\n* [Economic Indicators](https://tradingeconomics.com/united-states/indicators)\n* [Economic Indicator Forecasts](https://tradingeconomics.com/united-states/forecast)\n* [Tracking America’s Recovery](https://www.cnn.com/business/us-economic-recovery-coronavirus)\n\n[***Most Recent SEC Filings***](https://www.lazyfa.com/events/)\n\n* [SEC Form 10-K](https://sec.report/Form/10-K) (Annual Performance)\n* [SEC Form 10-Q](https://sec.report/Form/10-Q) (Quarterly Performance)\n* [SEC Form 8-K](https://sec.report/Form/8-K) (Information of Shareholder Interest)\n* [SEC Form DEFA14A](https://sec.report/Form/DEFA14A) (Upcoming Shareholder Meeting)\n* [SEC Form 4](https://sec.report/Form/4) (Insider Trading)\n* [SEC Form 144](https://sec.report/Form/144) (Insider Selling)\n* [SEC Form 13F](https://sec.report/Form/13F-HR) (Institutional Investment)\n\n***Other***\n\n* [Current Trading Halts](https://www.nasdaqtrader.com/trader.aspx?id=TradeHalts)\n* [Reg SHO Threshold List](https://www.nasdaqtrader.com/trader.aspx?id=RegSHOThreshold)\n* [Short Sale Circuit Breaker](https://www.nasdaqtrader.com/trader.aspx?id=ShortSaleCircuitBreaker)\n* [Highest Short Interest](https://www.highshortinterest.com)\n* [Most Recent Insider Filings](https://m.insidertracking.com)\n* [Fear and Greed Index](https://money.cnn.com/data/fear-and-greed/)\n* [OTC Market Snapshot](https://www.otcmarkets.com)\n* [Highest Implied Volatility](https://www.barchart.com/options/highest-implied-volatility/stocks)\n* [Most Recent IPO Filings](https://www.ipomonitor.com/pages/ipo-filings.html)\n* [Dividend Calendar](https://www.thestreet.com/dividends/index.html)\n* [Most Active Stocks](https://finance.yahoo.com/most-active)\n* [Daily Gainers](https://finance.yahoo.com/screener/predefined/day_gainers)\n* [Daily Losers](https://finance.yahoo.com/screener/predefined/day_losers)\n\n\\-----------------------------------------------\n\n[Morning Research and Trading Prep Tool Kit](https://www.tradinganalysisresources.com/2020/05/free-references-and-resources.html?m=1)\n\nOther Useful Resources:\n\n[The Ultimate Quick Resource For the Amateur Trader.](https://www.reddit.com/r/pennystocks/comments/hcja2q/the_ultimate_quick_resource_for_the_amateur_trader/)\n\nSubscribe to This Brief and the daily 4:00 AM Pre Market Brief on [The Twitter Link Here](https://www.tradinganalysisresources.com/2020/05/free-references-and-resources.html?m=1) . Alerts in the tweets will direct you to the daily brief in this sub\n\nIt is up to you to judge the accuracy and veracity of these headlines before trading.",
        "subreddit": "pennystocks",
        "title": "Your Pre-Market Brief for 08/19/2020",
        "url": "https://www.reddit.com/r/pennystocks/comments/iciv8u/your_premarket_brief_for_08192020/",
        "created": 1597849353.0
    }
]