[
    {
        "author": "AutoModerator",
        "created_utc": 1598962077,
        "id": "ikj1y5",
        "num_comments": 2579,
        "num_crossposts": 0,
        "selftext": "Please use this thread to discuss your portfolio, learn of other stock tickers, and help out users by giving constructive criticism.\n\nWhy quarterly?  Public companies report earnings quarterly; many investors take this as an opportunity to rebalance their portfolios.  We highly recommend you do some reading:  A list of [relevant posts &amp; book recommendations.](https://www.reddit.com/r/stocks/wiki/index#wiki_relevant_posts_.26amp.3B_book_recommendations)\n\nYou can find stocks on your own by using a scanner like your broker's or [Finviz.](https://finviz.com/screener.ashx)  To help further, here's a list of [relevant websites.](https://www.reddit.com/r/stocks/wiki/index#wiki_relevant_websites.2Fapps)\n\nIf you don't have a broker yet, see our [list of brokers](https://www.reddit.com/r/stocks/wiki/index#wiki_brokers_for_investing) or search old posts.  If you haven't started investing or trading yet, then setup your [paper trading.](https://www.reddit.com/r/stocks/wiki/index#wiki_is_there_a_way_to_practice.3F)\n\nBe aware of [Business Cycle Investing](https://eresearch.fidelity.com/eresearch/markets_sectors/sectors/si_business_cycle.jhtml?tab=sibusiness) which Fidelity issues updates to the state of global business cycles every 1 to 3 months (note: Fidelity changes their links often, so search for it since their take on it is enlightening).  [Investopedia's take on the Business Cycle](https://www.investopedia.com/articles/investing/061316/business-cycle-investing-ratios-use-each-cycle.asp) and their [video.](https://www.investopedia.com/video/play/business-cycle/)\n\nIf you need help with a falling stock price, check out Investopedia's [The Art of Selling A Losing Position](https://www.investopedia.com/articles/02/022002.asp) and their [list of biases.](https://www.investopedia.com/articles/stocks/08/capital-losses.asp)\n\nHere's a list of all the [previous portfolio stickies.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22Rate+My+Portfolio%22+-+r%2FStocks+Quarterly+Thread&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all)",
        "subreddit": "stocks",
        "title": "Rate My Portfolio - r/Stocks Quarterly Thread September 2020",
        "url": "https://www.reddit.com/r/stocks/comments/ikj1y5/rate_my_portfolio_rstocks_quarterly_thread/",
        "created": 1598990877.0
    },
    {
        "author": "closingbell",
        "created_utc": 1601297936,
        "id": "j1biar",
        "num_comments": 297,
        "num_crossposts": 0,
        "selftext": "Back in March, long before a short seller would raise questions about electric-truck company Nikola Corp. and hasten its founder’s exit, early investors in the company were expressing concerns of their own.Those investors, led by mutual-fund giant Fidelity Investments, were worried that Trevor Milton, for all his brash visionary talk and Twitter braggadocio, lacked the ability that Elon Musk possesses to deliver these sorts of newfangled products to market. They lobbied successfully to remove him as CEO before the company’s June IPO and for Milton’s father to leave the board, according to people familiar with the matter. When the deal was done, Milton only held the title of chairman, the post he resigned this month.\n\nThe back-room negotiations show that Milton’s past was a concern to investors months before General Motors Co. executives placed a bet on the company in a US$2 billion deal carved out after the IPO. They liked Milton’s vision and his ability to raise cash and felt the venture was safeguarded from his shortcomings in operations by his push upstairs, say people familiar with the matter. Nonetheless, the events that have unfolded since the short-seller report, with Nikola’s stock plunging amid a steady stream of negative headlines, have exposed just how high the risks still were.\n\nNow, it’s up to former GM Vice Chairman Steve Girsky, whose blank-check company VectoIQ took Nikola public via reverse merger in June, and Nikola CEO Mark Russell to stabilize the business and regain investor confidence. The plan with GM was to use Nikola’s hot stock and Milton’s ability to raise money to build a hydrogen-fueled trucking business with GM’s technology.\n\n“There is obviously someone on the diligence side who isn’t going to get a nice bonus this year,” said Reilly Brennan, founder of the venture capital fund Trucks Inc. “The best possible thing if you’re a shareholder is that Milton is no longer running the company and you have Girsky as chairman and GM providing technology.”\n\nThe GM deal was originally scheduled to close Sept. 30, and the automaker has said it plans to carry through, but that timing may slip, say people familiar with the matter. BP Plc is still engaged with Nikola in talks to partner on a network of hydrogen fueling stations for fuel-cell trucks the company hopes to sell, but also is slowing the pace for a deal, said the people, who asked not to be identified discussing private information. BP and GM declined to comment.\n\nMilton’s tale reads like a Greek tragedy. The report by short seller Hindenburg Research accused Milton of overhyping Nikola’s technology and has prompted investigations by the Justice Department and U.S. Securities and Exchange Commission. A cousin has accused him of a decades-ago sexual assault, which he denies. The company’s value peaked at US$30 billion and is now worth about US$7 billion.\n\nGirsky and GM Chief Executive Officer Mary Barra have both said publicly that they did plenty of due diligence. People familiar with the matter say that GM found out when scouting the deal that it had better batteries and fuel-cell technology but joined forces because Nikola had a working semi truck and access to capital markets. In addition, GM will get paid to build Nikola’s Badger pickup on existing assembly lines. Milton was so excited to get the Badger pickup program moving that he signed a deal that heavily favored GM, one of the people said.\n\nNikola’s stock and GM’s US$2 billion stake are worth less than half what they were on Sept. 8, when the deal was announced. Milton’s own stake is worth US$1.7 billion, down from almost US$5 billion at one point.\n\nMilton said in a June interview with Bloomberg News that he grew up in modest surroundings in Layton, Utah. His family moved to Las Vegas when he was very young and he lost his mother to cancer shortly after moving back to Utah in the sixth grade. He wrote on Twitter he didn’t finish high school, earning an equivalency certification instead, and later dropped out of college. His Twitter account has since been deleted.\n\nHe grew up in a tight-knit Mormon family, according to Aubrey Smith, his first cousin. She went on social media recently and accused him of sexually assaulting her in 1999 when she was 15 and he was 17.\n\nIn a public account on Facebook and Twitter, and repeated in a phone interview, Smith said that Milton came onto her at the funeral of their grandfather. He took her shirt off without permission, Smith wrote, and then he touched her inappropriately before someone knocked at the door and she ran out.\n\nMilton denied the allegations through a spokesman.\n\nSmith said Milton raised money from family members to get his start. He founded and ran several businesses, including a home-security company that Milton claims he sold for US$1.5 million. Next, in 2009, he founded an e-commerce platform called Upillar.com, which Milton claims “pioneered the shopping cart online.”\n\nThen he got into clean propulsion but ended up embroiled in litigation with dHybrid Inc., which he founded in 2009. The company retrofitted diesel vehicles with natural-gas-burning turbines, claiming the dual system had greater efficiency.\n\nBut a deal with Swift Transportation Co. in 2010 ended in court when Swift alleged dHybrid defaulted on a US$322,000 loan and that it retrofitted only half of the agreed vehicles. The case was dismissed in 2015.\n\nMilton later tried to sell dHybrid to a company called sPower in May 2012 but that, too, got mired in lawsuits after sPower backed out and accused Milton of exaggerating its technological capabilities.\n\nAmid the litigation, Milton started another company with a very similar name, dHybrid Systems, selling it in 2014 to Worthington Industries.\n\nDuring an interview with Bloomberg in June, Milton said that dHybrid Inc. was a success but conceded that, “we ended up closing that one down because of some litigation.”\n\nHis next startup was Nikola, founding it in 2014 in Salt Lake City before moving to Phoenix. Emulating Musk, he took the name from the electricity pioneer Nikola Tesla, and the company was soon billed as the Tesla of Trucks. His plan was seen as potentially disrupting the entire transportation industry by making trucks that ran on batteries or hydrogen-fuel cells. He also planned to build a network of hydrogen filling stations.\n\nFriends and Family\n\nMilton had friends and family members working for Nikola despite resumes that didn’t match the job. His brother, Travis Milton, is director of hydrogen and infrastructure. His LinkedIn profile shows that most of his experience was being “self-employed” in Maui. The short seller, Hindenburg Research, said that Travis Milton poured concrete as a contractor. Milton’s father Bill was originally on the board but stepped down when VectoIQ took the company public.\n\nThe company’s stock prospectus said that Nikola had awarded more than 3 million stock options “to recognize the superior performance and contribution of specific employees.” The list included Travis Milton and an uncle, Lance Milton, the document said, acknowledging that they are relatives.\n\nAs Milton went public with Nikola’s technology, questions soon arose involving his claims about the company’s fuel-cell system. He bragged in an investor video in 2019 that the company had created “what other manufacturers said was impossible to design.” But while Nikola holds patents in fuel-cell and battery technology, most of its planned hardware was coming from German supplier Robert Bosch Gmbh.\n\nNikola Demonstrations\n\nIt became clear that Milton had gotten ahead of himself. A 2016 demonstration showed a truck that didn’t have a working hydrogen-fuel-cell system and was missing key parts, people familiar with the matter said in June. Milton said at the time that the parts were removed as a safety precaution.\n\nIn July of this year, he recorded a video of the semi truck in which he ran alongside the vehicle as it coasted at low speeds in a parking lot. Aping Musk’s combative social-media persona, Milton took a shot at his detractors saying, “these damned trolls, I wonder if they are going to apologize to everyone for the lies they spread the tens of thousands of comments about how fake we are.”\n\nGirsky said in the webcast “Autoline This Week,” in which Bloomberg participated, that he has been in Nikola’s fuel-cell trucks and that they work.\n\nStill, when the GM deal was done, GM will be supplying all of the technology for every global market except Europe. Nikola’s pickup truck, called Badger, will use GM’s Ultium battery, and the semis will run on a fuel cell developed by GM and Honda Motor Co.\n\nSince Milton’s departure, Nikola has billed itself more as an integrator of other technologies into its Badger pickup and semi trucks.\n\nFor GM’s part, the automaker is protected from any financial downside. GM got 11 per cent of the stock for no cash investment and gets paid for its technology. If Nikola fails, GM won’t lose a dime.\n\nMilton has remained silent and is out of the company. He unknowingly presaged his own downfall in the June interview with Bloomberg: “Part of becoming a better person in life is losing everything you have got and having nothing left.”\n\nhttps://www.bnnbloomberg.ca/nikola-founder-milton-s-fall-reveals-what-his-backers-feared-1.1500376",
        "subreddit": "investing",
        "title": "Bloomberg: Nikola founder Milton's fall reveals what his backers feared",
        "url": "https://www.reddit.com/r/investing/comments/j1biar/bloomberg_nikola_founder_miltons_fall_reveals/",
        "created": 1601326736.0
    },
    {
        "author": "initialzx",
        "created_utc": 1599257583,
        "id": "impi1l",
        "num_comments": 180,
        "num_crossposts": 0,
        "selftext": "Source: [https://www.fidelity.com/learning-center/trading-investing/markets-sectors/bull-market-highs?ccsource=email\\_weekly](https://www.fidelity.com/learning-center/trading-investing/markets-sectors/bull-market-highs?ccsource=email_weekly)\n\nKey takeaways from the article:\n\n* The stock market hit new highs last week, and the history of market cycles suggests that the current bull market trend could continue for some time to come.\n* In terms of the business cycle, the US economy is out of recession and into an early cycle recovery.\n* In addition, the market continues to display characteristics of a secular bull market. Secular bull markets are prolonged super-cycles in which the market produces above average returns.\n* Factors supporting the secular thesis include de-equitization (the number of public stocks is declining), a highly accommodative monetary policy, and a weaker dollar.\n\nInterested in hearing your opinions.",
        "subreddit": "investing",
        "title": "Fidelity says we're in an early cycle bull market - do you guys agree?",
        "url": "https://www.reddit.com/r/investing/comments/impi1l/fidelity_says_were_in_an_early_cycle_bull_market/",
        "created": 1599286383.0
    },
    {
        "author": "XacTactX",
        "created_utc": 1599807833,
        "id": "iqlpe6",
        "num_comments": 124,
        "num_crossposts": 0,
        "selftext": "Every day on this sub I see many people asking \"Should I just buy VOO/VTSAX?\" and far too often someone replies and says yes. I just want to point out that according to your favorite investment firms, you should have international investments, and here is the evidence.\n\n&amp;#x200B;\n\n[**According to Vanguard, international stocks should outperform U.S. stocks by \\~3.5% per year in the next 10 years.**](https://advisors.vanguard.com/insights/article/marketperspectivesseptember2020)\n\n&amp;#x200B;\n\n|Type|Return|Risk|\n|:-|:-|:-|\n|U.S. Equities|3.9 - 5.9%|17.9%|\n|Global Equities ex-U.S.|7.4 - 9.4%|18.6%|\n\n[**According to BlackRock, international stocks should outperform U.S. stocks by \\~1.2% per year in the next 10 years.**](https://blackrockblog-blanktemplate-assets.s3.amazonaws.com/pdf/CMA/2008/Capital_Market_Assumptions_USD_5.pdf)\n\n&amp;#x200B;\n\n|Type|Return|Risk|\n|:-|:-|:-|\n|U.S. Large Cap Equities|5.8%|16.3%|\n|Global ex-U.S. Large Cap|7.0%|16.2%|\n\n[**According to Charles Schwab, international stocks provide a diversification benefit and they lower the volatility of your portfolio.**](https://www.schwab.com/resource-center/insights/content/why-global-diversification-matters)\n\n&amp;#x200B;\n\n&gt;\"If you don’t invest globally, you’re  not only narrowing your opportunity set and potentially decreasing your  expected return, but ignoring an important tool to help manage volatility. Though not without risk, a global allocation provides diversification benefits and is one of the underpinnings of modern wealth management.\"\n\n&amp;#x200B;\n\n[**According to Morningstar, international stocks generate less of their revenue in the U.S., and they have lower correlations to the U.S. market than the S&amp;P 500. (video)**](https://www.morningstar.com/articles/937958/should-you-bother-investing-abroad)\n\n&amp;#x200B;\n\n&gt;\" A lot of times people say, \"Well, you know, don't I get enough  international diversification with U.S. stocks?\" It is true that a lot  of large-cap U.S. stocks are global. Based on Morningstar data, U.S  stocks in the S&amp;P 500 generate about 62% of their revenue in the  U.S. But international stocks actually still have less exposure to the  U.S. market. If you look at the holdings of Vanguard Total International  Stock ETF, they only generated about 15% of their revenue in the U.S.  over the past year. So, you do get a lot better market diversification  in terms of where the underlying stocks do business by diversifying  across both U.S. as well as international stocks.\"\n\n&amp;#x200B;\n\n[**According to Fidelity, the currency exchange risk that comes from international stocks is not a major issue for long-term investors.**](https://www.fidelity.com/viewpoints/investing-ideas/international-investing-myths)\n\n&amp;#x200B;\n\n&gt; \"Actually, history shows that hedging currency returns doesn't improve  international stock returns—at least not over the long term. Currency  hedging (holding a stock denominated in a foreign currency and an equal  but opposite short position in the currency itself) is intended to  prevent currency fluctuations from hurting the stock price. While it  sounds good in theory, the time and cost it takes to hedge currency has  not paid off over time. Since 1973, currency hedging has detracted from  returns in 50% of quarters, and contributed to returns in 50% of all  quarters (see chart).\"",
        "subreddit": "investing",
        "title": "Should you own international investments? According to the experts, yes you should.",
        "url": "https://www.reddit.com/r/investing/comments/iqlpe6/should_you_own_international_investments/",
        "created": 1599836633.0
    },
    {
        "author": "OnlyBringinGoodVibes",
        "created_utc": 1600381298,
        "id": "iutsas",
        "num_comments": 81,
        "num_crossposts": 0,
        "selftext": "As the title says.  I'm late to the game at 31 but better late than never.  Opened a Fidelity account, maxed a Roth IRA with FSKAX.   I now have about $65k liquid with about $30k sitting in a previous employer 401k (T. Rowe).  I'd like so play with $15-20k in stocks split between a \"Safe\" bet like the FSKAX, but also wanting to buy some individual big market cap stocks.  Apple, Microsoft, Amazon, J&amp;J, Berk.B, and P&amp;G seem to be the hot tickets.  Thanks!",
        "subreddit": "stocks",
        "title": "$20k to spend on my first ever stocks",
        "url": "https://www.reddit.com/r/stocks/comments/iutsas/20k_to_spend_on_my_first_ever_stocks/",
        "created": 1600410098.0
    },
    {
        "author": "ericzhouh",
        "created_utc": 1600805039,
        "id": "ixv3zg",
        "num_comments": 63,
        "num_crossposts": 0,
        "selftext": "I have been mainly using Fidelity until a friend of mine introduced me to Robinhood in 2019. I moved 50% of my portfolio to Robinhood. After 1.5 years, my return on Robinhood is -15%, while on Fidelity is 5%. \nI reviewed my transactions and found that I am trading more aggressively on Robinhood. My instincts as a product design manager makes compare the UI design between Robinhood and Fidelity and found the following:\n1. Robinhood’s real-time stock price update makes me more anxious when following stock prices. \n2. The coloring and loss/gain percentages gives me dopamine rush, which triggers me to unconsciously open up the app every few minutes throughout the day. \n3. The swipe-up to submit order design and the fun fair animations following it make the act of trading feels like a game. \n4. The red dot on the messages tab compelled me to click on it.\nThese are all typical ways of making an addictive game. I wonder if frequencies of trading is a KPI that Robinhood is designed to maximize, since it profits from feeding retail investors’ trades to the market-makers.\n\nAnyway, I will move my portfolio to a boring broker to keep my sanity.\nHope this post helps you to be aware of the manipulation that Robinhood app is applying to us.",
        "subreddit": "wallstreetbets",
        "title": "Why Robinhood may cause you to lose money",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ixv3zg/why_robinhood_may_cause_you_to_lose_money/",
        "created": 1600833839.0
    },
    {
        "author": "TradingIsMyBitch",
        "created_utc": 1600542793,
        "id": "ivyt4p",
        "num_comments": 57,
        "num_crossposts": 0,
        "selftext": "SPAC's are making millionaires, so get in, dumbasses!   \n\nI'm already FOMO YOLO into DPHC but news just keeps coming and massive upside just confirmed. Analyst inadvertently gave valuation yesterday after analyst event last week.  $16 billion means over $90/share value, but that is over THREE times Friday close!  Once this converts to RIDE it will run even more.  They have third largest factory in the U.S. and backed by GM, Samsung, Fidelity, Goodrich, etc...   It is Free F'n Money.  FFM, bitches.   There are other spac's I see easy money in too, but this one is safest to YOLO into.  I went all in with 401k, IRA, Trade Accounts for shares, BUT you can get warrants for leverage if you need money to go farther.  You almost can't fuck up buying these spacs UNLESS you have paper fingers that hit \"sell\" and then you will lose your money no matter what good advice you are given.  p.s Plus, options coming looks like b/c showing up on some trading platforms (not Fidelity..just checked) per some post on stocktwits.  If you wait on options you are giving up money though.  p.p.s.  I'm a GenX'r, you fucks, not a boomer.\n\n10,000 shares DPHC (aka RIDE)",
        "subreddit": "wallstreetbets",
        "title": "YOLO into Lordstown Motors DPHC becoming RIDE in a month...",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ivyt4p/yolo_into_lordstown_motors_dphc_becoming_ride_in/",
        "created": 1600571593.0
    },
    {
        "author": "Genx-soontobeexdub",
        "created_utc": 1601290507,
        "id": "j19usq",
        "num_comments": 44,
        "num_crossposts": 0,
        "selftext": "We currently have a financial advisor that is charging us 1% yearly.   I see no way that he is worth that.  Some of his bets seem way too risky to me as well (DAL,UAL).  Does anyone have any experience with firing your advisor but keeping the same fidelity account and taking over control of it?",
        "subreddit": "investing",
        "title": "How do you fire your Fidelity advisor.",
        "url": "https://www.reddit.com/r/investing/comments/j19usq/how_do_you_fire_your_fidelity_advisor/",
        "created": 1601319307.0
    },
    {
        "author": "Masculiknitty",
        "created_utc": 1600454454,
        "id": "ivbvre",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "Hello everyone. I was told multiple times by Schwab representatives that the reorganization fee of $39 that is charged when splitting units would be waived for “active traders” - those who execute more than 36 trades a year. Unfortunately, this has apparently changed and they will only waive the fee for those with a household balance over $500,000. I love Schwab as a broker but this might be enough incentive for me to move my holdings to fidelity. \n\nIf anyone has a reason why I should not do so and just bite the bullet for my many different unit holdings, please enlighten me. Thank you.",
        "subreddit": "SPACs",
        "title": "Schwab Reorganization Fee",
        "url": "https://www.reddit.com/r/SPACs/comments/ivbvre/schwab_reorganization_fee/",
        "created": 1600483254.0
    },
    {
        "author": "krubem",
        "created_utc": 1599022384,
        "id": "il0h2j",
        "num_comments": 35,
        "num_crossposts": 0,
        "selftext": "So I use Fidelity and have been day trading for a few months with it, if I were to open start using TD or Schwab, what would happen with my taxes. I literally just wanna make 1 order on TD or Schwab because the stock I want is not on Fidelity.",
        "subreddit": "stocks",
        "title": "How would taxes work if I start trading with a second brokerage?",
        "url": "https://www.reddit.com/r/stocks/comments/il0h2j/how_would_taxes_work_if_i_start_trading_with_a/",
        "created": 1599051184.0
    },
    {
        "author": "Calabeast02",
        "created_utc": 1600120811,
        "id": "isv79e",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "I’m looking to switch my margin and Roth IRA accounts to a single, better brokerage (currently use Robinhood 😬 and webull for margin and Merrill for IRA.\n\nSeems like general consensus is Fidelity, TD Ameritrade, and ETrade. I’ve heard mixed reviews about all of them, but looking for the clear winner in terms of full accessibility to spacs and best extended hours.\n\nI like Robinhood for its simplistic and intuitive platform, and webull for its information, charting ability, and full access to extended hours.\n\nI like that fidelity does not charge for unit splits (can someone confirm this?), but it seems to lack advanced functionality. Have heard that E*TRADE is solid overall, and that TD has some service issues/glitches. \n\nDoes anyone know of another brokerage that offers full extended hours trading and full access to spacs with minimal fees? Or would you recommend one of the aforementioned brokerages?\n\nAppreciate any recommendations!",
        "subreddit": "SPACs",
        "title": "Best Brokerage for Trading SPACs?",
        "url": "https://www.reddit.com/r/SPACs/comments/isv79e/best_brokerage_for_trading_spacs/",
        "created": 1600149611.0
    },
    {
        "author": "anonoyster10",
        "created_utc": 1599613584,
        "id": "ip69jf",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "Hello! I'd like to preface that by no means am I really familiar with investing, I'm a college student and I just started learning more about it.\n\nI'm turning to Reddit to see where you guys would suggest I open up a brokerage account.\n\nLet's say I've got a couple thousand dollars to invest long-term, should I go for Robinhood or Fidelity/Schwab/TD/etc?\n\nI'm pretty risk-adverse and generally want to be hands-off. \n\nThanks so much in advance!",
        "subreddit": "investing",
        "title": "Which one should I pick: Robinhood or Fidelity/Schwab/TD/etc.?",
        "url": "https://www.reddit.com/r/investing/comments/ip69jf/which_one_should_i_pick_robinhood_or/",
        "created": 1599642384.0
    },
    {
        "author": "ti82_",
        "created_utc": 1600265625,
        "id": "itwbm3",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "Had a random call from NH just now, it's an account planner from Fidelity. I ask what the reason for calling is and he says they're actively reaching out to people to see if they have questions about how to manage their investments with the impending recession.\n\nBatten the hatches, cause it's gonna get stormy.\n\nPositions:\n\nSRNE sold 2 calls 12-18@12 lol makin that sweet premium",
        "subreddit": "wallstreetbets",
        "title": "Fidelity called, they're scared",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/itwbm3/fidelity_called_theyre_scared/",
        "created": 1600294425.0
    },
    {
        "author": "Dachtler",
        "created_utc": 1599785734,
        "id": "iqgeop",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "Just turned 16 and have a job and about 6,000$ considering I won't need most of it in 3-4 years I wanted to know what would be a good place to get started in investing. My grandfather got me a account in fidelity for my birthday. Any help would be grateful. Also I tried asking this on r/wallstreetbeats and they told me to come here.",
        "subreddit": "investing",
        "title": "Am 16 and wondering how to invest",
        "url": "https://www.reddit.com/r/investing/comments/iqgeop/am_16_and_wondering_how_to_invest/",
        "created": 1599814534.0
    },
    {
        "author": "Godkingcoconut",
        "created_utc": 1601263940,
        "id": "j14s3m",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "Okay so for Index Funds we all know the SPY.  Some of us bet it some of us just long term invest in a Vanguard/IShare/Fidelity S&amp;P Index.\n\nWe have the QQQ for those of us that know that tech is the future and strangely now the gold currency of the market in tough times.\n\nWe have the GLD and SLV for Gold and Silver when those are nice and low in safe times to buy in or play runs when turbulent.\n\nWhat other Index Funds are must knows and why?\n\nAnd any of you prefer or play the VTSAX versus the standard S&amp;P Index Funds and if so why?  I have always been curious on the selling feature of this one.\n\nAnyway I look forward to hearing more from people more knowledgeable than myself about the different plays in this realm and how you approach it all.\n\nI am curious from the WSB angle what all wild positions you take and what strange and exotic etfs you like to play for rare game hunting.",
        "subreddit": "wallstreetbets",
        "title": "What other funds you degenerates all betting on ;)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j14s3m/what_other_funds_you_degenerates_all_betting_on/",
        "created": 1601292740.0
    },
    {
        "author": "helpplease12223",
        "created_utc": 1600048973,
        "id": "isbrnx",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "Hi Reddit,\n\nI’ve got access to roughly $1.5m liquid.\n\nLooking to buy a stock that will IPO this week.\n\nI have a Merrill Edge account, can I go through them? I am not reading anything thus far that confirms Merrill Edge allows Pre IPO Investing.\n\nDo I need to get a Fidelity brokerage account? I looked into it, but I don’t think I can get the money transferred there before 8am Tuesday (time of IPO).\n\nCurious to see your all thoughts and what my options are to buy PreIPO.\n\nThanks In advance guys, looking forward to your help with this.",
        "subreddit": "investing",
        "title": "How can I invest in a Pre IPO?",
        "url": "https://www.reddit.com/r/investing/comments/isbrnx/how_can_i_invest_in_a_pre_ipo/",
        "created": 1600077773.0
    },
    {
        "author": "WannabeStonks69",
        "created_utc": 1600231524,
        "id": "itp1es",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "**Alliance Data Systems: A Special Situation Value Proposition**\n\nTl;dr ADS’s revenue hasn’t suffered much, but cash flows and income have due to debt restructuring which has changed valuation metrics significantly, but this may not be something to worry about but rather something to take advantage of.\n\nAlliance Data systems is a provider of private label credit cards to retail businesses like Ulta, Victoria’s Secret, Pottery Barn, J.Crew, Eddie Bauer, IKEA etc. and Alliance owns LoyaltyOne which runs Air Miles (been damaged severely, duh), and has partnerships with several other global retailers. Alliance attempts to capture transaction data to help companies create marketing strategies and to help understand what their consumer base wants and needs, they’re entire mission is centered around making sure producers are able to reduce their costs, focus on making products that are wanted, and improve their bottom line. \n\nAnalysis of consumer data is obviously very lucrative and several companies thrive off of this alone, but ADS will almost be a FinTech+Marketing company combined which will possibly revive it into the growth stock it once was promised to be.\n\nAlliance is partly a credit services/marketing company, so the structure of the company is a bit complex, but I’ll try to demystify the financials here soon. \n\nFirst I’d like to point out that Alliance is a plateauing company in terms of the top line; revenue:\n\nhttps://preview.redd.it/c06npxsuufn51.png?width=250&amp;format=png&amp;auto=webp&amp;s=5ee6c3d4e73e23f7621f66b436adecdfa5ced530\n\nYou can see here that for the past 3 years revenue has seemed relatively flat, and why this isn’t that bad is because Alliance is shedding some weight. Just last year they sold Epsilon, a small marketing division that was losing sales for 3.5B in cash ([https://www.bizjournals.com/dallas/news/2019/04/16/alliance-data-epsilon-publicis-groupe.html](https://www.bizjournals.com/dallas/news/2019/04/16/alliance-data-epsilon-publicis-groupe.html)) and they intended on using the proceeds to deleverage and redistribute cash to shareholders via a dividend hike. This may make the company seem weak, but Epsilon was a terrible fit for Alliance’s private credit based services, and the extra cash will be really helpful for their future plans. It was a perfect time to spin off and get rid of a dead limb, which they finally did. A big reason why net income was down so much this past year but revenue was not is because of this sale and its fees along with debt restructuring, which increased expenses by a great deal as you will see below, and a lot of this expense was spread throughout other expenses as well: \n\nhttps://preview.redd.it/fnczngzwufn51.png?width=535&amp;format=png&amp;auto=webp&amp;s=ffcb28fdcf6a8731220c6ddb86830eb02d67cbc1\n\n&amp;#x200B;\n\nThose 3 lines before adjusted EBITDA added a lot to their expenditures, and the income from the continuing operations was partly lower because of earlier OpEx increases most likely attributed to both debt restructuring and the selling of Epsilon.\n\nHere’s what I mean by a change in debt, financing cash flows have declined a lot, which makes overall cash flows look a lot lower, therefore scaring investors.\n\nhttps://preview.redd.it/eo1uf17zufn51.png?width=618&amp;format=png&amp;auto=webp&amp;s=1fa5733fe5fd4c0b1037f40e1983b61a3a425a45\n\nOn top of that, they recently paid off a large amount of debt and increased invested cash flows\n\nhttps://preview.redd.it/ysqh6148vfn51.png?width=526&amp;format=png&amp;auto=webp&amp;s=771dfe50383b7b7a144e5d5219543640c0605397\n\nThey also had lower defaults for their private credit cards in 2019, resulting in more healthy debt for the company. \n\nhttps://preview.redd.it/h8a86ay9vfn51.png?width=600&amp;format=png&amp;auto=webp&amp;s=b2be4684f013988dbf052e0404b15edf7001b33a\n\nNow let’s look into some basic fundamentals of the finances outside of the situation going on right now\n\n&amp;#x200B;\n\n[Low SGA\\/Gross profit therefore decreasing expenses relative to growth](https://preview.redd.it/zikqh0qcvfn51.png?width=375&amp;format=png&amp;auto=webp&amp;s=595b8e0a8fa0526dd6ecdbd9bdcd1db1f660042a)\n\n&amp;#x200B;\n\n[Increasing gross profits for the past few years](https://preview.redd.it/592fcpzevfn51.png?width=396&amp;format=png&amp;auto=webp&amp;s=3d96e038ef6692cbf2f1a513d8a395c1cc411223)\n\n&amp;#x200B;\n\n[Increased cash has resulted in a dividend hike from 2.28 to 2.52 this year](https://preview.redd.it/u39q0czhvfn51.png?width=415&amp;format=png&amp;auto=webp&amp;s=a0ad3dbe9aaed1306bdf53fa9662e40d875c507a)\n\n[Big decrease in long term debt, and we should see this go lower in the future as well.](https://preview.redd.it/z1jnyz04wfn51.png?width=434&amp;format=png&amp;auto=webp&amp;s=4191bb238f3d4dd2fc52260f6e79a448f64de281)\n\n&amp;#x200B;\n\n[Low Enterprise Value-Sales ratio, always a good buy in indicator](https://preview.redd.it/pduggpd6wfn51.png?width=372&amp;format=png&amp;auto=webp&amp;s=cc3822c623dae41daff7162a644e78ec20e1272a)\n\n&amp;#x200B;\n\n[Super low price\\/sales despite mostly stable sales numbers](https://preview.redd.it/brtinjc8wfn51.png?width=431&amp;format=png&amp;auto=webp&amp;s=c8987a9da5dd9bca2a9c88f67c4bc5b2dfe1c1ac)\n\nAlso ADS has a P/E of only 7.4, a forward P/E of just 4.1, a Price/Cash ratio of 0.43, and a Price/FCF of only 2. This along with the fact that competitors FIS,GPN,FISV,PCOM have way higher valuation multiples and the fact that ADS has very low WACC due to its primary financing being debt financing makes it a no-brainer for the average Joe value investor, because analyst targets are currently setting the price for this one at 62$. Not only that, but most conservative estimates of its intrinsic value will show it to be around the 80$ range. But I also think that this stock has major growth potential because instead of being a super asset and debt heavy company, ADS will now focus more on the data and service side of their business, making them a FinTech firm of sorts. They are big enough to be able to finance any sort of project that leans more into data analysis and tech, plus they have broad global overreach in the Middle East, Asia, and Europe where it’ll be easier to transfer their new lightweight business platform. But deleveraging can be a very difficult process, and it’s definitely not without pitfalls. Since this is a pretty big company that’s in the S&amp;P 500 though, they have more than enough cash to fall back on if this restructuring doesn’t go as planned, and while 2019 was shaping out to be a decent year for ADS, if you see the most recent 10-Q, there is a lot of impact from COVID on their margins, with revenues falling by 50% from the same quarter last year:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/66fptqmbwfn51.png?width=476&amp;format=png&amp;auto=webp&amp;s=cf054135e2c19eabfd1f78b37c163accdfcff348\n\nBut in my opinion, this just makes it a better buying opportunity. This is one of those really heavily damaged companies in a very damaged industry that’s got a lot of growth potential up its sleeve. At this point, I don’t know how much of a short term prospect there would be for the share price itself, but there’s a lot cooking underlying the price that may not be so obvious to investors. I think the panic selling has created a great storm for the value investor to rake up this stock at a huge discount price. It may continue to see more downturn still, but so far it seems relatively stagnant and just waiting for this bump in the road to come to an end. \n\nLMK if you have any experience with them below\n\nTl;Dr, If you have no idea when this'll moon and you love gambling on whether or not this'll be like SQ buy calls for whenever, probably LEAPs. but overall mad undervalued so buy shares for your ROTH if you have some extra cash laying around",
        "subreddit": "wallstreetbets",
        "title": "ADS DD, for the boomers and degens both",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/itp1es/ads_dd_for_the_boomers_and_degens_both/",
        "created": 1600260324.0
    },
    {
        "author": "EpicthrowawayIS",
        "created_utc": 1600269603,
        "id": "itxkk7",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "They PDT'd me by counting two buys of the same ticker followed by closing the entire position as once as 2 day trades.  I'm always extremely careful to check my remaining day trades and that was one fucking change of direction, not two.\n\nBesides that they were just a shitty broker overall.  I much prefer my other two accounts (Webull and Tastyworks).  Their interface was clunky as all fuck and their margin requirements and options restrictions were the worst I've seen.\n\nFuck them. I liquidated everything and am heading TD Ameritrade",
        "subreddit": "wallstreetbets",
        "title": "Fuck Fidelity",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/itxkk7/fuck_fidelity/",
        "created": 1600298403.0
    },
    {
        "author": "SignificantStation52",
        "created_utc": 1599925740,
        "id": "ireyk4",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "Hello, received Corp voluntary action notice via Fidelity.  The notice offers the right to redeem shares at $10.16 before the merger vote on Sept 28.  I have common shares. First of all why would I sell to them for $10.16 when I can sell in the market for $47.78.  Fidelity representative did not give me a good feeling; saying that when the merger takes place the new IPO ticker HYLL would be at $10.16 so why would anyone pay $47.78 if they can buy at $10.16.  Would greatly appreciate if someone can explain this notice.  I was hoping to make the decision to hold/sell once the ticker change with pop.",
        "subreddit": "SPACs",
        "title": "SHLL - CORP VOLUNTARY ACTION TO REDEEM",
        "url": "https://www.reddit.com/r/SPACs/comments/ireyk4/shll_corp_voluntary_action_to_redeem/",
        "created": 1599954540.0
    },
    {
        "author": "Haruv",
        "created_utc": 1601498955,
        "id": "j2uf6e",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "Hi,\n\nI'm not from the US and I already invest in the US market through my bank, but I would like to find another way to trade because the fees are pretty high, etc...\n\nI found a few platforms:\n\nSaxo Bank\n\nTD Ameritrade\n\nInteractive Brokers\n\nFidelity\n\nCharles Schwab\n\nI wanted to know if anyone has used these before and if they are any good.\n\nThanks in advance :)",
        "subreddit": "stocks",
        "title": "Non-US citizen, looking to invest",
        "url": "https://www.reddit.com/r/stocks/comments/j2uf6e/nonus_citizen_looking_to_invest/",
        "created": 1601527755.0
    },
    {
        "author": "vwite",
        "created_utc": 1601222889,
        "id": "j0tnni",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "I've read on other threads that tastyworks uses a\nApex clearing so fills are just as bad as robinhood and that I'd get better fills with ToS, does anyone know how the Fidelity trades fills are in comparison? I'm thinking about buying and selling options in a Roth IRA (extremely simple strategies, around 3 - 6 trades pr week) so don't really need all the charting options of ThinkorSwim. It seems fees are exactly the same for both, $0.65 per contract to open and $0.65 to close.",
        "subreddit": "options",
        "title": "Fidelity vs TD Ameritrade Fill prices?",
        "url": "https://www.reddit.com/r/options/comments/j0tnni/fidelity_vs_td_ameritrade_fill_prices/",
        "created": 1601251689.0
    },
    {
        "author": "IRGAWD",
        "created_utc": 1599091099,
        "id": "ilin0t",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "I’m confused how wash sales are calculated. I recently incurred a significant loss, then repurchased the same security (much smaller volume) forgetting that I had fucked around with it &lt;30 days ago, which resulted in a 4k disallowed loss. I’m guessing that a disallowed loss is triggered regardless of the size of the loss or size of future investment (as long as you repurchase in less than 30 days a losing previously losing position). So, in other words I could spend 100k on a position, lose 50k then repurchase $500 worth of the same stock 10 days later and now my 50k loss is disallowed. Is this correct? \n\nAlso, I called Fidelity who claimed wash sales don’t apply to options. Is this correct?",
        "subreddit": "wallstreetbets",
        "title": "Wash Sale Rules?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ilin0t/wash_sale_rules/",
        "created": 1599119899.0
    },
    {
        "author": "InsidiousDiseez",
        "created_utc": 1599525468,
        "id": "iojoj8",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "Recently I’ve been trying to apply and get approved for level 3 options trading from Fidelity which would allow me to trade credit and debit spreads, which are much more attractive to me than buying calls/puts. \n\nMy question is that I am not getting approved, and I was wondering the requirements for spreads. I currently have a $1,000 dollar account, and have level 2 options trading available. Do I need more money in my account to trade spreads? If so, what amount?\n\nIf anyone uses Fidelity to trade, advice would be much appreciated.",
        "subreddit": "options",
        "title": "Fidelity Spreads and Level 3 Options Trading",
        "url": "https://www.reddit.com/r/options/comments/iojoj8/fidelity_spreads_and_level_3_options_trading/",
        "created": 1599554268.0
    },
    {
        "author": "ChronicCSD",
        "created_utc": 1599145036,
        "id": "iluyyq",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "I use fidelity and TOS to trade but their charting and watch list are lame AF. Maybe I'm just not boomer enough. \n\nHas anyone tried TradeStation? Is it worth giving it a shot? Looking into webull aswell.",
        "subreddit": "wallstreetbets",
        "title": "Who else uses robinhood just to check price action and their watchlist? Tradestation, Webull opinions",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iluyyq/who_else_uses_robinhood_just_to_check_price/",
        "created": 1599173836.0
    },
    {
        "author": "kunst91",
        "created_utc": 1601427404,
        "id": "j2c7al",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "I have been options trading for about a year now in RH with a very small percentage of my portfolio to learn the basics.\n\nI would like to make this a more regular practice and devote a more significant percentage of my portfolio to options. \n\nI am in my late 20's and my current fidelity portfolio allocations are:\n\nBrokerage - $14k\n\nRoth IRA - $20k\n\nSEP IRA - $20k\n\nFirst, I am curious what percentage of my portfolio would be safe to devote to options. I have heard as low as 1-5%, but I have also seen posts here that suggest that as much as 50-100% of a portfolio can be made up of options as they are simply a mechanism to control equities.\n\nAlso of the three, which account would make the most sense to trade options in? Currently I have positions open in my brokerage and SEP IRA).",
        "subreddit": "options",
        "title": "Portfolio Allocation to Options",
        "url": "https://www.reddit.com/r/options/comments/j2c7al/portfolio_allocation_to_options/",
        "created": 1601456204.0
    },
    {
        "author": "Dachtler",
        "created_utc": 1599784716,
        "id": "iqg4l7",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Just turned 16 and have a job and have about 6,000$ but wanted to invest some because I won't be needing a lot of it for about 3-4 years wondering where is a good place to start and what to do. Lastly my grandfather opened a fidelity account for me to use. Any help Is gratefully appreciated",
        "subreddit": "wallstreetbets",
        "title": "Am 16 and wondering how to invest",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iqg4l7/am_16_and_wondering_how_to_invest/",
        "created": 1599813516.0
    },
    {
        "author": "Thraex_Exile",
        "created_utc": 1601243066,
        "id": "j0zj5b",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Long story short, I started investing through a robo-advisor(Blooom). While that journey could be a post of itself, what I’m finding is that the my fidelity indexes aren’t making me money. I know investing in companies is high risk, high reward. So it makes sense short-term they should be making me a lot more, but in the same period of time these fidelity indexes have lost capital.\n\nSo here comes the question: Am I wasting my money buying shares of fidelity versus a better known index fund like Nasdaq or S&amp;P? The zero fees attached is nice, but my research of short-term and overall interest gained in market shares suggests that Fidelity stock this robo-advisor chose is doing extremely poorly. S&amp;P for instance has risen 16% since Aug 2018, Fidelity zero international index has dropped 1%. \n\nIs this just a result of an international index vs a US index or is fidelity just a poor investment? Thank you for your input in advance.",
        "subreddit": "investing",
        "title": "The Viability of Fidelity Zero Index finds vs other index funds",
        "url": "https://www.reddit.com/r/investing/comments/j0zj5b/the_viability_of_fidelity_zero_index_finds_vs/",
        "created": 1601271866.0
    },
    {
        "author": "confusedp",
        "created_utc": 1599050421,
        "id": "il616f",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "USD has declined almost 10% compared to rest of the world. What is the best way to hedge this risk?\n\nI am very new to this, so this post is more asking for a discussion than me providing an answer.\n\nI found this article in Fidelity interesting: [https://www.fidelity.com/insights/markets-economy/prepare-weaker-dollar?ah=1](https://www.fidelity.com/insights/markets-economy/prepare-weaker-dollar?ah=1)\n\nText:\n\n&gt;U.S. investors are used to a strong dollar, and most don’t pay attention to its fluctuations. But the greenback’s value, relative to other major currencies, has fallen 10% over the past five months—and many expect the slide to continue. Investors have three options—stick to the original portfolio and simply ride out the currency fluctuations; shift into asset classes that tend to do better under a weakening dollar; and/or seek out investments designed to take advantage of a falling dollar.  \n&gt;  \n&gt;After the greenback suffered its worst month in a decade, investors are wondering why the drop. Here’s a close look at the forces behind it.© Financial Times 2020. These presentations are provided for informational purposes only.  \n&gt;  \n&gt;The dollar’s recent fall is primarily a result of the U.S. government’s monetary easing policies in response to the pandemic-triggered economic disruptions. Lower interest rates have made the currency less attractive to hold. In addition, the dollar supply surged as the Federal Reserve opened swap lines with other central banks. And the huge fiscal stimulus and mounting national debt have boosted demand for foreign capital.  \n&gt;  \n&gt;What’s more, as life in many parts of the world has begun to get back on track, the U.S. still doesn’t have Covid-19 under control. “The second-quarter GDP is the weakest we’ve seen on record,” says Schroders investment strategist Whitney Sweeney. “That—along with the increasing coronavirus infections—is really adding to concerns about weaker economic growth in the U.S. Simply being the haven is not going to be enough to bolster the dollar going forward.”  \n&gt;  \n&gt;Indeed, this might be the beginning of an extended dollar decline, says Kathy Jones, chief fixed-income strategist at the Schwab Center for Financial Research. She expects the currency to drop another 5% to 10% in the next year or two. “The Fed’s forward guidance says they’ll keep the rates low and liquidity ample for a couple of years. That’s a signal to the market that they don’t have a lot to fear in other currencies,” she says. “Investors have been heavily weighted in dollar assets, and now might be the time to diversify a little more broadly.”  \n&gt;  \n&gt;Investors could dial up their allocation to international assets, which typically benefit from a weakening dollar. Since foreign-based companies report their earnings in the local currency, U.S. investors will enjoy a larger gain when translating those numbers into dollars. For a well-diversified exposure, the $24 billion Vanguard Total International Stock ETF ( [VXUS](https://qr.fidelity.com/embeddedquotes/redirect/research?symbol=VXUS) ), which owns some 7,000 stocks from more than 45 countries, returned 18% over the past three months, beating the SPDR S&amp;P 500 ( [SPY](https://qr.fidelity.com/embeddedquotes/redirect/research?symbol=SPY)) by more than two percentage points.  \n&gt;  \n&gt;Investors should check whether an international fund is hedged against currency fluctuations or not. The hedged funds can protect returns when the dollar strengthens but will underperform when a cheaper dollar gives international assets an extra lift. While hedged and unhedged funds generate similar returns over the long run, in the short term, there can be big differences. Over the past three months, for example, the $49 billion iShares MSCI EAFE exchange-traded fund ( [EFA](https://qr.fidelity.com/embeddedquotes/redirect/research?symbol=EFA) ) gained 16.2%, while the $2.3 billion iShares Currency Hedged MSCI EAFE ETF ( [HEFA](https://qr.fidelity.com/embeddedquotes/redirect/research?symbol=HEFA) ) returned just 9.9%. “If the dollar continues to weaken, the unhedged funds should do better than the hedged funds,” says Morningstar ETF specialist Alex Bryan.  \n&gt;  \n&gt;A falling dollar can lead to inflation—higher prices for everything from apparel to airline fares. The core consumer price index, while still running lower than a year ago, jumped 0.6% from June to July, marking the fastest monthly rise since 1991. Yet, many economists say it’s too soon to worry. “We doubt that the rise in CPI in July is the start of a trend to higher inflation,” says Jones. “With the unemployment rate over 10% and excess capacity in so many industries, it’s unlikely that inflation can move up in a meaningful way this year.”  \n&gt;  \n&gt;Investors who want to be extra-cautious can shift some of their Treasuries into Treasury inflation-protected securities, or TIPS, whose face value rises with the consumer price index. Due to the Treasuries’ very low yields, however, Jones says that investors should “purely look at it as a hedge, rather than something that can produce income.”  \n&gt;  \n&gt;Hard assets like commodities are another hedge against inflation. Precious metals, in particular, have soared lately. ETFs such as the $33 billion iShares Gold Trust ( [IAU](https://qr.fidelity.com/embeddedquotes/redirect/research?symbol=IAU) ) and $14 billion iShares Silver Trust ( [SLV](https://qr.fidelity.com/embeddedquotes/redirect/research?symbol=SLV) ) are backed by physical commodities and closely track their prices. The $967 million Invesco DB Commodity Index Tracking ETF ( [DBC](https://qr.fidelity.com/embeddedquotes/redirect/research?symbol=DBC) ) offers a broader exposure, with futures contracts on 14 heavily traded commodities. Stock in companies that mine and trade commodities are another option, though usually more volatile.  \n&gt;  \n&gt;Finally, to specifically profit from a falling dollar, investors can directly bet on foreign currencies through the $76 million Invesco DB US Dollar Index Bearish ETF ( [UDN](https://qr.fidelity.com/embeddedquotes/redirect/research?symbol=UDN) ), which shorts the U.S. Dollar Index futures contracts and makes money if the dollar drops against six other major currencies. Be aware of the concentration risk; the euro alone accounts for half of the move.  \n&gt;  \n&gt;Morningstar’s Bryan recommends the iShares International Treasury Bond ETF ( [IGOV](https://qr.fidelity.com/embeddedquotes/redirect/research?symbol=IGOV) ) as a more diversified alternative; it owns a broad basket of government bonds from non-U.S. developed markets. Since interest rates in these countries are close to zero, the fund largely moves against the dollar’s value. But that also means no additional gains besides the currency movement. Bryan warns: “You are not really getting paid for holding the Treasuries, but it’s a safe place to park the money while you are riding out the movements of the dollar.”",
        "subreddit": "SecurityAnalysis",
        "title": "Dollar Hedging",
        "url": "https://www.reddit.com/r/SecurityAnalysis/comments/il616f/dollar_hedging/",
        "created": 1599079221.0
    },
    {
        "author": "passwerdsss",
        "created_utc": 1600261439,
        "id": "itv1cn",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "Now that we have beta transgender LGBTQ+ traders on Wall Street now they’re all betas. If you’ve never been in a fidelity or JP Morgan these guys are loser beta analysts for the most part who make 90k + bonus a year. Hate to break it to you but that’s nothing. Us retards do not use logic like them it’s either give us the tendies or crash and burn. \n\nThank being said they want to know wtf we retards are doing next Bc believe it or not we control the market. “One ape weak, many apes strong.” So start using fake tickers to fuck the algorithms we don’t need them inverting all of our plays. Even you retards who say they’re gonna buy into our positions your delusional. once the algorithm is working it will make them more money to inverse us then run with us.\n\n-just your average 20 y/o $T$L@ trader",
        "subreddit": "wallstreetbets",
        "title": "Fellow autists. THIS IS A CALL TO ARMS!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/itv1cn/fellow_autists_this_is_a_call_to_arms/",
        "created": 1600290239.0
    },
    {
        "author": "Footsteps_10",
        "created_utc": 1600361593,
        "id": "iunenq",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "Update from this post - [https://www.reddit.com/r/wallstreetbets/comments/humewm/cost\\_costco\\_guy\\_back\\_with\\_a\\_vengeance\\_like\\_thanos/?utm\\_source=share&amp;utm\\_medium=web2x&amp;context=3](https://www.reddit.com/r/wallstreetbets/comments/humewm/cost_costco_guy_back_with_a_vengeance_like_thanos/?utm_source=share&amp;utm_medium=web2x&amp;context=3)\n\nRecommended positions - 9/18 - Sell 340C/ Buy 350C for $2.00 premium. Will most likely be cash money. \n\nMy personal position - 9/18 - Sell 320C - Currently down -40% and will get assigned (or God will come to save me). I will sell a 10/16 320P and begin the wheel. I did capture the dividend, so $70 in my pocket. \n\nI am now 6/6 for my Costco recommendations. All in my post history. \n\nWhat a wild freaking ride. At one point, I was down over -300% on these plays at one point when the price hit 350+. I was just freaking stunned that I wasn't assigned early, but I guess I slipped through the cracks at Fidelity and the MMs didn't give a fuck about Costco. \n\nHeading into earnings next week 9/24. I don't see a reality where Costco misses. I will be selling puts across the board. They have had BOOMING sales due to Trump bucks. 12/13/13 Month over Month with their sales data. You should NOT BUY CALLS AT 40.5 P/E on Costco. Best of luck though. \n\nThe Innovel, Last Mile, the acquisition is not going well.",
        "subreddit": "wallstreetbets",
        "title": "$COSTCO Guy is back again from the grave. Update from previous play.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iunenq/costco_guy_is_back_again_from_the_grave_update/",
        "created": 1600390393.0
    },
    {
        "author": "WhiteHattedRaven",
        "created_utc": 1601236103,
        "id": "j0xjsa",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "Alright folks -- let's get a bit more involved than yelling (catchphrase)† at each other, and try to add some reasoning in. Dumb and useless since the market has no logic, I know, but I need something better than staring at weekend dow and jerking off. I want to discuss some different timeframes - the daily thread typically has people arguing with each other when one is holding leaps and the other is holding weeklies. They might both be right, so let's be specific.\n\nHere's a list of questions to get us started, and I'll add my own thoughts on all of these. Voice your opinion, but please also include the _why_. That way we can think through it together. Mainly interested in SPY/IWM, but all thoughts welcome. Stuff like \"cruise lines stock\" probably deserves a separate look.\n\n* Has the month of September been the start of a larger downtrend? If yes, how long do you expect this to continue?\n* Are we seeing a reversal of the downtrend/correction with Friday's move? If yes, is it short term for mostly next 1-2 weeks, or are you bullish through the new year?\n\nTimeframes we're interested in are:\n\n* Next week.\n* Next ~40 days heading into the election, and the ~2 weeks following it.\n* Jan 2021 and further.\n\nRecent catalyst topics:\n\n* Vaccine news (J&amp;J Phase 3).\n* Stimmy round 2 news (bill passing/almost ready in House).\n* Florida &amp; others reopening fully.\n* Europe lockdowns 2: wave 2 boogaloo.\n* Azerbaijan/Armenia conflict.\n\nLonger-term bullish reasons:\n\n* Stonks only go up (inflation, low-interest-rates driving money to equities).\n* Sector-based 'rona advantages, like QQQ and SPY.\n* Money on the sidelines since March.\n* Further DXY drops fueling equity \"growth\".\n\nLonger-term bearish reasons:\n\n* Corona never went anywhere and all signs point us to being headed into tougher months.\n* Extremely overvalued valuations (e.g. P/E ratios).\n* Civil unrest (mainly U.S., but also Belarus and others).\n\nPositions:\n\n* 401k - Bonds (account doesn't have cash option), re-balanced in Feb. Should have re-balanced back into stocks; expensive lesson. But I am patient and I see further downside. 🌈🐻\n* Roth - Various SPAC commons/warrants; I think these catch you a ban though, so shhh.\n* Robinhood - Blown up (on MGM, PCG, etc.); fuck their fills too, try something like ETrade/Fidelity and feel the difference instantly.\n* Others - VXX Dec 18 calls ($27, $30), SPXW puts (Oct 16/30, $3350, $3240, $3270), CMG Oct 16 puts ($1215, $1190), JNJ Jan 15 '21 $145 calls, PRPL shares and calls (didn't buy at the peak, so... have their mattress, am bullish), various other SPAC warrants and calls.\n\n† \"Bers/bulls r fuk\", \"stonks only go up\", \"green Monday\", etc.",
        "subreddit": "wallstreetbets",
        "title": "The non-DD DD: recent catalysts surely indicate we're moving to the right",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j0xjsa/the_nondd_dd_recent_catalysts_surely_indicate/",
        "created": 1601264903.0
    },
    {
        "author": "jaswangx0",
        "created_utc": 1598943827,
        "id": "ikfnnr",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "Billionaires will have billions of dollars in trading brokerages like Schwab, Fidelity, etc. If these brokerages go bankrupt, the SIPC will cover a max 500k for each brokerage so would a billionaire lose a huge amount of money if these brokerages fail and they lose their stocks?\n\nEven if they had 100 different accounts, that would cover 500,000*100 = 50 million.",
        "subreddit": "investing",
        "title": "How do billionaires protect themselves from the minimal SIPC coverage?",
        "url": "https://www.reddit.com/r/investing/comments/ikfnnr/how_do_billionaires_protect_themselves_from_the/",
        "created": 1598972627.0
    },
    {
        "author": "atlienf12",
        "created_utc": 1599355088,
        "id": "ind4jz",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "Fidelity wouldn’t let me exit my NIO calls on Thursday. I got a dumb fucking error message (stock symbol/ticker does not exist). I called support and spent 1.5 hours on the phone with this outcome: the rep also couldn’t execute my trade, and Fidelity could not offer me any compensation to make up for the difference in attempted trade price and current price. Just warning you autists.",
        "subreddit": "wallstreetbets",
        "title": "Fidelity fucked me on NIO calls",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ind4jz/fidelity_fucked_me_on_nio_calls/",
        "created": 1599383888.0
    },
    {
        "author": "chameleon_7",
        "created_utc": 1601061604,
        "id": "izq06p",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "Anyone here uses Fidelity? Turns out I cannot open a spread position unless I have at least $10k in my account? Then what's the point of having spreads enabled?",
        "subreddit": "wallstreetbets",
        "title": "Spreads with Fidelity?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/izq06p/spreads_with_fidelity/",
        "created": 1601090404.0
    },
    {
        "author": "ThemChecks",
        "created_utc": 1601166322,
        "id": "j0h6km",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": " From ETF.COM\n\nFidelity filed to launch a nontransparent ETF version of its most famous mutual fund. The [**Fidelity Magellan ETF**](https://www.sec.gov/Archives/edgar/data/945908/000137949120004667/filing712.htm#id_633624568), like its big brother the [Fidelity Magellan Fund (FMAGX)](https://fundresearch.fidelity.com/mutual-funds/summary/316184100?type=sq-NavBar), is a sort of go-anywhere equity fund that can invest in both growth and value stocks from domestic and foreign markets.\n\nTwenty years ago, the Magellan Fund was the largest fund in the world with more than $100 billion in assets, with the Vanguard 500 mutual fund nipping at its heels (it later surpassed Magellan). Today, FMAGX has roughly $22 billion in assets with an expense ratio of 0.77%.  \n\nIt’s been around since 1963, but it was under fund manager Peter Lynch, the Magellan Fund’s manager from 1977 to 1990, that it became the best-performing mutual fund in the world. And Lynch became one of the most famous investors in the world.\n\n\\_\\_\n\n&amp;#x200B;\n\nAnyone interested?",
        "subreddit": "investing",
        "title": "\"Fidelity Repackaging Magellan As ETF\"",
        "url": "https://www.reddit.com/r/investing/comments/j0h6km/fidelity_repackaging_magellan_as_etf/",
        "created": 1601195122.0
    },
    {
        "author": "champybaby",
        "created_utc": 1601499608,
        "id": "j2um88",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "Wall Street likes to snooze on tech companies they don't understand. Cloudflare ($NET) is one of them. \n\n**Here is what's not to like about the company:**   \nIt currently trades 25x its revenue.  In Q2, $NET  reported a quarterly revenue of $99m and a net profit of  -$25m (negative). The company's market cap is about $11b. Publicly traded rivals include Fastly and Zscaler, both of which are much larger and currently much more successful. \n\n**So what does Cloudfare do?**   \nGenerally speaking, NET makes websites really fast and really secure. Backers of this company include  Google and Microsoft. Both of these companies also use its services. \n\nI'm sure most of you have heard about DDoS attacks. Well, Cloudflare is really busy trying to stop them: It said earlier this year that it blocks 72b DDoS attacks *each day.* It also provides what's called a \"content distribution network,\" or CDN. CDN's help negate websites from bottle necking. CDNs can also improve the overall user experience by making everything faster. \n\nThe company provides both free and paid services. It also has a \"pay as you go\" model, but that's there mostly to convert them into its SaaS offering, where it captures 95% of its revenue. The free service mostly exists because it fuels the company's product, \"Network Flywheel;\" the more people who use Cloudflare, the more effective its services are. They do a lot of other things, and pretty much own the whole stack, but for those who want to explore further, and get more specifics, [I suggest reading this.](https://blog.cloudflare.com/why-we-raised-110m-from-fidelity-google-microsoft-baidu-and-qualcomm/) \n\n**So what's its current state?**   \nThe company currently provides services to 25m websites — a number that will continue to grow as many businesses are forced to go through so-called \"digital transformations\" as a result of the Covid-19 pandemic. \n\n**In the company's most recent earnings, Matthew Prince, CEO, said:** \"*We had a very strong quarter. Our Q2 revenue came in just shy of $100  million, up 48% year-over-year. We saw strength from our customers of  all sizes. We grew our large customer accounts, those paying us more  than $100,000 annually by 65% year-over-year. We also added nearly 7,000  new paying customers, bringing our total paying customer count to over  90,000. At the same time, we saw strong growth across our existing  customer base as they adopted more features of the Cloudflare platform.\"*\n\nPrince added that the effects of the pandemic have served as a boon to its business. And the company raised both its Q3 and annual guidance (though it's known to lowball its guidance). In 2019, $NET grew at a rate of about 50% each quarter. \n\nThey have been busy hiring new employees to meet demand; an unscientific check on LinkedIn reveals it currently has 257 openings. It also has a $50 price target from a lot of analysts. \n\n**What's next:**   \nAs we head into winter, more businesses will look to sell their goods, service, online as people bunker in to avoid catching the coronavirus. This change in consumer behavior will further accelerate its business. It's something I think Wall Street is snoozing on, especially with headlines that suggest you're twice as likely to die from COVID if you have the flu. \n\nAlso, unlike rivals such as Zscalar, Cloudflare is *significantly* easier to use for small to medium sized businesses (these aren't your mom and pop stores on Main Street; think businesses that generate $10m+ in revenue). \n\nImportantly, many people have experienced Spotify, Shopify, Reddit, Discord, Amazon, etc going down. And the headlines often suggest that it was a result of an outage or something by Cloudflare. [This recent headline from TechCrunch](https://techcrunch.com/2020/07/17/cloudflare-dns-goes-down-taking-a-large-piece-of-the-internet-with-it/), for instance, reads: \"*Cloudflare DNS goes down, taking a large piece of the internet with it\"*\n\nBut think about it ... so much of the internet relies on Cloudflare that when it experiences an issue, much of the internet is shut down as a result. That's pretty insane. \n\n**TLDR:** Buy Cloudflare.",
        "subreddit": "wallstreetbets",
        "title": "Here's why you should buy Cloudflare",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j2um88/heres_why_you_should_buy_cloudflare/",
        "created": 1601528408.0
    },
    {
        "author": "redditnaked",
        "created_utc": 1599185277,
        "id": "im7a6a",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "Hi /r/investing, \n\nI am pretty inexperienced when it comes to investing and I am here looking for some advice and help.\n\nI was wondering if there was a way to protect my major investments/positions, in say the S&amp;P 500, from major market declines by using a stop loss order. \n\nThe idea I have is to set a stop loss order through my brokerage company (Fidelity in this case) and configure this stop loss order to immediately sell all my shares of the S&amp;P 500 if the S&amp;P drops more than, say, 8% in a single day. Looking at the list of largest daily S&amp;P 500 changes 8% seems reasonable to me.\n\nDoes anyone else have something like this currently employed?",
        "subreddit": "investing",
        "title": "Is it possible to protect investments from sharp drops with a stop loss order?",
        "url": "https://www.reddit.com/r/investing/comments/im7a6a/is_it_possible_to_protect_investments_from_sharp/",
        "created": 1599214077.0
    },
    {
        "author": "stockmaster6969",
        "created_utc": 1599789648,
        "id": "iqhha9",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "Psthu warrants are showing up on fidelity excited for tommoroow !!",
        "subreddit": "SPACs",
        "title": "Don’t forget ur warrants tommorow!",
        "url": "https://www.reddit.com/r/SPACs/comments/iqhha9/dont_forget_ur_warrants_tommorow/",
        "created": 1599818448.0
    },
    {
        "author": "majorchamp",
        "created_utc": 1599346522,
        "id": "inavyq",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "As someone who is a novice in investing and has typically followed a \"set and forget\" mentality, is there a harm in doing this, especially in an IRA account where you want to diversify a bit more but not actively adding additional money into? \n\nI recently freed up about $3k (from profit) across a few index funds in my IRA (according to fidelity those funds are still at a 15-20% gain since inception) so that I could spread that across a couple ETFs. \n\nFine? Dumb? No biggie just keep those actions minimal? \n\nThanks",
        "subreddit": "stocks",
        "title": "Is there harm in taking a trim of profits (15%) off a mutual fund or index fund after a year of seeing 20-30% growth?",
        "url": "https://www.reddit.com/r/stocks/comments/inavyq/is_there_harm_in_taking_a_trim_of_profits_15_off/",
        "created": 1599375322.0
    },
    {
        "author": "Rover54321",
        "created_utc": 1599357645,
        "id": "indqwm",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Hi,\n\nApologies in advance for the newbie question:\n\nI bought $12k worth of FIPFX (a Mutual Fund) a few months ago, and it's currently worth $13k.\n\n(i) If I now want to sell all of that and buy QQQ (an ETF) with the proceeds, will I have to pay short term capital gains tax (on that $1k gain)?\n\nand (ii) if the answer is yes, will my brokerage (Fidelity) simply mail me a form at the end of the year in time for my tax filing, or do I have to independently calculate and report that?\n\nThanks in advance",
        "subreddit": "investing",
        "title": "Dummy question on Capital Gains tax",
        "url": "https://www.reddit.com/r/investing/comments/indqwm/dummy_question_on_capital_gains_tax/",
        "created": 1599386445.0
    },
    {
        "author": "Starbuckwhatdoyahear",
        "created_utc": 1599791835,
        "id": "iqi38p",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Does anyone trade in extended hours with Fidelity? I guess you have to call them to enable your ability to do that? What does the call entail? Do you have to qualify somehow? Is extended hours trading really much more volatile?",
        "subreddit": "stocks",
        "title": "Fidelity extended hours",
        "url": "https://www.reddit.com/r/stocks/comments/iqi38p/fidelity_extended_hours/",
        "created": 1599820635.0
    },
    {
        "author": "rajkumar81",
        "created_utc": 1599440850,
        "id": "inxzxu",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Friends\nI bought 100 units of PSTH/U in fidelity brokerage account. Can anyone help me understand\n1. How does warrants come into picture here and how many warrants I get (if any I get )\n2. Does this means I will still own 100 units of common shares of PSTH ?\n\nIntend is trying to understand Warrants",
        "subreddit": "SPACs",
        "title": "Warrants question on PSTH.U",
        "url": "https://www.reddit.com/r/SPACs/comments/inxzxu/warrants_question_on_psthu/",
        "created": 1599469650.0
    },
    {
        "author": "essentially_everyone",
        "created_utc": 1601474507,
        "id": "j2mo6g",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": " Found this [article](https://bankeronwheels.com/covid-19-investing-in-bear-market-crash-bottom/) and found it really helpful. Not saying that we're in a bear market, but these are principles we (new investors) should keep in mind all the time. Also it is not my article, all credit to [bankeronwheels.com](https://bankeronwheels.com/)\n\n1. Invest in Stocks gradually on the way down\n\nWhen and how to invest in stocks? If you have directly or indirectly prepared for a period of financial stress and have available cash you may consider starting investing when there is a market crash. A good strategy is to build rules and stick to them — either based on **certain index levels, for example** S&amp;P 500 at 2700 invest 20% of savings, 2500 another 20% etc. or **based on timing** (slicing every few weeks since we have no clarity which way the market may go and when it will bottom out)\n\n2. Do not chase an upward trend in a bear market\n\nOne of the **common mistakes** we see is **people chasing upward trends** because of **FOMO — Fear of Missing Out** (when stock market recovers after a big crash for a few days giving hope of long term gains). It takes more courage to buy according to predefined rules which often means buying when everything is gloomy and stocks lose massively. Buy on days when stocks are massively sold not bought. In the long term it pays off. Do not be tempted by rebounds that may prove short-lived.\n\n3. Do not try to time the market\n\nEven the best investors struggle with market timing. In fact most hedge funds (even the most prestigious ones) made substantial losses in March\n\nThe market can turn rapidly both ways and while you may avoid some bad days **avoiding just a few good days can be extremely detrimental to your long term performance** as illustrated by a study done by Fidelity.\n\nAlso, it is extremely **risky to use leverage since additional debt implies you must be correct on timing**\n\n4. Invest, do not speculate\n\nYou may not get spectacular 300–400% returns overnight but your money will be relatively safe if you base your decisions on sound financial statements and diversify. **ETFs** (including [**Bond ETFs**](https://bankeronwheels.com/best-etfs-in-2020/)) **are a great way to invest in indices without taking idiosyncratic risk** (e.g. L\\*\\*\\*\\* Coffee dropped 80% in one day in March on uncovered fraud — as Warren Buffett says “Only when the tide goes out to do you discover who’s been swimming naked”).\n\n**Ask yourself the question — am I more qualified than a professional investor** to predict which industry player may outperform the rest of the market? Do I know how the landscape post-crisis will look like? Even if you suspect knowing first-order effects are you sure of the second and higher-order effect (to Nicholas Taleb’s point).\n\n5. Avoid binary outcomes\n\nHow to invest in stocks to avoid drawdowns? Each crisis has its own most **vulnerable industries where outcomes can be binary** — in 2008 some Banks went out of business and as an investor, you may have lost everything. The Coronavirus crisis has other prime candidates for such outcomes, **airlines** can be nationalized and **hotel**/**tourism** industry players can go bankrupt should the distress last longer. You want to avoid these investments until there is more clarity on consumer confidence.\n\nSince these recover now you may think it was wise to invest at some point but the key is that you can’t base the **rightness of a decision bed on an outcome but on a probability it would occur**. And in March chances were high there would be lots of Airline Lehman Brothers (in fact, a lot materialized — LatAm, Virgin Australia, etc)\n\nSolution for how to invest in stocks avoiding binary outcomes: Choose Index Funds!\n\n6. Look for financially resilient firms\n\nIf you do invest in single names, do not believe blindly in potentially meaningless dividend yields based on past data unless it has been confirmed by the management after incorporating all the outlook related to Covid-19. Instead, look at **balance sheets with low debt and build-in resilience (cash)**. These firms may outperform and even acquire weaker competitors in the current environment. Be cautious though, you can’t predict the impact of post-Corona market on Business Models.\n\n7. Keep Some Cash\n\nRay Dalio now infamously said a few months ago that ‘Cash is Trash’. While he is one of the best thinkers in Finance the remark was badly timed. Even in the most conservative scenarios keep some reserves. This is primarily a health crisis and while an economic crisis unfolds having a safety net is paramount. **Additional unforeseen** **tail risks always exist (think Oil Price crash or Trade War on top of Coronavirus etc.)**\n\n8. Diversify in other assets including currencies, commodities and high quality debt products\n\nIt is difficult to predict which countries may relatively outperform. **Keep your portfolio diversified** geographically (e.g. Asia, Europe, US) and product-wise potentially including commodities like Gold that may outperform in low real rates / high inflation environments. Consider very high-quality debt products ([**Treasuries or Investment Grade Debt Bond** ](https://bankeronwheels.com/best-etfs-in-2020/)[**ETFs**](https://bankeronwheels.com/best-etfs-in-2020/)). [**Here** ](https://bankeronwheels.com/bond-etf-gold-etf-comparison/)is a good guide on how to protect your Stocks Portfolio.\n\n9. Stay informed but remain cautious\n\nKnowing how to invest in stocks is also about adjusting your strategies as there is more clarity about the outlook. But be very careful with financial experts and consensus — **when you see opinions converging usually something else will happen**\n\n10. Duration of the coronavirus pandemic is key\n\nThe risks are still skewed to the downside (it can take [**significant time**](https://www.cdc.gov/flu/pandemic-resources/basics/past-pandemics.html)). While there is a discount to peak market values and positive catalysts may materialize (most pharmas are working on Coronavirus vaccines and mitigating drugs) the time it takes and the change of behavior will alter the markets significantly.\n\n**The impact on people’s health even when cured and society at large is at this stage still uncertain. Stay safe and healthy!**",
        "subreddit": "stocks",
        "title": "How to invest in a bear market (helpful article)",
        "url": "https://www.reddit.com/r/stocks/comments/j2mo6g/how_to_invest_in_a_bear_market_helpful_article/",
        "created": 1601503307.0
    },
    {
        "author": "Godkingcoconut",
        "created_utc": 1601263793,
        "id": "j14qty",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Okay so for Index Funds we all know the SPY.  Some of us bet it some of us just long term invest in a Vanguard/IShare/Fidelity S&amp;P Index.\n\nWe have the QQQ for those of us that know that tech is the future and strangely now the gold currency of the market in tough times.\n\nWe have the GLD and SLV for Gold and Silver when those are nice and low in safe times to buy in or play runs when turbulent.\n\nWhat other Index Funds are must knows and why?\n\nAnd any of you prefer or play the VTSAX versus the standard S&amp;P Index Funds and if so why?  I have always been curious on the selling feature of this one.\n\nAnyway I look forward to hearing more from people more knowledgeable than myself about the different plays in this realm and how you approach it all.",
        "subreddit": "StockMarket",
        "title": "The DD on Index Funds..",
        "url": "https://www.reddit.com/r/StockMarket/comments/j14qty/the_dd_on_index_funds/",
        "created": 1601292593.0
    },
    {
        "author": "kenrod7",
        "created_utc": 1599764987,
        "id": "iq9zm4",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "pennystocks",
        "title": "What broker can I use to trade under $0.01? With the lowest fees of course. E*TRADE, Fidelity, TD? Ally won’t allow it",
        "url": "https://i.redd.it/kcw7d3x4ddm51.jpg",
        "created": 1599793787.0
    },
    {
        "author": "F-22Raptor_2020",
        "created_utc": 1599614638,
        "id": "ip6jir",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Hi. I’m new to this whole stock market world and have been using Fidelity brokerage account for about 3 weeks. Can I buy stocks and then sell it  on the same day or right away? Sort of confused about the restrictions regarding this.",
        "subreddit": "pennystocks",
        "title": "Buying and then selling stocks same day on Fidelity?",
        "url": "https://www.reddit.com/r/pennystocks/comments/ip6jir/buying_and_then_selling_stocks_same_day_on/",
        "created": 1599643438.0
    },
    {
        "author": "F-22Raptor_2020",
        "created_utc": 1599614547,
        "id": "ip6ik2",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Hi. I’m new to this whole stock market world and have been using Fidelity brokerage account for about 3 weeks. Can I buy stocks and then sell it  on the same day or right away? Sort of confused about the restrictions regarding this.",
        "subreddit": "stocks",
        "title": "Buying and then selling stocks same day on Fidelity?",
        "url": "https://www.reddit.com/r/stocks/comments/ip6ik2/buying_and_then_selling_stocks_same_day_on/",
        "created": 1599643347.0
    },
    {
        "author": "kolachesmuggler",
        "created_utc": 1599537656,
        "id": "iomr58",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "This may be a dumb question but what would be the best broker to go with if I were an absolute bare bones beginner. Ameritrade? Fidelity? Scwhab? I just want to start off small and basically just see where it goes.",
        "subreddit": "StockMarket",
        "title": "This may be a dumb question....",
        "url": "https://www.reddit.com/r/StockMarket/comments/iomr58/this_may_be_a_dumb_question/",
        "created": 1599566456.0
    },
    {
        "author": "oannes",
        "created_utc": 1599229296,
        "id": "imgt7i",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": " I have a brokerage account with Fidelity and began to question how exactly the price fluctuates. I understand it is based on supply and demand, and also understand that if a stock is sold at price X then that is the new stock value, but how does my broker decide what to sell my stock for? If I enact a Market order to sell my stock, how much under the current price does Fidelity go to sell the stock? Conversely, if I put in a buy order, how do they decide how much to buy it for? I assume its all automatic under some computer software, but I would like to understand how that decision is made.\n\nAnother question I’ve been pondering on, during a company's IPO, do they sell all their shares for a set price and then the price fluctuates? Or does price fluctuate after the first share is bought?",
        "subreddit": "stocks",
        "title": "At What price does my trading platform sell my stock?",
        "url": "https://www.reddit.com/r/stocks/comments/imgt7i/at_what_price_does_my_trading_platform_sell_my/",
        "created": 1599258096.0
    },
    {
        "author": "lunlope",
        "created_utc": 1599428989,
        "id": "inurad",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "“I am still beginner with this whole stock market. So please be gentle.”\n\nI have always wondered about people recommending a strategy of buying stocks for small goals like gathering money for down payment for home or college funds for kids. \n\nMaybe i am misunderstanding this whole thing, but i thought whenever there is a withdrawal with IRA accounts(fidelity) there will be heavy penalties to do so.\n\nI know there are apps for ETF trading without the panelty like Stash, but is it really safe to withdraw the money when my goals are met?",
        "subreddit": "stocks",
        "title": "Avoid paying penalty of withdrawing the money for short term goals? Like preping downpayment for home or college funds?",
        "url": "https://www.reddit.com/r/stocks/comments/inurad/avoid_paying_penalty_of_withdrawing_the_money_for/",
        "created": 1599457789.0
    },
    {
        "author": "oleosmirf",
        "created_utc": 1601037028,
        "id": "izik32",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "I was wondering whether there is an accepted formula for determining cost basis when purchasing units. \n\nIs there any guidance either in the prospectus or otherwise to determine what the initial price of the warrants and shares are after being split.\n\nFor example, here are some recent splits, again all purchased at par value of 10 per unit:\n\nI bought 2000 units of PTAC which comes with one full warrant. I was assigned a cost basis of $9.65 per share and $0.35 per warrant. \n\nI bought 600 units of ETAC which comes with 1/3 of one warrant. I was assigned a cost basis of $9.58 per share and $1.24 per warrant.\n\nI bought 300 units of ERES which comes with 1/2 of one warrant. I was assigned a cost basis of $9.64 per share and $0.72 per warrant. \n\nSo again, does anyone know what determines the share and warrant basis as there doesn’t seem to be a rhyme or reason.\n\nIm also curious if anyone has different numbers from a different brokerage. I use fidelity.",
        "subreddit": "SPACs",
        "title": "Cost Basis for Units Purchased at Par Value",
        "url": "https://www.reddit.com/r/SPACs/comments/izik32/cost_basis_for_units_purchased_at_par_value/",
        "created": 1601065828.0
    },
    {
        "author": "yukinara",
        "created_utc": 1599590441,
        "id": "iozczh",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "\n\nI started investing on June 2016. Back then I didn't know anything about investment in general. I just thought that as long as I buy stocks, they will continue to increase in value over time. I was pretty wrong. \n\nBack then I put in $1000 to try my luck, and over a couple months my account value increased to about $1500. I was stoke. I thought I got it and this game is just too easy to win. I withdrew all that to play with JNUG. I made another $1000. My head was over the moon because back then it was a pretty big deal, being in college and not making money.\n\nThen what happened? I lost it all to 3x leveraged ETFs and down $3000. The loss destroyed me. I thought I was never going to recover. And the funny thing is that, the whole time I was busy playing around with 3x ETF, I saw the single share of AMD steadily climbing (I bought it for shit and giggle because I thought AMD never gonna make it big). Looking back, had I just dump everything in AMD, I would be in a much better shape.\n\nSo I left whatever in my account as cash and didn't look back until August 2018, what was why my account flatted line for almost 2 years.\n\nIn August 2018 I tried my luck with investing again. This time I didn't waste time gambling, but rather doing some real investing. I selected reputable companies and famous brands. Then Sep 2018 hit and you already know what happened. The stock market tanked pretty hard until Dec 24th, 2018, which I called Bloody Christmas. Imagine waking up everyday to see my account in red, like my hard earned money evaporating into the air. \n\nExcept this time I did something different. I wasn't as hasty to sell off. I rebalanced my portfolio a bit and keep investing. Back then I had a decent job which can cover living cost and left me with a bit of saving for investment. I didn't sell everything and close my account. I left everything in there and see how it would work out because I do believe it will recover. And it did in 2019. In fact I've read that many investors regretted that they didn't invest heavier during 2019 due to fear of another recession. \n\nI recovered everything I've lost and made some extra profit just simply from buying and holding\n\nThen 2020 hit. I saw my accounts tanking just like before and this time I wasn't wavered. I continue to put in my paycheck every 2 weeks.\n\nMy account quickly recovered and steadily climbing until now.\n\n\n\nI made a screenshot so you guys can see my current standing. This is just RH, I also have an account with Fidelity, IRA with Charles Schwab, 401k, and HSA. But RH still hold most of my money, neatly 1/2 of my portfolio.\n\n\nhttps://imgur.com/a/JzwVbwG\n\nLet's make 1 thing clear\n\nI'm NOT a stock genius. I'm not considered myself to be a student of Warren Buffet. I did zero fundamental/technical analysis. I just though very simply: hey, these companies are financially strong, they have products that make money, their names are familiar, and they continue to innovate, so...why not?\n\nI'm just lucky I guess.\n\nMy biggest positions are in AMD, NVDA, AAPL, MSFT. I've used all of their products and am also a computer enthusiast. \n\n\nThe rest are ETFs like QQQ, VTI, XLK, FTEC.\n\nI do have some positions in cloud computing but they aren't big.\n\nThe past few days have been hard but whatever. I know it will recover just like before. Tomorrow is pay day and I will continue to put more money into my portfolio. Over all my account is still positive. I mean, 55% increase in past year and 44% over all is good, right? I have no complain. This correction is just another day for me to buy cheap stocks that's all.",
        "subreddit": "stocks",
        "title": "My account progression in the past 4 years of investing",
        "url": "https://www.reddit.com/r/stocks/comments/iozczh/my_account_progression_in_the_past_4_years_of/",
        "created": 1599619241.0
    },
    {
        "author": "CaptiveCervid",
        "created_utc": 1600925079,
        "id": "iyr6d4",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "I know that standard IPOs are difficult for retail investors to get, even if their broker has shares. Is it the same story with SPACS? Or is it even harder?\n\nI have a ToS and Fidelity accounts and have been wishing I could get a jump on some of the spacs coming out with good management teams.",
        "subreddit": "SPACs",
        "title": "Anybody have luck ordering spac IPOs through their broker?",
        "url": "https://www.reddit.com/r/SPACs/comments/iyr6d4/anybody_have_luck_ordering_spac_ipos_through/",
        "created": 1600953879.0
    },
    {
        "author": "drchaz",
        "created_utc": 1598985842,
        "id": "ikq65a",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "I have only bought options before; never sold.  So I'm a little confused about how this will go down.  My brokerage is Fidelity.\n\nI have 100 shares of MSFT that I have been hoping to sell at $229.  The price keeps getting close to my target but it never gets there so my order never executes.  So as an experiment, I decided I'd try selling a covered call for $230 instead of waiting for my order to execute.  That way I can earn a little premium while I wait.  So I sold a -MSFT201009C230 contract for $9.75.  All seems good.\n\nHowever, I'm confused by how this is going to go when the option is eventually exercised (I am hoping it will be exercised because I want to exit the position).  Fidelity does not seem to show anything \"linking\" the CC to my long shares, so I am assuming that it won't automatically liquidate the shares for me and that I'll have to do it manually? Is that correct?\n\nIt seems like I have a bunch of sales it might be hard to keep track of which shares are being used for covered calls and which are my LTBH positions.  Is there any way to set it up to auto-liquidate the 100 shares so that I can keep track automatically?\n\nAutomatic selling would also ensure that if the price drops while I'm not watching, it can be sold at the strike price rather than whatever the price is once I get to a place where I can set-up the trade.  Or should I just put in a limit order to sell it at the strike price right now?  Will that mess anything up?\n\nTIA!",
        "subreddit": "options",
        "title": "Long time buyer, first time seller -- Can I set-up my long position to auto-sell when my CC is exercised?",
        "url": "https://www.reddit.com/r/options/comments/ikq65a/long_time_buyer_first_time_seller_can_i_setup_my/",
        "created": 1599014642.0
    },
    {
        "author": "kunst91",
        "created_utc": 1601240944,
        "id": "j0yxi0",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "I currently have my assets split between a Roth IRA and SEP IRA, but I'd also like to have a brokerage account as a place to park some of my money and let it grow but be able to access it without incurring the IRA penalties. I'd ideally like to use a single ETF to simplify things and avoid capital gains from frequent trading. First question would be if a total world market fund vs. a total U.S. market fund would make sense here. I use Fidelity and have loved the iShares ETF's, so the two that come to mind are the URTH and ITOT, but I know that people love the Vanguard ETF's as well. ITOT and VTI are very similar with respect to returns and expense ratio, but URTH and VT differ quite a bit.",
        "subreddit": "investing",
        "title": "URTH vs. VT/ITOT vs. VTI for Taxable Brokerage Account",
        "url": "https://www.reddit.com/r/investing/comments/j0yxi0/urth_vs_vtitot_vs_vti_for_taxable_brokerage/",
        "created": 1601269744.0
    },
    {
        "author": "KevinWithaCapitalK",
        "created_utc": 1599997778,
        "id": "irwvt9",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "Can’t link bank account to my Roth IRA in Fidelity",
        "url": "https://www.reddit.com/r/investing/comments/irwvt9/cant_link_bank_account_to_my_roth_ira_in_fidelity/",
        "created": 1600026578.0
    },
    {
        "author": "chess415",
        "created_utc": 1599079888,
        "id": "ilfccr",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "investing_discussion",
        "title": "What is the process to open a brokerage account for stocks for $1,000,000? Should it be done online or in person (TD Ameritrade, Fidelity, Charles Schwab, Etrade). Is $1,000,000 enough of an amount that preferably it should be done in person over online?",
        "url": "https://www.reddit.com/r/investing_discussion/comments/ilfccr/what_is_the_process_to_open_a_brokerage_account/",
        "created": 1599108688.0
    },
    {
        "author": "jonvaughn",
        "created_utc": 1601027823,
        "id": "izgr7w",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "I've been putting the pieces together, looking for an earnings release mid-to-late October, and this one has the potential to be outstanding...\n\nOn July 13th, CBD of Denver announced their largest transaction in company history, a test pilot program, where a customer bought 500kgs (little more than a half ton) of CBD flower. $363,000 in revenue. QUOTE: \"If the purchaser is satisfied with the product, they have agreed to purchase an additional 1,000 kgs per week for an initial 3-month trial period.\"\nSource: https://www.nasdaq.com/press-release/cbd-of-denver-inc.-cbdd-announces-the-largest-transaction-in-company-history-2020-07\n\n45 DAYS INTO 3rd QUARTER - CBDD announces they've reached $1.4m in revenue.\nSource: https://www.otcmarkets.com/stock/CBDD/news/CBD-OF-DENVER-INC-CBDD-Reports-Revenue-for-First-45-Days-of-Q3?id=271817\n\nTHEN SEPTEMBER 21st PRESS RELEASE: (almost exactly three months later from the July 13th PR)\n\n\"CBDD has agreed to a working relationship with a Denver based company to supply up to two tons of hemp per month to CBDD's Rockflowr subsidiary. Marcel Gamma explains \"We are very excited about our new relationship, giving us much-needed product to fill outstanding orders...\"\nSource: https://www.prnewswire.com/news-releases/cbd-of-denver-inc-cbdd-announces-relationship-sourcing-hemp-for-swiss-subsidiary-301134390.html\n\nThe PPS is at .0011 (seems to have solid support here) as of 9/25/2020, a market cap of $4.3m, with 4.3B O/S. The biggest hurdle with $CBDD is the O/S. It's a big mountain to move, but I've seen runners do it. On a conservative side, $15m market cap would put us at .0035 but I think $30m isn't out of the realm of possibilities. .0035-.007, and if you consider CBDD's warpath of acquisitions, agreements, grow, and retail, we could definitely reach pennyland next year.\n\nAlso, CBDD is traded on the OTC Market as a Pink Sheet. You cannot get it on RH, from what I understand. I use Fidelity for trading OTC.",
        "subreddit": "pennystocks",
        "title": "$CBDD - Connect the dots, la la la la!",
        "url": "https://www.reddit.com/r/pennystocks/comments/izgr7w/cbdd_connect_the_dots_la_la_la_la/",
        "created": 1601056623.0
    },
    {
        "author": "Igettheshow89",
        "created_utc": 1599014115,
        "id": "ikyh9z",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Ant group definitely seems like a company ARKF would get involved with. Is there anyway to know beforehand or before the ant group ipo if ARKF intends to pick them up?\n\nSince ANT Group is going public only in China, I won’t be able buy shares on fidelity I don’t think. If there is a different fund, outside of ARKF, that might pick them up, please let me know.",
        "subreddit": "stocks",
        "title": "Will ARKF pick up ANT Group at IPO?",
        "url": "https://www.reddit.com/r/stocks/comments/ikyh9z/will_arkf_pick_up_ant_group_at_ipo/",
        "created": 1599042915.0
    },
    {
        "author": "Aircolored",
        "created_utc": 1599583411,
        "id": "iox2bd",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "I’m trying to buy a stock worth $0.06 but Fidelity doesn’t allow it and Robinhood doesn’t list it. Which app do you know would allow me to buy super cheap stocks?",
        "subreddit": "pennystocks",
        "title": "Which app allows you to trade cheat stocks?",
        "url": "https://www.reddit.com/r/pennystocks/comments/iox2bd/which_app_allows_you_to_trade_cheat_stocks/",
        "created": 1599612211.0
    },
    {
        "author": "Mitesite",
        "created_utc": 1599286392,
        "id": "imw7n6",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Most of the large brokers don't offer trading during all extended hours. I've only come across two brokers that do offer it, but I find it hard to believe that no other brokers do, especially the big ones like TD and Fidelity.\n\nWhich brokers offer full extended trading hours (4:00–9:30 a.m. and 4:00-8:00 p.m. ET), and which one of them is the best overall?",
        "subreddit": "stocks",
        "title": "Which brokers offer full extended trading hours?",
        "url": "https://www.reddit.com/r/stocks/comments/imw7n6/which_brokers_offer_full_extended_trading_hours/",
        "created": 1599315192.0
    },
    {
        "author": "EroticVelour",
        "created_utc": 1601471632,
        "id": "j2lv5h",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "I'm trying a new strategy on my SPAC holdings this time around and I'm wondering if anyone else can share their experience.  Specifically, I am looking to set limit sell orders on my SHLL.  In anyone else's experience will these limit orders still execute during the changeover (assuming the limit price is reached) even if the ticker change in the particular broker hasn't completed?  (This time I have Fidelity and Etrade, but please post any experience you've had with other brokers too).",
        "subreddit": "SPACs",
        "title": "Limit Order executions during ticker changeover?",
        "url": "https://www.reddit.com/r/SPACs/comments/j2lv5h/limit_order_executions_during_ticker_changeover/",
        "created": 1601500432.0
    },
    {
        "author": "gorkiam",
        "created_utc": 1599663950,
        "id": "iphm10",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "While trying to execute order for EWJV ETF ( Japan value), I got a warning Fidelity cannot accept this **market** order for illiquid asset. But Vanguard executed it fine as market order. Any thoughts why EWJV etf is illiquid or what's the difference between this ETF compared to others?",
        "subreddit": "investing",
        "title": "EWJV - How is this ETF different compared to others?",
        "url": "https://www.reddit.com/r/investing/comments/iphm10/ewjv_how_is_this_etf_different_compared_to_others/",
        "created": 1599692750.0
    },
    {
        "author": "Schwarles-Cobb",
        "created_utc": 1600264062,
        "id": "itvumf",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "I had a blast with you morons. Will continue to have a blast with you morons. But not on RH, I’m a big boy now, a responsible big boy. \n\nIt’s time I move onto fidelity. A real big boys brokerage. RH is great (haha funni joke) but just between us autists I really don’t like losing money. I KNOW SHOCKER, right?\n\nWhy did this post come to fruition? Well you see I don’t know. In other words...\n\nArrivederci you fucking troglodytes. I’ll see your sweet bodies when I’ve unlocked level 3 trading on fidelity. That way I can lose even more money on a big boy platform. \n\nI love men. Like really really really love men.\n\nIn addition I’ve got freak nasty stuck in my head...\n“I put my hands upon your hips when I dip, you dip, we dip”.\n\nTL;DR: nothing worth your time.\n\nPositions: SNOW - 10 shares / day trade at any price I don’t give a film flam.",
        "subreddit": "wallstreetbets",
        "title": "Hurr durr the which is dead.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/itvumf/hurr_durr_the_which_is_dead/",
        "created": 1600292862.0
    },
    {
        "author": "UneergroundNews",
        "created_utc": 1599199125,
        "id": "imakq2",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "The charts were green, the tendies were warm,\nI went to sleep, and woke up to a storm. \n\n57% loss, the gay bears were back at it, red dildos fucking every bull faggit. \n\nCan’t save my  tendies due to high traffic, how does an autist deal with something so tragic?\n\nUp from the basement I ascend, to ask for some tendies from my wife’s boyfriend. \n\nHis name is chad, not as autistic as I, he showed me his puts with percents to the sky. \n\n“Get a real broker like fidelity or WeBull”, but no matter the broker I’m still stuck in the shit hole. \n\nChad have me some nickels and quarters and dimes, fore why should I pay when my portfolio dies? \n\nDown on my luck I cash out my “assets”, and quickly stumble into WallStreetBets. \n\nThe boys on reddit always know what to do, because autists are autists and autists are you 😎",
        "subreddit": "wallstreetbets",
        "title": "I don’t know how I always end up here",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/imakq2/i_dont_know_how_i_always_end_up_here/",
        "created": 1599227925.0
    },
    {
        "author": "hmachine0",
        "created_utc": 1599780924,
        "id": "iqf298",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "I'm at work right no so I don't have time to call, but I was wondering if I was going to have any issues doing a rollover if I don't know the amount of the initial investment. My grandparents (passed) started an IRA many years ago for me, since then it has been transferred to multiple financial companies that keep shutting down. The current financial company says they do not know and have no way to tell. Is that going to be an issue for Fidelity? What do I do?",
        "subreddit": "investing",
        "title": "IRA Rollover to Fidelity",
        "url": "https://www.reddit.com/r/investing/comments/iqf298/ira_rollover_to_fidelity/",
        "created": 1599809724.0
    },
    {
        "author": "jakpayne89",
        "created_utc": 1599218850,
        "id": "ime7qd",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Anyone else’s Fidelity not allowing trades?",
        "subreddit": "pennystocks",
        "title": "Fidelity Down?",
        "url": "https://www.reddit.com/r/pennystocks/comments/ime7qd/fidelity_down/",
        "created": 1599247650.0
    },
    {
        "author": "abalonegal",
        "created_utc": 1599838388,
        "id": "iqsrjx",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "For starters, my apologies if I am misunderstanding something obvious. I'm new to investing. \n\nYesterday at 5:40 ET, I bought into three mutual funds for my Roth IRA account with Fidelity. 60% FXIAX, 30% FZILX and 10% FUAMX. I know that the order doesn't process instantly and is usually processed the following morning.  However, I'm looking at my account positions this morning and don't see any of the mutual funds listed. I see the sum of yesterday's contribution listed as SPAXX, which I understand is my core position.\n\nHave my mutual fund orders not settled? Again, sorry if this is obvious.",
        "subreddit": "investing",
        "title": "Mutual fund purchases not displayed in positions on Fidelity?",
        "url": "https://www.reddit.com/r/investing/comments/iqsrjx/mutual_fund_purchases_not_displayed_in_positions/",
        "created": 1599867188.0
    },
    {
        "author": "stonkalapokus",
        "created_utc": 1599408153,
        "id": "inoi4v",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "I’ve had a robinhood account for like 4 years now, and while it’s worked for my on and off trading throughout the years, I want to get more serious. Ive been doing some research and am kinda stuck between whether I wanna open an account with TD, Schwab, or Fidelity. Just wanted to see what some personal preferences are and why. Would really appreciate any insight",
        "subreddit": "investing",
        "title": "Which platform do you prefer?",
        "url": "https://www.reddit.com/r/investing/comments/inoi4v/which_platform_do_you_prefer/",
        "created": 1599436953.0
    },
    {
        "author": "aHuynh1994",
        "created_utc": 1599637775,
        "id": "ipbood",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "ARKK specifically but maybe their other ones as well. But I’m not quite sure which is the best platform to use for them. Any recommendations? Their website list a couple of things, in which I found fidelity since it has an app, but I read mix reviews about it. Any recommendations on how to invest in them? I currently use M1 Finance for my Tesla shares.",
        "subreddit": "investing",
        "title": "Trying to invest into Ark Invest",
        "url": "https://www.reddit.com/r/investing/comments/ipbood/trying_to_invest_into_ark_invest/",
        "created": 1599666575.0
    },
    {
        "author": "tiverma",
        "created_utc": 1600956028,
        "id": "iyxsbm",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Hello Friends,\n\nI previously had Vanguard but was forced to switch to Fidelity for work. I transferred some of my funds from VTSAX to FSKAX. I still hold some VTSAX in my Roth IRA. I'm interested in total stock market exposure and FSKAX looked like a good option. I'm probably not going to sell and switch funds right now, but for future contributions I want to make sure my funds go to the right place (2021 IRA Contribution). Like many of you, i'm cognizant of how much of an impact 1% a year can make over time, so I wanted to check in with you guys for some the best fidelity funds or any other advice? Thanks :)",
        "subreddit": "investing",
        "title": "Best Fidelity Funds",
        "url": "https://www.reddit.com/r/investing/comments/iyxsbm/best_fidelity_funds/",
        "created": 1600984828.0
    },
    {
        "author": "kursch75",
        "created_utc": 1599438612,
        "id": "inxfi2",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "TD Ameritrade charges 38$ per warrant exercise transaction. Does anybody know if fidelity is cheaper?",
        "subreddit": "SPACs",
        "title": "Exercise pricing",
        "url": "https://www.reddit.com/r/SPACs/comments/inxfi2/exercise_pricing/",
        "created": 1599467412.0
    },
    {
        "author": "SPACtotheMOON",
        "created_utc": 1599672449,
        "id": "ipkhdm",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "I am trying to buy FEAC Warrants on Fidelity. The ticket symbol FEAC/WS. I see the following error message: “(000940)Your order can not be processed at the current time. Please verify that you have entered the symbol correctly. Note that a symbol with a suffix, such as . N or .OB, is generally quotable but not tradable. You need to use the root symbol to place an order.”\n\nI was able to buy warrants for INSUW, DHPCW, etc. I see the ticker is causing the issue since it has ‘/WS’ instead of ‘W’. \n\nIs there a way to buy Warrants to but with ticket symbols /WS?",
        "subreddit": "SPACs",
        "title": "How to buy FEAC Warrants",
        "url": "https://www.reddit.com/r/SPACs/comments/ipkhdm/how_to_buy_feac_warrants/",
        "created": 1599701249.0
    },
    {
        "author": "sailmak",
        "created_utc": 1600371573,
        "id": "iuqqqd",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Hello,\n\nHow are the warrants priced after the pre-unit split?  \nCCIV will undergo a pre-unit split next week and I wanted to know whether the warrant price is pre-decided or is it based on some calculation\n\nI see most warrants start below $1 on the split day but looking at IPOB/Ws and IPOC/Ws they were priced around $2.5\n\nAlso, any expectation of the warrant prices for CCIV?  \n\n\np.s - opened a fidelity account this week for trading SPAC warrants and pre-units, started with SOAC units\n\nThanks!",
        "subreddit": "SPACs",
        "title": "After Pre Unit split - Warrant price question",
        "url": "https://www.reddit.com/r/SPACs/comments/iuqqqd/after_pre_unit_split_warrant_price_question/",
        "created": 1600400373.0
    },
    {
        "author": "Mcdouglas123",
        "created_utc": 1601132107,
        "id": "j07fj6",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "I finally dumped my ML financial advisor. I had over 5 million with him but he wasn’t performing well and my fees were 1 percent in internal fees plus the investments he chose had fees that were too high. i complained and he lowered my fees to .8% but still my investments had heavy fees. He claimed that the lowest he could go w ML fees was .7.  So why only lower mine to .8?  He also had me open up a ML edge account but only put 50k in for me to invest with absolutely no guidance from him he said once I get used to investing and learn how then he could move some more over. WTF. So I spoke with vanguard and fidelity and I decided to do self-directed at fidelity because there is an office nearby and they give you guidance and help with your portfolio 4x a year. If I want managed I will switch over to vanguard who will do it for .3 percent. Both guys I spoke with were such better options than the ML advisor who was a complete dick when I told him I am moving my accounts. I was such a fool. I explained to the ML advisor that the monthly fees (internal) that I pay ML are almost the same as my mortgage payment. I don’t have a high paying job and it does not make sense at my level of wealth to give them this money. He was so nasty about it. Question- who goes to these guys? I know I was a fool but when there is Vanguard, Fidelity and Schwab or evening Chase Private Client that is still way more reasonable then why do people give money to Merrill Lynch?",
        "subreddit": "investing",
        "title": "Foolishly kept investments with a Merrill Lynch advisor",
        "url": "https://www.reddit.com/r/investing/comments/j07fj6/foolishly_kept_investments_with_a_merrill_lynch/",
        "created": 1601160907.0
    },
    {
        "author": "AppropriateFile0",
        "created_utc": 1601393843,
        "id": "j21l8u",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Does anyone know why that is? I checked Pending Transfers and it says my stocks are \"pending transfer.\" I never asked to transfer any shares. I purchased my shares in cash before adding margin so why is it transferring somewhere? Sorry for the n00b question, I'm somewhat new.",
        "subreddit": "stocks",
        "title": "I added margin to my Fidelity account and now my stock prices/basis are \"pending\"",
        "url": "https://www.reddit.com/r/stocks/comments/j21l8u/i_added_margin_to_my_fidelity_account_and_now_my/",
        "created": 1601422643.0
    },
    {
        "author": "baphomelette",
        "created_utc": 1599685880,
        "id": "ippa50",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Unlike you fucking morons I'm not trying to gamble my life away, just using pocket change to at the casino. How are people getting insta approved for level 5 options while I have to wait a week for Fidelity to demand a bunch of paperwork just for fucking level 2? I don't even want to fuck with margin, wtf Fidelity you faggots.",
        "subreddit": "wallstreetbets",
        "title": "How is everyone getting approved for options and losing their entire life while I can't even get level 2",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ippa50/how_is_everyone_getting_approved_for_options_and/",
        "created": 1599714680.0
    },
    {
        "author": "redditobserver777",
        "created_utc": 1599609216,
        "id": "ip5387",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Anyone know if we have to call to ask for the split or if it will be done automatically. Bought units over a month ago",
        "subreddit": "SPACs",
        "title": "PTSH.U - Fidelity Warrant Common Split",
        "url": "https://www.reddit.com/r/SPACs/comments/ip5387/ptshu_fidelity_warrant_common_split/",
        "created": 1599638016.0
    },
    {
        "author": "Fun_Paleontologist_2",
        "created_utc": 1599959513,
        "id": "irowd5",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Does anyone have this information?\n\nE.g. for IBKR it states the deadline to exercise options is 4:40 EST or 3:40 CST.\n\nI can't find any information for other brokers - \n\nTD Ameritrade, Shwab, Fidelity, Questrade, RH?",
        "subreddit": "options",
        "title": "Looking for a list of Broker Deadlines for After hours options exercise",
        "url": "https://www.reddit.com/r/options/comments/irowd5/looking_for_a_list_of_broker_deadlines_for_after/",
        "created": 1599988313.0
    },
    {
        "author": "MontaMann",
        "created_utc": 1600432067,
        "id": "iv544o",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Let's say I buy a a slightly OTM option at 3:55 ET for $0.01 with a strike at $250 expiring today. The underlying stock price at 4:00 is $249.90, the option (theoretically) expires worthless. After hours, the stock jumps to $251. I execute a Cashless Exercise to Sell transaction (Fidelity) at 5pm (my understanding of the latest you can exercise).\n\nDo I make $99 profit? Am I required to have the cash to buy 100 shares of the underlying at the strike with the Cashless Exercise to Sell transaction? What's my risk besides the $0.01 premium I buy the contract for?\n\n\n\n\nFrom Fidelity:\n\nInitiate an Exercise-and-Sell Transaction (cashless)\n\nWith this transaction, which is only available from Fidelity if your stock option plan is managed by Fidelity, you may exercise your stock option to buy your company stock and sell the acquired shares at the same time without using your own cash.\n\nThe proceeds you receive from an exercise-and-sell transaction are equal to the fair market value of the stock minus the grant price and required tax withholding and brokerage commission and any fees (your gain).\n\n(https://www.fidelity.com/products/stockoptions/exercise.shtml#:~:text=Top-,Initiate%20an%20Exercise-and-Sell%20Transaction%20(cashless),without%20using%20your%20own%20cash.)",
        "subreddit": "options",
        "title": "Cashless Exercise and Sell transaction on OTM option that moves ITM after hours?",
        "url": "https://www.reddit.com/r/options/comments/iv544o/cashless_exercise_and_sell_transaction_on_otm/",
        "created": 1600460867.0
    },
    {
        "author": "Brothanogood",
        "created_utc": 1600976936,
        "id": "iz4cr3",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Square shares are up 146% in 2020 so far, and analysts at Oppenheimer think the stock can still go higher.\n\nOn Thursday, Oppenheimer upgraded Square ([SQ](https://finance.yahoo.com/quote/SQ?p=SQ&amp;.tsrc=fin-srch)) to outperform, with a price target of $185. (The all-time high was $166 on Sept. 1; shares were trading at around $152 on Thursday afternoon.) The upgrade is based on the growth of Square’s Cash App, and on the company’s opportunity to help merchants transition to e-commerce.\n\nBut really, the note is a post-pandemic vote of confidence.\n\nAs Oppenheimer writes, the COVID-19 pandemic has initiated a “massive shift in digital commerce, requiring merchants to rapidly adopt omni-channel solutions.” Of course, it was already obvious before the pandemic that the retail landscape was barreling toward e-commerce, but the pandemic has sent the trend into hyperdrive. [Walmart, Target, and Best Buy reported enormous surges](https://finance.yahoo.com/news/walmart-and-target-huge-ecommerce-gains-are-a-blaring-siren-to-brickandmortar-retail-192709224.html) (100%+) in digital sales in Q2; online-only retailers [Etsy](https://finance.yahoo.com/news/etsy-ceo-on-huge-q-2-etsy-is-becoming-much-more-mainstream-181632322.html) and [Wayfair](https://finance.yahoo.com/news/wayfair-stock-is-up-250-this-year-193131685.html) blew out their Q2 earnings; [Dick’s Sporting Goods is thriving](https://finance.yahoo.com/news/dicks-sporting-goods-is-wildly-outperforming-amid-the-pandemic-195504143.html) thanks to a combination of online sales and curbside pickup.\n\nAll of those are big retail names. Square’s bread and butter are SMBs (small and medium-sized businesses), which also need to immediately prioritize their e-commerce presence, if they didn’t already. Hundreds of thousands of small business have shut down due to the pandemic, but those that have survived will need to beef up their digital presence.\n\nOppenheimer believes Square is well-suited to serve those small businesses coming out of the pandemic, positioning Square “for outsized share gains as economic activity normalizes.”\n\nOppenheimer pegs Square’s TAM (total addressable market, [the “it” tech stat of the moment](https://finance.yahoo.com/news/what-cannabis-and-fake-meat-have-in-common-right-now-180741286.html)) at $160 billion, and within that, puts Cash App’s TAM at $63 billion, noting that “by reinvesting profits from prior Cash App cohorts, combined with its seller ecosystem, Square can develop significant network effects and products that will be challenging for other neo-banks to replicate in the digital wallet space.”\n\nIn other words, Square has an advantage over banks in the mobile payments race.\n\nOppenheimer also notes the “impressive volume and gross profit growth” of Cash App’s bitcoin trading feature. Square [enabled bitcoin trading within Cash App in 2018](https://finance.yahoo.com/news/why-square-embrace-bitcoin-brilliant-182530364.html). It reaped $875 million in bitcoin revenue in the second quarter, up 600% year over year, and $17 million in bitcoin gross profit, up 711% year over year. ($17 million is small for a company with $4.17 billion in revenue in 2019, but the growth is the point.) Oppenheimer cites the growth in bitcoin revenue as proof of “the scalability in the Cash App business model.”\n\nBitcoin has been a noted (and [some believe problematic](https://finance.yahoo.com/news/jack-dorseys-love-of-bitcoin-could-be-a-problem-for-square-122742500.html)) obsession of CEO Jack Dorsey.\n\nSquare has always touted that it serves both sides of the small business equation: sellers (i.e., businesses, through its point of sale hardware, payroll software, and Square Capital loan business) and shoppers (consumers paying with Square devices and/or using Cash App). Oppenheimer writes that this “two-sided network” will make Square “a structural winner during the recovery.”\n\nOf course, there’s an obvious downside case against Square: “Economic pressures persist longer than anticipated” if the pandemic drags on or even worsens, hitting small businesses harder; “competitive responses dampen growth,” and Square certainly has big competitors, including FIS (which acquired Worldpay last year), PayPal, ShopKeep, and Shopify; and if “new product launches and adoption slow,” which will be up to Dorsey and Square’s own pace of innovation.\n\nOppenheimer sees Square profit growing at a 37% annual rate from the end of 2020 through the end of 2022. Square was [Yahoo Finance’s Company of the Year in 2018](https://finance.yahoo.com/news/square-yahoo-finances-2018-company-133124167.html).\n\n—\n\n**Daniel Roberts is an editor-at-large at Yahoo Finance and closely covers fintech and payments. Follow him on Twitter at @**[**readDanwrite**](https://twitter.com/readDanwrite)**.**\n\n[**https://money.yahoo.com/square-is-positioned-to-be-a-winner-during-the-recovery-postpandemic-oppenheimer-191528365.html**](https://money.yahoo.com/square-is-positioned-to-be-a-winner-during-the-recovery-postpandemic-oppenheimer-191528365.html)",
        "subreddit": "stocks",
        "title": "Square is positioned to be a winner by helping small businesses digitize post-pandemic: Oppenheimer",
        "url": "https://www.reddit.com/r/stocks/comments/iz4cr3/square_is_positioned_to_be_a_winner_by_helping/",
        "created": 1601005736.0
    },
    {
        "author": "Slick3808",
        "created_utc": 1598978937,
        "id": "iknwg1",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Hello all,\n\nI'm single and in my early 30's.\nI'm in the 24% tax bracket and I've been maxing out employee match on my 401k, which is Vanguard target date fund wth ER of 0.05. \nMy employer match up to 6%.\n\nI plan to max out 401k this year, pre-tax, because I can really use the tax deduction.\n\nNow, I have my 401k and Roth IRA account with Fidelity and I've been investing in FZROX and FZILX in Roth IRA because I thought they were great index funds.\n\nBut then recently, I started question myself if there's any point in investing in both Target date fund and Index funds since they are very similar.\n\nAnd I figured I could really use Roth to take advantage of no tax on capital gains and dividends by investing into something other than index funds.\n\nI must be missing something though.\nI would like to know what others do with their retirement accounts and think about my retirement portfolio.\n\nI plan to retire in 15 years and I could really use some insights.\n\nThank you all in advance.",
        "subreddit": "investing",
        "title": "Investing in both Target date and Index fund?",
        "url": "https://www.reddit.com/r/investing/comments/iknwg1/investing_in_both_target_date_and_index_fund/",
        "created": 1599007737.0
    },
    {
        "author": "im_tripppin",
        "created_utc": 1600544903,
        "id": "ivzg9g",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "I was looking at buying ETFs and found that the expense ratio for the same fund on different brokers is not the same.\n\n[Fidelity - FSKAX](https://fundresearch.fidelity.com/mutual-funds/summary/315911693?type=sq-NavBar) \\- 0.015%\n\n[eTrade - FSKAX](https://www.etrade.wallst.com/v1/stocks/snapshot/snapshot.asp?ChallengeUrl=https://idp.etrade.com/idp/SSO.saml2&amp;reinitiate-handshake=0&amp;AuthnContext=authenticated&amp;env=PRD&amp;symbol=FSKAX&amp;rsO=new&amp;country=US) \\- 0.02%",
        "subreddit": "investing",
        "title": "Discrepancies in expense ratio - Fidelity vs eTrade",
        "url": "https://www.reddit.com/r/investing/comments/ivzg9g/discrepancies_in_expense_ratio_fidelity_vs_etrade/",
        "created": 1600573703.0
    },
    {
        "author": "Igettheshow89",
        "created_utc": 1599013998,
        "id": "ikyg6e",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Ant group definitely seems like a company ARKF would get involved with. Is there anyway to know beforehand or before the ant group ipo if ARKF intends to pick them up?\n\nSince ANT Group is going public only in China, I won’t be able buy shares on fidelity I don’t think. If there is a different fund, outside of ARKF, that might pick them up, please let me know.",
        "subreddit": "investing",
        "title": "Will ARKF pick up ANT Group at IPO?",
        "url": "https://www.reddit.com/r/investing/comments/ikyg6e/will_arkf_pick_up_ant_group_at_ipo/",
        "created": 1599042798.0
    },
    {
        "author": "badpauly",
        "created_utc": 1600981398,
        "id": "iz5se9",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "\nThis is a list of the top 20 companies that experienced the largest change in insider shares in the last seven (7) days.\nThe SEC defines an insider as any officer, director or 10% shareholder. It is not illegal for these people to buy or sell their own shares.\nIn fact, since most of them get paid in stock options, it is expected. However, it is illegal for them to trade on inside information\nthat has not been made public. So for example if there are drug trial results that are bad and not public,\ninsiders cannot dump shares. That said, many people have observed that insiders - in general - seem to have a good\ntrack record at timing their purchases.  All trades that are marked as part of a 10b5 plan are excluded from this report.\n\n## Largest Insider Buying (Last 7 Days)\nCompany|Count|Shares Changed|Avg. Price|Value Change\n--------|-----:|-----:|-----:|--------:    \n[11135MBC9 / Broadcom, Inc.](https://fintel.io/n/us/11135mbc9)|1|101,740|361|36,773,923 \n[ATHA / Athira Pharma, Inc.](https://fintel.io/n/us/atha)|2|1,808,824|17|30,750,008 \n[MTCR / Metacrine, Inc.](https://fintel.io/n/us/mtcr)|7|1,497,691|13|19,469,983 \n[ALRT / ALR Technologies, Inc.](https://fintel.io/n/us/alrt)|1|240,000,000|0|12,000,000 \n[STEP / StepStone Group Inc. Class A](https://fintel.io/n/us/step)|10|347,157|18|6,248,826 \n[JFR / Nuveen Floating Rate Income Fund ](https://fintel.io/n/us/jfr)|2|301,369|8|2,514,240 \n[TA / TravelCenters of America LLC](https://fintel.io/n/us/ta)|1|104,738|22|2,259,199 \n[SREV / ServiceSource International, Inc.](https://fintel.io/n/us/srev)|4|1,631,300|1|2,222,827 \n[PTVE / Pactiv Evergreen Inc. Common stock](https://fintel.io/n/us/ptve)|10|124,251|12|1,585,728 \n[BNL / Broadstone Net Lease, Inc.](https://fintel.io/n/us/bnl)|5|73,100|17|1,242,700  \n[VOXX / VOXX International Corp.](https://fintel.io/n/us/voxx)|4|103,552|8|813,992 \n[PBF / PBF Energy, Inc.](https://fintel.io/n/us/pbf)|1|100,000|7|697,910 \n[KSF / KINGSWAY FINANCIAL SERVICES INC](https://fintel.io/n/us/ksf)|3|190,000|3|589,000 \n[HIW / Highwoods Properties, Inc.](https://fintel.io/n/us/hiw)|2|13,000|33|435,070 \n[PB / Prosperity Bancshares, Inc.](https://fintel.io/n/us/pb)|1|8,700|50|431,233 \n[SAVA / Cassava Sciences, Inc.](https://fintel.io/n/us/sava)|2|46,281|9|419,527  \n[GBDC / Golub Capital BDC, Inc.](https://fintel.io/n/us/gbdc)|6|30,000|13|398,336 \n[ADMQ / ADM Endeavors Inc](https://fintel.io/n/us/admq)|12|17,301,500|0|395,816 \n[ETM / Entercom Communications Corp.](https://fintel.io/n/us/etm)|3|248,071|1|353,099  \n[AI / Arlington Asset Investment Corp.](https://fintel.io/n/us/ai)|5|120,000|3|321,340 \n[FUND / Sprott Focus Trust, Inc.](https://fintel.io/n/us/fund)|3|51,000|6|304,957 \n[CLDT / Chatham Lodging Trust](https://fintel.io/n/us/cldt)|1|32,600|8|265,364 \n[PER / SandRidge Permian Trust](https://fintel.io/n/us/per)|4|569,460|0|259,852 \n[VER / VEREIT, Inc.](https://fintel.io/n/us/ver)|1|40,000|6|253,152 \n[BFS / Saul Centers, Inc.](https://fintel.io/n/us/bfs)|1|10,000|25|249,400 \n[NVDA / NVIDIA Corp.](https://fintel.io/n/us/nvda)|2|450|496|224,142 \n[ERESU / East Resources Acquisition Company Unit](https://fintel.io/n/us/eresu)|5|22,000|10|215,810 \n[BHVN / Biohaven Pharmaceutical Holding](https://fintel.io/n/us/bhvn)|1|3,322|59|196,829 \n[MGY / Magnolia Oil &amp;amp; Gas Corp](https://fintel.io/n/us/mgy)|1|35,000|6|195,748 \n[SOR / Source Capital, Inc.](https://fintel.io/n/us/sor)|3|5,292|36|193,254 \n[JSD / Nuveen Short Duration Credit Opportunities Fund](https://fintel.io/n/us/jsd)|2|13,868|12|171,131 \n[ORA / Ormat Technologies, Inc.](https://fintel.io/n/us/ora)|1|3,000|56|167,310 \n[VGR / Vector Group, Ltd.](https://fintel.io/n/us/vgr)|4|17,500|9|164,325 \n[CIO / City Office REIT Inc.](https://fintel.io/n/us/cio)|2|21,500|7|157,585 \n[GP / GreenPower Motor Company Inc.](https://fintel.io/n/us/gp)|1|10,000|15|147,984 \n[HOME / At Home Group Inc.](https://fintel.io/n/us/home)|1|10,000|15|146,046\n\n## Largest Insider Selling (Last 7 Days)\nCompany|Count|Shares Change|Avg. Price|Value Change\n--------|-----:|-----:|-----:|--------:  \n[PPD / PPD, Inc.](https://fintel.io/n/us/ppd)|22|-60,187,833|31|-1,882,925,942 \n[FSLR / First Solar, Inc.](https://fintel.io/n/us/fslr)|1|-8,649,074|68|-592,461,569  \n[FRTA / Forterra, Inc.](https://fintel.io/n/us/frta)|1|-10,000,000|13|-128,250,000 \n[CRSR / Corsair Gaming, Inc.](https://fintel.io/n/us/crsr)|1|-6,500,000|17|-110,500,000 \n[FROG / JFrog Ltd.](https://fintel.io/n/us/frog)|4|-2,523,177|41|-103,248,403 \n[SWFT / Swift Transportation Company](https://fintel.io/n/us/swft)|2|-1,062,885|41|-43,503,240 \n[ONEW / OneWater Marine Inc. Class A](https://fintel.io/n/us/onew)|11|-2,075,184|19|-39,428,496 \n[RAPT / RAPT Therapeutics, Inc.](https://fintel.io/n/us/rapt)|1|-608,000|31|-18,756,800 \n[ETNB / 89bio, Inc.](https://fintel.io/n/us/etnb)|4|-550,000|28|-15,400,000 \n[ERA / Era Group Inc.](https://fintel.io/n/us/era)|3|-610,445|24|-14,324,164 \n[CRWD / CrowdStrike Holdings, Inc. Class A](https://fintel.io/n/us/crwd)|27|-78,873|130|-10,279,624 \n[FDX / FedEx Corp.](https://fintel.io/n/us/fdx)|4|-39,944|245|-9,858,681 \n[DOCU / DOCUSIGN INC](https://fintel.io/n/us/docu)|7|-49,299|192|-9,454,484 \n[K / Kellogg Co.](https://fintel.io/n/us/k)|1|-83,334|63|-5,214,500 \n[VRSK / Verisk Analytics, Inc.](https://fintel.io/n/us/vrsk)|2|-27,433|184|-5,037,638 \n[STRO / SUTRO BIOPHARMA INC](https://fintel.io/n/us/stro)|1|-400,000|12|-4,800,000 \n[TOTA / Tottenham Acquisition I Limited](https://fintel.io/n/us/tota)|1|-440,000|11|-4,765,200   \n[SEIC / SEI Investments Co.](https://fintel.io/n/us/seic)|1|-65,000|50|-3,262,350 \n[PLAN / Anaplan, Inc.](https://fintel.io/n/us/plan)|1|-51,180|57|-2,924,261 \n[WWE / World Wrestling Entertainment, Inc.](https://fintel.io/n/us/wwe)|1|-57,573|39|-2,255,710 \n[BBW / Build-A-Bear Workshop, Inc.](https://fintel.io/n/us/bbw)|3|-590,231|3|-2,004,106 \n[TTGT / TechTarget, Inc.](https://fintel.io/n/us/ttgt)|1|-46,100|38|-1,773,006 \n[PINS / Pinterest, Inc.](https://fintel.io/n/us/pins)|3|-45,549|37|-1,664,814 \n[FNF / Fidelity National Financial, Inc.](https://fintel.io/n/us/fnf)|1|-46,751|33|-1,520,763 \n[SMAR / SMARTSHEET INC](https://fintel.io/n/us/smar)|1|-30,000|47|-1,420,035 \n[RMG / RMG Acquisition Corp.](https://fintel.io/n/us/rmg)|3|-128,839|11|-1,393,196 \n[EGHT / 8x8, Inc.](https://fintel.io/n/us/eght)|8|-89,074|15|-1,356,241 \n[CRM / Salesforce.com, Inc.](https://fintel.io/n/us/crm)|17|-5,308|238|-1,288,578 \n[UPLD / Upland Software, Inc.](https://fintel.io/n/us/upld)|9|-34,048|38|-1,264,869 \n[RMT / Royce Micro-Cap Trust, Inc.](https://fintel.io/n/us/rmt)|4|-143,000|8|-1,101,885 \n[TOL / Toll Brothers, Inc.](https://fintel.io/n/us/tol)|3|-21,000|48|-992,522 \n[SWAV / ShockWave Medical, Inc.](https://fintel.io/n/us/swav)|1|-12,653|73|-926,073 \n[NVCR / NovoCure Limited](https://fintel.io/n/us/nvcr)|5|-8,262|109|-902,294 \n[YEXT / Yext, Inc.](https://fintel.io/n/us/yext)|6|-56,812|16|-883,202 \n[QSR / Restaurant Brands International Inc.](https://fintel.io/n/us/qsr)|1|-15,584|56|-874,418 \n[RARE / Ultragenyx Pharmaceutical Inc.](https://fintel.io/n/us/rare)|1|-10,000|85|-850,000 \n[MDLA / Medallia, Inc.](https://fintel.io/n/us/mdla)|1|-31,959|26|-836,182 \n[AGX / Argan, Inc.](https://fintel.io/n/us/agx)|1|-17,131|45|-769,525\n\n*Count* column is number of transactions.\n\nSource: [Fintel.io/insiders](https://fintel.io/insiders)",
        "subreddit": "StockMarket",
        "title": "Significant Insider Trading Activity (Last 7 Days)",
        "url": "https://www.reddit.com/r/StockMarket/comments/iz5se9/significant_insider_trading_activity_last_7_days/",
        "created": 1601010198.0
    },
    {
        "author": "budflight",
        "created_utc": 1600180262,
        "id": "it9w9c",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "49 with a healthy comp package that allows me to contribute 4-8k per month into investments. I expect my company to be acquired over the next 24-36 mos by a F500 org and have a nice upside should that stay on track. I also own two small businesses outside of \"real job.\" 20k cash in savings.\n\n\\~250k in Rollover IRA from a previous company (90% in a Fidelity date fund set at 2060 date for more aggressive nature and 10% in AAPL and 3 cannabis stocks) - my current company doesn't have a 401k so really just optimizing this IRA.\n\nStarted a Roth IRA for myself and my wife and have contributed the max to both for 2020. Using these for contributions for retirement.\n\n50k in accessible funds that are focused on AAPL, 5 cannabis stocks, LUV, and a few renewable energy ETFs and a small position in TSLA. The goal would be to keep this in something that is moving vs. dumping to a savings account (in order to keep it accessible)\n\nTwo questions:\n\n1. Taking profits - I bought TSLA at the 20% drop last week and it's up 31% as of today. It's only 4 shares so does it make sense to sell a share and drop that into SPY/VOO and let the rest ride? Same with other stocks? I am in AAPL at $34/share (\\~200 shares)...take all of those profits and drop into SPY/VOO? I hear so many stories of \"my dad's cousin bought AAPL 15 years ago and is sitting on a million bucks.\" While I want to be that guy, I don't want to lose out should they shit the bed, etc.\n2. DCA - Does it make sense to sell the entire IRA and drop into SPY/VOO over the next few months or stay put?\n\nAny other advice?",
        "subreddit": "stocks",
        "title": "Questions about DCA and taking profits",
        "url": "https://www.reddit.com/r/stocks/comments/it9w9c/questions_about_dca_and_taking_profits/",
        "created": 1600209062.0
    },
    {
        "author": "BioInfoPod",
        "created_utc": 1600453050,
        "id": "ivbfpn",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "I am interested to try to eventually have the capacity to get in on a few IPOs at the actual IPO price but, obviously, this seems exceptionally hard to actually do.\n\nSearching around I have seen online articles recommending platforms like webull and tradestation. I also know that fidelity offers the possibility if you have an account with enough assets (but even still, as I understand, it is not guaranteed). Before messing with these or any other potential platforms, I was wondering if anyone has any experience placing orders of any of these and if you have ever actually been able to get them filled at all?\n\nAnyone out there been able to actually get in any IPOs in the last couple years and if so, what platform did you use? How has your overall experience been with any platform you've used to try and get in on IPOs?",
        "subreddit": "investing",
        "title": "Anyone here actually getting in on anything at the IPO price? (and if so, how?)",
        "url": "https://www.reddit.com/r/investing/comments/ivbfpn/anyone_here_actually_getting_in_on_anything_at/",
        "created": 1600481850.0
    },
    {
        "author": "damnit2020",
        "created_utc": 1600192902,
        "id": "ite0r7",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Ive been using fidelity for better part of 10 yrs now, as thats where i first setup my retirement accounts, and has my inherited IRA. Considered moving my cash account to an app where most people seem to be day trading stocks - which fidelity has the T+3 rule, so i cant sell until the shares settle, or get a good faith violation.  \n\n\nWondering what benefits there are from moving a big boy like to fidelity to robinhood or webull? and why its better, if so?  \n\n\n*Side note - how do these apps get around the T+3 SEC rule where people can constantly flip in and out of stocks multiple times per day. id like to do this, and scrape 1% profit each flip, but have yet to crack the code, an figure out where &amp; how to do this.*",
        "subreddit": "pennystocks",
        "title": "What Advantages are there using a trading app like RH or WB, over your more traditional setups like fidelity?",
        "url": "https://www.reddit.com/r/pennystocks/comments/ite0r7/what_advantages_are_there_using_a_trading_app/",
        "created": 1600221702.0
    },
    {
        "author": "Torlek1",
        "created_utc": 1600556092,
        "id": "iw2id3",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "[https://www.reddit.com/r/wallstreetbets/comments/ivyt4p/yolo_into_lordstown_motors_dphc_becoming_ride_in/](YOLO into Lordstown Motors DPHC becoming RIDE in a month...)\n\n&gt; SPAC's are making millionaires, so get in, dumbasses!\n\n&gt; I'm already FOMO YOLO into DPHC but news just keeps coming and massive upside just confirmed. Analyst inadvertently gave valuation yesterday after analyst event last week. $16 billion means over $90/share value, but that is over THREE times Friday close! Once this converts to RIDE it will run even more. They have third largest factory in the U.S. and backed by GM, Samsung, Fidelity, Goodrich, etc... It is Free F'n Money. FFM, bitches. There are other spac's I see easy money in too, but this one is safest to YOLO into. I went all in with 401k, IRA, Trade Accounts for shares, BUT you can get warrants for leverage if you need money to go farther. You almost can't fuck up buying these spacs UNLESS you have paper fingers that hit \"sell\" and then you will lose your money no matter what good advice you are given. p.s Plus, options coming looks like b/c showing up on some trading platforms (not Fidelity..just checked) per some post on stocktwits. If you wait on options you are giving up money though. p.p.s. I'm a GenX'r, you fucks, not a boomer.\n\n&gt; 10,000 shares DPHC (aka RIDE)",
        "subreddit": "SPACs",
        "title": "Someone just did a YOLO on DPHC!",
        "url": "https://www.reddit.com/r/SPACs/comments/iw2id3/someone_just_did_a_yolo_on_dphc/",
        "created": 1600584892.0
    },
    {
        "author": "Jim_Layhe",
        "created_utc": 1601255234,
        "id": "j12nyd",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "I’m looking to fund 6k into an IRA this week, traditional not Roth. What are some of the more aggressive ETFs I can get through Fidelity that have pretty high risk but good returns. I’m guessing tech sector etc...\n\nI’m 29 and will put the max each year in so 6k to start.\n\nAlready maxing my 401k at work so IRA seemed like the next step.\n\nAre things like arkk arkw or tech related ETFs my best bet? Any suggestions?",
        "subreddit": "investing",
        "title": "Traditional IRA ETF suggestions",
        "url": "https://www.reddit.com/r/investing/comments/j12nyd/traditional_ira_etf_suggestions/",
        "created": 1601284034.0
    },
    {
        "author": "handsymcsackgrab",
        "created_utc": 1601387822,
        "id": "j1zonx",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Hi folks,\n\nI have been testing a option chain Monte Carlo valuation model and so far it has done well. I value the option chain and check which long/short iron butterflies are undervalued. Net over the testing period vix has decreased but there have been a few spikes and I think my model has done fairly well during spikes and falls so I would like to test it with real money (I can assume losing a bit to the bid ask but unless I try with real money then I can’t actually be sure what prices I will get). \n\nI was thinking of opening a new broker (I have Roth with fidelity and Robinhood for messing around but for this I want a more legit broker than Robinhood and something outside my Roth) with either TD, IBKR, or Fidelity. \n\nHow do they handle early assignment with long/short iron butterflies and does anyone have an estimate of how often l/s iron butterflies deal with early exercise?\n\nThanks,\nHandys",
        "subreddit": "options",
        "title": "Long/Short Iron butterfly - early exercise",
        "url": "https://www.reddit.com/r/options/comments/j1zonx/longshort_iron_butterfly_early_exercise/",
        "created": 1601416622.0
    },
    {
        "author": "SignificantStation52",
        "created_utc": 1601395234,
        "id": "j2225n",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Does anyone know why Fidelity shows Nov 20 for the rights expiration date?",
        "subreddit": "SPACs",
        "title": "KBLM Rights",
        "url": "https://www.reddit.com/r/SPACs/comments/j2225n/kblm_rights/",
        "created": 1601424034.0
    },
    {
        "author": "DeeBee77777",
        "created_utc": 1599244699,
        "id": "imlmge",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "I came across the Fidelity mutual fund FAOFX - Fidelity Advisor Series Growth Opportunities Fund. It’s a large cap growth fund that I believe is active. It shows that the fund has a expense ratio of 0.01%. Which it makes it the lowest expense ratio I know outside of the ZERO funds Fidelity has now. Does anyone know much about this fund and is the expense ratio the real deal?",
        "subreddit": "investing",
        "title": "FAOFX very low expense ratio",
        "url": "https://www.reddit.com/r/investing/comments/imlmge/faofx_very_low_expense_ratio/",
        "created": 1599273499.0
    },
    {
        "author": "thefunnybunny_",
        "created_utc": 1599344935,
        "id": "inaggz",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": ".........................this question had been bugging for some time so this is it: I have a question I am currently a new stock investor and I have a account with Charles Schwab and I was wondering is it even possible to switch over to Fidelity if so what is that gonna do to my taxes is that illegal is it normal can I have two brokerages I want is it normal to have a brokerage account in Fidelity and one in the other I just need some answers on what I could do and what I can’t in terms of going into two different brokerages at same time I’m just honestly looking for the simplest brokerage in terms of mobile usage everything seems too complicated...yeah just some answers possibly  this could literally be the biggest mistake or just another normal instant solution type of thing. I really don’t know but what if this is like “once u choose ur brokerage” that’s the final choice type",
        "subreddit": "investing",
        "title": "Confusing QUESTION",
        "url": "https://www.reddit.com/r/investing/comments/inaggz/confusing_question/",
        "created": 1599373735.0
    },
    {
        "author": "train_guy_420_69",
        "created_utc": 1601321084,
        "id": "j1iuxv",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Hi all,\n\nFirst time poster here, I just received my physical stock certificates I received as a gift when I was a child. It is 15 shares of McDonald’s and 10 shares of Disney (from 1995). I’m pretty sure they’ve both split since then but I’m not hip to any of it. I was wondering how I could get these physical certificates into any of the investing platforms like fidelity and Robinhood etc. I plan to keep some of the shares and sell some and learn some basic investing. Any help or guidance would be great!",
        "subreddit": "investing",
        "title": "Physical Stock Certificates to a Digital Wallet",
        "url": "https://www.reddit.com/r/investing/comments/j1iuxv/physical_stock_certificates_to_a_digital_wallet/",
        "created": 1601349884.0
    },
    {
        "author": "rajkumar81",
        "created_utc": 1600201234,
        "id": "itgtm8",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "I have 10 warrants (PSTHWS ) in my fidelity brokerage account and on sep 11, the common share price was 21$. So here are my questions\n1. Assume that PSTH common share trades at $30 during the warrant expiration ( 2025 hypothetical ) . That means I can excercise is my warrants and buy each stock for $21 .. though in 2025 it might trade at 30 $.\n\n2. I can still buy PSTHWS warrants trading at ~8 $ and do the same as step 1 ?",
        "subreddit": "SPACs",
        "title": "PSTHWS - question on buying warrants",
        "url": "https://www.reddit.com/r/SPACs/comments/itgtm8/psthws_question_on_buying_warrants/",
        "created": 1600230034.0
    },
    {
        "author": "bundadog",
        "created_utc": 1598985567,
        "id": "ikq2w8",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Hi. I'm interested in investing in certain stocks. I understand that I need to join a brokerage firm. I'm thinking fidelity or vanguard. I'm interested in active trading, possibly 5 year cycle or less. As far as taxes go, which account is best to open? (Roth IRA, traditional, etc) I'm new to investing/trading. (I already have a 401k setup and I'm not interested in changing it or mirror it. I'm receiving an additional  small amount &lt;5000k, and I'm not thinking of leaving this money invested a long time.)\n\nThanks",
        "subreddit": "investing",
        "title": "small sum for stock trading - which type of account to open",
        "url": "https://www.reddit.com/r/investing/comments/ikq2w8/small_sum_for_stock_trading_which_type_of_account/",
        "created": 1599014367.0
    },
    {
        "author": "RickDarylNeganAlpha",
        "created_utc": 1598983997,
        "id": "ikpk6p",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "TSLA free shares\n\nI bought TSLA on 8/21 before close. Aren’t I suppose to have 4 free shares in my account? Mine aren’t showing up. Would I contact fidelity about this? Or am I incorrect that I was suppose to receive 4 shares after the split.",
        "subreddit": "stocks",
        "title": "TSLA 4 free shares",
        "url": "https://www.reddit.com/r/stocks/comments/ikpk6p/tsla_4_free_shares/",
        "created": 1599012797.0
    },
    {
        "author": "Smooth_Consequence_1",
        "created_utc": 1598974416,
        "id": "ikmgbx",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Hi, I’m 21 years old &amp; have 15k just laying around. I have an extra 5k in a savings account, so a total of 20k. I want to invest within a Roth IRA &amp; with a brokerage that has index funds, preferably the s&amp;P 500. I have a few questions.\n\n1. Should I open up a Roth IRA and put a index fund in there, and also open up a brokerage account that I can play with before retirement &amp; use the gains? Can you have two different investment accounts &amp; invest the same index (s&amp;P 500 in both Ira AND separate brokerage account?) \n2. Should I have both my accounts with the same brokerage? Ex. Have my Roth IRA with vanguard and have my separate (tax paying) account with fidelity? Or should I keep everything with the same brokerage? \n3. I want my money to be fdic insured so I was thinking about opening a Roth with my local credit union. But after research, they are terrible at giving sufficient returns. Thoughts? \n4. (Don’t have to answer, I can do more research but it won’t hurt to ask) What beginner index funds should I do? What should an ideal portfolio look like? All weather, golden butterfly, dragon, etc?",
        "subreddit": "investing",
        "title": "21 years old &amp; need some investing advice!",
        "url": "https://www.reddit.com/r/investing/comments/ikmgbx/21_years_old_need_some_investing_advice/",
        "created": 1599003216.0
    },
    {
        "author": "DeeBee77777",
        "created_utc": 1599122757,
        "id": "ilps1h",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "I came across the Fidelity mutual fund FAOFX. It’s a large cap growth active fund based on what it says on the Fidelity website and seeing its turnover percentage. It has a expense ratio of 0.01%. I’m interested into looking more into the fund. Does anyone know much about this fund and is the expense ratio the real deal?",
        "subreddit": "investing",
        "title": "FAOFX’s low expense ratio",
        "url": "https://www.reddit.com/r/investing/comments/ilps1h/faofxs_low_expense_ratio/",
        "created": 1599151557.0
    }
]