[
    {
        "author": "boyinahouse",
        "created_utc": 1595395420,
        "id": "hvnvhw",
        "num_comments": 384,
        "num_crossposts": 0,
        "selftext": "Before the market crash in Feb/March, I'd see a new post every other day about the \"index fund bubble\" that was being touted around by Burry. His key premise was that a massive sell-off would lead to a major market collapse due to the \"small exit door\" theory. Three or however many circuit breakers later, we saw that index funds held up remarkably well. He was literally flat out wrong. Where are all those posts? Even a broken clock is right twice a day. The guy is still riding his high horse from 2008, and I hate seeing things he says taken as gospel. Hopefully none of you got suckered into that Gamestop play of his.",
        "subreddit": "investing",
        "title": "Michael Burry was wrong and no one noticed",
        "url": "https://www.reddit.com/r/investing/comments/hvnvhw/michael_burry_was_wrong_and_no_one_noticed/",
        "created": 1595424220.0
    },
    {
        "author": "endedupspinal",
        "created_utc": 1596079721,
        "id": "i0eubv",
        "num_comments": 90,
        "num_crossposts": 0,
        "selftext": "This is my first analysis on a company. I wrote this analysis for myself to understand GME after reading that Michael Burry has a large share in GME. I have no ownership in the company yet, and do not have any formal training. I would love to hear everyone's feedback and thoughts, as well as advice for what I could do better, mistakes in reasoning as well as any constructive comments/criticism. Thanks in advance!\n\n\n**Fundamental analysis of GME**\n\n**Premise:** GME is fundamentally undervalued (at least for the short term) and will reflect it’s true market value upon release of the next generation of xbox and playstation consoles.\n\n**Argument 1:** Stock price is cyclical, tied to the release of new games/consoles. Xbox has released consoles in 2002, 2013, and 2017, and upcoming in Q4 2020. Playstation has released consoles in 1994, 2000,  2006, 2013 and PS5 in Q4 2020. Both companies have released variations of the current brand in between time periods. GME stock value has generally reflected sales during these times. The performance of GME in 2017 onwards is due to - 64.2% revenue over the past 5 years as a result of no new consoles and a trend towards digital games.\n\n\n\n\n**Argument 2:** Pricing of the stock is below market value which was determined by: (Assets - Liabilities)/(outstanding shares) gives us $9.44 a share. Yet GME is currently marked at 4.50 a share.\n\n**Explaining the low pricing:**\n\nGME is currently being priced as if it is headed toward bankruptcy, rather than its intrinsic value. Market sentiment is that brick and mortar has been hammered by the online industry (amazon, ebay etc). The high expectations of of online retail over brick and mortar has caused people to shift resources and attention towards online retail and technology which has resulted in the following:\n\n1) An overvaluation of technological/online companies. For example Intrinsic value of Amazon (based on free cash flow) is 33% lower than it’s current share price. The higher pricing is due to the promise of amazon as an online retailer but amazon unperformed brick and mortar by a large margin for the past decade. \n\n\n2) an undervaluation of brick and mortar stores (amazon is currently generating $2 billion in profit, and has had many unprofitable years in the past decade, while walmart has profited $129 billion) in 2019 alone.\n\n\n\n3) Pessimism reflected by the market due to covid 19, where the expectation is that brick and mortar will be hit hardest and online will thrive, but over 2/3 of stores were able to continue operating albeit with modified procedures (curbside pickup, online orders). Additionally GME online sales have spiked 1500% during covid. \n\n4) Low emphasis on stockholders. In the past GME has not put tremendous emphasis on delivering shareholder value. However in recent months Hestia Capital and Permit Capital, both significant investors in GME with 7.3% holding have recently won 2 board seat nominations for Paul Evans and Curtis Wolf, who have promised to redirect efforts towards shareholder value by changing the companies focus on long term performance and by extension unlocking shareholder value. Strategies by management include: reducing costs, shift towards a long term strategy and alignment of compensation with performance, a historically neglected aspect resulting in investor frustration.\n\nI don’t think this is significant, but it is worth noting that management does see value in the company, albeit in the face of significant structural changes.\n\n**Arguments against:**\n\n1) Can GME survive until the December release of consoles?\n- yes, they have $500 million in liquidity, and a yearly operating cost of 2 billion, ample to support the store until console releases.\n\n2) will the market reflect GMEs value once sales are up?\nUnknown. I’m not certain of this.\n\n3) What advantage does GME offer over walmart and Bestbuy for sales of consoles?\n\nUnknown, GME may have higher pricing than its competitors and a wider assortment of games and accessories. I don’t find this convincing however. See #4\n\n4) Underperformance of console sales. \n\nThere is the potential for consoles to flop, but i don’t think this is viable given the improvements in technology, how long it has been since a new console was released, increasing work from home/stay at home population due to the pandemic and affordable pricing.\n\nAdditionally - covid has spiked GME online sales by 1500%, which is a positive sign for the retailers potential. \n\nHistorically, consoles have sold out upon pre-orders becoming available, i think this trend will continue into the next generation of systems.\n\n5) The move to digital:\n\nDigital relies on heavy internet speeds and storage, both practically unavailable right now.\n\n**Conclusion:**\n\nGME is currently under-priced due to a combination of low confidence in management, the expectation that online will take over brick and mortar, historically unfavorable treatment towards shareholders and future expectations of bankruptcy. However intrinsic value of the company is over twice it’s current pricing. The company has enough liquidity to support themselves through the console cycle and bankruptcy fears are unjustified. The company's change in management along with upcoming console release gives the potential for GME to return to its intrinsic value, generate profits and return to a fair market value. I plan to buy GME and hold for up to a year, either until the stock yields a profit or until the end of the console cycle.",
        "subreddit": "SecurityAnalysis",
        "title": "GME: Undervalued?",
        "url": "https://www.reddit.com/r/SecurityAnalysis/comments/i0eubv/gme_undervalued/",
        "created": 1596108521.0
    },
    {
        "author": "ImStillFunny",
        "created_utc": 1596089534,
        "id": "i0gwzw",
        "num_comments": 42,
        "num_crossposts": 0,
        "selftext": "Why would Donald Trump give this money to KODAK? Apparently they have chemical facilities that can make this vaccine material, but why them?\n\nSimple, JOBS, JOBS, JOBS. Before this Kodak had empty factories that were dedicated to photographic chemical bullshit, once the world moved towards digital cameras they got fucked and so did their workers.\n\nNow Big D is pumping the stock for his friends, and getting people jobs. So the next company I'm going to invest in is GameStop, because they have so many empty stores and they could package the vaccine.",
        "subreddit": "wallstreetbets",
        "title": "Don't look at KODAK, look at what it provides",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i0gwzw/dont_look_at_kodak_look_at_what_it_provides/",
        "created": 1596118334.0
    },
    {
        "author": "JStewie21",
        "created_utc": 1595329753,
        "id": "hv5hhe",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "GME",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hv5hhe/gme/",
        "created": 1595358553.0
    },
    {
        "author": "SnaxxG",
        "created_utc": 1594834791,
        "id": "hrs3q8",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "GameStop DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hrs3q8/gamestop_dd/",
        "created": 1594863591.0
    },
    {
        "author": "InYourBertHole",
        "created_utc": 1596124384,
        "id": "i0oh0l",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Listen up you autist ducks,\n\nWe’re all bleeding fucking money out of our fucking eyeballs this week, but this does not have to be this way. \n\nWhile browsing Finviz for the most heavily shorted stock on the market, I happened upon shitty old GameStop - a terrible company no doubt, with a 98% short float. Let me read that out to you, NINETY FUCKING EIGHT PERCENT. That leaves 2% of shares to trade. Zero fucking volume. 0. \n\nIf we, on wsb, start pushing the price up by buying shares (gay, I know) until shorters shit themselves, it would take them SIXTEEN days to cover their positions. \n\nAll public fucking info, check out Finviz. \n\nDisclaimer, before one of you fucks mention this: I hold no bags, no positions in this pile of garbage. But I would love to participate in sending this to fucking space with you and fuck up the institutions holding 98% of shares shorted. \n\nWho’s in, retards?",
        "subreddit": "wallstreetbets",
        "title": "GME and the biggest short squeeze opportunity for us WSB autists - if we unite as one",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i0oh0l/gme_and_the_biggest_short_squeeze_opportunity_for/",
        "created": 1596153184.0
    },
    {
        "author": "NeverOddOreveN12",
        "created_utc": 1593780843,
        "id": "hkijhm",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "The short interest is insane, higher than the number of shares. Also, GameStop has short term lease liabilities and a lot of equity in real estate that they can tap. With their new consoles coming out around the corner,  they are in no danger of going out of business this year.\n\nIs this the setup for the mother of all short squeezes?\n\nGME 4.5C 10/21",
        "subreddit": "wallstreetbets",
        "title": "GameStop Short Squeeze [Discussion]",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hkijhm/gamestop_short_squeeze_discussion/",
        "created": 1593809643.0
    },
    {
        "author": "THICCJeeves",
        "created_utc": 1595601552,
        "id": "hx2x3b",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Here we go again. From the man who brought you the now LEGENDARY $TACO DD (proven right they crushed ER and are up 9% today). And the highly questionable $GME DD, I now bring you a kind of boring but basically guaranteed free money long term play.\n\nHere in lies conagra brands. This baby is a sleeping giant and here’s why:\n\nThey’re a food company first of all and we all know those are hot right now with the pandemic and all. But even besides that, they own multiple fucking fire brands which you can view here on their website: https://www.conagrabrands.com/brands (Birds eye, Slim Jim, PAM, Earth Balance, BOOM CHIKA POP, etc) \n\nOne of the most notable to me is that they acquired gardein (the vegan meat company) in 2018 and my vegan girlfriend loves them and I think their stuff is pretty bomb too. They are a powerhouse in the vegan frozen food industry which is growing a shit ton every year. Again on top of that they have other great brands too AND they just had an amazing ER and great forward guidance. \n\nSo I know I know you’re waiting for the strike price and expiration. Well here’s the thing. This stock is a slow moving POS dividend stock (I learned that lesson the hard way when I tried to play their earnings with a call expiring a couple days later). This thing has a fucking delayed reaction to any news and ER reports I’ve found. So for that reason I’ve decided that a long call is the best play. More specifically I recommend either the 12/18 $40c or the 1/15/21 $40c. They’re both around the same price (like $0.30 difference) so it’s just a matter of preference I guess. \n\nSo far they’ve gone up almost $2 from $35 to $36.75 from ER a couple weeks ago. It’s already tested $37.15ish twice now and it will probably keep testing it for another week before fully legging up to the next level. Like I said it’s a slow mover. And don’t get too afraid of any corrections because this thing will correct very harshly but it’s always a textbook correction when you go back and look at the chart. It corrects to the extreme but always bounces back and again moves VERY SLOWLY. They were a $48 stock at one point in 2016 but got fucked when they acquired Pinnacle Foods and had a messy merger (which they are now recovering from). So this is why I easily see them hitting at least $40 again in the near term because they were worth $48 BEFORE aquiring even more brands. They have added birds eye and gardein since then which again are both powerhouses in the frozen section. \n\nSo for anyone who wants to throw a couple hundred bucks in this and see it double in a few months here you go. I would say you’d be safe dumping even 1k in. But who am I to say? I’m a little bitch and only betting $150 cuz I’m broke and have a low risk tolerance. \n\nCheers boys let’s make some money 🥂",
        "subreddit": "smallstreetbets",
        "title": "Conagra Brands ($CAG) DD",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/hx2x3b/conagra_brands_cag_dd/",
        "created": 1595630352.0
    },
    {
        "author": "NeverOddOreveN12",
        "created_utc": 1593780512,
        "id": "hkigqz",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Hello friends. I wanted to run this by everyone. There is a short interest in GameStop of 109% and they probably won’t go out of business any times soon. Is this a setup for the mother of all short-squeezes?",
        "subreddit": "investing",
        "title": "GameStop Short Squeeze",
        "url": "https://www.reddit.com/r/investing/comments/hkigqz/gamestop_short_squeeze/",
        "created": 1593809312.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1594834438,
        "id": "hrrzka",
        "num_comments": 0,
        "num_crossposts": 0,
        "subreddit": "wallstreetbets",
        "title": "GameStop Buyout DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hrrzka/gamestop_buyout_dd/",
        "created": 1594863238.0
    },
    {
        "author": "geoguy8034",
        "created_utc": 1595018699,
        "id": "ht3jfc",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Does anyone have information on what this said?",
        "subreddit": "stocks",
        "title": "GME: Seeking Alpha Catalyst Watch",
        "url": "https://www.reddit.com/r/stocks/comments/ht3jfc/gme_seeking_alpha_catalyst_watch/",
        "created": 1595047499.0
    },
    {
        "author": "mariomaker2stufzs",
        "created_utc": 1596125353,
        "id": "i0ordp",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Today sucks, at least my gamestop went up",
        "url": "https://i.redd.it/iktziypmq0e51.jpg",
        "created": 1596154153.0
    }
]