[
    {
        "author": "closingbell",
        "created_utc": 1599933366,
        "id": "irhabh",
        "num_comments": 602,
        "num_crossposts": 0,
        "selftext": "(Bloomberg) -- Nikola Corp. has left a trail of inconsistent statements and contradictory announcements that are now coming under scrutiny from short-sellers eager to poke holes in the electric-vehicle company’s success story.\n\nHindenburg Research, which holds a short position in Nikola stock and stands to gain if the shares fall, released a report Thursday detailing what it called “dozens of lies” about the company’s capabilities, partnerships or products. The firm used internal emails, analyzed photos and even cited an investigator dispatched to rural Utah to test how far a car would roll down a hill. Nikola said Hindenburg’s report was full of falsehoods but hasn’t offered anything specific to rebut the allegations.\n\nIt doesn’t take a hedge fund or a private eye to determine that Nikola, which struck a partnership this week with General Motors Co., has a pattern of discrepancies. A look at some of its announcements and filings, along with statements and tweets by Chairman Trevor Milton and other executives over the past few years, yields other examples that weren’t part of Hindenburg’s report. “It’s a bit confusing trying to follow Trevor on his various social media outlets about the timing and cadence of communication of the different variables that you’re talking about,” Jeff Osborne, a Cowen &amp; Co. analyst, told executives on an Aug. 4 conference call.\n\nNikola’s shares have tumbled 24% since the Hindenburg report, which, among other sources, cited a Bloomberg story from June about the company exaggerating the capabilities of a truck.\n\n“We are committed to doing our best to keep the investing public and all of our stakeholders informed and up to date at all times,” Chief Executive Officer Mark Russell said Friday in an emailed response to questions from Bloomberg about the following items.\n\nUnder Construction\n\nAt a press event on July 22, ahead of the groundbreaking of Nikola’s Coolidge, Arizona, factory, Head of Global Manufacturing Mark Duchesne fielded a question on when construction would get underway. “That one is an easy answer,” he said. “Start of construction is tomorrow.”\n\nThe timeline was repeated by Milton the following day in a tweet. But “construction” turns out to be a broad term.\n\nTo facilitate the groundbreaking ceremony, the city of Coolidge issued Nikola a temporary use permit on July 13. The document, obtained by Bloomberg, allowed the company to do some limited ground clearing and preparation for holding the event, along with listing a plan for coronavirus safeguards. It didn’t allow further construction to start beyond that. The company also obtained a Pinal County dust permit around the same time, a legal requirement in Arizona.\n\nOn Aug. 7, the company received its at-risk grading and drainage permit, City Manager Rick Miller said by phone. The permit allows Nikola to clear dirt and do drainage work on the site, but as yet the company doesn’t have the permits required for foundation work, plumbing, electrical or vertical construction, Miller said. The permits are available through public-records requests.\n\nOn Wednesday, Nikola said in a tweet that Coolidge’s city council had approved the company’s “factory masterplan” and that “construction can now go forward.” This is only partly true, Miller said. It was the planning and zoning commission that approved a “major site plan.” The approval will allow Nikola and its architects and engineers to apply for the next batch of permits.\n\nIn a statement, Nikola said that by “construction” it meant everything from groundbreaking to seeking permits. Now that its building plan is approved, “the various permits will be obtained in cadence with the steps of the construction. We remain on schedule for Phase 1,” the company said in an email.\n\n”The factory will be up in 12 months,” Milton said in a live broadcast on Instagram on Friday night. “The permit was just issued by the city. We are all good to go.”\n\nPuzzling Partnership\n\nNikola has a stated ambition of manufacturing hydrogen-powered fuel cell semi trucks by 2023. Since 2017, it has had an agreement for German auto parts supplier Robert Bosch Gmbh to “develop, build, test and support” various components for Nikola’s prototypes including a fuel-cell system, battery packs, steering pumps and motors, according to a regulatory filing in March.\n\nThe details of which partner is contributing what to the project has shifted over time, and the future of the deal has gotten hazier.\n\nNikola agreed to pay Bosch around $40 million for the development, according to the filing. In a presentation to investors in April, Nikola described the agreement with Bosch as a “co-development” and strategic supply chain partnership and said the company would jointly own any intellectual property developed with Bosch.\n\nHowever, Nikola executives have regularly stated that Nikola designed, developed and will provide much of the technology for its vehicles -- not Bosch. On Friday, Chief Financial Officer Kim Brady said that Nikola will provide only 15% of the parts in battery electric pickups due to be built in Ulm, Germany, while partner Iveco provides the rest. However, he added that Nikola’s input represents 90% of the truck’s value.\n\n“We are responsible for Nikola Tre -- the batteries, e-axle, e-motors, inverters, BMS system, infotainment system,” Brady said. “All the key electric propulsion systems come from Nikola.”\n\nAs recently as Aug. 25, Bosch has said that it’s “working with the company to make the fuel-cell drive for trucks suitable for mass production.”\n\nOn Monday, Nikola announced that GM -- not Bosch -- will mass-supply a fuel cell system for Nikola’s Class 7 and 8 semi trucks, as well as the battery packs for its debut electric pickup, the Badger. On Friday, Nikola clarified that Bosch will supply semi truck fuel cells in Europe, while GM will have exclusivity everywhere else.\n\n“Bosch is an investor, board member and supplier to Nikola. They help us in many facets of our business as our partner,” Nikola said.\n\nMilton bristled at a claim by a Twitter user that Nikola was jilting Bosch in favor of GM.\n\n“Bosch as a company with a dedicated hydrogen strategy welcomes the decision of GM to enter this market as an important player,” Bosch spokesman Tim Wieland said in an email. “Beyond that, Nikola and Bosch have been working together for several years, not only on the fuel cell power train but also on other innovations like the steering system and the Mirror Cam System for the first prototypes of the Nikola trucks. The two companies will continue to cooperate in the future, also on fuel cells.”\n\nGame Changer\n\nNikola’s narrative about its battery strategy has also shifted over time.\n\nIn November 2019, Nikola issued a press release claiming to have “game-changing” battery cell technology that it would unveil at an event in 2020. Nikola also said it had entered into a letter of intent to acquire a “world-class battery engineering team” to help bring the new battery to pre-production.\n\n“We are talking about doubling the range of BEVs and hydrogen-electric vehicles around the world,” Milton said in the statement.\n\nIn July, Milton tweeted that Nikola would “make the entire pack like the top guys do” for its upcoming pickup truck, called the Badger. He said that all internal components, such as batteries, inverters, software and controls, are Nikola’s own intellectual property. “We own it all in house,” he said.\n\nMilton clarified in a tweet on Thursday that Nikola’s change of direction -- to use GM’s Ultium battery technology for the Badger -- was a result of cost analysis and cost savings.\n\nBeer Trucks\n\nBack in March, Nikola said in a presentation to investors that it has a “signed binding agreement” to provide Anheuser-Busch with as many as 800 hydrogen fuel cell electric semi trucks. What the presentation didn’t say was that Anheuser-Busch committed to buy fewer trucks than that, and doesn’t have to buy any at all.\n\nThe deal was first announced in May 2018 and stated the trucks were originally expected to be integrated into Anheuser-Busch’s dedicated fleet by the end of 2020, according to a press release.\n\nThat timeline isn’t going to be met. During the Aug. 4 earnings call, Russell, the CEO, updated investors on the deal, saying, “We do believe that we’ll be able to give them test prototypes before the end of 2021; serial production or mass production of the fuel cell truck will not begin until 2023.”\n\nThat does corroborate with the timeline for production set out in a July filing -- and to be fair, lots of people’s plans have changed this year. But in the same filing, Nikola revealed that Anheuser-Busch retains the right to cancel the truck order, though there’s no indication that will happen. The contract also has lease terms and rental rates that may be hard for Nikola to meet, according to the filing, “depending on our ability to develop our trucks and hydrogen network according to current design parameters and cost estimates.”\n\nThe agreement between the two companies states that Anheuser-Busch gets priority of delivery for as much as 20% of Nikola’s initial “production line of Class 8 vehicles.” To get production going by 2023, Nikola must work to have dedicated equipment in Anheuser Busch’s breweries and distribution centers by the end of 2021, according to the deal terms. Anheuser-Busch only agreed to use at least 600 trucks -- the 800 figure, according to the document, is an estimate of what the brewer will need.\n\n“They have been, and continue to be, a great long-term partner in our shared vision of a zero-emission future (a Nikola Two prototype hauled our first load over public roads for them in St. Louis not too long ago),” Russell said in the statement Friday, referring to Anheuser-Busch. “Our original agreement with them has been modified over time. The current agreement terms are as we set forth in our earnings call.”\n\nAnheuser-Busch didn’t respond to a request for comment. The partnership with Nikola will help the brewer transition its entire long-haul fleet to zero-emission vehicles, Anheuser-Busch said last November.\n\nPrototype Production\n\nOn July 13, Milton said European partner Iveco was already producing vehicle prototypes.\n\n“We have a truck coming in to production right now with 720KwH, the largest battery we know of anywhere in the world coming in to production,” Milton said on the TC’s Charcast Podcast. “We have five of them coming off the assembly line right now in Ulm, Germany.”\n\nOn Aug. 4, during the company’s debut earnings call, Russell echoed the sentiment, saying that the first five prototypes were “coming off the end of the facility at this point.”\n\nThose statements were a mischaracterization of Nikola and Iveco’s progress in Ulm, according to two people familiar with the matter. The assembly line is still under construction and not yet operational or building prototypes, the people said. There are prototypes being built by hand in a workshop, one of the people said.\n\n“As stated previously, the first five production prototypes of the Nikola Tre are being completed, by an assembly team at the Ulm facility. Also as stated previously, the Nikola/IVECO JV mass production line facility in Ulm is still under construction, and is on track for the start of regular serial production in 2021,” Russell said Friday. “We anticipate that a number of current IVECO personnel will join the Nikola/IVECO JV production team in Ulm.”\n\nNikola’s Guidance\n\nHere’s when Nikola has said it will hit its big milestones, based on filings, statements and interviews: [ ]\n\nhttps://www.bnnbloomberg.ca/nikola-s-history-of-discrepancies-has-been-hiding-in-plain-sight-1.1492855",
        "subreddit": "investing",
        "title": "Bloomberg: Nikola’s History of Discrepancies Has Been Hiding in Plain Sight",
        "url": "https://www.reddit.com/r/investing/comments/irhabh/bloomberg_nikolas_history_of_discrepancies_has/",
        "created": 1599962166.0
    },
    {
        "author": "SnorkelHouse",
        "created_utc": 1601143051,
        "id": "j0alty",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "I like DCA'ing. I know some people dont. Ive seen research on both sides\n\n&amp;#x200B;\n\nFor those who do prefer to DCA, what is the best way to set intervals into the market. Is the delta in time more important or the drop in the market? I don't have a set method so I have tried to make my own but I also am a noob so I dont know. \n\nMy personal is 5% of  cash ( I want to invest) per month. Any time I see the desired index fund drop by more than 5% in a weeks time I 2X the amount for the month. \n\nAs recently weve seen in the sp500 at a 10% drop I did 4x. \n\n&amp;#x200B;\n\nAny suggestions on how to set up intervals/ a system?",
        "subreddit": "investing",
        "title": "How do you set up a cadence/ method for DCA'ing into an index fund?",
        "url": "https://www.reddit.com/r/investing/comments/j0alty/how_do_you_set_up_a_cadence_method_for_dcaing/",
        "created": 1601171851.0
    },
    {
        "author": "champybaby",
        "created_utc": 1601499608,
        "id": "j2um88",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "Wall Street likes to snooze on tech companies they don't understand. Cloudflare ($NET) is one of them. \n\n**Here is what's not to like about the company:**   \nIt currently trades 25x its revenue.  In Q2, $NET  reported a quarterly revenue of $99m and a net profit of  -$25m (negative). The company's market cap is about $11b. Publicly traded rivals include Fastly and Zscaler, both of which are much larger and currently much more successful. \n\n**So what does Cloudfare do?**   \nGenerally speaking, NET makes websites really fast and really secure. Backers of this company include  Google and Microsoft. Both of these companies also use its services. \n\nI'm sure most of you have heard about DDoS attacks. Well, Cloudflare is really busy trying to stop them: It said earlier this year that it blocks 72b DDoS attacks *each day.* It also provides what's called a \"content distribution network,\" or CDN. CDN's help negate websites from bottle necking. CDNs can also improve the overall user experience by making everything faster. \n\nThe company provides both free and paid services. It also has a \"pay as you go\" model, but that's there mostly to convert them into its SaaS offering, where it captures 95% of its revenue. The free service mostly exists because it fuels the company's product, \"Network Flywheel;\" the more people who use Cloudflare, the more effective its services are. They do a lot of other things, and pretty much own the whole stack, but for those who want to explore further, and get more specifics, [I suggest reading this.](https://blog.cloudflare.com/why-we-raised-110m-from-fidelity-google-microsoft-baidu-and-qualcomm/) \n\n**So what's its current state?**   \nThe company currently provides services to 25m websites — a number that will continue to grow as many businesses are forced to go through so-called \"digital transformations\" as a result of the Covid-19 pandemic. \n\n**In the company's most recent earnings, Matthew Prince, CEO, said:** \"*We had a very strong quarter. Our Q2 revenue came in just shy of $100  million, up 48% year-over-year. We saw strength from our customers of  all sizes. We grew our large customer accounts, those paying us more  than $100,000 annually by 65% year-over-year. We also added nearly 7,000  new paying customers, bringing our total paying customer count to over  90,000. At the same time, we saw strong growth across our existing  customer base as they adopted more features of the Cloudflare platform.\"*\n\nPrince added that the effects of the pandemic have served as a boon to its business. And the company raised both its Q3 and annual guidance (though it's known to lowball its guidance). In 2019, $NET grew at a rate of about 50% each quarter. \n\nThey have been busy hiring new employees to meet demand; an unscientific check on LinkedIn reveals it currently has 257 openings. It also has a $50 price target from a lot of analysts. \n\n**What's next:**   \nAs we head into winter, more businesses will look to sell their goods, service, online as people bunker in to avoid catching the coronavirus. This change in consumer behavior will further accelerate its business. It's something I think Wall Street is snoozing on, especially with headlines that suggest you're twice as likely to die from COVID if you have the flu. \n\nAlso, unlike rivals such as Zscalar, Cloudflare is *significantly* easier to use for small to medium sized businesses (these aren't your mom and pop stores on Main Street; think businesses that generate $10m+ in revenue). \n\nImportantly, many people have experienced Spotify, Shopify, Reddit, Discord, Amazon, etc going down. And the headlines often suggest that it was a result of an outage or something by Cloudflare. [This recent headline from TechCrunch](https://techcrunch.com/2020/07/17/cloudflare-dns-goes-down-taking-a-large-piece-of-the-internet-with-it/), for instance, reads: \"*Cloudflare DNS goes down, taking a large piece of the internet with it\"*\n\nBut think about it ... so much of the internet relies on Cloudflare that when it experiences an issue, much of the internet is shut down as a result. That's pretty insane. \n\n**TLDR:** Buy Cloudflare.",
        "subreddit": "wallstreetbets",
        "title": "Here's why you should buy Cloudflare",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j2um88/heres_why_you_should_buy_cloudflare/",
        "created": 1601528408.0
    },
    {
        "author": "SanitysLastRefuge",
        "created_utc": 1601471809,
        "id": "j2lwuq",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "The saga of one of the most hated but undiscovered growth stories continues with the stock approaching all time highs. \n\nA few weeks back I posted this article as well as supporting investment research showing how my estimated results for Q3 2020 justified a share price of $26-$30 assuming that Purple got no credit for its above market growth, margins, and multi-channel positioning. Since then, the stock has increased from $18 to $24 DESPITE a sale of shares by the retired founders. Those who bought in at that level were rewarded with 30%+ gains in a short period of time with another near term 20%+ upside as earnings come into focus. \n\nPost a few weeks ago: [https://www.reddit.com/r/investing/comments/inqaip/purple\\_innovation\\_prpl\\_analysis\\_on\\_q2\\_results/](https://www.reddit.com/r/investing/comments/inqaip/purple_innovation_prpl_analysis_on_q2_results/)\n\nResearch I published on Q3 estimated results justifying upside: [https://www.scribd.com/document/475027501/Purple-Innovation-Research-9-6-20](https://www.scribd.com/document/475027501/Purple-Innovation-Research-9-6-20)\n\nSince then, Purple's e-commerce momentum continues, as pointed out by Wedbush in a research note (don't just take it from me, but also those on the Street following the company):\n\nWedbush Research note - 9/28\n\n Purple Innovation (PRPL) Still in the Early Innings as Brand Momentum and Capacity Accelerate \n\n PRPL is becoming a leading mattress brand, driven by its highly differentiated and patent-protected hyper-elastic polymer grid technology. The company’s brand appears to be “going viral” if a recent 150% spike in Google search volume is any indication. This would not be the first viral activity for PRPL following pioneering YouTube video advertisements a few years ago, but it represents an inflection to a formidable industry competitor. Indeed, our capacity analysis indicates that PRPL could have $1.3b in annualized revenue production exiting 2021, which would make it a top 6 brand. While it is too early to call PRPL’s technology the next memory foam, which Tempur-Pedic (TPX, OUTPERFORM) developed and marketed to revolutionize the industry in the 1990s, it is gaining strong consumer acceptance and is growing much faster than Tempur-Pedic did. Moreover, the only consumer mattress licensee of the product, Intellibed, is looking for ways to further commercialize the technology by launching a line of gel matrix private label products at the leading retail mattress chain, Mattress Firm. As we detail inside, we see limited threat to PRPL from these products and given patent and trademark protections, as well as manufacturing complexities that create much higher costs for licensed gel matrix large layer producers, we see limited threats from future mattress products. Near-term, we remain comfortable with our above-consensus $180m 3Q20 revenue estimate, limited only by labor constraints in plants, lingering shipping delays, and a desire to adequately supply wholesale accounts to maintain relationships. Strong demand and a premium brand support limited promotions and price increases, which should help drive underlying (ex-growth investments) margin strength in 3Q20 and beyond. Finally, after InnoHold liquidated the last of its 13.6m (25%) share ownership in the secondary offering completed September 14, institutional ownership has likewise increased and an important overhang on shares has been removed. Accordingly, we increase our target price to $30 (from $27) and we reiterate our OUTPERFORM rating on shares of PRPL. \n\n Purple “going viral”? Google search volumes for Purple spiked during the weeks ending September 13 and September 20, to levels more than 150% y/y. While search volumes for all publicly traded mattress brands increased in the first week in September (likely due to the disruption from Hurricane Dorian during Labor Day of 2019) the trend continued to accelerate further as the month has continued only for PRPL. There has been no discernable shift in the company’s marketing campaign this month that we can identify through the website, social media, or youtube video uploads that would point to a specific driver of such an inflection. In fact, promotional cadence has been limited and price increases appear to have met no resistance, as we believe PRPL continues to have material order backlogs. We view this trend positively for the brand. \n\n Manufacturing capacity, utilization and mix estimate drives $180m 3Q revenue estimate. We remind investors that PRPL’s 7 th Mattress Max machine came online in June and has been fully operational throughout 3Q20. We estimate that each Mattress Max machine can produce \\~70k units annually, or \\~17.5k/quarter (the original Mattress Max machine is excluded from this, as it was built differently and exhibits a lower, estimated \\~50k annual yield, or 12.5k/quarter). With all 7 machines operating at 90% capacity this would equate to 420k annual units, or \\~105k/quarter. At an $2,000 average realized retail price and a 70%/30% mix between retail and wholesale (with retail realizing the average realized retail price in revenue per unit, and a wholesale unit generating half that) PRPL could generate $182m in mattress revenue in 3Q20, or $200m including non-mattress revenue, slightly above our $180m total revenue estimate; as capacity utilization may have been below 90% in 3Q20 due to labor constraints (leading to continued elevated order backlogs for both DTC and Wholesale), we are comfortable with our estimate (vs. consensus $173m), but see more upside than downside risk due to mix. PRPL is favoring DTC sales but is being sure to provide meaningful allocations to wholesale partners to maintain the relationships. Manufacturing capacity to grow sharply going forward; $1.3b annualized revenue potential exiting 2021. We take into account the company’s announced plan for adding an 8 th Mattress Max machine to be fully operational in 2H20, as well as the plan to add four more machines through 2021 while decommissioning the first Mattress Max machine, to forecast annualized unit capacity expansion of +55% y/y by the end of 2021. At a 70% DTC/30% Wholesale revenue split and 100% capacity utilization this equates to a potential $104m in revenue potential per machine or $1.3b in potential annualized revenue for mattresses by the end of next year, or $1.2b with a split of 60% DTC/40% Wholesale. (Reducing capacity utilization to 90%, the company’s target, and adding \\~10% revenue contribution from non-mattress products yields a similar total revenue potential estimate). Assuming demand continues to outpace supply, which is possible based on the sharply growing acceptance of the technology’s high benefits vs. costs, this level of annualized revenue is  not out of the question. This compares to our revenue estimate of $780m and consensus’ $790m estimate in 2021.",
        "subreddit": "investing",
        "title": "Purple Innovation (PRPL) Update: Price Momentum Continues Since My Last Post; Analysts Updating Price Targets to $30+ on Accelerating Viral Online Growth",
        "url": "https://www.reddit.com/r/investing/comments/j2lwuq/purple_innovation_prpl_update_price_momentum/",
        "created": 1601500609.0
    },
    {
        "author": "SanitysLastRefuge",
        "created_utc": 1601472711,
        "id": "j2m5s7",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "The saga of one of the most hated but undiscovered growth stories continues with the stock approaching all time highs.\n\nA few weeks back I posted this article as well as supporting investment research showing how my estimated results for Q3 2020 justified a share price of $26-$30 assuming that Purple got no credit for its above market growth, margins, and multi-channel positioning. Since then, the stock has increased from $18 to $24 DESPITE a sale of shares by the retired founders. Those who bought in at that level were rewarded with 30%+ gains in a short period of time with another near term 20%+ upside as earnings come into focus.\n\nPost a few weeks ago: [https://www.reddit.com/r/stocks/comments/inqkxc/purple\\_innovation\\_prpl\\_analysis\\_on\\_q2\\_results/](https://www.reddit.com/r/stocks/comments/inqkxc/purple_innovation_prpl_analysis_on_q2_results/)\n\nResearch I published on Q3 estimated results justifying upside: [https://www.scribd.com/document/475027501/Purple-Innovation-Research-9-6-20](https://www.scribd.com/document/475027501/Purple-Innovation-Research-9-6-20)\n\nSince then, Purple's e-commerce momentum continues, as pointed out by Wedbush in a research note (don't just take it from me, but also those on the Street following the company):\n\nWedbush Research note - 9/28\n\nPurple Innovation (PRPL) Still in the Early Innings as Brand Momentum and Capacity Accelerate\n\nPRPL is becoming a leading mattress brand, driven by its highly differentiated and patent-protected hyper-elastic polymer grid technology. The company’s brand appears to be “going viral” if a recent 150% spike in Google search volume is any indication. This would not be the first viral activity for PRPL following pioneering YouTube video advertisements a few years ago, but it represents an inflection to a formidable industry competitor. Indeed, our capacity analysis indicates that PRPL could have $1.3b in annualized revenue production exiting 2021, which would make it a top 6 brand. While it is too early to call PRPL’s technology the next memory foam, which Tempur-Pedic (TPX, OUTPERFORM) developed and marketed to revolutionize the industry in the 1990s, it is gaining strong consumer acceptance and is growing much faster than Tempur-Pedic did. Moreover, the only consumer mattress licensee of the product, Intellibed, is looking for ways to further commercialize the technology by launching a line of gel matrix private label products at the leading retail mattress chain, Mattress Firm. As we detail inside, we see limited threat to PRPL from these products and given patent and trademark protections, as well as manufacturing complexities that create much higher costs for licensed gel matrix large layer producers, we see limited threats from future mattress products. Near-term, we remain comfortable with our above-consensus $180m 3Q20 revenue estimate, limited only by labor constraints in plants, lingering shipping delays, and a desire to adequately supply wholesale accounts to maintain relationships. Strong demand and a premium brand support limited promotions and price increases, which should help drive underlying (ex-growth investments) margin strength in 3Q20 and beyond. Finally, after InnoHold liquidated the last of its 13.6m (25%) share ownership in the secondary offering completed September 14, institutional ownership has likewise increased and an important overhang on shares has been removed. Accordingly, we increase our target price to $30 (from $27) and we reiterate our OUTPERFORM rating on shares of PRPL.\n\nPurple “going viral”? Google search volumes for Purple spiked during the weeks ending September 13 and September 20, to levels more than 150% y/y. While search volumes for all publicly traded mattress brands increased in the first week in September (likely due to the disruption from Hurricane Dorian during Labor Day of 2019) the trend continued to accelerate further as the month has continued only for PRPL. There has been no discernable shift in the company’s marketing campaign this month that we can identify through the website, social media, or youtube video uploads that would point to a specific driver of such an inflection. In fact, promotional cadence has been limited and price increases appear to have met no resistance, as we believe PRPL continues to have material order backlogs. We view this trend positively for the brand.\n\nManufacturing capacity, utilization and mix estimate drives $180m 3Q revenue estimate. We remind investors that PRPL’s 7 th Mattress Max machine came online in June and has been fully operational throughout 3Q20. We estimate that each Mattress Max machine can produce \\~70k units annually, or \\~17.5k/quarter (the original Mattress Max machine is excluded from this, as it was built differently and exhibits a lower, estimated \\~50k annual yield, or 12.5k/quarter). With all 7 machines operating at 90% capacity this would equate to 420k annual units, or \\~105k/quarter. At an $2,000 average realized retail price and a 70%/30% mix between retail and wholesale (with retail realizing the average realized retail price in revenue per unit, and a wholesale unit generating half that) PRPL could generate $182m in mattress revenue in 3Q20, or $200m including non-mattress revenue, slightly above our $180m total revenue estimate; as capacity utilization may have been below 90% in 3Q20 due to labor constraints (leading to continued elevated order backlogs for both DTC and Wholesale), we are comfortable with our estimate (vs. consensus $173m), but see more upside than downside risk due to mix. PRPL is favoring DTC sales but is being sure to provide meaningful allocations to wholesale partners to maintain the relationships. Manufacturing capacity to grow sharply going forward; $1.3b annualized revenue potential exiting 2021. We take into account the company’s announced plan for adding an 8 th Mattress Max machine to be fully operational in 2H20, as well as the plan to add four more machines through 2021 while decommissioning the first Mattress Max machine, to forecast annualized unit capacity expansion of +55% y/y by the end of 2021. At a 70% DTC/30% Wholesale revenue split and 100% capacity utilization this equates to a potential $104m in revenue potential per machine or $1.3b in potential annualized revenue for mattresses by the end of next year, or $1.2b with a split of 60% DTC/40% Wholesale. (Reducing capacity utilization to 90%, the company’s target, and adding \\~10% revenue contribution from non-mattress products yields a similar total revenue potential estimate). Assuming demand continues to outpace supply, which is possible based on the sharply growing acceptance of the technology’s high benefits vs. costs, this level of annualized revenue is not out of the question. This compares to our revenue estimate of $780m and consensus’ $790m estimate in 2021.",
        "subreddit": "stocks",
        "title": "Purple Innovation (PRPL) Update: Price Momentum Continues Since My Last Post; Analysts Updating Price Targets to $30+ on Accelerating Viral Online Growth",
        "url": "https://www.reddit.com/r/stocks/comments/j2m5s7/purple_innovation_prpl_update_price_momentum/",
        "created": 1601501511.0
    },
    {
        "author": "radarbot",
        "created_utc": 1600709063,
        "id": "ix4v9g",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "LLNW is up 20% since its bottom on September 9. It got hit just like FSLY and NET during the big sell off in early September. Since then, its bounced back 20% from a low of $5 back up to the $6 range. This stock is highly volatile, moving between gains of 80% to losses of 40% in the past 3 months. Its volatility seems tied to macro factors affecting perceived continued work-from-home.\n\nThe investor presentation for Q3 are here: https://s24.q4cdn.com/772370104/files/doc_presentations/Limelight_Networks_Investor_Presentation_Analyst_Day_July2020.pdf\n\nThe important things I was able to glean from this is their current mktcap and perceived growth. Their current mktcap is around $700M with a stock price of $6. They look like they have a really solid floor at $5, but a ceiling at $7-ish.\n\nTheir Q3 numbers weren't particularly spectacular: https://s24.q4cdn.com/772370104/files/doc_financials/2020/q2/Q2-2020-Financial-Schedule.pdf\n\nWhat does stand out is their gross profit is around 40%. Which seems low compared to other CDNs. For example, Cloudflare's gross margin is 77%: https://www.businesswire.com/news/home/20200507005955/en/Cloudflare-Announces-First-Quarter-2020-Financial-Results\n\nI've seen posts on /r/stocks saying that LLNW is undervalued. And the graph that LLNW posts on their investor relations deck (data from 2019) has then low in revenue multiple per growth category. Which is good because they haven't run up yet comparatively.\n\nAgain, their revenue target for the year is about $232M, compared to $200M for all of 2019. Thats about a growth rate of 15%. But given their market cap is only $700M, thats a revenue to market cap multiplier of only ~3.02.\n\nI know its not apples to apples since Fastly is more of a hosting specialization company focusing on ease of use, but FSLY has revenue projections of $260M for 2020 (I got this number by taking their Q2 results and doubling it: https://investors.fastly.com/files/doc_financials/2020/q2/2Q20-Shareholder-Letter.pdf) and is trading at market cap of 9.5B. The big difference is that FSLY operates are revenue margins of 58%. FSLY is also seeing growth of 50% YoY.\n\nSo LLNW definitely has headwinds in this market. They have lower gross margin and lower growth rates compared to the other hype company in this market.\n\nDoes anyone have insight into whether LLNW is a worthwhile investment that can overcome these two factors that seem to govern stock price of these cloud hosting companies?",
        "subreddit": "stocks",
        "title": "LLNW growth rate and gross profit projections, and benefits from 2nd COVID wave bump",
        "url": "https://www.reddit.com/r/stocks/comments/ix4v9g/llnw_growth_rate_and_gross_profit_projections_and/",
        "created": 1600737863.0
    }
]