[
    {
        "author": "cooleddy89",
        "created_utc": 1604275407,
        "id": "jmd2g9",
        "num_comments": 48,
        "num_crossposts": 0,
        "selftext": "Obligatory disclaimer: “predicting is very difficult, especially if it’s about the future”, and I’ve been very wrong before (most recently about the market rebound). But it’s fun to have a discussion and what else is there to do now that it’s cold with a COVID surge?  \n&amp;nbsp;\n\nFull disclosure: Despite my arguments below, I hold modest positions in several of the apartment rental REITs. One reason is simply to hedge against me being wrong. I also think there’s a gap between the eventual modest decline in valuations and the 40-50% decline we’ve seen in luxury coastal apartment REITs (Essex, Avalon, Equity). The public REITs have investment grade credit rating, and several of them (Equity, Avalon) have recently issued debt at ~2% due to the accommodative corporate credit environment. Many also have suburban portfolios which could prosper from the urban departures. \n\n&amp;nbsp;\n\n# Intro \n\nThere’s been a great deal of hysteria in the popular press / investment forums about “the death of cities”. \n\nThis is clearly ridiculous. “Cities” are the engines of economic growth in every developed economy. The 100 largest metropolitan areas contain 65% of the US population and 68% of total economic activity (and closer to 75+% of patents, intellectual property development, etc). Cities as a whole will continue to grow and expand in the United States as they have for the past 200 years. \n\nOn the flip side, not all cities are created equally. I think a very reasonable question to ask is how will the multifamily real estate markets in very high cost of living cities (VCOL), loosely defined as San Francisco, NYC, Boston, and maybe LA fare in the near future? \n\nI’m personally a big believer that external shocks very rarely generate new trends but tend to accelerate existing underlying ones. And when looking at the future of VCOL areas we have a story about demographics, affordability, schools / child care, job dispersion, supply, and immigration. \n\n&amp;nbsp;\n\n# Thesis \n\nMy thesis is that VCOL, and in particular the dense urban cores, will see flat to negative growth in populations, rent, and condo prices as Millennials age into child-rearing years and move to areas with more affordable housing / better schools. Older generations will continue their preference for warmer, lower tax areas while foreign immigration remains depressed. This trend will be compounded by the increase in luxury rental units as projects initiated in 2018, 2019, and early 2020 move onto the market. More flexible work from home policies will also contribute modestly to this trend, but is not the main driver. Single family housing, even in VCOL areas, will likely be unaffected due to severe supply constraints. \n\n&amp;nbsp;\n\nI see Millennials primarily moving to 3 distinct areas of the country:\n\n- Cheaper areas outside the urban core in Metropolitan Statistical Area (MSA), e.g. Worcester MA in the larger Boston metro area, suburban areas in NJ adjacent to NYC, etc. \n- Smaller, emerging high-tech cities such as Pittsburgh, Boise, etc. that offer relatively affordable housing, walkable communities, and often close proximity to national parks, ski areas, etc. \n- Sunbelt / Southern “mega-cities’ such as Phoenix, Austin, Atlanta, etc. with affordable housing and booming populations \n\n# What do the public markets say?\n\nOne of the features (not a bug) of private real estate is that it moves much more slowly and is oftentimes uncorrelated with public markets. Case in point, residential housing prices peaked in the US around 2006-2007 and then decreased until 2012 (i.e. 3-4 years after the stock market and other public markets fully reflected the valuation shifts). Luckily for today’s investors, one major difference between 2008 and today is that we have large, national, publicly traded REITs in both the apartment and single family rental sectors. Even better, the apartment housing REITs have different geographic concentrations and economic consumers (i.e. luxury, affordable, student, etc.). We also have large, publicly traded companies involved in single family home building / renovations that are also great proxies for the single family housing market. \n\n&amp;nbsp;\n\nSo, how are apartment rental REITs in VCOL locations doing? The first one to consider is Essex Property Trust (ESS), a member of the S&amp;P 500. They have luxury apartments primarily in LA &amp; San Francisco (~75%) and also in Seattle (~25%). They are down ~40% from their all time high in February. Next up is Avalon Bay (AVB), the largest apartment REIT, which owns luxury apartments in VCOL coastal areas in Boston, NYC, SF, etc. They are down ~40% from their all time high. Equity Apartments, similar to AvalonBay but with a slightly worse credit rating of BBB+, is down ~50%. UDR, another coastal luxury apartment REIT, is also down ~40%. If you read the most recent earnings calls from Equity / Avalon, one thing they both cite is their high rental collection rate (~98%) and the high household income of their tenants (~$150,000). \n\n&amp;nbsp;\n\nLet’s contrast that to the sunbelt / mid Atlantic luxury REITs: Camden Property (CPT) and Mid America Apartments (MAA). These REITs have extensive holdings in Texas, Florida, Phoenix, etc. Mid America is down ~22% while Camden is down ~25%. \n\n&amp;nbsp;\n\nThe market is currently discounting luxury apartment rentals in VCOL by almost 2x the rate as more affordable sunbelt / Southern cities. This is despite the fact that rental collection rates remain high and that these properties have affluent tenants who are least likely to be affected by the recession. \n\n&amp;nbsp;\n\nThe contrast is even more stark when comparing against single family rental REITs, the largest of which is Invitation Homes (a spinoff of Blackstone, INVH). They own ~90,000 homes across the Sunbelt, upper mid-west, and more affordable areas of the West. They are down only 9% off of all time highs. The US home construction ETF from I-shares (ITB) which tracks home developers such as Lennox and home supply stores like Lowes actually set an all time high in September 2020. \n\n&amp;nbsp;\n\nThe bottom line is that public markets suggest that luxury, apartment rental housing companies have lost 20-50% of their pre-pandemic value, with VCOL losing almost twice the value of luxury rentals in booming sunbelt / southern cities. In contrast, single family home rentals remain extremely strong with valuations of home building companies trading at all time highs. \n\nAs an aside, if you’re bullish on VCOL areas I would strongly suggest purchasing these REITs. The dividend yields are ~4.5% which is the widest spread over 10 year treasuries (0.8%) in many years. If you listen to the earnings call from Equity, Avalon, etc. you’ll also hear the CEOs cite the high private market valuations of their properties. If the market is wrong you’ll lock in relatively high dividend rates with price appreciation. \n\n\n# Demographics \n\nEven before the pandemic, VCOL had stagnant or modestly declining populations. Government census records estimate that NYC lost ~76,000 residents in 2019, a drop of around 0.4%. It’s worth noting that NYC  has for years experienced net negative domestic migration, but foreign immigration balanced out the departures. The Boston metro region stayed flat while San Francisco declined slightly (~0.2%). While economically vibrant, the populations of these cities had clearly started to plateau and even modestly decline prior to the pandemic. There’s a nice graph at rent cafe that summarizes the metros with the highest and lowest net migration over the past decade. NYC and LA top the list, with Boston at the number 8 position. In contrast, the metros with the highest migration are Phoenix, Dallas, and Austin in the Top 5.  \t\n\n&amp;nbsp;\n\nIf we look at the composition of these cities, the largest age bracket is from 25-44: 37.5% in San Francisco, 33.2% in Boston, and 33% NYC. This essentially encompasses the millennial generation, who the census defines are born between 1981 - 1997 (~23 to 39). The millennial cohort comprises ~75 million individuals and is the largest generation since the baby boomers and significantly larger than the next generation, Gen-Z. \n\n&amp;nbsp;\n\nThe millennial cohort entered their mid-20s during and immediately after the Great Recession. Millennials with technical or advanced degrees flocked to the new “knowledge” jobs in tech, consulting, marketing, etc. at employers clustered in VCOL areas. With significant disposable income, these millennials fueled a rise in service industries that attracted other millennials to work as baristas, waiters, etc. At the same time, new single family home construction declined significantly due to the fallout from the housing bust. \n\n&amp;nbsp;\n\nAs a consequence rents held relatively steady during the financial crisis than surged during the recovery. As one data point, rents increased ~50%+ from 2010 to 2019 in SF. As Millennials willingly paid rapidly rising rents in these VCOL, a narrative emerged that millennial were somehow different. They were comfortable renting forever, they didn’t need much space, they believed in the sharing economy and wouldn’t purchase cars, etc. The data appeared to support this data, as the number of renters earning $150,000 increased at twice the rate as home owners.  \n\n&amp;nbsp;\n\nUnfortunately there is increasing evidence against this narrative. A linked MIT Sloan study suggests millennials may actually utilize vehicles more than older generations. The linked survey from ApartmentList suggests that over 90% of millennials want to own homes eventually. Millennials, based on all the studies and surveys I’ve seen, have similar aspirations as older generations. They want to eventually own, not rent, a residence and personal vehicle while raising children. All of these goals have simply been delayed due to financial constraints. \n\nAs we’ll see in the next section, these aspirations are effectively impossible for the vast majority of millennials in VCOL areas. \n\n# Affordability:\n\nThere’s a popular stereotype that the average millennial is a 4 year college graduate, making $100,000+ in tech, who walks around in Patagonia vests sipping $5 lattes (fuller disclosure: this stereotype hits uncomfortable close to home). According to the Government Accountability Office (GAO) only 44% of millennials even have 4 year or higher college degrees. Moreover, at age 39 (i.e. the oldest millennial), an income of $100,000 is in the top ~25% of incomes. The median net worth of the prime home buying aged millennial (30-34) is only $35,000 (including home equity), while the 90th percentile of this group is only ~$260,000 (including home equity). In 1989 (when baby boomers were the equivalent age of Millennials today) they held about 21% of the wealth in the US. In contrast, Millennials today have ~3%. \n\n&amp;nbsp;\n\nFor the median millennia household, who has an income of ~$69,000 pre-pandemic, buying even a modest apartment in a VCOL is difficult to impossible without extensive family assistance. Let’s assume that most millennial households want to have at least 1 child (a Gallup poll found ~87% of millennials without children eventually wanted to have them). That means long term millennials are likely to settle in at least 2BR and more likely 3 BR and up apartments / homes. \n\n&amp;nbsp;\n\nThe median priced condo (not house) in VCOL areas (pre-pandemic) is approximately  ~$1.2 million in SF,  ~$650,000 in Boston, and ~$667,900 in NYC (Manhattan, Brooklyn, and Queens). This understates the lack of affordability, because these prices reflect a mixture of studios to 3+ BRs. I couldn’t find detailed sales pricing for condos segmented by number of bedrooms, but glancing at Zillow / Redfin the prices for 3BR apartments or single family homes across all VCOL areas seems to be at least $800k and above depending on quality, location, etc. \n\n&amp;nbsp;\n\nRents are luckily far more transparent. According to Zumper, the rents for 3BR apartments and above in VCOL (pre-pandemic) areas were ~$5,000 in SF, ~$3,500 in Boston, and ~$4,000 in NYC.  As an aside, if we use a 30% rent to income ratio than a millennial household would have to make at least $10,500 per month (or an annualized salary of $126,000) to rent a 3 BR in the cheapest VCOL area. For households with families in 2017 between 30-35, an income of $126,000 is at the 80th percentile. As we’ll see in the next section, childcare dramatically adds to a households costs. \n\n&amp;nbsp;\n\nSo let’s focus our analysis on the wealthiest 10% of millennials (who coincidentally are also most likely to have affluent parents who can assist with a home down payment). These millennials, particularly those in the prime family formation years of 30-35, make over $170,000+. Given the well documented trend in associative mating, they are also likely to partner with other high income millennials. Let’s assume that ~5% of millennial households make  &gt;$200,000 per year (for comparison, the top 10% of all households made over $200,000 in 2019). These households can easily afford even San Francisco rental prices. And at first glance, a millennial household making $200,000 could save for a downpayment of a $1 million dollar home (~$240,000) within ~6 years if they saved 20% of their gross income. But what about affording the monthly mortgage payment? \n\n&amp;nbsp;\n\nAs rough numbers, a household making $200,000 in Boston, MA would be left with $148,712 after taxes. If they maxed out their 401k, they would have $121,135 or ~$10,000 per month. Redfin estimates that a $1 million home in Boston will cost ~$4500 a month based on a 3%, 30 year mortgage and including home insurance + property taxes. If we assume maintenance + furnishings + misc expenses we can probably assume a total housing cost of ~$5500 per month. Our hypothetical household is thus left with ~$4500 per month to spend on food, entertainment, vehicles costs, etc. while also maxing our their 401k. \n\nLet’s assume there are roughly 31 million households between 25-39, so back of the envelope math suggests that there is a pool of 1.5 million households available to buy real estate in VCOL areas (5% of 31 million) if they could afford the down payment or receive family assistance. \n\nThere is one giant impediment to that math though: affordable childcare and public schools. \n\n# Child Care\n\nThe biggest single reason in my opinion that millennials will leave VCOL urban areas is the the cost of childcare (averaging $2000 per month)  and the persistent poor performance of public schools.  \n\n&amp;nbsp;\n\nThe premier public school districts continue to remain in the outer suburbs of urban areas. A list of the top 15 public school districts in America shows numerous school districts in suburbs surrounding Chicago, NYC, San Francisco, Boston, and Philadelphia. In contrast, public school districts in dense urban areas often receive mediocre ratings. \n\nThe simplest alternative to these urban public schools is to pay for private school. Private school tuitions in VCOL areas range widely between ~$25k and ~$70k per child. These means a family of 4 could easily pay $50k or more in combined tuition, on top of the $66k ($5500 monthly) in housing expenses noted above. These two expenses alone would effectively consume the entire after tax income of a household making $200,000 per year. \n\n&amp;nbsp;\n\nThe crushing expense of childcare shows up in declining birth rates in VCOL. Since 2011, the number of babies born in NYC has declined 9%. San Francisco has the lowest share of children of any of the top 100 metros. Families with children older than 6 are in decline in high density urban areas. (There’s a great Atlantic article from Derek Thompson linked below) \n\n&amp;nbsp;\n\nThe bottom line is that for all but the wealthiest ~5% of millennial households settling down and raising a family in a VCOL area is essentially unaffordable without significant tradeoffs or parental support. Buying a modest home in a VCOL area, sending your children to private school, funding your retirement, and owning a modest vehicle combined requires a household income of close to $300,000. \n\n&amp;nbsp;\n\nBefore the hate mail begins, the key word in the sentence above is trade-offs. I’m well aware the maxing out a joint 401k is puts a household ahead of almost all other American families. Unlike some personal financial columnists, I’m in no way suggesting that earning $300,000 per year is close to poverty or any other nonsense like that. Clearly, earning $300,000 a year as a household is a rare privilege that lets you enjoy a very comfortable lifestyle. \n\nThe point I’m making is that in a VCOL a $300,000 salary does not make you feel affluent. You’re still likely stressed about money, still having to save for years to afford a down payment, driving a modest vehicle, etc. Meanwhile, any of your friends who live in Austin, Denver, etc. are able to enjoy a more stereotypical upper middle class life. Not to mention that your friends who move to Boise, Pittsburgh, etc. likely feel flat out wealthy. \n\n&amp;nbsp;\n\nTaxes are also worth a passing mention. Households making $200,000 in salary, maxing out both partners 401k, pay ~$10k in state / local taxes in VCOL areas (LA, SF, NYC, Boston). It’s worth noting that RSUs, i.e. the bulk of employees compensation at Big Tech firms, are taxed as regular income. Texas, Florida, Nevada, Washington, and New Hampshire all have no income taxes and most have booming metropolitan areas. The recent tax law changes passed by President Trump have also compounded the situation by increasing the standard deduction to $24,000 for married couples and capping the state and local tax deduction to $10k. \n\n# Job Dispersion:\n\nAs I mentioned above, the VCOL areas had stagnating or modestly declining populations even in 2019. In stark contrast, the sunbelt &amp; Southern cities are booming. Austin, TX experienced a 2.8% population increase in 2019. Denver, CO experienced a 1.5% population increase. Boise, Idaho was the fastest growing city in the US over the past decade. Even Orlando, FL is growing at over 1% a year. \n\n&amp;nbsp;\n\nAnd employers are more than happy to open offices in lower cost, “business friendly” locations. Palantir announced its intention to shift to Denver, CO. Tesla plans to open up its Gigafactory near downtown Austin. Startup funding in Austin continues to rise (albeit from low levels).  \n\nEven well established Silicon Valley offices have rapidly growing satellite offices in Austin, Denver, etc.  Facebook has 1200 employees in Austin (compared with ~15,000 in San Francisco). Google has &gt; 1500 employees in Austin as well. Google also employs 1500 employees in Denver / \nBoulder. \n\n&amp;nbsp;\n\nMany of these regions are anchored on world class research universities as well. The University of Texas at Austin has top 10 computer science and engineering programs. Carnegie Mellon in Pittsburgh is a Top 5 computer science school and leader in Artificial Intelligence research.  The University of Minnesota has a top 2 Chemical Engineering program. \n\n&amp;nbsp;\n\nWe unfortunately can’t discuss job dispersion without addressing the vociferous work from home debate. I frankly don’t think the pandemic will significantly impact the work from home trend long term. Many high paying sectors have already moved towards flexible work arrangements. Glancing at McKinsey’s website, we see that many of their positions list 20+ major metros as possible locations, including Atlanta, Chicago, Denver, etc. Snowflake, the hottest company of 2020, lists 237 open positions on their website. Only 86 of those are in listed as San Mateo (their SF Bay Area headquarters), mostly in engineering / internal operations. The reason is obvious: over 125 positions (i.e. 55+%) are in customer facing roles in sales, professional services, etc. Companies want a geographic dispersion of these roles both across the US and internationally. \n\n&amp;nbsp;\n\nIt’s also worth mentioning that “elite” companies, who provide a disproportionate number of the jobs for high income millennials, frankly don’t have that many employees. Alphabet and Facebook combined have only ~200,000 employees despite a market cap of approximately $2 trillion dollars. Bain &amp; McKinsey combined only have ~30,000 employees. JP Morgan chase has 256,941 employees, but only 37,000 (14.4%) are in New York. The largest single office for JP Morgan is actually in Columbus, Ohio and houses 11,050 employees. \n\nWe’re also seeing a bit of a “resource curse” for VCOL cities as the extremely high costs of living / business drive out firms who aren’t as profitable per employee. McKesson, #8 on the S&amp;P 500 list by revenue, moved its HQ from San Francisco to Dallas in 2018. Charles Schwab, is leaving San Francisco while expanding its offices in Denver &amp; Dallas. \n\n&amp;nbsp;\n\nThe bottom line is that the trend was already clear pre-pandemic. The leading companies, who pay the highest salaries, are actively investing in satellite offices or remote positions across the United States. For tech and management consulting companies, this helps distribute their customer facing sales and service teams. For financial and other companies, they are able to lower their costs by moving back-office operations outside VCOL areas. Meanwhile, companies who aren’t able to match the compensation packages of elite firms or want to lower their cost of business are relocating to cheaper areas. \n\nAs a final point, Forbes has an interesting article about the top 15 metro areas ranked by revenue of Fortune 500 companies headquartered there. While the New York metro area dominates the list with 65 companies that earn $1.7 trillion in revenue, and the greater SF / San Jose area is second with ~$1.5 trillion, the next 2 spots are Dallas ($996.2 billion) and Chicago ($842.2). Minneapolis and Houston also are in the top 7 spots, above either Boston or Washington DC. \n\n# Supply:\n\nConcerns about multifamily supply had already started in mid 2019. Years of low interest rates and strong rental price growth had led to dramatic booms in apartment housing. Fannie Mae (the government agency) has detailed insights into the multi-family market across major metros. Helpfully they also include rent growth predictions from 3 large real estate analytics companies.  \n\n&amp;nbsp;\n\nThe Boston, MA core urban area had a projected ~10,000 units in the pipeline for 2020 (estimated at 4-6% new supply).  Rent price increases were estimated at average of 2% and trending downward pre-pandemic.San Francisco had planned delivery of ~5,000 new unites in 2019 and 2020 with a projected increase in vacancy rate of 5% (trending towards balanced). New York City already had a glut of luxury apartments in 2019, with stagnant or negative rent growth projected pre-pandemic. \n\nIt’s worth noting that while single family home construction has continued to lag demand, multi-family home construction rebounded to pre Great Financial Crisis levels by 2013. By 2015, multifamily construction had hit the highest level since 1987. \n\n&amp;nbsp;\n\nWe can see the effect of supply in the fact that average rental prices in several VCOL had started to plateau around late 2018. Boston, MA saw rental price growth of only ~2-3% annually between 2016 and 2019 according to RentCafe. RentCafe also shows San Francisco average rents increasing from $3450 in Nov 2016 to $3683 in Nov 2019, for an annual increase of 2-3% as well. Brooklyn, NY average rents increased from $2603 in Nov 2016 to $2928 in Nov 2019 for a total increase of 12% or ~4% per year. One thing to keep in mind is that these average rents don’t take into account hedonistic adjustments, i.e. people moving into nicer, new luxury apartments and paying slightly more. \n\n# Immigration / Baby Boomers / Gen Z:\n\nWith evidence pointing towards a modest decline in the number of millennials in VCOL areas, could other groups offset their departure? What about foreign immigrants? \n\n&amp;nbsp;\n\nRegardless of your thoughts on the Trump administration, it’s clear the administration has kept its promise to reduce foreign immigration into the United States. In 2018, the New York Times reported that net immigration to the US was only 200,000, the lowest level since the Great Recession. The same article, along with a related article from PBS also notes in particular that Chinese student attendance has dropped significantly due to concerns over visas, geo-political tensions, and violence. The current pandemic and recent trade tensions are likely to only exacerbate the situation. The Department of Homeland Security websites shows that “Persons obtaining lawful residence in the US” dropped by ~150,000 between 2016 and 2019 (or ~10%). This is a problem for VCOL which have relied upon foreign immigration to make up for net domestic migration. Foreign investment has often followed this migration. \n\nAt the moment, there also isn’t an obvious political constituency to argue for increased legal immigration into the US. The Democratic Party’s immigration policy is largely focused on legalizing the Dreamers, i.e. children born to undocumented immigrants. The Republican Party’s immigration policy has largely focused around halting illegal immigration.\n\n&amp;nbsp; \n\nWhat about baby boomers returning to the cities for their golden years? The New York Times cites census data which indicates that 17.8% of 54-72 year olds live in urban areas (defined by density). This compares with 21.6% in 1990. Moreover, while more baby boomers are renting, they seem to prefer to do so in suburban areas. \n\n&amp;nbsp;\n\nWell, what about Gen Z (those born after between 1997- 2012)? First of all, the generation is smaller than millennials by about 5 million individuals. Second, a Pew research study has found that for the oldest Gen Zers (18-23), over 50% have reported that they or someone in their household has lost a job or pay in the recent recession compared to 40% of millennials and only 25% of Baby Boomers. Last, but likely most important, the millennials successfully revitalized and then gentrified large parts of the VCOL urban cores. As a consequence, to borrow a phrase, the rents are already too damn high. Gen Z will enter the workforce already facing sky high rents in VCOL while dealing with a weaker labor market due to the COVID induced recession. \n\n&amp;nbsp;\n\nThe bottom line is that there is no obvious group to replace the millennials if they start exiting core VCOL urban cores in large numbers. \n\n\n# Final Thoughts:\n\nWhew, if you made it this far congratulations! I started writing this as a way to organize my thoughts, then frankly became fascinated in the topic. \n\nIf I were to summarize this article, I would say “demographics is destiny” or “the pandemic accelerates, but does not change, existing trends”.  The 2010s saw the largest generation since the Baby Boomers delay the traditional milestones of adulthood to focus on their careers, education, and finances. Millennials preference for dense, walkable urban areas with deep job markets led to the urban renaissances of VCOL areas and accompanying spike in rents. A boom in multifamily construction followed as real estate developers rushed to deliver luxury rental apartments to cater to this new class of affluent urban dwellers. \n\n&amp;nbsp;\n\nThe 2020s will see VCOL areas deals with the consequences of their success. Most millennials simply cannot afford to raise families in VCOL areas. Even before the pandemic we saw net migration increasing out of VCOL towards the booming Southern / Southwestern areas of the country. Companies are more than willing to follow suit, either by moving directly or by opening satellite officers to take advantage of cheaper real estate and lower taxes. Unfortunately this increase in departures is occurring exactly as multifamily supply continues to increase in VCOL areas due to a multiyear boom in construction. And there is no evidence that I've seen of any other demographic group who will rush to fill the vacancies generated by millennials. Baby boomers continue to prefer warm, low tax, suburban areas. Foreign immigration is depressed and likely to remain so for a variety of factors. Gen Z, with ~5 million fewer members than the millennials,  is graduating into a depressed labor market with rents already inflated far past what the median salary can afford. \n\n&amp;nbsp;\n\nI want to emphasize that this is a modest shift in population, not a panicked flight. A number of affluent millennials will continue to reside in VCOL areas and even purchase long term residences (particularly with parental aid). Millennials who were able to buy in 2012-2014 have enjoyed significant real estate appreciation and are also likely to remain in those areas. But these modest population decreases will lead to a flat to negative rent price growth in VCOL areas as the market struggles to absorb additional luxury supply. \n\n&amp;nbsp;\n\nUnfortunately, as has been a recurring theme during this pandemic, the pain will be felt most acutely by small-scale landlords who bought properties recently in VCOL areas. Residential Real Estate is in some ways a zero sum game in that each tenant can usually only occupy one unit at a time. The large, publicly traded coastal REITs are currently tapping the corporate credit markets to push out their existing debt maturities and raise additional capital at historically low rates. They can, and are, offering deep concessions for their luxury units to attract tenants. They also typically have diversified into suburban areas and can invest opportunistically into high growth areas (notably Denver). They also have historically attracted the more affluent tenants who are willing to pay a premium for amenities (concierage, gyms, etc.) and are least affected by the pandemic. \n\n&amp;nbsp;\n\nTo end on a positive note, I think the migration of millennials to more affordable, emerging cities is a net positive for the United States. Entrepreneurship, measured by small business formation in the US, has been dropping for years. I think part of the problem is that millennials in VCOL are locked into high paying career paths to afford rent, childcare, etc. Likewise spreading economic growth across the country and revitalizing other areas of the US may help bridge some of the bitter partisan politics.   \n\n&amp;nbsp;\n\nP.S. If I post links in my posts they usually get blocked. I generally used NYT, Fannie Mae, the GAO, RentCafe (part of Yardi), and the Atlantic for my sources. If you're curious about a particular source I'll post it",
        "subreddit": "investing",
        "title": "Beyond doom and gloom: A nuanced discussion of multifamily rentals / REITs in very high cost of living cities (VCOL)",
        "url": "https://www.reddit.com/r/investing/comments/jmd2g9/beyond_doom_and_gloom_a_nuanced_discussion_of/",
        "created": 1604304207.0
    },
    {
        "author": "drkrab2010",
        "created_utc": 1606517241,
        "id": "k2bgai",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "After researching for weeks I have stumbled upon a cutting edge firm out of the Midwest, awaiting imminent patent approval on a new generation of radar equipment. \n\nTheir sales have ROCKETED in central asia and other south asian countries as their previous radars have proven to br effective and precise.\nTheir sale have risen about 29% following the clash between azerbaijan and Armenia.\n\nTHEY HAVE SIGNED A CONTRACT yesterday with multiple countries such as poland, UK and the people’s republic of China. \n\nSo BUY BUY BUY ATYN🚀🚀🚀🚀🚀🚀🚀🚀",
        "subreddit": "wallstreetbets",
        "title": "AEROTYNE INTERNATIONAL 🚀🚀🚀🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k2bgai/aerotyne_international/",
        "created": 1606546041.0
    }
]