[
    {
        "author": "interrobangbros",
        "created_utc": 1607098450,
        "id": "k6nunn",
        "num_comments": 40,
        "num_crossposts": 0,
        "selftext": "I'm not ok with my limited exposure to cybersecurity at the moment (I currently only own DT) so I'm in the middle of doing my DD on the below 20 companies. Just curious what the r/stocks hive mind is most bullish on.\n\nWorth noting that I know there are ETFs out there but that's not my preference. I prefer to pick stocks or build my own little basket of several companies.\n\n&amp;#x200B;\n\n|CRWD|PING|FTNT|PFPT|\n|:-|:-|:-|:-|\n|SPLK|ZS|TEAM|PANW|\n|NET|QLYS|CACI|NLOK|\n|CHKP|OKTA|CYBR|SAIL|\n|MIME|RPD|FEYE|VMW|",
        "subreddit": "stocks",
        "title": "Which Cybersecurity company are you most bullish on long-term and why?",
        "url": "https://www.reddit.com/r/stocks/comments/k6nunn/which_cybersecurity_company_are_you_most_bullish/",
        "created": 1607127250.0
    },
    {
        "author": "licenselessdriver",
        "created_utc": 1609448905,
        "id": "kny4bx",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "I plan to just handpick a few stocks and blindly buy them monthly on a 10 year horizon.\n\nWould pltr, net, ftnt be a good combination to buy starting from 2nd jan onwards? If it were up to you, which would you add or remove?\n\nI pick them due to their leadership and potential growth",
        "subreddit": "stocks",
        "title": "Controversial picks for 2021",
        "url": "https://www.reddit.com/r/stocks/comments/kny4bx/controversial_picks_for_2021/",
        "created": 1609477705.0
    },
    {
        "author": "laplaciandaemon",
        "created_utc": 1609113036,
        "id": "klegl7",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "**TLDR:** The whole US got hacked, cyber-security will moon (even more). Still not too late to board a rocket if you pick the right one. There is a lot of profit-taking going on after recent run-ups, once that is passed there could be another 10-20+% short-term gain. Even more, if something goes full meme.\n\nThis week: FEYE 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀Look for ATM calls with expiry before the 2/3/21 earnings call.\n\nFurther out: FTNT 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀LEAPs (if you don’t know what those are, just mash in something deep OTM for 2022/2023 and run away).\n\n&amp;#x200B;\n\n**Background**\n\nI’m not even going to start explaining the 2020 Russian hack. If you want to know more: [https://www.vox.com/22187866/usa-cyber-hack-solar-winds-microsoft](https://www.vox.com/22187866/usa-cyber-hack-solar-winds-microsoft)\n\nGreat post that actually preceded the FEYE 💥 💥 💥 from u/Chalupuhh: [https://www.reddit.com/r/wallstreetbets/comments/kgdp82/feye\\_and\\_other\\_cyber\\_stonks\\_on\\_the\\_rise\\_from/](https://www.reddit.com/r/wallstreetbets/comments/kgdp82/feye_and_other_cyber_stonks_on_the_rise_from/)\n\nEven before the hack, a lot of these tickers were starting to get significant press: [https://investorplace.com/2020/10/7-cybersecurity-stocks-to-buy-for-the-5g-wave/](https://investorplace.com/2020/10/7-cybersecurity-stocks-to-buy-for-the-5g-wave/)\n\nThere are a number of players in the cybersecurity space. Some of them (CRWD, NET) have already achieved demi-meme status and/or had huge run-ups before the hack. This overview is just a limited slice. Depending on how things evolve, I may revisit it and add other tickers (feel free to suggest).\n\n&amp;#x200B;\n\n**Fundamentals**\n\nNot even sure why I included this. No one here cares – and certainly, 2020 doesn’t give a damn. If you look at anything, at least digest the P/E and put/call ratios.\n\n[A bunch of shit no one here will look at.](https://preview.redd.it/1wrz49pzet761.png?width=2390&amp;format=png&amp;auto=webp&amp;s=f23f94821dec8fc28f06137c2cfa9648b7e1faa0)\n\n**Charts**\n\nCharts are all 4h (I have limited trading access during the day; therefore, I can only really trade daily momentum). Bollinger bands, MACD, and RSI are below if you’re into that kind of thing.\n\nThere is one over-arching pattern for many of these companies – gap up on 12/18, peak on 12/22, sell-off through 12/24. \n\nI hope you smooth brains stumbled into the run-up on FEYE. FireEye has been trading sideways for years. The mini-🌝 trip allowed some people a convenient exit point for profit-taking. The short-term chart (30min) shows the stock bouncing off a support level of around 22.35. Institutional holdings have gone up since 12/18. If it gets up above 23, there could be another decent run-up store (obligatory 🚀 🚀 🚀). Prior to almost meme’ing, volume was low (\\~7m) and has increased to around 40m. The put/call ratio remains favorable (\\~0.65). Options premiums have continued to go up; however, depending on where you look on the options chain there are bargains. Next ER is expected around 2/3/21, time options intelligently as the already inflated IV can lead to an even bigger crush.\n\n[12\\/18: a glorious day of tendies](https://preview.redd.it/7vvrzzn9ft761.png?width=1106&amp;format=png&amp;auto=webp&amp;s=e872369ebc51211fa2c1ff48a37e5bc670a5898c)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/acu4w2a0ht761.png?width=832&amp;format=png&amp;auto=webp&amp;s=48584285b81bd7f46c15f552540e067007adf125\n\nCRWD has gapped up twice in Dec, once after the hack and once earlier in the month. This has happened in the middle of a 30% run-up. IV is actually at a historical low (\\~60) and options volume remains high. \n\nhttps://preview.redd.it/7cjnp5njft761.png?width=1098&amp;format=png&amp;auto=webp&amp;s=f1b85e42140e4546167c76f6c1d1342a49eaa530\n\nPANW jumped in mid-November after an earnings miss (-2.36 on an expected 1.33). Why did jump after a big miss? Because 2020. It had the sector-wide gap up on 12/18 of around 5%, but volume and IV have not gone up significantly since.\n\nhttps://preview.redd.it/w7bdkpboft761.png?width=1092&amp;format=png&amp;auto=webp&amp;s=ee57bda1f71af09e4175d72d151b93bc9a275a72\n\nFTNT has been rolling up steadily for a couple of months now, having had a 30% run-up. Same 12/18 pop. The difference is that prior to the 10/29 ER, it dropped from 130 to 110 and has been making up ground since then. When you put the last couple of months in that context, it feels like there is more room to go up.\n\nhttps://preview.redd.it/l7duupiqft761.png?width=1100&amp;format=png&amp;auto=webp&amp;s=c687d01eb0fbb6a00085a3eb76a9e8c58b2e37be\n\nhttps://preview.redd.it/83qluzj3ht761.png?width=840&amp;format=png&amp;auto=webp&amp;s=1b17d1d27790f450b52d730ece846f2b7efe2622\n\nNET (Cloudflare) has a similar feel to CRWD. There was a big jump in Oct (44 to 60) in response to product announcements, but a limited response to the hack.\n\nhttps://preview.redd.it/k6culzptft761.png?width=1394&amp;format=png&amp;auto=webp&amp;s=18997f3df0349d8b2bef7c175608580ff436016a\n\n[This is where the wheels fall off on this post.](https://preview.redd.it/2p668r5vft761.png?width=1086&amp;format=png&amp;auto=webp&amp;s=7b9daecabdd2e2c5ad854407248fbe356624a8bf)\n\nhttps://preview.redd.it/899brxlwft761.png?width=1084&amp;format=png&amp;auto=webp&amp;s=44c8a952392633b95b5d338d4b916c0b2060709e\n\n**Plays**\n\nFEYE could achieve full meme status. There are still some deals to be had in the options chain if you hunt around. ATM calls for a couple of weeks out are still reasonable, with break-evens that are below the recent peak (25.46). If the drop at the end of the spike was profit-taking, then it could go to a price target of 30 or even 🚀🌝.\n\nFTNT feels like a solid long-term play. The fundamentals are good, YoY growth is great but not spectacular, and it’s trading at a P/E that’s low compared with everyone else. Naturally, it will beat earnings in February and immediately drop 20%.\n\nOptions for CRWD and NET have a big greed premium attached to them. Cloudflare (NET) still hasn’t had the same gap up others have, but it’s at the end of a big run-up. There’s a decent chance they will both get an earnings beat in February, especially as companies hand out contracts after the hack. Impossible to predict how things will go after that – probably up bigly as people have attached huge P/E ratios to both.\n\nI’m still trying to figure out how to play CHKP and MRVL.\n\nAs always – information and plays here are suggestions only. Invest at your own risk.\n\nData from yahoo finance, Nasdaq, tradingview, and marketchameleon.",
        "subreddit": "wallstreetbets",
        "title": "Cybersecurity overview / DD (FEYE, FTNT, and more)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/klegl7/cybersecurity_overview_dd_feye_ftnt_and_more/",
        "created": 1609141836.0
    },
    {
        "author": "wanna_fuck_my_GF",
        "created_utc": 1607804891,
        "id": "kbw9oz",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "I am trying to classify the cloud market for DD and comparison. I am only interested in publicly traded companies in US. So far I have managed the following \n\n1. Content delivery network - FSLY, NET, AKAM, RXT\n2. Security - FEYE, FTNT, PANW, CRWD, OKTA, SPLK, ZS\n3. Communication as a platform service - TWLO, RNG, KLR\n4. Edge cloud - SWCH\n5. Data warehousing - SNOW\n\nI have left data storage and computing as these are mostly done by the big cloud players. Data storage has many players other than the big ones like BOX as well. \n\nI have left out the big cloud players like AMZN, GOOG, MSFT etc as well since they fall into more than one category and cloud is not their main business. \n\nI wanted to get some feedback. Any names that I should include. I am mostly looking at companies that are new even though some names like AKAM and RXT are old.",
        "subreddit": "investing",
        "title": "Categorizing the cloud market",
        "url": "https://www.reddit.com/r/investing/comments/kbw9oz/categorizing_the_cloud_market/",
        "created": 1607833691.0
    },
    {
        "author": "lFUCK",
        "created_utc": 1608471142,
        "id": "kgu1ho",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "With all the media attention this week around the Solarwinds (SWI) Russia Hack, [https://www.wired.com/story/russia-solarwinds-hack-roundup/](https://www.wired.com/story/russia-solarwinds-hack-roundup/) many investors are jumping into Cyber Security Plays.\n\n**See breakdown of Friday's gains in the sector:**\n\n1. $CYRN gained 30m market cap (50%)\n2. $FEYE gained 1.1B market cap (34%)\n3. $QLYS gained 800m market cap (19%)\n4. $CYBR gained 800m market cap (16%)\n5. $FTNT gained 1.5B market cap (7%)\n6. $CRWD gained 2.0B market cap (10%)\n\n**Cyber Security Poised to Grow:**\n\nThere has been a drastic increase in the amount of cyber security hacks and DDoS'es in 2020.\n\n[https://www.zdnet.com/article/the-biggest-hacks-data-breaches-of-2020/](https://www.zdnet.com/article/the-biggest-hacks-data-breaches-of-2020/)\n\nCompanies that have been exposed this year alone include: Microsoft, Wawa, Clearview, GE, T mobile, Marriot, Nintendo, SBA, Mitsubishi, Amtrak, University of California, Nasa, MGM, MongoDB, Cisco, Canon, LG, Intel, Carnival, Barnes and Noble, Google, Dickey's, Manchester united, Vertafore, Home Depot and the Government/FBI to name a few.\n\nCyber Security and Foreign Threats will be in the media for the foreseeable future. See some of the news articles that were released this weekend by various media outlets\n\nNBC: 12/19/2020 [https://www.nbcnews.com/news/us-news/suspected-russian-hack-was-it-epic-cyber-attack-or-spy-n1251766](https://www.nbcnews.com/news/us-news/suspected-russian-hack-was-it-epic-cyber-attack-or-spy-n1251766)\n\nCTV: 12/18/2020 [https://www.ctvnews.ca/world/america-votes/with-trump-silent-reprisals-for-cyber-hacks-may-fall-to-biden-1.5236837](https://www.ctvnews.ca/world/america-votes/with-trump-silent-reprisals-for-cyber-hacks-may-fall-to-biden-1.5236837)\n\nUSA Today: 12/19/2020 [https://www.usatoday.com/story/tech/2020/12/18/cybersecurity-hack-attack-5-things-you-can-do-protect-yourself/3963057001/](https://www.usatoday.com/story/tech/2020/12/18/cybersecurity-hack-attack-5-things-you-can-do-protect-yourself/3963057001/)\n\nCNN: 12/18/2020 [https://www.cnn.com/videos/business/2020/12/17/us-government-agencies-hack-biden-trump-marquardt-nr-sot-vpx.cnn](https://www.cnn.com/videos/business/2020/12/17/us-government-agencies-hack-biden-trump-marquardt-nr-sot-vpx.cnn)\n\nGlobal News: 12/19/2020 [https://globalnews.ca/news/7476152/govt-agency-infrastructure-risk-from-cyber-attacks/](https://globalnews.ca/news/7476152/govt-agency-infrastructure-risk-from-cyber-attacks/)\n\nYou can bet your mom's 8 ball that boomers will be hopping into Cyber Stocks come Monday morning after being late to the party and reading about the breach on the weekend. Hopping into any cyber security related stock that posted gains on Friday.\n\nWhenever there is large media attention around a specific sector, the stock poised to gain the most is the lowest float/market cap play.\n\nBiden Weed Pump: SNDL rose 200% due to its small market cap, compared to industry average of 40% during this period\n\nBiden Solar Pump: SOL/SUNW rose 100%+ due to small market cap, compared to industry average of 50% during this period\n\nWhenever there is a multi day runner catalyst event, the stocks that ran the hardest on the first day are the ones that continue to pump for the rest of the week/month.\n\n**Why $CYRN has the most to gain:**\n\n$CYRN provides services to over 1.3 billion clients at the moment. Along with many large corporation including Google, Microsoft, The Walt Disney Company, Dell, Checkpoint, HP, T-Mobile, and McAfee are a few of the other corporations that trust Cyren to play a role in their cloud security arsenals.\n\n[https://techcommunity.microsoft.com/t5/microsoft-defender-for-endpoint/web-content-filtering-with-microsoft-defender-atp-now-in-public/ba-p/1132287](https://techcommunity.microsoft.com/t5/microsoft-defender-for-endpoint/web-content-filtering-with-microsoft-defender-atp-now-in-public/ba-p/1132287)\n\n$CYRN is currently trading 30% below its ATH, while all other stocks mentioned above are at their ATH's from Fridays news.\n\n$CYRN's tradeable active float is only 18.1m. With institutions owning 67% of the float. A large portion of this float was traded in the last hour on Friday (47.5%) resulting in a 50% gain going into close.\n\nJust based on the low float and media coverage, I expect CYRN to continue to pump into the 2's and possible higher throughout the week. If they put out a fluff article about working with MSFT and organizations affected by the SWI Hack that are already in their database and active customers this could see a 200%+ day.\n\nThis is a short term play, get in with the hype and hop out by next week unless there are new catalysts that arise. (new contracts, more breaches/media coverage)",
        "subreddit": "pennystocks",
        "title": "$CYRN - Cyber Security Play Primed to Run",
        "url": "https://www.reddit.com/r/pennystocks/comments/kgu1ho/cyrn_cyber_security_play_primed_to_run/",
        "created": 1608499942.0
    },
    {
        "author": "F1rstxLas7",
        "created_utc": 1608651857,
        "id": "ki7q9w",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "**Irrelevant Intro:** I thought I'd kick this off with the first play I've ever made *entirely without outside suggestion or analysis.* That might make you wonder why you should even read this to begin with, because I am very clearly *not* a professional, but god damn do I love analysis and stock picking. \n\n**Actual intro:** Fortinet, no not Fortnite, is an American multinational corporation headquartered in Sunnyvale, California that develops and markets cybersecurity products and services, such as firewalls, anti-virus, intrusion prevention and endpoint security. I ripped that description straight from Wikipedia, but it's important to note that a hobby, not profession, of mine is cybersecurity. Over the last few months reading various books, content here, and yes, digging into technical trading too, I finally decided I was ready. The only problem was, I didn't know where to start- this is where FTNT comes in. \n\n**I need to be clear here, the analysis I did for FTNT was done at the end of November. It's been about 3 weeks since this analysis so the valuation of the company *has* inherently changed.** \n\n**Why Fortinet?:**\n\nUltimately, my decision to buy into FTNT came from wanting to invest in the Cybersecurity industry. Yes, there are ETFs for this that spread out risk over a number of players, but I wanted to try and apply the tools I've picked up to real world investing. As I mentioned, cybersecurity is a hobby of mine. It's grown increasingly interesting to me, but more specifically, it's grown increasingly *more important* in today's tech driven world. To me, Cybersecurity is 'the utility industry with upside' because of tech's reliance on it.\n\nBecause I wanted something *specifically* within the Cybersecurity industry, I looked into *many* different companies listed in Cyber ETFs or competitors within the space. Specifically, I want to call out Palo Alto as a competitor, but others such as CyberArk, FireEye, and others. It's also important for me to stop right here and mention to you that if you do not know these companies well enough, you will not recognize that they **do not** offer the same products and services as one another. Just because a company is in the same industry as another doesn't mean they operate similarly. \n\n**Metrics:** \n\n1. Cybersecurity Industry CAGR:  Somewhere between 8% - 13% over the next few years.\n\n1. ROIC: 19.74% as of Sep 2020, but their last couple of years have been well above my mark for buy consideration. (GuruFocus)\n\n1. Institutional Ownership: 71% of shares held by Institutions, 85% of float held by Institutions. FYI, this was slightly lower during my purchase. I wanted to note institutional ownership for the following reason: The less Institutional ownership, the greater the chance for a significant rise in price after proven profitability comes. (Yahoo)\n\n1. D/E ratio: Pre-pandemic was around 2 and declining consistently. As of end of Sep, closer to 4. I can't imagine the D/E ratio not to drop off over the next couple of quarters. I wanted to mention D/E ratio specifically because of FTNT's in comparison to the rest of the industry. Because the industry is still tech based, high debt is *very* common. The fact that this company, especially 20 years ago, already has a successful track record of obtaining debt for higher returns is especially encouraging when comparing their competitors. \n\n1. PEG Ratio: At September's end, FTNT's PEG Ratio was .66, however it has increased to 1.16 as of today. Again, this is absolutely *insane* when compared to other Cybersecurity industry competitors. (GuruFocus)\n\n1. There are many other metrics that could be listed here, both in favor of FTNT and against them, but the ones above are a handful that went into my secret sauce when comparing the company against its competitors. \n\n**Subjective Sentiment:** \n\nThere have been huge catalysts that have helped boost FTNT recently. The COVID pandemic, like most other tech related picks, has definitely boosted FTNT's ability to outperform. The 52 week low of $70 was robbery and unfortunately I was too late to buy in at that point. My actual buy in price didn't come until the stock hit $124 but I'm glad I did, even then. About a week later, it was announced that FireEye was hit by a malware attack, which further exploded into basically what's being referred to as the largest cybersecurity event in the last decade and maybe ever. The implications are reaching as far as the US Gov't, foreign entities, and private businesses alike due to poor cybersecurity practices on behalf of the vendor SolarWinds. I'm not going to get into the details on this attack, but with every passing year, more cybersecurity incidents arise. Hacking is its own industry. Cybersecurity is its opposite. As the hacking industry grows, as does Cyber. This will *not* be a one time thing. If you are too concerned that you 'missed out' on a significant event and shouldn't even consider FTNT, you're gonna keep missing out on what Fortinet will continue to prevent against.\n\nWhat I think is the most important piece of this short novel is the sentiment behind the company itself. I am not a FTNT customer, so I was unfamiliar with their level of success from the customer's perspective. How did I get an idea of the company? Literally just reddit. It sounds insane, but it was tremendously helpful. Subreddits like r/sysadmin and r/netsec was a gold mine for finding out how people feel about both Fortinet, Palo Alto, and other competitors. And guess what, Fortinet was all thumbs up. \"Inexpensive and cheap\" was the mantra. Palo Alto, you ask? The cream of the crop when it came to the specific solution both companies were trying to solve, but expensive as heck. Even after the fundamental analysis done above, I reasoned that *everyone* needs to start considering Cybersecurity as a part of their core business expenses, but very few but the largest and mid size organizations are willing to put out cash for the \"Ferrari of equipment\" from Palo Alto.\n\n**Conclusion:**\n\nI could go on and on about Fortinet. It checks all of my boxes and again, it's important for me to say that FTNT is something I'm going to hold for *a long* time. Their leadership is killing it, they're performing when others are still figuring things out, and they still have incredible room to absolutely crush it in the industry. Despite my position being up only 20% since November 30th, I'm absolutely stoked about the potential that Fortinet has in the future.\n\nPlease provide criticisms &amp; feedback about FTNT because my strategy is based on examining all possible data &amp; information. It may not be relevant to me now, but keeping it in mind as I move forward with holding FTNT could prove fortuitous if things change. \n\n*Disclaimer, I am long FTNT and I wish you good luck trying to change my mind.*",
        "subreddit": "wallstreetbets",
        "title": "NASDAQ: FTNT",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ki7q9w/nasdaq_ftnt/",
        "created": 1608680657.0
    },
    {
        "author": "F1rstxLas7",
        "created_utc": 1608652073,
        "id": "ki7sl8",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "**Irrelevant Intro:** I thought I'd kick this off with the first play I've ever made *entirely without outside suggestion or analysis.* That might make you wonder why you should even read this to begin with, because I am very clearly *not* a professional, but god damn do I love analysis and stock picking. \n\n**Actual intro:** Fortinet, no not Fortnite, is an American multinational corporation headquartered in Sunnyvale, California that develops and markets cybersecurity products and services, such as firewalls, anti-virus, intrusion prevention and endpoint security. I ripped that description straight from Wikipedia, but it's important to note that a hobby, not profession, of mine is cybersecurity. Over the last few months reading various books, content here, and yes, digging into technical trading too, I finally decided I was ready. The only problem was, I didn't know where to start- this is where FTNT comes in. \n\n**I need to be clear here, the analysis I did for FTNT was done at the end of November. It's been about 3 weeks since this analysis so the valuation of the company *has* inherently changed.** \n\n**Why Fortinet?:**\n\nUltimately, my decision to buy into FTNT came from wanting to invest in the Cybersecurity industry. Yes, there are ETFs for this that spread out risk over a number of players, but I wanted to try and apply the tools I've picked up to real world investing. As I mentioned, cybersecurity is a hobby of mine. It's grown increasingly interesting to me, but more specifically, it's grown increasingly *more important* in today's tech driven world. To me, Cybersecurity is 'the utility industry with upside' because of tech's reliance on it.\n\nBecause I wanted something *specifically* within the Cybersecurity industry, I looked into *many* different companies listed in Cyber ETFs or competitors within the space. Specifically, I want to call out Palo Alto as a competitor, but others such as CyberArk, FireEye, and others. It's also important for me to stop right here and mention to you that if you do not know these companies well enough, you will not recognize that they **do not** offer the same products and services as one another. Just because a company is in the same industry as another doesn't mean they operate similarly. \n\n**Metrics:** \n\n1. Cybersecurity Industry CAGR:  Somewhere between 8% - 13% over the next few years.\n\n1. ROIC: 19.74% as of Sep 2020, but their last couple of years have been well above my mark for buy consideration. (GuruFocus)\n\n1. Institutional Ownership: 71% of shares held by Institutions, 85% of float held by Institutions. FYI, this was slightly lower during my purchase. I wanted to note institutional ownership for the following reason: The less Institutional ownership, the greater the chance for a significant rise in price after proven profitability comes. (Yahoo)\n\n1. D/E ratio: Pre-pandemic was around 2 and declining consistently. As of end of Sep, closer to 4. I can't imagine the D/E ratio not to drop off over the next couple of quarters. I wanted to mention D/E ratio specifically because of FTNT's in comparison to the rest of the industry. Because the industry is still tech based, high debt is *very* common. The fact that this company, especially 20 years ago, already has a successful track record of obtaining debt for higher returns is especially encouraging when comparing their competitors. \n\n1. PEG Ratio: At September's end, FTNT's PEG Ratio was .66, however it has increased to 1.16 as of today. Again, this is absolutely *insane* when compared to other Cybersecurity industry competitors. (GuruFocus)\n\n1. There are many other metrics that could be listed here, both in favor of FTNT and against them, but the ones above are a handful that went into my secret sauce when comparing the company against its competitors. \n\n**Subjective Sentiment:** \n\nThere have been huge catalysts that have helped boost FTNT recently. The COVID pandemic, like most other tech related picks, has definitely boosted FTNT's ability to outperform. The 52 week low of $70 was robbery and unfortunately I was too late to buy in at that point. My actual buy in price didn't come until the stock hit $124 but I'm glad I did, even then. About a week later, it was announced that FireEye was hit by a malware attack, which further exploded into basically what's being referred to as the largest cybersecurity event in the last decade and maybe ever. The implications are reaching as far as the US Gov't, foreign entities, and private businesses alike due to poor cybersecurity practices on behalf of the vendor SolarWinds. I'm not going to get into the details on this attack, but with every passing year, more cybersecurity incidents arise. Hacking is its own industry. Cybersecurity is its opposite. As the hacking industry grows, as does Cyber. This will *not* be a one time thing. If you are too concerned that you 'missed out' on a significant event and shouldn't even consider FTNT, you're gonna keep missing out on what Fortinet will continue to prevent against.\n\nWhat I think is the most important piece of this short novel is the sentiment behind the company itself. I am not a FTNT customer, so I was unfamiliar with their level of success from the customer's perspective. How did I get an idea of the company? Literally just reddit. It sounds insane, but it was tremendously helpful. Subreddits like r/sysadmin and r/netsec was a gold mine for finding out how people feel about both Fortinet, Palo Alto, and other competitors. And guess what, Fortinet was all thumbs up. \"Inexpensive and cheap\" was the mantra. Palo Alto, you ask? The cream of the crop when it came to the specific solution both companies were trying to solve, but expensive as heck. Even after the fundamental analysis done above, I reasoned that *everyone* needs to start considering Cybersecurity as a part of their core business expenses, but very few but the largest and mid size organizations are willing to put out cash for the \"Ferrari of equipment\" from Palo Alto.\n\n**Conclusion:**\n\nI could go on and on about Fortinet. It checks all of my boxes and again, it's important for me to say that FTNT is something I'm going to hold for *a long* time. Their leadership is killing it, they're performing when others are still figuring things out, and they still have incredible room to absolutely crush it in the industry. Despite my position being up only 20% since November 30th, I'm absolutely stoked about the potential that Fortinet has in the future.\n\nPlease provide criticisms &amp; feedback about FTNT because my strategy is based on examining all possible data &amp; information. It may not be relevant to me now, but keeping it in mind as I move forward with holding FTNT could prove fortuitous if things change. \n\n*Disclaimer, I am long FTNT and I wish you good luck trying to change my mind.*",
        "subreddit": "investing",
        "title": "[DD] NASDAQ: FTNT",
        "url": "https://www.reddit.com/r/investing/comments/ki7sl8/dd_nasdaq_ftnt/",
        "created": 1608680873.0
    },
    {
        "author": "RiverJayXXX",
        "created_utc": 1609353167,
        "id": "kn7shz",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": " Which ones (below) should I dump? What should I buy to add? Need to de-diversify my portfolio to the real winners of 2021? Someone on CNBC says portfolio should not be to diversified\n\n · BIDU · CSIQ · FCX · SEDG · APPS · ARKG · PLUG · PBW · ARKK · ARKQ · UCTT · TSM · SQ · DFS · DIS · NTES · TCEHY · AI · TTWO · PLTR · CAT · APHA · APPN · CRWD· DOYU · MELI · RTX · XL · MRVL · TSLA · MA · DKNG · NTDOY · HON · JD · ATVI · APD · ABBV · EXPE · AMD · GS · VRTX · GM · BMY · DE · BA · ZBRA · LIN · DD · MMM· FTNT · AYX · BZUN · WMT · BABA · RBC · F · NVDA · PYPL · CMCSA · TMO · AAPL · DHR · CRM · NKE· DOCU · SNOW · GOOGL · TWLO · EXPI · NFLX · UPS · ZM · AMZN · MSFT · SPLK · SHOP · FB · PINS",
        "subreddit": "wallstreetbets",
        "title": "Need advice on what to do with my portfolio",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kn7shz/need_advice_on_what_to_do_with_my_portfolio/",
        "created": 1609381967.0
    },
    {
        "author": "wanna_fuck_my_GF",
        "created_utc": 1607804466,
        "id": "kbw4z6",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "I am trying to classify the cloud market for DD and comparison. I am only interested in publicly traded companies in US. So far I have managed the following \n\n1. Content delivery network - FSLY, NET, AKAM, RXT\n2. Security - FEYE, FTNT, PANW, CRWD, OKTA, SPLK, ZS\n3. Communication as a platform service - TWLO, RNG, KLR\n4. Edge cloud - SWCH\n5. Data warehousing - SNOW\n\nI have left data storage and computing as these are mostly done by the big cloud players. Data storage has many players other than the big ones like BOX as well. \n\nI have left out the big cloud players like AMZN, GOOG, MSFT etc as well since they fall into more than one category and cloud is not their main business. \n\nI wanted to get some feedback. Any names that I should include. I am mostly looking at companies that are new even though some names like AKAM and RXT are old.",
        "subreddit": "stocks",
        "title": "Categorizing the cloud market",
        "url": "https://www.reddit.com/r/stocks/comments/kbw4z6/categorizing_the_cloud_market/",
        "created": 1607833266.0
    },
    {
        "author": "AICoderGamer",
        "created_utc": 1608346417,
        "id": "kfzrmg",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "FTNT going 🚀🚀🚀🚀🚀. All in on FTNT!",
        "url": "https://i.redd.it/6ul5pvr462661.jpg",
        "created": 1608375217.0
    },
    {
        "author": "AICoderGamer",
        "created_utc": 1607014673,
        "id": "k612da",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Fortinet Announces Industry’s First Secure SD-WAN Appliances for Operational Technology Environments\n\nhttps://www.globenewswire.com/news-release/2020/12/02/2138386/0/en/Fortinet-Announces-Industry-s-First-Secure-SD-WAN-Appliances-for-Operational-Technology-Environments.html\n\nFTNT is up 12.5% after news regarding its new SDWAN product line was released. I personally like the stock as Cybersecurity is only going to be needed more in the future and multiple Gartner awards it’s SDWAN products have recently recieved.\n\nCurious as to what others think about the stock, but I expect it to keep going up.\nMy current portfolio positions:\nAAPL - 35%\nAMZN - 35%\nPLTR - 10%\nFTNT - 20%",
        "subreddit": "stocks",
        "title": "FTNT up 12.5% today after announcement of SDWAN",
        "url": "https://www.reddit.com/r/stocks/comments/k612da/ftnt_up_125_today_after_announcement_of_sdwan/",
        "created": 1607043473.0
    }
]