[
    {
        "author": "lucky5150",
        "created_utc": 1603919746,
        "id": "jjwki2",
        "num_comments": 105,
        "num_crossposts": 0,
        "selftext": "I made on average 80-160% investing in mid March and just cleaned up and took some profits over the last 2 weeks.  Today I began looking over my watch list and here are a few of the companies I'm excited to buy if we head back down: (in no particular order)\n\nTSLA\nARKK\nAAPL\nAMZN\nMSFT\nFB\nAMD\nNVDA\n(Yeah I started with the obvious ones, just keep going)\nWYNN\nSWKS\nCAKE\nSPCE\nNIO\nABR\nT\nQCOM\nDIS\nLUV\nTPR\nTGT\nCRSR\nJWN\nELF\nRVLV\nBA\nDBX\nSQ\nZ\nPTON\nNFLX\nBYND\nTOL\nQQQ\nLMND\n\nand there you have it.  Some of these I already own. Most of these i made money on between March and September so I'd expect them to dip again and bounce back quickly and some will just be good long term holds\n\nWhat's on your watch list?",
        "subreddit": "stocks",
        "title": "What's on your watch list incase we have another crash? Here is mine.",
        "url": "https://www.reddit.com/r/stocks/comments/jjwki2/whats_on_your_watch_list_incase_we_have_another/",
        "created": 1603948546.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1604151914,
        "id": "jlim4i",
        "num_comments": 35,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/stocks. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading month ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning November 2nd, 2020.\n\n# **Investors are hoping for a clear presidential and Senate election outcome to end the sell-off  - [(Source)](https://www.cnbc.com/2020/10/30/investors-are-hoping-for-a-clear-presidential-and-senate-election-outcome-to-end-the-sell-off.html)**\n*****\n&gt; The best hope for markets in the week ahead is that there is a clear cut winner in Tuesday’s presidential election.\n*****\n&gt; The election looms large as the biggest wild card risk for markets, and there is a real concern that no outcome could lead to a period of uncertainty and turbulence for markets and the economy. On the other hand, some strategists say a clear winner and quick concession by the other candidate could lead to a relief rally. Also a worry is that Senate elections could be unresolved, which means it may not be known which party holds the majority.\n*****\n&gt; “If there’s no clear winner, it will be negative for risk assets...The market is really worried about not having clarity after the election. They’re worried about it dragging out four weeks as the results are contested,” said Ian Lyngen, head of U.S. rates strategy at BMO. “The overall landscape is not a political one. It’s that we’re in a pandemic, and we don’t want an uncertain election outcome that leaves the country concerned about leadership.”\n*****\n&gt; Stocks closed out October on a sour note, losing about 6% for the week, the worst performance since March, when the pandemic first shut down the economy. Strategists say the coronavirus is again worrying the market, as major European countries go into partial lockdowns, and the U.S. faces record numbers of new cases.\n*****\n&gt; Lyngen said he does not expect the markets to react as much if it’s only the fate of the Senate that is undetermined. But that is still very important, and if it’s not clear which party has a majority for days or even weeks, that would cast doubt on the ability of whichever candidate wins the presidency to pursue their policy agenda.\n*****\n&gt; # Senate key for stimulus\n&gt; The Senate is also key to how much money will be poured into the economy to help battle the impact of the virus. For instance, if former Vice President Joe Biden wins the White House, but Democrats do not reclaim the Senate, he will likely have to compromise on a smaller stimulus package and would not be able to implement tax increases. If President Donald Trump is re-elected and faces a newly Democratic Senate alongside the Democratic House, he will likely face push back on many issues though they may agree on a large stimulus package.\n*****\n&gt; As of Friday, Biden was leading Trump in the polls by 7.8 percentage points in the RealClearPolitics average of major polls. Democrats also appear likely to take the Senate, but some races are very tight.\n*****\n&gt; Bank of America strategists note that the Senate races are close with a few seats that could flip. Seven Republican seats are currently rated as toss-ups with four in battleground states, where they could be lost if there’s a strong Democratic surge. There could also be a clear majority, but still uncertainty in terms of final makeup.\n*****\n&gt; “The overall composition of the Senate is unlikely to be determined until sometime in January due to election rules in Georgia which stipulates the race goes to a run off if no candidates garners 50% majority in the general election and currently no candidate is projected” to hit that threshold, the BofA strategists wrote.\n*****\n&gt; The strategists say the timing of the results is unclear due to early voting but high volumes of mail-in ballots, which cannot be counted in some states until election day.\n*****\n&gt; “A short delay in the election result should have a trivial impact on the economy but a multi-week contested election could drag down H1 GDP growth by 0.5-1.0 pp,” according to BofA strategists. “Once there is a winner, the focus turns to stimulus.”\n*****\n&gt; # Watch bond yields\n&gt; That could mean bond yields will continue their move higher in the coming week. Yields have been rising on the idea that there will be some kind of stimulus after the election, and it will mean more U.S. debt and higher interest rates.\n*****\n&gt; “We expect rates to shift higher by 5 to 25 bps after the election outcome is known due to expectations for fiscal stimulus and improved growth prospects,” the BofA strategists wrote. The 10-year Treasury yield was at 0.86% Friday.\n*****\n&gt; However, if the election outcome is not known for awhile, the strategists said a contested outcome could push the 10-year yield materially lower.\n*****\n&gt; If there is a contested election, the strategist expect stocks to trade lower, but it would be a buying opportunity since the market typically recovers from headline-related losses within six months.\n*****\n&gt; “We expect a clear outcome to be neutral to positive for the market in the near term, except under a Biden win with a split Congress, which could potentially lead to continued gridlock in fiscal stimulus talks,” the BofA strategists added.\n*****\n&gt; Besides the election, there is also a Fed meeting, expected to end Thursday with no new announcements though it is likely the Fed will emphasize it will keep policy easy for a long time as the economy heals. The October employment report is expected on Friday and is expected to show continued job gains, after September’s 661,000 nonfarm payrolls.\n*****\n&gt; Jonathan Golub, chief U.S. equities strategist at Credit Suisse, does not expect the market to react much if the election outcome is as expected, with Biden winning and Democrats taking the Senate.\n*****\n&gt; “The most likely outcome is already discounted by the market. The best assumption is if you don’t have a big surprise, the market should do nothing,” Golub said, adding the most volatile week could be the one just ending. “This week is the one with the turmoil, and I don’t think the next week is the one where the market’s going to be crazy.”\n*****\n&gt; Golub said investors may be too worried about the election being unresolved and the real issue disturbing the market this past week is the growing spread of the virus.\n*****\n&gt; “There’s no rule we need to declare a victor,” said Golub. “We have four or five weeks. The market may not love that near-term indecision, but the system is set up to allow for it, and as long as things don’t go off the rails, and they really shouldn’t, this concern about a contested election is probably overblown as an investor issue.”\n*****\n&gt; Golub said there’s a greater chance that the winner of the presidency is known before the Senate. “The chances are that we’ll at least know directionally where the power sits, but that could take a little longer and the market may be a little uncomfortable with that,” he said.\n*****\n&gt; # Earnings reports\n&gt; Dozens of companies report earnings in the week ahead, and Golub said corporate profits are a bright spot for the market. The third quarter results so far are showing earnings down about 10%, compared to earlier forecasts of more than 20%, according to Refinitiv.\n*****\n&gt; “The reality is the economy is robust. 55% of the market cap of the S&amp;P has higher earnings in 2020 than in 2019. More than half the market is acting like there’s no recession, no downturn,” Golub said.\n*****\n&gt; Golub said both Trump and Biden would push for fiscal stimulus, but while the market is clear on where Trump stands it does not know that much about Biden, if he were to win. “It is going to take some time to get clarity on which of his policy initiatives are going to happen. I don’t believe he’s going to implement these tax increases he’s talking about right away. I think the economy is too frail,” said Golub.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/TQBrNag.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/LrQZHOj.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/WbqKDDT.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/zqi6l3G.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/9q0jEby.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/xGuEP7D.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/2SrRdkk.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/tCh05mj.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/qOJdagC.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/KhE54Ws.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/rrDYFK6.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/QEbWDb7.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/zBMyLqA.png))**\n\n*****\n\n&gt; # November Almanac: Usually a Top Month in Election Years\n\n&gt; November maintains its status among the top performing months as fourth-quarter cash inflows from institutions drive November to lead the best consecutive three-month span November-January. However, the month has taken hits during bear markets and November 2000, down –22.9% (undecided election and a nascent bear), was NASDAQ’s second worst month on record—only October 1987 was worse.\n\n&gt; November begins the “Best Six Months” for the DJIA and S&amp;P 500, and the “Best Eight Months” for NASDAQ. Small caps come into favor during November, but don’t really take off until the last two weeks of the year. November is the number-two DJIA (since 1950), NASDAQ (since 1971) and Russell 2000 (since 1979) month. November is best for S&amp;P 500 (since 1950) and Russell 1000 (since 1979).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/43b1cac3b88cfc6f79063d86ae9abfef/57e8d7f397fbeeb8-7f/s400x600/a8bff5e250ce7b9735197427f72d665b61fe0614.jpg))**\n\n&gt; November is a mixed bag in presidential election years. DJIA has advanced in 10 of the last 17 election years since 1952 with an average gain of 1.7%. Significant DJIA declines occurred in 2008 (-5.3%) and 2000 (-5.1%). For S&amp;P 500 November ranks best with a similar record to DJIA. NASDAQ, Russell 1000 and Russell 2000 are not as strong ranking #7, #3 and #6 respectively. Fewer years of data (12 for NASDAQ and 10 for Russell indices) combined with sizable losses in 2000 and 2008 drag down rankings and average gains when compared to DJIA and S&amp;P 500.\n\n*****\n\n&gt; # Whatever the Outcome, Day Before Election Day Historically Bullish\n\n&gt; Looking back at the last seventeen presidential elections since 1952, the day before Election Day has a clear bullish bias. DJIA and S&amp;P 500 have declined just three times and average gains of 0.51% and 0.44% respectively. NASDAQ and Russell 2000 are slightly weaker, but still bullish. Election Day (or the day after prior to 1980) leans bullish, but with a greater frequency of losses. Incumbent party victories are shaded in light grey.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/d030ea31abcb4bd298b596da0d2b2b4d/3d5b7e5afba3a9a5-14/s500x750/a8b43d243e3c57890dde8a0682726a1da587e5d2.jpg))**\n\n*****\n\n&gt; # GDP Bounces Back\n\n&gt; The outbreak of COVID-19 and the subsequent lockdowns triggered the largest quarter over-quarter decline in gross domestic product (GDP) since WWII, so perhaps it comes as no surprise that the following quarter tallied the sharpest rebound in that same time period. GDP expanded 33.1% on an annualized basis in the third quarter, ahead of Bloomberg consensus expectations of 32%, fueled by the continued reopening of businesses and reversing much of the economic fallout stemming from COVID-19-related lockdowns.\n\n&gt; As shown in the LPL Chart of the Day, consumer spending—the largest contributor to GDP in the US and roughly 70% of economic output—rebounded in a powerful fashion in the third quarter.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/10/10.29.20-Blog-Chart.jpg?ssl=1))**\n\n&gt; However, spending numbers were uneven, with a considerably larger portion spent on goods rather than services—consistent with the continued behavioral and business restriction effects on these industries. Further, the timing of spending was also fairly uneven, as much of the growth in consumer spending came in the early weeks of the third quarter and tapered off in recent weeks where the effects of fiscal stimulus and rising new COVID-19 cases influenced consumer behavior.\n\n&gt; “GDP rebounded stronger than expected in the third quarter, but the big question on everyone’s mind is whether the economy can remain on firm ground in the fourth quarter and into 2021,” stated LPL Chief Market Strategist Ryan Detrick. “Barring a new round of fiscal stimulus, it’s likely that growth will taper off in the fourth quarter, but we still don’t expect a double-dip recession.”\n\n&gt; Regardless of the state of economic momentum, it is remarkable that GDP is already only about 3.5% away from recovering the entire pandemic losses. The resilience of US consumers has been the top story of the recovery, even with the historic fiscal stimulus.\n\n&gt; The surge in growth in the third quarter may also have political implications. As we noted in our recent Weekly Market Commentary: Are the Polls Wrong Again? the average GDP growth in the second and third quarters of election years can have predictive power for who wins the election, with stronger growth favoring incumbents. However, we also point out that recessions close to elections have favored challengers, sending some conflicting market signals heading into Election Day!\n\n&gt; As the economy moves forward in the fourth quarter, we’ll continue to monitor real-time data indicators to gauge the impact of rising COVID-19 cases on consumer and business behavior.\n\n*****\n\n&gt; # Slight Dip In Consumer Confidence\n\n&gt; Consumer Confidence for the month of October was released earlier today and showed a slight dip relative to September. The headline index dropped from 101.3 down to 100.9 compared to expectations for a reading of 102.0. Given the rising number of cases and the upcoming election, it's not too surprising to see confidence come in a bit, so a decline of this magnitude isn't all that concerning. What is notable, though, is that even though Consumer Confidence remains right near post-COVID highs, it hasn't bounced all that much off its lows.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/102720-CC.png))**\n\n&gt; Breaking out this month's report by the sentiment of consumers towards both how they feel now and what they expect in the future, the Present Situation Index rose from 98.9 up to 104.6 while the Expectations component dropped from 102.9 down to 98.4. The drop in the Expectations component of this month's report looks like it's a partial reflection of growing uncertainty regarding COVID and the election as we head into the colder months of November and December.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/102720-CC-P-Exp.png))**\n\n&gt; In looking at the spread between Present Conditions and Expectations, it moved back into positive territory this month after dropping deeply into negative territory earlier this year. What's interesting to note about current levels is that in every prior recession since the late 1960s, by the time the spread moved back into positive territory after turning negative, the recession was already well in the rearview mirror.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/102720-CC-Spread.png))**\n\n&gt; Sentiment towards jobs also suggests a relatively positive trend. At the current level of 26.5, the Jobs Plentiful index is still far from its 40+ reading before COVID, but it did increase again in October as it has now done in four of the last five months. While it's by no means a strong reading at current levels, it hasn't been getting worse either. Looking at past recessions, it wasn't until well after the recession ended that the Jobs Plentiful index started to rebound.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/102720-CC-Jobs-plentiful.png))**\n\n*****\n\n&gt; # Industrials Malfunction\n\n&gt; With poorly received earnings reports from 3M (MMM) and Caterpillar (CAT) and general weakness overall, Tuesday was just a bad day for the Industrials sector. Just five stocks in the sector were up on the day and the sector overall was down 2.2% compared to the S&amp;P 500 which was down just 0.3%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/102720-Industrials-Sector-Perfoamnces.png))**\n\n&gt; The chart below shows the daily performance spread between the S&amp;P 500 and the Industrials sector over the last year. Positive readings indicate the S&amp;P 500 outperforming the Industrials sector and negative readings indicate that the Industrials sector outperformed the S&amp;P 500. With the S&amp;P 500 outperforming the Industrials sector by 1.88 percentage points on Tuesday, it was the widest performance gap (in the S&amp;P 500's favor) since 9/21. Even more notable, though, was the fact that there have only been three other days in the last year where the Industrials sector underperformed the S&amp;P 500 by a wider margin.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/102720-Industrials-Sector-Spread.png))**\n\n&gt; For the sector as a whole, it currently finds itself in a precarious position. After breaking its uptrend off the March lows on 9/21, the Industrials sector bounced back and rallied back to its former uptrend line, and while it just recently made a post-COVID high, the rally ran out of steam right at the former uptrend line. In the pullback that has followed, the sector closed yesterday right at a secondary line of support from the June lows. If this level doesn't hold through today's close, the technical picture for the sector will look a lot different than the way it looked just a few weeks ago.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/102720-Industrials.png))**\n\n*****\n\n&gt; # All or Nothing Days Back on the Rise\n\n&gt; The S&amp;P 500's A/D line for the day (number of advancing stocks minus number of declining stocks) currently stands at about -460, which would be the weakest one-day reading since June. Today's A/D reading also is notable in that it represents the tenth 'all or nothing' day for the S&amp;P 500 since the index's last peak on 9/2. We consider 'all or nothing' days to be those days where the S&amp;P 500's daily A/D reading is either above +400 or below -400. To put the frequency of 'all or nothing' days into perspective, while there have been ten in the last forty trading days, in the forty trading days before that there weren't any.\n\n&gt; The chart below shows the percentage of 'all or nothing' days on a 50-day rolling basis. The current pace of 20% is still well off the extraordinary level of 44% we saw back in late April/early May, but it is still relatively high.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/102820-AllorNothing-50.png))**\n\n&gt; Including today, there have now been 41 'all or nothing' days so far in 2020. If the current pace for the entire year keeps up that will put us on pace for fifty days this year. If the current pace keeps up and we do reach 50 'all or nothing' days this year, it will be the third-highest annual total behind 2011 (70) and 2008 (52), but even if there isn't another 'all or nothing' day this year, 2020 would still rank fifth behind the years from 2008 through 2011.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/102820-AllorNothing-All.png))**\n\n*****\n\n&gt; # Earnings and Economics Diverge\n\n&gt; This earnings season, we have frequently mentioned how beat rates have continued to rise relentlessly. From our Earnings Explorer database, our 3-month rolling EPS beat rate currently stands at a record high of 78.19%. That is nearly 20 percentage points higher than the historical average of 59.37%. The sales beat rate is not at a record, but it too is elevated at 69.09% versus the historical average of 56.45%. That means that of the companies that have reported earnings over the past three months, a massive proportion are exceeding consensus sales and EPS estimates.\n\n&gt; While earnings beat rates have continued to grind higher, economic data is another story. The Citi Economic Surprise Index basically tracks macroeconomic data and how it comes in relative to forecasts. Higher readings indicate the data is trending stronger than expected and vice versa for negative readings. With the unprecedented shock to macroeconomic data in 2020, this index for the United States plummeted, but that was followed by a sharp rebound to record highs. Although the index for the US remains higher than anything prior to the pandemic, it has been heading lower since the summer. In other words, economic data is still coming in better than expected but is not massively exceeding expectations to the degree it was back in the spring and early summer.\n\n&gt; The two charts below compare EPS and revenue beat rates to the Citi Economic Surprise Index. Comparing the two series to the Citi Economic Surprise Index shows that while EPS beat rate has been somewhat connected (correlation: +0.325)) there is very little in the way of correlation between the Surprise Index and the revenue beat rate (+0.084). Given that EPS figures are typically easier to massage than revenues, that was a bit of a surprise. What is notable about the recent decline in the Citi Economic Surprise Index is that in prior periods where it became elevated and then pulled back as it did in (2003, 2009, and 2018), the EPS beat rate typically didn't peak and start to trend lower for another few months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/102820-Citi-vs-Earn.png))**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/qOJdagC.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/9KQPNXR.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 11.2.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/pj7pysD.png))\n\n&gt; # ***Monday 11.2.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/h2HgKHB.png))\n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/DRjtGSM.png))\n\n*****\n\n&gt; # ***Tuesday  11.3.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/aoPSp6k.png))\n\n&gt; # ***Tuesday 11.3.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/BKnNZhJ.png))\n\n*****\n\n&gt; # ***Wednesday 11.4.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK!](https://i.imgur.com/97DJGA7.png))\n\n&gt; # ***Wednesday 11.4.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/4k28zp5.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/lb9tHJr.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!](https://i.imgur.com/i7l5LTf.png))\n\n*****\n\n&gt; # ***Thursday 11.5.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/8prHmLC.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/jlZMuyc.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!](https://i.imgur.com/Xs5XIA3.png))\n\n&gt; # ***Thursday 11.5.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/WX3Qbv9.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/kI5jFhr.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!](https://i.imgur.com/u6ZNU50.png))\n\n*****\n\n&gt; # ***Friday 11.6.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/aP1LaQn.png))\n\n*****\n\n&gt; # ***Friday 11.6.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/k3lJ7Qz.png))\n\n*****\n\n&gt; # PayPal $186.13\n**PayPal (PYPL)** is confirmed to report earnings at approximately 4:15 PM ET on Monday, November 2, 2020. The consensus earnings estimate is $0.95 per share on revenue of $5.40 billion and the Earnings Whisper ® number is $1.01 per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat The company's guidance was for earnings of approximately $0.76 per share. Consensus estimates are for year-over-year earnings growth of 58.33% with revenue increasing by 23.34%. Short interest has increased by 20.8% since the company's last earnings release while the stock has drifted lower by 3.0% from its open following the earnings release to be 21.7% above its 200 day moving average of $152.96. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, October 12, 2020 there was some notable buying of 10,377 contracts of the $210.00 call and 10,021 contracts of the $210.00 put expiring on Friday, December 18, 2020. Option traders are pricing in a 9.4% move on earnings and the stock has averaged a 5.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=PYPL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Square, Inc. $154.88\n**Square, Inc. (SQ)** is confirmed to report earnings at approximately 7:15 PM ET on Thursday, November 5, 2020. The consensus earnings estimate is $0.17 per share on revenue of $1.99 billion and the Earnings Whisper ® number is $0.23 per share. Investor sentiment going into the company's earnings release has 79% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 34.62% with revenue increasing by 57.13%. Short interest has decreased by 5.7% since the company's last earnings release while the stock has drifted higher by 1.1% from its open following the earnings release to be 46.1% above its 200 day moving average of $106.05. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, October 19, 2020 there was some notable buying of 4,158 contracts of the $155.00 put expiring on Friday, November 20, 2020. Option traders are pricing in a 11.3% move on earnings and the stock has averaged a 7.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SQ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Alibaba Group Holding Ltd. $304.69\n**Alibaba Group Holding Ltd. (BABA)** is confirmed to report earnings at approximately 6:35 AM ET on Thursday, November 5, 2020. The consensus earnings estimate is $2.11 per share on revenue of $22.89 billion and the Earnings Whisper ® number is $2.25 per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 17.88% with revenue increasing by 37.47%. Short interest has increased by 25.7% since the company's last earnings release while the stock has drifted higher by 18.6% from its open following the earnings release to be 29.8% above its 200 day moving average of $234.74. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, October 29, 2020 there was some notable buying of 35,528 contracts of the $420.00 call expiring on Friday, October 15, 2021. Option traders are pricing in a 8.3% move on earnings and the stock has averaged a 2.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BABA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Clorox Co. $207.25\n**Clorox Co. (CLX)** is confirmed to report earnings at approximately 6:30 AM ET on Monday, November 2, 2020. The consensus earnings estimate is $2.34 per share on revenue of $1.74 billion and the Earnings Whisper ® number is $2.50 per share. Investor sentiment going into the company's earnings release has 71% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 47.17% with revenue increasing by 15.54%. Short interest has increased by 20.7% since the company's last earnings release while the stock has drifted lower by 10.0% from its open following the earnings release to be 4.0% above its 200 day moving average of $199.34. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, October 30, 2020 there was some notable buying of 885 contracts of the $187.50 put expiring on Friday, November 6, 2020. Option traders are pricing in a 6.0% move on earnings and the stock has averaged a 3.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CLX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Roku Inc $202.40\n**Roku Inc (ROKU)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, November 5, 2020. The consensus estimate is for a loss of $0.41 per share on revenue of $354.45 million and the Earnings Whisper ® number is ($0.30) per share. Investor sentiment going into the company's earnings release has 74% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 86.36% with revenue increasing by 35.84%. The stock has drifted higher by 26.8% from its open following the earnings release to be 45.4% above its 200 day moving average of $139.23. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, October 30, 2020 there was some notable buying of 8,002 contracts of the $120.00 put expiring on Friday, January 15, 2021. Option traders are pricing in a 13.2% move on earnings and the stock has averaged a 14.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ROKU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Wayfair Inc. $248.03\n**Wayfair Inc. (W)** is confirmed to report earnings at approximately 7:00 AM ET on Tuesday, November 3, 2020. The consensus earnings estimate is $0.80 per share on revenue of $3.70 billion and the Earnings Whisper ® number is $1.41 per share. Investor sentiment going into the company's earnings release has 65% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 137.04% with revenue increasing by 60.49%. Short interest has decreased by 14.5% since the company's last earnings release while the stock has drifted lower by 12.7% from its open following the earnings release to be 34.7% above its 200 day moving average of $184.13. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, October 22, 2020 there was some notable buying of 1,001 contracts of the $130.00 put expiring on Friday, January 20, 2023. Option traders are pricing in a 15.7% move on earnings and the stock has averaged a 10.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=W&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Peloton Interactive $110.21\n**Peloton Interactive (PTON)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, November 5, 2020. The consensus earnings estimate is $0.13 per share on revenue of $727.51 million and the Earnings Whisper ® number is $0.21 per share. Investor sentiment going into the company's earnings release has 75% expecting an earnings beat The company's guidance was for revenue of $720.00 million to $730.00 million. Consensus estimates are for year-over-year earnings growth of 110.08% with revenue increasing by 219.08%. Short interest has increased by 99.3% since the company's last earnings release while the stock has drifted higher by 12.3% from its open following the earnings release to be 94.6% above its 200 day moving average of $56.63. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, October 30, 2020 there was some notable buying of 5,404 contracts of the $135.00 call expiring on Friday, November 20, 2020. Option traders are pricing in a 13.9% move on earnings and the stock has averaged a 9.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=PTON&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # QUALCOMM Incorporated $123.36\n**QUALCOMM Incorporated (QCOM)** is confirmed to report earnings at approximately 4:00 PM ET on Wednesday, November 4, 2020. The consensus earnings estimate is $1.22 per share on revenue of $5.94 billion and the Earnings Whisper ® number is $1.27 per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat The company's guidance was for earnings of $1.05 to $1.25 per share. Consensus estimates are for year-over-year earnings growth of 74.29% with revenue increasing by 23.39%. Short interest has decreased by 10.1% since the company's last earnings release while the stock has drifted higher by 20.4% from its open following the earnings release to be 32.1% above its 200 day moving average of $93.40. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, October 29, 2020 there was some notable buying of 3,990 contracts of the $136.00 call expiring on Friday, November 20, 2020. Option traders are pricing in a 8.6% move on earnings and the stock has averaged a 4.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=QCOM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Wingstop Inc. $116.33\n**Wingstop Inc. (WING)** is confirmed to report earnings at approximately 7:30 AM ET on Monday, November 2, 2020. The consensus earnings estimate is $0.32 per share on revenue of $63.60 million and the Earnings Whisper ® number is $0.43 per share. Investor sentiment going into the company's earnings release has 50% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 60.00% with revenue increasing by 27.52%. Short interest has decreased by 12.3% since the company's last earnings release while the stock has drifted lower by 17.2% from its open following the earnings release to be 5.9% below its 200 day moving average of $123.60. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 9.2% move on earnings and the stock has averaged a 5.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=WING&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Skyworks Solutions, Inc. $141.29\n**Skyworks Solutions, Inc. (SWKS)** is confirmed to report earnings at approximately 4:00 PM ET on Monday, November 2, 2020. The consensus earnings estimate is $1.52 per share on revenue of $840.22 million and the Earnings Whisper ® number is $1.59 per share. Investor sentiment going into the company's earnings release has 70% expecting an earnings beat The company's guidance was for earnings of approximately $1.51 per share on revenue of $830.00 million to $850.00 million. Consensus estimates are for year-over-year earnings growth of 2.70% with revenue increasing by 1.55%. Short interest has increased by 24.7% since the company's last earnings release while the stock has drifted higher by 7.5% from its open following the earnings release to be 15.4% above its 200 day moving average of $122.43. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, October 30, 2020 there was some notable buying of 2,358 contracts of the $149.00 call expiring on Friday, November 6, 2020. Option traders are pricing in a 8.9% move on earnings and the stock has averaged a 2.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SWKS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/stocks.",
        "subreddit": "stocks",
        "title": "Wall Street Week Ahead for the trading week beginning November 2nd, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/jlim4i/wall_street_week_ahead_for_the_trading_week/",
        "created": 1604180714.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1604152053,
        "id": "jline1",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Good Friday evening to all of you here on r/smallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading month ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning November 2nd, 2020.\n\n# **Investors are hoping for a clear presidential and Senate election outcome to end the sell-off  - [(Source)](https://www.cnbc.com/2020/10/30/investors-are-hoping-for-a-clear-presidential-and-senate-election-outcome-to-end-the-sell-off.html)**\n*****\n&gt; The best hope for markets in the week ahead is that there is a clear cut winner in Tuesday’s presidential election.\n*****\n&gt; The election looms large as the biggest wild card risk for markets, and there is a real concern that no outcome could lead to a period of uncertainty and turbulence for markets and the economy. On the other hand, some strategists say a clear winner and quick concession by the other candidate could lead to a relief rally. Also a worry is that Senate elections could be unresolved, which means it may not be known which party holds the majority.\n*****\n&gt; “If there’s no clear winner, it will be negative for risk assets...The market is really worried about not having clarity after the election. They’re worried about it dragging out four weeks as the results are contested,” said Ian Lyngen, head of U.S. rates strategy at BMO. “The overall landscape is not a political one. It’s that we’re in a pandemic, and we don’t want an uncertain election outcome that leaves the country concerned about leadership.”\n*****\n&gt; Stocks closed out October on a sour note, losing about 6% for the week, the worst performance since March, when the pandemic first shut down the economy. Strategists say the coronavirus is again worrying the market, as major European countries go into partial lockdowns, and the U.S. faces record numbers of new cases.\n*****\n&gt; Lyngen said he does not expect the markets to react as much if it’s only the fate of the Senate that is undetermined. But that is still very important, and if it’s not clear which party has a majority for days or even weeks, that would cast doubt on the ability of whichever candidate wins the presidency to pursue their policy agenda.\n*****\n&gt; # Senate key for stimulus\n&gt; The Senate is also key to how much money will be poured into the economy to help battle the impact of the virus. For instance, if former Vice President Joe Biden wins the White House, but Democrats do not reclaim the Senate, he will likely have to compromise on a smaller stimulus package and would not be able to implement tax increases. If President Donald Trump is re-elected and faces a newly Democratic Senate alongside the Democratic House, he will likely face push back on many issues though they may agree on a large stimulus package.\n*****\n&gt; As of Friday, Biden was leading Trump in the polls by 7.8 percentage points in the RealClearPolitics average of major polls. Democrats also appear likely to take the Senate, but some races are very tight.\n*****\n&gt; Bank of America strategists note that the Senate races are close with a few seats that could flip. Seven Republican seats are currently rated as toss-ups with four in battleground states, where they could be lost if there’s a strong Democratic surge. There could also be a clear majority, but still uncertainty in terms of final makeup.\n*****\n&gt; “The overall composition of the Senate is unlikely to be determined until sometime in January due to election rules in Georgia which stipulates the race goes to a run off if no candidates garners 50% majority in the general election and currently no candidate is projected” to hit that threshold, the BofA strategists wrote.\n*****\n&gt; The strategists say the timing of the results is unclear due to early voting but high volumes of mail-in ballots, which cannot be counted in some states until election day.\n*****\n&gt; “A short delay in the election result should have a trivial impact on the economy but a multi-week contested election could drag down H1 GDP growth by 0.5-1.0 pp,” according to BofA strategists. “Once there is a winner, the focus turns to stimulus.”\n*****\n&gt; # Watch bond yields\n&gt; That could mean bond yields will continue their move higher in the coming week. Yields have been rising on the idea that there will be some kind of stimulus after the election, and it will mean more U.S. debt and higher interest rates.\n*****\n&gt; “We expect rates to shift higher by 5 to 25 bps after the election outcome is known due to expectations for fiscal stimulus and improved growth prospects,” the BofA strategists wrote. The 10-year Treasury yield was at 0.86% Friday.\n*****\n&gt; However, if the election outcome is not known for awhile, the strategists said a contested outcome could push the 10-year yield materially lower.\n*****\n&gt; If there is a contested election, the strategist expect stocks to trade lower, but it would be a buying opportunity since the market typically recovers from headline-related losses within six months.\n*****\n&gt; “We expect a clear outcome to be neutral to positive for the market in the near term, except under a Biden win with a split Congress, which could potentially lead to continued gridlock in fiscal stimulus talks,” the BofA strategists added.\n*****\n&gt; Besides the election, there is also a Fed meeting, expected to end Thursday with no new announcements though it is likely the Fed will emphasize it will keep policy easy for a long time as the economy heals. The October employment report is expected on Friday and is expected to show continued job gains, after September’s 661,000 nonfarm payrolls.\n*****\n&gt; Jonathan Golub, chief U.S. equities strategist at Credit Suisse, does not expect the market to react much if the election outcome is as expected, with Biden winning and Democrats taking the Senate.\n*****\n&gt; “The most likely outcome is already discounted by the market. The best assumption is if you don’t have a big surprise, the market should do nothing,” Golub said, adding the most volatile week could be the one just ending. “This week is the one with the turmoil, and I don’t think the next week is the one where the market’s going to be crazy.”\n*****\n&gt; Golub said investors may be too worried about the election being unresolved and the real issue disturbing the market this past week is the growing spread of the virus.\n*****\n&gt; “There’s no rule we need to declare a victor,” said Golub. “We have four or five weeks. The market may not love that near-term indecision, but the system is set up to allow for it, and as long as things don’t go off the rails, and they really shouldn’t, this concern about a contested election is probably overblown as an investor issue.”\n*****\n&gt; Golub said there’s a greater chance that the winner of the presidency is known before the Senate. “The chances are that we’ll at least know directionally where the power sits, but that could take a little longer and the market may be a little uncomfortable with that,” he said.\n*****\n&gt; # Earnings reports\n&gt; Dozens of companies report earnings in the week ahead, and Golub said corporate profits are a bright spot for the market. The third quarter results so far are showing earnings down about 10%, compared to earlier forecasts of more than 20%, according to Refinitiv.\n*****\n&gt; “The reality is the economy is robust. 55% of the market cap of the S&amp;P has higher earnings in 2020 than in 2019. More than half the market is acting like there’s no recession, no downturn,” Golub said.\n*****\n&gt; Golub said both Trump and Biden would push for fiscal stimulus, but while the market is clear on where Trump stands it does not know that much about Biden, if he were to win. “It is going to take some time to get clarity on which of his policy initiatives are going to happen. I don’t believe he’s going to implement these tax increases he’s talking about right away. I think the economy is too frail,” said Golub.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/TQBrNag.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/LrQZHOj.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/WbqKDDT.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/zqi6l3G.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/9q0jEby.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/xGuEP7D.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/2SrRdkk.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/tCh05mj.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/qOJdagC.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/KhE54Ws.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/rrDYFK6.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/QEbWDb7.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/zBMyLqA.png))**\n\n*****\n\n&gt; # November Almanac: Usually a Top Month in Election Years\n\n&gt; November maintains its status among the top performing months as fourth-quarter cash inflows from institutions drive November to lead the best consecutive three-month span November-January. However, the month has taken hits during bear markets and November 2000, down –22.9% (undecided election and a nascent bear), was NASDAQ’s second worst month on record—only October 1987 was worse.\n\n&gt; November begins the “Best Six Months” for the DJIA and S&amp;P 500, and the “Best Eight Months” for NASDAQ. Small caps come into favor during November, but don’t really take off until the last two weeks of the year. November is the number-two DJIA (since 1950), NASDAQ (since 1971) and Russell 2000 (since 1979) month. November is best for S&amp;P 500 (since 1950) and Russell 1000 (since 1979).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/43b1cac3b88cfc6f79063d86ae9abfef/57e8d7f397fbeeb8-7f/s400x600/a8bff5e250ce7b9735197427f72d665b61fe0614.jpg))**\n\n&gt; November is a mixed bag in presidential election years. DJIA has advanced in 10 of the last 17 election years since 1952 with an average gain of 1.7%. Significant DJIA declines occurred in 2008 (-5.3%) and 2000 (-5.1%). For S&amp;P 500 November ranks best with a similar record to DJIA. NASDAQ, Russell 1000 and Russell 2000 are not as strong ranking #7, #3 and #6 respectively. Fewer years of data (12 for NASDAQ and 10 for Russell indices) combined with sizable losses in 2000 and 2008 drag down rankings and average gains when compared to DJIA and S&amp;P 500.\n\n*****\n\n&gt; # Whatever the Outcome, Day Before Election Day Historically Bullish\n\n&gt; Looking back at the last seventeen presidential elections since 1952, the day before Election Day has a clear bullish bias. DJIA and S&amp;P 500 have declined just three times and average gains of 0.51% and 0.44% respectively. NASDAQ and Russell 2000 are slightly weaker, but still bullish. Election Day (or the day after prior to 1980) leans bullish, but with a greater frequency of losses. Incumbent party victories are shaded in light grey.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/d030ea31abcb4bd298b596da0d2b2b4d/3d5b7e5afba3a9a5-14/s500x750/a8b43d243e3c57890dde8a0682726a1da587e5d2.jpg))**\n\n*****\n\n&gt; # GDP Bounces Back\n\n&gt; The outbreak of COVID-19 and the subsequent lockdowns triggered the largest quarter over-quarter decline in gross domestic product (GDP) since WWII, so perhaps it comes as no surprise that the following quarter tallied the sharpest rebound in that same time period. GDP expanded 33.1% on an annualized basis in the third quarter, ahead of Bloomberg consensus expectations of 32%, fueled by the continued reopening of businesses and reversing much of the economic fallout stemming from COVID-19-related lockdowns.\n\n&gt; As shown in the LPL Chart of the Day, consumer spending—the largest contributor to GDP in the US and roughly 70% of economic output—rebounded in a powerful fashion in the third quarter.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/10/10.29.20-Blog-Chart.jpg?ssl=1))**\n\n&gt; However, spending numbers were uneven, with a considerably larger portion spent on goods rather than services—consistent with the continued behavioral and business restriction effects on these industries. Further, the timing of spending was also fairly uneven, as much of the growth in consumer spending came in the early weeks of the third quarter and tapered off in recent weeks where the effects of fiscal stimulus and rising new COVID-19 cases influenced consumer behavior.\n\n&gt; “GDP rebounded stronger than expected in the third quarter, but the big question on everyone’s mind is whether the economy can remain on firm ground in the fourth quarter and into 2021,” stated LPL Chief Market Strategist Ryan Detrick. “Barring a new round of fiscal stimulus, it’s likely that growth will taper off in the fourth quarter, but we still don’t expect a double-dip recession.”\n\n&gt; Regardless of the state of economic momentum, it is remarkable that GDP is already only about 3.5% away from recovering the entire pandemic losses. The resilience of US consumers has been the top story of the recovery, even with the historic fiscal stimulus.\n\n&gt; The surge in growth in the third quarter may also have political implications. As we noted in our recent Weekly Market Commentary: Are the Polls Wrong Again? the average GDP growth in the second and third quarters of election years can have predictive power for who wins the election, with stronger growth favoring incumbents. However, we also point out that recessions close to elections have favored challengers, sending some conflicting market signals heading into Election Day!\n\n&gt; As the economy moves forward in the fourth quarter, we’ll continue to monitor real-time data indicators to gauge the impact of rising COVID-19 cases on consumer and business behavior.\n\n*****\n\n&gt; # Slight Dip In Consumer Confidence\n\n&gt; Consumer Confidence for the month of October was released earlier today and showed a slight dip relative to September. The headline index dropped from 101.3 down to 100.9 compared to expectations for a reading of 102.0. Given the rising number of cases and the upcoming election, it's not too surprising to see confidence come in a bit, so a decline of this magnitude isn't all that concerning. What is notable, though, is that even though Consumer Confidence remains right near post-COVID highs, it hasn't bounced all that much off its lows.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/102720-CC.png))**\n\n&gt; Breaking out this month's report by the sentiment of consumers towards both how they feel now and what they expect in the future, the Present Situation Index rose from 98.9 up to 104.6 while the Expectations component dropped from 102.9 down to 98.4. The drop in the Expectations component of this month's report looks like it's a partial reflection of growing uncertainty regarding COVID and the election as we head into the colder months of November and December.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/102720-CC-P-Exp.png))**\n\n&gt; In looking at the spread between Present Conditions and Expectations, it moved back into positive territory this month after dropping deeply into negative territory earlier this year. What's interesting to note about current levels is that in every prior recession since the late 1960s, by the time the spread moved back into positive territory after turning negative, the recession was already well in the rearview mirror.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/102720-CC-Spread.png))**\n\n&gt; Sentiment towards jobs also suggests a relatively positive trend. At the current level of 26.5, the Jobs Plentiful index is still far from its 40+ reading before COVID, but it did increase again in October as it has now done in four of the last five months. While it's by no means a strong reading at current levels, it hasn't been getting worse either. Looking at past recessions, it wasn't until well after the recession ended that the Jobs Plentiful index started to rebound.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/102720-CC-Jobs-plentiful.png))**\n\n*****\n\n&gt; # Industrials Malfunction\n\n&gt; With poorly received earnings reports from 3M (MMM) and Caterpillar (CAT) and general weakness overall, Tuesday was just a bad day for the Industrials sector. Just five stocks in the sector were up on the day and the sector overall was down 2.2% compared to the S&amp;P 500 which was down just 0.3%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/102720-Industrials-Sector-Perfoamnces.png))**\n\n&gt; The chart below shows the daily performance spread between the S&amp;P 500 and the Industrials sector over the last year. Positive readings indicate the S&amp;P 500 outperforming the Industrials sector and negative readings indicate that the Industrials sector outperformed the S&amp;P 500. With the S&amp;P 500 outperforming the Industrials sector by 1.88 percentage points on Tuesday, it was the widest performance gap (in the S&amp;P 500's favor) since 9/21. Even more notable, though, was the fact that there have only been three other days in the last year where the Industrials sector underperformed the S&amp;P 500 by a wider margin.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/102720-Industrials-Sector-Spread.png))**\n\n&gt; For the sector as a whole, it currently finds itself in a precarious position. After breaking its uptrend off the March lows on 9/21, the Industrials sector bounced back and rallied back to its former uptrend line, and while it just recently made a post-COVID high, the rally ran out of steam right at the former uptrend line. In the pullback that has followed, the sector closed yesterday right at a secondary line of support from the June lows. If this level doesn't hold through today's close, the technical picture for the sector will look a lot different than the way it looked just a few weeks ago.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/102720-Industrials.png))**\n\n*****\n\n&gt; # All or Nothing Days Back on the Rise\n\n&gt; The S&amp;P 500's A/D line for the day (number of advancing stocks minus number of declining stocks) currently stands at about -460, which would be the weakest one-day reading since June. Today's A/D reading also is notable in that it represents the tenth 'all or nothing' day for the S&amp;P 500 since the index's last peak on 9/2. We consider 'all or nothing' days to be those days where the S&amp;P 500's daily A/D reading is either above +400 or below -400. To put the frequency of 'all or nothing' days into perspective, while there have been ten in the last forty trading days, in the forty trading days before that there weren't any.\n\n&gt; The chart below shows the percentage of 'all or nothing' days on a 50-day rolling basis. The current pace of 20% is still well off the extraordinary level of 44% we saw back in late April/early May, but it is still relatively high.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/102820-AllorNothing-50.png))**\n\n&gt; Including today, there have now been 41 'all or nothing' days so far in 2020. If the current pace for the entire year keeps up that will put us on pace for fifty days this year. If the current pace keeps up and we do reach 50 'all or nothing' days this year, it will be the third-highest annual total behind 2011 (70) and 2008 (52), but even if there isn't another 'all or nothing' day this year, 2020 would still rank fifth behind the years from 2008 through 2011.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/102820-AllorNothing-All.png))**\n\n*****\n\n&gt; # Earnings and Economics Diverge\n\n&gt; This earnings season, we have frequently mentioned how beat rates have continued to rise relentlessly. From our Earnings Explorer database, our 3-month rolling EPS beat rate currently stands at a record high of 78.19%. That is nearly 20 percentage points higher than the historical average of 59.37%. The sales beat rate is not at a record, but it too is elevated at 69.09% versus the historical average of 56.45%. That means that of the companies that have reported earnings over the past three months, a massive proportion are exceeding consensus sales and EPS estimates.\n\n&gt; While earnings beat rates have continued to grind higher, economic data is another story. The Citi Economic Surprise Index basically tracks macroeconomic data and how it comes in relative to forecasts. Higher readings indicate the data is trending stronger than expected and vice versa for negative readings. With the unprecedented shock to macroeconomic data in 2020, this index for the United States plummeted, but that was followed by a sharp rebound to record highs. Although the index for the US remains higher than anything prior to the pandemic, it has been heading lower since the summer. In other words, economic data is still coming in better than expected but is not massively exceeding expectations to the degree it was back in the spring and early summer.\n\n&gt; The two charts below compare EPS and revenue beat rates to the Citi Economic Surprise Index. Comparing the two series to the Citi Economic Surprise Index shows that while EPS beat rate has been somewhat connected (correlation: +0.325)) there is very little in the way of correlation between the Surprise Index and the revenue beat rate (+0.084). Given that EPS figures are typically easier to massage than revenues, that was a bit of a surprise. What is notable about the recent decline in the Citi Economic Surprise Index is that in prior periods where it became elevated and then pulled back as it did in (2003, 2009, and 2018), the EPS beat rate typically didn't peak and start to trend lower for another few months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/102820-Citi-vs-Earn.png))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending October 30th, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=MZW-FyZvJ-g))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 11.1.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$PYPL** \n&gt; * **$SQ** \n&gt; * **$BABA** \n&gt; * **$CLX** \n&gt; * **$ROKU** \n&gt; * **$W** \n&gt; * **$PTON** \n&gt; * **$QCOM** \n&gt; * **$WING** \n&gt; * **$SWKS** \n&gt; * **$CVS** \n&gt; * **$GOLD** \n&gt; * **$NET** \n&gt; * **$SPCE** \n&gt; * **$GM** \n&gt; * **$HZNP** \n&gt; * **$LL** \n&gt; * **$MPC** \n&gt; * **$AZN** \n&gt; * **$WM** \n&gt; * **$TTD** \n&gt; * **$EL** \n&gt; * **$DBX** \n&gt; * **$AYX** \n&gt; * **$ON** \n&gt; * **$ZNGA** \n&gt; * **$CWH** \n&gt; * **$AMCX** \n&gt; * **$MELI** \n&gt; * **$SEDG** \n&gt; * **$REGN** \n&gt; * **$CPE** \n&gt; * **$LDOS** \n&gt; * **$AMRN** \n&gt; * **$UBER** \n&gt; * **$BMY** \n&gt; * **$KPTI** \n&gt; * **$LITE** \n&gt; * **$HUM** \n&gt; * **$WEN** \n&gt; * **$BHC** \n&gt; * **$MCK** \n&gt; * **$CPLP**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/qOJdagC.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/9KQPNXR.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 11.2.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/pj7pysD.png))\n\n&gt; # ***Monday 11.2.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/h2HgKHB.png))\n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/DRjtGSM.png))\n\n*****\n\n&gt; # ***Tuesday  11.3.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/aoPSp6k.png))\n\n&gt; # ***Tuesday 11.3.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/BKnNZhJ.png))\n\n*****\n\n&gt; # ***Wednesday 11.4.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK!](https://i.imgur.com/97DJGA7.png))\n\n&gt; # ***Wednesday 11.4.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/4k28zp5.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/lb9tHJr.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!](https://i.imgur.com/i7l5LTf.png))\n\n*****\n\n&gt; # ***Thursday 11.5.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/8prHmLC.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/jlZMuyc.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!](https://i.imgur.com/Xs5XIA3.png))\n\n&gt; # ***Thursday 11.5.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/WX3Qbv9.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/kI5jFhr.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!](https://i.imgur.com/u6ZNU50.png))\n\n*****\n\n&gt; # ***Friday 11.6.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/aP1LaQn.png))\n\n*****\n\n&gt; # ***Friday 11.6.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/k3lJ7Qz.png))\n\n*****\n\n&gt; # PayPal $186.13\n**PayPal (PYPL)** is confirmed to report earnings at approximately 4:15 PM ET on Monday, November 2, 2020. The consensus earnings estimate is $0.95 per share on revenue of $5.40 billion and the Earnings Whisper ® number is $1.01 per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat The company's guidance was for earnings of approximately $0.76 per share. Consensus estimates are for year-over-year earnings growth of 58.33% with revenue increasing by 23.34%. Short interest has increased by 20.8% since the company's last earnings release while the stock has drifted lower by 3.0% from its open following the earnings release to be 21.7% above its 200 day moving average of $152.96. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, October 12, 2020 there was some notable buying of 10,377 contracts of the $210.00 call and 10,021 contracts of the $210.00 put expiring on Friday, December 18, 2020. Option traders are pricing in a 9.4% move on earnings and the stock has averaged a 5.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=PYPL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Square, Inc. $154.88\n**Square, Inc. (SQ)** is confirmed to report earnings at approximately 7:15 PM ET on Thursday, November 5, 2020. The consensus earnings estimate is $0.17 per share on revenue of $1.99 billion and the Earnings Whisper ® number is $0.23 per share. Investor sentiment going into the company's earnings release has 79% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 34.62% with revenue increasing by 57.13%. Short interest has decreased by 5.7% since the company's last earnings release while the stock has drifted higher by 1.1% from its open following the earnings release to be 46.1% above its 200 day moving average of $106.05. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, October 19, 2020 there was some notable buying of 4,158 contracts of the $155.00 put expiring on Friday, November 20, 2020. Option traders are pricing in a 11.3% move on earnings and the stock has averaged a 7.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SQ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Alibaba Group Holding Ltd. $304.69\n**Alibaba Group Holding Ltd. (BABA)** is confirmed to report earnings at approximately 6:35 AM ET on Thursday, November 5, 2020. The consensus earnings estimate is $2.11 per share on revenue of $22.89 billion and the Earnings Whisper ® number is $2.25 per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 17.88% with revenue increasing by 37.47%. Short interest has increased by 25.7% since the company's last earnings release while the stock has drifted higher by 18.6% from its open following the earnings release to be 29.8% above its 200 day moving average of $234.74. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, October 29, 2020 there was some notable buying of 35,528 contracts of the $420.00 call expiring on Friday, October 15, 2021. Option traders are pricing in a 8.3% move on earnings and the stock has averaged a 2.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BABA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Clorox Co. $207.25\n**Clorox Co. (CLX)** is confirmed to report earnings at approximately 6:30 AM ET on Monday, November 2, 2020. The consensus earnings estimate is $2.34 per share on revenue of $1.74 billion and the Earnings Whisper ® number is $2.50 per share. Investor sentiment going into the company's earnings release has 71% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 47.17% with revenue increasing by 15.54%. Short interest has increased by 20.7% since the company's last earnings release while the stock has drifted lower by 10.0% from its open following the earnings release to be 4.0% above its 200 day moving average of $199.34. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, October 30, 2020 there was some notable buying of 885 contracts of the $187.50 put expiring on Friday, November 6, 2020. Option traders are pricing in a 6.0% move on earnings and the stock has averaged a 3.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CLX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Roku Inc $202.40\n**Roku Inc (ROKU)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, November 5, 2020. The consensus estimate is for a loss of $0.41 per share on revenue of $354.45 million and the Earnings Whisper ® number is ($0.30) per share. Investor sentiment going into the company's earnings release has 74% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 86.36% with revenue increasing by 35.84%. The stock has drifted higher by 26.8% from its open following the earnings release to be 45.4% above its 200 day moving average of $139.23. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, October 30, 2020 there was some notable buying of 8,002 contracts of the $120.00 put expiring on Friday, January 15, 2021. Option traders are pricing in a 13.2% move on earnings and the stock has averaged a 14.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ROKU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Wayfair Inc. $248.03\n**Wayfair Inc. (W)** is confirmed to report earnings at approximately 7:00 AM ET on Tuesday, November 3, 2020. The consensus earnings estimate is $0.80 per share on revenue of $3.70 billion and the Earnings Whisper ® number is $1.41 per share. Investor sentiment going into the company's earnings release has 65% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 137.04% with revenue increasing by 60.49%. Short interest has decreased by 14.5% since the company's last earnings release while the stock has drifted lower by 12.7% from its open following the earnings release to be 34.7% above its 200 day moving average of $184.13. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, October 22, 2020 there was some notable buying of 1,001 contracts of the $130.00 put expiring on Friday, January 20, 2023. Option traders are pricing in a 15.7% move on earnings and the stock has averaged a 10.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=W&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Peloton Interactive $110.21\n**Peloton Interactive (PTON)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, November 5, 2020. The consensus earnings estimate is $0.13 per share on revenue of $727.51 million and the Earnings Whisper ® number is $0.21 per share. Investor sentiment going into the company's earnings release has 75% expecting an earnings beat The company's guidance was for revenue of $720.00 million to $730.00 million. Consensus estimates are for year-over-year earnings growth of 110.08% with revenue increasing by 219.08%. Short interest has increased by 99.3% since the company's last earnings release while the stock has drifted higher by 12.3% from its open following the earnings release to be 94.6% above its 200 day moving average of $56.63. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, October 30, 2020 there was some notable buying of 5,404 contracts of the $135.00 call expiring on Friday, November 20, 2020. Option traders are pricing in a 13.9% move on earnings and the stock has averaged a 9.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=PTON&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # QUALCOMM Incorporated $123.36\n**QUALCOMM Incorporated (QCOM)** is confirmed to report earnings at approximately 4:00 PM ET on Wednesday, November 4, 2020. The consensus earnings estimate is $1.22 per share on revenue of $5.94 billion and the Earnings Whisper ® number is $1.27 per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat The company's guidance was for earnings of $1.05 to $1.25 per share. Consensus estimates are for year-over-year earnings growth of 74.29% with revenue increasing by 23.39%. Short interest has decreased by 10.1% since the company's last earnings release while the stock has drifted higher by 20.4% from its open following the earnings release to be 32.1% above its 200 day moving average of $93.40. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, October 29, 2020 there was some notable buying of 3,990 contracts of the $136.00 call expiring on Friday, November 20, 2020. Option traders are pricing in a 8.6% move on earnings and the stock has averaged a 4.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=QCOM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Wingstop Inc. $116.33\n**Wingstop Inc. (WING)** is confirmed to report earnings at approximately 7:30 AM ET on Monday, November 2, 2020. The consensus earnings estimate is $0.32 per share on revenue of $63.60 million and the Earnings Whisper ® number is $0.43 per share. Investor sentiment going into the company's earnings release has 50% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 60.00% with revenue increasing by 27.52%. Short interest has decreased by 12.3% since the company's last earnings release while the stock has drifted lower by 17.2% from its open following the earnings release to be 5.9% below its 200 day moving average of $123.60. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 9.2% move on earnings and the stock has averaged a 5.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=WING&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Skyworks Solutions, Inc. $141.29\n**Skyworks Solutions, Inc. (SWKS)** is confirmed to report earnings at approximately 4:00 PM ET on Monday, November 2, 2020. The consensus earnings estimate is $1.52 per share on revenue of $840.22 million and the Earnings Whisper ® number is $1.59 per share. Investor sentiment going into the company's earnings release has 70% expecting an earnings beat The company's guidance was for earnings of approximately $1.51 per share on revenue of $830.00 million to $850.00 million. Consensus estimates are for year-over-year earnings growth of 2.70% with revenue increasing by 1.55%. Short interest has increased by 24.7% since the company's last earnings release while the stock has drifted higher by 7.5% from its open following the earnings release to be 15.4% above its 200 day moving average of $122.43. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, October 30, 2020 there was some notable buying of 2,358 contracts of the $149.00 call expiring on Friday, November 6, 2020. Option traders are pricing in a 8.9% move on earnings and the stock has averaged a 2.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SWKS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/smallstreetbets.",
        "subreddit": "smallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning November 2nd, 2020",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/jline1/wall_street_week_ahead_for_the_trading_week/",
        "created": 1604180853.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1604151981,
        "id": "jlimqk",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/wallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading month ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning November 2nd, 2020.\n\n# **Investors are hoping for a clear presidential and Senate election outcome to end the sell-off  - [(Source)](https://www.cnbc.com/2020/10/30/investors-are-hoping-for-a-clear-presidential-and-senate-election-outcome-to-end-the-sell-off.html)**\n*****\n&gt; The best hope for markets in the week ahead is that there is a clear cut winner in Tuesday’s presidential election.\n*****\n&gt; The election looms large as the biggest wild card risk for markets, and there is a real concern that no outcome could lead to a period of uncertainty and turbulence for markets and the economy. On the other hand, some strategists say a clear winner and quick concession by the other candidate could lead to a relief rally. Also a worry is that Senate elections could be unresolved, which means it may not be known which party holds the majority.\n*****\n&gt; “If there’s no clear winner, it will be negative for risk assets...The market is really worried about not having clarity after the election. They’re worried about it dragging out four weeks as the results are contested,” said Ian Lyngen, head of U.S. rates strategy at BMO. “The overall landscape is not a political one. It’s that we’re in a pandemic, and we don’t want an uncertain election outcome that leaves the country concerned about leadership.”\n*****\n&gt; Stocks closed out October on a sour note, losing about 6% for the week, the worst performance since March, when the pandemic first shut down the economy. Strategists say the coronavirus is again worrying the market, as major European countries go into partial lockdowns, and the U.S. faces record numbers of new cases.\n*****\n&gt; Lyngen said he does not expect the markets to react as much if it’s only the fate of the Senate that is undetermined. But that is still very important, and if it’s not clear which party has a majority for days or even weeks, that would cast doubt on the ability of whichever candidate wins the presidency to pursue their policy agenda.\n*****\n&gt; # Senate key for stimulus\n&gt; The Senate is also key to how much money will be poured into the economy to help battle the impact of the virus. For instance, if former Vice President Joe Biden wins the White House, but Democrats do not reclaim the Senate, he will likely have to compromise on a smaller stimulus package and would not be able to implement tax increases. If President Donald Trump is re-elected and faces a newly Democratic Senate alongside the Democratic House, he will likely face push back on many issues though they may agree on a large stimulus package.\n*****\n&gt; As of Friday, Biden was leading Trump in the polls by 7.8 percentage points in the RealClearPolitics average of major polls. Democrats also appear likely to take the Senate, but some races are very tight.\n*****\n&gt; Bank of America strategists note that the Senate races are close with a few seats that could flip. Seven Republican seats are currently rated as toss-ups with four in battleground states, where they could be lost if there’s a strong Democratic surge. There could also be a clear majority, but still uncertainty in terms of final makeup.\n*****\n&gt; “The overall composition of the Senate is unlikely to be determined until sometime in January due to election rules in Georgia which stipulates the race goes to a run off if no candidates garners 50% majority in the general election and currently no candidate is projected” to hit that threshold, the BofA strategists wrote.\n*****\n&gt; The strategists say the timing of the results is unclear due to early voting but high volumes of mail-in ballots, which cannot be counted in some states until election day.\n*****\n&gt; “A short delay in the election result should have a trivial impact on the economy but a multi-week contested election could drag down H1 GDP growth by 0.5-1.0 pp,” according to BofA strategists. “Once there is a winner, the focus turns to stimulus.”\n*****\n&gt; # Watch bond yields\n&gt; That could mean bond yields will continue their move higher in the coming week. Yields have been rising on the idea that there will be some kind of stimulus after the election, and it will mean more U.S. debt and higher interest rates.\n*****\n&gt; “We expect rates to shift higher by 5 to 25 bps after the election outcome is known due to expectations for fiscal stimulus and improved growth prospects,” the BofA strategists wrote. The 10-year Treasury yield was at 0.86% Friday.\n*****\n&gt; However, if the election outcome is not known for awhile, the strategists said a contested outcome could push the 10-year yield materially lower.\n*****\n&gt; If there is a contested election, the strategist expect stocks to trade lower, but it would be a buying opportunity since the market typically recovers from headline-related losses within six months.\n*****\n&gt; “We expect a clear outcome to be neutral to positive for the market in the near term, except under a Biden win with a split Congress, which could potentially lead to continued gridlock in fiscal stimulus talks,” the BofA strategists added.\n*****\n&gt; Besides the election, there is also a Fed meeting, expected to end Thursday with no new announcements though it is likely the Fed will emphasize it will keep policy easy for a long time as the economy heals. The October employment report is expected on Friday and is expected to show continued job gains, after September’s 661,000 nonfarm payrolls.\n*****\n&gt; Jonathan Golub, chief U.S. equities strategist at Credit Suisse, does not expect the market to react much if the election outcome is as expected, with Biden winning and Democrats taking the Senate.\n*****\n&gt; “The most likely outcome is already discounted by the market. The best assumption is if you don’t have a big surprise, the market should do nothing,” Golub said, adding the most volatile week could be the one just ending. “This week is the one with the turmoil, and I don’t think the next week is the one where the market’s going to be crazy.”\n*****\n&gt; Golub said investors may be too worried about the election being unresolved and the real issue disturbing the market this past week is the growing spread of the virus.\n*****\n&gt; “There’s no rule we need to declare a victor,” said Golub. “We have four or five weeks. The market may not love that near-term indecision, but the system is set up to allow for it, and as long as things don’t go off the rails, and they really shouldn’t, this concern about a contested election is probably overblown as an investor issue.”\n*****\n&gt; Golub said there’s a greater chance that the winner of the presidency is known before the Senate. “The chances are that we’ll at least know directionally where the power sits, but that could take a little longer and the market may be a little uncomfortable with that,” he said.\n*****\n&gt; # Earnings reports\n&gt; Dozens of companies report earnings in the week ahead, and Golub said corporate profits are a bright spot for the market. The third quarter results so far are showing earnings down about 10%, compared to earlier forecasts of more than 20%, according to Refinitiv.\n*****\n&gt; “The reality is the economy is robust. 55% of the market cap of the S&amp;P has higher earnings in 2020 than in 2019. More than half the market is acting like there’s no recession, no downturn,” Golub said.\n*****\n&gt; Golub said both Trump and Biden would push for fiscal stimulus, but while the market is clear on where Trump stands it does not know that much about Biden, if he were to win. “It is going to take some time to get clarity on which of his policy initiatives are going to happen. I don’t believe he’s going to implement these tax increases he’s talking about right away. I think the economy is too frail,” said Golub.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/TQBrNag.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/LrQZHOj.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/WbqKDDT.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/zqi6l3G.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/9q0jEby.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/xGuEP7D.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/2SrRdkk.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/tCh05mj.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/qOJdagC.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/KhE54Ws.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/rrDYFK6.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/QEbWDb7.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/zBMyLqA.png))**\n\n*****\n\n&gt; # November Almanac: Usually a Top Month in Election Years\n\n&gt; November maintains its status among the top performing months as fourth-quarter cash inflows from institutions drive November to lead the best consecutive three-month span November-January. However, the month has taken hits during bear markets and November 2000, down –22.9% (undecided election and a nascent bear), was NASDAQ’s second worst month on record—only October 1987 was worse.\n\n&gt; November begins the “Best Six Months” for the DJIA and S&amp;P 500, and the “Best Eight Months” for NASDAQ. Small caps come into favor during November, but don’t really take off until the last two weeks of the year. November is the number-two DJIA (since 1950), NASDAQ (since 1971) and Russell 2000 (since 1979) month. November is best for S&amp;P 500 (since 1950) and Russell 1000 (since 1979).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/43b1cac3b88cfc6f79063d86ae9abfef/57e8d7f397fbeeb8-7f/s400x600/a8bff5e250ce7b9735197427f72d665b61fe0614.jpg))**\n\n&gt; November is a mixed bag in presidential election years. DJIA has advanced in 10 of the last 17 election years since 1952 with an average gain of 1.7%. Significant DJIA declines occurred in 2008 (-5.3%) and 2000 (-5.1%). For S&amp;P 500 November ranks best with a similar record to DJIA. NASDAQ, Russell 1000 and Russell 2000 are not as strong ranking #7, #3 and #6 respectively. Fewer years of data (12 for NASDAQ and 10 for Russell indices) combined with sizable losses in 2000 and 2008 drag down rankings and average gains when compared to DJIA and S&amp;P 500.\n\n*****\n\n&gt; # Whatever the Outcome, Day Before Election Day Historically Bullish\n\n&gt; Looking back at the last seventeen presidential elections since 1952, the day before Election Day has a clear bullish bias. DJIA and S&amp;P 500 have declined just three times and average gains of 0.51% and 0.44% respectively. NASDAQ and Russell 2000 are slightly weaker, but still bullish. Election Day (or the day after prior to 1980) leans bullish, but with a greater frequency of losses. Incumbent party victories are shaded in light grey.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/d030ea31abcb4bd298b596da0d2b2b4d/3d5b7e5afba3a9a5-14/s500x750/a8b43d243e3c57890dde8a0682726a1da587e5d2.jpg))**\n\n*****\n\n&gt; # GDP Bounces Back\n\n&gt; The outbreak of COVID-19 and the subsequent lockdowns triggered the largest quarter over-quarter decline in gross domestic product (GDP) since WWII, so perhaps it comes as no surprise that the following quarter tallied the sharpest rebound in that same time period. GDP expanded 33.1% on an annualized basis in the third quarter, ahead of Bloomberg consensus expectations of 32%, fueled by the continued reopening of businesses and reversing much of the economic fallout stemming from COVID-19-related lockdowns.\n\n&gt; As shown in the LPL Chart of the Day, consumer spending—the largest contributor to GDP in the US and roughly 70% of economic output—rebounded in a powerful fashion in the third quarter.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/10/10.29.20-Blog-Chart.jpg?ssl=1))**\n\n&gt; However, spending numbers were uneven, with a considerably larger portion spent on goods rather than services—consistent with the continued behavioral and business restriction effects on these industries. Further, the timing of spending was also fairly uneven, as much of the growth in consumer spending came in the early weeks of the third quarter and tapered off in recent weeks where the effects of fiscal stimulus and rising new COVID-19 cases influenced consumer behavior.\n\n&gt; “GDP rebounded stronger than expected in the third quarter, but the big question on everyone’s mind is whether the economy can remain on firm ground in the fourth quarter and into 2021,” stated LPL Chief Market Strategist Ryan Detrick. “Barring a new round of fiscal stimulus, it’s likely that growth will taper off in the fourth quarter, but we still don’t expect a double-dip recession.”\n\n&gt; Regardless of the state of economic momentum, it is remarkable that GDP is already only about 3.5% away from recovering the entire pandemic losses. The resilience of US consumers has been the top story of the recovery, even with the historic fiscal stimulus.\n\n&gt; The surge in growth in the third quarter may also have political implications. As we noted in our recent Weekly Market Commentary: Are the Polls Wrong Again? the average GDP growth in the second and third quarters of election years can have predictive power for who wins the election, with stronger growth favoring incumbents. However, we also point out that recessions close to elections have favored challengers, sending some conflicting market signals heading into Election Day!\n\n&gt; As the economy moves forward in the fourth quarter, we’ll continue to monitor real-time data indicators to gauge the impact of rising COVID-19 cases on consumer and business behavior.\n\n*****\n\n&gt; # Slight Dip In Consumer Confidence\n\n&gt; Consumer Confidence for the month of October was released earlier today and showed a slight dip relative to September. The headline index dropped from 101.3 down to 100.9 compared to expectations for a reading of 102.0. Given the rising number of cases and the upcoming election, it's not too surprising to see confidence come in a bit, so a decline of this magnitude isn't all that concerning. What is notable, though, is that even though Consumer Confidence remains right near post-COVID highs, it hasn't bounced all that much off its lows.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/102720-CC.png))**\n\n&gt; Breaking out this month's report by the sentiment of consumers towards both how they feel now and what they expect in the future, the Present Situation Index rose from 98.9 up to 104.6 while the Expectations component dropped from 102.9 down to 98.4. The drop in the Expectations component of this month's report looks like it's a partial reflection of growing uncertainty regarding COVID and the election as we head into the colder months of November and December.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/102720-CC-P-Exp.png))**\n\n&gt; In looking at the spread between Present Conditions and Expectations, it moved back into positive territory this month after dropping deeply into negative territory earlier this year. What's interesting to note about current levels is that in every prior recession since the late 1960s, by the time the spread moved back into positive territory after turning negative, the recession was already well in the rearview mirror.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/102720-CC-Spread.png))**\n\n&gt; Sentiment towards jobs also suggests a relatively positive trend. At the current level of 26.5, the Jobs Plentiful index is still far from its 40+ reading before COVID, but it did increase again in October as it has now done in four of the last five months. While it's by no means a strong reading at current levels, it hasn't been getting worse either. Looking at past recessions, it wasn't until well after the recession ended that the Jobs Plentiful index started to rebound.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/102720-CC-Jobs-plentiful.png))**\n\n*****\n\n&gt; # Industrials Malfunction\n\n&gt; With poorly received earnings reports from 3M (MMM) and Caterpillar (CAT) and general weakness overall, Tuesday was just a bad day for the Industrials sector. Just five stocks in the sector were up on the day and the sector overall was down 2.2% compared to the S&amp;P 500 which was down just 0.3%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/102720-Industrials-Sector-Perfoamnces.png))**\n\n&gt; The chart below shows the daily performance spread between the S&amp;P 500 and the Industrials sector over the last year. Positive readings indicate the S&amp;P 500 outperforming the Industrials sector and negative readings indicate that the Industrials sector outperformed the S&amp;P 500. With the S&amp;P 500 outperforming the Industrials sector by 1.88 percentage points on Tuesday, it was the widest performance gap (in the S&amp;P 500's favor) since 9/21. Even more notable, though, was the fact that there have only been three other days in the last year where the Industrials sector underperformed the S&amp;P 500 by a wider margin.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/102720-Industrials-Sector-Spread.png))**\n\n&gt; For the sector as a whole, it currently finds itself in a precarious position. After breaking its uptrend off the March lows on 9/21, the Industrials sector bounced back and rallied back to its former uptrend line, and while it just recently made a post-COVID high, the rally ran out of steam right at the former uptrend line. In the pullback that has followed, the sector closed yesterday right at a secondary line of support from the June lows. If this level doesn't hold through today's close, the technical picture for the sector will look a lot different than the way it looked just a few weeks ago.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/102720-Industrials.png))**\n\n*****\n\n&gt; # All or Nothing Days Back on the Rise\n\n&gt; The S&amp;P 500's A/D line for the day (number of advancing stocks minus number of declining stocks) currently stands at about -460, which would be the weakest one-day reading since June. Today's A/D reading also is notable in that it represents the tenth 'all or nothing' day for the S&amp;P 500 since the index's last peak on 9/2. We consider 'all or nothing' days to be those days where the S&amp;P 500's daily A/D reading is either above +400 or below -400. To put the frequency of 'all or nothing' days into perspective, while there have been ten in the last forty trading days, in the forty trading days before that there weren't any.\n\n&gt; The chart below shows the percentage of 'all or nothing' days on a 50-day rolling basis. The current pace of 20% is still well off the extraordinary level of 44% we saw back in late April/early May, but it is still relatively high.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/102820-AllorNothing-50.png))**\n\n&gt; Including today, there have now been 41 'all or nothing' days so far in 2020. If the current pace for the entire year keeps up that will put us on pace for fifty days this year. If the current pace keeps up and we do reach 50 'all or nothing' days this year, it will be the third-highest annual total behind 2011 (70) and 2008 (52), but even if there isn't another 'all or nothing' day this year, 2020 would still rank fifth behind the years from 2008 through 2011.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/102820-AllorNothing-All.png))**\n\n*****\n\n&gt; # Earnings and Economics Diverge\n\n&gt; This earnings season, we have frequently mentioned how beat rates have continued to rise relentlessly. From our Earnings Explorer database, our 3-month rolling EPS beat rate currently stands at a record high of 78.19%. That is nearly 20 percentage points higher than the historical average of 59.37%. The sales beat rate is not at a record, but it too is elevated at 69.09% versus the historical average of 56.45%. That means that of the companies that have reported earnings over the past three months, a massive proportion are exceeding consensus sales and EPS estimates.\n\n&gt; While earnings beat rates have continued to grind higher, economic data is another story. The Citi Economic Surprise Index basically tracks macroeconomic data and how it comes in relative to forecasts. Higher readings indicate the data is trending stronger than expected and vice versa for negative readings. With the unprecedented shock to macroeconomic data in 2020, this index for the United States plummeted, but that was followed by a sharp rebound to record highs. Although the index for the US remains higher than anything prior to the pandemic, it has been heading lower since the summer. In other words, economic data is still coming in better than expected but is not massively exceeding expectations to the degree it was back in the spring and early summer.\n\n&gt; The two charts below compare EPS and revenue beat rates to the Citi Economic Surprise Index. Comparing the two series to the Citi Economic Surprise Index shows that while EPS beat rate has been somewhat connected (correlation: +0.325)) there is very little in the way of correlation between the Surprise Index and the revenue beat rate (+0.084). Given that EPS figures are typically easier to massage than revenues, that was a bit of a surprise. What is notable about the recent decline in the Citi Economic Surprise Index is that in prior periods where it became elevated and then pulled back as it did in (2003, 2009, and 2018), the EPS beat rate typically didn't peak and start to trend lower for another few months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/102820-Citi-vs-Earn.png))**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/qOJdagC.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/9KQPNXR.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 11.2.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/pj7pysD.png))\n\n&gt; # ***Monday 11.2.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/h2HgKHB.png))\n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/DRjtGSM.png))\n\n*****\n\n&gt; # ***Tuesday  11.3.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/aoPSp6k.png))\n\n&gt; # ***Tuesday 11.3.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/BKnNZhJ.png))\n\n*****\n\n&gt; # ***Wednesday 11.4.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK!](https://i.imgur.com/97DJGA7.png))\n\n&gt; # ***Wednesday 11.4.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/4k28zp5.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/lb9tHJr.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!](https://i.imgur.com/i7l5LTf.png))\n\n*****\n\n&gt; # ***Thursday 11.5.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/8prHmLC.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/jlZMuyc.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!](https://i.imgur.com/Xs5XIA3.png))\n\n&gt; # ***Thursday 11.5.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/WX3Qbv9.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/kI5jFhr.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!](https://i.imgur.com/u6ZNU50.png))\n\n*****\n\n&gt; # ***Friday 11.6.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/aP1LaQn.png))\n\n*****\n\n&gt; # ***Friday 11.6.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/k3lJ7Qz.png))\n\n*****\n\n&gt; # PayPal $186.13\n**PayPal (PYPL)** is confirmed to report earnings at approximately 4:15 PM ET on Monday, November 2, 2020. The consensus earnings estimate is $0.95 per share on revenue of $5.40 billion and the Earnings Whisper ® number is $1.01 per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat The company's guidance was for earnings of approximately $0.76 per share. Consensus estimates are for year-over-year earnings growth of 58.33% with revenue increasing by 23.34%. Short interest has increased by 20.8% since the company's last earnings release while the stock has drifted lower by 3.0% from its open following the earnings release to be 21.7% above its 200 day moving average of $152.96. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, October 12, 2020 there was some notable buying of 10,377 contracts of the $210.00 call and 10,021 contracts of the $210.00 put expiring on Friday, December 18, 2020. Option traders are pricing in a 9.4% move on earnings and the stock has averaged a 5.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=PYPL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Square, Inc. $154.88\n**Square, Inc. (SQ)** is confirmed to report earnings at approximately 7:15 PM ET on Thursday, November 5, 2020. The consensus earnings estimate is $0.17 per share on revenue of $1.99 billion and the Earnings Whisper ® number is $0.23 per share. Investor sentiment going into the company's earnings release has 79% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 34.62% with revenue increasing by 57.13%. Short interest has decreased by 5.7% since the company's last earnings release while the stock has drifted higher by 1.1% from its open following the earnings release to be 46.1% above its 200 day moving average of $106.05. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, October 19, 2020 there was some notable buying of 4,158 contracts of the $155.00 put expiring on Friday, November 20, 2020. Option traders are pricing in a 11.3% move on earnings and the stock has averaged a 7.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SQ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Alibaba Group Holding Ltd. $304.69\n**Alibaba Group Holding Ltd. (BABA)** is confirmed to report earnings at approximately 6:35 AM ET on Thursday, November 5, 2020. The consensus earnings estimate is $2.11 per share on revenue of $22.89 billion and the Earnings Whisper ® number is $2.25 per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 17.88% with revenue increasing by 37.47%. Short interest has increased by 25.7% since the company's last earnings release while the stock has drifted higher by 18.6% from its open following the earnings release to be 29.8% above its 200 day moving average of $234.74. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, October 29, 2020 there was some notable buying of 35,528 contracts of the $420.00 call expiring on Friday, October 15, 2021. Option traders are pricing in a 8.3% move on earnings and the stock has averaged a 2.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BABA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Clorox Co. $207.25\n**Clorox Co. (CLX)** is confirmed to report earnings at approximately 6:30 AM ET on Monday, November 2, 2020. The consensus earnings estimate is $2.34 per share on revenue of $1.74 billion and the Earnings Whisper ® number is $2.50 per share. Investor sentiment going into the company's earnings release has 71% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 47.17% with revenue increasing by 15.54%. Short interest has increased by 20.7% since the company's last earnings release while the stock has drifted lower by 10.0% from its open following the earnings release to be 4.0% above its 200 day moving average of $199.34. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, October 30, 2020 there was some notable buying of 885 contracts of the $187.50 put expiring on Friday, November 6, 2020. Option traders are pricing in a 6.0% move on earnings and the stock has averaged a 3.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CLX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Roku Inc $202.40\n**Roku Inc (ROKU)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, November 5, 2020. The consensus estimate is for a loss of $0.41 per share on revenue of $354.45 million and the Earnings Whisper ® number is ($0.30) per share. Investor sentiment going into the company's earnings release has 74% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 86.36% with revenue increasing by 35.84%. The stock has drifted higher by 26.8% from its open following the earnings release to be 45.4% above its 200 day moving average of $139.23. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, October 30, 2020 there was some notable buying of 8,002 contracts of the $120.00 put expiring on Friday, January 15, 2021. Option traders are pricing in a 13.2% move on earnings and the stock has averaged a 14.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ROKU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Wayfair Inc. $248.03\n**Wayfair Inc. (W)** is confirmed to report earnings at approximately 7:00 AM ET on Tuesday, November 3, 2020. The consensus earnings estimate is $0.80 per share on revenue of $3.70 billion and the Earnings Whisper ® number is $1.41 per share. Investor sentiment going into the company's earnings release has 65% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 137.04% with revenue increasing by 60.49%. Short interest has decreased by 14.5% since the company's last earnings release while the stock has drifted lower by 12.7% from its open following the earnings release to be 34.7% above its 200 day moving average of $184.13. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, October 22, 2020 there was some notable buying of 1,001 contracts of the $130.00 put expiring on Friday, January 20, 2023. Option traders are pricing in a 15.7% move on earnings and the stock has averaged a 10.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=W&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Peloton Interactive $110.21\n**Peloton Interactive (PTON)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, November 5, 2020. The consensus earnings estimate is $0.13 per share on revenue of $727.51 million and the Earnings Whisper ® number is $0.21 per share. Investor sentiment going into the company's earnings release has 75% expecting an earnings beat The company's guidance was for revenue of $720.00 million to $730.00 million. Consensus estimates are for year-over-year earnings growth of 110.08% with revenue increasing by 219.08%. Short interest has increased by 99.3% since the company's last earnings release while the stock has drifted higher by 12.3% from its open following the earnings release to be 94.6% above its 200 day moving average of $56.63. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, October 30, 2020 there was some notable buying of 5,404 contracts of the $135.00 call expiring on Friday, November 20, 2020. Option traders are pricing in a 13.9% move on earnings and the stock has averaged a 9.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=PTON&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # QUALCOMM Incorporated $123.36\n**QUALCOMM Incorporated (QCOM)** is confirmed to report earnings at approximately 4:00 PM ET on Wednesday, November 4, 2020. The consensus earnings estimate is $1.22 per share on revenue of $5.94 billion and the Earnings Whisper ® number is $1.27 per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat The company's guidance was for earnings of $1.05 to $1.25 per share. Consensus estimates are for year-over-year earnings growth of 74.29% with revenue increasing by 23.39%. Short interest has decreased by 10.1% since the company's last earnings release while the stock has drifted higher by 20.4% from its open following the earnings release to be 32.1% above its 200 day moving average of $93.40. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, October 29, 2020 there was some notable buying of 3,990 contracts of the $136.00 call expiring on Friday, November 20, 2020. Option traders are pricing in a 8.6% move on earnings and the stock has averaged a 4.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=QCOM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Wingstop Inc. $116.33\n**Wingstop Inc. (WING)** is confirmed to report earnings at approximately 7:30 AM ET on Monday, November 2, 2020. The consensus earnings estimate is $0.32 per share on revenue of $63.60 million and the Earnings Whisper ® number is $0.43 per share. Investor sentiment going into the company's earnings release has 50% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 60.00% with revenue increasing by 27.52%. Short interest has decreased by 12.3% since the company's last earnings release while the stock has drifted lower by 17.2% from its open following the earnings release to be 5.9% below its 200 day moving average of $123.60. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 9.2% move on earnings and the stock has averaged a 5.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=WING&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Skyworks Solutions, Inc. $141.29\n**Skyworks Solutions, Inc. (SWKS)** is confirmed to report earnings at approximately 4:00 PM ET on Monday, November 2, 2020. The consensus earnings estimate is $1.52 per share on revenue of $840.22 million and the Earnings Whisper ® number is $1.59 per share. Investor sentiment going into the company's earnings release has 70% expecting an earnings beat The company's guidance was for earnings of approximately $1.51 per share on revenue of $830.00 million to $850.00 million. Consensus estimates are for year-over-year earnings growth of 2.70% with revenue increasing by 1.55%. Short interest has increased by 24.7% since the company's last earnings release while the stock has drifted higher by 7.5% from its open following the earnings release to be 15.4% above its 200 day moving average of $122.43. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, October 30, 2020 there was some notable buying of 2,358 contracts of the $149.00 call expiring on Friday, November 6, 2020. Option traders are pricing in a 8.9% move on earnings and the stock has averaged a 2.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SWKS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/wallstreetbets.",
        "subreddit": "wallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning November 2nd, 2020",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jlimqk/wall_street_week_ahead_for_the_trading_week/",
        "created": 1604180781.0
    },
    {
        "author": "ToKeepAndToHoldForev",
        "created_utc": 1602092210,
        "id": "j6vcwt",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "For the specific play I'm looking at I'd like to take advantage of the IV crush after earnings. Market Chameleon says SWKS is projected to have earnings on October 12th, but Robinhood (I know, shit app, I'm moving soon) says early November. Market Chameleon has a very convenient calendar but I don't want to use it and get screwed. \n\nThanks in advance.",
        "subreddit": "options",
        "title": "Do you guys find the Market Chameleon earnings calendar to be accurate?",
        "url": "https://www.reddit.com/r/options/comments/j6vcwt/do_you_guys_find_the_market_chameleon_earnings/",
        "created": 1602121010.0
    }
]