[
    {
        "author": "NhatNguyen2112",
        "created_utc": 1593937122,
        "id": "hlj54k",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": " \n\nI. **BUY General:** Vroom, Lemonade, AKTS, ZoomInfo, Warner Music, Accolade, Booge Energy, Pinduoduo, Graf Industrial, Mei Pharma, G1 Therapeutics, **American Lithium**, Blink Charging, **United Microelectronics, Big Digital Assets, Fosterville South Exploration**\n\n&amp;#x200B;\n\nII. **Buy Healthcare** \n\nBuy ACAD under $55\n\nBuy BLUE under $57 \n\n&amp;#x200B;\n\nIII. **Buy Tech:** \n\nBuy AYX up to $170\n\nBuy BILI under $45\n\nBuy XP below $50\n\nBuy MSGS up to $245\n\nBuy ESPO under $48, Tencent, Nintendo\n\nBuy Skyworks at $120\n\nBuy NXP Semiconductors at $105\n\nBuy Cirrus Logic at $60\n\nBuy Qorvo $105\n\nBuy MU \n\nBuy Qualcomm &amp; Broadcom\n\nBuy Taiwan Semiconductors\n\nBuy Marvell\n\nBuy ILIKF\n\nBuy Illumina\n\nBuy NXP\n\nBuy ON Semiconductor\n\nBuy Fabrinet\n\nBuy Sensata Technologies\n\n&amp;#x200B;\n\nIV. **Buy 5G:**\n\nEricson is the Super 5G Highway, buy at $9.2 \n\nBuy AMBA up to $55\n\nAPTV up to $85\n\nBuy AYX up to $120\n\nBuy BILI under $30.\n\nBuy ISRG below $550.\n\nBuy Z under $50.\n\nBuy ISRG\n\nBuy Zillow\n\nBuy MRVL Marvel\n\n&amp;#x200B;\n\nV. **Buy AI:** \n\nBuy BIDU up to $125\n\nBuy NVDA below $300\n\nBuy GLOB under $125\n\nBABA\n\nFB\n\nIQ\n\nAlteryx\n\nOLED is a buy up to $165.\n\n&amp;#x200B;\n\nVI. **Buy Batteries:**\n\nBollore\n\nBuy ILIKF\n\nMurata Manufacturing\n\nTDK Corporation\n\nToyota\n\n&amp;#x200B;\n\nVII. **USE Interactive Broker, Charles Schwab, or Fidelity to buy foreign stocks:**\n\n&amp;#x200B;\n\n* Buy 000100.SZ (TCL Technology Group ) under 6.50 Chinese yuan\n* Buy 000725.SZ (BOE Technology Group) up to 5 Chinese yuan\n* Buy 000050.SZ (Tianma Microelectronics) below 16 Chinese yuan\n* ILIKF\n\nVIII. **Put Option/ SELL:** KERN, TDOC, IIPR, Blue Solutions ([BLUE.PA](https://BLUE.PA))\n\n \n\nIX**. BUY-CALL OPTION:** SOLO $7.5 strike exp Aug 21, VKTS, BiliBili at $55 exp Aug 21, AKTS exp Aug 21 strike price $15, SHLL exp Aug 21 strike price at $30, Hertz at $1 July 31, GNUS $6 Jul 24th, Nio at $14 Aug 7.",
        "subreddit": "investing",
        "title": "Investment Recommendations",
        "url": "https://www.reddit.com/r/investing/comments/hlj54k/investment_recommendations/",
        "created": 1593965922.0
    },
    {
        "author": "ubunchofcrazyjok",
        "created_utc": 1593978099,
        "id": "hlsrjs",
        "num_comments": 242,
        "num_crossposts": 1,
        "selftext": "First big move since COVID for the Oracle of Omaha. He is finally digging in his 137 billion wallet. \n\nThis suggest that the game of waiting might be paying off in the long run. Better opportunity will unequivocally come at the right time. Also good news for overall market conditions. It suggests that retesting march low’s is off the table. \n\nDavid day trader global GLOBAL think he’s washed up. Its a bold move to go against the pinstripe suits.",
        "subreddit": "stocks",
        "title": "Warren Buffett’s Berkshire buys Dominion Energy natural gas assets in $10 billion deal",
        "url": "https://www.reddit.com/r/stocks/comments/hlsrjs/warren_buffetts_berkshire_buys_dominion_energy/",
        "created": 1594006899.0
    },
    {
        "author": "soozler",
        "created_utc": 1594098388,
        "id": "hmo8a9",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "The current policy of QE (brrrrrrrrr) according to most economic theories would mean that inflation will eventually happen, but will likely be delayed until the economy begins to reopen and spending recovers. \n\nTo avoid crowding out non-government debt, the Fed has stepped into risky bond markets and started buying those bonds to increase liquidity, this has some effect of delaying inflation but that balance sheet will unwind slowly.\n\nAnyway, if we assume that inflation will rise at a higher level that we saw in the last few years, the real winners will be people and companies with huge amounts of debt that are able to maintain enough cash flow to pay those obligations.  Their debts will be eroded by inflation, and taking on enormous amounts of debt will likely result in windfall profits assuming what they financed with debt appreciates at the same level of inflation (think share buy backs).\n\n\"the proportion of buybacks funded by corporate bonds reached as high as 30% in both 2016 and 2017, \".[1]. So, by taking out loans to buy stock, which will keep pace with inflation, the companies that have participated in this behavior will stand to make huge returns, at the expense of the debt holders (at this point the fed and anyone with a savings account). \n\nSo, what are some companies that stand to benefit from this?  Any company with a huge amount of debt, little cash on hand, a large number of repurchased shares, and a strong enough business model to not default on debt. \n\nThese are the stocks I think would fall into that category.  It's important to note that companies like MSFT and APPL sitting on mountains of cash may be forced into share buybacks to avoid inflation, thus further driving up their stock prices as well.\n\nUnited Parcel Service (UPS)\nCharter Communications (CHTR)\n\nVerizon Communications (VZ)\n\nComcast Corp. (CMCSA)\n\nOracle Corp. (ORCL)\n\nIBM Corp. (IBM)\n\nFord Motor Co. (F)\n\nI'd be interested what your thoughts are? \n\nTldr; inflation goes up. Companies with debt that don't default will be rewarded. Companies that might default probably bailed out and rewarded also. Companies with lots of cash will have their value eroded. Calls. \n\n\n1- https://hbr.org/2020/01/why-stock-buybacks-are-dangerous-for-the-economy",
        "subreddit": "wallstreetbets",
        "title": "Companies with high debt that stay liquid will be biggest winners",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hmo8a9/companies_with_high_debt_that_stay_liquid_will_be/",
        "created": 1594127188.0
    },
    {
        "author": "Prospector645",
        "created_utc": 1593829427,
        "id": "hkvq77",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Hi all. Fairly new to options here. I’m considering starting a wheel using one of the three stocks in the title. A few thoughts and questions I’d love to get feedback on:\n\nWFC: I think WFC is really undervalued and would not mind at all owning the shares. One downside here is that I work in financial services (insurance) so I’m already disproportionately exposed to the industry (employment, company stock, etc.) There’s some uncertainty with the earnings release upcoming, especially since they’ll be announcing just how much they’ll be cutting their dividend. Is it stupid to write a put that expires after the earnings announcement?\n\nPCG: They’re fresh out of bankruptcy and in my opinion have a lot of upside but very little downside. The stock price is very low, just under $10, which I know makes it a bit risky from traditional rules of thumb. However, I think they’ve done a ton to mitigate downside risk with the restructure.\n\nORCL: Love the company. It’s been trading sideways for a while now, and I think it’s likely it will continue to do so. Higher cost than the other two stocks, so technically more risk for selling the OTM put... but not too concerned about that.\n\nQuestions:\nShould any of these be outright avoided for a reason I haven’t considered?\n\nWhat’s the appropriate strike for the initial short put? I was thinking something with delta in the 20ish% range. Is that about right?\n\nWhat expiry is best for the initial short put? I was thinking something like 1-3 weeks out.\n\nNote: I’m only thinking of doing one contract to start. Just trying to get my feet wet / study the strategy. 100x any of these shares is a very small fraction of my portfolio, so while obviously not the goal, I could afford to lose it all. Not looking to “hit it big” or get rich on options... just trying to learn for fun.\n\nThanks for any and all advice!",
        "subreddit": "options",
        "title": "Wheel: WFC / PCG / ORCL",
        "url": "https://www.reddit.com/r/options/comments/hkvq77/wheel_wfc_pcg_orcl/",
        "created": 1593858227.0
    }
]