[
    {
        "author": "psychotrader00",
        "created_utc": 1600807595,
        "id": "ixvxpi",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": " **PsychoMarket Recap - Tuesday, Sept 22, 2020**\n\nStocks traded choppily before rising in another very volatile session, with traders weighing uncertainty around the presidential election, a worsening coronavirus situation in Europe, and concerns that fiscal stimulus will not come in near-term.  The Nasdaq outperformed, rose 1.86% as Apple (AAPL), Amazon (AMZN) and Facebook (FB) increased. The S&amp;P finished 1.02% and the Dow finished the day 0.5% up.\n\nThe coronavirus situation in Europe has greatly worsened, with experts and politicians warning that a second-wave is around the corner. On September 12, French authorities reported 10,000 COVID-19 cases in one day for the first time since the pandemic began. Since then, daily cases have soared to more than 13,000. Several \"red zones\", cities considered high risk, have seen clampdowns. There is much talk of a second national lockdown in the UK, with Prime Minister Boris Johnson announcing that there will be further restrictive measures aimed at containing another major outbreak, as the number of cases swells and top scientists warn that the death rate could grow exponentially. On Monday, the UK reported 4,368 new cases. In Spain, parts of the capital Madrid, saw new lockdown measures enforced on Monday. More than 850,000 residents face restrictions on travel and the size of gatherings, according to Al Jazeera. The EU CDC reported that in Spain, there were 300 cases of COVID-19 per every 100,000 people as the capital of Madrid saw new lockdown measures being enforced.\n\nProspects of more fiscal stimulus passing before the November election have dimmed, with Congress unable to come to a consensus. Today, Treasury Secretary Steve Mnuchin and Fed Chair Jerome Powell testified before the House Financial Services Committee. They said that the Fed and Treasury can only go ‘so far so fast’ and cannot replace targeted aid from Congress. “The recovery will go faster if we have both tools \\[from the Fed and Congress\\] continuing to work together,\" Powell said. Both Powell and Mnuchin credited the Cares Act for helping the economy recover at the height of the pandemic but have once again stressed to Congressional lawmakers the importance of targeted, fiscal aid in helping families and small businesses through these tough times.\n\n**Highlights**\n\n* Apple (AAPL) target raised by Raymond James from $110 to $120 OUTPERFORM. The stock finished 1.57% up.\n* ACN Accenture, currently at $233. Stock finished the day 1.29% up.\n   * Piper Sandler Raised Target $206 to $229 NEUTRAL\n   * Wedbush raised target from $240 to $255 OUTPERFORM\n* Amazon (AMZN) target raised bySanford C. Bernstein upgraded from MARKET PERFORM to OUTPERFORM price target of $3,400. Stock finished the day \n* Carvana (CVNA) ran 30.61% after the company projected a “record Q3” and was upgraded to a BUY rating by Goldman Sachs (GS)\n* Carvana (CVNA) was upgraded by Goldman Sachs $GS from $178 to $205, and NEUTRAL to BUY.  Q3 guidance was updated on the positive side and the stock took off. Finished 30% up for the day.\n* (CZR) Caesars Entertainment, Deutsche Bank raised its target from $50 to $65 at BUY\n* (FB) Facebook had Oppenheimer raise target from $270 to $300 OUTPERFORM\n* (NKE) Nike had Robert W. Baird raise target from $95 to $115 and from POSITIVE to NEUTRAL.\n* (NKE) Nike after the bell reported better than expected Q1 sales and EPS of $0.95 up from $0.86 YoY. The stock was up 3.1% for regular session and already more than 8% after hours.\n* (NFLX) Netflix had JP Morgan set Target $625 at BUY. that is about 20% higher than ATH, very bullish.\n* Today is (TSLA) Tesla Battery Day. Stay tuned for potential price moving announcements.\n* (GME) Gamestop surges on announcement that Cohen, Chewy’s founder, revealed an almost 10% stake in the company and his intention to become involved and compete with Amazon on the videogame space, just as he did pets with (CHWY) Chewy.\n* (SFIX) Stitch Fix reported worse than expected results, a loss of $0.44 vs expectation of a loss of $0.14. Shares were up 8% for the day, and now 14% down after hours.",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today, Sept 22. Enjoy!",
        "url": "https://www.reddit.com/r/stocks/comments/ixvxpi/here_is_a_market_recap_for_today_sept_22_enjoy/",
        "created": 1600836395.0
    },
    {
        "author": "StockShotCaller",
        "created_utc": 1600554389,
        "id": "iw22jr",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "**#Earnings for 21 Sep 2020**\n\nPre-Market (PM) $PT   \n\nAfter Hours (AH) $ERYP $QTT\n\n&amp;#x200B;\n\n**#Earnings for 22 Sep 2020**\n\nPM $AZO $NEOG    \n\nAH $KBH $NKE $SCS $SFIX\n\n&amp;#x200B;\n\n**#Earnings for 23 Sep 2020**\n\nPM $CNTG $CTAS $GIS $JKS $TNP $WOR\n\nAH $FUL $KBNT $WDDMF\n\n&amp;#x200B;\n\n**#Earnings for 24 Sep 2020**\n\nPM $ACN $BB $DRI $DYNT $FDS $JBL $KMX $NTWK $RAD $RSSS\n\nAH $AEHR $AIR $AYTU $CAMP $COST $MTN $SCHL $SPRWF $TCOM\n\n&amp;#x200B;\n\n**#Earnings for 25 Sep 2020**\n\nPM $AIH   \n\nAH $NTZ\n\n&amp;#x200B;\n\nSource [https://twitter.com/KillerStockCall](https://twitter.com/KillerStockCall)",
        "subreddit": "stocks",
        "title": "Earnings for the Week of 21 to 25 September",
        "url": "https://www.reddit.com/r/stocks/comments/iw22jr/earnings_for_the_week_of_21_to_25_september/",
        "created": 1600583189.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1600513539,
        "id": "ivql0n",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/StockMarket. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning September 21st, 2020.\n\n# **Markets are expected to be choppy, but dip buyers could be looking at tech favorites in week ahead  - [(Source)](https://www.cnbc.com/2020/09/18/markets-are-expected-to-be-choppy-but-dip-buyers-could-be-looking-at-tech-favorites-in-week-ahead.html)**\n*****\n&gt; After another week of losses, tech could be at the heart of a tug of war as dip buyers look for bargains in some of their favorite names and others see the group as still too frothy.\n*****\n&gt; In the past week, the S&amp;P 500 and Nasdaq were both down about 0.6%, the third losing week. It was the S&amp;P 500′s longest losing streak since October. Tech was broadly lower, with Amazon and Facebook both down 5% for the week. Information technology shares lost 1% but communications which includes Facebook and Google fell 2.3% for the week.\n*****\n&gt; “I think every time you’ve had a significant pullback in the familiar names, that tends to draw in more money,” said Ed Keon, chief investment strategist at QMA. “You’ve had a little rotation toward value. That’s a healthy sign for the market. I don’t think that’s an unhealthy market even though stocks look pricey. Given how low interest rates are, stocks look like the only game in town.”\n*****\n&gt; There are also a number of Fed speeches, but the most important will be the appearances by Fed Chairman Jerome Powell before three Congressional committees. At two of those, Tuesday and Thursday, Powell appears with Treasury Secretary Steven Mnuchin to discuss coronavirus aid.\n*****\n&gt; Art Hogan, chief market strategist at National Securities, said he does not expect much from Powell after his comments following the Fed’s meeting this week, though the central bank chairman is likely to once more tell Congress fiscal stimulus is needed to help the economy recover.\n*****\n&gt; Keon said it would be positive if there could be another stimulus deal but the market no longer expects it. “If we do get a deal, that would be really positive. I think at this point, there’s a little bit of a slowdown in news. We still have a ways to go before we get into earnings warnings season. We’re going to worry more about the presidential election and its aftermath,” said Keon.\n*****\n&gt; Keon said investors are increasingly focused on the election and the potential for an uncertain outcome, as states deal with large amounts of mailed ballots for the first time. He said the concern is it could take weeks or months to determine the outcome if the race is close.\n*****\n&gt; “It’s still six weeks to the election. We haven’t had the debates yet. That six weeks is a lifetime. Biden seems to be the favorite at this point, but I don’t think the market is betting on anything but higher volatility,” Keon said. President Donald Trump and former vice president Joe Biden hold their first debate Sept. 29.\n*****\n&gt; “I think volatility is the norm, not the exception, until we get through the election,” said Hogan.\n*****\n&gt; Investors have been hedging against extended volatility after the election. Patrick Kernan, who trades S&amp;P options with Cardinal Capital, said the flow into S&amp;P 500 options for January has been steady over the past several days. “The options markets are implying a contested election that could last until January,” he said. He said the market is not positioning around one candidate or other, just uncertainty.\n*****\n&gt; Goldman Sachs strategists noted Friday that investors have pushed out some hedging further into November, though some investors appear to be betting on an outcome by Dec. 8, the date states with contested elections have to report.\n*****\n&gt; There are also a few important reports on the economic calendar, including housing data on existing home sales Tuesday and new home sales Thursday. “The housing market has been solid and hopefully, we’ll get confirmation of that because people were upset by the decline in housing starts,” said Hogan.\n*****\n&gt; Manufacturing PMI is released Wednesday and durable goods are reported Friday.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/NxJH3xO.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/pqCJiWe.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/85tdlJ8.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/asJwOaC.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/fXDr9bd.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/F4ZSk2C.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/7LIfrR3.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/b7IUJO1.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/It9kGgQ.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/nkTU6Yr.png))**\n\n*****\n\n&gt; # Election Charts You Need To See: Part 2\n\n&gt; As we noted last week, the demand for election charts is off the charts (pun intended), so we are sharing some of our favorite election charts.\n\n&gt; Without further ado, here are some more election charts you need to know as November 3 inches closer.\n\n&gt; How stocks perform three months before the election has a stellar track record of predicting who will win in November. If stocks are higher, the incumbent party tends to win, while if stocks are lower, the incumbent party tends to lose. This indicator accurately predicted the winner 87% of the time (20 of 23) since the late 1920s.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.14.20-Blog-Chart-1.png?ssl=1))**\n\n&gt; Building on this, if President Donald Trump is going to win, right about now is when the S&amp;P 500 Index should start to outperform. Of course, if it weakens, it could mean we will be looking at a President Joe Biden soon.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.14.20-Blog-Chart-2.png?ssl=1))**\n\n&gt; Speaking of presidents up for re-election, here’s what the S&amp;P 500 historically has done during re-election years.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.14.20-Blog-Chart-3.png?ssl=1))**\n\n&gt; Lastly, here are two final charts that may help forecast the outcome.\n\n&gt; If real per capita disposable income is higher, the incumbent president usually wins. Conversely, if wages are weak, that bodes well for someone new in the White House. Given real per capita disposable income is up more than 7% this year, it would suggest President Trump should take more than 70% of the votes. Of course, this is greatly skewed due to the CARES Act, so we’d put a major asterisk next to this one.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.14.20-Blog-Chart-4.png?ssl=1))**\n\n&gt; To sum up, Gallup poll approval ratings have done a nice job of predicting how many votes a president up for re-election might get. With a 42% Gallup approval rating currently, this comes out to 49% of the total votes for President Trump, which points to a close race.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.14.20-Blog-Chart-5.png?ssl=1))**\n\n*****\n\n&gt; # Election Charts You Need To See: Part 3\n\n&gt; One of the top requests we’ve received the past few weeks is for more charts on the US elections. We shared some of our favorite in Election Charts You Need to See: Part 1 and Part 2, and today’s the third blog in our series on this important event.\n\n&gt; S&amp;P 500 Index earnings are expected to jump close to 23% in 2021 according to FactSet, as the global economy recovers. Presidential nominee Joe Biden has made it very clear he will likely hike taxes, which could potentially cut 10 percentage points off earnings growth next year if implemented. If Biden wins, we would expect Chinese tariffs to be removed as well, which would offset some of that impact and according to our friends at Strategas Research Partners would suggest earnings growth of nearly 17%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.18.20-Blog-Chart-1.png?ssl=1))**\n\n&gt; As shown in our LPL Chart of the Day, how the US dollar does ahead of the election has been a great indicator of which party might win in November. If the dollar is weak three months before the election, this bodes well for the incumbent party, while the incumbent party tends to lose if the dollar is strong. This signal has been right 7 of the past 8 elections.\n\n&gt; As we saw back in March, when trouble hits, the US dollar tends to do well, as investors flock to the safety of the world’s reserve currency. When things are calm, the dollar tends to weaken, which favors riskier assets. So far, the dollar is slightly lower, which would suggest a potential win for President Donald Trump.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.18.20-Blog-Chart-2-1.png?ssl=1))**\n\n&gt; Also, the size of the tax increase proposed by Joe Biden as a percentage of gross domestic product (GDP) would be one of the largest ever and rival President Lyndon B. Johnson’s (LBJ) tax increases in the late 1960s. Let’s remember though, if there’s a split Congress, the chances of the full tax plan being implemented is quite slim. Additionally, a weaker economy would also reduce the chances of a large tax hike.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.18.20-Blog-Chart-3.png?ssl=1))**\n\n*****\n\n&gt; # Seasonal Volatility Just Getting Started\n\n&gt; The market's day-to-day volatility has picked up in September after experiencing more stable trading action during the summer months. This is not out of the ordinary. Historically, the most volatile time of the year for stocks has been between September and early November. You can see this in the chart below that shows the average absolute daily percentage change for each trading day of the year beginning on the first trading day of January through the last trading day of December. As shown, daily volatility is very consistent around the +/-0.70% level over the first eight months of the year, but then it starts to pick up beginning in September until it reaches a peak during the first week or two of November. From there, the holiday season takes over and daily volatility plummets right through the end of the year. As shown in the chart, unfortunately we've still got a ways to go to get to the top of the volatility mountain, so make sure you've got your climbing gear ready for the next six to eight weeks!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/09/avgvol.png))**\n\n*****\n\n&gt; # Keeping Tabs On High Frequency Growth\n\n&gt; The week ended September 11th showed a sharp decline in our index of weekly GDP versus the year before. As shown, our index can be quite volatile, but it does do a decent job tracking the general trajectory of GDP. Since peaking at an implied growth rate of +0.9% YoY on July 10th, our index has slid to -2% YoY, the lowest reading since mid-June.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/09/091820-Weekly.png))**\n\n&gt; Taking a look at another tracker of short-term economic growth, below we show Weekly Economic Index data updated by the New York Fed each week. After decelerating sequentially YoY for the week ended September 4th, the WEI reported sequential YoY growth slower once again in the week ended September 11th. We also show what each high frequency tracker implies about quarterly growth. As shown, our tracker has consistently implied a higher quarterly growth rate than the Weekly Economic Index, and official data for the last two quarters. That said, Q3 is tracking at least 20%, with upside to the high-20s as the US continues to rebound from COVID. This post was originally published in our post-market macro report -- The Closer -- last night.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/09/091820-WEI.png))**\n\n*****\n\n&gt; # Sell(ing) Rosh Hashanah, Buy Yom Kippur\n\n&gt; As the High Holidays approach you may remember the old saying on the Street, “Sell Rosh Hashanah, Buy Yom Kippur.” It gets tossed around every autumn when the “high holidays” are on the minds of traders as many of their Jewish colleagues take off to observe the Jewish New Year and Day of Atonement.\n\n&gt; The basis for this, “Sell Rosh Hashanah, Buy Yom Kippur,” pattern is that with many traders and investors busy with religious observance and family, positions are closed out and volume fades creating a buying vacuum. Even in the age of algorithmic, computer, and high frequency trading these seasonal patterns persist as humans still need to turn the machines on and off and feed them money or take it away – and these algorithms and trading programs are written by people so the human influence is still there.\n\n&gt; Holiday seasonality around official market holidays is something we pay close attention to (page 100 Stock Trader’s Almanac). Actual stats on the most observed Hebrew holidays have been compiled in the table here. We present the data back to 1971 and when the holiday falls on a weekend the prior market close is used. It’s no coincidence that Rosh Hashanah and Yom Kippur fall in September and/or October, two dangerous and sometimes opportune months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/08c1da4f106eb00e65a4532c55dd8ea0/ad7e0851da5530c5-bd/s1280x1920/744427ad7335745d917da73a6033df7c6d4fe9eb.jpg))**\n\n&gt; Perhaps it’s Talmudic wisdom but, selling stocks before the eight-day span of the high holidays has avoided many declines, especially during uncertain times. While being long Yom Kippur to Passover has produced 59% more advances, half as many losses and average gains of 6.7%.\n\n&gt; This year the high holidays commence on Friday eve, September 18, and end Monday September 28 with Yom Kippur just before Octoberphobia. The current news flow already has folks selling ahead of the Jewish High Holidays, quite possibly setting up the market for further declines.\n\n*****\n\n&gt; # S&amp;P 500 down 24 of 30 during week after September options expiration, average loss 0.95%\n\n&gt; The week after September options expiration week, next week, has a dreadful history of declines most notably since 1990. The week after September options expiration week has been a nearly constant source of pain with only a few meaningful exceptions over the past 30 years. Substantial and across the board gains have occurred just four times: 1998, 2001, 2010 and 2016 while many more weeks were hit with sizable losses.\n\n&gt; Full stats are in the following sea-of-red table. Average losses since 1990 are even worse; DJIA –1.01%, S&amp;P 500 –0.95%, NASDAQ –0.95% and a sizable –1.42% for Russell 2000. End-of-Q3 portfolio restructuring is the most likely explanation for this trend as managers trim summer holdings and position for the fourth quarter.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/22b6293d7be32f7d061f3954195fbd77/96e081bfd002ca33-4d/s540x810/dbec24da50db919ec2882bb2c0051a40ed608543.jpg))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending September 18th, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=eOAuzK4Y3fY))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 9.20.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$COST** \n&gt; * **$AZO** \n&gt; * **$NKE** \n&gt; * **$ACB** \n&gt; * **$RAD** \n&gt; * **$GIS** \n&gt; * **$KMX** \n&gt; * **$SFIX** \n&gt; * **$AYTU** \n&gt; * **$JKS** \n&gt; * **$FDS** \n&gt; * **$DRI** \n&gt; * **$ACN** \n&gt; * **$TNP** \n&gt; * **$KBH** \n&gt; * **$BB** \n&gt; * **$CTAS** \n&gt; * **$NEOG** \n&gt; * **$WOR** \n&gt; * **$JBL** \n&gt; * **$QTT** \n&gt; * **$CNTG** \n&gt; * **$TCOM** \n&gt; * **$NTWK** \n&gt; * **$MTN** \n&gt; * **$FUL** \n&gt; * **$CAMP** \n&gt; * **$SANW** \n&gt; * **$AIR** \n&gt; * **$AIH** \n&gt; * **$SCHL** \n&gt; * **$ERYP**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/It9kGgQ.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/HB39ZrE.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 9.21.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n&gt; # ***Monday 9.21.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Tuesday  9.22.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/quiFQMw.png))\n\n&gt; # ***Tuesday 9.22.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/BOgJ0wf.png))\n\n*****\n\n&gt; # ***Wednesday 9.23.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/dbDH93f.png))\n\n&gt; # ***Wednesday 9.23.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/g7tSsGT.png))\n\n*****\n\n&gt; # ***Thursday 9.24.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/vIb8HLi.png))\n\n&gt; # ***Thursday 9.24.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Ke0CbCj.png))\n\n*****\n\n&gt; # ***Friday 9.25.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Friday 9.25.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # Costco Wholesale Corp. $335.96\n**Costco Wholesale Corp. (COST)** is confirmed to report earnings at approximately 4:15 PM ET on Thursday, September 24, 2020. The consensus earnings estimate is $2.85 per share on revenue of $52.61 billion and the Earnings Whisper ® number is $2.87 per share. Investor sentiment going into the company's earnings release has 74% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 5.95% with revenue increasing by 10.76%. Short interest has decreased by 40.5% since the company's last earnings release while the stock has drifted higher by 10.4% from its open following the earnings release to be 8.4% above its 200 day moving average of $310.06. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, September 18, 2020 there was some notable buying of 7,071 contracts of the $340.00 call expiring on Friday, September 25, 2020. Option traders are pricing in a 5.0% move on earnings and the stock has averaged a 1.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=COST&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # AutoZone, Inc. -\n**AutoZone, Inc. (AZO)** is confirmed to report earnings at approximately 6:55 AM ET on Tuesday, September 22, 2020. The consensus earnings estimate is $24.69 per share on revenue of $3.98 billion and the Earnings Whisper ® number is $24.85 per share. Investor sentiment going into the company's earnings release has 59% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 9.30% with revenue decreasing by 0.21%. Short interest has decreased by 6.2% since the company's last earnings release while the stock has drifted higher by 3.2% from its open following the earnings release to be 10.0% above its 200 day moving average of $1,095.56. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 6.5% move on earnings and the stock has averaged a 4.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AZO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Nike Inc $114.66\n**Nike Inc (NKE)** is confirmed to report earnings at approximately 4:15 PM ET on Tuesday, September 22, 2020. The consensus earnings estimate is $0.45 per share on revenue of $9.05 billion and the Earnings Whisper ® number is $0.47 per share. Investor sentiment going into the company's earnings release has 62% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 47.67% with revenue decreasing by 15.10%. Short interest has increased by 1.5% since the company's last earnings release while the stock has drifted higher by 16.4% from its open following the earnings release to be 19.1% above its 200 day moving average of $96.30. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, September 18, 2020 there was some notable buying of 2,687 contracts of the $118.00 call expiring on Friday, September 25, 2020. Option traders are pricing in a 7.1% move on earnings and the stock has averaged a 4.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NKE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Aurora Cannabis Inc $6.53\n**Aurora Cannabis Inc (ACB)** is confirmed to report earnings at approximately 4:00 PM ET on Tuesday, September 22, 2020. The consensus estimate is for a loss of $0.29 per share on revenue of $54.64 million and the Earnings Whisper ® number is ($0.36) per share. Investor sentiment going into the company's earnings release has 55% expecting an earnings beat. Consensus estiamtes are for year-over-year revenue to decline 35.99%. Short interest has decreased by 91.2% since the company's last earnings release while the stock has drifted lower by 21.8% from its open following the earnings release to be 73.6% below its 200 day moving average of $24.77. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, September 18, 2020 there was some notable buying of 1,300 contracts of the $7.00 call expiring on Friday, September 25, 2020.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ACB&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Rite Aid Corp. $13.44\n**Rite Aid Corp. (RAD)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, September 24, 2020. The consensus earnings estimate is $0.10 per share on revenue of $5.76 billion and the Earnings Whisper ® number is $0.15 per share. Investor sentiment going into the company's earnings release has 67% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 16.67% with revenue increasing by 7.34%. Short interest has decreased by 17.1% since the company's last earnings release while the stock has drifted lower by 7.2% from its open following the earnings release to be 7.6% below its 200 day moving average of $14.54. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, September 16, 2020 there was some notable buying of 858 contracts of the $12.00 call expiring on Friday, September 25, 2020. Option traders are pricing in a 20.6% move on earnings and the stock has averaged a 22.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=RAD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # General Mills, Inc. $57.32\n**General Mills, Inc. (GIS)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, September 23, 2020. The consensus earnings estimate is $0.87 per share on revenue of $4.16 billion and the Earnings Whisper ® number is $0.90 per share. Investor sentiment going into the company's earnings release has 74% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 10.13% with revenue increasing by 3.94%. Short interest has decreased by 7.8% since the company's last earnings release while the stock has drifted lower by 5.2% from its open following the earnings release to be 0.8% below its 200 day moving average of $57.76. Overall earnings estimates have been unchanged since the company's last earnings release. Option traders are pricing in a 6.5% move on earnings and the stock has averaged a 2.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=GIS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # CarMax, Inc. $103.07\n**CarMax, Inc. (KMX)** is confirmed to report earnings at approximately 6:50 AM ET on Thursday, September 24, 2020. The consensus earnings estimate is $0.96 per share on revenue of $5.17 billion and the Earnings Whisper ® number is $1.06 per share. Investor sentiment going into the company's earnings release has 54% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 31.43% with revenue decreasing by 0.60%. Short interest has decreased by 22.1% since the company's last earnings release while the stock has drifted higher by 4.7% from its open following the earnings release to be 17.6% above its 200 day moving average of $87.67. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 8.0% move on earnings and the stock has averaged a 4.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=KMX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Stitch Fix, Inc. $28.36\n**Stitch Fix, Inc. (SFIX)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, September 22, 2020. The consensus estimate is for a loss of $0.18 per share on revenue of $415.11 million and the Earnings Whisper ® number is ($0.14) per share. Investor sentiment going into the company's earnings release has 56% expecting an earnings beat The company's guidance was for revenue of at least $433.00 million. Consensus estimates are for earnings to decline year-over-year by 357.14% with revenue decreasing by 3.94%. Short interest has decreased by 9.3% since the company's last earnings release while the stock has drifted higher by 23.1% from its open following the earnings release to be 26.7% above its 200 day moving average of $22.38. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, September 18, 2020 there was some notable buying of 4,160 contracts of the $23.00 put expiring on Friday, September 25, 2020. Option traders are pricing in a 21.0% move on earnings and the stock has averaged a 11.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SFIX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Aytu BioScience, Inc. $1.38\n**Aytu BioScience, Inc. (AYTU)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, September 24, 2020. The consensus estimate is for a loss of $0.05 per share on revenue of $10.90 million. Investor sentiment going into the company's earnings release has 62% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 96.15% with revenue increasing by 535.20%. Short interest has decreased by 39.4% since the company's last earnings release while the stock has drifted lower by 22.9% from its open following the earnings release to be 13.8% above its 200 day moving average of $1.21. Overall earnings estimates have been revised lower since the company's last earnings release. The stock has averaged a 3.5% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AYTU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # JinkoSolar Holding Co., Ltd. $24.50\n**JinkoSolar Holding Co., Ltd. (JKS)** is confirmed to report earnings at approximately 6:40 AM ET on Wednesday, September 23, 2020. The consensus earnings estimate is $0.40 per share on revenue of $1.07 billion. Investor sentiment going into the company's earnings release has 53% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 122.22% with revenue increasing by 6.26%. Short interest has decreased by 7.4% since the company's last earnings release while the stock has drifted higher by 46.1% from its open following the earnings release to be 20.7% above its 200 day moving average of $20.30. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, August 28, 2020 there was some notable buying of 507 contracts of the $22.00 put and 502 contracts of the $25.00 call expiring on Friday, October 16, 2020. Option traders are pricing in a 11.4% move on earnings and the stock has averaged a 7.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=JKS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/smallstreetbets.",
        "subreddit": "smallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning September 21st, 2020",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/ivql0n/wall_street_week_ahead_for_the_trading_week/",
        "created": 1600542339.0
    },
    {
        "author": "SacRyder",
        "created_utc": 1600138849,
        "id": "it0cqo",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Been having fun with ER plays of late, RKT, Peloton, FDX.  Looking at next earnings play:\n\nBed bath beyond is on my short list, stock is under $15. Seems like a lot of department stores such as macy's and nordstrom had decent ER and saw a nice dump within 5 days prior to earnings and a nice pump post ER. I'm looking out for that pattern.\n\nAccenture. Business/tech consulting firm. Sept 24 ER. This is a pricey stock(for me), around $238. Would love to buy an option but have too much cash tied up in other investments. Might buy a couple shares.\n\nAny upcoming ER plays you guys are eyeing? Hopefully something at least 7 days from now.",
        "subreddit": "smallstreetbets",
        "title": "Upcoming ER plays",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/it0cqo/upcoming_er_plays/",
        "created": 1600167649.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1600807567,
        "id": "ixvxdl",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": " **PsychoMarket Recap - Tuesday, Sept 22, 2020**\n\nStocks traded choppily before rising in another very volatile session, with traders weighing uncertainty around the presidential election, a worsening coronavirus situation in Europe, and concerns that fiscal stimulus will not come in near-term.  The Nasdaq outperformed, rose 1.86% as Apple (AAPL), Amazon (AMZN) and Facebook (FB) increased. The S&amp;P finished 1.02% and the Dow finished the day 0.5% up.\n\nThe coronavirus situation in Europe has greatly worsened, with experts and politicians warning that a second-wave is around the corner. On September 12, French authorities reported 10,000 COVID-19 cases in one day for the first time since the pandemic began. Since then, daily cases have soared to more than 13,000. Several \"red zones\", cities considered high risk, have seen clampdowns. There is much talk of a second national lockdown in the UK, with Prime Minister Boris Johnson announcing that there will be further restrictive measures aimed at containing another major outbreak, as the number of cases swells and top scientists warn that the death rate could grow exponentially. On Monday, the UK reported 4,368 new cases. In Spain, parts of the capital Madrid, saw new lockdown measures enforced on Monday. More than 850,000 residents face restrictions on travel and the size of gatherings, according to Al Jazeera. The EU CDC reported that in Spain, there were 300 cases of COVID-19 per every 100,000 people as the capital of Madrid saw new lockdown measures being enforced.\n\nProspects of more fiscal stimulus passing before the November election have dimmed, with Congress unable to come to a consensus. Today, Treasury Secretary Steve Mnuchin and Fed Chair Jerome Powell testified before the House Financial Services Committee. They said that the Fed and Treasury can only go ‘so far so fast’ and cannot replace targeted aid from Congress. “The recovery will go faster if we have both tools \\[from the Fed and Congress\\] continuing to work together,\" Powell said. Both Powell and Mnuchin credited the Cares Act for helping the economy recover at the height of the pandemic but have once again stressed to Congressional lawmakers the importance of targeted, fiscal aid in helping families and small businesses through these tough times.\n\n**Highlights**\n\n* Apple (AAPL) target raised by Raymond James from $110 to $120 OUTPERFORM. The stock finished 1.57% up.\n* ACN Accenture, currently at $233. Stock finished the day 1.29% up.\n   * Piper Sandler Raised Target $206 to $229 NEUTRAL\n   * Wedbush raised target from $240 to $255 OUTPERFORM\n* Amazon (AMZN) target raised bySanford C. Bernstein upgraded from MARKET PERFORM to OUTPERFORM price target of $3,400. Stock finished the day \n* Carvana (CVNA) ran 30.61% after the company projected a “record Q3” and was upgraded to a BUY rating by Goldman Sachs (GS)\n* Carvana (CVNA) was upgraded by Goldman Sachs $GS from $178 to $205, and NEUTRAL to BUY.  Q3 guidance was updated on the positive side and the stock took off. Finished 30% up for the day.\n* (CZR) Caesars Entertainment, Deutsche Bank raised its target from $50 to $65 at BUY\n* (FB) Facebook had Oppenheimer raise target from $270 to $300 OUTPERFORM\n* (NKE) Nike had Robert W. Baird raise target from $95 to $115 and from POSITIVE to NEUTRAL.\n* (NKE) Nike after the bell reported better than expected Q1 sales and EPS of $0.95 up from $0.86 YoY. The stock was up 3.1% for regular session and already more than 8% after hours.\n* (NFLX) Netflix had JP Morgan set Target $625 at BUY. that is about 20% higher than ATH, very bullish.\n* Today is (TSLA) Tesla Battery Day. Stay tuned for potential price moving announcements.\n* (GME) Gamestop surges on announcement that Cohen, Chewy’s founder, revealed an almost 10% stake in the company and his intention to become involved and compete with Amazon on the videogame space, just as he did pets with (CHWY) Chewy.\n* (SFIX) Stitch Fix reported worse than expected results, a loss of $0.44 vs expectation of a loss of $0.14. Shares were up 8% for the day, and now 14% down after hours.",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today, Sept 22. Enjoy!",
        "url": "https://www.reddit.com/r/StockMarket/comments/ixvxdl/here_is_a_market_recap_for_today_sept_22_enjoy/",
        "created": 1600836367.0
    },
    {
        "author": "lordturbo801",
        "created_utc": 1600284963,
        "id": "iu2u88",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Do any of you have action on Blackberry?  What do you anticipate?\n\nI’m not a savant by any means.  I don’t hold huge positions but am interested in learning.  Any stocks y’all pay attention to?  Other than Tesla?  \n\nAlso, how do you feel about Accenture?  Another company announcing on Sept 24.",
        "subreddit": "wallstreetbets",
        "title": "BlackBerry Quarterly Results Sept 24th",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iu2u88/blackberry_quarterly_results_sept_24th/",
        "created": 1600313763.0
    },
    {
        "author": "spacej3di",
        "created_utc": 1600958813,
        "id": "iyylcg",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " **US equities lower: Dow (0.37%), S&amp;P 500 (0.35%), Nasdaq (0.46%), Russell 2000 (0.75%)**\n\n* US equities lower in Thursday morning trading, off best levels. Comes after stocks saw renewed pressure on Wednesday with the S&amp;P down the most in two weeks. Sector performance mixed. Energy, healthcare, consumer discretionary trailing. Tech, communication services relative outperformers. REITs the only sector higher. Treasuries mixed with outperformance at the long end. Dollar a bit firmer on euro and yen crosses and on track for big weekly gains. Gold down 0.5% after falling more than 2% yesterday with real yields highest in two months. WTI crude down 0.2% in somewhat choppy trading.\n* Multiple reports discussed the **recent flurry of Fedspeak stressing the need for additional fiscal stimulus** to support the economy. **President Trump refused to commit to a peaceful transition of power** if he loses in November, though some senior GOP leaders said an orderly transition will follow 3-Nov. Trump also said **White House could overrule any tightening of rules for emergency use authorization of a coronavirus vaccine**, saying higher standards sound like \"a political move\". **Trump reportedly will sign executive order to protect people with preexisting conditions** during a speech on healthcare today. On the economic front, weekly **US initial and continuing claims a bit higher than consensus** but **a big beat for August new-home sales**.\n* **ACN-US** missed and guided below. **DLTR-US** resumed its share repurchase program. **KMX-US** reported record revenues and profitability, but expectations were high. **TYL-US** told US local government clients it was hacked. **FDS-US** organic growth improved and guidance ahead. **ULTA-US** suspended planned expansion to Canada. **DRI-US** EBITDA and EBITDA guidance ahead and company reinstated dividend but comps still soft. **JEF-US** results much better than expected with IB a standout on underwriting strength. **FUL-US** beat, guided ahead of consensus and noted its end markets continue to show signs of improvement. **SSP-US** making an acquisition with help from an investment by **BRK.B**. **RAD-US** beat but some focus on rebate aggregator contract.\n\n**Notable Gainers:**\n\n* \\+45.0% **OMI-US** (Owens &amp; Minor): Guided FY20 earnings sharply higher on strong manufacturing productivity gains, PPE demand and deployment production equipment ahead of schedule, better elective procedures volume; expects solid 2021 trends will drive investment in future growth.\n* \\+25.9% **SSP-US** (EW Scripps): Confirmed a deal to buy ION Media for $2.65B; expected to be accretive to cash flow and margins from 2021; purchase to be partially financed by a $600M investment from BRK.B-US in preferred stock.\n* \\+9.4% **JEF-US** (Jefferies Financial Group): Q3 earnings and revenue strongly ahead with more buybacks authorized; analysts noted strength in investment banking led by underwriting though fixed income flagged a bit from last quarter's strength.\n* \\+6.3% **DRI-US** (Darden Restaurants): Fiscal Q1 EPS and EBITDA much better than expected on upside from GMs and labor and other operating expenses (which generated the bulk of the positive sell-side takeaways); comp improvement continued but still soft; fiscal Q2 EPS and EBITDA guidance also well ahead of consensus; fully repaid $270M term loan and reinstated dividend.\n* \\+4.2% **BBBY-US** (Bed Bath &amp; Beyond): Upgraded to outperform from neutral at Baird on positive on signs of a turnaround; noted sales stabilizing and checks suggest foundational changes taking hold; cited possible benefits from restructurings and store-network optimization.\n* \\+4.1% **JBL-US** (Jabil Circuit): Earnings and revenue beat, earnings guidance ahead though revenue guide soft; noted strength in Mobility, Healthcare, Cloud; sales gains across segments and better than expected operating margin.\n\n**Notable Decliners:**\n\n* \\-16.6% **RAD-US** (Rite Aid): Fiscal Q2 EBITDA beat with the Retail Pharmacy business a driver; raised FY21 revenue guidance but lowered EBITDA outlook with some focus on the headwind from a change in the rebate aggregator contract with Elixir.\n* \\-11.5% **NKLA-US** (Nikola Corp.): Downgraded to underperform from neutral at Wedbush; argued of CEO Milton leaves a void that will be hard to fill; noted battery innovations coming out of TSLA-US will be a complication for company's hydrogen efforts.\n* \\-7.2% **KMX-US** (CarMax): Q2 earnings, revenue, and GM beat; used unit comps and GM better than consensus; Finance results a bright spot with provision lower than expected; analysts generally positive on report but noted elevated expectations.\n* \\-4.8% **SSYS-US** (Stratasys): Downgraded to neutral from overweight at JP Morgan; cited lingering impact of Covid epidemic and questions about new polymer-based strategy; noted product launches likely to be delayed or muted.\n* \\-4.7% **PENN-US** (Penn National Gaming): Filed for 14M share secondary; downgraded to neutral from outperform at Macquarie; cited leverage, valuation, propriety survey results showing potential to achieve #4 share in iGaming/sports and competition.\n* \\-4.6% **ACN-US** (Accenture): Fiscal Q4 results below expectations; FY21 revenue and EPS guidance also below; consulting drove the Q4 revenue miss; company flagged revenue headwind from a decline in reimbursable travel costs; bookings beat on outsourcing; FCF also ahead of expectations.\n* \\-2.8% **GPS-US** (Gap): Kanye West tweeted he will not release his \"Yeezy Gap\" clothing line until he has a seat on the company's board; note that West has previously threatened to walk away from his deals and has said \"Black board seats matter.\"\n* \\-1.1% **ULTA-US** (Ulta Beauty): Announced that it is suspending its planned expansion to Canada; recall 2019 announcement about international expansion said Canada would be initial launch; said investments had largely been limited to early infrastructure buildout and leases.\n\n09:40:31 AM CDT on 24 Sep '20",
        "subreddit": "stocks",
        "title": "Morning Market Synopsis - Thursday, Sept. 24, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/iyylcg/morning_market_synopsis_thursday_sept_24_2020/",
        "created": 1600987613.0
    }
]